{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:24:05","date_modify":"2018-10-30 18:24:05","date_publish":"2018-08-07 15:16:04","description":"The mainstream media is attempting to pressure Twitter into banning InfoWars and Alex Jones after it successfully lobbied Facebook, YouTube, Apple Podcasts, and Spotify into doing so.","filename":"data/vaneerConsumption/CNNLeadsMediaBlackmailCampaigntoBootInfoWarsfromTwitter.json","image_url":"https://media.breitbart.com/media/2018/08/Jack-Dorsey-and-Alex-Jones.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_07__1540923845.html","title":"CNN Leads Media Blackmail Campaign to Boot InfoWars from Twitter","title_page":"CNN Leads Media Blackmail Campaign to Boot InfoWars from Twitter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The mainstream media is attempting to pressure Twitter into banning InfoWars and Alex Jones after it successfully lobbied Facebook, YouTube, Apple Podcasts, and Spotify into doing so.\nCNN senior reporter Oliver Darcy, who successfully lobbied other Silicon Valley companies to ban InfoWars, declared in an article that, “Twitter remains Jones’ only big portal to mainstream conversation… It was the only major social media company to take no action against Jones on Monday.”\nTwitter spokesperson says that neither InfoWars nor any other associated accounts are currently in violation of Twitter/Periscope rules. — Oliver Darcy (@oliverdarcy) August 6, 2018\nBuzzFeed News reporter Joe Bernstein, who in 2014 posted, “KILL a straight white man on your way to work tomorrow,” also lobbied Twitter to ban InfoWars for hate speech.\nAll of these removals put @Twitter and @Jack in the very uncomfortable position of being the only major social network to disseminate @infowars. Imagine explaining that to your employees! — Joe Bernstein (@Bernstein) August 6, 2018\n“Why isn’t Twitter banning Alex Jones and his Infowars propaganda? Everyone else is! Please retweet to @Twitter! #BanAlexJonesNow,” posted HillReporter.com editor Ed Krassenstein, while Super Deluxe’s Vic Berger declared author and journalist Mike Cernovich and conservative commentator Paul Joseph Watson “need to next,” before adding, “[Twitter CEO] @jack @twitter, what are you waiting for?”\nWhy isn't Twitter banning Alex Jones and his Infowars propaganda?\nEveryone else is! Please retweet to @Twitter! #BanAlexJonesNow — Ed Krassenstein (@EdKrassen) August 6, 2018\n“Twitter, what are you waiting for?” posted writer John Pavlovitz.\nTwitter, what are you waiting for? Google, Facebook, Apple Ban InfoWars’ Alex Jones https://t.co/2CEnjatcrt via @epochtimes — John Pavlovitz (@johnpavlovitz) August 6, 2018\n“There’s no way [Twitter CEO] @jack isn’t a white supremacist,” expressed Daily Kos employee Wagatwe Wanjuki. “There is literally ZERO evidence to suggest otherwise.”\nthere is literally ZERO evidence to suggest otherwise. — Wagatwe Wanjuki (@wagatwe) August 7, 2018\nBloomberg, Digiday, Newsweek, Adweek, TechCrunch, Slate, and even porn website YouPorn also attempted to put pressure on.\nTwitter has not removed Alex Jones or InfoWars from its service as of Monday afternoon. A Twitter spokesperson confirmed that InfoWars and associated accounts are not currently in violation of Twitter’s rules https://t.co/sScKxARvFh pic.twitter.com/a9jFhxdfpg — Bloomberg (@business) August 6, 2018\nHere's my piece on Infowars ban from the platforms with commentary from @shannoncoulter, @slpng_giants and @getongab — important to remember that 71 percent of Infowars desktop traffic comes direct. Also its apps + Twitter + Periscope are still up https://t.co/KQGg7i89gl — Kerry Flynn 🐶 (@kerrymflynn) August 7, 2018\nTwitter says Alex Jones and Infowars are not currently breaking any rules https://t.co/TaxY0t7qR3 pic.twitter.com/06QrgX9RRe — Newsweek (@Newsweek) August 7, 2018\nTwitter does not plan to follow Facebook, YouTube and Apple in removing Infowars today. (A Twitter spokesperson told me Infowars & its associated accounts aren't breaking any Twitter rules, adding that they don't always publish the same stuff to Twitter that they do elsewhere.) — Marty Swant (@martyswant) August 6, 2018\nFacebook, YouTube, Apple Podcasts, and Spotify have all banned Alex Jones and Infowars. In July, Twitter's chief of trust and safety told us why Jones is still allowed on this platform: https://t.co/aqF9ksiBF5 pic.twitter.com/iVvCKdTCu8 — Slate (@Slate) August 7, 2018","url":"https://www.breitbart.com/tech/2018/08/07/cnn-leads-media-blackmail-campaign-to-boot-infowars-from-twitter/"}
