{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:19:54","date_modify":"2018-10-30 20:19:54","date_publish":"2015-10-13 16:14:28","description":"Ahead of Tuesday night’s first Democratic presidential debate, CNN rounded up a group of Hollywood celebrities and other public figures to ask, “If you could pose a question to the presidential candidates at the Democratic debate on Tuesday night, what would you ask?”","filename":"data/vaneerConsumption/CNNSolicitsDebateQuestionsFromCelebrities.json","image_url":"https://media.breitbart.com/media/2015/10/katy-perry-points-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540930794.html","title":"CNN Solicits Debate Questions From Celebrities","title_page":"CNN Solicits Debate Questions From Celebrities | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ahead of Tuesday night’s first Democratic presidential debate, CNN rounded up a group of Hollywood celebrities and other public figures to ask, “If you could pose a question to the presidential candidates at the Democratic debate on Tuesday night, what would you ask?”\nAs one might expect, Hollywood’s biggest names offered up some soft ball questions relating to familiar DNC causes, and other commentary on current hot button issues.\nStars like Katy Perry, Elton John, and Margaret Cho asked questions relating to LGBT rights, HIV/AIDS, and abortion/Planned Parenthood, while other celebs expressed concerns about medical marijuana, jobs for the middle class, and gun control.\nCheck out some of Hollywood’s queries below:\nKaty Perry\nWith the GOP crusade to defund Planned Parenthood momentarily deflated, how do you intend to consistently protect American women seeking the legal, affordable health care that they so desperately require?\nAshton Kutcher\nDuring your presidency, you will be faced with a robotic revolution — for example, driverless cars and semitrucks — as machines take skilled and unskilled jobs from Americans. This will further hollow out the middle class and divide society. What do you propose we do as a nation to bridge the gap without stifling innovation? What will you do as president to maintain a country where everyone has upward mobility?\nDemi Lovato\nWhat’s the biggest issue with our health care system when it comes to mental health care, and what specifically will you do to fix it?\nShonda Rhimes\nThere is so much divisiveness is our government today. Achieving anything of substance seems impossible because compromise seems impossible. What do you think needs to be done to unite Congress so that they are working more for the good of all of the American people as a whole and less for the good of the partisan interests that seem to have currently halted any hope of legislative change or progress?\nElton John\nIn spite of great progress, HIV/AIDS is actually dramatically on the rise in the U.S. South. What would you do as president to help stop this epidemic, particularly among minority communities?\nJulianna Margulies\nNext year, the citizens in Nevada will vote on an initiative to require the same Brady background checks that are conducted at licensed gun dealers to be conducted for sales made at gun shows and online. Do you support that initiative and, as president would you seek to make it federal law?\nMelissa Etheridge\nCannabidiol — known as “CBD” — is an oil derived from hemp that should never have been lumped together with the definition of marijuana. Legalized in 15 states, including Georgia, Texas, Tennessee, Virginia, Wisconsin and Oklahoma, CBD has been shown to have dramatic anti-seizure effect. But in order for the families in those states to obtain CBD, most have to break federal law that treats CBD as a controlled substance. A majority of Republicans and Democrats in Congress support allowing access. If elected, will you pledge to move quickly to provide this relief to the families whose loved ones suffer from seizures associated with epilepsy?\nMargaret Cho\nHow do you allow LGBT couples who are now able to be married under the law full adoption rights in every state? How do we get equal rights to family?\nMartha Plimpton\nThe 1973 landmark Supreme Court decision Roe v. Wade ensured women’s access to abortion throughout the U.S. Yet since then, we’ve seen a steady reversal of those constitutional protections in the states, with nearly 300 new abortion restrictions enacted in the last five years, more than the previous decade combined. Today, many women are worse off than they were before Roe, with access to this basic and legal health care procedure essentially out of reach. Is it time for federal legislation, such as the Women’s Health Protection Act or the EACH Woman Act, to protect every woman’s right to reproductive health care? Will you fight for legislation that would ensure safe and legal abortion is available to all women, regardless of their ZIP code?\nModerator Anderson Cooper has pledged not to encourage the candidates to go after one another, saying, “these are all serious people. This is a serious debate,” so “gotcha” questions do not appear to be on the docket for the Democrats.\nThat being said, the debate is not expected to haul in as many viewers as the two previous Republican debates, one of which aired on CNN Sept. 16., and smashed ratings records for the network, bringing in more than 20 million viewers.\nRepublican presidential frontrunner Donald Trump, the man behind the record numbers, said Monday he doubts the Democrats will have enough energy to keep up with the GOP in ratings.\n“I think it’s not gonna be highly rated,” Trump said of Tuesday’s debate. “I think it’s going to be, you’re gonna watch it for 10 or 15 minutes, and people are gonna get bored and turn it off.”\nThe first Democratic presidential debate will air Tuesday at 8:30 p.m. ET on CNN.","url":"https://www.breitbart.com/politics/2015/10/13/cnn-debate-hollywood-stars-ask-dems-about-abortion-gun-control-gay-rights/"}
