{"authors":[],"date_download":"2018-10-30 14:15:32","date_modify":"2018-10-30 14:15:32","date_publish":"2018-07-20 00:00:00","description":null,"filename":"data/vaneerConsumption/CNNsAlysinCamerotaisfromMarsRudyGiulianiisfromEarth.json","image_url":"https://www.americanthinker.com/images/bucket/2018-07/208056.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_07_cnns_alysin_camerota_is_from_mars_rudy_giuliani_is_from_earth_1540908932.html","title":"CNN's Alysin Camerota is from Mars, Rudy Giuliani is from Earth","title_page":"CNN's Alysin Camerota is from Mars, Rudy Giuliani is from Earth","title_rss":"NULL","source_domain":"americanthinker.com","text":"Camerota is not interested in anything Trump has accomplished in his nineteen months, not one thing. She did not ask about North Korea, Russia, the Middle East, tax reform, or the GDP.\nAlysin Camerota interviewed Rudy Giuliani for half an hour on Monday (full interview embedded below) and demonstrated just how uninformed the folks at CNN are and just how determined they are to permanently inhabit the sewer.\nGranted, Giuliani is Trump's lawyer, not a foreign policy analyst or an economist. But, like the rest of CNN, she cares nothing about the issues that really affect the nation. She cares only about trapping and subsequently impeaching Trump. She thinks proving he paid people not to spill their tales of infidelity is important. She is interested only in Mueller, his \"investigation,\" Cohen, the \"Cohen tape,\" all of which is a big nothing.\nOr is it? Maybe it's a set-up of the D.C. journalist class. Who knows? Could be. When Giuliani brought up the 183 tapes of conversations with reporters that Cohen had and have now been turned over to Giuliani, Camerota was not interested. Next question.\nShe was interested only in a couple of alleged meetings, meetings that are meaningless, meetings that, if they took place, were not illegal in any way. She is only too happy to judge Trump's character but believes that Michael Cohen is a legitimate witness to be believed, despite his obvious chicanery. She ignored all of Giuliani's comments about the man. Don't confuse her with facts.\nThe most telling thing about the interview is how obvious it becomes that CNN is absolutely, purposefully clueless about the volumes of information that have been revealed, by the I.G. report, by John Solomon and Sarah Carter, by Gregg Jarrett in his book The Russia Hoax, and by a plethora of other real news outlets that have been reporting on the Clinton-DNC invention of a Trump collusion with Russia for months and months.\nCNN has its fingers in its ears. The people there do not want to know anything that does not support their anti-Trump mindset.\nGiuliani is terrific, given that Camerota was so determined to entrap him, somehow, some way. She did not. He made her look like the shallow, obsessed-with-sex mannequin she is. She thinks Trump discussing paying some Playboy playmate on an obviously doctored tape is going to convince Trump-supporters to leave him.\nShe is so trapped in her never-Trumpism that she cannot see that millions of Americans are better off since Trump became president, that several millions of people are no longer on food stamps, and that millions of Americans are no longer unemployed. Needless to say, she never mentioned the 4.1% GDP. She never mentioned the fact that it was the Clinton campaign, the DNC, and the FBI who paid for the phony dossier that triggered, unlawfully, the Mueller investigation. No, no, no.\nCrimes, no matter how egregious, committed by Democrats are not crimes to CNN. Trump's personal life should be an open book even if nothing about it is illegal. Think back to the left's defense of Clinton's tawdry escapades and leftists' sycophantic defense of his \"privacy.\"\nThe American left is as hypocritical as it is possible to be. Leftists are as intolerant as it is possible to be. The leftist media are the enemy of the people.\nThe truth that Camerota's interview reveals is not only CNN's refusal to acknowledge the Obama cabal's determination to take Trump down by any means necessary the minute he became the candidate, if not before. This bunch – Brennan, Clapper, Comey, McCabe, Rice, Strzok, Page & Company – gave not a moment's thought to the Constitution when they embarked upon their mission to destroy the man, even after he won the election. Every move they made was catastrophically illegal and, of course, unconstitutional. They doubled down once he was elected. CNN has to know all this, as so much of the actual documentation is out there for all to see and read. Did they not see the Peter Strzok hearing? Are they not aware of Comey's self-incriminating statements? Apparently not.\nMs. Camerota is very nicely put together but is as clueless about the American people as the rest of her colleagues. Her entire interview with Giuliani was meant to produce a gotcha moment that she could take to the bank. It did not happen. He made her look like the fool she is, interested only in hurting the president. She could not care less about his long list of accomplishments that have helped so many people already. Like Bill Maher, I suspect that she would be thrilled with an economic crash if it would hurt Trump.\nThese people, CNN, MSNBC, ABC, CBS, NBC, are increasingly irrelevant. Few people get their news from these outlets anymore. They all say exactly the same things anyway.\nPresident Trump is profoundly right to malign the mainstream media. Never before has there been such a coordinated effort by those charged with reporting facts to the population to undermine the truth and promulgate lies and propaganda meant to destroy a duly elected president. Yes, the press was vicious in Revolutionary times and certainly tried to destroy Lincoln and Reagan.\nOne may conclude that Trump's enemies elevate him to the stature of our finest leaders. The media's antipathy to this president, historically speaking, suggests he is doing everything right and will save America from the certain destruction of the Republic that would have followed had Clinton won the election. Camerota is a good little CNN soldier of anti-Trumpism. That is all she is.\nWatch the interview:","url":"https://www.americanthinker.com/blog/2018/07/cnns_alysin_camerota_is_from_mars_rudy_giuliani_is_from_earth.html"}
