{"authors":["John Nolte"],"date_download":"2018-10-30 18:24:32","date_modify":"2018-10-30 18:24:32","date_publish":"2018-06-30 14:32:33","description":"CNN anti-Trump activist Jim Acosta was caught on video Friday in the actual act of manufacturing fake news.","filename":"data/vaneerConsumption/CNNsJimAcostaCaughtonVideoManufacturingVeryFakeNews.json","image_url":"https://media.breitbart.com/media/2018/06/Jim-Acosta-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_06_30__1540923872.html","title":"CNN's Jim Acosta Caught on Video Manufacturing Very Fake News","title_page":"Nolte: CNN's Jim Acosta Caught on Video Manufacturing Very Fake News","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN anti-Trump activist Jim Acosta was caught on video Friday not only engaging in shameless grandstanding, but in the actual act of manufacturing fake news.\nIn the video embedded below, Acosta is present at a White House event where President Trump delivered remarks about the five journalists murdered in Maryland on Thursday. As you will see, though, Acosta is clearly too far away to be seen or heard by the president.\nNevertheless, although there is no way he will be heard, Acosta drops all pretense of professionalism to still holler a question to the president: “Will you stop calling the press the enemy of the people, sir?”\nIn other words, Acosta knows Trump cannot hear him, but like a heckler out to spoil the moment for everyone else, he still screams his question at him.\nWatch for yourself:\nOMG! CNN's @Acosta repeatedly shouts \"Mr. President, will you stop calling the press the enemy of the people\" at @realDonaldTrump and is shushed by an onlooker! pic.twitter.com/6eEySyHVNx — Jon Levine (@LevineJonathan) June 29, 2018\nIt is only at the end of the video that we discover Acosta’s true motive, and it is the opposite of journalism. Watch as Acosta turns around to look at his cameraman and appears to ask if they got the shot. Then the camera lights are shut off, which again reveals just how staged and artificial all of this is.\nThis is not journalism.\nAcosta and CNN knew Trump was too far away to hear the question.\nThis is staging news, manufacturing news, a fictional piece of propaganda produced as a means to deliberately mislead the public and embarrass the president.\nIf these staged theatrics are not bad enough, Acosta and CNN then doubled down in their deliberate crusade to mislead. “I tried to ask the president if he would stop calling us the enemy of the people. He did not respond,” Acosta tweeted Friday:\nI tried to ask the president if he would stop calling us the enemy of the people. He did not respond. — Jim Acosta (@Acosta) June 29, 2018\nAgain, this is Acosta and the far-left CNN’s calculated attempt to deceive, to make it seem as though Trump was asked a direct question and refused to answer\nAcosta is so far away from Trump, you can barely make out the president from where Acosta is standing, and yet, to fabricate fake news, Acosta films the propaganda of him shouting a futile question and then publicly accuses Trump of refusing to answer.\nIf the media do not want to be called the “enemy of the people,” maybe they should stop acting like it.\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.","url":"https://www.breitbart.com/the-media/2018/06/30/cnns-acosta-caught-video-manufacturing-very-fake-news/"}
