{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:49:58","date_modify":"2018-10-30 19:49:58","date_publish":"2017-04-19 16:08:31","description":"Former British ambassador to North Korea John Everard writes at CNN.com that Trump's strategy may have actually worked.","filename":"data/vaneerConsumption/CNNTrumpsNorthKoreaPolicyMightJustBeWorking.json","image_url":"https://media.breitbart.com/media/2017/03/trump1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2017_04_19__1540928998.html","title":"CNN: Trump's North Korea Policy Might Just Be Working","title_page":"CNN: Trump's North Korea Policy Might Just Be Working | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former British ambassador to North Korea John Everard writes at CNN.com on Wednesday that President Donald Trump’s assertive strategy towards the rogue nuclear power may have actually worked, despite domestic criticism.\nEverard writes:\nIn my opinion, the most plausible explanation for this is that North Korea blinked. Although it is possible the extensive preparations around its nuclear test site were intended only to wind up the international community, it seems more likely that the North Koreans did indeed plan a nuclear test Saturday but desisted, probably because they assessed the risks of serious retaliation were too great. The US carrier group it thought was near Korea and China’s threat on April 12 to support UN sanctions, including cutting off North Korea’s oil supply — which would have quickly brought its fragile economy to a halt — probably weighed heavily on Pyongyang as well.\nThough domestic critics attacked Trump for stating that the USS Carl Vinson and an “armada” were sailing toward the Korean peninsula, when in fact the ships were far away, Everard says that Trump’s statement was a successful bluff.\nThe North Korean dictator thought the carrier group really was off the Korean coast, Everard writes. “Very few people outside the US administration knew the carrier group was in fact some 3,500 miles away from the Korean Peninsula.”\nHe concludes:\nPerhaps the North Koreans calculated (rightly, it seems) that either a nuclear test or a test of an intercontinental ballistic missile — a long-range missile of the kind they would need to carry a nuclear warhead to the continental United States — was too dangerous. Instead, launching a medium-range missile would allow them to deny they were buckling under foreign pressure while not triggering a vigorous international reaction. The fact it failed doubtless also softened responses. If this analysis is right, then the United States has, for now at least, succeeded in its long-term goal of halting the development of North Korea’s nuclear weapons and missiles.\nOne observer who predicted Trump’s success in the confrontation was Dilbert illustrator and author Scott Adams, who had been stating for weeks that Trump’s unpredictable military moves might scare China into reining in its client state.\nCNN is rarely positive in its coverage of the 45th president, making Everard’s article particularly noteworthy.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/the-media/2017/04/19/cnn-trumps-north-korea-policy-might-just-working/"}
