{"authors":["John Nolte"],"date_download":"2018-10-30 20:32:33","date_modify":"2018-10-30 20:32:33","date_publish":"2014-10-23 15:39:00","description":"When Carol Costello went on CNN's \"Anderson Cooper 360\" last month to discuss an assault she suffered at the hands of an ex-boyfriend in college, no one |","filename":"data/vaneerConsumption/CNNTellsViewerstoEnjoyAudioOfWomanReportingAssaulttoPolice.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Journalism/2013/CNN/jeff-zucker-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2014_10_23__1540931553.html","title":"CNN Tells Viewers to 'Enjoy' Audio Of Woman Reporting Assault to Police","title_page":"CNN Tells Viewers to 'Enjoy' Audio Of Woman Reporting Assault to Police | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When Carol Costello went on CNN’s “Anderson Cooper 360” last month to discuss an assault she suffered at the hands of an ex-boyfriend in college, no one laughed. There’s nothing funny or political about a woman dealing with an assault of any kind. Despite her own experience, though, Costello used her morning perch as a CNN anchor Wednesday to smugly mock and call on her viewers to “enjoy” a young, single mother reporting a physical assault to authorities.\nBefore playing audio of this young woman telling a police officer that a man knocked her to the ground multiple times and dragged her across the grass, a gleeful Costello said to viewers that this “quite possibly the best minute and a half of audio we’ve ever come across, come across in a long time anyway.” She then urged her viewers to “sit back and enjoy.”\nThis is monstrous behavior.\nShe later doubled down on Twitter:\n—\nThis is quite possibly the best minute and half of audio we’ve come across in a long long time #PalinBrawl #CNN http://t.co/qb4fByzzie — Carol Costello (@CarolCNN) October 22, 2014\n—\nCNN already has a very big problem involving various reports of its treatment of black employees. Why would they want to compound their problems by mocking women reporting a physical assault.\nThe fact that the young single mother in question is Sarah Palin’s daughter Bristol tells us that CNN isn’t opposed to assaulting all women.\nHow would CNN and Costello react if a rival network did the same. We actually know the answer to that question. Fox later did the right thing and apologized the very next day. Twenty-four hours later, Costello and CNN remain silent.\nJohn Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2014/10/23/cnn-tells-viewers-to-enjoy-audio-of-woman-reporting-an-assault-to-police/"}
