{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 04:08:12","date_modify":"2018-10-23 04:08:12","date_publish":"2016-01-11 17:08:49","description":"A coach-load of 35 pupils and nine adults were on their way home to the Isle of Skye in Scotland when they passed through the French port (pictured in file photo) on Sunday","filename":"data/vaneerConsumption/CoachcarryingBritishschoolchildrenisattackedbymigrantsinCalais.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/2FFAF48300000578-0-image-a-41_1452531192907.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394230_Coach-carrying-British-schoolchildren-attacked-migrants-Calais_1540267692.html","title":"Coach carrying British schoolchildren is attacked by migrants in Calais","title_page":"Coach carrying British schoolchildren is attacked by migrants in Calais | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Migrants pelted a bus carrying British schoolchildren with rocks as it passed through Calais.\nA coach-load of 35 pupils and nine adults were on their way home to the Isle of Skye in Scotland when they got to the French port in the early hours of Sunday morning.\nThe youngsters had endured a long drive from Italy, where they had been skiiing, when the incident happened not far from the notorious 'Jungle' migrant camp.\nA bus carrying British schoolchildren has become the latest vehicle attacked by migrants as it attempted to reach the port of Calais in France (file photo)\nThe youngsters had been skiing in Italy, from where teachers posted this photo on Facebook last week\nThe children were sleeping when an outer window of double glazing on the coach was smashed as it passed through an incident between police and migrants.\nA spokesman for the Highland Council confirmed the incident was reported to the police and border control at Calais.\nThe coach, which did not stop due to the danger, was later deemed safe to continue its journey to Portree High School on Skye.\nDrew Millar, a councillor in Portree, told the Daily Record: 'The bus was attacked by migrants and at least one window was broken.... It was decided that, rather than stop the bus, they should carry on.\n'There was one pupil who needed treatment but that was due to a medical problem that was resolved.'\nBill Alexander, Highland Council's Director of Care and Learning said: 'We were alerted to the incident and parents were informed.\n'This was an unfortunate episode to the end of what was otherwise a very successful school ski trip. All those on the trip have returned safely.'\nVehicles on the road next to the camp have reported increasingly desperate attempts to board them\nThe school, on the Isle of Skye, said no one was injured and the children have now returned home safely\nCatherine MacDonald, head teacher at Portree High, added: 'Everyone has returned home safe and sound from what was a fantastic ski trip with snowsports certificates under their belts.\n'No one was injured as a result of the incident at Calais which was efficiently dealt with by our coach operator.'\nIt is not the first time a bus has been attacked while travelling to the port.\nIt was reported last month that a coach carrying the rock band Ash had a brick thrown through a window, injuring the driver.","url":"https://www.dailymail.co.uk/news/article-3394230/Coach-carrying-British-schoolchildren-attacked-migrants-Calais.html"}
