{"authors":[],"date_download":"2018-10-30 01:23:42","date_modify":"2018-10-30 01:23:42","date_publish":"2016-06-02 05:00:12","description":null,"filename":"data/vaneerConsumption/CoalitionoftheUnwilling.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/06/Gun_1_Battery_A_2-142nd_Field_Artillery_Operation_Desert_Storm-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862622.html","title":"Coalition of the Unwilling","title_page":"Coalition of the UnwillingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Foreign policy jokes are the worst jokes, as I learned at the Advancing American Security summit last month. One had me chuckling, however. “You’ve got me surrounded. I’m a bad strategist,” Professor Stephen Walt quipped while fielding questions from the lunch crowd that encircled him.\nThen again, we weren’t there at the Georgetown Fairmount for the chuckles. When the Koch Institute invited me to come, I was excited for a number of reasons, principally because of what it represented. Much of the political establishment in D.C., both Republican and Democrat, is committed to pursuing more of the same: more wars, more interventions, more preaching.\nHere, finally, was something different, in the right place, on such a scale that most foreign policy folks around town would have to worry. This new — oh, let’s call it a — coalition of the unwilling is coming together to inject realism, restraint, and consideration for concrete American national interests back into what passes for foreign policy debate today.\nHistorian Andrew Bacevich, who fought in Vietnam and whose only son died in Iraq, kicked things off. “The end of the Cold War,” he told us, “caught me completely by surprise.” Stationed in Germany at the time, he had “assumed the Cold War would continue indefinitely.” So he paid special attention to the new world order that was forming after that twilight struggle, and was quite worried by what he observed.\nHe held up his “favorite artifact” from the’90s and described it for the folks in the back of the room.\n“It’s the cover of the New York Times Magazine, dated March 28th, 1999. You can see the image. It’s of a clenched fist painted red, white, and blue. Old Glory on display,” Bacevich said.\n“But more important than the photograph is the text in the bottom right-hand corner, which I will read to you. ‘What the world needs now: For globalism to work, America can’t be afraid to act like the almighty superpower that it is.’\n“Now reflect on that for a moment, ‘Almighty.’ You know, omnipotent. Godlike. And this from the New York Times no less.”\nBefore the events of September 11, Bacevich said, this sort of “hubris” led only to “minor mischief” but when the “almighty superpower” was caught “napping, to put it mildly,” we got the war on terror, the freedom agenda, Iraq, Libya, Syria, ISIS — war, seemingly without end. Amen?\nBacevich was but the first of 14 speakers for the day, in debate panels and stand-alone addresses. Somehow, the organizers managed to make all the trains of thought run on time and leave room for audience questions like the ones that had Professor Walt scrambling.\nMy favorite speaker of the day turned out to be Chas Freeman, who was Nixon’s translator when he went to China and ambassador to Saudi Arabia when Saddam Hussein invaded Kuwait. He both looked and sounded a bit like an older John Goodman. His words were blunt and pungent. He had actual war stories.\nOf his own profession, Freeman quoted a New York Herald Tribune editorial from 1857: “Diplomacy is the sewer through which flows the scum and refuse of the political puddle. A man not fit to keep at home is just the man to send abroad.”\nFreeman told one tale of something that almost went badly wrong before the first Gulf War. In the run-up to the action in Kuwait, he said, “I got a telegram from the Department of State telling me to go see the king to arrange for bed down of B-52s in Jeddah.\n“Well, I called [Generals] Norm Schwarzkopf and Chuck Horner. Neither of them had requested this or saw any need for it.\n“So I went back with a telegram in response saying, ‘Before I execute this instruction, I would like to be assured that you have considered the fact that the only place for bed down in Jeddah is in the hatch terminal. One photo of a B-52 in the entryway to Mecca and we’re dead in the Muslim world.\n“Number two, last time I looked, we are here to defend Saudi Arabia and the B-52 is not widely regarded as a defensive weapon system.\n“And number three, the local commander in Centcom appears not to have asked for this.\n“And number four, there’s no requirement for it.\n“Number five, we can, if you wish, move the bombs and the support equipment in and put those in Jeddah. And if we actually get into a war where we use the B-52, nobody’s going to care if it recovers from Diego Garcia or someplace in the U.S. and lands in Jeddah.”\nIn response, he received a cable from the Undersecretary of State and National Security Advisor Brent Snowcroft telling him to get on with it.\n“Then I sent a cable back saying, ‘It’s not clear to me that you have considered the reasons not to do this and would you please assure me that the senior staff has given you my arguments.”\nThis continued up to and including the first President Bush, who threw up his hands but later told Freeman, “Thank God you didn’t execute that order.”\nFreeman prefaced this by explaining his own golden rule of thumb: “Both soldiers and diplomats have to answer a key question before we act: ‘And then what?’ And if we can’t answer that question, we shouldn’t do whatever it is that we’re about to do.”\nThat sounds like a good consideration for politicians as well.","url":"https://spectator.org/coalition-of-the-unwilling/"}
