{"authors":[],"date_download":"2018-10-30 21:26:14","date_modify":"2018-10-30 21:26:14","date_publish":"2018-06-29 16:46:00","description":"According to Georgia’s Division of Family and Children Services, there are more than 13,000 children in foster care. Of those, about 40 percent were removed from families due to substance abuse.","filename":"data/vaneerConsumption/Cobbboyinfostercareduetodrugepidemic.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/30/Images/newsEngin.22381862_IMG_1210.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_parenting_anothe_00e97b60b8ca400dbf88025011befd2b__1540934774.html","title":"Cobb boy in foster care due to drug epidemic","title_page":"This Life with Gracie: Cobb boy in foster care due to drug epidemic","title_rss":"NULL","source_domain":"ajc.com","text":"It’s been nearly two years since I last saw Chase Howard, the little boy with Duchenne Muscular Dystrophy.\nNo one thought he’d even see his 10th birthday then.\nAs Sept. 19 approached, his aunt, Michelle McClain issued a Facebook appeal to make his day extra special.\n“He won’t be able to have a normal birthday like most kids,” she wrote. “No Chuck E. Cheese as he doesn’t have the strength to play the games, nothing like that.”\nAs soon as she hit the send button, the cards and written notes began arriving – nearly 1,000 a day.\nSept. 19, of course, did come and Chase was still here to celebrate.\nIf someone doesn’t intervene soon, McClain fears that might not be the case this time around.\n“Chase is in real danger of death or damage that cannot be corrected,” she said recently.\nWhen we talked back in 2016, the muscle tissue in Chase’s arms and legs had disintegrated so much and so quickly, he needed a wheelchair to get around. Aunt Shellie and his mom, Pam, were pretty sure his heart and lungs were next.\nIt happens with Duchenne Muscular Dystrophy, a rare and deadly genetic disorder that strikes one in every 3,500 kids born, mostly boys, each year.\nRELATED | Church families open homes to children caught in opioid crisis\nNow it isn’t just DMD that’s threatening Chase; McClain contends it’s the government or more specifically the Cobb County Division of Family and Children’s Services.\nLast October, when his mom could no longer control her craving for alcohol and cocaine, Chase was placed in foster care.\nAccording to Georgia’s Division of Family and Children Services, there are more than 13,000 children in foster care. Of those, about 40 percent were removed from families due to substance abuse.\nNationwide, the number of children in foster care increased 8 percent from 397,000 in 2012 to 428,000 in 2015, according to data from the U.S. Department of Health and Human Services.\nWhy? Opioid and methamphetamine addiction.\nBut that’s only part of the problem.\nChase Howard, right, with U.S. postal service employee Scott Wilson. Wilson said at the time he had never seen so much mail for one person. Contributed by Cameron Wade/USPS (The Atlanta Journal-Constitution)\nChase’s Aunt Shellie contends he isn’t receiving adequate care. His foster parent can’t even keep up with his medical needs, she said. Shellie wants her nephew moved from his current foster placement to the foster family previously approved by Bartow County officials and where, she said, the DFCS attorney, his Guardian Ad Litem and the judge all agreed was in his best interest during a May 14 review hearing.\n“Now DFCS is saying that he will not be moved (and) that he is safe in his current placement,” Shellie said.\nMcClain, who said she was unable to take her nephew because of her living conditions, said she saw red flags all along that “things were not quite right with Chase’s care” but all the pieces didn’t make sense until she attended a doctor’s appointment with him back in April.\nChase had lost 12 pounds since she last saw him.\nRELATED | Why a Cobb boy wound up with more than 9,000 birthday wishes\nWhen his doctor suggested adding additional calories with Boost or other calorie drinks, she said, the foster mom shot that down and asked for a G-tube to be placed.\n“Had I not been allowed to attend all of Chase’s doctor’s appointments, they would have never known of the danger he is in,” McClain said. “I am desperate to have Chase moved as soon as possible to a loving and caring foster home.”\nShortly after the doctor’s visit, McClain listed her concerns in a five-page email to DFCS.\nWalter Jones, spokesman for DFCS, said that confidentiality requirements prohibited the agency from commenting on the specifics of the case.\nHe said, however, “the division is committed to safeguarding the interests of every child in state care. That includes attending to any medical condition or accommodating any physical circumstances.”\nIn addition to monthly visits to every child, Jones said, that input from the child’s attorney and consultation with his or her medical providers, DFCS staff listens to the input of family members and responds to their requests.\n“However, sometimes professional evaluations show that every family request is not in accord with best practices for the child,” he said.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nBefore his diagnosis in 2013, McClain and Chase’s mother believed he was simply clumsy, a little boy with an old man’s gait.\nRELATED | DFCS to accept blame in children’s deaths\n“There was no indication something might be wrong,” McClain said. “We had no family history of muscular dystrophy.”\nThey were on a kindergarten field trip one day when he suddenly fell to his knees and couldn’t get up. When she took him to a doctor a few weeks later and he suggested a muscle biopsy, mother and aunt decided to get a second opinion. A biopsy, they thought, was too invasive for someone so young.\nA second doctor suggested they see a neurologist, and that’s when they learned Chase might have muscular dystrophy, probably Beckers, a milder form of the disease. A genetic blood test confirmed Chase had DMD. He was just 7.\nShellie, the fixer, logged onto her computer and Googled Duchenne. Every body function will go. His digestion system will shut down. Eventually, his heart and lungs will wear out.\nHis condition has continued to deteriorate.\nMcClain has filed a complaint with the Office of Child Advocacy but since sharing her concerns with DFCS, she said, she has not been allowed any more visits.\n“It’s like they are trying to hide something,” McClain said.\nLet’s hope not.\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/parenting/another-kid-falls-victim-drug-epidemic-but-danger/MkqFYTx6yzO8ArettfB1eJ/"}
