{"authors":[],"date_download":"2018-10-30 14:38:42","date_modify":"2018-10-30 14:38:42","date_publish":"2018-07-26 02:17:00","description":"Cobb County Commissioners narrowly approved a tax increase Wednesday night, delivering a victory to Chairman Mike Boyce who campaigned hard for what he has called a “sustainable” millage rate.","filename":"data/vaneerConsumption/CobbCountyCommissionvotes32toraisetaxes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/07/10/Videos/4435454.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_7eecd291b559f7b05e8f8c3a572d9c34__1540910322.html","title":"Cobb County Commission votes 3-2 to raise taxes","title_page":"Cobb County Commission votes 3-2 to raise taxes","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb County Commissioners narrowly approved a tax increase Wednesday night, delivering a victory to Chairman Mike Boyce who campaigned hard for what he has called a “sustainable” millage rate.\nThousands of residents weighed in by email, phone and in person.\n“This is how I govern,” Boyce told the audience, referring to a series of town hall meetings he held to discuss the tax rate and budget. “I talk to you. I want you to be part of the conversation.”\nThe county faced tough choices after using one-time money to fill a budget hole last year. One of its credit rating agencies issued a warning, and parks and library staff were preparing plans to close facilities in anticipation of cuts.\nmore than a hundred Cobb residents turned out for the county commission vote on the millage rate (Meris Lutz/AJC)\nThe 2019 budget, approved with the millage rate, would avoid such cuts, restore Sunday library hours and create more positions in the police department.\nThe decisive vote came from West Cobb Commissioner Bob Weatherford, who lost a Republican primary runoff the night before and delivered an emotional speech in favor of the new tax rate.\n“I think it’s time to invest in Cobb’s future,” Weatherford said. “I will not leave this county worse off than when I got here.”\nThe majority of residents who spoke before the vote said they were in favor of raising taxes to keep or expand services and support police.\nCritics expressed concern for seniors living on fixed incomes, and accused the county of irresponsible spending.\nCommissioner Lisa Cupid joined the chairman and Weatherford in voting for the increase--a difference of about $215 on a home with a fair market value of $275,000 without a homestead exemption.\nCommissioners Bob Ott and JoAnn Birrell voted in opposition.","url":"https://www.ajc.com/news/local-govt--politics/cobb-county-commission-votes-raise-taxes/nN2B0huarYIt0rlpxF9kXI/"}
