{"authors":[],"date_download":"2018-10-30 21:54:03","date_modify":"2018-10-30 21:54:03","date_publish":"2018-08-07 14:44:00","description":"Cobb planning official Thea Powell attended her final meeting as commissioner Tuesday, telling the audience that she was being removed from her position because she spoke out against a tax hike that passed last month.","filename":"data/vaneerConsumption/Cobbplanningcommissionersaysshewasremovedforspeakingagainstt.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/07/Images/thea%20powell_4845x3032.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_dcabfad5974d7ac60f89022104beb156__1540936443.html","title":"Cobb planning commissioner says she was removed for speaking against t","title_page":"Cobb planning commissioner says she was removed for speaking against t","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb planning official Thea Powell attended her final meeting as commissioner Tuesday, telling the audience that she was being removed from her position because she spoke out against a tax hike that passed last month.\nPlanning commissioners are political appointees and receive a small stipend.\nPowell was appointed by Chairman Mike Boyce, who successfully championed the tax increase, which he said was necessary to fill a budget gap and restore services.\nBoyce informed Powell that he would be replacing her in a letter dated July 26--the day after the new tax rate narrowly passed and just over a week after Powell objected to the increase at a public hearing.\nAt Tuesday’s meeting, Powell said Boyce never expressed dissatisfaction with her performance during her 18 months on the commission.\n“Since no reason was given and considering the timing, I can only assume that speaking out may have been what prompted this action,” she said. She urged her fellow commissioners to “continue to listen to all who come before you as we are servants of the people and have the responsibility of keeping their best interest at the forefront.”\nA statement from the chairman did not address his reasons for removing Powell, a former county commissioner.\n\"I've decided to change my appointment on the Planning Commission,” Boyce said. “I thank her for all her years of service to Cobb County and wish her all the best in the future.\"\nA replacement has not been chosen yet, according to county spokesperson Ross Cavitt.","url":"https://www.ajc.com/news/local-govt--politics/cobb-planning-commissioner-says-she-was-fired-for-speaking-out-against-tax-hike/Tj8IGXMXCI0BsKpIMvtzFP/"}
