{"authors":[],"date_download":"2018-10-30 21:54:44","date_modify":"2018-10-30 21:54:44","date_publish":"2018-07-31 18:39:00","description":"Today, the Cobb pension’s funded level is just 52 percent, making it one of the poorest funded in the state.","filename":"data/vaneerConsumption/Cobbspensionfundtellsstoryoffiscalreckoning.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/07/31/Images/newsEngin.22241028_cobbtax.0724-BH004.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_d73ff49ead5b13eb3cc4944748f1e441__1540936484.html","title":"Cobb’s pension fund tells story of fiscal reckoning","title_page":"Ga. news: Cobb’s pension fund tells story of fiscal reckoning","title_rss":"NULL","source_domain":"ajc.com","text":"The year was 1997: The economy was soaring; Hanson’s MMMBop was in nonstop radio rotation; and Cobb County’s pension fund was plump and healthy.\nLooking to remain competitive with other metro Atlanta counties in the recruitment of government workers, Cobb commissioners decided to nearly double pension benefits for all county employees.\nThat’s when, despite its reputation for good money management, the county started digging a hole that it has yet to climb out of.\nToday, the Cobb pension’s funded level is just 52 percent, making it one of the poorest funded in the state. In order to fulfill its promise to more than 6,000 current and retired employees, the county will have to increase its contribution to the pension by about 30 percent over the next 20 years.\nThe rising cost of the county’s pension obligation is among the reasons cited by Cobb Chairman Mike Boyce for a recent tax rate increase.\n“Pensions are a large part of our expenses, and we have to address them appropriately in order to retain the confidence of our employees,” Boyce said.\nCritics say Cobb’s pension shortfall demonstrates how short-term gains won out over long-term planning to the detriment of civil servants and taxpayers. County leaders failed to make provisions to boost pension funding, even in the heyday of the market. At the same time, measures taken to shore up the pension fund have made the county’s retirement benefits less generous and attractive to new employees, they say.\nThe health of a pension plan largely depends on the stock market and the accuracy of predictions about investment returns and future costs. Even a slight change in returns or costs can greatly increase the unfunded liability.\nThough the county had consulted with its then-financial adviser, the Segal Company, before upping its pension benefits, Cobb went from having enough money to cover 95 percent of promised benefits to below 70 percent within a year.\nBill Byrne, the county chairman at the time, said he had no regrets about the decision.\n“In that period of time, we were competing with other counties to keep good public safety people employed in Cobb County and to attract new ones,” Byrne said of the pension benefits. “It worked.”\nAfter the dot-com bubble burst around the year 2000, the pension fund continued to decline until 2008, the nadir of the great recession. Its funded level has lingered between 50 and 55 percent ever since.\nRoger Tutterow, the chair of the pension board and an economist at Kennesaw State University, said the plateau is actually a sign the county is making more responsible choices. He pointed to reforms made in recent years to the pension, including committing to a 30-year amortization period and revising down the assumed rate of investment return. The county has also updated its mortality projections as people live longer.\nSince 2010, new employees have enrolled in a hybrid plan with a retirement savings account and a less generous pension.\n“Over the the next half a dozen years or so, we should start seeing that funded ratio improve,” Tutterow said.\nCommissioner Bob Ott said the county’s primary responsibility is to protect pension benefits that have already been earned. At the same time, he said, Cobb needs to “create a pension for the existing employees moving forward that is affordable and sustainable by the taxpayers.” He said he was in favor of eliminating the traditional county pension payments entirely and moving exclusively to retirement savings accounts.\nBut Matt Babcock, the pension advocate for the local firefighters union, said current employees are paying the price for past mistakes. He said that, after the decision in 1997, successive administrations failed to adjust the county’s contribution to cover the new unfunded liability.\nInstead, employee contributions have continued to rise while retirement benefits have been cut, making Cobb less attractive to new recruits.\n“I’m definitely concerned about my pension and the firefighters I work with,” Babcock said. “The hybrid pension doesn’t even come close to providing a livable retirement.”\nRetirees complain that the county made poor choices even as it has struggled to fortify its pension fund. People at the top, they say, were granted large raises and overly generous employment contracts that resulted in huge pension payouts. Pension payments are based on the average of the highest five consecutive years within the employee’s last decade of employment.\nThe county’s highest paid pensioner is retired County Manager David Hankerson, who collects $23,892 a month. Hankerson signed a contract with the county in 1993 guaranteeing raises almost every year, sometimes twice a year, according to county personnel records. That contract was renewed by successive administrations until Hankerson retired in 2017.\nFollowing him at the top: former Support Services Agency Director Virgil Moon, who served on the pension board for many years and helped to shape pension policies. He collects $10,339 a month.\nWhile older rank and file employees benefited from the same pension bump that got the fund into trouble to begin with, there have been no cost of living adjustments since 2004, and some say they struggle to make ends meet.\nRetired Cobb Police Lieutenant Don Minter said his pension of about $54,000 a year isn’t enough to support himself, his wife, his aging father and his adult son, who has struggled with PTSD since returning home from the war in Afghanistan.\nSo at age 62, Minter recently went back to work, earning $15 an hour as a policeman in Euharlee, a small town about an hour and a half away from where he lives with his wife in the North Georgia mountains. Three days a week, he sleeps in a motor home behind City Hall so he can be on time for his 5 a.m. shift.\n“Maybe at 64, we can afford to try to retire again,” Minter said, referring to himself and his wife, who retired from the Federal Bureau of Investigation and now works for a local orchard. “We’re a whole lot better off than most people.”\nCobb is far from alone. It is a common tale for public pensions flush with cash in the late ’90s to have increased benefits or decreased contributions based on overly rosy projections.\nWhile the pension fund is not in immediate danger of bankruptcy, if Cobb leaders fail to adequately address the issue, they could be faced with a choice between raising taxes again or cutting services. Other state and local governments have faced higher borrowing costs as their retirement plans languish in the red.\n“I have looked at thousands of failed and failing pension funds, and there’s never been a failed pension fund that didn’t have a room full of experts saying it wouldn’t,” said Edward Siedle, a former Securities and Exchange Commission attorney and pension expert. Though Cobb revised its assumed rate of return from 8 percent down to 7.5, he said even that is “utterly unrealistic.”\nThe 2019 budget for Cobb includes $55 million for the pension fund — up $9 million from the previous year.\nCobb’s annual payment is expected to rise $1 million to $2 million a year for the next 20 years, peaking at about $70 million in 2041 before falling as beneficiaries of the old, generous plan die off. That’s assuming the fund’s investments do well. If not, the county’s obligation could go up even more.\n“The first thing stakeholders have to look at is the fact that past screw-ups have cost them money and how quick should they be willing to accept losses without explanations,” Siedle said. “If past mistakes aren’t addressed, then it’s likely they’ll be repeated.”","url":"https://www.ajc.com/news/local-govt--politics/cobb-pension-fund-tells-story-fiscal-reckoning/qfoa2gexSmWWlKeuZQc9dK/"}
