{"authors":[],"date_download":"2018-10-30 21:54:11","date_modify":"2018-10-30 21:54:11","date_publish":"2018-08-03 19:12:00","description":"Local officials and advocates for transit and greenspace are eagerly awaiting an announcement from G...","filename":"data/vaneerConsumption/CobbrailtrailadvocatesawaitCSXleaserenewal.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/newsEngin.22653695_trainfatal.0313-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_cobb-rail-trail-advocates-await-csx-lease-renewal__1540936451.html","title":"Cobb rail, trail advocates await CSX lease renewal","title_page":"Cobb rail, trail advocates await CSX lease renewal","title_rss":"NULL","source_domain":"ajc.com","text":"Local officials and advocates for transit and greenspace are eagerly awaiting an announcement from Gov. Nathan Deal’s office that could have major implications for the future of mobility in Cobb County.\nCSX’s lease of the Western & Atlantic Railroad, which is owned by the state, is almost up for renewal, and the terms of the new contract will determine whether passenger rail could one day be operated along the same line.\nFans of the Silver Comet Trail are also hoping CSX will agree to abandon several miles of rail it owns that would clear the way to connect the Silver Comet to the Atlanta Beltline by way of a riverside park.\n“It is my understanding that an announcement of a lease is imminent,” wrote State Rep. Teri Anulewicz, who represents South Cobb. “I am confident that the state will represent Cobb County on this issue.”\nState Sen. Lindsey Tippins said he has asked to see the proposal for the new contract and been denied.\n“I was told that the final contract would contain provisions to make passenger rail available to the state,” Tippins said. “I don’t know what those provisions are and I don’t know how favorable they may be.”\nTippins said he believes it would be cheaper to expand the right of way of an existing rail corridor rather than to acquire new right of way, despite logistical concerns about running passenger trains on the same line as freight.\nThe rail line also lacks a connection to MARTA, and early plans to explore building one at the Gulch in downtown seem to have fizzled, Tippins said. The Gulch is reportedly on a list of potential sites that have been submitted to Amazon in hopes of luring the tech giant to Atlanta.\n“I don’t think [passenger rail on the Western & Atlantic] needs to be dismissed summarily and I don’t think we should be held hostage economically on property that the state already owns,” Tippins said.\nLaura Phelps, spokesperson for CSX, declined to comment on specifics but said the negotiations with the state have been “very productive.”\nA spokesperson for Deal said the governor had nothing to announce.\nIn the meantime, Cobb County has already drawn up plans for what it calls the “Silver Comet Connector,” which it estimates will cost about $10 million.\nCobb County has already drawn up plans for a Silver Comet Connector to Atlanta. (Source: Cobb County) (The Atlanta Journal-Constitution)\nThe Silver Comet Trail, which runs from Smyrna to Anniston, Ala., has been an economic boon to the rural areas through which it passes, generating $118 million for Georgia and supporting 1,300 jobs here, according to a 2013 study by the Northwest Georgia Regional Commission.\nCommissioner Lisa Cupid, who represents the area, said she expects to receive good news about what she called a “cherished amenity in our community.”\nRoberta Cook, a volunteer with Connect the Comet, was among those who delivered a petition of nearly 4,000 signatures to Gov. Deal’s office last year urging him to support connecting the Comet and the Beltline. She said she has heard “rumblings” that her group may hear something soon.\n“We think there is some news that is imminent,” she said.","url":"https://www.ajc.com/news/cobb-rail-trail-advocates-await-csx-lease-renewal/Zrw8ErADSY40JoWRFjXKaJ/"}
