{"authors":[],"date_download":"2018-10-30 21:53:07","date_modify":"2018-10-30 21:53:07","date_publish":"2018-06-27 00:48:00","description":"Cobb commissioners decided to spend the last of the money from a 2017 park bond issuance to purchase...","filename":"data/vaneerConsumption/CobbParksCountyapprovespurchaseof30acresofTrittproperty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/10/03/Images/photos.medleyphoto.11617432.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_19a78683737e680886b8fb9dbdba2737__1540936387.html","title":"Cobb Parks: County approves purchase of 30 acres of Tritt property","title_page":"Cobb Parks: County approves purchase of 30 acres of Tritt property","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb commissioners decided to spend the last of the money from a 2017 park bond issuance to purchase 30 acres of undeveloped land in East Cobb that had once been eyed for a large senior housing development.\nWith two commissioners absent, the remaining three representatives voted Tuesday night to spend $8.3 million to purchase part of the parcel known as the Tritt property, after owner Wylene Tritt. Friends of East Cobb Park agreed to donate an additional $102,000 to help close the deal.\nThe land, located next to the current East Cobb Park, will remain undeveloped for the time being.\nCynthia Patterson of the Cobb Parks Coalition used the open comment portion of the meeting to thank commissioners, property owners and park advocates for their support.\n“Tonight we celebrate expanding Cobb’s greenspace legacy,” she said, describing the Tritt parcel as a “green jewel” of East Cobb.\nBut Roberta Cook, also a Cobb Parks Coalition member, reminded the board that they never issued the full $40 million in park bonds approved by voters in 2008.\nLast year, commissioners approved a park bond issuance that ended up totaling $27.4 million. They said they could not legally issue the full $40 million due to the payment schedule written into the original referendum.","url":"https://www.ajc.com/news/local-govt--politics/cobb-parks-county-approves-purchase-acres-tritt-property/jU8UC2XPqD0fTUgM0xvV3L/"}
