{"authors":[],"date_download":"2018-10-30 21:36:33","date_modify":"2018-10-30 21:36:33","date_publish":"2018-07-12 14:56:00","description":"Chris Armstead's video from a Chick-fil-A in Nashville of his gospel flash mob rendition of \"Every Praise\" by Hezekiah Walker has gone viral. The Roswell man works at Children’s Healthcare of Atlanta in North Druid Hills but he works part-time at East Cobb Church of Christ in Marietta.","filename":"data/vaneerConsumption/CobbchurchministersgospelChickfilAflashmobvideogoesviral.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/12/Images/gospelchickfila_1130x707.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cobb-church-mins_ef2a876616f54bb4b385d7f02ea64577__1540935393.html","title":"Cobb church minister’s gospel Chick-fil-A flash mob video goes viral","title_page":"Cobb church minister’s gospel Chick-fil-A flash mob video goes viral","title_rss":"NULL","source_domain":"ajc.com","text":"It’s not uncommon to sing praises in a Chick-fil-A. But it’s rare for 60 professional a capella gospel singers from around the world to plan a flash mob performance inside one.\nVideo of just that was recorded by the worship minister of a Marietta church and has drawn 8 million views after posting it to his Facebook page Saturday.\n“I mean, I was shocked in the first couple of hours when it started to get hundreds of thousands” of views, said Chris Armstead, who recorded the video.\nHe lives with his wife in Roswell and works full-time at Children’s Healthcare of Atlanta in North Druid Hills. But he is the worship minister for East Cobb Church of Christ in Marietta.\nREAD | Cobb teen’s tweet goes viral after personalizing Bible for boyfriend\nThe video was taken in Nashville were he and 60 others were for the weeklong Worship Leader Institute, which trains a capella worship ministers in everything from how to organize singers to microphone techniques.\nAnd, yes, the Chick-fil-A manager is cool with it. The chain is known for its pro-Christian beliefs and commitment to the Bible. After all, it is 60 professional singers paying to give a show to other customers.\nOne group started the song, “Every Praise” by Hezekiah Walker, and then other groups planted in the crowd popped up on certain lines.\nREAD | High schooler uses Marietta Chick-fil-A sign in very public promposal\nREAD | Cobb boy sees colors for first time after mom gets him special glasses\nArmstead said he’s been recording these gospel flash mobs at the store since 2016 and never gotten a response like this online.\nWhen asked why he thought this one resonated so much, he said: “This song ... has so much appeal across a lot of cultural context and worship styles.”\nHe said the diversity of folks in the video helped; those attending the conference were from not only America but Australia, South Africa, Brazil, Guatemala, the United Kingdom and Canada.\nLike Cobb County News Now on Facebook | Follow us on Twitter\nIn other news...","url":"https://www.ajc.com/news/local/cobb-church-minster-gospel-chick-fil-flash-mob-video-goes-viral/YyV6YEQArYa6FWJufFawLM/"}
