{"authors":[],"date_download":"2018-10-30 21:52:02","date_modify":"2018-10-30 21:52:02","date_publish":"2018-09-11 16:29:00","description":"The commission’s approval brings to a close the most significant contract dispute between the Braves and the county since SunTrust Park opened last year.","filename":"data/vaneerConsumption/CobbapprovessettlementwithBravesoverstadiumfees.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/15/Images/newsEngin.22309933_040117-braves-print-ba03.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_04d84f45066903bc62926bbfc37a379d__1540936322.html","title":"Cobb approves settlement with Braves over stadium fees","title_page":"Cobb approves settlement with Braves over stadium fees","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta Braves will pay Cobb County more than a million dollars to cover water and sewer at the team’s new, publicly-financed stadium, according to a settlement approved by commissioners Tuesday.\nCobb Chairman Mike Boyce hailed the agreement as a win for the county, although the amount Cobb will collect is less than the $1.5 million it originally claimed the Braves owed. The net benefit to Cobb reflects money the county agreed to pay the Braves to offset other costs.\n“The board held its ground,” Boyce said.\nThe commission’s approval brings to a close the most significant contract dispute between the Braves and the county since SunTrust Park opened last year. The squabble involved a relatively minor sum, but it represented the kind of unforeseen, ongoing costs that many in Cobb feared when the commission pledged some $400 million in tax dollars to the project five years ago.\nBoyce, who was elected in 2016 on a platform that was critical of the Braves deal, said he was confident that any outstanding disputes with the team have been resolved.\n“There’s no guarantees in this world, but let’s just take the people who are in place right now, who have worked through the first two seasons of this baseball stadium, and so far we’ve reached an agreement on everything,” Boyce said. “I would hope that we are the one partnership, sports partnership, where we do in fact make money.”\nThe vote to approve the settlement split 4-1 after tense exchanges between commissioners over whether they had time to fully vet the agreement.\nCommissioner Lisa Cupid, the sole dissenting vote, said that the county was in danger of repeating mistakes made in 2013 when it rushed to approve the original deal with the Braves. Cupid, an attorney, said she had only been presented with an agenda item to approve a settlement, but not the settlement contract itself.\n“We need to see everything pertaining to any agreement with this organization,” Cupid said, referring to the Braves. “That’s how we got here in the first place.”\nThe disagreement started earlier this year when the county approached the Braves about paying $1.5 million for sewer and water at SunTrust Park. The Braves refused to pay and countered that the county owed the team $4.6 million for various expenses. The two sides initiated mediation proceedings earlier this year, but Tuesday’s vote averted that course.\nThe rift followed a disagreement last year over whether Cobb had satisfied a $14 million obligation to fund transportation infrastructure. At that time, the county agreed to pay $11.8 million to the Braves, the bulk of which came out of the water fund.\nThe remaining $327,000 of that sum will be paid in installments, per the settlement.\nOnly one resident addressed the settlement during the public comment portion of the meeting.\nBen Williams of the Cobb chapter of the Southern Christian Leadership Conference spoke out against any additional payment to the Braves, citing promises by the previous chairman, Tim Lee, that the county’s obligation was capped.\n“It is in our interest to hold the line and not one penny more,” Williams said. “Not one penny more.”\nVIDEO: In other Cobb news","url":"https://www.ajc.com/news/local-govt--politics/cobb-approves-settlement-with-braves-over-stadium-fees/iSAzR7yadcRZD0X7GzYUbO/"}
