{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 20:01:05","date_modify":"2018-10-30 20:01:05","date_publish":"2017-01-24 11:49:09","description":"BY MELISSA RUGGIERI/AJC Music Scene\nThe Coca-Cola Roxy Theatre, the new...","filename":"data/vaneerConsumption/CocaColaRoxyTheatrenearBravesSunTrustParkannouncesopeningco.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/01/24/Images/WPIMAGE_cmgajcmusic_10087.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_coca-cola-roxy-t_3b98899545abccd0b01a3e5d72bdb6e3__1540929665.html","title":"Coca-Cola Roxy Theatre near Braves' SunTrust Park announces opening co","title_page":"Coca-Cola Roxy Theatre near Braves' SunTrust Park announces opening co","title_rss":"NULL","source_domain":"ajc.com","text":"BY MELISSA RUGGIERI/AJC Music Scene\nThe Coca-Cola Roxy Theatre, the new 3,800-capacity venue opening in The Battery Atlanta next to the Atlanta Braves’ home at SunTrust Park, has announced its inaugural handful of concerts.\nThe two-tiered venue is slated to open April 8 with Glass Animals (part of the Radio 105.7 4th Birthday Show). Other concerts announced so far are Corey Smith on April 22 and Bush on May 10.\n\"It fits a niche in the market,\" said Peter Conlon, president of Live Nation Atlanta. \"There's nothing right now with that big of a general admission floor, and a lot of bands want that.\"\nIn addition to the GA floor, the 53,000 square foot site will offer permanent seating in the balcony.\nThe Roxy is named after the original theater, which was stationed in Buckhead until 2008 (it’s now Buckhead Theatre). The new venue will feature tributes to the original with Elvis and Elton (John) bars and memorabilia.\n\"I like when we use the vintage names, like the stages at Music Midtown, because people have good memories,\" Conlon said. \"People grab me all the time and say, I met my wife at such and such show. (The original Roxy) accomplished a lot in its day. I watched Leonard Cohen play there. Elton played it, Bon Jovi played it, Johnny Cash...\"\nThe plan for the Roxy – which will offer free Wi-Fi, five full service bars, flat screens throughout and easy entrance/exit flow - is to host about 40 shows per year.\nWith a size that sits between the 2,600-capacity Tabernacle and 6,900-capacity Chastain Park Amphitheatre, the Roxy Theatre will be booked accordingly and feature all genres of music. But Conlon isn't worried about competing with his own venues.\n\"It's a numbers issues as far as demand. We'll ultimately go with what we think is the best play for the act - and some bands want to just do general admission. I don't think it will be a problem,\" he said.\nAll concerts will go on sale at 10 a.m. Jan. 27 at www.livenation.com.\nFollow the AJC Music Scene on Twitter and Facebook.","url":"https://www.ajc.com/blog/music/coca-cola-roxy-theatre-near-braves-suntrust-park-announces-opening-concerts/C9OXeQqPD3V4Wf0cHvBdHN/"}
