{"authors":[],"date_download":"2018-10-30 14:20:54","date_modify":"2018-10-30 14:20:54","date_publish":"2014-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/COCommissionrulescakebakermustservegaycouples.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_co_commission_rules_cake_baker_must_serve_gay_couples_comments_1540909254.html","title":"CO Commission rules cake baker must serve gay couples","title_page":"Blog: CO Commission rules cake baker must serve gay couples","title_rss":"NULL","source_domain":"americanthinker.com","text":"A cake shop owner who was sued by a gay couple for refusing to make a cake for their reception has been ordered to make cakes for gay couples, and \"to report quarterly for two years on staff anti-discrimination training and any customers he refuses to serve,\" according to the AP: Colorado's Civil Rights Commission on Friday ordered a baker to make wedding cakes for same-sex couples, finding his religious objections to the practice did not trump the state's anti-discrimination statutes. The unanimous ruling from the seven-member commission upheld an administrative law judge's finding in December that Jack Phillips violated civil rights law when he refused to make a wedding cake for a gay couple in 2012. The couple sued. \"I can believe anything I want, but if I'm going to do business here, I'd ought to not discriminate against people,\" Commissioner Raju Jaram said. Phillips, a devout Christian who owns the Masterpiece Cakeshop in the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/05/co_commission_rules_cake_baker_must_serve_gay_couples_comments.html"}
nvictions until somebody shuts me down,\" he told reporters after the ruling.\nHe added his bakery has been so overwhelmed by supporters eager to buy cookies and brownies that he does not currently make wedding cakes.\nThe couple who sued Phillips, Dave Mullins and Charlie Craig, were pleased that the commission roundly rejected Phillips' arguments. \"We're just thrilled by that,\" Mullins said.\nGay marriage remains illegal in Colorado. Mullins and Craig were married in Massachusetts and wanted a wedding cake for a reception to celebrate their union back home in Colorado.\nState law prohibits businesses from refusing to serve customers based on their sexual orientation.","url":"https://www.americanthinker.com/blog/2014/05/co_commission_rules_cake_baker_must_serve_gay_couples.html"}
