{"authors":[],"date_download":"2018-10-22 21:03:32","date_modify":"2018-10-22 21:03:32","date_publish":"2014-05-05 20:10:13","description":"A mystifying NSA tweet turned out to be in code — but such a simple one that it can be solved in seconds.","filename":"data/vaneerConsumption/CodeCrackedMysteriousNSATweetIsDecryptedinSeconds.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/421536/nsa_caf18475588e98452bab213d59ef59fe.1200;630;7;70;5.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_code-cracked-mysterious-nsa-tweet-decrypted-seconds-n97546_1540242212.html","title":"Code Cracked: Mysterious NSA Tweet Is Decrypted in Seconds","title_page":"Code Cracked: Mysterious NSA Tweet Is Decrypted in Seconds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNSA's recruiting office sent out a mystifying tweet Monday morning, prompting observers to question whether perhaps the agency had sent the nonsense message by accident. But on closer inspection, the tweet turned out to be a code designed to lure in would-be cryptographers — though by cipher standards, it's a pretty simple one.\nThe letters below look at first like they could represent anything. But to the eye of a cryptographer, a few things stand out. See if you can spot them.\nThe period comes at the end, and each \"word\" is 12 characters long — except those with punctuation. This suggests that the spaces are meaningless, only the letters are in code, and the symbols are being used normally.\nIn addition, simple analysis of the coded text shows that some letters appear more frequently than others, just as in English and other languages. This suggests the code is a simple \"substitution cypher,\" where each letter is changed for another.\nThis type of cryptogram is among the oldest and simplest, one version of it having been used by none other than Julius Caesar.\nSuch simple code can be solved by brute force, using a computer tool to try hundreds of different combinations of letter swaps. It only took six seconds for this Web app to figure out the solution, albeit with a minor error. But half an hour's work would have done it, too: The most common letters in the code (P, C and I) are likely the most common letters in English (E, T and A) — as indeed they turned out to be. The message is:\n\"Want to know what it takes to work at NSA? Check back each Monday in may as we explore careers essential to protecting our nation.\"\nNot quite as disappointing as \"Don't forget to drink your Ovaltine,\" but still not as exciting as people might have hoped. We'll keep an eye on the NSA's Twitter account to see if future coded messages appear this month.\nWhen contacted for more information, an NSA spokesperson wrote in an email to NBC News that the coded tweet is not in fact the first, and is \"part of recruitment efforts to attract the best and the brightest.\"","url":"https://www.nbcnews.com/tech/security/code-cracked-mysterious-nsa-tweet-decrypted-seconds-n97546"}
