{"authors":["Abc News"],"date_download":"2018-10-30 00:53:33","date_modify":"2018-10-30 00:53:33","date_publish":"2018-10-28 19:16:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/CodyBellingernotstartinginGame5MaxMuncytostartat2B.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_cody-bellinger-starting-game-max-muncy-start-2b_story_id=58813836_1540860813.html","title":"Cody Bellinger not starting in Game 5; Max Muncy to start at 2B","title_page":"Cody Bellinger not starting in Game 5; Max Muncy to start at 2B - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"LOS ANGELES -- Max Muncy, out of the starting lineup when the Los Angeles Dodgers faced David Price under American League rules earlier in this series, will start at second base in Game 5 of the World Series on Sunday, with the Boston Red Sox one win away from a championship.\nThe Dodgers will sacrifice some defense in order to utilize the left-handed bat of Muncy, who finished the regular season with an .891 OPS against lefties. Cody Bellinger, another left-handed hitter with more drastic platoon splits, will be on the bench, with David Freese starting at first base and Enrique Hernandez playing center field.\nThe Dodgers will start with four consecutive right-handed hitters -- Freese, Justin Turner, Hernandez and Manny Machado, respectively. Dodgers manager Dave Roberts, who used all-right-handed lineups when his team faced Chris Sale and Price in Games 1 and 2, said he likes Muncy's \"at-bat quality.\"\nEven with lefty Clayton Kershaw on the mound, the Red Sox will ignore the matchup advantages at third base (using the left-handed-hitting Rafael Devers instead of the right-handed-hitting Eduardo Nunez) and at second base (the left-handed-hitting Brock Holt starts instead of the right-handed-hitting Ian Kinsler).\nThe outfield alignment will be Andrew Benintendi in left, Mookie Betts in center and J.D. Martinez in right, with center fielder Jackie Bradley Jr. available off the bench alongside first baseman Mitch Moreland, who hit a pinch-hit three-run homer in the seventh inning of Ryan Madson on Saturday.\nDodgers closer Kenley Jansen will be available despite recording nine outs over the past two games, Roberts said.","url":"https://abcnews.go.com/Sports/cody-bellinger-starting-game-max-muncy-start-2b/story?id=58813836"}
