{"authors":["Associated Press","Harry Pettit For Mailonline"],"date_download":"2018-10-23 03:28:34","date_modify":"2018-10-23 03:28:34","date_publish":"2017-04-26 14:56:17","description":"'Coca-Cola Plus' has shipped in white bottles in Japan. The no-calorie beverage contains five grams (0.2oz) of indigestible dextrin - a source of dietary fibre - per 470ml bottle.","filename":"data/vaneerConsumption/CokeisaddingFIBREtoitsdrinks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/27/09/3FA73AE600000578-0-image-a-8_1493281071566.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447932_Coke-offers-namesake-drink-fiber-Japan_1540265314.html","title":"Coke is adding FIBRE to its drinks","title_page":"Coke is adding FIBRE to its drinks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Coke's flagship cola is being sold as a health drink of sorts in Japan, with a version that promises to deliver fibre.\n'Coca-Cola Plus' has shipped in white bottles and is designed to go alongside meals.\nThe no-calorie beverage contains five grams (0.2oz) of indigestible dextrin – a source of dietary fibre – per 470ml bottle.\nScroll down for video\nCoke's flagship cola is being sold as a health drink of sorts in Japan, with a version that promises to deliver fibre. 'Coca-Cola Plus' has shipped in white bottles and is designed to go alongside meals\nWHY COKE IS ADDING FIBRE TO ITS DRINKS Drinks promising health benefits are common in Japan. The country is home to the world's largest ageing population, and older consumers are driving growth of it's healthy beverage market. This market is led by teas, followed by cola soft drinks. 'Being an ageing society has made it a unique market where consumers are extremely health-conscious and seek functionality,' said Dr David Machiels, product development director at Coca-Cola Asia Pacific.\n'Drinking one Coca-Cola Plus per day with food will help suppress fat absorption and help moderate the levels of triglycerides in the blood after eating,' the company said in a press release.\nIt claims that the drink is a result of 'more than a decade of research and development'.\nThe launch of Coca-Cola Plus was noted by the company in Japan during a call Tuesday, as well as Canada Dry Plus that has fibre.\nCoca-Cola Plus hit shelves in March, the company said, and is being marketed to the 40-and-over crowd.\nThe company said this group is driving the growth of the country's 'food of specified health use' (FOSHU) products.\n'Coca-Cola Plus is a sugar-free and calorie-free beverage with FOSHU functions,' said Dr David Machiels, product development director at Coca-Cola Asia Pacific.\n'We hope people will drink it with meals.'\nJapan is home to the world's largest ageing population.\nDrinks promising health benefits are common in Japan. Japan has an aging society, creating a unique market in which consumers are extremely health-conscious and seek functionality, said Dr David Machiels (pictured), product development director at Coca-Cola Asia Pacific\nOlder consumers are driving growth of the country's FOSHU beverage market, led by teas, followed by cola soft drinks.\n'Being an ageing society has made it a unique market where consumers are extremely health-conscious and seek functionality,' Dr Machiels said.\nDrinks promising health benefits are common in Japan.\nCoke is the top beverage maker in the country, but not necessarily because of its namesake drinks.\nInstead, the bigger brands include a canned coffee, orange-flavoured water and green tea.\nCoke also introduced a tea with fibre in Japan in 2014.","url":"https://www.dailymail.co.uk/sciencetech/article-4447932/Coke-offers-namesake-drink-fiber-Japan.html"}
