{"authors":["Sportsmail Reporter"],"date_download":"2018-10-23 01:03:46","date_modify":"2018-10-23 01:03:46","date_publish":"2016-01-29 14:51:04","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/ColchestervsTottenhamTeamnewskickofftimeprobablelineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30A1D12100000578-0-image-a-40_1454078707383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-3422744_Colchester-vs-Tottenham-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash_1540256626.html","title":"Colchester vs Tottenham: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash","title_page":"Colchester vs Tottenham: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Tottenham's trip to League One side Colchester United.\nTeam news\nColchester\nKevin Keen could turn to experienced players Nicky Shorey and Darren Ambrose when they host Tottenham after the duo came off the bench during their defeat at Scunthorpe last week.\nThe boss could rotate his squad as his side struggle at the bottom of League One. Elliot Lee could make his first start following his loan switch from West Ham.\nProvisional squad: Walker, Garvan, Briggs, Edwards, Wynter, Elokobi, Wright, Gilbey, Porter, Moncur, Massey, Lee, Olufemi, Kent, Szmodics, Eastman, Bonne, Vincent-Young, Brindley, Ambrose, Shorey, Kean, Parish, Sordell\nColchester United midfielder Darren Ambrose could feature against Tottenham\nTottenham\nKevin Wimmer will slot in for knee ligament injury victim Jan Vertonghen in the fourth-round clash at Colchester.\nEngland stars Harry Kane and Dele Alli could start from the bench as Spurs boss Mauricio Pochettino bids to keep his top stars fresh.\nRyan Mason has still failed to recover from his ankle injury.\nProvisional squad: Lloris, Vorm, Walker, Rose, Trippier, Davies, Alderweireld, Wimmer, Dembele, Carter-Vickers, Fazio, Winks, Dier, Alli, Carroll, Bentaleb, Eriksen, Onomah, Chadli, Lamela, Son, Kane\nKevin Wimmer will slot in for knee ligament injury victim Jan Vertonghen\nKey match stats (supplied by Opta)\nCOLCHESTER v TOTTENHAM Kick-off: Saturday, 12.45pm (BT Sport) Odds (subject to change): Colchester: 8/1 Draw: 9/2 Tottenham: 2/5 Referee: Michael Oliver Managers: Kevin Keen (Colchester), Mauricio Pochettino (Tottenham)\nThis will be the first ever competitive meeting between these sides.\nNo player has scored more goals in this season’s FA Cup than Colchester’s Macauley Bonne (4).\nTottenham haven’t progressed past this stage since they reached the semi-final in 2012, while Colchester last reached the fifth round in 2006. Both sides were undone by Chelsea in those seasons.\nSpurs have lost just one of their last 13 FA Cup games against lower league opposition (W9 D3), though it was their most recent encounter (vs Leeds in the fourth round in 2013).\nSpurs are unbeaten in nine successive away matches in all competitions (W6 D3 L0).\nThe Lilywhites have scored in 14 successive competitive games away from home.\nHarry Kane has scored 15 goals in his last 18 appearances for Spurs in all competitions.","url":"https://www.dailymail.co.uk/sport/article-3422744/Colchester-vs-Tottenham-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash.html"}
