{"authors":["Associated Press"],"date_download":"2018-10-23 03:53:10","date_modify":"2018-10-23 03:53:10","date_publish":"2016-01-28 19:38:12","description":"NEW YORK (AP) — After its upcoming Super Bowl halftime show, Coldplay expects to be accustomed to big stages. The British rockers said Thursday they would be...","filename":"data/vaneerConsumption/ColdplaysetsUSstadiumconcerttour.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:bd0f5cb9f02f4d06ba4637c107e6f21d-4PuZeKVXE7cd9005b2c8760cdacf-384_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421025_Coldplay-sets-US-stadium-concert-tour_1540266790.html","title":"Coldplay sets US stadium concert tour","title_page":"Coldplay sets US stadium concert tour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Coldplay sets US stadium concert tour\nNEW YORK (AP) — After its upcoming Super Bowl halftime show, Coldplay expects to be accustomed to big stages.\nThe British rockers said Thursday they would be performing seven stadium gigs in the United States this summer, touring in support of their album, \"A Head Full of Dreams.\" Since the announcement called them the first U.S. shows, it is expected there will be more.\nAll of those announced so far are on Saturday nights, starting July 16 at MetLife Stadium in the New York City metropolitan region.\nFILE - In this Nov. 22, 2015, file photo, Jonny Buckland, from left, Chris Martin, Will Champion, and Guy Berryman of Coldplay perform at the American Music Awards at the Microsoft Theater in Los Angeles. The British rockers said Thursday, Jan. 28, 2016, they would be performing several stadium gigs in the United States this summer, touring in support of its album, \"A Head Full of Dreams.\" (Photo by Matt Sayles/Invision/AP, File)\nColdplay is also scheduled to play Soldier Field in Chicago; Gillette Stadium outside Boston; Lincoln Financial Field in Philadelphia; the Rose Bowl in the Los Angeles area; AT&T Stadium in Arlington, Texas; and Levi's Stadium in the San Francisco market.\n___\nOnline:\nhttp://coldplay.com/\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421025/Coldplay-sets-US-stadium-concert-tour.html"}
