{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 03:49:16","date_modify":"2018-10-23 03:49:16","date_publish":"2017-04-26 15:22:32","description":"It was business as usual for Coleen Rooney on Wednesday when she hit the gym in Liverpool, showing off her figure in skin-tight sportswear.","filename":"data/vaneerConsumption/ColeenRooneyshowsofftonedfigureinsportswear.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA014DE00000578-0-image-a-25_1493216540956.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448052_Coleen-Rooney-shows-toned-figure-sportswear_1540266556.html","title":"Coleen Rooney shows off toned figure in sportswear","title_page":"Coleen Rooney shows off toned figure in sportswear | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She enjoyed a family getaway in Madrid over the weekend.\nAnd it was business as usual for Coleen Rooney on Wednesday when she hit the gym in Liverpool, showing off her figure in skin-tight sportswear.\nThe WAG, 31, was rocking a long-sleeved top and curve-hugging leggings, switching her trainers for sliders after her exercise session.\nScroll down for video\nGym bunny: It was business as usual for Coleen Rooney on Wednesday when she hit the gym in Liverpool, showing off her figure in skin-tight sportswear\nColeen appeared to be running errands, clutching her essentials in one hand and her diary in the other.\nThe brunette pulled her long locks up in a high ponytail and opted for natural make-up.\nShe was fresh from her holiday to Spain, watching the big match between Real Madrid and Barcelona with son Kai.\nOut and about: Coleen appeared to be running errands, clutching her essentials in one hand and her diary in the other\nThe mother-of-three shared a snap of son Kai, seven, at the Bernabéu stadium in Madrid on Sunday night, captioning it with the words: 'Great night with Kai at Madrid v Barcelona!!..... Lucky Boy.'\nYoung Kai is a keen football fan and is already following in father Wayne's footsteps by training at the Manchester United youth academy, as well as reportedly attending sessions at rivals Manchester City.\nEarlier this month, Wayne, 31, posted a sweet tribute to Coleen on Instagram to mark her 31st birthday.\nThe Manchester United striker shared an adorable photo of his long-term love cuddled up to their young brood to his 24.3million online followers.\nLucky boy: The mother-of-three later shared a snap of son Kai, seven, at the Bernabéu stadium on Madrid on Sunday night\nIn the snap, a smiling Coleen looked every inch the doting mother as she kept her three young sons Kai, Klay, three, and baby Kit, one, close as they posed for the charming photo together.\nCaptioning the cute picture, Wayne wrote: 'Happy Birthday to my wife and the best mum to our boys @ColeenRoo.'\nHe also shared a snap of him and his wife enjoying a romantic dinner together to kick off the birthday celebrations.\nLoved up: Earlier this month, Wayne, 31, posted an Instagram snap of the couple enjoying a romantic dinner together to celebrate Coleen's birthday","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448052/Coleen-Rooney-shows-toned-figure-sportswear.html"}
