{"authors":["April Glover For Daily Mail Australia"],"date_download":"2018-10-22 23:08:09","date_modify":"2018-10-22 23:08:09","date_publish":"2017-03-16 05:56:59","description":"Coles Express has been overcharging Australian motorists by up to four cents per litre in Sydney, Melbourne and Brisbane. The supermarket is hiking its prices in bid to keep up with Woolworths.","filename":"data/vaneerConsumption/ColesExpressoverchargingdriverswithexpensivefuel.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E50A2D400000578-0-image-a-11_1489636882231.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318680_Coles-Express-overcharging-drivers-expensive-fuel_1540249689.html","title":"Coles Express overcharging drivers with expensive fuel","title_page":"Coles Express overcharging drivers with expensive fuel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It has been revealed supermarket giant Coles is overcharging motorists by as much as four cents per litre for fuel.\nColes sells petrol to drivers at its chain of Express stations and is ripping off customers particularly in Sydney, Melbourne and Brisbane, a report has found.\nIn an interview on The Today Show, NRMA spokesperson Peter Khoury said Coles has hiked prices simply 'because they can'.\nScroll down for video\nColes Express outlets are charging up to four cents more than other petrol stations, a Motormouth report finds\nColes is jacking up its prices to fund its eternal price war with competitor Woolworths, and its costing customers an extra four cents every litre, a Motormouth report found.\nAnd the supermarket chain is targeting Australia's busiest capital cities with high-priced Coles Express fuel.\nKhoury said: 'Sydney, Melbourne and Brisbane were hit the hardest, and they are the cities you'd expect price pressure to go down because there is so much competition.\nBut Coles is actually putting its prices up. So they're bucking the trend and they're making a fair bit of money off the back of motorists.'\nThe supermarket chain hikes its prices to keep up with a raging price war against competitor Woolworths\nKhoury told Today that the lowest prices for fuel on any given day can usually be found in South-West and Western Sydney.\nThe most expensive suburbs to fill up in Sydney are the Eastern suburbs and the Northern Beaches.\nWhen asked how motorists could avoid being overcharged for fuel, Khoury said to 'shop around'.\n'The local motoring clubs will always tell you where the cheapest petrol is, where the cheapest suburbs are,' he added.\nColes operates over 685 Coles Express convenience outlets across Australia.\nDaily Mail Australia contacted Coles for comment and are waiting on a response.","url":"https://www.dailymail.co.uk/news/article-4318680/Coles-Express-overcharging-drivers-expensive-fuel.html"}
