{"authors":["Peter Devlin","Leith Huffadine For Daily Mail Australia"],"date_download":"2018-10-22 23:21:44","date_modify":"2018-10-22 23:21:44","date_publish":"2016-01-11 05:27:18","description":"Australian supermarket Coles is under pressure to remove its eggs from warm shelves to prevent the spread of salmonella, matching a promise from rival Woolworths.","filename":"data/vaneerConsumption/Colesunderpressuretomoveeggsoffwarmshelvestopreventsalmonella.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004C66500000578-0-image-a-19_1452486726034.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393181_Coles-pressure-eggs-warm-shelves-prevent-salmonella_1540250504.html","title":"Coles under pressure to move eggs off warm shelves to prevent salmonella","title_page":"Coles under pressure to move eggs off warm shelves to prevent salmonella  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Woolworths to move eggs from warm to\nAustralian supermarket giant Coles is coming under increasing pressure from its customers to move eggs off warm shelves to prevent the spread of salmonella, matching a promise made by rival Woolworths.\nThe widespread practice of storing eggs unrefrigerated in supermarkets could lead to more salmonella outbreaks, particularly in warm weather, experts warn.\nCompetitor Woolworths has said it would store eggs on refrigerated shelves to prevent salmonella being spread, but Coles has yet to offer its customers the same assurance.\nShoppers are calling for all eggs to be refrigerated in supermarkets across Australia after concerns have been raised about eggs left on shelves causing salmonella\nThis has upset Coles customers, with some threatening to boycott stores until action is taken. Many angry shoppers took to social media to vent their frustration.\n'This applies to all Coles, GET THE EGGS BACK IN THE FRIDGE,' one disgruntled customer posted on the company’s Facebook page on Saturday.\n'When you start to take other people’s health in your own hands, that’s where we need to draw the line,' another shopper posted on Monday.\nColes has been replying to complaints advising those concerned that its practice regarding egg storage adheres to Food safety Australia and New Zealand (FSANZ) standards.\nMany major supermarkets and local grocery stores across Australia keep eggs on warm shelves, despite many egg producers and wholesalers advising they are kept chilled.\nWoolworths has said it will keep all eggs in refrigeration, while the storage process at IGA supermarkets is not known as each retailer is independently owned\nStoring eggs on warm shelves is a common practice in supermarkets throughout Australia\nColes says it 'adheres to all regulations regarding egg storage, while Aldi would not say if any of its stores kept eggs chilled\nColes told the Sydney Morning Herald it 'adheres to all health and safety regulations regarding egg storage'.\nAldi did not say if any of its stores kept eggs refrigerated.\nBut Woolworths told the newspaper it would start to chill all eggs, and already did so at some stores.\nA major egg supplier for IGA said it told store owners to keep eggs below five degrees.\nAs the stores are individually owned, it was not known how many followed recommendations, the Sydney Morning Herald reported.\nThe widespread practice of storing eggs unrefrigerated in supermarkets could lead to higher risks of salmonella outbreaks, particularly in warm weather\nCustomers have vowed to boycott Coles because it stores eggs on warm shelves after experts warned a lack of refrigeration is behind a spike in salmonella outbreaks\nALDI did not disclose if any of its stores keep eggs in refrigerators\nCustomers have already stopped buying their eggs from Coles over fears of an increased salmonella risk\nColes replied to complaints advising customers that it adheres to Food Safety Australia and New Zealand standards\nDespite a recent rise in salmonella cases - with up to 40 percent related to contaminated eggs - retailers are not required to keep them cold, the Sydney Morning Herald reported.\nAssociate Professor Martyn Kirk, an epidemiology expert from the Australian National University, said it was 'crucial' for supermarkets to consider cold egg storage - as well as other salmonella prevention methods - as it could help reduce the risk of an outbreak.\n'It is a priority. We've seen lots of outbreaks. We should be doing multiple things to try and prevent salmonella occurring,' he told the Sydney Morning Herald.\nDespite a recent rise in salmonella cases in Australia- with up to 40 percent related to contaminated eggs - retailers are not required to keep them cold, the Sydney Morning Herald reported\nSalmonella bacteria is carried by birds and usually spread to eggs from faeces, and can cause diarrhoea, vomiting, stomach cramps, headaches and fever\nThe Australia Egg Corporation Limited compiled this list of recommendations for storing and checking eggs\nSalmonella bacteria is carried by birds and usually spread to eggs from faeces.\nSymptoms can include diarrhoea, nausea and vomiting, stomach cramps, fever and headache.\nFood safety laws require Australian eggs to be washed, checked for cracks, graded, and then stored and transported chilled - but not kept chilled on retailer's shelves.\nJanuary, February and March were the peak period for infections, according to National Notifiable Diseases Surveillance System figures.\nAssociate Professor Martyn Kirk said it was 'crucial' for supermarkets to consider cold egg storage to help reduce the possibility of salmonella outbreaks\nFood safety laws require Australian eggs to be washed, checked for cracks, graded, and the stored and transported chilled - but not kept chilled on retailer's shelves","url":"https://www.dailymail.co.uk/news/article-3393181/Coles-pressure-eggs-warm-shelves-prevent-salmonella.html"}
