{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-23 01:14:51","date_modify":"2018-10-23 01:14:51","date_publish":"2016-01-29 15:00:34","description":"Brisbane teenager Cole Miller's (pictured) heart is now beating in a young boy's chest and his lungs have been given to help another boy and little girl breathe.","filename":"data/vaneerConsumption/ColeMillersorganshavebeendonatedtosixpeople.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B32A9700000578-0-image-a-2_1454079661457.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422938_Cole-Miller-s-organs-donated-six-people_1540257291.html","title":"Cole Miller's organs have been donated to six people","title_page":"Cole Miller's organs have been donated to six people | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His life was tragically cut short after a one-punch attack when he was just 18-years-old.\nBut Brisbane teenager Cole Miller has helped save the lives of at least six others - including three young children - after his healthy organs were donated.\nThe teenager's heart is now beating in a young boy's chest and his lungs have been given to ensure that another boy and a girl can breathe.\nThree adults have also been given the chance to live longer and healthier lives after receiving the young water polo player's kidneys and liver, the Courier Mail reported.\nCole Miller's (pictured) life was tragically cut short after a one-punch attack when he was just 18-years-old\nCole's older brother Billy (pictured speaking at a memorial) said the whole family 'broke down in tears' when they heard about the 'miracle'\nCole's older brother Billy, an Olympic water polo player, said the whole family 'broke down in tears' when they heard about the donations, saying it was a 'miracle'.\n'You don't get the specifics but when we found out, we all broke down in tears again,' he said.\n'To think that at the age of 18, he could save someone else's life — even though we were going through this tragedy with our own family, the fact that we could help someone else was amazing.\n'We'll probably never meet that boy, or that little girl. But hopefully she has an extended and joyful life and lives it to her full potential.\n'If anything, it's magical. It really is.'\nHe revealed that his mother had always encouraged them to get an organ donation licence, but the brothers never thought anything would happen to them.\nSteven and Mary-Leigh Miller sprinkle holy water on the coffin of their son, 18 year-old one-punch victim Cole Miller, during his funeral service in Brisbane at the Cathedral of St Stephen on Wednesday\nThe teenager's heart is now beating in a young boy's chest and his lungs have been given to ensure that another boy and a girl can breathe\nCole had just got back from an interstate water polo tournament when he decided to join friends for a night in Fortitude Valley.\nPolice have alleged he was 'coward punched' in the back of the head in Chinatown Mall after he was challenged to a fight in the early hours of January 3.\nHe died in hospital from massive head trauma a day after the alleged assault.\nDaniel Maxwell and Armstrong Renata, both 21, were remanded over the attack and charged with unlawful striking causing death, a charge that carries a maximum penalty of life imprisonment.\nMr Maxwell's lawyer, Michael Bosscher, unsuccessfully tried to argue that he did not deliver the fatal blow.\nCole was laid to rest in a heartbreaking funeral service on January 13 attended by his family and friends at the Cathedral of St Stephen.\nHis father, Steven, wiped away tears and broke down with grief while delivering the eulogy during the funeral for his 18-year-old son that was attended by more than 1,000 people.\nThe ABC reports that the bereaved father spoke lovingly of his son's years growing up in the family home on the Sunshine Coast.\n'He was always good for a kiss and a cuddle,' he said.\n'Still in year 12, the whole family always stopped for a hug and a kiss from him. It was our family tradition.\n'This young boy, Cole, could hold my heart in his every being. He did so then and he still does.'","url":"https://www.dailymail.co.uk/news/article-3422938/Cole-Miller-s-organs-donated-six-people.html"}
