{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-22 22:17:45","date_modify":"2018-10-22 22:17:45","date_publish":"2016-01-28 10:11:19","description":"Coleen Rooney has shared the first picture of her newborn baby Kit with her older sons.","filename":"data/vaneerConsumption/ColeenRooneysharespictureofnewbornbabyKitwitholdersonsKaiandKlay.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A9244B00000578-0-image-a-12_1453975838703.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420653_Proud-mother-Coleen-Rooney-shares-sweet-picture-newborn-baby-Kit-older-sons-Kai-Klay_1540246665.html","title":"Coleen Rooney shares picture of newborn baby Kit with older sons Kai and Klay","title_page":"Coleen Rooney shares picture of newborn baby Kit with older sons Kai and Klay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Coleen Rooney has shared the first picture of her newborn baby Kit with her older sons.\nThe 29-year-old posted the black and white image on Thursday morning, an adorable snapshot of her boys Kai, six, and two-year-old Klay sat with her in the middle as the older of the boys bottle feeds the youngest.\nAlong with the picture, she wrote: 'Love at first sight!! My boys.'\nScroll down for video\nAdorable! Coleen Rooney shared the first picture of her three sons all together on Thursday, with her eldest son Kai, six, feeding newborn son Kit, as two-year-old Klay watched on\nIn the snap, Coleen looks glowing as she relaxes on a hospital bed with hers and husband Wayne's children, toddler Klay sat on her lap as she cuddled him.\nAnd Kai looks like a responsible young fellow as he carefully cuddles his little brother while giving him his latest meal.\nThe adorable snapshot of their happy and ever-expanding family comes after proud dad Wayne shared his own picture earlier in the week.\nShowing off his new bundle of joy on Instagram on Monday, the footballer posted a picture of Kit at just a few minutes old alongside the caption: 'Meeting Kit for the first time. Home time now.'\n'Meeting Kit for the first time': Proud father Wayne Rooney has posted a cute Instagram picture of his newborn baby, Kit, at just a few minutes old. However, he received criticism from fans who pointed out that all three of his children - Kai, Klay and Kit - now share the same initials as the KKK - the abbreviation for the Ku Klux Klan\nThe 30-year-old and his wife Coleen announced the arrival of their third son - naming him Kit Joseph Rooney - on Sunday.\nThey both took to Twitter to announce the news, writing: 'Our gorgeous little boy arrived today. Kit Joseph Rooney. 8Ib 1oz. We are over the moon.'\nThe proud parents also later shared a picture of him in his car seat as they made their way home, with Coleen writing: 'Welcome to the world Kit.'\n'Home and well': The Manchester United player posted another sweet image of his newborn baby son on his Instagram page on Monday afternoon\nJust hours after revealing the first photograph of their new arrival, Wayne's Twitter followers started trolling him – pointing out that all three of his children's initials are KKK, the same as the white supremacist group\nHowever, just hours after revealing the first photograph of their new arrival, Wayne's Twitter followers started trolling him – pointing out that all three of his children's initials are KKK.\nTheir eldest son Kai, who is now six, was born in November 2009, while second son Klay, arrived in May 2013.\nDozens of people pointed out on social media that the initials for all three children stood at KKK and drew comparison to the 'Ku Klux Klan' – the white supremacist organisation.\nDarren Taylor wrote: 'Has Rooney really called his kids the KKK?'\nDozens of people pointed out on social media that the initials for all three children stood at KKK and drew comparison to the 'Ku Klux Klan' – the white supremacist organisation\nWhile Anthony Tierney wrote: 'Wayne & Colleen Rooney do know there are 25 other letters in the alphabet right? Calling your kids KKK not the cleverest idea ever #Rooney'\nMarcus Page said: 'Rooney and his three children. Kai, Klay and Kit. Also known as the KKK.'\nAnd Mark Ashall wrote: 'So Wayne Rooney's 3 kids will now be known as the KKK, brilliant forward thinking by the parents......Not!'\nOthers added: 'So Rooney has called his children Kai, Klay and Kit. His children are the KKK. They will get on with John Terry #mufc'\nAnd: 'Can't wait for all of Rooney's kids to play in attack for United and be known as 'The KKK.'\n'Looking forward to starting my capsules': Coleen has revealed she will eat her own placenta following the birth of her third son Kit\nMeanwhile, Coleen has also admitted that she'll be taking pills made from her new son's placenta.\nTaking post-pregnancy in her stride, the mother-of-three has had her son’s placenta made into capsules by Liverpool company Placenta Plus.\nSharing a picture of the pills on Twitter, Coleen excitedly said: ‘Looking forward to starting my capsules @placentaplus1 .... Thank you xx (sic)’\nColeen isn’t the only new mother who is trying out this trend as Kim Kardashian recently revealed she took the pills after having daughter North West and again with new baby Saint.\nTelling fans: Taking post-pregnancy in her stride, the mother-of-three has had her son’s placenta made into capsules by Liverpool company Placenta Plus\n‘I’m having it freeze-dried and made into a pill form – not actually fry it like a steak and eat it (which some people do, BTW),’ she confessed on her app.\n‘I had great results and felt so full of energy and didn’t have any signs of depression. I definitely had to do it again.\n‘Every time I take a pill, I feel a surge of energy and feel really healthy and good. I totally recommend it for anyone considering it!’\nThe day prior to Kit's birth, Wayne had hinted that it could almost be time, as the footballer shared a poignant throwback photograph of the family, taken after the birth of their second son Klay.\nThe snap, taken in May 2013, showed the happy couple with their boys, including newborn Klay and their eldest son Kai.\nHappy: Coleen and Wayne announced the arrival of their new baby boy Kit Joseph Rooney on Sunday via Twitter - they are pictured with their eldest sons Kai (left) and Klay (right) in an Instagram snap\nSo thrilled: The couple both tweeted the news via their Twitter accounts\nAlong with the image, shared on Thursday, the footballer added: '#TBT - Family picture after Klay was born. Not long left until the new addition is here! #Family.'\nAhead of the birth, Coleen tweeted on January 18 along with a couple of heart and baby emojis: 'No baby yet!! .... Hurry up!! ..... Too comfy.'\nAnd, earlier last week, eager father Wayne, shared another family photo, writing: 'Not long left until our third child arrives, can't wait to meet the new member of our family!'\nThe time is nigh! Wayne Rooney shared a lovely throwback family photo on Thursday, taken shortly after Coleen gave birth to their second son Klay in 2013 - as they hinted that the labour could have started\nBefore the big day: Coleen, pictured last week when she was due to give birth any day\nWayne and Coleen - who have been together since they were 16, and married in 2008 - revealed their baby news back in July with simultaneous posts on their respective Twitter pages.\nThe glowing mum took to her Twitter account in the height of summer to share the news of her pregnancy with her 1.2million followers.\n'Baby number 3 is on the way ...... January!! We are so happy and excited,' she revealed.\nAnd Wayne also wrote on his page: 'Delighted that me and @ColeenRoo have our 3rd child on the way.'\nThey are already proud parents to six-year-old Kai and Klay, two, but Coleen was said to have been hoping to have a girl the third time around.\nNo baby yet! On Monday, the 29-year-old expectant mum almost seemed frustrated as she revealed on Twitter that her baby was 'too comfy'\nSpeaking shortly after giving birth to Klay in 2013, she told Hello! Magazine: 'I'd probably like another one - not too soon though.\n'I think a girl would complete the family but because the boys get on so well, another boy would be just as nice.'\nHowever, she and her Manchester United player spouse confessed held off learning of their newborn's gender before the birth.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420653/Proud-mother-Coleen-Rooney-shares-sweet-picture-newborn-baby-Kit-older-sons-Kai-Klay.html"}
