{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:36:56","date_modify":"2018-10-22 21:36:56","date_publish":"2016-01-28 08:17:29","description":"Colin Farrell, 39, gelled back his hair before taking a mystery woman out for lunch in West Hollywood on Wednesday","filename":"data/vaneerConsumption/ColinFarrellshowsoffslickedbackhairinWestHollywood.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/08/30A76C2600000578-0-image-a-17_1453968280691.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420521_Colin-Farrell-shows-slicked-hair-takes-mystery-woman-lunch-West-Hollywood_1540244216.html","title":"Colin Farrell shows off slicked back hair in West Hollywood","title_page":"Colin Farrell shows off slicked back hair in West Hollywood | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has long been renowned for being slick with the ladies.\nAnd perhaps this inspired ageing lothario Colin Farrell to gel back his hair before taking a mystery woman out for lunch in West Hollywood on Wednesday\nThe adventurous former Ballykissangel star looked like he could hardly wait to spirit off his companion following their intimate meal in the trendy area of Los Angeles County.\nHe's done it again: Colin Farrell was spotted holding hands with a mystery woman after a lunch date in West Hollywood on Wednesday\nThe 39-year-old former line dancing instructor was looking as cool as they come in a white T-shirt, tight black jeans and cowboy boots.\nBut while his hair looked like it had been dipped back in grease, the stylish star went for a more messy look than the traditional 'do.\nOn a previous appearance on the Ellen DeGeneres Show the Irish favourite, perhaps slightly unconvincingly, begged for tips on how to bag himself a girlfriend.\nThe True Detective actor told the daytime chat show doyen: 'Straight up, you are literally the closest thing I have to a girlfriend.\n'I don't have a type. A human being, you know? I suppose kindness is kind of nice and sexy.'\nSlick: The ageing lothario's hair was as sleek as his moves during his romantic outing\nNo wonder the ladies love him: The hunky former line dancing instructor was looking as cool as they come\nFallen under his spell? If so she is in good company with the likes of Angelina Jolie and Britney Spears\nColin was once one of Hollywood's foremost wild men, but he says he now prefers to drink water after a tough yoga session than drinking copious amounts of alcohol.\nHe said: 'It's helped to stay away from cocaine and whisky. Life moves in cycles. I'm not going to say there was a particular day or time [when things changed], or even that I'm a different man.\n'I enjoy the work more, I enjoy being a dad more, I enjoy doing things that I never thought I'd enjoy. Like yoga.'\nOver the years Colin has dated many of the world's most desirable women, including Britney Spears, Angelina Jolie and Michelle Rodriguez.\nHolding on: She was faithfully clasping onto his hand as their journey continued\nDressed down: Colin looked cool and casual in his white T-shirt, jeans and boots","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420521/Colin-Farrell-shows-slicked-hair-takes-mystery-woman-lunch-West-Hollywood.html"}
