{"authors":["George Odling For Mailonline"],"date_download":"2018-10-22 23:45:19","date_modify":"2018-10-22 23:45:19","date_publish":"2016-01-28 12:59:41","description":"Colin McDonald, 42, struck during a bar brawl in Manchester which resulted in the death of innocent bystander Dominic Doyle. He has a long history of violence and has killed twice before.","filename":"data/vaneerConsumption/ColinMcDonaldvictimDominicDoylesmotherslamsBritishjusticesystem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30A9AB3200000578-0-image-a-46_1453985727339.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420822_Mother-one-killer-Colin-McDonald-s-victims-slams-British-justice-let-early-allowed-commit-manslaughter_1540251919.html","title":"Colin McDonald victim Dominic Doyle's mother slams British justice system","title_page":"Colin McDonald victim Dominic Doyle's mother slams British justice system | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Killer Colin McDonald is responsible for three deaths after repeatedly being released from prison\nA double-killer was allowed to kill again after repeatedly being released from prison.\nThe mother of a victim of career criminal Colin McDonald has condemned British 'joke justice' for repeatedly allowing the thug, who has taken three lives, back on the streets to strike again.\nMcDonald, 42, first took a life when he pushed a man into the Rochdale canal in 1997 during an attempted robbery and was found guilty of manslaughter.\nIn 2010 - while on bail for a brutal stabbing attack - he ran over and killed 38-year-old father Wayne Leary in a Kia Picanto he was driving without insurance or a licence.\nThen he was again released early after serving five years of a 10-year jail term.\nJust months later he struck again when he was involved in a bar brawl which resulted in the death of innocent bystander Dominic Doyle in June 2015.\nMr Doyle, 21, who had been on the books of Manchester United as a young boy, was killed at random after one of his friends had a minor bust up with a 15-year old boy in a pub toilet in Denton. The 15-year old and another teenager, 18, admitted murder.\nTalented footballer Dominic Doyle, 21, was once on the books at Manchester United but was killed when McDonald encouraged a teenage boy to attack others\nMCDONALD'S HISTORY OF VIOLENCE 1997: McDonald jailed for manslaughter after following a stranger and pushing him into the canal in Manchester city centre. 2001: Released shortly after serving less than half of his 10-year sentence, he is convicted of GBH after breaking a man's jaw with a brick outside a pub. 2005: In the dock again for a fight outside a pub. 2010: He stabs a man 11 times in a brutal attack and is released on bail. He was later given 10 years for the offence. April 2010: Weeks after the stabbing he knocked down and killed Wayne Leary in Oldham Road, Failsworth. He fled the scene and handed himself in 36 hours later. He had no insurance and no licence and pleaded guilty to death by careless driving. He was jailed for 18 months. 2015: McDonald is back on the streets early in the year after serving half his sentence June 2015: McDonald encourages teenage boy to attack Dominic Doyle. January 2016: McDonald is convicted after a trial of manslaughter of Dominic Doyle.\nMcDonald, who was accused of encouraging the boy to attack others, was charged with murder but was found guilty of manslaughter at Manchester Crown Court.\nAs McDonald today (Thursday) faced a life sentence, Mr Leary's mother, said: 'It's appalling that this man was allowed to kill and kill again because of the joke justice system that operates in this country.'\nHer son died the day after McDonald struck him with a Kia Picanto while he was crossing the road to meet his daughter.\nMrs Leary added: 'People say a leopard never changes its spots and that is exactly the case with Colin McDonald. He should never have been let out of jail in the first place after the first killing, let alone after he left my son to die like he did. I just feel sorry for the family of his latest victim.\n'I am a religious person and I do believe in giving people another chance but I will never forgive that man and I will never forget what he did. I just hope the judge locks him away for good this time. I am sick of soft justice in this country letting people out just to commit similar crimes over and over again.'\nMrs Leary, a 62-year-old retired pub landlady, added: 'I don't think that the public is protected enough from people like McDonald. McDonald is a career criminal, a violent criminal. He is 42. It's not as if he is a young kid.\nDominic Doyle was stabbed in an attack led by McDonald outside a pub in Greater Manchester\nMourners lay flowers at the spot where Dominic Doyle was stabbed to death by two teenagers encouraged to attack others by 42-year-old McDonald\nMrs Leary, a 62-year-old retired pub landlady, said: 'I am a religious person and I do believe in giving people another chance but I will never forgive that man and I will never forget what he did. I just hope the judge locks him away for good this time. I am sick of soft justice in this country letting people out just to commit similar crimes over and over again.'\nShe added: 'I don't think that the public is protected enough from people like McDonald. McDonald is a career criminal, a violent criminal. He is 42. It's not as if he is a young kid.\nWayne Leary, 38, was left to die in front of his ten year old daughter in a callous hit and run smash after career criminal McDonald was given bail following a vicious stabbing\nWayne Leary was crossing a road to meet his daughter Aimee when he was mown down by McDonald in a Kia Picanto\n'He should not even have been out to get behind the wheel to kill my son, or be out to get involved in a fight outside a pub in Dominic's death. My concern is that he will only serve another four or five years and then could kill someone else.\n'He likes to think of himself as some kind of hard man - if that's right who knows if those young lads would actually have carried out the attack on Dominic if he wasn't there. He has had enough second chances. The judge has to make sure that he goes away for a very long time. Lock the door and throw away the key. He will get his comeuppance when he meets his maker.'\nMrs Leary, who is married to husband Tom, 71, said that her grandaughter Aimee is a credit to her father.\nShe added: 'Wayne was a footballer and Aimee has followed in his footsteps. She plays for Bury Ladies and is doing really well. She wants to train to be a paramedic in tribute to the people who did so much to try to save her dad's life.'","url":"https://www.dailymail.co.uk/news/article-3420822/Mother-one-killer-Colin-McDonald-s-victims-slams-British-justice-let-early-allowed-commit-manslaughter.html"}
