{"authors":[],"date_download":"2018-10-22 21:19:27","date_modify":"2018-10-22 21:19:27","date_publish":"2014-05-06 18:33:28","description":"Somehow, an unsuspecting civilian received parts of a NOAA drone delivered by UPS.","filename":"data/vaneerConsumption/CollateralPackageUPSMistakenlyDeliversGovernmentDronetoRedditor.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/424031/140506-noaa-puma-drone-1348_b84e217d0a4b1c8b56a15687d3b93f44.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_collateral-package-ups-mistakenly-delivers-government-drone-redditor-n98446_1540243167.html","title":"Collateral Package: UPS Mistakenly Delivers Government Drone to Redditor","title_page":"Collateral Package: UPS Mistakenly Delivers Government Drone to Redditor","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUPS has \"reacquired\" parts of a government drone that it mistakenly delivered to an unsuspecting Reddit user, the company confirmed to NBC News on Tuesday.\n\"We're still investigating what happened, but it's true that we had a misdelivery,\" UPS spokeswoman Susan Rosenberg told NBC News. \"We've already reacquired the package and will get it to the intended recipient.\"\nThe package contains parts of a \"Puma\" drone owned and shipped by the National Oceanic and Atmospheric Administration, the agency confirmed -- but it's unclear how the box ended up in a random civilian's hands.\nThe strange tale began Monday, when bewildered Reddit user Seventy_Seven posted a series of photos and asked: \"Did I just get a drone in the mail?\"\nSeventy_Seven received the weightlifting bench he ordered ... but UPS also delivered a second \"odd box\" that contained wings and a control panel, along with a card marking the contents as \"USA FEDERAL PROPERTY\" that should be returned to NOAA.\nNOAA spokesman David Miller confirmed Tuesday that it's one of eight boxes of Puma drone parts that the agency shipped to a Masschusetts research facility. The Puma is \"essentially a 'flying camera,' designed for aerial observation,\" he added.\n\"It seems UPS delivered one of the eight boxes to the wrong address,\" Miller said.\nRosenberg said UPS is still looking into what, exactly, went wrong. \"We deliver nearly 17 million packages every day, and sometimes a mistake can be made,\" she said.\nSeventy_Seven said in his Reddit post that he contacted UPS, but a representative insisted the box belonged to him.\nAfter Seventy_Seven's post went viral, he wrote about his increasing concern as fellow Reddit users wondered aloud about whether he could land in trouble. Finally, he said, he heard from higher-ups at both UPS and NOAA.\nSeventy_Seven didn't reply to a request for comment, but he seems relieved to be getting rid of his ill-gotten drone after enduring a day of ribbing from Redditors joking that he'd wind up dead.\nHe replied: \"All of this info is making it really tempting to keep it.\"","url":"https://www.nbcnews.com/tech/innovation/collateral-package-ups-mistakenly-delivers-government-drone-redditor-n98446"}
