{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 22:11:47","date_modify":"2018-10-30 22:11:47","date_publish":"2016-07-22 19:28:27","description":"Colby College's bias incident report logs were published to the Internet, revealing dozens of reports about micro-aggressions and safe space violations.","filename":"data/vaneerConsumption/CollegesBiasIncidentReportLogsLeakedPhraseOntheOtherHandReportedforAbleism.json","image_url":"https://media.breitbart.com/media/2016/05/10584676434_c9fee88d9a_k.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_07_22__1540937507.html","title":"College's Bias Incident Report Logs Leaked; Phrase 'On the Other Hand' Reported for 'Ableism'","title_page":"College's Bias Incident Report Logs Leaked; Phrase 'On the Other Hand' Reported for 'Ableism' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In an unfortunate turn of events for a small liberal arts college in Maine, Colby College’s bias incident report logs were published to the Internet, revealing dozens of reports about the campus’s gravest micro-aggressions and safe space violations.\nSo check out what made it onto the \"bias incident log\" at Colby College… https://t.co/77HdtDOrPq pic.twitter.com/wbjihH0Nb2 — Samantha Harris (@SamatFIRE) June 21, 2016\nColby College in Waterville, Maine, vaguely defines harassment as “unwelcome hostile or intimidating remarks, spoken or written.” Like most institutions of higher education, they provide their students with a bias incident report system to prevent harassment on the basis of one’s identity. Due to a technical mistake by Colby’s web administrators, the entirety of the system’s log was published to the college’s website.\nThe log, which has been archived and can be viewed here, contains various complaints, many of which detail seemingly benign incidents. Perhaps most significantly, the log reveals that a Colby student was reported for engaging in “ableism,” or the discrimination of individuals with physical disabilities or deformities, when he or she uttered the phrase “on the other hand.”\nSo check out what made it onto the \"bias incident log\" at Colby College… https://t.co/77HdtDOrPq pic.twitter.com/wbjihH0Nb2 — Samantha Harris (@SamatFIRE) June 21, 2016\nThe report provides no other details on the incident other than that it occurred in Colby’s Pugh Center, which is a “dynamic space” where students come together to participate in clubs/organizations, attend programs on diversity, and use the school’s support services. It is also unclear if Colby administrators had identified a perpetrator or wished to seek disciplinary measures to ensure that this type of harassment can be prevented in the future.\nThe free speech and student rights organization, Foundation for Individual Rights in Education (FIRE), has named Colby the recipient of their Speech Code of the Month award for cultivating a campus environment where the misinterpretation of someone’s words can result in even the most innocent of students being reported.\nOther incidents highlighted by the Foundation for Individual Rights in Education include:\n“Swastika carved into a pumpkin. *Report canceled, not a swastika.”\n“At a Halloween party, a student reported seeing three students wearing a sombrero, poncho, and mustache as costumes.”\n“A person reported that during the Colby v. Bowdoin men’s basketball game, a person screamed statements about women and the WNBA to degrade the referee.”\n“A person reported that two members of the basketball team dressed up as Hasidic Jews to celebrate their ninth Annual Mustachio Basho.”\nTom Ciccotta is a classical liberal who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta. You can email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/07/22/colleges-bias-incident-report-log-leaks/"}
