{"authors":["Associated Press"],"date_download":"2018-10-23 03:43:22","date_modify":"2018-10-23 03:43:22","date_publish":"2017-03-16 14:49:18","description":"BOGOTA, Colombia (AP) - Colombian Vice President German Vargas Lleras has offered his resignation amid speculation he'll seek the country's top office in...","filename":"data/vaneerConsumption/Colombiavicepresidentquitsamidtalkofpresidentialrun.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-229011-1489675767-957_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320576_Colombia-vice-president-quits-amid-talk-presidential-run_1540266202.html","title":"Colombia vice president quits amid talk of presidential run","title_page":"Colombia vice president quits amid talk of presidential run | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BOGOTA, Colombia (AP) - Colombian Vice President German Vargas Lleras has offered his resignation amid speculation he'll seek the country's top office in next year's election.\nVargas Lleras delivered a letter to Congress Wednesday night asking lawmakers to relieve him of his duties. A vote is expected next week. Sitting officials must resign by May in order to be eligible to run in the May 2018 election.\nPolls show the famously hot-tempered politician is one of the front-runners to succeed President Juan Manuel Santos after having overseen the biggest infrastructure buildout in decades.\nColombia's Vice President German Vargas LLeras holds a hard hat that says in Spanish \"100,000 homes\" as he delivers his annual report to President Juan Manuel Santos during a ceremony in Bogota, Colombia, Tuesday, March 14, 2017. (AP Photo/Fernando Vergara)\nBut he's mistrusted by many of Santos' supporters and being courted by some right-wing opponents because of his lukewarm support for a peace deal with leftist rebels.\nSantos has already tapped former police chief Oscar Naranjo to replace Vargas Lleras.","url":"https://www.dailymail.co.uk/wires/ap/article-4320576/Colombia-vice-president-quits-amid-talk-presidential-run.html"}
