{"authors":[],"date_download":"2018-10-22 22:35:01","date_modify":"2018-10-22 22:35:01","date_publish":"2014-05-11 21:08:35","description":"A powerful spring storm dropped more than a foot of sloppy, wet snow in parts of Colorado and Wyoming on Mother's Day.","filename":"data/vaneerConsumption/ColoradoWyomingSlammedbySpringSnowstorm.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/435101/140511-snow-colo-jms-1707_cafd744a9798f9073940c5211d89ca4d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_colorado-wyoming-slammed-spring-snowstorm-n102626_1540247701.html","title":"Colorado, Wyoming Slammed by Spring Snowstorm","title_page":" Colorado, Wyoming Slammed by Spring Snowstorm","title_rss":"NULL","source_domain":"nbcnews.com","text":"In Colorado, Department of Transportation officials said plunging temperatures and heavy, wet snow created icy road conditions, and multiple accidents were reported on several highways.\nSouthwest of Denver, a seven-car pileup Sunday evening injured a sheriff's deputy on U.S. 285 near the community of Doubleheader, The Denver Post reported. Three others were hurt, but their injuries didn't appear to be life-threatening.\nWeather was likely a factor in the crash, but its cause was still being investigated, sheriff's spokeswoman Jacki Kelley told the newspaper.\n\"The roads are just really bad out there,\" she said.\nSnow amounts could vary greatly as temperatures continue to drop later Sunday. But up to 15 inches could fall at higher elevations and 4 to 9 inches could fall at lower elevations, including Denver and other cities along Colorado's Front Range.\n\"May snow certainly isn't unheard of here in Colorado, even down in the Denver metro area,\" said David Barjenbruch, another weather service meteorologist in Boulder. \"If we see the total accumulations that we are anticipating from this storm, we are certainly going to see a top 10 May snow event for the Denver metro area.\"\nBarjenbruch said a foot of snow had already fallen in the foothills of Larimer County northwest of Denver by Sunday morning, and workers along much of the Front Range can expect a \"slushy, sloppy morning commute\" Monday.\nThe weather service also warned that snow could be heavy and wet enough to snap tree limbs and power lines, causing power failures. Winds gusting up to 30 mph could reduce visibility, and slushy roads could be treacherous to drive.\nJulie Smith, a spokeswoman for Denver International Airport, said crews have treated runways in anticipation of dropping temperatures Sunday night.\n\"At this point we are seeing some delays with our airlines while they are getting their deicing operations up and running, and we do expect the airlines to be fully deicing in the morning,\" she said.\nMeanwhile, Denver officials plan to deploy up to 70 snowplows overnight to prepare for Monday's commute.\nIn southern Wyoming, the storm forced transportation officials to close a 150-mile stretch of Interstate 80 from Cheyenne to Rawlins on Sunday.\nThe weather service said mountainous areas in south-central Wyoming got up to 2 feet of snow, and the metro areas of Cheyenne and Laramie averaged 6 to 10 inches. Rob Cox, a weather service meteorologist in Cheyenne, said he expects more accumulation overnight, likely an additional 2 to 4 inches in some locations.\n\"There will be a lot of water after all this is said and done,\" he said, adding that there could be some localized flooding.\nIn the West, high winds at the bottom of the storm sent dust blowing across Arizona and New Mexico, and the Los Angeles area had been under \"red flag\" fire warnings, with authorities saying blazes could quickly spread out of control under low humidity, gusty winds and dry conditions.\nThe storm is the result of a low-pressure system moving east colliding with a cold air mass from the north. Spring-like weather was expected to return to the Rockies by Tuesday.\n- Associated Press","url":"https://www.nbcnews.com/news/weather/colorado-wyoming-slammed-spring-snowstorm-n102626"}
