{"authors":["Frances Martel"],"date_download":"2018-10-30 19:25:35","date_modify":"2018-10-30 19:25:35","date_publish":"2016-02-19 05:00:51","description":"A former Colombian drug lord has accused a Venezuelan government official of leading a drug cartel that has sold cocaine to the Islamic State and al-Qaeda.","filename":"data/vaneerConsumption/ColombianDrugLordVenezuelasFormer2SoldCocainetoIslamicState.json","image_url":"https://media.breitbart.com/media/2016/02/Diosdado-Cabello-Venezuela-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_18__1540927535.html","title":"Colombian Drug Lord: Venezuela's Former #2 Sold Cocaine to Islamic State","title_page":"Colombian Drug Lord: Venezuela's Former #2 Sold Cocaine to Islamic State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A former Colombian drug lord who has been freed after serving an 18-year sentence in the U.S. prison system has accused Diosdado Cabello, a senior official in Venezuela’s socialist government, of leading a drug cartel that has sold cocaine to the Islamic State and al-Qaeda.\nJavier Cardona Ramírez ran a Colombian drug cartel in the 1980s that distributed cocaine to much of the U.S. eastern seaboard and served his term in Brooklyn. Through connections still in jail or the drug trade, Cardona Ramírez insists that Venezuela’s Cartel de los Soles has almost complete control of the cocaine trade in the region, and that it is headed by Cabello. Cabello, he said in an interview this week, “is Venezuela’s biggest drug trafficker” and comparable to Mexico’s Joaquín “El Chapo” Guzmán. He claims he personally bought 700 kilos of cocaine from the Cartel de los Soles while still smuggling drugs into the United States.\nThe Cartel de los Soles sells cocaine to Africa, according to Cardona Ramírez. “It is stocked and cared for [in Africa] by Al Qaeda and the diabolical terrorist group ISIS,” he claims, “who stock tons of cocaine.”\nIn addition to Cabello, Cardona claims his brother, José David Cabello, and Venezuelan Colonel Hugo Carvajal run the Cartel de los Soles. “These individuals are moving between 40 and 50 tons of cocaine a month, using the Venezuelan National Guard,” Cardona said, stating that they buy the product from the Revolutionary Armed Forces of Colombia (FARC), the world’s third wealthiest terrorist organization, after the Islamic State and Hamas.\nCardona was careful not to implicate Venezuelan President Nicolás Mauro, whom he called “a great fool” who should know of Cabello’s activities but who maintains a distance from the drug operation being run through his government.\nDiosdado Cabello served as the head of Venezuela’s National Assembly for years under Maduro, losing his position in December 2015 following a historic election where the anti-socialist opposition won the majority in the legislature. While president of the legislature, Cabello served as the nation’s second-in-command, ready to succeed Maduro should any tragedy befall him.\nCardona has been out of prison for more than a year and claims to have become an evangelical Christian. He is the author of a book, The Narco Rescued from Hell, and dedicates himself to giving talks at churches and youth groups urging young people to stay away from the drug trade. He lives in Miami.\nHe is not the first to accuse Cabello of running the Cartel de los Soles, one of the largest drug smuggling organizations in the Americas. Former Assistant Secretary of State for Western Hemisphere Affairs under George W. Bush, Roger Noriega, accused Cabello of using money from the Cartel de los Soles to fund Maduro’s re-election campaign in 2014. Again, Noriega claimed Maduro was willfully ignorant of these activities and had no major role in drug trafficking.\nLeamsy Salazar, a former bodyguard to late dictator Hugo Chávez, accused Cabello of running the Cartel de los Soles upon defecting to the United States last year. Francisco Flores de Freitas and Efrain Antonio Campo Flores, President Maduro’s nephews, claimed they were attempting to sell 800 kilograms of cocaine in Haiti on Cabello’s behalf upon being arrested last year. They later claimed the drugs belonged to former Minister of the Interior Tarek El Aissami.\nCardona’s accusation is the first that links the Venezuelan government to Sunni radical Islamism. Maduro’s government has well-documented ties to Alawite Shiite Bashar al-Assad in Syria and enjoys warm relations with the terror state of Iran. Multiple sources have accused the Venezuelan government of aiding Hezbollah. A former diplomat at the Venezuelan embassy in Baghdad claimed he was forced to forge Venezuelan documents in the names of Hezbollah operatives, allowing them to travel freely in the West. Another report claimed the Cuban government was manufacturing Venezuelan passports for the use of non-Venezuelan citizens tied to Hezbollah. Spanish reporter Emili J. Blasco claimed in his book, Boomerang Chávez, that Maduro met with senior Hezbollah leader Hassan Nasrallah and agreed to issue hundreds of passports to Hezbollah operatives in 2007.\nThe Islamic State has been documented to use drugs liberally to keep its young jihadis in battle. A report this week claimed Islamic State leaders regularly used a banned substance called fenethylline, or Captagon, to help terrorists with sleep deprivation and depression in Mosul, Iraq. “ISIS is using special tablets, the fighters take the drug and they don’t know where they are or what they are doing. They are just shooting and fighting,” one report claimed.\nLast year, captured Islamic State terrorists admitted to using Xanax in battle, which would make them think “tanks are birds that you could annihilate with your sword.” Law enforcement have also found cocaine in the homes of captured or killed Islamic State leaders.","url":"https://www.breitbart.com/national-security/2016/02/18/venezuelas-former-national-assembly-head-did-business-with-hezbollah/"}
