{"authors":["Associated Press"],"date_download":"2018-10-23 05:11:51","date_modify":"2018-10-23 05:11:51","date_publish":"2017-03-10 15:14:12","description":"BOGOTA, Colombia (AP) - Pope Francis will visit Colombia in September as part of a trip to celebrate the South American nation's steps toward ending five...","filename":"data/vaneerConsumption/ColombianchurchofficialsPopeFrancistovisitinSept.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196791-1489161255-240_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301604_Colombian-church-officials-Pope-Francis-visit-Sept_1540271511.html","title":"Colombian church officials: Pope Francis to visit in Sept.","title_page":"Colombian church officials: Pope Francis to visit in Sept. | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BOGOTA, Colombia (AP) - Pope Francis will visit Colombia in September as part of a trip to celebrate the South American nation's steps toward ending five decades of armed conflict.\nIt will be the first papal visit to the staunchly Roman Catholic country in 31 years.\nVatican envoy Ettore Balestrero made the announcement in Bogota on Friday alongside President Juan Manuel Santos. The trip was simultaneously announced by the Vatican in a brief statement.\nPope Francis sits on a bus with members of the Roman on their way back to the Vatican at the end of a week long spiritual retreat at the village of Ariccia, near Rome, Friday, March 10, 2017. (L'Osservatore Romano/Pool Photo via AP)\nThe first Latin American pope will arrive in Bogota on Sept. 6 and visit three other cities - Medellin, Cartagena and Villavicencio - before returning to Rome on Sept. 11.\nHis visit to Medellin will come nearly 50 years after the landmark 1968 meeting by Latin American clergy in the city, where bishops endorsed liberation theology.\nThe length and itinerary of the trip as announced marks something of a departure for Francis. Usually when travelling such a long distance, the pope would add on a second country in the region, and limit the time in each country to two to three days.\n\"It's rare for the Pope to visit a single country and stay there for four days,\" Balestrero said. \"That shows the importance Francis attributes to this trip and ultimately Colombia.\"\nAuthorities have been talking about Francis' intention to travel to Colombia for two years but the trip had been delayed as a peace process with the Revolutionary Armed Forces of Colombia dragged on and the Vatican took care to avoid taking sides in the heated political debate that ensued.\nWith the deal reached last November, and attention turning to the difficult implementation of the accord, Santos said he hoped Francis' visit would help spur reconciliation among deeply divided Colombians.\n\"Pope Francis is a builder of bridges, not walls,\" said Santos, winner of last year's Nobel Peace Prize. \"The visit will help Colombians come together as a fairer, more compassionate, more equal country, one that is in peace. The Holy Father is coming to support Colombians in the building of peace.\"\nFrancis' would be the third papal visit to Colombia after a trip by Pope Paul VI in 1968 and a 10-city marathon by Pope John Paul II in 1986.\n___\nAP Writer Nicole Winfield contributed to this report from Rome.","url":"https://www.dailymail.co.uk/wires/ap/article-4301604/Colombian-church-officials-Pope-Francis-visit-Sept.html"}
