{"authors":["Associated Press"],"date_download":"2018-10-23 02:27:06","date_modify":"2018-10-23 02:27:06","date_publish":"2016-01-29 17:01:06","description":"Elmer Melchi, who had cancer, died in a hospice care center in Pueblo, Colorado on Thursday - a week after his wife June Melchi, who has dementia, was brought to visit him there in his final days.","filename":"data/vaneerConsumption/ColoradoWWIIparatrooperdiesafterbriefreunionwithwife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B52ADF00000578-0-image-a-4_1454099213817.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423145_Colorado-WWII-paratrooper-dies-brief-reunion-wife_1540261626.html","title":"Colorado WWII paratrooper dies after brief reunion with wife","title_page":"Colorado WWII paratrooper dies after brief reunion with wife | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A World War II paratrooper from Colorado who was initially denied permission to move into the same nursing home as his wife has passed away after their brief reunion.\nElmer Melchi, who had cancer, died in a hospice care center in Pueblo on Thursday - a week after his wife June Melchi, who has dementia, was brought to visit him there.\nThe veteran, who jumped into Normandy on D-Day and later was captured by the Germans in the Netherlands, passed away in his sleep at age 92, The Pueblo Chieftain reported.\nElmer Melchi, who had cancer, died in a hospice care center in Pueblo on Thursday - a week after his wife June Melchi, who has dementia, was brought to visit him there (pictured during the reunion)\nDuring their last time together last week, the couple sang songs, held hands and kissed\nElmer Melchi (pictured), a World War II paratrooper from Colorado, who was initially denied permission to move into the same nursing home as his wife has passed away after their brief reunion just last week\n'My dad went for his last jump,' one of Melchi's three sons, Gary, an Army veteran told the newspaper. 'He told me today, \"I'm going.\"'\nAfter his health worsened on New Year's Eve, the Veterans Administration denied the family's request to allow him to spend his final days with his wife who was at University Park Care Center because it was not a VA-sanctioned facility.\nAt the time, an anonymous donor had offered to pay for 10 days of care for Elmer Melchi at the nursing home after learning of the couple's plight.\nHowever, the VA later gave permission, but Garry Melchi said his father's health never improved enough to allow him to move, The Pueblo Chieftain reported.\nInstead, the couple was reunited when June Melchi was taken to Sangre de Cristo Hospice for the sweet reunion last Wednesday.\nWhile his wife no longer remembered her husband's name, she was happy to be with him as they sang, held hands and kissed during what became their last time together, according to the newspaper.\nThe couple met in England and married in 1945.\nThe couple met in England and married in 1945. Garry Melchi, one of three sons, said his father was captured during Operation Market Garden, shot while trying to escape a POW camp and finally freed after the Russians liberated the camp\nThe veteran, who jumped into Normandy on D-Day and later was captured by the Germans in the Netherlands, passed away in his sleep at age 92 at Sangre de Cristo Hospice (pictured)\nGarry Melchi previously said his father was captured during Operation Market Garden, shot while trying to escape a POW camp and finally freed after the Russians liberated the camp.\nHe said his father walked across Germany and France and got on a boat to go to England, where the future June Melchi thought he was dead.\n'He only had one thing on his mind - get to my mom,' Garry Melchi said.\nHe said his father drove to the nursing home to see his 89-year-old mother four times a week until his health worsened on New Year's Eve.","url":"https://www.dailymail.co.uk/news/article-3423145/Colorado-WWII-paratrooper-dies-brief-reunion-wife.html"}
