{"authors":["Elizabeth Ballou"],"date_download":"2018-10-31 00:11:01","date_modify":"2018-10-31 00:11:01","date_publish":"2014-08-12 20:21:14","description":"Colorado has landed in the news again, and this time, it has nothing to do with that little green plant everyone's always talking about. The Colorado teen birth rate has dropped 40 percent since 2009. If you think that such results are due to…","filename":"data/vaneerConsumption/ColoradosTeenBirthRateDropped40AndItsProbablyBecauseOfJustOneThing.json","image_url":"https://imgix.bustle.com/uploads/image/2018/7/8/c6588cc2-0055-48b6-bce9-c45c47f06a44-birthcontrol_lizminch1.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35495-colorados-teen-birth-rate-dropped-40-and-its-probably-because-of-just-one-thing_1540944661.html","title":"Colorado's Teen Birth Rate Dropped 40%, And It's Probably Because Of Just One Thing","title_page":"Colorado's Teen Birth Rate Dropped 40%, And It's Probably Because Of Just One Thing","title_rss":"NULL","source_domain":"bustle.com","text":"Colorado has landed in the news again, and this time, it has nothing to do with that little green plant everyone's always talking about. The Colorado teen birth rate has dropped 40 percent since 2009. If you think that such results are due to drastic social changes, think again: it's probably due largely to a single program. In 2009, Colorado began providing IUDs to low-income teenage women for little to no cost. Five years later, the program is a resounding success.\nIUDs, or intrauterine devices, are small, T-shaped pieces of plastic inserted into the uterus in order to prevent pregnancy. Once they're inserted, that's usually it: they function on their own for the next several years, making them easier to keep up with than condoms or the pill. One of the major downsides is the cost: they can run you up to several thousands of dollars. Once that concern is taken away, though, an IUD becomes a pretty attractive choice. In case you're curious (not having had an IUD, I know I was), here's an animation of an IUD insertion:\nARHPorg on YouTube\nThe Colorado IUD program became possible through an anonymous donation of $23 million. Sixty-eight family-planning clinics throughout the state began to offer IUD insertion, quadrupling the number of IUD procedures performed and decreasing the abortion rate by 35 percent. For every dollar the state spent on the program, it saved $5.68 in Medicaid costs, for a total of $42.5 million. That makes the scenario a win-win: the teen birth rate dropped substantially without the state having to contribute a fortune.\nHowever, several conservative organizations are saying that the state's teen birth rate drop has nothing to do with the program. \"What we have seen over many years is that access to contraception does not equal fewer unintended pregnancies and fewer abortions,\" said Carrie Gordon Earll, the senior director of public policy for Focus on the Family. \"Availability of contraception leads to increased sexual activity, which leads to unintended pregnancies and abortions.\" While no study should be seen as scientific law, the majority of studies on the link between birth control availability and abortion rates make it clear that access to birth control lowers pregnancy and abortion rates. (Here's a major study by the Washington University in St. Louis, for example.)\nBob Enyart, a spokesman for Colorado Right to Life, said that the IUD program is a disastrous idea. “When you teach children that they’re animals — that they have evolved from pigs and dogs and apes — then they act like animals,” Enyart said. \"We are made in God's image, and God's likeness, and for 13-, 14-, 15-year-old girls to be having sex is destructive for them.\"\nNot to bust this guy's bubble, but we, er, actually did evolve from apes.\nFortunately, actual success stories from the program prove that it's made not only a statistical change, but a personal one as well. According to Greta Klinger, the program's director, some young women have used these IUDs to stop generational cycles of teen pregnancy:\n\"We had a young woman come into one of our clinics — she was 17. Her mom and all of her sisters had been pregnant as teens and she didn't want that to happen, so she came in and got an IUD fitted straight away. She came back three years later. She had been the first in her family not only to graduate high school but was now enrolled in college. She said this had been a life-changer for her.\"\nTo me, this seems to send a strong message: Such initiatives not only decrease teen birth and abortion rates, but they save states money that can be used on, say, sex education before puberty hits. And not every state has such generous donors, but perhaps others can try scaled-down versions of Colorado's program in the near future.\nImages: wifflegif","url":"https://www.bustle.com/articles/35495-colorados-teen-birth-rate-dropped-40-and-its-probably-because-of-just-one-thing"}
