{"authors":[],"date_download":"2018-10-22 21:34:21","date_modify":"2018-10-22 21:34:21","date_publish":"2016-12-01 00:00:00","description":"Authorities also released audio of the conversation between the pilot and the airport's communications tower during the doomed plane's final moments on Monday. Only six of 77 people aboard survived.","filename":"data/vaneerConsumption/ColombiaPlaneRanOutOfFuelBeforeItCrashedNearMedellin.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=503955018_1540244061.html","title":"Colombia Plane Ran Out Of Fuel Before It Crashed Near Medellin","title_page":"Colombia Plane Ran Out Of Fuel Before It Crashed Near Medellin : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nColombian authorities say a plane ran out of fuel before it crashed on Monday. It went down near the Colombian city of Medellin, killing nearly all the members of a Brazilian soccer team. Colombian media have released dramatic audio between air traffic controllers and the plane's pilot. Reporter John Otis has more.\nJOHN OTIS, BYLINE: The audio is of the Bolivian pilot of the charter aircraft, Miguel Quiroga, and an air traffic controller at the Medellin airport.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED AIR TRAFFIC CONTROLLER #1: (Speaking Spanish).\nOTIS: In this exchange, Quiroga requests permission to land. But the controller says another plane is about to make an emergency landing and that the runway will not be ready. She asks Quiroga, how long can he remain in a holding pattern?\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED AIR TRAFFIC CONTROLLER #1: (Speaking Spanish).\nOTIS: Quiroga replies, \"We have a fuel emergency, miss. That's why I'm asking for an immediate landing.\" After that, the controller spends a few minutes waving off approaching planes to make room for Quiroga. But by then, Quiroga reports that his aircraft has run out of fuel and has suffered a total electrical failure.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED AIR TRAFFIC CONTROLLER #1: (Speaking Spanish).\nOTIS: Then the plane disappears from radar and the controller tries to contact Quiroga.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED AIR TRAFFIC CONTROLLER #1: (Speaking Spanish).\nUNIDENTIFIED AIR TRAFFIC CONTROLLER #2: (Speaking Spanish).\nOTIS: \"He's not answering,\" says another controller. Then, silence.\nAt about the same time, the plane smashed into a mountain ridge 8 miles south of the airport. Quiroga, who was 53 and the father of three, died in the crash, as did 70 passengers and crew members. Only six people survived, including three members of Brazil's Chapecoense team.\nThe plane's two so-called black boxes have been recovered, but there's been no official confirmation of what caused the crash. The aircraft, a British Aerospace 146 regional jet, usually flies much shorter hops than Monday's 4-hour flight from the Bolivian city of Santa Cruz. Experts say another clue that the plane ran out of fuel was the lack of an explosion when the plane went down.\nFor NPR News, I'm John Otis in Bogota, Colombia.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=503955018"}
ion process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/12/01/503955018/colombia-plane-ran-out-of-fuel-before-it-crashed-near-medellin"}
