{"authors":[],"date_download":"2018-10-30 01:06:51","date_modify":"2018-10-30 01:06:51","date_publish":"2014-11-21 00:00:00","description":null,"filename":"data/vaneerConsumption/ColoradoSexScandalContinues.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_11_colorado_sex_scandal_continues_1540861611.html","title":"Colorado 'Sex Scandal' Continues","title_page":"Colorado 'Sex Scandal' Continues","title_rss":"NULL","source_domain":"americanthinker.com","text":"Colorado 'Sex Scandal' Continues\nTwo stories this author covered in earlier pieces seem to have merged into one story: the Obama administration’s decision to send out a threatening letter demanding that colleges treat sexual assault as a form of gender-based discrimination, and the Colorado “sex” scandal. I contended ar the time that only the police are capable of properly investigating sexual assault, and only the criminal courts are capable of adjudicating such matters. I stand by this position. I also expressed skepticism as to the merits of the CU-Boulder “sex” scandal. Supposedly, the culture of the CU-Boulder philosophy department resembles the Miami Dolphins locker room, yet specific allegations remain sparse. Given the facts, skepticism remains justified.\nSince March, CU-Boulder agreed to settle a lawsuit filed by a female philosophy grad student, and they also fired philosophy professor David Barnett for “retaliation.” An unnamed female grad student accused an unnamed male grad student of sexual assault, resulting in a police investigation but no arrests or charges. While the accused student did not face criminal charges, the school found him guilty of violating the campus sexual assault policy. Professor David Barnett objected. In Barnett’s view, the investigators had distorted the evidence in order to arrive at a finding of guilt. He submitted a thirty-eight-page report detailing the discrepancies between what the witnesses saw and what appeared in the investigator’s official findings. In response, the accuser sued the school for retaliation; the school responded by settling her lawsuit for 825,000 dollars and suspending Barnett with the intention of eventually terminating him. Barnett responded by filing a lawsuit of his own, alleging that Chancellor Phil Di Stefano had defamed him. It also deserves to be pointed out that the female grad student did not come forward with this allegation until years later, at which point the alleged perpetrator had become a philosophy instructor at CU-Boulder. Further, if what Barnett alleges in his lawsuit is true, he had ample reason to be suspicious of both the investigators and the investigation. One cannot assess the merits of the allegations against the former male grad student because the relevant files are confidential, but the idea that questioning the findings or methodology of an investigation constitutes retaliation seems absurd. CU-Boulder has essentially declared not only that the accused does not enjoy the presumption of innocence, but that defending the accused's innocence amounts to sexual harassment. How exactly the accused can receive a fair hearing in such an environment remains a mystery. At this point it should be pointed out that false rape claims are far more prevalent than people think. Feminists like to claim that only a negligible number of rape allegations are false (2-8%), but the number of allegations recanted, along with the number of allegations not resulting in charges, indicates a much larger portion. Whatever problems exist within the legal system, this case illustrates why schools have no business adjudicating sexual assault claims. Had this case been tried in a court of law, we would be able to assess the charges in light of the evidence. In the present situation, we have no idea what was alleged, what evidence was presented, or the exact nature of the statute. Even if the proceedings were fair (which they likely were not), the findings could never acquire any legitimacy. The effort to adjudicate sexual assault allegations in makeshift tribunals will not end happily.","url":"https://www.americanthinker.com/blog/2014/11/colorado_sex_scandal_continues.html"}
