{"authors":[],"date_download":"2018-10-30 14:32:07","date_modify":"2018-10-30 14:32:07","date_publish":"2016-05-23 15:49:18","description":"The new owners of Colony Square have tapped a pair of well-known design firms to re-position the office and retail complex as a gathering hub and living room for Midtown Atlanta.","filename":"data/vaneerConsumption/ColonySquareteamunveilsnewlookforMidtowncomplex.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/23/Images/photos.medleyphoto.9873968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_colony-square-te_90eb806eecefc60339b1c37af1e8743f__1540909927.html","title":"Colony Square team unveils new look for Midtown complex","title_page":"Colony Square team unveils new look for Midtown complex","title_rss":"NULL","source_domain":"ajc.com","text":"The new owners of Colony Square have tapped a pair of well-known design firms to re-position the office and retail complex as a gathering hub and living room for Midtown Atlanta.\nOn Monday, North American Properties said it has tapped New York City architects Beyer Blinder Belle and Atlanta’s Lord Aeck Sargent to help transform the public spaces of Atlanta’s first true mixed-use development.\nThe team also announced new logos and a branding concept for Colony Square: urbane. A new rendering and video fly-through shows a new glass-heavy mall with public art and a focus on shared spaces.\nThe release said the project will take cues from well-known public square such as Plaza De Santa Ana in Madrid, and will focus on the pedestrian experience.\nIn December, developer North American Properties and equity partner Lionstone Investments closed on their purchase of the two office towers and retail mall at 14th and Peachtree streets — one of Atlanta’s busiest crossroads. Colony Square rose in the late 1960s and 1970s as a project ahead of its time, but the development has fallen behind other office development in Midtown.\n“The renewal of Colony Square represents an extraordinary opportunity to create a charismatic and welcoming public place at the heart of a growing neighborhood, on the corner of ‘Main and Main’ Atlanta,” Richard Metsky, partner at Beyer Blinder Belle, said in a news release. “The design concept supports the ongoing transformation of Midtown into a vibrant commercial, retail, residential and cultural district.”\nNorth American said the firm has conducted about 200 interviews over the past five months to see what the community wants in Colony Square. Branding firm Imbibe developed the “urbane” concept and a new logo.\nClick here or watch the video below to see a new fly-through video of the project.\nhttp://youtu.be/oIZ6oNI4k54","url":"https://www.ajc.com/news/local/colony-square-team-unveils-new-look-for-midtown-complex/mpSMw7OU7MdYwkGaDfmf7I/"}
