{"authors":["Associated Press"],"date_download":"2018-10-23 05:41:52","date_modify":"2018-10-23 05:41:52","date_publish":"2016-01-29 21:24:46","description":"BOGOTA, Colombia (AP) — Colombia and Venezuela are both reporting a jump in cases of a rare, sometimes paralyzing syndrome that may be linked to the Zika vir...","filename":"data/vaneerConsumption/ColombiaVenezuelalookforZikalinkstoGuillainBarre.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:9f1a6c66d4a547489749b33e435913a1-3bmscybNe842cce83474b5a06ad8-107_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423491_Colombia-Venezuela-look-Zika-links-Guillain-Barre_1540273312.html","title":"Colombia, Venezuela look for Zika links to Guillain-Barre","title_page":"Colombia, Venezuela look for Zika links to Guillain-Barre | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Colombia, Venezuela look for Zika links to Guillain-Barre\nBOGOTA, Colombia (AP) — Colombia and Venezuela are both reporting a jump in cases of a rare, sometimes paralyzing syndrome that may be linked to the Zika virus.\nColombian Deputy Health Minister Fernando Ruiz said Friday that his country has recorded 41 cases of Guillain-Barre syndrome that appear to be linked to Zika infections. It had detected 12 such cases a week ago.\nColombia has said it had about 16,500 suspected cases of Zika, though only a small fraction have been confirmed by laboratory tests.\nThis 2006 photo provided by the Centers for Disease Control and Prevention shows a female Aedes aegypti mosquito in the process of acquiring a blood meal from a human host. Scientists believe the species originated in Africa, but came to the Americas on slave ships. It's continued to spread through shipping and airplanes. Now it's found through much of the world. (James Gathany/Centers for Disease Control and Prevention via AP)\nThe mosquito-borne virus is spreading rapidly in the region after being detected last year in Brazil. Investigators are scrambling to determine if the surge is related to seeming increases of the rare birth defect known as microcephaly, which results in babies being born with abnormally small heads, and of Guillain-Barre, which can leave patients temporarily paralyzed.\nVenezuelan Health Minister Luisana Melo said Friday that her country has recorded 255 cases of Guillain-Barre, apparently as part of its effort to fight Zika, though she did not specify the link or the time frame.\nFormer Health Minister Jose Oletta said that figure indicates the number of suspected Zika cases in Venezuela is far more than the government's estimate of roughly 4,500. He has estimated Venezuela could have 400,000 cases.\n\"Normally, we'd expect 30 or 40 cases of Guillain-Barre a month,\" said Oletta, who now works with the Network to Defend National Epidemiology. \"What this shows is that the minister has the total number of Zika cases wrong.\"\nZika outbreaks have been reported in several Latin American and Caribbean countries, raising concerns elsewhere about travelers becoming infected.\nDr. Anthony Fauci, the head of the U.S. National Institute of Allergy and Infectious Disease, said Friday that he doesn't think U.S. airports need to screen travelers arriving from nations with Zika cases. He said the disease is spread by mosquitoes and is not transmitted from one person to another.\nSpeaking in Washington, Fauci said the U.S. government is taking the virus \"very seriously\" and preparing in case it should spread to the United States. He said Americans should not \"get overly panicked\" since there have been no transmissions of the disease in the U.S.\nAedes aegypti mosquitoes sit in a petri dish at the Fiocruz institute in Recife, Pernambuco state, Brazil, Wednesday, Jan. 27, 2016. The mosquito is a vector for the proliferation of the Zika virus currently spreading throughout Latin America. New figures from Brazil's Health Ministry show that the Zika virus outbreak has not caused as many confirmed cases of a rare brain defect as first feared. (AP Photo/Felipe Dana)","url":"https://www.dailymail.co.uk/wires/ap/article-3423491/Colombia-Venezuela-look-Zika-links-Guillain-Barre.html"}
