{"authors":[],"date_download":"2018-10-22 22:10:24","date_modify":"2018-10-22 22:10:24","date_publish":"2016-01-28 10:05:26","description":"A renowned Thai massage-parlour tycoon turned graft-busting politician was jailed Thursday for two years over the demolition of a stretch of seedy bars in Ba...","filename":"data/vaneerConsumption/ColourfulThaimassageparlourbossturnedpoliticanjailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g74y-2vdWmEltwXfba0ce28e6326f5e9b-656_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420665_Colourful-Thai-massage-parlour-boss-turned-politican-jailed_1540246224.html","title":"Colourful Thai massage-parlour boss-turned politican jailed","title_page":"Colourful Thai massage-parlour boss-turned politican jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Colourful Thai massage-parlour boss-turned politican jailed\nA renowned Thai massage-parlour tycoon turned graft-busting politician was jailed Thursday for two years over the demolition of a stretch of seedy bars in Bangkok's tourist heart more a decade ago.\nChuwit Kamolvisit was imprisoned by the Supreme Court over a conviction for trespassing, false imprisonment and criminal damage linked to the 2003 destruction of the bars on land he had recently bought.\nThe nightime demolition saw scores of heavies hired by Chuwit and his accomplices, some 40 of whom were also jailed on Thursday, destroy the bars with the help of diggers.\nFormer massage parlour tycoon Chuwit Kamolvisit has been jailed for illegally demolishing bars on land he had bought ©Pornchai Kittwongsakul (AFP/File)\nHe later established Chuwit garden on the land, a rare public green space in the city's congested heart that is also thought to be worth several million dollars.\nDelivering the ruling, a judge reduced his sentence from five years to two because he \"had paid sufficient compensation to the owners\" and built a park on the land.\nChuwit, 55, is one of Thailand's most colourful public figures known for his dapper appearance, humourous slap-downs of critics and frequent newspaper appearances wielding guns in 'come and get me' acts of defiance of his enemies.\nHe often boasts of his days as a successful \"pimp\" employing hundreds of women in Bangkok massage parlours, but now shoots-from-the-hip on television talk shows as a crusader against dodgy cops and politicians.\nA survivor of Thailand's tumble-dryer politics, Chuwit was twice elected to parliament, the first time in 2005. Many tipped him to eventually reach a high-profile office such as Bangkok governor before a 2014 coup swept away political parties.\nSpeaking before the ruling, Chuwit told reporters he was ready to face justice.\n\"I want to be a good example for politicians, and to the people, that I am not a runaway who wants to sip wine on a yacht,\" he said, before signing off with \"thank you for coming... you will miss me\".\nChuwit's jailing is a rare case of a high-profile figure facing justice in Thailand.\nCourt cases involving the rich and powerful are routinely delayed or ensnared in red tape, with critics bemoaning how easily the rule of law is warped by political influence and cash.\nKamolvisit often boasts of his days as a successful \"pimp\" employing hundreds of women in Bangkok massage parlours, but now shoots-from-the-hip on television talk shows as a crusader against dodgy cops and politicians ©Pornchai Kittwongsakul (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420665/Colourful-Thai-massage-parlour-boss-turned-politican-jailed.html"}
