{"authors":["Chris Tognotti"],"date_download":"2018-10-31 01:35:45","date_modify":"2018-10-31 01:35:45","date_publish":"2014-08-12 19:38:03","description":"We're more than eight months into the new era of legal marijuana in Colorado. And in Denver, you can find a pretty big public exhibition that's firmly in the \"no\" camp — two big, human-sized cages calling teenage weed smokers \"lab rats.\"…","filename":"data/vaneerConsumption/ColoradosLabRatAntiMarijuanaCampaignIsActuallyPrettyIronic.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0b86d5c7-8ba1-4ce9-bb36-59dd7140e9ab.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35457-colorados-lab-rat-anti-marijuana-campaign-is-actually-pretty-ironic_1540949745.html","title":"Colorado's \"Lab Rat\" Anti-Marijuana Campaign Is Actually Pretty Ironic","title_page":"Colorado's \"Lab Rat\" Anti-Marijuana Campaign Is Actually Pretty Ironic","title_rss":"NULL","source_domain":"bustle.com","text":"We're more than eight months into the new era of legal marijuana in Colorado. And in Denver, you can find a pretty big public exhibition that's firmly in the \"no\" camp — two big, human-sized cages calling teenage weed smokers \"lab rats.\" Specifically, the campaign — commissioned by the state of Colorado, and conceived by ad man Mark Sukle — urges them not to be lab rats, as research into the effects of marijuana on developing brains is relatively scant. And, as shouldn't come as much surprise, the exhibition cages have already attracted some attention: one of the cages has already been vandalized.\nThe cages were erected as the result of settlements with pharmaceutical companies, according to CBS News, and they make the implicit case that marijuana might be dangerous for teenage and developing brains. There's been much reporting on early research into teenage marijuana use lately, likely due to the rise of legalization in states like Colorado and Washington, and the possibility that more will follow suit.\nAs NPR reports, some studies have recently suggested that smoking marijuana could have unique effects on the brains of teenagers, with one from Duke University suggesting it could result in diminished IQ. Of course, it's important not to draw too many assumptions — as NPR also points out, the Duke study's heaviest marijuana smokers had lower IQs from the get-go, raising questions about causation.\nBut, basically, that's the thrust of this campaign: Pending further research, a 17-year-old is making herself a veritable lab rat by lighting up.\nHere's the thing: this is a slightly strange tact for anti-marijuana advocates to be taking, seeing as the lack of available research is itself a function of the drug's long-term illegality across the United States. As detailed by the Marijuana Policy Project:\nAlthough 23 states and the District of Columbia have approved medical marijuana laws, the Institute of Medicine’s call for expanded clinical trials on marijuana’s medical safety and efficacy remains largely unfulfilled. In 2008, the American College of Physicians noted that “research expansion has been hindered by a complicated federal approval process [and] limited availability of research-grade marijuana ... .” In addition to the standard FDA and DEA approvals needed for all research using Schedule I drugs, researchers conducting trials with marijuana must receive approval through a National Institute on Drug Abuse/Public Health Service (NIDA/PHS) protocol review process that exists for no other drug.\nBasically, thanks to marijuana's status as a Schedule 1 drug under the DEA's rules (which puts it on equal footing with heroin, mescaline, MDMA and bath salts), researchers have historically had a hell of a time doing the kind of studies which now, as outright legalization begins to spread, would've been really useful in crafting policy regarding underage users.\nJustin Sullivan/Getty Images News/Getty Images\nIt is true that getting more data on marijuana's impact on teenage brains would be useful, and like many cases where a truly comprehensive degree of understanding isn't available, you might want to err on the side of caution and common sense. While I can't and would never say this for everyone, I certainly wouldn't have been helped by a high school weed habit, even independent of any potential neurological effects.\nBut it's also true that the decades-long prohibition on marijuana has politicized the issue, and that's an inescapable concern for its advocates. Just as the drug was once smeared as an insanity-inducing menace that might make you slice up your mouth on a broken cola bottle (1951's \"Drug Addiction,\" pictured above), there's understandable worry about such political opposition weighing into the modern scientific debate.\nIn any event, whether Colorado's campaign will actually dissuade any young people from toking up isn't terribly clear. If the vandalism is any indication, they could run the risk of becoming ironic paeans to weed culture, which is probably not what they hoped for. To his credit, Colorado state health department chief Dr. Larry Wolk was pretty generous in discussing the vandalism, according to CBS News.\nIf they are defacing it or their doing something with regard to graffiti or gathering in the cages, at least they are taking notice … and let the debate occur.\nImages: Getty Images","url":"https://www.bustle.com/articles/35457-colorados-lab-rat-anti-marijuana-campaign-is-actually-pretty-ironic"}
