{"authors":["Lucas Nolan"],"date_download":"2018-10-30 22:09:54","date_modify":"2018-10-30 22:09:54","date_publish":"2016-10-01 20:16:59","description":"Benjamin Sweetwood jokingly called himself \"handsome\" in Chinese during a Chinese language class. This triggered feminists.","filename":"data/vaneerConsumption/ColumbiaUniversityStudentForcedToAttendReEducationForSayingHesHandsome.json","image_url":"https://media.breitbart.com/media/2015/10/Columbia-University-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_10_01__1540937394.html","title":"Columbia University Student Forced To Attend 'Re-Education' For Saying He's Handsome","title_page":"Columbia University Student Forced To Attend 'Re-Education' For Saying He's Handsome | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Columbia University student Benjamin Sweetwood recently wrote a piece for The Tab discussing the “re-education” he received from the gender-based misconduct office for daring to refer to himself as “handsome” in class.\nSweetwood was attending a Chinese language class in the fall of 2014. Naturally part of this class was using the vocabulary and grammar learned to create sentences. During one class Sweetwood referred to himself as handsome using the Chinese phrase, “Wǒ hěn shuài”. Sweetwood thought nothing of this, finished the class and went home. The next day however Sweetwood was asked to stay after class by his professor, in Sweetwood’s own words, this is how the exchange went.\n“She mentioned I had called myself handsome and alluded to my joking personality in general. She also told me she was not offended at all. She said she thought it was funny, but that she didn’t want to get in trouble herself. She told me if I want to make those jokes, I should come to her office hours to do so. I assumed it’s because my sick mind needed to be contained in a space where other students were not at risk of harm. I felt bad for the teacher as she seemed to be in a tough situation, where she had no choice but to scold me.”\nSweetwood received an email from Columbia University’s dean later in the day informing him that he had been reported to the “Gender-Based Misconduct Office” and would need to meet with the dean as soon as possible. Sweetwood did meet with the dean who attempted to make him admit fault in the situation, Sweetwood refused.\n“My dean tried to make me agree that I would never do this again. I flat out refused. I laid into her about how upset I was about the situation and I said something along the lines of: ‘If you’re asking me to not be myself, then I guarantee I will end up back in your office again.’”\nThe Dean did however seem to concede that the reaction to Sweetwoods comments may have been over the top, at one point saying, “Even if I agree with you, I obviously couldn’t say anything…”.\nThis eventually led to Sweetwood being forced to discuss the matter with a caseworker from the Gender-Based Misconduct Office who set up a “re-education” meeting in his office. Once Sweetwood explained what happened and his general views on gender based attacks and homophobia, the caseworker seemed to lighten up, once again echoing the deans sentiment saying, “Even if I were to agree with you, you know I can’t say anything…”.\nThe case was eventually dismissed but Sweetwood didn’t miss his chance to let the classmate that reported him know how he felt about the situation.\n“Later that week, in Chinese class when my teacher was having us use a new sentence structure to talk about things that make us upset, my sentence was: “I get upset when I get reported to Gender Misconduct by my classmates (OK, I may have used a little bit of English to get the full phrase out). I probably shouldn’t have done that but it was just too damn funny not to.”\nRead Sweetwood’s full article at The Tab here.\nLucas Nolan is a conservative who regularly contributes articles on censorship and free speech to Breitbart. Follow him on Twitter@LucasNolan_ or email him at lucas@yiannopoulos.net","url":"https://www.breitbart.com/tech/2016/10/01/columbia-university-student-forced-to-attend-re-education-for-saying-hes-handsome/"}
