{"authors":[],"date_download":"2018-10-22 23:17:40","date_modify":"2018-10-22 23:17:40","date_publish":"2014-11-10 00:00:00","description":"Scientists in England are ready to do something that's never been done before — combine the DNA of two women and one man to create embryos that don't carry hereditary mitochondrial disorders.","filename":"data/vaneerConsumption/CombiningTheDNAOf3PeopleRaisesEthicalQuestions.json","image_url":"https://media.npr.org/assets/img/2014/11/07/npr_dna_1_wide-f2c3c4c46036268e5630ec9cdb146e50c44af32a.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=360342623_1540250260.html","title":"Combining The DNA Of 3 People Raises Ethical Questions","title_page":"Combining The DNA Of 3 People Raises Ethical Questions : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nToday in Your Health, we report on a controversial transplant of DNA. The question is whether scientists should be allowed to move DNA from one woman to an egg of another woman. Some doctors want to try. They want to help women who carry genetic disorders to have healthy children. NPR's Rob Stein went to England, where scientists could get the first green light.\nROB STEIN, BYLINE: To understand why scientists would want to do this sort of thing, I took a trip to the north of England, to visit Victoria Collins.\nVICTORIA COLLINS: Hello.\nSTEIN: Hi, how are you?\nCOLLINS: I'm all right, thank you.\nSTEIN: She's 37 and lives in a tidy, brick row house in County Durham. It's about four hours north of London.\nCOLLINS: Do you want a cup of tea or coffee?\nSTEIN: Yeah, I'd love - a cup of coffee would be great.\nCOLLINS: Do you want to take a seat? And I'll just be through in a second, OK?\nSTEIN: Collins comes from a family that's had lots of trouble having healthy babies for generations.\nCOLLINS: My grandma had twin sisters who both died as babies. One died 13 days old and one at 6 months old.\nSTEIN: Their little bodies just wasted away.\nCOLLINS: No matter how much food the babies were getting, they just - their nutrients weren't getting through to the body.\nSTEIN: Collins wants kids, but like every woman in her family, she's carrying genetic mutations that can cause horrible disorders. They're called mitochondrial diseases.\nCOLLINS: It's always in the back of my mind that I could pass on mitochondrial disease to a child of mine.\nSTEIN: She's hoping doctors down the road at Newcastle University are going to be allowed to try to help women like her, by replacing the defective DNA in her eggs with healthy DNA from another woman's egg. But that would mean doing something that's never been done before - making changes in human DNA - changes that would be passed down for generations and deliberately creating babies with genes from three different people. To find out more, I spent some time with the scientists at Newcastle.\nDOUG TURNBULL: Hi. Hi, I'm Doug Turnbull.\nSTEIN: I'm Rob Stein. Nice to meet you.\nDoug Turnbull treats people with these mitochondrial diseases.\nTURNBULL: When I see the anguish of the families every connect that I do, you maybe have the disease yourself, you see your children being very severely affected - dying early. Or you see your sister dying before you do. In most families, it is a devastating illness.\nSTEIN: These mitochondrial illnesses are caused by defects in a very specific kind of DNA.\nTURNBULL: This DNA is very different from the DNA that we all hear about.\nSTEIN: That DNA is in the nucleus of the cells, that thing right in the middle, like the yolk in an egg, the tens of thousands of genes that help make us who we are - the color of our eyes or hair, the shape of our noses, how tall or smart we are. The kind of DNA that causes these disorders is tiny, just 37 genes, and it's in a totally different part of the cell called mitochondria\nTURNBULL: Mitochondria are like little power stations, present in all our cells.\nSTEIN: Power stations that provide the energy that cells need, and if the mitochondrial DNA is defective, the cells don't work right.\nTURNBULL: So these are diseases where, in effect, the cells run out of energy.\nSTEIN: Mitochondrial DNA is only passed down from women to their babies through their eggs. So replacing defective mitochondrial DNA with healthy DNA could fix this. To see how they actually do the DNA transplants, Turnbull suggests I walk across town to another lab at the university.\nLAURA IRVING: Hi, my name's Laura.\nSTEIN: There, I find Laura Irving, a research associate at Newcastle. She's working in a small, darkened room. She's intently focused on the microscope in front of her.\nIRVING: So at this point in time, we're just turning the microscope on.\nSTEIN: Do you mind if I just peek into the microscope and see what it looks like in there? As I'm leaning in, I notice there's a Petri dish sitting on the microscope. It's lit up from below, so it's kind of glowing in the dark. That's where Irving does the DNA transplants.\nIRVING: It's like microsurgery.\nSTEIN: First, she carefully grabs the egg with the defective mitochondrial DNA with the tip of a long, thin glass tube so she can hold it very still.\nIRVING: We need to make sure that the egg it doesn't spin.\nSTEIN: Next, Irving pierces the shell with the laser so she can pull out the regular DNA from the nucleus of the cell, leaving the defective mitochondrial DNA behind. Technically, the egg's now a very early embryo because it's already been fertilized.\nIRVING: So at this point in time, I'm just removing the pronuclei from the embryo.\nSTEIN: The pronuclei is the DNA?\nIRVING: Yeah. The pronuclei contains the DNA from the mother and father.\nSTEIN: Under the microscope, the pronuclei look like little bubbles.\nIRVING: Then carry these to the recipient embryo.\nSTEIN: The recipient embryo is made from an egg donated by a woman with healthy mitochondria. Irving removes all of its regular DNA, leaving behind the healthy mitochondrial DNA from the donor so she can transplant the DNA from the couple trying to have a healthy baby into it.\nIRVING: You need to be careful as this could just contain the DNA which could quite form a child. It's quite precious material really, so I think you do need to remember and kind of keep a steady set of mind when you perform the procedure.\nSTEIN: And the result is an embryo with healthy mitochondrial DNA of the donor and regular DNA of the mother and the father. If the Newcastle scientists get the green light, they transfer an embryo made this way into the womb of a woman trying to have a healthy baby. But the idea of scientists manipulating a human being's DNA like this has triggered an intense debate.\nDAVID KING: This would be the first time that genetic changes were made in a person's DNA in a way that they will be passed down to all that person's descendents.\nSTEIN: David King runs a genetic research watchdog group that's been fighting this.\nKING: For the last 30 years, governments around the world and bioethicists around the world have always said, no, we shouldn't be doing this.\nSTEIN: For lots of reasons. One big worry is that scientists could make some kind of mistake - a mistake that could create new health problems that would then be passed down for generations. And critics like King say allowing scientists to tinker with human DNA for a medical reason could open the door for doing this kind of thing for other reasons.\nKING: That's something that could potentially lead to this future of designer babies and consumer eugenics, whereby people would be able to purchase, for their children, sort of genetic enhancements and certain characteristics like athletic ability or intelligence. That's the future, that if we get into it, it will be absolutely socially disastrous throughout society as a whole.\nSTEIN: But that's not all he objects to. Remember every baby born this way would have DNA from three different people.\nKING: A lot of people find that very troubling. It speaks to something very deep and emotional - I think in the human psyche - about the way reproduction is supposed to work.\nSTEIN: Despite all this, it looks like the British government is going to let this go ahead. Sally Davies, England's chief medical officer, dismisses concerns about kids with three genetic parents. She says the mitochondrial DNA does nothing more than provide energy for cells. She likes to compare the procedure to changing the battery in a car.\nSALLY DAVIES: So the child will have the characteristics that any other child would have from that family - intelligence, looks, behaviors - whatever. The only thing different would be those 37 genes in each mitochondria, and it is all about changing the battery so it's not flat, so it works, so you're healthy.\nSTEIN: She also dismisses fears about designer babies\nDAVIES: We will not be going there. We cannot go there, by law. This is about the power pack, and it's not designer babies, it's healthy babies.\nSTEIN: For her part, Victoria Collins isn't worried about having a baby with a few dozen genes from another woman. She just wants to have a healthy baby who can go on to have healthy babies of her own.\nCOLLINS: You've got this desire to be a mother, and you ultimately want your child to be healthy. So it'd give us peace of mind really.\nSTEIN: The British Parliament may vote on this by the end of the year. If so, the Newcastle scientists hope to do their first DNA transplant sometime next year. In this country, the Food and Drug Administration is asking the National Academy of Sciences for advice about whether to let scientists try the same thing here. Rob Stein, NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=360342623"}
