{"authors":["Sheila Dang"],"date_download":"2018-10-30 22:53:33","date_modify":"2018-10-30 22:53:33","date_publish":"2018-07-26 00:00:00","description":"Comcast's quarterly profit topped expectations, but revenue missed.","filename":"data/vaneerConsumption/Comcastearningsbeatbutsheds140000cableTVsubscribers.json","image_url":"https://amp.businessinsider.com/images/5af0e2d519ee8622008b49e0-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_comcast-earnings-beat-sheds-140000-cable-tv-subscribers-2018-7_1540940013.html","title":"Comcast earnings beat, but sheds 140,000 cable TV subscribers","title_page":"    Comcast earnings beat, but sheds 140,000 cable TV subscribers - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The NBC and Comcast logo are displayed on top of 30 Rockefeller Plaza, formerly known as the GE building, in midtown Manhattan in New York Thomson Reuters\n(Reuters) - Comcast Corp on Thursday said it shed more cable TV subscribers than the previous year, but beat Wall Street estimates for quarterly profit as it gained more high-speed internet customers.\nComcast, which dropped its pursuit of Twenty-First Century Fox Inc's entertainment assets last week after a bidding war with Walt Disney Co, is still competing against Fox to acquire European pay-TV company Sky PLC to expand internationally and find more growth with media content.\nRevenue from high-speed internet customers rose 9.3 percent to $4.26 billion during the second quarter as Comcast added 260,000 internet subscribers, beating an average estimate of 200,000 net adds from analysts at MoffettNathanson and Macquarie.\nThe biggest U.S. cable provider also shed 140,000 video customers during the second quarter, up from 34,000 customers lost in the prior-year quarter, as TV viewers move to a growing number of cheaper streaming options, such as AT&T Inc's newly-launched WatchTV at $15.\nNet income attributable to Comcast rose 27.6 percent to $3.2 billion, or 69 cents per share, from $2.5 billion, or 52 cents per share, a year earlier.\nEarnings per share excluding adjustments were 65 cents per share, up from 52 cents per share last year, beating analyst estimates of 60 cents per share.\nComcast's revenue rose 2.1 percent from the previous year to $21.7 billion, but fell short of analyst estimates of $21.86 billion, according to Thomson Reuters data.\nTotal capital expenditures were $2.25 billion during the quarter, down 3.3 percent from last year.\nComcast added 204,000 Xfinity Mobile customers in the quarter ended June 30. The wireless service launched last year and is available only to Comcast internet subscribers.\nRevenue from the company's NBCUniversal segment was flat compared to the previous year, due to revenue decline for its movie studios, as hit movie \"Jurassic World: Fallen Kingdom\" opened late in the quarter.\n(Reporting by Sheila Dang; Editing by James Dalgleish)","url":"https://www.businessinsider.com/comcast-earnings-beat-sheds-140000-cable-tv-subscribers-2018-7"}
