{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:19:12","date_modify":"2018-10-30 18:19:12","date_publish":"2018-07-19 14:26:24","description":"Comcast announced Thursday it is pulling out of the bidding war with Walt Disney Co. for film and television operations of 21st Century Fox.","filename":"data/vaneerConsumption/ComcastPullsBidfor21stCenturyFoxPavesWayForDisneyTakeover.json","image_url":"https://media.breitbart.com/media/2018/03/AP-Iger-640x480.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_07_19__1540923552.html","title":"Comcast Pulls Bid for 21st Century Fox, Paves Way For Disney Takeover","title_page":"Comcast Pulls Bid for 21st Century Fox, Paves Way For Disney Takeover","title_rss":"NULL","source_domain":"breitbart.com","text":"Comcast announced Thursday it is pulling out of the bidding war with Walt Disney Co. for film and television operations of 21st Century Fox.\nThe media giant said in a statement it would instead focus on acquiring the European pay TV operator Sky, shifting its stand on how it approaches the latest round of consolidation in the media-entertainment sector. The move by Comcast effectively ensures that Disney will be able to complete its $71.3 billion tie-up with Fox that creates a new powerhouse in the sector as Rupert Murdoch slims down his media empire.\n“Comcast does not intend to pursue further the acquisition of the Twenty-First Century Fox assets and, instead, will focus on our recommended offer for Sky,” said a statement from group which is the leading US cable operator and also owns NBCUniversal. Both Comcast and Disney had been coveting the prized assets being sold by Murdoch, which include the Fox studios in Hollywood and important film and television production operations. At the same time, the two media giants have been aiming to take control of Sky, the British-based pay-T.V. operator in which Fox holds a 39 percent stake.\nIn June, the British cleared the way for Rupert Murdoch’s 21st Century Fox to take full control of pan-European TV giant Sky after Fox agreed to address media plurality concerns. Despite the clearance, satellite pay-TV group Sky could still end up being bought by Comcast or Disney amid a US media industry tug-of-war. “It is now a matter for the Sky shareholders to decide whether to accept 21CF’s bid,” Britain’s Culture Secretary Jeremy Wright said in a statement. Fox’s long-running pursuit for all of Sky had been plagued by UK government fears over media plurality and broadcasting standards — and the influence of Australian-born US citizen Murdoch.\nDisney launched its offer for Fox’s assets last December at $52.4 billion as the Murdoch family announced they would reorganize to focus on Fox News, the Fox broadcast network and some sports operations. Comcast made its bid of $65 billion in June, aiming to capitalize on what was seen as an easier regulatory path after AT&T successfully defended an antitrust challenge to its acquisition of media-entertainment group Time Warner.\nDepartment of Justice officials filed a motion on Wednesday requesting an accelerated timeline for its appeal of a judge’s decision to approve a merger between AT&T and Time Warner. In the filing, the Justice Department asked the Washington, D.C., Circuit Court of Appeals to expedite the appeal by filing all legal briefs before October 18 and commencing oral arguments shortly afterward.\nAT&T didn’t object to the expedited timeline, according to the filing. The company, which merged with Time Warner days after the initial ruling, previously agreed to hold Time Warner’s Turner cable networks in a separate business unit during any appeals-court proceedings through next February. AT&T CEO Randall Stephenson told Fox Business’s Charlie Gasparino that he was “not surprised” by the Justice Department’s decision to appeal the ruling and said prepared to take the case to the Supreme Court if need be.\nBREAKING: @ATT CEO Randall Stephenson just now telling @CGasparino \"The ATT/TimeWarner merger is closed, DONE, not surprised the DOJ is still trying to break up the merger by appealing\" & he will take this all the way to the Supreme Court if he has to.\" — Liz Claman (@LizClaman) July 12, 2018\nThe Justice Department said any delay in deciding the appeal “will make it increasingly difficult to unwind the merger” if it is granted. “If the appeal is not decided by then, AT&T immediately can be expected to exercise the increased bargaining leverage that it would gain from control of Turner,” the filing stated. The department filed its appeal against U.S. District Judge Richard Leon’s decision to OK the $85.4 billion merger last week, despite Leon stating he didn’t believe the government had “a likelihood of success” on merit of appeal.\nThe Agence France-Presse and United Press International contributed to this report.","url":"https://www.breitbart.com/the-media/2018/07/19/comcast-pulls-bid-for-21st-century-fox/"}
