{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:23:29","date_modify":"2018-10-30 20:23:29","date_publish":"2015-03-17 19:07:52","description":"Comedy Central has announced the March 30 airing of the Roast of Justin Bieber will not include jokes at the expense of late actor Paul Walker.","filename":"data/vaneerConsumption/ComedyCentralCutsPaulWalkerJokesfromBieberRoastAfterBacklash.json","image_url":"https://media.breitbart.com/media/2015/03/paul-walker-memorial-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_17__1540931009.html","title":"Comedy Central Cuts Paul Walker Jokes from Bieber Roast After Backlash","title_page":"Comedy Central Cuts Paul Walker Jokes from Bieber Roast After Backlash | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Comedy Central has announced the March 30 airing of the Roast of Justin Bieber will not include jokes at the expense of late actor Paul Walker.\nSeveral jokes by comedian Jeffrey Ross at the event were reportedly made about Walker, who died in a car accident in 2013 at the age of 40, and aimed at Walker’s friend Ludacris.\n“Move b—h, get out the way,” Ross said, quoting Ludacris’ 2002 hit “Move B—ch”. “That’s what Paul Walker should have told that tree.”\nThe rapper and actor, who appeared in several Fast & Furious franchise films alongside Walker, was reportedly not pleased, and neither was the studio audience.\n“Too soon? Too fast? Too furious? Give me a break people I’m trying to save this kid’s life,” Ross replied.\nAccording to the Hollywood Reporter, an offended Ludacris motioned for the show to stop filming at one point during the jokes.\nRoss was later asked by THR if his Walker jokes went too far, to which he replied: “I was so in the moment, I don’t know what jokes hit.”\nA spokesperson for the network also responded to the controversy:\nRoasts often push the limits of good taste and we give the participants full rein to try things knowing we have the edit to shape the show. Sometimes the line is discovered by crossing it. The Paul Walker references will not be in the telecast.\nBieber told reporters after the show that he “didn’t particularly like the Walker jokes.”\nThe special will air on Comedy Central March 30.","url":"https://www.breitbart.com/entertainment/2015/03/17/bieber-roast-jokes-about-paul-walkers-death-cut-by-comedy-central/"}
