{"authors":["Emma Cueto"],"date_download":"2018-10-30 23:36:17","date_modify":"2018-10-30 23:36:17","date_publish":"2014-08-13 15:49:13","description":"There are some guys who don't seem to understand the idea that some women would like to have sex that doesn't involve men — which I guess is what happens when you live in a culture with such messed up ideas about women's sexuality and about male…","filename":"data/vaneerConsumption/ComedianCameronEspositoGivesHomophobicHecklerAPerfectAndHilariousResponse.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e659c8f7-cdb1-46b2-adc3-c035dd32e358.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35604-comedian-cameron-esposito-gives-homophobic-heckler-a-perfect-and-hilarious-response_1540942577.html","title":"Comedian Cameron Esposito Gives Homophobic Heckler A Perfect (And Hilarious) Response","title_page":"Comedian Cameron Esposito Gives Homophobic Heckler A Perfect (And Hilarious) Response","title_rss":"NULL","source_domain":"bustle.com","text":"There are some guys who don't seem to understand the idea that some women would like to have sex that doesn't involve men — which I guess is what happens when you live in a culture with such messed up ideas about women's sexuality and about male entitlement. But Cameron Esposito, a comedian who happens to be a lesbian , has the perfect response to such guys. Because seriously dudes, you're not the center of the universe.\nEsposito is a stand-up comedian, writer, popular podcast host, and self-described \"giant lesbian.\" In a piece from her upcoming comedy album Same Sex Symbol , she remembers one night at a stand up show when a man shouted at her from the audience, \"You look like a woman who doesn't sleep with men.\" Which is certainly a very wordy way of calling someone a lesbian, but maybe he just wanted to be especially clear. Esposito, though, rather than letting the comment get to her, brings it up in her stand-up routine as a hilarious joke.\nAnd when you think about it, it is pretty funny. I mean, what, does he think she's going to be super bummed about not sleeping with men? Maybe he intended to make Esposito look bad with the comment, but by the end of the segment, he's the one who's turned into a joke.\nKill Rock Stars on YouTube\nImage: Kill Rock Stars/YouTube","url":"https://www.bustle.com/articles/35604-comedian-cameron-esposito-gives-homophobic-heckler-a-perfect-and-hilarious-response"}
