{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:57:00","date_modify":"2018-10-30 22:57:00","date_publish":"2014-08-14 15:21:14","description":"If you’ve ever found yourself wishing that selfies were illegal, you’re not the only one. Jena Kingsley, a writer and comedian, thinks the selfie generation is getting out of control, too — so she decided to do something about it. Kingsley recently…","filename":"data/vaneerConsumption/ComedianJenaKingsleysNoSelfieZonePrankConvincesPeopletoPayaFake50FineforTakingIllegalSelfies.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6048be7f-c917-4494-bdfa-9eca2532772c.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35772-comedian-jena-kingsleys-no-selfie-zone-prank-convinces-people-to-pay-a-fake-50-fine-for_1540940220.html","title":"Comedian Jena Kingsley’s “No Selfie Zone” Prank Convinces People to Pay a Fake $50 Fine for Taking “Illegal” Selfies","title_page":"Comedian Jena Kingsley’s “No Selfie Zone” Prank Convinces People to Pay a Fake $50 Fine for Taking “Illegal” Selfies","title_rss":"NULL","source_domain":"bustle.com","text":"If you’ve ever found yourself wishing that selfies were illegal, you’re not the only one. Jena Kingsley, a writer and comedian, thinks the selfie generation is getting out of control, too — so she decided to do something about it. Kingsley recently set up a Punk’d-style prank to see how many people would believe her if she told them they were in violation of anti-selfie laws — and the number of folks who were willing to pony up a $50 fine for their “illegal” selfies is pretty surprising. Seems like the kind of thing Jimmy Kimmel would do, no? Here’s how it went down.\nFirst, Kingsley made some nicely official-looking signs proclaiming specific areas of New York’s Central Park to be “No Selfie Zones” between the hours of 7 a.m. and midnight, seven days a week. Then she dressed up in a security uniform and went around enforcing the “law.” Although it seems like a pretty easy prank to see through — at one point, for example, she told a pair of no selfie zone violators about the fines, “The money is going to girls with no self-esteem, because they’re not photogenic” — a lot of people apparently took it at face value. The one way to wiggle out of the fine? For the poor, unsuspecting rubes to delete the offending pictures in front of Kingsley.\nNo, Stefan. No selfies for you. Or for anyone else, either.\nKingsley and her camera crew did get caught and subsequently kicked out of the park by actual park security — but as TIME pointed out, the fake law isn’t too far off the mark. A number of institutions, including school graduations, a selection of nightclubs, and New York itself with its “tiger selfie” law, have been banning the ubiquitous social media pics. Kingsley remarked, “Can you imagine what our pics are going to look like to our children and grandchildren?” — and she’s kind of right. Maybe I’m just a horrible cynic; but most of the time, all I see in every new selfie trend is technologically-bred narcissism. The exception are things like the statue selfies we saw the other day and projects like Hugo Cornellier's and Rebecca Brown's, but they're far from the rule.\nCheck out Kingsley’s video below. Would you believe it if someone told you selfies were illegal? And perhaps more importantly, would you continue to take them anyway, even when threatened with a fine?\nJena Kingsley on YouTube\nImage: Jena Kingsley/YouTube; Giphy","url":"https://www.bustle.com/articles/35772-comedian-jena-kingsleys-no-selfie-zone-prank-convinces-people-to-pay-a-fake-50-fine-for"}
