{"authors":["Ian Hanchett"],"date_download":"2018-10-30 21:38:14","date_modify":"2018-10-30 21:38:14","date_publish":"2016-07-07 18:48:06","description":"During testimony before Congress on Thursday, FBI Director James Comey stated that people without the proper security clearance did have access to | Video","filename":"data/vaneerConsumption/ComeyClintonAllowedPeopleWithoutSecurityClearancesToHaveAccessToClassifiedMaterialOnHerServer.json","image_url":"https://media.breitbart.com/media/2016/07/Chaffetz-Comey-77-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_07_07__1540935494.html","title":"Comey: Clinton Allowed People Without Security Clearances To Have Access To Classified Material On Her Server","title_page":"Comey: Clinton Allowed People Without Security Clearances To Have Access To Classified Material On Her Server | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During testimony before Congress on Thursday, FBI Director James Comey stated that people without the proper security clearance did have access to classified material on presumptive Democratic presidential nominee former Secretary of State Hillary Clinton’s server.\nComey said, “I don’t think any of the correspondents on the classified emails were uncleared people. These were all people with clearances, working, doing State Department business, on the unclass system.”\nHe added, “[T]here’s no doubt that uncleared people had access to the server, because even after Pagliano, there were others who maintained the server who were private sector folks.” He then pegged the number of people without clearances who had access to the server as “probably more than two, less than ten.”\nHe was then asked, “Did Secretary Clinton’s attorneys have the security clearances needed?” He responded, “They did not.”\nAfter Representative Jason Chaffetz (R-UT), who was questioning Comey said, “Hillary Clinton gave direction to her attorneys, without a security clearance, to go through documents that were classified.” Comey responded, “I think that’s what happened, in fact. Whether that was the direction is a question I can’t answer sitting here.”\nChaffetz later asked, “[I]s there a reasonable expectation that Hillary Clinton would send and receive, if not hourly, if not daily, classified information? That’s reasonable to think that the secretary of state would get classified information at every moment. She’s not the head of fish and wildlife. So, the idea that she would turn over her emails, her system, her server, to what it sounds like, up to ten people without security clearances, and there’s no consequence. So, why not do it again?”\nComey answered, “That’s a question I don’t think you should put to me. You’re asking — I’m talking about my criminal investigation.”\nChaffetz then asked, “But, how can that — there’s no intent there? Does she not understand that these people don’t have security clearances?” Comey answered, “Surely she understands at least some of them don’t have security clearances.”\nChaffetz then asked, “So, she understands they don’t have security clearances, and it’s reasonable to think she’s going to be getting classified information. Is that not intent to provide a non-cleared person access to classified information?”\nComey answered that it wasn’t reasonable to assume that “someone who is maintaining your server is reading your emails. In fact, I don’t think that’s the case here. There’s a separate thing, which is, when she’s engaging counsel to comply with the State Department’s request, are her lawyers then exposed to information that may be on there that’s classified.”\nAfter Chaffetz asked whether Clinton’s lawyers saw classified information, Comey stated he didn’t know.\nChaffetz responded, “It has to be yes, director. you came across 110, and they said they went through all of them.” Comey countered, “Well, they didn’t read them all. They just looked at headers.”\nAfter an exchange on whether Clinton’s attorneys read classified emails, Chaffetz asked, “Did Hillary Clinton give non-cleared people access to classified information?” Comey answered, “Yes.”\nChaffetz then asked Comey, “What do you think her intent was?” Comey answered that he believed her intent “was to get good legal representation, then to make a — make the production to the State Department. … I don’t see the evidence there to make a case that she was acting with criminal intent in her engagement with lawyers.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2016/07/07/comey-clinton-allowed-people-without-security-clearances-to-have-access-classified-material-on-her-server/"}
