{"authors":[],"date_download":"2018-10-30 14:29:31","date_modify":"2018-10-30 14:29:31","date_publish":"2014-12-19 00:00:00","description":null,"filename":"data/vaneerConsumption/ComingtotheSilverScreenShelleyandBarrysFirstDate.json","image_url":"https://www.americanthinker.com/images/bucket/2014-12/193593.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_12_coming_to_the_silver_screen_shelley_and_barrys_first_date__comments_1540909771.html","title":"Coming to the Silver Screen: Shelley and Barry's First Date","title_page":"Blog: Coming to the Silver Screen: Shelley and Barry's First Date","title_rss":"NULL","source_domain":"americanthinker.com","text":"When Harvard law student Barack took a summer job at Chicago’s prestigeous Sidley Austin law firm, the world was unaware that history was being made. It was there where, according to her supervisors, hard-to-manage second-year associate Michelle LaVaughn Robinson, eager to change the world, was making a name for herself complaining about being treated as a second-year associate. It was while tagging along behind Michelle, Barack’s advisor at the time, that the earth moved for our future president, and not only because the determination in Michelle’s stride caused the building’s rafters to shake. After loving her from afar, with a lot of arm twisting and haranguing, Michelle finally agreed to lower herself and accept a date with the first-year law student. On that momentous day, the duo sauntered around the Southside of Chicago, providing the young, love-struck community organizer with the ears Michelle admitted she thought at first were large... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/12/coming_to_the_silver_screen_shelley_and_barrys_first_date__comments.html"}
ophy clearly swept the object of his affection right off her size-11 feet.\nThe date was a success because the lovers were married in 1992. Then in 2012, the site of the Obamas’ first kiss, which Obama said tasted like chocolate, outside a Baskin-Robbins ice cream shop in Chicago’s Hyde Park, was memorialized with a city plaque. Since then, ice cream of every flavor has occasionally been spotted on the front of both their shirts, as well as dried on the corners of both their lips.\nNow, here we are, a mere twenty-something years later, and finally an indie film will recount the summer of 1989 when Barack enticed America’s future first lady to take stroll, enjoy the cultural sights at the Art Institute, and hold hands during Do the Right Thing, Spike Lee’s, aka Mookie’s, movie about sizzling summer days, pizza, and racial unrest.\nSo move over, Gone with the Wind. Titanic, take a hike, because Shelley and Barry’s steaming hot passion is about to make its way onto the silver screen. That’s right - the epic romance story Southside With You, due to begin filming in July of 2015, is poised to fly like cupid’s arrow straight into America’s hearts.\nSouthside With You originated in the fertile minds of producer Richard Tanne, who wrote the screenplay, and the fetching Get On Up actress Tika Sumpter. Producers Tracey Bing, Richard Tanne, and Columbia Pictures alumni Stephanie Allain inexplicably view the Obama romance as one of the “great love stories of our time.”\nSumpter and Tanne developed the script and will co-produce the flick. In fact, Tika is so committed to the project that instead of offering Whoopi Goldberg the leading role, she cast herself as the warm and always welcoming Michelle, which is sort of like actress Kerry Washington casting herself as Texas congresswoman Sheila Jackson Lee.\nAccording to Tracey Bing, “Richard,” who hasn’t even found an actor to play Barack, “really captures the essence of that romantic connection between Barack and Michelle that is so evident in the way that they look at each other.”\nWell! America certainly looks forward to witnessing those scenes. I hope that the movie will capture some of the more notable side-glances Michelle has shot Barack’s way over the years.\nTake Dorothy Height and Nelson Mandela’s funeral, for instance.\nOn the loving-glance-o-meter, those ‘look at each other’ moments between the president and first lady reduce Meryl Streep and Clint Eastwood’s longing gazes in The Bridges of Madison County to nothing more than pathetic pabulum for wannabe romantics.\nTracey Bing did add, “We are looking forward to finding the perfect Barack.” Well good luck with that, because it’s been six plus-years and even Michelle would probably agree that a “perfect Barack” is nowhere to be found.\nThen again, if he’s not touring with Yo Gaba Gaba maybe D.J. Lance would be up for the job.\nNonetheless, if perchance the green-lit project should fall through, there’s always plenty of material for a movie chronicling the authenticity of the Clinton marriage. And with any luck, the currently hot, amply-sized actress/comedian Melissa McCarthy will be available to star as Hillary.\nJeannie hosts a blog at www.jeannieology.com","url":"https://www.americanthinker.com/blog/2014/12/coming_to_the_silver_screen_shelley_and_barrys_first_date_.html"}
