{"authors":[],"date_download":"2018-10-22 23:04:17","date_modify":"2018-10-22 23:04:17","date_publish":"2014-05-13 16:52:14","description":"If Donald Sterling's ownership of the Los Angeles Clippers is terminated, don't assume Shelly Sterling is automatically out, too.","filename":"data/vaneerConsumption/CommentaryForcingOutDonaldSterlingsWifeisNoSlamDunkforNBA.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/435321/140511-shelly-donald-sterling-jms-2302_ee5e14df90c8eabcb2dcde2ef1c03509.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_commentary-forcing-out-donald-sterlings-wife-no-slam-dunk-nba-n104331_1540249457.html","title":"Commentary: Forcing Out Donald Sterling's Wife is No Slam Dunk for NBA","title_page":"Commentary: Forcing Out Donald Sterling's Wife is No Slam Dunk for NBA","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe National Basketball Association board of governors, composed of the owners of the 30 NBA teams, may soon vote to terminate Donald Sterling's ownership of the Los Angeles Clippers for racist comments he made to a one-time companion that were made public April 26. NBA officials have said they intend to force the sale of the team to someone not named Sterling, as the coach of the team and some NBA players on and off the team have said they want.\nThe NBA constitution requires the NBA to overcome a number of hurdles to force Mr. Sterling to relinquish his stake. A supermajority of the owners must agree to terminate Mr. Sterling's ownership of the team. Mr. Sterling must further be found to have violated a duty expressly set out in the NBA constitution or a provision of some other contract Mr. Sterling made with the NBA, such as a \"morals clause\" in a contract that has not yet been publicly released.\nLet's assume the league can get by those obstacles and others and that Donald Sterling is banished from the league without, improbably, much of a fight from him. Mr. Sterling's estranged wife, Shelly, owns 50 percent of the team. Mrs. Sterling has not been accused of any wrongdoing. What if she follows through on her threat not to relinquish possession of her part of the team without a fight? What rights does she have? The answer depends far more on the terms of the NBA constitution than the law of community property.\nThe league insists Mrs. Sterling would have no rights under the NBA constitution to retain her ownership interest in the team. Donald Sterling is the controlling owner of the Clippers. NBA spokesman Mike Bass released a statement on Sunday: \"Under the NBA constitution, if a controlling owner's interest is terminated by a three-quarters vote, all other team owners' interests are automatically terminated as well.\"\nIn other words — if he goes, she goes.\nUh, not so fast. It is true that anyone with a beneficial ownership interest in an NBA team — such as, say, a community property interest — is bound by the NBA constitution. It also is true that anyone's ownership interest in any team is subject to termination by a supermajority vote of the board of governors. Beyond that, though, things get murky.\nUnder the NBA constitution, if three-fourths of the board finds an accused owner guilty of conduct warranting termination, it is the membership of the team (which the constitution calls a \"member\") in which the guilty owner has an interest that \"shall automatically be terminated.\" The team may remain in the league if two-thirds of the governors \"vote instead to terminate the ownership interest of the guilty owner\" or vote to impose a fine instead of termination of any kind.\nYou can see the problem with forcing Mrs. Sterling from the league even if her husband is found guilty. No one is talking about dropping the Los Angeles Clippers from the NBA. If more than one person has an ownership interest in a team, the constitution allows the termination of the ownership interests of fewer than all of them. Charges will be brought against Mr. Sterling alone. Regardless of Mr. Sterling's fate, it is hard to see how Mrs. Sterling could be called a \"guilty owner\" whose ownership interest in the team may be terminated.\nIt is no answer to say that the non-recourse clause of the NBA constitution means Mrs. Sterling can't challenge a decision of the league against her. That is true only to a point. Subsection (j) of Article 14, which sets out the termination procedure, says: \"The decision of the association made in accordance with the foregoing procedure shall be final, binding, and conclusive, and each member and owner waives any and all recourse to any court of law to review any such decision.\" Under New York law and the NBA constitution, an owner may challenge in court a termination decision not in accordance with the NBA constitution.\nThe board's termination decision would not be self-executing if Mrs. Sterling refuses to accept it. Mrs. Sterling could challenge the board's decision when the board goes to court to enforce its decision. Such a challenge would not be unprecedented. In 1973, the Seattle Supersonics successfully challenged the decision of then-NBA Commissioner Walter Kennedy fining the team $10,000 and awarding its first round draft pick to the Philadelphia 76ers to punish the Sonics for signing a player over whom the 76ers had exclusive negotiating rights. A federal judge concluded that the commissioner had exceeded his authority under the version of the NBA's constitution then in effect and vacated his decision.\nESPN has quoted the interim CEO of the Clippers, Dick Parsons, as saying, \"A prolonged legal battle is in no one's interest, certainly not the league's.\" He's right. A legal fight against Mrs. Sterling — not to mention Mr. Sterling — is no slam dunk.\nCommentary by Dan Eaton, a partner with the San Diego law firm of Seltzer Caplan McMahon Vitek, where his practice focuses on defending and advising employers. He also is a professor at the San Diego State University College of Business Administration, where he teaches classes in business ethics and employment law. Follow him on Twitter@DanEatonlaw. The views expressed in this commentary do not necessarily reflect the views of NBC News.","url":"https://www.nbcnews.com/business/business-news/commentary-forcing-out-donald-sterlings-wife-no-slam-dunk-nba-n104331"}
