{"authors":["Katie Fustich For Dailymail.Com"],"date_download":"2018-10-23 05:36:31","date_modify":"2018-10-23 05:36:31","date_publish":"2017-04-26 17:01:29","description":"Commuter Barbie is a hilarious new parody commercial that tackles the highs and lows of millennial women on the New York City subway. Commuter Barbie comes with Starbucks, a yoga mat, and more.","filename":"data/vaneerConsumption/CommuterBarbieparodycommercialiseveryoneonthetrain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA02DF400000578-0-image-a-23_1493216952186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4447852_Commuter-Barbie-parody-commercial-train_1540272991.html","title":"Commuter Barbie parody commercial is everyone on the train","title_page":"Commuter Barbie parody commercial is everyone on the train | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barbie has had many identities in her lifetime: a ballerina, a pilot, a veterinarian, and now - thanks to a new parody video - a commuter.\nIn the Commuter Barbie commercial, everyone's favorite doll has been transformed into a MetroCard-carrying millennial. Soft music sings about Commuter Barbie's many features, while two young girls hilariously discuss Barbie's accessories, career, and even her apartment applications.\nThe clip, which was written and directed by Carina Hsieh and Claudia Arisso, both skewers and embraces the many stereotypes about millennial women in a way that feels reminiscent of HBO's Girls.\nScroll down for video\nShe's just like the rest of us! The Commuter Barbie commercial all-too-accurately depicts the hectic lifestyle of millennial women in New York City\nPlaytime! The video shows two young girls playing with - and commenting on Commuter Barbie. 'She'll never make 40 times her rent! Sad!' they exclaim\n'Wow! It really spills!' Commuter Barbie's tiny coffee looks eerily familiar - it even has her name spelled wrong for maximum accuracy\nCommuter Barbie comes sporting a beanie, glasses, and even a tiny Canada Goose jacket. Strapped to her back is a yoga mat, and slung over her should a tote bag from popular bookstore The Strand.\nBarbie even carries a tiny 'Grande Macchiato, to keep you awake.' The girls playing with the doll exclaim, 'Wow! It really spills!'\nAccompanying her coffee is a tiny Clif Bar for her 'breakfast snack.' On the way back home? A Trader Joe's grocery bag, likely stuffed with frozen pizza and veggie chips.\nFor commuting entertainment, Barbie sports large pink headphones that are both perfect for 'listening to podcasts' and 'blocking out the creeps'.\nShe's also literary, of course, and carries both a copy of hip author Zadie Smith's Swing Time, and a 'coffee-stained copy of the New Yorker'.\nUnfortunately, just like the real one it represents, Commuter Barbie's MetroCard is 'subject to random fare hikes'.\nShe's never seen without them: A Trader Joe's shopping bag and a tote from The Strand will hold both Commuter Barbie's frozen mozzarella sticks, and her keys\nCommuting entertainment: Barbie is a big fan of both trendy podcasts and the 'luminous prose' of author Zadie Smith\nOne of the most cutting parts of the video comes when the two young girls playing with Commuter Barbie begin sorting through her apartment rental applications.\nThey turn to each other and sigh: 'She'll never make 40 times her rent. Sad!'\nThe clip is both a parody of a lifestyle and an homage to the strange yet very real microcosm that is the New York City subway.\nWriters and directors Hsieh and Arisso tell Daily Mail Online that the initial inspiration for the clip actually came when the pair of writers (who are former roommates and best friends) spotted the miniature tote bag seen in the video.\n'It set off a PTSD flashback to every canvas-lined rush hour commute we’ve ever had,' says Hsieh. Thus, the inspiration for making a parody commercial about a 'girl trying her best' was found.\nAccessorizing! A coffee-stained coffee of the New Yorker and a 'heavy water bottle that hardly holds any water' are both staples of Commuter Barbie's routine\nBatteries not included: Unfortunately, Commuter Barbie's most realistic element is that her essential MetroCard (sold separately) is subject to random fare hikes\nAs for writing and filming, it took them 'less than an hour to nail down the script' and just a day to film, which they did in their apartment.\nThe fantastic miniatures you see in the video are all handcrafted, much to Hsieh and Arisso's enjoyment. They joke to Daily Mail Online, 'If we were paid hourly to assemble miniatures, we might actually be able to afford real Canada Goose jackets.'\nThe reaction to the video has been overwhelmingly positive, with many comments expressing something along the lines of 'this is my life.'\nHseih says: 'It's great to see that so many women relate to the un-glamorous facets of city living.'\nAs for future projects, the comedy duo says they are interested in possible expansion packs for Commuter Barbie, including an Etsy pack for knitting on the train, or a tourist pack that includes plenty of hard shell suitcases to stuff into a crowded subway car.\nWhether you love her, hate her, or are her - there is no denying there is a Commuter Barbie in everyone's life.","url":"https://www.dailymail.co.uk/femail/article-4447852/Commuter-Barbie-parody-commercial-train.html"}
