{"authors":[],"date_download":"2018-10-30 01:18:48","date_modify":"2018-10-30 01:18:48","date_publish":"2016-05-02 19:52:37","description":null,"filename":"data/vaneerConsumption/CommunistPartyFeelsTheBern.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/05/Screen-Shot-2016-05-01-at-4.24.14-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862328.html","title":"Communist Party Feels The Bern","title_page":"Communist Party Feels The BernThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"U.S. communists couldn’t be happier about the Democratic Party’s direction than Bernie himself.\nAs it has for months now, People’s World again this past week carried a headline hailing Bernie Sanders “revolution.” As the successor to the Soviet-funded and directed Daily Worker, and as ongoing house organ of Communist Party USA,People’s World is pleased with the long march of “progress” in the Democratic Party. The far-left lurch of today’s Democratic Party is lovingly in line with what the comrades have long desired. These inheritors of the Soviet experiment see Bernie Sanders as an exciting culmination of what they have been fighting for. And they view Barack Obama’s “fundamental transformation” of the Democratic Party as having made a candidate like Bernie possible.\nIf you think this is hyperbole on my part, you should educate yourself by reading what today’s communists are writing. As the latest exhibit, consider the instructive words ofJohn Bachtell, Communist Party USA chair, in the latest valentine to Bernie in People’s World:\nThe campaign of Sen. Bernie Sanders is making a unique contribution to defeating the Republican right and has the potential to galvanize long-term transformative change. The campaign is also a movement. Millions are fed up with the same old establishment politics tied to Wall Street and the 1 per cent. It’s reminiscent of the 2008 and 2012 Obama campaigns…. Seeds of change are being sown and foundations are being laid for deeper-going changes in the future…. The campaign is expanding the collective political imagination and injecting radical ideas into the body politic. It has legitimized democratic socialism in the national conversation. Sanders is also influencing Hillary Clinton to adopt more progressive positions on a wide range of issues.\nNote the Obama-speak in Bachtell’s rhetoric, from the invoking of “transformative change” and “seeds of change” to pointing to the very model of Barack’s 2008 and 2012 campaigns. And observe the excitement about Bernie having “legitimized democratic socialism in the national conversation” and influencing Hillary to adopt “more progressive positions.”\nThe head of Communist Party USA continued:\nBut Sanders understands if he is elected his radical economic and social agenda including breaking up the big banks, universal health care, tuition-free university, massive jobs creation, expanding Social Security, and repealing Citizen’s United will go nowhere given the vice grip the GOP and extreme right has on Congress. The only way to realize a radical agenda is through a “political revolution.”… Sanders sees his campaign as part of a much bigger movement that must be built. A political revolution rests on building a broad coalition…. A political revolution will be fueled by ongoing shifts in public attitudes. Majorities of Americans now favor taxing the rich, raising the minimum wage, immigration reform, abortion rights, marriage equality, criminal justice reform, and action to curb the climate crisis. New social movements are influencing millions at the grassroots including the Fight for 15, Black Lives Matter, The Dreamers, reproductive rights, marriage equality, and climate justice activists. A political revolution is based on the idea that majorities make change. It is not enough for majorities to believe in an idea, they must actively fight for it…. Movements are acting both within and outside the Democratic Party and comprise many of the key forces in the anti-right alliance.\nThis pitch for Bernie in People’s World by the head of Communist Party USA employs the rally cry “political revolution” a dozen times in under a thousand words, plus repeated use of the words “radical” and “progressive.” Make no mistake: the comrades are jazzed for Bernie Sanders. They want, as another People’s World writer likewise puts it, nothing short of a “Bernie Sanders political revolution.”\nBachtell looks with hope at how Bernie’s struggle could transform the political landscape and further remake the party of Kennedy and Truman:\nA political revolution can transform politics if labor, its allies and the broad left put their stamp on the multi-class alliance, shape its politics and frame the issues debated for the elections. The Sanders campaign is helping do this…. It will be transformative if the anti-right coalition is united and mobilized. Polls show that 86% of Clinton supporters will support Sanders in the general election if he is the nominee, and 79% of Sanders supporters will support Clinton if she wins. Sanders will need Clinton’s supporters in order to win.\nNote, remarkably, the vast support for Sanders that exists not only among his own comrades but among Hillary Clinton backers. This is support, of course, for a man who has long been an avowed, unapologetic socialist, who was fully sympathetic to the communist universe.\nAlso revealing is how today’s communists have hopped aboard the bandwagon of the new left’s cultural agenda, including on sexual-gender issues. I’ve been pointing this out for some time (see my book on the left’s takedown of family and marriage). The emergent Bernie-Democrat-socialist-communist-progressive-liberal coalition, advises Bachtell, “must fight uncompromisingly against racism, sexism, homophobia, transphobia, anti-Muslim and anti-immigrant attacks and all efforts to divide.”\nWorkers of the world, unite — against “transphobia!” Who would have foreseen that one? Karl Marx, call your office.\nSome Democrats reading this will lash out at me, as the messenger. But I urge them to again carefully read the words I’m quoting. They come directly from the head of Communist Party USA, a man who is the successor to Gus Hall, to Earl Browder, to William Z. Foster, writing in the house organ of CPUSA, People’s World, successor to theDaily Worker. I ask Democrats: Does it not concern you that your no. 2 for the presidential nomination so fires up these literal communists? Does that not bother you?\nUnfortunately, I fear that many of today’s Democrats could care less, especially the Bernie millennials educated into pro-socialist imbecility by our public schools and universities. As one reader of The American Spectator put it after reading my previous post on Bernie, “I informed my son, now over 40, that Bernie was a Communist. He replied ‘so what!”\nIndeed, the Sanders campaign could mass-produce bumper stickers boldly touting “Bolsheviks for Bernie” sandwiched between grinning faces of Marx and Lenin and our contemporary products of the American university would shrug and cheer.\nReturning to the appraisal of Communist Party USA, John Bachtell finished with this: “A political revolution will help establish the foundations for a real people’s party, whether it results in a breakaway from or a takeover of the Democratic Party. Regardless of whether Sanders wins or not, the politics of the nation will never be the same and the fight for a political revolution will continue.”\nThere we are, ladies and gentlemen. The new political revolution that “will continue” must come either with a breakaway from the Democratic Party or with a “takeover of the Democratic Party.” Once upon a time in America, it seemed it could have only come with a breakaway. But now, in the Obama-Bernie America, a takeover of the Democrats has greater promise than ever. Just ask the literal millions of modern Democrats pulling the lever for a 74-year-old socialist as their next president. And just ask Bernie Sanders’ advocates in Communist Party USA. They, too, feel the Bern.","url":"https://spectator.org/communist-party-feels-the-bern/"}
