{"authors":["John Hayward"],"date_download":"2018-10-30 20:50:14","date_modify":"2018-10-30 20:50:14","date_publish":"2015-08-31 12:49:59","description":"Communists think lying people in order to maintain power and further their righteous agenda is not only acceptable, but required.","filename":"data/vaneerConsumption/CommunistsSwindledChinasWorkingPoorWithStockPropaganda.json","image_url":"https://media.breitbart.com/media/2015/08/ap_ap-photo1329-e1440501596327.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_31__1540932614.html","title":"Communists Swindled China's Working Poor With Stock Propaganda","title_page":"Communists Swindled China's Working Poor With Stock Propaganda | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"One of the important lessons to take away from China’s stock market crash is a lesson nobody on Earth should need repeated: communists lie. Collectivists of every stripe devoutly believe that lying to the people in order to maintain power and further their righteous agenda is not only acceptable, but required.\nKnowledge is dangerous. Who knows what the Little People might do, if they have too much of it? Better to give them the illusion of freedom, and manipulate their choices by controlling the flow of information.\nThe Washington Post ran a heartbreaking story over the weekend about how China’s stock market crash wiped out small investors – poor farmers who wanted a taste of the good life that has been largely restricted to city-dwelling elites, and believed their government when it told them to invest their meager savings in the sure-fire success of the stock market.\nThis spring, the country was gripped by stock fever, a frenzy of borrowing and buying that saw Chinese markets soar to historic heights, drawing in tens of millions of first-time investors, including dozens of people in this northern Chinese village. The rally was bolstered by rah-rah editorials in the state-controlled press. Invoking President Xi Jinping’s vision for a powerful and prosperous China, the People’s Daily called rising stock prices “carriers of the China dream.” When the benchmark index hit 4000 points, an editorial in the same party flagship promised it was “just the beginning” of the bull run. But the bulls would soon retreat, taking with them that official confidence. After trying — and failing — to prop up the market through July, the state has faded from view. The morning after “Black Monday,” the 8.5 percent slide that sent global markets sinking this past week, the People’s Daily led with a rosy report on Tibet. Now investors across the country are left wondering how what seemed like a sure thing so quickly turned into a suck on their life savings — and what the party leaders many trust might do about it.\nThe story includes sad vignettes from Nanliu, once the postcard example of a booming, rapidly modernizing China where even rural villagers could spend their afternoon buzzing about hot regime-endorsed stock picks instead of playing mahjong. The village chief became the town’s investment advisor. Hardscrabble farmers poured their life savings into the market… and then borrowed from relatives to invest even more.\nTheir money vanished in a matter of hours when the market plunged…. and some of the farmers lost even more by trusting propaganda from Beijing that “hostile foreign forces” were causing the market crisis, so “patriotic” investors should keep their chips on the table instead of cutting their losses and getting out. As one of the messages beamed at these poor folks put it, “Win glory for the country, even if you lose the last penny.”\nNow the high-rolling market-savvy village chief has disappeared, and the farmers are mostly back in the fields… although for many, as the Post puts it, “the taste of fast money has been hard to forget.”\nLike many around the world who have been taken for a ride by confidence men, they want to play again, and this time they’re certain they’ll win. Several of the farmers quoted in the article expressed unshaken confidence in Beijing’s wisdom – which is, of course, mandatory for good and “patriotic” citizens. The inability to admit mistakes and learn from pain remains a defining attribute of government-corporate fusions around the world.","url":"https://www.breitbart.com/politics/2015/08/31/communists-swindled-chinas-working-poor-with-stock-propaganda/"}
