{"authors":["Alanna Bennett"],"date_download":"2018-10-30 22:38:59","date_modify":"2018-10-30 22:38:59","date_publish":"2014-08-14 20:46:51","description":"Myspace has yet to resurrect Mixology, so the initial can of worms Yahoo opened when it brought Community back from the brink of nonexistence seems to be relatively safe, for now. And now that the \"Huh???\"s have passed, Yahoo and Community can get…","filename":"data/vaneerConsumption/CommunitySeason6TeaserHasYahooBraggingAboutSavingtheShowVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f8efb1b1-6a2b-4a4e-8110-4105767ed44b.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35836-community-season-6-teaser-has-yahoo-bragging-about-saving-the-show-video_1540939139.html","title":"'Community' Season 6 Teaser Has Yahoo Bragging About Saving the Show - VIDEO","title_page":"'Community' Season 6 Teaser Has Yahoo Bragging About Saving the Show — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Myspace has yet to resurrect Mixology, so the initial can of worms Yahoo opened when it brought Community back from the brink of nonexistence seems to be relatively safe, for now. And now that the \"Huh???\"s have passed, Yahoo and Community can get back to their mission statement: Making more Community. Hence this new teaser for Community Season 6.\nUnless I missed something, this new teaser doesn't seem to include any actual footage from Community's sixth season, but that's OK: All Community's loyal audience needs at this juncture is the continued reassurance that new footage actually will happen.\nAnd Yahoo makes a good (albeit obvious) tactical decision here: It makes use of footage from Community's cult classic history, from the paintball episode to Troy and Abed's epic bromance. It also uses Community's \"darkest timeline\" but as a means through which to introduce its new, not-dark timeline — alongside voice-overs of The Six Million Dollar Man's words: \"We can rebuild it.\" As they continue, they tailor it to Community itself: \"We have the ability to make the world's first bionic show.\"\nSo we've got the promise of new Community. Now they've just gotta deliver.","url":"https://www.bustle.com/articles/35836-community-season-6-teaser-has-yahoo-bragging-about-saving-the-show-video"}
