{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 03:07:41","date_modify":"2018-10-23 03:07:41","date_publish":"2017-03-16 13:50:36","description":"A woman told the Old Bailey how she tried to save the life of 16 week old Imani Wiltshire aboard a London bus. Rosalin Baker, 25, and Jeffrey Wiltshire, 52, are on trial accused of her murder.","filename":"data/vaneerConsumption/Commuterweepsrecallstryingtosavebabyslifeonbus.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E547AEC00000578-0-image-a-107_1489672786989.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320274_Commuter-weeps-recalls-trying-save-baby-s-life-bus_1540264061.html","title":"Commuter weeps recalls trying to save baby's life on bus","title_page":"Commuter weeps recalls trying to save baby's life on bus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young commuter wept in court as she told how she desperately tried in vain to save the life of a baby on a bus as the mother sat 'relaxed' while holding her mobile phone.\nThe parents of 16-week-old Imani Wiltshire are on trial at the Old Bailey accused of murdering their daughter then trying to cover it up by staging her death in public.\nRosalin Baker, 25, was given the 'thumbs-up' by her boyfriend Jeffrey Wiltshire, 52, as she boarded a double decker with their baby in a sling on the morning of September 28 last year, the court heard.\nRosalin Baker, 25, is on trial at the Old Bailey accused of murdering her 16-week-old daughter, Imani\nBaker was given the 'thumbs-up' by her boyfriend Jeffrey Wiltshire, 52, as she boarded a bus with their baby in a sling on the morning of September 28 last year. Pictured, a court sketch of the pair\nIt wasn't until mid-way through her journey to Ilford on the number 25, in Stratford Town Centre, that Baker raised the alarm that something was wrong with the child.\nImani, who had been born prematurely at 28 weeks, was rushed to hospital, but she had already died from a fractured skull and brain injuries caused by her being thrown against the floor or a wall, jurors heard.\nShe had also suffered a fractured wrist as a result of her arm being pulled or twisted, and at least 40 rib fractures, allegedly caused by her chest being squeezed as the her tiny body was shaken, the court heard.\nFjoralba Shmitz was listening to music on her earphones as she got on the bus and sat down on the lower deck behind Baker on her way to work.\nShe became aware of the mother when she gestured to her to come over while talking on her mobile phone.\nMs Shmitz said: 'I believe she was on the phone. She said \"there's something wrong with my baby\".\n'I saw the baby's face. I touched her left cheek. It was cold. I straight away tried to take the baby out of the sling.\n'I took the baby and I laid her down on the bus seat. The baby was not breathing. I tried to help but I didn't manage to do so. The baby had lips that were cold.'\nFjoralba Shmitz was listening to music on her earphones as she got on the number 25 and sat down on the lower deck behind Baker on her way to work\nMs Shmitz, who gave evidence via an Italian interpreter, said the child's eyes were closed and she had a blue bruise under one eye.\nWeeping, she went on: 'I became distressed because the baby was there not moving. The mother was sitting there and did not have any reaction.\n'At a certain point, I took the child in my arms. I went up to the bus driver and asked him to call the police and the ambulance.\n'I thought that the baby was dead. I took the baby back to the bus seat and a lady - a think she was Spanish - started praying.\n'I think someone spoke to the ambulance but I was in so much shock that I cannot remember.'\nProsecutor Duncan Atkinson QC asked: 'During the process of first you and others trying to help the baby, what was the lady you thought was the mother doing?'\nThe witness replied: 'She did not have any reaction. She was not crying, she was not shouting, she was not speaking and there were other passengers on the bus too who were asking if it was my son.'\nBaker is on trial at the Old Bailey accused of murdering her daughter then trying to cover it up by staging her death in public\nCross examining, Icah Peart QC said: 'This is obviously a very shocking and distressing episode for you, but right from the very start, is it correct that the mother of the child appeared to be completely detached from what was happening to her child?'\nMs Shmitz replied: 'A detached person does not stay on the phone in her hand when her daughter is not being well. I believe when I was sitting down and she made a sign, she was on the phone to someone, so I don't know. As far as I'm concerned, she seemed very relaxed.'\nParamedic Anthony Steadman said that in 18 years on the job, he had never seen a parent react the way Baker had their dead or dying child.\nHe told the court: 'The mother said the baby had been crying some 10 minutes before, but the jaw was stiff and her tongue was blue. She appeared to have been dead for sometime.\n'The mother displayed no emotion, there were no questions asked. But before we transported her she wanted to swap her mobile phone with her sister.\n'She was very vocal. She wasn't prepared to leave until she had done that. I had never seen that reaction from a parent before - she lacked emotion and appeared to be disengaged from what was happening.\n'From my impression, she seemed cold - the only emotion she showed was when we said we were going to leave the scene. Then she was very vocal until she had swapped her mobile phone with her sister.'\nParamedics reported that Imani had been very cold when they reached her, and it had been very difficult to intubate her because rigor mortis had set in.\nParamedic Lyndon Ashurst described Baker as 'quiet': 'She was very quiet - which was a little bit unusual. She wasn't really interacting with us.\n'The mum seemed disengaged. She wasn't behaving like someone normally would as far as you would expect as far as when their baby was unwell.'\nProsecutor Duncan Atkinson QC said: 'The injuries after Imani had died, when inflicted, would have caused Imani very significant pain and distress.\n'Yet in that last week neither parent sought to get Imani immediate medical help, or to prevent the later incidents of violence from occurring.'\nBaker and Wiltshire were both arrested on the afternoon of 28 September after doctors raised concerns about their baby's injuries.\nMr Atkinson said they each lied to police and denied Wiltshire was Imani's father.\nThey also denied they had been together in the period before their baby's death and the night before, jurors heard.\nBut the prosecutor said: 'These defendants are the only realistic candidates for having caused the injuries from which Imani died.\n'If they were not both responsible for the infliction of injury, at least one of them failed to intervene when the other did.'\nThe couple, of Newham, east London, deny murder and causing or allowing the death of their child.\nThe trial continues.","url":"https://www.dailymail.co.uk/news/article-4320274/Commuter-weeps-recalls-trying-save-baby-s-life-bus.html"}
