{"authors":[],"date_download":"2018-10-22 21:14:32","date_modify":"2018-10-22 21:14:32","date_publish":"2014-06-04 00:00:00","description":"NBC News","filename":"data/vaneerConsumption/Commentary3MythsaboutTechnologysRoleinEducation.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/487351/school_technology_60af2f32a7035fabc6396d4568af99f3.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_education-nation_commentary-3-myths-about-technologys-role-education-n122526_1540242872.html","title":"Commentary: 3 Myths about Technology's Role in Education","title_page":"Commentary: 3 Myths about Technology's Role in Education - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"There is a lot of buzz around technology's role in education. Unfortunately, most of these conversations are missing the mark – honing in on ed-tech financing or the “technology gap.”\nWhat follows are three common myths surrounding technology’s purpose in the education system and ways to address these myths to help improve innovation, adoption and student outcomes.\nMyth #1: It’s all about disruption.\nOne of the biggest problems surrounding technology in education is that new developments and products are often over-hyped, due to the thought that technology should immediately “disrupt” current operations. This sensationalism frames new technology as a cure all to improve processes and outcomes, but then fails to offer actionable steps for schools to implement and integrate that technology into existing practices.\nInstead, technology should be approached as part of the solution. One should consider how digital tools can make a realistic, sustainable impact on the education system. School districts should focus on tools that improve the current experience and process, that are easily used and integrated seamlessly. One great example of this is Unity High School in Oakland, CA. They have integrated Khan Academy’s online videos into their Algebra 1 curriculum to create a blended learning program.\nThe over-promise, under-deliver model often ends up making schools, administrators and teachers skeptical about embracing new technologies, even the ones that add definitive value. By shifting our mindset, we can bridge the gap between hype and reality.\nMyth #2: It’s all about the classroom.\nAnother common misconception is that “technology in education” only refers to digital classroom tools, or software that helps improve educators’ teaching abilities, enhances the actual learning process or helps students become more tech-savvy. While such tools are important to our education system, technology can make an impact long before and after a lesson.\nThere are a variety of resources that help schools save time and money in their day-to-day operations. For example, successful districts are considering buying hiring software to help them ensure they are hiring the best teachers to impact student achievement efficiently and cost-effectively. Digital tools can also help improve and customize professional development for teachers. And behind the scenes, new cloud computing and analytic systems are improving district’s data storage for materials including student attendance records, grades and individual student information.\nMyth #3: It’s all about … well … technology.\nAny conversation about technology must acknowledge the reality that technology itself is not a cure all. Even the greatest ed-tech tools are ineffective if we don’t have great teachers to utilize them. Research has shown time and time again that teacher quality remains the most important school-based factor for student achievement. While considering all education technology solutions, we must remember that it is our educators who matter most and make the biggest difference. Every software or hardware purchase should be made with one end goal, to positively impact student achievement.","url":"https://www.nbcnews.com/feature/education-nation/commentary-3-myths-about-technologys-role-education-n122526"}
