{"authors":["Meghan Walsh"],"date_download":"2018-10-23 01:00:29","date_modify":"2018-10-23 01:00:29","date_publish":"2014-12-11 00:00:00","description":"A study tracking grads from Washington state's schools found those who completed programs longer than a year had more pay and steadier work — especially in health care, technology and skilled labor.","filename":"data/vaneerConsumption/CommunityCollegeProgramsCanLeadToBigPayoffsInTheRightFields.json","image_url":"https://media.npr.org/assets/img/2014/12/11/34606741_h31626750_wide-6a5a650786629db642797aa6cd45b7a3facc63b8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ed_2014_12_11_370045065_community-college-programs-can-lead-to-big-payoffs-in-the-right-fields_1540256429.html","title":"Community College Programs Can Lead To Big Payoffs - In The Right Fields","title_page":"Community College Programs Can Lead To Big Payoffs — In The Right Fields : NPR Ed : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Community College Programs Can Lead To Big Payoffs — In The Right Fields\nEnlarge this image toggle caption Zach Gibson/MLive.com/Landov Zach Gibson/MLive.com/Landov\nWhen it comes to higher education, we've all heard the talking points: More people than ever are pursuing four-year degrees — despite skyrocketing tuition costs — because they don't have many other choices if they want to be competitive in the workforce.\nBut new research suggests that some community college degrees, which are much less expensive, can significantly increase a student's potential income.\nEnlarge this image toggle caption Matt Rourke/AP Matt Rourke/AP\nAnalyzing seven years of post-graduation data from more than 20,000 students who attended Washington state's 34 community and technical colleges, researchers from Columbia University and the Career Ladders Project in Oakland, Calif., found that programs that take more than a year to complete lead to better employment odds and higher wages — sometimes even more so than a bachelor's degree.\nThere has been scarce research on community colleges, says Mina Dadgar, one of the study's lead authors and director of research at the Career Ladders Project, leading to the assumption that the schools are less valuable than they really are. The fact that many associate degrees, particularly in humanities, are meant only to get students in the door at four-year colleges and thus aren't useful by standard measures also undermines community colleges' reputations.\nIn more practical fields, though — including health care, technology and skilled labor — students with community college credentials can make their way into the workforce and immediately start earning salaries above $50,000 according to the U.S. Bureau of Labor Statistics.\n\"This is an affordable investment,\" Dadgar says. \"For many students, community colleges are a way to earn a family-supporting wage, but we don't really think of them that way.\"\nWomen in particular benefit from the programs, receiving as much as 15 percent higher wages than women who dropped out of four-year colleges.\nBut students do need to invest some time to get those returns. Short-term certificates, which take less than a year to pursue, don't lead to significant economic return, the study found — unless they're combined with deliberate foresight about what comes next.\nGrading Community Colleges, 5 Years Into Obama Improvement Efforts Grading Community Colleges, 5 Years Into Obama Improvement Efforts Download · 6:48 6:48\n\"The challenge is, many credentials are not well thought through,\" says James Stone, director of the National Research Center for Career & Technical Education. \"They're dead ends.\"\nBoth Stone, who had no affiliation with the study, and Dadgar stressed two main points: First, policymakers need to start making it so that short-term certificates can build off one another. And second, high school counselors — who, they say, for the most part promote only the four-year track — need to use these data to present community college as a legitimate option for students.\n\"We still have this belief that the four-year college is the only pathway,\" Stone says. \"This is the perfect time to promote these opportunities.\"\n(The study, which was published by the American Educational Research Association, was funded by the Bill and Melinda Gates Foundation, a prominent donor to NPR.)","url":"https://www.npr.org/sections/ed/2014/12/11/370045065/community-college-programs-can-lead-to-big-payoffs-in-the-right-fields"}
