{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:43:39","date_modify":"2018-10-30 18:43:39","date_publish":"2014-06-05 14:12:00","description":"While thousands of people from across the nation are urging Oklahoma Gov. Mary Fallin (R) to sign her state's Common Core repeal bill, Oklahoma Business |","filename":"data/vaneerConsumption/CommonCoreProponentsUrgeOKGovFallinNottoSignCommonCoreRepeal.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2013/Education/empty_classroom_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_06_05__1540925019.html","title":"Common Core Proponents Urge OK Gov. Fallin Not to Sign Common Core Repeal","title_page":"Common Core Proponents Urge OK Gov. Fallin Not to Sign Common Core Repeal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"While thousands of people from across the nation are urging Oklahoma Gov. Mary Fallin (R) to sign her state’s Common Core repeal bill, Oklahoma Business and Education Coalition executive director Phyllis Hudecki and Michael Brickman, national policy advisor of the Gates-funded Fordham Institute, released on Monday a report titled “Impact Analysis: Six Reasons Why HB 3399 Is Bad Policy.”\nIn the report, the two ardent Common Core supporters argue that by repealing the Common Core standards, Oklahoma would incur costs of over $125 million, or nearly $200 for each of the state’s 620,000 students.\n“Reverting back to the state’s prior standards would nullify the progress that has been made and carry significant fiscal and educational costs, which have gone largely unspoken in the current debate,” the authors write.\nThe figure conjured up by Brickman and Hudecki, a former Fallin-appointed state Secretary of Education, is nowhere near the $1.24 million number arrived at by the Oklahoma Department of Education.\n“For one, withdrawing from Common Core could cost Oklahoma its waiver from the No Child Left Behind Act, may cause the state to forfeit control of about $27 million of federal funding,” they write. “That would put greater control in the hands of federal authorities and could result in sanctions for hundreds of Oklahoma schools.”\nHowever, as Dr. Sandra Stotsky, nationally renowned standards expert who was invited to be a member of the Common Core Validation Committee, wrote at Breitbart News in March:\nIf a state obtained a waiver from some aspects of No Child Left Behind (NCLB) and now seeks to opt out of using Common Core’s standards and tests aligned to or based on them, it is highly unlikely to lose Title I money. Title I is implicated in the Common Core issue only because the state committed to the CCLS [Common Core Learning Standards] to obtain the waiver. If the state applies for an extension of the waiver through the 2015-2016 school year, it would need to replace its commitment to implement the Common Core with a commitment to implement alternative standards approved by its institutions of higher education (IHEs). IHE approval of more demanding “college- and career-ready” standards would allow the state to retain the waiver, without penalty. Legislators need to ask their public IHEs to approve standards that enable mathematically and scientifically ambitious high school students to take STEM-preparatory coursework while in high school, not in transition courses elsewhere after high school graduation or after passing a GED test. If the US Department of Education (USED) decided to be punitive, it could withhold at most only 5%-10% of the 1% of Title I funds set aside for state administrative functions. For example, if a state received $200 million under Title I, the administrative set-aside is $2 million. The most severe federal punishment would be 5-10% of that, or a maximum of $200K.\nWhat is incredible about Hudecki’s and Brickman’s claim of the costs to Oklahoma for repealing Common Core is the fact that the standards’ promoters have never provided costs to states for adopting Common Core. As more states have left the test consortia, how do the ones remaining know how much it will cost them to participate in the Common Core assessments?\nJenni White, president of Restore Oklahoma Public Education (R.O.P.E.) observes:\nIn fact, that’s been one of opponents largest concerns – how much will this cost. The National Conference of State Legislators doesn’t know. Governing magazine doesn’t know. In fact, even Oklahoma’s own legislators couldn’t have known what it would cost to implement the CCSS because they were passed into state law before they were even fully written and prepared for public view. You can’t estimate costs of an initiative for which you’re not fully familiar, but now we’re going to cry foul on costs?\nHudecki and Brickman warn Fallin that a repeal of Common Core could cause a “shortsighted political takeover” when the Oklahoma state legislature – the citizens’ elected representatives – oversees the development of the state’s new standards.\nSuch a move “opens the door to politicization of education policy,” argue the report’s authors.\nIronically, the authors don’t consider the fact that 45 states adopted the Common Core standards, sight unseen and with no evidence of their validity, in order to compete for Race to the Top federal stimulus funds and waivers from No Child Left Behind. It’s hard to imagine anything more “shortsighted” or “politicized” than that reality.\nHudecki and Brickman note that, in its Gates-funded evaluation of state standards throughout the country, the Fordham Institute found that Oklahoma’s PASS standards were found to be “on par” with Common Core. However, the authors degrade Oklahoma’s PASS standards since Fordham’s evaluation of them doesn’t fit in with their argument.\nHerein lies the problem: where are non-Gates-funded studies that provide solid evidence of the so-called “rigor” of the Common Core standards?\nZe’ev Wurman, visiting scholar at the Hoover Institution and author of the Pioneer Institute report, “Common Core’s Validation: A Weak Foundation for a Crooked House,” demonstrated the shoddy research that was performed by Common Core Validation Committee members who signed off on the standards. In the pro-Common Core studies Wurman examined, he found the research had been poorly executed and failed to provide evidence that the standards are internationally competitive and reflective of college-readiness.\nSimilarly, the 2014 Brown Center report by the Brookings Institution found that the Common Core standards will have “little to no impact on student achievement.”\nFor two individuals who are concerned about the “politicization” of education, Hudecki and Brickman actually seem obsessed with politics. The last three points they make to urge Fallin not to sign the Common Core repeal bill are all about politics.\nThe authors assert that if Fallin refuses to sign the Common Core repeal bill, she will “demonstrate political courage,” just like other Republican governors such as Jan Brewer (AZ), who simply “rebranded” Common Core, Chris Christie (NJ), and Bill Haslam (TN), who has promoted Common Core alongside Jeb Bush and Tennessee U.S. Sen. Lamar Alexander.\nHudecki and Brickman claim, “Much of the momentum to abandon the Common Core is politically driven,” as if the unholy alliance of big government, education, corporate elitists supporting Common Core is not political.\nLastly, the Common Core supporters tell Fallin that if she signs the Common Core repeal bill, “opponents will not be satisfied.”\nUsing Gov. Mike Pence’s decision to simply “rebrand” the Common Core standards as an example of a situation in which “critics will not be appeased by repeal” is clearly a purposeful distortion of the truth.\nWhat Hudecki and Brickman show the nation in their “report” is that Oklahoma’s repeal bill is the real deal. Oklahoma’s bill would revert the state to its former Priority Academic Student Skills (PASS) standards while it creates new standards within the next two years. The new standards must be proven to be sufficiently unlike Common Core before they can be enacted. And that is no “rebrand.”","url":"https://www.breitbart.com/politics/2014/06/05/pro-common-core-leaders-concoct-costs-to-oklahoma-to-urge-fallin-not-to-sign-common-core-repeal/"}
