{"authors":["John Hayward"],"date_download":"2018-10-30 21:36:03","date_modify":"2018-10-30 21:36:03","date_publish":"2015-08-14 13:50:16","description":"There is, no doubt, a fascinating story behind how Hillary Clinton chose this particular outfit for her server management needs","filename":"data/vaneerConsumption/CompanyThatHandledHillaryClintonsServerSued.json","image_url":"https://media.breitbart.com/media/2015/07/Hillary-Clinton-house-party-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_14__1540935363.html","title":"Company That Handled Hillary Clinton's Server Sued","title_page":"Company That Handled Hillary Clinton's Server Sued | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"We’ll be hearing a lot more in the days to come about Platte River Networks, the tiny computer company in Denver, Colorado that Hillary Clinton improbably chose to manage the illicit “home-brewed” server she stashed in the basement of her vast estate in Chappaqua, New York.\nThe FBI reportedly visited the company’s Denver office earlier this week, but neither the Bureau nor company officials was willing to discuss what transpired during the visit. The best CBS News in Denver could do, by way of background reporting, was chat with a computer-science professor who observed that there were “questions about what security protocols were in place,” and mildly observed that Platte River Networks did not seem like “the best choice” for handling the secret personal server of the Secretary of State and her top aides, which we now know was processing classified and top-secret information, contrary to months of false denials from Hillary Clinton and her mouthpieces.\nThere is, no doubt, a fascinating story behind how Clinton chose this particular outfit for her server management needs. They do seem to be extraordinarily skilled at wiping hard drives without making backup copies of subpoenaed information, which would certainly have caught Clinton’s eye while she was leafing through their sales brochure.\nWere employees of Platte River cleared to handle the top-secret information Clinton was handling? Did they have experience and training at securing a system that would have been one of the top targets in the world for hackers – and not just freelance troublemakers, but skilled espionage agents working for foreign governments? Were the interactions of company representatives with Clinton’s server logged as carefully as State Department IT specialists would have been? Was the company careful and disciplined enough to handle such a sensitive assignment?\nA clue to the latter question is provided by a strange incident that occurred after Clinton departed as Secretary of State, resulting in a lawsuit being filed against Platte River last year. As chronicled by the UK Daily Mail, the computer company was sued by a telecommunications firm, T2 Communications, for its role in illegally accessing the master database of all U.S. telephone numbers, and using that information to improperly seize control of 390 phone lines… including some used by the White House and Defense Department.\nT2 alleges that it had provided 16 phone lines to an insurance broker called Cambridge until they decided to switch providers and signed up with Windstream Communications, who worked with McLeod USA, a local exchange carrier owned by Windstream, and Platte River. But instead of taking over the 16 lines, T2 claims that the companies asked for 390 more lines in what they called ‘intentional misappropriation’. T2 alleges that they did this by illegally accessing the database for the Number Portability Administration Centre, the master agency which manages all US phone numbers. The lawsuit states: ‘Under NPAC regulations, telecommunications providers are only allowed to access the NPAC data base for the exclusive purpose of routing, rating of calls, billing of calls, or performing maintenance in connection with the provision of telecommunications services. ‘Contrary to these NPAC regulations, Defendants accessed the NPAC database to find T2s 390 telephone lines as well as to obtain T2 and its customers’ proprietary network information for use in marketing T2’s lines to their existing and prospective customers.’ The lawsuit describes at length the chaos that resulted when the 390 numbers used by T2 customers suddenly stopped working. T2 employees’ numbers also stopped working as did lines for: ‘The Department of Defense, Department of Energy; multiple medical emergency facilities as numbers used for general, pre- and post-surgical contact, and obstetric or gynecological emergencies; Federal Contract Support Desks; White House Military Operations support desks, several financial institution’s main telephone numbers, multiple Denver-based Charter schools’ main and backdoor phone numbers, a US-Based telephone number for IBM China, multiple other information technology companies and their support and internal telephone numbers, as well as T2’s main telephone numbers’. The lawsuit states that the lines were dead for at least 21 hours and that it took the company at least 10 days to ‘unwind’ the mess and get the numbers back.\nThey knocked out the number people would have called to report that their phones weren’t working? What a fun couple of weeks that must have been.\nPlatte River’s role in all of this, according to the lawsuit, involved “spotting any red flags” and “resolving any inaccuracies” with the deal. The suit says Hillary’s computer company “acted negligently and breached this duty by failing to identify that the 390 additional lines were improper.”\nThat’s not very reassuring, when their previous job involved fending off every spy agency in the world from the email server Hillary Clinton wasn’t supposed to be using.","url":"https://www.breitbart.com/politics/2015/08/14/company-that-handled-hillary-clintons-server-sued/"}
