{"authors":["Ted Thornhill For Mailonline"],"date_download":"2018-10-23 04:14:20","date_modify":"2018-10-23 04:14:20","date_publish":"2017-04-26 15:56:15","description":"The Greek Islands, Cyprus and Turkey – all dream destinations. And here’s your chance to win a £1,500 voucher so that you can explore these wonderful destinations with Manos holidays.","filename":"data/vaneerConsumption/COMPETITIONWina1500ThomasCookholidayvoucher.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F9FABEF00000578-0-image-a-4_1493218540802.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4448176_COMPETITION-Win-1-500-Thomas-Cook-holiday-voucher_1540268060.html","title":"COMPETITION: Win a £1,500 Thomas Cook holiday voucher","title_page":"COMPETITION: Win a £1,500 Thomas Cook holiday voucher  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Greek Islands, Cyprus and Turkey – all dream destinations.\nAnd here’s your chance to win a £1,500 voucher so that you can explore these wonderful destinations with Manos holidays.\nFor over 50 years Manos, part of the Thomas Cook group, has been helping travellers explore the beauty and diversity of the Eastern Mediterranean.\nFor over 50 years Manos, part of the Thomas Cook group, has been helping travellers explore the beauty and diversity of the Eastern Mediterranean. Pictured is Mykonos, one of the destinations you can explore with the firm\nIts passion started with experiencing the authentic sounds, sights and tastes of Greece and its beautiful islands.\nNow it’s spreading its wings.\nFor summer 2018 it’s introducing Turkey and Cyprus to its portfolio, so there’s now even more to discover.\nManos offers holidays that focus on small, local-run hotels to suit your needs and budget.\nFor summer 2018 Manos is introducing Turkey, pictured, and Cyprus to its portfolio, so there’s now even more to discover\nAnd from summer 2018, all Manos bookings will be covered by Thomas Cook’s ‘24 Hour Hotel Satisfaction Promise’.\nSo now is the perfect time to start thinking differently about your next holiday and consider something truly authentic.","url":"https://www.dailymail.co.uk/travel/travel_news/article-4448176/COMPETITION-Win-1-500-Thomas-Cook-holiday-voucher.html"}
