{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:28","date_modify":"2018-10-30 22:13:28","date_publish":"2016-07-06 15:29:29","description":"Jerry Brown signed a ban on rifles with \"bullet buttons,\" among other California gun laws, but an inventor has found a new way around it.","filename":"data/vaneerConsumption/CompanyInventsDevicetoDefyCaliforniaGunLaws.json","image_url":"https://media.breitbart.com/media/2016/07/Screen-Shot-2016-07-06-at-8.26.21-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_07_06__1540937608.html","title":"Company Invents Device to Defy California Gun Laws","title_page":"Company Invents Device to Defy California Gun Laws","title_rss":"NULL","source_domain":"breitbart.com","text":"Just days after Governor Jerry Brown signed an “assault weapons” ban on rifles with “bullet buttons,” among other California gun laws, the inventor of the button has introduced the “Patriot Mag Release,” a device that makes even the AR-15 California-compliant.\nFor starters, the “bullet button” is simply a magazine release that the gun owner suppresses with a sharp or pointed object — often the tip of a bullet. Democrats argued that having such a release allows criminals to reload too quickly, and therefore banned it for law-abiding citizens. Brown signed the ban into law on July 1.\nBut on July 5, the inventor of the “bullet button” introduced the “Patriot Mag Release,” a.k.a. “Bullet Button Reloaded.”\nAccording to Vocativ, the inventor’s company, Bullet Button, began selling the new mag releases on Tuesday. And the biggest difference between the method of the new release versus the classic version is that the new method literally requires the gun to be partially taken down before the magazine will come out.\nThat sounds self-defeating at first. However, the parts supplied with the release make partial take-down and re-assembly a very simple and quick procedure.\nThe “Patriot Mag Release” works with AR-15s and AK-47s, and can also work with AR-10s (with some extra tweaking/added adjustment).\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/07/06/california-gun-laws-patriot-mag-release/"}
