{"authors":["Katie Amey For Mailonline"],"date_download":"2018-10-23 00:01:04","date_modify":"2018-10-23 00:01:04","date_publish":"2016-01-11 08:16:41","description":"Former Concorde flight attendant and author Sally Armstrong spoke to MailOnline Travel about her experiences on board the most elite passenger jet in the world.","filename":"data/vaneerConsumption/ConcordeflightattendantrecallsdaysonboardwithElizabethTaylor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/30064CF500000578-0-image-a-2_1452501322185.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3390373_Flight-attendant-recalls-star-studded-days-board-Concorde-John-Denver-Elizabeth-Taylor_1540252864.html","title":"Concorde flight attendant recalls days on board with Elizabeth Taylor","title_page":"Concorde flight attendant recalls days on board with Elizabeth Taylor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Few professions are as cloaked in mystique and glamour as that of a flight attendant - especially when one's career path includes eight years of experience on board a British Airways Concorde.\nFrom A-list Hollywood actors to royal family members and billionaire CEOs, everyone whose anyone has flown on the world's most iconic plane.\nSally Armstrong, former flight attendant and author, spoke to MailOnline Travel in honour of the upcoming 40th anniversary of the Concorde's first scheduled flight, to discuss her most surreal experiences... such as the time Dame Elizabeth Taylor lent her her jewels.\nFormer flight attendant Sally Armstrong is pictured here in Nice after having acted as crew on the Royal Arab charter\nSally Armstrong recalled her experiences flying on board the world's most elite plane, the Concorde, in her new book\nInitially trained as a teacher, Armstrong first became interested in a career change after her flatmate - also an airline stewardess - came home to London from Nairobi on one very grey November day.\n'My flatmate had just arrived back and had a huge basket of beautiful fruits, a great suntan and all those pretty bikinis hanging in the bathroom,' she recalls. 'I thought \"Hang on, there's a better life here.\" And that was the starting point.'\nArmstong worked on 747s for British Airways for seven years before landing the prestigious role on board the Concorde, where she gained unprecedented access to the world's most elite passengers.\n'It was everyday,' she remembers. 'Tom Cruise, Robert DeNiro, Paul McCartney - who, sadly, I didn't meet. They never took it for granted. It was always an adventure - even for the most well-travelled.'\nThe crew including senior pilot Jock Lowe and Dick Bell (cabin service director), at Mildenhall Air Show with the Red Arrows\nOne of Armstrong's most memorable encounters was with John Denver, who asked her to dinner in New York CIty\nDuring the Royal Arab charter flight, Armstrong - and all other flight attendants - had to wear white gloves\nAs a flight attendant, she was also privy to being wined and dined by some of the world's biggest stars.\n'I once met John Denver on a flight,' she told MailOnline Travel. 'He asked me if I went to New York City very often - I did - and he asked if I was planning to be there on the 13th of November. I said yes and he invited me to have dinner with him.\n'That particular day wound up being the first time that the Concorde ever got diverted - to NewarK - and we were two hours late getting in. I thought, \"Okay, I'm going to miss this hot date.\"\n'When I finally got to the hotel in New York City, I had two messages. I went to my room and got into bed and then the phone rang - it was John - asking where I was and telling me to meet him for dinner. I was dressed and up like a shot. He was the most charismatic person I've ever met.'\nArmstong said that one of the things she misses the most is working with such a tight-knit group of colleagues\nArmstrong also met Dame Elizabeth Taylor, who invited her to try on her 33-carat Krupp diamond ring\nHere, Armstrong and the rest of the crew are pictured on location having just completed a luxurious transfer\nAnother particularly memorable event occurred when Dame Elizabeth Taylor boarded one of Armstrong's transatlantic journeys.\nArmstrong said: 'She was one person I always wanted to meet - she was an icon - and she came on the aircraft one evening, and Michael Douglas was actually sitting opposite her.\n'I didn't want to stare at her, but the next time I came down the aisle, my colleague was speaking to her. She said, \"Miss Taylor, your ring is absolutely gorgeous.\"'\nIt turned out to be Krupp Diamond - the 33-carat diamond ring given to her by then-husband Richard Burton.\nArmstrong continued: 'She just slipped it off her finger and said, \"Girls, try it on, try it on.\" We went into the bathroom with the ring to try it on in front of the mirror. That's how she was - she was lovely.'\nDuring an unscheduled Concorde service to Glasgow, Armstrong was met with a red carpet and bagpipes\nAnother particularly rich passenger once purchased an additional seat for his briefcase - presumably, it contained more money than the flight's fare, Armstrong recalled\nDuring her seven-year Concorde career, Armstrong spent time with business magnates and even experienced a parallel landing stunt at the Philadelphia Airport in America.\nArmstrong said: 'We had two Concordes landing together on parallel runways and then taking off together. That would never have happened on any other fleet.'\nAmong her more memorable passengers, she cites one particularly wealthy man who brought his briefcase on board - and demanded that it be given its own seat.\n'We assumed it contained more money than the airfare,' she said.\nAnother man brought his falcon on the plane, where it sat on the flight deck in a cage.\n'If the plane had crashed, the last thing that would've been heard on the black box was the falcon squawking,' she added with a laugh.\nNow retired, Armstrong admits she has no desire to revisit her days of flying in what she calls the most 'elite club atmosphere'.\n'It was a life I lived when I was young and it is for young people because it is very demanding,' she explained. 'It was a period in my life that I loved but I wouldn’t say that I miss anything about it.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3390373/Flight-attendant-recalls-star-studded-days-board-Concorde-John-Denver-Elizabeth-Taylor.html"}
