{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:52:08","date_modify":"2018-10-30 20:52:08","date_publish":"2015-10-25 23:43:36","description":"Indianapolis Cajun restaurant Papa Roux was robbed, and the owner responded by announcing discount prices for concealed carry permit holders","filename":"data/vaneerConsumption/ConcealedPermitHoldersOfferedaDiscountAfterRestaurantIsRobbed.json","image_url":"https://media.breitbart.com/media/2015/10/papa-roux-cajun-restaurant-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_25__1540932728.html","title":"Concealed Permit Holders Offered a Discount After Restaurant Is Robbed","title_page":"Concealed Permit Holders Offered a Discount After Restaurant Is Robbed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 24, Indianapolis Cajun restaurant Papa Roux was robbed for the first time ever, and owner Art Bouvier responded by announcing a discount price for concealed carry permit holders in order to attract armed, law-abiding citizens to the restaurant.\nThe robbery occurred around 7:30 pm when a suspect entered the restaurant, claimed to be armed, and was given the money in the register. Bouvier said he had previously instructed his crew to hand the money over rather than risk their lives. And while Bouvier still believes the lives of his crew are more valuable than the money in the register, one change the robbery convinced him to make is in putting a greater emphasis on the benefit of armed, law-abiding citizens in and around his business.\nAccording to the Indianapolis Star, Bouvier announced the discount for concealed permit holders “shortly after learning of the robbery.” He used a Facebook post to say, “If thugs are going to come in and threaten OUR extended family with guns, you’d better believe I will use every trick I know to protect (our family).”\nHe said, “I don’t want Papa Roux to turn into the O.K. Corral, but I don’t want to be an easy target.”\nBouvier added that he has always been a supporter of Second Amendment rights, and for the foreseeable future, he wants to focus on the benefits of carrying concealed.\nBouvier said, “We’re not saying, ‘Show us your gun.’ But if you’re a legal and stable carrier of a concealed carry license, I’m going to reward that. To me, it’s common sense. And until further notice, you’ll get 25 percent off your bill.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/25/concealed-permit-holders-offered-discount-restaurant-robbed/"}
