{"authors":[],"date_download":"2018-10-22 20:40:08","date_modify":"2018-10-22 20:40:08","date_publish":"2014-05-02 21:14:21","description":"L.Condoms has launched a one-hour home delivery service in Manhattan for the lover in a hurry.","filename":"data/vaneerConsumption/CondomCompanyOffersOneHourHomeDeliveryServiceinManhattan.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/417461/1hrbanner-4_948b5cacd11c443d938a347b45382f87.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_condom-company-offers-one-hour-home-delivery-service-manhattan-n96031_1540240808.html","title":"Condom Company Offers One-Hour Home-Delivery Service in Manhattan","title_page":"Condom Company Offers One-Hour Home-Delivery Service in Manhattan","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn New York City, you can get just about anything delivered, from Thai food to mattresses.\nNow, for the lover in a hurry in the city that never sleeps, a bike messenger will bring safe sex to your door.\nL. Condoms, a company specializing in prophylactics made from natural latex with no chemicals added, just launched a one-hour condom delivery service in Manhattan. It already offers such a service in Los Angeles and San Francisco.\nFor $8 in New York, (it is $5 in L.A. and San Francisco) the products will be delivered in an unlabeled black box. The service is available through the website – thisisL.com.\nBut there is more to it than just convenience. The company was founded by Talia Frenkel, a photojournalist whose coverage of the effects of HIV/AIDS on women and girls inspired her to create a higher quality premium condom. Now for each one purchased, one will be donated to a developing country — particularly those in need of HIV/AIDS prevention tactics and education.\n-NBC News staff","url":"https://www.nbcnews.com/business/consumer/condom-company-offers-one-hour-home-delivery-service-manhattan-n96031"}
