{"authors":[],"date_download":"2018-10-22 20:45:50","date_modify":"2018-10-22 20:45:50","date_publish":"2014-05-03 13:30:15","description":"The former secretary of state decided against delivering the address at Rutgers University because she believed she would be a distraction.","filename":"data/vaneerConsumption/CondoleezzaRiceDropsOutofRutgersCommencementAfterProtests.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/417996/140503-condoleezza-rice-mn-945_e881334a7e32a4c53538c368b3690dca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_condoleezza-rice-drops-out-rutgers-commencement-after-protests-n96246_1540241150.html","title":"Condoleezza Rice Drops Out of Rutgers Commencement After Protests","title_page":"Condoleezza Rice Drops Out of Rutgers Commencement After Protests","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFormer Secretary of State Condoleezza Rice has decided against delivering the commencement address at Rutgers University following protests by some faculty and students over her role in the Iraq War.\nRice said in a statement Saturday that she informed Rutgers President Robert Barchi that she was declining the invitation.\n\"Commencement should be a time of joyous celebration for the graduates and their families,\" Rice said. \"Rutgers' invitation to me to speak has become a distraction for the university community at this very special time.\"\nThe school's board of governors had voted to pay the former secretary of state under President George W. Bush and national security adviser $35,000 for her appearance at the May 18 ceremony.\nRutgers officials later issued a statement saying they respect Rice's change of plans: \"While Rutgers University stands fully behind the invitation to Dr. Rice to be our commencement speaker and receive an honorary degree, we respect the decision she made and clearly articulated in her statement this morning.\"\nBut some students and faculty had protested, staging sit-ins and saying Rice bore some responsibility for the Iraq War as a member of the Bush administration. Barchi and other school leaders had resisted the calls to disinvite Rice, saying the university welcomes open discourse on controversial topics.\nIn her statement, Rice defended her record, saying that she was honored to serve her country and that she had \"defended America's belief in free speech and the exchange of ideas.\" But she said she didn't want to detract from the spirit of the commencement ceremony.\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/condoleezza-rice-drops-out-rutgers-commencement-after-protests-n96246"}
