{"authors":["Kenneth Dickerman","Photo Editor","Tara Wray"],"date_download":"2018-10-21 03:01:25","date_modify":"2018-10-21 03:01:25","date_publish":"2018-08-10 10:01:08","description":"An artist uses photography to sort through a bout of depression.","filename":"data/vaneerConsumption/Confrontingdepressionwithphotosthisartistsworksarekeenemotionalwitnessestothisbrokenworldofours.json","image_url":"https://www.washingtonpost.com/resizer/Nf-QoIp5oEpEceyFg76MwrAKX8I=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CV67QHD73QZP7KZAULOWMGSTOU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_10__1540090885.html","title":"Confronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’","title_page":"Confronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’ - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Tara Wray’s new book “Too Tired for Sunshine” (Yoffy Press, 2018) is beautifully melancholic. Wray took most of the photos in the book in Vermont during a period when she was experiencing a bout of depression. The subjects of the photos are not very remarkable on their own. But they are drenched in the emotions Wray was feeling as she made them, transforming them from potentially banal observations about everyday life into poignant vignettes about what it means to be alive.\nOn the Kickstarter page Wray set up to raise the funds needed to publish the book, she gives us more insight into the project. First, she addresses the title: What does “Too Tired for Sunshine” mean? She says it is “the experience of feeling so melancholy that not even a sunny day can raise your spirits.”\nWray’s book focuses on the kinds of things you would see every day living in the rural northeast, or as she says, “daily life and wanderings, the photographs in this work focus on unsettling subjects – backyard slaughterhouses, melancholic dogs, disrepair in various forms – as well as depictions of isolation in people, animals, and objects. Often I find myself photographing subjects that appear drastically out of place, seemingly devoid of context . . . making photographs and sharing them allows me to get outside of my head and connect more fully with the world around me. I hope this work will inspire others to discover a sense of unreality in their own world.”\nWhile many of the images in Wray’s book are clearly meditations on melancholy, there is whimsy too. Nestled in between the forlorn images are glimpses of humor. For example, as you are flipping past photos of empty diners and glum snowy landscapes, you will also encounter a smiling older woman sitting in a car with curlers in her hair, or a dog wearing what seems to be a snow suit. As Aimee Bender says in the introduction to the book, the images in the book, “become keen emotional witnesses to this broken world of ours.”\nYou can buy the book here or here.\n(Tara Wray/Yoffy Press)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nArtist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’\nFor these underprivileged young women in France, rugby provides strength, resilience and empowerment\nAn intimate, lyrical and poetic portrait of wrestling in Senegal","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/10/confronting-depression-with-photos-this-artists-work-is-a-keen-emotional-witnesses-to-this-broken-world-of-ours/"}
