{"authors":[],"date_download":"2018-10-23 00:41:34","date_modify":"2018-10-23 00:41:34","date_publish":"2017-03-10 07:33:09","description":"Mongolian courts banned them, human rights groups slammed them and the labour ministry demands they cease, but none of that has stopped Mongolia's...","filename":"data/vaneerConsumption/ConflictsofinterestkeepMongolianchildjockeysinthesaddle.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/07/wire-194551-1489131191-451_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300284_Conflicts-Mongolian-child-jockeys-saddle_1540255294.html","title":"Conflicts of interest keep Mongolian child jockeys in the saddle","title_page":"Conflicts of interest keep Mongolian child jockeys in the saddle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In Mongolia court bans and criticism from human rights groups are ignored as the practice of using child jockeys in horse races persists\nMongolian courts banned them, human rights groups slammed them and the labour ministry demands they cease, but none of that has stopped Mongolia's politicians from letting child jockeys saddle up.\nDespite the outcry, coaches still hire child riders to race at breakneck speeds across the freezing steppe in high stakes contests with powerful backers.\nThe contests have been met with outrage on social media, where commenters share photos of young riders suffering painful falls from the saddle and call on authorities to enforce the court order suspending the event.\nChild jockeys are forbidden from appearing in winter and spring races, according to regulations issued by the country's ministry of labour in February 2016.\nBut that has not stopped Mongolian Prime Minister Jargalsaikhanii Erdenebat from approving a recent horse race about 20 kilometres outside of the capital of Ulaanbaatar in Tsagaan Hutul, as well as in two other provinces later this month.\nWinter-spring horse races are often held in temperatures as low as -20 degrees Celsius, which can lead to frostbite, particularly in long distance races in high winds.\nTemperatures dipped as low as -12 Celsius during Sunday's race in Tsagaan Hutul.\nIn Mongolia it is only in the last two decades that coaches have recruited child jockeys from lower income, rural families\nAt one race last Sunday, at least 10 horses crossed the finish line without riders after their jockeys apparently fell off. In total, 31 of the young jockeys took a spill at the event, according to Mongolia's authority for children and family affairs.\nMedics on scene refused to answer AFP's questions about whether any children had been injured.\nMongolia holds an average of 600 horse races with over 16,000 children participating as jockeys, according to government figures.\nA 2014 UNICEF report said that some 326 child jockeys were hospitalised in 2012, mostly with head or bone injuries.\n- 'Confluence of interests' -\nDisplays of skilled horsemanship are an important part of traditional Mongolian culture, but professional child jockeys are a relatively recent phenomenon, only appearing during the last 10 years.\nAs little as two decades ago, horse races were organised only during the country's summer festival Nadaam, and riding coaches, known as \"uyach\" in Mongolian, used their own children or relatives as jockeys.\nSince that time, racing has become a popular, albeit shadowy business and uyach seek out boys between the ages of seven and 10 to ride in the competitions.\nThe riders are often sponsored by local politicians, who tout their ownership of race horses during their campaigns. Ownership of livestock is an important measure of success for rural voters, many of whom continue to lead traditional pastoral lives.\nChildren's light weight gives them an advantage in horse races that often run for 18 to 26 kilometres, among the longest on earth.\nMost of the recruits come from lower income families in rural areas, where uyach are widely respected.\nChildren's light weight gives them an advantage in horse races in Mongolia that often run for 18 to 26 kilometres, among the longest on earth\nYa Boldbaatar, the chief organiser of the Uyach Association, told local reporters that organisers had not received notice of the court's decision to ban child jockeys before the most recent race: \"We only heard the decision from the media.\"\nKhurelchuluunii Bayasgalan, a public relations officer at the metropolitan administrative court told AFP that the horse-racing coaches association still has 14 days to appeal against the court decision, meaning that the order was not yet final.\nBut the ruling should have been put into immediate effect, Odonkhuugiin Munkhsaikhan, a legal expert at Mongolian National University, wrote on his web site.\n\"However, the government has conflicts of interest. Some of the cabinet members are uyach and have been allowed to organise the race without considering the court's decision.\"\nHorse races with child jockeys are sometimes held during the Mongolian winter, when the temperature can sink to - 20 degrees Celsius\nSanchir Jargalsaikhan, a political scientist in Ulaanbaatar, told AFP that the case showed how Mongolian plutocrats could increasingly ignore the country's laws.\nThe speaker of the country's parliament, the Great Khural, is also a member and head of the Uyach association, he said, adding that \"because of this confluence of interests, an amateur association is able to override the decision of the court and go unpunished.\"\nLast winter, 16 children fell off their horses and two broke their legs during a race that was held over objections by the Mongolian National Human Rights Commission and civil society groups.","url":"https://www.dailymail.co.uk/wires/afp/article-4300284/Conflicts-Mongolian-child-jockeys-saddle.html"}
