{"authors":[],"date_download":"2018-10-30 01:08:47","date_modify":"2018-10-30 01:08:47","date_publish":"2017-04-19 00:04:09","description":null,"filename":"data/vaneerConsumption/ConfirmedJohnBrennanColludedWithForeignSpiestoDefeatTrump.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/1024px-John_Brennan_swearing_in_as_CIA_Director.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861727.html","title":"Confirmed: John Brennan Colluded With Foreign Spies to Defeat Trump","title_page":"Confirmed: John Brennan Colluded With Foreign Spies to Defeat TrumpThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"An article in the Guardian last week provides more confirmation that John Brennan was the American progenitor of political espionage aimed at defeating Donald Trump. One side did collude with foreign powers to tip the election — Hillary’s.\nSeeking to retain his position as CIA director under Hillary, Brennan teamed up with British spies and Estonian spies to cripple Trump’s candidacy. He used their phony intelligence as a pretext for a multi-agency investigation into Trump, which led the FBI to probe a computer server connected to Trump Tower and gave cover to Susan Rice, among other Hillary supporters, to spy on Trump and his people.\nJohn Brennan’s CIA operated like a branch office of the Hillary campaign, leaking out mentions of this bogus investigation to the press in the hopes of inflicting maximum political damage on Trump. An official in the intelligence community tells TAS that Brennan’s retinue of political radicals didn’t even bother to hide their activism, decorating offices with “Hillary for president cups” and other campaign paraphernalia.\nA supporter of the American Communist Party at the height of the Cold War, Brennan brought into the CIA a raft of subversives and gave them plum positions from which to gather and leak political espionage on Trump. He bastardized standards so that these left-wing activists could burrow in and take career positions. Under the patina of that phony professionalism, they could then present their politicized judgments as “non-partisan.”\nThe Guardian story is written in a style designed to flatter its sources (they are cast as high-minded whistleblowers), but the upshot of it is devastating for them, nonetheless, and explains why all the criminal leaks against Trump first originated in the British press. According to the story, Brennan got his anti-Trump tips primarily from British spies but also Estonian spies and others. The story confirms that the seed of the espionage into Trump was planted by Estonia. The BBC’s Paul Wood reported last year that the intelligence agency of an unnamed Baltic State had tipped Brennan off in April 2016 to a conversation purporting to show that the Kremlin was funneling cash into the Trump campaign.\nAny other CIA director would have disregarded such a flaky tip, recognizing that Estonia was eager to see Trump lose (its officials had bought into Hillary’s propaganda that Trump was going to pull out of NATO and leave Baltic countries exposed to Putin). But Brennan opportunistically seized on it, as he later that summer seized on the half-baked intelligence of British spy agencies (also full of officials who wanted to see Trump lose).\nThe Guardian says that British spy head Robert Hannigan “passed material in summer 2016 to the CIA chief, John Brennan.” To ensure that these flaky tips leaked out, Brennan disseminated them on Capitol Hill. In August and September of 2016, he gave briefings to the “Gang of Eight” about them, which then turned up on the front page of the New York Times.\nAll of this took place at the very moment Brennan was auditioning for Hillary. He desperately wanted to keep his job and despised Trump for his alleged “Muslim ban,” a matter near and dear to Brennan’s heart. Not only was he an apologist for the Muslim Brotherhood, but Brennan’s Islamophilia dated to his days in college, when he spent a year in Cairo learning Arabic and taking courses in Middle Eastern studies. He later got a graduate degree with an emphasis in Middle Eastern studies. In 1996, his ties to the Islamic world tightened after he became the CIA’s station chief in Riyadh, Saudi Arabia. He once recalled that “during a 25-year career in government, I was privileged to serve in positions across the Middle East — as a political officer with the State Department and as a CIA station chief in Saudi Arabia. In Saudi Arabia, I saw how our Saudi partners fulfilled their duty as custodians of the two holy mosques of Mecca and Medina. I marveled at the majesty of the Hajj and the devotion of those who fulfilled their duty as Muslims by making that privilege — that pilgrimage.”\nOut of this Islamophilia came a special dislike of Michael Flynn, who had planned to rip up the Obama-era “reset” with Muslim countries. Furious with Flynn for his apostasy from political correctness, Brennan and other Obama aides couldn’t resist the temptation to take him out after rifling through transcripts of his calls with the Russian ambassador. They caught him in a lie to Mike Pence and made sure the press knew about it.\nWere the media not so completely in the tank for Obama and Hillary, all of this political mischief would make for a compelling 2016 version of All the President’s Men. Instead, the public gets a steady stream of Orwellian propaganda about the sudden propriety of political espionage. The headline writers at Pravda couldn’t improve on this week’s official lie, tweeted out by the Maggie Habermans: “Susan Rice Did Nothing Wrong, Say Both Dem and Republican House Aides.”\nLiberals pompously quote the saying — “the bigger the lie, the more it will be believed” — even as their media enshrine it. Historians will look back on 2016 and marvel at the audacity of its big lie: whispers of an imaginary Trump-Russia collusion that wafted up from the fever swamps of a real collusion between John Brennan and foreign powers seeking Trump’s defeat.","url":"https://spectator.org/confirmed-john-brennan-colluded-with-foreign-spies-to-defeat-trump/"}
