{"authors":["Raheem Kassam"],"date_download":"2018-10-30 18:28:09","date_modify":"2018-10-30 18:28:09","date_publish":"2016-01-29 23:13:01","description":"A Daily Mail article blocked in Sweden is causing outrage as social media users ponder why the massive news outlet is masking a story about migrant murder","filename":"data/vaneerConsumption/CONFIRMEDDailyMailArticleBLOCKEDInSwedenDueToMigrantMurderCourtCase.json","image_url":"https://media.breitbart.com/media/2016/01/mail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_29__1540924089.html","title":"CONFIRMED: Daily Mail Article BLOCKED In Sweden Due To Migrant Murder Court Case","title_page":"CONFIRMED: Daily Mail Article BLOCKED In Sweden Due To Migrant Murder Court Case | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An article on website of the Daily Mail newspaper (Mail Online) is being blocked in Sweden after the news outlet cast doubts on the age of the alleged migrant attacker currently on trial in the country following the stabbing of a 22-year-old asylum centre worker.\nEarlier this week the Mail Online reported that the family of the deceased 22-year-old Alexandra Mezher had revealed that she told them before her death that some of the ages of the so-called “child” migrants in the asylum centre were suspicious to her. She said she was dealing with “big powerful guys” aged up to 24 years old.\nThe news article has now been blocked voluntarily by the Daily Mail following “legal advice”, Breitbart London can confirm.\nA source at the newspaper told Breitbart London this evening that the reporting on the article and the website were both fine, but that in Sweden alone the paper has had to take action “to avoid prejudicing” ongoing legal proceedings concerning the alleged murderer.\nThe source said the Mail Online “have to have a block” on “one article”.\nBut Mail Online readers in Sweden are reporting blackouts on several different stories, and a Swedish website reports:\n“The murder suspect, Somali, claims he is only 15 years old, but the Daily Mail articles portrayed him as much older than that. One of the articles was blocked also contains an interview with a Swedish policeman who openly talks about an “explosion of crime” in the immigration track. The officer has worked as a police officer for 30 years and says that the situation in Sweden today is markedly different to how it looked in the 20th century. “During the week, the Daily Mail flew a journalist team from Great Britain into Göteborg to monitor the ongoing lawsuit against the applicant Somali. The British journalists have written numerous articles about the murder.”\nMiss Mezher, 22, was rushed to a nearby hospital after being stabbed repeatedly earlier this week.\nSwedish police initially refused to comment on the identity of the man, a resident of the asylum centre in Mölndal catering for unaccompanied minors aged 14-17.\nThe Mail Online is one of the largest news outlets in the world.","url":"https://www.breitbart.com/europe/2016/01/29/daily-mail-articles-blocked-in-sweden-over-migrant-stabbing-court-case/"}
