{"authors":["Caitlin Mahon"],"date_download":"2018-10-30 22:38:57","date_modify":"2018-10-30 22:38:57","date_publish":"2014-08-14 20:46:26","description":"It's that time of year again — when Congress takes the August recess to get some rest and relaxation, and leaves a huge pile of issues for September. The 113th Congress is quickly becoming known as one of the least productive Congresses in history,…","filename":"data/vaneerConsumption/CongressWorksFarLessThanYouDoButGetsPaidAWholeLotMore.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/761f1a45-022a-4f29-b57a-7333ffe2fef0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34540-congress-works-far-less-than-you-do-but-gets-paid-a-whole-lot-more_1540939137.html","title":"Congress Works Far Less Than You Do (But Gets Paid A Whole Lot More)","title_page":"Congress Works Far Less Than You Do (But Gets Paid A Whole Lot More)","title_rss":"NULL","source_domain":"bustle.com","text":"It's that time of year again — when Congress takes the August recess to get some rest and relaxation, and leaves a huge pile of issues for September. The 113th Congress is quickly becoming known as one of the least productive Congresses in history, and it's hardly surprising. In 2014, the House of Representatives and Senate will be in session less than half of the amount of days that the average American works, according to ABC News. The numbers really aren't pretty.\nDays In Session\nHouse of Representatives 2014 In Session Days: 109\nSenate 2014 In Session Days: 107\nWorking Hours\nNumber of hours House members worked in 2013: 942\nNumber of hours the average American worked in 2013: 1,788\nSalary\nAnnual salary for the average American worker: $37,128\nBase salary for member of Congress each year: $174,000\nThis only adds insult to injury; a staggering 74 percent of American voters believe our Congress is unproductive, according to a new national poll by Marist, The Wall Street Journal, and NBC News. President Barack Obama, in the meantime, is considering using executive action on certain issues since Congress has failed to act, according to MSNBC. Members of Congress will return to Washington during the first week of September, and have quite a few issues to address, such as immigration, mass transit affairs, minimum wage, government funding, and Veterans Affairs, among others.\nAlex Wong/Getty Images News/Getty Images\nOf course, there are arguments to be made that Congress works much more than the public believes. According to an article in the National Journal and a Congressional Management Foundation survey, the House of Representatives members put in 70 hours each week while in session, and almost 60 hours while at home. According to the Foundation, \"members work long hours, ensure unequaled public scrutiny and criticism, and sacrifice family time to fulfill work responsibilities.\"\nBrendan Hoffman/Getty Images News/Getty Images\nHappy summer, Congress. We're not bitter at all.","url":"https://www.bustle.com/articles/34540-congress-works-far-less-than-you-do-but-gets-paid-a-whole-lot-more"}
