{"authors":[],"date_download":"2018-10-22 22:13:31","date_modify":"2018-10-22 22:13:31","date_publish":"2014-05-09 14:33:02","description":"In the Oscar-winning movie, space debris threatens the life of U.S. astronauts. The danger is not just Hollywood drama.","filename":"data/vaneerConsumption/CongressAsksCouldGravityReallyHappen.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2015_18/431876/140509-140302-gravity-placeholder-0956_ef668c1c2a3f0f6e6e98222192dc4f33.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_congress-asks-could-gravity-really-happen-n101416_1540246411.html","title":"Congress Asks: Could 'Gravity' Really Happen?","title_page":"Congress Asks: Could 'Gravity' Really Happen?","title_rss":"NULL","source_domain":"nbcnews.com","text":"There is a lot of it out there. Currently, the Joint Functional Component Command for Space (JFCC SPACE), part of the Department of Defense, is tracking 23,000 objects in Earth’s orbit. They move fast — very fast. A piece of debris the size of a fleck of paint is capable of moving at 17,500 miles per hour.\nIn 2007, when the Chinese government decided to demonstrate its ability to destroy a satellite with a kinetic weapon, at least 3,400 pieces of space junk were created in what the committee called \"the largest single debris event in history.\"\nThe fallout threatened expensive satellites and astronauts, who in 2011, had to prepare to evacuate the International Space Station multiple times. The three astronauts aboard the ISS had the time had to repeatedly climb into the attached Soyuz rocket when debris from the destroyed satellite passed perilously close to their location.(Luckily, the astronauts have never had to attempt a \"Gravity\"-esque escape).\nThe problem is only going to get worse, Zamka said, with private companies like SpaceX looking to launch satellites along with various national space agencies.\nIn Congress, the big question is whether a single agency should be formed to monitor space junk and warn satellite operators when danger is on the horizon, or whether it should remain the responsibility of three agencies: the DoD, the FAA and Federal Communications Commission.\nAlso up for debate: Deciding who is financially responsible when satellites create debris, and whether the government agencies and private corporations that operate satellites are culpable if they don't move their property when warned about impending space junk collisions.\nAs for how to clean up the debris that is already out there, scientists and officials like Lt. Gen. John Raymond, of the Air Force Space Command, are stumped.\n“I have not heard of any technology,\" he told the committee, \"that, in the near term, is going to be able to solve this problem.\"","url":"https://www.nbcnews.com/science/space/congress-asks-could-gravity-really-happen-n101416"}
