{"authors":[],"date_download":"2018-10-22 20:40:00","date_modify":"2018-10-22 20:40:00","date_publish":"2014-05-02 20:42:31","description":"A proposal to allow tolls on the nation’s interstate highways is meeting bipartisan opposition in the House.","filename":"data/vaneerConsumption/CongressPutsBrakesonObamaPlantoAllowTollsonHighways.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/417286/140502-toll_thorp_highways-1636_6250b34a5f96c07d2cf0dae02ffaeccb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_congress-puts-brakes-obama-plan-allow-tolls-highways-n95986_1540240800.html","title":"Congress Puts Brakes on Obama Plan to Allow Tolls on Highways","title_page":"Congress Puts Brakes on Obama Plan to Allow Tolls on Highways","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA proposal to allow tolls on the nation’s interstate highways is meeting bipartisan opposition in the House, where lawmakers are rushing to pass legislation to keep our nation's roads funded.\n\"I absolutely will do everything I can to make certain that it doesn't see the light of day,\" Rep. John Mica, R-Fla., a former chairman of the House Transportation and Infrastructure Committee, told NBC News.\nCurrently, an 18.4 cent per-gallon gasoline tax fills the Highway Trust Fund, the pool of money tapped for the construction and repair of federal highways. The new plan would be paid with both the gas tax and pro-growth business tax reform.\nBut in question is a decades-old ban on tolls that applies to the vast majority of the nation's interstate highways. In a bill introduced by the White House this week, the ban would be lifted and states would have the flexibility to implement tolls to help pay for repairs to their highway systems.\nMica says that’s the kind of proposal that makes constituents bring out “pitchforks.” Democrat Rep. Peter Defazio of California said it is “a non-starter.”\n\"People around here, including the Obama administration, need to get real about it,” he told NBC News. \"I live in the western United States, [where] tolls are not a practical way of paying for interstates that span vast distances.”\nIn 10 years you'll have cars getting 50 miles to the gallon or plugged-in--you'll have electric cars--the gas tax is broken, so what do you do then? You either go tolls, you go to an infrastructure bank, you have to do something\nThe Department of Transportation estimates that the Highway Trust Fund will be depleted by the end of August. Congress has done a number of short-term fixes over the past few years to keep the fund afloat, but attempts to implement long-term reforms to make the fund sustainable have been stymied by partisan politics.\nSome lawmakers point out that revenues from the gas tax are going down as the auto industry develops cars with better mileage.\n\"The gas tax doesn't work anymore,\" Rep. Duncan Hunter , R-Calif., told NBC News. \"In 10 years you'll have cars getting 50 miles to the gallon or plugged-in--you'll have electric cars--the gas tax is broken, so what do you do then? You either go tolls, you go an infrastructure bank, you have to do something.\"\nBut critics of the Obama plan call it \"double taxation\" on hardworking commuters.\n\"It sounds like in theory that would be good, but I think when you get to the local level, the county commissions and all that kind of stuff, you're going to meet a lot of resistance to tolling,\" Rep. Shelly Moore Capito, R-WV., said, noting that some of her constituents might commute 30 miles each day.\n“Let's say you're commuting every day. That's a lot of money,\" Capito said, \"I think it's an option to be looked at, but I don't think it would fly in my state.\"\nTolling existing interstates is extremely inefficient, creates bloated government bureaucracy, increases business and travel costs, and diverts traffic from tolled interstates onto local roads\nOpposition to interstate highway tolls also comes from trucking and fast-food industries, which argue that the plan will hurt the economy by encouraging consumers to avoid highways. In a statement, The Alliance for Toll-Free Interstate -- a coalition of individuals, businesses, and organizations fighting against tolls -- called the proposal a \"gimmick\" that \"shirks the federal government's responsibility to generate sustainable funding for roads.\"\n\"Tolling existing interstates is extremely inefficient, creates bloated government bureaucracy, increases business and travel costs, and diverts traffic from tolled interstates onto local roads, accelerating road degradation and causing serious safety concerns,\" Miles Morin, a spokesman for the Alliance said.\nThe current Chairman of the Transportation Committee, Rep. Bill Shuster, R-Pa., has yet to take a stance on the proposal, but released a statement saying \"I respect that, for the first time, the Obama Administration has put forward a detailed surface transportation proposal. While I'm certain I won¹t agree with all the details, I look forward to reviewing it.\"","url":"https://www.nbcnews.com/politics/congress/congress-puts-brakes-obama-plan-allow-tolls-highways-n95986"}
