{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:07:49","date_modify":"2018-10-30 18:07:49","date_publish":"2018-08-01 21:15:03","description":"The Congressional Black Caucus is reportedly planning to challenge House Minority Leader Nancy Pelosi for Speaker if Democrats win.","filename":"data/vaneerConsumption/CongressionalBlackCaucustoChallengeNancyPelosiforSpeakerReport.json","image_url":"https://media.breitbart.com/media/2018/08/Nancy-Pelosi-vs.-Cedric-Richmond-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_01__1540922869.html","title":"Congressional Black Caucus to Challenge Nancy Pelosi for Speaker: Report","title_page":"Congressional Black Caucus to Challenge Nancy Pelosi for Speaker: Report | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Congressional Black Caucus is reportedly planning to challenge House Minority Leader Nancy Pelosi (D-CA) for the position of Speaker of the House after the November midterm elections — assuming Democrats win the majority.\nIn May, Pelosi, 78, declared that she intended to reclaim the Speaker’s gavel if Democrats won. “We will win. I will run for speaker. I feel confident about it. And my members do, too,” Pelosi told the Boston Globe. In February, she showed that she still has the sheer physical stamina for the job by staging a record-setting eight-hour-plus speech on the floor of the House of Representatives. And she remains one of the Democratic Party’s most important fundraisers, meaning that many members feel they owe her their positions.\nHowever, Republicans managed to stave off Democratic challengers in several special elections last year by tying them to Pelosi. In 2018, many of the Democrats who have won special elections in Republican districts have done so by promising explicitly not to support Pelosi’s return as Speaker. And dozens of Democratic candidates have promised not to vote for her if they are elected to the House.\nRight now I’m counting THIRTY-ONE House Dem candidates who have publicly said they won’t back @NancyPelosi for speaker — that’s not including those who lost in primaries. Worth noting that 21 of them are in @DCCC‘s Red to Blue. The running list: pic.twitter.com/PsHSSVGJBd — Ally Mutnick (@allymutnick) July 31, 2018\nPelosi’s many loyalists are still declaring their intent to “put Nancy Pelosi back in the speakership.” But the Congressional Black Caucus (CBC), a key voting block within the party, is mobilizing to put one of its members in charge instead. Emboldened by “democratic socialist” Alexandria Ocasio-Cortez’s upset victory over the party’s fourth-ranking leader in the House, Rep. Joe Crowley (D-NY), the CBC says a black speaker after a Democratic win in November is no longer a “possibility,” but a “probability,” according to Politico.\nNo clear favorite has emerged, but Politico reports that the likeliest candidates are Reps. Jim Clyburn (D-SC), Hakeem Jeffries (D-NY), Cedric Richmond (D-LA), Elijah Cummings (D-MD), and Marcia Fudge (D-OH).\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2018/08/01/congressional-black-caucus-to-challenge-nancy-pelosi-for-speaker-report/"}
