{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:20:35","date_modify":"2018-10-30 20:20:35","date_publish":"2015-05-10 17:17:39","description":"Taylor Swift is taking her 1989 World Tour to Washington, D.C. this summer, and if you have the cash to avoid the nosebleed section, now you have the option to enjoy the show with a member of congress--for $2,500.","filename":"data/vaneerConsumption/CongressAsks2500toSitwithThematTaylorSwiftConcert.json","image_url":"https://media.breitbart.com/media/2015/05/Taylor-Swift-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_10__1540930835.html","title":"Congress Asks $2,500 to Sit with Them at Taylor Swift Concert","title_page":"Congress Asks $2,500 to Sit with Them at Taylor Swift Concert","title_rss":"NULL","source_domain":"breitbart.com","text":"Taylor Swift is taking her 1989 World Tour to Washington, D.C. this summer, and if you have the cash to avoid the nosebleed section, now you have the option to enjoy the show with a member of congress–for $2,500.\nSwift has scheduled back-to-back shows in our nation’s capital for July 13-14 at Nationals Stadium, and some lawmakers are seizing the opportunity to use the “Shake it Off” singer’s big events to shake down fans for some much needed cash.\nThe Washington Post’s Colby Itkowitz obtained invitations to the event. He reports at least four members of congress planned fundraisers around the event and are asking big bucks for you to spend the evening with them.\nFor $2,500 a ticket you can watch the concert with Rep. Gwen Moore (D-WI), Rep. Lois Frankel (D-FL) or Rep. Cheri Bustos (D-IL).\nThe only Republican planning a cash drive is Rep. Steve Stivers (R-OH), who is asking for $1,500 per ticket. Moreover, for $2,500 he will allow you to bring a friend.\nThe 1989 World Tour’s D.C. stops are scheduled for July 13, 2015 at 5:00pm, and July 14, 2015 at 5:00pm.\nStandard tickets, which went on sale November 21, range between $54.50 and $134.50, while VIP packages range between $199 and $479. The most expensive VIP package includes reserved floor seating, entry into the official “1989” pre-show party, limited edition tour lithographs and exclusive on-site VIP perks.\nNo further details have been released regarding what a congressional package might entail.","url":"https://www.breitbart.com/politics/2015/05/10/members-of-congress-are-asking-2500-to-sit-with-them-at-taylor-swift-concert/"}
