{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:17:40","date_modify":"2018-10-30 19:17:40","date_publish":"2015-04-14 15:32:01","description":"The Senate Foreign Relations Committee will vote Tuesday on Sen. Bob Corker's (R-TN) proposal for Congress to have a say in the Iran deal.","filename":"data/vaneerConsumption/CongressionalApprovalonIranDealFacesBigTestTuesday.json","image_url":"https://media.breitbart.com/media/2015/01/corker-reuters-e1421178609337.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_14__1540927060.html","title":"Congressional Approval on Iran Deal Faces Big Test Tuesday","title_page":"Congressional Approval on Iran Deal Faces Big Test Tuesday | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The opportunity for Congress to have a say in the Iran deal faces a big test Tuesday afternoon. The Senate Foreign Relations Committee will debate and vote on the bipartisan measure put forth by Sen. Bob Corker (R-TN).\nCorker’s proposal gives Congress 60 days to review the final negotiations before any sanctions on Iran are lifted.\nSecretary of State John Kerry is meeting with lawmakers Tuesday behind closed doors trying to convince them about his negotiations with Iran.\nCorker said in a morning appearance on Fox News that he will talk with Kerry prior to the committee hearing, but added he believes the American people need their elected representatives to go through this deal with a “fine tooth comb.”\nAccording to Politico, Corker will open up his bill for amendment votes to gain bipartisan support and avoid a veto from President Obama.\nOn discussing how his committee will vote, Corker said, “We’ve had good and productive meetings,” adding, “I do hope and think we are going to be successful.”\nSen. Chris Coons (D-DE) has said he believes President Obama will veto whatever happens, according to Fox News.\nCorker added, “It is so important that we have a strong committee vote today to signal to the rest of the Senate that this is broadly supported.”\nSen. Jeff Flake (R-AZ) told Breitbart News Tuesday before the committee hearing that “Congress has a role to play because we passed the sanctions that brought Iran to the negotiating table, and only Congress can lift the sanctions on a permanent basis.”\nFlake also said, “I support Sen. Corker’s bill because it ensures the administration can’t make an end-run around Congress using waiver authority to implement any agreement, and I believe it strengthens our position at the negotiating table.”\nOn Monday, a spokesman from Sen. Marco Rubio’s (R-FL) office told Breitbart News that Rubio has serious concerns that the negotiations are allowing Iran to continue its nuclear program.\nThe spokesman said Rubio “looks forward to debating this issue and reserves the opportunity to call up any of these amendments for a vote with the goal of strengthening the bill and making sure the American people’s voices are heard on the future of Iran’s nuclear program.”\nSen. Tim Kaine (D-VA), who co-sponsored and helped craft the bill, previously said, “I believe Congress should weigh in on the content of the deal given the centrality of the congressional sanctions to the entire negotiation and the significant security interests involved.”\nSenator John Barrasso (R-WY) echoed Kaine’s support. A spokesperson from Barrasso’s office told Breitbart News he plans to introduce four amendments if any Democrats attempt to weaken the legislation.\nSen. Rand Paul (R-KY) also added his backing of Corker’s bill Monday night on Fox News.\nThe legislation is cosponsored by Senators John McCain (R-AZ), Joe Donnelly (D-IN), Heidi Heitkamp (D-ND), Kelly Ayotte (R-NH), Bill Nelson (D-FL), Jim Risch (R-ID), and Angus King (I-Maine).","url":"https://www.breitbart.com/politics/2015/04/14/congressional-approval-on-iran-deal-faces-big-test-tuesday/"}
