{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:16","date_modify":"2018-10-30 19:52:16","date_publish":"2016-04-10 23:56:01","description":"CT 5th District candidate Bill Stevens opposes universal background checks for gun sales unless similar checks are placed on other rights.","filename":"data/vaneerConsumption/CongressionalCandidateWhenUniversalBackgroundChecksApplytoSpeechTheyCanApplytoGuns.json","image_url":"https://media.breitbart.com/media/2016/04/bill-stevens-connecticut-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/2nd-amendment_2016_04_10__1540929136.html","title":"Congressional Candidate: When Universal Background Checks Apply to Speech, They Can Apply to Guns","title_page":"Congressional Candidate: When Universal Background Checks Apply to Speech, They Can Apply to Guns | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Connecticut 5th District candidate Bill Stevens opposes universal background checks for gun sales unless similar checks are put in place for speech and other rights enumerated in constitutional amendments.\nStevens stresses that all natural rights are of a cloth and therefore individual in nature. He suggests that choosing one of the rights — guns, in this case — to control via expanded government oversight clearly subjects that right to a different standard than the others. He believes this becomes evident if one thinks about trying to control another right in the same way that guns are controlled.\nThe Bethal Patch reports that Stevens said, “If there aren’t universal background checks for the First Amendment – voting – then they shouldn’t apply to the Second Amendment.” He said that universal checks “[infringe] on the rights of law-abiding Americans,” and for that reason, his opposition to them “is more a conversation not about guns but about protecting the Constitution.”\nStevens is from Newtown, Connecticut. He testified against gun control in 2013, just over a month after Adam Lanza stole guns from his mother and opened fire in Sandy Hook Elementary. The Hartford Courant reported Stevens telling the Connecticut General Assembly, “You will take my ability to protect my [daughter] from my cold dead hands.”\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/2nd-amendment/2016/04/10/congressional-candidate-no-gun-control-without-speech-control/"}
