{"authors":["Stephanie Haney For Dailymail.Com"],"date_download":"2018-10-22 23:12:16","date_modify":"2018-10-22 23:12:16","date_publish":"2017-04-26 06:56:26","description":"US Representative from Iowa Steve King seemed to question the language skills of his Latina constituent who was in Washington, DC, Vanessa Marcano-Kelly, in a tweet he posted on Tuesday.","filename":"data/vaneerConsumption/CongressmanSteveKingmocksLatinawithoffensivetweet.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C814600000578-0-image-a-61_1493183029852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446318_Congressman-Steve-King-mocks-Latina-offensive-tweet_1540249936.html","title":"Congressman Steve King mocks Latina with 'offensive' tweet","title_page":"Congressman Steve King mocks Latina with 'offensive' tweet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Congressman Steve King seemed to question the language skills of one of his Latina constituents in an 'offensive' tweet he posted on Tuesday.\nVanessa Marcano-Kelly, a board member of Iowa Citizens for Community Improvement who is fluent in English, Spanish and French according to the New York Daily News, had a meeting scheduled with a member the Iowa Representative's staff for 2.00pm Eastern in Washington, DC.\nWhen the staffer was a no-show after 23 minutes, Marcano-Kelly, 32, then tweeted about the missed meeting, which the congressman quoted with the reply, 'Do you always lie in English?'\nKing's initial response was posted at 3.10pm Eastern, 45 minutes after his constituent's tweet.\nFurious with that response, Marcano-Kelly marched to King's office and streamed the ensuing encounter on Facebook Live.\nCongressman Steve King seemed to question the language skills of one of his Latina constituents in a tweet he posted on Tuesday\n'Had mtg set up with @SteveKingIA staff in DC,' Marcano-Kelly tweeted at 2.25pm Eastern. '23 min later, staff no show. We're here all the way from IA. Way 2 serve the people, Rep. King.'\nWhen King responded accusing Marcano-Kelly of lying and appearing to question her ability to speak English, she and her team from Iowa Citizens for Community Improvement decided to 'take the meeting to him.'\n'It was shocking to see that,' the interpreter and translator told the Daily News.\n'I had that gut feeling in the pit of my stomach. I felt targeted, attacked and offended that you have this person who’s supposed to be representing Iowa, who has power, belittling you like that.'\nUS Representative from Iowa Steve King seemed to question the language skills of his Latina constituent, Vanessa Marcano-Kelly (pictured) in a tweet he posted on Tuesday, which prompted her to march to King's office and stream the ensuing encounter on Facebook Live\nMarcano-Kelly read King's 'discriminatory' and 'offensive' tweet as she was waiting for another scheduled meeting, she said.\nOnce she arrived to King's office, she can be seen on video demanding an apology and asserting that she always tells the truth, in any of the three languages she speaks.\nMarcano-Kelly also made it clear that tweets she had found offensive from King's Twitter account, which his staff confirmed in the video that he runs himself, were to be a large part of her discussion with the staffer who failed to show up to meeting.\nMarcano-Kelly (L) made it clear that tweets she had found offensive from King's Twitter account, which his staff confirmed in the video that he runs himself, were to be a large part of her discussion with the staffer who failed to show up to meeting; US Republican Representative from Iowa Steve King is shown here (R) using a mobile device while arriving to a House Republican Caucus meeting in Washington, DC, on March 24\nMarcano-Kelly specifically referenced a tweet posted on April 18 featuring an image of an alcoholic beverage that was meant in celebration of the plight of Deferred Action for Childhood Arrivals (DACA) beneficiary Juan Manuel Montes, 23, who remains in Mexico pending cases surrounding his deportation.\n'First non-valedictorian DREAMer deported,' the tweet read. 'Border Patrol, this one's for you.'\nThe live-streamed encounter went on for about 5 minutes before a woman left to check with her staff to verify that a meeting was in fact scheduled, after first looking over the email chain allegedly confirming the appointment presented by Marcano-Kelly and her staff.\nThe live-streamed encounter went on for about 5 minutes before a woman left to check with her staff to verify that a meeting was in fact scheduled, after first looking over the email chain allegedly confirming the appointment presented by Marcano-Kelly and her staff\nThe woman returned almost 3 minutes later with the staffer who missed the appointment.\nHe was very apologetic, and took responsibility for not attending the off-site meeting.\nLater, King replied once more to Marcano-Kelly, again quoting her initial tweet about the missed meeting.\n'U didn't lie. No way to connect u2 the missed meeting,' he wrote at 5.28pm Eastern. 'Next time just call. Glad all is cleared up.'\nBut it's not quite all cleared up for Marcano-Kelly, who vehemently stated repeatedly that King's social media presence does not represent Iowan values.\n'The fact that he targeted, that was very charged,' she said. 'I think he’s proud of that hardline stance he has on immigration. He’s not going to change.'","url":"https://www.dailymail.co.uk/news/article-4446318/Congressman-Steve-King-mocks-Latina-offensive-tweet.html"}
