{"authors":[],"date_download":"2018-10-30 01:05:52","date_modify":"2018-10-30 01:05:52","date_publish":"2018-07-30 00:05:42","description":null,"filename":"data/vaneerConsumption/CongressonCryptoIsBitcointheFutureofMoney.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/bitcoin-2007912_1920.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861552.html","title":"Congress on Crypto: Is Bitcoin the Future of Money?","title_page":"Congress on Crypto: Is Bitcoin the Future of Money?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On July 18, the U.S. House Committee on Financial Services conducted its second hearing on digital currencies with an almost exclusive focus on cryptocurrency. Chairman Andy Barr (R-KY) focused the committee on two questions: 1) Are digital currencies going to have only a niche appeal or will they fundamentally change the economy and 2) how should the U.S approach digital currency? Over an hour and a half, the committee, if nothing else, demonstrated how ill-equipped it is to answer this question.\nMoney isn’t what it used to be. Keynesian economics weaponized government monetary policy. Big spending and big printing became the norm. The last link to the old financial system broke in 1971 under Nixon. His departure from the gold standard fully committed the U.S. to fiat currency. This new monetary system, however, is unsustainable. Fiat currencies can be printed at the whim of a bureaucrat’s calculator. Need economic growth? Just print a few trillion bills to whip up job creation. Too much inflation? Peg the interest rate.\nYet, you can’t beat the market forever.\nCryptocurrencies are a reaction to governmental monetary interventionism. Bitcoin, the flagship cryptocurrency, promises economic nirvana: peer-to-peer transactions via a decentralized, open-source financial network. Lost in all this techno gibberish is how revolutionary Bitcoin is. Revolutionary, to be clear, in the traditional sense of the word.\nBitcoin is a return to old methods. A return to real wealth creation, free markets, and sound money. In a world of hyper-government spending, Bitcoin is a market solution, or at the very least counter, to 20th century fiat systems.\nBitcoin is a digital currency that mimics, and arguably expands upon, the gold standard. To be reductionist, Bitcoin lowers transaction costs and strips away government monetary power. Instead of mining the earth’s crust, your computer bangs away at math equations. As a reward for wrecking your computer’s graphic card and moving the earth incrementally closer towards a global warming holocaust, you receive a fraction of a coin disbursement from the program. These coins are transferred to a digital “wallet” on your phone or computer which acts as an encrypted folder holding the private “key” to your coins.\nA key needs a lock — Blockchain.\nBlockchain is a permanent ledger of all bitcoin transactions ever stored on an open access network. When a Bitcoin is exchanged for a good or service, the privacy key is exchanged between the two parties while the public key records the transaction on the blockchain. In this way, all transactions are available to the public. The exchange of keys initiates the transaction and the recording on the blockchain signifies it as a closed transaction.\nThe key innovation of Bitcoin, and therefore all cryptocurrencies, is blockchain’s open source ledger. Among other things, the ledger’s public proof of purchase stamp is a main source of value to Bitcoin. Just like an accountant’s book, blockchain holds the record of all financial ins and outs. Now anyone with a computer can see what the CPA does behind the visor. Consequently, for the first time in human history, peer-to-peer exchanges can take place over great distances among total strangers with total confidence.\nWhat if you get ripped off? Luckily, Bitcoin’s fluid design incentivizes adjustments. Multisigs, which stands for multiple signatures, is just such an innovation that allows for a third party system to verify transactions. Compared to banking systems like VISA, these third parties are extremely weak. They merely sign off on transactions as requested. Users, therefore, have the benefit of a safety net without worrying about arbitrary powers rifling through their accounts.\nMonetary revolutions such as Bitcoin only take place every few centuries — the Financial Services committee is in an unforgiving spot. Additionally, there seems to be more fake news relating to cryptocurrency than Donald Trump. The committee’s questions, unfortunately, reflected these facts:\n“What’s the problem we are trying to solve, except for the problem the narcotic dealers are trying to solve?” — Brad Sherman (D-CA)\n“Why is [cryptocurrency] not like Wild Cat Banking of the 1830s?” — French Hill (R-AR)\nYes, cryptocurrencies have an image problem — what emerging technology doesn’t? In the meantime, businesses and universities are taking crypto seriously. IBM has an entire blockchain platform and the London School of Economics opened a new course on the subject this year. It would be wise of the Committee to hit the books.\nTo answer the Congress, it comes down to two points: efficiency and inflation. Blockchain ends reliance on expensive third party systems. If Bitcoin has its way, banks will become a thing of the past. Secondly, and perhaps more significantly, Bitcoin cuts at the fundamental issue of government-backed money — inflation. Under Bitcoin, governments will no longer be able to print themselves into history. The reported use of Bitcoin in Venezuela hints at this future.\nThese two features, among many others, cut at the fabric of government monetary systems. How will governments respond?\nTo date, the U.S. crypto community is largely untouched by the regulatory state. Past hearings, such as in March 2018, leave crypto enthusiasts hopeful. Some rhetoric points to ignorance, some to caution. On the whole, the U.S. is moving slower than skeptics would perceive as wise against a “threat” to consumer security or even U.S. financial hegemony.\nOther governments, such as Canada and the United Kingdom, are taking more proactive stances, researching heavily in crypto markets with an eye towards government-backed coins. Instead of an open source blockchain, a centralized bank would control the ledger. Each branch, termed “node,” of the chain would be given to a commercial bank like Citi or Wells Fargo. Opponents argue this cuts at the fundamental purpose of cryptocurrency — decentralization. Proponents believe that meshing banks and cryptotech arrives at a happy medium: traditional safety measures while retaining diminished transaction costs. The latter idea was met with great interest at the hearing.\nFor now, expect Bitcoin to continue gaining ground at the behest of self-interested coders, researchers, writers, and enthusiasts. A simple search on Twitter or Reddit will expose a hive of young minds striving toward a financial revolution. It may very well be the future of exchange.","url":"https://spectator.org/congress-on-crypto-is-bitcoin-the-future-of-money/"}
