{"authors":["Kavitha George"],"date_download":"2018-10-31 01:52:44","date_modify":"2018-10-31 01:52:44","date_publish":"2018-09-06 04:53:00","description":"At least some people can get ready to kiss their unpaid internships goodbye. If the 2019 legislative branch appropriations bill passes, congressional interns will be paid in the House and Senate starting next fiscal year, reported Roll Call. Under…","filename":"data/vaneerConsumption/CongressionalInternshipsWillBePaidStartingIn2019AsLongAsThisSpendingPackagePasses.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/ec11d0d4-ff74-43cf-9e40-e1fa535842b3-getty-1024565738.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_congressional-internships-will-be-paid-starting-in-2019-as-long-as-this-spending-package-passes-11770607_1540950764.html","title":"Congressional Internships Will Be Paid Starting In 2019 As Long As This Spending Package Passes","title_page":"Congressional Internships Will Be Paid Starting In 2019 As Long As This Spending Package Passes","title_rss":"NULL","source_domain":"bustle.com","text":"At least some people can get ready to kiss their unpaid internships goodbye. If the 2019 legislative branch appropriations bill passes, congressional interns will be paid in the House and Senate starting next fiscal year, reported Roll Call. Under the Congressional Accountability Act, interns in Congress have been specifically excluded from receiving benefits like minimum wage that are guaranteed to other government employees. But there's a good chance that's about to change.\nEarlier this year, the Senate included $5 million for intern pay in another version of the spending package. The House followed suit, and on Wednesday announced that it would be allocating $8.8 million to cover interns in the bill, according to The Hill. One major benefit of moving to pay interns is that congressional internships would now be more accessible to students of all backgrounds. \"Because the bulk of Congressional Internships are unpaid, they are implicitly easier for individuals from privileged backgrounds to participate in and complete,\" Rep. Tim Ryan of Ohio, a Democrat on the House Legislative Branch Appropriations Subcommittee, told The Hill.\nSen. Chris Murphy of Connecticut, who got his start in Washington as a Senate intern, agreed. \"I was an intern for my Senator, Chris Dodd, but there's no way that I could have taken advantage of that opportunity had my family not had the resources to be able to send me down to Washington for a summer,\" he wrote in a statement advocating for Senate intern pay in June.\nIn June, The New York Times reported that wealthier students have historically had an advantage in gaining access to internships — and the networking perks that they offer — on Capitol Hill. The cycle only deepens inequity among the rising generation, The Times reported, as privileged students go on to take other prestigious positions, leaving less advantaged students with fewer options.\n\"Interns do good work in our office, and they should be compensated,\" Senator Chris Van Hollen, Democrat of Maryland and a sponsor of the Senate intern pay allocation told The Times. \"We need to make sure that every qualified candidate has the opportunity to intern on the Hill regardless of their financial circumstances.\"\nAllocating federal pay for interns could also help foster racial diversity Congress. A 2015 study by the Joint Center for Political and Economic Studies found that almost 93% of top Senate staff are white, and in the House upwards of 77% of staff are white. \"Internships can often be the gateway to working on the Hill,\" Van Hollen told The Times, \"and we need to make that ladder of opportunity available.\"\nIn 2016, Paul Ryan was sharply criticized for posting a selfie with an overwhelmingly white crowd of congressional interns. \"I think this sets a record for the most number of #CapitolHill interns in a single selfie. #SpeakerSelfie.\" he captioned the photo.\n\"They say a picture is worth 1,000 words, but based on this photo, only three come to mind: lack of diversity,\" Rep. Alma Adams told The Guardian at the time. \"We know that diversity needs to be improved in workplaces like Capitol Hill just based upon our observations alone or this selfie taken by the Speaker Ryan.\"\nCongress could pass the bill as early as Friday, reports The Hill, though debates over other funding areas could delay a final agreement to next week.","url":"https://www.bustle.com/p/congressional-internships-will-be-paid-starting-in-2019-as-long-as-this-spending-package-passes-11770607"}
