{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:22:22","date_modify":"2018-10-23 03:22:22","date_publish":"2017-03-16 14:17:02","description":"A three-year-old girl has been found after surviving several days alone in an apartment in East Hartford, Connecticut, after her 37-year-old mother, Twanna Toler (pictured), died.","filename":"data/vaneerConsumption/Connecticutgirlsurvivesinflatafterhermomdied.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/20/3E581F5700000578-0-image-a-40_1489696801121.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320460_Girl-survives-days-apartment-mother-died_1540264942.html","title":"Connecticut girl survives in flat after her mom died","title_page":"Connecticut girl survives in flat after her mom died | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A three-year-old girl has been found after surviving several days alone in an apartment with her dead mother.\nThe toddler, who has not been identified, managed to stay alive for days by eating cereal off the floor inside the home in East Hartford, Connecticut.\nHer mother, 37-year-old Twanna Toler, was found dead in her bed by a social worker who had been called to the apartment after the young girl was absent from childcare for a number of days.\nTwanna Toler, 37, was found dead in her apartment. Her three-year-old daughter survived for several days alone inside their home after the death\nA three-year-old girl has been found after surviving several days alone in an apartment (pictured) after he mother died\nEast Hartford Police said an autopsy is currently being carried out on Toler, but added there are so signs of forced entry or any 'immediate evidence a crime took place', NBC News reports.\nPolice said while investigators do not know exactly when the mom died, it is believed the three-year-old was alone: 'definitely more than a couple of days'.\nToler's social media accounts were filed with photographs of her with her young daughter.\nSusan Tash, a woman who lives in the apartment below the young girl, said she was shocked to hear the terrible news.\nA care worker who went to the apartment after the young girl was reported to have missed several days of childcare found Toler (pictured) dead in her bed\nPolice said they did not yet know how long Toler (left) had been dead before she was found in the apartment\n'Boy do I regret not going up there,' Tash told the Hartford Courant.\n'It's hard to get over that she was up there and that was happening.'\nThe young girl was taken to the Connecticut Children's Medical Center after being found.\nPolice said she was slightly dehydrated, but otherwise unharmed.\nThe toddler managed to stay alive for days by eating cereal off the floor inside the building (pictured) in East Hartford, Connecticut","url":"https://www.dailymail.co.uk/news/article-4320460/Girl-survives-days-apartment-mother-died.html"}
