{"authors":["Caroline May"],"date_download":"2018-10-30 21:55:48","date_modify":"2018-10-30 21:55:48","date_publish":"2015-03-30 20:00:27","description":"A recent SSA Inspector General audit estimates that the agency has paid out some $17.1 million in benefits to at least 740 dead people. In one case, a Connecticut man has been convicted of defrauding the program for a quarter century. |","filename":"data/vaneerConsumption/ConnecticutManBilksFedsCollectsDeadMomsSocialSecurityFor25Years.json","image_url":"https://media.breitbart.com/media/2015/01/social-security-checks-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_30__1540936548.html","title":"Connecticut Man Bilks Feds, Collects Dead Mom's Social Security For 25 Years","title_page":"Connecticut Man Bilks Feds, Collects Dead Mom's Social Security For 25 Years | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Connecticut man was able to collect Social Security benefits on behalf of his deceased mother for more than a quarter century, according to the Connecticut U.S. Attorney’s Office.\nWilliam Chase of Milford, Connecticut was sentenced to six months in prison and another three years of supervised release last week after he was found guilty of stealing his late mother’s Social Security benefits.\nHis mother died in 1988. Chase never notified the Social Security Administration of her demise.\nInstead, from his mother’s death until last May, the government deposited $307,396 worth of Social Security benefits into his mother’s account, which Chase controlled. Of that, according to the U.S. Attorney, Chase used more than $292,000 “for his personal use and enjoyment.”\nChase’s bank returned the remaining $14,761. Chase was ordered to repay all that he had taken.\nThe resolution of this multi-decade fraud comes in the wake of a recent SSA Inspector General audit which estimated that the agency has paid out some $17.1 million in benefits to at least 740 dead people.\nThe IG released the audit this month.\n“We estimate there is at least $17,103,880 in outstanding payments deposited into bank accounts of beneficiaries in suspense status after the death of the beneficiary,” the audit read. “However, we believe the actual figure is likely higher because we limited our review to individuals in suspense for fewer than 7 years, residing in the United States, and those with higher monthly benefit amounts.”","url":"https://www.breitbart.com/politics/2015/03/30/connecticut-man-bilks-feds-collects-dead-moms-social-security-for-25-years/"}
