{"authors":["Nelson Groom For Daily Mail Australia"],"date_download":"2018-10-23 01:31:50","date_modify":"2018-10-23 01:31:50","date_publish":"2017-04-26 12:02:21","description":"Samuel Johnson's terminally ill sister, Connie, has opened up on the struggle of leaving behind her two beloved sons, and how they are spending her final months.","filename":"data/vaneerConsumption/ConnieJohnsontellshowshesspendingherfinalmonths.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F47E200000578-0-image-a-7_1493206127495.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446934_Connie-Johnson-tells-s-spending-final-months_1540258310.html","title":"Connie Johnson tells how she's spending her final months","title_page":"Connie Johnson tells how she's spending her final months | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Samuel Johnson's terminally ill sister, Connie, has opened up on the struggle of leaving behind her two beloved sons.\nRather than dwelling on her own tragic fate, the 40-year-old has turned her attention on her kids and the memories she can leave them in her final months.\nConnie is playing board games with her eldest, Willoughby, 10, and teaching Hamilton, 9, to ride a bike so they remember a 'normal' childhood with her, according to ABC.\nThis month, the courageous Canberra mother announced her heart-wrenching decision to end all cancer treatment after battling the disease for over a decade.\nSamuel Johnson's terminally ill sister, Connie, has opened up on the struggle of leaving behind her sons Hamilton, (left) and Willoughby\nConnie this month announced her decision to end all cancer treatment after battling the disease for over a decade\nShe has been playing board games and riding bikes with her kids so they remember a 'normal' childhood with her\nConnie said in the candid interview she saw a clear divide between her professional legacy and the one she would leave her family.\n'Legacy with family is very different to legacy at work. My legacy with family is playing board games with Willoughby, and watching Hamilton get better on his unicycle, skateboard and bike.'\nConnie, who co-founded the charity Love Your Sister with Samuel, said these activities were sentimental because they were how she spent her own tender years.\n'I like encouraging those interests and sharing the little moments because that's the stuff I remember from my childhood. I want them to have those fond, normal childhood memories with their mum.'\nShe also shed light on the moment Molly Meldrum interrupted her brother's Logies dedication speech on Sunday, leaving Samuel 'upset.'\n'That was the first thing he said on the phone to me,' said Connie, whose brother skipped the Logies after-parties to spend the night chatting to her on the phone.\nAn ecstatic Connie Johnson reacts to the news her brother had won the Best Actor Logie on Sunday night\nShe also shed light on the controversial moment Molly Meldrum interrupted her brother's Logies speech\nSamuel on Sunday won the Best Actor Logie for his role in the mini-series Molly\nHe dedicated his Best Actor Logie to his dying sister Connie in a touching tribute\n'He said I didn't get to say what I wanted to say you Con… He was quite upset about that,' she said.\nSamuel won the the Gold Logie for his portrayal of music legend Molly Meldrum. He dedicated the win to his dying sister in a touching - albeit cut short - tribute.\nHowever Connie said she isn't bitter: Meldrum's life served as the inspiration for Samuel's role.\n'He has lived a wonderful, amazing, country-changing life,' she said.\n'That gave Sam very good material to work with when he was portraying his character…. I think both Molly's deserve the Logie.'\nFootage on the nights captured the stirring moment Connie and her supporters saw Samuel claim the coveted award.\nConnie said she was initially reluctant to let her brother retire from acting to focus on cancer research\nConnie co-founded the cancer charity Love Your Sister with Samuel\nSamuel has previously raised over one and a half million for Connie and cancer research when he uni-cycled around Australia\nIn February, Samuel announced his retirement from acting after nearly 25 years to focus on cancer research.\nConnie said she was initially reluctant to let her brother carry out his decision, but accepted it is his priority.\n'I didn't want him to retire. He still needs to earn a living while he's flying the flag for cancer research,' she said.\n'But he was quite decided, quite determined. This is where he needs to be right now in his life.'\nIn 2014, Samuel, raised over one and a half million dollars for cancer by uni-cycling across Australia - breaking the then-Guinness World Record for the most distance travelled on a one wheeler.","url":"https://www.dailymail.co.uk/news/article-4446934/Connie-Johnson-tells-s-spending-final-months.html"}
