{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 04:27:17","date_modify":"2018-10-23 04:27:17","date_publish":"2016-01-29 20:09:59","description":"George Barnes, 45, a Connecticut firefighter, and his wife, Nancie, 47, have been charged with cruelty to persons, unlawful restraint and risk of injury to a minor stemming from the alleged abuse.","filename":"data/vaneerConsumption/ConnecticutcouplechargedwithconfiningfiveadoptedchildrentobathroomforMONTHS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B5227100000578-0-image-a-99_1454098621265.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423362_Couple-charged-confining-five-adopted-children-bathroom-MONTHS-forcing-stand_1540268837.html","title":"Connecticut couple charged with confining five adopted children to bathroom for MONTHS","title_page":"Connecticut couple charged with confining five adopted children to bathroom for MONTHS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Connecticut firefighter and his wife have been arrested for allegedly keeping their five adopted children locked in a bathroom for months as punishment for bad behavior.\nGeorge and Nancie Barnes, of Watertown, were taken into custody Thursday on charges of cruelty to persons, unlawful restraint and risk of injury to a minor.\nMr Barnes, 45, and his 47-year-old wife adopted four of the children and were guardians to the fifth.\nPolice learned of the alleged abuse in mid-December after one of the children complained at school about the mistreatment at the hands of his parents.\nScroll down for video\nParents charged: George Barnes (left), a Connecticut firefighter, and his wife, Nancie (right), are accused of keeping their five adopted children, ages 9 to 18, locked up in the bathroom for months as punishment\nInvestigators determined that the parents would lock their children, ranging in age from 9 to 18, in the bathroom for long stretches of time and force them to stand up and read as punishment.\nNancie and George Barnes used baby monitors to keep an eye on the children and make sure they remained standing, according to police. The kids were also served their meals inside the bathroom.\nThe Barnes couple allowed their children to attend school during the day and sleep in their beds at night, but they had to be back in the bathroom in the morning, or after they returned home in the afternoon, the station WTNH reported.\nFor one of the children, the bathroom confinement lasted from September to December, when police learned of the allegations and had the youngsters removed from the Barnes household.\nThe five adopted kids have been placed in the custody of the Department of Children and Families.\nOfficials with the DCF said Mr Barnes, a volunteer firefighter and licensed EMT, and his wife, who works as a bookkeeper, had passed criminal and child-welfare checks and were licensed as an adoptive couple, reported the Hartford Courant.\nHowever, this is not the first time that the Barneses have been accused of mistreating the children in their care.\nFree: Mr and Mrs Barnes bonded out of jail Friday (pictured) after being arraigned on charges of cruelty to persons, unlawful restraint and risk of injury to a minor\nCruel: Years earlier, Nancie Barnes had allegedly asked the owner of a day care center to withhold snacks from two of her children as punishment for misbehavior\nThe owner of a local day care center where two of the couple’s kids were enrolled at one point revealed to NBC New York that about four years ago, Mrs Barnes came to her asking to withhold snacks from her children for misbehaving at home.\nRhonda Lagasse, who runs Watertown Little People, said she contacted the DCF about Nancie Barnes' unusual request and an investigation was conducted, at the conclusion of which the couple withdrew the kids from the day care center.\nGeorge and Nancie Barnes were arraigned Friday morning and released from jail after posting $35,000 bond each.\nA judge issued orders of protection prohibiting the parents from contacting their children. They are due back in court on February 24.","url":"https://www.dailymail.co.uk/news/article-3423362/Couple-charged-confining-five-adopted-children-bathroom-MONTHS-forcing-stand.html"}
