{"authors":["Sunni Upal For Mailonline"],"date_download":"2018-10-23 03:26:40","date_modify":"2018-10-23 03:26:40","date_publish":"2016-01-29 18:24:30","description":"Crystal Palace striker Connor Wickham has been handed a three-game ban by the FA for his elbow on Jan Vertonghen on Saturday.","filename":"data/vaneerConsumption/ConnorWickhamhandedthreematchbanforelbowonTottenhamsJanVertonghen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/25/13/308497C800000578-0-image-a-117_1453727758865.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423254_Connor-Wickham-handed-three-match-ban-elbow-Tottenham-s-Jan-Vertonghen_1540265200.html","title":"Connor Wickham handed three-match ban for elbow on Tottenham's Jan Vertonghen","title_page":"Connor Wickham handed three-match ban for elbow on Tottenham's Jan Vertonghen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crystal Palace striker Connor Wickham has been handed a three-game ban by the FA for his elbow on Jan Vertonghen on Saturday.\nThe former Sunderland man was charged with violent conduct for flinging an elbow at the Belgian - but the incident was missed by referee Martin Atkinson.\nHowever, FA chiefs have retrospectively punished the Eagles striker and he will miss his team's next three matches.\nPalace striker Connor Wickham was banned for three matches following a clash with Jan Vertonghen\nReplays appear to show that Wickham aimed an elbow at the Tottenham defender, who was later substituted\nA statement on the FA's website read: 'Following an Independent Regulatory Commission hearing today, Connor Wickham will serve a three-match suspension with immediate effect.\n'The Crystal Palace forward was charged with violent conduct following an incident with Tottenham Hotspur’s Jan Vertonghen in the 69th minute of the game on Saturday, which was not seen by the match officials but caught on video.\n'Wickham admitted the charge but mitigated against the standard three-match suspension, however, this was rejected by the Independent Regulatory Commission.'\nVertonghen left the pitch with a knee injury shortly afterwards and Spurs boss Mauricio Pochettino said: 'We have to wait and assess him. We hope it's not a big issue but we don't know for now. It was painful with his knee and ankle but tomorrow we need to assess him better.'","url":"https://www.dailymail.co.uk/sport/football/article-3423254/Connor-Wickham-handed-three-match-ban-elbow-Tottenham-s-Jan-Vertonghen.html"}
