{"authors":[],"date_download":"2018-10-22 22:17:45","date_modify":"2018-10-22 22:17:45","date_publish":"2014-06-09 18:09:21","description":"The promotion for Hillary Clinton's new book has the feel of a campaign rollout for a presidential candidate, and here comes the attack ads.","filename":"data/vaneerConsumption/ConservativeGroupHitsHillaryinnewTVad.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/497151/140609-140529-hillary-clinton-jms-1613-1407_5dc49971d81f10de9ee2767c2aeeb115.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_conservative-group-hits-hillary-new-tv-ad-n126486_1540246665.html","title":"Conservative Group Hits Hillary in new TV ad","title_page":"Conservative Group Hits Hillary in new TV ad","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe promotion for Hillary Clinton's new book already has the feel of a campaign rollout for a possible presidential candidate.\nAnd now comes the traditional response to a campaign -- an attack ad from the opposition.\nThe group Emergency Committee for Israel -- created in part by prominent conservative Bill Kristol -- is airing a TV ad criticizing Hillary Clinton for not condemning remarks from her successor, Secretary of State John Kerry, for saying that Israel risks becoming an \"apartheid state\" if it doesn't make peace with the Palestinians.\nThe Emergency Committee for Israel tells NBC News that the TV ad will air in DC and NYC tonight in conjunction with Clinton's interview on ABC. And the ad also will run on cable in the DC and NYC markets.\nTranslation: This isn't a HUGE buy. But it's noteworthy that this is the first TV ad hitting Clinton -- a year and a half before the first 2016 contests begin, and also before we know for sure Clinton will be running for the White House.","url":"https://www.nbcnews.com/politics/first-read/conservative-group-hits-hillary-new-tv-ad-n126486"}
