{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline","John Stevens","Deputy Political Editor For The Daily Mail"],"date_download":"2018-10-22 23:36:57","date_modify":"2018-10-22 23:36:57","date_publish":"2017-03-16 07:29:09","description":"The Tories failed to properly declare a total of £275,813 in campaign spending for the 2015 general election won by David Cameron.","filename":"data/vaneerConsumption/ConservativePartyisfined7000byElectoralCommission.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/217A548A00000578-0-image-a-8_1489649335181.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319104_Conservative-Party-fined-70-00-Electoral-Commission_1540251417.html","title":"Conservative Party is fined £70,00 by Electoral Commission","title_page":"Conservative Party is fined £70,00 by Electoral Commission | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fine: The Conservative Party has been fined £70,000 following an investigation into election campaign expenses including when David Cameron won the 2015 General Election\nThe Conservative Party has been fined £70,000 following an investigation into election campaign expenses and its treasurer referred to the Met Police, the Electoral Commission has announced.\nThe Tories failed to properly declare a total of £275,813 in campaign spending for the 2015 general election won by David Cameron.\nThis included £102,000 on its election Battlebus - but officials forgot to report £63,000 of the spending.\nThe party also failed to maintain records explaining the amounts it invoiced to candidates in three 2014 by-elections, for work on their campaigns, meaning their spending could not be verified.\nThe election watchdog also said that Theresa May's party also 'hindered and caused delay to the investigation'.\nTory party treasurer Simon Day has been referred to Scotland Yard over the campaign spending errors.\nSir John Holmes, Chair of the Electoral Commission said: 'Our investigation uncovered numerous failures by a large, well-resourced and experienced Party to ensure that accurate records of spending were maintained and that all of the Party's spending was reported correctly.\n'The rules established by Parliament for political parties and their finances are there to ensure transparency and accountability. Where the rules are not followed, it undermines voters' confidence in our democratic processes, which is why political parties need to take their responsibilities under the legislation seriously.'\nThe Tory election expenses scandal deepened last night as 12 police forces asked prosecutors to decide whether MPs should be charged over allegations of electoral fraud.\nUp to two dozen MPs could lose their seats or even be sent to jail along with their election agents over claims they broke rules on campaign spending.\nPrime Minister Theresa May is braced for the outcome of police investigations into a series of Tory MPs' election campaigns\nThe Crown Prosecution Service has received files of evidence from 12 forces, with a further five still investigating. Allegations centre on claims candidates in marginal seats wrongly declared the use of election battle buses and spending on hotels as national expenditure rather than local, for which there are tighter spending limits.\nParty chiefs were last night struggling to contain a mutiny from MPs who accuse them of 'casting them adrift'.\nThanet South MP Craig Mackinlay was said to have been interviewed under caution last week\nThe CPS yesterday said it had been passed files from Avon and Somerset, Derbyshire, Cumbria, Devon and Cornwall, Gloucestershire, Greater Manchester, Lincolnshire, Metropolitan Police, Northamptonshire, Nottinghamshire, West Yorkshire and Staffordshire.\nProsecutors said the files, which relate to Tory MPs who won seats at the 2015 General Election, were 'all under consideration'. They have until June to decide whether to charge anyone.\nBoth the CPS and police refused to name the MPs or agents under investigation. Derbyshire Police said it had sent two files to prosecutors. Investigations are still ongoing in Kent, Cheshire, Lancashire, the West Midlands and Warwickshire.\nA spokesman for Warwickshire Police said 'voluntary interviews have taken place with two individuals' and their investigation was 'nearing finalisation'.\nOn Tuesday it was revealed that Craig Mackinlay, who beat former Ukip leader Nigel Farage in South Thanet, was questioned under caution for six hours by Kent Police last week. Officers are deciding whether to send files to the CPS.\nMP WHO BEAT FARAGE COULD LOSE SEAT By John Stevens for the Daily Mail The Tory MP who beat Nigel Farage was last night a step closer to losing his seat after the Electoral Commission found his party had failed to declare thousands of pounds in hotel bills used by those helping his campaign. Ukip yesterday began selecting a candidate to stand in South Thanet in the hope a by-election is called if Craig Mackinlay resigns or is found guilty of electoral fraud. Mr Mackinlay won the battleground seat by 2,812 votes in the 2015 election but the Electoral Commission yesterday said the party had understated its campaign spending The Tories declared local expenses totalling £14,837.77, putting Mr Mackinlay just £178.61 under the spending limit for individual candidates. However, the investigation found it had not included expenditure including a £15,641 bill for rooms at the Royal Harbour Hotel in Ramsgate used by supporters. The findings are particularly embarrassing as activists thought to have stayed there include Theresa May's chief of staff Nick Timothy and her political secretary Stephen Parkinson, although neither is accused of culpability. Mr Mackinlay was interviewed under caution by Kent Police last week. He has denied any wrongdoing. A senior Tory party source last night said: 'If there is going to be a by-election anywhere then South Thanet is where it is going to be.' Ukip chairman Paul Oakden yesterday announced the party would start considering candidates for the seat in case it becomes vacant. Mr Farage has said he would 'probably' run in any by-election.\nThe allegations centre on whether the Conservative 'battle bus', pictured in Swindon during the campaign, should have been recorded as national or local spending\nEssex, Sussex and Wiltshire Police held their own probes but said they would not take further action. A separate Electoral Commission investigation into whether the Tories broke election spending limits is also under way and is expected to report back in the next few weeks.\nTwo close aides to Theresa May – Stephen Parkinson and Chris Brannigan – were caught up in the row about South Thanet last night after Channel 4 News reported they had campaigned in the seat. The broadcaster has already claimed it had seen documents that suggest the Prime Minister's chief of staff, Nick Timothy, played a central role in the battle to keep Mr Farage out of Parliament. None of the aides was responsible for how local spending was declared, and none is accused of any wrongdoing.\nTOP FIGURES IN THE FIRING LINE AS PARTY ENGULFED IN EXPENSES STORM Former Tory party chairman Lord Feldman was last night dragged into the election expenses row. The investigation has caused embarrassment to figures throughout the party Lord Feldman David Cameron's old Oxford University friend and tennis partner was co-chairman of the party during the 2015 General Election campaign and when the spending declarations were filed. In his role at the top of the party, he chaired its Executive Senior Management Team (ESMT), which decided to spend funds on battle buses that toured marginal constituencies in the final two weeks before the 2015 election. The Electoral Commission accuses the ESMT of failing to 'identify or consider' how the buses could break election rules if used to campaign for individual candidates. 'Little or no monitoring or supervision was put in place to mitigate the risk. This risk clearly materialised,' the report said. Lord Feldman, 51, who is described as Mr Cameron's 'oldest political friend', worked for his family's fashion firm and was made a peer by the former PM in 2010. He was not interviewed by the Electoral Commission for its investigation despite being the boss of treasurer Simon Day, who now faces potential criminal charges. He made no comment yesterday. Simon Day The Tory official signed the party's declaration of its spending for the General Election and three by-elections in 2014. The Electoral Commission has reported him to the Metropolitan Police over claims he failed to record or incorrectly recorded £275,813 in campaign expenditure. He could face up to one year in jail if found to have 'knowingly or recklessly' made a false declaration. The Commission report said it was 'satisfied beyond reasonable doubt' that he had not listed the spending correctly 'without reasonable excuse'. Mr Day was previously a partner at accountants BDO Stoy Hayward LLP. Mark Clarke The Road Trip 2015 battle bus campaign, which took supporters to target seats in the final days of the General Election campaign, was the brainchild of Mr Clarke. He became known as the 'Tatler Tory' after being tipped by Tatler magazine as future Trade Secretary. Mr Clarke hit the headlines in the wake of the election after claims he had bullied Elliott Johnson, an activist who committed suicide. He denies the allegations. Mr Clarke was expelled from the party and banned for life. The Electoral Commission interviewed him about his role organising the battle bus campaign during its investigation, but he is not accused of wrongdoing. NICK TIMOTHY AND STEPHEN PARKINSON Theresa May's chief of staff and political secretary, respectively, are among party activists who were based in South Thanet during the General Election campaign. The Electoral Commission report said hotel rooms used by party workers in the constituency should have been at least in part declared as local spending. Mr Timothy and Mr Parkinson are not accused of any wrongdoing and were not responsible for the spending declarations. GRANT SHAPPS Mr Shapps was co-chairman of the Conservative party from 2012 to 2015 and played a key role in Road Trip 2015, designed to win marginal seats in the General Election. He was interviewed by officials as part of the Electoral Commission inquiry – but was not criticised in any way.\nOne of the Tory MPs embroiled in the scandal has accused party chiefs of 'cocking up' and then 'casting them adrift'.\nIn an angry email to party chairman Sir Patrick McLoughlin, Lincoln MP Karl McCartney said: 'At what stage do you think you (the Party) might inform us that another media s***storm is coming? We didn't create this mess, the clever d***s at CCHQ [Conservative Campaign Headquarters] did, and I don't see their professional reputations being trashed in the media much.'\nA Conservative Party spokesman said: 'We are co-operating with the ongoing investigations.'","url":"https://www.dailymail.co.uk/news/article-4319104/Conservative-Party-fined-70-00-Electoral-Commission.html"}
