{"authors":["Ian Mason"],"date_download":"2018-10-30 17:53:39","date_modify":"2018-10-30 17:53:39","date_publish":"2018-07-03 23:46:06","description":"As Trump moves towards his decision on his nomination, some commentators on the legal right are anxious to avoid the mistakes of the past.","filename":"data/vaneerConsumption/ConservativesConcernedJudgeonTrumpsSCOTUSShortlistCouldBeNextAnthonyKennedy.json","image_url":"https://media.breitbart.com/media/2018/07/Justice-Anthony-Kennedy-AP-PhotoManuel-Balce-Ceneta.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_03__1540922019.html","title":"Conservatives Concerned: Judge on Trump's SCOTUS Shortlist Could Be Next Anthony Kennedy","title_page":"Conservatives Concerned: Judge on Trump's SCOTUS Shortlist Could Be Next Anthony Kennedy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The inclusion of Judge Raymond Kethledge on President Donald Trump’s shortlist to replace Supreme Court Justice Anthony Kennedy has some in conservative circles worried history may be repeating itself, Breitbart News has learned.\nThe Washington Post reported Monday that Kethledge, who sits on the U.S. Court of Appeals for the Sixth Circuit, met with the president along with fellow potential nominees Judge Amul Thapar, also of the Sixth Circuit; Judge Amy Barrett of the Seventh Circuit, and Judge Brett Kavenaugh. of the D.C. Circuit. Kethledge graduated from the University of Michigan Law School, worked for Sen. Spencer Abraham (R-MI), and was appointed to the bench by President George W. Bush.\nAs President Trump moves quickly towards his decision on his nomination to replace Justice Kennedy, some commentators on the legal right are anxious to avoid the mistakes of the past. No one with whom Breitbart News spoke suggested that Kethledge is a “closet liberal” like the notorious selections by previous Republican administrations of Justices Earl Warren, John Paul Stevens, and David Souter. Among some, however, there was an implication he could fit the mold of justices like Kennedy himself, who have, once confirmed to the Supreme Court, ruled further to the left than it was thought they would as they took their lifetime appointments.\nKennedy, for whom Kethledge clerked, was President Ronald Reagan’s final Supreme Court appointment, getting his nomination after Senate Democrats torpedoed his first two picks for the spot, Judge Robert Bork and Judge Douglas Ginsburg. Like Kethledge, Kennedy came with strong conservative bona fides. He moved in Reaganite circles dating back to the 40th president’s days as California governor and was selected at the personal recommendation of then-Attorney General Edwin Meese, among the most prominent leaders of legal conservatism in the 1980s and of all-time.\nKennedy, however, will be perhaps best remembered for those critical moments where he sided with the Court’s liberal wing. Most notably, he co-wrote the decision saving the then-only 19-year-old Roe v. Wade in 1992’s Planned Parenthood v. Casey, authored the opinions mandating homosexual marriage nationwide in Obergefell v. Hodges, granted federal habeus corpus rights to foreign terrorists captured on the battlefield in Boumediene v. Bush, and joined in Justice Stevens’ Massachusetts v. EPA majority allowing people to sue the federal government over global warming.\nAll of these 5-4 holdings, in which Kennedy proved the swing vote, relied in part on appeals to moral and philosophical considerations — rather than to the original public meaning of the Constitution — to reach their broad and unprecedented understandings of the Fourteenth Amendment’s Due Process Clause or other constitutional provisions. As Chief Justice Roberts wrote in his dissent from Obergefell, for example, “Whatever force that belief may have as a matter of moral philosophy, it has no more basis in the Constitution than did the naked policy preferences adopted in [the long overturned] Lochner [v. New York.]”\n“[H]ow consistently do potential nominees return to first principles, turning to what the Constitution originally meant?” James Phillips, a legal commentator who sits on the Executive Committee of the Federalist Society’s Religious Liberties Practice Group, urged the White House to keep in mind if they hope to pick the type of consistent originalist conservative they indicate they desire.\nThe Trump administration has, in fact, placed a premium on “originalism” — the philosophy that constitutional matters are best considered with reference to the original public meaning of the text when constitutional provisions were first written — in their judicial nominations. White House Counsel Don McGhan, for example, has made clear that all potential Trump Supreme Court nominees “have a demonstrated commitment to originalism and textualism.”\nDespite his generally conservative record of decisions on the bench, three sources familiar with Kethledge’s reasoning and judicial philosophy have raised concerns with Breitbart News over his tendency, not unlike his one-time boss Justice Kennedy, to resort to sweeping moral judgment, rather than constitutionally-mandated restraint, in reaching his opinions.\nThis emphasis on moral considerations over constitutional originalism can be seen in one of Kethledge’s opinions, United States v. Gabrion, where he wrote for the majority of the entire Sixth Circuit. Kethledge upheld rapist and murderer Marvin Gabrion’s death penalty which Gabrion’s lawyers sought to overturn in part based on Michigan’s lack of a death penalty. The murder took place on federal land, making Gabrion eligible for execution, to which the jury unanimously sentenced him.\nBoth a concurring opinion and the dissent criticized Kethledge’s use of moral considerations in determining whether the jury should have been able to hear evidence about how, if the murder had taken place nearby, outside of the national forest, Gabrion would not have faced death. “I do not think that the majority’s references to the jury’s moral judgment are necessary to resolve this case,” wrote Judge Eric Clay, who came to the same conclusion upholding Gabrion’s death sentence, but wrote seperately specifically to object to Kethledge’s sweeping moral reasoning.\nJudge Karen Moore, in dissent, disputes Kethledge’s “moral” framework, writing:\nRather than apply the Supreme Court’s conception of relevance, the majority fashions its own standard—“mitigation evidence encompasses both culpability and character, all to the extent relevant to the defendant’s personal responsibility and moral guilt. … I cannot support transforming the standard in such a way that precludes a defendant from presenting constitutionally relevant evidence simply because a panel of judges cannot see its moral relevance.\nKethledge defended his reasoning, but, crucially for judicial originalists, made no reference to the original public meaning of the Eighth Amendment’s prohibition on “cruel and unusual punishment.”\nAn opinion Kethledge joined in 2016 similarly raised questions as to the centrality of originalism in Kethledge’s approach to the Second Amendment.\nIn Tyler v. Hillsdale County Sheriff’s Dept., all 15 judges of Kethledge’s court reheard an earlier panel decision and ruled 9-6 in favor of Clifford Tyler, a Michigan man a magistrate sent for a brief stay at a mental health facility after his children found him distraught on learning his wife of 23 years had run off with another man — and his life savings — and called the police, fearing their father might harm himself. Thirty years later, Tyler sought to have his right to purchase a gun, lost forever as a result having been in a mental hospital for 30 days in the 1980s, restored. Kethledge sided with the majority, joining Judge Jeffrey Sutton’s concurring opinion, one of several siding with the man who, under Michigan law, had no mechanism to petition to dispute his status as “mentally ill” and who was unable to own firearms, despite having led an exemplary life without signs of mental illness for decades.\nKethledge had the option of joining one of several pro-gun opinions, including a heavily “original meaning” focused one which criticized the controlling opinion in the case for “giving little more than a nod to the originalist inquiry.”\nBut Kethledge instead joined the Sutton opinion, which focuses largely on the injustices endured by the mentally ill, criticizing the government for tacking too close to “the unfair generalizations that once applied to individuals with mental health challenges” in its arguments. Sutton, for example, made reference to the infamous 1927 Supreme Court case Buck v. Bell, that upheld Virginia’s eugenic sterilization laws for the mentally ill.\n“The key insight,” Sutton concluded, “is that no government may permanently deny rights based on generalizations stemming from classifications about any individual who once was institutionalized.”\nThe implications of Kethledge’s decision to join Sutton’s Tyler concurrence are uncertain, but may suggest a judicial philosophy on the Second Amendment that stands at odds with the originalist direction paved by Justice Antonin Scalia when he crafted the Heller decision.\nThese question marks over Kethledge’s approach to constitutional law gave the legal experts with which Breitbart News discussed the matter pause over his consideration for a lifetime appointment to the nation’s highest court, especially when some other names reputedly on President Trump’s shortlist raised no such misgivings.\nWhen Judge Kavanaugh, for example, addressed the very first major post-Heller Second Amendment case at the appellate level, he delivered a blistering, original meaning-driven dissent to the D.C. Circuit’s decision to uphold Washington, D.C.’s attempts to preserve as much of the very gun regulations at issue in the original Heller case as possible.\n“In my view, Heller and McDonald leave little doubt that courts are to assess gun bans and regulations based on text, history, and tradition,” Kavanaugh writes, adding later:\nThe Constitution is an enduring document, and its principles were designed to, and do, apply to modern conditions and developments. The constitutional principles do not change (absent amendment), but the relevant principles must be faithfully applied not only to circumstances as they existed in 1787, 1791, and 1868, for example, but also to modern situations that were unknown to the Constitution’s Framers.\n“Our role as a lower court is simply to apply the test announced by Heller to the challenged provisions of D.C.’s new gun laws,” Kavanaugh concludes, emphasizing judicial restraint.\nWhen another judge reportedly under close consideration for Kennedy’s post, Thomas Hardiman of the Third Circuit, wrote a concurring opinion in a post-Heller case on the application of laws prohibiting felons from possessing guns, he writes, “[A] common thread running through the words and actions of the Founders gives us a distinct principle to inform our understanding of the original public meaning of the text of the Second Amendment,” and engaged in an extensive historical analysis of the application of laws banning dangerous people from owning guns throughout the history of the United States, pre-constitutional America, and England.\nThis Hardiman opinion, in Binderup v. Attorney General, became an instant classic of Second Amendment originalism, thrilling the National Rifle Association and pro-gun rights legal scholars.\nGiven the long history of even solid-seeming conservative jurists giving conservatives cause for regret once seated on the Supreme Court, those sources familiar with Kethledge who spoke with Breitbart News emphasized their preference over him for candidates like these, about whom there are no doubts of their philosophical commitment to originalism and judicial restraint.","url":"https://www.breitbart.com/politics/2018/07/03/conservatives-concerned-judge-on-trumps-scotus-shortlist-could-be-next-anthony-kennedy/"}
