{"authors":[],"date_download":"2018-10-30 19:50:08","date_modify":"2018-10-30 19:50:08","date_publish":"2015-05-25 16:11:47","description":"WARSAW, Poland (AP) — Polish voters have sent a strong signal that they are unhappy with the country's direction, apparently unseating a president despite the country's years of fast economic growth and unprecedented stability. |","filename":"data/vaneerConsumption/ConservativeChallengerWinsPolishElectionSignalingRightwardShift.json","image_url":"https://media.breitbart.com/media/2015/05/ap_andrzej-duda_ap-photo2-1024x764.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_25__1540929008.html","title":"Conservative Challenger Wins Polish Election, Signaling Rightward Shift","title_page":"Conservative Challenger Wins Polish Election, Signaling Rightward Shift | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WARSAW, Poland (AP) — Polish voters have sent a strong signal that they are unhappy with the country’s direction, apparently unseating a president despite the country’s years of fast economic growth and unprecedented stability.\nAccording to an exit poll, challenger Andrzej Duda, a right-wing member of the European Parliament, won the country’s presidential election Sunday with 52 percent of the vote to 48 percent for the incumbent, Bronislaw Komorowski. Official results are expected late Monday.\nIf Duda’s win is confirmed, it could herald a major political shift in the European Union’s sixth largest economy, a nation that has been able to punch above its weight in Europe without belonging to the 19-nation eurozone. Poland’s influence is underlined by the fact that one of its own, Donald Tusk, now heads the European Council in Brussels.\nThe changing political mood could signal a return to power of Duda’s conservative Law and Justice party in the fall parliamentary election. That would cement Poland’s turn to the right, create a new dynamic with other European countries and possibly usher in a less welcoming climate for foreign investors.\nLaw and Justice presents itself as a protector of those who haven’t benefited from the capitalist transformation and as a defender of national interests abroad. It is staunchly pro-U.S., but has a sometimes defiant stance toward other European partners, which has created tensions in the past with the EU and neighboring Germany.\nDuda says he wants new taxes on the foreign-owned banks and supermarkets to protect Polish interests, suggesting an approach similar to that of Prime Minister Viktor Orban of Hungary. He also said he wants banks returned to Polish control.\nAnalyst Jacek Kucharczyk said Poland’s relations with other European powers will now depend on whether Duda sticks to the relatively moderate agenda he campaigned on or whether he embraces his party leader’s more combative foreign policy stance.\n“That would be a nightmare scenario for Polish foreign policy, because it would mean getting into conflicts with Germany and anti-EU stunts and aggressive rhetoric toward Russia,” said Kucharczyk, president of the Institute of Public Affairs, an independent think tank in Warsaw. “We are in for a bumpy ride. The only question is how bumpy it will be.”\nParty supporters, however, have been rejoicing since Duda’s apparent victory was announced late Sunday. They say the party will do much more to help the many Poles who have not benefited from the country’s economic growth, those who face low wages and job insecurity despite a quarter-century of growth. In his campaign speeches, Duda often spoke of the more than 2 million Poles who left in the past decade to seek better economic opportunities abroad.\nSupporters also say Duda will do more to fight for the country’s economic interests.\n“Andrzej Duda is a responsible person and will be a responsible president,” said Zbigniew Ziobro, a former justice minister when the Law and Justice party led the government. “He will fulfill Poland’s obligations toward NATO and the European Union, but he will definitely put more stress on Poland’s interests.”\nIn Moscow, the Kremlin said President Vladimir Putin congratulated Duda and “expressed confidence that building constructive relations between Russia and Poland … would strengthen security and stability in Europe.”\nThe rise of Duda also marks a generational shift in Polish politics. He would be the sixth president since the fall of communism in 1989, but at 43, the first too young to be a major participant in the 1980s struggle between communist authorities and the Solidarity opposition movement. He apparently won a significant share of young voters on Sunday.\nDuda said Monday he plans to leave Law and Justice, following a tradition of Polish presidents breaking formal ties to their parties to represent the entire nation.\nKomorowski left the pro-EU Civic Platform party when he won the presidency in 2010, but remained closely tied to it. Observers say was a key factor in his undoing, with voters punishing him for government corruption scandals and unpopular measures such as a rise in the retirement age.\n___\nAssociated Press writers Monika Scislowska in Warsaw and Lynn Berry in Moscow contributed to this report.","url":"https://www.breitbart.com/national-security/2015/05/25/conservative-challenger-wins-polish-election-signaling-rightward-shift/"}
