{"authors":[],"date_download":"2018-10-22 21:44:53","date_modify":"2018-10-22 21:44:53","date_publish":"2014-05-07 22:45:46","description":"Right-leaning groups have spent three times as much attacking Republicans as attacking Democrats.","filename":"data/vaneerConsumption/ConservativeGroupsSpendaFortuneAttackingRepublicans.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/427541/1405070-matt-bevin-jms-1740_44c851962dba2128c713aec84c5618b9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_conservative-groups-spend-fortune-attacking-republicans-n99861_1540244693.html","title":"Conservative Groups Spend a Fortune Attacking Republicans","title_page":"Conservative Groups Spend a Fortune Attacking Republicans","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHard-line conservatives have become Democrats’ unwitting allies in the battle to control Congress.\nConservative groups have together spent nearly $3 attacking Republican candidates for every $1 spent slamming Democrats, according to a Center for Public Integrity analysis of federal independent expenditure disclosures.\nIn all, from Jan. 1 through Tuesday, identifiably conservative political action committees, super PACs and nonprofit groups have spent about $10 million attacking Republican congressional candidates in advertisements and other communications.\nRead the Center for Public Integrity version of this story.\nIdentifiably liberal groups, meanwhile, have spent next to nothing attacking their own, instead spending millions of dollars either bashing Republican hopefuls or gushing about fellow Democrats through television, radio and Internet ads.\nSuch a dichotomy illustrates the persistent family feud between mainstream Republicans and their tea party-affiliated cousins, many of whom have forced GOP incumbents into bitter -- and expensive -- primary fights because they believe they’re not conservative enough.\nIt also provides a curious twist to the initially Republican-benefiting Citizens United v. Federal Election Commission decision of 2010, which led to the creation of super PACs and freed politically active nonprofit groups and union organizations to raise and spend unlimited amounts of money to spend supporting or opposing political candidates.\nDuring the 2010 midterm elections, conservative organizations hardly spent any money opposing Republican candidates, federal records from the first four months of that year indicate.\nTea party groups of today are unapologetic about their attacks on numerous Republican torchbearers. They say the candidates they support are bona fide conservatives better positioned to defeat Democrats in November’s general election.\nClub for Growth Action, the super PAC arm of the Club for Growth, has so far invested $2 million into attacks on several incumbent Republicans, including Sen. Thad Cochran, R-Miss.; Rep. Mike Simpson, R-Idaho; and Shane Osborn, a former Nebraska state treasurer who’s running for U.S. Senate.\nClub for Growth Action seeks to involve itself in contests “we feel that our resources can make an impact on the outcome of the race,” spokesman Barney Keller said.\nSo far, tea party groups are off to a lousy start. Tea party-backed candidates failed Tuesday in a long-shot primary bid to unseat House Speaker John Boehner, R-Ohio, and win North Carolina’s U.S. Senate primary. But they still sought to find a silver lining.\n“Whether we win or lose, the other side has had to campaign on our issues during these primaries,” said Russ Walker, national political director for FreedomWorks for America, which has this year spent more than $118,000 on advertisements and related expenditures primarily attacking Senate Minority Leader Mitch McConnell, R-Ky., and Cochran. “Our ultimate goal is to pass policy that’s lowering taxes and making government smaller.”\nMatt Bevin, who is challenging incumbent Sen. Mitch McConnell in Kentucky's Republican Senate primary, speaks to a gathering at FreePAC Kentucky, April 5, 2014, at the Kentucky International Convention Center in Louisville, Ky. Timothy D. Easley / AP\nOfficially, Republican Party officials are floating above the fray, and per usual, not endorsing candidates in primaries.\n“Voters in each congressional district know best as to who will make the best general election candidate,” National Republican Congressional Committee spokeswoman Andrea Bozek said.\nGOP brass are, however, hardly thrilled with their midterm election lot, regardless of their early success repelling tea party challenges.\nThree national-level party officials not authorized to speak on behalf of the party said they’re particularly concerned that protracted primary fights -- a la Mitt Romney in 2012 -- will hurt the party’s ultimate midterm congressional nominees by bleeding them of time and resources that could be better spent skewering Democrats.\nOne cited Cochran’s June 3 primary fight with state Sen. Chris McDaniel, who’s enjoyed heavy support from groups such as FreedomWorks for America and the Senate Conservatives Fund, as particularly troubling.\nDemocrats, for their part, are content to let conservatives continue to supply ammunition to its circular firing squad.\n“Anytime you have people spending large amounts of money to attack their own, you have a smile on your face,” said Peter Fenn, president of Fenn Communications Group, whose many Democrat-supporting roles include working as a surrogate spokesman for the presidential campaigns of Al Gore, John Kerry and Barack Obama. “You have what I like to call the cuckoo caucus going against hardened conservatives. It shows how extreme the Republican Party has become, and that helps Democrats.”\nSaid Matt Thornton, spokesman for Democrat-backing super PAC House Majority PAC: “Pass the popcorn. It’s indicative that the Republican Party is at war with itself… the longer they’re spending money against each other, the less time they’re spending against us.”\nMainstream conservative organizations are responding with big money of their own to parry tea party-affiliated groups’ offensives on established Republicans.\nThe U.S. Chamber of Commerce, for example, has so far spent $1 million on attack ads targeting tea party challengers. This includes $500,000 against Cochran primary challenger McDaniel in Mississippi and $200,000 against attorney Bryan Smith, who’s battling incumbent Rep. Mike Simpson in Idaho.\nThe U.S. Chamber spent another $300,000 against attorney Woody White, who lost Tuesday to former state Sen. David Rouzer in North Carolina’s 7th Congressional District GOP primary.\nIt’s also spent another $3.6 million through early May on positive ads boosting the images of several GOP candidates, including those such as McConnell, Simpson and U.S. Sen. candidate Thom Tillis in North Carolina who faced, or are facing, competitive primaries.\nChamber officials didn’t respond to inquiries Wednesday. But spokeswoman Blair Latoff Holmes told the Center for Public Integrity recently that the U.S. Chamber would “support free enterprise candidates aggressively and early” and that such support “is predicated on where the candidates stand on a broad range of issues that are important to the business community.”\nIn the Cochran vs. McDaniel primary, a super PAC formed by Cochran supporters and calling itself Mississippi Conservatives has spent $600,000 on ads pummeling McDaniel.\nThe YG Network, a 501(c)(4) nonprofit led by a former deputy chief of staff to House Majority Leader Eric Cantor, R-Va., spent $50,000 on phone calls and mailers opposing White in the North Carolina.\nSuper PAC American Crossroads, founded in part by GOP strategist Karl Rove, has yet to launch negative attacks against Republicans. But it has involved itself in Republican intramurals spending more than $1.8 million on positive ads that mostly urged North Carolina Republicans to vote Tuesday for Tillis over his tea party rivals.\nTillis won handily, and now faces Sen. Kay Hagan, the Democratic incumbent who’s already enjoying significant air cover from the likes of liberal super PAC Senate Majority PAC, which didn’t wait for Tillis to win his primary and has already lit him up with more than $2.4 million in negative ads.\n“We saw the need to boost the name ID of the candidates we support while also holding the Democrats accountable for their records,” American Crossroads spokesman Paul Lindsay said of his super PAC’s strategy.\nIn addition to these \"independent expenditures\" -- messages that overtly promote or oppose federal political candidate -- groups such as Koch brothers-backed Americans for Prosperity have sponsored a slew of so-called “issue ads” that mention federal-level politicians but don’t advocate for or against their election or defeat. Groups sponsoring issue ads aren’t required to disclose how much they cost or where they’re appearing, unless they’re run 30 days before a primary or 60 days before a general election.\nWhile both liberal and conservative groups will eventually fight each other full time, expect the right to remain at odds with itself for some time yet.\nRepublicans’ contested U.S. Senate primary in Nebraska isn’t until May 13, and the Kentucky primary, featuring McConnell and opponent Matt Bevin, is May 20. The winner will face well-funded Democrat Alison Lundergan Grimes.\nAnd it won’t be until Sept. 9 until the final GOP congressional primaries are conducted.\nOne, in New Hampshire, features former U.S. Sen. Scott Brown, R-Mass. Brown is in no way a tea party favorite. He faces accusations of carpetbagging and must fend off primary challenges from former U.S. Sen. Bob Smith, R-N.H., former state Sen. Jim Rubens and conservative activist Karen Testerman. The state of 1.3 million residents is already drawing super PAC interest.\nThis story was published by The Center for Public Integrity, a nonprofit, nonpartisan investigative news organization in Washington, D.C.","url":"https://www.nbcnews.com/news/investigations/conservative-groups-spend-fortune-attacking-republicans-n99861"}
