{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:48:38","date_modify":"2018-10-30 18:48:38","date_publish":"2016-11-23 01:33:47","description":"Leftwing professors are taking to Twitter to troll a new website launched by conservative student organization Turning Point USA (TPUSA). | Politics","filename":"data/vaneerConsumption/ConservativeStudentGroupTrolledforLaunchingProfessorWatchlist.json","image_url":"https://media.breitbart.com/media/2016/11/classroom-testing-school-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_22__1540925318.html","title":"Conservative Student Group Trolled for Launching ‘Professor Watchlist’","title_page":"Conservative Student Group Trolled for Launching ‘Professor Watchlist’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Leftwing professors are taking to Twitter to troll a new website launched by conservative student organization Turning Point USA (TPUSA).\nNearly 200 college professors are now listed on Professor Watchlist, which seeks to “expose and document college professors who discriminate against conservative students, promote anti-American values, and advance leftist propaganda in the classroom.” Visitors to the site are invited to “help us identify, and expose more professors who have demonstrated liberal bias in the classroom.”\nProfessors can be searched for by name or by school. In describing the site, TPUSA founder and executive director Charlie Kirk wrote:\nIt’s no secret that some of America’s college professors are totally out of line. Everyday I hear stories about professors who attack and target conservatives, promote liberal propaganda, and use their position of power to advance liberal agendas in their classroom. Turning Point USA is saying enough is enough. It’s time we expose these professors. Today, Turning Point USA is proud to announce the launch of ProfessorWatchList.org , a website dedicated to documenting and exposing professors who discriminate against conservative students and promote anti-American, left wing propaganda in the classroom.\nThe left, however, is mocking the site, claiming President-elect Trump and his supporters want to ban free speech.\nhow to #trollprofwatchlist\n1. go to https://t.co/xxobrwZqyX\n2. enter totally valid complaint\n3. screenshot, submit, tweet w hashtag\n4. glory — Shit Academics Say (@AcademicsSay) November 21, 2016\nIn response to the new website, NYMag.com asks, “So what exactly does Turning Point USA do when they’re not calling back to McCarthyism and making lists of college professors who have offended their conservative sensibilities?”\nOthers have joined in the mockery by registering a “complaint” about a “professor” at the website and then posting it on Twitter under the hashtag #trollprofwatchlist ­ . Some “professors” mentioned included Indiana Jones, “Clue” University’s Professor Plum, and Gilderoy Lockhart from Hogwarts School of Witchcraft and Wizardry.\nOther “complaints” were more political.\nSomebody has to do the obvious one . . . #trollprofwatchlist pic.twitter.com/yQzFjdjbqo — Melanie Mallon (@MelMall) November 22, 2016\nMelanie Mallon, aka “Popular Voter’s” suggestion for the watchlist is tweeted below with a complaint about Professor Donald Trump from Trump University. The problem: “Repeated attempts at censoring free speech; settling in court like a loser (the literature promised WINNERS would be teaching us); promised I would make money but all I got was this lousy swastika.”","url":"https://www.breitbart.com/politics/2016/11/22/conservative-student-group-trolled-for-launching-professor-watchlist/"}
