{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:20:35","date_modify":"2018-10-30 18:20:35","date_publish":"2016-02-17 16:17:44","description":"Inside sources at Twitter have confirmed that the platform is covertly silencing voices of dissent against trendy social justice narratives.","filename":"data/vaneerConsumption/ConservativeTwitterUsersShouldFightBack.json","image_url":"https://media.breitbart.com/media/2016/01/ap_twitter_ap-photo-1-e1453321650324.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_17__1540923635.html","title":"Conservative Twitter Users Should Fight Back","title_page":"Conservative Twitter Users Should Fight Back | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Inside sources at Twitter have confirmed that the platform is covertly silencing voices of dissent against trendy social justice narratives. Social media, once hailed as a democratizing force, looks set to ossify into another tool of establishment elites intent on controlling the flow of information.\nThere’s something particularly insidious about this, given that social media platforms rely on their users to generate content. Twitter draws its influence from the millions of users who produce and share information on the platform. The constant stream of information on Twitter, which attracts new users and affects the national political dialogue, flows entirely from a sea of unpaid users.\nThese users have no say in how the site is run, who is appointed to moderate their posts, or what new features are added. Now we know that they don’t even get a say in whether the site becomes politically biased in an election year. Old media barons at least had to pay professional journalists to disseminate their political narratives. On social media, everyone’s doing it for free — including people who don’t share any of Jack Dorsey’s opinions.\nWhat are those opinions? Well, they would not be out of place at a student sit-in at Rutgers or Missouri. Dorsey was once an “ardent internet feminist” — with the blue hair to prove it — and marched alongside Black Lives Matter protesters in Ferguson. Now it seems he also shares the regressive left’s determination to silence competing points of view.\nConservatives and cultural libertarians shouldn’t just whine on the Internet. They should take action. For years, social media companies have been besieged by a new wave of progressive advocacy groups who demand restrictions on political speech under the guise of preventing “online abuse.” These are the groups who now make up Twitter’s dystopianly-named “Trust and Safety Council.” If conservatives don’t want to be marginalised on the social web, they must form groups that are just as noisy — or at least, noisy enough for Twitter’s investors to hear them.\nThere are those who will disagree and say that the best option is to simply leave Twitter, or create an alternative. After all, isn’t that how conservatives countered the bias of the mainstream media? In broadcast, Fox broke the domination of liberal networks to become the most trusted national news channel in America, even among Democrats. On the internet, Breitbart’s traffic is surging ahead while competitors on the regressive left, like Gawker, decline. Couldn’t a fair and balanced competitor to Twitter do the same?\nThere’s no doubt that the moment is perfect for a competitor to emerge. Twitter’s stock is in freefall, active users are leaving the site, and investors are uneasy. Nevertheless, without active pressure from an organised force of conservative and culturally libertarian web users, there’s no guarantee that such a replacement wouldn’t follow the pattern of other social media sites: an initial commitment to free speech, followed by a series of capitulations to Silicon Valley progressives.\nFurthermore, a competitor that is too explicitly conservative would only attract conservative users. Outside of Facebook, social media’s demographics are still young and metropolitan, which favours the regressive left. Celebrities, who command the largest followings on social media, also skew left — or are at least advised by their PR consultants to do so. At best, a conservative competitor to Twitter would only create two ideological ghettos on the web, one populated by the regressive left, and another populated by conservatives, cultural libertarians, and dissident liberals. This would accelerate political polarization in the U.S, which is already higher than it has been for two decades.\nWhen political factions stop talking to each other, it hinders intellectual progress, which relies on arguments being tested by their most determined opponents. That’s why Steven Pinker, Jonathan Haidt, and other academics and cognitive scientists associated with the Heterodox Academy are pushing for more conservatives in the liberal-dominated social sciences. Although Pinker and Haidt are both self-identified liberals themselves, they also recognise that politically homogeneous bubbles do little but spread dogma. If two Twitters were to emerge, one conservative and one left-wing, that would be the result.\nConservatives and cultural libertarians are the most likely constituency to rise up, as they are the ones being predominantly targeted, but this is really a battle that should be taken up by all social media users. The Twitters and Facebooks of the world are not like the media empires of old; they are entirely reliant on users. Properly organised, users could hold them to account, in a way that would make investors sit up and listen — but they are not yet properly organised.\nThey should be organised, and they should be organised soon. Nothing less than the original dream of the open web, where information flows freely, unfiltered by establishment elites, is at stake. If a new class of domineering media barons is allowed to emerge, “new” media will soon look very much like the old.\nFollow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/02/17/conservative-twitter-users-must-fight-back/"}
