{"authors":["Matthew Debord"],"date_download":"2018-10-31 00:04:28","date_modify":"2018-10-31 00:04:28","date_publish":"2016-12-04 00:00:00","description":"The CVT-equipped car has in theory an infinite range of gearings and can match power to driving conditions to maximize fuel-economy.","filename":"data/vaneerConsumption/ConsumersdontlikeCVT.json","image_url":"https://amp.businessinsider.com/images/57f4fa0557540cb2018b4cfb-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_consumers-dislike-continuously-variable-transmissions-2016-12_1540944268.html","title":"Consumers don't like CVT","title_page":"    Consumers don't like CVT - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The 2017 Honda HR-V is a small crossover that comes with a CVT. Honda One of the big advantages that traditional gas-powered cars have over electric vehicles is that for people who like to feel the power of an engine, internal combustion is the way to go.\nElectric cars have lightning acceleration, but because they effectively have only one gear, they can feel a bit space-age and technical after that initial burst of speed.\nPlenty of drivers grew up on that visceral sense of having the car shift through the gears with an automatic transmission.\nPlenty of other drivers shifted the gears themselves with a manual. I learned to drive on an auto, but soon picked up the skills needed to \"drive stick,\" and I still prefer it.\nBut my feelings aside, traditional transmissions for gas cars are inherently not fuel efficient. Automakers have taken two paths to solve this problem: more forward gears; and continuously variable transmissions (CVTs).\nNeither is a perfect fix. Adding gears to an automatic transmission — 7-, 8-, and 9-speeds are becoming common — means that a car's computer needs to have modes that will enable more aggressive driving. Otherwise, the transmission's brain will make a beeline for the \"overdrive\" gears to max out the MPGs. Downshifts for acceleration can be balky: the power takes too long to come on.\nFor example, when you put a new Porsche 911 Carrera with an automatic transmission (a \"PDK\" dual-clutch set, actually) in Sport Plus mode, it will hold off on a shift from second to third gear for an eternity, if you aren't laying heavy on the throttle.\nCVTs eliminate this problem by eliminating the gears. The CVT-equipped car has in theory an infinite range of gearings and can match power to driving conditions to maximize fuel-economy. It's the ideal solution for vehicles were the MPGs matter and performance doesn't, such as hybrids and gas-sipping compact SUVs.\nCVTs have clear advantages. Honda\nTrouble is that consumers have been raised on a lifetime diet of old-school transmissions that pull hard when they're supposed to. PwC noted this in a recent report on trends in the auto industry, focusing on Honda's implementation of CVTs in many of its vehicles:\nHonda is taking a ... chance with its recent adoption of continuously variable transmissions (CVTs) across the bulk of its car lineup. Instead of cycling through fixed gears, these transmissions operate on pulleys that constantly adjust gear ratios to provide optimal performance in transferring power to the automobile's wheels. CVT technology delivers much better fuel economy because it eliminates inherent inefficiencies in fixed-gear transmissions that result in wasted energy. However, customers are not sold on CVTs yet; some complain that these cars are listless, especially during acceleration, because they lack the rhythmic higher revs and forward movement felt during traditional transmission up-shifting.\nObviously, this is a generational challenge: more mature drivers have long-held beliefs about how cars should behave.\nBut CVTs are routinely savaged by the automotive media, and there's a trickle-down effect. Enthusiasts are justified in despising the things. Just give me my 5-speed manual and a clutch! But most consumers will appreciate the better fuel economy once they get used to the CVT's quirks.\nThe system uses a belt instead of fixed gears. Honda\nI've driven plenty of CVT cars — my own Toyota Prius has a type of CVT — and I think they're fine. If I want quick access to horsepower and torque, I'm not going to worry too much about MPGs. And the CVT-equipped vehicles I've driven, after a brief learning curve, are plenty fast enough when needed.\nBut consumers' reactions shouldn't be underestimated. People are surprisingly conservative about new stuff when it comes to cars. Hybrids are the most successful new innovation to come along in half a century, and they succeeded mainly because they didn't ask drivers to accept a paradigm shift: they still ran on gas, for one thing.\nHowever, the history of the car business is one of constant incremental improvement. An automaker like Honda is playing a long game with CVTs. In a decade or so, memories of \"speeds\" in a car could be fading.","url":"https://www.businessinsider.com/consumers-dislike-continuously-variable-transmissions-2016-12"}
