{"authors":[],"date_download":"2018-10-30 18:14:29","date_modify":"2018-10-30 18:14:29","date_publish":"2018-08-24 00:00:00","description":"For five years, Caleb Clemmons has been in limbo fueled by mental illness and homelessness. It began with a social media post that he said was a joke, but the police said was a terrorist threat.","filename":"data/vaneerConsumption/ConsequencesgreatforCobbmanwhomadethreatonsocialmedia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/24/Videos/4468142.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_threat-made-soci_8635f82d93cbb571429962c62b8ebe1e__1540923269.html","title":"Consequences great for Cobb man who made threat on social media","title_page":"How a joke cost Caleb Clemmons everything, leaving him homeless","title_rss":"NULL","source_domain":"ajc.com","text":"On Monday, Caleb Jamaal Clemmons did what nearly every other 25-year-old does when he wakes up. He logged onto his social media accounts.\nFor the first time in five years, he logged on to Tumblr and wrote:\nEntire Days: *Standing in the street*\nThen, unlike most 25-year-olds, he did just that. Stood in the street. Or wandered around his makeshift Smyrna neighborhood.\n“I wanted to give a perceptive glance of what the journey has been for me,” Clemmons said of his Tumblr post. “There were days when just entire 24 hours I have just been standing in the street and ambling around Cobb County. They were notes from the experience.”\n08/22/2018 — Smyrna, Georgia — Caleb Clemmons surfs the internet in Smyrna, Wednesday, August 22, 2018. Caleb, 25, graduated from Douglas County High School and now spends most of his time at a local Cobb County library. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM) (The Atlanta Journal-Constitution)\nFor five years, Clemmons has been in limbo fueled by mental illness and homelessness. It began with a social media post.\nIn February 2013, the psychology major was jailed and kicked out of Georgia Southern University for the Tumblr blog post he wrote under the pseudonym, “irenigg:” Hello. my name is irenigg and i plan on shooting up georgia southern. pass this around to see the affect it has. to see if i get arrested.\nThree hours after his post, police came to his dorm. They found no weapons or evidence of a planned attack, but he was charged with making terroristic threats.\n“Honestly, it was an initial numbness, then there was a panic. It was like my mind was blown away,” Clemmons said. “I thought I was gonna be able to explain my way out of it. I thought I was gonna go home.”\nInstead, he sat in the Bulloch County Jail for six months because his family couldn’t afford his $20,000 bail. He was eventually sentenced to five years of probation and prohibited from using any social media during that time.\n08/22/2018 — Smyrna, Georgia — Caleb Clemmons’ old profile picture from his former Tumblr blog. When Caleb was a sophomore at Georgia Southern University he wrote on his Tumblr blog that he was going to shoot up the school. Hours later he was arrested and his world changed. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM) (The Atlanta Journal-Constitution)\nClemmons maintains that his post was a provocative joke — he wanted to see how long it would take for it to get noticed or for him to get arrested. Now he acknowledges that it was a mistake.\n“I wanted to see if it would manifest into something and get a few scares. As a person who is prone to humor, it was the kind of thing that would entertain,” Clemmons said. “That was the weight of it. Nothing deep at all. But I see now that it was a momentary lapse of judgment.”\nThreat or free speech?\nThere is never a good time to post even the vaguest of threats, even as an experiment. But Clemmons’ post could not have come at a worse time — just two months after 20 children and six adults were killed during the Sandy Hook Elementary School shooting in December 2012. And a week before his post, a student at Price Middle School in Atlanta was killed on campus in a targeted shooting.\nBetween the Columbine High School shooting in 1999 and Clemmons’ threatening post, there were 143 school shootings in America, including the Virginia Tech massacre that left 32 dead on a college campus.\n“It comes down to a few different things: was it a true threat, or was it something he said in jest?” Adelphi University internet law and digital ethics professor Mark Grabowski said. “If the statement can be reasonably interpreted by people as a joke, then it might not be considered a true threat. But if a court interprets that a message was intentionally threatening, it is treated as a threat regardless of whether the messenger has the means to carry the act out.”\nDanica Kombol, a social media strategist and CEO of the Atlanta-based Everywhere Agency, compares it to screaming “fire” in a crowded movie theater. The fire might not be there, but the fear and panic — and therefore the threat — is real.\n“Federal law has been criminalizing communicating threats since 1939,” Kombol said. “Just because it is social media, should he be exempt from those laws?”\nEarlier this month, Morehouse College launched an investigation into comments made by a student who suggested he planned to “shoot up” the Atlanta school. The student complained in a Twitter post about being on hold for three hours with the college’s financial aid office and wrote: “I’ve decided to become the first black man to shoot up a school.”\nIn the street\nSince his arrest and parole sentence in 2013, Clemmons has essentially been homeless. While wandering neighborhoods in 2014, he was charged with trespassing and given an 11-month jail sentence. During that jail stay, he was diagnosed with bipolar disorder.\n“His time in jail worsened his condition. This is a kid that had never been in trouble. He just wanted attention,” his grandmother Mary Jackson said.\nOn any given day, Clemmons just walks. Usually to a branch of the Cobb County Library off South Cobb Drive.\nSeveral people along South Cobb Drive near its intersection with I-285 noticed how out of place he looked walking along the affluent but busy stretch, and reached out to help.\n“I noticed him a month before I spoke to him,” said Angie Ross, who lives in the neighborhood and spotted Clemmons in July. “People would call the police on him and I didn’t know what to think about him either — until I stopped and talked to him.”\nIn early August, Ross posted a long message on the Nextdoor neighborhood message board telling people who Clemmons was and seeking help for him. It worked.\nRoss took Clemmons to doctor and social services appointments, while others have stepped up with food and clothes. Lawyers have reached out to Ross offering free legal aid, and someone offered to pay for his medicines. Through Nextdoor, Ross also got a long, detailed message from someone in social services offering guidance.\n“Caleb has an innocence about him,” said neighbor Karla Szaflarski, who has been in charge of collecting donations. “It has been life-changing to see how people have been so selfless and compassionate.”\nFinding help\nOn the day after his social media ban is lifted, Clemmons is seated at a neighborhood pool talking to Ross when Szaflarski approaches with a soft drink and a breakfast biscuit. He likes the outdoors and can’t stand confined places or being touched or touching some things.\nAs Szaflarski and Ross chat, Clemmons methodically and quietly crumbles the biscuit, still in the wrapper, between his thumb and index finger. He then opens the wrapper and eats the biscuit like an ice cream cone, never touching the contents with his hands. Crumbs spill down his shirt, but he ignores it.\n“I want to see Caleb thrive and have his potential reach its peak,” Szaflarski said. “I want to see him go through the worst and experience the best.”\nIt’s unclear what comes next for Clemmons.\nIn other news:\nWhat You Need To Know: Reality Winner\nHis grandmother said she talks to him daily, but said she is not equipped to take him in.\n“People are trying to get him good mental health,” Mary Jackson said. “This is the best shot he has had in getting quality help.”\nOn Thursday, Ross took him to see the county’s mental health specialist, where he received medicine and a new case worker.\n“It may take up to six months to get him permanent housing, but they will look into something temporary that is suitable for his illness,” Ross said.\nMeanwhile, Clemmons said he just wants to write and become a famous blogger.\nBut he has a warning for people who might follow him.\n“Honestly, what happened to me was appropriate. There had to be an example set so that people understand that what I did is not something that can be tolerated,” Clemmons said. “It was fair. I was just more disappointed with myself. So, consider what you are doing. Consider the isolation and the consequences.”","url":"https://www.ajc.com/news/local/threat-made-social-media-still-has-consequences-for-cobb-man/w5g6bXaOjkZUX4R4mjd7AP/"}
