{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-22 23:45:48","date_modify":"2018-10-22 23:45:48","date_publish":"2016-01-28 13:01:36","description":"Employees at a building site in east China became so angry that their wages were not being paid, they decided to teach their boss the ultimate lesson, yesterday they clamped his car in scaffolding.","filename":"data/vaneerConsumption/Constructionworkerslockbossscarinscaffoldingdemandingwages.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30A84BA000000578-0-image-a-37_1453983193096.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3420841_The-ultimate-car-clamp-Angry-construction-workers-lock-boss-s-car-scaffolding-demand-owed-salaries_1540251948.html","title":"Construction workers lock boss's car in scaffolding demanding wages","title_page":"Construction workers lock boss's car in scaffolding demanding wages | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Workers at a construction site in east China became so angry that their wages were not being paid they decided to teach their boss the ultimate lesson.\nIn a bid to get their wages, migrant workers from the Shangrao Economic Development Zone in Jiangxi Province, used scaffolding to lock their bosses car up so he was unable to drive anywhere, reports the People's Daily Online.\nThey used 12 long scaffolding poles to clamp down a Skoda belong to one of their bosses after a dispute over money between the company and the employees.\nNo escape: Builders in Sichuan Province, China, taught their boss the ultimate lesson when he didn't pay them\nTrapped: In a dispute over wages, workers in China used scaffolding to stop their boss getting away in his car\nIt's understood that the workers were to receive their owed wages before the upcoming Chinese New Year, so that they could go home to celebrate the occasion with their families.\nThe car reportedly belongs to one of the shareholders involved in the dispute.\nThe employees feared he would get away, so they made sure he couldn't by clamping the car with the building equipment.\nJust to be one hundred per cent sure he couldn't get away they also deflated the tyres.\nPictures of the trapped 4x4 show the poles tightly clamped together around the sorry looking car so it is unable to move.\nUltimate car clamp: They used 12 pieces of scaffolding tightly bolted around the car and let down the tyres\nPayback: This beige Skoda had no chance of driving off after its owner had a dispute with his employees\nOne of the workers spoke to a local reporter and said that his boss owes him 70,000 Yuan (£7,443) in wages, and he is still waiting for it.\nIn China, there are around 250 million migrant workers that have left their villages for better paid jobs in the city, often leaving their entire family behind for years at a time.\nIt's common that these Chinese migrant workers, often working as waiters and construction workers in Chinese cities, face the difficulty in receiving wages on time. Enforcement of laws to protect the group is also relatively weak.\nIt is unclear if the extreme clamping method by the employees at the Shangrao Economic Development Zone was successful.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3420841/The-ultimate-car-clamp-Angry-construction-workers-lock-boss-s-car-scaffolding-demand-owed-salaries.html"}
