{"authors":[],"date_download":"2018-10-22 22:37:31","date_modify":"2018-10-22 22:37:31","date_publish":"2014-06-10 17:36:37","description":"Two conservative House Republicans say that when their conference elects a speaker in 2015, they don't expect it to be John Boehner.","filename":"data/vaneerConsumption/ConservativesPredictBoehnerWontSeekAnotherTermasSpeaker.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/499871/140610-boehner_speaker-1324_a27022ee9c873931923d83d922306411.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_conservatives-predict-boehner-wont-seek-another-term-speaker-n127526_1540247851.html","title":"Conservatives Predict Boehner Won't Seek Another Term as Speaker","title_page":"Conservatives Predict Boehner Won't Seek Another Term as Speaker","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwo conservative House Republicans say that when their conference elects a speaker in 2015, they don't expect it to be John Boehner.\n\"I don't think he runs,\" Rep. Raul Labrador, R-Idaho, said at a monthly event held by the Heritage Foundation called Conversations with Conservatives.\nAnother conservative, Rep. Matt Salmon, R-Ariz., echoed Labrador, saying, \"I don't think he's going to come back as Speaker either.\"\nIn response, Boehner spokesman Michael Steel told NBC News: \"The speaker has said - publicly and privately - that he intends to be speaker again next year. That has not changed.\"\nThe question came after reports that top House Republicans would somehow punish those who attempted to stage any type of coup to overthrow Boehner during next year's election. Salmon said any attempt at retribution for those who voted against Boehner would be a \"boneheaded move.\"\n\"I think that would be the most boneheaded move, even making that kind of threat is a boneheaded move,\" Salmon said, \"I think that rather than trying to threaten with a heavy hand, it would be a lot better to work with the majority of the conference to make sure that we're appealing to the principals that the majority sees as the right way to go.\"\nIn January 2013, 12 Republicans declined to vote for Boehner for speaker, which was just six votes away from forcing a second ballot for speaker for the first time since 1923. Salmon voted for Boehner for speaker in 2013, while Labrador did not vote.\n\"We all serve at the pleasure of our constituents, OK, I was elected by my voters, they can unelect me in the next election,\" Salmon said, \"Our leadership also serves at our behest, they aren't our bosses, they actually report to us, that's the way it's supposed to be, we are their constituents and they serve at our pleasure.\"","url":"https://www.nbcnews.com/politics/congress/conservatives-predict-boehner-wont-seek-another-term-speaker-n127526"}
