{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 22:06:35","date_modify":"2018-10-30 22:06:35","date_publish":"2016-08-11 09:54:47","description":"The Guardian newspaper published a report dealing with equality in the car insurance industry, despite it being dismissed as being \"flawed\".","filename":"data/vaneerConsumption/ControversyAfterClaimDriversInEthnicallyDiverseAreasPayMoreCarInsurance.json","image_url":"https://media.breitbart.com/media/2016/08/multiculti.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_08_11__1540937195.html","title":"Controversy After Claim Drivers In Ethnically Diverse Areas Pay More Car Insurance","title_page":"Controversy After Claim Drivers In Ethnically Diverse Areas Pay More Car Insurance","title_rss":"NULL","source_domain":"breitbart.com","text":"Britain’s Guardian newspaper has splashed on a report dealing with equality in Britain’s car insurance industry, despite it having been dismissed as being “flawed” and compiled “by people with no understanding of how car insurers price their policies”.\nThe new report, co-written by former New Labour equality commissioner Trevor Phillips who recently said he “should have known better” on Muslims failing to integrate into British society, accuses the insurance industry of charging what amounts to an “ethnic penalty” to certain road users.\nThe paper states the report found those who live in neighbourhoods with a higher density of ethnic minorities pay up to £450 a year more for their car insurance, regardless of their own ethnic identity.\nPhillips’ report claims the discrepancy exists in both well off and poor areas, and that insurers are engaging in discriminatory practice, claiming there was what the paper called “evidence of systemic bias” and a “strong statistical relationship”. The Guardian reports the claim that the insurers have “definitely produced an inequality of outcome to the detriment of BME [black and minority ethnic] groups”.\nIt said up to 90 per cent of the difference between insurance premium prices appeared to be contingent on the ethnic makeup of an area.\nPhillips said:”Intuitively, most people assume that ethnic minorities are poorer than average and live in areas with elevated crime levels.\n“However, this explanation is hard to sustain, if only for the reason that the minority group mostly obviously affected in the UK, Indian-heritage Britons, are far wealthier than other racial minorities and economically almost indistinguishable from white Britons. In fact, this group is slightly more likely than white Britons to occupy higher-skilled professional jobs. Yet they, too, pay a significant ethnic penalty.”\nThe paper has called on insurers to end these discriminations in their premium calculations. Campaigning against another perceived injustice — the discounts given to on-average safer women drivers — led to a ban by the European Union in 2012, forcing insurers to give the same premiums to both sexes.\nThe insurance industry has reacted strongly to the report. The Guardian reports the remarks of the director of general insurance policy at the Association of British Insurers who said: “This report was compiled without any consultation with the insurance industry, by people with no understanding of how car insurers price their policies, and was paid for by a firm of solicitors with a vested interest in fuelling the compensation culture.”","url":"https://www.breitbart.com/europe/2016/08/11/controversy-claim-drivers-ethnically-diverse-areas-higher-car-insurance/"}
