{"authors":["Savannah O'Leary"],"date_download":"2018-10-30 22:24:36","date_modify":"2018-10-30 22:24:36","date_publish":"2014-08-15 18:44:23","description":"Chuck Hagel is a 68-year-old white male. He is America’s Secretary of Defense, having served since 2013. He was formerly a United States Senator. He also, apparently, presides over black female hairstyles in the military.\nIn April, Hagel and the…","filename":"data/vaneerConsumption/ControversialFemaleSoldierHairstylePoliciesAreUnderReviewBecauseTheyWereSuperRacist.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0e66d792-3c85-47f9-8d55-cda6c0fd3f8b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35928-controversial-female-soldier-hairstyle-policies-are-under-reviewbecause-they-were-super-racist_1540938276.html","title":"Controversial Female Soldier Hairstyle Policies Are Under Review...Because They Were Super Racist","title_page":"Controversial Female Soldier Hairstyle Policies Are Under Review...Because They Were Super Racist","title_rss":"NULL","source_domain":"bustle.com","text":"Chuck Hagel is a 68-year-old white male. He is America’s Secretary of Defense, having served since 2013. He was formerly a United States Senator. He also, apparently, presides over black female hairstyles in the military.\nIn April, Hagel and the military laid down new hairstyle restrictions that directly affected black women. Though the legislation was meant to maintain “uniformity among troops” by banning large cornrows, twists, and dreadlocks, black women took immediate offense. The regulations dictated that “braids or cornrows that are unkempt or matted are considered dreadlocks and are not authorized.”\nPredictably, a massive petition fired backlash at the discriminative policy. Marcia L. Fudge, the Ohio Democrat who is the chairwoman of the black caucus, articulated black women’s frustration perfectly. “One of the things they should not do is insult the people who’ve given up their time and put their lives at risk by saying their hair is unkempt,” she said.\n“One of the things they should not do is insult the people who’ve given up their time and put their lives at risk by saying their hair is unkempt.\"\nChuck Hagel was forced to reevaluate his decision, and ordered the secretaries of each military branch to conduct a policy review, and five months later, justice has been served, the New York Times reports.\nIn a letter to the chairwoman of the Congressional Black Caucus, Hagel has clarified that the military will expand its definition of acceptable haistyles to include cornrows, braids, and other hairstyles. He also intends to eliminate the “offensive language, including the terms ‘matted and unkempt,’ from both the Army and Air Force grooming regulations.”\nThat is all fine and well. Things are moving in the right direction. But this ridiculous blip indicates towards the Army's discriminative mindset, which continues to regard the white hair of women as the baseline for its policies.","url":"https://www.bustle.com/articles/35928-controversial-female-soldier-hairstyle-policies-are-under-reviewbecause-they-were-super-racist"}
