{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:21:46","date_modify":"2018-10-30 21:21:46","date_publish":"2015-10-16 16:59:54","description":"Controversy erupted over the U.S. Air Force dad who questioned a North Texas school district's dress code. Nasty Facebook posts, a protest to defend the school district's patriotic honor, and pronouncements of police protection dispatched district-wide for alleged death threats all came because an Iraq war veteran questioned something in the policy. |","filename":"data/vaneerConsumption/ControversyEruptsOverAirForceDadWhoQuestionedSchoolDressCode.json","image_url":"https://media.breitbart.com/media/2015/06/USAF66.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_10_16__1540934506.html","title":"Controversy Erupts Over Air Force Dad Who Questioned School Dress Code","title_page":"Controversy Erupts Over Air Force Dad Who Questioned School Dress Code","title_rss":"NULL","source_domain":"breitbart.com","text":"Controversy erupted over the U.S. Air Force dad who questioned a North Texas school district’s dress code. Nasty Facebook posts, a protest to defend the school district’s patriotic honor, and pronouncements of police protection dispatched district-wide for alleged death threats all came because an Iraq war veteran questioned something in the policy.\nBreitbart Texas reported that 11-year-old twin girls got in trouble for a dress code violation. The large Air Force emblem on the back side of their new zipper front hooded sweatshirts exceeded size compliance at Aubrey Middle School. Their dad, Phil Rolen, a disabled Air Force vet, asked the school district to re-evaluate the dress code policy over the 1 1/2 by 1 1/2 inch outerwear logo policy.\nRolen told Breitbart Texas via email he met with Aubrey Independent School District (ISD) Superintendent Debby Sanders on Monday, pointing out the policy only addressed store bought or “designer brand” emblems. It does not mention military or other recognized American pride symbols including the U.S. flag. According to Rolen, Aubrey Middle School principal Karen Wright and an Aubrey ISD police department officer attended.\nThat same day, Sanders emailed parents a letter announcing that an armed police presence would go into effect districtwide, stemming from a “parent and military veteran that Aubrey ISD student dress code prohibited his children from wearing certain items of outerwear containing emblems representing the United States Air Force.” She emphasized, “This issue has caused much public controversy and concern from our community,” as the reason to take “extra precautions” upping security measures. “Therefore, you and your children will see an increased presence of local police on all campuses.”\n“The letter sent people into a panic. I just couldn’t believe it,” Rolen told Breitbart Texas.\nIn other media reports, Sanders asserted the compliance issue was size-related and not over the logo’s pro-military message. However, on Tuesday night, a group of parents protested to defend their patriotism. “We want to show the world Aubrey ISD is patriotic,” Meredith Tenney told KTVT 11 (CBS). They voiced upset over “unwanted negative attention,” a backhanded slap at Rolen for talking to the media. The school felt wrongfully portrayed as unpatriotic in news coverage. They also held up signs to news cameras that read: “Patriotism is not measured by the size of dress code” and “What kind of patriot puts our children in danger?”\nBreitbart Texas reviewed Facebook posts in which individuals claimed bomb threats happened at the middle school, hurling insults at Rolen for questioning the decade old dress code. Some blamed him for the alleged threats, yet none cited substantiated incidences. One person threatened to post the Rolen family address online, if only she knew it. Another wrote: “All this public crap and him ranting and now others has now put OUR CHILDREN at harm to bomb threats. So way to go Phill Rolen way to go.”\nOne alluded to Ahmed Mohamed, the Irving teen who made international headlines for a perceived clock “hoax bomb” last month. “Phill Rolen, guess you should have sent them to school with a ‘clock’ so we don’t offend anti-Americans.” A lot of complaints about him “going on TV” to affect change, although he originally went to his principal.\n“This has never been about calling Aubrey unpatriotic but rather about the school not making a common sense decision on a USAF logo that clearly wasn’t a ‘designer brand,’” Rolen told Breitbart Texas.\nHe finds the community’s reaction all rather shocking. He also expressed disappointment with tone of the districtwide e-blast, which he feels positioned him as a threat to students. Rolen said it made him “look like some sort of crazy PTSD veteran safety threat, or someone inciting violence.” Rolen noticed the steady stream of angry social media messages started after the superintendent’s letter. He said he contacted the Denton County Sherriff’s Office and asked for increased patrols around his home.\nBreitbart Texas attempted to reach Sanders, who did not return our calls. Instead, Aubrey ISD’s newly hired Dallas crisis communications firm, Spaeth Communications spokeswoman Laurie Barnett responded by email. To our questions on specific credible threats made against the school or district, she wrote it was “not appropriate to discuss.”\nThe PR rep acknowledged that the reported police presence was in response to these threats. When asked if the district asserted that Rolen threatened the school, she said, “Not at all.”\nStill, a lot of rancor in the community directed at one man the district rep admits is not a threat.\nBreitbart Texas visited the middle school on Wednesday afternoon just before dismissal expecting to see visible reported armed police presence. “Officers from the Aubrey ISD, Aubrey police and surrounding agencies” were placed at all school campuses, according to the Denton Record-Chronicle. However, Breitbart Texas found no visible armed campus or city police presence stationed outside. It was quiet at the nearby high school, too.\nSanders acquiesced in the second paragraph of her Monday email. She decided “to allow students to wear larger military logos” only temporarily “until the dress code can be revisited.” For now, that may not matter to the Rolen girls. They are at home with the stomach flu, said Rolen.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/10/16/controversy-erupts-air-force-dad-questioned-school-dress-code/"}
