{"authors":["Charlie Nash"],"date_download":"2018-10-30 21:13:10","date_modify":"2018-10-30 21:13:10","date_publish":"2016-02-25 19:26:49","description":"Convicted Democratic state senator Leland Yee of California was a notorious opponent of the video game industry who praised feminist hero Anita Sarkeesian.","filename":"data/vaneerConsumption/ConvictedGunRunnerLelandYeePraisedAnitaSarkeesiansCrusadeAgainstVideoGames.json","image_url":"https://media.breitbart.com/media/2016/02/anita-sarkeesian-flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_25__1540933990.html","title":"Convicted Gun Runner Leland Yee Praised Anita Sarkeesian's Crusade Against Video Games","title_page":"Convicted Gun Runner Leland Yee Praised Anita Sarkeesian's Crusade Against Video Games | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic state senator Leland Yee of California, recently convicted for bribery and arms smuggling, was a notorious opponent of the video game industry who praised feminist hero Anita Sarkeesian.\nThe state senator made a career of attacking violent video games, blaming them for youth violence. In 2005 after the Grand Theft Auto: San Andreas ‘Hot Coffee’ mod was unearthed, Yee passed two California assembly bills that restricted the sale of mature video games to those under the age of 18 and where these games could be advertised.\nYee, who was also a vocal supporter of gun control, argued that playing video games “desensitized” young players to violence and “increased antisocial behaviour.” It was a Yee-sponsored anti-video game California law that was eventually struck down by the Supreme Court, with the late Justice Antonin Scalia writing the majority opinion in which video games were granted protection under the 1st Amendment.\nYet the anti-gun and anti-violence crusader was at the same time purchasing automatic firearms and shoulder-launched missiles from Islamic extremist group the Moro Islamic Liberation Front in the Southern Philippines and attempting to sell those weapons to undercover FBI agents posing as potential buyers. That’s right. Whilst Yee was complaining about virtual violence, he was trying to sell illicit weapons that could have ended up on the streets of America.\nBut that’s not all. During his anti-game crusades he found an ally: Feminist Frequency spokesperson Anita Sarkeesian, who also built her career by attacking video games not just for violence, but also for alleged misogyny.\nI commend Anita Sarkeesian for her willingness and courage to take on this important issue. For far too long, the video game industry has glorified violence against women and often depicted female characters as nothing more than sex objects. Such sexism is unacceptable and teaches our kids the wrong lessons. Those who have criticized Ms. Sarkeesian with such offensive comments should be ashamed. It is time for the industry to stop perpetuating stereotypes and further demeaning women.\nCharlie Nash is a contributor to Breitbart Tech and former editor of the Squid Magazine. You can follow him on Twitter @MrNashington.","url":"https://www.breitbart.com/tech/2016/02/25/convicted-gun-runner-leland-ye-praised-anita-sarkeesian-attacked-violent-video-games/"}
