{"authors":[],"date_download":"2018-10-30 18:48:43","date_modify":"2018-10-30 18:48:43","date_publish":"2016-11-30 19:20:00","description":"The Georgia Supreme Court’s unanimous decision erases a jury’s conclusion in July 2015 that Ellis was guilty of attempted extortion and perjury.","filename":"data/vaneerConsumption/ConvictionofDeKalbCEOBurrellEllisoverturned.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/30/Images/newsEngin.16983897_062415-ellis-bs1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_05783271eef103ddb38e622ce207e047__1540925323.html","title":"Conviction of DeKalb CEO Burrell Ellis overturned","title_page":"Breaking: Supreme Court tosses conviction of DeKalb CEO Burrell Ellis","title_rss":"NULL","source_domain":"ajc.com","text":"The state’s highest court delivered a stunning blow Wednesday to DeKalb County prosecutors when it threw out the conviction of CEO Burrell Ellis, ruling that he was denied a fair trial.\nThe Georgia Supreme Court’s unanimous decision erases a jury’s conclusion in July 2015 that Ellis was guilty of attempted extortion and perjury. The court found that the judge in the case restricted testimony that could have helped clear Ellis.\n“We find that the evidence presented at trial was sufficient to enable a rational trier of fact to find Ellis guilty … beyond a reasonable doubt,” wrote Justice Harold Melton. “We must nevertheless reverse Ellis’ convictions based on certain evidentiary errors that occurred at his trial.”\nEllis, whose term expires at the end of this year, has been suspended from office since he was indicted three and a half years ago. He served an eight-month prison sentence.\nDespite the Supreme Court’s decision, Ellis won’t return to the office he was twice elected to. DeKalb’s newly elected CEO, Mike Thurmond, takes office Jan. 1.\nEllis’ case now returns to DeKalb’s courts, where prosecutors will have to decide whether to seek a retrial. Ellis has already gone to court twice after his initial case ended in a mistrial when jurors couldn’t reach unanimous verdicts on any of the counts against him.\nEllis was convicted for trying to shake down Power and Energy Services for a $2,500 campaign contribution and threatening to end its $250,000 contract with the county. Ellis was also found guilty on three perjury counts for lying under oath about his role in awarding county contracts.\nThe Supreme Court found two significant violations of Ellis’ rights to a fair trial.\nSuperior Court Judge Courtney Johnson shouldn’t have prevented Ellis’ defense team from calling county contractors who didn’t feel they were threatened after declining to donate to his campaign, the high court said. Also, a special purpose grand juror shouldn’t have been allowed to testify about his opinion about the relevance of Ellis’ statements under oath that led to the perjury verdict.\nPlease read the full version of this story on MyAJC.com.","url":"https://www.ajc.com/news/local-govt--politics/conviction-dekalb-ceo-burrell-ellis-overturned/3jWVZK5MF0Opx423MCkYyH/"}
