{"authors":[],"date_download":"2018-10-30 20:36:39","date_modify":"2018-10-30 20:36:39","date_publish":"2015-10-16 14:10:10","description":"Fall is finally in the air across metro Atlanta, and there will be plenty evidence of that this weekend with temperatures dipping down to unaccustomed lows overnight and a long list of local events carrying a distinctly autumnal flavor.","filename":"data/vaneerConsumption/Coolertempsfallfestivalsplentyof.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/16/Videos/4561965300001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_atlanta-weekend-_fa8b8fbadd6505a5da6d3b78aec98ece__1540931799.html","title":"Cooler temps, fall festivals, plenty of...","title_page":"Atlanta weekend | Cooler temps, fall festivals, plenty of...","title_rss":"NULL","source_domain":"ajc.com","text":"Fall is finally in the air across metro Atlanta, and there will be plenty evidence of that this weekend with temperatures dipping down to unaccustomed lows overnight and a long list of local events carrying a distinctly autumnal flavor.\nThe Weather\nAfter what seems like weekend upon weekend of rain, not to mention the customary heat, the bone dry, cooler weather expected for Saturday and Sunday should be a great relief for many people.\nThere will be a definite chill in the air, though, especially for those who get up and out of the house early each day.\nTemperatures are forecast to dip into the 40s by early Saturday, a downward turn that will recur overnight Saturday into Sunday morning.\nChannel 2 Action News meteorologist Brian Monahan said a cold front passing through the area Friday is causing the dip.\nHow low will it go? The north Georgia mountains could see some patchy frost. Temperatures in the upper 30s are possible.\nDaytime highs around Atlanta will rebound nicely over the weekend, however, ranging into the 60s, maybe pushing toward 70. It’s not exactly summer on the beach weather, but it befits the various events and activities typical of the season.\n“We’ve got chilly temperatures but a lot of sunshine,” Monahan says, a fine mix for many activities.\n» Check the full forecast and track changes\nWhat’s Going On\nTo the north, in apple country, it’s the second weekend of the Georgia Apple Festival in Ellijay. Saturday and Sunday, hundreds of vendors will display their wares, including food, crafts and other handmade goods.\nDecatur always seems to have one festival or another going on, and this weekend will be no different. The Decatur Beer Festival is tap for Saturday downtown. From noon to 5 p.m., people can sample scores of craft beers, listen to live music and try various food offerings.\nAlso on Saturday, the 15th annual Little 5 Points Halloween festival will offer music, food and a big Halloween parade.\nSunday marks the 25th AIDs Walk Atlanta & 5k Run, the largest AIDS-related fund raising event in the Southeast, raising funds for AIDS service organizations across metro Atlanta. It all takes place at Piedmont Park.\nAtlantans can celebrate creativity at the Festival on Ponce, the arts and crafts festival set in historic Olmsted Linear Park. Festival-goers can check out the 125 displays of fine arts and crafts, folk and “outsider art.” In addition to the fine arts, there will be music, food and drinks. Attendance is free.\nThe Falcons played during the week, but there’s still football to be seen live in Atlanta this Saturday when the Georgia Tech Yellow Jackets try to rebound against Pittsburgh. Kickoff is set for 12:30 p.m. Thge University of Georgia Bulldogs take on Missouri Tigers at 7:30 p.m. on Saturday.\nFull list of weekend events here.\nGetting Around\nAs always, be mindful of the big crowds expected for some of those big events, particularly around the Georgia Tech campus before and after the game, at Piedmont Park and at Little Five Points.\nBeyond that, the Georgia Department of Transportation has a lengthy list of construction projects.\nWork planned over this weekend:\nThe Express Lanes project will require a traffic detour at Barrett Parkway. I-75 southbound traffic will be directed to exit the interstate at Barrett Parkway (Exit 269) then resume travel on the interstate via the I-75 southbound entrance ramp from Barrett Parkway from 10 p.m., Friday until 5 a.m., Sunday.\nOn I-575, one northbound lane will close between Barrett Parkway and Chastain Road and one southbound lane will close between Dupree Road and Towne Lake Parkway from 9 p.m., Friday until 12 p.m., Saturday for work on the Express Lanes project.\nOne northbound and one southbound lane will close on I-575 between SR 92/Alabama Road and SR 140/ Hickory Flat Road nightly from 9 p.m., Friday until 5 a.m., Sunday.\nThe Express Lanes Project will also require one northbound and one southbound lane closure on I-75 between Wade Green Road and Chastain Road from 9 p.m., Friday until 5 a.m., Sunday.\nAnd work on the Express Lanes Project will require one lane closure on I-285 eastbound just before the I-75 interchange from 9 p.m., Saturday until 5 a.m., Sunday.\nWork on the South Metro Express Lanes will require various lane closures on I-75 southbound between Jonesboro Road and SR 20/SR 81 from 9 p.m., Friday until 7 p.m., Saturday.\nOn I-75, one northbound lane will close between SR 120 Loop/South Marietta Parkway and SR 5/SR 5 Spur/ Canton Road Connector from 6:30 a.m., until 3:30 p.m., Saturday.\nPart of the exit ramp will close on I-75 northbound at the exit of Spring Street from 9 p.m., Friday until 5 a.m., Monday for work.\nOn I-85, crews will stripe the northbound and southbound on and off ramps between Cleveland Avenue and the I-285 interchange nightly from 9 p.m., Friday until 5 a.m., Monday. But no ramps will close at any time.\nOn I-20, two eastbound lanes and two westbound lanes will close between SR 280/ H.E. Holmes and SR 139/ Martin Luther King Jr. Drive from 9 p.m., Friday until 5 a.m., Monday.\nAlso on I-20, two eastbound lanes will close between Almon Road and SR 12/US 278 continuously from 9 p.m., Friday until 5 a.m., Monday.\n• Bridgework will require two southbound lane closures on I-285 at the Atlanta Road exit and one eastbound and one westbound lane closures on Atlanta Road continuously from 9 p.m., Friday until 5 a.m., Monday. Overnight pacing operations will require all northbound and southbound lanes to close on I-285 between Paces Ferry Road and Atlanta Road.\nOn I-285, a rolling closure will require two southbound lanes to close between the I-85 interchange and SR 8/ US 278/ Hollowell Parkway from 9 p.m., Friday until 5 a.m., Monday.\nThere will be additional rolling lane closures on I-285. Contractors will correct some striping on the east side perimeter between the I-20 interchange and the I-85 interchange nightly from 9 p.m., Friday until 5 a.m., Monday.\nSign structure work will require two westbound lanes and one eastbound lane closures on I-285 between the I-85 interchange and SR 14 SPUR/ SR 279/ Old National Highway from 9 p.m., Friday until 5 a.m., Monday.\nAlso on I-285, one eastbound and one westbound lane will close at SR 139/ Riverdale Road from 9 p.m., Friday until 5 a.m., Monday.\nSR 3/US 41/Northside Drive will close between the I-75 interchange and Collier Road for utility repairs. Traffic will be detoured to Howell Mill Road from 7 a.m., Saturday until 11 p.m., Sunday.\nResurfacing work will require one lane closure on SR 138 between SR 54/ Jonesboro Road and Government Circle and one lane closure on SR 54/ Jonesboro Road between Citizens Parkway and Oxford Drive from 9 p.m., Saturday until 6 a.m., Sunday.\nOn SR 166/Campbellton Road/Langford Parkway, one eastbound lane and one westbound lane will close between Barge Road to Sylvan Road nightly from 9 p.m., Friday until 5 a.m., Monday.\nAnd one lane will close on SR 279/Old National Highway from the Fayette County line to SR 14/ US 29/ Roosevelt Highway from 9 p.m., Sunday until 5 a.m., Monday for resurfacing.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.","url":"https://www.ajc.com/news/local/atlanta-weekend-cooler-temps-fall-festivals-plenty-roadwork/ihvOrbBTdmrLfVZXBloQSL/"}
