{"authors":[],"date_download":"2018-10-30 20:23:03","date_modify":"2018-10-30 20:23:03","date_publish":"2015-11-20 14:57:00","description":"Sunny skies are forecast for Saturday and Sunday, and the big orange orb in the sky means drivers will see plenty of orange barrels blocking interstate lanes for weekend road work.","filename":"data/vaneerConsumption/CoolertempsplentyofroadworkSnow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/20/Videos/4623388390001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_atlanta-weeken_2de3472492b88c92804ee0536ad1a8f1__1540930983.html","title":"Cooler temps, plenty of roadwork, ‘Snow...","title_page":"Atlanta weekend | Cooler temps, plenty of roadwork, ‘Snow...","title_rss":"NULL","source_domain":"ajc.com","text":"Sunny skies are forecast for Saturday and Sunday, and the big orange orb in the sky means drivers will see plenty of orange barrels blocking interstate lanes for weekend road work.\nHere’s where you can expect lanes to be closed:\nI-75 Express Lanes project will again result in detour and lane closings\nThe ramp from the Canton Road Connector to I-75 southbound in Cobb County will be closed from 9 p.m. Friday through 5 a.m. Saturday. Motorists wishing to go south on I-75 will have to take I-75 northbound to Barrett Parkway, exit and re-enter southbound I-75 there.\nOne lane of I-75 in each direction between Chastain and Wade Green roads will be closed during those same hours, as will two lanes of I-75 in each direction at Windy Hill Road.\nOn I-575, one lane in each direction between Bells Ferry Road and Ga. 92 will be closed all weekend.\nSign structure work on I-75 will close one southbound lane between I-575 and the Canton Road Connector from 7 a.m. to 3:30 p.m. Saturday, one southbound lane between I-285 and Cumberland Boulevard from 7 a.m. to 5 p.m. Saturday, and one northbound lane from Chastain Road to Ga. 92 from 7 a.m. to 5 p.m. Saturday.\nOn the other side of town, work on the South Metro Express Lanes project will close one southbound lane of I-75 between Jonesboro Road and Hudson Bridge Road from 9 p.m. Friday until noon Saturday.\nEast of Atlanta, one eastbound lane of I-20 will be closed all weekend between Almon Road and U.S. 278, along with the entrance and exit ramps.\nOn I-285, two northbound lanes between Donald Lee Hollowell Parkway and South Atlanta Road, and two southbound lanes near Washington Road, will be closed all weekend.\nAlso on I-285, up to three lanes in each direction will be closed all weekend between Chamblee Tucker Road and I-20.\nOne lane of Ga. 400 in each direction between Lenox Road and Holcomb Bridge Road will be closed nightly for striping.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\nSunny skies, much cooler temps on tap for the weekend\nChannel 2 meteorologist Karen Minton is forecasting partly sunny skies for Saturday and sunny skies on Sunday, with only a 10 percent chance of a scattered shower during the overnight hours Saturday night.\nAfternoon highs will be in the mid-50s Saturday and upper 40s Sunday, with morning lows around 43 Saturday and 37 Sunday.\n» Check the full forecast and track changes\nFootball and wrestling top weekend events\nGeorgia State takes on South Alabama at 2 p.m. Saturday at the Georgia Dome, while the Falcons play the Colts at 1 p.m. Sunday at the Dome.\nIn Athens, Georgia plays Georgia Southern at 7 p.m. Saturday at Sanford Stadium.\nPhilips Arena hosts the WWE Survivor Series wrestling matches at 7:30 p.m. Sunday.\nStone Mountain Park’s “Snow Mountain” attraction, which lets kids of all ages slide down a snow-covered lawn in front of Memorial Hall, opens Saturday for a three-month run.\n» Full list of weekend events","url":"https://www.ajc.com/news/traffic/atlanta-weekend-cooler-temps-plenty-roadwork-snow-mountain/cXzysyVeeIKM9JipEu2BhI/"}
