{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:32:46","date_modify":"2018-10-30 21:32:46","date_publish":"2017-01-11 12:59:24","description":"One of the first tenants to open at Atlantic Station has decided to close its doors.","filename":"data/vaneerConsumption/CopelandsCheesecakeBistronowclosedatAtlanticStation.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/11/Images/WPIMAGE_cmgajcfoodandmore_13045.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_co_91606dda8f8e00fbb0e54d3dd76ab4bf__1540935166.html","title":"Copeland's Cheesecake Bistro now closed at Atlantic Station","title_page":"Copeland's Cheesecake Bistro now closed at Atlantic Station","title_rss":"NULL","source_domain":"ajc.com","text":"One of the first tenants to open at Atlantic Station has decided to close its doors.\nNew Orleans-based Copeland's Cheesecake Bistro closed last week at 265 18th St. in Atlanta, according to Tomorrow's News Today.\nAl Copeland Investments, the company that owns the eatery, will keep open Copeland's of New Orleans restaurants in Kennesaw and at Cumberland.\nWhile it was open, Copeland's served a variety of Creole-inspired dishes including cajun crawfish macaroni and cheese, spicy herb fried chicken and crabmeat-stuffed ravioli as well as salads, pizza pasta bowls, soups, wraps and a selection of cheesecakes.\nA statement from Atlantic Station said the closure aligns with the shopping center's \"strategy to refresh restaurant concepts with the latest and best in fast-casual and fine dining experiences,\" and that a new concept for the space will be announced soon:\n\"In a mutual strategic decision with Atlantic Station, Copeland’s Cheesecake Bistro has decided to close its 18th Street restaurant effective immediately. Copeland’s will focus on its two Copeland’s of New Orleans franchise locations in the Atlanta area that “proudly serve customers the best of New Orleans creole cuisine” and “better represent the future of Copeland’s and our focus on growth within the company,” said Al Copeland Jr. The closing of Copeland’s Cheesecake Bistro also aligns with Atlantic Station’s strategy to refresh restaurant concepts with the latest and best in fast-casual and fine dining experiences. Plans for new dining concepts will be announced soon at Atlantic Station, the city’s original repurposed, revitalized development that today is Atlanta's premier in-town dining and shopping destination.\"\nCopeland's is the second big restaurant closure at the development in the past 12 months -- Ron Eyester's Diner closed in February 2016.\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instagram .","url":"https://www.ajc.com/blog/atlanta-restaurants/copeland-cheesecake-bistro-now-closed-atlantic-station/EWRZavSavaBSAoH33PnVxK/"}
