{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:58:35","date_modify":"2018-10-30 20:58:35","date_publish":"2015-09-30 13:34:01","description":"Copper's crashing prices cause devastating economic ripples around the world; China's 'climate change' promise may already be in trouble","filename":"data/vaneerConsumption/CoppersCrashingPricesCauseDevastatingRipplesWorldwide.json","image_url":"https://media.breitbart.com/media/2015/09/GettyImages-151974095.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_30__1540933115.html","title":"Copper's Crashing Prices Cause Devastating Ripples Worldwide","title_page":"Copper's Crashing Prices Cause Devastating Ripples Worldwide","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nNew York’s Obamacare Co-op collapses, the fourth so far this year\nCopper’s crashing prices cause devastating economic ripples around the world\nChina’s ‘climate change’ promise may already be in trouble\nNew York’s Obamacare Co-op collapses, the fourth so far this year\nPresident Obama\nOne of the hare-brained schemes in the Obamacare design was the establishment of a network of nonprofit insurance companies to compete with the established insurance companies, who were repeatedly painted as evil villains during the Obamacare discussions. The non-profit insurance companies are called “Consumer Oriented and Operated Plans,” usually abbreviated to “Obamacare co-ops.”\nThere were co-ops established in 23 states, and all but one lost money in 2014, and Iowa’s co-op, CoOportunity Health, failed spectacularly in December, 2014.\nFour more co-ops have collapsed in 2015, and on Tuesday, New York regulators announced the collapse of the biggest Obamacare co-op in the nation, Health Republic Insurance of New York.\nFurthermore, the Centers for Medicare and Medicaid Services (CMS) have admitted for the first time that there will be additional failures this year. Probably someone is going to get fired for making that admission.\nAt times like this, I like to recall that when Jonathan Gruber said that passage of Obamacare depended on the stupidity of the American people, he was referring to Obamacare supporters, not to people like me.\nThe reason the co-ops were failing is because they all did the same things: Since they are funded by Obamacare, they do not have to make a profit, so they gained market share by pricing premiums far below market rates. During 2014, the co-ops paid out $1.16 in insurance reimbursements for every $1.00 they collected in premiums. They could get away with this because they’re government agencies and don’t care who gets screwed.\nThe New York co-op has been even worse, paying out $1.40 in benefits for every $1 it got in premiums. They charged money-losing premiums to gain market share, but the more customers they had, the more money they lost.\nI described all this last month in my article, “Healthcare.gov — The greatest software development disaster in history”.\nIn that article, which I posted after months of investigation, I showed that the Obama administration threw away hundreds of billions of Medicare fund dollars into Obamacare exchanges, Obamacare co-ops, Obamacare risk corridors, and Obamacare web sites, all of which are drowning in red ink. The investigation revealed lying at all levels, including criminal fraud — which will never be prosecuted because criminal acts in Obamacare are immune from prosecution.\nThe collapse of the New York Obamacare co-op is a sign of things to come. The $710 billion Medicare fund that Obamacare confiscated has almost completely been used up, and so we can expect to see a lot more Obamacare collapses in the next few months. Bloomberg and NY State Dept. of Financial Services\nCopper’s crashing prices cause devastating economic ripples around the world\nCopper prices fell to $4920 per tonne on Monday, before recovering slightly. The price has been crashing, and is down 21% so far in 2015, after falling 16% in 2014. The current price is at a six-year low, just above the low of the financial crisis six years ago. The crash is expected to continue, with predicted prices at $4800 at the end of this year, and $4500 at the end of next year.\nJust as the 60% collapse in the price of oil has been disastrous for exporting countries around the world, including Russia, Iran, Saudi Arabia and Venezuela, the collapse in the price of copper is rippling throughout the world.\nThe copper crash is being mostly blamed on the slowdown in China’s economy, which is also causing drops in prices of coal, oil and metals.\nThe copper crash is causing crashes in the prices of stocks for mining companies. Miners are some of the largest companies in the world, responsible for hundreds of thousands of jobs in many countries. The world’s largest miner is Melbourne-based BHP Billiton, whose stock price has fallen 29% in the last three months. The second-largest miner, also Melbourne-based, is Rio Tinto, which is less dependent on copper, has limited it’s stock declines this year to 30%.\nHowever, stock prices for Swiss-based Glencore Plc, the world’s third-largest copper miner, fell 30% on Monday ALONE.\nThe result is a disaster for the African country Zambia, whose economy is heavily dependent on the price of copper. Glencore has announced plans to suspend operations in the country, which will result in the loss of thousands of jobs. Zambia’s currency, the kwacha, fell 13% against the dollar on Monday alone. Glencore is also suspending operations in the Democratic Republic of Congo.\nStock prices for another copper mining company, Phoenix AZ based Freeport-McMoRan Inc., fell over 10% on Monday, with the stock price now down 61% since the beginning of the year. Freeport announced earlier this month that it’s cutting in half its operations in Chile, and will be laying off hundreds of workers.\nAs I have been saying for many years, the world is in a deflationary spiral in this generational Crisis era. Deflation has gripped economies in Europe, America, China and Japan.\nThe deflationary spiral is affecting global stock prices, which fell to a two-year low on Tuesday, at the end of the worst quarter in years. Generational Dynamics predicts that there will be a global financial crisis and stock market crash, bringing the Dow Jones Industrial Average below 3000. Mining.com and Economist and BBC and Reuters\nChina’s ‘climate change’ promise may already be in trouble\nClimate change activists are ecstatic over a promise by China to implement a “cap and trade” system in 2017 to reduce greenhouse gas emissions. The way it works is to create a new class of synthetic securities backed by “carbon credits.” Each company receives a supply of these securities, and they can be bought and sold. Buying the securities gives a company the right to pollute more, and selling the securities obligates the company to pollute less.\nAs I wrote in 2007 in “UN Climate Change conference appears to be ending in farce,” “cap and trade” is a financial scam, and the securities are nearly worthless, in the same way that near-worthless securities were created from subprime mortgages. European nations implemented a cap-and-trade system that not only did not reduce carbon emissions, but probably increased them.\nThe recently exposed debacle with Volkswagen shows what can happen. VW implemented software in its cars to cheat on emissions tests, and implemented it in millions of cars in Europe. These cars are spewing huge amounts of emissions into the air, but thanks to the cheating software, official figures show much lower emissions. Now that the scam has been revealed it will be necessary to compute new figures, and news stories indicate that the new figures will be much higher than the old ones. So much for reduced emissions in Europe.\nThis brings us back to China. If the Europeans, with a supposedly open economy, can so easily cheat on emissions measurements, then it will be enormously easy for China to cheat. China can claim any emissions figures it wants, and nobody will even know, just as China lies about its military budget and other economic figures.\nChina has committed to reaching its carbon emissions targets by 2030, but what is really laughable is that China has not indicated what those targets are. So China is in a position to make up both emission statistics and emission targets as it goes along.\nBut already analysts are saying that China is going to have to back off from its promises, because the economy is slowing. According to an analyst:\nWith slowing energy demand in a slowing economy, the last thing these companies want is an extra cost associated with a carbon emissions commitment. They’ve got enough to worry about already. The launch of a nationwide [cap-and-trade] market at a time when they are having a difficult time to survive has the risk of not having enthusiastic participants at first.\nIn the meantime, with China opening new coal mines every week, does anyone seriously believe that any emissions will actually be reduced? Brookings and Bloomberg\nKEYS: Generational Dynamics, Obamacare, Co-ops, Jonathan Gruber, Health Republic Insurance of New York, copper, oil, Russia, Iran, Saudi Arabia, Venezuela, Chile, China, BHP Billiton, Rio Tinto, Glencore, Zambia, Democratic Republic of Congo, Freeport-McMoRan, climate change, cap and trade, Volkswagen\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/09/30/world-view-coppers-crashing-prices-cause-devastating-ripples-worldwide/"}
