{"authors":[],"date_download":"2018-10-30 18:34:16","date_modify":"2018-10-30 18:34:16","date_publish":"2016-10-04 20:40:29","description":"The DeKalb County Sheriff's Office asked Tuesday for the public's help locating Taiquan Mitchell.","filename":"data/vaneerConsumption/CopsseekTaiquanMitchellmurdererwhofledDeKalbcourt.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/03/Images/dekalb-guy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_authorities-can-_42c08a9c13bef76c207a2ac1a1ba4bcb__1540924456.html","title":"Cops seek Taiquan Mitchell, murderer who fled DeKalb court","title_page":"Cops seek Taiquan Mitchell, murderer who fled DeKalb court","title_rss":"NULL","source_domain":"ajc.com","text":"The DeKalb County Sheriff's Office asked Tuesday for the public's help locating Taiquan Mitchell, who left court Monday before hearing the jury find him guilty of murder.\nThe 24-year-old Atlanta man had been out on $125,000 bond in connection with the January 2014 death of Marcus Beanite Waters, 29, according to jail records. He left court during lunch and hasn't been seen since, the sheriff's office said.\nAnyone with information was asked to contact the DeKalb County Sheriff’s Office Fugitive Unit at 404-298-8402.\n>RELATED: Cops: DeKalb murder suspect forgot phone with ‘selfies’ at crime scene\n>RELATED: Large meth lab found 'directly' in front of DeKalb elementary school\nMitchell was granted bond on May 7, 2014, by Judge Asha F. Jackson, according to court records. The judge ordered the bond with the condition that the murder suspect wear an ankle monitor and be on house arrest.\nThe district attorney's office opposed the bond request, according to an agency spokesman.\nWaters died in a robbery on Carteret Place off I-285.\n-\nLike DeKalb County News Now on Facebook | Follow us on Twitter and Instagram","url":"https://www.ajc.com/news/local/authorities-can-find-convicted-murderer-who-fled-dekalb-court/XFXWQVZWsLbJBDOH8eyPHJ/"}
