{"authors":[],"date_download":"2018-10-30 20:16:09","date_modify":"2018-10-30 20:16:09","date_publish":"2016-02-26 23:18:09","description":"Police in three metro Atlanta counties are searching for a crew of serial shoplifters that they’re calling “The Baby Crew,” according to Channel 2 Action News.","filename":"data/vaneerConsumption/CopsGrouptookbabyalongonmetroAtlantashopliftingspree.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/26/Images/photos.medleyphoto.8812178.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-group-took-_4474c72b841f4dc5af26d6e7f607720b__1540930569.html","title":"Cops: Group took baby along on metro Atlanta shoplifting spree","title_page":"Cops: Group took baby along on metro Atlanta shoplifting spree","title_rss":"NULL","source_domain":"ajc.com","text":"Police in three metro Atlanta counties are searching for a crew of serial shoplifters that they’re calling “The Baby Crew,” according to Channel 2 Action News.\nThe crew consists of at least four people, including a man carrying an infant in a baby carrier, Alpharetta police said.\nSurveillance video from August showed a man with an infant in a baby carrier and teenager walking through the Macy’s at North Point Mall putting polo shirts into a diaper bag.\nWhen store security tried to stop the group, the man carrying the baby bolted from the store towards the parking lot. A witness outside thought the suspect was trying to kidnap the child, so he followed him and jotted down the license plate number, police told the station.\n“They placed this infant in danger,” Alpharetta Department of Public Safety spokesman George Gordon told Channel 2. “They’re teaching this juvenile a life of crime that’s going to get him charged.”\nIn addition to North Point Mall, police said the same group shoplifted from Stonecrest, Cumberland, Gwinnett Place and Lenox Square malls, the station said. Police told Channel 2 that they have identified and are looking for a possible female suspect, but are trying to identify the others in the video.\nAnyone with information on any of the suspects is asked to contact police.","url":"https://www.ajc.com/news/local/cops-group-took-baby-along-metro-atlanta-shoplifting-spree/ay6nQfG3m0uJm0sneG9NKM/"}
