{"authors":[],"date_download":"2018-10-30 18:39:50","date_modify":"2018-10-30 18:39:50","date_publish":"2017-01-19 21:24:00","description":"The Gwinnett County prosecutor arrested in a massive Dunwoody prostitution sting was caught on video in the act, according to warrants.","filename":"data/vaneerConsumption/CopsGwinnettprosecutorcaughtoncamerahavingsexwithprostitute.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/WSBRadio/2017/01/19/Images/photos.medleyphoto.12888557.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-gwinnett-pr_be0e3eec5315f7e0b162faaf006e47d0__1540924790.html","title":"Cops: Gwinnett prosecutor caught on camera having sex with prostitute","title_page":"Cops: Gwinnett prosecutor caught on camera having sex with prostitute","title_rss":"NULL","source_domain":"ajc.com","text":"The Gwinnett County prosecutor arrested in a massive prostitution sting this week was caught on video in the act, according to warrants.\nThe documents released Thursday say Christopher Quinn, a 46-year-old assistant district attorney, was a “member” of the “Gold Club.” The brothel was run out of an apartment complex across the street from the Dunwoody Police Department.\nQuinn, who is one of 56 people arrested in the case, is accused of going to the club’s website to set up an appointment, then having sex with a prostitute in December. A second escort service known as “Lipstick and Shoes” was allegedly tied to the Gold Club and was housed in different complexes.\nThe warrants say the Gold Club admitted customers by referral only and employed a “rigid organizational screening process.”\nPolice haven’t revealed exactly how, but they allege Quinn was seen having sex on camera and was also identified by his license plate.\nGwinnett County District Attorney Danny Porter said Wednesday he’s aware of the arrest and awaiting more information.\nQuinn’s attorney, Noah Pines, has declined to comment on the facts of the case. But he described Quinn as “an outstanding lawyer who finds himself caught up in the system.”\nQuinn turned himself in Tuesday and has been charged with pandering and violation of Georgia’s felony racketeering statute.\nHe is considered on leave from the DA’s office, where he works in the appeals section after years with the Fulton County District Attorney’s Office, Porter said.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/cops-gwinnett-prosecutor-caught-camera-having-sex-with-prostitute/TAFu6fI8mABpCVWGb0bW3N/"}
