{"authors":[],"date_download":"2018-10-30 20:32:16","date_modify":"2018-10-30 20:32:16","date_publish":"2015-11-17 14:09:05","description":"A Lilburn father confessed to killing his 12-year-old special needs son, but a motive remained unclear Tuesday, according to police.","filename":"data/vaneerConsumption/CopsLilburndadadmitstokillingspecialneeds12yearoldson.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/17/Images/photos.medleyphoto.8400445.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_cops-lilbur_e4b2010d487858e2c1633e9a740f240e__1540931536.html","title":"Cops: Lilburn dad admits to killing special needs 12-year-old son","title_page":"Cops: Lilburn dad admits to killing special needs 12-year-old son","title_rss":"NULL","source_domain":"ajc.com","text":"A Lilburn father confessed to killing his 12-year-old special needs son, but a motive remained unclear Tuesday, according to police.\nPolice said Fikri Erdem admitted to cutting his son Hakan’s throat with a large kitchen knife and stabbing himself in the arms before calling 911. Police have said the incident appeared to be a murder and attempted suicide.\nThe 47-year-old father is charged with one count of malice murder. He was still hospitalized under police guard Tuesday at Gwinnett Medical Center with non-life threatening injuries.\nSomeone answering the door of the family’s home on Remington Court declined to comment. Police said they had not history of calls to the home.\nNeighbor Mohommad Bhuyan told Channel 2 Action News that he has known the Erdems for 10 years and he often saw the father caring for his son, who was a Sweetwater Middle School student.\n“He’s a good guy,” Bhuyan said. “All the time he takes care of his son.” Several other neighbors said they either declined to comment or did not know the family.\nMonday night, police say Hakan Erdem a was found dead shortly after 9 p.m. in a small pickup truck in the back parking lot of the First Baptist Church in Lilburn. Police said the father drove to the church and committed the crime.\nWhile the church is near the family’s home, police said the family is not affiliated with the church and it was unknown why the father chose the church’s parking lot.\nFikri Erdem called his wife, Gunes Erdem, at 7:44 p.m. Monday - less than two hours before he called police to the church parking lot - and left her a voice mail message, police said. He told her he was sorry and asked her to tell their daughters that it was an accident. He then disconnected the call.\nAs Fikri Erdem was being taken to the hospital, Gunes and another woman arrived at the church and said they were on their way to the Lilburn Police Department to report that he and Hakan were missing.\nLilburn police Capt. Thomas Bardugon said Tuesday that Hakan was a special needs child, according to his mother, and the child suffered from cerebral palsy.\nHis mother told investigators that Hakan screamed and yelled a great deal and needed constant care. She told investigators Fikri Erdem had been unable to sleep for about 10 days.\nTragedy also struck the family in Lilburn in July 2011. Their house caught fire during a lightning storm, damaging the structure and displacing the family, according to a Channel 2 Action News report at the time. No one was injured.\nFikri Erdem, a native of Turkey, said at the time that he carried then-8-year-old Hakan to safety.\nPolice said once the father recovers from his injuries in Monday’s attack, he will be taken to jail to face the murder charge.\nUpdated information is available here.","url":"https://www.ajc.com/news/crime--law/cops-lilburn-dad-admits-killing-special-needs-year-old-son/0tf5vEUlTgyEg7NJrMmFdL/"}
