{"authors":[],"date_download":"2018-10-30 20:38:33","date_modify":"2018-10-30 20:38:33","date_publish":"2015-10-14 16:09:25","description":"A police officer fatally shot a gun-wielding motorist during a Wednesday morning traffic stop on I-75 in Bartow County, authorities said.","filename":"data/vaneerConsumption/CopshootskillsgunwieldingdriverduringBartow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/14/Videos/4557480061001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_gbi-cop-sho_0fbc31ef4071b2002d3595c3ee05ad6d__1540931913.html","title":"Cop shoots, kills gun-wielding driver during Bartow...","title_page":"GBI: Cop shoots, kills gun-wielding driver during Bartow...","title_rss":"NULL","source_domain":"ajc.com","text":"A police officer fatally shot a gun-wielding motorist during a Wednesday morning traffic stop on I-75 in Bartow County, authorities said.\nGeorgia Bureau of Investigation spokesman Scott Dutton said the Emerson Police Department was “working traffic” on the interstate when, just before 11 a.m., they discovered a tag violation on a passing vehicle. Emerson is about 40 miles northwest of Atlanta, just south of Cartersville near Allatoona Lake.\nAn Emerson officer pulled the car over near Ga. 113/Main Street. The officer ran the license of the driver, described only as a 27-year-old Georgia resident, and found outstanding felony warrants, Dutton said.\nThe officer and the driver were “engaged in conversation” when “things escalated,” the spokesman said.\nDutton wasn’t sure which came first but said the officer unsuccessfully deployed his Taser, and the driver pulled out a handgun and pointed it at the officer. The officer ordered the driver to put the gun down, but he did not, Dutton said, and the officer fired “multiple” shots.\nThe driver was hit and taken to a local hospital, where he was later pronounced dead. His identity was not immediately released Wednesday and neither was the officer’s.\nDutton said it was not immediately clear if the driver fired any shots at the officer. Specifics about the warrants for the driver’s arrest also were not available.\nThe GBI is investigating the shooting. Messages left with the Emerson Police Department were not returned Wednesday.","url":"https://www.ajc.com/news/crime--law/gbi-cop-shoots-kills-gun-wielding-driver-during-bartow-traffic-stop/WN4UtiLdy3j9u1AAIAkupL/"}
