{"authors":[],"date_download":"2018-10-30 18:03:55","date_modify":"2018-10-30 18:03:55","date_publish":"2018-08-22 16:39:03","description":"Antico Pizza and El Super Pan were caught selling booze to minors at The Battery. The Cobb County police department tested 10 businesses in The Battery, the 1.5-million-square-foot mixed-use entertainment behemoth attached to the Atlanta Braves' new stadium, SunTrust Park.","filename":"data/vaneerConsumption/CopsAnticoatTheBatterysoldboozetominorduringunderagesting.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/09/13/Images/BIZ_STONEBREWING-GERMANY_1_LA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-antico-the-_4d6671135b2641a134c65bcb7046f1c6__1540922635.html","title":"Cops: Antico at The Battery sold booze to minor during underage sting","title_page":"Cops: Antico at The Battery sold booze to minor during underage sting","title_rss":"NULL","source_domain":"ajc.com","text":"Two notable eateries at The Battery Atlanta sold alcohol to minors during a recent sting, Cobb County police announced Wednesday.\nAntico Pizza and El Super Pan were caught selling the booze Monday. Cobb cops tested 10 businesses at The Battery, the 1.5-million-square-foot mixed-use entertainment behemoth attached to SunTrust Park.\nDepartment spokeswoman Officer Sarah O’Hara told The Atlanta Journal-Constitution that the servers will be cited and will have to go to criminal court for the citation.\nREAD | Party scene around Braves’ SunTrust Park stadium missing one piece\nREAD | SunTrust Park starts second season with new food, beverage options\nThe eateries are given an administrative fee to pay, she said. It’s $750 for the first offense.\nMost restaurants are put on a calendar to be rechecked, O’Hara said.\nBelow are the spots that did not sell alcohol to a minor.\n• Goldbergs\n• Wahlburgers\n• Punch Bowl Social\n• Cru Wine Bar\n• Yard House\n• Feed Fried Chicken\n• Sports and Social\n• C Ellet’s\nLike Cobb County News Now on Facebook | Follow on Twitter","url":"https://www.ajc.com/news/local/cops-antico-the-battery-sold-booze-minor-during-underage-sting/H9528rAITZjNcfLIY2r3GK/"}
