{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:00:11","date_modify":"2018-10-30 20:00:11","date_publish":"2015-10-15 02:53:29","description":"The owner of a daycare center says she was hit in the face with a shovel after she refused to allow a drunken father to take his children.","filename":"data/vaneerConsumption/CopsDaycareOwnerHitwithShovelforRefusingtoLetDrunkDadTakeKids.json","image_url":"https://media.breitbart.com/media/2015/10/martha-mcclure-beaten-daycare-owner-GoFundMe.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540929611.html","title":"Cops: Daycare Owner Hit with Shovel for Refusing to Let Drunk Dad Take Kids","title_page":"Cops: Daycare Owner Hit with Shovel for Refusing to Let Drunk Dad Take Kids","title_rss":"NULL","source_domain":"breitbart.com","text":"The owner of a daycare center told police that she was hit in the face with a shovel by the girlfriend of a drunken father of three children in her care because she would not allow him to leave the center with the children.\nThe daycare center owner, Martha McClure of Ronan, Montana, told police that Francis Joseph Jackson, 31, showed up with a woman the daycare workers didn’t recognize and demanded that he be allowed to take his three children. Jackson is not the legal guardian. He also had a court order to stay away from the children.\nMcClure told police that Jackson also seemed inebriated, and she could smell alcohol on his breath.\nJackson allegedly got belligerent inside the daycare center when told he wouldn’t be allowed to take his kids. Police reported that “at some point the male struck [McClure].” He also began throwing toys and other objects.\nPolice reported that the daycare center owner ordered the pair to leave and she followed them outside to make sure they left. Outside, they exchanged words again, and the woman accompanying Jackson grabbed a shovel and hit the daycare worker in the face, causing severe damage.\nThe daycare center operator reported that she had surgery after the beating and faces a long road to recovery. A friend of McClure set up a GoFundMe page to help her with the medical expenses, especially the costs of eye surgery.\nPolice apprehended Jackson, but his girlfriend is still at large. Jackson was charged with assault, aggravated burglary, and custodial interference, and will be extradited to Lake County.\nFollow Warner Todd Huston on Twitter @warnerthuston, or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2015/10/14/cops-daycare-owner-hit-shovel-refusing-let-drunk-dad-take-kids/"}
