{"authors":[],"date_download":"2018-10-30 20:08:55","date_modify":"2018-10-30 20:08:55","date_publish":"2017-03-17 15:37:00","description":"An employee of Avondales Estates’ Pallookaville Fine Foods is accused of stabbing a co-worker in the back “at least” 11 times with a butcher knife.","filename":"data/vaneerConsumption/CopsPallookavilleworkerstabscolleague11timeswithbutcherknife.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/11/28/Images/photos.medleyphoto.12321493.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-pallookavil_90a7e016b0a83b0b136a7b23a026a655__1540930135.html","title":"Cops: Pallookaville worker stabs colleague 11 times with butcher knife","title_page":"Cops: Pallookaville worker stabs colleague 11 times with butcher knife","title_rss":"NULL","source_domain":"ajc.com","text":"An employee of Avondales Estates’ Pallookaville Fine Foods is accused of stabbing a co-worker in the back “at least” 11 times with a butcher knife, police said.\nIan Clayton, 27, allegedly wielded the 7-inch blade around 5:30 p.m. Tuesday with customers inside the quirky eatery, arrest warrants allege.\nThe co-worker is recovering in the hospital. The suspect is in the DeKalb County jail without bond, charged with aggravated assault.\nThe restaurant, which closed down after the attack, is back open.\n“Thanks for the community support and concerns!” the company said in a statement on its Facebook page Wednesday. “(The victim) is in stable condition and in good spirits at the hospital today.”\nQuestions remain three days later.\nPolice haven’t revealed an alleged motive, other than an argument between the men.\nA woman in the circus-themed downtown restaurant, known for its giant corndogs and custom sodas, told police she was eating when the violence broke out.\nShe was applying pressure to his wounds with towels when police arrived.\nAnother worker told police he saw Clayton pushing the victim and then begin to attack him.","url":"https://www.ajc.com/news/local/cops-pallookaville-worker-stabs-colleague-times-with-butcher-knife/moYe6hRzzk6CfevwvZMRAM/"}
