{"authors":[],"date_download":"2018-10-30 18:38:51","date_modify":"2018-10-30 18:38:51","date_publish":"2016-11-17 21:22:00","description":"Six people were arrested after a large fight among students and adults, including one who had a gun, at a DeKalb County high school.","filename":"data/vaneerConsumption/CopsManhadguninlargefightamongadultskidsinDeKalbschool.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/17/Images/Redan%20high.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-man-had-gun_bff2bd16a48efeae568461b291789138__1540924731.html","title":"Cops: Man had gun in large fight among adults, kids in DeKalb school","title_page":"Cops: Man had gun in large fight among adults, kids in DeKalb school","title_rss":"NULL","source_domain":"ajc.com","text":"Six people were arrested after a large fight among students and adults, including one who had a gun, at a DeKalb County high school.\nIt happened Wednesday at 10:30 a.m. in a hallway at Redan High in the Stone Mountain area, according to warrants released to The Atlanta Journal-Constitution.\nDeKalb County Schools spokesman Quinn Hudson said the district intends to help see the incident \"prosecuted to the fullest extent of the law.\"\n\"The health and safety of all our students and staff are our most important priorities,\" he said in a Thursday email. \"The incident was immediately brought under control by district police and several arrests were made.\"\nIt's not clear what led to the fight. It also wasn't clear why the adults were in the school.\nThose arrested were adults, except for a 17-year-old girl and boy. Several of the adults appeared to be parents. All were charged with fighting and disrupting a public school, which are misdemeanors.\nSteven Greene, 34, of Atlanta, was also charged with a felony count of carrying a gun into a school. He's accused of having a semi-automatic handgun, according to police.","url":"https://www.ajc.com/news/local/cops-man-had-gun-large-fight-among-adults-kids-dekalb-school/3KPcfQOKw7l8jYRJBR8pZM/"}
