{"authors":[],"date_download":"2018-10-30 14:26:30","date_modify":"2018-10-30 14:26:30","date_publish":"2016-12-14 20:53:00","description":"A Gwinnett man was recently arrested after he allegedly fired a handgun into the air near an Alpharetta  bar.","filename":"data/vaneerConsumption/CopsManhidesgunnearAlpharettabartellscopstheywontfindit.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/WHIO/2016/04/06/Images/photos.medleyphoto.9289005.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-man-hides-g_5148a58508f15552add5d2a0d456aa46__1540909590.html","title":"Cops: Man hides gun near Alpharetta bar, tells cops they won't find it","title_page":"Cops: Man hides gun near Alpharetta bar, tells cops they won't find it","title_rss":"NULL","source_domain":"ajc.com","text":"A Gwinnett man was arrested after he allegedly fired a handgun into the air near an Alpharetta bar. He later taunted officers, saying he'd find the hidden gun before them, police said.\nWilliam Brewer, 33, of Sugar Hill, was charged with discharging a firearm in city limits and disorderly conduct under the influence of alcohol, according to an incident report.\nThe Dec. 10 report states that moments after an officer at Alpharetta City Hall heard a gunshot, a 911 caller reported that someone fired into the air near 3 South Main St.\nWitnesses said they asked their friend, Brewer, to leave after he got in an argument with someone near the alley by Butcher & Brew and South Main Kitchen.\nBrewer allegedly said no, took out a 9mm Glock pistol and \"fired one round into the air straight up above his head.\"\nThe witnesses ran away, afraid, and Brewer walked the other way. When Brewer returned to the scene, he told police he threw the gun in the alley behind some bushes, according to the report.\nA 9mm casing was located, but the firearm was not.\nOn the way to jail, Brewer reportedly \"spontaneously utter(ed)\" that he owned a Glock, and said there's no proof he shot the gun in the air.\n\"I know how the game is played and I can't tell you where the gun is because I am going to find it before you do,\" he said, according to the report.","url":"https://www.ajc.com/news/local/cops-man-hides-gun-near-alpharetta-bar-tells-cops-they-won-find/3V8C7jbKRBrVoHSZBl07IL/"}
