{"authors":["James Wilkinson For Dailymail.Com"],"date_download":"2018-10-22 21:13:14","date_modify":"2018-10-22 21:13:14","date_publish":"2017-03-16 00:49:46","description":"An alleged multi-million dollar scheme to steal goods from stores across 28 states has ended with 12 people indicted on multiple charges, including alleged ringleader Richard Rimbaugh.","filename":"data/vaneerConsumption/Copsarrest12inhightech12mcrimering.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FD70200000578-0-image-a-11_1489623575576.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318428_Cops-arrest-12-high-tech-12m-wide-crime-ring_1540242794.html","title":"Cops arrest 12 in 'high-tech $12m crime ring'","title_page":"Cops arrest 12 in 'high-tech $12m crime ring' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An alleged multi-million dollar scheme to steal goods from stores across 28 states and resell them on Amazon and eBay has ended with 12 people indicted on racketeering and theft charges.\nThe ten-month probe, named 'Operation Sticky Fingers,' claimed Richard 'The General' Rimbaugh, 64, would send out thieves with security-disabling devices to steal items on a daily basis.\nPolice seized 5,300 items and more than $8 million when they swooped on the ring, which was based in New York and believed to have been running for 20 years, Staten Island Live reported.\n'This was a sophisticated, ongoing enterprise,' New York State attorney general Eric T Schneiderman said. 'It was run with military-like precision.'\n'Leaders': Cops say Richard 'The General' Rimbaugh (left), 64, and George 'The Field Marshall' Athanasatos (right), 62, headed-up a multi-million-dollar theft and resale operation\n'Captains': They would pass demands for specific in-demand items through captains (l-r) George Rapatsouleas, Roger Ringhiser and Gregory Anastasaiou, cops said\nOfficials say Rimbaugh, of Manhattan, and George 'The Field Marshall' Athanasatos, 62, of Brooklyn, would demand specific items from the team, based on resale value.\nThey included printer cartridges, GPS devices and athletic smart watches.\nThe four crews, which were organized, Mafia-style, with lieutenants and sub-lieutenants, would then go out and raid stores such as Target, Best Buy and Staples, authorities say.\nThey would allegedly travel around the country, roving from state to state, stealing every single day in organized raids to keep ahead of the law.\n'They were instructed to which stores to hit and not to hit,' Schneiderman said. 'They understood they had to keep moving.'\nAthanasatos provided the teams with 'bazookas' - special vests that can hide large quantities of stolen goods - as well as 'kryptonite' devices that disable security alarms at store exits, he added.\nThey also had radios to listen in on security staff and technology to unlock and remove security devices, officials say.\nHigh-tech: The teams used high-tech devices to disable security in stores, then shipped goods to Rimbaugh for resale, cops said. (l-r) Robert Scarano, Krissylee Harris and Frank Albergo\nUS-wide: The teams operated across 28 states, stealing on a daily basis, according to investigators (l-r) Joseph Pooler, Giovanna Bonello, Nusret Srdanovic, Kevin Cerrato\nThe items would then be shipped back to Rimbaugh's address and resold for 30-50 per cent of the recommended retail price online, cops say.\nThe team, who are aged 22 to 59 and have nicknames such as 'Baby-Arm Johnson' and 'Nipplehead,' had resold at least $12 million in merchandise since 2012, police claim.\nMre than $8 million was seized in cash and from bank and PayPal accounts by police.\nThe defendants face charges of enterprise corruption, money laundering, criminal possession of stolen property and conspiracy.\nThey each face up to 25 years in prison if convicted.\nThe investigation was conducted by the attorney general’s Organized Crime Task Force with support from the New York State Police.\nHaul: NY state attorney general Eric Schneiderman (pictured with evidence) said cops took in $8m in money and more than 5,300 stolen items when they performed their raid\n'Military-style': Schneiderman said the 'sophisticated' gang uncovered by 'Operation Sticky Fingers' ran with 'military-like precision'","url":"https://www.dailymail.co.uk/news/article-4318428/Cops-arrest-12-high-tech-12m-wide-crime-ring.html"}
