{"authors":[],"date_download":"2018-10-22 23:01:27","date_modify":"2018-10-22 23:01:27","date_publish":"2014-05-13 09:14:07","description":"Police officer Stephen Arkell, 48, was shot and killed while responding to a domestic dispute in New Hampshire that ended in a fiery explosion.","filename":"data/vaneerConsumption/CopShotBeforeNewHampshireHomeExplodedMadeUltimateSacrifice.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437561/140512-nh-fire-jms-1837_a6fb5d72dea653a851986032b18dac6d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_cop-shot-new-hampshire-home-exploded-made-ultimate-sacrifice-n103916_1540249287.html","title":"Cop Shot Before New Hampshire Home Exploded Made 'Ultimate Sacrifice'","title_page":"Cop Shot Before New Hampshire Home Exploded Made 'Ultimate Sacrifice'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA police officer with two teenage daughters was shot and killed while responding to a domestic dispute in New Hampshire Monday that ended in a raging house fire and an explosion caught on film.\nBrentwood Police Officer Stephen Arkell, 48, answered the domestic dispute call at about 4 p.m. and was fatally shot when he arrived at the house, State Attorney General Joseph Foster told reporters.\nState Gov. Maggie Hassan ordered that flags be flown at half-staff in honor of Arkell, saying all of New Hampshire is in mourning.\n\"Officer Arkell bravely answered the call of duty and made the ultimate sacrifice, a heroic demonstration of his commitment to the safety of his fellow citizens,\" she said in a statement. \"Like so many of our first responders do on a daily basis, Officer Arkell courageously put his life on the line to protect others, and in doing so, was tragically taken far too soon.\"\nSuspected gunman Michael Nolan, 47, was presumed killed by the fire that quickly leveled the house, Foster said. Another officer who responded tried to enter the house but was driven out of the home by gunfire, he added.\nNolan is the son of the homeowner, 86-year-old Walter Nolan, The Associated Press reported. Neighbor Susan Hughes told the Portsmouth Herald she saw Walter Nolan being taken from the scene by ambulance before the fire began.\nAnother neighbor, Felisa Blazek, told the Boston Globe she was inside her house when she heard screaming.\n“It seemed like a domestic situation between my neighbor and his son,” said Blazek, followed by “rapid gunfire” which “wouldn’t stop.”\nArkell was a part time officer with a family and two daughters in their teens, said Wayne Robinson of Brentwood Police Department.\nMonday's incident comes during National Police Week, and two years and one month after Greenland, N.H. Police Chief Michael Maloney was shot and killed and four other officers were shot during a drug raid in nearby Greenland.\nThe Associated Press contributed to this report.\nAlastair Jamieson","url":"https://www.nbcnews.com/news/us-news/cop-shot-new-hampshire-home-exploded-made-ultimate-sacrifice-n103916"}
