{"authors":["Kayla Dean"],"date_download":"2018-10-31 01:40:36","date_modify":"2018-10-31 01:40:36","date_publish":"2018-08-28 14:03:52","description":"Writing platforms are in no way easy to build, especially when they’re centered on a niche subject — for example, lingerie. But that’s exactly how former nonprofit worker Cora Harrington got her start. Under a pen name, she started her first blog…","filename":"data/vaneerConsumption/CoraHarringtonsInIntimateDetailIsAnInclusiveGuideToLingerieThatReframesTheIntimateApparelConversation.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/cfba2ba3-3d37-4415-85b1-a7b7e08b3e83-intimate2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_cora-harringtons-in-intimate-detail-is-inclusive-guide-to-lingerie-that-reframes-the-intimate-apparel-conversation-10259618_1540950036.html","title":"Cora Harrington's \"In Intimate Detail\" Is An Inclusive Guide To Lingerie That Reframes The Intimate Apparel Conversation","title_page":"Cora Harrington's \"In Intimate Detail\" Is An Inclusive Guide To Lingerie That Reframes The Intimate Apparel Conversation","title_rss":"NULL","source_domain":"bustle.com","text":"Writing platforms are in no way easy to build, especially when they’re centered on a niche subject — for example, lingerie. But that’s exactly how former nonprofit worker Cora Harrington got her start. Under a pen name, she started her first blog about hosiery in 2008, but she quickly expanded into writing about the wider world of bras, corsets, and shapewear. In 2008, she launched The Lingerie Addict, which is now a six-figure-earning fashion website and the largest intimate apparel blog.\nThrough her work, Harrington seeks to break down the expectations that people should wear lingerie for a partner or in an attempt to \"fix\" their bodies. In Intimate Detail, her first book, is an empowering lingerie guide that breaks down the intimidating aspects of lingerie and makes it approachable for everyone.\n“I knew I wanted an inclusive book that was completely unlike any lingerie book that had been published from the very beginning,” Cora Harrington tells Bustle. “My book doesn’t cover everything, because that’s a pretty bold claim, but I covered as much as I could in a way that hopefully helps people feel like they’re welcome and there is room for them in the world of lingerie.”\nIn Intimate Detail by Cora Harrington, $16.51, Amazon\nIn Intimate Detail contains chapters on items like bras, shapewear, underwear, and hosiery, along with a guide to shopping for and taking care of lingerie. While the collection details the history of lingerie items – revealing interesting insights like the fact that 4,000-year-old Greek paintings show women wearing corset-like bras — it’s also a practical guide to the nomenclature and uses for different lingerie items. After reading In Intimate Detail, readers may have a clearer sense of how to select lingerie and why lingerie items have different fits across brands and styles. The book also contains drawings and descriptions of contemporary bustiers, caftans, and pantyhose to help demystify the process of buying these items.\n\"I covered as much as I could in a way that hopefully helps people feel like they’re welcome and there is room for them in the world of lingerie.\"\nAlthough the book includes a bibliography for which extensive research was required, Harrington takes a practical approach to the subject, sharing the information she internalized from a decade of writing and learning about lingerie.\n“I feel like the timing in terms of this book was perfect. If I had been asked five years ago, I would not have been ready for the book that I wrote last year,” Harrington says, adding that writing regular posts for her blog prepped her for the experience of publishing a book.\nCora Harrington, photo courtesy of Nora Ellenson\n“I got used to writing because I’m not a writer by trade,” Harrington says. “I don’t have a background in journalism or a writing degree or anything like that. Writing my blog helped me learn how to develop my voice and the way I wanted to talk about lingerie.”\nAs Harrington declares in the introduction, “lingerie does not always have to be erotic wear.” This is a guiding philosophy for the book, which also includes a bra size conversion chart, example capsule wardrobes, and an appendix specifically for trans women, nonbinary people, plus size people, and people with physical disabilities.\nPhoto courtesy of Cora Harrington\nOne of the most defining features of In Intimate Detail is its gender-neutral language. “If you’re someone who is nonbinary or transitioning, it’s probably something you’ll notice. There are no references to ‘she,’ ‘her,’ or ‘for men’ or all that other stuff people say when they’re talking about lingerie. I wanted to show that it’s possible to talk about lingerie in a way that includes everyone,” Harrington says.\nShe spent all of 2017 writing and moved cross-country from California to New York while working on the book for which entrepreneur and burlesque icon Dita Von Teese wrote the foreword. A longtime admirer of Von Teese’s style and entrepreneurship, Harrington contacted her via email, asking if she would share what lingerie means to her. But the journey towards writing In Intimate Detail was a lot more complex, and there have been more than a few hurdles.\n\"I wanted to show that it’s possible to talk about lingerie in a way that includes everyone.\"\n“Lingerie is kind of a hidden side of the fashion industry,” Harrington says. “A lot of people don’t talk about it because it’s not really seen as a part of the fashion conversation in a lot of ways, except for Victoria’s Secret’s fashion show. Beyond that, there aren’t a lot of conversations happening about intimate apparel. I feel like there’s this infrastructure set up around the beauty industry that doesn’t really trickle down to intimates. There are few experts and publications that focus on intimates and can speak with authority on the subject. Because of that, I feel like people think there isn’t a lot to say about intimate apparel, that intimate apparel must not be worth covering.”\nThat difficulty often emerged in the early days of The Lingerie Addict, not only because big brands initially refused to work with Harrington, but also because of the misunderstandings that dominate conversations about intimates. Although The Lingerie Addict has ads on the site, Harrington can’t use Google Adsense, a program that allows publishers to serve automatic advertisements, because her website is considered adult content by Google.\nPhoto courtesy of Cora Harrington\n“I think that’s a pretty sad commentary on how a lot of people think about intimate apparel,” Harrington says. “The idea that a bra — which half the country, half the world wears — is seen as inherently shameful says a lot about how we think about lingerie and how we see bodies. It connects to how little we know about our bodies, because if you’re told from the very beginning that your body and undergarments are shameful, if there’s a culture of shame, fear, and ignorance around your own breasts and genitals, you’re never going to learn about how to find the best possible things for you.”\n\"The idea that a bra — which half the country, half the world wears — is seen as inherently shameful says a lot about how we think about lingerie and how we see bodies.\"\nIt's this spirit that Harrington brings to In Intimate Detail. When she began, The Lingerie Addict, she felt the conversation about intimates needed to be pushed beyond the idea of buying something sexy for someone else's gaze. “These conversations aren’t very inspiring. They’re not going to motivate me to go to my local lingerie boutique and try on a beautiful slip or chemise. It turns lingerie shopping into a chore,\" she says.\nBecause Harrington had such a long time to write about lingerie, she had a clear sense of what she wanted to say in In Intimate Detail. “Anytime you do something for a long time you hope that other people notice it and think it’s been worthwhile,” Harrington says.\n“One of the things I hope my book does is dissipate that shame and show that there’s nothing to feel bad about when it comes to lingerie if you want to learn more about it,\" she says. \"It’s natural and normal and not something you have to hide.”","url":"https://www.bustle.com/p/cora-harringtons-in-intimate-detail-is-inclusive-guide-to-lingerie-that-reframes-the-intimate-apparel-conversation-10259618"}
