{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 03:57:50","date_modify":"2018-10-23 03:57:50","date_publish":"2017-04-26 15:39:24","description":"The Labour leader has been accused of 'running scared' after aides made clear he will not agree to pre-election showdowns that do not include the Prime Minister.","filename":"data/vaneerConsumption/CorbynrefusestodoTVdebateswithLibDemsorSNP.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F9D584100000578-0-image-a-35_1493217311554.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448114_Corbyn-refuses-TV-debates-Lib-Dems-SNP_1540267070.html","title":"Corbyn refuses to do TV debates with Lib Dems or SNP","title_page":"Corbyn refuses to do TV debates with Lib Dems or SNP | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn will not take part in TV debates against the Lib Dems or SNP - despite berating Theresa May for refusing to go up against him.\nThe Labour leader has been accused of 'running scared' after aides made clear he will not agree to pre-election showdowns that do not include the Prime Minister.\nThe climbdown is embarrassing after Mr Corbyn led criticism of Mrs May over her reluctance to be involved in the clashes.\nBroadcasters are considering whether to 'empty chair' the premier in programmes being planned for the run-up to June 8.\nThe Labour leader (pictured leaving his London home today) has been accused of 'running scared' after aides made clear he will not agree to pre-election showdowns that do not include the Prime Minister\nBut the situation is at risk of descending into farce after Mr Corbyn also said he would not take part.\nA senior aide to the leader said a debate would only be worthwhile if it pitted the leaders of the two biggest parties against one another.\nAsked whether Mr Corbyn would attend a broadcast which did not involve Mrs May, the spokesman said: 'Obviously, if you are talking about a debate about the possible outcomes of the election, you are talking about a debate between the Conservative Party and the Labour Party first and foremost.\n'To have a debate among the opposition parties doesn't meet that objective at all.\n'I don't think having a debate among opposition parties in any way meets the objective of giving the British people a chance of seeing what the real choices are in this election campaign.\n'Our challenge is to the Prime Minister to have the strength and guts to actually face a direct debate with Jeremy Corbyn on the issues facing the country and the issues of this election.\n'The fact that she is running scared of that is a sign of her weakness, not her strength.'\nThe spokesman added: 'We've made clear that this election is a choice between a Conservative government and a Labour government. There is no other possible outcome'.\nLiberal Democrat leader Tim Farron said the debates must go ahead.\nBroadcasters are considering whether to 'empty chair' Theresa May (pictured at PMQs today) in programmes being planned for the run-up to June 8\nMr Corbyn, pictured in the Commons today, led criticism of Mrs May over her reluctance to be involved in the clashes\n'Corbyn is running scared,' he said. 'He is running away from facing his opponents, he is running away from defending his policies, he is running away from leadership.\n'Given he has been absent since the day he was elected as leader of the opposition, it is no surprise that he is choosing to be absent now.'\nGreen Party co-leader Caroline Lucas added: 'A failure by both Corbyn and May to appear in the television debates would be a dereliction of their duty as party leaders.'\nTV debates first happened during a general election campaign in 2010, when Gordon Brown went head-to-head with David Cameron and Nick Clegg.\nMr Cameron agreed to take part in a single seven-way debate in 2015, but would not go head-to-head with Ed Miliband.\nThere were a variety of other formats on display, including a 'challengers' debate for the parties who were not in government.\nITV has confirmed it intends to host a leaders' debate during this year's campaign, while the BBC's head of newsgathering has said the corporation would not let a single politician stop a programme which was in the public interest.","url":"https://www.dailymail.co.uk/news/article-4448114/Corbyn-refuses-TV-debates-Lib-Dems-SNP.html"}
