{"authors":["Press Association"],"date_download":"2018-10-23 04:05:18","date_modify":"2018-10-23 04:05:18","date_publish":"2017-04-26 15:44:22","description":"Theresa May has made clear she will not participate in televised debates in the run-up to the June 8 General Election.","filename":"data/vaneerConsumption/CorbynmightnotdoTVdebatesifMaydeclinesthem.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465865-1493217863-70_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448132_Corbyn-not-TV-debates-May-declines-them_1540267518.html","title":"Corbyn might not do TV debates if May declines them","title_page":"Corbyn might not do TV debates if May declines them | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn may not take part in TV election debates which do not involve Theresa May, Labour has indicated.\nBroadcasters are facing calls for the Prime Minister to be “empty chaired”, after she made clear she will not participate in televised debates in the run-up to the June 8 General Election.\nBut a senior Labour spokesman suggested that a debate would only be worthwhile if it pitted the leaders of the two biggest parties against one another.\nTheresa May\nAsked whether Mr Corbyn would attend a broadcast which did not involve Mrs May, the spokesman said: “Obviously, if you are talking about a debate about the possible outcomes of the election, you are talking about a debate between the Conservative Party and the Labour Party first and foremost.\n“To have a debate among the opposition parties doesn’t meet that objective at all. I don’t think having a debate among opposition parties in any way meets the objective of giving the British people a chance of seeing what the real choices are in this election campaign.\n“Our challenge is to the Prime Minister to have the strength and guts to actually face a direct debate with Jeremy Corbyn on the issues facing the country and the issues of this election. The fact that she is running scared of that is a sign of her weakness, not her strength.”\nJeremy Corbyn\nThe spokesman added: “We’ve made clear that this election is a choice between a Conservative government and a Labour government. There is no other possible outcome. It’s extraordinary that the Prime Minister feels unable to face a direct television debate with the leader of the only other possible government that could come out of this election.\n“We are continuing to press her to have those debates, and to have a head-to-head debate. We are confident that if the British public get to see that debate with Theresa May having to face Jeremy Corbyn in a direct debate, the public would respond to Labour’s message.\n“That’s one of the reasons why they are running scared of having that debate.”\nTV debates first became part of the British general election campaign in 2010, when Gordon Brown went head-to-head with David Cameron and Nick Clegg. After protracted wrangling, debates went ahead in 2015 in a variety of formats, including one involving leaders of parties which were not in government.\nLeaders' debate in 2015\nITV has confirmed it intends to host a leaders’ debate during this year’s campaign, while the BBC’s head of newsgathering has said the corporation would not let a single politician stop a programme which was in the public interest.\nLiberal Democrat leader Tim Farron said the debates must go ahead and called on broadcasters to “empty chair” Mrs May and Mr Corbyn if they do not take part.\n(Jonathan Brady/PA)\n“Corbyn is running scared,” he said. “He is running away from facing his opponents, he is running away from defending his policies, he is running away from leadership.”","url":"https://www.dailymail.co.uk/wires/pa/article-4448132/Corbyn-not-TV-debates-May-declines-them.html"}
