{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:13:44","date_modify":"2018-10-30 19:13:44","date_publish":"2015-04-14 18:32:12","description":"Defying threats of a presidential veto, critics of the Iran deal reached a bipartisan compromise on Tuesday that will allow the Iran Nuclear Agreement Review Act--the \"Corker-Menendez bill\"--to proceed to a vote with a veto-proof two-thirds majority. The White House has backed down, fearing the embarrassment of a veto override on a key foreign policy issue. Yet the conditions that critics of the Iran deal had to accept will, in fact, make the deal easier to pass in its current form. |","filename":"data/vaneerConsumption/CorkerMenendezBillFastTrackAuthorityforIranDeal.json","image_url":"https://media.breitbart.com/media/2015/04/ap_robert-menendez-bob-corker_ap-photo1-1024x673.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_14__1540926824.html","title":"Corker-Menendez Bill: Fast-Track Authority for Iran Deal","title_page":"Corker-Menendez Bill: Fast-Track Authority for Iran Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Defying threats of a presidential veto, critics of the Iran deal reached a bipartisan compromise on Tuesday that will allow the Iran Nuclear Agreement Review Act–the “Corker-Menendez bill”–to proceed to a vote with a veto-proof two-thirds majority. The White House has backed down, fearing the embarrassment of a veto override on a key foreign policy issue. Yet the conditions that critics of the Iran deal had to accept will, in fact, make the deal easier to pass in its current form.\nUnder the reported terms of the compromise, Congress will be able to review the Iran deal, and possibly reject it. However, it will only have an up-or-down majority vote, in both houses–and it will need a two-thirds majority to override a veto. Effectively, the Corker-Menendez bill inverts the constitutional process, which requires all treaties to be ratified by a two-thirds majority in the Senate. It is the equivalent of the “fast-track” authority on trade agreements–which the left despises.\nIndeed, White House spokesperson Josh Earnest said Tuesday that President Barack Obama might consider signing a version of the bill that makes it “the one and only mechanism for codifying precisely what the Congress’s oversight is into this matter.” (The other compromises were the removal of language requiring the president to certify that Iran is not engaging in terror, and a shortened timeframe for Congress to review the final Iran deal once it had been reached and submitted.)\nThe reasons the Corker-Menendez deal passed are twofold. One is that the public overwhelmingly wants Congress to have a say in the Iran deal–and not just the monitoring role that the administration has described, but an up-or-down, yes-or-no role. The other is that the Obama administration’s case for the Iran deal is exceedingly weak. Experts–even sympathetic ones–have grave doubts about the deal, and Iran accuses Obama of lying about what is actually in the deal “framework.”\nYet the unique structure of fast-track authority means that, theoretically, President Obama could commit the United States to a nuclear deal that is opposed by a majority–but not quite a two-thirds majority–of the Congress. A “rogue” agreement would be of questionable value, since it would enjoy less legitimacy than one that had won a vote in Congress. A “rogue” agreement could also, in the end, reflect party loyalty above national security–more so than under traditional process.\nThe constitutionality of fast-track authority is a hotly-debated topic. (It will be amusing to watch the same Democrats who denounce the Corker-Menendez bill as an encroachment on the president’s powers adopt exactly the opposite line on free trade.) Arguably, however, national security–especially on nuclear proliferation–is a more urgent priority than free trade, and the Iran deal ought to be subject to Senate ratification. A “rogue” agreement on Iran is the worst possible outcome.","url":"https://www.breitbart.com/politics/2015/04/14/corker-menendez-bill-fast-track-authority-for-iran-deal/"}
