{"authors":[],"date_download":"2018-10-22 21:28:57","date_modify":"2018-10-22 21:28:57","date_publish":"2014-05-07 12:49:33","description":"Cornelius Gurlitt \"appointed the private-law foundation Kuntsmuseum Bern his unrestricted and unfettered sole heir,\" the museum said in a statement.","filename":"data/vaneerConsumption/CorneliusGurlittLeavesNaziEraArtTrovetoSwissMuseum.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/423341/140506-cornelius-gurlitt-art-matisse_9349183ba1def28da48cd756de58427d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_europe_cornelius-gurlitt-leaves-nazi-era-art-trove-swiss-museum-n99111_1540243737.html","title":"Cornelius Gurlitt Leaves Nazi-Era Art Trove to Swiss Museum","title_page":"Cornelius Gurlitt Leaves Nazi-Era Art Trove to Swiss Museum","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMUNICH, Germany – Reclusive art collector Cornelius Gurlitt left his entire trove of works concealed for decades to the Kuntsmuseum in Bern, Switzerland, the museum said Wednesday.\nGurlitt, who died on Tuesday, hoarded more than 1,000 works believed to be lost in World War II or destroyed by the Nazi regime in his apartment and in a house outside Salzburg, Austria. The collection, which was amassed by Gurlitt's father, Hildebrand Gurlitt, includes paintings and drawings by Marc Chagall, Pablo Picasso and Henri Matisse.\nGerman tax authorities discovered the pieces in February 2012 in Gurlitt's apartment.\nGurlitt's lawyer Christoph Edel confirmed by telephone and in writing that Gurlitt had \"appointed the private-law foundation Kuntsmuseum Bern his unrestricted and unfettered sole heir,\" the museum said in a statement.\nThe news \"came like a bolt from the blue, since at no time has Mr. Gurlitt had any connection with Kuntsmuseum Bern,\" it said.\nThe Nazis had labeled the avant-garde artworks as “degenerate” and plundered them from museums or forced owners, many of them Jewish, to sell them for below their real prices. Hildebrand Gurlitt, an art dealer close to the Nazi regime, built up the collection that today rivals those of many of the world’s modern art museums.\nHis son then concealed them for decades.","url":"https://www.nbcnews.com/news/europe/cornelius-gurlitt-leaves-nazi-era-art-trove-swiss-museum-n99111"}
