{"authors":["Pam Key"],"date_download":"2018-10-30 21:30:16","date_modify":"2018-10-30 21:30:16","date_publish":"2015-06-22 21:08:36","description":"Cornel West: Obama ‘Has Become the First Nigg*rized Black President’","filename":"data/vaneerConsumption/CornelWestObamaHasBecometheFirstNgerizedBlackPresident.json","image_url":"https://media.breitbart.com/media/2015/06/cor.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_22__1540935016.html","title":"Cornel West: Obama ‘Has Become the First N–gerized Black President’","title_page":"Cornel West: Obama ‘Has Become the First N--gerized Black President’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(Offensive language warning)\nMonday on CNN’s “Newsroom with Brooke Baldwin,” Cornel West started discussing the Confederate flag but quickly moved to Obama’s recent comments about race when he said, “The first black president has become the first nigg**ized black president.”\nWest said, “Just to tell the truth and say, look, you can’t talk about wealth and inequality, massive unemployment and under employment and you can’t talk about drones being dropped on people in other parts of the world without talking about white supremacy and its ways in which it operates. It doesn’t have to be overt. The president is right about that. But too many black people are nigg**ized. I would say the first black president has become the first nigg**ized black president. Why a nigg**ized black person is a black person who is afraid and scared and intimidated when it comes to putting a spotlight on white supremacy. And fighting against white supremacy.”\n“So when many of us were saying you have to fight against racism. What were we told? No he can’t deal with racism because he’s has other issues, political calculations. He’s the president of all America not just black America. We know he’s president of all America, but white supremacy is American as cherry pie. We’re talking about moral issues spiritual issues. It’s not just skin pigmentation, it has to be what kind of nation we want to be. Democrats and Republicans play on both of those parties in terms of running away from the vicious legacy of white supremacy until it hits us hard. Thank God for Ferguson and the young folk of all colors, Staten Island and fighting there, thank God in Baltimore, now the precious folk in Charleston. Keep in mind this and I want to end on this, too. When we talk about forgiveness, you notice how quick the white press wants to accent black people forgiving? It’s not an utterance. It’s a process. We are a loving people. We’ve been hated so. But to forgive a day or so after, that’s a pathological empathy you have forgiven because you work it through. You make sure you don’t hate. That’s the key. Don’t hate. Forgiveness comes later. The press wants to accent forgiveness. We are fighting people as well as forgiving people,” he added.\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/politics/2015/06/22/cornel-west-obama-has-become-the-first-n-gerized-black-president/"}
