{"authors":["Clemence Michallon For Mailonline"],"date_download":"2018-10-23 02:08:35","date_modify":"2018-10-23 02:08:35","date_publish":"2016-01-11 13:47:53","description":"The actor, 62, acted as a compere during for the evening in Tyne and Wear. The Confederate flag began as a military banner used by souther States during the American Civil War (1861-1865).","filename":"data/vaneerConsumption/CoronationStreetsBruceJonespresentsWesternnightinfrontofConfederateflag.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A6A7800000578-0-image-a-66_1452519774942.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393859_Coronation-Street-Bruce-Jones-racist-Confederate-flag-Country-Western-night_1540260515.html","title":"Coronation Street's Bruce Jones presents Western night in front of Confederate flag","title_page":"Coronation Street's Bruce Jones presents Western night in front of Confederate flag | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Coronation Street star Bruce Jones appeared at a country and western night in front of a 'racist' flag.\nThe 62 year-old, known to millions as cabbie Les Battersby, acted as compere for the evening in South Shields, Tyne and Wear.\nAt the back of the stage was a Confederate flag - the historic banner of the 13 Southern States who stood in favour of slavery during the American Civil War, which many see as a symbol of racism.\nAnother Confederate flag was on the side of the hall and a third showed the face of Western legend John Wayne.\nBruce Jones, who played cabbie Les Battersby in Coronation Street, stood in front of a Confederate flag during a Country and Western night in South Shields, Tyne and Wear\nMr Jones wore a black stetson and an unbuttoned shirt and sang with a female country and western singer. He told the audience: 'I tell you what, she's class. She's class. She's had my shirt off in seconds'\nMr Jones, who wore a black stetson and an unbuttoned shirt, sang with a female country and western singer.\nHe told the audience: 'I tell you what, she's class. She's class. She's had my shirt off in seconds.'\nThe £4 event at Armstrong Hall attracted up to 300 people, many dressed in Western gear. Most seemed oblivious to the symbolism of the Confederate flag.\nHall manager Eddie Proud said: 'We were approached by a country and western group who wanted to bring country and western nights back to South Shields.'\nA spokesman for anti-racism group Hope Not Hate said: 'This flag is deemed to be offensive for a number of reasons and people should be a little more culturally sensitive.\n'We have no reason to defend that flag, but we understand it is a symbol of Country and Western music. We aren't American and people should be more aware what the flag means.'\nAfter being used during the American Civil War, the Confederate flag was later waved by white supremacist groups and segregationists in the 1950s and 1960s, in opposition to the Civil Rights movement.\nDylann Roof, suspected of killing nine people during a mass shooting at Emanuel African Methodist Episcopal Church, in Charleston, South Carolina, waved a Confederate flag and posed next to it in photographs that surfaced days after the attack.\nThe flag also appeared on his car's license plate.\nHOW THE CONFEDERATE FLAG BECAME ASSOCIATED WITH RACISM The Confederate flag began as a military banner used during the American Civil War The Confederate flag began as a military flag. Several Southern units flew it during the American Civil War (1861-1865). One of them was the Army of Norther Virginia, which acted under the command of Gen. Robert E. Lee's. Wanting to maintain slavery was one of the main reasons cited by Southern states to explain why they had declared secession. The Confederate flag resurged during the civil rights movement in the 1950s and 1960s, used by segregationists. It went on to become a symbol of white supremacy, waved by organisations such as the Ku Klux Klan. Some advocates of the Confederate flag insist it is not as a racist flag but a symbol of independence and heritage. But President Barack Obama called for the removal of the flag in June 2015, saying it had 'always been more than ancestral pride.' Members of the Ku Klux Klan and other white supremacist groups staged protests to defend their right to wave the banner. About 100 of them rallied the following month in South Carolina. In August, hundreds of flag-waving supporters of the Confederacy clashed with Civil rights activists at a rally in Georgia. Republican presidential candidate Ben Carson said in September that American citizens should be able to fly the Confederate flag on their private property. Director Quentin Tarantino called it the 'American swastika' in an interview with The Telegraph earlier this month.\nResidents in South Shield hit out at the club's decision to display the Confederate flag at the event and criticised Mr Jones for performing in front of it.\nCarly Wilson said: 'Now that concern has been voiced by the public he should at least learn about the issues and apologise.\n'I don't know if it shows a lack of knowledge on the subject or if he just doesn't care, but as a figure in the public eye he has a level of influence and should know better.\n'The confederate flag should never be used, let alone as a tool to promote something.\n'It's a symbol of hatred and heavily associated with slavery and segregation in America and those kind of connotations don't just go away, despite the fact that a lot of people just think of it as a symbol of Southern pride.\n'The Confederate flag has been used by the Klu Klux Klan and more recently by Dylann Roof. When real-life people are carrying out acts of hatred in the name of the Confederate flag, it shows how much progress is still needed.\n'It's a small courtesy to not use the flag anymore despite your personal feelings on it, and I can't help but feel that anyone who refuses despite knowing what it represents needs to be called out on it. It's just not acceptable.'\nThe flag, which began as a military banner during the American Civil War, was first used by Southern States who supported slavery. It was later waved by segregationists during the civil rights movement in the 1950s and 1960s\nEmma McEwan said Mr Jones should have know what the flag stood for.\nShe said: 'He's a grown man, his decisions are his own. It is of course disheartening knowing that anyone, especially someone who can hold influence on others can still, in 2016, support these values.\n'I don't agree with anyone posing with these flags but I would feel that anyone that does so, does so knowingly and willingly.\n'In my opinion you would only ever pose with the Confederate flag if you held the views and values upon which it's based.\n'I have always been quite proud of the reputation South Shields has for being a bit of a beacon of ethnic diversity. All through my lifetime and my parents' lifetime, it has been a town that is so diverse and tolerant of race.\n'It saddened me to see a picture associated with South Shields and the confederate flag. The confederate flag will always be a symbol of racism, hatred and segregation to millions of people.\n'I believe President Obama made a very correct statement in that the flag \"belongs in a museum\".\n'In more recent history, it of course has been linked with Country music, as a symbol of the Southern states in which the flag represents. However, the flag is still also used in relation to racist attacks and beliefs.","url":"https://www.dailymail.co.uk/news/article-3393859/Coronation-Street-Bruce-Jones-racist-Confederate-flag-Country-Western-night.html"}
