{"authors":["Amanda Williams For Mailonline"],"date_download":"2018-10-23 04:47:05","date_modify":"2018-10-23 04:47:05","date_publish":"2016-01-11 17:58:48","description":"Edward Crawford, a 41-year-old magician, was accused of lurking outside Stephanie Briggs' London office in December 2014 - seven weeks after he had been issued with a harassment notice.","filename":"data/vaneerConsumption/CoronationStreetsJohnnyBriggsdaughtersexisclearedofstalkingher.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DD89300000578-0-image-a-4_1452539492881.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394217_Ex-boyfriend-Coronation-Street-actor-Johnny-Briggs-daughter-cleared-stalking-searching-WiFi-near-office_1540270025.html","title":"Coronation Street's Johnny Briggs' daughter's ex is cleared of stalking her","title_page":"Coronation Street's Johnny Briggs' daughter's ex is cleared of stalking her | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Edward Crawford, a 41-year-old magician, was accused of lurking outside Stephanie Briggs' London office in December 2014 - seven weeks after he had been issued with a harassment notice\nThe ex-boyfriend of Coronation Street star Johnny Briggs' daughter was today cleared of stalking her after their relationship ended.\nEdward Crawford, a 41-year-old magician, was accused of lurking outside Stephanie Briggs' London office in December 2014 - seven weeks after he had been issued with a harassment notice not to contact her.\nMs Briggs, 33, whose father played Mike Baldwin in the soap for 36 years, claimed Mr Crawford threatened to kill himself and sang a song from Winnie the Pooh down the phone after she broke up with him.\nBut Mr Crawford said he only had a vague idea where his ex-girlfriend - whose dad played Mike Baldwin in the ITV soap for 36 years - worked, and said he was only standing in the foyer of a nearby office to use a free wi-fi spot.\nWestminster Crown Court heard that Ms Briggs, 33, and her cousin confronted Mr Crawford and that he had told them he was there for a meeting.\nToday Judge Elizabeth Roscoe today said she was not absolutely sure that Mr Crawford had gone there to stalk her.\nGiving closing comments, she said: 'The issue is whether or not Mr Crawford sought out the course of conduct knowing or believing that this was a course of conduct that would cause alarm or distress and that course of conduct was stalking Miss Briggs.'\nShe added: 'Mr Crawford is a man of 41 years, of good character and that allows him to say to the court that as a man of good character he is less likely to commit and offence and that his evidence should be believed because he is of good character.\n'He gives an explanation of why he is there - it is perhaps a bit thin but in my view that alone is not enough for me to say that this is part of a course of conduct.\n'In my view I cannot rule out coincidence and while I say I fully accept the account of the conversation by Miss Briggs' cousin, even if Mr Crawford has lied about it, I am not satisfied that the only reason he lied is to hide the fact that he was there to stalk Miss Briggs.\n'I do not find the prosecution has proved their case and the charge is dismissed.'\nJudge Roscoe said she did not believe a restraining order was necessary in this case.\nThe court had earlier heard that he didn't know where Ms Briggs worked because she hadn't been in the job long.\nAnd even if he had known, he said that he'd since found out that the building was three roads away and he could not have seen either the main or the side entrance.\nCoronation Street star Johnny Briggs (pictured right) with his daughter Stephanie at the 2006 British Soap awards\nThe court was shown CCTV footage from the building where Crawford claims to have been looking for the address where he wanders around, in and out.\nBut he said that he was trying to find the best wifi signal. When he initially tried to go and sit down, he said there was no reception by the chairs and he instead went to the door.\nWhen Crawford left he said he had walked 200 to 300 metres away when Miss Briggs and her cousin shouted his name and started asking him what he was doing.\nA previous hearing heard that Miss Briggs was hounded by her former lover who 'bombarded' her with texts and calls.\nShe told how when she blocked his numbers he continued 'haranguing' her from public telephone boxes and left rambling voicemails when he called her his 'heroin' and his 'drug.'\nIn his closing speech, Crawford's lawyer Dan O'Callaghan said that Miss Briggs - a trained actress - had not been genuine or legitimate when she told the court that she was still haunted by the events and struggled to eat properly or leave her house without always looking for her ex.\n'We know that Miss Briggs has been in the acting profession and still is and I suggest that the evidence she gave was a performance,' he said.\n'The fact of the matter is that Miss Briggs could do with sitting in court in another harassment case and seeing what harassment really is.'\nMiss Briggs and her cousin approached him as he walked away from a nearby building where he had been for just over half an hour, challenged him and took his photograph.\nHe said: 'She and and her cousin then confronted him in a pincer movement - to continue the dramatic analogy - almost like the first scene of Macbeth.'\nThe three witches open Shakespeare's tragedy and correctly predict Macbeth's downfall. Crawford claims he was simply using the free wifi hotspot nearby and sheltering from the rain in a nearby office block.\nThe court also heard the nine voicemails - some left in the early hours of the morning - that Crawford left for Stephanie over the course of ten days in September 2014.\nBut Mr Crawford (pictured with his current girlfriend) said he only had a vague idea where his ex-girlfriend - whose father played Mike Baldwin in the ITV soap for 36 years - worked, and said he was only standing in the foyer of a nearby office to use a free Wi-Fi spot\nIn one he sings down the phone to her and in another he shouts: 'Get some f****** help'.\nCrawford said in another voicemail: 'You feel like you are not being listened to - that's how I feel every f****** day so pick up the f****** phone.'\nIn another he said: 'I have been angry at times and I have said angry things to you and I have been sad and I have said sad things to you but I am just really confused.'\nCrawford said that he was responding to messages she had left him and he had been left sad and confused by the breakup, on his birthday in August.\nHe said: 'I was like a lovelorn fool. I was probably one step away from writing bad teenage poetry.'\nBut he insisted that by December, he had a new girlfriend - who sat in the public gallery as he gave his evidence - and his mindset had changed completely.\nHe described the 'intense' relationship and that the couple would exchange 30-100 texts a day.\n'Two weeks in she told me that she loved me and I said the same a week later,' Crawford said.\nCrawford said that after they broke up they arranged to meet to talk about things. He text her on the day and said 'are we still meeting up?' but Miss Briggs told him that she was going to her father's birthday.\nAsked by prosecutor Nicola Flint why she would make arrangements on her father's birthday, Crawford said: 'I doubt very much if she went to her father's birthday.\n'They weren't on very good terms at the time.\n'In the police evidence it says she didn't go to her father's birthday.'\nWhen a policeman called him to warn him of a harassment notice on 14 October he said he knew the relationship was over and by December had no reason to contact her.\n'My mindset had changed earlier because I I had taken the advice of a few friends to get back out there.'\nIn her closing speech, Miss Flint insisted that his appearance near her office block had not been a coincidence.\nShe said: 'His reason for being there is completely implausible.'","url":"https://www.dailymail.co.uk/news/article-3394217/Ex-boyfriend-Coronation-Street-actor-Johnny-Briggs-daughter-cleared-stalking-searching-WiFi-near-office.html"}
