{"authors":[],"date_download":"2018-10-22 21:19:54","date_modify":"2018-10-22 21:19:54","date_publish":"2014-06-04 23:49:00","description":"A man drove most of the way from Arizona to Michigan with the body of his 31-year-old girlfriend sitting in the seat next to him.","filename":"data/vaneerConsumption/CorpseRidesHundredsofMilesAfterDriverRefusestoStop.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/488331/140604-ray-tomlinson-1850_9cb32ef33c8b1b61dea5ce9777e95cab.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_corpse-rides-hundreds-miles-after-driver-refuses-stop-n122996_1540243194.html","title":"Corpse Rides Hundreds of Miles After Driver Refuses to Stop","title_page":"Corpse Rides Hundreds of Miles After Driver Refuses to Stop","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA man drove most of the way from Phoenix to the Detroit area this week with a corpse for company, authorities say.\nRay Tomlinson told NBC station WDIV that he picked up a 31-year-old woman after she checked out of a mental health facility in Phoenix, near where he and his 92-year-old mother spend winters. On Sunday, the three of them set out in his van for Warren, Mich., 1,900 miles away.\nTomlinson, 62, said that they were in New Mexico on Monday when he couldn’t wake the younger woman, described as his girlfriend, who was sitting in the front passenger seat.\nHe nudged her. \"I just said, you know, you want something? And at this point in time she was stiff,\" Tomlinson told WDIV. \"There wasn't jerking or moans or groans, or cries for help, she just fell asleep.\"\nBut he said he checked the internet on his phone and found he had 48 hours to get her to a morgue.\n\"I can just take her to the Macomb County morgue, because that was my plan,\" he said.\nThen someone at the mental health facility called the woman’s phone to check on her. Tomlinson told them she was dead.","url":"https://www.nbcnews.com/news/us-news/corpse-rides-hundreds-miles-after-driver-refuses-stop-n122996"}
