{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 02:39:17","date_modify":"2018-10-23 02:39:17","date_publish":"2017-04-26 13:49:28","description":"The nation has been gripped by the latest horrific Coronation Street storyline, which sees Nathan Curtis grooming 16-year-old schoolgirl Bethany Platt.","filename":"data/vaneerConsumption/CorriesChrisHarpersaysNathanwillproposetoBethany.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FBEF700000578-0-image-a-64_1493211629991.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447662_Corrie-s-Chris-Harper-says-Nathan-propose-Bethany_1540262357.html","title":"Corrie's Chris Harper says Nathan will propose to Bethany","title_page":"Corrie's Chris Harper says Nathan will propose to Bethany | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The nation has been gripped by the latest horrific Coronation Street storyline, which sees Nathan Curtis grooming 16-year-old schoolgirl Bethany Platt.\nAnd the actor who plays him, Chris Harper, appeared on This Morning on Wednesday, where he said the dark storyline is 'only just the beginning for Bethany'.\nHaving lost her virginity to Nathan - Chris revealed the storyline has received a positive reaction from many survivors of sexual abuse, as it's important that young girls are made aware of the dangers that anyone in this position could face.\nScroll down for video\n'There are darker times to come': Corrie's Chris Harper hinted to This Morning on Wednesday that Bethany Platt will be raped again as he reveals storyline has received a positive reaction from survivors of sexual abuse\nAiming to do good: The actor said the storyline has received a positive reaction from many survivors of sexual abuse\nHe said: 'Nathan has done it before to other people [groomed them] and is doing with other people still. Bethany is falling in love with him.\n'She is going to be entering a dark space and Nathan introducing Neil is just the beginning. Counsellors call it love bombing and it can happen to anyone.\n'The perpetrator pretends to be your hero but Bethany to Nathan is a commodity.\nTalking to hosts Holly Willoughby and Phillip Schofield, he revealed Bethany will accept Nathan's proposal, as he hinted she will suffer another harrowing rape, after already been forced into sex by his friend Neil\nHe said: 'Nathan has done it before to other people [groomed them] and is doing with other people still. Bethany is falling in love with him'\nHe continued: 'She is going to be entering a dark space and Nathan introducing Neil is just the beginning. Counsellors call it love bombing and it can happen to anyone'\nChris also spoke of the reaction he had received from survivors of sexual abuse. He said: 'Brilliant - just amazing. The community that's out there of victims and survivors, however they describe themselves, is brilliant...'\n'Nathan will be proposing to her and Bethany starts wearing a ring. He wins her trust and makes her fall in love with him then flips it and plays on her age.'\nPhillip asked him if he thought Nathan's time on the street would be short-lived and he replied: 'I hope so.'\nChris also spoke of the reaction he had received from survivors of sexual abuse.\nHe said: 'Brilliant - just amazing. The community that's out there of victims and survivors, however they describe themselves, is brilliant...\nSad: Nathan hinted that there are many more troubling times to come for Bethany\n'They're used to just being splashed across tabloid headlines or ignored or labelled.\n'It's a fantastic role. I actually burst into tears when I found out I got the role. My wife, who's brilliantly supportive, is the one who suggested I run the London Marathon for the NSPCC. It's a great part, but I also got to be a part of a greater message.'\nLucy Fallon, who plays Bethany, has previously spoken of the importance in raising awareness around the disturbing issue of child abuse following criticism of the show’s decision to air its current grooming plot pre-watershed.\nAppearing on Loose Women recently, the 21-year old applauded the long running soap’s decision to tackle the subject head on in a bid to educate their younger fan base.\nShe said: 'It's important it is before the watershed.\nWe're trying to target people who watch Corrie. There are a lot of fans who are young teenagers, it's important that they watch it.’\nFor confidential support call Rape Crisis on Helpline: 0808 802 9999 (12-2:30 and 7-9:30) or visit rapecrisis.org.uk","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447662/Corrie-s-Chris-Harper-says-Nathan-propose-Bethany.html"}
