{"authors":["Lisa Mcloughlin For Mailonline"],"date_download":"2018-10-23 02:08:19","date_modify":"2018-10-23 02:08:19","date_publish":"2017-03-10 11:05:43","description":"The 26-year-old Coronation Street star channelled her character Rosie Webster as she slipped into a pair of ripped skintight denims on Friday.","filename":"data/vaneerConsumption/CorriesHelenFlanaganfilmswithBrookeVincent.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E227B6100000578-0-image-a-99_1489145307375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300824_Helen-Flanagan-films-Brooke-Vincent_1540260499.html","title":"Corrie's Helen Flanagan films with Brooke Vincent","title_page":"Corrie's Helen Flanagan films with Brooke Vincent | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They were previously forced to cancel filming on the cobbles because of Storm Doris.\nNow back on location, Helen Flanagan and Brooke Vincent were in flying form as they shoot upcoming scenes for their dramatic drug storyline on Friday.\nThe 26-year-old Coronation Street star channelled her character Rosie Webster as she slipped into a pair of ripped skintight denims and stomach grazing crop top.\nScroll down for video\nWhat a (tummy) tease! Helen Flanagan flaunts her toned stomach in skimpy crop top as she joins on-screen sister Brooke Vincent for Coronation Street filming\nSister, sister: Helen Flanagan and Brooke Vincent were in flying form as they shoot upcoming scenes for their dramatic drug storyline on Friday\nEyes up: Helen was sure to flaunt her assets in front of the on set crew, who found it difficult not to look\nDespite being ripped, her jeans featured shimmering sequin knee patches that highlighted her slender legs as she walked alongside her on-screen sister.\nShe injected height into her casual look with a pair of heeled black trainers as she teetered across the road clad in her statement khaki parka with vibrant neon fur trimmed hood.\nWorking her brunette locks into a curly pigtails, she draped her patterned Chanel handbag over her shoulders to add to her colourful ensemble.\nIn between takes, the mother-of-one made sure to wrapped herself in a long red padded jacket, while she protected her mane from the drizzling weather.\nTop of the crops: Helen showcased her enviable abs in a tummy teasing pink crop top\nSkintight: The 26-year-old Coronation Street star channelled her character Rosie Webster as she slipped into a pair of ripped skintight denims\nDenim days: Despite being ripped, her jeans featured shimmering sequin knee patches that highlighted her slender legs\nVibrant: Working her brunette locks into a curly pigtails, she draped her patterned Chanel handbag over her shoulders to add to her colourful ensemble alongside her on-screen sister\nTaking style notes from Helen, Brooke displayed her pins in similar ripped denims as they filmed their latest scenes.\nShe wrapped a padded brown winter coat around her frame as she chatted to her co-star in between takes.\nThe soap star worked her locks into a half up of Ariana Grande ilk, while adding inches to her petite frame with a pair of heeled black boots.\nThe pair have no doubt been enjoying working together again - particularly with their meaty new storyline.\nHaving fun: The pair appeared in high spirits together\nStyle lead: Taking style notes from Helen, Brooke displayed her pins in similar ripped denims as they filmed their latest scenes\nRed hot: She wrapped a padded brown winter coat around her frame as she chatted to her co-star in between takes\nHanging on the telephone: The girls were captivated by something on Brooke's phone\nStrut: Helen was seen flouncing along a street, littered with random household rubbish\nRosie's return to the soap has been nothing short of explosive, immediately kicking off with a drugs scandal.\nIn recent weeks, it's emerged that Rosie is acting as a drugs mule and has already dragged her younger sister Sophie into the dirt.\nFollowing a four-year break, the soap character smuggled back cocaine from America.\nSophie, who left the cobbles in the autumn, had been out to visit her big sister and returned with her to Weatherfield.\nKooky: Later, she swapped her black trainers for a pair of pom pom accented pumps\nWhat a tease! Helen's choice of top teased at her ample cleavage\nWarming up: In between takes, the mother-of-one made sure to wrapped herself in a long red padded jacket, while she protected her mane from the drizzling weather\nSelfie time! In between takes, Helen took a number of pouty selfies\nSnapping spree: Her co-star Brooke seemed less than interested in Helen's selfie spree\nAction: The scene seemed to portray Helen looking bored in her van\nWith her home searched thoroughly by police, thankfully to avail, Rosie and her sister were taken in for questioning.\nTheir mum Sally has now discovered Rosie's sideline and in forthcoming scenes stages a protest against sexual harassment.\nIn an attempt to spend more time with her daughters, Sally joins the duo on their window cleaning round but is reportedly left horrified by the builders' lewd comments towards them.\nCute: Helen held her phone in her hand, which featured a darling phone cover of her daughter Matilda\nRelaxed: Helen held an umbrella over her head as she waited for her scene to be reset\nSally Dynevor, who plays the character, told Digital Spy: 'Sally is doing the protest because she is angry with herself about what has happened to Rosie.\n'Rosie isn't even that bothered, she likes all the attention, but Sally has been so hurt that Rosie did not confide in her that this is her way to show Rosie that she supports her, even though it's not the way that Rosie wants her to help.\n'That's a big thing for Sally; she's upset that Rosie thinks of her as so judgemental, so she's going to try to not be like that in the future... but how long that will last I don't know.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300824/Helen-Flanagan-films-Brooke-Vincent.html"}
