{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:50:35","date_modify":"2018-10-31 01:50:35","date_publish":"2018-09-06 12:57:32","description":"Nearing the end of a long day of confirmation hearings, New Jersey Sen. Cory Booker fired racial justice questions at Brett Kavanaugh, the latest Supreme Court nominee from President Donald Trump. Kavanaugh answered few of Booker's questions…","filename":"data/vaneerConsumption/CoryBookerAskedBrettKavanaughAboutRacialJusticeIssuesDuringTheHearing.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/31532687-24fd-4e7e-b880-19662b18ca6f-getty-1027431574.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_cory-booker-asked-brett-kavanaugh-about-racial-justice-issues-during-the-hearing-11771265_1540950635.html","title":"Cory Booker Asked Brett Kavanaugh About Racial Justice Issues During The Hearing","title_page":"Cory Booker Asked Brett Kavanaugh About Racial Justice Issues During The Hearing","title_rss":"NULL","source_domain":"bustle.com","text":"Nearing the end of a long day of confirmation hearings, New Jersey Sen. Cory Booker fired racial justice questions at Brett Kavanaugh, the latest Supreme Court nominee from President Donald Trump. Kavanaugh answered few of Booker's questions directly, and the senator said that the replies he did get \"do not provide me comfort.\"\nInstead of taking a position on civil rights issues, Kavanaugh largely repeated that he respects court \"precedent,\" which many have argued may not actually be the case. In the past, he's shown willingness to creatively interpret a settled decision so that it strays from its original purpose. And many have also pointed out that \"precedent\" doesn't mean much for the Supreme Court, which can overrule a previous case to create a new precedent.\n\"I know what the law is now,\" Booker told Kavanaugh, per NJ.com. \"I want to know what the law is going to be when you get on the court and have the ability to change those precedents.\"\nWhen Kavanaugh insisted, \"I have trouble departing from the Supreme Court precedent,\" the senator challenged him: \"But you don't! You opined about it in emails, you've opined about in Wall Street Journal articles.\"\nThe Senate Judiciary Committee has been given around 500,000 pages of documents and memos from Kavanaugh's past to look through before his confirmation vote, according to USA Today. Booker seems to have been referring to an op-ed Kavanaugh wrote in 1999 — also referenced by Sen. Kamala Harris in the hearing — in which he said that Hawaii had a \"racial spoils system.\" Booker also claimed that Kavanaugh had once used the term \"naked racial set asides\" in an email; the nominee asked to see a copy of the message before answering, and Booker said he would provide it later.\nNJ.com on YouTube\nThe senator brought up a few racial justice issues in particular, including affirmative action. He mentioned a series of cases, like Bakke in 1978, Grutter in 2003, and Fisher in 2016, in which the Supreme Court ruled that race may be used as a narrowly-tailored factor in college admissions to make a student body diverse. \"The simple question here,\" Booker said, trying to get at Kavanaugh's personal opinion on the matter, \"is: Do you believe these cases were rightly decided?\" Kavanaugh did not give a direct answer and again brought up \"precedent.\"\nBooker also discussed voting rights and brought up the nominee's record on the issue. In 2012, Kavanaugh voted to uphold a law in South Carolina that required people to show a photo ID before voting at the polls. The Obama administration had been trying to get rid of the law, arguing that it put a disproportionate burden on minority voters because they were more likely to lack photo IDs.\nPBS NewsHour on YouTube\n\"We are at a time where states are enacting these laws all over our country, designed to disenfranchise voters,\" Booker said. \"Your answers don't provide me comfort — as a justice of our nation's highest court — that you will fairly take into account the barriers that continue to disenfranchise minority voters.\"","url":"https://www.bustle.com/p/cory-booker-asked-brett-kavanaugh-about-racial-justice-issues-during-the-hearing-11771265"}
