{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:17:28","date_modify":"2018-10-30 20:17:28","date_publish":"2016-02-11 18:51:03","description":"On February 10 COSMOPOLITAN ran a column urging girlfriends to take guns as seriously as \"abortion and STIs,\" making firearms a topic of conversation with their boyfriends. |","filename":"data/vaneerConsumption/COSMOGirlfriendsShouldTalkAboutGunsLikeAbortionsAndSTIs.json","image_url":"https://media.breitbart.com/media/2014/11/Cosmopolitan-Magazine-US-July-2014-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_02_11__1540930648.html","title":"COSMO: Girlfriends Should Talk About Guns Like 'Abortions And STIs'","title_page":"COSMO: Girlfriends Should Talk About Guns Like 'Abortions And STIs' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On February 10 Cosmopolitan magazine ran a column urging girlfriends to take guns as seriously as “abortion and STIs,” making firearms a topic of conversation with their boyfriends.\nThe magazine says the push is part of their effort to “raise awareness among unmarried women of the risk for gun violence.”\nCosmo says they “talked to some women who love guns, some who loathe them, and a lot in between. And every woman agreed that she would want to know if the man she was dating owned a firearm.” They pointed to the example of 23-year-old named Crystal, who lives in New York City and “[dates] a police officer.” Crystal said, “I don’t want to look in a drawer for a towel and instead find a gun.” And they pointed to 21-year-old Hudson, a student from Orono, Minnesota, who said, “I’d be alarmed if he did not feel comfortable talking about it.”\nCosmo emphasized that girlfriends should not hesitate to talk to their boyfriends about guns because their lives may depend on it. They suggest this is so because Congress has not passed enough gun control focused on dating relationships.\nAccording to Cosmo, “Bringing up guns can be awkward, but as with abortion and STIs, you should know where your partner stands.”\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/the-media/2016/02/11/cosmo-partners-with-everytown-urges-girlfriends-to-talk-to-boyfriends-about-guns/"}
