{"authors":["Pamela J. Hobart"],"date_download":"2018-10-30 23:41:30","date_modify":"2018-10-30 23:41:30","date_publish":"2014-08-13 14:28:48","description":"There's no denying that the cover of Cosmopolitan magazine tends to be a little bit...over the top. So the editors decided to have a little fun with removing all the sexual references, and it became easily apparent why Cosmo doesn't usually have a…","filename":"data/vaneerConsumption/CosmopolitanMagazineShowsWhatTheirGRatedCoversWouldLookLikeYawn.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/228164a4-804b-441a-a8b7-9410823b5be7.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35517-cosmopolitan-magazine-shows-what-their-g-rated-covers-would-look-like-yawn_1540942890.html","title":"'Cosmopolitan' Magazine Shows What Their G-Rated Covers Would Look Like, Yawn","title_page":"'Cosmopolitan' Magazine Shows What Their G-Rated Covers Would Look Like, Yawn","title_rss":"NULL","source_domain":"bustle.com","text":"There's no denying that the cover of Cosmopolitan magazine tends to be a little bit...over the top. So the editors decided to have a little fun with removing all the sexual references, and it became easily apparent why Cosmo doesn't usually have a G-rated cover: It would be incredibly and painfully boring!\nAll the sex that's usually splashed across the cover may give the mistaken impression that Cosmo readers (or even all women) are crazy, conflicted nymphomaniacs who are also simultaneously obsessed with sexually pleasing men (no matter the acrobatics required!). Here's how to have more orgasms! No wait, here's how to give him more orgasms! You could be forgiven for assuming that Cosmo readers do nothing other than have sex.\nThe truth is probably much more boring and commercially motivated: All the reading we wanted to do about lip gloss and flirting we already got out of the way, like in middle school. Cosmo needs to grab eyeballs, and as the old adage goes, sex sells. Although women do seem to have lower sex drives than men in general, that doesn't make us frigid. After a long, boring day of work, childcare, the gym, the \"second shift,\" and whatever else, those juicy headlines jumping out at you from the grocery store's checkout counter are exactly what's needed to grab your attention by the junk. Here is one of the three doctored covers:\nCosmopolitan magazine\nIs it even possible to read any of these headlines non-euphemistically? I would pay money not to have to slog through any of these (except for maybe \"15 Ways to Stimulate His Mind\"). If you don't like sex headlines or articles, leave that Cosmo on the shelf. For those of us with a libido, please keep doing like you do, Cosmo. Check out the other two G-rated covers over at Cosmo online.","url":"https://www.bustle.com/articles/35517-cosmopolitan-magazine-shows-what-their-g-rated-covers-would-look-like-yawn"}
