{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:17:46","date_modify":"2018-10-30 20:17:46","date_publish":"2015-04-03 04:00:22","description":"Cosmo examined the push for campus carry in 12 states and showed that Everytown for Gun Safety must now implore students to defeat the NRA.","filename":"data/vaneerConsumption/CosmoEverytownRelegatedtoImploringStudentstoDefeatNRA.json","image_url":"https://media.breitbart.com/media/2015/03/campus-carry-OK-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_04_02__1540930666.html","title":"Cosmo: Everytown Relegated to Imploring Students to Defeat NRA","title_page":"Cosmo: Everytown Relegated to Imploring Students to Defeat NRA | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On April 1, Cosmopolitan magazine examined the current NRA-backed push for campus carry in “12 state legislatures” and showed that Everytown for Gun Safety has been relegated to imploring students to defeat the NRA or else.\nAccording to Cosmo, the NRA is joined by Students for Concealed Carry in pushing for women to be allowed to carry their concealed handguns on campus for self-defense. Both groups are passionate in their conviction that women who carry guns for self-defense in Walmart, parks, and shopping malls—as well as gas stations, drug stores, and restaurants—ought to be able to carry them to fend off attackers on campus as well.\nEverytown does not want laws changed to allow women the choice of being armed on campus for self-defense, yet they are now relegated to asking college students to fight this fight as all of Everytown’s attempts to this point have fallen on deaf ears.\nFor example, in late February, Everytown tried to stop the campus carry momentum by demanding that Nevada Assemblywoman Michele Fiore (R) and Florida state Representative Dennis Baxley (R) apologize for pushing campus carry as a way for women to protect themselves against sexual assault. No apology was issued.\nSo, in early March, Everytown joined with Moms Demand Action in Florida to push the novel idea of fighting sexual assault with backpacks instead of guns, but Florida lawmakers passed campus carry out of committee anyway. Then, as part of a desperate push to stop campus carry, Everytown tweeted about the dangers of giving guns to “drunk, college-age daughters.”\nStill nothing. Crickets.\nSo now Cosmo says Everytown has taken to MTV appearances to try to get college students to stand up and stop the would-be campus carry juggernaut.\nEverytown’s Jason Rezepka claims that the majority of college students are solidly against the NRA’s push to allow women to be armed on campus for self-defense, and right now, those college students “are in a unique position to [affect] the national guns on campus debate.”\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/the-media/2015/04/02/cosmo-everytown-relegated-to-imploring-students-to-defeat-nra/"}
