{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:13:36","date_modify":"2018-10-30 20:13:36","date_publish":"2015-05-27 11:40:08","description":"Cosmopolitan covered the death of a 21-year-old Australian woman who reportedly died from taking birth control pills for only 25 days.","filename":"data/vaneerConsumption/CosmoReportsonDeathbyContraceptivePill.json","image_url":"https://media.breitbart.com/media/2015/05/BC-Pills.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_27__1540930416.html","title":"Cosmo Reports on Death by Contraceptive Pill","title_page":"Cosmo Reports on Death by Contraceptive Pill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Despite Planned Parenthood’s best efforts to downplay the dangers of birth control pills, even some of its allies occasionally go off script. In an unusual article this week, Cosmopolitan magazine covered the gruesome death of a 21-year-old Australian woman named Fallan Kurek who reportedly died from taking birth control pills for only 25 days.\nWhen she stopped breathing, Kurek was rushed to the hospital by paramedics, where scans showed that she had a large clot on her lung, causing the right side of her heart to become inflamed. After three days in ICU, she was pronounced brain dead and taken off life support shortly after.\nAs the article states, “If you think an unplanned pregnancy or an irregular period is scary, this should put things in perspective.”\nThe essay also noted that Kurek’s death came shortly after other “scary reports” about the risks of taking birth control pills — “like the 26-year-old woman who recently suffered a birth-control-induced stroke.”\nThe author did feel obliged to say that “oral contraceptives can be a total godsend for women” but observed that research suggests that for many women, “the risks outweigh the benefits.”\nDespite a growing awareness of the sometimes fatal side-effects of the birth control pill, groups like Planned Parenthood continue to campaign so that school-aged girls may receive free birth control without the knowledge or consent of their parents.\nOn its website, Planned Parenthood tells girls that “most of the time you don’t need a parent’s permission to get birth control,” and they recommend not using their parents’ health insurance to pay, if they are worried about their parents finding out. “You can also always call your nearest Planned Parenthood health center to see if they can give you free or low-cost services so you don’t have to use your parents’ insurance,” it says.\nCurrently in the United States, twenty-one states explicitly allow all minors to consent to contraceptive services without parental permission, and twenty-five states permit minors to consent to contraceptive services in one or more circumstances.\nWhen news broke in 2012 that New York City public schools were providing free birth control pills to teenagers without their parents’ consent, liberals closed ranks in defending the practice. Time magazine, for example, declared that “the health risk of using birth control pills is surely outweighed by the much greater medical risks of adolescent pregnancy and childbirth.”\nIn a bizarre exercise in mental legerdemain, Time stated that “it seems like common sense that parents who sign permission slips for Tylenol should have the authority to make serious moral and medical decisions for their own children. Except when they shouldn’t.”\nAnother abortion and birth control advocacy group, the Center for Reproductive Rights, has constantly made the argument that parental consent for contraceptives “threatens teen health and constitutional rights.”\nSupporters of parental consent laws, they assert, “are out of touch with reality.” These proposed laws “threaten adolescent health and well-being,” and “even teens who could comply with parental consent requirements will face delays in getting contraceptive services.”\nTry telling that to the parents of Fallan Kurek.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/politics/2015/05/27/cosmo-reports-on-death-by-contraceptive-pill/"}
