{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:17:33","date_modify":"2018-10-30 20:17:33","date_publish":"2015-11-30 18:15:55","description":"Cosmo is urging its readers to countdown to the holidays with its own “Sex-Vent” calendar to make Christmas and Hanukkah all about lust.","filename":"data/vaneerConsumption/CosmoReadiesOffersSexVentCalendarforChristmasAndHanukkah.json","image_url":"https://media.breitbart.com/media/2015/11/Cosmo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_30__1540930653.html","title":"Cosmo Readies Offers 'Sex-Vent' Calendar for Christmas And Hanukkah","title_page":"Cosmo Readies Offers 'Sex-Vent' Calendar for Christmas And Hanukkah","title_rss":"NULL","source_domain":"breitbart.com","text":"Cosmopolitan magazine is urging readers to count down to the holidays this year with its own “Sex-Vent” calendar – complete with step-by-step instructions for how to make Christmas and Hanukkah all about lust.\n“Our Sex-Vent calendar delivers 24 days of hotness,” Cosmo promises, as it advertises sex toys and other products to achieve its own standard of merriness.\nThe print magazine’s holiday issue (pages 149 – 153) teases, “This season’s about to get a whole lot merrier, if you know what we mean (and we think you do).”\nAccording to the magazine, a game of “Sex Dreidel” is sure to make your Hanukkah bright:\nThis spin (get it?) on the traditional game makes each Hebrew letter on the toy’s sides represent something a little less kosher than you’re used to. Instead of chocolate coins, you and your partner will be playing for pleasure… If the dreidel lands on… Nun: According to the ancient Hebrew rules, you do nothing. So sit back…and let him do all the work while you enjoy the festival of lights going on inside your mind. Gimel: You get the pot! Mid-girl-on-top, make like a dreidel and spin around. The end-game? Deeper feels for you and, for him, an amazing view of your, uh, promised land…\nCosmo also invites its readers to “Light His Menorah!” for Hanukkah by rubbing oil from a melted massage candle “on his chest and back, massaging as you go.”\n“Just like the Maccabees’ flame, he’ll last even longer than expected,” Cosmo boasts.\nInstead of the traditional Advent calendar that marks the days until Jesus’ birth, Christmas celebrants are invited to “Go A-Caroling” the Cosmo way “because getting it on to ‘Away in a Manger’ is just wrong,” the magazine asserts.\n“[C]ue up Sharon Jones and the Dap Kings’ new album, It’s a Holiday Soul Party, and skip straight to their sultry version of ‘Please Come Home for Christmas,’ (No, it’s not just a clever name),” Cosmo recommends.\nCosmo readers can also “join in a reindeer game” that starts out in the “missionary” sex position and involves winding “a winter scarf around your holiday hottie’s upper torso and have him rear back on his knees…On Dasher! On Prancer! On Dude!”\nOn December 20 of the “Sex-Vent” calendar, Cosmo women are urged to “light up his Yule log” with step-by-step instructions on how to do just that.\nVictoria Hearst – granddaughter of Hearst Corporation founder William Randolph Hearst – says Cosmopolitan – published by the corporation that bears her name – continues to grow increasingly “depraved.”\nHearst – the founder and chairwoman of Praise Him Ministries in Ridgeway, Colorado – also launched the Cosmo Harms Minors campaign in April. The campaign seeks to get the magazine declared “adult material” so that its covers will be behind blinders in stores to protect young children and adolescents from its blatant sexual material at checkouts.\nSeveral supermarket chains and Walmart have thus far agreed to treat Cosmo as “adult material” by using blinders for its covers.\n“Cosmopolitan magazine and its publisher the Hearst Corporation owe every Jew and Christian in America an apology,” Hearst tells Breitbart News. “Every time I think that editor Joanna Coles and her crew at Cosmo cannot get more depraved, they prove me wrong.”\nHearst says the “Sex-Vent” calendar serves to “mock and defile something good and holy to millions of American Christians like me.”\n“Each day of Cosmo‘s ‘24 Days OF Hotness’ tells the reader to perform sexual acts that include the use of sex toys, ‘erection rings,’ and pornographic books, all of which are pictured along with their price and the websites where they can be purchased,” Hearst explains. “Mind you, nowhere on the cover of this sex rag is there any content warning! So your underage children can buy this magazine without your consent or knowledge.”\n“Jews and Judaism are also included as targets in the pornographic calendar,” Hearst adds. “The Jewish celebration of Hanukkah is turned into a pornfest that Israel’s ancient pagan enemies would be proud of!”\nRecent issues of Cosmo have showcased a prostitute’s life and praised incest as a “perfect storm” that could be a normal relationship were it not considered taboo.\n“There seems to be nothing too vile, pornographic or vulgar that the women at Cosmopolitan Magazine will not embrace and endorse,” Hearst says, adding that her grandfather purchased Cosmopolitan in 1905 as a traditional family women’s magazine.\nOn its website, the Hearst Corporation states, “Cosmopolitan is the best-selling young women’s magazine in the U.S., a bible for fun, fearless females that reaches more than 18 million readers a month.”\n“It’s become a porn rag, and its editor-in-chief and the authorities at Hearst Corporation pornographers,” Hearst asserts.","url":"https://www.breitbart.com/politics/2015/11/30/cosmo-readies-offers-sex-vent-calendar-christmas-hanukkah/"}
