{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:17:36","date_modify":"2018-10-30 20:17:36","date_publish":"2016-03-12 20:51:42","description":"Rep. Diane Black – a member of the House special panel investigating fetal tissue practices in the United States – reports that Cosmopolitan magazine rejected her request for an op-ed submission in response to Amy Brenneman’s recent column in which the actress asserts she never regretted her abortion. |","filename":"data/vaneerConsumption/CosmopolitanRejectsRepDianeBlacksResponsetoAmyBrennemansINeverRegrettedMyAbortionStory.json","image_url":"https://media.breitbart.com/media/2016/03/cosmopolitan-cover.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_12__1540930656.html","title":"Cosmopolitan Rejects Rep. Diane Black’s Response to Amy Brenneman’s ‘I Never Regretted My Abortion’ Story","title_page":"Cosmopolitan Rejects Rep. Diane Black’s Response to Amy Brenneman’s ‘I Never Regretted My Abortion’ Story | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Diane Black – a member of the House special panel investigating fetal tissue practices in the United States – reports that Cosmopolitan magazine rejected her request for an op-ed submission in response to Amy Brenneman’s recent column in which the actress asserts she never regretted her abortion.\n“After I read Amy Brenneman’s column, my office reached out to Cosmopolitan’s editorial staff and asked if they would consider giving me a platform to issue a response,” Black tells Breitbart News in an interview. “Regrettably, they informed my office that, no, they would not consider a submission on this topic, mentioning their belief that the issue is one of ‘reproductive rights.’”\n“It’s a shame that Cosmopolitan, a publication that purports to celebrate and empower women, is not interested in giving a voice to the millions of pro-life women who believe, as I do, that women’s rights begin in the womb,” she adds.\nBrenneman slammed the state of Texas’ abortion safety laws, which were challenged by abortion supporters at the Supreme Court earlier this month, claiming that the new laws would block women from their constitutional right to an abortion – one that she says she exercised during her junior year at Harvard when she found herself pregnant.\nBrenneman wrote:\nWhen I learned I was pregnant, I knew immediately and without question that I wanted an abortion. I had no desire to be a mother at that time — I wanted to finish college and start my career. We found a doctor in the yellow pages. We went to his clean and respectable office. I had the procedure done with no pain; my boyfriend was with me the whole time. Afterward, I breathed huge sigh of relief and thought to myself, I get my life back! I was grateful that I lived in a country where forced birth was not the law of the land and where motherhood was not a lifelong consequence for a contraception slip.\n“I have never, not for one moment, regretted my abortion,” Brenneman asserts. “My abortion story is absolutely uneventful. It has left no scars.”\nBlack – who has been a registered nurse for over 40 years – penned an open letter to Brenneman that, ultimately, was published at FoxNews.com – in which she discusses her own personal experience:\nLike you, I know what it is like to be single, pregnant, and uncertain of what the future holds. I was carrying my youngest child to term when my first husband left me amid the demons of alcoholism. Later, in my career as an emergency room nurse, I met other young women in this same precarious position. I believe that the pro-life community has a responsibility to those women. It is why I have long supported the work of my local crisis pregnancy center and other nonprofits that offer real, tangible help to women in this very situation – everything from diapers and formula to counseling and prayer.\n“I’m baffled why it is that Cosmopolitan is supposed to be a magazine that is read by women — and they tout women’s rights — and yet they won’t allow the other side to be heard,” Black says. “I think that is very telling of the magazine and which side they weigh in on.”\nICYMI – My questioning at Select Investigative Panel on Infant Lives hearing: https://t.co/dVliVymkws #RespectInfantLives — Diane Black (@RepDianeBlack) March 2, 2016\nBlack tells Breitbart News that Brenneman’s column and the subsequent rejection of her response by Cosmopolitan are disturbing for several reasons:\nI was touched to begin with on the whole equality thing, that we cast ourselves as advocates for women, as folks who want to be sure that women do have an ability to be able to function in society with women’s health, and so on. And that begins in the womb. The thought that you can just say you’re a women’s rights person, but you don’t have value for that little girl that may be in your womb – that’s where women’s rights begin, from the very beginning. Second, I think that too many times we pro-lifers speak in a way in which maybe we don’t connect with those who have had abortions – where they may think that we’re judging them – and that’s not at all of what I’m about, nor do I think most pro-life women are about that. It’s about getting the truth out so that women have the ability to make the best decision for them. And I think that’s something that’s so important that we do as pro-life women.\nBlack’s views on abortion safety laws such as those passed by Texas, which require abortionists to have admitting privileges at local hospitals and abortion clinics to meet the same safety and health standards as other outpatient surgical facilities, are also informed by her work as an emergency room nurse.\nShe tells Breitbart News:\nWe did have a botched abortion come into the ER and this young lady had an out-of-town abortion and they had given her a 1-800 number to call. But, by the time she reached the hospital she was in a situation where she had lost so much blood that we could not save her. And so, when I talk about the reasons why these have to be safe places and why these women have to be given the information and they should be regulated, I don’t believe that any woman should lose a life at the hands of an unregulated, unsafe abortion clinic or even a fly-by-night abortion doctor. I just think that is so important that we get that message out there they deserve every bit as much consideration where they have those procedures done as much as any other procedure.\nBlack expresses amazement that abortion supporters seem bent on suppressing scientific and technological data – such as ultrasounds – that provide important information for women considering abortion.\n“All too often women don’t get enough information when they do go to a source such as Planned Parenthood or these other abortion clinics that are making money off of abortion,” she said. “And they’re not given as much information as they need.”\nShe continues:\nI remember when Roe v. Wade was decided. We didn’t have the kinds of science and technology that we have today. Women were convinced this wasn’t a baby – that this really wasn’t life. And we know now as we see all this information come out about fetal tissue that this is a baby – and you don’t get a heart, a lung, a liver, a brain from a blob of tissue – you get that from a baby. And, unfortunately, women many years ago didn’t have good information to make a good decision because they were convinced it wasn’t really “life,” that it was just a “blob,” and now I think that we have this information the falsehood that’s out there is continued. This is just a blob of tissue – it’s not a baby. We’ve got the technology today to say, “That’s not true at all. Here’s what the truth is.” Too often, women are not getting all that information to make the best informed decision – especially the young ones – who don’t know the questions to ask, and they don’t have good advice, and they go into a clinic where they’re really there just to do abortions and not to help that young girl make that decision.\nBlack states the “war on women” is really coming from the abortion industry that won’t support the safety and health standards in abortion clinics patients and medical professionals have come to expect in other situations.\nShe explains:\nThe abortion lobby is essentially saying, “’We’re going to set a different standard for the surgical procedure of abortion – and it is a surgical procedure – and we’re going to set a different standard for that than if you were to go into an outpatient department and have your gall bladder removed or a colonoscopy. We’ve got certain standards there, but we’re not going to give women that same standard when we do an abortion procedure.” And this message doesn’t get out there. Unfortunately, people like those at Cosmopolitan won’t allow the other side of the story to be told. When we try to tell the other side of the story, they shut us down – that to me is a “war on women” – not letting me speak, not letting me be a part of being able to tell my side and get the truth out there about women not really having the kind of information that they need to make the decision – or once they make the decision to be in a safe place where a physician would have a hospital within 30 miles they could take that young girl or woman to in case there was an emergency situation. Or, just to have the same health standards as any other ambulatory surgical center. Why would you not want to have the same cleanliness and all of the same things you want in another surgical center? And, yet, you will have abortion supporters who won’t even want you to talk about it – that’s the “war on women.”\nBreitbart News reached out to Cosmopolitan and was directed to Cosmo.com for comment on why it rejected Black’s op-ed request, but received no response.","url":"https://www.breitbart.com/politics/2016/03/12/cosmopolitan-rejects-rep-diane-blacks-response-to-amy-brennemans-i-never-regretted-my-abortion-story/"}
