{"authors":["Press Association"],"date_download":"2018-10-23 01:55:59","date_modify":"2018-10-23 01:55:59","date_publish":"2017-03-16 12:13:09","description":"From April 1, the price of a prescription will be £8.60.","filename":"data/vaneerConsumption/CostofNHSprescriptionsanddentalcareinEnglandrising.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/12/wire-228233-1489666392-79_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319944_Cost-NHS-prescriptions-dental-care-England-rising_1540259759.html","title":"Cost of NHS prescriptions and dental care in England rising","title_page":"Cost of NHS prescriptions and dental care in England rising | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The cost of an NHS prescription in England will increase by 20p to £8.60 from April 1.\nThe increase was announced by Health Minister Philip Dunne, who said overall prescription charges were expected to rise “broadly in line with inflation” because the cost of prepayment certificates were being held at their current levels.\nThe price of dental care will also increase, with the lowest-cost band one treatment rising by 90p and band three treatment increasing by £10.60.\nMr Dunne told MPs: “The prescription charge will increase by 20p from £8.40 to £8.60 for each medicine or appliance dispensed.\nMinister for Health Philip Dunne\n“To ensure that those with the greatest need, including patients with long-term conditions, are protected, we have frozen the cost of the prescription prepayment certificates (PPCs) for another year. The three-month PPC remains at £29.10 and the cost of the annual PPC will stay at £104, allowing unlimited prescriptions within a specified time period.\n“Taken together, this means prescription charges are expected to rise broadly in line with inflation.”\nThe dental charge increases form part of a two-year settlement announced last year. In 2017/18 a band one course of treatment and urgent treatment will increase by 90p from £19.70 to £20.60.\nFor band two treatment, the price will increase by £2.40 from £53.90 to £56.30 and for band three treatments, a £10.60 increase will see the price rise from £233.70 to £244.30.\nCharges for wigs and fabric supports will rise in line with inflation.","url":"https://www.dailymail.co.uk/wires/pa/article-4319944/Cost-NHS-prescriptions-dental-care-England-rising.html"}
