{"authors":["Jeff Poor"],"date_download":"2018-10-30 21:31:21","date_modify":"2018-10-30 21:31:21","date_publish":"2015-06-03 02:27:08","description":"Coulter on Immigrant Influx: 'American Women Are About to Find Out, You Never Had It So Good'","filename":"data/vaneerConsumption/CoulteronImmigrantInfluxAmericanWomenAreAbouttoFindOutYouNeverHadItSoGood.json","image_url":"https://media.breitbart.com/media/2015/06/Coulter62.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_06_02__1540935081.html","title":"Coulter on Immigrant Influx: 'American Women Are About to Find Out, You Never Had It So Good'","title_page":"Coulter on Immigrant Influx: 'American Women Are About to Find Out, You Never Had It So Good' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday’s broadcast of Fox News Channel’s “The Kelly File,” Ann Coulter, author of the new book, “¡Adios, America! — The Left’s Plan to Turn Our Country into a Third World Hellhole,” warned about the threat the influx of immigrants to the United States could have on the American culture.\nShe explained that although she is worried about the political consequences as a Republican, the cultural impact is much more profound. She pointed to an incident in England to show how that culture there has changed, despite of the efforts of the media to camouflage such incidents that may have stemmed from such cultural changes due to immigration policy.\n“The point I’m making with that, obviously that should be important to me as a Republican,” Coulter said. “But it’s the culture of America that is being changed. It’s the most successful culture on earth and particularly for women, children, plants and animals. Minorities have never been treated with such respect. I mean, you go back to [Alexis] de Tocqueville talking about how women are treated in America. American women are about to find out, you never had it so good, as with American men because no other cultures are like this. You have, in fact one of the things I make fun of in the book, about how the media always hides — you know, ‘spot the immigrant!’ in this or that heinous crime story about a gang rape, child rape, incest rape.”\n“Even the New York Post did it a few days ago with a gang rape of a 12-year old in England,” she continued. “Headline is, ‘School girl raped by 60 men.’ Huh — boy! ‘Men’ are awful in England! And then even reading closely, you will find out perhaps that they’re Asian. Oh, are they Chinese? Are they Korean? No, of course they are Muslim men – Pakistanis. It’s been going on and on and on, raping these British girls, but you will not find it in the media. You certainly won’t find it in the American media. Actually, the British media is where I ended up finding out the truth about a lot of these stories. It is being hidden. This was done intentionally to our country without checking with the American people. And the reason it was done was to get the Democrats 30, 40, 50 million new voters. It’s working. And they have the audacity to act like their arguments are winning. ‘Ah ha, we’ve been vindicated.’ No, you changed the voters.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2015/06/02/coulter-on-immigrant-influx-american-women-are-about-to-find-out-you-never-had-it-so-good/"}
