{"authors":["Farida Jhabvala Romero","Dan Morain","David Gorn"],"date_download":"2018-10-30 23:13:56","date_modify":"2018-10-30 23:13:56","date_publish":"2018-09-06 20:49:48","description":"Oakland voters could approve the state’s first tax on privately owned vacant properties in November.","filename":"data/vaneerConsumption/Couldthistaxonvacantpropertieshelpendhomelessness.json","image_url":"https://calmatters.org/wp-content/uploads/VACANT-PROPERTY-TAX-Photo-1-e1536860236921.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941236.html","title":"Could this tax on vacant properties help end homelessness?","title_page":"Could this tax on vacant properties help end homelessness? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Like many Oakland residents, Candice Elder, 34, is alarmed at the rapidly increasing number of people pitching tents on sidewalks and under freeways in the city.\nUnlike most residents, Elder has worked at dozens of homeless encampments as part of a team providing “rapid response services on call 24-7,” including food, crisis management and medical assistance.\n“The rate of homelessness has dramatically increased in the last few years. And you can correlate that to the affordability crisis,” said Elder, founder and director of The East Oakland Collective nonprofit, as she visited a 65-year old woman sitting on a corner, surrounded by piles of belongings.\nIt could take years to build more affordable housing, but Elder sees a faster way to relieve homelessness in the city.\n“There’s a lot of vacant properties that haven’t been used for years,” said Elder, as she pointed to a fenced, empty parcel next to the encampment she visited on a recent morning. “As a city and as a community, we need to take a look at these vacant public and private lands and see how we can use them.”\nVoters will decide on taxing owners of vacant properties\nOakland voters could approve the state’s first tax on privately owned vacant properties in November. The city estimates the tax could raise as much as $10 million annually for homeless services, blight remediation and to stem illegal dumping. Tax revenue would also go toward new affordable housing.\nOwners of properties in use fewer than 50 days per year would be taxed as much as $6,000 per parcel annually, if two-thirds of voters approve the measure in November.\nTwo weeks after the Oakland City Council voted 6-2 to place the tax on the ballot, officials in the neighboring city of Richmond greenlighted a similar proposal.\nOwners of vacant properties would pay the same amount of additional tax, regardless of the size or worth of their property. Under California law, cities cannot legally tie a parcel tax to market values.\nCritics worry the tax could disproportionately hurt small landowners, pushing some to sell their property to investors that can pay Oakland’s skyrocketing market values. But proponents praise the tax as a creative incentive to transform thousands of vacant lots and buildings into homes or businesses, and at the same time decrease blight.\n“We are looking not only to get rid of the trash, the weeds, the types of problems you might see, but also to encourage people to do something that would be of benefit to the community,” said Councilwoman Rebecca Kaplan, who authored the measure.\nIn just two years, the city’s homeless population increased by 25 percent to nearly 2,800 people, according to the most recent survey of Alameda County. But some homeless advocates say that’s a severe undercount because many people who are couch surfing or sleeping in cars were not included.\nProperty owner sees benefits, but objects to tax\nOakland resident Francisco Acosta agrees with the goal of encouraging more productive uses for vacant properties.\nThe father of three said an empty parcel next to his home attracts trash and drug use. A gunfight in the lot once sent a stray bullet through a bedroom in his house, he said.\nBut Acosta, who also owns a lot labeled as vacant by the county assessor’s office, doubted the tax would encourage him to build the duplex he previously planned for his land. He was dismayed after learning city permits would cost about $35,000 and take a year to process.\n“It doesn’t make sense to just try to penalize people with taxes for not having something built on their lot when they are making it difficult for everybody to build something,” said Acosta, who is growing potatoes, bell peppers and other vegetables on the plot instead.\nHe might not be subject to the tax if the city defines gardening as an active use of property. But Acosta contemplated that if he is faced with a new $6,000 tax assessment each year, he would likely sell.\n“It’d be too much money to pay,” he said. “The tax will pressure people into selling or building, but most likely selling for those who don’t have time, money and energy to deal with the tax.”\nBuilding new housing in Oakland is an expensive proposition. While construction costs can vary significantly based on the size and amenities of a project, the city estimates 1,000 square feet of new construction costs about $200,000.\nPermitting fees for a three-bedroom home can total more than $25,000, according to Oakland’s planning and building department.\nCouncilwoman Kaplan said she understands small property owners face barriers to build housing the city desperately needs. Her tax measure would give them financial assistance to design and construct affordable units.\nNonprofits and low-income owners would be exempt from the tax, as well as others who can prove financial hardship.\nKaplan suspects the majority of vacant properties are being held by owners as a speculative investment in Oakland’s hot real estate market.\n“People who may not have the connection and the motivation to do something with them, and especially a lot of big corporate speculators,” said Kaplan. “And so the vacant property tax will help us keep track of who owns them, what they’re doing with them.”\nMeasure lacks clarity, critics say\nAbout 4,400 bare lots could be subject to the tax plus an unknown number of vacant residential, commercial and industrial buildings, according to a report by Katano Kasaine, Oakland’s finance director.\nCritics decried that lack of clarity, arguing it’s unfair to ask voters to decide on the tax in November.\n“It’d be great to have a list first before you went about taxing people on it,” said Kiran Shenoy, government affairs director for the Oakland Berkeley Association of Realtors. “We don’t know whether or not this is going to end up disenfranchising a lot of small Oakland property owners.”\nHe stressed that although the measure has several exemptions, it will be up to the landowners to prove they qualify.\nA recent study by the Terner Center for Housing Innovation at UC Berkeley found most vacant parcels in the city are small, fit for a single family house or duplex.\nAuthor Hayley Raetz dug through county data that suggests 57 percent of vacant land owners in the city only hold one parcel. But she cautions that percentage is likely overblown in part because owners can create individual LLCs or limited liability companies for each property they buy.\n“That’s where it gets tricky unfortunately. Sometimes you see lots that have owners with different first names and the same last name. But it’s hard to tell if that’s a family or if it’s just a common last name,” Raetz said.\nImplementing tax measure will be key\nLand use experts and others following the debate said that while they support the concept of the tax, much of the proposal’s effectiveness depends on how the city would put it into action.\n“We do have some concerns about how it will be implemented, starting with the definition of what constitutes vacancy,” said Sarah Karlinsky, senior policy adviser at SPUR, a think tank focused on urban planning in the San Francisco Bay Area. The organization sent a letter to city leaders recommending they clarify that definition.\nA parcel that hosts a farmers market once a week would be considered active, said Councilwoman Kaplan. But Karlinksy said enforcement even in that scenario could prove difficult.\n“Monitoring that from the public sector side is really tough,” she said. “Like, are they going to send people out every week to make sure Joe had his farmers market?”\nProponents for the tax point to other cities that have tried taxing empty homes and blighted properties, such as Vancouver, British Columbia and Washington, D.C. as examples of efforts to make land more productive while funding city services.\n“I think this vacant property tax is brilliant,” said Paula Hawthorn, adding that she is tired of walking by abandoned-looking storefronts near her Oakland home. “It’s a good way to stop people from holding on to their property for speculation.”\nFor James Vann, a retired architect who pushed for the tax, the exemptions in Oakland’s measure, and the city’s promise to work out the details, are enough to move forward.\nThe tax would be in place no sooner than 2020, giving the city time to ramp up the effort and create a registry of properties.\nVann believes the measure, which would expire in 20 years, represents an opportunity to fund homeless services the city is struggling to afford.\n“There’s just no money there in the budget,” said Vann, a member of the Homeless Advocacy Working Group. “The homelessness problem is one that we are facing now, that is critical. We can’t wait.”\nThe California Dream series is a statewide media collaboration of CALmatters, KPBS, KPCC, KQED and Capital Public Radio with support from the Corporation for Public Broadcasting and the James Irvine Foundation.\nFarida Jhabvala Romero | KQED","url":"https://calmatters.org/articles/will-vacant-properties-tax-help-homelessness/"}
