{"authors":["Will Stewart For Mailonline"],"date_download":"2018-10-23 01:55:49","date_modify":"2018-10-23 01:55:49","date_publish":"2017-03-16 12:12:26","description":"NSA whistleblower Edward Snowden, 33, exiled in Moscow, could be sent back to the US where he faces a 1,000-year sentence, in exchange for a Russian arms dealer, it is claimed.","filename":"data/vaneerConsumption/CouldEdwardSnowdenbeSWAPPEDforRussiancriminal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53E51900000578-0-image-a-11_1489665770769.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4308180_Could-Edward-Snowden-SWAPPED-Russian-criminal_1540259749.html","title":"Could Edward Snowden be SWAPPED for Russian criminal?","title_page":"Could Edward Snowden be SWAPPED for Russian criminal? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NSA Whistleblower Edward Snowden could be extradited to the US by Vladimir Putin in a swap deal for a Russian criminal, MailOnline has learned.\nSpeculation is growing that Putin may be ready to send back Snowden to help mend the strained relationship between Washington and Moscow.\nAs his girlfriend Lindsay Mills posts carefree pictures on Instagram, there is growing evidence Snowden is concerned he may be handed back to the US.\nA source told MailOnline: 'A way forward could be an exchange of the kind negotiated when Anna Chapman and other 'illegal agents' returned to Moscow.\n'This could involve an agreement that neither side would pursue criminal action or sentences against the parties.'\nSwap deal: Speculation is growing that Edward Snowden, pictured with his American girlfriend Lindsay Mills , could be sent back to the US in exchange for a Russian prisoner\nPrisoner trade: Whistleblower Snowden, who leaked millions of classified US files onto the internet, is reportedly becoming concerned he could be handed back to the US, where he faces a 1,000-year jail sentence. Pictured: Snowden's girlfriend Ms Mills\nGift to trump: Speculation is growing that Putin may be ready to send back Snowden to help mend the strained relationship between Washington and Moscow. Pictured: Snowden's former pole dancing lover Ms Mills\nSelfies: As his girlfriend Ms Mills, pictured with the whistleblower, posts carefree pictures on Instagram, there is growing evidence he is concerned he may be handed back to the US\nLast month American channel NBC quoted a senior US official saying Russia was considering a Snowden handover 'to curry favour' with Trump.\nThe move would be seen as a Putin 'gift to Trump', paving the way for warmer relations and an end to sanctions, it was claimed.\nSnowden could face a 1,000 year prison sentence for treachery in leaking NSA secrets in any deal handing him back to the US.\nDespite happy pictures of the whistleblower and his American lover being posted on her social media, 33-year-old Snowden appears to fear that his Russian bolthole could be lost by Putin's quest for better relations with Washington.\nWhile America’s most wanted has been told he can stay in Moscow until 2020, he is evidently worried this does not give him enough protection.\nIn a move that would infuriate Washington, his attorney Wolfgang Kaleck recently asked the European Parliament to consider granting him asylum.\nBerlin-based attorney Mr Kaleck claimed EU countries were indebted to the whistleblower for exposing US snooping on 'friendly' European governments.\nHis Moscow lawyer Anatoly Kucherena has also said that he could apply for full Russian citizenship after being resident in the country for five years, which would prevent him from ever being extradited to the US.\nClose: Ms Mills, pictured, and Snowden are believed to share an apartment together in Moscow but she does not live in the country permanently. Nothing of her pictures with Snowden gives away any clues as to his location\nRomance: Former pole dancer Mills is believed to have been integral in Snowden's shift from US patriot to the country's most infamous whistleblower. Mills, pictured, followed him to Moscow after he fled but her photos give no indication as to where they are currently hiding\nLocked up: If Snowden is handed back to the US, he faces a 1,000-year prison sentence for treachery in leaking NSA secrets. Pictured: His girlfriend Mills showing her flexibility\nOne of the criminals being considered in the controversial exchange is said to be convicted arms dealer Viktor Bout, 50, nicknamed the 'Merchant of Death'.\nBout, a former air force officer, was kidnapped by US authorities in Thailand in 2011 and convicted of conspiracy to kill US citizens and provide material for terrorists.\nIn Moscow respected journalist and political analyst Sergey Parkhomenko claimed an exchange of Snowden for Bout had already been agreed by Putin and Trump.\nBut this was stopped because of the political climate in the US over Trump's alleged links to Russia.\nKucherena insisted that Moscow 'has no legal basis to hand over Snowden'.\nHe called on Trump to make it legally safe for Snowden to return to the US.\n'We all hope that the new president will take a balanced approach to this matter and make the correct decision - to terminate criminal prosecution of Edward Snowden, a man who loves America and misses it,' he said.\nLoving: Snowden's girlfriend Ms Mills, has been sharing sweet snaps of the couple while the cloud of extradition hangs over them. Pictured: Mills' Instagram post showing the couple celebrating Valentine's day together\nDeal: There is a suggestion that Ms Mills' boyfriend could be exchanged with the US for a Russian criminal. One of those reportedly being considered in the controversial exchange is said to be convicted arms dealer Viktor Bout, 50, nicknamed the 'Merchant of Death'\nStuck: Snowden has been told he can stay in Moscow until 2020, while his attorneys plead for the European Parliament to grant him asylum, but he is said to be concerned this does not give him adequate protection. Ms Mills, pictured, visits him in Moscow from her US home\nIndebted: Snowden's Berlin-based attorney Wolfgang said EU countries owed the whistleblower for exposing US snooping on 'friendly' European governments\n'The way I see it, he (Trump) would gain far more authority if he saw to it all insinuations about Edward Snowden were brought to an end.'\nIn Russia Snowden takes intense security measures amid fears that he could be kidnapped by US agents.\nHe shares an apartment with his girlfriend, a former pole dancer, who regularly visits him in Moscow from the US.\nExchange: Arms dealer Viktor Bout, above, is a name often linked to any swap with Snowden. Bout was reportedly kidnapped by US authorities in Thailand in 2011 and convicted of conspiracy to kill US citizens and provide material for terrorists\nDirector Oliver Stone, who last year released a movie on Snowden, said Mills was crucial to Snowden’s transformation from US patriot to whistleblower.\n'They said she was a pole dancer and dismissed her widely,' said Stone.\nBut Snowden realised 'he couldn't live without her', he said.\n'I think that from being a loner, he changed, and I don't think he ever had another girlfriend, as far as I know.'\nMills' pictures include racy shots but also landscape images which seldom give any clues about their location.\nNothing in her social media gives any sense of Snowden's whereabouts in Russia, although he possibly has an IKEA blind in his bedroom.\nSnowden, a former National Security Agency contractor, is wanted for espionage and theft of state secrets.\nHe shook the American intelligence establishment to its core in 2013 with a series of devastating leaks on mass surveillance in the US and around the world.\nThey included revelations about snooping on friendly foreign leaders.\nHe has been living in exile in Russia since summer 2013 after spending weeks in the transit zone of Moscow's Sheremetyevo airport.\nLovers: After Mills, pictured, followed him to Russia, Snowden said: 'I think the greatest freedom that I've gained is that I no longer have to worry about what happens tomorrow, because I'm happy with what I've done today'\nScenic: Mills' photos of her with 33-year-old former NSA man Snowden rarely give away clues about their secret location in Russia\nIn his attempts to escape 'persecution' by the US authorities, Snowden asked more than 20 countries for asylum but was unable to leave Russia after the US revoked his passport.\nSnowden has said: 'I think the greatest freedom that I've gained is that I no longer have to worry about what happens tomorrow, because I'm happy with what I've done today.'","url":"https://www.dailymail.co.uk/news/article-4308180/Could-Edward-Snowden-SWAPPED-Russian-criminal.html"}
