{"authors":[],"date_download":"2018-10-22 22:23:24","date_modify":"2018-10-22 22:23:24","date_publish":"2014-05-09 15:48:36","description":"“Drones might be marginally helpful, but what we really need first in recovering these girls...is good intelligence.”","filename":"data/vaneerConsumption/CouldDronesHelpFindNigeriasMissingSchoolgirls.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/432406/140509-nigeria-schoolgirls-mn-1320_51e6de1c51dcf6b2b86cb93ca109cb17.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_could-drones-help-find-nigerias-missing-schoolgirls-n101501_1540247004.html","title":"Could Drones Help Find Nigeria's Missing Schoolgirls?","title_page":"Could Drones Help Find Nigeria's Missing Schoolgirls?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe search for nearly 300 missing Nigerian schoolgirls has taken on an international dimension with the arrival of American and British experts on the ground to help track down the teens.\nThere are military personnel, development experts, law-enforcement and intelligence agents. And then there’s the possibility of calling in the drones.\nReuters reported Thursday that the U.S. was considering a request by Nigeria to provide surveillance aircraft and intelligence. \"We are considering it,\" Linda Thomas-Greenfield, U.S. assistant-secretary of State for African Affairs, said in an interview.\nWhile surveillance drones have been used for humanitarian purposes from the Fukushima radiation disaster to earthquake hit Haiti, experts are divided over how effective they would be in searching for the schoolgirls whose plight has captivated the world.\n“From a technical perspective it makes sense,” said military aviation expert Caitlin Lee. “You can see places you probably couldn’t get to on foot.”\nDrones — also known as unmanned aerial vehicles, or UAVs — also can be stationed longer than manned aircraft, using cameras and infrared sensors that can detect movement and heat to transmit live feeds to analysts on the ground.\nFeeds from around-the-clock surveillance would help analysts on the ground establish patterns of life - movement of people, numbers of people and suspicious activity - that could ostensibly shed light on the girls' whereabouts.\nThat, she said, takes time - which has been slipping away in the weeks since the girls were seized from their school in northeastern Nigeria.\nGetting drones up in the air most likely wouldn’t be an issue, as long as Nigeria agrees to open up its airspace. The U.S. has unarmed drones in the region, which have been used to gather intelligence to help French forces conducting operations in Mali.\nThe tricky part is making sure the drones, which offer a soda-straw view of a location, know where to look.\n“Drones might be marginally helpful, but what we really need first in recovering these girls – and in fighting a group like Boko Haram – is good intelligence,” said J. Peter Pham, director of the Africa Center at the Atlantic Council.\nDescribing the search for the girls as “looking for needles in a haystack,” he said human intelligence and communications, or signals, intelligence - are both crucial.\n“This is a puzzle,” he said. “It’s going to be cracked primarily with human intelligence. And that takes time.”\n“Drones might be marginally helpful, but what we really need first in recovering these girls – and in fighting a group like Boko Haram – is good intelligence”\nIn Nigeria, however, that could prove problematic.\nExperts say that human intelligence is not well developed in northern Nigeria, where many locals also fear the security forces and are reluctant to share information.\nSignals intelligence, too, is often unreliable. The Nigerian government has also periodically shut down cell phone networks in the northeast to choke communications between militants, which makes it impossible for signals intelligence analysts to triangulate locations.\n“Irrespective of what one thinks of NSA surveillance, there is a certain value in being able to collect that kind of data an analyze it,” Pham said. “But you can’t collect or analyze if you shut down the whole system.”\nIf the intelligence picture does come together and point to certain parts of the country, terrain there could throw a wrench in any aerial surveillance operation.\nDrones are effective over open terrain — like in Mali or Niger, but Nigeria is densely populated and in many areas, members of extremist groups like Boko Haram are largely indistinguishable from locals.\n“It’s one thing if you have Toyota trucks full of armed guys creating a wave of dust across the Sahara,” said Pham. “It’s a whole other thing when they’re hidden in the population.”\nMost experts and analysts believe the girls have been split into smaller groups, meaning there could be a large number of potential sites for surveillance.\nPlus, if intelligence indicates the girls are being held in a dense, forested area -- like Sambisa Forest, a Boko Haram stronghold - drones could have problems honing in on where the hostages are being held.\nCameras mounted on UAvs are “virtually a non-starter” outside of checking clearings and wide open spaces for search and reconnaissance operations, according to Nick Brown, editor of IHS Jane’s International Defence Review.\nBrown said that in addition, trying to find targets through foliage is a “huge challenge” issue for airborne sensors.\n“Thermal signatures such as body heat are easily masked by the leaves and the air gaps between canopy layers,” he explained.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/could-drones-help-find-nigerias-missing-schoolgirls-n101501"}
