{"authors":["Francesca Chambers","White House Correspondent For Dailymail.Com"],"date_download":"2018-10-23 05:41:13","date_modify":"2018-10-23 05:41:13","date_publish":"2016-01-11 18:41:15","description":"She lost Iowa to Barack Obama that year and never bounced back. Obama won the presidency, and Clinton got stuck waiting in line for another eight years.","filename":"data/vaneerConsumption/CouldHillaryClintonloseBOTHofthefirsttwoprimarystates.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/30019D7300000578-0-image-a-19_1452536939980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394196_Could-Hillary-lose-two-primary-states-Nightmare-scenario-unfolds-Bernie-Sanders-crushes-2008-repeats-itself_1540273273.html","title":"Could Hillary Clinton lose BOTH of the first two primary states?","title_page":"Could Hillary Clinton lose BOTH of the first two primary states? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From the 30,000 foot level, Hillary Clinton appears to have a lock on the Democratic nomination.\nShe polls as much as 15 points ahead of Bernie Sanders, her main rival in the race, and has the support of more than half of the party officials who could shift the balance at the national nominating convention this summer.\nA closer look at the race shows Clinton, 68, in danger of losing the first two contests in Iowa and New Hampshire to Sanders.\nThat's a nightmare scenario for Clinton, the presumed winner of the 2008 nomination, the Washington Post points out.\nSCROLL DOWN FOR VIDEO\nHillary Clinton is danger of losing the first two contests in Iowa and New Hampshire to Bernie Sanders. Clinton is seen here on Sunday in New Hampshire campaiging\nNew polls put Sanders, seen here yesterday in Iowa, ahead in New Hampshire and within three in the Hawkeye State\nShe lost Iowa to Barack Obama that year and never bounced back. Obama won the presidency, and Clinton got stuck serving in his cabinet.\nClinton has been waiting eight years for a second shot at the presidency, and her campaign has carefully worked to avoid a repeat of the 2008 catastrophe.\nIt's deployed both Bill and Chelsea Clinton to stump for Hillary, tripling the ground the operation can cover each day.\nThe former president and the Clinton's daughter are in New Hampshire this week as Hillary takes on Iowa. While the candidate makes appearances in South Carolina over the weekend, they'll pick up where she left off in the Hawkeye State.\nThe former first family has also turned fundraising into a team effort. Bill's been headlining donor events for his wife for some time. Chelsea will make her own contribution later this month when she collects cash for Hillary's campaign in New York and LA.\nClinton has called in other big guns to campaign on her behalf in Iowa and New Hampshire, as well.\nTony Goldwyn, aka President Fitzgerald Grant of Scandal, spent a weekend in December using the popularity of his on-air character to help Clinton win votes there.\nActress Lena Dunham lent a helping hand over the weekend, skipping the Golden Globes to pinch hit for Clinton in Des Moines and Iowa City. She made stops for Clinton in New Hampshire on Friday.\nWomen's World Cup soccer winner Abby Wambach, who helped lead Team USA to victory and retired at the end of last year, joined Dunham on the trail in New Hampshire at a Women for Hillary event, then split off to campaign for Clinton elsewhere in the state.\nIn October Katy Perry set the stage when she traveled to Des Moines with Clinton to attend a Democratic Party dinner. Before the function, a fundraiser for the party's Feb. 1 caucuses, Perry performed at a free, outdoor concert for Clinton's backers.\nAnd yet, Sanders has pulled within three of Clinton in Iowa in an NBC News poll taken in conjunction with Marist and the Wall Street Journal.\nThe same survey found Sanders leading her by four points in New Hampshire.\nIowans will cast their votes in three weeks on Feb. 1. New Hampshire residents are up a week later on Feb. 9.\nHer campaign is trying to avoid a repeat of 2008, when she lost Iowa to Barack Obama and never bounced back. It's trotting out celebrities in the final weeks before the Iowa caucuses to campaign for Clinton, including Lena Dunham, seen here on Friday stumping for Clinton in New Hampshire\nIt's deployed both Bill and Chelsea Clinton to stump for Hillary, tripling the ground the operation can cover each day. Bill's seen here in Iowa last week. He'll be in New Hampshire tomorrow\nThe polls of the early voting states, released yesterday, were taken last week, as President Barack Obama announced new gun control guidelines.\nClinton's backed Obama every step of the way on the measures and depicted Sanders as soft on gun violence. She made several rare TV appearances on MSNBC and CBS last week to do just that.\n'I think that the excuses and efforts by Senator Sanders to avoid responsibility for this vote, which the National Rifle Association hailed as the most important in 20 years, points at a clear difference,' Clinton said yesterday on Face the Nation.\nShe added, 'It’s a difference that Democratic voters in our primary can take into account.'\nSince the polls were taken former Congresswoman Gabrielle Giffords, who retired after her miraculous recovery from a gun shot wound to the head, and her astronaut husband Mark Kelly have endorsed Clinton.\nThis morning Sybrina Fulton, mother to Trayvon Martin, penned an op-ed on CNN giving the former first lady and U.S. Senator her support, as well.\nFulton doesn't mention Sanders.\nShe says in Clinton she 'found a mother and a grandmother who truly heard me, and understood the depth of my loss' and touts the former lawmaker's work to prevent gun violence.\n'Clinton will uphold President Obama's recent executive actions, and then she'll go even further,' Fulton writes. 'Her plan focuses on reforms that would help keep more guns out of the hands of criminals.'\n'I agree with the President: We should only support leaders that fight for common-sense gun reforms. Clinton passes that test.'\nOver the weekend Clinton also trotted out an endorsement from Planned Parenthood and brought the head of the women's health network, Cecile Richards, with her to events in New Hampshire to tout it.\nClinton is trying to break Sanders' hold over Democratic voters by going after him on guns. She's seen here yesterday talking about it on Face the Nation\nClinton is expected to come in first in the Nevada and South Carolina caucuses at the end of February regardless of what happens in Iowa and New Hampshire.\nIn South Carolina she has a 40-point lead over Sanders.\nBut four days later Sanders will have new pick-up opportunities on Super Tuesday, when his home state of Vermont votes, as does Massachusetts.","url":"https://www.dailymail.co.uk/news/article-3394196/Could-Hillary-lose-two-primary-states-Nightmare-scenario-unfolds-Bernie-Sanders-crushes-2008-repeats-itself.html"}
