{"authors":["Lisa Ryan For Dailymail.Com"],"date_download":"2018-10-23 05:13:26","date_modify":"2018-10-23 05:13:26","date_publish":"2016-01-11 18:22:58","description":"University of Sydney scientists warn chromium supplements may be tied to cancer. The Julia Roberts movie Erin Brockovich linked chromium-filled water to a cluster of illnesses.","filename":"data/vaneerConsumption/CouldweightlosssupplementsthatturncarcinogeniccauseCANCER.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D5A1600000578-0-image-a-48_1452534657861.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394285_Could-weight-loss-supplements-cause-CANCER-Chromium-turns-carcinogenic-enters-body-s-cells_1540271606.html","title":"Could weight-loss supplements that 'turn carcinogenic' cause CANCER?","title_page":"Could weight-loss supplements that 'turn carcinogenic' cause CANCER? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Long-term use of nutritional chromium supplements may lead to an increased risk of cancer, scientists reveal.\nChromium is a trace mineral involved the metabolism of carbohydrates, fats and proteins.\nThe mineral is often found in weight loss and body building supplements.\nHowever, chromium can also take on a carcinogenic form, which can increase the risk of cancer.\nThe carcinogenic form gained notoriety in the Julia Roberts movie Erin Brockovich, which linked a cluster of illnesses – including cancer – to its presence in a California town’s drinking water.\nAnd now, a new Australian study found that chromium is partially converted into the carcinogenic form – called hexavalent chromium – when it enters cells.\nThe findings raise health concerns over the extended use of nutritional chromium supplements.\nLong-term use of nutritional supplements that contain the mineral chromium has been potentially linked to increased cancer risk, scientists reveal. A new study found that chromium is partially converted into a carcinogenic form when it enters cells (File photo)\nThe mineral is primarily found in two forms.\nThe first is trivalent chromium(III) picolinate, which is sold as nutritional supplements.\nMeanwhile, hexavalent chromium(VI) is its ‘carcinogenic cousin'.\nSupplements containing chromium are taken for weight loss and body building – with up to 500 micrograms of the mineral included in each tablet.\nChromium supplements are also used to treat metabolic disorders, including insulin resistance and type 2 diabetes.\nBut, chromium’s mechanism of action in the body is not well understood.\nThe US National Academy of Science estimated that up to 200 micrograms of chromium is a safe and adequate dietary intake for adults.\nThese findings should make people think twice about taking supplements containing large doses of chromium Professor Peter Lay, of University of Sydney\nFurthermore, Australia’s National Health and Medical Research Council Nutrient Reference Values, which are currently under review, recommend 25-35 micrograms of chromium daily for adults.\nIn the new study, a research team from the University of Sydney treated animal fat cells with chromium(III) in a laboratory.\nThey then created a map of every chemical element contained within the cell using an intense X-ray beam, called a synchrotron.\nThe X-rays were conducted in Argonne National Laboratory in the US.\nLead study author Dr Lindsay Wu, now of University of New South Wales, said: ‘This high energy X-ray beam from the synchrotron acted as a fluorescent microscope, which allowed us to not only see the chromium spots throughout the cell but also to determine whether the spots were chromium(III) or a combination of chromium(III) chromium (V) and chromium(VI).\n‘The health hazards associated with exposure to chromium are dependent on its oxidation state.\n‘We were able to show that oxidation of chromium inside the cell does occur, meaning it loses electrons and transforms into a carcinogenic form.’\nA high energy x-ray beam allowed scientists to identify chromium spots throughout the cell. By using a second high energy beam focused at these spots, the scientists were able to tell that the cell had converted into the carcinogenic form of chromium. The spots are identified by the arrows in this image\nFurther experiments conducted in Australia and Japan helped clarify the carcinogenic nature of chromium(V) and chromium(VI) formed in cells.\nProfessor Peter Lay of University of Sydney said that the latency period for chromium(VI)-related cancers is often greater than 20 years.\nAs a result, the findings raised concerns about the possible cancer-causing qualities of chromium compounds and the risks of taking chromium nutritional supplements long-term or in high doses.\nProfessor Lay said: ‘With questionable evidence over the effectiveness of chromium as a dietary supplement, these findings should make people think twice about taking supplements containing large doses of chromium.\n‘However, additional research is needed to ascertain whether chromium supplements significantly alter cancer risk.’","url":"https://www.dailymail.co.uk/health/article-3394285/Could-weight-loss-supplements-cause-CANCER-Chromium-turns-carcinogenic-enters-body-s-cells.html"}
