{"authors":["Lucia Peters"],"date_download":"2018-10-30 23:41:33","date_modify":"2018-10-30 23:41:33","date_publish":"2014-08-13 14:09:03","description":"Remember that HIV-killing condom we told you about a few weeks ago? Well, it’s got a buddy now, and it might be just as effective at stopping the virus in its tracks. A team of bioengineers at the University of Washington have created a “tampon”…","filename":"data/vaneerConsumption/CouldaTamponCouldHelpProtectWomenAgainstHIVThisOneMight.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b1edd67d-1e0c-42e4-b809-9c80d7198e8f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35582-could-a-tampon-could-help-protect-women-against-hiv-this-one-might_1540942893.html","title":"Could a Tampon Could Help Protect Women Against HIV? This One Might","title_page":"Could a Tampon Could Help Protect Women Against HIV? This One Might","title_rss":"NULL","source_domain":"bustle.com","text":"Remember that HIV-killing condom we told you about a few weeks ago? Well, it’s got a buddy now, and it might be just as effective at stopping the virus in its tracks. A team of bioengineers at the University of Washington have created a “tampon” that might prove to be a major player in protecting women against HIV.\nIt’s not a tampon in the traditional sense — it’s shaped like one and inserted like one, but it isn’t a feminine hygiene product. The preliminary study, published in the journal Antimicrobial Agents and Chemotherapy, details how it works: Researchers built the tampon out of silk-line fibers packed full of the HIV treatment drug maraviroc, which evidence suggests might also act as a preventative. Inserting it into the vagina brings it into contact with a whole lot of moisture, which causes the fibers to dissolve — and as they break down, they release the maraviroc, allowing the body to quickly and easily absorb the medication. Neat-o, right?\nMost HIV prevention efforts have hitherto been focused on Pre-Exposure Prophylaxis, or PrEP. Meant primarily for those at high risk of HIV infection — people in relationships with HIV-positive partners, people who inject drugs, people who have regular unprotected sex with partners while remaining unsure of their HIV status, and so on — they’re ingested via a daily pill. Topical methods also exist in the forms of creams or gels, although they can be both messy and unreliable.\nThat’s why the researchers have stepped up to the plate. Said lead author Cameron Ball to the Huffington Post, “We envision a product that could dissolve, pretty much instantaneously, into a gel and then spread around the vagina during sex. We want something that dissolves quickly so that people can say, ‘Hey, I wasn’t planning on it, but I’m going to have sex in five minutes so I need to use this product, and I want it to be completely dissolved before that.’”\nAs Salon pointed out, the advantages of this delivery method are many: It’s more effective, it won’t have the same leakage or mess, and it could even be harnessed to prevent other STIs or as a method of contraception. It still might be a while before we see it in pharmacies — it’s got a few more rounds of trials to go — but it’s still an exciting prospect. Between the tampon and the condom, we’ll be better equipped to fight HIV — as well as the stigma that goes along with it. Healthy sex is good sex!\nImages: Fotolia; Gif Abyss","url":"https://www.bustle.com/articles/35582-could-a-tampon-could-help-protect-women-against-hiv-this-one-might"}
