{"authors":[],"date_download":"2018-10-30 14:29:50","date_modify":"2018-10-30 14:29:50","date_publish":"2014-06-09 00:00:00","description":null,"filename":"data/vaneerConsumption/CouldBenghazihavebeenaBergdahlGambitthatWentSouth.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_06_could_benghazi_have_been_a_bergdahl_gambit_that_went_south_comments_1540909790.html","title":"Could Benghazi have been a Bergdahl Gambit that Went South?","title_page":"Articles: Could Benghazi have been a Bergdahl Gambit that Went South?","title_rss":"NULL","source_domain":"americanthinker.com","text":"President Obama has been trying to close Gitmo for years, which means finding a way – any way – to free the terrorists from that prison. Regrettably for Obama, try as he might, he has been unable to obtain Congressional approval to release Gitmo detainees back onto the battlefield to recommence the murder, mayhem, and destruction. Thus far, the United States Congress thinks it is in the best interest of the American people to keep highly dangerous Taliban fighters locked up for as long as possible. Barack “I won” Obama thinks otherwise. That’s why founding member of the Taliban Khair Ulla Said Wali Khairkhwa, who had close ties with Osama bin Laden, and Mohammad Nabi Omari, member of a joint al-Qaeda/Taliban cell and called “one of the most significant former Taliban leaders detained,” along with deputy chief of Taliban intelligence Abdul Haq Wasiq are now roaming free on the streets of... (Read Full Article)","url":"https://www.americanthinker.com/articles/2014/06/could_benghazi_have_been_a_bergdahl_gambit_that_went_south_comments.html"}
re present when CIA paramilitary officer Johnny Micheal Spann was killed during the 2001 Mazar-e Sharif prison riot.\nAll five are classified as a \"high risk\" to the United States. That’s why, based on those credentials, it’s easy to see why Congress had been reluctant to make a deal with the devil that is the Taliban.\nBut at this juncture none of that matters, because thanks to Barack Obama’s majestic magnanimity, five jihadists are now free to wage war again on Americans worldwide.\nIn the past, Barack Obama has repeatedly proven that he believes he is above the law, which is why he took the Gitmo matter into his own hands and circumvented the rule requiring him to notify Congress 30 days prior for approval before releasing prisoners. By ignoring the National Defense Authorization Act that he himself signed into law, the “rogue” president belittled Congress and again showed total disrespect for the authority of the U.S. Constitution.\nWhat’s distressing is that in this case the commander-in-chief found a man who may possibly be a traitor to assist in his clandestine endeavor to accomplish what Congressional obstacles had thus far prevented. That assistant was Sgt. Bowe Bergdahl, who was allegedly fed up with being identified as an American and defending America’s interests in Afghanistan.\nFrom the looks of things, Bergdahl may have been attracted to the Taliban even before he walked off his base. Yet Barack Obama was willing to portray a deserter and possible traitor as an honorable POW and use that as cover to spring five mass-murdering Taliban operatives from Gitmo.\nThis Bergdahl “rescue” is such a tangle of provable lies it must inspire a certain amount of conjecture, such as: Could the president’s desire to free Gitmo prisoners explain what went down 20 months ago in Benghazi?\nSorry to have to say it, but with such a conniving, deceitful administration, if a Taliban sympathizer/Army deserter was used as the bargaining chip to free five high-level Taliban fighters, is it that farfetched to imagine that the kidnapping of an American ambassador presented the president with the perfect opportunity to swap either the Gitmo Five or some other equally dangerous individual(s)?\nMoreover, after observing the president’s dishonesty in the Bergdahl affair, it’s not that much of a stretch to believe that if Obama couldn’t get Congress to agree to swap Bergdahl in early 2012, he might have manipulated the volatile Benghazi situation in hopes that a kidnapped American diplomat would eliminate Congressional objections to a high-level prisoner swap.\nIf the theory is accurate and Obama calculated to delay trying to save Stevens with the goal of a hostage swap, how could things have gone so terribly wrong?\nGranted, dealing with terrorists is a risky endeavor to undertake, regardless of the circumstances. However, the president has proven repeatedly that forethought is not one of his strong suits. Thus, it probably never occurred to Obama that when working with jihadists the effort could backfire with catastrophic results.\nGuesswork aside, what is certain is that according to former regional security officer Eric Nordstrom, after repeated requests for additional security were denied, he was so frustrated in his efforts to protect the American ambassador he said that dealing with the State Department felt like “The Taliban [was] on the inside of the building.” If the hesitation to respond was purposeful when the inevitable finally did happen, it certainly could explain why an American ambassador had been left so poorly defended.\nIt could also shed light on the initial “stand down” order that was given during the attack; the bizarre rationale behind the White House’s decision to concoct the lie about the video; and why the president’s whereabouts on the night of September 11th, 2012 are still among the Obama administration’s best-kept secrets.\nA calculated effort to thwart a speedy rescue in order to orchestrate a potential hostage exchange might also explain why Hillary and Obama were still perpetrating the video lie as the flag-covered coffins carrying the remains of Christopher Stevens, Sean Smith, Tyrone S. Woods and Glen Doherty were rolled off the cargo plane at Andrews Air Force Base.\nEven for a man anxious to empty out Gitmo, four dead Americans would certainly put the kibosh on trying a prisoner swap a second time; so maybe it was shell shock that caused Obama to wait almost two years to give Bergdahl a go without Congressional approval.\nEither way, if any of this speculation is even remotely close to true, it certainly would make more understandable all the obfuscation and mystery in the aftermath of that fateful night.\nBut more importantly, after a frustrating two-year-long probe that has accomplished nothing but Obama administration stonewalling, if the unscrupulous tactics behind the Bergdahl/Gitmo charade are ever fully disclosed, maybe America will get outraged enough to demand to know what really happened in Benghazi.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2014/06/could_benghazi_have_been_a_bergdahl_gambit_that_went_south.html"}
