{"authors":[],"date_download":"2018-10-22 22:51:58","date_modify":"2018-10-22 22:51:58","date_publish":"2014-05-12 21:54:04","description":"Dateline just hit one million Facebook fans, and we want to bring one of YOU to NYC to represent the million!","filename":"data/vaneerConsumption/CouldYOUbetheoneinamillion.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/437501/x_30_dtl_million_140512_c1383c013889f2b0a3f7814944797596.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/dateline_could-you-be-one-million-n103621_1540248718.html","title":"Could YOU be the one in a million?","title_page":"Could YOU be the one in a million?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDateline just hit one million Facebook fans, and we want to bring one of YOU to NYC to represent the million! Tell us why it should be you on our Facebook page. If you win, we’ll bring you (and a friend) to NYC to spend some time with us behind the scenes!\n-----------------------------------------------------------------------------------------------------\nDateline's One In A Million Contest\nOfficial Rules\nMay 12, 2014—May 19, 2014\nPRELIMINARY INFORMATION: NO PURCHASE NECESSARY. A purchase will not improve your chances of winning. Void where prohibited. The One In A Million Contest (“Contest”) will begin on May 12, 2014 at 6:00 PM ET and end on May 19, 2014 at 11:59 PM ET (“Contest Period”). All times in the Contest refer to ET Time (“ET”). Odds of winning depend upon the number of eligible entries received. Contest is subject to all applicable federal, state and local laws.\nELIGIBILITY: Open only to permanent, legal United States (“U.S.”) residents who are physically residing in one (1) of the forty-eight (48) continental United States or the District of Columbia (excluding Alaska, Hawaii, Puerto Rico, Guam, the Virgin Islands and other United States territories), and who are eighteen (18) years of age or older as of the start of the Contest Period. Officers, directors, and employees of Contest Entities (as defined below), members of these persons’ immediate families (spouses and/or parents, children, and siblings, and their spouses, regardless of where they reside), and/or persons living in the same households as these persons (whether or not related thereto) are not eligible to enter or win the Contest. Contest Entities, as referenced herein, shall include Dateline NBC and NBCUniversal Media, LLC, both located at 30 Rockefeller Plaza, New York, NY 10112, (“Sponsors”), and their respective parent, subsidiary, and affiliate companies, and their administrative, advertising, and promotion agencies, and any other entity involved in the development, administration, promotion, or implementation of the Contest. Entrants must be of good moral character. Sponsors reserve the right to exclude anyone convicted of a crime (other than moving violations of a misdemeanor type that did not involve personal injury, drugs, or alcohol).\nTO ENTER: During the Sweepstakes Period, visit Dateline’s Facebook Page at https://www.facebook.com/datelinenbc (the “Page”) and click “Like.” Once you have “Liked” the Page, you will be required to submit a comment to Dateline’s post on the Page that will be posted on May 12, 2014] at or about [6:00PM ET] (the “Post”) with a statement (“Statement”) of fifty (50) words or less on the following theme: What makes you one (1) in a million and why do you deserve a trip to New York City to spend time with the Dateline team? (“Entry”). The Statement must be submitted via a “Comment” on the Post.\nAs part of your Entry, you will also have the opportunity to submit an optional photo (“Photo”) depicting why you are one (1) in a million and deserve a trip to New York City to spend time with the Dateline team. You must submit the Photo as part of your Statement via a “Comment” on the Post. Photo must have been taken by you and you must have permission of any person identified in Photo. Professional Photos and Photos with watermarks are not eligible. If any minor appears in the Photo, you must be the parent or legal guardian of the minor.\nAs part of your Entry, you will also have the opportunity to submit an optional video (“Video”) by including a public URL that links to your Video on a video-sharing website (for example, YouTube, Vimeo, Vine, or Instagram Video) in your Statement via your Comment on the Post. Video must be no longer than two (2) minutes depicting why you are one (1) in a million and deserve a trip to New York City to spend time with the Dateline team. You must submit the Video by including a public URL that links to your Video in your Statement. If you would like to include a Video in your Entry, before submitting your Entry, you must upload Video onto the applicable video-sharing website according to the instructions provided on the applicable video-sharing website. Video is subject to and must comply with the applicable video-sharing website’s terms of service and specifications for user Video and/or video uploads. Video must also comply with the applicable video-sharing website’s guidelines and any other policies as may otherwise be posted on the applicable video-sharing website. Failure to comply with such policies shall result in disqualification at the sole discretion of Sponsors. Video cannot have been created professionally. You must have the permission of any person identified in the Video. If any minor appears in the Video, you must be the parent or legal guardian of the minor.\nAll Entries become the property of Sponsors and will not be acknowledged or returned. Your Statement must be original (that is, written by you) and must be submitted in the English language.\nBy entering the Contest, entrants grant Sponsors the non-exclusive, royalty-free, and irrevocable rights to use, reproduce, copy, publish, display, distribute, perform, translate, adapt, modify, and otherwise exploit the Statement, Photo, and Video, and to incorporate the Statement, Photo, and Video in other works in any and all markets and media worldwide in perpetuity. Entrants warrant that they have the sole and exclusive right to grant such rights to Sponsors and that the Sponsors' reproduction, publishing, displaying, and/or other use of the Statements, Photos, and Videos will not infringe on any rights of third parties, including, without limitation, copyright, trademark, privacy, or publicity, or create claims for defamation, false light, idea misappropriation, intentional or negligent infliction of emotional distress, or breach of contract. If any Statements, Photos, or Videos contain material that is violent, pornographic, obscene, illegal, inappropriate, or racially or morally offensive or if any Statements, Photos, or Videos do not comply with these Official Rules or meet Sponsors’ standards for any reason, as determined by Sponsors in their sole discretion, such Statements, Photos, and Videos (and the related Entries) may be rejected as ineligible for consideration and/or deleted from the Page. Entries must comply with all applicable laws, rules, and regulations. Sponsors shall have no obligation to copy, publish, display, or otherwise exploit the Statements.\nYou may enter once during the Contest Period. Multiple Entries received from any person beyond this limit will void all such additional Entries. Entries must be received before May 19, 2014 at 11:59 PM ET to be eligible for the Contest. Sponsors’ computer shall be the official timekeeper for all matters related to this Contest. Any person found to have used multiple accounts to enter will be deemed ineligible and disqualified. Entries generated by a script, macro, or other automated means will be disqualified. Entries that are incomplete, garbled, corrupted, or unintelligible for any reason, including, but not limited to, computer or network malfunction or congestion, are void and will not be accepted. In case of a dispute over the identity of an entrant, the authorized account holder of the account used to enter will be deemed the entrant. “Authorized account holder” is defined as the person who is assigned to an account by the website. Sponsors reserve the right to deem that the Entry was made by the registered subscriber of the account submitted at the time of entry. Entry constitutes permission (except where prohibited by law) to use entrant’s name, user name, city, state, likeness, image, and/or voice for purposes of advertising, promotion, and publicity in any and all media now or hereafter known, throughout the world in perpetuity, without additional compensation, notification, permission, or approval.\nJUDGING: A panel of qualified judges selected by Sponsors (“Judges”) will review the eligible Entries received during the Contest Period and select one (1) potential winner (“Winner”) on or about 100% based on the following judging criteria (“Judging Criteria”): Originality (25%), Creativity (25%), and Appropriateness to the Theme (50%). In the event of a tie, the Judges will break the tie by selecting the tied entrant who received the highest points from the Judges for Originality as the potential Winner. In the event a tie remains, the tied Entries will be judged by an additional tie-breaking judge, using the Judging Criteria, to determine which of the tied entrants will be the potential Winner. Decisions of Sponsors and Judges are final and binding with respect to all matters related to the Contest. Winning is subject to verification of eligibility. Sponsors reserve the right to pick fewer than one (1) Winner, or to extend the Contest Period if in their sole discretion, Sponsors do not receive a sufficient number of eligible and qualified Entries. Potential Winner will be notified by a comment on the post with the winner’s name tagged. PotentialWinner may be required to execute and return an affidavit of eligibility, release of liability, and, except where prohibited, publicity release (collectively, “Contest Documents”) within two (2) days of such notification. Noncompliance within this time period, with these Official Rules or the return of or inability to deliver any Prize (as defined below) or Prize notification may result in disqualification and, at Sponsors' discretion, and time permitting, an alternate potential Winner may be selected from among all eligible remaining Entries based on the Judging Criteria.\nPRIZE: There will be one (1) prize awarded (“Prize”) to Winner. Prize consists of the following: a trip for Winner and one (1) guest (“Guest”) to New York City (“Trip”) and the opportunity for Winner and Guest to meet the Dateline team and observe the work of a Dateline production (“Event”). Trip includes the following: round-trip coach class airfare for Winner and Guest from a major airport near Winner’s home to a major airport in the New York/New Jersey Metropolitan Area (“Destination Airport”), to be determined by Sponsors in their sole discretion; accommodations for two (2) nights for Winner and Guest (single room/double occupancy), at a hotel in the New York/New Jersey Metropolitan area (“Hotel”), to be determined by Sponsors in their sole discretion; roundtrip ground transfers between Destination Airport and Hotel; and a meal stipend of fifty dollars ($50) per day each for Winner and Guest. Trip must be taken at a date to be determined by Sponsors in their sole discretion. Prize is subject to certain terms and conditions, as specified by issuer. These Official Rules and the Contest itself are neither a contract nor an application for employment. Prize does not constitute an employment opportunity.\nEstimated Retail Value (“ERV”) of Prize is one thousand and five hundred dollars ($1,500). Actual Retail Value (“ARV”) of Prize may vary. Any difference between ERV and ARV will not be awarded. Sponsors will furnish an Internal Revenue Service Form 1099 to Winner for the ARV of Prize for the year in which Prize was won.\nAll details of Prize will be determined by Sponsors in their sole discretion. Sponsors reserve the right to substitute a similar prize (or prize element) of comparable or greater value. All taxes and other expenses, costs, or fees associated with the acceptance and/or use of Prize are the sole responsibility of Winner. Prize cannot be transferred by Winner or redeemed for cash and is valid only for the items detailed above, with no substitution of Prize by Winner. If Prize is unclaimed within a reasonable time after notification from Sponsors, as determined by Sponsors in their sole discretion, it will be forfeited, and time permitting, an alternate Winner may be selected from the remaining eligible entries at Sponsors’ sole discretion.\nTravel arrangements must be made through Sponsors’ agent, on a carrier of Sponsors’ choice. Certain travel restrictions and black out dates may apply. Sponsors have the right in their sole discretion to substitute ground transportation for air transportation depending on Winner’s place of residence. Winner and Guest must travel together on the same itinerary, including the same departure date, destination and return date, and must have valid travel documents (e.g., valid government issued photo ID and/or passport) prior to departure, and failure to do so will result in forfeiture of Prize. Sponsors will not replace any lost or stolen tickets, travel vouchers or certificates.\nOnce travel commences, no unscheduled stopovers are permitted; if an unscheduled stopover occurs, full fare will be charged from stopover point for the remaining segments, including return, of the trip. Sponsors are not liable for any expenses incurred as a consequence of flight cancellation/delay. Trip may not be combined with any other offer and travel may not qualify for frequent flyer miles. All travel and lodging will be at the risk of Winner and Guest. Winner is solely responsible for all expenses and costs associated with acceptance and/or use of Prize not specifically stated herein as being awarded, including, without limitation any and all taxes and other expenses, costs, or fees associated with the acceptance and/or use of Prize, travel insurance, ground transportation (other than as described above), security and airport fees, taxes, insurance, gasoline, meals, gratuities, and souvenirs. Sponsors shall have the right, but not the obligation, to make any deductions and withholdings that Sponsors deem necessary or desirable under applicable federal, state and local tax laws, rules, regulations, codes or ordinances. Prize cannot be transferred or substituted by Winner or redeemed for cash and is valid only for the items detailed above, with no substitution of Prize by Winner. Sponsors reserve the right to substitute a similar prize (or prize element) of comparable or greater value. If Prize is unclaimed within a reasonable time after notification from Sponsors, as determined by Sponsors in their sole discretion, it will be forfeited, and time permitting, an alternate Winner may be selected from the remaining eligible Entries at Sponsors’ sole discretion.\nRECORDING: Sponsors, in their sole discretion, may choose to record and/or broadcast the Event. If Sponsors, in their sole discretion, elect to incorporate any such audio and/or video recording (the “Recording”) into Dateline, its Website or Page, or other television shows, the taping and/or the Recording will not be considered an employment opportunity, and Winner will not be entitled to compensation or credit thereof. Sponsors will determine the nature of the Recording in their sole discretion. If the Recording is broadcast, such broadcast will be at a time, for a length of time, and on a date determined by Sponsors in their sole discretion. Winner may be required to return completed and signed appearance releases, confidentiality agreements and such other documents as may be required by Sponsors prior to participation in the Event. Failure of First Round Finalists and Entrants to complete and execute these documents in a timely manner, as determined by Sponsors in their sole discretion, may cause Prize to be forfeited. The content of the Recording as, and if, finally exhibited and the number of exhibits and re-airs thereof, if any, will be determined by Sponsors in their sole discretion. Winner will not have a right of review, notice, or approval of the content of the Recording or any exhibition or exploitation thereof. Sponsors have the right, in their sole discretion, to disqualify Winner and remove Winner from Event at any time, if any behavior of Winner is deemed by Sponsors to be disruptive or if it may or does cause damage to person, property, or reputation of Sponsors or if it otherwise violates the policies of Sponsors, or if Winner does not follow the directions of Sponsors at all times.\nCONDITIONS: By entering the Contest, each entrant agrees for entrant and for entrant’s heirs, executors, and administrators (a) to release and hold harmless Contest Entities, Facebook, and their respective officers, directors, and employees (collectively, “Released Parties”) from any liability, illness, injury, death, loss, litigation, or damage that may occur, directly or indirectly, whether caused by negligence or not, from such entrant’s participation in the Contest and/or his/her acceptance, possession, use, or misuse of Prize or any portion thereof (including any travel related thereto); (b) to indemnify Released Parties from any and all liability resulting or arising from the Contest and to hereby acknowledge that Released Parties have neither made nor are in any manner responsible or liable for any warranty, representation, or guarantee, express or implied, in fact or in law, relative to Prize, including express warranties provided exclusively by prize supplier that are sent along with Prize; (c) if selected as a Winner, to the posting of such entrant’s name on www.DatelineNBC.com (the “Website”) and the Page, and the use by Released Parties of such name, voice, image, and/or likeness for publicity, promotional, and advertising purposes in any and all media now or hereafter known, throughout the world in perpetuity, without additional compensation, notification, permission, or approval, and, upon request, to the giving of consent, in writing, to such use; and (d) to be bound by these Official Rules and to waive any right to claim any ambiguity or error therein or in the Contest itself, and to be bound by all decisions of the Sponsors, which are binding and final.Failure to comply with these conditions may result in disqualification from the Contest at Sponsors’ sole discretion.\nADDITIONAL TERMS: Sponsors reserve the right to permanently disqualify from any promotion any person they believe has intentionally violated these Official Rules. Any attempt to deliberately damage the Contest or the operation thereof is unlawful and subject to legal action by Sponsors, who may seek damages to the fullest extent permitted by law. The failure of Sponsors to comply with any provision of these Official Rules due to an act of God, hurricane, war, fire, riot, earthquake, terrorism, act of public enemies, actions of governmental authorities outside of the control of Sponsors (excepting compliance with applicable codes and regulations), or other “force majeure” event will not be considered a breach of these Official Rules. Released Parties assume no responsibility for any injury or damage to entrants’ or to any other person’s computer relating to or resulting from entering or downloading materials or software in connection with the Contest. Released Parties are not responsible for telecommunications, network, electronic, technical, or computer failures of any kind; for inaccurate transcription of entry information; for errors in any promotional or marketing materials or in these Official Rules; for any human or electronic error; or for entries that are stolen, misdirected, garbled, delayed, lost, late, damaged, or returned. Sponsors reserve the right to cancel, modify, or suspend the Contest or any element thereof (including, without limitation, these Official Rules) without notice in any manner and for any reason (including, without limitation, in the event of any unanticipated occurrence that is not fully addressed in these Official Rules). In the event of cancellation, modification, or suspension, Sponsors reserve the right to select Winner in a random drawing from among all eligible, non-suspect entries received prior to the time of the event warranting such cancellation, modification, or suspension. Notice of such cancellation, modification, or suspension will be posted on the Website. Sponsors may prohibit any entrant or potential entrant from participating in the Contest, if such entrant or potential entrant shows a disregard for these Official Rules; acts with an intent to annoy, abuse, threaten, or harass any other entrant, Sponsors, or Sponsors’ agents or representatives; or behaves in any other disruptive manner (as determined by Sponsors in their sole discretion). Sponsors reserve the right to modify these Official Rules for clarification purposes without materially affecting the terms and conditions of the Contest.\nDISPUTES: The Contest is governed by, and will be construed in accordance with, the laws of the State of New York, and the forum and venue for any dispute shall be in New York, New York. If THE controversy or claim is not otherwise resolved through direct discussions or mediation, it shall THEN be resolved by FINAL AND binding arbitration administered by JUDICIAL ARBITRATION AND MEDIATION SERVICES, INC., in accordance with its Streamlined Arbitration Rules and Procedures or subsequent versions thereof (“JAMS Rules”). The JAMS Rules for selection of an arbitrator shall be followed, except that the arbitrator shall be experienced and licensed to practice law in new york. All proceedings brought pursuant to this paragraph will be conducted in the County of new york. THE REMEDY FOR ANY CLAIM SHALL BE LIMITED TO ACTUAL DAMAGES, AND IN NO EVENT SHALL ANY PARTY BE ENTITLED TO RECOVER PUNITIVE, EXEMPLARY, CONSEQUENTIAL, OR INCIDENTAL DAMAGES, INCLUDING ATTORNEY’S FEES OR OTHER SUCH RELATED COSTS OF BRINGING A CLAIM, OR TO RESCIND THIS AGREEMENT OR SEEK INJUNCTIVE OR ANY OTHER EQUITABLE RELIEF.\nWINNER ANNOUNCEMENT: For the name(s) of the Winner(s) , available after __June 1, 2014, visit www.DatelineNBC.com, or send a self-addressed, stamped envelope to be received by June 1, 2015 to: Dateline NBC, 30 Rockefeller Center, New York, NY 10112, Attn: One in a Million Contest.\nThis Contest is in no way sponsored, endorsed or administered by, or associated with Facebook. Entrants are providing information to Sponsors and not to Facebook.","url":"https://www.nbcnews.com/dateline/could-you-be-one-million-n103621"}
