{"authors":[],"date_download":"2018-10-30 01:15:50","date_modify":"2018-10-30 01:15:50","date_publish":"2014-05-06 08:00:00","description":null,"filename":"data/vaneerConsumption/CouldCrimeahavebeenprevented.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/05/rtrlfive997076.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862150.html","title":"Could Crimea have been prevented?","title_page":"Could Crimea have been prevented?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Western Weakness Comes at a Price\nby Jonathan S. Tobin\nThe question of whether anything could have been done to prevent the Russian seizure of Crimea is more than the usual tiresome counter-factual debate that follows any historical event. Ukraine’s dismemberment was a fait accompli the moment Vladimir Putin gave the order to move his troops. But the “what ifs” about the prelude to that order are important—and not just because it is by no means clear how far Putin means to go, either with the rump of Ukraine or with the other nations that were once part of the Tsarist/Soviet empire he seems intent on reassembling. At a time when the United States seems to be undergoing a sea change in opinion about the direction of its foreign policy, with isolationism on the rise, it is worth examining whether American decisions played a role in creating this crisis.\nTo assert a direct and indisputable connection between the situation in Crimea and anything the United States or its European allies have done is difficult. As many of Putin’s apologists point out, Russia has always considered control of Ukraine a strategic priority. The chaos in Kiev and the fall of Moscow’s puppet, ousted president Viktor Yanukovych, was bound to trigger a Russian response. Options to forestall Putin’s invasion—whether by inviting Ukraine into NATO or threatening the use of force to defend Crimea—were never seriously considered.\nYet to admit that the West was powerless to prevent the invasion is not the same thing as to claim that decisions made by the United States played no role in Putin’s thinking. The Obama administration’s appeasement of Putin as he sought to reassert Russian power doubtless helped to convince him he could do as he liked without fear of serious repercussions. From the administration’s abandonment of missile defense in Poland and the Czech Republic, to its farcical attempt to “reset” relations with Russia, to its disastrous retreat on Syria last year, Obama’s weakness has emboldened the Russian leader.\nThe principal argument against this thesis rests on the fact that Putin invaded Georgia in 2008. If George W. Bush couldn’t stop Russia from overrunning a former component of the Soviet Union, why should Obama even try? But this is comparing apples to oranges. In Georgia a shooting war already existed between the Tbilisi government and pro-Russian separatists in a land geographically far removed from the West.\nThe better question to ask is why Putin did not take Crimea sooner. During Ukraine’s Orange Revolution in 2004 and 2005, nationalist protests toppled a pro-Moscow government led by the same Victor Yanukovych whose ouster prompted this year’s invasion. Why did Putin hold fast then? The answer is clear: In 2004, he was still unsure about Russia’s ability to project force beyond its borders and the West’s willingness to countenance such an act. Today he suffers neither of those doubts.\nPresident Obama came into office in 2009 determined to change America’s image. The U.S. would no longer be a unilateral cowboy besotted with its own exceptionalism, but instead a multilateral conciliator. Regardless of the dubious merits of such a stance, one key to its implementation was to warm relations with Russia, which had chilled to new post-Cold War lows after the Georgia conflict. Outwardly, the new policy was made manifest in the snubs to erstwhile allies and Hillary Clinton’s comic photo-op with a “reset” button. Inwardly, the administration made a point of casting Russia in key roles on the world stage. For instance, Obama and Clinton made Putin’s consent the lynchpin to the administration’s lackluster efforts to stop the Iranian nuclear program. The Russians have their own reasons for worrying about a nuclear Iran, but their more equivocal approach to the issue acted as a brake on American diplomacy and sanctions, and empowered Putin in a manner no previous U.S. administration had.\nBut that was nothing compared to the way Russia profited from Obama’s precipitate retreat from his “red line” on the Syrian government’s use of chemical weapons. Bashar al-Assad represents the last vestige of the old Soviet empire’s sphere of influence in the Middle East, and Putin has invested heavily in his survival. Obama’s last-ditch deal to remove the country’s chemical weapons placed the process in Putin’s hands and essentially guaranteed the survival of Assad. The agreement not only signaled a U.S. withdrawal from its obligations in the area but also elevated Putin’s prestige and his sense of invulnerability.\nRussia is no longer a rival superpower, but exactly the kind of dictatorship that is always encouraged by Western weakness. The consequences of an America in retreat will be felt around the world, as rogue regimes in Iran and North Korea have already demonstrated. Halting Russian revanchism will require the sort of strong American commitment to which Obama has shown himself allergic. It will also require us to reject the siren song of neo-isolationists, and recommit to maintaining our influence and defending our allies. Though Obama thought he could back away from troublesome arguments scot-free, Vladimir Putin has just reminded him that weakness always comes at a price.\nThe Problem is Political Incompetence\nby W. James Antle III\nThe Crimean crisis may well have been preventable. But as with so many other problems—metastasizing Islamist terror networks, our looming entitlements crunch, the immigration disaster—the optimal window for resolution was in the 1990s. If Russia had during that time evolved into a real free-market economy, subject to the rule of law and other cultural prerequisites for functional capitalism, rather than a cronyist kleptocracy, the bear might not be so rabid today. Vladimir Putin would still be a thug—he is a KGB man, after all—but perhaps not the president. Nostalgia for the Soviet Union would probably not have taken hold among the populace.\nNotice that this depends more on Russian than Western statesmanship. Diplomatic “resets” and deep, soul-searching gazes from the American president are mostly irrelevant. Here the United States is guilty only of underestimating how difficult it is for totalitarian regimes to develop the conditions for ordered liberty that we (mostly) take for granted, or to recover habits of self-government after they have atrophied from decades under the jackboot.\nThat’s not to say Russia’s self-inflicted wounds haven’t been aggravated by unforced Western errors. Expanding NATO virtually to Moscow’s doorstep always contained three risks: Russians might use the move as a pretext to justify renewed expansionism; it might draw NATO powers into an Eastern bloc war; or, if NATO declined to mobilize troops to defend its new members from Russian aggression, it might expose the alliance as built on largely empty promises (at least as it pertained to the former Soviet republics).\nIf Georgia had joined NATO, for instance, the United States may well have had to fight a nuclear-armed Russia over South Ossetia. Or, more likely, America would have stood by and watched events like the occupation of Gori, despite ostensible treaty obligations to intervene. (Make no mistake: The choice would have been up to the United States, one of only four NATO members to spend at least 2 percent of GDP on defense as of 2013.)\nExpansion also upended an understanding that facilitated the Soviet Union’s relatively peaceful death. Adam Garfinkle asked in National Interest all the way back in 1996: “If it had been proposed to you in 1989 that the Warsaw Pact and the Soviet Union both would come peaceably to an end, that Germany would be reunited in NATO, and that all Russian military forces would withdraw behind their own frontier—and that all that was asked in return was that NATO not take advantage of this retreat by moving eastward—would you have accepted?” This was followed by a dangerous game of tug-of-war between the European Union and Russia over deeply divided Ukraine, culminating in the recent overthrow of a corrupt but democratically elected president. As has proved to be the case after the toppling of much worse despots (think Iraq, Libya, the Arab Spring) the forces this upheaval has unleashed are in many cases anti-Western and illiberal.\nThe problem isn’t American weakness (at least not until entitlements and interest payments on the national debt displace defense spending from the federal budget). Conservatives need to stop reaching for that catch-all explanation for the world’s ills. The problem is our political class’s incompetence. The same people who cannot in 2014 launch a successful website around the president’s signature domestic political achievement cannot be counted on to identify pro-Western forces in countries they know next to nothing about. The same people who routinely fail to anticipate the unintended consequences of their actions at home will be prone to similar blunders abroad.\nIn the run-up to the Iraq war, the libertarian writer Brink Lindsey argued that an activist foreign policy was compatible with support for limited government because there is no “invisible hand”—Adam Smith’s metaphor for self-regulation in the market—in global affairs. Lindsey was only partially correct (as one might expect of a man who supported the Iraq invasion and a tactical alliance between libertarians and liberals). While the invisible hand is missing, the knowledge problem remains.\nBarack Obama has certainly mishandled Russia and Ukraine. Unfortunately, some critics want him to compound those errors by escalating progressively from harmless bloviating to empty threats. “To be honest, if we define our interests narrowly, if we applied a coldhearted calculus, we might decide to look the other way,” the president admitted in Brussels. “Our economy is not deeply integrated with Ukraine’s. Our people and our homeland face no direct threat from the invasion of Crimea. Our own borders are not threatened by Russia’s annexation.” Instead of taking these premises to their logical conclusion—that perhaps the United States shouldn’t involve itself too deeply—Obama predictably labeled such a “coldhearted calculus” as “casual indifference.” But many of his Republican critics suffer from a similar inconsistency, illustrated by the seemingly contradictory impulses of their electoral base.\nA late March Pew Research Center poll found that 45 percent of Republican voters want to “take a firm stand against Russian actions” in Ukraine, while 47 percent prefer to “not get too involved in the situation.” Only 11 percent want to consider a military option. GOP politicians aren’t much different. While a few, like Ted Cruz, have offered specifics, such as reinstating the canceled antiballistic missile station in Eastern Europe, most just made vague noises about strength. Scott Walker, a 2016 presidential possibility, compared the situation to keeping his sons in line at home.\nReduce Europe’s reliance on Russian natural gas. Impose sanctions that truly have multilateral support. Keep Russia isolated among such diplomatic powerhouses as North Korea and Zimbabwe, a far cry from the Warsaw Pact. Be confident in containing a genuinely weak, shrinking country that cannot afford much imperial overreach.\nObama has sought to undo many of Ronald Reagan’s domestic achievements. The right should not be complicit in similarly unwinding his biggest foreign-policy accomplishment: American victory in the Cold War.","url":"https://spectator.org/58699_could-crimea-have-been-prevented/"}
