{"authors":[],"date_download":"2018-10-22 20:52:35","date_modify":"2018-10-22 20:52:35","date_publish":"2014-06-03 13:18:33","description":"It's about if the Senate race plays out like Indiana’s did two years ago -- which resulted in giving Democrats an opening in a contest they had no business winning.","filename":"data/vaneerConsumption/CouldaTeaPartyWininMississippiChangethe2014Math.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483606/senate_mississippi-jpeg-021cb_cbe5031c0b74be16614045c4f87917f2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_could-tea-party-win-mississippi-change-2014-math-n121136_1540241555.html","title":"Could a Tea Party Win in Mississippi Change the 2014 Math?","title_page":"Could a Tea Party Win in Mississippi Change the 2014 Math?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCould Mississippi play out like Indiana did in 2012?\nToday's marquee primary, the Republican Senate race in Mississippi, is the latest skirmish between the GOP establishment and Tea Party. If the Tea Party doesn’t win, it’s very possible they won’t have another big victory the rest of this primary season. But the contest is also about something else: It's about if the Senate race plays out like Indiana’s did two years ago -- which resulted in giving Democrats an opening in a contest they had no business winning. Like in Indiana when Richard Mourdoch took on longtime incumbent Dick Lugar, a Tea Party Republican (Chris McDaniel) is challenging a longtime incumbent (Thad Cochran) in Mississippi. Like in Indiana two years ago, parts of the state establishment aren’t too happy with the Tea Party challenge or the challenger, and they could very well sit on their hands in the fall. Like Mourdoch in Indiana, McDaniel appears to be prone to making a mistake (just look at how he’s handled this blogger arrest story). And just like in Indiana when Democrats had a credible nominee in Rep. Joe Donnelly (D-IN) to take advantage of any opening, Democrats don’t have a bad candidate in former Rep. Travis Childers (D-MS). Now there are some important differences. One, Mourdoch was the runaway primary winner over Lugar in 2012, while McDaniel-vs.-Cochran is incredibly close. And two, Indiana in 2012 took place in a presidential year (read better Dem turnout), while Mississippi 2014 would be in a midterm year (better GOP turnout).\nIf it does, that makes the GOP’s path to a Senate majority more difficult\nBut if Democrats get any kind of opening in Mississippi, here’s why that would be very important in November: A Democratic win there -- as remote as it may seem -- would raise the GOP’s magic number (from six to seven) in the seats it must net in order to win back the Senate. Given the stakes, you are going to see a lot of pressure on the Lotts and Barbours to get on board if McDaniel wins. Then again, it’s very possible Cochran holds on. This is a 50%-50% race, folks.\nThe other June 3 primaries we’re watching\nBeyond Mississippi, seven other states are holding their primaries today -- Alabama, California, Iowa, Montana, New Jersey, New Mexico, and South Dakota. That’s the most of any other primary day this cycle. The other races we’re watching: In Iowa’s Senate GOP primary, front-runner Joni Ernst needs to cross 35% in the crowded field to avoid having the nomination decided by a state convention. NBC’s Alex Moe covered Sen. Marco Rubio (R-FL) stumping for Ernst yesterday. “[Ernst] is an exceptional candidate,” Rubio told the crowd. “Come November, the whole country may be up late watching the returns from Iowa because the choice you make here could very well be the difference between another two years with [Harry Reid as majority leader or a new day for our country.” BTW, it is truly amazing that Ernst is being pushed to victory almost EXCLUSIVELY by outside groups, who have outspent Ernst herself… Welcome to the NEW NORMAL when it comes to financing campaigns. And in California’s gubernatorial primary, we’re watching to see who emerges in the state’s top-two “jungle primary” format -- former Bush administration official Neel Kashkari or Tea Partier Tim Donnelly -- for the (seemingly uphill) chance to take on Gov. Jerry Brown (D) in the fall.\nHonda vs. Khanna in the spotlight\nAs we wrote last week, California also has a ton of great congressional primaries tonight. Bloomberg Businessweek’s Josh Green highlights maybe the best one: Democratic incumbent Mike Honda vs. Dem challenger Ro Khanna in Silicon Valley. “The race is notable for many reasons. Khanna is young (37); Honda is old (73 later this month). Khanna has won the support of a swath of Silicon Valley tech titans; Honda is backed by the traditional liberal interest groups. Khanna has raised boatloads of cash (more than Honda), which is unusual for an intra-party challenger taking on a veteran incumbent. And as I detailed in Businessweek last April, Khanna has used that money to hire much of Barack Obama's tech team in order to deploy at the congressional level the same sophisticated turnout and persuasion techniques used in the 2012 presidential campaign.” But remember, the top two finishers advance to November, so it’s very possible we’re talking about Honda vs. Khanna again in five months.\nNational Journal on the Senate race that got away from Democrats\nA final point on today’s primaries: National Journal spotlights the one race that got away for Democrats: “South Dakota Senate. “The Senate race to succeed retiring Democratic Sen. Tim Johnson could have been one of the most consequential contests in the country, if Democrats had a little more luck. Just over a year ago, the political talk in South Dakota centered on which of their up-and-coming prospects would run—former Rep. Stephanie Herseth Sandlin, one of the most popular figures in the state after representing it for three full terms in the House, or Tim Johnson's son Brendan Johnson, who's serving as a U.S. attorney.” More: “As Senate Majority Leader Harry Reid and the Democratic Senatorial Campaign Committee tried to engineer the situation to their advantage—they preferred Herseth Sandlin to the more-liberal Johnson, and wanted to avoid a contentious primary—the party's worst-case scenario materialized. Johnson first expressed his disinterest in May 2013, leaving the door wide open for the former congresswoman to run. At the same time Johnson made his decision, Weiland announced his candidacy with support from some Johnson allies.” We’ve pointed out how Montana truly put a Senate majority in play for Republicans. But Democrats’ inability to get a top-tier candidate in South Dakota -- especially given the Tom Daschle vs. Harry Reid conflict in the state – didn’t help things.\nIn Poland, Obama defends exchange for Bergdahl\nOutside of today’s primaries, the other story we’re watching is President Obama’s European trip -- he arrived in Poland just hours ago and held a press avail with Polish President Komorowski. And the biggest news was Obama’s statement defending the prisoner exchange for Bowe Bergdahl’s release: Americans don’t leave their soldiers behind. “We still get back an American soldier if he’s held in captivity. Period. Full stop,” Obama said, per the Washington Post. More: “President Barack Obama is urging Congress to support a $1 billion initiative to boost U.S. military activity in Europe, the White House said Tuesday, as the president kicked off a four-day trip to the continent,” NBC News reports. It’s pretty clear today, re: Bergdahl that the Obama admin has decided to change its talking points: it is no longer defending Bergdahl’s service (will Susan Rice come to regret saying Bergdahl served with “honor and distinction” on a Sunday show?)… Obama, Hagel and Dempsey are all about defending the principle of bringing an American soldier home, they are leaving questions about how he disappear for another day. Quite the shift in tone in the last 48 hours.\nHillary also defends Bergdahl exchange, sort of\nSpeaking in Colorado yesterday, per NBC’s Bill Hatfield, Hillary Clinton also defended the prisoner swap for U.S. soldier Bowe Bergdahl, while leaving some distance. “I don't believe in second guessing people who have to make these hard choices. But I would make a couple points,” Clinton said. “First, we do have a tradition -- I ascribe to it -- it's a tradition that's not only embedded in our military but in our country, and that is we try not to leave any of our soldiers on the field… This young man, whatever the circumstances, was an American citizen -- is an American citizen, was serving in our military. And you know, a lot of our closest allies do prisoner exchanges to get our POWs back all the time. Israel did.” Given the statements -- America doesn’t leave its soldiers behind -- Republicans have to be VERY CAREFUL of not overplaying their hands here. Yes, there are so many unanswered questions. And, yes, Bergdahl’s fellow soldiers are now saying critical things. But an entire political party doesn’t want to be AGAINST getting a U.S. soldier out of captivity. That’s a dangerous place. The questions about this exchange are coming up organically but if the GOP is seen has helping to politicize, they could undermine the focus that is deserved right now. It is notable that, according to the New York Times, a conference call with former soldiers talking critically about Bergdahl’s release, was reported as organized by “Republican operatives.”\nPoll: 58% believe Obama covered things up on Benghazi\nSpeaking of overplaying your hand, don’t miss this Washington Post/ABC poll result when it comes to Benghazi, the “number of Americans who think the Obama Administration has covered things up (58 percent) is even larger than the number who want the investigation (51 percent). Americans say 58-32 that Obama has covered things up rather than being honest about what happened.” Folks, this explains why Democrats ultimately decided to cooperate in the Benghazi hearings. They have been pushing this “House GOP is overplaying their hand” but the public doesn’t view it that way.\nWhere have the environmentalist Republicans gone?\nWe (and others) focused yesterday on the Democratic divisions -- blue state vs. red state -- over the announced EPA regulations to lower carbon emissions from power plants. But here’s a different way of looking at the issue: You had the entire Republican Party standing up for coal country, despite the GOP’s struggles on the coasts. After all, we didn’t see a single Republican from Florida, or on the West Coast, or in the Northeast back the EPA regs and the effort to curb greenhouse gasses. And it comes as a new Washington Post/ABC poll finds 70% of Americans saying that the federal government should limit the release of greenhouse gases to reduce global warming. Republicans are doubling down on their strengths (standing up for rural/red-state America), but aren’t shoring up their weaknesses elsewhere (on the coasts, urban areas). Sherwood Boelert, call your office\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/could-tea-party-win-mississippi-change-2014-math-n121136"}
