{"authors":[],"date_download":"2018-10-22 21:47:47","date_modify":"2018-10-22 21:47:47","date_publish":"2014-06-06 16:10:51","description":"Barra won praise for her efforts to be transparent about those problems while pushing for much-needed changes within the carmaker's flawed culture.","filename":"data/vaneerConsumption/CouldGeneralMotorsMaryBarraEmergeWithHerReputationIntact.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/291226/140331-mary-barra-gm-ceo-11a_0633a6d0982d3512552e3c566677ea6b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_could-general-motors-mary-barra-emerge-her-reputation-intact-n124601_1540244867.html","title":"Could General Motors' Mary Barra Emerge With Her Reputation Intact?","title_page":"Could General Motors' Mary Barra Emerge With Her Reputation Intact?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFaulted for a combination of \"incompetency and neglect,\" General Motors took a serious hit as the results of an independent investigation into its handling of a fatal safety defect were released Thursday.\nBut GM CEO Mary Barra won praise for her efforts to be transparent about those problems while pushing for much-needed changes within the carmaker's flawed culture.\nIn a blunt address to 1,200 company workers at GM's Renaissance Center headquarters in Detroit, Barra tried to balance her message to address a variety of different constituencies.\nShe expressed her \"deepest sympathies to the families that lost loved ones and to those who were injured,\" while also presenting a blunt corporate mea culpa, noting that the handling of the ignition switch problem was \"riddled with failures, which led to tragic results.\"\nBut Barra didn't tell her employees that they should all collectively fall on their swords, noted Greg Smith, a consultant with Portland, Maine-based VIA Agency, which has worked with a number of automakers on corporate image problems.\nInstead, she made sure that GM workers came away feeling that they could, and should, do a better job, and that management will stand behind them—even if it means blowing the whistle on managers who took shortcuts on safety.\n\"She exhibited real leadership here, addressing both her internal and external constituents,\" Smith said, calling Barra \"poised and decisive.\"\nTransparency has been a key point for Barra since the crisis began with word of the first ignition switch recall in February. The automaker has since expanded that service action to cover 2.6 million vehicles.\n\"They had to take corrective action\" to prove that her promise to come clean wasn't just meaningless words, said Don Tanner, a reputation specialist with Detroit's Tanner Friedman.\n\"I think [Barra] took an important step today,\" he said.\nThe first woman to serve as CEO of a major automaker, Barra initially won strong praise. But she took a beating during April hearings on Capitol Hill that looked into the ignition switch problem.\nAlthough Thursday's report concluded she didn't know about the problem during her prior job as GM's global product development chief, it's ultimately her responsibility that GM makes real changes, experts said.\n\"We need more than an accounting of past mistakes; we need to ensure accountability and that permanent measures are put in place to prevent future deaths,\" Sen. Ed Markey of Massachusetts said in a statement.\nThursday's report, prepared by former federal prosecutor Anton Valukas, found that GM could have done a far better job of dealing with a defective ignition switch that has been linked to at least 13 deaths. The probe has already led to the dismissal of 15 GM employees—most of them senior managers or executives—while five others have been disciplined.\nMore from The Detroit Bureau:\nFord Puts Fusion Concept on a Diet\nSummer's Here and Teen Drivers Face the \"100 Deadliest Days\"\nAt 650 Horsepower, the new Corvette Z06 is GM's Most Powerful Production Model Ever","url":"https://www.nbcnews.com/storyline/gm-recall/could-general-motors-mary-barra-emerge-her-reputation-intact-n124601"}
