{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:30:58","date_modify":"2018-10-30 18:30:58","date_publish":"2018-06-21 16:31:20","description":"Birmingham council has appointed a controversial Muslim Labour member who has previously claimed that Islamic State does not exist and has dismissed Islamist attacks to a committee tasked with protecting children from radicalisation and terrorism.","filename":"data/vaneerConsumption/CouncillorWhosaidIslamicStateDoesntExistGivenAntiTerrorRole.json","image_url":"https://media.breitbart.com/media/2018/03/Birmingham.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_21__1540924258.html","title":"Councillor Who said Islamic State Doesn't Exist Given Anti-Terror Role","title_page":"Councillor Who said Islamic State Doesn't Exist Given Anti-Terror Role","title_rss":"NULL","source_domain":"breitbart.com","text":"Birmingham council has appointed a controversial Muslim Labour member who has previously claimed that Islamic State does not exist and has dismissed Islamist attacks to a committee tasked with protecting children from radicalisation and terrorism.\nSafia Akhtar Noor was suspended and then forced to resign as a school governor at Yew Tree Community School in Birmingham after several posts on her Facebook questioned if the terror group was an invention after the Westminster Bridge attack.\nOn the day of the attack in March last year, she wrote: “Can people stop fighting on Facebook? Sadly people died in Westminster today but people die every day in Syria, Palestine, Africa, Rohingya, Kashmir. Need I carry on?!! Grow up and stop pointing fingers!”\nFive days later she claimed in another message: “So someone got stabbed after the attack last week as a result of media and government claiming that SO CALLED ISIS HAD CLAIMED RESPONSIBILITY.”\nShe added: “There is no ISIS and there is no proof.”\nDespite this, the law student was able to stand as a Labour candidate in May’s local elections in the Small Heath ward – which has a majority Muslim population – and won with more than 3,000 votes.\nNow, she has been appointed to the Children’s Social Care Overview and Scrutiny Committee of the Labour-controlled council.\nThe body looks over initiatives to prevent radicalisation and extremism and has given guidance on the Prevent strategy, intended to stop people being drawn into terrorism.\nAlex Yip, Conservative councillor for Sutton Wylde Green, questioned her selection to the committee.\nI question the wisdom of this appointment- of the 8 scrutiny committees to appoint Cllr Noor who was suspended as a school governor to the one with oversight over Children Safety @birmingham_live https://t.co/NzUvMc01sc — Cllr. Alex Yip JP (@alexyip258) June 21, 2018\n“It is shocking to think that the Labour administration would appoint Councillor Akhtar, of all the ones available, to this scrutiny committee,” he told Birmingham Live.\n“Although she has apologised for saying they [her social media postings] should have been worded more carefully, they still represent her views.\n“Considering that the school at which she was a governor suspended her, saying her comments breached its code of conduct, it beggars belief that Labour think it appropriate for her to oversee safeguarding of children, including protecting them from the threat of radicalisation.”\nAccording to a study by The Henry Jackson Society from March last year, one in ten convicted UK Islamic terrorists come from the Sparkbrook district of Birmingham, which is ten minutes from Small Heath.\nThe Labour-run Birmingham City council – Europe’s largest local authority – has been consistently accused of turning a blind eye to extremism, including during the ‘Trojan Horse’ scandal, when radical Muslims forced their agenda on state schools.","url":"https://www.breitbart.com/europe/2018/06/21/birmingham-muslim-labour-councillor-islamic-state-anti-terror-role/"}
