{"authors":[],"date_download":"2018-10-30 20:54:18","date_modify":"2018-10-30 20:54:18","date_publish":"2018-07-12 19:12:00","description":"The wedding guest who was shot while waiting for an Uber outside of an Atlanta country club early S...","filename":"data/vaneerConsumption/CountryclubshootingvictimIDdasmanagerofseveralrestaurants.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/07/12/Images/Screen%20Shot%202018-07-12%20at%202.19.44%20PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_country-clu_3d8eb0026e606fefc966911080e5904d__1540932858.html","title":"Country club shooting victim ID’d as manager of several restaurants","title_page":"Country club shooting victim ID’d as manager of several restaurants","title_rss":"NULL","source_domain":"ajc.com","text":"The wedding guest who was shot while waiting for an Uber outside of an Atlanta country club early Sunday manages restaurants in the Washington, D.C., area, ABC affiliate WJLA-TV reported.\nChristian Broder, 34, is the general manager of Millie’s Spring Valley, a well-known California Baja-style restaurant, and several others. He is also the general manager of Georgetown Events and the father of a 9-month-old, according to WJLA.\n34-year-old father Christian Broder, a well-known general manager of many DC restaurants and Georgetown Events is still in critical condition after being robbed and shot in Atlanta Georgia. Police have released a sketch. We have new information coming up at noon on @ABC7News pic.twitter.com/ES6fic5aZ8 — John Gonzalez (@ABC7John) July 12, 2018\nBroder remains at Piedmont Hospital after he was shot in his stomach during the armed robbery outside the Capital City Country Club on West Brookhaven Drive and Capital City Lane.\nA GoFundMe page was set up, with a goal of $50,000, to help support Broder and his family. It had raised more than $37,000 as of Thursday afternoon.\nAccording to the page, Broder is in critical condition in the intensive care unit and has undergone multiple lifesaving operations.\nWJLA reported that Broder’s large intestine was removed during surgery and that he opened his eyes for the first time Wednesday, a positive sign for his recovery.\n“The Georgetown Events family is devastated by the heartless and cowardly act of violence against our beloved friend, partner and colleague, Christian,” Bo Blair, president of Georgetown Events, said in a statement Thursday. “He is the loving father of 9-month-old Frances, the husband of my wife's sister Molly and the son of the wonderful Broder family of Atlanta.\n“He is in critical condition in intensive care fighting so hard to live. The staff at Piedmont Hospital in Atlanta has worked around the clock since Sunday performing one miraculous surgery after another to keep Christian alive. Please pray for him.”\nThe man who shot Broder is still at large. On Wednesday, police released a surveillance video and sketch of a man involved in a separate carjacking they say could be linked to the shooting.\nMORE: Cops say new video, sketch connected to shooting outside wedding reception\nA sketch of the suspect released Wednesday. (Atlanta Police Department)\nPolice say the White Dodge Charger used for the armed robbery and shooting was the same one that was involved in the carjacking.\nMORE: Wedding guest shot while waiting for Uber outside country club, police say\nIn other news:","url":"https://www.ajc.com/news/crime--law/country-club-shooting-victim-manager-several-restaurants-area/0QjDJhLaBvMUfsDym6pgOL/"}
