{"authors":["Press Association"],"date_download":"2018-10-22 23:04:11","date_modify":"2018-10-22 23:04:11","date_publish":"2016-01-28 11:34:21","description":"A council has apologised after pornography was accidentally played at the funeral of a father and baby who died in a car crash. Simon Lewis and Simon Junior ...","filename":"data/vaneerConsumption/Councilapologyafterpornisplayedduringfuneralserviceforfatherandson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-c3566eaf-9bc0-4d17-b606-25bd00fcf5f2-4vVdYopwYQ7f641721b07ac97cd4-604_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420695_Council-apology-porn-played-funeral-service-father-son_1540249451.html","title":"Council apology after porn is played during funeral service for father and son","title_page":"Council apology after porn is played during funeral service for father and son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Council apology after porn is played during funeral service for father and son\nA council has apologised after pornography was accidentally played at the funeral of a father and baby who died in a car crash.\nSimon Lewis and Simon Junior were killed in a head-on collision on Lamby Way in Cardiff on New Year's Eve.\nHundreds of mourners were left shocked after the video was played during the service at Thornhill Crematorium in the city.\nSimon Lewis, who died with his baby son Simon Junior when the car they were in was in collision with a blue Peugeot 307 as it travelled along Lamby Way in Cardiff on New Year's Eve (South Wales Police/PA)\nCardiff Council, which runs the crematorium, has apologised for the incident and said it will be launching an investigation.\nA spokeswoman said: \"There were four television screens used to display visual tributes as part of this funeral service.\n\"The television screen which showed the inappropriate content was recently installed, replacing a screen which was broken.\n\"We are trying to establish if the new screen - which is a smart television - could have accepted or picked up a broadcast by accident via bluetooth or across a wifi network.\n\"The other three screens, which aren't smart TVs, were unaffected.\n\"We are clear that it isn't possible for any member of staff to play or download anything on the computer that links to the screens in the chapel.\n\"The screen has now been completely disconnected until audio visual engineers carry out a thorough investigation.\n\"We would like to take this opportunity to send our sincere apologies to the family and to the mourners at the funeral.\"\nThe fatal crash happened on December 31 when the Lewis family's Daihatsu Sirion collided with a blue Peugeot 307.\nMr Lewis, 33, died at the scene. His pregnant wife, Amanda, and their three-year-old daughter survived - although the couple's child had to be delivered by emergency Caesarean section in hospital.\nHowever, despite the best efforts of doctors, the baby was pronounced dead on January 3.\nSouth Wales Police said Mrs Lewis had been left totally and utterly devastated by both deaths.\nA family tribute issued by the force said: \"Simon was a very popular man who lived for his family. He was a wonderful father and husband who was looking forward to the birth of his son.\n\"He will never be replaced.\"\nA man has since been charged with causing two deaths through dangerous driving, aggravated taking of a vehicle without consent, driving while disqualified, and driving without insurance.\nKyle Kennedy, 29, of Harris Avenue, Rumney, appeared at Cardiff Magistrates' Court earlier this month.\nHe was remanded in custody to appear at Cardiff Crown Court on February 5.\nThe Reverend who led Wednesday's service of Mr Lewis and his son told Wales Online of the moment the offending footage appeared on screen.\nLionel Fanthorpe said: \"I look at my congregations instead of the TV screen, but when I heard this noise and members of the congregation moving towards the screen, I realised something was wrong.\n\"Members of the family were very distressed, and Simon's father-in-law was desperately upset.\n\"This was not what anybody could have ever imagined or wanted.\n\"Thankfully an engineer came to fix it and turn it off. It seems to be some kind of electronic accident.\"\nOne mourner, who did not want to be named, branded the video as \"absolutely disgusting\".\nThey said: \"It was around four or five minutes before they could turn it off. Everyone could not believe what they were seeing.\n\"Simon's family have been through hell and back already without having more distress.\n\"To the rev's credit he handled the situation really well. He said he had never seen such filth and apologised on behalf of the council.\"\nFuneral directors James Summers & Son have called on Cardiff Council to leave no stone unturned in its investigation.\nA statement from the firm said: \"As the crematorium operator, Cardiff City Council facilitated the digital display of the images during the service.","url":"https://www.dailymail.co.uk/wires/pa/article-3420695/Council-apology-porn-played-funeral-service-father-son.html"}
