{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 02:12:29","date_modify":"2018-10-23 02:12:29","date_publish":"2017-03-16 12:37:25","description":"EXCLUSIVE: Laura Peacock, 34, from Manchester, founded a leading support group. She underwent corrective surgery in 2012 after struggling emotionally with the condition.","filename":"data/vaneerConsumption/Countlesswomenleftsuicidalbybreastdeformity.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E540D7400000578-0-image-a-24_1489667521050.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4316180_Countless-women-left-suicidal-breast-deformity_1540260749.html","title":"Countless women left suicidal by breast deformity","title_page":"Countless women left suicidal by breast deformity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of women are being left suicidal due to a common breast condition, experts warn.\nTuberous breasts are an abnormality where the chest fails to develop normally and glands often stop growing at the 'bud stage'.\nThere are no precise numbers on how many suffer with the disorder, but a leading support group estimates it to be in the thousands.\nAnd, worryingly, many of them turn to surgeons who wrongly treat them with traditional, but unsuitable, implants - leaving them dissatisfied and depressed.\nNow, a former sufferer and her cosmetic surgeon have joined forces and spoken exclusively to the MailOnline to raise awareness of the issue.\nFounder: Following her experience, Laura Peacock was compelled to form a support group\nLaura Peacock, 34, founded Support for Women with Congenital Breast Deformity in 2012 and it now has hundreds of members.\nThe mother-of-two, from Horwich, Greater Manchester, underwent corrective surgery in 2012, having struggled with tuberous breasts since she was 13 years old.\nPrior to that, the condition was so bad that while trying to breastfeed her son, she left him in hospital with severe dehydration.\nToday, through the help of Dr Navid Jallali, she's demanding better education and understanding of the condition.\nSpecifically, because it's often incorrectly perceived as cosmetic, according to the consultant cosmetic and reconstructive surgeon.\nDr Jallali, who has appeared on Channel 5’s Botched Bodies, told MailOnline: 'Tuberous breast deformity (TBD) is a massive issue in the UK, affecting a great many women.\n'But because of a lack of research, and a chronic lack of awareness among some doctors, it’s my view that it’s not being tackled properly. And that’s causing patients to suffer in silence.\n'It’s not just a case of someone having small breasts and wanting a larger volume cup size. With TBD, the shape is often very uneven between the breasts.\nBefore the surgery: Like many women, Laura's breasts were narrower at the base than usual\nArrested development: Her breasts also had a high crease, causing them to look elongated\n'For most patients it’s unsightly at best, and a source of extreme anguish at worst.'\nDr Jallali, who has a clinic on London's Harley Street, added: 'I’ve seen many patients who arrive at the clinic painfully shy, lacking in confidence and withdrawn.\nWHAT ARE TUBULAR BREASTS? Tuberous breasts (also known as tubular or constricted breasts) are an abnormality in the breast shape. This condition is genetic and is characterised by a tightened, narrow base to your breast and a high crease, causing the breasts to look elongated. They are often characterised by: Elongated breast shape\nBase of the breast is narrower than usual\nHigh inframammary crease – the fold underneath the breast\nHerniation – areola has become a little wider and more domed\nAsymmetry – one breast is more tubular than the other Source : Aurora Clinics\n'These are the women who’ve struggled to form relationships because of their breasts.\n'In rare circumstances, patients have also related their suicidal thoughts to me. To me, this is unacceptable and more needs to be done to combat TBD head-on.'\nDr Jallali, one of the UK’s most accomplished breast cancer reconstruction surgeons, treats around 40 women suffering with TBD every year.\nThe surgery is not, however, straightforward.\n'There’s a lot we don’t know about TBD. While it’s considered a congenital disease, passed down through the genes, it had been assumed TBD was caused by a lack of progesterone' he explains.\n'But for me that doesn’t ring true either. If it was, you’d expect to see both breasts similarly affected, not just one as is often the case.\n'Coupled with this lack of understanding is the fact that corrective surgery is very difficult.\n'Some surgeons don’t really like taking the procedure on as it’s quite complex. And what you’re left with is a great demand for TBD surgery but not an extremely limited supply of willing surgeons. Many women don’t know where to turn.'\nCorrected: The skin needed to be stretched by a surgical balloon implant which expanded\nBigger: Once there was a large enough pocket of skin, an implant could be inserted\n'The NHS is notoriously strict when it comes to 'boob jobs', but free surgery to correct TBD can sometimes be available where it’s not rationed by the Clinical Commissioning Group.'\nDr Jallali said: 'The key feature of a patient with TBD is that patients lack skin, particularly on the lower half of the breast. That makes it incredibly difficult to insert an implant.\nIn rare circumstances, patients have also related their suicidal thoughts to me. To me, this is unacceptable and more needs to be done to combat the deformity head-on Dr Navid Jallali, a cosmetic surgeon\n'What needs to be done instead is that a small balloon, called an expander, is inserted into the breast in the initial operation.\n'Every couple of weeks the balloon is slowly expanded to stretch the skin, with some patients needing up to ten expansions. It’s not a painful process, and the good part is that a patient can really be in control of how large they’d like their breast to be.\n'Then, once there’s a large enough pocket of skin, an implant can be inserted. From my perspective, the results are often overwhelming - with truly life changing outcomes.\n'Patients write to say, \"I’ve worn a bikini for the first time in 20 years\", or \"I’ve got my first ever boyfriend\". Their confidence goes through the roof.'\nFor more information visit www.navidjallali.com\nFor confidential support call the Samaritans in the UK on 08457 90 90 90, visit a local Samaritans branch or click here for details.","url":"https://www.dailymail.co.uk/health/article-4316180/Countless-women-left-suicidal-breast-deformity.html"}
