{"authors":["Associated Press"],"date_download":"2018-10-23 02:42:40","date_modify":"2018-10-23 02:42:40","date_publish":"2016-01-28 17:44:10","description":"PHILADELPHIA (AP) — A Philadelphia city councilman is hearing boos for a proposal that would seemingly give police the authority to approve which bands, rapp...","filename":"data/vaneerConsumption/CouncilmansparksoutcrywithmusicianDJregistryproposal.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421274_Councilman-sparks-outcry-musician-DJ-registry-proposal_1540262560.html","title":"Councilman sparks outcry with musician, DJ registry proposal","title_page":"Councilman sparks outcry with musician, DJ registry proposal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Councilman sparks outcry with musician, DJ registry proposal\nPHILADELPHIA (AP) — A Philadelphia city councilman is hearing boos for a proposal that would seemingly give police the authority to approve which bands, rappers and DJs can perform in certain venues.\nThe bill proposed by Councilman Mark Squilla last week would require restaurants, nightclubs and bars accommodating 50 people or more to collect contact information for all performers. They would be required to give the information to police, if asked. Police would then decide whether they get a license to perform.\nThe proposal unleashed an outcry by musicians and fans on social media.\nThe Districts, a rock band from central Pennsylvania, tweeted a link to a Change.org petition against the bill, saying, \"This bill must be stopped! Please read, sign and keep #PhillyMusic alive and well!\"\nIn a statement on his Facebook page, Squilla said the bill is being misinterpreted and isn't intended to restrict artistic expression but to address public safety issues by closing a loophole that has allowed venues to operate without a license.\n\"We learned that some operators were able to avoid obtaining (a license) because there was no live music or a DJ but music was streaming or playing from an iPod or iPad,\" he said. \"This bill now includes such amplified recorded music.\"\nThe Philadelphia Police Department's legal adviser told the Philadelphia Inquirer on Thursday that the provision giving police final approval on licenses was \"a mistake\" and the department doesn't want that role.\n\"Don't think the Philadelphia police department wants anything to do with approving acts. We don't want to be involved in this. People have First Amendment rights,\" Capt. Francis Healy said. \"We never asked for it.\"\nHealy said the current system — where the Department of Licenses and Inspections consults the Police Department on licensing — works well.\nSquilla said he would consider changes \"as suggested by concerned parties.\"\nIn September, there was a fatal shooting in his district a few doors down from the Theatre of Living Arts as fans were arriving for a rap show featuring Lil Durk. However, Squilla has said the bill is not in response to any particular incident.","url":"https://www.dailymail.co.uk/wires/ap/article-3421274/Councilman-sparks-outcry-musician-DJ-registry-proposal.html"}
