{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 01:19:55","date_modify":"2018-10-23 01:19:55","date_publish":"2016-01-29 15:05:03","description":"Country singer Katie Armiger has filed a lawsuit against her record label claiming she was told to 'sex it up' and 'hug, kiss and flirt' with radio programmers in order to be successful.","filename":"data/vaneerConsumption/CountrysingerKatieArmigersuesherlabelclaimingshewastoldtosexitup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B30C3400000578-0-image-a-33_1454079762597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422832_Country-singer-Katie-Armiger-sues-label-claiming-told-sex-up_1540257595.html","title":"Country singer Katie Armiger sues her label claiming she was told to 'sex it up'","title_page":"Country singer Katie Armiger sues her label claiming she was told to 'sex it up' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Country singer Katie Armiger has filed a lawsuit against her record label claiming she was told to 'sex it up' and 'hug, kiss and flirt' with radio programmers in order to be successful.\nLast June, the 24-year-old singer's label, Cold River Records, issued a statement on her behalf saying she was taking a breather from music to 'decide her next career aspirations', Fox411 Country reported.\nBut she denied this claim and said she did not have any plans to quit country music before filing the suit.\nCountry singer Katie Armiger (pictured December 2014) has filed a lawsuit against her record label claiming she was told to 'sex it up' and 'hug, kiss and flirt' with radio programmers in order to be successful\nLast June, the 24-year-old singer's label, Cold River Records, issued a statement on her behalf saying she was taking a breather from music to 'decide her next career aspirations'. However, she denied this claim (Armiger pictured above in June 2014)\nAt the time she wrote in response on Instagram saying she had been locked out of her Twitter and Facebook accounts, noting those were not her words and that she would make an official announcement soon, according to Country Weekly.\n'I never quit country music. I haven't spoken because I wasn't able to,' she told Country Weekly as she comes forward with the suit.\n'My label filed a suit against me, but I kept hoping for an amicable solution.\n'Now, everyone can see my response. The answer I filed with the federal court speaks for itself.'\nAccording to court filings, the country artist claimed she was asked to 'purchase \"hot\", \"game-changing\" clothes' and that the label's President Pete O'Heeron 'repeatedly' told her that she 'needed to make radio program directors \"wish you could take them home with you\".'\n'O'Heeron told Ms Armiger that if \"they don't wanna take you home, they're not gonna play your music. Period\",' the suit claims.\nThe label's president Pete O'Heeron (right) has responded saying he is 'saddened and disappointed' to learn of Armiger's statements against the label which he dismissed as 'malicious and completely false'\nHowever, O'Heeron has since released a statement saying he is 'saddened and disappointed' to learn of Armiger's statements against the label which he dismissed as 'malicious and completely false', according to Country Weekly.\nHe said that the timing of her claims have surfaced after the label was 'forced' to sue her for 'refusing to perform the remainder of her contracts', and claims she is using the claims to 'get out of her contracts and gain publicity for her career'.\nO'Heeron also told Fox411 Country that 'it speaks for itself the fact that Katie claims we were asking her to \"sex it up\", yet two months later she is campaigning to be country music's hottest bachelorette'.\nIn her official statement, Armiger explained that the label had expectations for how she should act to get ahead and that she 'just wasn't willing to take that approach', according to Country Weekly.\n'I've worked hard and I'm proud of what I've done musically and personally,' she said.\nSince coming forward with the suit, the Texan has said that it took a lot of bravery to do so\nOn Twitter, she wrote thanking everyone for their patience and support and said she is 'excited to get back out there soon to do what I love!'\n'My label had expectations for how I should behave to get ahead - particularly how I should interact with influential men in the industry.\n'I just wasn't willing to take that approach. I wanted to make it with integrity and I still do.\n'I know that there are good people in this business and particularly in country radio, and I'm so grateful to those who support my career and play my music.'\nSince coming forward with the suit, the Texan has said that it took a lot of bravery to do so, but that it is important for women in music.\n'There are so many challenges for women in music,' she told Fox411 Country. 'I think that this keeps the conversation open and give women that are in my position a needed voice.'\nArmiger is from Houston, Texas and at age 14 was the grand-prize winner of Houston's Best Country Singer competition, according to Billboard.\nShe has charted five singles on Billboard's Hot Country Songs as well as her album Fall Into Me, her highest charting album to date which peaked at No.32 on Billboard's Top 200 Albums in 2013.","url":"https://www.dailymail.co.uk/news/article-3422832/Country-singer-Katie-Armiger-sues-label-claiming-told-sex-up.html"}
