{"authors":["Harvey Day For Mailonline"],"date_download":"2018-10-23 03:30:55","date_modify":"2018-10-23 03:30:55","date_publish":"2017-03-10 13:05:59","description":"Stacey Bresnen and her boyfriend Lee Stammers had just climbed the famous 199 steps up to the Church of Saint Mary in Whitby, North Yorkshire, when they snapped the spooky silhouettes.","filename":"data/vaneerConsumption/CoupleclaimtheysawghostofamanandhisdoginWhitby.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22DD0800000578-0-image-a-12_1489150009384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301016_Couple-claim-spotted-ghost-man-dog_1540265455.html","title":"Couple claim they saw ghost of a man and his dog in Whitby","title_page":"Couple claim they saw ghost of a man and his dog in Whitby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple out for a romantic nighttime stroll on church grounds were spooked when they spotted what they believe could be the ghost of an old man and his dog in the church that inspired Bram Stoker's Dracula.\nStacey Bresnen and her boyfriend Lee Stammers had just climbed the famous 199 steps up to the Church of Saint Mary in Whitby, North Yorkshire, when they snapped the spooky silhouettes.\nThe pair had been hunting for the graves of two people who were born and died on the same day when Ms Bresnen, 37, said she was blown away by the striking shape of an old man sat down to the right of some steps.\nA couple out for a romantic nighttime stroll on church grounds were spooked when they spotted what they believe could be the ghost of an old man and his dog\nAnd when she looked at it further, she spotted a dog sitting to his right beneath the frame of a church door.\nThe mother-of-six, from Seaham, Durham, said: 'We'd just been for a pint but I wasn't that drunk that I was seeing things.\n'I'm forever taking pictures and usually they're of nothing much but straight away I turned to Lee and said \"Look at that man there\".\n'It's quite atmospheric up around the church. It's right beside Whitby Abbey and there's a big graveyard and a big tradition of Goths in the town.\nStacey Bresnen (right) and her boyfriend Lee Stammers (left) had just climbed the famous 199 steps up to the Church of Saint Mary in Whitby, North Yorkshire\nTHE SPOOKY CHURCH THAT INSPIRED DRACULA... As Bram Stoker sat at his desk overlooking the seaside town of Whitby Bay in 1890 he noticed the huge number of bats flying around St Mary's Church. Perched on top of a cliff St Mary's, with its rows upon rows of tombstones, looked out onto the stormy North Sea. It was the atmospheric surroundings of Whitby and St Mary's Church which would inspire him to write the classic Gothic novel Dracula published in 1897. As Bram Stoker sat at his desk overlooking the seaside town of Whitby Bay in 1890 he noticed the huge number of bats flying around St Mary's Church (pictured) The writer happened to be staying in the town trying to decide whether it would be suitable for a family holiday. However, it became the perfect backdrop for his book. He wrote: 'For a moment or two I could see nothing, as the shadow of a cloud obscured St. Mary's Church. 'Then as the cloud passed I could see the ruins of the Abbey coming into view; and as the edge of a narrow band of light as sharp as a sword-cut moved along, the church and churchyard became gradually visible... 'It seemed to me as though something dark stood behind the seat where the white figure shone, and bent over it. What it was, whether man or beast, I could not tell.' Christopher Lee in the 1958 horror film Dracula which was inspired by Stoker's novel Stoker's Dracula is shipwrecked off the Yorkshire coast. He comes ashore in the guise of a black dog and wreaks havoc on the town. Prince Vlad the Impaler, from Transylvania and known for his bloodthirsty reputation, is thought to have been the inspiration for Stoker's character Dracula. One of the characters, Mina, keeps a journal containing detailed descriptions of Whitby and those areas frequented by Dracula.\n'We come here quite a bit, with and without the kids, and we love to walk around but I've never been spooked like this.\n'It was one of those moments where you're glad someone else is there to see it with you so you know you're not going mad.'\nShe added: 'It's not often you see something like this before you take a picture - normally you notice the little weird things afterwards.\n'But with this one I knew it was something special. Lee was a bit freaked out by it.\nMs Bresnen took the eerie picture on February 24 on a getaway with her partner without the kids\n'Straight away he said \"Can you not see the dog?\". I'm very into things like this and I really believe it could be the ghost of an old man who used to walk his dog around Whitby.'\nMs Bresnen took the eerie picture on February 24 on a getaway with her partner without the kids.\nShe said: 'I must have thousands of pictures on my phone but nothing as incredible as this.\nShe said: 'I must have thousands of pictures on my phone but nothing as incredible as this'\n'You can see his arms, his jacket, his face, his eyes. I was speechless. The same with the dog - very vivid eyes and ears.\n'Whitby is the sort of place where you wonder about these sort of happenings. Lee thinks I'm a bit of a spook but there's definitely something there.\n'I wish I'd taken more pictures now because it was really freaky. The light comes across from this old flash light and it's really moody.\n'Next time we're back I'll be checking if he's still there.'","url":"https://www.dailymail.co.uk/news/article-4301016/Couple-claim-spotted-ghost-man-dog.html"}
