{"authors":["Jo Tweedy For Mailonline"],"date_download":"2018-10-23 01:01:28","date_modify":"2018-10-23 01:01:28","date_publish":"2016-01-11 11:30:32","description":"When Lee Turnock, 29, and wife Anne, 28, from Werrington were forced to run during the Tunisia terror attacks in 2015, they were grateful they'd lost weight before the break - and have now lost more.","filename":"data/vaneerConsumption/CouplewhofledTunisianterrorgunmanbyrunningupfiveflightsofstairssaytheirpreholidaydietsavedtheirlivesandtheyhavenowlostninestonebetweenthem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007D63B00000578-0-image-a-39_1452511431065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393694_Couple-fled-Tunisian-terror-gunman-running-five-flights-stairs-say-pre-holiday-diet-saved-lives-lost-nine-stone-them_1540256488.html","title":"Couple who fled Tunisian terror gunman by running up five flights of stairs say their pre-holiday diet saved their lives - and they have now lost nine stone between them","title_page":"Couple who fled Tunisian terror gunman by running up five flights of stairs say their pre-holiday diet saved their lives - and they have now lost nine stone between them  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple forced to run for their lives during the Tunisian terror attacks have spoken out about how the traumatic incident propelled them to lose even more weight after they realised the importance of fitness.\nLee and Anne Turnock, from Werrington in Staffordshire, escaped with their lives after they fled the ISIS terrorist who killed 38 people in the Tunisian resort of Port El Kantaoui in June last year - but say they were only able to reach safety because they had shed weight before their holiday.\nLee, 29, and Anne, 28, were both clinically obese before they started dieting in May 2015 but managed to shed two stone each before their holiday to Tunisia.\nMotivation: Lee and Anne Turnock, from Werrington in Staffordshire, say that being fit enough to flee Tunisian gunman Rezgui Yacoubi, who killed 38 people in June 2015, has seen them maintain a healthy lifestyle\nBefore the weight loss, Lee, 29, weighed in at almost 19st and needed an XXL t shirt while Anne, 28, wore size 24 clothes\nParamedic Anne, 28, tipped the scales at 19st 4lb, and struggled to squeeze into a size 24 dress - while husband Lee weighed almost 19st and needed an XXL t shirt. They decided to battle the bulge together and signed up for the Cambridge Weight Plan.\nAfter being forced to escape gunman Rezgui Yacoubi, who went on a killing spree that claimed the lives of 30 Britons, they realised that their weight loss had saved them by enabling them to run away more quickly.\nAfter shedding an extra five stone between them, Lee has now launched a new career as a consultant for the weight loss firm.\nLee, 29, said: 'It was an absolutely horrific experience and not one I'd want to repeat. I have never been so scared in my life.\n'There's no doubt that if we'd both been packing the extra pounds we would have struggled to run as fast as we did. We were only a few metres from the beach where the terrorist was shooting.\n'I'd never run up five flights of stairs before and I didn't even know I could.'\nNow, the pair have lost nine stone between them and say that thinking back to running up those flights of stairs is all the motivation they need to stay fit\nWhat Anne and Lee ate before their began their diet in May 2015 BREAKFAST: Nothing LUNCH: Four rounds of sandwiches, chocolate bar, packet of crisps, can of fizzy pop SNACK: Flapjack and more fizzy pop DINNER: Takeaway or lasagne with four rounds of bread and butter, plus pudding every night. What the Turnock's eat now: BREAKFAST: Shredded wheat LUNCH: Light salad and piece of fruit DINNER: Fish, jacket potato and vegetables\n'When we came back, it was almost easy to say that we were going to just enjoy every moment and scrap the diet - but then we realised that we might not have been here if we hadn't lost the weight.\n'Any time I felt like giving in, I just thought back to running up those stairs and knew I should stick at it.'\nThe couple had both tried and failed to lose weight and keep it off before - but it was only when Anne went for a TV makeover and had to give her dress size that she realised she needed to do something about her weight.\n'I was in denial and had put my dress size down as 18', she said, 'but nothing would fit and the production crew had to go out and buy me clothes in a size 24. It was so humiliating.'\nBoth Anne and Lee had managed to shed almost two stone in the first two months on the Cambridge Weight Plan - and were looking forward to a holiday abroad feeling trimmer.\nAnne said: 'It was only the third day of our holiday and I wanted to go and sunbathe on the beach, but Lee had a blister on his foot and didn't want to get sand in it, so we stayed by the pool.\n'I'd been reading my kindle and had just leant down to put it away when I head banging. I didn't really think anything of it at first, I thought it was fireworks. but it kept coming.\n'I turned round and saw a woman behind me dive under her deckchair, and saw people running from the beach. Lee just looked at me, grabbed my hand, and said: 'run'.\n'I didn't even know I could run, but we just went as fast as we could into the nearest building, a hotel. We were trying to help other people too, who were old or infirm, but it was just complete chaos.\n'We ran up to the first floor, but the corridor at the top of the stairs was a dead end.\n'We ran up four more flights of stairs, and then someone in a room pulled us in - they were a British family and there were about 10 of us hiding in the room.\nFateful holiday: Anne and Lee were caught up in the Tunisian terror attacks that saw ISIS gunman Rezgui Yacoubi target a beach resort and hotel where the couple were staying\nThe couple say that without being lighter on the their feet, thanks to their pre-holiday weight loss, they may not have been able to run from their attacker...within hours of the terrorist's killing spree, they were on a flight back to the UK\nLee now works as a diet adviser for the slimming club and says his weight-loss is kept on track by the memory of running for his life\nChanged outlook: Anne and Lee describe the incident as terrifying and say they'll never look at life in the same way again\n'We barricaded ourselves in and tried to get information about what was happening from our relatives back home.\n'After a couple of hours, we were told it was safe to come out, and we were put back on a plane home within hours.'\nLee added: 'When I realised the bangs we could hear were gunfire, I thought it was a gangfight amongst locals that had got out of hand.\n'It was only after we'd climbed the first flight of stairs that I looked out of the window and saw this man with a gun, shooting tourists around the pool area. I was terrified, but I just had to get Anne and get us both to safety.\n'One of the men who were were hiding in the room had been separated from his family, and we found out later that he sadly lost his dad in the attacks. It was just awful.'\nWhen they arrived back home, they both continued to follow the diet plan - and 6ft 3in Lee has become a Cambridge consultant after hitting his target weight of 14st.\nAnne has also slimmed to 15st, and a size 14 - and when she reaches her own target weight, she also hopes to become a consultant and inspire other people to lose weight with her story.","url":"https://www.dailymail.co.uk/femail/article-3393694/Couple-fled-Tunisian-terror-gunman-running-five-flights-stairs-say-pre-holiday-diet-saved-lives-lost-nine-stone-them.html"}
