{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 00:16:15","date_modify":"2018-10-23 00:16:15","date_publish":"2017-03-16 09:24:06","description":"Trevor and Ann Heley, from Fixby, West Yorkshire, bought the 4x4 vehicle less than two years ago from a dealership but claim it has driven them round the bend after a series of issues.","filename":"data/vaneerConsumption/CoupleputwarningposterontroublesomeRangeRover.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E530DB300000578-0-image-a-9_1489656160222.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319276_Couple-warning-poster-troublesome-Range-Rover_1540253775.html","title":"Couple put warning poster on troublesome Range Rover","title_page":"Couple put warning poster on troublesome Range Rover | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A retired couple who forked out £44,400 on a Range Rover have buyer's remorse so acutely they have slapped posters on it warning other motorists from buying one.\nTrevor and Ann Heley, from Fixby, West Yorkshire, bought the 4x4 vehicle less than two years ago from a dealership but claim it has driven them round the bend after a series of issues.\nA sticker on the car reads: 'Range Rover Evoque - this is the worst car purchase I have ever made. Be warned!'\nTrevor and Ann Heley have put a poster on their Range Rover Evoque after encountering a series of problems with it\nThe pair bought their car brand new from Huddersfield-based Rocar Moores Land Rover, which was taken over by Rybrook Group four months later.\nProblems with the vehicle allegedly included the ECO system not working, the tailgate rattling and the brake disks and pads needing to be replaced.\nAfter what the couple claim was limited help from the companies involved, they say their 'only alternative' was to put warning signs on it.\n'It hasn't come easy to attach the signs. We feel embarrassed about admitting we own a vehicle that we are so dissatisfied with,' Mr Heley said.\nThe sticker on the car reads: 'Range Rover Evoque - this is the worst car purchase I have ever made. Be warned!'\nMr Heley, a retired engineer, and Ann, a retired nurse, also claim that the rear camera is useless in rain or damp conditions, the surround camera system is ineffective in the dark and the operation of the electric handbrake is impractical.\nHe said: 'There have been numerous previous problems with the vehicle and with the dealership not complying with Jaguar Land Rover protocols or following their own working instructions.\n'Unfortunately, we cannot come to an amicable agreement with Jaguar Land Rover or their dealer. We have lost all faith with the Evoque and Jaguar Land Rover.\n'Jaguar Land Rovers' attitude is that they want us to just grin and bear owning a vehicle that, we feel, is not of satisfactory quality, is not fit for purpose nor is as described.'\nThe couple, from Fixby, West Yorkshire, say they will put the car up for sale on eBay at a 'reasonable' price\nThe couple say they will list the car for sale on eBay for a 'reasonable' price.\nA Jaguar Land Rover spokeswoman said: 'At this stage the case with Mr and Mrs Heley is currently active. Our executive team have been working for some time to draw this to a satisfactory close.\n'Until the case is closed we cannot comment any further, however we are working hard to resolve this.'","url":"https://www.dailymail.co.uk/news/article-4319276/Couple-warning-poster-troublesome-Range-Rover.html"}
