{"authors":["Australian Associated Press"],"date_download":"2018-10-23 00:09:56","date_modify":"2018-10-23 00:09:56","date_publish":"2017-04-26 09:22:10","description":"A woman allegedly kept by a Melbourne couple as a slave for eight years can give her evidence against them via video recording because she is still vulnerable two years on.","filename":"data/vaneerConsumption/Coupleaccusedofkeepingwomanasaslaveforeightyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DE36000000578-0-image-a-14_1493197668612.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446578_Couple-accused-keeping-woman-slave-eight-years_1540253396.html","title":"Couple accused of keeping woman as a slave for eight years","title_page":"Couple accused of keeping woman as a slave for eight years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman allegedly kept by a Melbourne couple as a slave for eight years can give her evidence against them via video recording because she is still vulnerable two years on.\nKumuthini Kannan and Kandasamy Kannan, of Mount Waverley, have each been charged with possessing a slave between July 2007 and July 2015, and one count of exercising ownership over a slave.\nThey have denied the allegations.\nA couple will face a trial at Melbourne Magistrates' Court after being accused of enslaving a woman for eight years\nProsecutors have told Melbourne Magistrates' Court the complainant - who allegedly was scalded with hot water during the ordeal - is vulnerable and physically unwell.\nThey requested she be spared from appearing at the five-day committal hearing to give evidence, an application Magistrate Jacinta Dwyer granted.\n'This is a case clearly where the complainant is a vulnerable adult,' crown prosecutor Krista Breckweg said.\n'She remains physically unwell.'\nThe defence opposed the application and raised a number of issues, including the manner in which police questioned the alleged victim, arguing it was prejudicial.\nThe committal hearing had been due to occur in May but has been held off until December while the defence sorts out funding issues.","url":"https://www.dailymail.co.uk/news/article-4446578/Couple-accused-keeping-woman-slave-eight-years.html"}
