{"authors":[],"date_download":"2018-10-30 21:39:16","date_modify":"2018-10-30 21:39:16","date_publish":"2018-10-29 15:18:22","description":"The Michigan photographer searching for the couple he captured in a breathtaking moment at Yosemite...","filename":"data/vaneerConsumption/CouplefeaturedinviralproposalphotoatYosemitefound.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/29/Images/lovers-1259124_1280-U74526660673kGM-680x383.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_couple-featured-viral-proposal-photo-yosemite-found__1540935556.html","title":"Couple featured in viral proposal photo at Yosemite found","title_page":"Couple featured in viral proposal photo at Yosemite found","title_rss":"NULL","source_domain":"ajc.com","text":"The Michigan photographer searching for the couple he captured in a breathtaking moment at Yosemite National Park has found them, WOOD-TV reported.\n>> Read more trending news\nOn Oct. 17, Matthew Dippel posted a dramatic photo of a man proposing to his girlfriend at Taft Point and asked for help in identifying them. He had posted on Facebook, Twitter and Instagram.\nThe couple came forward, and they are Charlie Vo and fiancee Melissa, who live in Alhambra, California, WOOD reported.\n“I found them,” Dippel wrote on Facebook. “In short, I captured the second proposal, the more special and official one in Charlie’s words.”\n>> Photographer seeks couple captured in marriage proposal shot\nDippel took the photograph on Oct. 6 while hiking with a friend at Yosemite.\nIn a FaceTime call Saturday night, Vo told 24 Hours News 8 that he and his fiancee originally got engaged in February.\nBut Vo said he wanted a more dramatic setting, so he planned a second proposal as they hiked on Taft Point.\nVo said he saw an article about Dippel’s photo from a news station in Los Angeles. After a Google search, they saw the story was all over the internet, WOOD reported.\n\"I was in shock, really. I just told him (Dippel), 'I can't believe you took that picture of us and it turned out great,'\" Vo told the television station. \"I was just shocked to find him like that and that he took such a great photo of us.\"\n\"I'm glad I finally found you to share this special moment with you,\" Dippel wrote on Facebook.","url":"https://www.ajc.com/news/couple-featured-viral-proposal-photo-yosemite-found/9xU9MVuqzrtusJGXe09P1K/"}
