{"authors":[],"date_download":"2018-10-30 22:21:12","date_modify":"2018-10-30 22:21:12","date_publish":"2018-08-30 20:07:00","description":"No electricity or running water didn’t stop Charlie Lefort and John Peter Casey from purchasin...","filename":"data/vaneerConsumption/CoupletransformsuninhabitablebungalowintoVirginiaH.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/30/Images/090218%20hf%20private_-14.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_home_bungalow-blends-past-with-present__1540938072.html","title":"Couple transforms ‘uninhabitable’ bungalow into Virginia-H","title_page":"Couple transforms ‘uninhabitable’ bungalow into Virginia-H","title_rss":"NULL","source_domain":"ajc.com","text":"No electricity or running water didn’t stop Charlie Lefort and John Peter Casey from purchasing a bungalow in Atlanta’s Virginia-Highland neighborhood. But those problems and others, like the kitchen ceiling falling in, kept them from moving in immediately.\n“It was uninhabitable. Everything had to be replaced,” Lefort said.\nBut they saw positives throughout the home, from its oversized rooms to original fireplaces, windows and heart pine floors. The home, which also now has an addition on the back, will be featured on the neighborhood’s home tour later this year.\n“It was untouched. Nobody had done a poor renovation that we would have to undo,” Lefort said. “It was in its original state.”\nSnapshot\nResidents: Charlie Lefort and John Peter Casey. Lefort works for Shareable Forms, a healthcare information technology company, and Casey owns Pea Ridge Kitchen & Bar, a restaurant in Decatur.\nLocation: Atlanta’s Virginia-Highland neighborhood. The Virginia-Highland Tour of Homes is scheduled for Dec. 1-2.\nSize: 3,600 square feet, four bedrooms, three-and-a-half baths\nYear built/bought: 1910/2005\nArchitectural style: Classic bungalow\nFavorite architectural elements: Original windows, hardware and heart pine floors, heavy crown molding\nArchitect: Pritchett + Dixon\nDesign consultants: Renaissance Tile & Bath; cabinets by Phil Plunkett\nRenovations: They started a down-to-the-studs renovation in 2005, before moving into the home. Ten years later, they expanded the back with a two-story addition. “There was an unused attic with a 15-foot pitch that we were able to put three bedrooms and two-and-a-half baths in without leaving the footprint of the house,” Lefort said. In 2016, a backyard update was completed.\n“Everything doesn’t have to be done at the same time. We did the first floor first. Then we got in it and then we did the second floor. Then we did the backyard,” Lefort said. “We didn’t try to do it all, which I think a lot of people do because they want instant gratification and perfect and complete, but we like to sort of phase it out. It gives us something to focus on, and I think you get better results when you have time and patience — and money.”\nInterior design style: Traditional with contemporary elements\nFavorite interior design elements: 18th-century English furnishings, including chests and a kitchen prep table that serves as a coffee table.\nFavorite outdoor elements: Deck with a fireplace and L-shaped porch, which covers the front and side of the home. They also added copper gutters. “We feel like that really spoke to the integrity of when the house was built,” Lefort said.\nResources: Furniture from Stanton Home Furnishings and Bungalow Classic.\nTip: “The No. 1 thing would be to get an architect. It’s worth the money,” Lefort said. “To try to do it yourself without the assistance of an architect, really, you’d wind up probably spending more money.”","url":"https://www.ajc.com/lifestyles/home/bungalow-blends-past-with-present/HLjskIbpz6I9vjcZnegIGJ/"}
