{"authors":[],"date_download":"2018-10-22 22:55:46","date_modify":"2018-10-22 22:55:46","date_publish":"2014-05-12 19:25:56","description":"Ken and Beth Melton say car company settled their suit while covering up evidence of ignition problems.","filename":"data/vaneerConsumption/CoupleAccusesGMofLyingRefilesSuitOverDaughtersCrashDeath.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/250021/140313-brooke-melton-1045a_e3e8ffa4d3c026460969915d52f0e265.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_couple-accuses-gm-lying-refiles-suit-over-daughter-s-crash-n103481_1540248946.html","title":"Couple Accuses GM of Lying, Refiles Suit Over Daughter's Crash Death","title_page":"Couple Accuses GM of Lying, Refiles Suit Over Daughter's Crash Death","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Georgia couple whose daughter died in a 2010 car crash has refiled a lawsuit against General Motors, alleging that when they settled with the car company in 2013 it concealed critical evidence about ignition problems in Chevy Cobalts, and that a key GM witness committed perjury.\n“The Meltons would not have settled their case if they had known of the perjury and concealment of critical evidence,” said the Melton’s lawyer, Lance Cooper, who has also asked the court to sanction GM. “It is now apparent that GM’s plan was to resolve the Meltons’ claims before disclosing the Cobalt ignition switch design changes.”\nRead the original NBCNews.com story about the Meltons' lawsuit.\nKen and Beth Melton said they had thought “long and hard” before refiling their claim. “Ultimately,“ they said in a statement, “we decided that GM should not be allowed to get away with what they did in the previous lawsuit.”\n\"We decided that GM should not be allowed to get away with what they did\"\nThe Melton’s daughter Brooke died on her 29th birthday when her 2005 Cobalt lost power on a rain-slicked highway and she slid into an on-coming car.\nBrooke Melton died on her 29th birthday. Courtesy Melton family\nFour days before the accident, according to the Meltons, Brooke’s car had shut off while she was driving and she had lost her power steering and her brakes. She was able to pull her car over and restart it. She called her father, and he said they should take it to a dealership in the morning.\nBrooke got her car back from the dealership on March 9, 2010. Her fatal accident was the next day.\nWhen the Meltons filed suit, experts contacted by Cooper examined the “black box” from the accident and found that the key had slipped from the “on” to the “accessory” position three seconds before the accident, shutting off her power steering and power brakes. Brooke’s car had then hydroplaned on the wet highway and been struck by another car.\nThis February, the car company recalled the model that Brooke bought, along with other Chevrolets, Pontiacs and Saturns from model years 2003 to 2007. The car company now says the cars are prone to shutting off when the ignition is jostled.\nDuring depositions for their suit last summer, however, the Meltons learned from GM engineers that the company had been aware of potential problems with its ignition systems before Brooke purchased her car in 2005.\nEngineers were aware that if the key was jostled or stressed by a dangling keychain it might slip and turn the car off. They proposed that GM keys be altered to make the opening for the key ring smaller.\nInstead of changing the keys, however, GM designed an insert that could be added to the keys. It then sent a bulletin to dealerships that said the insert could be provided to car owners who complained about ignition shut-offs. GM only provided inserts for 474 vehicles, according to GM warranty records.\nThe Meltons also learned that the car company had made another significant change with even less fanfare.\nThe detent plunger and spring are two metal parts that fit together inside a car’s ignition column. When a car key has been turned to the “on” position, they hold the key in place.\nWhen an engineer working for the Meltons’ attorney began buying ignition columns from Cobalts, he found that between 2006 and 2007, GM had made both the detent plunger and its attached spring bigger.\nThe combined difference in size was only about 1.6 millimeters, or less than the thickness of a quarter, but the engineer, Mark Hood of McSwain Engineering, told NBC News that the change meant the plunger and spring would exert more force and make the key harder to move accidentally. “The longer plunger and the longer spring is more likely to stay in the run position,” said Hood.\nHood also discovered that GM had apparently made the change to the plunger and switch without changing the part number.\nDuring a depositions in the Melton case on April 29, 2013, a GM design engineer responsible for the Cobalt ignition switch said he didn’t recall ever authorizing such a change.\n“So if such a change was made, it was made without your knowledge and authorization?” asked the Meltons’ attorney.\n“That is correct,” answered the engineer, Ray DeGiorgio.\nIn a June 2013 court filing, GM backed up DeGiorgio’s version of events:\n“As design release engineer Ray DeGiorgio testified, GM LLC did not request and was not asked to authorize of approve a change in the cap and spring in the ignition switch.”\nOn Feb. 7, 2014 GM informed the National Highway Traffic Safety Administration that it was recalling certain Cobalts and other vehicles. On Feb. 24, GM told NHTSA that it was expanding the recall. “GM, for the first time,” wrote the Meltons in their refiled complaint, “also acknowledged that detent changes were made to the ignition switches.”\nA document released by GM to NHTSA also showed what appeared to be DeGiorgio’s signature approving the change. According to the new complaint, “Mr. DeGiorgio’s signature is on this page as the GM authorized engineer who signed off on this change to the ignition switch.”\nThe Meltons had reached a settlement with GM in September 2013. After the recall, according to Cooper, they asked GM to reopen the suit, and the car company refused.\nIn a press release Monday, Cooper said that in declining to reopen the suit, GM attorney Robert Ellis, had denied “fraudulently conceal[ing] relevant and critical facts” and denied engaging in “any improper behavior.”\nFollow NBC News Investigations on Twitter and Facebook.\n“The response by GM validates our decision,” said Ken and Beth Melton. “We are hopeful that this new lawsuit will uncover who at GM knew about the design change and why Brooke was never told.”\nIn a statement to NBC News regarding the refiling, GM said, “Our response to the demand letter through counsel stands on its own,” and then repeated its denial that it had engaged in any improper behavior or fraudulently concealed any facts.\nRay DeGiorgio could not be reached for comment.","url":"https://www.nbcnews.com/storyline/gm-recall/couple-accuses-gm-lying-refiles-suit-over-daughter-s-crash-n103481"}
