{"authors":[],"date_download":"2018-10-22 23:10:17","date_modify":"2018-10-22 23:10:17","date_publish":"2014-07-07 00:00:00","description":"Jews have made mahia, a spirit made with fermented figs, in Morocco for centuries, but the tradition has all but died out. A New York couple aims to reintroduce the drink that once connected a nation.","filename":"data/vaneerConsumption/CoupleRevivesLostMoroccanFigLiquorOneBottleAtATime.json","image_url":"https://media.npr.org/assets/img/2014/07/07/mahia_bottles_wide-9500648a76e79866428f2f8913237ea1bf2d36bf.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=329529687_1540249817.html","title":"Couple Revives Lost Moroccan Fig Liquor, One Bottle At A Time","title_page":"Couple Revives Lost Moroccan Fig Liquor, One Bottle At A Time : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nFor centuries, Jews in Morocco distilled a clear liquor made from figs or dates. It was called mahia. The practice of making mahia had all but disappeared. And then a Moroccan Jew living in New York decided to revive his family's distilling practice. Alex Schmidt has this story about one couple's efforts to make a viable new business out of an ancient tradition.\nDORIT NAHMIAS: Is it the fourth one? I'm not sure. Did you taste it?\nALEX SCHMIDT, BYLINE: It's the middle of the workday and David and Dorit Nahmias are busy in their tiny distillery. In the entryway are Moroccan rugs, photos of David's parents and an old-fashioned copper still. This is the sort of contraption David's family used to distill in Morocco.\nDAVID NAHMIAS: I grew up, you know, people constantly coming to our home and asking for mahia - everyone, the Jews, the Muslims, everyone, including the cops. (Laughing). So mahia - it was part of the tradition. Living with people, you know, Jews and Muslims live together.\nSCHMIDT: David had wanted to start a professional mahia distillery for as long as he'd known his wife. But they both had stable jobs in the banking industry and she wouldn't hear of it.\nDORIT NAHMIAS: Why would you give all that up to start a business? It was like - it was stupid. It was ridiculous.\nSCHMIDT: But then a few years ago, David's parents passed away at the same time Dorit lost her job.\nDORIT NAHMIAS: When you don't have that security anymore, you have to take a chance.\nSCHMIDT: Now, the equipment is more professional than home-brewing back in Morocco - shiny, cylindrical, industrial-sized stills. But most people have no idea what mahia is. The Nahmiases are trying every marketing tricks they can to gain a foothold. A major one - alcohol tasting events like Manhattan's Whiskey Jewbilee. Attendees paid over $100 bucks a pop to come here and sample fine whiskey and other liquors. The Nahmiases also distill whiskey, which gives them an entry-point into markets that might otherwise be closed to them. The crowds stream in and David starts pitching.\nDAVID NAHMIAS: Hundred percent from figs. There is no sugar - no sugar, no chemicals, nothing. And it's very natural.\nSCHMIDT: Dean Schuckman takes a sip of the clear liquor.\nDEAN SCHUCKMAN: This is excellent. It's smooth. I can taste a little bit of the fig. It's delicious.\nSCHMIDT: Score one point for mahia. But then Dana Siegel takes a sip and she just doesn't get it.\nDANA SIEGEL: I thought it was interesting. I kind of wanted to understand a little bit more - what type of spirit it is. If it's a flavored vodka, that's one thing. If it's a liqueur, it's another. I couldn't quite figure it out. But the fig flavor came through and I really liked that a lot.\nSCHMIDT: Technically, mahia is an eau de vie, which just means it's a clear fruit brandy. Schnapps is eau de vie and so is aquavit. Mahia joins a band of unfamiliar alcohols trying to gain a market in the U.S. There's cachaca from Brazil, pisco from Chile. Derek Brown writes about alcohol and owns several bars. He says sometimes unknown spirits do become popular.\nDEREK BROWN: It might be hard to imagine at this point, but vodka was once a weirdo spirit in the United States. There was some advertising campaign around it - a very famous one in the 1960s. And they had very famous people like Woody Allen, you know, toasting to Smirnoff. And today it is the most widely sold spirit.\nSCHMIDT: The Nahmiases have gotten some cutting-edge mixologists to incorporate mahia into cocktails on their menus. Step-by-step, they hope they'll build this ancient family tradition into a business they can pass on to their kids. For NPR News, I'm Alex Schmidt in New York.\n(SOUNDBITE OF INSTRUMENTAL MUSIC)\nSIEGEL: This is ALL THINGS CONSIDERED from NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=329529687"}
 was once a weirdo spirit in the U.S.,\" says Derek Brown, who writes about cocktails and owns several bars in Washington, D.C. \"There was an ad campaign around it, a very famous one in the 1960s, and they had famous people like Woody Allen toasting Smirnoff. And today, it is the most widely sold spirit in the United States.\" It also helped that vodka was a key ingredient in three popular cocktails of the day: the bloody mary, the Moscow mule and the dirty martini.\nThe Nahmiases have succeeded in getting some cutting-edge mixologists to incorporate mahia into cocktails on their menus in Los Angeles and Providence, R.I., and they're pushing for more all the time. The couple have no plans to give up on their mahia revival quest anytime soon. They've put all they have into it.\n\"It's too late to turn around and go back. No way,\" Dorit Nahmias says. \"We gotta make it work. We have no choice.\"","url":"https://www.npr.org/sections/thesalt/2014/07/07/329529687/couple-revives-lost-moroccan-fig-liquor-one-bottle-at-a-time"}
