{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:38:25","date_modify":"2018-10-31 01:38:25","date_publish":"2018-08-28 15:30:42","description":"Another Bachelor: Winter Games couple is calling it quits, and their split is sure to leave more than a few fans heartbroken. As E! News reported, Courtney and Lily from Bachelor: Winter Games broke up. And you're definitely going to want to have…","filename":"data/vaneerConsumption/CourtneyLilyFromBachelorWinterGamesSplitButTheirStatementsAreSuperEndearing.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/2e041174-b77d-47df-93b5-a365f86d3873-148769_5964.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_courtney-lily-from-bachelor-winter-games-split-but-their-statements-are-super-endearing-10301546_1540949905.html","title":"Courtney & Lily From 'Bachelor: Winter Games' Split, But Their Statements Are Super Endearing","title_page":"Courtney & Lily From 'Bachelor: Winter Games' Split, But Their Statements Are Super Endearing","title_rss":"NULL","source_domain":"bustle.com","text":"Another Bachelor: Winter Games couple is calling it quits, and their split is sure to leave more than a few fans heartbroken. As E! News reported, Courtney and Lily from Bachelor: Winter Games broke up. And you're definitely going to want to have some tissues at the ready before you read their sweet and mature statements. But don't worry, there's also plenty of humor thrown in to make you smile through any tears.\nBoth Courtney Dober and Lily McManus took to Instagram to share the sad news with their fans. Based on their messages, it doesn't seem as though there's any bad blood with this split. Lily started off her own post with the kindest of words for Courtney, whom she called a \"bloody good man.\" \"It makes my eyes leak a little bit but myself and Court have decided to split on mutual terms. I love Court with every ounce of my being,\" the reality star wrote in a post published on Aug. 27.\nLily, who got her start on The Bachelor New Zealand, continued to write, \"You guys watched us fall in love and it was honestly just as magical as it looked in real life.\" In case you weren't already tearing up, her post also included a video of her now ex-boyfriend writing on a chalkboard \"Lily & Courtney Were Here\" surrounded by a heart.\nCourtney posted a similarly kind note, alongside a clip of the couple doing a \"shooey\" on Bachelor: Winter Games, about the breakup on Instagram. \"We're best friends and its become clear to both of us that the emotional side of our relationship doesn't allow us to be the best versions of ourselves,\" he wrote.\nThe reality star, who previously appeared as a contestant on The Bachelorette Australia, wrote that the clip he included perfectly encapsulated the pair's relationship with his \"humor, our vulnerability, your witty replies.\" He also said that the TV moment marks when he believes their relationship began, which gives a whole new meaning to the already emotional post.\nFor fans of the couple, who were by far the best duo on Winter Games, by the way, this news will definitely be a bit heartbreaking. They were one of the strongest couples on the show and provided some of the cutest moments on the series during its run. In fact, they were going so strong that they recently celebrated a big milestone in their relationship.\nThey celebrated their six-month anniversary together in mid-June as they both noted on Instagram. In Courtney's post, he wrote that Lily, who he affectionately referred to as his \"crusty crab woman,\" is the \"weirdest person he's ever met and he thanked her for making him \"feel relatively normal.\" His now ex-girlfriend also had a little fun with her tribute, which she wrote to her \"selfie queen.\"\nWhether they were appearing on Winter Games or showing off their relationship in one of their RV road trip updates, it really seemed like Courtney and Lily had a bond that rivaled the strongest Bachelor Nation couples. Adorably enough, it sounds as though that bond will continue even after their split.","url":"https://www.bustle.com/p/courtney-lily-from-bachelor-winter-games-split-but-their-statements-are-super-endearing-10301546"}
