{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:54","date_modify":"2018-10-23 05:01:54","date_publish":"2016-01-29 20:48:29","description":"INDIANAPOLIS (AP) — Indiana is not liable to pay damages incurred by a company that provided stage rigging that collapsed and killed seven people during the ...","filename":"data/vaneerConsumption/CourtrulesforIndianainstatefairstagecollapsecase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422896_Court-rules-Indiana-state-fair-stage-collapse-case_1540270914.html","title":"Court rules for Indiana in state fair stage collapse case","title_page":"Court rules for Indiana in state fair stage collapse case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Court rules for Indiana in state fair stage collapse case\nINDIANAPOLIS (AP) — Indiana is not liable to pay damages incurred by a company that provided stage rigging that collapsed and killed seven people during the 2011 state fair, the state's high court has unanimously ruled.\nMid-America Sound Corp. had argued that a voucher claim form the State Fair Commission signed months after the August 2011 collapse included an \"indemnification\" provision that released it from any claims arising from the use of its equipment. But the high court ruled Thursday that the invoice form's language \"did not clearly and unequivocally provide for retroactive application\" of that provision for any claims arising from the deadly rigging collapse.\nChief Justice Loretta Rush also wrote that the \"need for explicit language is especially important when an agreement involves retroactive indemnity.\"\nThursday's ruling vacates a 2015 state appeals court ruling that had overturned a trial judge's finding that Mid-America Sound could not shift its liabilities to the state.\nSeven people were killed and nearly 100 were injured when high winds toppled rigging and sent the roof of the stage onto fans awaiting the start of a concert by the country duo Sugarland at the fairgrounds in Indianapolis.\nIndiana has paid out $11 million to victims of the collapse, including $5 million under the state's liability cap and $6 million in public funds freed up by the General Assembly.\nThe amount of damages Mid-America Sound faces in lawsuits filed following that disaster remains under court seal.\nRobert MacGill, the company's lead attorney in the case, declined to comment Friday on the court's ruling.\nIndiana Attorney General Greg Zoeller said in a statement that he's relieved the court ruled against Mid-America Sound's effort to \"shift its legal responsibility for the State Fair tragedy onto the taxpayers.\"\nIndiana's attorneys argued during September's hearing in front of the high court that the State Fair Commission is a state entity that cannot be required to pay the liability faced by a private company and that doing so would violate state law.\nIndiana Solicitor General Thomas Fisher also told the justices the indemnification provision in Mid-America's invoice claim form was \"a gotcha claim.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3422896/Court-rules-Indiana-state-fair-stage-collapse-case.html"}
