{"authors":[],"date_download":"2018-10-22 21:13:09","date_modify":"2018-10-22 21:13:09","date_publish":"2014-05-06 13:24:49","description":"The Supreme Court's decision to let stand a Nebraska city's law banning renting to undocumented immigrants could open door to similar laws elsewhere.","filename":"data/vaneerConsumption/CourtDecisionCouldLeadToMoreImmigrantRules.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/422921/20140506-nebraska-rent-immigrants-sl-0928_dd0a2463d8846d259cf4b9504691cb01.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_court-decision-could-lead-more-immigrant-rules-n98076_1540242789.html","title":"Court Decision Could Lead To More Immigrant Rules","title_page":"Court Decision Could Lead To More Immigrant Rules ","title_rss":"NULL","source_domain":"nbcnews.com","text":"The U.S. Supreme Court's decision not to review Fremont, Nebraska's ordinance that bans renting homes to undocumented immigrants could open the door to similar laws elsewhere, say supporters like Kansas U.S. Attorney Kris Kobach, who defended the law, though they are likely to encounter legal challenges.\nKobach said Monday's decision was a victory that gives a \"bright green light\" for other cities within the 8th Circuit U.S. Court of Appeals that want to adopt such laws. The circuit includes Arkansas, Iowa, Minnesota, Missouri, Nebraska, and the Dakotas.\nThe Fremont ordinance requires renters to get a $5 permit and swear that they have legal permission to live in the United States. First approved in 2010, the ordinance has survived several legal challenges and an attempt to repeal it at the ballot box in February.\nBut Thomas Saenz, president and general counsel for the Mexican American Legal Defense Fund, said Fremont could still face challenges to its ordinance. The ACLU of Nebraska said it will keep close tabs on the city and will consider a new lawsuit if tenants report discrimination. The federal appeals panel that upheld the ordinance in June left an opening for future lawsuits if people can show the rules have resulted in discrimination.\n--The Associated Press","url":"https://www.nbcnews.com/news/latino/court-decision-could-lead-more-immigrant-rules-n98076"}
