{"authors":[],"date_download":"2018-10-30 14:32:47","date_modify":"2018-10-30 14:32:47","date_publish":"2015-06-20 00:00:00","description":null,"filename":"data/vaneerConsumption/CourtdoctorscangiveabortionsviaSkype.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06__court_doctors_can_give_abortions_via_skype_comments_1540909967.html","title":"Court: doctors can give abortions via Skype","title_page":"Blog: Court: doctors can give abortions via Skype","title_rss":"NULL","source_domain":"americanthinker.com","text":"There are a lot of limitations on what we can do, like eating food with trans fats or drinking soda in large cups, but the government places these limitations benevolently because its concerned for our health. That's why we can't pick insurance plans with only the health coverage we want anymore. But when it comes to abortions, anything goes. If you want your baby's brain suctioned, drilled, fried, or scrambled, there's a veritable IHOP menu of ways to end your pregnancy. In light of this, an Iowa court has decided that doctors can administer some abortions via video conferencing. Iowa's Supreme Court ruled Friday that Planned Parenthood of the Heartland may keep using its controversial telemedicine-abortion system. More than 7,200 Iowa women have used the system to obtain abortion-inducing pills since 2008. The system, the first of its kind in the nation, allows Planned Parenthood doctors in Des Moines or Iowa City to interact via video... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/06/_court_doctors_can_give_abortions_via_skype_comments.html"}
y Iowa's anti-abortion governor, ruled in 2013 that the system should effectively be banned because of purported safety concerns. The ban was put on hold while Planned Parenthood appealed in court. A district judge sided with the regulators in 2014, but the Supreme Court disagreed Friday. The court also noted that other staff members in the outlying Planned Parenthood clinics draw blood, take medical histories and perform sonograms on the patients, which are transmitted to the physicians. A \"staff member\"? What is that, a nurse? Someone with medical training? A receptionist? A janitor? I think if the court is going to rule this way, it should go all the way. Women shouldn't have to go to clinics at all. All they need is a laptop with a webcam. They can go online and examine themselves while the doctor watches, as people do in those live video shows on the internet. There's no need for a doctor to actually examine a patient before administering a dangerous drug, right? At least, there's no need where abortion is concerned! In fact, maybe video conferencing isn't even necessary. Maybe a woman could sign up for an abortion via Twitter, and then the doctor, in 140 characters or less, will conduct is examination. Alternatively, perhaps a woman seeking an abortion could merely \"friend\" or \"like\" an abortionist's page on Facebook, and that would be sufficient to get the abortion drug. Because when it comes to abortion, the government says anything goes. This article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/06/_court_doctors_can_give_abortions_via_skype.html"}
