{"authors":["John Binder"],"date_download":"2018-10-30 21:24:47","date_modify":"2018-10-30 21:24:47","date_publish":"2018-06-22 00:31:41","description":"The federal government has been separating border crossing families since before 2001 and throughout the Bush and Obama administrations, court records reveal.","filename":"data/vaneerConsumption/CourtRecordsFedsHaveSeparatedIllegalAlienFamiliesSinceBefore2001.json","image_url":"https://media.breitbart.com/media/2018/06/Brownsville4-1-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_21__1540934687.html","title":"Court Records: Feds Have Separated Illegal Alien Families Since Before 2001","title_page":"Court Records: Feds Have Separated Illegal Alien Families Since Before 2001 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The federal government has been separating border crossing families since before 2001 and throughout the Bush and Obama administrations, court records reveal.\nIn a 2016 opinion by the Ninth Circuit Court of Appeals, the court confirmed that since before 2001, illegal alien adults have oftentimes been separated from the minor children with whom they arrived at the border.\n“Families who were detained had to be housed separately, splitting up parents and children,” the opinion stated, citing records from 2007.\nFor weeks, the establishment media, Democrats, and the GOP establishment have falsely claimed that President Trump’s “zero tolerance” policy at the border — where all border crossers are criminally prosecuted — has spurred, for the first time ever, a result in which border crossing families are separated.\nIn 2014, Breitbart Texas broke the story of how child border crossers were being crammed into detention centers and facilities by the Obama administration, revealing a number of exclusive Breitbart News photos that went unmentioned by the establishment media.\nLikewise, Breitbart News has exposed how child border crossers were detained without their illegal alien guardians under the Obama administration. The total number of border crossing children who were separated from the adults they arrived with at the border by the Obama administration is unknown, as the Department of Homeland Security (DHS) did not track those records at the time.\n\"A series of rare photos taken from inside detention facilities where mostly Central American minors were held in detention by Obama in 2014 reveals that detention of border crossers has largely remained the same under Trump as it was previously.\" https://t.co/kxYbm330b5 — John Binder 👽 (@JxhnBinder) June 18, 2018\nAbout 1,400 American children are separated from their incarcerated parents for every one child border crosser who is separated from the illegal alien adult with whom they arrived at the border, Breitbart News reported.","url":"https://www.breitbart.com/politics/2018/06/21/court-records-feds-have-separated-illegal-alien-families-since-before-2001/"}
