{"authors":["William Lee Adams For Mailonline"],"date_download":"2018-10-23 03:19:00","date_modify":"2018-10-23 03:19:00","date_publish":"2016-01-29 18:08:34","description":"On Thursday evening the 51-year-old rocker played to her reputation as a musical firebrand by slipping into a fiery red blouse skirt with bow collar for a sushi date at Matsuhisa Restaurant","filename":"data/vaneerConsumption/CourtneyLovesizzlesinredshirtdressduringdatewithmalefriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2847800000578-0-image-a-16_1454076839048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422771_Courtney-Love-sizzles-red-blouse-dress-sushi-dinner-date-male-pal-without-new-boyfriend-Nicholas-Jarecki_1540264740.html","title":"Courtney Love sizzles in red shirt dress during date with male friend","title_page":"Courtney Love sizzles in red shirt dress during  date with male friend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently showed off her new beau Nicholas Jarecki at Adam Sandler's holiday party.\nBut on Thursday evening, rocker Courtney Love, 51, stepped out with another male companion for a sushi dinner date at Matsuhisa Restaurant in Beverly Hills.\nPlaying to her reputation as a musical firebrand, she wore a fiery red blouse-style dress with long sleeves and a bow collar.\nScroll down for video\nDinner date: On Thursday evening rocker Courtney Love dined at Matsuhisa Restaurant in Beverly Hills with a male friend. She wore a fiery red blouse dress with bow collar\nThe dress stopped well north of her knees, showing off her slim pins and a tattooed chain of green four-leaf clovers around her left ankle.\nCourtney rose to fame on the punk music scene by breaking as many rules as possible, but fashion-wise she kept it mainstream on Thursday.\nShe draped a Burberry trench coat over her left arm and a beige handbag with a quilted pattern and a gold chain over her right shoulder.\nNice pins: Courtney's dress stopped far above her knees, showing off her slender legs and a tattooed chain of green four-leaf clovers around her left ankle\nHealth-conscious Courtney could have enjoyed a baby spinach salad with white fish and fresh salmon sashimi at the famed Japanese restaurant, which is run by celebrity chef Nobu Matsuhisa.\nAnd while she is clearly fond of her dinner date, the Hole singer only has eyes for 36-year-old director Nicholas Jarecki - the son of wealthy commodities trader Henry Jarecki.\nCourtney began dating Nicholas, who directed the 2012 film Arbitrage, around four months ago, after mutual friends introduced them last autumn.\nRear view: Courtney completed her red look with red heels with matching soles\nAccessorized: She draped a Burberry trench coat over her left arm and wore beige handbag with a quilted pattern and gold chain over her right shoulder\nEarlier this week a source told the MailOnline that this is no passing fancy: 'They're very serious about each other.'\nThe couple seem to share a love of health and fitness.\nOn Sunday they slipped into their gym kit and enjoyed a jog through the Los Feliz neighbourhood in Los Angeles .\nYou can't miss her! Courtney Love rocked a rather eye-catching outfit as she went for a jog with a male pal in Los Feliz, Los Angeles on Sunday","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422771/Courtney-Love-sizzles-red-blouse-dress-sushi-dinner-date-male-pal-without-new-boyfriend-Nicholas-Jarecki.html"}
