{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:59:29","date_modify":"2018-10-30 17:59:29","date_publish":"2015-05-17 17:36:26","description":"A court denied parole to Saudi national Homaidan al-Turki, 45, after he refused to attend a sex offender course. He is currently serving an eight years-to-life sentence after a court convicted him of keeping his maid as a sex slave. |","filename":"data/vaneerConsumption/CourtDeniesParoletoSaudiForRefusingtoAttendSexOffenderCourses.json","image_url":"https://media.breitbart.com/media/2015/05/homaidan-al-turki-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_17__1540922369.html","title":"Court Denies Parole to Saudi For Refusing to Attend Sex Offender Courses","title_page":"Court Denies Parole to Saudi For Refusing to Attend Sex Offender Courses | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A court denied parole to Saudi national Homaidan al-Turki, 45, after he refused to attend a sex offender course. He is currently serving an eight years-to-life sentence after a court convicted him of keeping his maid as a sex slave.\nThe sentence required him to attend these classes. He told the state “his Muslim beliefs do not allow him to look at pictures of scantily-clad women.” His lawyers also stated the program “would require [him] to look at photos that included women in bathing suits or undergarments.” But the spokesperson for the Colorado Department of Corrections insists the program does not include the photos, but involves “open discussion and admission of his offenses, which al-Turki has always denied.”\nAl-Turki lived in America after he received an academic scholarship. He resided in Colorado with his wife and five children. Authorities arrested the wife and maid in 2004 due to their visas. That is when the maid said “she had been forced to work 12 hour days with no break and then locked in a cellar and abused regularly by the Saudi.” The trial also revealed the FBI was investigating him due to possible terrorist links. He received a 28 years-to-life sentence, but a judge reduced his sentence to eight years-to-life for good behavior in 2011.\nIn 2012, he pleaded with the US to send him back to Saudi Arabia to finish his sentence, but an FBI agent stopped then-prison chief Tom Clements from granting the request. The FBI claimed they were investigating al-Turki and there is no guarantee the Saudi government would not release him as soon as he stepped on their soil, but did not reveal more information. Clements wrote in his letter he refused the transfer due to al-Turki’s refusal to attend the sex offender classes. Clements was shot to death nine days after he refused al-Turki. Authorities immediately suspected the Saudi in his death, but ballistics pointed to a man in a Texas police chase. However, al-Turki is still suspected of involvement.\nHe was also accused of putting a hit on fellow inmate only known as Martin. Authorities moved al-Turki to federal custody for security reasons.","url":"https://www.breitbart.com/national-security/2015/05/17/court-denies-parole-to-saudi-for-refusing-to-attend-sex-offender-courses/"}
