{"authors":["Candace Sutton For Daily Mail Australia"],"date_download":"2018-10-22 21:07:32","date_modify":"2018-10-22 21:07:32","date_publish":"2016-01-11 00:17:50","description":"The NSW town of Cowra 300km west of Sydney is still haunted by the night a 'frenzied maniac' hacked two women to death, but 29 years later police are offering a $200,000 reward.","filename":"data/vaneerConsumption/Cowrapoliceofferrewardinmurdermysteryoftwoyoungwomen29yearsago.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/23/3000E4E500000578-0-image-a-26_1452470037289.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393110_Police-offer-reward-murder-mystery-two-young-women-bludgeoned-death-29-years-ago-frenzied-maniac-case-haunts-country-town_1540242452.html","title":"Cowra police offer reward in murder mystery of two young women 29 years ago","title_page":"Cowra police offer reward in murder mystery of two young women 29 years ago | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was a double murder of such brutality and merciless violence that it still haunts the country town where the two innocent young women died.\nNow police are offering a $200,000 reward for information leading to the arrest and conviction of the man who savagely bludgeoned Catherine Holmes and Georgina Watmore with a sharp, heavy weapon in the early hours of April 15, 1987.\nThe two women were workmates at the Edgell Cannery in the historic town of Cowra, 300km west of Sydney.\nAccording to a local newspaper, Cowra Community News, the 'night of infamy when ... a frenzied maniac wielding ... an axe or tomahawk hacked two young women to death in suburban bedroom haunts the collective conscience of Cowra townspeople'.\nGeorgina Watmore (left), 24, and her friend and workmate at the Edgell cannery in Cowra had a small after-pub party in April 1987, but in the early hours of the morning were bludgeoned to death by someone they were 'deeply and emotionally involved with' but who has never been charged\nThe brutal murder of the two women in the house (pictured) on Jindalee Circuit, Cowra is remembered as the 'night of infamy' and still haunts the historic town 300km west of Sydney to this day\nBut a Coroner has ruled that the person responsible for Ms Holmes and Ms Watmore's murders was someone they knew and with whom they were 'deeply and emotionally involved'.\nCatherine Holmes, nee Pollard, was a 28-year-old mother of two infants who had separated from her children's father. Georgina Watmore was just 24.\nIt was a Tuesday night in mid Autumn when the temperature in Cowra could soar to 30 degrees C during the day, and drop down to less than ten degrees at night.\nMs Holmes children were away, holidaying with their father on the NSW Central Coast. She had invited Ms Watmore for a drink at her home, 1 Jindalee Circuit, in a street of mostly housing commission dwellings.\nIt was an after-pub get together for the two friends and a few others. Neighbours say it was 'not particularly noisy' and police believe the party broke up in the early hours of the morning.\nThe next day Ms Holmes was due at the cannery, but did not show up. Her neighbour, Robyn Moulder, became concerned later on Wednesday when she saw Ms Holmes' car was still in the driveway when the bubbly young mother should have been at work.\nThe following morning the next door neighbour's son saw blood saptter and the bodies of Geogrina Watmore (above, left) and Catherine Holmes lying motionless in the bedroom\nMs Moulder's son went over to the house and looked through the window of the main bedroom. He could see blood spatter and two women lying motionless on the bed.\nWhen the ambuulance arrived, paramedics Paramedics found Ms Holmes dead. An unconscious Ms Watmore died on arrival at Cowra hospital.\nA post mortem revealed that Ms Holmes had been bludgeoned 15 times, Ms Watmore struck five times. While they surmised the murder weapon may have been a tyre lever or an axe, it was never found.\nThe back door of the home had been left unlocked and there was no sign of forced entry. Senior police described the murders as among of the worst they had seen.\nCowra, which had a population of around 7000, was in shock. The town which was best known for being the site of a World War II Japanese prisoner of war camp who attempted a mass break-out in 1944, now had another source of notoriety.\nCatherine Holmes, 28, (above), mother of two infant children had been hacked to death 15 times with an axe or tyre lever, while her friend Georgina Watmore had been struck five times, but was dead on arrival at hospital\nIn the wake of the murders, police interviewed 400 people, some of them up to four times, including the guests at the small party Ms Holmes hosted.\nA Coroner's inquest into the murders in 1988 heard evidence from around 30 witnesses.\nCoroner Jim Smith eliminated rumours that the murders were drug related, said the murders were not a random attack and that the offender must have been 'deeply and emotionally involved' with the victims.\nHe said he was satisfied police had conducted a thorough investigation. But in the years since, family and friends have discussed the names of likely suspects to have perpetrated such violence on the two women.\nBoth women's families have spent almost three decades wondering who killed their loved ones.\nMs Holmes's cousin John Pollard told Daily Mail Australia that the family was still deeply affected by the murders and despite the Coroner's praise for the police investigation, he believed the suspect still 'walked free to this day' in the town.\nThe house at 1 Jindalee Circuit, Cowra, lay unoccupied for several years following the brutal murders, but the families of the two women hope that a $200,000 police reward for information may encourage someone to come forward\n'I was talking to Cathy on that day before she got murdered. It was over the fence when I was picking up my daughter next door,' he said.\n'She was just as normal. When we heard the next day, it was a shock. 'There were a lot of suspects back then but nothing really happened.\n'There was some hush hush about the murder weapon being found but nothing came of it. I've had my suspects, the whole of Cowra has.\n'If only Georgina had survived she could have said who did it and it would have been solved.'\nFour years ago, Ms Holmes’s sister, Robyn Coffey, told the Cowra Guardian that her sister's children 'were only babies when she died and she loved them with all her heart'.\n'She was gorgeous, she laughed a lot, she was a good sister and a good mother.'\nIn 2014, family marked the anniversary of the deaths with a written tribute, saying 'Two beautiful angels were taken from us 27 years ago and it changed our lives forever.\n'But there's not a day that goes by that we don't have our thoughts and memories of you both that time can never erase.'\nIn May 1987 a $50,000 reward was posted by the NSW Government. Strike Force Alister was formed in March 2009 to inveatigate the crimes.\nNow the NSW Minister for Police, Troy Grant, has approved a $200,000 government reward for anyone who can provide information to solve the crimes.\nIn the Cowra Community News, Georgina's brother David Booth welcomed the substantial reward offer.\n'There is someone out there who has information about my sister's death,' he said. 'Unfortunately,\ntheir conscience has not been enough to get them to contact police.\n\"I hope that this reward is enough to change their mind, and to give my family and Catherine's some answers as to what happened that night.'","url":"https://www.dailymail.co.uk/news/article-3393110/Police-offer-reward-murder-mystery-two-young-women-bludgeoned-death-29-years-ago-frenzied-maniac-case-haunts-country-town.html"}
