{"authors":["Julie Mccarthy"],"date_download":"2018-10-22 21:42:25","date_modify":"2018-10-22 21:42:25","date_publish":"2016-11-16 00:00:00","description":"People in India are camped out in long lines at banks seeking to exchange high-denomination currency that the government has withdrawn from circulation.","filename":"data/vaneerConsumption/CrackdownOnBlackMarketCausesCashCrunchInIndia.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_16_502274860_crack-down-on-black-market-causes-cash-crunch-in-india_1540244545.html","title":"Crackdown On Black Market Causes Cash Crunch In India","title_page":"Crackdown On Black Market Causes Cash Crunch In India : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Crackdown On Black Market Causes Cash Crunch In India\nPeople in India are camped out in long lines at banks seeking to exchange high-denomination currency that the government has withdrawn from circulation.\nDAVID GREENE, HOST:\nIn India, a nationwide cash crunch has brought economic life in streets and villages to a virtual standstill. This is because last week, the government of Prime Minister Narendra Modi invalidated 500 and 1,000 rupee banknotes. These are the country's largest. NPR's Julie McCarthy is on the line from New Delhi. Julie, good morning.\nJULIE MCCARTHY, BYLINE: Good morning.\nGREENE: Now, let me get this straight. Eliminating these banknotes - this was supposed to crack down on tax evaders and other people who keep their assets in cash. But it sounds like it has had a lot of unintended consequences.\nMCCARTHY: Yes, indeed. You know, you can't pass an open bank branch on the streets today and not see people snaking out the door, and they're not happy. One man, who had been there since 5 in the morning, told me he moved 21 feet. And it was 2 o'clock in the afternoon. Then a fight broke out because everybody was so mad about people pushing ahead in the lines.\nYou know, there's disarray. The ATM machines are empty. And, you know, with this crackdown on this unaccounted-for money, the government effectively wiped out 86 percent of India's cash in terms of value. And replenishing that, as you can imagine, is an administrative nightmare.\nNow, a couple of housewives in line said, look, you know, it's for a good cause. There's no problem. But a woman behind them who seemed a bit more representative said, hold on, this is no minor disruption. Her business, which is supplying IT parts, has been closed for a week. She's got no cash to get to work. She's scraping with the food there is at home. It's the common man, she said, who's bearing this burden.\nGREENE: How did the government not realize that this would really affect ordinary people and not just rein in tax evaders?\nMCCARTHY: Well, that's the question. I mean, how well-thought-out was it? And they seem to have forgotten one key factor - cash is king in India. Ninety-seven percent of all transactions are in cash. People don't have it. This is the problem.\nAnd millions of these Indians standing in line, David, are losing a day's wages just being there. People can't pay their bills. Small businesses, who are the bulwark of this economy, they're paralyzed because people have stopped shopping. You know, people with relatives in the hospitals are stuck. These are big bills they have to pay.\nAnd this is not a credit-card country. The government is calling on people to withstand this inconvenience for the greater good. But one security guard in line said to me, look, black money, white money, I can't get my money. So it appears to a lot of people that this whole currency switch has been a bit bungled.\nGREENE: Well, to say the least. I mean, what about the bad guys that the government's going after? Is there any success in what they've tried here?\nMCCARTHY: Well, you know, we don't know that yet. And the calculation has been that, look, if you pull from circulation, these 500 and thousand rupee bills - the largest bills, as you said - and replace them with new bills, you'd choke off counterfeiters. And you begin to hunt down what could be billions of dollars stashed in India's underground economy.\nFor example, black money is a major factor in propping up real estate prices because that's where a lot of this unaccounted money ends up, in property, in gold, in jewelry, in fancy cars. So this will not be going after the super rich, maybe the tier beneath them. And that would include political parties. So watch that space.\nGREENE: Julie, what if I'm sitting here and I'm not trafficking in black money, and I just have some of these old 500 or 1,000 rupee notes, and I just want to get them exchanged? I mean, is that possible?\nMCCARTHY: (Laughter) Yeah, you can. You can if you show up with more than 250,000 rupees, about $3,600, you're going to raise the eyebrows of the tax collector. But if you can account for that, you're OK. If you cannot account for it, you're going to face a 200 percent taxation rate. Now, you know, Modi is gambling that this whole crackdown is going to help burnish his political standing. But in the meanwhile, the physical capacity of the banking system and the people's patience is being seriously strained by all of this.\nGREENE: OK. Quite an economic mess in India right now. NPR's Julie McCarthy speaking to us from New Delhi. Julie, thanks.\nMCCARTHY: Thank you.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/11/16/502274860/crack-down-on-black-market-causes-cash-crunch-in-india"}
