{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:42:22","date_modify":"2018-10-30 21:42:22","date_publish":"2017-01-09 15:53:38","description":"One of the first spots to open at Krog Street Market\nis closing its doors to rebrand, E...","filename":"data/vaneerConsumption/CraftIzakayatocloseatKrogStreetMarketwillreopenasMakimono.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/09/Images/WPIMAGE_cmgajcfoodandmore_12992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_cr_1bb3ee96d5098d759d2db71f1fc838a8__1540935742.html","title":"Craft Izakaya to close at Krog Street Market, will reopen as Makimono","title_page":"Craft Izakaya to close at Krog Street Market, will reopen as Makimono","title_rss":"NULL","source_domain":"ajc.com","text":"One of the first spots to open at Krog Street Market is closing its doors to rebrand, Eater Atlanta reports.\nChef Jey Oh said Craft Izakaya will close Sunday, Jan. 15 and will reopen Wednesday, Jan. 18 as Makimono, a take-away sushi bar, a concept he described as a Japanese version of Chipotle. The new concept will feature a variety of to-order sushi rolls and cooked bowls.\nThe restaurant's dining room will become general seating for the market, while the interior sushi bar will serve as a cocktail bar.\nThe reconfiguration is the most recent change at Krog Street Market, which in the past few months has seen Suzy Siu's Baos open; The Cockentrice and Spotted Trotter close with the announcement that a Castellucci Hospitality Group concept will take Cockentrice's place ; and Varuni Napoli announce it will open a spot in the market in 2017.\nRead more about the latest at Krog Street Market here.\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/craft-izakaya-close-krog-street-market-will-reopen-makimono/QARQYo1v8aVYLCbXpwhxsK/"}
