{"authors":["Alicia Lu"],"date_download":"2018-10-30 23:18:42","date_modify":"2018-10-30 23:18:42","date_publish":"2014-08-13 20:52:08","description":"Just when you thought Comcast's reputation couldn't possibly get any worse, the cable and Internet company rubbed its hands together, laughed maniacally, and said in a sinister voice, \"Well you thought wrong.\" (Metaphorically.) After Ryan Block was…","filename":"data/vaneerConsumption/CraftyComcastPutWannabeExCustomerAaronSpainOnHoldUntilOfficesClosedVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7f84037d-1194-4f64-952a-997d9822e72b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35672-crafty-comcast-put-wannabe-ex-customer-aaron-spain-on-hold-until-offices-closed-video_1540941522.html","title":"Crafty Comcast Put Wannabe-Ex-Customer Aaron Spain On Hold Until Offices Closed - VIDEO","title_page":"Crafty Comcast Put Wannabe-Ex-Customer Aaron Spain On Hold Until Offices Closed — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Just when you thought Comcast's reputation couldn't possibly get any worse, the cable and Internet company rubbed its hands together, laughed maniacally, and said in a sinister voice, \"Well you thought wrong.\" (Metaphorically.) After Ryan Block was pushed to the brink of insanity when trying to cancel his cable service last month, another customer has publicized his issues while trying to cancel the service: A Comcast customer rep put Aaron Spain on hold until the office closed, thus slyly getting out of the whole damn thing.\nKudos to Comcast for employing a whole spectrum of terrible service techniques (from annoying to passive aggressive and everything in between) — I wonder if it's in their training manuals.\nLike Block, Comcast customer Aaron Spain wanted to switch cable and Internet providers, and like Block, Spain faced extreme difficulty in completing what should be a very simple task. When Spain called Comcast's customer retention department, a representative immediately put him on hold ... for three and a half hours. After three hours of listening to statically elevator music and automated recordings, Spain decided to document his journey through hell, recording a video.\nWhen he uses a different phone to call the cancellation department, he's forced to go through what feels like 5,872 steps before he finally reaches the right menu option. When he chooses \"to disconnect all of your Comcast services,\" the automated recording says (probably with a grin), \"I'm sorry, but our offices are now closed.\" I bet you my Verizon account that she's not really sorry!\nAaron Spain on YouTube\nAt this point, Spain has been on hold on his other line for more than three hours. And at one point during the video, he adds, \"By the way, this is after a month of trying to get them to fix my service.\"\nSo it doesn't really matter if Comcast take the \"I'm going to drive them insane by repeatedly asking why they're canceling their service\" route (which Block was treated to) or the \"I'm going to avoid the problem altogether\" route (which you just witnessed with Spain above), Comcast's customer retention reps will keep you on the phone for eternity.\nAnd it doesn't end with Block and Spain. A third customer, Tim Davis, publicized Comcast's questionable customer service when he tried to get technician charges refunded after a previous rep had assured him that he wouldn't be charged. Comcast fought his request until he whipped out a recording of the first rep. In Davis's recording, he asks the rep, \"You're telling me that if I didn’t have a recording of that call, you wouldn’t have been able to do it?\" She replies, \"Yes, that is correct.\"\nThe moral of the story here is clear: always record your calls with Comcast. Now, let's all take a deep breath until the next Comcast customer service nightmare.","url":"https://www.bustle.com/articles/35672-crafty-comcast-put-wannabe-ex-customer-aaron-spain-on-hold-until-offices-closed-video"}
