{"authors":[],"date_download":"2018-10-22 21:23:13","date_modify":"2018-10-22 21:23:13","date_publish":"2014-06-05 00:44:13","description":"The plane's engine was sputtering before it went down in woods southeast of Tacoma, Wash., witnesses reported.","filename":"data/vaneerConsumption/CrashofWorldWarIIDesignPlaneKillsTwoinWashingtonState.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_crash-world-war-ii-design-plane-kills-two-washington-state-n123076_1540243393.html","title":"Crash of World War II-Design Plane Kills Two in Washington State","title_page":"Crash of World War II-Design Plane Kills Two in Washington State","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA World War II-design trainer aircraft sputtered and crashed into a wooded area southeast of Tacoma, Wash., on Wednesday killing two people, authorities said.\nAn airplane was seen flying low with its engine sputtering before it went down about 3:30 p.m. PT (6:30 p.m. ET) west of the town of Buckley, about 20 miles from Tacoma, Pierce County Sheriff’s Detective Ed Troyer said in his department Twitter feed.\nTroyer said two people were killed in the crash, both believed to be males. The area where the plane crashed is a mix of woods, farmland and rural homes north of state Route 410. It was not immediately known where the aircraft was heading, and names of the victims were not released.\nAllen Kenitzer of the Federal Aviation Administration said the aircraft was a two-passenger North American AT-6C. Kenitzer said the National Transportation Safety Board would take the lead on investigating what happened.\nThe T-6 was introduced in the 1930s and used for training U.S. and other pilots during World War II and beyond. Variants were also used in combat in conflicts around the world. AT-6C was a model designation for the U.S. Air Force.\n— Gil Aegerter","url":"https://www.nbcnews.com/news/us-news/crash-world-war-ii-design-plane-kills-two-washington-state-n123076"}
