{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:14:31","date_modify":"2018-10-22 21:14:31","date_publish":"2016-01-11 00:28:09","description":"The 28-year-old is nominated for Best Performance by an Actress in a Television Series - Musical or Comedy at the Golden Globes.","filename":"data/vaneerConsumption/CrazyExGirlfriendstarRachelBloomsingsasexyGoldenGlobesong.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004DE5100000578-0-image-a-25_1452487196013.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393183_Spanx-corset-Spanx-corset-Crazy-Ex-Girlfriend-star-Rachel-Bloom-sings-sexy-Golden-Globe-song-honor-shapewear-noting-t-breathe_1540242871.html","title":"Crazy Ex-Girlfriend star Rachel Bloom sings a 'sexy Golden Globe song'","title_page":"Crazy Ex-Girlfriend star Rachel Bloom sings a 'sexy Golden Globe song' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crazy Ex-Girlfriend star Rachel Bloom may have to make a habit out of singing a 'sexy Spanx song' before all award ceremonies - after her odd pre-event ritual led to her winning a Best Actress gong at this year's Golden Globes.\nBefore Sunday evening's star-studded ceremony, Rachel took to Instagram to reveal that she had squeezed herself into some tight-fitting Spanx and a corset, no doubt in order to make sure that her figure-hugging green dress, which was custom-made by Christian Siriano, fit like a glove.\nBut rather than try and keep her shapewear a secret, Rachel, 28, was more than happy to sing about the undergarments from the rooftops - quite literally in fact, as she actually penned and performed a little ditty in honor of the slinky nude-colored underwear.\nLooking good! Rachel Bloom performed a song in honor of her Spanx ahead of the Golden Globes red carpet on Sunday evening\nBody-popping: The 28-year-old danced along to her ditty, before admitting to the camera that she was struggling to breathe in the tight-fitting shapewear\nWinner! Rachel picked up the Golden Globe for Best Performance by an Actress in a Television Series - Musical or Comedy for her role in Crazy Ex-Girlfriend\nIn a video posted to her Instagram account just hours ahead of the event, Rachel, can be seen body-rolling and dancing in her Spanx, while singing her original song.\n'It's the sexy Golden Globe-y song, the sexy Golden Globe-y song,' she sings in a husky voice, while sexily thrusting her chest forward.\n'Spanx and a corset, Spanx and a corset,' she continues, before finally admitting to the camera: 'I can't breathe!'\nDespite her discomfort however, it seems the shapewear worked a treat for Rachel, who not only received high praise from Twitter's would-be fashion critics when she made her debut on the carpet, but also managed to scoop herself the Golden Globe for the Best Performance by an Actress in a Television Series - Musical or Comedy for her role in Crazy Ex-Girlfriend.\nAnd after marching up on stage, following a few seconds of speechless disbelief, Rachel seized upon the opportunity to fly the flag for all those who have made her show such a success, first paying tribute to the President of The CW network for picking the show up in the first place.\n'Oh my god, oh my god!' she said when she got up to the stage. 'Guys, guys, guys, I'm just going to talk to you like it's just people and I'm not on TV.\nShocked: When Rachel took to the stage, she spent a few speechless seconds attempting to find the words to thank her friends, family and fans, before launching into a passionate speech\nDisbelief: The actress looked like she was having a ball as she posed up with her Globe backstage\nShe's a hit! The Spanx clearly worked a treat, as Rachel looked stunning in her form-fitting Christian Siriano gown, which she accessorized with a box clutch and a pair of gold earrings\nDisbelief: After marching up on stage, following a few seconds of speechless shock, Rachel seized upon the opportunity to fly the flag for all those who have made her show such a success\n'We made a pilot for another network and they rejected it and we sent the pilot to every other network in Hollywood and we got six rejections in one day, and we felt like crap.\n'But we knew it was good, and Mark Pedowitz [who is the President of] The CW picked it out and he saved us, and he's the reason that there's a musical comedy on network television right now!'\nShe finally paid tribute to her 'amazing' husband and her parents, before pumping her trophy in the air in celebration and heading off the stage.\nEven before her momentous win, however, Rachel's fans were quick to praise her on social media, with many taking to Twitter to comment on her stunning sense of style.\n'Oh my goodness Rachel Bloom looks stunning!' one person wrote on the social media site, while designer Christian Siriano, the man behind Rachel's beautiful green gown, proudly tweeted: 'The stunning Rachel Bloom looks gorgeous in her custom Siriano gown tonight.'\nBut while her dress proved incredibly popular, it was nowhere near as big a hit as the Spanx she proudly wore underneath it - and the song written in their honor.\n'My new pet!' The actress shared this image on her Instagram account shortly after her win, joking that the award is as precious as an animal to her\nAlready a winner: Rachel, who is nominated for Best Performance by an Actress in a Television Series - Musical or Comedy, received high praise for her performance on Instagram\nShe's on a roll: The actress was more than happy to reveal the slimming secret behind her ensemble\n'I love you. I want you to win all the awards,' one of her fans commented on the Instagram video, while another added: 'This is the best. Never watched your show before but I'm definitely going to start now!'\nEarlier this week, Rachel admitted to Elle.com that she has struggled in the past when it comes to knowing what to wear on the red carpet, saying that her curvy figure often makes it difficult for her to find fashions that flatter her physique.\n'I'm learning very quickly,' she said. 'Fashion has always been a source of stress for me, because I don't know how to dress myself.\n'I'm short-torsoed with big boobs and I don't really understand what a belt does. But you get on these shows and people fit the clothing to you and suddenly you learn, \"Oh, I should be wearing petite jackets.\"","url":"https://www.dailymail.co.uk/femail/article-3393183/Spanx-corset-Spanx-corset-Crazy-Ex-Girlfriend-star-Rachel-Bloom-sings-sexy-Golden-Globe-song-honor-shapewear-noting-t-breathe.html"}
