{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 20:47:11","date_modify":"2018-10-30 20:47:11","date_publish":"2015-11-14 23:46:39","description":"The newly appointed Polish foreign minister has moved to forestall the inevitable hand-wringing over the Paris attacks, this morning claiming \"crazed leftists\" would blame the killings of over 120 civilians by Islamist terrorists on the West.","filename":"data/vaneerConsumption/CrazedLeftistsWillTryToBlameParisAttacksOnTheWest.json","image_url":"https://media.breitbart.com/media/2015/11/Waszczykowski.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_14__1540932431.html","title":"'Crazed Leftists' Will Try To Blame Paris Attacks On The West","title_page":"Newly Elected Right-Wing Polish Government: 'Crazed Leftists' Will Try To Blame Paris Attacks On The West","title_rss":"NULL","source_domain":"breitbart.com","text":"The newly appointed Polish foreign minister has moved to forestall the inevitable hand-wringing over the Paris attacks, this morning claiming “crazed leftists” would blame the killings of over 120 civilians by Islamist terrorists on the West.\nSpeaking on Polish radio this morning, foreign minister-select Witold Waszczykowski who will take his post officially on Monday called Friday night’s terror attack “an attack on civilisation,” adding, “France is an icon of civilisation”.\nThe minister expressed that Islamic State terror was caused by half-hearted Western military campaigns which were enough to goad them into “civilisation war with the West”, but stopped short of full war, not enough to defeat the Caliphate.\nWithout naming any particular states, Mr. Waszczykowski also took aim at the countries who help fund Islamist terrorism. He said the West should: “exert enormous pressure on those countries that created the Islamic State, or which support it.\n“Of course, if it comes to closing the channels of financing and recruiting for the Islamic State, you can take those together when you go to war. Unfortunately, we are are not talking about war but a broader coalition with regional nations against the Islamic State”, reports Telewizja Republika.\nHis harshest criticisms, however, were reserved for the European intellectual elite who he believed would try and lever the attacks to their political advantage.\nAsked by the radio interviewer whether the attacks were linked to the European migrant crisis, he said: “I have a problem with that, because I heard in this morning’s discussions these crazed leftists who explained that we are guilty, that Western countries are to blame.\n“[They say] we have not created the right conditions for living, for integration for these people and they are so frustrated by it they reach for the Kalashnikov, the suicide belt. It is down to the faults of our society.\n“That’s a blind alley. Whipping up shame in our society, makes our civilisation lame”.\nAlthough Mr. Waszczykowski doesn’t officially become foreign minister until next week, he has not been shy about getting involved in sensitive national and global issues since the stunning victory of his right-wing Law and Justice party last month in a national election that totally cleared the Polish parliament of left-wing parties.\nSpeaking to the BBC about Poland’s refusal to take immigrants, Mr. Waszczykowski said yesterday: “the proposal to accept a large number of migrants from other continents, migrants that are seeking jobs and social benefits, is not acceptable to us. Our job markets are not prepared to accept such large amounts of people.\n“In case of Poland, our job market is very narrow. Two million Poles are searching for jobs in Western Europe, and one and a half million Poles are jobless here in Poland”.\nPressed by BBC reporter Nkem Ifejika, who had recently reported from Poland’s national day celebration complaining of the fact the attendees were overwhelmingly Polish, Mr. Waszczykowski said on the subject of Poland accepting political refugees: “this is a different problem, of course. We’re supposed to respect international law, and we’re supposed to provide shelter for those who search from asylum”.\n“If there are people who can escape from Syria and can prove their identity, can prove they were engaged in political activity and may be persecuted by the Assad regime… they can legitimately flee to safe havens, and for them the first safe countries are like Lebanon, Turkey, and Jordan. Escaping there, they are refugees.\n“Once they leave these countries and travel through Europe, they are violating international law, and become illegal migrants. They are migrants searching for jobs and social benefits”.\n“We cannot give them the possibility to live in Poland just because they wish to have a better life. We can’t even provide a better life for millions of Poles… we cannot provide every citizen in the earth the level of living of Western European standards”.\nAgain pushing Mr. Waszczykowski to drop his tough stance on migration, Mr. Ifejika then asked the foreign minister to condemn the words of his own party leader, who last month accused migrants of bringing diseases and parasites into Europe. Refusing to back down, Mr. Waszczykowski countered: “we accept this language, it is not the language of hate, it is the language of warning.\n“Such a large, uncontrolled migration may cause problems for the life of Europe… security of our country is the most important, I am a politician… I am taking part in the decision to secure Poland… I spent years living in foreign countries, living in the Middle East. I was the ambassador to Iran.\n“I know this region, I know the culture, I know what might happen with uncontrolled migration from regions where war has been going on for years. This is not the language of hate, it is the language of warning”.\nOne of Mr. Waszczykowski’s senior colleagues moved to back him up this morning, telling journalists that Poland would not be accepting migrants under the European Union relocation quota scheme, and said he would cancel the outgoing government’s commitment to the scheme. Europe affairs minister Konrad Szymanski, who will also take up his role on Monday said: “in the face of the tragic acts in Paris, we do not see the political possibilities to implement [this]”.\nMany are now looking to Eastern Europe as a beacon for hope, as they resolutely refuse to accept the European Union’s multicultural ambitions. Speaking to Breitbart London, Euro-sceptic, anti-migration Sweden Democrat member of parliament Kent Ekeroth spoke of his admiration. He said:\n“The eastern states are Europe’s hope. They are the ones standing against the left-wing liberalism – the EU tried to push it on them, to change them just like they changes Western Europe. But I hope they won’t change. I always feel this connection with other Europeans, and I want to help preserve these different but similar cultures in Europe”","url":"https://www.breitbart.com/europe/2015/11/14/newly-elected-polish-government-crazed-leftists-will-try-blame-paris-attacks-west/"}
