{"authors":["Portia Crowe"],"date_download":"2018-10-30 23:10:36","date_modify":"2018-10-30 23:10:36","date_publish":"2016-12-08 00:00:00","description":"Peck was previously head of internet research at SunTrust.","filename":"data/vaneerConsumption/CreditSuissehiresRobertPeckasheadofglobalinternetbanking.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_credit-suisse-hires-robert-peck-as-head-of-global-internet-banking-2016-12_1540941036.html","title":"Credit Suisse hires Robert Peck as head of global internet banking","title_page":"    Credit Suisse hires Robert Peck as head of global internet banking - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Robert Peck. YouTube/SurveyMonkey Credit Suisse has hired Robert Peck from SunTrust to head its global internet banking franchise, according to an internal memo seen by Business Insider.\nHe is expected to start in New York in March and will report to global technology banking head David Wah.\nPeck was previously head of internet research at SunTrust. Before SunTrust, he was president of the tech, media, and telecom, or TMT, merchant bank CoRise.\nAs an internet analyst, Peck made regular media appearances. Last year he made headlines for calling on Yahoo to remove Marissa Mayer as CEO.\nHe recently called on Twitter to cut 10% of its workforce in order to save about $100 million a year due to its stagnating user growth. He is also known to be an Alibaba bull.\nCredit Suisse's tech group lost five key bankers earlier this year, including Cameron Lester, who was head of global internet banking.\nHe and four other group heads — Cully Davis, Bill Brady, Steve West, and John Metz —left for Jefferies in May.\nHere's the full memo, co-signed by global TMT coheads Wah and Mark Simonian:\n\"We are pleased to announce that Robert Peck will join Credit Suisse as a Managing Director, Head of Global Internet Investment Banking within the Technology Group of the Investment Banking and Capital Markets division. Bob is expected to start in March 2017. He will be based in New York and will report to David Wah.\n\"Bob joins us from SunTrust Securities where he has most recently served as the Head of Global Internet Research since 2013. Bob has been covering the Internet sector for over a decade and has consistently been a thought leader in the Internet and Digital Media sector, having been ranked for several years in Institutional Investors' Annual All-America Research rankings. He has been the lead equity analyst covering Internet and US diversified Media stocks including Alibaba, Amazon, Facebook, Google and Netflix. Bob is featured regularly in the media, including CNBC, Bloomberg, Fox Business News, The Wall Street Journal and The New York Times, and he is well known by technology companies, public investors and venture capitalists alike. Prior to joining SunTrust in 2013, Bob was President of CORISE LLC, a TMT Merchant Bank, and from 2008 to 2011 he was a senior analyst covering TMT at Baron Capital. Bob has also served as a mentor at ERA, an early stage startup accelerator in New York City dedicated to mentoring and seeding early stage entrepreneurs.\n\"Credit Suisse's Technology Group has had a long legacy of leadership in the Global Internet sector, having acted as bookrunner for the IPOs of such leaders as Google, Baidu, Facebook and Alibaba. The hiring of Bob, combined with the recent Managing Directors joining in San Francisco, Marco Chisari in Technology M&A and Brian Marshall in Software, demonstrates our commitment to maintain our leadership position in Technology investment banking.\n\"Please join us in welcoming Bob to Credit Suisse and wishing him success in his new role.","url":"https://www.businessinsider.com/credit-suisse-hires-robert-peck-as-head-of-global-internet-banking-2016-12"}
