{"authors":[],"date_download":"2018-10-30 20:55:41","date_modify":"2018-10-30 20:55:41","date_publish":"2016-12-23 00:00:00","description":"The Justice Department is trying to hold European banks accountable for shoddy securities that contributed to the US housing market collapse.","filename":"data/vaneerConsumption/CreditSuisseagrees53billionsettlementoverUSmortgagebackedsecuritiescase.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_credit-suisse-agrees-53-billion-settlement-over-us-mortgage-backed-securities-case-2016-12_1540932941.html","title":"Credit Suisse agrees $5.3 billion settlement over US mortgage backed securities case","title_page":"    Credit Suisse agrees $5.3 billion settlement over US mortgage backed securities case - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Credit Suisse CEO Tidjane Thiam. REUTERS/Ruben Sprich/File Photo ZURICH (Reuters) - Credit Suisse has agreed in principle to pay US authorities $2.48 billion to settle claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis, the Swiss bank said on Friday.\nCredit Suisse will also provide $2.8 billion in consumer relief over five years from the settlement, it said in a statement, adding the deal was subject to negotiation of final documentation and approval by its board of directors.\n\"Credit Suisse will take a pre-tax charge of approximately $2 billion in addition to its existing reserves against these matters. This will be taken in our 4Q 2016 financial results,\" it added.\nThe final deal is in line with the $5 billion-$7 billion the US Department of Justice (DOJ) had asked Credit Suisse to pay earlier in negotiations, as reported by Reuters on Monday.\nThe news came after Deutsche Bank agreed to a $7.2 billion settlement with the DOJ over its sale and pooling of toxic mortgage securities.\nThe deals highlight the Justice Department's efforts to hold European banks accountable for shoddy securities that contributed to the US housing market collapse.\nThe department sued Barclays on Thursday over similar claims.\nCredit Suisse had paid a $2.8 billion fine in 2014 for helping wealthy Americans evade tax. Credit Suisse in November said it had upped litigation provisions by 357 million francs ($348.29 million), mainly in connection with mortgage-related matters.\n($1 = 1.0250 Swiss francs)\n(Reporting by Michael Shields; Editing by Stephen Coates)","url":"https://www.businessinsider.com/credit-suisse-agrees-53-billion-settlement-over-us-mortgage-backed-securities-case-2016-12"}
