{"authors":["Rachael Levy","Matt Turner"],"date_download":"2018-10-30 23:16:17","date_modify":"2018-10-30 23:16:17","date_publish":"2016-12-08 00:00:00","description":"More people have left Credit Suisse after the investment bank announced its downsizing last year.","filename":"data/vaneerConsumption/CreditSuissedeparturesinNewYorkandLondon.json","image_url":"https://amp.businessinsider.com/images/583df779ba6eb605688b5a93-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_credit-suisse-just-laid-off-a-lot-of-people-2016-11_1540941377.html","title":"Credit Suisse departures in New York and London","title_page":"    Credit Suisse departures in New York and London - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"CEO Thiam of Swiss bank Credit Suisse speaks during a news conference in Zurich. Ruben Sprich/Reuters There have been more departures from Credit Suisse in recent weeks.\nAmong the New York departures:\nGary Gunn , global program trading, head of US agency execution, has left, according to people familiar with the matter. He did not respond to messages seeking comment in time for publication.\n, global program trading, head of US agency execution, has left, according to people familiar with the matter. He did not respond to messages seeking comment in time for publication. Jill Shea, an equity research analyst covering the banking sector, has left. Her office phone number is no longer in service. She did not respond to messages seeking comment in time for publication.\nan equity research analyst covering the banking sector, has left. Her office phone number is no longer in service. She did not respond to messages seeking comment in time for publication. Ashley Serrao, an equity research analyst covering the banking sector, has left. His office phone number is no longer in service. He could not be reached for comment.","url":"https://www.businessinsider.com/credit-suisse-just-laid-off-a-lot-of-people-2016-11"}
