{"authors":[],"date_download":"2018-10-22 22:09:18","date_modify":"2018-10-22 22:09:18","date_publish":"2014-05-09 05:27:16","description":"Fifteen of the best high school jazz bands compete this weekend for national honors, including a darkhorse entry from a struggling Florida town.","filename":"data/vaneerConsumption/CrescendoinBlueCanUnderdogWinHighSchoolJazzsTopPrize.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/430226/140508-floridajazz-cover_02a273ba9ba56bce193f7f5d1a4edeff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_crescendo-blue-can-underdog-win-high-school-jazzs-top-prize-n101071_1540246158.html","title":"Crescendo in Blue: Can Underdog Win High School Jazz's Top Prize?","title_page":"Crescendo in Blue: Can Underdog Win High School Jazz's Top Prize?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSome of the sweetest beats in Manhattan on Friday will come from the brass and strings of 24 young musicians who’ve roamed far from their hardscrabble Florida town to lay it down at the country’s most prestigious high school jazz competition.\nThe jazz band from the Osceola County School of the Arts –- a 900-student school located in a financially frayed community on the fringe of Disney World –- already has bested nearly 100 other high school ensembles by landing an invite to compete against 14 other groups at the annual “Essentially Ellington” contest at Jazz at Lincoln Center.\nOsceola, a 6-12-grade arts school that enrolls students through auditions, represents the rugged realities of its community. In Osceola County, the per capita income is $19,728 and 16 percent of the locals live below the poverty level, according to the U.S. Census Bureau.\nThree student-musicians at the school are homeless.","url":"https://www.nbcnews.com/news/us-news/crescendo-blue-can-underdog-win-high-school-jazzs-top-prize-n101071"}
