{"authors":["Associated Press"],"date_download":"2018-10-23 04:49:46","date_modify":"2018-10-23 04:49:46","date_publish":"2016-01-29 20:39:30","description":"SAN FRANCISCO (AP) — Crews are tearing down a multimillion-dollar San Francisco house that is sliding down a hill, threatening other homes. The three-story, ...","filename":"data/vaneerConsumption/CrewsdemolishingSanFranciscohouseslidingoffhill.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:042a8ce339bc470cb3401753199dbd98-3bmscybNe842cce83474b59addcc-338_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423266_Crews-demolishing-San-Francisco-house-sliding-hill_1540270186.html","title":"Crews demolishing San Francisco house sliding off hill","title_page":"Crews demolishing San Francisco house sliding off hill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crews demolishing San Francisco house sliding off hill\nSAN FRANCISCO (AP) — Crews are tearing down a multimillion-dollar San Francisco house that is sliding down a hill, threatening other homes.\nThe three-story, mid-century house has separated more than a foot from the curb and has sunk more than a foot, says home owner Ronald Martell, who was on site Friday to oversee demolition work.\nIt's unclear what is causing the home to slide, although El Nino storms that have drenched the San Francisco Bay Area could be partly to blame. Martell said one neighbor has reported basement flooding, and there appears to be too much water on his property for the amount of rain that's fallen.\nA work crew demolishes a home that is sliding off a hill and threatening another home in San Francisco, Friday, Jan. 29, 2016. City crews ordered an emergency demolition on Thursday and the work continued Friday. (AP Photo/Jeff Chiu)\nThe city ordered five other homes— one on either side of Martell's house and three at the bottom of the hill behind his house_to hire engineers to show their homes are safe.\nRecords show the Martells bought the house for roughly $2 million in October. But the family hadn't moved in yet, pending a possible remodel.\nIt's been a bad week for Martell, a biotech chief executive who was attending his father's out-of-state funeral Tuesday when he learned the city had red-tagged the house, deeming it unsafe for occupation.\nA neighbor initially texted Martell on Saturday to tell him about a crack in the driveway parallel to the curb. The next day the neighbor sent a photo.\nOn Monday, a contractor spotted a second crack. By Tuesday the city had red-tagged the house, deeming it unsafe for occupation, and informed Martell that his house was sliding_a shock since a buyer's inspection indicated nothing was wrong.\nMartell and his family rushed back to San Francisco on Wednesday, a birthday he shares with his 13-year-old son, to meet with engineers. On Thursday, the city ordered an emergency demolition.\nBy then, the house had slipped 14 inches away from the curb and dropped 12 inches. The gaps have continued to grow.\nWilliam Strawn, a spokesman for San Francisco's Department of Building Inspection, said the city ordered an immediate teardown because of the \"imminent public safety hazard.\"\nStrawn said the cause of the unstable soil conditions is under investigation.\n\"We'd love to rebuild,\" Martell said. \"The question is what's happening with the larger hillside and is there a water issue that needs to be corrected?\"\nNeighbor Mark Miller, whose home is unaffected, said seeing unsettled soil is unsettling.\n\"You don't expect your foundation to slip out from underneath you,\" he said.\nA work crew demolishes a home that is sliding off a hill and threatening another home in San Francisco, Friday, Jan. 29, 2016. City crews ordered an emergency demolition on Thursday and the work continued Friday. (AP Photo/Jeff Chiu)\nA work crew demolishes a home that is sliding off a hill and threatening another home in San Francisco, Friday, Jan. 29, 2016. City crews ordered an emergency demolition on Thursday and the work continued Friday. (AP Photo/Jeff Chiu)","url":"https://www.dailymail.co.uk/wires/ap/article-3423266/Crews-demolishing-San-Francisco-house-sliding-hill.html"}
