{"authors":[],"date_download":"2018-10-30 20:48:57","date_modify":"2018-10-30 20:48:57","date_publish":"2018-08-27 10:00:00","description":"Bill Torpy writes about Benjamin Paul, 30, whose job offer from Georgia Tech was yanked after Tech learned about crimes Paul committed as a teen.","filename":"data/vaneerConsumption/CrimesmancommittedasateenquashGaTechjoboffer.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/27/Images/newsEngin.22773939_ben-paul-16x9.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-when_0e452eb3d7a549c647c7c8e2074e7e07__1540932537.html","title":"Crimes man committed as a teen quash Ga. Tech job offer","title_page":"Crimes man committed as a teen quash Ga. Tech job offer | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"Benjamin Paul was thrilled by the opportunity Atlanta afforded. The single father was a career adviser at Miami Dade College and, in June, was offered a similar gig at Georgia Tech. It was a ticket to the big time in an ascendant city.\nThe $50,000 job was not only career advancement, it was a poignant tale of redemption. Paul, a drug-selling ruffian in his teens, had steadily toiled to turn his life around and prove he would not become just another young black man who fell off the rails early on and was unable to recapture a sense of purpose.\nThe job’s start date was Aug. 1, so Paul found an apartment in the gentrifying area around Howell Mill Road. It was near his job and, more importantly, would allow his third-grade daughter to attend a “winning school.”\nWell, it didn’t work out that way. Earlier this month, Georgia Tech’s HR office sent him a letter saying thanks, but no thanks. A background check had disqualified him.\nNever mind that Paul’s crimes — felonies that he had admitted to the university — were 12 years ago or earlier, occurring when he was 17 and 18. He is 30.\nNever mind that Paul moved to Miami to escape bad influences in his native Tampa. Never mind that he worked to get a GED, an associate’s degree, a bachelor’s and finally a master’s. Or that he dutifully worked at Miami Dade College for four years and erased early suspicions to earn rave references from supervisors. Or that he’s an ordained minister. Or that he pieced together school, work and child care to raise a young daughter who is said to be a delight.\nPaul admits his criminal record “looks real messy on paper.” The background check found convictions for sale of cocaine, being a delinquent in possession of a firearm, and two robberies (without a weapon).\nHe admits he sold small amounts of coke and “tried to shake down some junkies for cash. That didn’t go well.”\nPaul served less than a year and then left Tampa. Getting a job is crucial for probationers to turn their lives around. It also proves to be difficult. He applied for entry-level jobs with Kroger, Target and UPS. But after background checks, the answer was nope, nope and nope.\nHe has noticed that companies increasingly perform background checks for most jobs. Atlanta employment lawyer Jeffrey Sand says, “That’s become the norm. It’s become cheaper to order background reports. You can get one for your babysitter.”\nTech would not comment on Paul. The University System of Georgia’s hiring guide says schools “will consider the specific responsibilities of the position for which the candidate is being considered, the nature, number and gravity of crimes for which the candidate was convicted and the amount of time that has passed since the conviction.”\nI suppose Tech, which otherwise hasn’t been good about policing in-house shenanigans with administrators, wants another decade or two of Paul’s good behavior to roll by.\n» IN-DEPTH: Lax oversight allowed high-paid Georgia Tech officials to misuse tax money\n» RELATED: Georgia Tech dragged its feet on investigation, tipster complained\n» MORE: Georgia Tech president fires another administrator\nAfter moving to Miami, Paul worked under-the-table jobs until he caught on with AmeriCorps, where he established a food pantry at Miami Dade College. Supervisors and co-workers liked his initiative and energy. He then told them about his past.\n“I’ve done this 100 times; I’ve learned don’t bring it up until you have to,” he said.\nNathaniel Gomez, then a college supervisor, said several managers, including the dean, met to discuss Paul. They decided to keep him. By then, he had formed relationships and “had made a name as a positive, dedicated, professional employee,” Gomez said. Paul later got a couple of promotions.\n“He earned everything he got,” said Gomez, one of his references to Tech. “He’s one of those people I could put my name out there for.”\nPaul said, “Miami Dade College was my moment of redemption.”\nAfter being allowed to stay, he said, “I gave them my best.”\nBut he was making just $30,000 and could only afford to live in a “hole-in-the-wall” efficiency apartment for him and his daughter.\n“With the master’s degree (earned this summer) I had the confidence to venture out. I have experience. I have an education. Georgia Tech told me my references were stellar.”\nBut then his past, 12 years in the mirror, caught up with him. Again.\nIn recent years, society has increasingly pushed criminal justice reform after years of a tough-on-crime approach that has left offenders stacked up like cord wood.\nGov. Nathan Deal created the Council on Criminal Justice Reform to try to move thousands of Georgians from prison bunks into society as productive citizens.\nNathan Deal (left) is sworn in as the 82nd governor of Georgia by his son, Hall County Superior Court Judge Jason Deal, in the House chamber on January 10, 2011, in Atlanta. (AP Photo/John Bazemore)\nI reached out to Deal’s son, Jason, a Hall County judge who has been an advocate of drug court, which tries to find ways to give people second (and third) chances. When I called Jason Deal, he thought I was a drug court “graduate” he was trying to get enrolled in college.\nHe said cases such as Paul’s are not uncommon. “Unfortunately, I see that fairly often in drug court. They get a job and are working the job well, and after 30 days they do a background check and they lose the job. The company says, ‘Well, that’s the policy.’”\nSteven Teske, chief juvenile court judge in Clayton County, said, “This creates a very heavy yoke around ex-offenders. And who it hurts most is people of color.”\nJudge Steven Teske of Clayton County Juvenile Court holds up a piece of paper bearing the words “Five Years” during his Second Chance program on February 26, 2012. Looking on is Quantavious Poole, who completed the program. Five years is how much prison time awaits program graduates if they make another criminal choice in life. (Johnny Crawford / AJC file) (The Atlanta Journal-Constitution)\nGeorgia is a “right to work state,” meaning companies largely have free rein to do as they please. Companies argue they want to know whether their employees are a threat to other employees. And they worry about liability.\n“But at what point is it necessary to keep an ex-offender on a list?” asked Teske. “This guy for the last 12 years has lived an ideal life, but his name continues to be on a list that serves no purpose for society.\n“What pisses me off,” Judge Teske said, “is many of the people (who are hard-liners concerning second chances) go to church and read the Scripture that says, ‘Forgive seven times 70 times.’ But they don’t live it. It’s hypocrisy.”\nMaybe someone will give the teachings of the Good Book a shot for this man named Paul, who, like the Apostle Paul, has undergone a life change on a “street called Straight.”","url":"https://www.ajc.com/news/local/torpy-large-when-old-crimes-kill-new-man-career-goals/0UVfHyn52XBAiHA2J33SuI/"}
