{"authors":[],"date_download":"2018-10-30 21:07:19","date_modify":"2018-10-30 21:07:19","date_publish":"2018-07-31 09:52:00","description":"Jury selection is scheduled to get underway Tuesday in federal court in Virginia in the criminal tri...","filename":"data/vaneerConsumption/CriminaltrialforPaulManafortsettobegininVirginiaManafortdr.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/03/22/Videos/3960629.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_criminal-tria_1fd4ef6c4975819ea336b631d38ad281__1540933639.html","title":"Criminal trial for Paul Manafort set to begin in Virginia; Manafort dr","title_page":"Criminal trial for Paul Manafort set to begin in Virginia; Manafort dr","title_rss":"NULL","source_domain":"ajc.com","text":"Jury selection is scheduled to get underway Tuesday in federal court in Virginia in the criminal trial of President Donald Trump’s former campaign manager Paul Manafort.\n>> Read more trending news\nManafort is charged with bank fraud, tax evasion, witness tampering and obstruction of justice\nHe’s also facing separate charges for not disclosing consulting work he did in Ukraine and is charged with money laundering and undisclosed foreign lobbying in federal court in Washington. The trial on those charges is expected to get underway in September.\n>> Related: Special counsel asks judge to revoke Paul Manafort’s house arrest over witness tampering\nManafort has maintained his innocence in both cases and has pleaded not guilty.\nMeanwhile, Manafort dropped a civil case against special counsel Robert Mueller on Monday. He withdrew his appeal of a judge’s decision to throw out his civil case against Mueller, according to CNN.\n>> Related: Paul Manafort's Russia ties: 5 things to know\nManafort first filed the suit against Mueller, the Department of Justice and Deputy Attorney General Rod Rosenstein in January, CNN reported, but in April, a federal judge dismissed the case. Manfort then appealed.","url":"https://www.ajc.com/news/national/criminal-trial-for-paul-manafort-set-begin-virginia-manafort-drops-civil-case-against-mueller/NM4L8qlQUM2Hg1RznWf1KL/"}
