{"authors":["Bob Price"],"date_download":"2018-10-30 19:06:18","date_modify":"2018-10-30 19:06:18","date_publish":"2017-03-30 16:08:00","description":"A Mexican national accused of assaulting an immigration deportation officer pleaded guilty to the charge in a San Antonio federal court.","filename":"data/vaneerConsumption/CriminalAlienPleadsGuiltytoAssaultingICEDeportationOfficer.json","image_url":"https://media.breitbart.com/media/2017/02/GettyImages-492659324.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_03_30__1540926378.html","title":"Criminal Alien Pleads Guilty to Assaulting ICE Deportation Officer","title_page":"Criminal Alien Pleads Guilty to Assaulting ICE Deportation Officer","title_rss":"NULL","source_domain":"breitbart.com","text":"A Mexican national accused of assaulting an immigration deportation officer pleaded guilty to the charge in a San Antonio federal court.\nHugo Baltazar-Ramirez, a 23-year-old Mexican national pleaded guilty to assaulting an Immigration and Customs Enforcement (ICE) Enforcement Removal Officer (ERO) during a targeted enforcement operation carried out in Austin, Texas, in February. The ERO officer received minor injuries but did not require hospitalization.\n“One ICE officer was injured in Austin, Texas, while he was arresting a criminal alien early in the morning of Feb. 10,” ICE spokesperson Adelina Pruneda said in a written statement sent to Breitbart Texas at the time of the incident. “The officer was treated and released from a local hospital.”\nCourt records obtained by Breitbart Texas from the Department of Justice’s Western District of Texas stated that Baltazar-Ramirez attempted to escape apprehension after the deportation officer placed him under arrest for being unlawfully present in the United States. The officer caught up with the man after about a 200-yard foot pursuit. The criminal complaint states that Baltazar-Ramirez then fought with the officer.\nDuring the struggle, the officer got one handcuff on the suspect but was unable to place the second hand in the restraint. Baltazar-Ramirez then got on top of the officer. He allegedly began striking the officer’s head against the ground several times, causing injury that would require medical attention.\nAbout this time, another arrived and assisted the deportation officer in gaining control of the suspect. Baltazar-Ramirez was placed in handcuffs.\nThe date for Baltazar-Ramirez’ sentencing hearing is currently pending. He faces a sentence of up to 20 years in prison, followed by deportation.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.","url":"https://www.breitbart.com/border/2017/03/30/criminal-alien-pleads-guilty-to-assaulting-ice-deportation-officer/"}
