{"authors":["Harry Slavin For Mailonline"],"date_download":"2018-10-23 01:48:28","date_modify":"2018-10-23 01:48:28","date_publish":"2017-04-26 12:29:09","description":"Real Madrid will face Deportivo La Coruna without Cristiano Ronaldo after the striker was left out of Zinedine Zidane's squad.","filename":"data/vaneerConsumption/CristianoRonaldooutofRealMadridsquadforDeportivo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9D97C000000578-0-image-a-11_1493205927579.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447354_Cristiano-Ronaldo-Real-Madrid-squad-Deportivo_1540259308.html","title":"Cristiano Ronaldo out of Real Madrid squad for Deportivo","title_page":"Cristiano Ronaldo out of Real Madrid squad for Deportivo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Real Madrid will face Deportivo La Coruna without Cristiano Ronaldo after the striker was left out of Zinedine Zidane's squad.\nLa Liga leaders Real make the trip to Estadio de Riazor with a heavily depleted squad, after Toni Kroos was also left in Madrid.\nWith Gareth Bale out for another three weeks after aggravating an ankle injury in the defeat to Barcelona on Sunday and Sergio Ramos suspended, Zidane will be forced to ring the changes as his side look for a return to the top of the table.\nCristiano Ronaldo has been left out of the Real Madrid squad to face Deportivo La Coruna\nIt is the third consecutive time that Ronaldo has been left at home for an away trip, with the 32-year-old also just one booking away from a domestic suspension.\nIncluded in the squad is Raphael Varane for the first time since the beginning of April, a welcome boost given the dearth of options Zidane currently has at centre back, with Pepe also sidelined with injury.\nRaphael Varane will make his return to the Real Madrid squad for their match on Wednesday\nThe defensive crisis has seen Castilla right back Alvaro Tejero called up to the squad as back up.\nMadrid lost their grip at the top of the table thanks to Lionel Messi's last-gasp winner at the Bernabeu on Sunday, with Barcelona leapfrogging their rivals based on their head-to-head record.\nZidane's side do have a game in hand over Luis Enrique's men, but travel to face a La Coruna side that has already beaten Barcelona at home this season.","url":"https://www.dailymail.co.uk/sport/football/article-4447354/Cristiano-Ronaldo-Real-Madrid-squad-Deportivo.html"}
