{"authors":["Will Martin"],"date_download":"2018-10-31 00:25:12","date_modify":"2018-10-31 00:25:12","date_publish":"2018-07-10 00:00:00","description":"Ronaldo was Real Madrid's top all-time goal scorer, with 451 goals since moving there in 2009. He has won five Ballons d'Or — the most prestigious individual trophy in world soccer — and is arguably the greatest player in the history of the sport.","filename":"data/vaneerConsumption/CristianoRonaldoJuventustransferconfirmedsendingsharesrocketing.json","image_url":"https://amp.businessinsider.com/images/5b3f347a70e2911e008b4aa9-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cristiano-ronaldo-juventus-transfer-shares-surge-2018-7_1540945512.html","title":"Cristiano Ronaldo Juventus transfer confirmed, sending shares rocketing","title_page":"    Cristiano Ronaldo Juventus transfer confirmed, sending shares rocketing - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images\nShares of Italy's most successful, best-known soccer team, Juventus, surged on Tuesday after it was confirmed that the side has signed Real Madrid superstar Cristiano Ronaldo for around 100 million euros ($117 million).\nSpanish news outlet La Sexta reported earlier that a deal for Ronaldo is now almost done, and Sky News said that Juventus' president, Andrea Agnelli, has flown to the Greek island of Kalamata — where Ronaldo is on holiday — to hold talks with the star. Ronaldo's move was then confirmed by Juventus later in the afternoon.\nRonaldo was Real Madrid's top all-time goal scorer, with 451 goals since moving there in 2009. He has won five Ballons d'Or — the most prestigious individual trophy in world soccer — and is arguably the greatest player in the history of the sport.\nNews of the developing transfer, which was first rumored last week, sent Juventus shares skyward. Once Ronaldo's transfer was confirmed, Juventus' Stuttgart traded shares rose by almost 40%, hitting €1.12, as the chart below shows:","url":"https://www.businessinsider.com/cristiano-ronaldo-juventus-transfer-shares-surge-2018-7"}
