{"authors":[],"date_download":"2018-10-23 04:27:13","date_modify":"2018-10-23 04:27:13","date_publish":"2016-01-29 20:15:26","description":"Two foreign journalists working in Burundi and arrested during a raid were released one day later on Friday, on the eve of a key Africa summit where the trou...","filename":"data/vaneerConsumption/CrisishitBurundifreestwoforeignjournalists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7cj-3bmscybNe842cce83474b5983bf2-742_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422273_Burundi-arrests-two-foreign-journalists_1540268833.html","title":"Crisis-hit Burundi frees two foreign journalists","title_page":"Crisis-hit Burundi frees two foreign journalists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crisis-hit Burundi frees two foreign journalists\nTwo foreign journalists working in Burundi and arrested during a raid were released one day later on Friday, on the eve of a key Africa summit where the troubled nation tops the agenda.\nThe journalists, Jean-Philippe Remy, Africa bureau chief for French daily Le Monde, and British photojournalist Phil Moore, were arrested on Thursday afternoon during a raid in which 15 others were also held, police said.\nBoth journalists have covered the region for years, winning several awards for their work. Their arrest sparked widespread condemnation from rights groups and diplomats.\nFrench journalist for Le Monde newspaper, Jean Philippe Remy (L) and freelance photographer Phil Moore speak with a foreign journalist in the hall outside the Prosecutor's office in Bujumbura on January 29, 2016\n\"They were released, no charges were brought against them,\" French ambassador Gerrit Van Rossum told AFP, but added they had not been given their equipment and notebooks back.\nFrench Foreign Minister Laurent Fabius welcomed the pair's release, stressing \"France's commitment to freedom of the press, in Burundi as in everywhere else.\"\nBurundi has been in crisis since April when President Pierre Nkurunziza ran for a controversial third term, sparking street protests, a failed coup, regular killings and a nascent rebellion.\nDespite Burundi's rejection, African leaders are expected to vote at AU headquarters in Ethiopia this weekend on sending 5,000 peacekeepers to Burundi, to end months of the violence the journalists were reporting on when arrested.\nThe Foreign Correspondents' Association of East Africa (FCAEA), who described the reporters as \"consummate professionals\", said that while their release was \"a big relief... the incident bodes ill for our work in Burundi.\"\nPolice said a mortar, a Kalashnikov rifle and pistols were seized in the raid in Nyakabiga, a Bujumbura suburb and anti-government protest hotspot.\nMoore, 34, has frequently worked for AFP and other international publications, winning widespread recognition for his photographs of conflicts in eastern Democratic Republic of Congo as well as Libya, Somalia and Syria.\nRemy, 49, has won several awards, including the 2013 Prix Bayeux-Calvados for his coverage of the war in Syria.\n- Mass graves -\nThe Burundi government has cracked down on the press, forcing independent media to shut down and driving some journalists into exile.\nAFP and RFI reporter Esdras Ndikumana, 54, was forced to seek refuge in Kenya in August after he was tortured by the National Intelligence Service (SNR) in Bujumbura.\nWhile the official theme of the African Union meeting is human rights, leaders from the 54-member bloc will once again confront a string of crises across the continent when they open two-day talks at AU headquarters in the Ethiopian capital on Saturday.\nLeaders, as well as UN chief Ban Ki-moon, are expected to open the summit around 11:00 am (0800 GMT), but Nkurunziza is not expected to attend.\nSince he won presidential elections in July, clashes between loyalists and the opposition have turned increasingly violent.\nThe UN has warned that Burundi risks a repeat of a 1993-2005 civil war, with some 400 dead since April and at least 230,000 people fleeing to neighbouring countries.\nOn Friday, rights group Amnesty International released satellite photos they said \"strongly indicate\" five mass graves of those killed during battles in the capital in December.\n\"These images suggest a deliberate effort by the authorities to cover up the extent of the killings by their security forces and to prevent the full truth from coming out,\" Amnesty's regional chief Muthoni Wanyeki said.\nBurundi ©Vincent LEFAI, Jean Michel CORNU (AFP)\nFrench journalist Jean-Philippe Remy (L) and British photojournalist Phil Moore ©Charly Triballeau, Phil Moore (AFP/File)\nBurundi has been in crisis since April when President Pierre Nkurunziza ran for a controversial third term, sparking street protests, a failed coup, regular killings and a nascent rebellion ©Griff Tapper (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422273/Burundi-arrests-two-foreign-journalists.html"}
