{"authors":["Jonathan Spencer For Mailonline"],"date_download":"2018-10-23 01:43:13","date_modify":"2018-10-23 01:43:13","date_publish":"2017-03-16 11:54:24","description":"They may be arch rivals in the world of football but Barcelona's Lionel Messi and Real Madrid's Cristiano Ronaldo have come together to make an appeal over the war in Syria.","filename":"data/vaneerConsumption/CristianoRonaldoandLionelMessiuniteoverSyriawar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53BE0A00000578-0-image-a-25_1489663737997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319734_Cristiano-Ronaldo-Lionel-Messi-unite-Syria-war_1540258993.html","title":"Cristiano Ronaldo and Lionel Messi unite over Syria war","title_page":"Cristiano Ronaldo and Lionel Messi unite over Syria war | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They may be rivals in the world of football but Lionel Messi and Cristiano Ronaldo have come together to make an appeal over the war in Syria.\nThe La Liga stars, who continuously battle with each other to be the best player in the world, have taken to their respective social media pages to post emotional messages to their huge followings.\nThe famous duo, who are both fathers, have called for peace in Syria and the protection of children who are suffering from the misery, violence and hunger in the country.\nLionel Messi joined his football rival by making a Syria war appeal on social media\nBarcelona star Messi, a UNICEF ambassador, took to his official Facebook page on Wednesday to post a heartfelt message, in which he admits he is 'heartbroken' by the devastating war that has now gone on for six years.\nHe captioned the post: 'A war day is too much. The children of Syria have been subjected to violence and cruelty for SIX years in a conflict that holds them hostage.\n'As a father and as a UNICEF's Ambassador I am heartbroken. Add your voice to UNICEF to demand the end of the war.'\nCristiano Ronaldo, with his son Cristiano Jnr, posted a message directed to the Syrian kids, such as Omar (inset)\nReal Madrid forward Ronaldo then followed suit on Instagram by writing a message, in which he spoke of children affected by the war.\nThe Portuguese international, who is seen posing with his son Cristiano Jnr, wrote on his official account: 'Today I think of Syrian kids like Omar* who drew his dream of being a barber. #SaveSyriasChildren.'\nIn December last year, Ronaldo made a generous donation to help fund emergency supplies in Aleppo, including food, clothing and medical care for families across Syria.","url":"https://www.dailymail.co.uk/sport/football/article-4319734/Cristiano-Ronaldo-Lionel-Messi-unite-Syria-war.html"}
