{"authors":[],"date_download":"2018-10-23 00:26:48","date_modify":"2018-10-23 00:26:48","date_publish":"2016-01-29 13:30:26","description":"A new draft charter meant to soothe Thailand's caustic political divisions was unveiled Friday but swiftly shot down by the toppled government who warned it ...","filename":"data/vaneerConsumption/CriticswarnnewdraftcharterwilldeepenThaicrisis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i0sf-3bmscybNe842cce83474b5608686-308_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422791_Critics-warn-new-draft-charter-deepen-Thai-crisis_1540254408.html","title":"Critics warn new draft charter will deepen Thai crisis","title_page":"Critics warn new draft charter will deepen Thai crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Critics warn new draft charter will deepen Thai crisis\nA new draft charter meant to soothe Thailand's caustic political divisions was unveiled Friday but swiftly shot down by the toppled government who warned it would only deepen the kingdom's crisis.\nThe draft is the junta's second stab at crafting a new constitution since former army chief Prayut Chan-O-Cha ousted an elected civilian government in May 2014.\nPrayut says he was forced into a coup to restore order following months of mass street protests.\nPrime Minister of Thailand General Prayut Chan-o-Cha's ruling junta says its new charter as the only way to clip the wings of powerful politicians and expunge corruption ©Don Emmert (AFP/File)\nThe junta touts its new charter as the only way to clip the wings of powerful politicians and expunge corruption.\nBut critics say it is a brazen attempt to limit the influence of billionaire ex-premier Thaksin Shinawatra whose populist parties have won all elections since 2001, unsettling the Bangkok-centric elite.\nThe junta's first effort at a charter was voted down by a military-appointed committee late last year, effectively starting the drafting process anew and postponing elections for over a year.\nAnalysts said that move was engineered to extend the military government's rule over Thailand, which has seen 12 successful army takeovers since absolute monarchy was abolished in 1932 and 20 constitution rewrites.\nThe next few weeks will be dedicated to gathering feedback on the fresh charter, drafting committee chairman Meechai Ruechupan told reporters.\n\"We are ready to reasonably adjust the constitution as it will be enforced for the entire nation to benefit the public,\" he said, launching the document.\n-'Lip service to democracy'-\nThe revised charter contains many of the same controversial points that saw the last draft voted down.\nA major sticking point among politicians of all stripes is a provision to allow for the parliament to choose an unelected prime minister to lead the country.\nThe draft wants to establish a proportional representation voting system, something the junta say will make every ballot count but large parties have balked at that provision fearing they may struggle to make a clear majority.\nCritics say other elements are openly anti-democratic, including a provision for a 200-member unelected senate.\nIn a statement rejecting the draft, the toppled Puea Thai Party said it hoped the junta is \"aware of the damage that will occur if the constitution is enacted\".\nThe party, whose leader Yingluck Shinawatra -- Thaksin's sister -- was removed by a court just before the coup and is now on trial warned the document may become \"the core cause of crisis in the future\".\nA finalised version of the charter is due to go to a referendum vote this August.\nBut political expression or gatherings remain banned in Thailand and it is unclear if opponents will be at all able to discuss their concerns.\n\"In some sense, the new document gives lip service to democracy while only enshrining a hollow variant of it,\" Paul Chambers, a Thailand-based academic, told AFP.\nThailand's nearly century-long struggle with democracy has seen 19 charters come and go, with power swinging back and forth between military rulers and quasi-democratic legislatures.\nPrayut this week said elections will be held in July 2017, irrespective of the outcome of referendum.\nSupporters of the Puea Thai Party, which says it hopes the junta is \"aware of the damage that will occur if the constitution is enacted\" ©Pornchai Kittiwongsakul (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422791/Critics-warn-new-draft-charter-deepen-Thai-crisis.html"}
