{"authors":["Neil Munro"],"date_download":"2018-10-30 19:02:46","date_modify":"2018-10-30 19:02:46","date_publish":"2017-01-24 04:42:40","description":"President Donald Trump’s deputies have yet to stop the Department of Homeland Security from printing more of President Obama’s work permits for younger illegals. | Politics","filename":"data/vaneerConsumption/CriticsTrumpsDeputiesBreakHisCheapLaborImmigrationPromiseonDayOne.json","image_url":"https://media.breitbart.com/media/2017/01/DACA-Joe-Raedle-Getty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_23__1540926166.html","title":"Critics: Trump's Deputies Break His Cheap-Labor Immigration Promise on Day One","title_page":"Critics: Trump's Deputies Break His Cheap-Labor Immigration Promise on Day One | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump’s deputies have yet to stop the Department of Homeland Security from printing more of President Obama’s work permits for younger illegals who claim they were brought into the United States when they were younger than 16.\nThis inaction is in violation of one of Trump’s most prominent campaign promises, and it also gives away bargaining power that Trump needs to make the GOP-led Congress implement his popular campaign promises on immigration reform, warns Mark Krikorian, head of the Center for Immigration Studies.\n“It is an explicit betrayal of a promise he made — Point number five in his Phoenix speech” on immigration policy, Krikorian told Breitbart News. “That is a red line they have crossed less than three days into their administration.”\nIn his August speech in Phoenix, Ariz., Trump promised to immediately stop Obama’s amnesty and work permit programs, saying:\nNumber Five: Cancel Unconstitutional Executive Orders & Enforce All Immigration Laws We will immediately terminate President Obama’s two illegal executive amnesties, in which he defied federal law and the Constitution to give amnesty to approximately five million illegal immigrants.\nThose popular promises to reform the nation’s cheap-labor economic strategy were vital to Trump’s destruction of the Democrats’ midwestern “blue-wall” on election day.\nTrump repeated his promises in his inauguration speech, saying, “We will follow two simple rules: Buy American and Hire American.”\nTrump’s media aides did not respond to emails from Breitbart.\nIn 2012, Obama announced his “Deferred Action for Childhood Arrival” decision and directed immigration officials to stop trying to repatriate illegals who claim they were brought into the country as children before June 2012. Some of the recipients are now aged 35.\nObama also ordered officials to actually give work permits to the younger illegals. Those DACA work permits allow the migrants to take jobs needed by millions of Americans who have fallen out of the job market since the 2008 crash. All told, Obama’s deputies have printed work permits for more than 750,000 of the foreigners, even though huge numbers of young Americans either lack jobs or are stuck in low paying, part-time jobs. Obama also minimized the repatriations of illegals, and dramatically increased the inflow of white-collar contract workers for jobs sought by young American graduates.\nObama’s DACA work permits are each valid for two years, and DHS officials are still refreshing expiring permits, as well as handing out new permits to new applicants.\nTrump’s campaign promise would have been very easy to keep, Krikorian said. His staff should have called the Department of Homeland Security in November to tell them to stop issuing new work permits for the DACA illegals as soon as Trump became president on Jan. 20, he said. “That’s all it would take,” he added.\nThat slow-motion policy would allow the current two-year permits to gradually expire, without the liberals’ “cartoon” vision of Trump suddenly cancelling the permits and quickly rounding up the migrants for deportation, he said.\nThe failure to act indicates that the Chamber of Commerce Republicans in Trump’s White House — led by Chief of Staff Reince Priebus — are pushing aside his populist campaign promises, Krikorian warned.\nThe failure to stop printing work permits for illegals also means that Trump is giving away bargaining power that he needs to make GOP and Democratic legislators fulfill his major immigration campaign promises, Krikorian said. For example, Trump should stop updating the DACA work permits until the Congress agrees to fully fund the border fence, to force employers to verify that each job applicant has the right to work and to cut legal immigration by ending the practice of giving Green Cards to the extended family members of recent immigrants, he said. Any deal that favors the DACA illegals should also end the so-called “Diversity Lottery” that brings in 50,000 legal immigrants each year, regardless of education or skills, he said.\n“I’m for giving Green Cards to the DACA [illegals], but we have to get something back” via a deal in Congress, Krikorian said.\nMoreover, a DACA deal will allow the Trump administration to strike a bigger deal that would provide Green Cards to most existing illegal immigrants in exchange for getting legislators to sharply cut annual legal immigration, Krikorian said. In August 2016, Trump also promised to cut the record rate of legal immigration down to prior historical levels.\nCurrently, the federal government annually awards Green Cards to roughly one million legal immigrants, and annually invites roughly one million foreign contract workers to stay in the United States for up to seven years. That business-boosting cheap labor policy hugely inflates the new labor supply by almost 50 percent each year, sharply cutting wages and salaries for the roughly four million young Americans who enter the workforce each year. In turn, that loss of jobs and wealth among Americans helps spur demand for illegal drugs.\nBut the failure of Trump’s deputies to immediately stop issuing new DACA work permits suggests that Priebus and his allies — including House Speaker Paul Ryan — are hustling him to make a border wall deal that would not reduce the annual inflow of cheap foreign labor into the United States, said Krikorian.\nLiberal blogger Mickey Kaus — who backs Trump’s immigration reform plans — also says Trump is giving up negotiating power with the cheap-labor establishment.\nSo Obama created 'facts on ground' re DACA decree. Trump scared 2 pull trigger 2 reverse. Weak negotiating position! https://t.co/pA2UseGHHk — Mickey Kaus (@kausmickey) January 23, 2017\nCurrently, establishment Republicans are willing to support some kind of wall if they can preserve the inflow of foreign labor, which also serves as additional customers for restaurants, retail stores, and property developers.\nIn recent statements, Ryan has repeatedly said that Trump has only asked him to complete the border wall. One of Ryan’s top deputies also made the same claim.\nThose Ryan statements indicate that he is still trying to preserve or even increase the annual inflow of white-collar and blue-collar foreign workers, which transfers roughly $500 billion a year from wages into profits and also reduces the high-tech investment in automation and robots that is needed to keep Americans’ wages rising in a low-wage global economy.\nIn January, for example, Ryan called for an amnesty-style immigration policy that would allow employers to hire an unlimited supply of cheap foreign workers instead of competing for the limited supply of Americans workers by offering them better pay and training:\nI think you have to secure the border. I think you have to have reforms that get people to come out of the shadows and get right with the law and get — and make sure that while you’re securing the border, you’re fixing what’s broken in the legal immigration system. I think we need to have an immigration system that is wired for what our economy needs … I think we should give visas based on what the economy needs.\nIf Trump is not careful, Ryan and Priebus may try to push him into that cheap-labor-forever deal later this year, Krikorian warned.\nThe pro-establishment deal may be called the “Group of Eight” or the “Collection of Eight,” mimicking the 2013 coalition dubbed the Gang of Eight,” Krikorian said. That 2013 deal — which was blocked by GOP primary voters — would have shifted even more of the nation’s annual income from workers to investors, according to the Congressional Budget Office.\nOn Jan. 22, Priebus suggested he wants the border-wall-for-cheap-labor exchange. “I think we’re going to work with the House and Senate leadership, as well as to get a long-term solution on that issue,” Priebus told Fox News Sunday. “I’m not going to make any commitments to you,” Priebus said.\nOn Jan. 23, White House spokesman Sean Spicer evaded reporters’ questions about the DACA work permits, saying:\nI think the president has been clear that he is going to prioritize the areas of dealing with the immigration system, both building the wall and making sure that we address people who are in this county illegally. First and foremost, the president’s been very, very clear that we need to direct agencies to focus on those who are in this country illegally and have a record, a criminal record or pose a threat to the American people. That’s where the priority is going to be.\n“That’s my fear [for 2017]… maybe [Trump] will formally amnesty the DACA [illegals] in exchange for nothing [from Congress], or in exchange for some phony border bill that he doesn’t need because the president has all the authority to do all the fencing or the wall on the border,” he said.\n“I’m afraid they’re going to use that [bad deal] as an excuse [for abandoning immigration labor reform, saying]—‘We’ve passed this border bill in exchange for giving Green Cards to the DACA [illegals] and now we’re moving on to the next thing,’” Krikorian said.\nHowever, Ryan and the GOP are worried about the voters’ bipartisan hostility to the cheap-labor programs. In December, Ryan cancelled a 2015 measure that he supported to let companies annually bring in 196,000 additional blue-collar contract workers via the H-2B visa program.\nFollow Neil Munro on Twitter @NeilMunroDC or email the author at NMunro@Breitbart.com","url":"https://www.breitbart.com/politics/2017/01/23/critics-trump-deputies-break-immigration-promise-day-one/"}
