{"authors":["Ali Waked"],"date_download":"2018-10-30 20:30:19","date_modify":"2018-10-30 20:30:19","date_publish":"2017-04-19 15:04:19","description":"Public calls are rising in Egypt for Al-Azhar to intervene and reform Islamic education after twin terror attacks targeted Coptic Christians.","filename":"data/vaneerConsumption/CriticsDemandEgyptsAlAzharInstitutionReformIslamicEducationFollowingCopticChurchSuicideBombings.json","image_url":"https://media.breitbart.com/media/2017/04/Coptic-Church-Bombings.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_19__1540931419.html","title":"Critics Demand Egypt’s Al-Azhar Institution Reform Islamic Education Following Coptic Church Suicide Bombings","title_page":"Critics Demand Egypt’s Al-Azhar Institution Reform Islamic Education Following Coptic Church Suicide Bombings","title_rss":"NULL","source_domain":"breitbart.com","text":"Public calls are on the rise in Egypt for Al-Azhar University, the most important religious institution in Egypt and the Sunni world, to reform Islamic education after twin terror attacks targeted Coptic Christian churches on Palm Sunday last week, killing dozens of worshipers and a number of security personnel.\nIntellectuals in the country claimed that Al-Azhar bears responsibility for the extremism that has taken hold of Egyptian society and as long as the institution refuses to change Islamic education curriculum, it will share responsibility for the spilling of Christian blood.\nThe Egyptian author known as Fatima Naout said, “Al-Azhar is indirectly liable for the murder of Copts in Egypt. Ideological terror is the driving force behind the terrorists.”\nNaout demanded that Al-Azhar “cleanse the curriculum, something that has never happened. Al-Azhar has kept all the content, including societal hostility against the Copts, even calls for violence. There are verses in the Quran that call for violence that were justified when they descended (on the prophet).”\nNaout called for these verses to be removed from educational materials, saying, “Until then, the blood of the Copts is on Al-Azhar’s hands.”\nNot all agreed with Naout however, and one social media user, Ahmed Alsayed, wrote angrily, “Have you heard about Sunday school and the material in these schools? Have you read the Bible and how it supports the murder of non-Christians, especially children? Will Sisi manage or will someone dare demand a religious Christian debate in the churches?”\nOthers on social media cursed the author and promised that God would do so as well.\nAhmed Moussa, a television presenter, said, “The president’s decision to appoint a supreme council to fight terror and extremism means the death of the Al-Azhar institution.”\nMoussa referred to the Egyptian president’s decision to appoint a supreme council to fight terrorism and extremism and to grant authority to the council for monitoring in all areas of life in Egypt.\nAccording to the senior journalist, “Al-Azhar failed to deal with the terror. As of today, there is no religious discourse in Egypt that deals with terror. The voice of the president was ended after he demanded reform in the religious discourse for three years and no one did anything. It looks like he’s tired and so, in my opinion, the decision regarding the council is the death of Al-Azhar. There won’t be any Al-Azhar left.”\nMoussa added that “all the attacks and the terrorists, including those in recent days – most are graduates of Al-Azhar and students of the institution. I’ll say it again: we need to blow up the contents and curricula of Al-Azhar. They are dividing Egypt, even between the Muslims themselves.”","url":"https://www.breitbart.com/middle-east/2017/04/19/critics-demand-egypts-al-azhar-institution-reform-islamic-education-following-coptic-church-suicide-bombings/"}
