{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 01:20:14","date_modify":"2018-10-23 01:20:14","date_publish":"2016-01-29 15:13:01","description":"A woman in central China has married her long-term boyfriend after people on a crowd-funding website paid for the ceremony. Zhang Yan is ill with Uremia and has spent all of her money on treatment.","filename":"data/vaneerConsumption/Criticallyillwomanwhospentherweddingmoneyontreatmenttiestheknot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1C7EB00000578-0-image-a-12_1454069943011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3422425_Heart-warming-moment-critically-ill-woman-spent-wedding-money-treatment-ties-knot-long-awaited-ceremony-funded-complete-strangers_1540257614.html","title":"Critically ill woman who spent her wedding money on treatment ties the knot","title_page":"Critically ill woman who spent her wedding money on treatment ties the knot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A seriously ill woman from central China was given her dream wedding yesterday after asking for help from complete strangers through social media.\nThe 25-year-old, named Zhang Yan, suffers from uremia, a condition that gradually leads to kidney failure, the People's Daily Online reports.\nShe decided to raise money via a crowdfunding group on WeChat, the equivalent to Twitter in China, after spending all of her and her long-term boyfriend's money on hospital treatment.\nGetting hitched: Zhang Yan and her boyfriend married in a church ceremony in Changde, China, yesterday\nUnwell: Zhang Yan has to travel to the hospital every three days for dialysis which has been a strain on funds\nBeautiful bride: A local photo studio gave a pre-wedding shoot for free to Zhang Yan and her boyfriend\nZhang Yan from Hunan province, met Li Jun, her husband-to-be at her cousin's wedding when she was 17. The pair instantly fell in love.\nIn 2008, they both moved to Huizhou, Guangdong for work however Zhang Yan soon became sick and was diagnosed with uremia.\nSince then she has gone to hospital every three days for dialysis.\nHer boyfriend borrowed 10,000 Yuan (£1,064) to buy a used van to enable her to get to hospital.\nAccording to reports, the pair have spent all of their money on her treatment and thought that their dreams of getting married were ruined.\nIt was then that she heard of the crowdfunding group on WeChat and uploaded her story there asking to raise 50,000 Yuan (£5,300).\nShe wrote: 'I'm not afraid of dying, or wish for a new liver, I only wish I have enough time to marry him. I fear of dying on the operating table not having married him'.\nPeople answered her plea, donating 16,000 yuan (£1,700) for her special day while a charity paid for the rest, according to a report on Hunan Red Net News.\nYesterday the pair married in a church surrounded by their families.\nThey were given a photo shoot for free by a local photo studio.\nGenerous public: The bride took to the crowdfunding website after spending all of her money on treatment\nBack in the hospital: Zhang Yan needs constant dialysis treatment as she suffers from uremia","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3422425/Heart-warming-moment-critically-ill-woman-spent-wedding-money-treatment-ties-knot-long-awaited-ceremony-funded-complete-strangers.html"}
