{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 01:40:52","date_modify":"2018-10-23 01:40:52","date_publish":"2016-01-28 16:09:15","description":"The brazen group, dressed in tracksuits with stockings over their heads, spent an unbelievable two hours outside the house in Weston Favell, Northampton before they were disturbed by dogs.","filename":"data/vaneerConsumption/CrooksturncctvcamerasTOWARDSthemselvesbeforebreakingintohouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB404500000578-0-image-a-89_1453994443438.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421173_Cocky-crooks-turn-security-cameras-breaking-house-family-dogs-scare-off_1540258852.html","title":"Crooks turn cctv cameras TOWARDS themselves before breaking into house","title_page":"Crooks turn cctv cameras TOWARDS themselves before breaking into house | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A trio of brazen crooks were caught on CCTV breaking into a family home after they appeared to turn the security camera on themselves.\nThe group, dressed in tracksuits with stockings over their heads, spent an unbelievable two hours outside the house before they were eventually disturbed by two large schnauzer dogs.\nThe men fled empty-handed but homeowner Sherie Wright, 47, was shocked when she viewed her CCTV camera the next morning and realised how long the gang had been in her garden.\nThe crooks appeared to turn the CCTV camera on themselves before breaking into the house in Northampton\nA burglar, who has a rucksack on his back, peers through a window using his hands to shield the glare from a security light\nIn the footage, one of the crooks can be seen using a torch to peer through a window of the family's £550,000 five-bedroom detached home in Weston Favell, Northampton.\nAnother then brazenly walks up to the camera and turns it to point towards the rest of the gang.\nA third burglar, who has a rucksack on his back, then peers through a window using his hands to shield the glare from a security light.\nOne of the gang also attempts to cover his eyes as he returns to move the camera for a second time.\nDressed in tracksuits with stockings over their heads, the men spent an unbelievable two hours outside house\nEventually the crooks flee the premises across the garden after being disturbed by the dogs.\nSherie was asleep in the house along with her husband Jeff, 49, and son Jaime, 21, when the burglars struck between midnight and 2am on January 19.\nThe family, who run two petrol stations, say they were terrified when they saw the burglars had been in their garden for so long before breaking in.\nSherie said: 'It has terrified us all beyond imagination.\nThe family say they were terrified when they saw the burglars had been in their garden for more than two hours\n'I just want to warn other people in the area that even if they think their property is safe with CCTV cameras this can still happen to you.\n'The CCTV shows they waited in the garden for an hour and 40 minutes until we went to sleep.\n'The dogs are our saviours really. I don't know what would have happened if it hadn't been for them.\n'They knew what they were doing. They were in the garden watching us while we were watching television.\nThe homeowner said the men popped a window pane by the back door and hid it in bushes in the garden\n'Then they stayed hidden in the garden for an hour until they saw us go to bed and broke in about 1.30am.\n'What they did was pop a window pane by the back door and hid it in bushes in the garden and got in that way.\n'My husband had come back downstairs because he couldn't sleep so was in the lounge when he saw the torch lights and realised someone was inside.\n'But we have two giant dogs so they heard them too and charged at them straight away.\nThe homeowner was in the lounge when he saw the torch lights and realised someone was inside the house\n'They quickly ran out and luckily for them they managed to shut the back door on their way out so the dogs couldn't chase them.\n'We have got eight cameras and floodlights everywhere and there is a giant dog bed outside so it is odd that they targeted us.\n'There have been a load of burglaries nearby but ours was the first caught on camera so the police were really happy.\n'Officers came out the next night to make sure we were okay and have been door to door but nobody has been arrested yet.'\nThe family say it was odd they were targeted because they have eight cameras and floodlights everywhere\nMrs Wright said nothing had been taken by the burglars but the incident had left the whole family feeling less safe in their own home.\nShe added: 'We don't have anything of great value in the house.\n'The police said there had been other burglaries in the same area that had been committed in a similar way.'\nNorthamptonshire Police are now appealing for anyone with information about the burglary to contact them or the anonymous charity Crimestoppers on 0800 555 111.","url":"https://www.dailymail.co.uk/news/article-3421173/Cocky-crooks-turn-security-cameras-breaking-house-family-dogs-scare-off.html"}
