{"authors":[],"date_download":"2018-10-22 20:58:34","date_modify":"2018-10-22 20:58:34","date_publish":"2014-06-03 19:13:03","description":"Thousands celebrated in Egypt's public squares after election results were officially announced.","filename":"data/vaneerConsumption/CrowdsCheerFormerArmyChiefsElectionVictoryinEgypt.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484901/pc-140603-egypt-election-mn-1415_153cd073a5aeb6adc8aa6a18f24fbfaa.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_crowds-cheer-former-army-chiefs-election-victory-egypt-n121551_1540241914.html","title":"Crowds Cheer Former Army Chief's Election Victory in Egypt","title_page":"Crowds Cheer Former Army Chief's Election Victory in Egypt","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nABOVE: Egyptians wave national flags as they celebrate in Cairo's Tahrir Square on Tuesday after election results were officially announced.\nEgypt's president-elect, the former army chief Abdel-Fattah el-Sissi, told Egyptians it is now \"time to work\" to rebuild the country after he was officially declared the landslide winner of last week's election.\nThousands celebrated in public squares around the country with cheers, fireworks and pro-military songs after the Election Commission officially announced el-Sissi's victory with nearly 97 percent of the vote in an election that it said saw a turnout of 47.45 percent.\nEl-Sissi is to be sworn in Sunday to replace Egypt's first democratically elected president, the Islamist Mohammed Morsi, whom the then-army chief ousted last summer. Since then, el-Sissi has ridden to power on the support of Egyptians craving stability after three years of turmoil, bolstered by a nationalist mania stoked by pro-military TV and newspapers. His supporters and the media have cheered the fierce crackdown on Morsi's supporters that has killed hundreds and arrested thousands the past 11 months.\n--The Associated Press","url":"https://www.nbcnews.com/news/world/crowds-cheer-former-army-chiefs-election-victory-egypt-n121551"}
