{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-22 20:56:40","date_modify":"2018-10-22 20:56:40","date_publish":"2016-01-29 04:56:03","description":"She's been largely under the radar since Christmas, but Princess Mary was back this morning, attending a New Year reception organised by the Women Deliver Committee in Copenhagen.","filename":"data/vaneerConsumption/CrownPrincessMarysparklesataWomenDeliverconferenceinDenmark.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AF040200000578-0-image-a-50_1454042764968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422107_Crown-Princess-Mary-looks-chic-sparkles-sequin-Women-Deliver-conference-Denmark_1540241800.html","title":"Crown Princess Mary sparkles at a Women Deliver conference in Denmark","title_page":"Crown Princess Mary sparkles at a Women Deliver conference in Denmark | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She posed for a photograph with the Danish soccer player, Nadia Nadim\nThe New Year reception was organised by the Women Deliver Committee\nShe’s been largely under the radar since enjoying a carefree holiday and well-deserved break in Australia over Christmas, but Princess Mary made a triumphant sartorial return to business this morning.\nThe glamorous Royal donned a sparkly top at the New Year reception organised by the Women Deliver Committee in Copenhagen.\nThe 43-year-old Australian-born princess, who will celebrate her 44th birthday next week, was straight back into work at the Committee, which is one of the largest global meetings that focus on the health, rights and well-being of girls and women.\nWomen Deliver: Princess Mary appeared today at a New Year reception in Copenhagen\nPrincess perfection: The princess paired a sparkly top with plain black trousers and left her hair loose\nRoyal duties: She posted for several photos ahead of the Women Deliver conference itself in May this year\nPairing black slimline trousers, with a sparkly long-sleeved black and silver sequin top, the down-to-earth princess stayed true to her stylish roots, adopting a chic and polished look with her glossy brunette hair worn neat and down.\nPrincess Mary appeared at the reception in Copenhagen this morning, ahead of the actual conference itself, which will take place between 16 and 19 May this year.\nMore than 5,000 global leaders are expected to participate in the event, including Melinda Gates, Dr Jim Yong Kim (the President of World Bank) and Mary herself.\nGreat style: The glamorous princess is passionate about charity work, and was last seen on January 16 presenting scholarships at the Organization for Heart Conditions on January 11\nPatron lady: Mary is to the Patron of the Women Deliver conference taking place in May this year\nMary is the Patron of the conference, supporting events which are close to her heart.\nHer passions for working with women and children are always at the forefront of her efforts, after she established her own organisation, The Mary Foundation, in 2007.\nWhile at the reception earlier this morning, Mary posed in several photos and also posed for a photograph with the Danish soccer player, Nadia Nadim.\nFellow guests: The event will also be attended by Melinda Gates and the President of the World Bank\nInternational stage: The Crown Princess is keen to represent Denmark on an international stage\nAs one of the busiest royals, it is hardly surprising that Mary is starting to make a return to her philanthropic duties.\nShe has worked tirelessly to prove her commitment to charity in the past, having played soccer in the rain with schoolchildren for the sake of children’s rights, fought for women’s equality and visited hospitals in Ethiopia.\nShe is also very keen to represent Denmark on the international stage.\nToday’s appearance showed the princess looking relaxed and healthy following the Christmas period. Let's hope we'll be seeing a lot more of Mary soon.","url":"https://www.dailymail.co.uk/femail/article-3422107/Crown-Princess-Mary-looks-chic-sparkles-sequin-Women-Deliver-conference-Denmark.html"}
