{"authors":["Kerry Mcdermott For Mailonline"],"date_download":"2018-10-23 02:45:15","date_modify":"2018-10-23 02:45:15","date_publish":"2017-04-26 13:59:57","description":"Crown Princess Victoria of Sweden was greeted at The Hague by the Dutch King Willem-Alexander today. She wore a vibrant blue dress that matched perfectly with her suede heels and envelope clutch.","filename":"data/vaneerConsumption/CrownPrincessVictoriaofSwedenatTheHague.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F55B100000578-0-image-a-23_1493211351812.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4447240_Crown-Princess-Victoria-Sweden-Hague_1540262715.html","title":"Crown Princess Victoria of Sweden at The Hague","title_page":"Crown Princess Victoria of Sweden at The Hague | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She may have been top to toe in blue, but Crown Princess Victoria of Sweden appeared anything but glum at an engagement in the Netherlands today.\nThe Swedish royal, 39, smiled as she was greeted by the Dutch King Willem-Alexander at The Hague, dressed in a vibrant blue dress with matching heels and clutch.\nEven Victoria's jewellery, a matching necklace and earring set that appeared to be sapphires, were the exact same shade as the rest of her striking outfit.\nCrown Princess Victoria of Sweden attended a ceremony to mark the 20th anniversary of the organisation for the prohibition of chemical weapons at The Hague\nEven her sparkling earrings - possibly sapphires - matched her blue dress and shoes perfectly\nKing Willem-Alexander greeted the Crown Princess warmly with a hug, as she arrived at The Hague for a ceremony to mark the 20th anniversary of the Organisation for the Prohibition of Chemical Weapons.\nWorld leaders gathered there today to urge all nations to join together to 'banish forever the evil of chemical weapons.\nAmbassadors from OPCW member nations joined the royals at the solemn ceremony today, which was led by UN chief Antonio Guterres.\nVictoria's blue suede shoes matched her dress and clutch exactly. The Crown Princess is seen posing for a snap with the Dutch King Willem-Alexander\nThe two royals embraced as Crown Princess Victoria arrived for the ceremony at The Hague\nHer vibrant blue dress had a flattering cowl neck and a demure knee length hem\nCrown Princess Victoria and King Willem-Alexander were joined by ambassadors for OPCW member nations in the Netherlands today\nThe Princess' visit to the Netherlands comes hot on the heels of a four day state visit to Tokyo, where she met Emperor Akihito and Empress Michiko.\nShe visited Japan without her husband Prince Daniel, in her capacity as advocate for the UN's Sustainable Development Goals.","url":"https://www.dailymail.co.uk/femail/article-4447240/Crown-Princess-Victoria-Sweden-Hague.html"}
