{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 02:09:52","date_modify":"2018-10-23 02:09:52","date_publish":"2016-01-28 16:58:15","description":"The teenager, who cannot be named for legal reasons, admitted hitting the elderly woman on a south London bus in an attack, shown, that has left the victim 'always looking over her shoulder'.","filename":"data/vaneerConsumption/Croydonpensioner87tellsofattackbyjailedschoolgirlfaredodger.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AAD16C00000578-0-image-a-6_1453997915697.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421256_Pensioner-87-tells-attack-schoolgirl-fare-dodger-left-traumatised-sleeps-lights-14-year-old-attacker-locked-four-months_1540260592.html","title":"Croydon pensioner, 87, tells of attack by jailed schoolgirl fare dodger","title_page":"Croydon pensioner, 87, tells of attack by jailed schoolgirl fare dodger | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 87-year-old punched in the face by a schoolgirl fare dodger has told a court how she can still see her attacker’s fist coming at her whenever she closes her eyes.\nThe youngster, a 14-year-old girl, was sentenced to four months in detention for the assault on the pensioner while on the 166 bus through Croydon last October.\nDuring a sentencing hearing at Croydon Youth Court today, the court heard that the victim, Marion Endecott, had been left 'changed' by the attack and was 'always looking over her shoulder'.\nReading her statement, Jonathan Efemini, prosecuting, said: 'I enjoyed using the buses, the independence they gave me, and I liked talking to the drivers.\nScroll down for video\nMarion Endecott is shown approaching the girl about not paying for a ticket in footage captured on the bus\n'Since I was attacked I am now so frightened.It has changed me. I am now always looking over my shoulder.\n'I am petrified of bumping into the girl who punched me. Even in my house, when I hear a creak, I get scared someone is there.'\nThe court heard that Ms Endecott was so traumatised by the event - which left her with painful bruising for almost a month - that she had to live with her daughter for two weeks.\n'When I shut my eyes, especially when I go to the bus stop where it happened, I see her fist coming towards me. It's frightening,' Mr Efemini read.\n'Sometimes I go to sleep with the lights on. I never used to, but I feel better with them on.'\nMr Efemini outlined how the defendant was with her careworker when she boarded the bus at in Coulsdon around 3.20pm on October 16.\nBut she didn't have the money to pay her fare and argued with the bus driver.\nMr Efemini said: 'She told her she was only two to three stops away from home. [The defendent] started laughing and she said 'it's not funny'.\n'In response to this [the defendant] is said to have punched her in the face. It was a rather hard punch that resulted in persisting injuries as well as bruising.\n'As a result of this she was taken to hospital. Now when she approaches a bus stop she is petrified. She is constantly looking at people's faces.'\nThe 14-year-old fled the scene and avoided arrest until police released CCTV of the attack. She was tracked down after the footage went viral and admitted common assault.\nThe victim suffered bruising and swelling to her left eye and was taken to St Helier Hospital for treatment.\nDistrict judge Peter Greenfield gave the defendant the maximum possible detention sentence for her age and said: 'This is very serious.\n'If the victim had fallen back it could have killed her. I cannot fathom this at all.\nThis is the shocking moment the 14-year-old schoolgirl, who cannot be named, punched the 87-year-old woman in the face on a bus in south London\nAnother woman then rushes to comfort the pensioner, who has just been struck by the 14-year-old girl\n'You clearly must have known the victim was older and vulnerable. It was a random attack on a clearly very vulnerable woman.'\nRaheema Jamal, mitigating, said the defendant, who lives in care and has a previous conviction for assault, had a troubled childhood which contributed to her actions.\nBut commenting on a police interview with the defendant, Judge Greenwood said: 'You seemed to apportion blame on the lady, which is incredible. She was an innocent victim.'\nThe judge sentenced the youngster to 16 weeks detention and training for common assault. She will spend half the time in detention before undergoing a rehabilitation programme.\nDuring the hearing, the defendant also pleaded guilty to a charge of criminal damage after throwing a table into a window at her home earlier this month.","url":"https://www.dailymail.co.uk/news/article-3421256/Pensioner-87-tells-attack-schoolgirl-fare-dodger-left-traumatised-sleeps-lights-14-year-old-attacker-locked-four-months.html"}
