{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 02:07:59","date_modify":"2018-10-23 02:07:59","date_publish":"2017-03-10 11:05:10","description":"Dozens of fashion-forward pooches were photographed as they arrived at the NEC in Birmingham for the second day of the internationally-renowned dog show.","filename":"data/vaneerConsumption/Crufts2017Day2Dogsarriveineyecatchingoutfits.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22420600000578-0-image-a-22_1489142992392.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300688_Dogs-arrive-day-two-Crufts_1540260479.html","title":"Crufts 2017 Day 2: Dogs arrive in eye-catching outfits","title_page":"Crufts 2017 Day 2: Dogs arrive in eye-catching outfits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They spend hours on their hair and push the boundaries in eye-catching outfits.\nBut members of this fashion pack do not spend their time sitting front row at catwalk shows. These trend-setters are all hopefuls at this year's Crufts competition.\nThe perfectly-coiffed pooches were photographed as they arrived at the NEC in Birmingham this morning for the second day of the internationally-renowned dog show.\nPoodles, pugs and long haired pekingeses were among the dogs spotted making their way into the arena, which showcases toy and utility breeds.\nA tiny Chinese crested dog proved good things come in small packages as it trotted down the pavement sporting a dashing gold and red embroidered coat with a white fluff trim. Others looked fetching in star-patterned and leopard-printed onesies.\nWhile many of the larger dogs were happy to stretch their legs, some of the smaller ones were carried and wheeled into the show ring in specially-made cases. One pug looked particularly smug as it was wheeled past in a floral basket with its name - Pickle - emblazoned across the front.\nWhile there are numerous competitions within the four-day show, the prize that every dog owner has their eye on is the title Best In Show. Last year it was bestowed on a fluffy Westie named Geordie Girl, who saw off more than 22,000 competitors to claim the historic title.\nTaking a walk on the wild side: One short-haired dog stays warm in a tiger-print onesie as it arrives for day two of Crufts\nLook at me! A Standard Poodle jumps up and surprises its owner as it is shown during the second day of Crufts\nPerfect pair: Two giant white poodles show off their impeccable behaviour as they walk into the arena side-by-side\nIt's all in a name: Posing in a gold and red embroidered coat, a Chinese crested dog shows off an Oriental-patterned jacket\nSmug pug: Pickle looked as proud as punch as she was wheeled into the show ground on her own custom-made basket\nMe first! A trio of Cavalier King Charles Spaniels bump into each other as they pull their owner towards the front door\nHitting the spot: A poodle puts its best fashion foot forward as it struts into the Birmingham NEC in a leopard-print onesie\nA bit of all white: Dogs of all shapes and sizes made sure their fur was looking at its best as they arrived for the competition\nRed carpet ready: Long-haired Yorkshire terriers with bows in their hair are hand carried inside by smartly-dressed men\nWatch where you're going! A couple of the contestants look like they are struggling to see with their hair styled over their eyes\nDouble trouble: Two bulldogs muscle their way into the arena for day two, which features working and toy dog breeds\nTeamwork: A woman proudly shows off her long-haired dog, left, while a poodle practises its tricks outside, right\nThree of a kind: A mini pack of Italian Greyhounds arrive together in colourful coats ready for day two of Crufts\nLong hair, don't care: This glamorous pair of Maltese dogs up the style stakes with matching sapphire blue bows\nPampered: A Yorkshire terrier has its game face on, left, and a Maltese dog has its hair in wraps ahead of the show, right\nThrice as nice: Handlers kneel next to their long-haired Yorkshire terriers as they show them on the second day of Crufts\nStrikingly similar: This man and his Shih Tzu pull the same face as he carries the dog around the show ring inside the arena\nShowtime! A long-haired Yorkshire terrier looks as pretty as a picture, left, and an exhausted bulldog takes a break, right\nStaring down the competition: Two Yorkshire terriers square off against each other as they prepare for the competition\nFinal touches: A dog obediently lifts his front leg for its handler as she makes sure the fur is absolutely perfect for the show\nPep talk: Two Spaniel type dogs look eagerly at their handler as they wait to compete on the second day of Crufts\nMane attraction: A standard poodle hits new heights with its hair as it poses for a close up at the annual dog show\nDancing queen: A poodle is brought up on its hind legs by its handler as they take a turn around the show ring","url":"https://www.dailymail.co.uk/femail/article-4300688/Dogs-arrive-day-two-Crufts.html"}
