{"authors":["Eyder Peralta"],"date_download":"2018-10-23 05:37:20","date_modify":"2018-10-23 05:37:20","date_publish":"2015-06-02 00:00:00","description":"The captain told local media the vessel sank after getting caught in a cyclone in China's Yangtze River. Few of the 458 on board are thought to have survived the incident.","filename":"data/vaneerConsumption/CruiseShipCapsizesInChinaLeavingHundredsUnaccountedFor.json","image_url":"https://media.npr.org/assets/img/2015/06/02/ap521877429345_wide-83f4c0ab16668c1a1eb8574f6ed38789cf99af53.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_06_02_411432733_cruise-ship-capsizes-in-china-leaving-hundreds-unaccounted-for_1540273040.html","title":"Cruise Ship Capsizes In China, Leaving Hundreds Unaccounted For","title_page":"Cruise Ship Capsizes In China, Leaving Hundreds Unaccounted For  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Cruise Ship Capsizes In China, Leaving Hundreds Unaccounted For\nEnlarge this image toggle caption Cheng Min/AP Cheng Min/AP\nUpdate, 12:40 a.m ET:\nThe death toll is at 18 early Wednesday in the sinking of a cruise ship on China's Yangtze River, Reuters reports, and the government has corrected the number of those rescued to 14, down from 15.\nChina's government-run CCTV reports that salvage ships are on hand to attempt to breach the hull of the ship. Hundreds of people are still unaccounted for 36 hours after the ship capsized.\nMore than 100 additional divers are scheduled to begin work at the site today, but storm weather, fast currents and fifty feet of water have made for challenging conditions for the rescuers, the Associated Press reports.\nOriginal post:\nAccording to The Associated Press, the vessel was carrying more than 400 people and authorities have rescued 15.\nThe AP reports:\n\"The cruise was from Nanjing to the southwestern city of Chongqing, and many of those aboard were elderly. \"Some of the survivors swam ashore, but others were rescued more than 12 hours after the ship went down, after search teams climbed aboard the upside-down hull and heard people calling out from within.\"\nThe official Xinhua News Agency reported that both the captain and the chief engineer of the ship have been rescued.\nThe agency said both of them \"claimed the ship sank quickly after being caught in a cyclone.\"\nThe Wall Street Journal reported:","url":"https://www.npr.org/sections/thetwo-way/2015/06/02/411432733/cruise-ship-capsizes-in-china-leaving-hundreds-unaccounted-for"}
