{"authors":["Staff Report"],"date_download":"2018-10-30 19:16:49","date_modify":"2018-10-30 19:16:49","date_publish":"2015-08-12 00:00:00","description":"A small group of protesters picketing Ted Cruz outside a downtown Little Rock restaurant Tuesday night were doused with water by the business' head chef and owner.","filename":"data/vaneerConsumption/CruzprotestersdousedwithwateroutsideCacherestaurant.json","image_url":"https://media.arkansasonline.com/img/photos/2015/08/12/splash_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_aug_12_cruz-prote_102e215f84e85efc688755a3b40680ce__page=5_1540927009.html","title":"Cruz protesters doused with water outside Cache restaurant","title_page":"Cruz protesters doused with water outside Cache restaurant","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The head chef and owner of Cache in downtown Little Rock poured a bucket of water on a small group of protesters Wednesday night, hitting one. Photo courtesy Stephanie Maxwell.\nA small group of protesters picketing Ted Cruz outside a downtown Little Rock restaurant Tuesday night were doused with water by the business' head chef and owner.\nAccording to a Little Rock Police Department report, James Bozeman told officers he and friends were protesting outside Cache, 425 President Clinton Ave., while Cruz and Arkansas Gov. Asa Hutchinson were inside.\n\"Bozeman advised during their peaceful protest someone inside the restaurant, on the balcony, poured a pitcher of water onto\" one of the protesters, police wrote in the report.\nThe report noted that the four protesters were unclear about who poured the water.\nArkansas Democrat-Gazette associate features editor Emily Van Zandt, who happened to be in the restaurant at the time with a group of reporters from the newspaper, said Cache executive chef and owner Payne Harding dumped the water from a champagne bucket while wearing his chef jacket bearing his name.\nHarding issued a statement Wednesday apologizing \"to James Ryan Bozeman along with every individual affected by the events that took place last evening.\"\n\"This was a heat of the moment action driven by frustration; these actions were in no way shape or form politically motivated,\" Harding said. \"Customers were having difficulty entering and exiting the restaurant and I thought it was causing a problem for my business. I did not know who the protesters were or what they were protesting. It was as simple as a poor decision that, given the opportunity to make again, I would obviously think about the consequences before I acted. Cache is, and will always be, an establishment that welcomes everyone. There is no excuse for my actions, and I sincerely apologize.\"\nJennifer Pierce, who was also in the group of picketers, said earlier that they were \"speaking with lawyers on legal action.\"\nOfficer Richard Hilgeman said police didn't make an arrest and planned no further action. He said the protesters could request prosecutors issue a warrant, though he noted that the report didn't even list a suspect.\n\"All we've got is that report,\" Hilgeman said. \"It's up to the prosecutor if they can press any charges. I wouldn't expect there to be warrants issued.\"","url":"https://www.arkansasonline.com/news/2015/aug/12/cruz-protesters-doused-water-outside-cache-restaur/?page=5"}
