{"authors":["Associated Press"],"date_download":"2018-10-23 03:33:09","date_modify":"2018-10-23 03:33:09","date_publish":"2016-01-29 18:27:34","description":"RINGSTED, Iowa (AP) — For Ted Cruz, the path to victory in Iowa doesn't run through Des Moines or Davenport or other voter-rich parts of this sprawling, larg...","filename":"data/vaneerConsumption/CruzheadstotinyIowatownstocomplete99countytrek.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:fe40319adafb48c39d71f399e523e386-3bmscybNe842cce83474b58bbb17-819_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422343_Cruz-heads-tiny-Iowa-towns-complete-99-county-trek_1540265589.html","title":"Cruz heads to tiny Iowa towns to complete 99-county trek","title_page":"Cruz heads to tiny Iowa towns to complete 99-county trek | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cruz heads to tiny Iowa towns to complete 99-county trek\nRINGSTED, Iowa (AP) — For Ted Cruz, the path to victory in Iowa doesn't run through Des Moines or Davenport or other voter-rich parts of this sprawling, largely rural state.\nInstead, it goes through out-of-the-way dots on the map like Ringsted — population 422 — situated closer to the Minnesota border than to Des Moines, a three-hour drive to the south.\nCruz began his final 14-stop, four-day blitz toward Monday's caucuses with a stop Friday at the 3 Generations Bar & Grill in Ringsted. From there he ventures on to Fenton — population 279 — followed by the relatively booming metropolises of Emmetsburg, Wilton and Wapello, each with populations somewhere between 2,000 and 4,000.\nRepublican presidential candidate Sen. Ted Cruz, R-Texas, answers a question during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nWhy is Cruz spending so much time so far away from where most people live?\nIt's called the \"full Grassley,\" in Iowa caucus-speak.\nIt refers to longtime Republican Sen. Chuck Grassley's annual trek to all 99 of the state's counties, something he's been doing religiously since 1981. It's no small feat in a state with 56,000 square miles to cover — roughly six times as much as New Hampshire, where the country's second contest is scheduled for Feb. 9.\nBut completing the \"full Grassley\" has become the ultimate challenge for many presidential candidates.\nThe effort can be hit or miss. Covering all of Iowa's 99 counties demands a lot of time and energy, with candidates having to travel hundreds of miles, often to remote areas with small crowds and sparse media coverage.\n\"I think it's great,\" said Joy Anderson, 47, who came from nearby Estherville, Iowa, to see Cruz in Ringsted. \"He's reaching out to small town America and out here in Iowa. That's what we want.\"\nSome have questioned Cruz's delay in tackling the Iowa challenge, which has ultimately drawn him away from population centers in the final hours leading up to the Feb. 1 contest.\n\"It's an unneeded distraction for his staff,\" said longtime Iowa strategist Eric Woolson, who mapped out Michele Bachmann's 99-county tour in 2012 and worked for Wisconsin Gov. Scott Walker's campaign this cycle.\n\"I would suspect if they could go back and do this again, they would have been more aggressive in getting those counties marked off the list in October, November or even early December.\"\nBut Woolson said he didn't think Cruz would be hurt too much by having to wrap it up so late because, as one of the front-runners, he will get coverage no matter where he is.\nThe Texas senator is embracing an old-school campaigning style in Iowa. Unlike rival Donald Trump, who flies in and out and holds massive rallies drawing thousands, Cruz is content to meet with anywhere from a few dozen people to several hundred. He's visited Pizza Ranches — a trademark Iowa campaign stop — and stopped by small-town diners, coffee shops and church basements that form the fabric of the vast Iowa landscape.\nCruz contrasts his dedication to visiting every corner of the state with Trump's approach.\n\"What we're doing is what we've been doing from the very beginning,\" Cruz told reporters before a campaign stop Tuesday at Bogie's Steakhouse in Albia, Iowa — population 3,800. \"Doing town halls, doing retail meetings, just looking in the eyes of the men and women across Iowa asking for their support, asking for them to stand with us on caucus night. I believe the only way to win the state of Iowa is to go and ask, one on one, for the support of the grass roots.\"\nMany have tried the \"full Grassley\" approach and failed.\nWalker only got about a third of the way through before his campaign imploded in September. Louisiana Gov. Bobby Jindal and former Texas Gov. Rick Perry — the latter is now campaigning with Cruz — both ended their campaigns before completing it.\nFormer Pennsylvania Sen. Rick Santorum hit up all 99 Iowa counties by September, revisiting the 2012 strategy that earned him a win in Iowa. This time around, being a road warrior hasn't proven as successful for Santorum. He is mired at the bottom of the polls and was relegated to the undercard debate in Des Moines on Thursday night.\nBut Cruz sees it as a winning strategy.\n\"I don't believe Iowa can be won from a Manhattan TV studio or a D.C. TV studio,\" Cruz said Tuesday in a dig at Trump. \"It has to be won on the ground.\"\nCruz is slated to complete his 99th county when he visits Jefferson on Monday afternoon, just hours before the caucuses, when he will see if the strategy paid off.\n___\nFollow Scott Bauer on Twitter at http://twitter.com/sbauerAP and find more of his work at http://bigstory.ap.org/content/scott-bauer","url":"https://www.dailymail.co.uk/wires/ap/article-3422343/Cruz-heads-tiny-Iowa-towns-complete-99-county-trek.html"}
