{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:46:01","date_modify":"2018-10-30 21:46:01","date_publish":"2015-06-24 15:35:48","description":"Even though Republicans won a majority of Congressional seats in 2014, Cruz says powerful career politicians and lobbyists make up “The Washington Cartel” because they benefit from big government at the expense of everyday Americans. |","filename":"data/vaneerConsumption/CruzVersusTeamBoehnerObamaSlamsWashingtonCartelonObamatradeandExImportBank.json","image_url":"https://media.breitbart.com/media/2015/03/ted-cruz-pointing-flag-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_24__1540935961.html","title":"Cruz Versus Team Boehner-Obama: Slams 'Washington Cartel' on Obamatrade and Ex-Import Bank","title_page":"Cruz Versus Team Boehner-Obama: Slams 'Washington Cartel' on Obamatrade and Ex-Import Bank | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP presidential candidate Sen. Ted Cruz (R-TX) says he supports free trade, but is tired of secret, back room deals being used to promote President Obama’s trade deals, specifically calling out shameful actions by House leadership.\n“This seems to be an all too common trend in Washington that whatever is happening corrupt backroom deals dominate the end product,” Cruz said at the Heritage Foundation Wednesday morning, discussing the secrecy surrounding the TPA and trade debate.\nThe Senate is scheduled as early as Wednesday to hold its final vote on the controversial Trade Promotion Authority (TPA) bill that gives President Obama fast track trade authority to finalize his trade deals without Congressional amendments, only an up or down vote on the final deal.\nEven though Republicans won a majority of Congressional seats in 2014, Cruz says powerful career politicians and lobbyists make up “The Washington Cartel” because they benefit from big government at the expense of everyday Americans.\nCruz said career politicians open up their wallets in corrupt backroom deals that result in one interest group getting advantage over another, and the Washington Cartel shuns those who don’t oblige:\nJust this week we saw a shameful example of this, as House leadership threw Representative Mark Meadows out of his chairmanship because of his principled objection to TPA. Just this morning news broke that leadership is now seeking to strip Ken Buck –another conservative in the House – of his leadership position. Why is it that Republican leadership always always always cut deals with the Democrats and with Washington and throws overboard the conservatives that come October and November an election year they are desperately asking to turn out and elect them in power.\n“No taxation without Representation?” Cruz mocked, asking how the elected Representatives in Washington actually represent the men and women back home they are supposed to be working for.\nCruz said the Ex-Im Bank should expire, to help end the gravy train for Washington lobbyists. He also discussed renewable energy mandates, saying they raise the cost for American families and job creators, destroying the free market. Cruz said bakers and restaurants are being forced to pay more for sugar and to undercut competition. He addressed the fact that a majority of Americans don’t want to tax the internet saying America must keep the internet free and keep government hands off the internet.\n“This freedom thing is very very scary for Washington,” Cruz said.\nHe added, “It is time to break The Washington Cartel.” He is calling for politicians to stand with the people. “Americans across this country rise up,” Cruz said, calling for Americans to engage on the issues and bring back the voice of the people.\n“The rich and well connected keep getting more and more favors at the behest of hard working Americans and we’ve got to stop this,” Cruz said, adding big government benefits big business, small government benefits small business.","url":"https://www.breitbart.com/politics/2015/06/24/cruz-versus-team-boehner-obama-slams-washington-cartel-on-obamatrade-and-ex-import-bank/"}
