{"authors":[],"date_download":"2018-10-30 14:31:08","date_modify":"2018-10-30 14:31:08","date_publish":"2015-07-25 00:00:00","description":null,"filename":"data/vaneerConsumption/CruztoMcConnellYoulie.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_cruz_to_mcconnell_you_lie_1540909868.html","title":"Cruz to McConnell: 'You lie!'","title_page":"Cruz to McConnell: 'You lie!'","title_rss":"NULL","source_domain":"americanthinker.com","text":"Senator Ted Cruz , the sometimes-incendiary Texan running for the Republican presidential nomination, took to the Senate floor on Friday to call his party’s majority leader a liar in an extraordinary public airing of grievance.\nRemember when Congressman Joe Wilson yelled, \"You lie!\" to Obama at the State of the Union address? That was the first time a Republican had confronted Obama directly about his falsehoods. Now Ted Cruz has taken a similar step, saying that Senate majority leader Mitch McConnell lied to him when McConnell said that he would let the Export-Import Bank die.\nMr. Cruz said allowing that vote on the measure, which will almost certainly pass, was “an absolute demonstration that not only what he told every Republican senator, but what he told the press over and over and over again, was a simple lie.” He detailed what he said was a closed-door confrontation he had with Mr. McConnell in May, after supporters of the Export-Import Bank tried to derail a trade bill unless they were promised a vote to keep the bank open. “It was a direct question I asked the majority leader in front of all the Republican senators,” he said. He said that Mr. McConnell had been “visibly angry” and that “like St. Peter,” the majority leader had offered a denial three times: “There is no deal, there is no deal, there is no deal.” “The Republican leader is behaving like the senior senator from Nevada,” Mr. Cruz said, accusing Mr. McConnell of running the Senate the same way his predecessor, Senator Harry Reid, Democrat of Nevada, operated.\nNone of this will be surprising to readers of this site. The Export-Import Bank is all about subsidies to big business, and McConnell represents the agenda of big business, whether it's supporting subsidies, amnesty, or even Obamacare. In vote after vote, he had supported the Obama agenda even while rhetorically speaking the opposite and holding phony votes that have no meaning because they aren't tied to budgetary appropriations.\nMy question is, where do the other candidates stand on this? Rand Paul is McConnell's BFF, even allegedly working with McConnell to cover up Obamacare fraud. (Think I'm exaggerating? Read the linked article.) Marco Rubio has been silent on the Republican collusion and corruption on Capitol Hill. Haven't heard Scott Walker or any of the other candidates talk about this. Maybe they don't think it's a problem.\nWhat do you think?\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/cruz_to_mcconnell_you_lie.html"}
