{"authors":["Sportsmail Reporter"],"date_download":"2018-10-23 00:09:19","date_modify":"2018-10-23 00:09:19","date_publish":"2016-01-29 12:54:23","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/CrystalPalacevsStokeTeamnewskickofftimeprobablelineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1013A00000578-0-image-a-52_1454072012502.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422733_Crystal-Palace-vs-Stoke-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash_1540253359.html","title":"Crystal Palace vs Stoke: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash","title_page":"Crystal Palace vs Stoke: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Stoke's trip to Crystal Palace.\nTeam news\nCrystal Palace\nAlan Pardew will not start Crystal Palace's new signing Emmanuel Adebayor in their FA Cup fourth-round fixture at home to Stoke, believing the striker to be short of match fitness.\nAdebayor is likely to be on the bench, while Connor Wickham is suspended for the next three games after being found guilty of violent conduct by the FA following an incident with Jan Vertonghen in their recent 3-1 defeat by Tottenham.\nDwight Gayle has, however, returned to contention, strengthening Pardew's attacking options which had already been undermined by hamstring and knee injuries to Bakary Sako and Yannick Bolasie.\nProvisional squad: Adebayor, Cabaye, Campbell, Chamakh, Dann, Delaney, Gayle, Hangeland, Hennessey, Jedinak, Kelly, Ledley, Lee, Mariappa, McArthur, McCarthy, Mutch, Puncheon, Souare, Speroni, Ward, Zaha.\nEmmanuel Adebayor could make his debut for Crystal Palace against Stoke\nStoke City\nMark Hughes is set to ring the changes, but will not be able to call upon midfielder Charlie Adam.\nAdam, on as a substitute and then off again shortly after in Tuesday's Capital One Cup clash with Liverpool having sustained a calf tear, has been ruled out for up to six weeks. Geoff Cameron (ankle) and Ryan Shawcross (back) are also on the sidelines.\nThe likes of Mame Biram Diouf, Phil Bardsley and Jakob Haugaard are expected to come into the team, while Marko Arnautovic is being assessed after he limped off on Tuesday as well.\nProvisional squad: Butland, Haugaard, Wollscheid, Wilson, Muniesa, Johnson, Pieters, Bardsley, Whelan, Van Ginkel, Ireland, Arnautovic, Afellay, Bojan, Shaqiri, Walters, Diouf, Joselu, Crouch, Odemwingie\nMark Hughes is set to ring the changes, but will not be able to call upon midfielder Charlie Adam\nKey match stats (supplied by Opta)\nThese two sides have been drawn together twice, with the Potters progressing on both occasions (1989 and 2013), with the most recent encounter going to a replay.\nCRYSTAL PALACE v STOKE Kick-off: Saturday, 3pm Odds (subject to change): Crystal Palace: 23/20 Draw: 11/5 Stoke: 3/1 Referee: Mark Clattenburg Managers: Alan Pardew (Crystal Palace, Mar Hughes (Stoke)\nPalace have beaten Stoke in three of their last four meetings (D1), including an 88th minute winner from Lee Chung-Yong in a 2-1 league victory at the Britannia in December.\nThis is the fourth FA Cup game in a row that Crystal Palace are facing Premier League opposition. They’ve won two of the previous three, losing out to Liverpool in the fifth round last season.\nStoke have lost their last four all Premier League FA Cup ties, last beating Bolton 5-0 in the 2011 semi-final.","url":"https://www.dailymail.co.uk/sport/football/article-3422733/Crystal-Palace-vs-Stoke-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash.html"}
