{"authors":["Press Association Reporter"],"date_download":"2018-10-23 01:01:17","date_modify":"2018-10-23 01:01:17","date_publish":"2016-01-11 11:28:41","description":"Crystal Palace assistant manager Keith Millen has warned his players not to give a wounded Aston Villa any encouragement in their Barclays Premier League clash on Tuesday night.","filename":"data/vaneerConsumption/CrystalPalaceplayerswarnednottoletupagainststrugglingAstonVillaside.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/2FF2BA5500000578-0-image-a-10_1452511661529.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393753_Crystal-Palace-players-warned-not-let-against-struggling-Aston-Villa-side_1540256477.html","title":"Crystal Palace players warned not to let up against struggling Aston Villa side","title_page":"Crystal Palace players warned not to let up against struggling Aston Villa side | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crystal Palace assistant manager Keith Millen has warned his players not to give a wounded Aston Villa any encouragement in their Barclays Premier League clash on Tuesday night.\nVilla are rooted to the bottom of the table with eight points from 20 games and are without a league win since the opening day of the campaign.\nAnd their miserable season took another turn for the worse on Saturday when they were held by League Two Wycombe in the third round of the FA Cup.\nAston Villa have not won in the Premier League since the opening day of the season\nCaptain Micah Richards was seen confronting a section of angry Villa supporters after the 1-1 draw, while a video later emerged of the players and staff being taunted by some fans as they boarded the team bus after the match.\nPalace are next up for Remi Garde's men on Tuesday night and Millen wants the Eagles to ensure the home fans have nothing to get excited about at Villa Park.\n'We need to get off to a good start and if there is a volatile atmosphere there we don't want to give them any sort of encouragement to get behind the Aston Villa team,' Millen said.\n'Fair enough to Micah Richards to brave the fans and try and explain the situation to them. I don't know what was said but he is certainly passionate about Aston Villa and what is going on and it is hurting him.\nRemi Garde has come under pressure after struggling since replacing Tim Sherwood\n'The main thing from the fans' point of view is that they want to see the players going out there fighting for the cause of the club and they have got every right to express their feelings.\n'They are under pressure and they desperately need a win. We have been there at the bottom of the league but fortunately managed to get ourselves out of it so we know what that pressure is like.\n'You are looking for something in the game to cling on to - whether it is the first goal or something to get the crowd involved - so we have to make sure we are ready for the start of the game.'\nIn contrast to Villa, Palace are seventh in the table, and after three games without a league victory over the festive period they returned to winning ways on Saturday with a 2-1 victory at Southampton in the FA Cup.\nCrystal Palace hope to take advantage of Aston Villa's plight when they visit on Tuesday\n'We were pleased we didn't get a a replay from Saturday's game,' added Millen, who was deputising for manager Alan Pardew in Monday's pre-match press conference.\n'The FA Cup is a massive competition and we put a full-strength team out and luckily we got a result.\n'When you look at Aston Villa tomorrow, the manager will pick a team he thinks will win the game, and then you move on to the next match which is against Manchester City at the weekend, so it is not an easy week but we are in a good place.'","url":"https://www.dailymail.co.uk/sport/football/article-3393753/Crystal-Palace-players-warned-not-let-against-struggling-Aston-Villa-side.html"}
