{"authors":["Frances Martel"],"date_download":"2018-10-30 19:31:07","date_modify":"2018-10-30 19:31:07","date_publish":"2016-04-06 00:40:31","description":"The legal firm data leak known as the Panama Papers show Venezuela used Cuban money to purchase advanced passport technology from Germany.","filename":"data/vaneerConsumption/CubaFundedVenezuelanPassports.json","image_url":"https://media.breitbart.com/media/2015/12/Hezbollah-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_05__1540927867.html","title":"Cuba Funded Venezuelan Passports","title_page":"Panama Papers: Cuba Funded Venezuelan Passports","title_rss":"NULL","source_domain":"breitbart.com","text":"The massive legal firm data leak known as the Panama Papers have exposed business dealings that allowed the government of Venezuela under Hugo Chávez to use Cuban money to purchase advanced passport technology from Germany. Venezuela would later be accused of falsifying passports for Hezbollah terrorists.\nThe revelation surfaced as part of the 11.5 million documents leaked to the German newspaper Süddeutsche Zeitung from the Panamanian law firm Mossack Fonseca, later handed over for aid in analysis to a number of journalistic outlets, most prominently the International Consortium of Investigative Journalists (ICIJ). The ICIJ has set up a website to help parse the information in these documents, and one website specifically for the revelations surfacing on the government of Venezuela.\nIt is there that the ICIJ has revealed in a Spanish-language report that Mossack Fonseca helped the governments of Cuba and Venezuela establish a shell corporation to engage a German technology company to buy state-of-the-art passport printing technology.\nAccording to the report, late dictator Hugo Chávez established a project in 2005 to update the Venezuelan passport system, which would first require identifying a seller of the appropriate technology to approach. Venezuela, then as now, enjoying patronage from the government in Havana, would use Cuban money to buy the new technology. This made the purchase much more difficult, as few respectable corporations would feel comfortable doing business with the communist dictatorship.\nVenezuela found a vendor: the German company Bundesdrukerei. In an email surfacing as part of the Panama Papers, a representative of that corporation makes clear: “the fundamental reason why this company does not want to sell to Cuba and Venezuela directly is because of the reputational issue. They fear their competition will create adversarial propaganda against them for selling to totalitarian governments.”\nMossack Fonseca then stepped in to design an elaborate currency exchange system to disassociate Cuba with the funding, a system known in Latin America as a “financial bicycle,” because the money is peddled through so many different currencies as to render its origins barely recognizable. Many corporations use this system to generate income, switching into cheaper currencies with higher interest rates and waiting for the money to grow before returning the money to its original form. In this case, Mossack Fonseca cycled the money through the currencies of at least four countries in addition to Cuba and Venezuela, then put the money in a shell corporation: Billingsley Global Corp. Billingsley bought the technology after receiving an influx of 64 million euros.\nVenezuela got its passports, and Cuba retained the right to access and control the software that creates the passports.\nLike most of the known revelations in the Pentagon Papers, this exchange is of questionable legality at worst, completely acceptable for a global banking lawyer at best. What makes this particular discovery notable is the years of evidence mounting that Venezuela and Cuba used the Venezuelan passport system to fabricate false documents for Hezbollah terrorists.\nA 2015 report estimated that the government of Venezuela has issued over 500 passports to members of the Shiite terrorist group Hezbollah. The terrorists would then use the passports to travel more freely through the Western Hemisphere, as their real identities and nationalities would trigger more thorough investigations into their backgrounds. Spanish reporter Emili Blasco found evidence that current Venezuelan strongman Nicolás Maduro met with Hezbollah leader Hassan Nasrallah in 2007 to discuss an agreement for distributing the fake passports.\nA former diplomat in Venezuela’s Baghdad embassy, Misael López Soto, testified before fleeing the embassy in a video posted online that he was forced to flee after receiving multiple death threats for attempting to notify Caracas that his embassy was distributing dozens of falsified birth certificates, passports, and other government documents to known members of Hezbollah. The terrorists would pay between $5000 and S15000 for each document.\nA report in February at the UK-based Asharq Al-Awsat cited a former Venezuelan diplomat as alleging that a “Cuban company” had made an agreement with Venezuela to issue the contracts. No details were provided, but such an agreement fits the Panama Papers description of the incident.\nThe governments of either nation have yet to remark on this particular allegation.","url":"https://www.breitbart.com/national-security/2016/04/05/panama-papers-venezuela-cuba-conspired-passports/"}
