{"authors":["Frances Martel"],"date_download":"2018-10-30 19:20:37","date_modify":"2018-10-30 19:20:37","date_publish":"2017-02-18 01:59:28","description":"A Cuban artist known as \"El Sexto\" testified before the U.S. Senate Thurs., urging America to pressure the Cuba into respecting human rights.","filename":"data/vaneerConsumption/CubanAntiCommunistArtistElSextoinWashingtonPressureRalCastro.json","image_url":"https://media.breitbart.com/media/2016/12/Danilo-Maldonado-el-sexto-artist-cuba-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_02_17__1540927237.html","title":"Cuban Anti-Communist Artist 'El Sexto' in Washington: 'Pressure Raúl Castro'","title_page":"Cuban Anti-Communist Artist 'El Sexto' in Washington: 'Pressure Raúl Castro' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Danilo Maldonado Machado, a Cuban artist known as “El Sexto” — who has served four prison sentences for anti-communist artwork — testified before the U.S. Senate Thursday, urging the American people and their lawmakers to pressure the communist regime into respecting human rights.\n“I ask the people and the government of the United States to pressure Raul Castro’s regime to release the thousands of political prisoners existent in my country,” Maldonado told the Senate Subcommittee on Western Hemisphere, Transnational Crime, Civilian Security, Democracy, Human Rights, and Global Women’s Issues Thursday. According to the artist, “at least 85% of the present prison population would be considered innocent in any democratic country and would have never been sent to prison.”\nAs recently as one month ago, Maldonado was one of those unjustly imprisoned. He told his story to the subcommittee: “I am 33 years old and have already served four sentences only because I have criticized the Cuban dictatorship through my art,” he explained. His most recent arrest followed the death of longtime tyrant Fidel Castro. Maldonado took to the streets of Havana to celebrate his death, spray-painting the words “he’s gone” (“se fue“) onto a wall and publishing a Facebook live video celebrating.\n“I walked about a mile, took transportation to the other side of the city, and walked for a while celebrating until my video, that went viral on social media, was transmitted live as the only celebratory event in the city of Havana, and on the island,” he told the Senate.\nDuring his arrest, he detailed, “my jailers tried to terrorize me by threatening that, at any time, they could take me to the yard to execute me by firing squad.”\n“I was very worried by this because I knew that could easily happen given the record of the hundreds if not thousands of political prisoners executed by the dictatorship,” he noted. Scholars have documented at least 3,600 executions by firing squad during the Fidel Castro era and thousands of others have been killed and “disappeared” for counterrevolutionary activities.\nMaldonado did not only tell his personal story to the subcommittee but took the opportunity to address the greater damaging effects of continuing to allow the Castro regime to continue in power. He noted that the Cuban Constitution, written by the Communist Party, forbids art “contrary to the Revolution.” The Castro brothers, he added, “contributed high numbers of mercenaries and arms to the wars in Angola, Ethiopia, under the command of the Russian Army, the FARC in Colombia, and guerrillas in Venezuela in the 60s and in last two decades have supported the dictatorial Chavista regime” in Venezuela.\nEl Sexto habla ante el Senado EEUU by yusnaby\nMaldonado flew to Miami shortly after his release in late January. He served 55 days in prison for “vandalizing” public property with his “he’s gone” graffiti, a crime typically punished with a 27-peso fine. Before his current prison sentence, Maldonado spent ten months in prison for writing the names of the Castro brothers on two pigs as part of an art project honoring George Orwell’s Animal Farm.\nHe is currently on a media tour detailing his story and advocating for the human rights of those on the island. As a child, he told the Miami Herald, he endured the suffering common of the “Special Period,” when Castro could not longer rely on the now-defunct Soviet Union to keep his government afloat. “Sometimes we didn’t even have 50 cents to buy the milk,” he told the newspaper. “My rebellion against poverty and oppression started then.”\nMaldonado will appear later this month at the Geneva Summit for Human Rights and Democracy, speaking to the United Nations Human Rights Council about his personal ordeal.\nWhile the Cuban government freed Maldonado after receiving formidable pressure from international groups to do so, they did not release Eduardo Cardet, the other Cuban dissident arrested in the aftermath of Fidel Castro’s death. Cardet, of the anti-communist Christian Libertation Movement (MCL), was beaten and whisked away to prison in front of his young children. While initial reports claimed he had publicly expressed joy at Fidel Castro’s death, his wife — present during the arrest — has denied this. Cardet is facing three years in prison for allegedly attempting to attack a police officer, a charge Amnesty International confirms as baseless.\nMaldonado’s appearance in Washington follows that of Lilian Tintori, wife of Venezuelan political prisoner Leopoldo López. Venezuela’s socialist government counts Cuba as its firmest ally and has implemented similarly draconian measures to silence anti-leftist dissent. President Donald Trump received Tintori at the Oval Office on Senator Marco Rubio’s request and issued a demand for Venezuela to release her husband.\nTrump later discussed his dinner with Senator Rubio, where the two reportedly shared their views on oppression in Cuba. “We had a very good discussion on Cuba,” the president said, “because we have very similar ideas towards Cuba.”","url":"https://www.breitbart.com/national-security/2017/02/17/cuban-anti-communist-artist-el-sexto-testifies-senate/"}
