{"authors":[],"date_download":"2018-10-30 22:27:27","date_modify":"2018-10-30 22:27:27","date_publish":"2018-09-05 20:57:55","description":"CBN News recently interviewed Academy Award-winning actor Cuba Gooding, Jr. about his film career and how he learned about African-American history through the characters he played on screen.","filename":"data/vaneerConsumption/CubaGoodingJrtoCBNNewsTheseStoriesAboutAfricanAmericansCantbeIgnoredAnymore.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/standard/images/cubagoodingjr_si.jpg?itok=xI2DSLvC","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_entertainment_2018_september_cuba-gooding-jr-to-news-these-stories-about-african-americans-cant-be-ignored-anymore_1540938447.html","title":"Cuba Gooding, Jr. to CBN News: 'These Stories About African Americans Can't be Ignored Anymore'","title_page":"Cuba Gooding, Jr. to CBN News: 'These Stories About African Americans Can't be Ignored Anymore' | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"CBN News recently interviewed Academy Award-winning actor Cuba Gooding, Jr. about his film career and how he learned about African-American history through the characters he has played on screen.\nHis performance in the film Jerry Maguire earned Gooding an Oscar for Best Actor in a Supporting Role in 1997. But critics say the characters he portrayed in real life American hero films like \"Red Tails,\" \"Tuskegee Airmen,\" and \"The Butler,\" are his true signature performances.\nInterestingly enough, Gooding says he really didn't know much about the African American contribution to American history prior to working on these films.\n\"You have got to remember I grew up in the 80s and 90s. And in my schooling, we didn't have a lot of schooling about these stories about African Americans' participation in American history,\" Gooding told CBN News. \"We didn't have the Tuskegee Airmen, the Red Tails and Men of Honor's. I didn't know about Dorie Miller at Pearl Harbor.\"\nIn the 2014 film titled \"Life of a King,\" Gooding plays Eugene Brown, a real-life modern-day hero who went from serving time in prison to saving lives through the game of chess.\n\"These stories can't be ignored anymore,\" Gooding explained. \"I read the fact that this was a very normal man who's incarcerated, comes out, and does good like in \"Lean on Me\" or \"Remember the Titans.\"\n\"There's an epidemic of black-on-black crime still today and gang violence that is destroying the family nucleus in today's society in America,\" Gooding noted. \"And I think part of that is that these young black men feel that they have no choice but to pick up a gun and represent their hood. Where's the father figure in these men's lives?\"\nGooding confessed that before he acted in \"Life of a King\", he had very little knowledge of chess.\n\"I never played chess growing up. I knew nothing about chess,\" he said. \"But to have those chess masters on the set, talking to you about the mentality of the game it is like life. It's a great metaphor for our youth today.\"\nClick the player to watch CBN News' Efrem Graham's entire interview with Cuba Gooding, Jr. above.","url":"http://www1.cbn.com/cbnnews/entertainment/2018/september/cuba-gooding-jr-to-news-these-stories-about-african-americans-cant-be-ignored-anymore"}
