{"authors":["Frances Martel"],"date_download":"2018-10-30 20:41:50","date_modify":"2018-10-30 20:41:50","date_publish":"2015-08-17 16:01:40","description":"The head of Cuba's \"normalization\" team has vowed that Cuba will not \"move one millimeter\" on its rampant human rights violations.","filename":"data/vaneerConsumption/CubaWontMoveOneMillimeteronHumanRights.json","image_url":"https://media.breitbart.com/media/2015/08/Josefina-Vidal-Cuban-foreign-ministry-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_17__1540932110.html","title":"Cuba Won't Move 'One Millimeter' on Human Rights","title_page":"Cuba Won't Move 'One Millimeter' on Human Rights","title_rss":"NULL","source_domain":"breitbart.com","text":"The head of Cuba’s delegation to negotiate “normalization” with the United States has vowed that Cuba will not “move one millimeter” on issues such as its rampant human rights violations in talks with American officials. This follows Secretary of State John Kerry’s visit to the island for the opening of the American embassy in Havana.\n“Decision of an internal nature are not negotiable and will never be on a conversational agenda with the United State to negotiate over,” said Josefina Vidal, the head of the Cuban delegation tasked with reestablishing diplomatic relations with America. She added that “Cuba will do absolutely nothing, will not move one millimeter its position to try to respond to people that are not looking out for our nation’s best interests.”\nVidal was responding to concerns that the Obama administration’s decision to legitimize the communist Cuban regime by reestablishing diplomatic ties would embolden Castro and his cohort when oppressing the rights of Cuban dissidents to demand a democratic government. In a separate interview with Reuters, Vidal dismissed complaints by Cuban exiles in the United States of communist repression of their families on the island as calls for “revenge.”\nThe Cuban government has largely responded to criticism of the White House by asserting that they would not be persuaded to democratize their government, and by pointing out so-called “human rights” issues within the United States.\nWhile Vidal was apparently tasked with the former, Cuban Foreign Minister Bruno Rodríguez did the latter as he spoke with reporters, following the reopening of the American embassy in Havana on Friday. During a press conference with Secretary Kerry, Rodríguez alleged that men and women receive equal salaries in Cuba and that “police brutality” was unheard of, unlike in the United States. The weekend before his statement, over 90 Cuban dissidents were arrested, many beaten, or kept under house arrest, following a protest march against President Obama, condemning the White House for legitimizing the human rights violations committed against them. Another 200 were arrested on Sunday for publicly expressing disapproval of the Castro regime.\nDuring the conference in which Rodríguez claimed America had a bigger police brutality problem than Cuba, Kerry asserted that he did not believe Congress would back full diplomatic relations with Cuba should the human rights situation not improve. “There is no way that Congress will lift the embargo if [the Cuban government] does not move regarding issues of conscience,” he said. He added that there was “an enormous distinction” to be made between isolated incidents of police abuse in the United States and Cuban state policy of violence and abuse towards political dissidents.","url":"https://www.breitbart.com/national-security/2015/08/17/obama-diplomacy-success-story-cuba-wont-move-one-millimeter-on-human-rights/"}
