{"authors":["Frances Martel"],"date_download":"2018-10-30 20:50:50","date_modify":"2018-10-30 20:50:50","date_publish":"2015-04-15 14:17:23","description":"Cuban political arrests have tripled since President Obama announced that a White House concessions package would be afforded to the regime.","filename":"data/vaneerConsumption/CubaIncreasesPoliticalArrests70inMarchFollowingUSThaw.json","image_url":"https://media.breitbart.com/media/2015/04/000_DV2003449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_15__1540932650.html","title":"Cuba Increases Political Arrests 70% in March Following US Thaw","title_page":"Cuba Increases Political Arrests 70% in March Following US Thaw | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Newly released statistics show that the communist government of Raúl Castro in Havana has exponentially increased the number of political arrests, beatings, and detentions since President Barack Obama announced that a White House concessions package would be afforded to the regime.\nThe University of Miami’s Institute for Cuban and Cuban-American Studies (ICCAS) released its regular trimester report this week, finding that politically motivated arrests increased nearly 70% between January and March, from 178 arrests in the former month to 610 in the latter. There were 492 individual instances of politically motivated arrests in February.\nArgentine news outlet Infobae notes also that recorded instances of physical aggression against dissidents tripled during that time.\nThe “Violations of Human Rights in Cuba” report records every person arrested on every day of the month and the circumstances of their arrest. The report notes the number of arrests in March was the highest in the past seven months.\nWhile the number of arrests have been increasing on a monthly basis, the Institute notes that longer-term trends also indicate the Cuban government has become more oppressive in the past decade. The Cuban government increased the number of politically motivated arrests nationwide from 172 in 2010 to 1,052 arrests in 2014.\nWhile many of these arrests occurred while dissidents attempted to organize overtly political rallies, the Cuban government has also exacerbated its persecution of practicing Christians. The Institute report finds that 53 individual arrests occurred in January for attempts to attend Catholic Sunday Mass in January; 211 individual arrests occurred for the same in February. Some of these were arrests of the same people on more than one Sunday morning, particularly members of the Ladies in White dissident group: mothers, sisters, wives, and other relatives of political prisoners.\nIn one incident in February, 200 people were arrested for attempting to attend a Mass. In the ensuing melee, Castro supporters tarred a member of the Ladies in White group.\nTrends from previous years indicate that arrest statistics will skyrocket as the summer arrives. The Castro regime broke political arrest records in May 2014, arresting 1,120 people, and followed up that month with nearly 1,000 arrests in June. Many of these individual arrests were of the same dissidents. Guillermo Fariñas, for example–a dissident who has conducted 23 hunger strikes against the communist regime–was arrested almost every Monday in June 2014.\nIn July 2014, a mass arrest of 100 members of the Ladies in White group prevented a Sunday Mass from occurring in honor of the victims of the March 13 Tugboat Massacre, in which the Cuban government drowned 37 people, among them 10 children, who were attempting to escape to the United States on a raft.\nThe Obama administration has said little about rampant human rights violations in Cuba, instead establishing closer relations with the Castro regime. President Obama met and shook hands with Castro at the Summit of the Americas this past weekend and removed Cuba from the State Department’s state sponsors of terrorism list Tuesday, despite the Castro government’s ties to the Revolutionary Armed Forces of Colombia (FARC), the ETA, and Hezbollah. Days before President Obama met with Castro at the Summit, Cuban government agents physically attacked a small group of political dissidents attempting to leave flowers at a bust of Cuban revolutionary hero José Martí in Panama City. The dissidents were in Panama after receiving an official invite from Summit organizers fearing that Cuban civil society would not be adequately represented by the communist regime.","url":"https://www.breitbart.com/national-security/2015/04/15/cuba-increases-political-arrests-70-in-march-following-us-thaw/"}
