{"authors":["Associated Press"],"date_download":"2018-10-23 03:47:49","date_modify":"2018-10-23 03:47:49","date_publish":"2016-01-29 19:06:27","description":"PARIS (AP) — Raul Castro is coming to France for the first-ever state visit of a Cuban president to the land of wine and gastronomy, a trip that could boost ...","filename":"data/vaneerConsumption/CubanleaderRaulCastrotoFranceforhistoricstatevisit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:99acfba4df54471ea9df687f4a31b340-3bmscybNe842cce83474b58feaff-155_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423273_Cuban-leader-Raul-Castro-France-historic-state-visit_1540266469.html","title":"Cuban leader Raul Castro to France for historic state visit","title_page":"Cuban leader Raul Castro to France for historic state visit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cuban leader Raul Castro to France for historic state visit\nPARIS (AP) — Raul Castro is coming to France for the first-ever state visit of a Cuban president to the land of wine and gastronomy, a trip that could boost French investments and promote stronger economic, cultural and tourist ties between Paris and Havana.\nCastro is to arrive Saturday for the private part of his trip ahead of his official visit on Monday and Tuesday, landing only eight months after French Socialist President Francois Hollande's one-day stop in Havana. The two leaders are to have dinner at the Elysee palace on Monday night.\n\"This visit marks a new step in the development of a stronger relationship between the two countries,\" the French presidency said.\nFILE - In this Monday, Sept. 28, 2015 file photo, Cuba's President Raul Castro arrives for the 70th session of the United Nations General Assembly at U.N. headquarters. Raul Castro is to come to France for the first state visit ever of a Cuban President in the country, a trip that could help boosting French investments and developing stronger economic, cultural and touristic ties between Paris and Havana. Castro is to arrive on Saturday, Jan. 30, 2016 for the private part of his trip ahead of the official visit on Monday and Tuesday, only 8 months after French Socialist President Francois Hollande¿s one-day stop in Havana. (AP Photo/Jason DeCrow, file)\nCastro's visit also comes two months after the Paris Club of creditor countries forgave $8.5 billion of overdue Cuban interest payments in exchange for Cuba's promise to pay off $2.6 billion in loans from developed countries over the next year and a half.\nFrance, to which Cuba owed $4 billion in overdue loans, led the creditors' negotiations. The deal was hailed by both sides as an essential step in clearing the path for Cuba to regain access to international credit that had been long unavailable due to the overdue loans.\nThe U.S. maintains an economic embargo against Cuba and is not among the creditor nations.\nFrance hopes to see some business partnerships flourish in Cuba in tourism, transport and environmental industries in the wake of the normalization of the country's ties with the U.S.\n\"The agreement at the Paris Club is paving the way for a bilateral agreement with France\" to be signed Monday, a top French official said Friday.\nCuba's remaining debt to France amounts to $390 million (360 million euros). With this new bilateral deal, part of the money would be reinvested in development projects on the island, another French diplomat said.\nThe two countries are expected to announce the opening of the French Agency of Development's office in Havana. The agency is a specialized financial institution that can make loans to public and private actors to support bilateral development projects.\nThe two French officials spoke on condition of anonymity because they were not authorized to disclose any details ahead of the visit.\nCuba's debt to France has not been honored since the 1980s, when Socialist President Francois Mitterrand and his wife Danielle openly supported the Cuban government.\nFrance has called for the lifting of the U.S. embargo since 1991. Former Cuba President Fidel Castro, brother of Raul, came to Paris on private visit in 1995 and met with Mitterrand at the Elysee palace.\nSome commercial deals are expected to be signed on the sidelines of Raul Castro's visit.\nFrench companies already working with Cuba — such as Pernod Ricard beverages, the hotel company Accor, the Bouygues construction group and the shipping group CMA CGM — could get new development opportunities.\nCastro's trip to Paris comes only few days after the visit of Iranian President Hassan Rouhani — another effort by French government to boost investments in an economy crippled by decades of sanctions until the Tehran nuclear deal last year.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3423273/Cuban-leader-Raul-Castro-France-historic-state-visit.html"}
