{"authors":["Associated Press"],"date_download":"2018-10-23 00:47:57","date_modify":"2018-10-23 00:47:57","date_publish":"2017-03-10 07:44:07","description":"TOKYO (AP) - Outfielder Alfredo Despaigne hit a grand slam in the fifth inning on Friday as Cuba beat Australia 4-3 to advance to the second round of the...","filename":"data/vaneerConsumption/Cubareaches2ndroundofWBCwith43winoverAustralia.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194971-1489136354-544_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300254_Cuba-reaches-2nd-round-WBC-4-3-win-Australia_1540255677.html","title":"Cuba reaches 2nd round of WBC with 4-3 win over Australia","title_page":"Cuba reaches 2nd round of WBC with 4-3 win over Australia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - Outfielder Alfredo Despaigne hit a grand slam in the fifth inning on Friday as Cuba beat Australia 4-3 to advance to the second round of the World Baseball Classic.\nDespaigne, who played for the Chiba Lotte Marines in Japan the last three seasons, connected off Australia pitcher Lachlan Wells for his second homer of the tournament.\n\"I don't swing to be a home run king,\" Despaigne said. \"I try to drive in runs. I'm so happy to contribute to the national team.\"\nCuba's Alfredo Despaigne hits a grand slam off Australia's pitcher Lachlan Wells during the fifth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nDespaigne homered three times in six games in the 2013 World Baseball Classic. His grand slam Friday came off a 2-1 fastball Wells left in the middle of the plate.\nCuba finished Pool B with a 2-1 record and will face Israel at Tokyo Dome on Sunday. Australia has played in the WBC all four times but has never made it out of the first round.\n\"We out-hit them, we out-played them,\" Australia manager Jon Deeble said. \"The only place we didn't win was the scoreboard. They (Cuba) have a knack of doing that.\"\nTwo-time champion Japan faces China later Friday with a chance to finish in first place in the Pool B.\nCuba's Alfredo Despaigne reacts after hitting a grand slam off Australia's pitcher Lachlan Wells during the fifth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nAustralia's Mitch Dening, foreground, scores on Logan Wade's single as Cuba's catcher Frank Morejon drops the ball during the fifth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nAustralia's Mitch Dening (17) scores on Logan Wade's single as Cuba's catcher Frank Morejon drops the ball during the fifth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017. (AP Photo/Toru Takahashi)\nCuba's Alfredo Despaigne watches the flight as he hits a grand slam off Australia's pitcher Lachlan Wells during the fifth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017. (AP Photo/Toru Takahashi)\nCuba's Alfredo Despaigne watches the flight of his grand slam off Australia's pitcher Lachlan Wells during the fifth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017.. (AP Photo/Toru Takahashi)\nAustralia's last batter Brad Harman leaves for his dugout after getting struck out looking as Cuba's catcher Frank Morejon celebrates to end their first round game of the World Baseball Classic at Tokyo Dome in Tokyo Friday, March 10, 2017. Cuba won 4-3. (AP Photo/Toru Takahashi)\nCuba's closer Miguel Lahera, right, hugs catcher Frank Morejon after their 4-3 win over Australia in their first round game of the World Baseball Classic at Tokyo Dome in Tokyo Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nCuba's manager Carlos Marti, left, celebrates with coach Carlos Louis after their 4-3 win over Australia in their first round game of the World Baseball Classic at Tokyo Dome in Tokyo Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nCuba's players celebrate after their 4-3 win over Australia in their first round game of the World Baseball Classic at Tokyo Dome in Tokyo Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nCuba's players celebrate after their 4-3 win over Australia in their first round game of the World Baseball Classic at Tokyo Dome in Tokyo Friday, March 10, 2017. (AP Photo/Koji Sasahara)\nCuba's closer Miguel Lahera, second from left, celebrates with teammates after their 4-3 win over Australia in their first round game of the World Baseball Classic at Tokyo Dome in Tokyo Friday, March 10, 2017. (AP Photo/Toru Takahashi)\nCuba's closer Miguel Lahera pitches against Australia in the ninth inning of their first round game of the World Baseball Classic at Tokyo Dome in Tokyo, Friday, March 10, 2017. Cuba won 4-3. (AP Photo/Toru Takahashi)","url":"https://www.dailymail.co.uk/wires/ap/article-4300254/Cuba-reaches-2nd-round-WBC-4-3-win-Australia.html"}
