{"authors":["Lee Stranahan"],"date_download":"2018-10-30 18:21:39","date_modify":"2018-10-30 18:21:39","date_publish":"2015-11-23 03:40:18","description":"An anti-racism rally at the University of Colorado to show support for Mizzou was cancelled because the organizers were thought to be white.","filename":"data/vaneerConsumption/CUBoulderAntiRacismRallyCanceledBecauseOrganizersAreWhite.json","image_url":"https://media.breitbart.com/media/2015/11/students-at-university-of-colorado-boulder-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_22__1540923699.html","title":"CU-Boulder Anti-Racism Rally Canceled Because Organizers Are White","title_page":"CU-Boulder Anti-Racism Rally Canceled Because Organizers Are White | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An anti-racism rally planned at the University of Colorado, Boulder, to show solidarity with University of Missouri black activists was cancelled because the protest organizers are white. However, a check of one of the event planner’s Facebook page reveals that isn’t the case.\nThe rally was killed under pressure from the CU’s Black Student Alliance, whose co-president Paris Ferribee said, “It’s not anyone that’s being affected telling the story, it’s only white people telling the story.” The rally was planned by students in a CU course called “Whiteness Studies.” Azabe Kassa posted an apology on the group’s Facebook page:\nOn behalf of the Whiteness Studies class, we apologize to the Black student organizations and Black students on the CU campus. We realize that we acted impulsively and should have consulted with BSA, not taking into account their previous efforts. We acknowledge that we should have contacted BSA to see what they were already planning WITH regard to Mizzou. While we understand that this does not excuse our actions, we learned a lesson in proper allyship. We still hope to work with BSA to support YOUR efforts AND to stand in solidarity with Black students. We intend to follow BSA’s lead, and we have cancelled the rally that we planned for tomorrow. At this time, we intend to leave the event page up as a public forum to draw attention to issues of racism on this campus. This space was not intended to invoke racist comments, however these comments show exactly why we do need to address racism on this campus. If anyone would like this page to be taken down, please contact me. Once again, we sincerely apologize for any offense we have caused, and take full responsibility for our actions.\nThe white students who wanted to protest racism were called racists by Ms. Ferribee, according to The Daily Camera:\n“That’s a slap in the face and that’s practicing racism, whether they want to believe it or not,” Ferribee said. “They used their white privilege and oppressed voices and stifled voices that are experiencing this every day.”\nAs a recent editorial in CU’s newspaper The Daily Camera explains, the result was a Martin O’Malley-style apology from the “white” students to the BSA.\nRegrettably, the BSA leaders’ censure resulted in another capitulation by the innocent. “We acknowledge that we should have contacted (the BSA) to see what they were already planning,” wrote Azabe Kassa, one of the event organizers. “We learned a lesson in proper allyship. We still hope to work with (the BSA) to support (its) efforts and to stand in solidarity with black students.” Mr. Kassa’s [sic] apology reads like a forced confession from one of the accused in a Stalin-area gulag. Not only must today’s activist “free speakers” fear potential retribution from the institutional authorities, but they must also fear retribution from critics among those whom they aim to support.\nDespite being attacked for her whiteness, several photos of Azabe Kassa posted on her Facebook page reveal that she appears to be what the left refers to as “a person of color.”\nEarlier in the year, Ms. Kassa had tweeted her excitment at seeing a speech by 1960s black liberation activist Angela Davis.\nI’m so essscited to see Angela Davis speak ✊ — Azabe Kassa (@azabiannights) April 23, 2015\nAt a recent meeting, Ferribee expressing a willingness to work with the white advocates whom she had previously shut down and also demanded mandatory training and more money for black students. The CU Indpendent reported:\n“Don’t let what happened on Thursday give you the impression that we don’t want to collaborate with white students” Ferribee said. “When you start thinking, ‘Oh they don’t like me’…it’s not about you. It’s not about me. It’s about the history. We’re trying to break some things down. We can all work together to make change.”… Ferribee discussed four main initiatives with the crowd: “A safe space — BSA lost its office last year; a mandatory undergraduate class on diversity, because students say they don’t feel accepted in their own dorm rooms… transparency from the university; and more financial aid for students of color.”\nFollow Breitbart’s lead investigative reporter and Citizen Journalism Boot Camp founder Lee Stranahan on Twitter at @Stranahan.","url":"https://www.breitbart.com/politics/2015/11/22/cu-boulder-anti-racism-rally-canceled-organizers-white/"}
