{"authors":[],"date_download":"2018-10-30 01:12:52","date_modify":"2018-10-30 01:12:52","date_publish":"2018-10-29 14:08:46","description":null,"filename":"data/vaneerConsumption/CulpabilityIsaTrickyThing.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/1024px-President_Trump_Arrives_in_Switzerland_39892623251.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861972.html","title":"‘Culpability Is a Tricky Thing’","title_page":"‘Culpability Is a Tricky Thing’The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“Culpability is a tricky thing,” Julia Ioffe writes at the Washington Post. She nevertheless finds Donald Trump culpable in inspiring a murderer, wholly unconnected to him, of 11 at the Tree of Life synagogue in Pittsburgh. “His role is just to set the tone,” Ioffe writes of the president. “Their role is to do the rest.”\nA morbid Washington parlor game involves assigning blame for murderous acts to one’s political enemies. The rules do not require evidence for such serious charges (the trickiness of culpability and all). “For the record,” Robert Bowers explained on social media, “I did not vote for nor have I owned, worn, or even touched a maga [Make America Great Again] hat.” The racist gunman further explained his opposition: “Trump is a globalist, not a nationalist.”\nDespite Robert Bowers’s views finding expression in no major American party or politician, the president’s enemies exploit the carnage by blaming a familiar villain. This script remains familiar for reasons beyond Trump. From John F. Kennedy’s assassination in Dallas to Jared Lee Loughner’s murder of six at a Congresswoman Gabbie Giffords event in Tucson, liberals falsely, and reflexively, accuse their political enemies of inspiring murder.\nThe Rorschach Test quality that inevitably colors responses to horrible, dramatic acts of violence yields to a separate psychological phenomenon — denial — when culpability in murder proves not very tricky and allies of a personal, direct sort kill many people for explicitly political reasons.\nI spent the last decade exploring a case study in this of sorts in writing Cult City: Jim Jones, Harvey Milk, and 10 Days That Shook San Francisco. Before the poor drank Jim Jones’s Kool-Aid in South America, the powerful did in San Francisco. But as the 40th anniversary of the Jonestown massacre approaches, few recall the importance of the latter half of that equation in the gruesome realization of the former half. Without powerful politicians aiding and abetting Jim Jones, Jonestown never happens.\nMayor George Moscone, who once said of Jim Jones that he “examines his conscience more thoroughly than anyone I know,” appointed the Peoples Temple leader to the city’s Housing Authority Commission, where he effectively became the largest landlord in San Francisco by quickly becoming chairman. When Peoples Temple came under investigation for voter fraud, the district attorney assigned a deputy to investigate — that he was also Jim Jones’s deputy in Peoples Temple did not strike him as a conflict of interest. He found no wrongdoing. Current U.S. Senator Dianne Feinstein joined a unanimous San Francisco board of supervisors in presenting a 1976 “Certificate of Honor” to Jim Jones “in recognition of his guidance and inspiration in establishing the many humanitarian programs in Peoples Temple, and in deep appreciation of his tireless and invaluable contributions to all the people of the Bay Area.” California Governor Jerry Brown spoke at Peoples Temple. Willie Brown, the future mayor of San Francisco and speaker of the California assembly, called Jones “a highly trusted brother in the struggle for liberation” in a letter to Fidel Castro encouraging the Cuban leader to grant Jones the honor of a state visit.\nElected politicians legitimized Jim Jones. Ideologues painted a picture of Jonestown diametrically opposed to reality.\nCause célèbre lawyer Charles Garry proclaimed upon visiting Jonestown, “I have seen paradise, where there is no sexism, racism, ageism, elitism, no one hungry.” San Francisco supervisor Harvey Milk described Jonestown to Carter cabinet official Joseph Califano as “a beautiful retirement community in Guyana, the type of which people of means would pay thousands of dollars to patronize” and as developing “new methods of agriculture” soon responsible for “alleviating the world food crisis.” Playwright Donald Freed commented after his August 1978 trip to the agricultural commune, “Martin Luther King, I think, if he could see Jonestown, would recognize it as the next step in his agenda, and he would say, ‘One, two, three, many more Jonestowns.’”\nJonestown, unique in both the sheer numbers of dead and the bizarreness of their end, also separates itself from other instances of mass death in that the political connections to the event proved direct; the ideological purpose (“revolutionary suicide protesting the conditions of an inhumane world”), explicit.\nRemarkably, no mention of the mutually-beneficial relationship between Harvey Milk and Jim Jones appears in either Oscar-winning motion picture on the slain San Francisco supervisor; Willie Brown writes as though he barely knew Jim Jones, a man he once compared to Martin Luther King and Mahatma Gandhi, in his memoirs; and Jane Fonda, though questioned about facelifts and her trip to North Vietnam, never gets asks why she cozied up to Jim Jones.\nMore than 900 people suffered the consequences of their reckless boosterism of Jim Jones. Strangely, few of the boosters ever did. Culpability, it’s a tricky thing.","url":"https://spectator.org/culpability-is-a-tricky-thing/"}
