{"authors":[],"date_download":"2018-10-30 19:51:32","date_modify":"2018-10-30 19:51:32","date_publish":"2017-02-14 20:35:00","description":"The CobbLinc Cumberland Circulator routes will begin March 31, the same day as the Braves' first exhibition game against the New York Yankees.","filename":"data/vaneerConsumption/CumberlandcirculatorroutessetaheadofBravesopening.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/14/Images/circulator%201_1134x710.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_4c744a74906d6e70b9d5c8819c705d4b__1540929092.html","title":"Cumberland circulator routes set ahead of Braves opening","title_page":"Cumberland bus, shuttle routes set ahead of SunTrust Park opening","title_rss":"NULL","source_domain":"ajc.com","text":"The route for a new bus to help shuttle fans to SunTrust Park and commuters around the Cumberland area was approved by the Cobb Commission Tuesday.\nThe CobbLinc Cumberland Circulator will begin operation on March 31, the same day as the Braves' first exhibition game against the New York Yankees. Service will continue weekdays and Saturdays throughout the year, including game days at the new stadium, and cost $2.50 to ride.\n“The Cumberland area is a major employment and residential activity center with significant growth potential,” Transportation Director Jim Wilgus told the board while presenting the item. “Transportation infrastructure and services are critical for managing traffic congestion and facilitating economic development.”\nOperation of the bus service will be supported by a $3 hotel/motel fee in the Cumberland area. This special tax district will cover the operational expenses for the remainder of fiscal year 2017 — about $570,000 based on a yearly operation cost of a little more than $1 million.\nThe southern route of the Cobb circulator\n“The funding for the ongoing operational costs for fiscal year 2018 and beyond will be part of the annual budget discussions,” Wilgus wrote in an email. “Currently that funding has not been determined, but we will continue to monitor the Cumberland Special Service District’s revenue to determine if there are excess collections above the required debt service payments, that can be applied to the circulator’s operational costs.”\nIn 2015, the county bought six new buses for the circulator. The county’s share of the $3.3 million price tag was $670,000.\nThe core route will travel in a continuous loop around the Interstate-75/Interstate 285 interchange, with stops at the Cobb Galleria, Atlanta Marriott Northwest, the Cobb Energy Performing Arts Center and SunTrust Park..\nA second, southern route will start at the Cumberland Transfer Center and travel down Cumberland Parkway and Paces Ferry Road to the Home Depot corporate offices.\n“We’re going to be looking very carefully at the ridership of this new circulator,” said Chairman Mike Boyce. He said the county wanted to ensure that “the intent is being met by the service.”","url":"https://www.ajc.com/news/local-govt--politics/cumberland-circulator-routes-set-ahead-braves-opening/DS2EjTB8eIDvCvilcXdmYP/"}
