{"authors":["Camila Domonoske"],"date_download":"2018-10-22 21:39:06","date_modify":"2018-10-22 21:39:06","date_publish":"2016-09-26 00:00:00","description":"After two nights of violent unrest, a midnight curfew was imposed on Thursday night. As protests became peaceful, though, it was not always enforced, and authorities lifted it on Sunday.","filename":"data/vaneerConsumption/CurfewLiftedInCharlotteAfterSeveralDaysOfPeacefulProtests.json","image_url":"https://media.npr.org/assets/img/2016/09/26/gettyimages-610389880_wide-621b7c65b3c99048354e1b51f9440098cbebf899.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_09_26_495445117_curfew-lifted-in-charlotte-after-days-of-peaceful-protests_1540244346.html","title":"Curfew Lifted In Charlotte After Several Days Of Peaceful Protests","title_page":"Curfew Lifted In Charlotte After Several Days Of Peaceful Protests : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Curfew Lifted In Charlotte After Several Days Of Peaceful Protests\nEnlarge this image toggle caption Sean Rayford/Getty Images Sean Rayford/Getty Images\nThe city of Charlotte, N.C., has lifted a midnight curfew, as protests over the weekend continued to be mostly peaceful.\nDemonstrators have taken to the streets for nearly a week, after police shot and killed Keith Lamont Scott on Tuesday. Police say Scott had a gun; his family says he was unarmed.\nThe first two nights of unrest resulted in property damage, injuries and a temporary interstate shutdown. One protester was shot Wednesday night and later died; a civilian has been arrested in connection to that shooting.\nAfter those two nights of violence, the governor of North Carolina declared a state of emergency and the city imposed a curfew. But on the first night of the curfew protests were largely calm and orderly, and police allowed demonstrators to remain on the street after midnight.\nProtests continued nightly, with many demonstrators calling for Charlotte police to release video footage of the shooting. A video taken by Scott's wife, which did not directly show the shooting, had been made public by Scott's family on Friday.\nLaw How 'Open Carry' Laws In North Carolina Apply To Keith Lamont Scott's Case How 'Open Carry' Laws In North Carolina Apply To Keith Lamont Scott's Case Listen · 5:10 5:10\nOn Saturday, officials released two police videos, showing Scott walking backward with his hands at his side when he was shot. Police Chief Kerr Putney said the delay in releasing the videos was meant to protect the integrity of the investigation.\nProtesters told The Associated Press that watching the videos reinforced their doubts about the police accounts that the shooting of Scott was justified:\n\"Dozens of people on Sunday stopped by a makeshift memorial near the site where Scott died. Most said after watching the police videos that they were struck by what appeared to be little threat that Scott posed the officers. \" 'If he had a gun in his hand, I couldn't see it. If he had one, he never raised it,' Reda Burch said. 'His hands never left his side. So no, I don't see a reason to kill him.' \"The videos changed the mind of Stacey Sizemore, who said that she worked in human resources for the Charlotte-Mecklenburg Police Department before leaving about six years ago. She said she knows police officers strive to protect the public, but the videos put new doubt into her mind that the shooting was necessary. \" 'If you're backing up, that's saying you don't want a fight. You don't want a confrontation. So that's the part that, kind of, didn't make it better for me,' Sizemore said.\"\nProtests on Saturday and Sunday continued to be peaceful.\nDavid Boraks of member station WFAE reports that an NFL game on Sunday was both a moment of escape and a chance for further protests:","url":"https://www.npr.org/sections/thetwo-way/2016/09/26/495445117/curfew-lifted-in-charlotte-after-days-of-peaceful-protests"}
