{"authors":["Npr Staff"],"date_download":"2018-10-22 21:21:32","date_modify":"2018-10-22 21:21:32","date_publish":"2017-03-17 00:00:00","description":"What questions do you have about the toll that climate change is taking — and about possible solutions?","filename":"data/vaneerConsumption/CuriousGoatAskUsAboutClimateChangeAndGlobalWellbeing.json","image_url":"https://media.npr.org/assets/img/2017/03/17/gettyimages-93066205-50_wide-fc2216e357176bc3d8109c4d96c0d3be0deb239a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_goatsandsoda_2017_03_17_520433017_-curiousgoat-ask-us-about-climate-change-and-global-well-being_1540243292.html","title":"#CuriousGoat: Ask Us About Climate Change And Global Well-being","title_page":"#CuriousGoat: What Do You Want To Know About Climate Change And Global Well-being? : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"#CuriousGoat: Ask Us About Climate Change And Global Well-being\nEnlarge this image toggle caption Christopher Furlong/Getty Images Christopher Furlong/Getty Images\nWhat Is #CuriousGoat?\n#CuriousGoat is a monthly series from Goats and Soda that asks our audience to share a question on a special topic about global health and development. Read the response story of our previous #CuriousGoat on pandemics here.\nEarth Day is coming up on April 22.\nIt's an occasion to think about the risks we all face from climate change — and to recognize the toll these problems take on the people in the developing world, who are especially vulnerable. When oceans rise, when drought strikes, the consequences can be dire. People are losing their homes and becoming climate refugees, losing their crops, losing their water sources. Disease-carrying insects are moving into new territory.\n\"People who are poorly off are always going to bear the brunt when things go badly,\" says Dr. Alfred Sommer, epidemiologist and dean emeritus at Johns Hopkins Bloomberg School of Public Health.\nWe'd like to hear from you: What do you want to know about climate change and its effect on global well-being? Use the form below to submit your question.\nThank you for submitting your question. The submission round is now closed.\nYou have until Friday, March 24, to submit a question. We'll pick one and publish a story that answers that question next month.","url":"https://www.npr.org/sections/goatsandsoda/2017/03/17/520433017/-curiousgoat-ask-us-about-climate-change-and-global-well-being"}
