{"authors":["Alicia Lu"],"date_download":"2018-10-30 22:29:09","date_modify":"2018-10-30 22:29:09","date_publish":"2014-08-15 15:10:16","description":"I guess watching MTV Cribs just wasn't enough for these teens — they had to see how the rich and famous live up close and personal. Seven teenagers walked into NBA player Ray Allen's home in Coral Gables early Thursday morning. Allen wasn't home,…","filename":"data/vaneerConsumption/CuriousTeensTourNBAStarRayAllensMansionInTheDeadOfNight.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bbd21ce7-2a12-4ccc-af33-f96149943055.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35901-curious-teens-tour-nba-star-ray-allens-mansion-in-the-dead-of-night_1540938549.html","title":"Curious Teens Tour NBA Star Ray Allen's Mansion In The Dead Of Night","title_page":"Curious Teens Tour NBA Star Ray Allen's Mansion In The Dead Of Night","title_rss":"NULL","source_domain":"bustle.com","text":"I guess watching MTV Cribs just wasn't enough for these teens — they had to see how the rich and famous live up close and personal. Seven teenagers walked into NBA player Ray Allen's home in Coral Gables early Thursday morning. Allen wasn't home, but the intruders startled his wife and kids, who were sleeping upstairs. If you were to give these kids the benefit of the doubt, you could speculate that they were avid fans of the former Miami Heat player and resorted to desperate measures to meet him, but in real life they were probably just bored.\nAround 2 a.m. on Thursday, seven 18- and 19-year-olds left a house party to go explore the house next door. According to Coral Gables police, the teens said they wanted to see how a professional basketball player lives. Thinking that nobody was home, the teens entered the house through an unlocked door in the back of the house.\nWhat happened next is unclear, but one can only imagine that it was like the scene from The Hangover where Bradley Cooper and company stumble through Mike Tyson's house and proceed to pee in the pool and hump his pet tiger, all while drunkenly laughing and making a ruckus.\nThe seven teens must have been equally giddy with excitement because they woke Allen's wife, Sharon. Police said that when she saw them she screamed, \"What the f**k are you doing in my house?\" Then she heard one of the teens, a girl, say, \"Oh my God!\" before they all ran out of the house laughing. Who knows how many expensive objects they pawed before getting caught.\nAfter police were called, the host of the party next door directed officers to a house where the teens were located. After being questioned, the teens escaped charges from the police. Since nothing was stolen, there was no sign of forced entry, and no intent, the police were not able to charge them with burglary, and since the police were not there to witness the incident, they couldn't charge the kids with trespassing either. They're not getting off scot-free though. According to Coral Gables police spokesperson Kelly Denham, Sharon intends to press trespassing charges.\nWell, it could have gone down a lot worse. Hell, Ray Allen wasn't even home. But for any kids out there who are still curious about how NBA players live, save yourself some trouble and take a virtual tour instead. Here, we've even compiled the best tours for you below.\nSpencer Logan on YouTube\nPlacid Peet on YouTube\npablo sandoval on YouTube\nImage: Warner Bros","url":"https://www.bustle.com/articles/35901-curious-teens-tour-nba-star-ray-allens-mansion-in-the-dead-of-night"}
