{"authors":["Press Association"],"date_download":"2018-10-23 00:34:36","date_modify":"2018-10-23 00:34:36","date_publish":"2017-03-16 10:03:09","description":"Take Five Day aims to raise awareness of ways to protect against fraud.","filename":"data/vaneerConsumption/Customersgivenantiscamtipsas2millionadayislosttofinancialfraud.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227619-1489658595-16_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319530_Customers-given-anti-scam-tips-2-million-day-lost-financial-fraud_1540254876.html","title":"Customers given anti-scam tips as £2 million a day is lost to financial fraud","title_page":"Customers given anti-scam tips as £2 million a day is lost to financial fraud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Around £2 million was lost to financial fraud each day of last year, according to a campaign encouraging people to pass on scam prevention tips to their friends and family.\nThe overall scale of financial fraud in 2016 was £768.8 million, an increase on the £755 million lost in 2015, Financial Fraud Action UK (FFA UK), whose members include banks and card companies, said.\nThe losses include payment card and cheque fraud as well as remote banking fraud, which covers internet banking, telephone banking and mobile banking.\nCustomers are being urged to use caution during financial transactions as fraud cases rise\nFFA UK’s figures were released to coincide with Take Five Day on Thursday – a day of action during which staff in more than 6,800 bank branches will talk to customers about simple ways to protect against fraud. They will also encourage them to tell five other people about steps they can take.\nIt’s #TakeFiveDay! Today is all about taking the time to spread the #TakeFive message. We want you to aim to tell five people! RT pic.twitter.com/DmZ3g5FcA7 — Take Five (@TakeFive) March 16, 2017\nThe day is part of the Take Five campaign, which encourages people to pause for thought before doing something like replying to an unsolicited email or transferring money.\nThe campaign focuses on financial frauds directly targeting consumers, such as email deception known as phishing, phone-based scams known as vishing and scams using text messages known as smishing.\nSuch scams often involve a fraudster posing as a legitimate organisation such as their victim’s bank or the police.\nTake our Fraud Defence Test and let us know your score! https://t.co/hqOyxxyddW pic.twitter.com/KBCO3RWHBt — Action Fraud (@actionfrauduk) January 25, 2017\nScams often put pressure on people to act quickly to force them into doing something they would not ordinarily do, such as revealing bank account passwords and pins or transferring money to someone else.\nTony Blake, senior fraud prevention officer at the Dedicated Card and Payment Crime Unit (DCPCU), said: “On Take Five Day we are encouraging everyone to share the message that it’s OK to stop and think before sharing any personal or financial details.”\nTake Five Day today!! Tweet about how you are supporting with photos using #TakeFiveDay Come on let's change people's behaviour! @TakeFive pic.twitter.com/X5VHOWfXGa — Tony Blake (@Tonydcpcu) March 16, 2017\nResearch for the campaign has found that nearly three-quarters (74%) of people are worried about falling victim to financial fraud while more than two-thirds (68%) express the same concern about their families.\nDespite this, seven in 10 (71%) have never discussed how to protect themselves against financial fraud with anyone. More than half (55%) believe it is too complicated a subject for a conversation.","url":"https://www.dailymail.co.uk/wires/pa/article-4319530/Customers-given-anti-scam-tips-2-million-day-lost-financial-fraud.html"}
