{"authors":[],"date_download":"2018-10-30 01:03:48","date_modify":"2018-10-30 01:03:48","date_publish":"2018-08-13 00:05:25","description":null,"filename":"data/vaneerConsumption/CusterDiedforOurVirtues.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Custer5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861428.html","title":"Custer Died for Our Virtues","title_page":"Custer Died for Our VirtuesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"When I was growing up in the 1960s and 1970s, you sometime saw a bumper sticker that read “Custer Died for Your Sins.”\nFor the Left, figures like Custer represented an America of racism, ignorance, violence, and imperialism, portrayed on the silver screen in movies like Little Big Man, and playing itself out in real life in the Vietnam War.\nBut the reality of Custer is far different. He represents, in many ways, what used to be old-fashioned American virtues, perhaps summed up in that singularly old-fashioned word “pluck.”\nHe famously graduated last in his class, ending his West Point career court-martialed for failing to break-up — indeed for refereeing — a fight between two cadets, so that, in his words, “I was in the guard house when my class graduated.”\nHe did graduate, however — or was court-martialed — straight to the front in the Civil War, where his bravery, daring, and initiative caught the eye of General George McClellan. Custer was courageous, a good scout (even taking on the hazardous duty of going up in balloons for aerial reconnaissance), and took pride in never confessing to exhaustion or hunger.\nMcClellan said that “in these days Custer was simply a reckless, gallant boy, undeterred by fatigue, unconscious of fear; but his head was always clear in danger and he always brought me clear and intelligible reports of what he saw when under the heaviest fire. I became much attached to him.”\nUnlike his patron, though, Custer was all for battle. As a cavalry officer he swiftly became the Union’s “Boy General,” gaining his first star at the age of twenty-three. He was conspicuous in the field, in a way that made him an easy mark for sharpshooters — with his long blond locks, crimson tie, and black velvet jacket radiating gold braid — and quite unafraid to charge into the enemy.\nIt was an enemy that he respected and even liked. Many of best friends at West Point had been Southerners. He and they were not just cavaliers at heart, but conservative Democrats, and while he confessed himself duty-bound to fight for the Union, he felt no bitterness toward his Southern comrades — and his warm feelings were returned. After Custer was killed at the Battle of the Little Big Horn, Southern newspapers were among the most vehement in calling for his death to be avenged.\nCuster was always controversial — fame invites criticism — but he represented an optimistic, dynamic America that retained its sense of manifest destiny even after a catastrophically costly Civil War. He was a man of keen loyalties — not just to the Union, but to his family. Dying with him at the Little Big Horn were his brothers Tom and Boston, his nephew Henry Armstrong “Autie” Reed, and his brother-in-law Lieutenant James Calhoun (the “Adonis of the 7th Cavalry”). And while Custer had waged total war against both Confederates and Indians, he was as sympathetic to the native tribes as he had been to Southerners, saying once, “If I were an Indian, I often think I would greatly prefer to cast my lot among those of my people who adhered to the free open plains, rather than to submit to the confined limits of a reservation, there to be the recipient of the blessed benefits of civilization, with its vices thrown in without stint and measure.”\nAlas, today, Americans are not so broadminded. All is politicized — and it’s not just Confederate statues that are pulled from their plinths. Just about every American hero is liable to fall foul of some aspect of the Left’s Ministry of Truth. Last year, the fast-food chain Sonic yanked a commercial featuring an actor who portrayed Custer for comic effect. Apparently the mere mention of Custer’s name, or his appearance, is supposed to be offensive because he fought Indians.\nAs America rips up its mystic chords of memory, severs them, and throws them on a funeral pyre, we can’t just retire to our dens, watch reruns of Gunsmoke, and remember the good old days (though we should do that occasionally with our children — the best defense against lies about the past is to revisit the past).\nWe need to build up a counter-narrative to the Left’s iconoclasm. We can talk until we’re Union blue in the face about the culture war, but until we start displacing the hectoring Left on the airwaves, screens, and printed pages that dominate our imaginations, we will always lose. Custer could show us how to win. We should invest ourselves with his pluck, his sense that life is full of adventure and opportunity, and his conviction that fortune favors the bold. If there’s one thing socialist roundheads can’t stand, it is cavaliers like Custer. Let’s celebrate them.\nHistorian and novelist H. W. Crocker III’s most recent book is Armstrong, a comic novel of George Armstrong Custer surviving the Battle of the Little Big Horn to become an anonymous, gun-slinging do-gooder in the West.","url":"https://spectator.org/custer-died-for-our-virtues/"}
