{"authors":[],"date_download":"2018-10-22 20:43:21","date_modify":"2018-10-22 20:43:21","date_publish":"2014-06-02 20:45:33","description":"Make sure you have the right credit card in your wallet — one that does not charge a foreign transaction fee.","filename":"data/vaneerConsumption/CutCostofTravelAbroadWithRightCreditCard.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/92776/140102-creditcards-biz_fb97a72c8e2b90e9be236440fedee0b6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_cut-cost-travel-abroad-right-credit-card-n120666_1540241001.html","title":"Cut Cost of Travel Abroad With Right Credit Card","title_page":"Cut Cost of Travel Abroad With Right Credit Card","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHere's a simple way to save some money every time you make a purchase on your trip. Make sure you have the right credit card in your wallet — one that does not charge a foreign transaction fee.\n\"About 90 percent of all credit cards have a foreign transaction fee, which can be as high as 3 percent,\" said Odysseas Papadimitriou, CEO of CardHub. \"Three percent might not sound like much, but when you multiply it by the typical budget of an international trip, it can add up to a lot of money.\"\nDoes your card have this fee?\nIf you're not sure, check the terms and conditions. A few big-name credit card issuers have started to eliminate this fee on some of their cards.\nChase now has 13 cards that don't have a foreign transaction fee, including the Marriott Rewards Premier credit card, Southwest Airlines Rapid Rewards Premier card, United MileagePlus Club Visa and British Airways Visa Signature card.\n\"If your card has this fee, you might want to apply for another one before your trip. There are a number of really good cards available that you might want to consider.\"\n\"Most of these cards are designed for frequent travelers and have benefits that would suit their specific needs and wants,\" said Paul Hartwick, a spokesman for Chase. \"Features like bonus points for travel purchases and no foreign transaction fees are especially attractive to these customers.\"\nAmerican Express recently dropped the fee for its Gold, Platinum and Reserve Delta SkyMiles credit cards.\n\"If your card has this fee, you might want to apply for another one before your trip,\" said Bill Hardekopf, CEO of LowCards.com. \"There are a number of really good cards available that you might want to consider.\"\nFor example, consider the Chase Sapphire Preferred card, BankAmericard Travel Rewards card and the Barclaycard Arrival Plus World Elite MasterCard.\nA few card issuers — Capital One, Discover and Pentagon Federal Credit Union — do not have foreign transaction fees on any of their cards. The Capital One Quicksilver and Venture Rewards cards come highly recommended by various comparison websites. (See a full list of recommended cards at CardHub.)\nWhat about a smart card?\nUnless you frequently travel outside the country, you probably have a credit card with a magnetic strip on the back. That could be a problem in other parts of the world where they've converted to EMV technology — the so-called \"smart card\" that uses an embedded microchip to verify your identity.\n\"It's a good idea to have the EMV card, but it's probably not as important as some people would have you believe,\" said Ed Perkins, who writes for SmarterTravel.com. \"I wouldn't stay home because you don't have one.\"\nAmerica is in the process of switching to EMV cards, but there's no need to wait. See if your bank can give you a new chip-based card. Chase, Citi and Bank of America now offer a number of cards that are EMV compatible — they have both a mag strip and a chip. And as an added bonus, they don't have a foreign transaction fee. (See a list of EMV-enabled credit cards on LowCards and NerdWallet.)\nGetting cash in another country\nYou may be tempted to get some foreign currency at the airport. Travel experts advise against that because the exchange rate is so bad. Wait until you get to your destination and find an ATM.The average charge for currency conversion is 6.73 percent higher at a bank, and 10.17 percent higher at a Travelex location, than using a credit card with no foreign transaction fee, according to CardHub's 2014 Currency Exchange Study.\nBut watch out for other fees. The average foreign ATM fee is around $2.78 per transaction. You may be able to avoid that if you use a cash machine that's affiliated with your bank.\nBank of America has a no-fee agreement with banks in many countries, including Australia, Canada, China, England, France, Germany, Italy and Mexico through its Global ATM Alliance, which will save you $5 per transaction. Keep in mind, there still may be a foreign transaction fee of three percent.\nA few checking accounts now offer debit cards that don't have a foreign transaction fee, so you can withdraw cash from any ATM without getting dinged.\nBefore you leave\nNo matter where you go or what card you have, contact your bank or card issuer and let them know about your travel plans. Otherwise, you run the risk that their fraud prevention computer programs might see these out-of-profile transactions, suspect a problem and shut down the card.\nIt's also a good idea to make sure you've paid off the balance, so you don't run out of credit while you are away.\nCheck with your bank to find out what sort of charges you might incur if you use their card when you're away and find out what, if anything, you can do to avoid those fees.\nOne more money-saving tip: Never let a merchant convert your purchase into U.S. dollars. That may seem convenient, but you'll get a lousy exchange rate and still have to pay a conversion fee when that transaction is processed by your credit card company.\n\"Pay in the local currency and let your card company take care of the conversion for you,\" advised Charles Leocha, chairman and co-founder of Travelers United. \"You'll get the best exchange rate that way.\"","url":"https://www.nbcnews.com/business/travel/cut-cost-travel-abroad-right-credit-card-n120666"}
