{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:02:00","date_modify":"2018-10-30 21:02:00","date_publish":"2016-06-28 13:42:37","description":"Senior advisor to Palestinian President Mahmoud Abbas Sultan Abu Al-Einein called on Palestinians to behead Israelis they encounter.","filename":"data/vaneerConsumption/CutOffTheHeadOfEveryIsraeliDoNotNegotiate.json","image_url":"https://media.breitbart.com/media/2016/01/Israel-stabbing-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_06_28__1540933320.html","title":"Cut Off The Head Of Every Israeli, Do Not Negotiate","title_page":"Abbas’ Snr Advisor: Cut Off The Head Of Every Israeli, Do Not Negotiate","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Sultan Abu Al-Einein, a senior advisor to Palestinian President Mahmoud Abbas, called on Palestinians to behead Israelis in an article published Monday.\nWhen asked in an interview with Palestinian news agency Donia Al-Watan to comment on the prospects of building normal relations with Israel, Abu Al-Einein said he rejects all attempts at peace or negotiations with Israelis.\n“If you would ask me about my personal position, I would tell you – every place you find an Israeli cut off his head. Likewise, I am against talks, negotiations, meetings, and normalization in all its forms with the Israeli occupation,” Abu Al-Einein was quoted as saying.\nIsraeli NGO Palestinian Media Watch has exposed previous instances of Abu Al-Einein’s glorification of murder. Abu Al-Einein, who in addition to being Abbas’ advisor is also a member of Fatah’s Central Committee, said that killing Jews is not only a Palestinian national goal, but something Allah demands as an Islamic commandment.\nFollowing the 2014 butchering of four rabbis during morning prayers in a synagogue in Jerusalem, Abu Al-Einein posted pictures of the dead rabbis lying in their own blood on his Facebook page. He called the massacre, in which the rabbis were hacked to death with axes and kitchen knives, “a heroic operation” and said that murdering rabbis during prayer makes one the ultimate “soldier of Allah.”\n“Blessed be your quality weapons, the wheels of your cars, your axes and kitchen knives. By Allah, these are stronger than the arsenals of our enemy, because [it’s] according to Allah’s will. We are the soldiers of Allah.” See the images with the original message below:\nIn the recent wave of Palestinian terror, Abu Al-Einein praised a series of terrorists who carried out stabbing, shooting, or car-ramming attacks against Israelis, often penning thank-you notes to them.\nTo the terrorist who killed one and wounded 11 in an attack on Beersheba’s central bus station, Abu Al-Eineim wrote, “We loved you, while you sowed life for all Palestinians.”","url":"https://www.breitbart.com/middle-east/2016/06/28/abbas-snr-advisor-cut-off-the-head-of-every-israeli-do-not-negotiate/"}
