{"authors":["Judy Lin"],"date_download":"2018-10-30 23:10:47","date_modify":"2018-10-30 23:10:47","date_publish":"2017-02-06 00:00:00","description":"Generous retirement benefits for public safety employees could help push the Bay Area city of Richmond into bankruptcy","filename":"data/vaneerConsumption/Cuttingjobsstreetrepairslibrarybookstokeepupwithpensioncosts.json","image_url":"https://www.trbimg.com/img-58939496/turbine/la-me-richmond-pensions-photos-20170202-004/600","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540941047.html","title":"Cutting jobs, street repairs, library books to keep up with pension costs","title_page":"Cutting jobs, street repairs, library books to keep up with pension costs - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"When the state auditor gauged the fiscal health of California cities in 2015, this port community on the eastern shore of San Francisco Bay made a short list of six distressed municipalities at risk of bankruptcy.\nRichmond has cut about 200 jobs — roughly 20% of its workforce — since 2008. Its credit rating is at junk status. And in November, voters rejected a tax increase that city leaders had hoped would help close a chronic budget deficit.\nThis series is a partnership of\n“I don’t think there’s any chance we can avoid it,” said former City Councilman Vinay Pimple, referring to bankruptcy.\nA major cause of Richmond’s problems: relentless growth in pension costs.\nPayments for employee pensions, pension-related debt and retiree healthcare have climbed from $25 million to $44 million in the last five years, outpacing all other expenses.\nBy 2021, retirement expenses could exceed $70 million — 41% of the city’s general fund.\nRichmond is a stark example of how pension costs are causing fiscal stress in cities across California. Four municipalities — Vallejo, Stockton, San Bernardino and Mammoth Lakes — have filed for bankruptcy protection since 2008. Others are on the brink.\n“The truth is that there are cities all over the state that just aren’t owning up to all their problems,” said San Bernardino City Manager Mark Scott.\nIncreasingly, pension costs consume 15% or more of big city budgets, crowding out basic services and leaving local governments more vulnerable than ever to the next economic downturn.\nRichmond is a racially diverse, working-class city of 110,000 whose largest employer is a massive Chevron oil refinery. Like many California municipalities, Richmond dug a financial hole for itself by granting generous retirement benefits to police and firefighters on the assumption that pension fund investments would grow fast enough to cover the cost.\nThat optimism proved unfounded, and now the bill is coming due.\nCity Manager Bill Lindsay insists that Richmond can avoid going off a cliff. Last year, financial consultants mapped a path to stability for the city by 2021 — but at a considerable cost in public services.\nThe city cut 11 positions, reduced after-school and senior classes, eliminated neighborhood clean-ups to tackle illegal trash dumping, and trimmed spending on new library books — saving $12 million total.\nCity officials also negotiated a four-year contract with firefighters that freezes salaries and requires firefighters to pay $4,800 a year each toward retirement healthcare. Until then, the benefit was fully funded by taxpayers.\n“I’ve seen some of my good friends go through it in Vallejo and Stockton, and what we found out during those [bankruptcies] is that your union contracts aren’t necessarily guaranteed,” said Jim Russey, president of Richmond Firefighters Local 188.\nRichmond’s consultants said the city had to find $15 million more in new revenue or budget cuts by 2021. Lindsay said the city has been looking hard for additional savings, and the police union recently agreed to have its members contribute toward retirement healthcare.\n“If you look at the five-year forecast, with reasonable assumptions, even with the growth in pension cost, it does start to generate a surplus,” Lindsay said.\nJoe Nation, a former Democratic state legislator who teaches public policy at Stanford’s Institute for Economic Policy Research, is not so sanguine. He reviewed Richmond’s retirement cost projections and said they leave little room to maneuver.\nOver the next five years, every dollar the city collects in new revenue will go toward retirement costs, leaving little hope of restoring city services, Nation said.\n“If there is an economic downturn of any kind, I can imagine that they could be pushed to the brink of bankruptcy, if not bankruptcy,” Nation said.\nLast month, the California Public Employees’ Retirement System (CalPERS), the state’s main pension fund, lowered its projected rate of return on investments from 7.5% to 7% per year. That means Richmond and other communities will have to pay more each year to fund current and future pension benefits.\nThe change is expected to increase local government pension payments by at least 20% starting in 2018, according to CalPERS spokeswoman Amy Morgan.\nAn analysis by the nonprofit news organization CALmatters indicates that Richmond’s retirement-related expenses could grow to more than $70 million per year by 2021. That represents 41% of a projected $174-million general fund budget.\nLindsay said the city’s estimates of future pension costs are lower because of different assumptions about salary increases and other costs.\nThe city of Richmond’s pension-related budget problems have taken a toll on public services, including street repair. (Robert Durell / CALmatters)\nVoters approved a sales tax increase in 2014 to help stabilize the city’s finances. But in November, voters rejected an increase in the property transfer tax that was expected to bring in an additional $4 million to $6 million annually.\nLindsay said the city was never counting on the property transfer tax in its 5-year plan. If the city needed more cash, he says Richmond has properties it can sell.\nADVERTISEMENT\n“Budget management is much more difficult in Richmond than in Beverly Hills, but you still manage it,” Lindsay said. “To say it’s spiraling out of control into bankruptcy does incredible damage to our community and it’s just not accurate.”\nRichmond is especially hard hit by personnel costs because of high salaries for public employees. The city’s average salary of $92,000 for its 938 employees was fifth highest in California as of 2015, according to the state controller. The city’s median household income is $54,857.\nPolice officers and firefighters in Richmond make more than $137,000 per year on average, compared with an average $128,000 per year for Berkeley police and firefighters, where housing prices are more than 60% higher than in Richmond.\nPublic safety salaries averaged $115,000 in Oakland and $112,000 in Vallejo.\nMayor Tom Butt says of Richmond’s pension-related financial problems: “It’s a huge mess ... One of these days, it’s just going to come crashing down.” (Robert Durell / CALmatters)\nRichmond Mayor Tom Butt, an architect and general contractor who has served on the city council for two decades, says the city that was once among the state’s most dangerous has little choice but to pay higher salaries to compete for employees with nearby communities that are safer and more affluent.\n“You can’t convince anyone here that they deserve less than anybody in any other city,” Butt said.\nLindsay said the decision to offer higher salaries for public safety employees was strategic.\n“The city council made a conscious decision to put a lot into public safety, in particular reducing violent crime. And largely, we’ve been successful,” Lindsay said.\nViolent crimes have been declining in the city over the past decade with homicides dropping to a low of 11 in 2014. But Richmond is experiencing an uptick, recording 24 homicides in 2016, according to the police department.\nPart of the challenge with public safety costs dates to 1999, when Richmond, like many local governments, matched the state’s decision to sweeten retirement benefits for California Highway Patrol Officers.\nCHP officers could retire as early as 50 with 3% of salary for each year of service, providing up to 90% of their peak salaries in retirement. Other police departments soon demanded and got similar treatment.\nRichmond firefighters are eligible to retire at age 55 with 3% of salary for each year of service. Recent hires will have to work longer to qualify for a less generous formula under legislation passed in 2013.\nRichmond’s actuarial pension report shows there are nearly two retirees for every police officer or firefighter currently on the job.\nTo cope with severe budgetary pressures, the city of Richmond put this Fire Department training facility up for sale. (Robert Durell / CALmatters)\nIn a way, Richmond is a preview of what California cities face in the years ahead. According to CalPERS, there were two active workers for every retiree in its system in 2001. Today, there are 1.3 workers for each retiree. In the next 10 or 20 years, there will be as few as 0.6 workers for each retiree collecting a pension.\nBecause benefits have already been promised to today’s workers and retirees, cuts in pension benefits for new employees do little to ease the immediate burden. It “means decades before the full burden of this will be completely dealt with,” said Phil Batchelor, former Contra Costa County administrator and former interim city manager for Richmond.\nToday, Richmond’s taxpayers are spending more to make up for underperforming pension investments. CalPERS projects that the city’s payments for unfunded pension liabilities will more than double in the next five years, from $11.2 million to $26.8 million.\nNow, the lower assumed rate of investment return is projected to add nearly $9 million to Richmond’s costs by 2021.\n“It’s a huge mess,” said Mayor Butt. “I don’t know how it’s going to get resolved. One of these days, it’s just going to come crashing down.”\nJudy Lin is a reporter at CALmatters, a nonprofit journalism venture in Sacramento covering state policy and politics.\nTwitter: @ByJudyLin\nAdditional credits: Sean Greene\nCalifornia's Pension Crisis Sign up for our Essential Politics newsletter to receive more stories like this Privacy policy","url":"http://www.latimes.com/projects/la-le-me-richmond-pensions/"}
