{"authors":["Chris Benderev","Robert Melillo","Co-Founder Of Brain Balance Achievement Centers","Dr. James Mcgough","Of Ucla","On The Published Research About Brain Balance"],"date_download":"2018-10-22 21:50:45","date_modify":"2018-10-22 21:50:45","date_publish":"2018-06-18 00:00:00","description":"With 113 locations in the U.S., Brain Balance says its drug-free approach has helped tens of thousands of children. But experts say there's insufficient proof of its effectiveness.","filename":"data/vaneerConsumption/CuttingEdgeProgramForChildrenWithAutismAndADHDRestsOnRazorThinEvidence.json","image_url":"https://media.npr.org/assets/img/2018/06/12/brain-balance-1_wide-405387c9e19a6f892c4d1e6ab83e985ea6d6ba95.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2018_06_18_616805015_cutting-edge-program-for-children-with-autism-and-adhd-rests-on-razor-thin-evide_1540245045.html","title":"'Cutting Edge' Program For Children With Autism And ADHD Rests On Razor-Thin Evidence","title_page":"Brain Balance's Approach To Autism, ADHD: High Hopes, High Costs And Slim Science : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'Cutting Edge' Program For Children With Autism And ADHD Rests On Razor-Thin Evidence\nEnlarge this image toggle caption Hokyoung Kim for NPR Hokyoung Kim for NPR\nSome parents see it coming. Natalie was not that kind of parent.\nEven after the director and a teacher at her older son's day care sat her down one afternoon in 2011 to detail the 3-year-old's difficulty socializing and his tendency to chatter endlessly about topics his peers showed no interest in, she still didn't get the message.\nHer son, the two educators eventually spelled out, might be on the autism spectrum.\n\"I was in tears at the end,\" she says. \"When I got home, I was just devastated.\"\nNatalie broke the news to her wife, Stephanie, whose mind fast-forwarded to a distressing future. Would her son — a squat, cheerful boy who, despite his affectionate nature, didn't have any playmates — ever be able to make friends?\nWhen a doctor eventually confirmed he had an autism spectrum disorder, the diagnosis came with a suggestion: Perhaps the boy would benefit from Prozac when he turned 7.\n\"That was when both of us fell apart in that meeting,\" Natalie says. For both parents, medication wasn't an option.\n\"Prozac is a very powerful drug for adults. Why would you give it to a 7-year-old?\" Stephanie wondered after the doctor's visit. \"I welled up with all of this emotion. And I said I will not let that happen.\"\n(To protect their privacy, we are only using Natalie's and Stephanie's first names. We are not naming their children.)\nThe fear of psychotropic drugs led the family to pursue alternative treatments for autism.\nTo start, they dropped gluten.\nThen one day, as Natalie roamed the aisles of a gluten-free expo in a Chicago suburb not far from where the family lives, she came across a booth for a Brain Balance Achievement Center.\nNatalie says the program claimed to help with disorders ranging from dyslexia to ADHD and autism. Best of all, it didn't involve prescription drugs.\n\"We were very excited,\" Stephanie says. \"Maybe we found a solution that wasn't going to be about medicine. I was very, very hopeful.\"\n\"It will completely, absolutely, 100 percent change your life\"\nNatalie had stumbled upon one of 113 Brain Balance franchises across the country. Seventeen more are in the works. In the dozen years since its inception, Brain Balance says, it has helped roughly 25,000 children. The company says it is currently taking in over $50 million in annual revenue.\nAlthough Brain Balance isn't the only purveyor of alternative approaches for developmental disorders in the U.S., the scale of the enterprise sets it apart. The company's approach is still relatively new and not widely known, meaning many experts in the field of childhood development have not vetted its effectiveness.\nBrain Balance says its nonmedical and drug-free program helps children who struggle with ADHD, autism spectrum disorders and learning and processing disorders. The company says it addresses a child's challenges with a combination of physical exercises, nutritional guidance and academic training.\nAn NPR investigation of Brain Balance reveals a company whose promises have resonated with parents averse to medication. But Brain Balance also appears to have overstated the scientific evidence in its messaging to families, who can easily spend over $10,000 in six months, a common length of enrollment.\nBrain Balance's metrics for consumer satisfaction are impressive. Customers rate the program, on average, an 8.5 on a 10-point scale in surveys, according to the company.\nThe ratings square with comments in online forums and in interviews NPR conducted with 18 parents who enrolled their children. Across the country, about three dozen centers are run by parents who began as happy customers.\nBrain Balance's website is where caretakers encounter the company's strongest pitch: dozens upon dozens of parent testimonials.\nBrain Balance Achievement Centers YouTube\nOne of the company's television commercials begins with a montage of formerly frustrated mothers. But, they all agree, Brain Balance put an end to their kids' challenges. One woman insists \"it will completely, absolutely, 100 percent change your life.\"\nAutism \"can become a thing of the past\"\nThe man who created Brain Balance, Robert Melillo, is often introduced as \"Dr. Melillo\" in media appearances. He has a doctorate and an active license in chiropractic. He is also acknowledged as an expert in the field of functional neurology, chiropractic's controversial alternative to mainstream neurology.\nMelillo's biography states he has master's degrees in neuroscience and clinical rehabilitation neuropsychology, though it does not say from where. A curriculum vitae for Melillo that NPR found on a website for chiropractic licensing boards says the master's in neuroscience came from the Carrick Institute for Graduate Studies, a chiropractic academy in Florida that isn't accredited by any of the agencies recognized by the Department of Education. His second master's degree is from a now-defunct program at Touro College, a private educational organization based in New York.\nThis isn't smoke and mirrors. This is real stuff.\nMelillo says it was during an intense period of research in the 1990s, while his own son struggled with attention issues, that he conceived of a single disorder to explain everything from autism to ADHD to dyslexia. He called it functional disconnection syndrome.\nAs he writes in his book, Disconnected Kids, the syndrome occurs when \"areas in the brain, especially the two hemispheres of the brain, are not electrically balanced, or synchronized.\" The particulars of this imbalance are not clearly defined in the book, but numerous metaphors — some involving concert orchestras with bad timing or tuning — paint a picture of a child's brain unable to communicate with itself.\nAccording to Melillo, a weak right hemisphere (the emotional half) can lead to autism and ADHD; a weak left hemisphere (the logical half) often causes learning disorders like dyslexia.\nAnd he argues in the book that for people who follow his program, \"ADHD, dyslexia, and even autism, among others, can become a thing of the past.\"\nHe even appears to see his program as the answer to societal problems.\nIn February, one day after the mass shooting at Marjory Stoneman Douglas High School in Parkland, Fla., Melillo used his public Facebook page to envision a world where Brain Balance had reached the shooter.\ntoggle caption Facebook/Screenshot by NPR\n\"I can't help but wonder if Brain Balance and Brain Integration could have prevented this tragedy,\" Melillo wrote in the post alongside a news report in which the shooter's relatives said the teenager had been diagnosed with autism and took medication.\n\"We have to make the whole world more aware of Brain Imbalances and how they can be helped especially in kids,\" he added. \"This is my mission now.\"\nWhat happens at Brain Balance\nStephanie and Natalie say they watched their older son from the other side of a two-way mirror as a Brain Balance staff member ran him through a series of tests during his baseline assessment. Later, they received his results: eight pages of ratings in unfamiliar categories.\n\"I have two master's [degrees] and a Ph.D., and I needed them explained to me,\" Natalie says. Their son had a weak right hemisphere. Additionally, his \"frontal lobe acquisition\" was lacking. His primitive reflexes were also in bad shape, according to the assessment, portions of which were shared with NPR.\nThe center recommended six months of one-hour sessions three times a week, a common course of intervention.\nBrain Balance's approach breaks down into three broad categories: academic, nutrition and sensory-motor.\nThe academic exercises focus on the same areas targeted by many after-school tutoring programs. The nutritional component recommends decreasing a child's intake of gluten, dairy and refined sugar.\nThe third, and most complex, prong of Brain Balance's intervention is its sensory-motor training, a diverse set of physical exercises. Parents and former employees describe activities like walking across balance beams, syncing actions with a computerized metronome and being spun in swivel chairs.\nA child demonstrates Brain Balance techniques on a TV program in Idaho. YouTube\nConsistent with Melillo's theory, Brain Balance focuses much of its sensory-motor training on one-half of the child's body to send strengthening signals up and across to the supposedly weak, opposite hemisphere of the brain. (Much of the human brain indeed maps to the opposite half of the human body.)\nFor instance, with a \"right brain weak\" child like Stephanie and Natalie's son, Brain Balance may have him wear a vibrating armband on his left biceps or eyeglasses that allow light only onto the left visual field. Or they may simply have him stand on his left leg.\nIt has not been uncommon for parents to enroll their children for at least six months, costing roughly $12,000. The company recently said its average enrollment is now about four months. Assessments and optional nutritional supplements and blood tests can add hundreds of dollars.\nThe program isn't covered by insurance. Brain Balance offers payment plans to parents who can't cover the cost immediately. As of publication, close to 200 families have solicited money from relatives and friends with GoFundMe.com campaigns.\nEnlarge this image toggle caption Chris Benderev/NPR Chris Benderev/NPR\nNatalie and Stephanie were quoted $5,000 for their first three months, with the option to re-up for more after.\n\"When you're talking about your child's self-esteem and knowing it's the most important thing, what are you going to do?\" Stephanie says. \"Maybe work a few more years and take a little bit out of your retirement so that maybe — if you nip this thing in the bud — he's able to have a better life going forward?\"\nThey dipped into their retirement savings and enrolled both their sons at a total cost of more than $15,000.\n\"Cutting edge\" science\nIn numerous media appearances, Melillo hasn't been shy about publicizing the strength of his program's scientific evidence.\n\"This isn't smoke and mirrors. This is real stuff. ... [Parents] are going to get real answers,\" Melillo told a radio host in 2010. \"We've shown in our centers that we can correct these problems completely. We've proved that in research,\" he said on TV in 2014. \"We use really cutting-edge brain science to address the issue,\" he said in 2016.\nYet a dozen experts in autism spectrum disorder, ADHD, dyslexia and childhood psychiatry interviewed by NPR all identified flaws in Brain Balance's approach.\nThey said the company's idea of imbalanced hemispheres was too simplistic and built upon the popular, discredited myth of the logical left brain and the intuitive right brain.\n\"It doesn't make sense,\" says Mark Mahone, a pediatric neuropsychologist at the Kennedy Krieger Institute in Baltimore. \"In virtually every activity that one does ... both hemispheres of the brain are very, very active. ... It's not as simple as just being a left- or a right-hemisphere problem. Nothing is that simple.\"\nEnlarge this image toggle caption Chris Benderev/NPR Chris Benderev/NPR\nAs for the three-pronged Brain Balance regimen, experts NPR spoke with said there is no solid evidence suggesting gluten, dairy or sugar consumption affects ADHD, autism or dyslexia. And although physical exercise may have modest impacts on inattention and tutoring can help in school, these interventions can be found elsewhere for much less money. No expert suggested either as a front-line remedy for ADHD or autism.\nDoctors and researchers NPR interviewed also questioned the diagnostic metrics Brain Balance uses.\nFor example, the company tests children for the primitive reflexes that drive infants to instinctively suckle or grab a finger. Natalie and Stephanie were told their son's lingering primitive reflexes were connected to his behavioral issues.\nBut multiple pediatricians said it is exceptionally rare for children older than 4 to retain any primitive reflexes.\n\"Typically by 1 year of age these primitive reflexes have disappeared,\" says Dr. Andrew Adesman, a developmental pediatrician at Cohen Children's Medical Center of New York. \"The major exception is children who have cerebral palsy.\"\nMelillo disagreed with the experts' opinions. \"I think they're completely wrong,\" he says.\n\"Pediatricians rarely look at primitive reflexes after infancy, but if they did, they will find that, in many cases, they are still there,\" he wrote in an email.\nMelillo also pushed back against the medical consensus that autism, ADHD and dyslexia aren't caused by hemispheric differences and that gluten doesn't affect such disorders.\n\"I can show you a lot of papers that actually say that there is a relationship between food sensitivities, gluten sensitivity and different types of issues and conditions,\" he says. \"So again, it depends on the expert.\"\n\"Evidence based\"?\nThere are two published studies of Brain Balance, which the company has said show that 81 percent of children with ADHD no longer displayed symptoms after three months in the program.\n\"We have two studies now,\" Melillo said on local TV in 2013. \"So that means that we qualify as what we call 'evidence based' at this point.\"\nBrain Balance of Edwardsville YouTube\nBrain Balance touted one of the studies on its blog with the headline, \"Control Study Shows Brain Balance Eliminates ADHD Symptoms.\"\nThe studies, however, have serious scientific shortcomings.\nMelillo, someone with a clear financial interest in the outcome, co-authored the first one.\nHe also had parents rate their own children's improvement in ADHD symptoms but didn't compare them with other kids who weren't in Brain Balance.\nWithout a control group, a study cannot definitively determine whether an intervention — a pill or procedure or program — is the reason for improvement or whether any change is simply the placebo effect.\nThe second study did feature a control group of children with ADHD who didn't do Brain Balance. But it compared them with the same children from the first study published years earlier instead of randomly assigning children into simultaneous treatment and control groups.\n\"My issue with these data is that there's no legitimate comparison for the treatment group, so we really don't know if [Brain Balance] helps,\" says Dr. Paul Wang, deputy director for clinical research at the Simons Foundation.\nThe experts NPR consulted took issue with other aspects of the studies as well.\nIt means absolutely nothing. ... What we have here, in my view, is a marketing piece.\nThe kids in the treatment and control groups differed in important ways, the experts said, rendering comparisons between them less meaningful. The two groups weren't drawn from the same centers; all of the treatment group was medicated while only 60 percent of the controls were; and at baseline the controls scored more severe on an ADHD rating scale.\nCuriously, even though the second study reused the treatment group data from the first study published years earlier, it reported different improvements on those same kids' test scores. The lead author on both studies, Gerry Leisman, a professor of neuro and rehabilitation sciences at the University of Haifa in Israel, explained one of the test score differences as a \"reviewer correction\" but did not provide explanations for any of the six remaining discrepancies.\nDr. James McGough, a professor of clinical psychiatry at UCLA's David Geffen Medical School, wasn't convinced by Brain Balance's published research. \"It means absolutely nothing. ... What we have here, in my view, is a marketing piece.\"\nAt least one state remains similarly unconvinced.\nIn 2015, Wisconsin's Department of Health Services determined Brain Balance had \"insufficient evidence\" to show it was a \"proven and effective treatment for individuals with autism spectrum disorder and/or other developmental disabilities,\" as the Milwaukee Journal-Sentinel reported. The state assigned Brain Balance to the second-lowest ranking on its five-tier system. The only lower ranking is for \"potentially harmful\" treatments.\nBrain Balance defends its approach\nAsked by NPR why Brain Balance hadn't been tested more thoroughly before its nationwide expansion began a decade ago, Melillo says the company was \"faced with a dilemma.\" While he did feel an obligation to validate his approach, he says he knew Brain Balance worked and didn't want to deprive his clients of its benefits while waiting for clinical trials. \"All these 25,000 families that we've helped, are they left suffering for years on end?\"\n\"What was done to date was commensurate to the resources that we had,\" says Aleem Choudhry, the chairman of Brain Balance and a managing member at Crane Street Capital, which invested in the franchise in 2013.\nThe company says ADHD was the only disorder to be studied thus far because — contrary to the opinion of all the experts contacted by NPR — it is neurologically equivalent to others like autism, dyslexia and OCD. If Brain Balance improves ADHD symptoms, Melillo says, \"then we believe that we're going to get the same results in the other types of issues, because they're really the same problem.\"\nMelillo also says the company's proprietary records from about 80,000 before-and-after client assessments qualify as corroboration. Melillo disputed the idea that his company's own data may require third-party review. \"Data is data,\" he says. \"There's no bias in the way we collect this.\"\nA new study of a computerized version of Brain Balance is underway at a Harvard-affiliated hospital and features a concurrent control group of children.\nBut Melillo says that questions about the research behind Brain Balance ultimately miss a larger, more important point.\n\"Families are out there struggling and suffering, and they don't really give a crap about the data or the research, to be quite honest,\" he says. \"When they go through it and they see the difference in their child ... that's what matters to them.\"\nChoudhry, the company's chairman, later clarified that \"we very much do care about the data.\"\nNo easy answer\nWith both their boys enrolled in Brain Balance, the routine for Stephanie and Natalie's family was frantic.\nThree times a week, Stephanie would ferry their sons against traffic to and from their sessions. Family dinners became more rushed. Soccer and swimming were abandoned.\nLost time is often a hidden cost of any form of treatment.\nThe mothers began observing changes in their older son. They say his previously weak sense of smell suddenly blossomed, first for brownies and then other foods. And he became less obsessed with characters he had repetitively sketched in his notebooks and imbued with rich inner lives. (His parents are torn as to whether this was a positive development.) He also advanced in certain Brain Balance measures, including his primitive reflexes.\nEnlarge this image toggle caption Hokyoung Kim for NPR Hokyoung Kim for NPR\n\"It's not that the needle didn't move on some of those dimensions,\" says Natalie. \"But if you step back at the 10,000- or 100,000-foot view and say, 'Is this kid different in a way that his life is going to be better or altered?' the answer is 'No.' OK, so now he can smell brownies that he couldn't smell before but is his life different?\"\nShe says she and her wife began to feel discouraged, thinking about the \"aura around this program that says your child's going to be different and better-adjusted.\"\nEric Rossen of the National Association of School Psychologists isn't surprised by Brain Balance's popularity as an option beyond what schools and insurance will cover.\nHe says many parents are frustrated by mainstream medicine's limits when it comes to complex disorders like autism. And schools are sometimes too strapped for resources to provide students with learning disorders all the help their parents may want.\n\"Most parents will say they would die for their children,\" Rossen says. \"So to say, 'I want to provide some therapy and pay a few thousand dollars' is quite short of dying for them and it's totally reasonable.\"\nBut he says \"the problem is they are easy prey for certain providers that can make promises that cannot necessarily be kept or are not necessarily backed by scientific data.\"\nFor parents looking to find evidence-based third-party interventions, experts suggest the What Works Clearinghouse, which is backed by the Department of Education, or the Substance Abuse and Mental Health Services Administration's own resource.\nBrain Balance's protocol doesn't appear to pose any physical or developmental harms to children. Instead, the program's costs may come in other ways: siphoning away time and money, and prolonging the hope in some parents that their child may one day shed his or her disorder.\nDr. Susan Hyman, a professor of pediatrics at the University of Rochester who has studied autism treatments for decades, says many alternative providers do this by offering an unrealistically simple solution.\n\"If you were to come to a traditional provider who said, 'You know I'm going to have you work really, really, really hard. ... I might have some drugs. Drugs have side effects. And 90 percent of the time, as an adult, he is still going to have autism,' that's a far less attractive message than 'I can help you.' \"\nBeyond Brain Balance\nBy the end of their older son's second three-month session at Brain Balance, Stephanie and Natalie had completely soured on it. They stopped believing that vibrating armbands and spinning in swivel chairs would translate to social success.\nThey decided to not continue.\nLater, in second grade, their older son began to work with a social worker at school who taught him how to have socially acceptable conversation with his peers.\nAnd Stephanie and Natalie did something else — the unthinkable.\nThey put their son on a medication called Strattera. Calibrating the proper dosage with tolerable side effects was a drawn-out process, but eventually they reached an equilibrium. Their older son ended up with a new diagnosis that has some overlap with autism but is more consistent with ADHD, which the medication treats.\nEnlarge this image Hokyoung Kim for NPR Hokyoung Kim for NPR\nToday, he seems to be navigating the world more successfully than before.\nOn a Saturday last August, their older son — who once plaintively asked his parents, \"Why aren't I invited to birthday parties?\" — had just wrapped up a party to celebrate turning 10 years old.\nNatalie and Stephanie had pizzas delivered and rented a truck lined with pleather sofas on one side and video game systems along the other. The children sat in pairs and used their greasy fingers to dispatch their avatars against each other in virtual battle.\n\"They were yelling my son's name and saying 'Come play with me! Come play with me!' \" recalls Natalie.\nThe birthday boy says he invited almost all of his friends, from school and camp, and all but one showed up, which was more than he could have ever imagined before.\n\"Because,\" he says before pausing. \"I haven't had friends for a bit. Until I got my medicine. I got some treatment. I got help. Now, I have tons of friends.\"\nThe reporter, Chris Benderev, can be contacted at cbenderev@npr.org.","url":"https://www.npr.org/sections/health-shots/2018/06/18/616805015/cutting-edge-program-for-children-with-autism-and-adhd-rests-on-razor-thin-evide"}
