{"authors":["Associated Press"],"date_download":"2018-10-22 22:40:15","date_modify":"2018-10-22 22:40:15","date_publish":"2016-01-11 03:30:07","description":"PASADENA, Calif. (AP) — The CW television network chief offered a strong vote of confidence Sunday to the slow-to-catch-on comedy \"Crazy Ex-Girlfriend,\" only...","filename":"data/vaneerConsumption/CWnetworkgivesvoteofconfidencetoGirlfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:367794a61d5f4f76a7b5cfa9de60ff69-3bWLCvS3pZb5eb4fce05c5fa5577-642_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3392883_CW-network-gives-vote-confidence-Girlfriend_1540248015.html","title":"CW network gives vote of confidence to 'Girlfriend'","title_page":"CW network gives vote of confidence to 'Girlfriend' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CW network gives vote of confidence to 'Girlfriend'\nPASADENA, Calif. (AP) — The CW television network chief offered a strong vote of confidence Sunday to the slow-to-catch-on comedy \"Crazy Ex-Girlfriend,\" only hours before actress Rachel Bloom's Golden Globe award for best actress in a comedy gave the show a burst of publicity.\nCritics love the quasi-musical where Bloom's character Rebecca Bunch moves to a strange town in pursuit of a former flame, but ratings have put it in the danger zone. The Monday night comedy is paired with \"Jane the Virgin\" on the CW schedule.\n\"We believe in the show,\" said Mark Pedowitz, CW president. \"We stand by this show. We believe there's a place on the schedule for this show, so we're going to give it a chance to be seen.\"\nRachel Bloom poses in the press room with the award for best actress in a TV series, comedy or musical, for her role in \"Crazy Ex-Girlfriend\" at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nBloom, in accepting the Globe Sunday night, thanked Pedowitz for taking on \"Crazy Ex-Girlfriend\" when several other networks rejected it. Bloom's award came a year after Gina Rodriguez won the same honor for starring in \"Jane the Virgin.\"\nNeither Pedowitz or Aline Brosh McKenna, executive producer of \"Crazy Ex-Girlfriend,\" said they believed the show needed to be retooled in order to attract more viewers.\nThe show's unusual nature — Bloom broke out into a French cabaret song about mental illness in one episode — could be an impediment to viewers. Each show usually has a couple of fully realized musical numbers.\n\"It's an out-of-the-box show so it's hard to get people to understand totally what it is,\" McKenna said. \"When you watch one episode, I think people get it.\"\nConsidering it's rarely an exact science to figure out what makes some shows succeed and others fail, it's not wise to let the creative process be influenced by theories on what can make it more popular, she said.\n\"You just try to make the best show that you can in the hope the people find it,\" she said.\nMeanwhile, fingers were crossed that co-creator Bloom's Golden Globe would get the show an extra boost of attention.","url":"https://www.dailymail.co.uk/wires/ap/article-3392883/CW-network-gives-vote-confidence-Girlfriend.html"}
