{"authors":["Lucy Crossley For Mailonline"],"date_download":"2018-10-22 22:55:12","date_modify":"2018-10-22 22:55:12","date_publish":"2016-01-28 11:20:59","description":"Steve Willey, 46, from Washington, Tyne and Wear, suffered catastrophic head injuries when he was attacked as he waited for a bus with wife Paula following an evening out in Newcastle.","filename":"data/vaneerConsumption/CyclistSteveWilleyisstillinhospitalcomaafteronepunchattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9CA8A00000578-0-image-a-14_1453979977338.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420739_Keen-cyclist-46-hospital-coma-one-punch-attack-bus-stop-two-days-Christmas_1540248912.html","title":"Cyclist Steve Willey is still in hospital coma after one-punch attack","title_page":"Cyclist Steve Willey is still in hospital coma after one-punch attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cyclist suffered a bleed to his brain and family don't know if he will recover\nA man is still in a coma in hospital more than a month after he was the victim of an alleged one-punch attack at a bus stop.\nKeen cyclist Steve Willey, 46, suffered catastrophic head injuries when he was attacked as he waited for a bus with wife Paula on December 23.\nThe couple had been enjoying a pre-Christmas drink in Newcastle and were on their way back home to Washington, Tyne and Wear.\nSteve Willey, 46, (pictured) is still in a coma in hospital more than a month after he was the victim of an alleged one-punch attack at a bus stop\nNissan worker Mr Willey was rushed to the Royal Victoria Infirmary in Newcastle where doctors discovered he had suffered a serious bleed to the brain.\nAfter being told there was a 50-50 chance Mr Willey would not survive, his family spent an agonising Christmas waiting for news while he remained in intensive care.\nOne month on, Mr Willey is still in a coma and while doctors say his condition has improved enormously, it is too early to tell how and when he will recover.\n'Steve is still in hospital and still hasn't regained consciousness,' said Mr Willey's brother Chris. 'He's come a long way but we are still in the dark with regards to what the outcome will be.\nNissan worker Mr Willey suffered catastrophic head injuries when he was attacked as he waited for a bus with wife Paula on December 23\n'We are just trying to be as positive as we can be. It's just a waiting game. All we can do is wait.'\nMr Willey had travelled to Newcastle to meet his wife after finishing his last shift at Washington's Nissan plant before the Christmas break.\nThe couple enjoyed a couple of drinks together before going to a coffee shop, then at around 8.15pm they decided to travel home.\nBut as they waitied for their bus, Mr Willey was allegedly attacked. Passers-by rushed to help before paramedics arrived to take an unconscious Mr Willey to hospital.\n'He was operated on within an hour and a half,' said father-of-one Chris, 32. 'He had a bleed on his brain but there's not a mark on him. The hospital have been fantastic.\n'The are keeping everything positive, but he's got a very very long road ahead of him.'\nMr Willey's brother Chris (left) is raising money for Newcastle's Royal Victoria Infirmary by hosting a marathon spinning session at Fausto Coffee Shop in Sunderland, owned by Louise Riddell (right)\nBoth the Willey brothers are both keen cyclists and Chris has organised a marathon spinning fundraiser for the hospital with staff at Fausto Coffee Shop in Sunderland, where the siblings are regulars.\nThe event, which starts on Friday, will see participants attempt to keep the bike's wheels moving continually during the cafe's opening hours for as long as possible.\n'As a brother Steve was always there to look out for us. He's just very likeable,' said Chris. 'The number of people that have come forward to help is humbling.\n'So many people have commented on how kind and good-natured a person he is. It is hard to put it into words. I have been blown away by the response.\n'I have no idea how much money we will raise for the RVI but it's just a gesture to show how grateful we are. The night he went into hospital we weren't sure he was going to survive. We just want to give something back.\n'I feel helpless because there's not a lot I can do for Steve. It's just frustrating.'\nNicholas Graham, 26, of Belsay Gardens, in Newcastle, has appeared before Newcastle Crown Court charged with causing grievous bodily harm.","url":"https://www.dailymail.co.uk/news/article-3420739/Keen-cyclist-46-hospital-coma-one-punch-attack-bus-stop-two-days-Christmas.html"}
