{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-22 23:05:09","date_modify":"2018-10-22 23:05:09","date_publish":"2016-01-28 11:44:48","description":"Cameron Primrose was making his way along one of London's 'cycle superhighway' routes, in Cable Street, when he rode across a junction and ploughed into another cyclist.","filename":"data/vaneerConsumption/Cyclistsmashesintomanonabikeinpainfulheadoncollision.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9FD3200000578-0-image-a-18_1453980867027.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420637_Nicest-crash-victims-Cyclist-smashes-man-bike-painful-head-collision-pair-politely-separate-ways_1540249509.html","title":"Cyclist smashes into man on a bike in painful head-on collision","title_page":"Cyclist smashes into man on a bike in painful head-on collision | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A cyclist captured the painful moment he ploughed head-first into another biker on his helmet-camera while travelling at speed in London.\nCameron Primrose was making his way along one of the capital's 'cycle superhighway' routes, in Cable Street, in the East End, when he rode across a junction.\nCameron, who takes full responsibility for the accident, claims he was distracted by a car as he approached the bike lane, where another cyclist was travelling.\nCameron Primrose made his way along one of London's 'cycle superhighway' routes and rode across a junction\nCameron claims he was distracted by a car as he approached the bike lane, where another cyclist was travelling\nThe clip shows the cyclist realising his mistake a moment too late and shouting 'sorry' as he slams into his fellow biker.\nCameron lands on the ground in a heap alongside the two bikes while the other cyclist backs away holding his face.\nThe pair, who remain remarkably calm throughout the exchange, talk for a few moments - Cameron admits that he thought the other man was going left.\nThankfully both escaped the incident uninjured and without damage to their bikes.\nThe cyclist realises his mistake a moment too late and shouts 'sorry' as he slams into his fellow biker\nCameron lands on the ground in a heap alongside the bikes while the other cyclist backs away holding his face\nSince appearing online some viewers have pointed out the lack of appropriate markings and 'poor design' of the turning where the crash occurred.\nWriting online, Cameron said: 'I still admitted full responsibility as it was my fault but in my (very weak) defence/excuse, I was slightly distracted by the car that just turned down a cycle lane.\n'By the time I saw the other cyclist approaching my thinking was, if I go left, he'll continue around the cycle lane's left hand edge, keeping to his left and I might just get past in front of him and he go round my back.\n'As he didn't follow the left hand edge my assumption put us on a direct collision course!! Whoops.\nThe pair talk for a few moments and Cameron admits that he thought the other man was going left\n'Luckily nobody hurt and the bikes were fine. I made sure he was OK and we shook hands and went on our way. No harm no foul.\n'To the cyclist I hit, if you're watching this I'm very sorry. It was totally my fault. At least we can get some crash footage entertainment out of it!'\nCameron later added, in reply to a comment: 'Wouldn't we all be hypocrites if we call out other people's mistakes but never acknowledge our own?'","url":"https://www.dailymail.co.uk/news/article-3420637/Nicest-crash-victims-Cyclist-smashes-man-bike-painful-head-collision-pair-politely-separate-ways.html"}
