{"authors":["Renae Reints"],"date_download":"2018-10-31 01:52:44","date_modify":"2018-10-31 01:52:44","date_publish":"2018-09-06 06:45:43","description":"The governor's race to the ballot in New York has been heated, with incumbent Andrew Cuomo facing off against a progressive newcomer. His rival, political first-timer Cynthia Nixon, appeared on Late Night with Seth Meyers Wednesday, promoting her…","filename":"data/vaneerConsumption/CynthiaNixonTellsSethMeyersThingsWouldBeDifferentIfSheJustLetTrumpHaveHerEmmy.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/eae6ee2d-7735-45ef-a333-e3f3750bd41b-getty-1017756404.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_cynthia-nixon-tells-seth-meyers-things-would-be-different-if-she-just-let-trump-have-her-emmy-11770685_1540950764.html","title":"Cynthia Nixon Tells Seth Meyers Things Would Be Different If She Just Let Trump Have Her Emmy","title_page":"Cynthia Nixon Tells Seth Meyers Things Would Be Different If She Just Let Trump Have Her Emmy","title_rss":"NULL","source_domain":"bustle.com","text":"The governor's race to the ballot in New York has been heated, with incumbent Andrew Cuomo facing off against a progressive newcomer. His rival, political first-timer Cynthia Nixon, appeared on Late Night with Seth Meyers Wednesday, promoting her platform just a week before New Yorkers will head to the polls. She took the opportunity to berate Cuomo's \"corruption\" and take a swipe at President Donald Trump, harking back to her years alongside him in the entertainment industry.\nNixon is historically known for her career as an award-winning actress; she previously starred as Miranda Hobbes in HBO's Sex and the City. As she sat down with Meyers, the talk show host showed her a picture of her accepting an Emmy in 2004. The man granting her the trophy was the one and only Trump.\nMeyers and Nixon joked about Trump's apparently tight grip on the Emmy, \"because, you know, he was nominated so many times and he never had one of his own,\" said Nixon.\n\"And in retrospect, I think that maybe if I had just let him have mine, we wouldn’t be in the situation that we’re in,\" she added, getting laughs from the audience. \"But hindsight is always 20/20.\"\nWhile she, too, is a celebrity turned politician, Nixon has always partially focused on community issues. She's been an activist as well as an actress, with a focus on education rights, LGBTQ issues, women's rights, and criminal justice — it's this energy she's bringing to the political arena.\nWith a highly progressive platform, Nixon is without a doubt in favor of a single-payer healthcare system with universal coverage. She's been criticized for failing to provide a budget for such a plan though, once telling the New York Daily News, \"Pass it and then figure out how to fund it.\"\nYou can't criticize Nixon for lacking passion, however. Her debate with Cuomo last week was fiery, full of harsh criticisms, and calls for more transparency from both sides. Nixon carried this fire to her interview on Late Night.\n\"We have a governor whose administration has been rife with corruption and if anything the last four years his administration has outdone itself,\" Nixon said of Cuomo, according to the New York Post.\nNixon is also passionate about protecting a woman's right to choose abortion. Her own mother underwent an abortion before they were legal, Nixon told Bustle earlier this summer, and it was \"horrible.\" Thus the political candidate is filled with \"terror\" at the thought of Trump's Supreme Court pick Brett Kavanaugh joining the country's top justices.\n\"I shudder to think how many women will try and give themselves abortions, because that’s what used to happen,\" Nixon told Bustle in July, considering the consequences if Roe v. Wade were to be repealed.\nThe New York primaries will be held on Sept. 13 with most polls open from 6 a.m. to 9 p.m. EST. Registered voters may find their polling location using the online search form provided by the New York State's Board of Elections.\nNixon was one of three powerful women speaking with Meyers Wednesday night. Her peers included actress Maggie Gyllenhaal and author Ingrid Rojas Contreras, whose debut book, Fruit of the Drunken Tree, came out this year.","url":"https://www.bustle.com/p/cynthia-nixon-tells-seth-meyers-things-would-be-different-if-she-just-let-trump-have-her-emmy-11770685"}
