{"authors":["Michael Lucchese"],"date_download":"2018-10-30 19:47:41","date_modify":"2018-10-30 19:47:41","date_publish":"2015-07-04 04:47:00","description":"Police report that they have arrested double the number of illegal immigrants at Czech international airports as they did last year.","filename":"data/vaneerConsumption/CzechAirportsReportMassiveInfluxofIllegalImmigrants.json","image_url":"https://media.breitbart.com/media/2015/07/czech-airport-prague-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_03__1540928861.html","title":"Czech Airports Report Massive Influx of Illegal Immigrants","title_page":"Czech Airports Report Massive Influx of Illegal Immigrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Police report that they have arrested double the number of illegal immigrants at Czech international airports as they did last year. Most of the aliens were arrested at Prague’s international airport, and a sizeable number of them arrived on planes from Turkey and Greece.\nIn the first five months of this year, 100 illegal aliens were arrested, compared to 42 arrested in the first five months of last year.\nCzech police detained a total of 2,418 illegal foreigners staying in the Czech Republic over the last five months, compared to 712 in 2014.\nJan Kučera, a police official tasked with handling cases related to foreigners in the Czech Republic, said that this influx was due to the massive waves of migration from Africa and the Middle East that Europe has been experiencing over the last year, as chaos in those regions grow and natives look for an escape from the violence and destruction.\nA total of about 137,000 have crossed the Mediterranean Sea to reach Europe over the last year—an 83 percent increase from last year. That figure is an astounding number, causing massive headaches for officials in Brussels, who fear they do not have the administrative capacity to deal with the influx.\nSeveral countries in the European Union have stepped up border security in response to the growing crisis.\nThe United Kingdom, for instance, increased security measures at the French town of Calais, which is connected to the UK via a tunnel system that runs beneath the English Channel.\nBritish Prime Minister David Cameron said that the government was specifically interested in adding more security personnel and sniffer dog teams, in addition to adding new fencing on that side of the Channel.\nEarlier this month, Breitbart News reported that Hungary announced plans to build a massive wall on their border with Serbia in order to keep out illegal immigrants.\nBoth Great Britain and Hungary have been condemned by EU member states and neighbors.\nThe French mayor of Calais blasted British attempts at improved border security, saying that, instead, the British government needs to focus on reforming their welfare system and improving identification procedures.\nIn reference to the Hungarian border fence, many EU states condemned it, decrying it as a violation of the EU’s principles.\n“Hungary’s decision is completely unacceptable to us,” Austrian interior minister Johanna Mikl-Leitner said.\nSerbia, which is not an EU member but is considering potentially entering the confederation, was furious with the Hungarian plans, going so far as to call the border fence the “new Berlin Wall.”","url":"https://www.breitbart.com/national-security/2015/07/03/czech-airports-report-massive-influx-of-illegal-immigrants/"}
