{"authors":["Ashley Collman For Dailymail.Com","James Wilkinson For Dailymail.Com"],"date_download":"2018-10-23 03:15:52","date_modify":"2018-10-23 03:15:52","date_publish":"2017-03-16 14:05:14","description":"Trevor Summers, 39, kidnapped his estranged wife Alisa Summers, 37, on Saturday and held her hostage for two days in Florida.","filename":"data/vaneerConsumption/Dadwrotemurderousnotetokidsafterkidnappingmom.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E547EAA00000578-0-image-a-54_1489673094975.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320312_Dad-wrote-murderous-note-kids-kidnapping-mom_1540264552.html","title":"Dad 'wrote murderous note to kids after kidnapping mom'","title_page":"Dad 'wrote murderous note to kids after kidnapping mom' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man who kidnapped his estranged wife and held her captive for two days may have been planning her murder, according to a creepy note he wrote to their five kids.\nTrevor Summers, 39, kidnapped his wife Alisa, 37, over the weekend and told their kids that he was taking her on a trip 'to the islands'.\nBut the next two days were anything but a vacation for Mrs Summers, who was tied up and gagged as her husband tried to hire a charter boat from Florida to an unknown destination.\nPolice rescued the 37-year-old mother and arrested her husband on Monday, after a witness spotted the couple's car and called police.\nIt has since been revealed that cops found a disturbing note left behind in the car, written by Mr Summers and addressed to their five children.\nScroll down for video\nTrevor Summers (center) appeared in court for the first time on Wednesday, after he was arrested on Monday for kidnapping his wife and holding her hostage for two days\nAlisa Summers said she feels lucky to have survived the two-day nightmare\nIn the note, Mr Summers spoke as if he and his wife were already dead and lamented the break down of their marriage.\n'So we have ended it for your sake,' he wrote. 'We wish you the best in everything you do and will be watching you from heaven.'\nMr Summers also appeared in court for the first time on Wednesday, and was ordered held in jail pending a bond hearing next Monday.\nHe wore a vest to the hearing normally reserved for inmates on suicide watch.\nMeanwhile, his wife has spoken out to reporters, saying she feels lucky to have survived.\n'I'm doing amazing. I can't believe that I'm alive,' Mrs Summers told Fox 13.\n\"I'm just so thankful for everyone who was following and the sharing the story' she added. 'I could actually feel everyone's prayers during it all and that's what got me through it.'\nAfter arresting Mr Summers, police say they found a note left behind in the couples' car, written to their five kids. The family of seven pictured above\nMrs Summers (left and right) was kidnapped early Saturday morning by her estranged husband (left), police said. She was seen trying - and failing - to escape on Saturday night\nIn February Alisa told police he had kept her in his home at knifepoint for hours. He denied the claim and police did not prosecute\nPolice were alerted to Alisa's plight on Saturday at 9:05pm, when she was seen bolting from her car outside a Walgreens on Fishhawk Crossing Boulevard only to be bundled back in by a man.\nBut police said her ordeal began more than 15 hours earlier, as part of a twisted plot by her husband.\nTrevor Summers has been separated from his wife since at least November, when she left him behind in Riverview and moved to Valrico, around 20 minutes away, with the children.\nPrior to her kidnapping, Trevor had been secretly communicating with their 14-year-old daughter, Gee said.\nHe asked the girl, who is not being identified, to leave a window open in Alisa's Valrico home so that he could enter early Saturday morning, the sheriff continued.\nMr Summers had told the girl he just wanted to head over and speak to Alisa, Gee claimed, and entered early in the morning, before telling the girl to wait in his car outside.\nAt 5:30am Saturday he told the girl to drive her siblings to his Riverview home, 20 minutes away, saying he was going to speak to their mom over the course of the next day.\nPolice were only notified 15 and a half hours later, at 9:05pm, when the Walgreens witness saw Alisa with her hands tied, trying to escape from her dark-blue Saturn Outlook. Mrs Summers said they stopped at the store to get her cold medication.\nA fruitless day of searching followed, but on Monday morning a citizen spotted the vehicle in Ruskin.\nThe car drove a mile away and parked outside a house, but details given by a witness helped police isolate, locate and surround it.\nCops say Trevor manipulated his 14-year-old daughter into leaving open a window in Alisa's home so he could sneak inside and kidnap her mom on Saturday morning\nUniformed and plain-clothes deputies converged on the address. Gee said Mr Summers stayed in the front seat while his wife exited from the rear.\nMr Summers resisted arrest, Gee said, and was hospitalized with a non-life-threatening knife wound to the throat.\nHis wife also had a cut on her wrist, sustained during the ordeal.\nPolice don't yet know what Trevor Summers' long-term plans were or why they were in Ruskin, but said those questions will be raised with Alisa.\nTrevor has been hit with six charges including attempted murder, kidnapping, theft of his wife's vehicle and a violation of a domestic injunction she had already taken out on him.\nTrevor told his daughter to drive her siblings to his house by herself at 5.30am, cops claim. He told her he wanted to talk to Alisa alone - but then he took the mom\nAs the search for the missing woman intensified over the weekend, it emerged that she told police last month that her husband threatened her with a knife.\nWhen asked whether sheriff's deputies had not believed her claim, he said the situation was complicated by Mr Summer's conflicting statement, in which he denied her claim and said she shoved one of their children.\n'The legal standards that we have to get to are very tough,' he said.\nThe couple - whose children, aged three to 14, who are now being cared for by Mr Summers' father - had suffered a deteriorating relationship over the past six months, including claims of violence.\nOn October 31 she asked a judge for a domestic violence injunction, but her request was dismissed.\nIn November, her Facebook page says, she moved to Valrico - around 20 minutes from her husband in Riverview - and in December she filed for divorce.\nChillingly, on February 21 she filed for another protection order, claiming that after she had gone to his home to discuss a divorce settlement, her husband had threatened her with a knife.\nAlisa was seen trying to bolt from her car (pictured) outside a Walgreens on Saturday night. She failed, but police were called in. They were in the car when found Monday\nShe claimed he had held her against her will, and threatened to tie her up with duct tape and rope.\nThe following day, he filed for a protective order against her, saying she had made up the claims and had angrily pushed their 12-year-old son into a corner.\nPolice made no arrests because they only had the two statements to act on.\nSpeaking on Monday morning, Mr Summer's own lawyer, Hope Lefeber, said she was shocked to hear the claims about her client.\nShe said he was a Christian man with no violent criminal record.\n'I know he always wanted to work out his marriage,' she said.\nThe breakdown of the couple's relationship may well have been spurred on by Mr Summers' conviction for wire fraud and conspiracy on September 16 last year.\nSummers, who was to be sentenced Wednesday, pleaded guilty to trying to defraud investors out of at least $345,000 with a scheme to print advertisements on straws.\nTrevor pleaded guilty in September to wire fraud and conspiracy charges after prosecutors said he tried to con at least $345,000 out of investors in his business\nAlisa was seen screaming outside this Walgreens, around 20 minutes from Trevor's home. She was found two days later, 25 miles away in Ruskin\nOne of his victims, high school friend Krissy Flynn, 39, invested $10,000 in his scheme, and says he was 'brilliant but weird'.\nHe bought cell phones for his staff on the project, but the phones ran out when bills went unpaid.\n'I don't trust this guy for a second,' Flynn said. 'He's a brilliant person, and he knows how to scam money out of people.'\nA federal lawsuit against him in 2008 said he had more than 20 civil suits filed against him and that he'd filed for bankruptcy three times between 2004 and 2008.\nIt also claimed he had served probation for minor charges such as passing bad checks.\nAnd in 2011 he lost a $4milion judgement although it's not known whether the plaintiffs collected.","url":"https://www.dailymail.co.uk/news/article-4320312/Dad-wrote-murderous-note-kids-kidnapping-mom.html"}
