{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 20:51:48","date_modify":"2018-10-22 20:51:48","date_publish":"2017-03-16 00:00:18","description":"The judges said that in the ‘seismic year’ of Brexit, the Mail was a ‘must-read’ across the political spectrum with a ‘strong and provocative voice’ that dominated the narrative and never wavered.","filename":"data/vaneerConsumption/DailyMailcrownedNewspaperoftheYearatPressAwards.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/23/3E4F859600000578-0-image-a-38_1489622258282.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/home_article-4318338_Daily-Mail-crowned-Newspaper-Year-Press-Oscars_1540241508.html","title":"Daily Mail crowned Newspaper of the Year at Press Awards","title_page":"Daily Mail crowned Newspaper of the Year at Press Awards | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Daily Mail has triumphed at the annual Press Awards, regarded as the Oscars of British journalism, by winning Newspaper of the Year.\nThe judges said that in the 'seismic year' of Brexit, the Mail was a 'must-read' across the political spectrum with a 'strong and provocative voice' that dominated the narrative and never wavered.\nAs well as the newspaper's win in the prestigious overall award, members of the Mail's formidable team won three individual awards and were highly commended in four separate categories.\nWinners: Peter Oborne, left, won the Columnist of the Year (popular) category while Stan 'Mac' McMurty was hailed as 'just superb' as he was awarded Cartoonist of the Year\nAccepting the award, Paul Dacre, Fleet Street's longest-serving editor, paid tribute to 'the incredibly hard-working, incredibly brilliant journalists' on the Mail and thanked the newspaper industry, which he said has 'still got a hell of a lot of life left in it'.\nUnder Mr Dacre, the Mail has now won the Newspaper of the Year at the British Press Awards seven times – more than any other title.\nIn their citation for the latest accolade, the judges said of the Mail: 'In the seismic year of Brexit, the battle for No 10 and campaigning journalism, the winner had its finger on the pulse of the national conversation. Not only did it shape both the agenda and the narrative, it reflected the temper of a large part of the country in a year of political upheaval. It was a must-read across the political and public spectrum and its strong and provocative voice never wavered.\n'From crusading reports on press freedom to Brexit, the sepsis scandal, the madness of drivers using mobile phones, wasteful foreign aid spending, betrayal of Afghan interpreters, the harm caused by 'plastic poison' and the battle to end the witch-hunt against British troops, the conviction of this paper's commentary and campaigning in 2016 was only matched by its energy.\n'It is also never afraid to have a strong opinion. It is the job of a newspaper to hold power to account and to forensically question and probe those who act in our name. The decision of the judges was that it dominated the narrative and produced agenda-setting and stand-out coverage in 2016.'\nThe Mail dominated in the Columnist of the Year (popular) category, in which the judges were 'as ever, impressed by the exceptional standard of entries'.\nDominic Lawson was highly commended for 'having strong views always written with a passion'. But it was the newspaper's Peter Oborne who took the award for what the judges described as 'hard-hitting gritty columns which look at topics from a diverse viewpoint'.\nThe Mail's long-serving and incomparable Mac – Stan McMurtry – was hailed as 'just superb' by the judges as he was awarded Cartoonist of the Year for his 'beautifully drawn, clever cartoons that excelled in a supreme field'.\nIt was another great night for our stellar team of sports journalists too, with Andy Hooper being crowned Sports Photographer of the Year for the fourth time at the awards, whose full title is the Society of Editors National Press Awards, presented at the Hilton hotel on London's Park Lane on Tuesday night.\nThe judges said Hooper 'produced excellent images that captured the true essence of sport – nothing stood still'. Defence Correspondent Larisa Brown was highly commended in the Specialist Journalist of the Year category after this paper's campaign to end the witch-hunt against British soldiers accused of mistreating civilians in Iraq.\nThe judges described her work as a 'cracking example of special reporting in the defence arena'.\nThe Mail's Frances Hardy was praised for a series of 'superb and compelling' reads as she was highly commended in the Interviewer of the Year (popular) category.\nMartha Kelner was highly commended in the Sports Journalist of the Year category for exposing bullying in British cycling. The judges said: 'Her coverage has had a great impact on the sport of cycling which had to examine its culture from the top down.'","url":"https://www.dailymail.co.uk/home/article-4318338/Daily-Mail-crowned-Newspaper-Year-Press-Oscars.html"}
