{"authors":["Daily Mail Comment"],"date_download":"2018-10-22 22:01:02","date_modify":"2018-10-22 22:01:02","date_publish":"2016-01-11 02:05:56","description":"Will the merciless hounding of our soldiers over spurious allegations of misconduct in Iraq ever cease? Nearly 13 years on lawyers are pursuing a staggering 1,154 compensation claims.","filename":"data/vaneerConsumption/DAILYMAILCOMMENTGraspinglawyersandagrotesquebetrayal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/01235D37000004B0-0-image-a-18_1452477807728.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3393262_DAILY-MAIL-COMMENT-Grasping-lawyers-grotesque-betrayal_1540245662.html","title":"DAILY MAIL COMMENT: Grasping lawyers and a grotesque betrayal","title_page":"DAILY MAIL COMMENT: Grasping lawyers and a grotesque betrayal  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Will the merciless hounding of our soldiers over spurious allegations of misconduct in Iraq ever cease?\nNearly 13 years after Tony Blair propelled Britain into a calamitous war against Saddam Hussein, money-grabbing lawyers are pursuing a staggering 1,154 compensation claims against members of the Armed Forces, with allegations ranging from mistreatment of prisoners to unlawful killing.\nAnd even though most of the accused soldiers have already been cleared by military inquiries, and some by civilian courts, they are being made to prove their innocence again and again to a dizzying array of legal bodies.\nLawyers are pursuing 1,154 compensation claims against members of the Armed Forces (file photo)\nFirst there is the Iraq Historic Allegations Team, created by the Ministry of Defence in 2010 to review abuse claims, then the Iraq Fatality Investigations unit – a kind of quasi-inquest headed by a High Court judge – then, for the most serious cases, the threat of prosecution by the International Criminal Court.\nAnd even after all that, the soldiers may still have to defend themselves against damages claims in the civil courts.\nThis appalling witch-hunt has so far cost around £100million – though, significantly, there has not been a single criminal conviction and IHAT has made just one minor finding of abuse out of 18 cases examined.\nSo who is paying the bills? You guessed it, the British taxpayer. The investigators are paid by the Government, the lawyers through legal aid, and successful claimants with a fat compensation cheque.\nThere are also dubious agents who scour Iraq for new ‘victims’. They not only receive money from the lawyers but also demand a cut of any damages awarded.\nSo a nice little earner for everyone concerned, except the poor soldiers, whose lives are left in a Kafka-esque limbo for years on end.\nWould any other country show such ruthless determination to persecute its own dedicated servicemen and women?\nThe Mail has always made clear that British soldiers are not above the law and should be held to account for any wrongdoing. But once cleared by the due process of military and civil law, they should be allowed to get on with their lives.\nIn the name of Queen and country, they risked being killed or maimed in a brutal and dirty war. Abandoning them now to the mercy of rapacious, ambulance-chasing lawyers and their grasping clients is a grotesque betrayal.\nEUROPE'S REAL CRISIS\nDAVID Cameron expressed confidence yesterday that he was close to the deal he has been seeking with European leaders before setting a date for the EU referendum. But how paltry – and frankly irrelevant – his demands seem in the light of the deepening immigration crisis.\nAs Germany reels from mass attacks on women and several EU countries reject free movement within Europe by restoring border controls, it’s clear the one burning question across the continent is how to cope with the sheer numbers flooding in.\nYet all the Prime Minister wants from Brussels is a temporary restriction on migrant welfare payments, some minor bureaucratic reforms and a vague exemption from ‘ever-closer union’.\nBritain must regain sovereignty over its own borders. Without it, we simply can’t control immigration.\nWhen will Mr Cameron finally accept this ineluctable fact?","url":"https://www.dailymail.co.uk/debate/article-3393262/DAILY-MAIL-COMMENT-Grasping-lawyers-grotesque-betrayal.html"}
