{"authors":["Daily Mail Comment"],"date_download":"2018-10-22 21:12:18","date_modify":"2018-10-22 21:12:18","date_publish":"2017-04-26 01:18:17","description":"Opposition Brexit spokesman Sir Keir Starmer is spoken of as his party’s great white hope to lead a revival after the Corbyn nightmare. If so, heaven help Labour!","filename":"data/vaneerConsumption/DAILYMAILCOMMENTIsSirKeirthebestLabourcando.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/1664CB1200000514-0-image-a-4_1493165535139.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-4445972_DAILY-MAIL-COMMENT-Sir-Keir-best-Labour-do_1540242738.html","title":"DAILY MAIL COMMENT: Is Sir Keir the best Labour can do?","title_page":"DAILY MAIL COMMENT: Is Sir Keir the best Labour can do? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Opposition Brexit spokesman Sir Keir Starmer is spoken of as his party’s great white hope to lead a revival after the Corbyn nightmare. If so, heaven help Labour!\nOutlining his party’s stance on EU withdrawal, the former Director of Public Prosecutions proved himself wholly out of his intellectual depth – incoherent, self-contradictory, achingly dull and peddling a blatantly fraudulent prospectus.\nIn one breath, he pledged to respect the public’s vote for Brexit and to end the free movement of people.\nOpposition Brexit spokesman Sir Keir Starmer is spoken of as his party’s great white hope to lead a revival after the Corbyn nightmare. If so, heaven help Labour\nYet in the next, he refused to rule out staying in the single market and the customs union – though this would keep us subject to European judges and stop us striking trade deals in the wider world. What’s more, he would also allow European workers to retain free access to Britain.\nIn other words, Labour is in favour of both leaving the EU and remaining in it.\nBut this was barely the start of Sir Keir’s ineptitude. On day one of a Labour government, he said, the party would guarantee the rights of EU citizens in Britain, asking nothing in return to protect the million-plus British expats in Europe.\nMeanwhile, he would retain EU laws and red tape. And for good measure, he would let MPs demand renegotiations – giving our partners a powerful incentive to offer an unacceptable deal and possibly delaying withdrawal for years.\nIf this is the best Sir Keir can offer, mightn’t Labour just as well stick with Mr Corbyn?\nCriminal betrayal\nIf they believed in good faith that British troops committed atrocities against innocent Iraqis, law firm Leigh Day could claim a shred of justification for hounding our soldiers through courts and tribunals.\nBut now even this excuse for their ambulance-chasing is looking thin.\nFrom left: Anna Crowther, acting senior partner Russell Levy, Martyn Day, Sapna Malik and managing partner Frances Swaine from law firm Leigh Day, arriving at a Solicitors Disciplinary tribunal\nEvidence has emerged that the firm’s solicitors pursued false allegations – subjecting soldiers to years of torment, while costing taxpayers millions – despite having powerful reasons to believe the accusers were lying insurgents.\nAs Leigh Day lawyers face 19 charges of misconduct, which they deny, the Solicitors Disciplinary Tribunal has the power to strike them off. But as Colonel Richard Kemp argues on this page, this matter cannot be allowed to rest there.\nIf they are found guilty of knowingly soliciting and spreading false evidence against those who risk their lives for us, they must surely face criminal charges.\nA stranger to truth\nIrony of ironies! The world’s most prolific purveyor of false information, Wikipedia co-founder Jimmy Wales, has announced plans for a current affairs website – to tackle the scourge of fake news.\nLeave aside that his online encyclopaedia is a byword for inaccuracy.\nWikipedia co-founder Jimmy Wales, has announced plans for a current affairs website – to tackle the scourge of fake news\nA campaigner against Brexit – who last year joined the board of The Guardian and is married to Tony Blair’s former diary secretary – Wales was found in 2005 to have censored his own Wikipedia entry, removing references to the pornographic nature of a search engine he ran.\nHis site has even sought to ban the Mail as a source, while continuing to endorse Russian and Chinese propaganda outlets.\nCan the BBC explain why it gave Wales eight minutes’ peak airtime to promote his new venture? Or why anyone should trust this hypocrite to tell the unexpurgated ‘politically neutral’ truth?\nn IN a victory for the Mail, the BBC has been told to end the bullying tactics of licence fee collectors, as it emerges that seven in ten prosecutions for evasion are against women. In this multi-channel age, the licence fee becomes ever harder to justify. Aggressive and unfair enforcement makes it more indefensible still.","url":"https://www.dailymail.co.uk/debate/article-4445972/DAILY-MAIL-COMMENT-Sir-Keir-best-Labour-do.html"}
