{"authors":["Daily Mail Comment"],"date_download":"2018-10-22 20:26:18","date_modify":"2018-10-22 20:26:18","date_publish":"2016-01-29 01:37:32","description":"DAILY MAIL COMMENT: What the Tories still do not seem to understand is how toxic it is for their rich tech-company friends to pay a tax rate of 3 per cent while small UK businesses are hounded for every penny.","filename":"data/vaneerConsumption/DAILYMAILCOMMENTCosytaxdealsaresotoxicfortheTories.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/2FE358DC00000578-0-image-a-62_1454031260838.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3422075_DAILY-MAIL-COMMENT-Cosy-tax-deals-toxic-Tories_1540239978.html","title":"DAILY MAIL COMMENT: Cosy tax deals are so toxic for the Tories","title_page":"DAILY MAIL COMMENT: Cosy tax deals are so toxic for the Tories  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Almost a week has passed since George Osborne so ill-advisedly declared HMRC’s sweetheart deal with Google a ‘victory’, and still the damaging revelations keep pouring out of Whitehall\nAlmost a week has passed since George Osborne so ill-advisedly declared HMRC’s sweetheart deal with Google a ‘victory’, and still the damaging revelations keep pouring out of Whitehall.\nToday the Mail discloses how, on a 2013 trip to the US, Treasury Minister David Gauke tried to schmooze a room-full of tech giants with promises of ‘low’ taxes and HMRC ‘relationship managers’ to help them avoid ‘expensive litigation’.\nIncredibly, the cost to the Exchequer of this charm offensive (£5,736) was more than the total tax bill paid by Facebook (£4,327) in the UK the following year!\nMeanwhile, the Chancellor yesterday dug himself deeper into a hole, repeating his risible claim that the £130million paid by Google is ‘a major success’.\nHe argues that he has a better record than Labour in shaking a few coppers from the deep pockets of the internet firm, a claim that would have more validity if the upper echelons of the Tory Party had not enjoyed such close links with it.\nIndeed, what the Conservatives still do not seem to understand is how toxic it is for their rich and powerful tech-company friends to be paying a tax rate of three per cent, while small businesses in Britain are hounded mercilessly for every penny.\nThe fact that this debacle has occurred just as millions are losing sleep to fill in self-assessment forms, on pain of punitive fines if they are late, adds further insult.\nThose people might care to reflect on how much tax HMRC raised annually in the UK from Starbucks (£8.1million), Apple (£11.8million) and Amazon (£11.9million) – all of whom have global revenues of tens of billions of pounds.\nTime to walk away?\nAfter months of phoney rows and ‘crisis talks’ over the Prime Minister’s referendum negotiations, Brussels yesterday revealed it is ready to offer Britain an ‘emergency brake’ to control immigration.\nDoubtless the idea will be presented as a great victory by David Cameron, who is desperate to hold the vote in June, before the summer months bring even greater migrant chaos to the continent.\nIn reality, however, Europe’s ‘concession’ is next to useless.\nNot only would the new rules do nothing to prevent migrants travelling here in the first place, they’d merely allow a halt on the payment of certain benefits.\nAfter months of phoney rows and ‘crisis talks’ over the Prime Minister’s referendum negotiations, Brussels yesterday revealed it is ready to offer Britain an ‘emergency brake’ to control immigration\nMost farcically, Brussels – not Britain’s democratically-elected Parliament – will have the power to decide when the ‘brake’ could be applied.\nSuch meaningless gestures, frankly, insult the intelligence.\nInstead of settling for gimmicks which will do nothing to restore Britain’s borders, wouldn’t Mr Cameron be better walking away for now – and telling the crumbling EU to come back when it has something meaningful to offer?\nBut then, as Mr Cameron has made it clear he is determined to remain in the EU, he has lost what little negotiating power he might ever have had.\nA wasted generation\nIn a devastating report, the OECD warns that, by packing courses with students entirely unsuited to academic studies, universities are undermining the ‘currency’ of degrees – with our graduates sixth from bottom of its international league tables for literacy and numeracy.\nBelatedly, ministers are realising the folly – pursued by Labour and the Tories – of trying to push youngsters off to university, often to study dubious subjects, rather than providing them with the alternative of high-quality vocational apprenticeships.","url":"https://www.dailymail.co.uk/debate/article-3422075/DAILY-MAIL-COMMENT-Cosy-tax-deals-toxic-Tories.html"}
