{"authors":[],"date_download":"2018-10-30 01:19:45","date_modify":"2018-10-30 01:19:45","date_publish":"2017-01-05 13:16:25","description":"The Daily Mail bias rating is Right. As of May 2017, a slight majority of AllSides users who voted on this rating agreed. Of those who disagreed, the average rating was on the cusp between a Lean Right and Right bias rating. As of right now, there is not sufficient evidence to change the Right bias rating.","filename":"data/vaneerConsumption/DailyMail.json","image_url":"https://www.allsides.com/sites/default/files/logo-all-sides-20px_1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/allsides.com/news-source_daily-mail_1540862385.html","title":"Daily Mail","title_page":"Daily Mail Media Bias | AllSides","title_rss":"NULL","source_domain":"allsides.com","text":"The Daily Mail bias rating is Right. As of May 2017, a slight majority of AllSides users who voted on this rating agreed. Of those who disagreed, the average rating was on the cusp between a Lean Right and Right bias rating. As of right now, there is not sufficient evidence to change the Right bias rating.\nMore on Daily Mail\nThe Daily Mail is a British daily tabloid newspaper with much of its coverage about entertainment and pop news, and politically is a traditional supporter of Conservatives. It also considers BBC News to have a left bias. It is owned by the Daily Mail and General Trust and is published in London. It was first published in 1896 by the Harmsworth brothers, Alfred and Harold. It is the United Kingdom's second-largest selling daily newspaper after The Sun. In its founding, the Daily Mail was aimed at the literate lower-middle class and had a high volume of advertising revenue. Over time, it has produced many notable stories, but has also come under fire for a variety of controversies, including accusations of homophobia, racism, and sexism.\nSources:\nWikipedia\nDaily Mail","url":"https://www.allsides.com/news-source/daily-mail"}
