{"authors":["Breitbart News"],"date_download":"2018-10-30 18:27:59","date_modify":"2018-10-30 18:27:59","date_publish":"2016-03-29 22:54:54","description":"A reporter from the Daily Mail asked Senator Ted Cruz to state on the record that he has always been faithful to his wife Heidi Cruz.","filename":"data/vaneerConsumption/DailyMailAsksTedCruzCanYouJustSayIveAlwaysBeenFaithfultoMyWife.json","image_url":"https://media.breitbart.com/media/2016/03/ted-cruz-carly-fiorina.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_29__1540924079.html","title":"Daily Mail Asks Ted Cruz: Can You Just Say 'I've Always Been Faithful to My Wife'?","title_page":"Daily Mail Asks Ted Cruz: Can You Just Say 'I've Always Been Faithful to My Wife'? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"From the Daily Mail:\nTed Cruz declined to answer a question on Monday about whether he has ever been unfaithful to his wife Heidi.\n‘Senator Cruz,’ DailyMail.com asked him, ‘can you please swat down more definitively this National Enquirer piece by telling us on the record that you’ve never been unfaithful to your wife?’\nThe National Enquirer published a story last Wednesday that speculated about five women with whom the Republican presidential candidate was rumored to have had extramarital affairs.\nCruz has batted down the specifics of the story on numerous occasions since it appeared in supermarket checkout lanes.\nBut instead of making a blanket declaration that he has been faithful during the entirety of his 14-year marriage – a move that would effectively end the vicious news cycle – Cruz stood silently as campaign surrogate Carly Fiorina leapt in to intercept the question and change the subject.\n…\nDailyMail.com directed the question a second time at Cruz when Fiorina had finished.\n‘Senator I’m sorry, this is a very serious question about your character,’ the second question came.\n‘Will you just – if the answer is, “Yes, I’ve always been faithful to my wife,” can you just say so please?’\nHis practised answer stuck to the more limited denial that the National Enquirer story was false, calling it ‘complete garbage.’\n‘It is total lies, it was planted by Donald Trump’s henchmen, and I don’t think the people of Wisconsin or the people of America have any interest in tabloid trash.’\nRead the rest of the story here.","url":"https://www.breitbart.com/politics/2016/03/29/daily-mail-asks-ted-cruz-can-you-just-say-ive-always-been-faithful-to-my-wife/"}
