{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 21:43:31","date_modify":"2018-10-22 21:43:31","date_publish":"2016-01-28 08:49:03","description":"Daisy Lowe and her new beau Thomas Cohen, 25, were all smiles as they stepped out to celebrate the model's 27th birthday on Wednesday night.","filename":"data/vaneerConsumption/DaisyLoweleavesrestauranthandinhandwithnewbeauThomasCohen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/08/30A7A26D00000578-0-image-a-8_1453968435431.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420506_Daisy-Lowe-leaves-restaurant-hand-hand-new-beau-Thomas-Cohen-couple-enjoy-birthday-meal-grandparents_1540244611.html","title":"Daisy Lowe leaves restaurant hand in hand with new beau Thomas Cohen","title_page":"Daisy Lowe leaves restaurant hand in hand with new beau Thomas Cohen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Since going public with their romance last week, they've been been spotted looking smitten together on a number of occasions.\nAnd Daisy Lowe and her new beau Thomas Cohen, 25, were all smiles as they stepped out to celebrate the model's 27th birthday on Wednesday night.\nThe couple went for dinner at J Sheekey's in Covent Garden, London, where they were joined by Daisy's grandparents.\nScroll down for video\nHappy birthday! Daisy Lowe and her new beau Thomas Cohen, 25, were all smiles as they stepped out to celebrate the model's 27th birthday on Wednesday night at J Sheekey in Covent Garden, London\nWalking hand in hand as they strolled down the street, the pair's body language suggested they were truly comfortable in one another's company.\nRock chick Daisy wore a flowing black dress with a cream lace bust underneath an open black leather jacket.\nHer sleek raven tresses fell down her front, while she opted for minimal make-up allowing her natural beauty to shine through.\nSide by side: Walking hand in hand as they strolled down the street, the pair's body language suggested they were truly comfortable in one another's company\nHappy days: Rock chick Daisy wore a flowing black dress with a cream lace bust underneath an open black leather jacket\nBlossoming romance: Since going public with their romance last week they've been been spotted looking smitten together on a number of occasions\nKeeping things co-ordinated she sported a pair of leather boots and accessorised with a low-hanging silver necklace.\nUnderneath her left arm she carried a gift bag, possibly a present from Thomas.\nThe former S.C.U.M frontman looked dapper in a knee-length coat worn over a brown suede shirt.\nThe clean-shaven father-of-two completed his outfit with a pair of smart trousers and brown suede slip-ons.\nTalking to Now magazine, Daisy said: 'I'm never going to talk about my personal life, never,' but she did say: 'I am so happy, thanks, yeah. I'm about good vibes all around.'\nRock chick: Keeping things co-ordinated she sported a pair of leather boots and accessorised with a low-hanging silver necklace\nReason to smile: Daisy recently revealed she was 'happy' with her personal life\nPerfect match? The clean-shaven father-of-two completed his outfit with a pair of smart trousers and brown suede slip-ons\nThe daughter of Pearl Lowe and rocker Gavin Rossdale also spoke to GQ magazine recently in which she spoke about her relationships with men in general.\nShe said in the past: 'I've been seeing men that either remind me of my mother, or remind me of my father. I either end up care-taking or being abandoned, so I've had enough of my romantic instincts. I need to date away from type.'\nMeanwhile, Thomas performed his first solo gig on Monday night, with Daisy watching from the wings.\nThe singer was left bereft following the death of his wife Peaches Geldof in 2014, who was also Daisy's best friend.\nTight grip: The couple interlocked their fingers with Thomas leading the way\nHaving a chat: Tom was deep in conversation on his phone as he walked through Covent Garden\nFeeling good: Daisy wore a huge smile on her face throughout the evening and clearly enjoyed her birthday\nAnd while the rocker may have moved on romantically, he proved his beloved spouse will always be in his heart as he appeared to pay tribute to the late star during his gig.\nHe played songs from his forthcoming album Bloom Forever to an intimate crowd in Village Underground, Shoreditch.\nThomas crooned a host of tracks which he reportedly revealed were about 'living in Kent' - a seeming nod to the family home they shared in Wrotham, where Peaches tragically passed away aged 25 following a drug overdose.\nHe sang: 'You couldn’t make it through. Time to say goodbye. Holding onto each other and sing to one another. Everyone knows the house feels so cold. Just to say goodbye.'\nAnd lyrics to another bitterly sad tune, read: 'Sleeping alone, it’s hard to go on in our country home, where we belong. Sing to me one last time. Your sun is still shining. Hold my hand as the sea becomes a storm.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420506/Daisy-Lowe-leaves-restaurant-hand-hand-new-beau-Thomas-Cohen-couple-enjoy-birthday-meal-grandparents.html"}
