{"authors":["Jason Chester For Mailonline"],"date_download":"2018-10-22 21:28:17","date_modify":"2018-10-22 21:28:17","date_publish":"2017-04-26 01:55:51","description":"The fashionable pair rubbed shoulders as French designer Roland Mouret threw pre-opening party The Dinner Of Love inside the city’s ambitious new hotel complex, The Ned.","filename":"data/vaneerConsumption/DaisyLoweandEleanorTomlinsonoozeelegance.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B5AF400000578-0-image-a-170_1493166791453.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445970_Daisy-Lowe-Eleanor-Tomlinson-ooze-elegance_1540243697.html","title":"Daisy Lowe and Eleanor Tomlinson ooze elegance","title_page":"Daisy Lowe and Eleanor Tomlinson ooze elegance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Style credentials were once again reinforced on Tuesday evening as Daisy Lowe and Eleanor Tomlinson led the glamour at an exclusive dinner party in London.\nThe fashionable pair rubbed shoulders as French designer Roland Mouret threw pre-opening party The Dinner Of Love inside the city’s ambitious new hotel complex, The Ned.\nOpting for a simple black evening dress, Daisy, 28, opted for an understated look while making an entrance ahead of the one-off event, held in honour of the 252 room complex’s imminent launch.\nScroll down for video\nLeading the way: Style credentials were once again reinforced on Tuesday evening as Daisy Lowe and Eleanor Tomlinson led the glamour at an exclusive dinner party in London\nThe model added to her look with matching black sandals, while her trademark fringe was present and correct as she joined her fellow guests at The Ned’s Venetian brasserie Cecconi’s – one of eight upmarket restaurants boasted by the venue.\nEvidently in high spirits, Daisy beamed while posing for photos shortly before settling down for a meal consisting of dishes inspired by northern Italian cuisine.\nAdopting a similar theme, Eleanor, 24, sported an off-shoulder black gown that served to accentuate her slender physique.\nThe Poldark actress completed her look with a pair of black stiletto heels, while a tasteful black choker and simple clutch bag proved to be notable accessories.\nElegant: Opting for a simple black evening dress, Daisy, 28, opted for an understated look while making an entrance at the city's ambitious new hotel complex, The Ned\nFinishing touches: The model added to her look with matching black sandals\nSignature style: Her trademark fringe was present and correct as she joined her fellow guests at The Ned’s Venetian brasserie Cecconi’s – one of eight upmarket restaurants boasted by the venue\nUpbeat: Evidently in high spirits, Daisy beamed while posing for photos shortly before settling down for a meal consisting of dishes inspired by northern Italian cuisine\nDaisy recently revealed that her appearance on Strictly Come Dancing has given her a newly-found body confidence.\nShe told the podcast GLAMOUR Presents: Hey it’s OK: 'The best gift that Strictly gave me was making sure that I did dance every day.\n‘I think with modelling you’re constantly scrutinised for your body and it was such a gift using my body and feeling proud of it, of what it could do.'\nA vision in black: Adopting a similar theme, Eleanor, 24, sported an off-shoulder black gown that served to accentuate her slender physique\nTasteful: A black choker and simple clutch bag proved to be notable accessories\nSay cheese: Eleanor was joined by guests including Nisha Grewal at the pre-opening dinner\nShe added: 'I think especially for young people in this day and age with so much social media and everything that’s going on, you’re constantly bombarded with, “Am I good enough?”\n‘And actually to take yourself out of that and do something physical and then be really proud, eventually, of what you can do ‘cause it certainly doesn’t happen straight away!’\nFollowing her stint on Strictly, she admitted she's still adjusting to being more widely recognised - despite already having established her self as a successful model with brands including Chanel, Vivienne Westwood and Burberry.\nIt's my party: Host Roland Mouret joined Eleanor for a picture ahead of his lavish celebratory dinner party\nIn good company: The French designer was also joined by Solange Azagury-Partridge (L) and Kim Hersov (R)\nCheers! Daisy passed the time with Tim Blanks at Mouret's exclusive dinner party\nMeanwhile Eleanor, who play Demelza alongside screen husband Aidan Turner in Poldark, will soon be back when the third series airs later this year.\nThe pair were previously seen filming in freezing conditions on the Welsh moors in January.\nPoldark is expected to return to BBC One over the summer.\nThree's company: Mimi Xu, Roland Mouret and Lara Bohinc\nLeggy display: Cindy Bruna caught the eye as she took a seat at the exclusive venue\nSpecial guests: Gary Powell and Todd Lynn also attend the Roland Mouret pre-opening dinner at Cecconi's\nLadies that love: Cindy Bruna [L] and Charlotte Carroll [R] attended Roland Mouret's The Dinner of Love\nShades of blue: [L-R] Mimi Xu and Lara Bohinc attended the event in contrasting blue outfits\nMaking an appearance: Amelia Warner [L] attended The Ned as did Marc Almond [R]","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445970/Daisy-Lowe-Eleanor-Tomlinson-ooze-elegance.html"}
