{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 02:14:58","date_modify":"2018-10-23 02:14:58","date_publish":"2016-01-28 17:01:33","description":"Dakota, now 26 and an established actress in her own right, covers this month's The Edit magazine, explaining that the experience of watching her parents on screen has stayed with her.","filename":"data/vaneerConsumption/DakotaJohnsonrecallsseeingherparentshavesexwithotherpeopleinfilms.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB5FCC00000578-0-image-a-104_1453996447205.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421203_Dakota-Johnson-cringes-recalls-seeing-famous-parents-sex-people-screen_1540260898.html","title":"Dakota Johnson recalls seeing her parents 'have sex with other people' in films","title_page":"Dakota Johnson recalls seeing her parents 'have sex with other people' in films | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dakota Johnson may have put her parents through the hell of seeing her have sex on the big screen - but it seems that they did it to her first.\nThe 50 Shades Of Grey star candidly recalled seeing mum Melanie Griffith and dad Don Johnson sleep with other people when they were at the height of moviestar fame.\nDakota, now 26 and an established actress in her own right, covers this month's The Edit magazine, explaining that the experience of watching her parents on screen has stayed with her.\nScroll down for video\nHonest: Dakota Johnson admitted that seeing her parents have sex with other people on screen has stayed with her, as she gave a candid cover interview for The Edit\nNo editing here: Her candid childhood insight is featured in the February issue of The Edit magazine for net-a-porter\n'I was around for a lot of it,' Dakota confessed. 'And I would watch them. But there were also things I could see that I didn't want to, like watch my parents have sex with other people.\n'And there was a scene where my mom got slapped in the face. I lost my mind! I couldn't deal with that at all.'\nLooking fashion-forward in a red beret and a string of patterned new-season ensembles, Dakota is photographed for the magazine by Laurie Bartley.\nThe actress became a household name overnight by starring in this decade's most talked about erotic romance, based on the best-selling raunchy novels by EL James.\nDakota therefore famously followed in her parents' footsteps begging the question, had she ever watched her parents' raunchy scenes?\nHer father Don shared raunchy screen time with Virginia Madsen in 1990's The Hot Spot, while also later starring alongside Melanie on Born Yesterday, Paradise and The Harrad Experiment.\nMelanie began dating dating Don when she was only 14 years old and they married 1976, having just one child, before separating in March 1994, then for a final time in May 1995.\nOn growing up in a celebrity family, Dakota went on to say: 'I understood that my family was famous.\nAn insight: She described being something of a wild child, growing up at the height of her parents' fame\n'I saw the way it felt from the inside, and that put me off ever feeling like I was capable of gawking at someone because they were famous.'\nCalling 21st Century Hollywood a 'free-for-all,' Dakota mused: 'You didn't [used to] see actors unless they were on the red carpet; they weren't publicly photographed all the time.\n'Now anyone can take my picture, and I can take anyone's picture, at any moment. I feel like something has been lost… It's like a little bit of magic is slipping away and I don't know why.'\nShe admitted to being something of a 'wild child' for her two famous parents, explaining in her own words: 'I'm a quiet observer. [Growing up] I was demure some of the time, but also outspoken... I was \"colorful\". I didn't abide by rules very well. I was like a wild, feral little child.'\nToo much information: One of Hollywood's hottest couples, Melanie and Don put their raunchiest moments in front of the camera, including this shoot in the October 1976 edition of Playboy\nFamous: The duo married 1976, having just one child, before separating in March 1994, then again in May 1995\nFollowing in their footsteps: Dakota, here with mother Melanie in February 2015, became an overnight star in her own right for this decade's raunchiest film, 50 Shades Of Grey, based on the erotic novels\nDakota's first foray into high profile acting came last Valentine's Day, playing the Anastasia Steele to Jamie Dornan's sex-obsessed Christian Grey.\n'In real life,' the actress said. 'I feel like [Dakota] would eat Christian Grey. She would suspend him from the ceiling and smack him open like a piñata.'\nShe will reprise the role again in 2017's Fifty Shades Darker and 2018's Fifty Shades Freed and has been preparing for the relative seclusion that immersing herself in the character brings about.\n'[I have a few more weeks] to get ready to crawl into a hole for six months, say goodbye to my friends and my life, and stop dating bread.'\nDakota also takes on a very different role in 2016, trying her hand at comedy alongside Leslie Mann for How To Be Single.\nRead the full interview with Dakota Johnson in the February edition of The EDIT, available to download on the free app for iPhone, iPad and Android.\nRaunchy scenes: She put her parents through the same hell when she played Anastasia Steele to Jamie Dornan's Christian Grey","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421203/Dakota-Johnson-cringes-recalls-seeing-famous-parents-sex-people-screen.html"}
