{"authors":["Tom Murphy"],"date_download":"2018-10-30 14:37:12","date_modify":"2018-10-30 14:37:12","date_publish":"2015-11-22 00:00:00","description":"Arkansas quarterback Brandon Allen passed for a school-record seven touchdowns and Mississippi State’s Dak Prescott threw for 508 yards and five touchdowns, but their big-game shootout came down to a field-goal try.","filename":"data/vaneerConsumption/Daksatoughone.json","image_url":"https://media.arkansasonline.com/img/photos/2015/11/22/Mississippi_St_Arkans_Jone_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_nov_22__1540910232.html","title":"Dak’s a tough one","title_page":"Dak’s a tough one ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Mississippi State's Dak Prescott (15) keep the ball and runs during the the first half of an NCAA college football game against Arkansas, Saturday, Nov. 21, 2015 in Fayetteville, Ark. (AP Photo/Samantha Baker)\nFAYETTEVILLE — Arkansas quarterback Brandon Allen passed for a school-record seven touchdowns and Mississippi State’s Dak Prescott threw for 508 yards and five touchdowns, but their big-game shootout came down to a field-goal try.\nMississippi State’s Beniquez Brown broke through the line and blocked Cole Hedlund’s 29-yard field goal in the final minute to preserve the Bulldogs’ wild 51-50 victory over Arkansas on Saturday.\nThe Bulldogs (8-3, 4-3) won their fourth consecutive game in the series and won for the first time in Fayetteville before a crowd of 71,936 at Reynolds Razorback Stadium.\n“Wow, what a football game that was,” Mississippi State Coach Dan Mullen said. “That was big-time ball, as impressive a quarterbacking performance as I think you’re going to see in college football on both sidelines.”\nArkansas (6-5, 4-3) likely had its hopes for a Florida bowl trip dashed along with its four-game winning streak.\n“I’ve been through a couple of heartbreakers since coming to Arkansas but that one might be at the top of it, just to be that close in that type of a game and to walk out empty handed,” Arkansas Coach Bret Bielema said.\n“It’s tough,” said Arkansas tight end Hunter Henry, who had 7 catches for a career-high 129 yards and 2 touchdowns. “That’s just how football works. … It’s awesome when you’re on the other side of it, like we’ve been a couple times this year. And it sucks when you’re on this side of it.”\nMississippi State scored the winning points on Prescott’s fifth touchdown pass, a 14-yard strike to Fred Ross with 3:05 remaining.\nArkansas drove to the Mississippi State 19 as Allen went 5 for 5 for 70 yards through the air, but the Razorbacks stayed on the ground after that, hanging near the middle of the field to set up Hedlund’s short field goal with 46 seconds remaining after the Bulldogs used all their timeouts.\n“We weren’t able to execute the most monumental easy thing that we have to be able to accomplish, which is a field goal inside the 20-yard line,” Bielema said. “That’s my fault that we didn’t prepare enough for that situation.”\nAllen completed 30 of 43 passes for 406 yards, tied former Kentucky quarterback Tim Couch’s SEC record with 7 touchdown passes and surpassed Ryan Mallett’s school record with his 63rd career touchdown pass.\nPrescott overcame two second-half turnovers, an interception and a fumble, to complete 38 of 50 passes for a career-high 508 yards.\n“I’d say he might be the best player I ever coached,” Mullen said. “And if you look at my coaching resume that’s pretty impressive.”\nThe Bulldogs held a 631-479 edge in total offense, notching their highest yardage total ever in an SEC game. Mississippi State has won four road games in a season for the first time since 1994.\nThe Bulldogs held 1,200-yard rusher Alex Collins to 53 yards on 19 carries, snapping his streak of four consecutive 100-yard games. Mississippi State also outrushed the Razorbacks 123-73.\nPrescott completed his first 12 passes and Mississippi State seized the momentum in the first half by holding Arkansas to 3 three-and-outs while building a 31-21 lead at the break.\nArkansas trailed 31-14 late in the second quarter, but scored four unanswered touchdowns, sparked by a string of takeaways early in the second half.\nJosh Harris knocked the ball loose from kickoff returner Brandon Holloway on the second-half kickoff and Jeremy Sprinkle recovered for Arkansas at the Bulldogs’ 23.\nAllen found Hunter Henry for a 20-yard completion on third and 12, then looped a play-action throwback to Sprinkle for a 3-yard score three plays later to cut Mississippi State’s lead to 31-28.\nReceiver De’Runnya Wilson tipped Prescott’s pass on the next offensive snap and Kevin Richardson dove to make an interception.\nAllen gunned a deep ball down the left sideline on the next play for a 39-yard touchdown to Henry and a 35-31 Arkansas lead. It was the first Allen-to-Henry touchdown pass since Week 3.\nDeatrich Wise Jr. had a sack and strip on Prescott and Taiwan Johnson recovered for the Razorbacks, returning to the Mississippi State 40. Henry caught an 18-yard pass from Allen five plays later for a 42-31 Arkansas lead.\nThe Razorbacks had one more chance to add on to the lead after forcing a punt, but after driving to the Bulldogs’ 26, Allen threw incomplete on fourth and 1 on a deep attempt for Henry.\nBielema said he thought about kicking a field goal from the 26, but “it was just out of our range, didn’t feel good about our operation.”\nThe Bulldogs’ Ross made the play of the night and finished with 10 catches for 154 yards and 2 touchdowns. Mississippi State led 24-14 when Ross made a leaping one-handed tip to himself over Richardson, then juked his way past Richardson and safety Josh Liddell for a 55-yard touchdown.\nArkansas tight ends Sprinkle and Henry combined to catch five touchdown passes. Sprinkle had 6 catches for 47 yards and tied a school record with 3 touchdowns.","url":"https://www.arkansasonline.com/news/2015/nov/22/daks-tough-one/"}
