{"authors":[],"date_download":"2018-10-22 21:04:46","date_modify":"2018-10-22 21:04:46","date_publish":"2014-06-04 09:12:17","description":"The Dalai Lama, reviled by Beijing as a separatist, made the rare comments on the violence at a prayer meeting two years after he renounced politics.","filename":"data/vaneerConsumption/DalaiLamaOffersPrayersforTiananmenMartyrs.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/486011/140604-dalai-lama-cover-5a_acef1a770a23e9f086b2c12bcc59312d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_dalai-lama-offers-prayers-tiananmen-martyrs-n122056_1540242286.html","title":"Dalai Lama Offers Prayers for Tiananmen 'Martyrs'","title_page":"Dalai Lama Offers Prayers for Tiananmen 'Martyrs'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDHARAMSALA India - Exiled Tibetan spiritual leader the Dalai Lama marked the 25th anniversary of the Tiananmen Square crackdown in Beijing on Tuesday by urging China to embrace democracy and offering prayers for the protest \"martyrs.\"\nThe Dalai Lama, reviled by Beijing as a separatist, made the rare comments on the June 4, 1989, violence at a prayer meeting two years after he renounced politics.\n\"I offer my prayers for those who died for freedom, democracy and human rights,\" the 1989 Nobel Peace Prize winner said according to a statement that was released by Initiatives for China, a Washington-based group that campaigns for a peaceful transition to democracy in China.\n\"While great progress has been made to integrate into the world economy, I believe it is equally important to encourage China to enter the mainstream of global democracy,\" he added.\n\"In this anniversary of China's young martyrs, let us pray that the Chinese leaders of today would turn their hearts away from fear and defensiveness, that they would reach out to the victims and victims' families, and repent of the massacre of China's youth.\"\nA representative of the Dalai Lama's private office in Dharamsala, his base in northern India, confirmed that the statement was authentic.\nChina's Foreign Ministry condemned the comments.\n\"Everyone is clear about who the Dalai (Lama) is. His statement has ulterior motives,\" ministry spokesman Hong Lei told a daily news briefing.\nDespite his global renown, the 78-year-old Dalai Lama is viewed by Beijing's communist leadership as a dangerous \"splittist\" who espouses violence. He denies the charges, saying he only wants genuine autonomy for his homeland.\nChina has ruled Tibet with an iron fist since troops marched in 1950. The Dalai Lama fled into exile in India in 1959 after an abortive uprising against Chinese rule.\n- Reuters","url":"https://www.nbcnews.com/news/world/dalai-lama-offers-prayers-tiananmen-martyrs-n122056"}
