{"authors":[],"date_download":"2018-10-23 03:38:21","date_modify":"2018-10-23 03:38:21","date_publish":"2016-01-11 16:22:22","description":"South African fast bowler Dale Steyn was on Monday ruled out of playing in the third Test against England, starting at the Wanderers Stadium on Thursday. Coa...","filename":"data/vaneerConsumption/DaleSteynruledoutofthirdEnglandTest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-701bk-3WAQP5SaQH704788ebcf7e0be3ff-972_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394158_Steyn-ruled-England-Test_1540265901.html","title":"Dale Steyn ruled out of third England Test","title_page":"Dale Steyn ruled out of third England Test | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dale Steyn ruled out of third England Test\nSouth African fast bowler Dale Steyn was on Monday ruled out of playing in the third Test against England, starting at the Wanderers Stadium on Thursday.\nCoach Russell Domingo said Steyn had been advised to take another week’s rest after suffering a shoulder strain during the first Test in Durban.\nHe has been undergoing tests and the Domingo said his medical team were awaiting further opinion from a specialist on how best to manage the injury.\nSouth Africa fast bowler Dale Steyn appeals for the wicket of England batsman Steven Finn on the second day of the first Test against England at Kingsmead Stadium in Durban on December 27, 2015 ©Marco Longari (AFP/File)\nSteyn, the world’s top-ranked Test bowler, has only played in two of South Africa’s most recent five Tests and on both occasions has suffered an injury which prevented him from bowling in the second innings.\nDomingo said he was confident that Steyn, 32, would still have a role to play in the Test side.\n\"All players are going to experience some sort of niggles at some stage of their career and he has just had a few of them of late.\n\"He is a great athlete, as fit as anyone, these things happen. He is just going through that phase of his career but I’m sure he will get through it.\"\nFollowing the resignation of Hashim Amla after the drawn second Test in Cape Town, South Africa will be led for the first time in Tests by AB de Villiers.\n\"Within our team it's been business as usual,\" said Domingo. \"I don’t see too much of a change in the change room because it’s all the same players, they have all played under AB in the one-day side so it’s not too much of an adjustment.\n\"We want to build on our performance from Cape Town, there were a lot of positives for us.\n\"AB is really looking forward to doing it. He has always wanted to captain the Test side and he is really excited by the challenge.\"\nDomingo said he was not too concerned about the lack of experience in the bowling line-up with both Steyn and Vernon Philander ruled out because of injury.","url":"https://www.dailymail.co.uk/wires/afp/article-3394158/Steyn-ruled-England-Test.html"}
