{"authors":[],"date_download":"2018-10-30 00:51:39","date_modify":"2018-10-30 00:51:39","date_publish":"2018-09-13 00:05:58","description":"The recent shooting death of Botham Jean by a Dallas police officer ought to send a chill down the spine of anyone who believes in limited government, property rights, and other conservative principles. In recent years, we’ve seen a number of unarmed, law-abiding people shot to death by police as they were trying to comply with orders or even begging for their life, but this one is particularly shocking.","filename":"data/vaneerConsumption/DallasShootingCauseforOutrage.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/DallasShooter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860699.html","title":"Dallas Shooting Cause for Outrage","title_page":"Dallas Shooting Cause for OutrageThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nThe recent shooting death of Botham Jean by a Dallas police officer ought to send a chill down the spine of anyone who believes in limited government, property rights, and other conservative principles. In recent years, we’ve seen a number of unarmed, law-abiding people shot to death by police as they were trying to comply with orders or even begging for their life, but this one is particularly shocking.\nJean was in his own apartment when Officer Amber Guyger reportedly entered it and shot him to death. According to the arrest warrant, she said she was returning home from work and went into the apartment, mistakenly thinking it was her own, which is right below Jean’s apartment. The affidavit suggests the door was ajar, she went inside and saw a large silhouette and thought there was a burglar. She reportedly told investigators she drew her weapon and after Jean did not respond to her “verbal commands,” fired two shots, called 911, turned on the lights, and realized the mistake.\nThere’s a lot to examine in this accounting of the incident, and in the allegations of contradictory information made by the family’s attorney. Such details will emerge as Guyger faces a trial for manslaughter, but a few broader points should be clear for the rest of us. For starters, in America we should not have follow anyone’s verbal commands while we are within our own home unless a warrant has been properly executed.\nThe doors to my house are not always locked and sometimes are ajar. If I’m half asleep and an armed intruder breaks in, I am under no obligation to comply with what that person demands. I should have every right to grab my 12-gauge shotgun and defend myself. How am I supposed to know that the intruder isn’t a serial killer here to carve up my family? If that person is a government employee who mistook my house for hers, then the risk should be hers, not mine.\nIt’s bad enough when SWAT teams bust down the wrong door and shoot my dog because the police clerk jotted down the wrong address, or engage in one of those dubious no-knock raids. But the off-duty, but uniformed, Guyger apparently had no official reason to be in Jean’s apartment. She should be treated no differently than if I had broken into her house by mistake.\nAs conservative writer David French noted in his National Review column: “So far, Guyger is only charged with manslaughter. But all the available evidence indicates that she intentionally shot Jean. This wasn’t a warning shot gone awry. The pistol didn’t discharge during a struggle.” In other words, manslaughter (the charge could be increased after review by the grand jury) is not serious enough.\nHad Guyger not been a cop, the charges probably would be much harsher. The department would probably not have delayed before arresting her. There’s indication she’s benefiting from protections — legal, cultural, and institutional — routinely afforded police officers. In America, officials are supposed to be held to the same standards as the rest of us, but in reality they get an absurd level of protections above and beyond anything that everyday plebes receive.\nConservatives routinely complain about politically inspired IRS audits, excessive regulations, punitive levels of taxation, and the constant attacks by the government on our property rights. In California, we’re tired of how the state’s progressives see few limits to the private areas they can regulate. But I’d love to see more outrage on the Right at police misbehavior given how many times people are unjustly killed even in their own private spaces. I, too, am aghast at bans on plastic straws. But we ought to express much more concern for these threats to our life than the lesser governmental abuses.\nI’ve reported on many of these cases. Police media departments can’t be counted on to provide a balanced portrayal. Pick any shooting and compare the initial statements to the facts that later emerge. Departments often conceal reports they produce unless those reports reflect well on the officer. And the media is useless. Cop reporters tend to obsequiously report official statements. District attorneys are closely allied with police and rarely file charges. There are endless laws that give police extra protections, including one that allows them to confer after a shooting — effectively allowing involved officers to get their stories straight before the investigation.\nIn past years, I noticed a growing acknowledgment on the Right of the need to reform some policing procedures. After all, government unions are a main reason it’s nearly impossible to get rid of bad officers. Union legal defense funds often pay for legal costs of those accused of bad behavior. The small number of overly aggressive or incompetent cops often are the source of a large number of civil settlements and abuse allegations faced by departments. These protections keep them on the force.\nBut the Left’s culturally divisive response to police shootings and failure to distinguish between justified shootings and unjustified ones, as well as its embrace of myriad unrelated leftist political issues, has hardened the conservative position into one of kneejerk police support. That’s too bad, because all government officials — in uniform or in any other agency — ought not to be given protections the rest of us don’t receive.\nAs an aside, conservatives need to think about what this situation means for the right to keep and bear arms. Police increasingly send SWAT teams even to serve minor warrants on people simply because they are legal gun owners. In one incident, police shot to death a man during a traffic stop after he told them that he had a legal firearm. In another recent case, police shot to death the homeowner who had just used a weapon to kill an intruder and was holding a gun.\nBased on the statistics, Guyger might only receive just a slap on the wrist after being afforded every special privilege offered to a member of her profession, although fortunately I haven’t seen many defenses of her so far. If she isn’t sufficiently punished, this means there is no protection anywhere from shooting by government official. If this doesn’t bother you and you claim to believe in limited government, then you might not really believe in limited government.\nSteven Greenhut is Western region director for the R Street Institute. Write to him at sgreenhut@rstreet.org.","url":"https://spectator.org/dallas-shooting-cause-for-outrage/"}
