{"authors":["Jennifer Brett"],"date_download":"2018-10-30 18:17:49","date_modify":"2018-10-30 18:17:49","date_publish":"2016-07-10 15:24:33","description":"DALLAS - Park Cities Baptist Church has played a key role in this devastated city's healing thi...","filename":"data/vaneerConsumption/Dallaschurchpraysforvictimsofficersandthegunmansfamily.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/07/10/Images/WPIMAGE_cmgajcbuzz_11863.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_dallas-church-pra_78753cf9eab2cf6add975cfb56c3e2b6__1540923469.html","title":"Dallas church prays for victims, officers - and the gunman's family","title_page":"Dallas church prays for victims, officers - and the gunman's family","title_rss":"NULL","source_domain":"ajc.com","text":"DALLAS - Park Cities Baptist Church has played a key role in this devastated city's healing this week, and the message from the pulpit today was one of grace, unity and love.\n\"It's been a tragic week,\" said Associate Senior Pastor Miller Cunningham. \"Our hearts are broken. We've seen the senseless murder of five Dallas police officers. We've seen in graphic form the depth of racial division that exists in our community.\"\nHe led the congregation in prayer for the victims, the injured, and for the family of slain gunman Micah Xavier Johnson.\n\"In a time like this it's important to remember, love always conquers hate, always,\" Cunningham said. \"Light always destroys darkness.\"\nMORE:\nDallas suspect left message in blood on the wall\nThis video of people lining up to hug Dallas police officers has been viewed 30 million times\nSupport, tensions in Dallas\nDallas protest organizer recalls the moment he heard gunshots and saw officers hit\nPolice chief says Dallas sniper attack was “well planned”\nHealing, investigation continue in Dallas after ambush\nThe church's senior pastor, Jeff Warren, is on sabbatical and didn't preach Sunday. Instead the congregation at the 10:45 a.m. traditional worship service heard from Park Cities' Minister to Singles Travis Cook - who happens to be a Marietta native and Kennesaw State University graduate.\nMarietta native and KSU graduate Travis Cook delivered the message at Park Cities Baptist Churchs 10:45 a.m. traditional worship service on Sunday. Photo: Jennifer Brett\n\"It's not an easy Sunday to lead worship,\" said Cook, who served for five years as a U.S. Army Reserve chaplain. His message stressed the importance of unity, humility and grace.\n\"You can't be self-centered and maintain unity,\" he said.\nThe week's tragedies provided grim sermon topics in churches in Baton Rouge, La. and St. Paul, Minnesota, where the police shooting deaths of Alton Sterling and Philando Castile touched off protests around the country, including the one in Dallas that ended with five officers being killed by sniper fire\nIn Baton Rouge, Star Hill Baptist Church Pastor Floyd Jetson prayed with two police officers on his way to church.\n“Whether they stand on street corners or wear uniforms of blue, we pray for their families,” said Jetson, whose church is located less than a mile away from the Triple S market, where Sterling was fatally shot early Tuesday morning by a Baton Rouge police officer, touching off a week of heated protests. “We refuse to turn against our brothers and sisters. To those who refuse to love us, we love them anyway.”\nSterling’s death, and the subsequent video that showed him pinned to the ground as he was shot, have put many Baton Rouge residents on edge, fearing, if not expecting, the worst. The tension between police and demonstrators is as palpable as the stifling summer heat, with 101 people arrested overnight outside of police headquarters. More protests were planned Sunday afternoon and evening.\n“Will we believe those who tell us we are hopelessly divided by race?” Jetson asked. “Do we accept that the conditions we face are hopeless? Or do we refuse to believe evil can win? Our God is able.”\nIn St. Paul, worshippers gathered beneath the stained glass windows at Pilgrim Baptist Church, Minnesota’s oldest African-American church, to find words of strength after a harrowing week.\nPilgrim is is less than five miles from where Castile was shot and killed by a police officer, and a short walk from the freeway protest late Saturday that shut down a major highway and erupted into violence.\nSenior Pastor Rev. Charles Gill leads a prayer at Pilgrim Baptist Church in St. Paul, Minnesota’s oldest African-American church. Photo: Willoughby Mariano\nThe congregation was founded on resistance. Its earliest members were slaves who escaped during the worst of the Civil War, seeking the freedom that this country promised to white men but withheld from them. Senior Pastor Rev. Charles Gill alluded to this history of discrimination Sunday with words from the Declaration of Independence.\n“We hold these truths to be self-evident that all men are created equal,” he said. “Really? Really? I don’t think everyone here sees this evidence quite as clearly.”\nThese words struck a nerve with congregants. Maggie Barnes said she knew Castile, a cafeteria manager, through her job as a child care worker for students who attended the school where he worked. She arrived at the service after spending the evening on the freeway with demonstrators, ho and hoped she could convince the crowd to march peacefully.\n“I told those young people, don’t get caught up in the chains of sin,” Barnes said. “That is not what Martin Luther King is about. That is not what Black Lives Matter is about.”\nBut the orderly Black Lives Matter protest was overshadowed by angry bystanders throwing water bottles, chunks of concrete, firecrackers and orange traffic barrels at a line of officers wearing riot gear. Some 100 people were arrested and five officers sustained minor injuries.\n“I need to be here at this church to find peace,” Barnes said.\nU.S. Sen. Amy Klobuchar attended to show solidarity and to demand a thorough investigation of Castile’s death.\n“It just gives me some hope to be here in this place of worship and to feel God. Because we are in agony,” Klobuchar said to the congregation.\nThe service laid the groundwork for a peaceful and pragmatic show of resistance, saying boycotts are under consideration. Gill offered the services of an attorney for members who are stopped by police and announced that crisis counselors would be stationed at the church during the week. The church program listed numbers for NAACP hotlines and the Minnesota Department of Human Rights.\n“Don’t panic. Don’t retreat,” he said. “This is the time to move forward. This is the time to be assertive.”\n“We don’t know what the next days will bring, but we need to be ready. It may mean we need to do stuff we have never done before. It may mean we move quicker than we have. But we need to be ready,” Gill said.\nHe ended with a call for the elected officials in attendance to come to the altar and join hands.\n“We need you, Lord, to be victorious in this,” he pray. “We need you, Lord, to end this.”","url":"https://www.ajc.com/blog/buzz/dallas-church-prays-for-victims-officers-and-the-gunman-family/6xAY9c2Snd9SW1vqOl4M7N/"}
