{"authors":["Rebecca Davison For Mailonline","Baz Bamigboye For The Daily Mail"],"date_download":"2018-10-22 21:49:09","date_modify":"2018-10-22 21:49:09","date_publish":"2016-01-11 01:49:00","description":"Dame Helen Mirren appeared to be perfectly in her element as she walked the red carpet at the 73rd annual Golden Globe Awards on Sunday night.","filename":"data/vaneerConsumption/DameHelenMirrenblowskissestoherfansattheGoldenGlobeAwards2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001EACD00000578-0-image-a-48_1452476906791.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393236_Dame-Helen-Mirren-70-blows-kisses-fans-Golden-Globe-Awards_1540244949.html","title":"Dame Helen Mirren blows kisses to her fans at the Golden Globe Awards 2016","title_page":"Dame Helen Mirren blows kisses to her fans at the Golden Globe Awards 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dame Helen Mirren appeared to be perfectly in her element as she walked the red carpet at the 73rd annual Golden Globe Awards on Sunday night.\nThe 70-year-old actress blew kisses to the crowds as she as she arrived at the Hilton in Beverly Hills to celebrate the big night.\nWorking her magic, Helen showed off her incredible figure in a simple black gown by Badgley Mischka which had a plunging sweetheart neckline with a mesh section.\nScroll down for video\nThat's one way to shine: Dame Helen Mirren appeared to be perfectly in her element as she walked the red carpet at the 73rd annual Golden Globe Awards on Sunday night.\nHelen was up for Best Performance by an Actress in a Supporting Role in any Motion Picture for her role in Trumbo, but was beaten by Kate Winslet who starred in the Steve Jobs biopic.\nTrumbo tells the story of Dalton Trumbo, who in 1947, was Hollywood's top screenwriter, until he and other artists were jailed and blacklisted for their political beliefs.\nBut Mirren still shone on the night as she dazzled in diamonds, drawing attention to her decolletage with a statement necklace by Harry Winston as well as a matching bracelet.\nSee full news coverage of the Golden Globes winners and red carpet moments\nLost out: Helen was up for Best Performance by an Actress in a Supporting Role in any Motion Picture for her role in Trumbo, but was beaten by Kate Winslet who starred in the Steve Jobs biopic\nShe dazzled in diamonds: Helen drew attention to her decolletage with a statement necklace by Harry Winston as well as a matching bracelet, reported worth more than a million dollars\nThe jewels were reported to have been worth more than a million dollars.\nShe carried an embellished silver clutch bag in her hand as she walked down the red carpet.\nPosing with her hands confidently on her hip, she wore her blonde locks behind her ear as she added some colour to her look with a slick of berry lipstick.\nDouble act: Helen Mirren and Gerard Butler took to the stage to present an award at Sunday night's ceremony\nCarrying on the fun: Helen attended the Weinstein Company & Netflix Golden Globe afterparty\nAccording to the Washington Post, Matt Lauer told Helen that he had read in an interview that she doesn’t like the word 'sexy.'\nThen he looked her up and down and said, 'tough.'\nBut humble Helen told him the reason she is this glam is because of her team of hair and makeup stylists who put her together then cheer her on as she walks out the door.\nDuring the ceremony, Helen co-presented the Best Motion Picture in a Foreign Language award with Gerard Butler.\nThe pair thrilled viewers with their flirtatious exchanges, before announcing Hungarian film Son of Saul the winner.\nAnd despite losing out to Kate Winslet in the Best Supporting Actress category, Helen remained in good spirits and headed to the Weinstein Company & Netflix afterparty where she hung out with Morgan Freeman.\nEyes wide shut: The actress cosied up to Morgan Freeman, with the actor making a cheeky facial expression\nStunning: Helen was the picture of elegance as she modeled her jewels for the camera\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393236/Dame-Helen-Mirren-70-blows-kisses-fans-Golden-Globe-Awards.html"}
