{"authors":["Sebastian Shakespeare For The Daily Mail"],"date_download":"2018-10-22 21:48:25","date_modify":"2018-10-22 21:48:25","date_publish":"2016-01-11 01:43:28","description":"BBC grandee David Dimbleby’s contract to host Question Time comes to an end this year, but the 77-year-old is said to be determined to win another deal that would keep him employed into his 80s.","filename":"data/vaneerConsumption/DameJoanBakewellwantsDavidDimblebyreplacedwithawoman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/0016FBF500000258-0-image-a-26_1452475955900.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393213_SEBASTIAN-SHAKESPEARE-Time-replace-Dimbleby-woman-says-Dame-Joan_1540244905.html","title":"Dame Joan Bakewell wants David Dimbleby replaced with a woman","title_page":"Dame Joan Bakewell wants David Dimbleby replaced with a woman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Call for a change: Dame Joan with David Dimbleby\nBBC grandee David Dimbleby’s contract to host Question Time comes to an end this year, but the 77-year-old is said to be determined to win another deal that would keep him employed well into his 80s.\nHowever, distinguished broadcaster Joan Bakewell has thrown a spanner in the works.\nShe believes the time has come to replace him with a woman.\n‘I think it would be terrific,’ she tells me. ‘Dame Jenni Murray would be great at it and so, too, would Julia Somerville.’\nDimbleby’s brother Jonathan presents Radio 4’s Any Questions? and their father, Richard, was the BBC’s leading news commentator.\n‘The Dimblebys are broadcasting royalty,’ says Dame Joan, who is a Labour peer. ‘I mean, they have been ever since their father presented Panorama, so they’re a dynasty.\n‘There aren’t any female dynasties, so, in a sense, they’re ahead of the game. It’s been their game and that’s fine, they’re not to blame for that, it’s just the way the world was. But the world is changing, for the better, in my view.’\nThe BBC’s decision to hand Dimbleby a five-year contract, worth £15,000 per episode, caused an outcry in 2011.\nPresenter Anna Ford, who left the Corporation in 2006 because she couldn’t face being relegated to the ‘graveyard shift’ on its rolling news channel, said: ‘I wonder how these charming dinosaurs such as Mr Dimbleby and John Simpson continue to procure contracts with the BBC, when, however hard I look, I fail to see any woman of the same age, the same intelligence and the same rather baggy looks.’\nBaroness Bakewell, who was memorably described as ‘the thinking man’s crumpet’ by fellow broadcaster Frank Muir, tells me there are now ‘strong and resolute women who have the authority’ to present a programme such as Question Time.\n‘That wouldn’t have been the case about 15 years ago, when women tended to be much softer in their interviewing techniques. That is no longer the case now — we only have to look at Laura Kuenssberg [BBC political editor] and Cathy Newman, of Channel 4 News.\n‘My generation were rather timid and polite — we did apologise — but not any more.’\nBest known for playing vicars in To The Manor Born and The Fall And Rise Of Reginald Perrin, Gerald Sim proves benevolent in death as well as on screen.\nThe actor, who died last year aged 89, left £4.1 million in his will. Among the beneficiaries are the two surviving children of his niece Jane Holland, who was killed in the 2004 Boxing Day tsunami. They will share £400,000.\nGerald also left money to showbiz retirement home Denville Hall, where he lived with his sister Sheila Sim and her husband Lord Attenborough.\nSuki's Downton hairdo\nHaving ended her mutually beneficial relationship with bachelor Bradley Cooper, Suki Waterhouse opens a new front in her efforts to conquer Tinseltown.\nThe model-turned-actress hit a Hollywood party with a Twenties-style hairdo worn by Lily James in Downton Abbey - all the rage in the U.S.\nAll Suki needs now is a new leading man.\nSuki Waterhouse (right) hit a Hollywood party with a Twenties-style hairdo worn by Lily James (left) in Downton\nTory darling Donal Blaney has had a tough few months since he was forced to resign as Conservative Way Forward chairman. It followed increased scrutiny over his links to the Mark Clarke ‘Tatler Tory’ bullying scandal. But now Blaney seems to have far more pressing matters on his mind. He’s taken to social media to complain about the company aboard his first-class train carriage.\n‘Yet again South Eastern Railway fail to police first class,’ he ranted. ‘Eight passengers get on at Bromley South on 0950 to Victoria.’\nHow Blaney ‘knew’ these passengers didn’t have first-class tickets is anyone’s guess.\nFancy being responsible for rejecting MPs’ outrageous expenses? Their watchdog is advertising for a chairman who will ‘play a critical role in restoring public confidence in MPs, democracy and the reputation of Parliament’.\nCurrent Independent Parliamentary Standards Authority boss Sir Ian Kennedy, appointed after the MPs’ expenses scandal in 2009, is stepping down at the end of his first term.\nTo add insult to injury as you turn down the MPs’ claims, you will be paid £700 a day — more than twice their salary.\nBeeb's Children In Need leaves Vera in the lurch\nChildren in Need has withdrawn funding from the Dame Vera Lynn (pictured) Children’s Charity\nDame Vera Lynn lifted morale in the darkest days of World War II with songs such as We’ll Meet Again and The White Cliffs Of Dover, but she’s been left despondent by the BBC’s Children In Need.\nIt’s withdrawn thousands of pounds worth of funding from the Dame Vera Lynn Children’s Charity after being one of its most generous backers for six years.\nWhen the Forces’ Sweetheart, pictured, who turns 99 in March, was told the news, she said: ‘What on earth are we going to do?’\nThe small charity, which supports more than 600 children with cerebral palsy, had received around £25,000 a year.\n‘Dame Vera is hugely disappointed,’ her daughter Virginia tells me.\n‘She can’t understand why they had to cut funding completely — why they couldn’t have said: “We’re still on board, but we can only give you £10,000 or even £5,000 this year.”\n‘We weren’t expecting vast increases.’\nA BBC spokesman says: ‘Each year we receive thousands of applications from projects across the UK.","url":"https://www.dailymail.co.uk/news/article-3393213/SEBASTIAN-SHAKESPEARE-Time-replace-Dimbleby-woman-says-Dame-Joan.html"}
