{"authors":["Associated Press"],"date_download":"2018-10-22 20:03:51","date_modify":"2018-10-22 20:03:51","date_publish":"2016-01-29 00:14:03","description":"Damon Knowles glowered as he was arraigned. He is accused of wielding the knife that left grandmother-of-nine Carmen Rivera needing 30 stitches in her face after an attack at 7.15am on Monday.","filename":"data/vaneerConsumption/DamonKnowlesincourtforslashingthefaceofCarmenRiveraonNewYorksubway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE2C7A00000578-0-image-a-6_1454028227534.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421943_Man-21-court-slashing-face-grandmother-71-New-York-subway-fears-grow-amid-rise-random-knife-attacks-city_1540238631.html","title":"Damon Knowles in court for 'slashing the face of Carmen Rivera on New York subway'","title_page":"Damon Knowles in court for 'slashing the face of Carmen Rivera on New York subway' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 21-year-old man has appeared in court charged with slashing a 71-year-old woman in the face on a New York subway as fears of knife attacks plague the city.\nDamon Knowles glowered as he stood in silence on Thursday to be arraigned.\nHe is accused of wielding the knife that left grandmother-of-nine Carmen Rivera needing 30 stitches in her face after an attack on the 6 train at 7.15am on Monday.\nThe incident was the fourth seemingly random slashing in as many weeks in the city.\nDamon Knowles glowered as he stood in silence on Thursday to be arraigned. He is accused of wielding the knife that left grandmother-of-nine Carmen Rivera needing 30 stitches in her face after an attack on Monday\nHe became a suspect after he was charged with trespass and resisting arrest in another case on Tuesday\nCarmen Rivera (pictured), a 71-year-old grandmother, was slashed on the cheek as she rode the subway\nKnowles reportedly became a suspect after he was charged with criminal trespass and resisting arrest in another incident on Tuesday, according to the Daily News.\nSpeaking outside her home on Tuesday, Rivera said she did not realize she had been cut until getting off the train.\nPolice are still looking for a suspect in the December slashing of Tony-award winning playwright David Henry Hwang, who was carrying groceries down a Brooklyn street when he felt like he got hit in the back of the head. He suddenly couldn't walk straight.\n'I kept veering into a wall, then a parked car. And that's when I realized I was bleeding,' Hwang, the author of M. Butterfly, said this week.\nHwang had been slashed with a blade by someone who came out of nowhere. The wound was so deep it severed an artery leading to his brain.\nTony-award winning playwright David Henry Hwang (pictured in November) was slashed by a blade by someone who came out of nowhere while he was carrying groceries down a Brooklyn street, but he is not the only victim of such an usual crime\nSince December, about a dozen such random, unprovoked slashings have been reported across the city, including three this week on subway train including one on Tuesday at the Atlantic Avenue station in Brooklyn\nHe isn't the only victim of such an unusual crime.\nSince December, about a dozen such random, unprovoked slashings have been reported across the city, including three this week on subway trains.\nAll were committed by strangers, police said. They used knives, razors and, in one instance, possibly a machete.\nPolice say the spate of attacks is largely a coincidence. Investigators believe they were committed by different, unconnected people.\nBut the sheer randomness of the crimes has reinforced old fears about safety in a city of strangers.\n'I like to think that, as a New Yorker, I'm fairly aware - conscious of people around me,' Hwang said. 'But this happened on a dark corner of my block.\n'This was a random attack, and the number of recent random attacks surprises me. Is this a new phenomenon?'\nNYPD are searching for this man, who is suspected of slashing a woman's hand on board a 3 train in Brooklyn\nEight minutes after the 3 train assault, a 32-year-old man was slashed in the face while waiting for a 6 train at the 116th Street station in Harlem\nThe idea of a 'thrill crime,' where the perpetrator seeks to feel powerful through an attack on a stranger, is not new: A good example, criminologists say, is the knockout assault that surfaces occasionally, where teenagers try to knock someone out with a single punch.\nThe attacks seem random, but there's often a connection, even if it's just in motive.\n'They want to create anxiety, to feel powerful, to laugh at the results,' said criminologist Jack Levin of Northeastern University, who studies the crime.\nThere has been an uptick in knife attacks citywide the past few months, but police statistics don't distinguish between random and targeted attacks. And overall crime is near modern-era lows.\nCommissioner William Bratton said this week that crime is inescapable.\nDamon Knowles, 21, was taken into custody late on Tuesday night suspected of slashing Carmen River, 71\n'The reality is we still have crime in New York City. We'll always have crime in New York City,' he said.\n'But the reality is also that there is less crime in this city than there has been at any time in the last 25 to 50 years.'\nChief of Detectives Robert Boyce said the spate was 'a little unusual for us,' but he disregarded the idea of a copycat crime.\nHe said officials were working quickly to arrest the perpetrators. At least three people have been arrested already.\nAmanda Morris (pictured), 24, of Brooklyn, was walking to a grocery store job in Manhattan on January 6 when a man who had been walking beside her suddenly reached out, slashed her face and dashed off\nOne man was accused of slashing a 71-year-old woman on the cheek as she rode the subway to work.\nAnother man with a history of assault arrests was charged with an unprovoked slashing attack on a man from New Jersey who was in the city to have dinner with friends.\nThe victim in that assault needed 150 stitches to close the wound in his face.\nAmanda Morris, 24, of Brooklyn, was walking to a grocery store job in Manhattan on January 6 when a man who had been walking beside her suddenly reached out, slashed her face and dashed off. The attack was recorded by a security camera.\nCommissioner William Bratton (pictured center) said this week that crime is inescapable\n'I felt like I got punched in the face,' Morris told The New York Post. 'It was like, \"Oh, that's weird. Why would someone punch me?\" Suddenly, blood was all over my hands, and I started crying.'\nA man with a long history of arrests was later charged in the attack. He has since been accused of a similar slashing attack on a woman in the Bronx on January 1 and is suspected in other assaults.\nDefendants in the slashing cases could face five to 25 years in prison.\nThe randomness of such a crime can cause panic, but it shouldn't, authorities say.\n'At the end of the day, there are greater risks in life than this,' said Dr. Jason Hershberger, head of the psychiatry department at Brookdale University Hospital and Medical Center.\n'This has more to do with how afraid we are of the unpredictable than a real safety problem.'","url":"https://www.dailymail.co.uk/news/article-3421943/Man-21-court-slashing-face-grandmother-71-New-York-subway-fears-grow-amid-rise-random-knife-attacks-city.html"}
