{"authors":["Kirspencer For Daily Mail Australia"],"date_download":"2018-10-23 00:16:33","date_modify":"2018-10-23 00:16:33","date_publish":"2017-03-16 09:27:20","description":"The 90.9 Sea FM host pledged to get rid of his eyebrows, but revealed some strange markings post-shave Thursday, turning to the camera and declaring: 'It's called ringworm'.","filename":"data/vaneerConsumption/DanAstleyshowsoffbizarreredrashonhisshavedhead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E5316C700000578-0-image-a-27_1489656404222.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318972_Dan-Astley-shows-bizarre-red-rash-shaved-head_1540253793.html","title":"Dan Astley shows off bizarre red rash on his shaved head","title_page":"Dan Astley shows off bizarre red rash on his shaved head | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the 90.9 Sea FM host who pledged to get rid of his eyebrows if he raised enough money for World's Greatest Shave.\nAnd after delivering on his promise, Dan Anstey has been spotted with a bizarre red rash.\nIn a video posted by co-host Heather Maltman, Dan reveals some strange markings post-shave, turning to the camera and declaring: 'It's called ringworm'\nNew look? Radio personality Dan Astley shaved his head and eyebrows for charity, before revealing he has 'ringworm'\nThe radio anchor appeared covered in specks of shaving cream in the video, with his hair and eyebrows both missing.\nIn the background, people can be heard discussing his appearance before Heather asks directly what the red spots are.\n'It's called ringworm. It's the worm and it has me,' Dan responds, wiping his head with a towel before throwing at her.\n'Ah it touched me!' Heather yells, trying to back away from the towel.\nGross! In a video posted by co-host Heather Maltman, Dan reveals some strange markings post-shave, turning to the camera and declaring: 'It's called ringworm'\nThe Queenslander looked fine though in an Instagram photo he posted earlier in the day, sporting his new bald look while posing with some AFL players.\nIn the picture he played up his appearance to footballer Gary Ablett Jr, who is known for his famous bald look.\n'Move over Gaz, the GC has a new favourite Sun,' he joked in his caption.\n'Special': Dan also stuck his newly-shaved head into a display of melons\nDan's pledge page shows the radio host pre-shave, sporting short brown hair, bushy eyebrows and a moustache.\nIn his bio he writes: 'Leukaemia is awful and we need to cure it, so to that end Ben Hannant the sadistic psychopath (in conjunction with Heather Maltman the backstabbing flip-flopper) is making me wax my eyebwors IF and only if we raise $1000'.\nSo far the Sea FM star has exceeded his goal by over $400 as of Thursday.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318972/Dan-Astley-shows-bizarre-red-rash-shaved-head.html"}
