{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:31:27","date_modify":"2018-10-30 22:31:27","date_publish":"2014-08-15 14:09:44","description":"There have been three thoughts that have been circulating the Internet for the past few weeks: 1.) When can I get a dancing Baby Groot toy? 2.) When will there be a video of that amazing scene in Guardians of The Galaxy when Baby Groot shakes his…","filename":"data/vaneerConsumption/DancingBabyGrootGuardiansofTheGalaxySceneIsNowOnlineAtLastVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/81da4614-52ae-48c6-ae8a-ce2a10dc5e7e.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35906-dancing-baby-groot-guardians-of-the-galaxy-scene-is-now-online-at-last-video_1540938687.html","title":"Dancing Baby Groot 'Guardians of The Galaxy' Scene Is Now Online, At Last! - VIDEO","title_page":"Dancing Baby Groot 'Guardians of The Galaxy' Scene Is Now Online, At Last! — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"There have been three thoughts that have been circulating the Internet for the past few weeks: 1.) When can I get a dancing Baby Groot toy? 2.) When will there be a video of that amazing scene in Guardians of The Galaxy when Baby Groot shakes his botanical hips? 3.) Why isn't there a button I can push on my computer that can make a burrito come out of my keyboard? Oh, that might just be me. Anyhow, while there's still no official dancing Baby Groot toy yet (you can make a DIY version for now), Yahoo! has brought the Web what it's been waiting for: a video of that dancing Baby Groot scene. AT LAST.\nBecause as adorable as the little plant is as he/she/it swings around in GIF form, it's not the same as watching the scene when that moment happens. Context is everything, my friends. Fortunately, now you can re-live that moment and you can also now show your friends this Guardians of The Galaxy clip so that they can understand this glorious plant you've been talking about.\nCheck it out below, and re-watch it again and again and again and again...'cause who runs the world? PLANTS.\nImage: Yahoo! Movies","url":"https://www.bustle.com/articles/35906-dancing-baby-groot-guardians-of-the-galaxy-scene-is-now-online-at-last-video"}
