{"authors":[],"date_download":"2018-10-22 21:06:52","date_modify":"2018-10-22 21:06:52","date_publish":"2014-05-05 22:55:20","description":"Pop Star Britney Spears was sued in Los Angeles Monday by a dancer who claims she broke her nose and refused to pay her medical bills.","filename":"data/vaneerConsumption/DancerSuesBritneySpearsBabyDontHitMeOneMoreTime.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/421966/140505-britney-spears-1914_3201053cdb4dd91670e8c4886a5f3485.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_dancer-sues-britney-spears-baby-dont-hit-me-one-more-n97701_1540242412.html","title":"Dancer Sues Britney Spears: Baby, Don't Hit Me One More Time","title_page":"Dancer Sues Britney Spears: Baby, Don't Hit Me One More Time","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn actress and dancer has sued pop star Britney Spears in Los Angeles Superior Court for allegedly breaking her nose during a rehearsal and refusing to pay her medical bills.\nThe woman, Dawn Noel, filed the lawsuit Monday claiming she was injured on Aug. 19, 2013, during a rehearsal at a private dance studio in Woodland Hills, north of Los Angeles, for Spears' music video for her single \"Work Bitch.\"\nIn the complaint obtained by NBC News, Noel says that she arrived at 10 a.m. and rehearsed with other dancers and the choreographer until Spears arrived at 12:30 p.m. \"in a disheveled and confused state.\" Although the choreography involving Spears \"was fairly basic,\" she was \"having difficulty learning the moves, performing dances steps and following simple directions,\" according to the lawsuit.\n\"After approximately half an hour of rehearsing, as (Noel) stood off to (Spears') side, Britney twirled in an unbalanced and reckless manner, arms extended out to her sides, and forcefully backhanded (Noel) in the face,\" the complaint alleges.\"","url":"https://www.nbcnews.com/pop-culture/celebrity/dancer-sues-britney-spears-baby-dont-hit-me-one-more-n97701"}
