{"authors":["Alanna Bennett"],"date_download":"2018-10-30 22:36:09","date_modify":"2018-10-30 22:36:09","date_publish":"2014-08-14 22:01:18","description":"If you are a person who saw Guardians of the Galaxy — and the opening weekend box office numbers suggest you are — then you are likely also a person who loves themselves a dancing Baby Groot tree. That's because dancing baby Groot became undeniably…","filename":"data/vaneerConsumption/DancingBabyGrootFromGuardiansoftheGalaxyWasInspiredBySomethingClosetoHome.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/40f4d538-6268-4947-8842-9f3e8b9a033e.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35849-dancing-baby-groot-from-guardians-of-the-galaxy-was-inspired-by-something-close-to-home_1540938969.html","title":"Dancing Baby Groot From 'Guardians of the Galaxy' Was Inspired By Something Close to Home","title_page":"Dancing Baby Groot From 'Guardians of the Galaxy' Was Inspired By Something Close to Home","title_rss":"NULL","source_domain":"bustle.com","text":"If you are a person who saw Guardians of the Galaxy — and the opening weekend box office numbers suggest you are — then you are likely also a person who loves themselves a dancing Baby Groot tree. That's because dancing baby Groot became undeniably popular after his debut in the credits at the movie's end. And now we know something beautiful: What inspired Guardians' dancing baby Groot.\nTurns out there was a specific person in mind when the Guardians team were going about making a CGI sapling boogie — and it wasn't Vin Diesel, who voiced Groot throughout the film. Turns out it was Guardians' director, James Gunn. As Gunn told Yahoo:\nBaby Groot dancing is 100 percent me. I was too embarrassed for anyone to be there, so I made everyone leave the room and I set up a camera and I videotaped myself dancing. Then I sent the video to the animators and had them animate over that. I begged them not to leak the video! Two of my closest friends came to an early screening and said ‘Hey, I recognize those moves! That’s you dancing isn’t it?!’\nThat's all well and good, James Gunn. But, uh, we're gonna need to see that video. As evidence.\nImage: Nerdist","url":"https://www.bustle.com/articles/35849-dancing-baby-groot-from-guardians-of-the-galaxy-was-inspired-by-something-close-to-home"}
