{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:38:58","date_modify":"2018-10-30 23:38:58","date_publish":"2014-08-13 15:05:23","description":"Ladies and gentlemen (and, ahem, Marvel) behold: a dancing Baby Groot toy from Guardians of the Galaxy! Yes — a very, very, very wise soul who had the prescience and D.I.Y. dexterity that apparently none of us have, created a dancing Baby Groot toy.…","filename":"data/vaneerConsumption/DancingBabyGrootToyFromGuardiansoftheGalaxyHasanAdorableNewLookVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/19565449-09f5-48c2-b7b2-e14703a5d049.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35591-dancing-baby-groot-toy-from-guardians-of-the-galaxy-has-an-adorable-new-look-video_1540942738.html","title":"Dancing Baby Groot Toy From 'Guardians of the Galaxy' Has an Adorable New Look - VIDEO","title_page":"Dancing Baby Groot Toy From 'Guardians of the Galaxy' Has an Adorable New Look — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Ladies and gentlemen (and, ahem, Marvel) behold: a dancing Baby Groot toy from Guardians of the Galaxy! Yes — a very, very, very wise soul who had the prescience and D.I.Y. dexterity that apparently none of us have, created a dancing Baby Groot toy. It is available below for your viewing pleasure but sadly, it is not yet available for your purchasing pleasure. Hey, Marvel, wanna get on that? Christmas will be like a dream come true for your merchandising and consumerism team!\nGuardians of The Galaxy Baby Groot, aka The Plant That Has Taken The Internet by Storm, has proven over the past few weeks that yes, shrubs really can take center stage. One can practically hear the echoing, rallying cries of the Internet: \"we want Baby Groot toys!\" But when life doesn't hand you the toys that you want, you must take matters into your own hands. A do it yourself project might seem like it's just a way to get you to don your apron of domesticity, but it's actually exemplary of being totally self sufficient. Turn down for what? \"No one's gonna do it for me? FINE. I'mma DO IT MYSELF... bitch.\"\nSo, how did this wise soul, Patrick Delahanty, get his D.I.Y. on and make this toy? He explains on his YouTube page:\nI made this using a \"Movin' & Groovin'\" flower I got from eBay, cut off the dumb daisy, and covered the stem on felt and twine. My fiancee sculpted the head from Model Magic. We then painted everything with brown and tan paint. He can now dance to Peter Quill's \"Awesome Mix\"... or to my own mix.\nThe secret's out. Man, this plant's hips don't lie. Perhaps a twerking Baby Groot is in order?\nPatrick Delahanty on YouTube\nImage: Patrick Delahanty/Youtube","url":"https://www.bustle.com/articles/35591-dancing-baby-groot-toy-from-guardians-of-the-galaxy-has-an-adorable-new-look-video"}
