{"authors":["Elliott Bretland For Mailonline"],"date_download":"2018-10-22 21:45:07","date_modify":"2018-10-22 21:45:07","date_publish":"2016-01-29 08:08:50","description":"Daniel Sturridge has featured just three times since Jurgen Klopp took charge at Anfield in October and Souness feels Liverpool need to get the root of the striker's injury problems.","filename":"data/vaneerConsumption/DanielSturridgesetbacksarenotacoincidenceandLiverpoolmustfindcauseofinjuryproblemsclaimsGraemeSouness.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/309A1B6900000578-0-image-a-11_1454054789210.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422312_Daniel-Sturridge-setbacks-not-coincidence-Liverpool-cause-injury-problems-claims-Graeme-Souness_1540244707.html","title":"Daniel Sturridge setbacks are not a coincidence and Liverpool must find cause of injury problems, claims Graeme Souness","title_page":"Daniel Sturridge setbacks are not a coincidence and Liverpool must find cause of injury problems, claims Graeme Souness | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Daniel Sturridge's recurring injury problems are no coincidence, according to Liverpool legend Graeme Souness.\nThe Reds striker has struggled with thigh and hamstring injuries and has missed much of this season and last.\nSturridge has featured just three times since Jurgen Klopp took charge at Anfield in October and Souness feels Liverpool must get the root of the problem.\nLiverpool striker Daniel Sturridge's (right) injury problems are not a coincidence, claims Graeme Souness\nSturridge has featured just three times for Liverpool since Jurgen Klopp took charge at Anfield in October\n'Daniel Sturridge was injured a lot prior to Klopp's arrival,' Souness, who played for and managed Liverpool, told Omnisport. 'Sturridge should be the first name on the team sheet because he has great qualities, but he isn't.\n'If he declares himself fit on a Monday and when you're writing the team out on Friday, you're not putting the number nine in because you know on a Saturday that Sturridge might not be fit [that's a problem].\n'So instead of being the first name, he's going to be the last on the team sheet and it shouldn't be like that.\n'I think they have run into a series of hamstring injuries which may have been self-inflicted, I think that's maybe something to look at. To have six or seven hamstring injuries all at the same time is not a coincidence.'","url":"https://www.dailymail.co.uk/sport/football/article-3422312/Daniel-Sturridge-setbacks-not-coincidence-Liverpool-cause-injury-problems-claims-Graeme-Souness.html"}
