{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 01:03:01","date_modify":"2018-10-23 01:03:01","date_publish":"2016-01-29 14:39:45","description":"The case shocked the nation in 2012 when little Daniel was found dead at his home in Coventry. Mariusz Krezolek and his partner Magdalena Luczak were convicted of his murder","filename":"data/vaneerConsumption/DanielPelkasstepfatherMariuszKrezolekisfoundhangedinprisoncell.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B30B0900000578-0-image-a-113_1454079003452.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422872_Step-father-murdered-four-year-old-Daniel-Pelka-hanged-prison-cell_1540256581.html","title":"Daniel Pelka's stepfather Mariusz Krezolek is found hanged in prison cell","title_page":"Daniel Pelka's stepfather Mariusz Krezolek is found hanged in prison cell | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The stepfather of Daniel Pelka - who murdered the tragic four-year-old in a case which shocked Britain - has been found dead in prison.\nMariusz Krezolek and his partner Magdalena Luczak systematically starved little Daniel and locked him in a box room, where he slept on a urine-soaked mattress.\nThe youngster died after he was dunked in a cold bath and hit over the head before being shut in his room. A judge found Krezolek delivered the fatal blow.\nKrezolek was jailed for life for the killing of the youngster - who resembled a 'famine victim' at the time of his death and foraged for scraps of food from his school bin because he was so hungry.\nMariusz Krezolek (right, with his partner, Magdalena Luczak) has been found dead in his prison cell. The couple killed Luczak's son Daniel Pelka (left) after the youngster was put through a harrowing abuse ordeal\nThe 36-year-old killer was found dead at Full Sutton prison in Yorkshire where he was serving his minimum 30-year sentence.\nHis death comes six months after his partner, Luczak, Daniel's mother, was found hanging in her prison cell at HMP Foston Hall.\nA Prisons Service spokesman said: 'HMP Full Sutton prisoner Mariusz Krezolek was found unresponsive in his cell at 8.30am on Wednesday 28 January.\n'Staff immediately attempted resuscitation but he was pronounced dead shortly after.\n'As with all deaths in custody, there will be an investigation by the independent Prisons & Probation Ombudsman.'\nThe case of Daniel Pelka brought an outpouring of grief in Coventry and the West Midlands after the little boy was found dead at his home in March 2012.\nDespite his weight plunging to just 1.5 stone after a six-month campaign of abuse, his situation was ignored by numerous government agencies because of 'stressed' staff and bad record keeping.\nHe weighed less than a toddler and stood six inches smaller than average when he died a few months short of his fifth birthday with at least 30 injuries to his emaciated body.\nThe death of Krezolek (left) comes six months after his partner, Luczak (right), Daniel's mother, was found hanging in her prison cell\nHis killers, both originally from Poland, blamed each other for the head injury which ultimately caused Daniel's death. They were found guilty of his murder at a trial in 2013.\nThe judge in their case said she believed that Krezolek beat Daniel around the head and then the couple left him to die alone on March 3, 2012, even having sex as he lay unconscious.\nMrs Justice Laura Cox told the pair: 'Your campaign of cruelty, as it has accurately been described, culminated in the severe blow or blows to his head that killed him. He was just four and a half years old.'\nThe judge in Krezolek's trial said she believed he had delivered the fatal blow's to Daniel's head\nShe said the pair had subjected him to 'deliberate, escalating and incomprehensible brutality, which continued right up to his death'.\nThe trial heard that Luczak, despite knowing of Daniel's hunger, gave specific instructions to his teachers that he was not to eat any more food than his small packed lunch because of an 'eating disorder'.\nKrezolek, a brick-layer who had trained in the Polish army, had been allowed to remain in the UK despite receiving three jail terms and being arrested six times in the eight years between his arrival and Daniel's death.\nHis sister later revealed that he was a violent criminal who was booted out of the army for attacking a fellow recruit.\nHis trial heard that he told the colleague in the summer of 2011: 'It's not even worth beating him [Daniel] because he won't feel pain as he's autistic.'\nIn other disturbing comments, Krezolek also informed the same work-mate that Daniel was 'all f***** up' and 'a very bad person'.\nCampaigner Nicci Astin, 39, who set up the Justice for Daniel Pelka Facebook page in a bid to prevent similar tragedies, said: 'If he's killed himself then he's a coward but it may have been the best thing he ever did in his horrible little life.\n'I suppose at the moment I'm in shock. Part of me is relieved that Krezolek is dead but part of me wanted to see him rot in jail.\n'At least he will no longer sit in a prison having three meals a day all paid for at the taxpayers' expense because he never let Daniel have that luxury.\n'It is a terrible waste of a family. Poor Daniel slipped through the cracks of the system and we will continue to fight to make sure it doesn't happen to other children.'","url":"https://www.dailymail.co.uk/news/article-3422872/Step-father-murdered-four-year-old-Daniel-Pelka-hanged-prison-cell.html"}
