{"authors":["Matt Turner"],"date_download":"2018-10-30 22:28:11","date_modify":"2018-10-30 22:28:11","date_publish":"2016-12-13 00:00:00","description":"Will the Dodd-Frank Act survive Donald Trump's presidency? At JPMorgan, it might not matter.","filename":"data/vaneerConsumption/DanielPintoJPMorganonproprietarytrading.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_daniel-pinto-jpmorgan-on-proprietary-trading-2016-12_1540938491.html","title":"Daniel Pinto JPMorgan on proprietary trading","title_page":"    Daniel Pinto JPMorgan on proprietary trading - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JPMorgan\nWill the Dodd-Frank Act survive Donald Trump's presidency? At JPMorgan, it might not matter.\nPresident-elect Donald Trump said on the campaign trail that he would effectively dismantle the landmark piece of post-financial crisis regulation, and after his election a post on his transition website said he would replace the act \"with new policies to encourage economic growth and job creation.\"\nPaul Atkins, one of the favorites for the role of Securities and Exchange Commission chair, is a vocal critic of the rule.\nThe expectation of an easier regulatory regime has contributed to bank stocks rallying since the election.\nBut Daniel Pinto, CEO of JPMorgan's giant investment bank, told Business Insider in a wide-ranging interview that JPMorgan \"will not do anything differently at all if the rule is eliminated.\"\nHe added that the bank would not go back to proprietary trading if it became permissible again.\nHere's the relevant passage:\nTurner: There is a new administration. There is talk of Dodd-Frank being repealed. What does that mean for JPMorgan?\nPinto: Almost every regulation that is in place, in my view, serves a purpose. Most of the time it is a rational piece of regulation, but there is a lot of overlap. This government, or any other government, at some point will have to think: \"We've put all these regulations in place. Which of those are really necessary? And which of those are overlapping one another? And what is affecting the economy?\" Someone will do that at some point. I think that is a good exercise. I think the banking sector is in a good place. It's better regulated. It is far more secure in terms of capital, liquidity, and controls. That's a good thing. But the pile of regulations, one on top of the other, has created a degree of bureaucracy and cost for a sector that is a bit challenged from a returns perspective.\nAt some point, that needs to be addressed. Someone starting that process would be a good thing. It doesn't mean at all that you want to go back to a place where you create risk. That is not what we're looking at. There is a lot of noise about the Volcker rule, whether that stays or goes. We will not do anything differently at all if the rule is eliminated. The way we would do business would not change. We may avoid some of the bureaucracy around all the reporting and checking and all of these things, but the way we do business would not change.\nTurner: That gets to another question. If the rules are rolled back, and let's say proprietary trading is allowed again, would everyone suddenly rush back into proprietary trading? Or would they say: \"You know what, we've learned our lesson. We probably shouldn't do that again.\"\nPinto: Well, we were never big in prop to begin with. We are not going back. Our business is built around taking risk to provide clients with liquidity. Are we going to do anything massively different? The answer is no.\nPinto isn't the first to say his employer wouldn't go back to proprietary trading.\nCitigroup CFO John Gerspach said last week that \"we don't want to do proprietary trading, but I also would love to work with regulators to lessen the burden of proving that we are not engaging in proprietary trading.\"Read the whole interview here.","url":"https://www.businessinsider.com/daniel-pinto-jpmorgan-on-proprietary-trading-2016-12"}
