{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-22 22:19:24","date_modify":"2018-10-22 22:19:24","date_publish":"2016-01-29 09:21:18","description":"Lisa Borch, then 15, and her boyfriend Bakhtiar Mohammed Abdulla, 29, stabbed her mother Tina Römer Holtegaard at least 20 times in their home in Kvissel, northern Denmark, in October 2014.","filename":"data/vaneerConsumption/DanishgirlLisaBorchwhomurderedmumafterbeingradicalisedbyISISisjailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2015/09/15/14/2C56E25A00000578-0-image-a-90_1442323137649.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422387_Blonde-Danish-girl-stabbed-mother-death-radicalised-watching-ISIS-execution-videos-online-jailed-nine-years_1540246764.html","title":"Danish girl Lisa Borch who murdered mum after being radicalised by ISIS is jailed","title_page":"Danish girl Lisa Borch who murdered mum after being radicalised by ISIS is jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The 16-year-old Danish girl who stabbed her mother to death after watching ISIS' sickening beheadings of British hostages has been jailed for nine years.\nLisa Borch, then 15, and her boyfriend Bakhtiar Mohammed Abdulla, 29, stabbed her mother Tina Römer Holtegaard at least 20 times in their home in Kvissel, northern Denmark, in October 2014.\nBefore the brutal murder of her mother, Borch had spent hours on YouTube watching footage of the savage decapitations of David Haines and Alan Henning.\nKiller: Danish teenager Lisa Borch (pictured left and right) was aged only 15 when in October last year she spent hours on YouTube watching footage of the savage decapitations of David Haines and Alan Henning\nTina Römer Holtegaard was stabbed at least 20 times at the home she shared with her daughter in Kvissel\nThe 16-year-old will serve nine years in prison - the longest sentence handed to a teenager in modern times in Denmark - after a High Court upheld a September ruling.\nBorch had appealed her initial sentence, telling the Western HIgh Court that the plan to kill her mother was all Adbulla's idea,\nShe told the court che had only confessed to the crime because she was scared of her boyfriend, who at 29 is nearly twice her age, The Local.dk reports.\nHer stepfather Jens Holtegaard told Danish media that although Borch was obsessed with ISIS, he did not blame Islam.\nHe said she could 'just as easily been attracted to the biker gang environment or some other extreme'.\nLisa Borch and her radical Muslim, Iraqi-born boyfriend Bakhtiar Mohammed Abdulla, 29, (pictured left and right) took a long-bladed kitchen knife and stabbed her mother Tina Römer Holtegaard at least 20 times\nInfluenced: A court which sentenced Borch to nine years in jail heard how she became obsessed with militant Islam after falling in love with an unnamed Muslim man. She later met Bakhtiar Mohammed Abdulla\nDuring the initial trial in September, the court heard how Borch became obsessed with militant Islam after falling in love with an unnamed Muslim man.\nBut he jilted her when he moved back to Sweden to be with his wife and children.\nHowever, she soon found a new soulmate in Iraq-born Abdulla, whom she befriended after meeting at a refugee centre near her home.\nBrainwashed: The court heard how Borch (pictured) became obsessed with militant Islam after falling in love with a unnamed Muslim\nFollowing the brutal murder, in which both Borch and Abdulla participated, the teenager called police claiming: 'I heard my mother scream and I looked out the window and saw a white man running away. Please come here, there is blood everywhere.'\nOn arrival police found Mrs Holtegaard, whose husband was away on a short business trip at the time of her murder, covered in her own blood in bed.\nDespite making the frantic phone call, the victim's daughter was discovered sitting on a chair in the living room playing with her iPhone and watching videos on YouTube. When police asked where her mother was, Borch refused to leave her computer and simply pointed upstairs.\nA later police examination of the computer showed that she had watched endless repeats of the beheadings of the two Britons, both of whom had gone to Syria on humanitarian missions.\n'She watched them the whole evening long,' said prosecutors at her trial. When police first arrived at the house she didn't leave the computer and merely pointed upstairs to indicate where her mother lay dead. It was this apparent disinterest which made her prime suspect in a matter of minutes.\nThe court heard that Borch's twin sister had recently moved out of the family home because she couldn't stand the constant arguing that went on between her mother and sister.\nProsecutors said it was this 'endless rowing which cost the mother her life.'\nThe court was told that Borch had teamed up with Abdulla after being dumped by her first lover. The two planned to flee together to Syria and fight for the ISIS cause.\nBorch claimed at the trial that they were 'just good friends' but authorities believe they were lovers.\nThe rows with her mother intensified as she pressured her daughter to break off her relationship with him and 'live the life of a normal teenager.'\nProsecutor Karina Skou told the court that the pair made a diabolical pact to kill her mother saying: 'This murder was cold blooded, ice cold and committed in a bestial manner.'\nBorch even showed her twin sister the knife she planned to use to kill their mother, but the comment was incorrectly written off a macabre joke.\nA police examination of Borch's computer showed that the teenager had watched endless repeats of the beheadings carried out by Mohammed Emwazi - the British ISIS executioner better known as Jihadi John\nBorch and her radical Muslim boyfriend Bakhtiar Mohammed Abdulla, 29, took a long-bladed kitchen knife and stabbed Tina Römer Holtegaard at least 20 times at the home they shared in rural Kvissel\nIn court Borch and Abdulla blamed one another for the killing of Mrs Holtegaard.\nHe claimed to have only arrived to 'help Lisa' after the teenager had already killed her mother. But Borch said Abdulla had actually been the knifeman.\nThe muddled version of events meant the court heard several stories about what actually happened.\nAlthough Abdulla was no longer at the property when police arrived, investigators found his fingerprints in the victim's bedroom.\nAlthough it couldn't be established who'd actually delivered the blows that killed Mrs Holtegaard, both of the accused were found guilty of murder.\nBorch was sentenced to nine years in prison, the first of which will be spent in a youth offenders institute.\nAbdulla received 13 years and will be expelled from Denmark when his sentence is up.\nBoth were ordered to pay around £40,000 in compensation to Mrs. Holtergaard's husband - Borch's stepfather - as well as her twin sister and a younger brother.","url":"https://www.dailymail.co.uk/news/article-3422387/Blonde-Danish-girl-stabbed-mother-death-radicalised-watching-ISIS-execution-videos-online-jailed-nine-years.html"}
