{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 01:03:15","date_modify":"2018-10-23 01:03:15","date_publish":"2016-01-29 14:39:40","description":"Daniel Evans, 22, of Filby, Norfolk, regularly films and broadcasts videos on his beloved Norfolk Broads, which has resulted in him being compared to Steve Coogan's character Alan Partridge.","filename":"data/vaneerConsumption/DanielEvansfromNorfolkiscomparedtoStevenCooganduetouniquestyle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2F15C00000578-0-image-a-69_1454078410802.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422863_The-real-life-Alan-Partridge-Young-radio-TV-presenter-Norfolk-compared-Steven-Coogan-character-brilliantly-unique-broadcasting-style-not-mention-dress-sense_1540256595.html","title":"Daniel Evans from Norfolk is compared to Steven Coogan due to unique style","title_page":"Daniel Evans from Norfolk is compared to Steven Coogan due to unique style | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young radio and TV presenter has been dubbed the real-life Alan Partridge after his unique videos led him to become a YouTube sensation.\nDaniel Evans, 22, regularly films and broadcasts videos on his beloved Norfolk Broads and the countryside.\nThis, coupled with his presenting style and dress-sense, has drawn comparisons with one of the county's favourite sons, Alan Partridge.\nKeen: Daniel Evans regularly films and broadcasts videos on his beloved Norfolk Broads and the countryside\nDan's presenting style and dress-sense has led to comparisons with Steve Coogan's character Alan Partridge\nThe Alan Partridge character, played by actor Steve Coogan, is a TV and radio presenter parodying several different TV personalities.\nIn Welcome to Places of My Life, the fictional character films walking tours around Norfolk, which have drawn direct comparisons with Dan's videos.\nDespite Partridge's obvious character flaws, Dan is happy with the comparison due to their shared love of the county.\n'It's not something I intended to do, the first time it happened was on Radio One with Greg James who played one of my videos on air,' he said.\nThe Alan Partridge character, played by actor Steve Coogan, is a TV and radio presenter parodying several different TV personalities\nDan began filming for friends and family at a very young age before producing his own video for the BBC on his love for Great Yarmouth\n'At first it was a bit bizarre because I didn't see any connection between himself and myself but I can now see a connection as someone who really loves Norfolk.\n'The main difference between us there is my love for the county is genuine whereas his is fake.\n'Lots of my friends do seem to find the connection funny and lots of them are encouraging me to make my videos more like Alan Partridge.'\nAs his videos began to get more attention due to the Alan Partridge link, Dan admitted to dressing like the fictional star to play up to it.\nDan is happy with the comparison due to their shared love of the county, despite the obvious character flaws\nDan's videos have gained a cult following after receiving a spike in viewers thanks to Radio One and a radio interview in Chicago\nHowever Dan insisted that he would continue presenting in his own way as that was what got him noticed.\nHe said: 'As long as I'm sharing my passion for the countryside and basically being in the outdoors then I'm doing something I've always wanted to do.\n'The way I present the films has evolved over time but as long as the public are enjoying my videos then I don't think I should change.\n'I'll just keep giving the public what they want.'\nDan admitted to dressing like the fictional star to play up to it as his videos began to get more attention\nDan insisted that he would continue presenting in his own unique way as that was what got him noticed\nAfter receiving a spike in viewers thanks to Radio One and a radio interview in Chicago, Dan's videos have gained a cult following.\nWhile he is thrilled to receive feedback, he revealed that some viewers have sent him very strange requests.\n'Feedback on the videos has been mixed, some of it has been intelligent but some of it has been very bizarre.\n'I've had very strange requests from people who've compared me to Alan Partridge.'\nDan produced a series of YouTube clips on Norfolk, as well as presenting his own internet radio show, named Bandana, when he was younger\nDan said his old radio show consisted of good music along with chat about his main passion, the Norfolk countryside\nDan, of Filby, Norfolk, began filming for friends and family at a very young age before producing his own video for the BBC on his love for Great Yarmouth.\nAfter receiving great feedback on his video, he decided to produce a series of YouTube clips on Norfolk, as well as presenting his own internet radio show, named Bandana.\nHosted on the Spreaker website, Dan said the show consisted of good music along with chat about his main passion, the Norfolk countryside.\nIn Welcome to Places of My Life, Alan Partridge films walking tours around Norfolk, which have drawn direct comparisons with Dan's videos\nDan said he has always had a deep connection with Norfolk and that it is a wonderful place to live and film\nHe said: 'I think I've always had a deep connection with Norfolk, not just because it's where I was brought up but also because it's a very unique place.\n'It hasn't got a motorway and it's about 40 years behind in urbanisation so it's a wonderful place to live and film.'","url":"https://www.dailymail.co.uk/news/article-3422863/The-real-life-Alan-Partridge-Young-radio-TV-presenter-Norfolk-compared-Steven-Coogan-character-brilliantly-unique-broadcasting-style-not-mention-dress-sense.html"}
