{"authors":[],"date_download":"2018-10-21 02:48:10","date_modify":"2018-10-21 02:48:10","date_publish":"2018-08-10 14:16:24","description":"Danielle has been part of some of our most important projects as a member of the Design department.","filename":"data/vaneerConsumption/DanielleRindlerjoinsGraphics.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_10__1540090090.html","title":"Danielle Rindler joins Graphics","title_page":"Danielle Rindler joins Graphics - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Graphics Director Chiqui Esteban and Design Director Greg Manifold:\nWe’re happy to announce that Danielle Rindler will be joining the Graphics department as an assignment editor.\nDanielle has been part of some of our most important projects as a member of the Design department. She first came to The Post as an intern from Indiana University in 2012, and rejoined us in 2014 after two years as a news designer for The Arizona Republic.\nDanielle played a major role on the teams that created the 1968 D.C. riots project, the What Unites Us project, the murder with impunity series and the DEA investigation published last year. She also worked on the multi-departmental efforts to develop custom experiences for AppleNews. Beyond these big collaborations, Danielle also produced pieces of her own as a designer and developer, including the 100 days of @realDonaldTrump, while also leading our excellent print work around the Inauguration.\nHer work has received several awards from the Society for News Design for print and digital designs, and she recently attended Poynter’s 2018 Leadership Academy for Women in Digital Media.\nDanielle will move over to Graphics on September 4.","url":"https://www.washingtonpost.com/pr/wp/2018/08/10/danielle-rindler-joins-graphics/"}
