{"authors":["Julia Pritchard For Mailonline"],"date_download":"2018-10-23 05:25:12","date_modify":"2018-10-23 05:25:12","date_publish":"2017-03-10 15:15:42","description":"The former beauty queen displayed her growing bump in a grey sports tracksuit and matching trainers as she headed to her local nail salon in Sutton Coldfield.","filename":"data/vaneerConsumption/DanielleLloyddisplaysbumpasshegetshernailsdone.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E2386B400000578-0-image-a-284_1489158815284.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301612_Danielle-Lloyd-displays-bump-gets-nails-done_1540272312.html","title":"Danielle Lloyd displays bump as she gets her nails done","title_page":"Danielle Lloyd displays bump as she gets her nails done | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She announced she was expecting her fourth child, and first with fiancé Michael O'Neill, last month.\nAnd Danielle Lloyd was truly glowing on Friday, as she headed out for a relaxing day of pampering.\nThe former beauty queen displayed her growing bump in a grey sports tracksuit and matching trainers as she headed to her local nail salon in Sutton Coldfield.\nScroll down for video\nNailed it! Danielle Lloyd, 33, certainly looked every inch the glowing mother-to-be on Friday, as she headed out for a day of pampering\nThe glamour model proudly showed off her ever-blossoming bump in the casual grey marl tracksuit.\nThe zip hooded top was of a form fit, to gently cling to her burgeoning belly, while the skinny trousers highlighted her long and lean legs to all.\nKeeping co-ordinated from head to toe, the former Celebrity Big Brother star teamed the ensemble with matching grey sports trainers, complete with structured white soles.\nCasual chic: The zip hooded top was of a form fit, to gently cling to her burgeoning belly, while the skinny trousers highlighted her long and lean legs to all\nDespite remaining casual in her outfit, the mother-of-three upped the glamour in her hair and make-up - keeping her brunette locks sleek and adding a sweeping of bronzer to her cheeks.\nDanielle beamed widely as she headed in to her local nail salon, showing no signs of fatigue from pregnancy - which she announced last month.\nThe new arrival with be Danielle's fourth child, as she already has three sons from her marriage to footballer Jamie O'Hara - Archie, six, Harry, five, and George, three.\nHappy family: The new arrival with be Danielle's fourth child, as she already has three sons with footballer Jamie O'Hara - Archie, six, Harry, five, and George, three (above)\nShe is expecting the new addition with her fiancé Michael O'Neill, who proposed at Claridge's Hotel on Valentine's Day last year.\nDanielle, who met Michael in the gym in 2015 a year after divorcing the footballer, recently admitted that their sex life hadn't suffered as a result of the pregnancy.\nShe recently confessed to Closer: 'We still have a spicy relationship and the sex is far from gone!'\nWhile they only announced they were expecting in February, Danielle was also quick to gush that it will not be their only child together.\n'Michael's joked that if we have another boy, we'll have to get on it straight away and try again for a girl!' she added playfully.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301612/Danielle-Lloyd-displays-bump-gets-nails-done.html"}
