{"authors":["Matt Turner"],"date_download":"2018-10-30 22:28:45","date_modify":"2018-10-30 22:28:45","date_publish":"2016-12-13 00:00:00","description":"Daniel Pinto, CEO of JPMorgan's giant investment bank spoke to us about the importance of scale in the trading business.","filename":"data/vaneerConsumption/DanielPintoofJPMorganoncostcutting.json","image_url":"https://amp.businessinsider.com/images/56bb61946e97c61e048b649d-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_daniel-pinto-of-jpmorgan-on-cost-cutting-2016-12_1540938525.html","title":"Daniel Pinto of JPMorgan on cost cutting","title_page":"    Daniel Pinto of JPMorgan on cost cutting - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JPMorgan Chase trader on the floor of the New York Stock Exchange Thomson Reuters \"When you start trying to cut costs in this type of business, you don't know when you'll stop.\"\nThat's Daniel Pinto, CEO of JPMorgan's giant investment bank. He was speaking about the importance of scale in the trading business, and the downward spiral that can begin with cost cuts.\nAnd when you cut, you can find yourself heading in to a downward spiral.\nUsing a slide from an investor day presentation earlier in the year, he explained that when you cut one business, the revenue is lost, but some of the costs stay on. That then puts additional pressure on the remaining businesses, potentially triggering a series of dominoes. Business Insider sat down with Pinto in a wide-ranging interview. Here's the relevant extract:\nPinto: It is shared infrastructure. Revenue flows go away, but capital related to operational and credit risk doesn't. That doesn't change just because you close a line of business. It just gets reassigned to different businesses. That's why when you start cutting you say, \"I don't like rates — I'm going to cut rates,\" well, the marginal ROE of what is left is worse. And as you cut more, it gets worse and worse. In my view, when you start trying to cut costs in this type of business, you don't know when you'll stop cutting. The more you do, the more painful it will become — all in an environment where the wallet has been shrinking.\nTurner: Right. It's not like Jenga. You can't push one bar out and leave all the other business lines untouched.\nPinto: The more you cut, the less you can do for your clients.\nBy definition you're going to cut the business that is less profitable, but that is a business that may be very important to your clients. Let's say you cut rates. You know that the marginal return that you have left will be a bit worse. To compensate, you need a higher market share in your remaining products. It's not obvious that the clients that need that product that is less profitable will reward you with business that is more profitable. The complete set of products is important.\nJPMorgan hasn't had to cut a great deal, thanks in large part to its unparalleled scale. JPMorgan ranked in the top three in every investment-bank business line but one in the first six months of the year, according to the data analytics company Coalition, placing No. 1 in four of the 14 categories.\nA lot of firms have cut one or more business lines, thugh, as they've sought to resize their business for a tougher, more heavily regulated environment. On one hand, that reduces the number of competitors. There are fewer players in each business. On the other hand, it intensifies the competition between the remaining players.\nFrom the transcript:\nTurner: A lot of people who used to do X, Y, and Z have now decided to just do X and Y. Their focus on those remaining businesses then becomes much more intense. X and Y is all they have left. What does that look like?\nPinto: That's absolutely true. An example of that is equities. We will see how it plays out when equities goes into a down cycle. Everyone said, \"We'll cut fixed income and focus all of our energy on protecting our equities franchise.\" Fine. Equities was growing. Now we have the first year where the equities wallet shrinks, and we may have another one. I don't know.\nRead the whole interview here.","url":"https://www.businessinsider.com/daniel-pinto-of-jpmorgan-on-cost-cutting-2016-12"}
