{"authors":["Ashley Adams"],"date_download":"2018-10-30 22:28:44","date_modify":"2018-10-30 22:28:44","date_publish":"2014-08-15 16:43:54","description":"Go ahead and add \"Daniel Radcliffe is a pretty good ping pong player\" to the list of interesting/perfect things you learned this week. (He's truly a man of many talents.) But that's not the only thing you'll learn in the latest installment of…","filename":"data/vaneerConsumption/DanielRadcliffeOnceWaxedanUhInterestingBodyPartMoreFunFactsfromaVeryFastInterviewVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ede519c2-c83f-4749-ac4a-16e130e5d673.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35918-daniel-radcliffe-once-waxed-an-uh-interesting-body-part-more-fun-facts-from-a-very_1540938524.html","title":"Daniel Radcliffe Once Waxed an, Uh, Interesting Body Part & More Fun Facts from a Very Fast Interview - VIDEO","title_page":"Daniel Radcliffe Once Waxed an, Uh, Interesting Body Part & More Fun Facts from a Very Fast Interview — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Go ahead and add \"Daniel Radcliffe is a pretty good ping pong player\" to the list of interesting/perfect things you learned this week. (He's truly a man of many talents.) But that's not the only thing you'll learn in the latest installment of Vogue's \"73 questions\" series. The former boy wizard answered questions that ranged from his favorite film (12 Angry Men) to his favorite food (a Canadian diner staple called poutine that quickly put to bed my fantasy of having dinner with Daniel Radcliffe the moment \"cheese curd\" came into play). Also revealed: Radcliffe's true opinion of horses (because admit it, you've had some concerns since he did Equus). You'll also learn that Daniel Radcliffe is your new favorite person ever and probably your soulmate for the following reasons:\nTHE TITLE OF HIS AUTOBIOGRAPHY WILL BE BRING ON THE EMPTY BROOMSTICKS\nI'm quite possibly the only person that falls in the center of the \"People who love a good David Niven reference\"/\"People who love a good Harry Potter reference\" venn diagram but boy do I fall there enthusiastically. And for that, Mr. Radcliffe, I thank you.\nHE COMMITS TO HIS CRAFT\nAnd by \"commits to\" I mean \"waxes\" and \"craft\" I mean \"ass\" (or as Radcliffe days, \"arse\"). It was for a role, of course. The more you know!\nHE WRITES POETRY\nSpecial guest star Zoe Kazan showed up to ask him the best gift he's ever gotten a girl, to which Radcliffe responded, \"My terrible poetry.\" Apparently he'll also take you down in the \"poetry\" category of Trivial Pursuit (which doesn't technically exist — Radcliffe was probably thinking of the Arts and Entertainment category. Or just inventing categories because Daniel Radcliffe gets to Accio any Trivial Pursuit category he damn well pleases).\nHE'S NOT SURE IF AMERICA IS BETTER THAN BRITAIN\nTo quote my favorite part of the video:\nINTERVIEWER: How is America better than Britain?\nDANIEL RADCLIFFE: *longest pause ever recorded*\nHE'S READY FOR HIS TRIP TO MARS\nRadcliffe plans to bring his sense of humor and his iPod (and will presumably cross that \"no food, shelter, or oxygen\" bridge when he comes to it).\nAnd that's just the beginning! The entire interview is definitely worth watching, if for nothing else than the bonus time step demonstration (something else Radcliffe's not too shabby at).\nVogue's \"73 Questions\" series is still fairly new (Radcliffe's appearance comes in the most recent of four episodes) and Radcliffe's is only the second interview to include some type of activity (Blake Lively made cupcakes in her \"Blakery\" but Sarah Jessica Parker and Olivia Munn just had to sit around like boring losers). In the hopes that the current trend continues, I have a couple of helpful celebrity/activity pairings.\nI'd love to see some ukulele jams with Michael Cera. I'm not sure if he actually plays ukulele or if my brain just inexplicably photoshops a ukulele into my mental picture of him. Regardless, something about Michael Cera just screams \"teeny tiny guitar\" to me.\nThey can follow that up with some fishing with Kristen Stewart. Think of all the cold fish jokes that could be made! That interview practically writes itself.\nI'd also like to pitch scrapbooking with Taylor Swift. She probably needs a place to keep all those Instagram photos of her hanging out with all her famous and impeccably dressed friends. Plus, Swift strikes me as one hell of a scrapbooker.\nFinally, I think tattoos with Miley Cyrus would make a killer season finale. And Cyrus happens to be an experienced tattoo artist. What could possibly go wrong?\nSo there you have it, Vogue. Ball's in your court now.","url":"https://www.bustle.com/articles/35918-daniel-radcliffe-once-waxed-an-uh-interesting-body-part-more-fun-facts-from-a-very"}
