{"authors":["Matt Turner"],"date_download":"2018-10-30 22:23:09","date_modify":"2018-10-30 22:23:09","date_publish":"2016-12-14 00:00:00","description":"A bunch of events in 2016 had the potential to send the market into a tailspin.","filename":"data/vaneerConsumption/DanielPintoJPMorganontradingvolumes.json","image_url":"https://amp.businessinsider.com/images/584c34f5ca7f0c1c008b4dfc-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_daniel-pinto-jpmorgan-on-trading-volumes-2016-12_1540938189.html","title":"Daniel Pinto JPMorgan on trading volumes","title_page":"    Daniel Pinto JPMorgan on trading volumes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President-elect Donald Trump at a rally in Grand Rapids, Michigan, on Friday. REUTERS/Mike Segar A bunch of events in 2016 had the potential to send the market into a tailspin.\nFrom the Brexit decision in June to the election of Donald Trump in November and the Italian vote against constitutional changes in December, there have been unexpected election results and breaks with the status quo.\nAnd while these events spurred trading activity, they did not roil the market in the way that many had predicted. In recent weeks, the US stock market has regularly topped record highs, for example.\nAccording to Daniel Pinto, the CEO of JPMorgan's giant investment bank, the events all triggered what has been called \"good volatility.\" That is to say that trading has been continuous, trading volumes have been healthy, and markets have been liquid.\nThat kind of trading is \"our business\" and a \"positive thing,\" Pinto said. Here's the relevant passage from the interview, which you can read in full here:\nTurner: Brexit, the election of Trump, the Italian referendum maybe, they all seem to be breaks from the status quo. Everything is new. There's a new party in government in the US. The UK is leaving the EU. Who knows what is going to happen in Italy. The market suddenly has to make sense of a lot more new information. Does that create more volume going forward?\nPinto: Probably. The important thing is that the market functions rather than the events or nonevents. The important thing is that at the time an event happens, the market should continue providing liquidity. When asset managers or clients need to reposition their books, in whatever direction, the market liquidity is there at a certain price. Higher volumes and more volatility in a continuous market, where it doesn't gap, is a good thing. That's our business. That is a positive thing. The last two or three events were positive events because there was volatility in a market that was functioning.\nTurner: There is this distinction between good volatility and bad volatility.\nPinto: Bad volatility is where the market gaps and no one can trade in the middle. These recent moves have been continuous moves.\nTurner: So with all that said, what are your expectations for 2017? Will the momentum from 2016 extend in to next year?\nPinto: It probably will. In the US, pro-growth policies will extend the expansionary cycle. There will be more action from the Fed, and that will create more opportunities on the interest rate side. Whatever policies the US takes on trade and globalization, it will have an influence on what does or doesn't happen in emerging markets. You have plenty of events taking place in Europe. You have a new government in Italy, elections in France and Germany. You have the initiation of the Brexit process. There are plenty of things that create a benign environment for volumes. Growth in the US will create more opportunities in M&A, in equity capital markets. Some of the momentum from this year may go into next year.\nRead the whole interview here.","url":"https://www.businessinsider.com/daniel-pinto-jpmorgan-on-trading-volumes-2016-12"}
