{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 22:17:22","date_modify":"2018-10-22 22:17:22","date_publish":"2016-01-28 10:09:48","description":"Daniel Radcliffe, 26, has proudly explained how he was responsible for bringing a farting corpse, quite literally, to life in the quirky indie flick 'Swiss Army Man'.","filename":"data/vaneerConsumption/DanielRadclifferevealshisprideforSwissArmyManatSundance2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A84E1F00000578-0-image-a-72_1453974044143.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420630_It-s-m-proud-say-Daniel-Radcliffe-reveals-pride-bringing-farting-corpse-life-Swiss-Army-Man_1540246642.html","title":"Daniel Radcliffe reveals his 'pride' for Swiss Army Man at Sundance 2016","title_page":"Daniel Radcliffe reveals his 'pride' for Swiss Army Man at Sundance 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His latest role is worlds apart from the Harry Potter franchise in which he made his name.\nAnd Daniel Radcliffe, 26, has proudly explained how he was responsible for bringing a farting corpse, quite literally, to life in the quirky indie flick 'Swiss Army Man'.\nIn an interview with Slate at the film's Sundance premiere, he revealed: 'Every day I got to set and we’d be thinking, \"How the hell are we gonna do this? It’s impossible!\" And every day, we got it done.\nScroll down for video\nFull of beans: Daniel Radcliffe, 26, has proudly explained how he was responsible for bringing his flatulent corpse character, quite literally, to life in an interview at the film's Sundance premiere\n'I would like to take this opportunity to say that it’s mostly me. And I’m proud to say it! I watched the first six minutes of the film and I’m so proud of how dead I f***ing look!'\nNot only does the film see Radcliffe ridden through the ocean by co-star Paul Dano as a fart-propelled jet-ski, but there are eye-popping scenes involving close-ups of his character's erection, which Dano uses as a compass.\n'One of the pieces that I had on was just a wooden—wow, I can’t believe I’m telling you this—it was like the end of a broom,' said Radcliffe. 'It was all just like one line, and too smooth. So that was the one note that I gave, and they took it and ran with it.'\nHit or miss? Daniel's latest cinematic offering may not be such a surefire success, if the reaction of initial audiences is anything to go by\nAn acquired taste, the film split opinion at the prestigious film festival with some members of the audience choosing to walk-out mid screening.\nBut unperturbed, Radcliffe diplomatically explained that he understood the film wouldn't be for everyone.\nHe added that those who did enjoy it would 'hold it very dear' to them and praised it as a 'triumph of creativity over practicality'.\nThe Harry Potter star is a proven box office success but the audience reaction to the indie flick hints that it might not be the surefire success of his previous efforts.\nAccording to a report in Variety, the film proved to be a divisive feature of last Friday's Sundance Film Festival in Utah, where it attracted crowds but failed to retain them.\nWalk-outs: Daniel Radcliffe's latest film proved to be a divisive feature of Friday's Sundance Film Festival in Park City, Utah, where it attracted crowds - but failed to retain them\nIt claims that 'the Eccles Theater had to turn away hundreds of movie fans, and even a few industry VIPs, at the packed premiere.\n'But the bizarre fable about a lost man (Paul Dano) who befriends a farting corpse (Radcliffe) could win the festival’s award for the most walk-outs, as a continuous stream of audience members kept standing up and bolting for the door throughout the film.\n'Dano’s character inspects the body, as it comes to life by twitching and passing gas. The film has drawn mixed reactions.'\nOn the ground: Reports say numerous film-goers prematurely left the screening on Friday afternoon\nMan in black: The 26-year-old Englishman was rocking Timberland boots with his all-black attire\nOnline, fans have expressed the spectrum of opinion - with some defending the quirky comedy.\n'The people who walked out of Swiss Army Man didn't get it,' tweeted Alex Billingham. 'Takes about 20 minutes until you figure it out. If you don't think, seems stupid.'\nLikewise, Steven Weintraub added: 'SWISS ARMY MAN is definitely not for everyone. But great performances by Paul Dano and Daniel Radcliffe make it worth seeing.'\nQuirky: A still from the movie shows Paul Dano's character finding the body of Daniel's on-screen alter-ego\nLine-up: The film's directors - Daniel Scheinert and Daniel Kwan - pose with their film's stars\nOthers were less diplomatic. Chris Nashawaty said: 'If [Michel] Gondry directed a castaway version of Weekend At Bernie's it might come close to the strangely confounding Swiss Army Man.'\nFilmed in the redwoods of Humboldt County, the indie flick - directed by Daniel Scheinert and Daniel Kwan - has also received a lukewarm response on IMDB.\nThere, 12 users gave it an average score of 5.3 out of 10.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420630/It-s-m-proud-say-Daniel-Radcliffe-reveals-pride-bringing-farting-corpse-life-Swiss-Army-Man.html"}
