{"authors":["Rohan Banerjee For Mailonline"],"date_download":"2018-10-22 23:40:10","date_modify":"2018-10-22 23:40:10","date_publish":"2016-01-28 12:53:18","description":"Milos Raonic has put in some impressive performances at the Australian Open so far and received plenty of support, not least from supermodel girlfriend Danielle Knudson.","filename":"data/vaneerConsumption/DanielleKnudsoncopiesboyfriendMilosRaonicsposeaheadofAustralianOpensemis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9AD7E00000578-0-image-a-36_1453979763399.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3420773_Danielle-Knudson-shows-support-boyfriend-Milos-Raonic-copycat-pose-prepares-Australian-Open-semis_1540251610.html","title":"Danielle Knudson copies boyfriend Milos Raonic's pose ahead of Australian Open semis","title_page":"Danielle Knudson copies boyfriend Milos Raonic's pose ahead of Australian Open semis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She uploaded a picture of herself dressed like Raonic on Instagram\nThe 25-year-old has put in some impressive performances in Melbourne\nMilos Raonic has put in some impressive performances at the Australian Open so far, turning heads while edging a five-set thriller against fourth seed Stan Wawrinka and beating Gael Monfils to reach the tournament's last four.\nThe 25-year-old has received plenty of support, not least from supermodel girlfriend Danielle Knudson, who uploaded a picture of herself dressed in her own version of his tennis kit on Instagram.\nStriking a pose aimed to mimic Raonic hitting a shot, she captioned the snap jokingly: 'Now I Look the part, I just need to work on my game.'\nDanielle Knudson has shown her support for tennis star boyfriend Milos Raonic with an Instagram post\nKnudson has been a regular court-side supporter for Raonic during the Australian Open in Melbourne\nThe Canadian supermodel was called 'stunning' by pop singer Justin Bieber in the summer of 2014\nKnudson and Raonic pose for a photo together while enjoying a beach holiday last month\nKnudson, who has done extensive work with the Guess clothing line, shot to prominence 18 months ago when she caught the attention of pop star Justin Bieber.\nThe singer called her 'stunning' and shared one of her modelling photos on his own Instagram account.\nRaonic, meanwhile, will face British No 1 Andy Murray in the Australian Open's semi-final on Friday.\nThe Canadian won three of the pair's first four meetings, but Murray has claimed the last two. The Scot also won the only Grand Slam match between them at the 2012 US Open.\nRaonic, the youngest man left in the Melbourne competition, is bidding to win the first major of his career.\nSpeaking about his development following the win over Wawrinka, he told reporters: 'I think it was more you have these guys, these Grand Slam champions, guys that have been playing great, and to beat one of them for the first time at a Slam, doesn't matter if that was on Court 15 or whichever court.\n'It has a very concrete sort of message to the work I'm putting in and how I'm going about things.'\nRaonic is set to face British No 1 Andy Murray in the Australian Open's last four on Friday","url":"https://www.dailymail.co.uk/sport/tennis/article-3420773/Danielle-Knudson-shows-support-boyfriend-Milos-Raonic-copycat-pose-prepares-Australian-Open-semis.html"}
