{"authors":["John Hayward"],"date_download":"2018-10-30 20:56:25","date_modify":"2018-10-30 20:56:25","date_publish":"2015-03-16 20:57:04","description":"Each year, the Free Press Society of Denmark gives out the Sappho Award -- a prize for courage in the advocacy of free speech, named after the Greek poet who serves as the Society's icon. This year's winner is cartoonist Lars Vilks, who has been dealing with death threats from Muslims in Europe ever since drawing a dog with Mohammed's head in 2007. |","filename":"data/vaneerConsumption/DanishFreePressSocietyAwardsPrizetoCartoonistLarsVilks.json","image_url":"https://media.breitbart.com/media/2015/02/Lars-Vilks-Mohammed-as-a-dog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_16__1540932985.html","title":"Danish Free Press Society Awards Prize to Cartoonist Lars Vilks","title_page":"Danish Free Press Society Awards Prize to Cartoonist Lars Vilks","title_rss":"NULL","source_domain":"breitbart.com","text":"Each year, the Free Press Society of Denmark gives out the Sappho Award — a prize for courage in the advocacy of free speech, named after the Greek poet who serves as the Society’s icon. This year’s winner is cartoonist Lars Vilks, who has been dealing with death threats from Muslims in Europe ever since drawing a dog with Mohammed’s head in 2007.\nLast month, an ambitious jihadi attacked the conference in Copenhagen where Vilks was speaking, killing one bystander and wounding three police officers before moving on to a shooting rampage at the city’s major synagogue.\nThe BBC, which mildly describes Vilks’ situation by saying, “his cartoon offended many Muslims and he now lives under guard in Sweden,” notes that armed security was required for the Sappho Award ceremony. It was held at Christianborg Castle, which also houses the Danish parliament. “Our correspondent says the show of force is something of a culture shock for what had been a peaceful and relatively secure country,” notes the network.\nVilks remains determined to give the jihad-inclined forces of intolerance a few culture shocks of their own.\n“I am an artist and my artwork is probably difficult to understand,” he said when receiving his award. “Many have tried to understand what that dog is about. But I don’t even understand it myself. Some believe that it is a form of blasphemy, but I say that it is what art is all about. I show my things to the world and then the world must interpret it.”\nAccording to Agence France-Presse, the Sappho Award ceremony was the 68-year-old cartoonist’s first public appearance since the Copenhagen attack. A previous appearance scheduled two weeks ago in Vilks’ native Sweden was first postponed, and then canceled, due to security concerns about Muslim violence.","url":"https://www.breitbart.com/national-security/2015/03/16/cartoonist-lars-vilks-wins-prize-for-courage-from-danish-free-press-society/"}
