{"authors":["Mailonline Reporter"],"date_download":"2018-10-22 22:26:25","date_modify":"2018-10-22 22:26:25","date_publish":"2016-01-28 10:29:08","description":"The model, who has three sons with her footballing ex Jamie O'Hara, 29, is selling Chanel handbags, Gucci shoes and sequin Christian Louboutin stilettos on her page.","filename":"data/vaneerConsumption/DanielleLloydflogsherolddesignerhandbagsandclothesinonlinesale.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A94F6900000578-0-image-a-22_1453976859703.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420554_Former-WAG-Danielle-Lloyd-flogs-old-designer-handbags-clothes-online-sale-demanding-4-500-one-Chanel-tote_1540247185.html","title":"Danielle Lloyd flogs her old designer handbags and clothes in online sale","title_page":"Danielle Lloyd flogs her old designer handbags and clothes in online sale | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's accumulated quite the designer collection in her years as a WAG - but now Danielle Lloyd is giving her fans the chance to snap up some bargains as she flogs her wardrobe online.\nAccording to The Sun, 32-year-old Danielle is selling her designer goods on online market place, Depop.\nThe model, who has three sons with her footballer ex-husband Jamie O'Hara, 29, is selling Chanel handbags, Gucci shoes and sequin Christian Louboutin stilettos on her page.\nScroll down for video\nFormer WAG Danielle Lloyd, 32, is selling lots of her old designer handbags and clothes - including Chanel bags and Christian Louboutin heels - in an online sale\nDanielle's account blurb reads: 'Hope you all have fun shopping! All sales are final no refunds available will always listen to offers so DM me x.'\nIn one description attached to a pair of £350 boots, Danielle writes: 'Stunning Roberto Cavalli boots worn twice amazing condition look brand new comes with box and protector bag.'\nIn another, for a classic quilted Chanel bag, Danielle explains: 'Classic beige jumbo bag used slightly dirty on the outside and makeup marks on inside lamb skin quilted leather.'\nOne of her Chanel handbag listings has sparked debate on the site. The £4,500 product's description reads: 'Authentic Chanel boy bag limited edition comes with receipt box authentication card real silver stitching.'\nOne item is this 'Authentic Chanel boy bag limited edition', which is on sale for £4,500 and has sparked debate among users questioning why it is so expensive. 'It's limited edition and Chanel bag are very collectable [sic]', replied Danielle\nA pair of all pink sequin Christian Louboutin heels, which can cost up to £1,000, are on sale for £300. 'Worn a few times but in great condition payed a lot for these!!!,' writes Danielle\nShe is also selling a pair of Roberto Cavalli boots on sale for £350. 'Stunning Roberto cavalli boots worn twice amazing condition look brand new comes with box and protecter bag,' reads Danielle's description\nOne user asked: 'Beautiful bag but are you looking for more than you paid for it?', to which Daniellie replied: 'Yes Hun it's limited edition and Chanel bag are very collectable.'\nAnother user then responded: 'But it's not vintage this model is still for sale in the shops for less money.' To which Danielle replied: 'No it's not it's a limited piece which was bought dec 2014.'\nUsers were quick to question why Danielle was selling it, to which she explained: 'No nothing at all wrong with it, its stunning I just don't use it enough x.'\nShe is also listing a large limited edition Fendi spy handbag for £1,200, which she claims she paid £8,000 for and has only used twice\nThere's also plenty of men's clothes - including a £600 Gucci tracksuit, right, and never-before-worn Louis Vuitton T-shirt, left, on sale for half the price of the original for £180\nAs well as clothes and shoes, she is also selling jewellery - much of it by Robert Cavalli. One ring, which is listed at £50, is described as being in 'amazing condition' and will 'look stunning on'.\nThere's also plenty of men's clothes - including a £600 Gucci tracksuit and never-before-worn £180 Louis Vuitton T-shirt - on sale for half the price of the original.\nA man, whose head has been cropped from the shot, can be seen modelling the garments. It could well be her boyfriend, electrician Michael O’Neill.\nOver half of Danielle's listed items, which come with huge discounts, have sold.\nA spokesperson for Danielle said: ‘Just like Kim Kardashian, Katie Price and Vicky Pattinson and many other celebrities, Danielle doesn’t see that having a clear out of some unwanted clothes to sell is a big deal.\n'As a mum-of-three, it’s quite a normal thing to do to sell clothes online, and as she normally would, Danielle will be making a charitable donation from any money she makes.’","url":"https://www.dailymail.co.uk/femail/article-3420554/Former-WAG-Danielle-Lloyd-flogs-old-designer-handbags-clothes-online-sale-demanding-4-500-one-Chanel-tote.html"}
