{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 03:58:22","date_modify":"2018-10-23 03:58:22","date_publish":"2017-03-16 14:59:15","description":"Actress Danniella Westbrook is making no attempts to hide the fact that she wants to return to BBC soap EastEnders full-time.","filename":"data/vaneerConsumption/DanniellaWestbrooksaysEastEndersonlyuseherforPR.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54CD4300000578-0-image-a-31_1489675929125.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320610_Danniella-Westbrook-says-EastEnders-use-PR_1540267102.html","title":"Danniella Westbrook says EastEnders only 'use' her for PR","title_page":"Danniella Westbrook says EastEnders only 'use' her for PR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She made a brief comeback as Samantha Mitchell a year ago when veteran character and on-screen mother Peggy died.\nBut actress Danniella Westbrook is making no attempts to hide the fact that she wants to return to BBC soap EastEnders full-time.\nHowever, the 43-year-old - who had to resort to an appearance on Celebrity Big Brother last year for work instead - thinks the BBC only 'use' her occasionally to boost ratings.\nScroll down for video\n'They just will not do it!' Danniella Westbrook admits she wants to be written back in to EastEnders but that the BBC only 'use' her for PR... as she hits a late night kebab joint in Marbella\n'They just will not do it. They have said I’m sacked, I’m this and that, they seem to use me for PR and not for the work,' she told The Sun.\nElaborating on what the long-running soap is missing currently, Danniella went on: 'Because you haven’t got the Pauline, Peggy and Pat types, older characters... it needs Sam, Sharon and Roxy; but they just won’t do it!'\nAfter declaring that she would 'always' go back to the show if asked, admitting how much she 'loves it', Danniella said: 'The last time I went back fans [wanted me back] because [Sam’s] a superbitch and there’s good tension between her and Sharon and all that stuff.'\nIndeed, Samantha's 'superbitch' status is a notorious one in the EastEnders canon.\nComeback: Danniella Westbrook is making no attempts to hide the fact that she wants to return to BBC soap EastEnders full-time\nShe feels 'used': The 43-year-old - who had to resort to an appearance on Celebrity Big Brother last year for work instead - thinks the BBC only 'use' her occasionally to boost ratings\nIn and out: Sam was portrayed by Danniella from 1990, for ten years until 2000; she returned again between 2009 on and off until last year when she appeared on four episodes for Peggy's funeral scenes (pictured)\nYet Danniella's personal troubles have plagued her abiity to get hired as an actress; in fact, when the show required the character of Sam to be back in the series between 2005 and 2005 they hired a different actress all together (Kim Medcalf).\nSam was portrayed by Danniella from 1990, for ten years until 2000; she returned again between 2009 on and off until last year when she appeared on four episodes for Peggy's funeral scenes.\nBecause of the star's tumultuous personal life, the actress feels she is brought in and out for the sake of publicity, and that she is somewhat 'used'.\nThis year alone she has been in the press for alleged vagrancy, a drug relapse, a public reconciliation with her son on Loose Women, extravagent trips abroad and buying new cars despite supposed financial struggles, and kissing men in public - one being 'Human Ken Doll' Rodrigo Alves and the other a mystery lover.\nUnstable: Because of the star's tumultuous personal life, the actress feels she is brought in and out for the sake of publicity, and that she is somewhat 'used'\nShe was spotted putting on a cosy display with the elusive beau in Marbella on Sunday, where she has been seen for the past couple of weeks.\nA source spotted the new couple at Callaghan's Bar after they were seen looking loved-up.\n'They've been snogging each other's faces off all day,' the source explained.\nVerifying the suitor's identity, a second insider confirmed that the younger man is named Paris and identified him as a 'bad boy type'.\nDanniella had got tongues wagging over the weekend as she documented a romantic evening out with her new 'special little friend'.\nCosy: The soap star - who spends the winter months in the Spanish hotspot - took to her Instagram to share a number of cosy snaps with her handsome other half\nThe soap star - who spends the winter months in the Spanish hotspot - took to her Instagram to share a number of cosy snaps with her handsome other half.\nEnjoying his company, the former EastEnders actress posted a number of telling selfies with Paris, in which he placed a sweet peck on her check.\nCaptioning the candid pic, she wrote: 'Dinner date in the port with our friends #thisgirlcan #loveMylife #princess #happy #marbella #marbslife #dinnerdate #thewestbrook #one'.\nIn another intimate shot, Danniella could be seen wrapping her arms around her mystery man in complementing monochrome ensembles.\nParty pals: Having used the hashtag 'one' alongside her images with her hunky companion, many of her loyal followers questioned who the mystery man was\nShe wrote along with it: 'Ready for our night with friends in Marbella #my #loveMylife #thisgirlcan #happy #sunshine #princess.'\nHaving used the hashtag 'one' alongside her images with her hunky companion, many of her loyal followers questioned who the mystery man was.\nAnswering her social media fans, she referred to the brown haired pal as 'my special little friend' alongside a number of winky face emojis.\nMailOnline have contacted Danniella Westbrook's rep for comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320610/Danniella-Westbrook-says-EastEnders-use-PR.html"}
