{"authors":["Becky Freeth","Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 02:46:07","date_modify":"2018-10-23 02:46:07","date_publish":"2017-03-16 13:22:55","description":"Danny Dyer has been pictured back in the UK with his wife Joanna Mas for the first time this week, after returning from a break in South Africa, where he was recovering alone.","filename":"data/vaneerConsumption/DannyDyerreunitedwithwifeJoanneMas.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54675C00000578-0-image-a-83_1489670557988.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320248_PICTURED-Danny-Dyer-reunited-wife-Joanne-Mas_1540262767.html","title":"Danny Dyer reunited with wife Joanne Mas","title_page":"Danny Dyer reunited with wife Joanne Mas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Danny Dyer has been pictured back in the UK with his wife Joanna Mas for the first time this week, after returning from a solo break in South Africa.\nThe EastEnders actor is taking time off from the soap EastEnders amid claims he was suffering from 'exhaustion and stress'.\nWith a cigarette resting between his lips, a relaxed Danny, 39, was spotted driving his wife around Essex on a shopping trip as he now returns to everyday life.\nBack together: Danny Dyer (left) was seen reunited with his wife Joanne Mas (right) for the first time this week\nThe chivalrous actor let his long-term love take a backseat and instead commanded the flashy vehicle with one hand, using the other to puff on a cigarette.\nBoth were shaded behind sunglasses, keeping a distinctly lower profile than usual on their shopping trip.\nDanny was said to be taking some time away from the soap for personal reasons, after a string of emotional storylines for his character.\nHe was last seen in an Instagram snap taken during his time away in South Africa, where he is thought to have been alone.\nBack together: Danny was at the wheel of his vehicle, with Joanne in the passenger seat\nCute couple: Danny and his wife Joanne married in 2016\nReunited: Danny was at the wheel of a flashy car, using one hand to puff a cigarette\nSpotted: It's the first time the actor has been seen since returning to the UK\nGetting around: It was a more relaxed day out in Essex, where he was shopping with Joanne\nThe star - who plays Mick Carter in EastEnders - was seen flashing a peace sign as he cuddled up to a fan for the shot.\nIt was reported in January that an incident at the National Television Awards saw an 'intoxicated' Danny become embroiled in a 'meltdown' leading to claims that he was bowing out of EastEnders for a rest period.\nDespite the claims, and an accompanying video, soap bosses came forward after the leaked clip to deny that he is 'spiralling out of control, exhausted and needs to control his temper.'\nHappy and healthy: Danny was said to be taking some time away from the soap for personal reasons and was last seen in an Instagram snap taken during his time in South Africa\nDanny flew out on February 10, and despite only just coming home, is already planning another trip as he allegedly wants to take Joanne on a 'no expenses spared' second honeymoon following his alleged work woes.\nDuring his South African break, Joanne was reportedly staying at home with their three daughters Dani 19, Sunnie nine and two-year-old son Arty.\nAccording to The Mirror the couple are now set to relight their romance by jetting to the Maldives: 'Since they got married Danny has been working non stop, they haven’t had a lot of time together and he wants to make Jo feel special.\n'He’s very focused on his family. His time in South Africa has done him the world of good. Now he just wants to do lots of fun things with his family.\nBack on track: He jetted off to South Africa last month during an extended break from EastEnders amid claims he was suffering from 'exhaustion and stress'\nDespite the romantic gesture, reports surfaced in January stating he had exchanged racy messages with a young mother, who he met at an Essex book signing event the previous year, as she claimed he told her 'bend over and show me that bottle' - cockney rhyming slang for her backside.\nOn June 27, just nine weeks before his wedding to Ms Mas, he sent the woman a picture of his privates poking out of boxer shorts. A source said after the revelation: 'This was a bit of fun between Danny and a girl that has got a bit out of hand.\n'There was no relationship, it was nothing serious and Jo is not about to split up with the love of her life over a few messages. Everything we have heard suggests Jo will stand by her man.'\nPerfect pair: Despite just coming home he is already planning another trip as he wants to take Joanne on a 'no expenses spared' second honeymoon following his alleged work woes\nNews of the romantic getaway comes after it was claimed that the cast of EastEnders are reportedly planning a surprise welcome back party for Danny when he returns to the BBC soap.\nHis co-stars, according to the Daily Star, are keen to show their support for the soap favourite when he makes his anticipated return.\nA source told the newspaper: 'They're keen to show everyone is behind him 100% after his tough few months. They are planning a round of applause when he steps back behind the bar for filming for the first time.'\n'The cast know how important Danny is to the show's success and don't want it to be awkward.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320248/PICTURED-Danny-Dyer-reunited-wife-Joanne-Mas.html"}
