{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 02:31:37","date_modify":"2018-10-23 02:31:37","date_publish":"2016-01-28 17:19:10","description":"Security entered the Celebrity Big Brother house for the second time this series as a hysterical Stephanie Davis threatened to quit the show.","filename":"data/vaneerConsumption/DanniellaWestbrookclaimsStephanieDavisbehaviouronCBBhasRUINEDhercareer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC52B500000578-0-image-a-94_1453998497909.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421260_She-won-t-work-Stephanie-Davis-threatens-leave-Celebrity-Big-Brother-house-Danniella-Westbrook-remarks-future-career-prospects_1540261897.html","title":"Danniella Westbrook claims Stephanie Davis' behaviour on CBB has RUINED her career","title_page":"Danniella Westbrook claims Stephanie Davis' behaviour on CBB has RUINED her career | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Security entered the Celebrity Big Brother house for the second time this series as a hysterical Stephanie Davis threatened to quit the show.\nIn scenes airing in Thursday's episode, Stephanie, 22, became angry following another tense round of nominations and became embroiled in an argument with Danniella Westbrook, 42, who told her, 'You'll never work again off the back of this show.'\nIn the Diary Room, she decided to exit the house and asked, 'Where's Jez please? I am leaving right now. I'm not doing this anymore,' before fleeing to the detox clinic to find Jeremy McConnell.\nScroll down for video\nFriend or foe: Stephanie Davis, 22, was left upset when Danniella Westbrook, 42, told her that her behaviour in the house has jeopardized her career prospects\nWith tempers flaring, Stephanie was called back to the Diary Room where security were forced to intervene to calm her down.\nIt is the second time that security have been called into the house in as many weeks after Megan McKenna had to be restrained during a row with John Partridge and Tiffany Pollard.\nBefore this series, security had not entered the house in 10 years.\nDavis's unhappiness began earlier in the day when she was confirmed as one of the 'toxic' housemates to be treated by TV nutritionist Gillian McKeith, alongside McConnell, Pollard and Darren Day.\nSick of it: The controversial 22-year-old told Jeremy she's sick of having to explain herself\nThe nominations, to be revealed in the show, by the remaining 'pure' housemates further upset Pollard and Davis who had both been drinking.\nAsked to return to the detox clinic, Davis screamed: 'I'm not going in! I've given you more entertainment than anything you could wish for!' before returning to the living area in a frenzied manner and announcing that the house was sending her mad.\nIn response to Westbrook's observation that she was self-destructing, Davis lashed out: 'Never speak to me again after this.'\nGrowing more frantic, Davis entered the Diary Room but refused to be filmed and threatened to leave the house, at which point security was called for her own safety.\nShe was eventually allowed to leave the room and sought the comfort of McConnell in the detox clinic where the pair decided to leave the house together.\nHuge impact: Stephanie revealed that her life had been 'turned upside down' by Big Brother\nDuring a conversation with Gemma Collins and John Partridge in the kitchen, Danniella had said: 'She won’t ever work again when she’s come out of here. I love her dearly; I’ve been that girl that has self-destruct. I feel sorry for her.'\nBut Stephanie didn't see the comments as those of a concerned friend.\nRetreating to the detox clinic, she told love interest Jeremy McConnell: 'Danniella went I will never work again after this show. Laughing in my face! I want to go now!'\nAnd the heavily tattooed model reassured her that he would back her up, before revealing: 'I only want to be with you.'\nSticking together: Jeremy and Stephanie made their way to the diary room to discuss their potential exit from the house\nIt looked like the incident would be the straw that broke the camel's back, when the pair made their way to the diary room to discuss their potential exits.\nSee more of the latest CBB updates as Danniella claims Stephanie will 'never work again'\nJeremy explained that he thought Stephanie has had enough and was not happy, and that he would walk out with her.\nAdmitting they had had a great time in the house, Stephanie then said: 'I’d rather go together and not be without him! I’m sick of explaining myself.'\nBut after speaking to Big Brother, the pair decided to stay in the detox clinic.\nAnd Stephanie confessed: 'My life has been turned upside down by this programme.'\nBack in the clinic, Jeremy comforted a visibly upset Stephanie, and told her to ‘stop letting words hurt her’.\nIn the bedroom, Danniella opened up to John, Gemma and Darren Day about Stephanie, claiming she could relate to what she's going through.\n'I don’t want her to fall apart in front of everyone, it’s not a good place, it’s hard to come back from,' said Danniella.\n'I feel so sorry for her, she’s so beautiful. I wish I had kept my mouth shut. I know along the way that people have tried to help me, and I’ve broken their hearts.'\nEver supportive, Jeremy and Stephanie hug in bed as she tells him: 'Thanks for looking after me.'\nThe fall out comes as Gillian McKeith entered the house on Wednesday to hold a detox clinic to rid housemates of their 'toxicity'.\nTiffany, Scotty T, John and Stephanie were sent to spend the night in clinic, and Gillian has spent the day reassessing the housemates to decide who is toxic and who is pure.\nThinking of others: Danniella told housemates she felt sorry for Stephanie","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421260/She-won-t-work-Stephanie-Davis-threatens-leave-Celebrity-Big-Brother-house-Danniella-Westbrook-remarks-future-career-prospects.html"}
