{"authors":["Marc Jackson For Mailonline"],"date_download":"2018-10-23 02:35:03","date_modify":"2018-10-23 02:35:03","date_publish":"2017-03-10 11:46:23","description":"The former EastEnders star, 43, was the victim of a brutal theft in which a mugger swiped her Prada handbag from her arm as she walked down the street.","filename":"data/vaneerConsumption/DanniellaWestbrookisvictimofbrutalmugginginSpain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22B40C00000578-0-image-a-7_1489147794271.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300958_Danniella-Westbrook-victim-brutal-mugging-Spain_1540262103.html","title":"Danniella Westbrook is victim of brutal mugging in Spain","title_page":"Danniella Westbrook is victim of brutal mugging in Spain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has faced a series of setbacks in her private and professional life over the last 12 months.\nAnd Danniella Westbrook was dealt another blow this week after being mugged in Marbella, Spain.\nThe former EastEnders star, 43, was the victim of a brutal theft in which a mugger swiped her Prada handbag from her arm as she walked down the street.\nScroll down for video\nTraumatic: Danniella Westbrook was dealt another blow this week after being mugged in Marbella, Spain\nDaniella had 600 euros and other personal items in the bag and admits the experience has left her shaken.\nSpeaking to The Sun Online, she said: 'F***ing hell, I’m shook up. I’m an old girl now. It could have been a lot worse.\n'It had cash in it and my work phone. I had my work phone in there and luckily I had my iPhone in my hand. There was some training stuff, a pair of trainers and that’s all they’ve got away with – my Prada bag. It could have been a lot worse, he could have dragged me down the bloody road with it.\n'They could have got away with my makeup bag and then I would have been devastated. Can't put a price on that bad boy at my age, let me tell you!'\nBlow: The former EastEnders star, 43, was the victim of a brutal theft in which a mugger swiped her Prada handbag from her arm as she walked down the street\nNew start: The star has relocated to the Spanish party town over the winter months as she tries to rebuild her life\n'Getting these bangers back': Despite health woes after having extensive dental work, the 43-year-old TV personality hinted she wanted another breat augmentation, displaying some serious cleavage in a low-cut top\nThe star has relocated to the Spanish party town over the winter months as she tries to rebuild her life.\nLast year the star - who has long struggled with addiction issues - suffered a cocaine relapse and was left hospitalised after dental surgery went wrong.\nDespite the health scare, she insists she ready to go back under the knife again.\nbeen missing the size of her old assets, hinting in an Instagram post that she getting a boob job next month.\nThe 43-year-old TV personality posted a flashback photo of herself in her younger years, displaying some serious cleavage in a low-cut top.\nDanniella captioned the picture: 'Getting these bangers back next month whoop whoop #mylife #bangers'.\nThe former EastEnders star appears to be plotting an extreme makeover, revealing she also wants to her old hairstyle back.\nSharing a stony-faced snap of herself sporting a blunt fringe, she posted: 'Don't p**s me off .. my resting bitch face ... can't wait for hair to be like this again soon'.\nMakeover? The former EastEnders star appears to be plotting an extreme makeover, posting another old photo and revealing she wants her former hairstyle back\nDanniella is no stranger to surgery, having augmented her breasts from a 34B to a 34D, before going under the knife again to achieve a 34DD.\nThis comes after Danniella hit out at a persistent online stalker and flagged them to the Metropolitan Police.\nThe actress is fed up of the constant trolling and wrote on Twitter: 'This stalker don't stop shes been at it since Feb 2016 not 1day she hasn't harassed me . Today alone I've blocked 43 accounts @metpoliceuk'\nShe's had enough: Danniella recently hit out at a persistent online stalker and flagged them to the Metropolitan Police\nDanniella has found it hard to deal with the stalker over the past 12 months, previously telling MailOnline that she wanted the culprit jailed.\nShe said: 'It's not nice to think they are fixated on pretending to be me and getting access to all my private emails.\n'To be honest, I'm going to go away and try and rest and relax. This whole thing is very frightening and draining.\n'It's like this stalker won't give up until I'm run into the ground.'\nAnnoying: Even Danniella's friends have fallen victim to the troll, with reality personality Chelsey Harwood also being messaged\nShe also said: 'I'm both shocked and scared about how much control this stalker/hacker has on my private emails and social media.'\n'I'm scared that they might come after my kids or me.'\nThe star went on the offensive on Thursday, writing: 'What a d**k head just shows she's making loads of fake accounts what a mug #trollonthedole'.\nEven Danniella's friends have fallen victim to the troll, with reality personality Chelsey Harwood also being messaged.\nPunish them: Danniella previously told MailOnline that she wanted the culprit jailed\nDanniella moved to reassure her, posting: 'Babe she's been on everyone's case this stalker is a cranko w**ko @chelsey_harwood wifey ignore her #trollonthedole'\nThe problem first came to light publicly last summer when a series of bizarre messages surfaced on Danniella's Twitter account, claiming she was pregnant and had been hospitalised after suffering a drug addiction relapse.\nBut the star took to Twitter to blast the allegations from her alleged stalker, who she claims has repeatedly hacked her account and is trying to 'ruin' her life.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300958/Danniella-Westbrook-victim-brutal-mugging-Spain.html"}
