{"authors":["Phil Casey","Press Association Sport Golf Correspondent"],"date_download":"2018-10-23 03:29:07","date_modify":"2018-10-23 03:29:07","date_publish":"2017-03-16 14:19:18","description":"Danny Willett was due to tee off at 8:11am local time at the Arnold Palmer Invitational at Bay Hill, but pulled out due to illness and was replaced in the field by American Blayne Barber.","filename":"data/vaneerConsumption/DannyWillettwithdrawsfromArnoldPalmerInvitational.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E544B2E00000578-0-image-a-121_1489672581181.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-4320350_Danny-Willett-withdraws-Arnold-Palmer-Invitational_1540265347.html","title":"Danny Willett withdraws from Arnold Palmer Invitational","title_page":"Danny Willett withdraws from Arnold Palmer Invitational | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Danny Willett has withdrawn from the Arnold Palmer Invitational, just three weeks before the defence of his Masters title at Augusta National.\nWillett was due to tee off at 8:11am local time at Bay Hill, but pulled out due to illness and was replaced in the field by American Blayne Barber.\nThe world number 14 will now have just one tournament, next week's WGC-Dell Technologies Match Play in Texas, to find some form ahead of the year's first major championship.\nDanny Willett's Masters preparations have hit a wall as he withdrew from Bay Hill due to illness\nAmerican Blayne Barber replaced Willett in the field at the Arnold Palmer Invitational\nWillett was fifth in the Maybank Championship in February after failing to convert a three-shot 54-hole lead.\nBut then missed the cut in the Honda Classic and was 69th in a 77-man field in the WGC-Mexico Championship.\nHowever, the 29-year-old will be hoping to offer a strong title defence at the Masters at the beginning of April after winning in remarkable fashion last year.\nWillett claimed a shock Masters win with a superb five-under-par on the final day as overnight leader Jordan Spieth crumbled during a thrilling last round.","url":"https://www.dailymail.co.uk/sport/golf/article-4320350/Danny-Willett-withdraws-Arnold-Palmer-Invitational.html"}
