{"authors":[],"date_download":"2018-10-23 00:16:22","date_modify":"2018-10-23 00:16:22","date_publish":"2014-08-05 00:00:00","description":"With a sly salute to fellow composer and big-band leader Duke Ellington, Argue presents the U.S. premiere of a new 35-minute work. It joins other unrecorded tunes during Secret Society's Newport set.","filename":"data/vaneerConsumption/DarcyJamesArguesSecretSocietyLiveInConcert.json","image_url":"https://media.npr.org/assets/img/2014/08/05/darcyjamesargue_wide-321fae6fa1592b8b1a1ce7ba8bd1affa47fbdea1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_08_01_337152066_darcy-james-argues-secret-society-newport-jazz-2014_1540253782.html","title":"Darcy James Argue's Secret Society, Live In Concert","title_page":"Darcy James Argue's Secret Society, Live In Concert : NPR","title_rss":"NULL","source_domain":"npr.org","text":"At the 1956 Newport Jazz Festival, Duke Ellington and his Orchestra gave a performance so raucous and powerful that historians mark it as a turning point of the great bandleader's five-decade career. At its center was a piece called \"Diminuendo and Crescendo in Blue,\" with a barn-burning solo interlude from saxophonist Paul Gonsalves.\nThe composer and big-band leader Darcy James Argue is something of a Duke scholar, and by now a Newport Jazz Festival veteran. So he chose this date to present a 35-minute piece inspired by \"Diminuendo\" for the first time in the U.S. \"Tensile Curves\" joins a number of other previously unrecorded works that Secret Society presented at the main stage on Friday, Aug. 1.\nSet List\n\"Ferromagnetic\"\n\"All In (For Laurie Frink)\"\n\"Codebreaker (For Alan Turing)\"\n\"Tensile Curves\"\n\"Last Waltz For Levon\"\nPersonnel\nDarcy James Argue, composer/arranger; Erica von Kleist, alto saxophone/winds; Rob Wilkerson, alto saxophone/winds; Sam Sadigursky, tenor saxophone/winds; John Ellis, tenor saxophone/winds; Carl Maraghi, baritone saxophone/winds; Seneca Black, trumpet; Tom Goehring, trumpet; Matt Holman, trumpet; Nadje Noordhuis, trumpet; Ingrid Jensen, trumpet; Marshall Gilkes, trombone; Ryan Keberle, trombone; Jacob Garchik, trombone; Jennifer Wharton, bass trombone; Miles Okazaki, guitar; Adam Birnbaum, piano; Matt Clohesy, bass; Jon Wikan, drums","url":"https://www.npr.org/2014/08/01/337152066/darcy-james-argues-secret-society-newport-jazz-2014"}
