{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 23:08:02","date_modify":"2018-10-22 23:08:02","date_publish":"2017-03-16 05:58:45","description":"On Monday, a group of daredevils free dived with a pod of sharks off the coast of Waipahu, Hawaii, using no protective gear as they left their shark tank to get a closer look.","filename":"data/vaneerConsumption/DaredevilsswimoutofsharkcageandfreediveinHawaii.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E520F5B00000578-0-image-a-76_1489643655915.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318992_Daredevils-swim-shark-cage-free-dive_1540249682.html","title":"Daredevils swim out of shark cage and free dive in Hawaii","title_page":"Daredevils swim out of shark cage and free dive in Hawaii | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most of us would go out of our way to avoid one shark let alone a group of them, but five adventuresome divers left the safety of their shark cage in order to get close to the mammoth beasts.\nA young man, Jake, who posts YouTube videos of his diving adventures, and his pals took a swim out of the metal shark cage so he could free style with sharks off the coast of Waipahu, Hawaii on Monday.\nThe mesmerizing video shows the group having some very close-up encounters while with the predators in the deep blue ocean, and luckily for them, the beasts didn't seem to mind their presence.\n'Free diving' involves using snorkel gear to get to the kind of depths usually reserved for scuba divers. The group used no protective gear and surely would have been in serious trouble if one of the fanged-creatures hadn't taken kindly to being made YouTube stars.\nScroll down for video\nJake and his pals start their descent with only snorkeling gear and a camera\nThe group leaves their shark tank to begin their surreal swimming with sharks\nThe group bravely look around to see where the mammoth beasts are located\nA curious shark approaches from the dark blue depths of the ocean\nThe shark swims alongside the group without much interest in them\nOne shark comes very close to the group, probably just as curious as they are\nA woman in the group swims closer to a pod of sharks\nJake is the daredevil adventurer has a YouTube channel that chronicles his water fun","url":"https://www.dailymail.co.uk/news/article-4318992/Daredevils-swim-shark-cage-free-dive.html"}
