{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 04:17:08","date_modify":"2018-10-23 04:17:08","date_publish":"2016-01-11 17:24:05","description":"The video, which was captured in an unknown location, shows the man preparing to ride his motorbike from the back of a flatbed truck after ignoring the perfectly good ramp in front of him.","filename":"data/vaneerConsumption/Daredevilridesdirtbikeoffthebackofaflatbedtruckinvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D3EC400000578-0-image-a-29_1452532917697.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394178_I-don-t-need-use-ramp-daredevil-rides-dirt-bike-flatbed-truck-predictable-results_1540268228.html","title":"Daredevil rides dirt bike off the back of a flatbed truck in video","title_page":"Daredevil rides dirt bike off the back of a flatbed truck in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A motorcyclist attempted to showcase exactly what his dirt bike was capable of doing - but failed miserably in some hilarious footage posted online.\nThe video, which was captured in an unknown location, shows the man preparing to ride his motorbike from the back of a flatbed truck.\nA small ramp has been propped up against the truck's trailer to enable the man to ride down safely - but he has other ideas.\nOther ideas: The man ignores the ramp propped up against the truck's trailer and opts for the direct approach\nDetermined to demonstrate that his off-road Yamaha is capable of the unthinkable, the man prepares to ride straight from the trailer without using the ramp.\nHe then gets himself into position and after revving the motorbike a few times rides off the side of the flatbed truck.\nThe biker can be seen leaning back slightly in an optimistic attempt to keep the front wheel straight upon landing.\nHowever, the sheer weight of the motorbike forces the front wheel down as more of it rides off the side of the truck.\nThe man gets himself into position and after revving the bike a few times rides off the side of the flatbed truck\nOh dear: The man attempts to keep the front of his bike straight but hits the ground on the very top of his wheel\nThis results in the man hitting the ground on the top of the wheel and being thrown straight over the handlebars and into the gravel.\nThe bike then continues to roll forward before landing on top of the man and falling to the side.\nThe clip concludes with the video maker filming the foolish biker lying on the ground, presumably in quite a bit of pain.\nInstant regret: The man is thrown straight over the dirt bike's handlebars and into the gravel","url":"https://www.dailymail.co.uk/news/article-3394178/I-don-t-need-use-ramp-daredevil-rides-dirt-bike-flatbed-truck-predictable-results.html"}
