{"authors":["Tom Murphy"],"date_download":"2018-10-30 21:25:53","date_modify":"2018-10-30 21:25:53","date_publish":"2016-10-07 00:00:00","description":"Ask an Arkansas football fan to choose a favorite Darren McFadden moment, but don't necessarily expect the same answer.","filename":"data/vaneerConsumption/DarrenMcFaddenlefthismarkonthewaytohalloffame.json","image_url":"https://media.arkansasonline.com/img/photos/2016/10/07/JEFF0143aaaa_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_feb_28_oh-the-mcfadden-years-20170228__page=1_1540934753.html","title":"Darren McFadden left his mark on the way to hall of fame","title_page":"Darren McFadden left his mark on the way to hall of fame","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas running back Darren McFadden runs for a touchdown during a game against LSU on Friday, Nov. 23, 2007, in Baton Rouge, La. - Photo by Jeff Mitchell\nFAYETTEVILLE -- Ask a University of Arkansas Razorbacks football fan to choose a favorite Darren McFadden moment, but don't necessarily expect the same answer.\nMcFadden, who will be inducted into the Arkansas Sports Hall of Fame Friday, is Arkansas' all-time leading rusher (4,590 yards), the SEC's No. 2 all-time leading rusher and a two-time Heisman Trophy runner-up and will be the hall's youngest active football inductee.\n\"Just think about it, there's a lot of people who may not go in until their 40s or even their 50s,\" said McFadden, who has spent the past nine season in the National Football League. \"As a guy who's going to be 30 in August, I'm looking forward to it. It shows what my fans and my peers think of me in the state of Arkansas.\"\nMcFadden loved his home state enough to have \"501 boy,\" a tribute to his area code, tattooed onto his biceps, \"Arkansas bred\" inked onto his stomach, a Razorback breaking through the A on his right shoulder and an interlocking \"LR\" for Little Rock covering much of his back during his stay in Fayetteville.\nThe SEC was McFadden's playground for three years from 2005 through 2007, and his No. 5 jersey was worn by thousands of Arkansas children, and he repaid the adulation of the home-state fans with massive games and unforgettable moments.\nThere was the regular-season finale his junior year, when he led the Razorbacks to a 50-48 upset of No. 1 LSU in Baton Rouge, La., with 206 rushing yards and 34 passing yards and, counting his work at quarterback in the Wild Hog formation, accounted for 289 yards and four touchdowns before a national television audience on the day after Thanksgiving.\nThen there was McFadden's 321 rushing yards, tying the SEC single-game record, in a 48-36 victory over South Carolina that same season. And his 181 rushing yards and first big breakout performance in the Wild Hog in a 31-14 victory over Tennessee with ESPN GameDay on campus in 2006.\nDon't forget about his 190 rushing yards and two touchdowns against Georgia as a true freshman. Or his 219 rushing yards and two touchdowns against South Carolina as a sophomore.\nIn his only game against a Nick Saban defense at Alabama in 2007, McFadden ran 33 times for 195 yards and 3 touchdowns. He put the Razorbacks on his back in a rally from a 31-10 deficit into a 38-31 lead before a concussion knocked him from the game.\nMcFadden played after major surgery on his toe before his sophomore season and played through torn cartilage in his ribcage as a junior. His 4,590 rushing yards ranks behind Herschel Walker's 5,259 in the SEC record books.\nMcFadden has his favorite moment.\n\"I've got to go with LSU, when they were No. 1 in the country and we went down and beat them in triple overtime,\" McFadden said. \"That's got to be my No. 1 game of all time.\"\nMcFadden strolled into the background of Coach Houston Nutt's on-field interview with CBS that day with a mini baseball bat in his hand, saying \"We got that wood right here!\" to which Nutt implored ESPN analysts Lou Holtz and Mark May to \"Put him in the Heisman!\"\nNutt quickly identifies that game as his favorite McFadden memory.\n\"He played such a role and he was the ultimate teammate,\" Nutt said. \"With him on the direct snap, he could hand it to his teammates or he could throw it to Peyton Hillis or Marcus Monk, or he could run it. He was just a triple threat.\"\nThere are many in UA circles who consider McFadden the best player to ever strap on shoulder pads for the Razorbacks and among the best to every play college football.\n\"I hear that all the time, but like I say, I just looked at it like I was going out there and playing football,\" McFadden said. \"I never thought about the numbers and the stats when I was going through it and doing it.\n\"It's a great honor to even be held in that conversation when people bring up some of the best football players of all time. It's a great honor.\"\nMcFadden, a two-time All-American and two-time Doak Walker Award winner as the nation's best running back, can laugh about his Heisman runner-up campaigns to Ohio State quarterback Troy Smith in 2006 and Florida quarterback Tim Tebow in 2007, but it's still a sore subject.\n\"I definitely believe I should have gotten one of them,\" McFadden said. \"After my sophomore year, when Troy Smith won, everybody was saying, like, sophomores don't win it. They don't win it.\n\"I'm like, OK, I understand it. Then turn around my junior year and I lost it to a sophomore, then I was just completely baffled. I can't take anything from Tebow. He had a heck of a year and he put up great numbers. But I definitely feel like I should have won one of those Heismans, if not both.\"\nMcFadden was the only double Heisman Trophy runner up until Stanford quarterback Andrew Luck repeated the feat in 2010 and 2011.\n\"What separated him was just his size and his speed and strength,\" said Dean Weber, the Arkansas trainer during McFadden's college career and a long-time friend. \"He was supposed to be the best thing since sliced bread coming up here and he proved it in three years.\"\nMcFadden shared a backfield with Peyton Hillis and close friend Felix Jones, with whom he posted tandem 1,000-yard rushing seasons in 2006 and 2007. His activities with Jones including them dressing up as Fred Flintstone and Barney Rubble for Halloween in 2007.\nNutt said some of his favorite McFadden stories came from fellow coaches like Urban Meyer and Nick Saban. Once, at the SEC spring meetings in Destin, Fla., Nutt said Meyer told him he used film of McFadden on special teams to instruct his players.\nNutt said Meyer showed his team a play of McFadden blocking for Jones on a kickoff return, running full speed to knock a defender on his back.\n\"We stop it there and say, 'This is what an All-America does,'\" Nutt said Meyer told him. \"He's very unselfish. He's not worried about getting the ball. Most people would take the play off, but he didn't.\"\nMcFadden said that kind of play epitomized how he wanted to be known.\n\"I'm not one of those me-me-me guys, give me the ball, let me do this,\" McFadden said. \"I'm a team guy. Whatever I can do to help my team win in whatever way, that's what I'm gonna do.\n\"Me and Felix were great buddies, so that made it even better to be out there blocking for someone that was one of your best friends on the team.\"\nPulaski Oak Grove Coach John Mayes recognized the potential in McFadden after the youngster made phenomenal improvement heading into his sophomore season in 2002.\n\"I put him right on Arkansas that next summer with Danny [Nutt]. He said, 'Coach, we've got to have him.' He was just a man amongst boys. Plus, he had a love for the game. He wanted to gain everything he could from it. He took all the corrections positively.\"\nTim Horton took over as Arkansas running backs coach in 2007 after McFadden led the SEC with 1,647 rushing yards the previous year.\n\"He was everything that I had heard and then some,\" Horton said. \"When you're the returning runner-up for the Heisman Trophy and you get a new position coach, I was just so impressed with his willingness to learn and his willingness to be a teachable player. He had a great, great work ethic. He was obviously as gifted a player as the school's ever had.\"\nHorton said \"I don't know how you could put anybody in front of him\" in the discussion of greatest Arkansas football player of all time.\n\"Oh, without question,\" Nutt said. \"Without question he should be in that conversation.\"\nMcFadden's durability in college, which included no missed games despite his various injuries, did not translate to the NFL after he was taken by the Oakland Raiders with the No. 4 pick of the 2008 NFL Draft.\nHe has played only two 16-game seasons in his nine year career due to a variety of injuries, with two 1,000-yard seasons. He rushed for 1,157 yards and 7 touchdowns and had 1,664 yards from scrimmage for the Raiders in 2010, his best year as a pro, then delivered 1,089 rushing yards in his first year with the Dallas Cowboys in 2015.\n\"That was very satisfying because I knew I still had that in me,\" McFadden said of his 2015 performance. \"It was just a matter of falling into the right situation and getting the right help around me. When I got to Dallas, that's something they did. They have a phenomenal offensive line here.\"\nMcFadden suffered a broken elbow prior to last season and was limited to 87 rushing yards in four games as rookie Ezekiel Elliott took over as the lead running back. He is a free agent starting in March.\n\"My body is still pretty fresh and I don't feel like I've missed a step now,\" he said. \"I'm like a diesel engine. They get over 100,000 miles.\"\nSports on 02/28/2017","url":"https://www.arkansasonline.com/news/2017/feb/28/oh-the-mcfadden-years-20170228/?page=1"}
