{"authors":["Kayla Caldwell For Dailymail.Com"],"date_download":"2018-10-23 05:12:25","date_modify":"2018-10-23 05:12:25","date_publish":"2016-01-11 18:20:39","description":"The Kill Bill star and her singer boyfriend - who have been dating since July 2014 - were spotted braving chilly weather to head to a romantic breakfast together in Malibu.","filename":"data/vaneerConsumption/DarylHannahandNeilYoungstepouttogetherforbreakfastinMalibu.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DB55D00000578-0-image-a-10_1452537392481.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394174_Daryl-Hannah-Neil-Young-bundle-step-breakfast-Malibu_1540271545.html","title":"Daryl Hannah and Neil Young step out together for breakfast in Malibu","title_page":"Daryl Hannah and Neil Young step out together for breakfast in Malibu | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Things look to be going strong for Daryl Hannah and Neil Young, as they were spotted stepping out together for breakfast on Sunday.\nThe couple kept close as they made their way into Malibu Beach Inn to grab a bite on the chilly Sunday morning.\nThe 55-year-old star and her 70-year-old beau bundled up for the outing, keeping warm in thick jackets.\nScroll down for video\nRomantic outing: Daryl Hannah and Neil Young visited Malibu Beach Inn for breakfast together on Sunday\nDaryl kept warm on the morning outing in a heavy, navy blue duffle coat with a fur-lined hood and wooden toggle buttons.\nShe coupled the winter coat with a pair of form-fitting tan, corduroy trousers, and black combat boots.\nThe Kill Bill star also sported a long, tan scarf, finishing off her cozy look with a pair of black sunglasses.\nKeeping warm: The talented couple kept warm in heavy coats and scarves as they made their way to the restaurant\nStill stunning: The Wall Street star looked youthful with long blonde locks and a linen scarf\nShe wore her long, blonde tresses in a side part, and styled in soft waves that cascaded over her shoulders.\nNeil sported a loose-fitting green T-shirt, which he coupled with a brown and white plaid button down.\nHe wore those underneath a heavy, brown jacket, which he sported over a pair of fitted, black trousers.\nGoing strong: The two have been dating since July 2014 after the singer left his wife of 36 years, singer Pegi Young\nThe Crosby, Stills And Nash star finished off the laid-back look with a pair of brown boots, a black hat, and coordinating sunglasses.\nHe and the Splash actress have been dating since July 2014 after the singer left his wife of 36 years, singer Pegi Young.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394174/Daryl-Hannah-Neil-Young-bundle-step-breakfast-Malibu.html"}
