{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 23:37:15","date_modify":"2018-10-22 23:37:15","date_publish":"2017-03-16 07:33:29","description":"The 34-year-old actress made a case for red being the new black Wednesday at a Netflix premiere in Miami Beach, Florida.","filename":"data/vaneerConsumption/DaschaPolancosizzlesinreddressatNetflixpremiere.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E52307700000578-0-image-a-116_1489647123706.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319108_Dascha-Polanco-sizzles-red-dress-Netflix-premiere_1540251435.html","title":"Dascha Polanco sizzles in red dress at Netflix premiere","title_page":"Dascha Polanco sizzles in red dress at Netflix premiere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dascha Polanco made a case for red being the new black Wednesday at a Netflix premiere in Miami Beach, Florida.\nThe 34-year-old actress sizzled in an off-the shoulder lacy red Milly dress at the premiere of Ingobernable at the Colony Theater.\nDascha was showing support for the new Spanish-language political drama that will debut March 24 on Netflix.\nLady in red: Dascha Polanco sizzled in a lacy red Milly dress Wednesday at a Netflix premiere in Miami Beach, Florida\nMexican actress Kate del Castillo, 44, stars as First Lady of Mexico Emilia Urquiza in the 15-episode series.\nDascha portrays inmate Dayanara Diaz in the hit Netflix comedy-drama series Orange Is The New Black.\nThe series focuses on a group of women in prison at Litchfield Penitentiary and will return on June 9 for its fifth season.\nNetflix shared a sneak peek last month of the upcoming season.\nNetflix star: The actress stars in the Netflix series Orange Is The New Black\nShowing support: Dascha was showing support at the premiere for the upcoming Spanish-language political drama Ingobernable that will debut on Netflix on March 24\nThe 14-second trailer showed the main characters in a quick montage before ending with Daya aiming a gun.\nDanielle Brooks, who plays Taystee on the show, revealed in January that season five will take place over three days.\nDascha has opened up about how fashion designers despite her success on OITNB still refuse to collaborate with her because of her size.\nHit show: Dascha will reprise her role of Dayanara Diaz for the upcoming fifth season of OITNB\nClassic look: The actress struck the classic chin on shoulder pose at the premiere\nCritically acclaimed: Dascha is part of the ensemble cast that has received critical acclaim\nShe told Vogue magazine last August about her experiences with being turned away.\n'I understand that it's business, but still, it's like, really?' Dascha said.\nSome of the high-end brands that rejected her were companies that she has been loyal to for some time.\nShe told the outlet: 'I love what they do, so I had my publicist reach out to their PR team. Their response was, ''Oh, you're not the sizes we have, not right now, maybe in the future''.'\nDascha added: 'It's disappointing, but I try to work with up-and-coming designers who will make things for me and who will collaborate with me. People who love my curves and embrace them as much as I do.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319108/Dascha-Polanco-sizzles-red-dress-Netflix-premiere.html"}
