{"authors":["Emma Glanfield For Mailonline"],"date_download":"2018-10-22 22:54:42","date_modify":"2018-10-22 22:54:42","date_publish":"2016-01-28 11:13:30","description":"Sue Feldt, 48, is urging Cristal Marquez to avoid marrying her father Ron Sheppard, 67, who is still married to his eighth wife Weng, 37, who he lives with in Somerton, Somerset.","filename":"data/vaneerConsumption/DaughterofBritainsmostmarriedmantellshisninthwifetobeRun.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/23/16/30814B3500000578-0-image-a-2_1453568303055.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420603_Daughter-Britain-s-married-man-tells-ninth-wife-Run-Run-quick-says-stick-wife-number-eight-all_1540248882.html","title":"Daughter of Britain's most married man tells his ninth wife-to-be 'Run!!'","title_page":"Daughter of Britain's most married man tells his ninth wife-to-be 'Run!!' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A daughter of Britain's most married man has pleaded with his ninth wife-to-be to 'run, run quick' after he proposed despite still being married to his eighth wife.\nSue Feldt, 48, is urging Cristal Marquez to avoid marrying her father Ron Sheppard, 67, claiming his string of marriages over the years have already caused 'so much pain and stress, so many tears'.\nMr Sheppard had proposed to Cristal, 27, in a karaoke bar in her hometown in the Philippines at New Year, amid plans to leave his current wife, Weng, who he shares a home with in Somerset.\nHowever, after going public with his new engagement, the father-of-eight has now claimed he may stick with his eighth wife after all – claiming they patched up a domestic dispute with a McDonalds.\nSue Feldt, 48, is urging Cristal Marquez to avoid marrying her father Ron Sheppard, 67 (pictured together), claiming his string of marriages over the years have already caused 'so much pain and stress, so many tears'\nMr Sheppard, 67, got down on one knee and proposed to Filipino call centre worker Cristal Marquez in a bar in the Philippines on New Year's Eve, despite still being married to his current wife - number eight - Weng, 37\nThe pair had come to blows over his plans to marry Cristal, who is 40 years his junior, when Weng, 37, learned of the news on Sunday after reading about it in a national newspaper.\nThey apparently had an explosive row at their home in Somerton, Somerset, which resulted in the police being called.\nMr Sheppard, a retired holiday camp entertainer, told the Daily Mirror: 'We had a big row. Weng went out of the room, came back with a hammer and smashed my phone.\n'We were struggling and I pushed her neck to get away. It's all in the police report. It was a spur-of-the-moment thing and it just got all over-heated.'\nHe added: 'At the moment we're in the process of getting divorced but it's looking like we might get back together.\n'She's bought me a new tablet, we've had lunch together at McDonalds, she's told me she loves me and I've said I love her.'\nFollowing the row, two of the serial bridegroom's daughters have spoken out to condemn their 'embarrassing' father's antics – and to claim they want nothing more to do with him.\nMs Feldt, who is one of three children from his first marriage to ex-wife Margaret, said: 'I am ashamed to call him my dad. I have disowned him and he will die a lonely old man because he has destroyed his family who used to worship him.'\nWeng Platino, pictured with Mr Sheppard (left, on their wedding day) and (right, celebrating their 10th anniversary in 2014) is said to have 'brandished a hammer' at him after his recent proposal came to light\nThe twice-divorced mother-of-four, who has moved to Australia, also urged his new fiancée to avoid marrying her father, claiming he is a serial dater who will never be happy with just one woman.\nShe told the Mirror: 'What I would say to Cristal is: '\"Run! Run quick in a different direction to my dad\". I want the world to know this man is not what he claims to be.'\nAnother of his daughters, married mother-of-two Kelly-Marie McMullen, 32, from St Austell in Cornwall, described him as 'Britain's worst father' and said he has 'let me down all my life'.\nShe told the newspaper: 'I think he is vile.\n'I haven't seen him since last summer and our relationship is finished now.'\nAvon and Somerset Police confirmed officers were called to a disturbance at the Mr Sheppard and Weng’s property in Somerset at about 1pm on Sunday.\nCristal Marquez shows off her engagement ring after Mr Sheppard popped the question over New Year\nA spokesman added: ‘Both parties have been spoken to. Neither wish to make a complaint so no further action will be taken at this time.’\nMr Sheppard, who has written a book on his life called Lord of the Wedding Rings and is set to have a film made about him, has married eight women since his first ceremony aged 19 in 1966. He tied the knot with first wife Margaret 47 years ago and the pair had two children together before divorcing two years later.\nHe then met second wife Jeanette and they wed in 1973, but it only lasted one year and Mr Sheppard has since described the marriage as a 'business transaction' which enabled them to receive a bigger house from the council.\nShortly after their divorce, Mr Sheppard met third wife Lesley and in 1976 they tied the knot. They went on to have two children together and he said he thought she 'was for keeps', but he left five years later following a string of arguments.\nHe went on to meet 18-year-old blonde Kathy at Pontins holiday camp in Somerset and the pair married in 1982. They had a daughter together and lasted four years, despite Mr Sheppard claiming it was a 'rebound relationship' following his split from Lesley.\nIt wasn't long after that split that he met his fifth wife Sue at a bingo hall. Despite claiming he wasn't 'swept off his feet by her', he moved in to her two-bedroom home and they married in 1986. They had two sons together but she threw him out after he was offered a job in Bournemouth.\nHe then went on to marry Usha in 1999, after the pair met while he was on a stop-off trip to Singapore. They lasted four years but split after Mr Sheppard cheated on her during a holiday alone to Thailand.\nWith divorce number six behind him, he met seventh wife, Wan, in Bangkok in 2003 during a trip to visit an old friend.\nHowever, after returning to the UK, the pair stayed together for just eight months before the bride announced she was returning to her native country in 2003.\nMr Sheppard first walked down the aisle in 1966, when he married his first wife Margaret, at the age of just 19\nMr Sheppard married third wife Lesley in 1976 and they had two children together but left her five years later\nIt was then that Mr Sheppard met his current wife, trainee nurse Weng, after reaching out online and sparking up a friendship with her.\nHe said he had finally settled down after finding his 'true love' and 'soul mate', and on their tenth wedding anniversary in 2014 said he hoped they had ’10 more years together’.\nHowever, less than two years later he fell for Filipino call centre worker Cristal after secretly chatting her up online.\nMr Sheppard fell for Filipino call centre worker Cristal after secretly chatting her up online.\nThe couple first met more than ten years ago, when Cristal was 15 or 16, while he was married to Wan, wife number seven, and living in Thailand.\nMr Sheppard met Weng after splitting from his seventh wife, Wan (together above), when she returned to her home in Bangkok after eight months\nHe was said to have grown distant from his current wife Weng after 11 years of marriage following his antics on a recent trip to the Far East, which included him sharing a bed with young female masseuse Iza Samontes, 27.\nParkinson's sufferer Mr Sheppard, who denied misbehaving, proposed to mother-of-one Cristal on New Year's Eve and previously said he intends to adopt her seven-year-old son Miggs.\nSpeaking of meeting Cristal, he said: 'I was invited out there for Christmas to spend it with her family. She is absolutely adoring and very, very caring.\n'She looked after me so well when I was over there. With my Parkinson's she took really good care of me - she even showered me to make sure I was ok.\n'When I proposed I did get down on one knee - I managed to do it. She said 'yes' straight away. She loves me to bits, same as I do her. I think we'll be married by September.'\nMr Sheppard has spent 44 of the last 47 years married. His longest union lasted 13 years, while the shortest was just 10 months.\nHe married Weng on the Isle of Wight in November 2004 and he said she was 'the one' when they celebrated their tenth wedding anniversary last year.\nHe admitted that nine months ago he started messaging other women via a dating website but claimed he 'didn't know what he was doing' due to medication he takes for Parkinson's.\nHe said he messaged 'one or two people' sending them around £300 and Weng was upset when she saw the messages.\nIn November, he went to the Philippines alone for a four-week charity trip, and ordered a leg massage in his hotel room, which was carried out by Iza.\nMr Sheppard said there was a security lock-down due to President Obama attending a nearby economic meeting forced her to stay in his hotel room.\nHe denies they had sex, and simply slept in the same room, but Weng demanded a divorce.\nUnemployed Cristal, lives in Pampanga with her mother, and Mr Sheppard said she was married previously, but split up with her husband six years ago.\nMr Sheppard married Weng in 2004 and is now contemplating whether he wants to stay with her or marry Cristal. He said: 'We're in the process of getting divorced but it's looking like we might get back together'\nMr Sheppard said previously: 'She doesn't want me just for a visa because she actually wants to stay in the Philippines, but because of my medication it would be too expensive, so she has agreed to come over here in about six months.\n'When I arrived at the airport Miggs ran up and gave me a cuddle and said 'hello daddy Ron, I love you daddy Ron'.\n'It was so lovely.\n'I'm going to adopt Miggs. It will take some time, but we'll do it. His English is brilliant and he prefers to speak English - it's fate.'\nThey had planned to get married in England in September, although Mr Sheppard is now said to be deciding about whether to go ahead with the union or stay and work it out with current wife Weng.\nCristal said: 'I want to marry Ron - definitely. He is a very loving person and so sweet. I'm attracted to him. I've fallen in love with him.","url":"https://www.dailymail.co.uk/news/article-3420603/Daughter-Britain-s-married-man-tells-ninth-wife-Run-Run-quick-says-stick-wife-number-eight-all.html"}
