{"authors":["Ben Kochman For Dailymail.Com"],"date_download":"2018-10-23 04:21:39","date_modify":"2018-10-23 04:21:39","date_publish":"2017-04-26 16:01:36","description":"Mikayla Raji (pictured) bought James Police Officer Joseph Quinn dinner after meeting him at an Italian restaurant. Raji's police officer father was killed while on duty in a drunk driving crash.","filename":"data/vaneerConsumption/Daughter8ofslainNewJerseycopbuysofficerdinner.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0338500000578-0-image-a-18_1493216906157.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447750_Daughter-8-slain-New-Jersey-cop-buys-officer-dinner_1540268499.html","title":"Daughter, 8, of slain New Jersey cop buys officer dinner","title_page":"Daughter, 8, of slain New Jersey cop buys officer dinner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her dad would have been so proud.\nAn eight-year-old New Jersey girl whose police officer father died in the line of duty has paid for a random patrolman's dinner - and now local cops are trying to return the favor by raising money for her education.\nJamesburg Police Officer Joseph Quinn was eating at the Villa Borghese restaurant in Helmetta when little Mikayla Raji approached him to say 'hello'. Raji then leaned over and whispered to her mother that she wanted to secretly pay for the officer's dinner.\n'I wanted to do it because he works hard and he keeps us all safe,' she told NBC News 4.\nMikayla Raji, 8 (left) never got to meet her father, Officer Thomas Raji (right), who died on duty\nWith a little police work, Quinn soon discovered who had picked up his $15 tab - and why she has a special place in her heart for police officers.\nRaji never got to meet her father, Thomas Raji, who was killed on the job in Perth Amboy by a speeding drunk driver in 2008, seven months before she was born.\nHer mother, Mimi Raji, was also a police officer. 'She's got a big heart, and she's always thinking about other people,' Mimi told NBC.\nJamesburg Police offered Mikayla Raji (center) free dinner at their headquarters anytime\nTo pay Mikayla's generosity forward, the Jamesburg Police Department launched a GoFundMe page to raise money for her education. The fund has already raised over $8,000 of its $10,000 goal.\nThe police department also invited her to stop by the headquarters for a meal anytime.\n'This time, dinner is on us!' the department wrote on Facebook, adding: 'If you ever need us for anything, you can guarantee we will be there for you.'\nLocal police have also invited Mikayla to lead the Memorial Day parade this year as an honorary member riding in a patrol car.","url":"https://www.dailymail.co.uk/news/article-4447750/Daughter-8-slain-New-Jersey-cop-buys-officer-dinner.html"}
