{"authors":["Justin Caruso"],"date_download":"2018-10-30 20:35:41","date_modify":"2018-10-30 20:35:41","date_publish":"2018-10-30 18:42:25","description":"Veteran comedian Dave Chappelle said President Donald Trump is not \"making the wave\" of racism in America but is simply \"surfing it.\"","filename":"data/vaneerConsumption/DaveChappelleTrumpIsNotMakingtheWaveofAmericasRacismHesSurfingIt.json","image_url":"https://media.breitbart.com/media/2018/10/daveChappellewave1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_10_30_da_889b2271f54acd8c0e11f6deddb93767__1540931741.html","title":"Dave Chappelle: Trump Is ‘Not Making the Wave’ of America’s Racism, ‘He’s Surfing It’","title_page":"Dave Chappelle: Trump Is ‘Not Making the Wave’ of America’s Racism, ‘He’s Surfing It’","title_rss":"NULL","source_domain":"breitbart.com","text":"Veteran comedian Dave Chappelle said President Donald Trump is not “making the wave” of racism in America but is simply “surfing it.”\n“Some of the things they say–even when they say that Russia influenced the election, it’s kind of like, is Russia making us racist? Is that who’s doing it? Oh okay…oh my God, thank goodness, I thought it was us,” Dave Chappelle told CNN’s Christiane Amanpour.\n“If they killed the country that way, then we’re the murder weapon,” Chappelle also said.\n“I would not even name the era after him,” he also told Amanpour. “He’s getting too much credit. He’s not making the wave, he’s surfing it.”\n“All he does is sing those people’s greatest hits–build a wall, all these things we’ve heard before, he just sings all the songs. He’s the only one that has been brash enough to do it,” the former Comedy Central star said.\nThe 45-year-old has consistently expressed more measured opinions about Trump and politics in general than many of his fellow celebrities. Following Kanye West’s meeting with President Trump in the Oval Office, Chappelle defended the rap superstar.\nHowever, Chappelle is still no fan of President Trump.\n“I just don’t like the way [Trump] talks. I don’t like…you know…we’re living in a time where there’s gotta be a little more cultural sensitivity,” the Netflix comedy host said earlier this month.\nChappelle continued, “And even a guy like me that’s just writing jokes, I have to listen more than I’ve ever had to listen cause the gripes is coming so fast and furious, and I’m not dismissive of people’s gripes–might sound like it on stage, but I listen, and as a president of a country that’s as eclectic as ours, you look around your crowd and you see it’s like a patchwork of people. I just think that he’s speaking to a very small choir.”","url":"https://www.breitbart.com/entertainment/2018/10/30/dave-chappelle-trump-not-making-the-wave-of-racism-hes-surfing-it/amp/"}
