{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 23:31:23","date_modify":"2018-10-22 23:31:23","date_publish":"2017-03-16 07:12:20","description":"They've both made careers out of making people smile — and it looks like comedians rely on each other for it too. The 35-year-old posted a screengrab from her phone to Instagram","filename":"data/vaneerConsumption/DaveChapellecheersupAmySchumerviaFaceTime.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E526C1200000578-0-image-a-91_1489650229998.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319024_Dave-Chapelle-cheers-Amy-Schumer-FaceTime_1540251083.html","title":"Dave Chapelle cheers up Amy Schumer via FaceTime","title_page":"Dave Chapelle cheers up Amy Schumer via FaceTime | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They've both made careers out of making people smile — and it looks like comedians rely on each other for it too.\nAmy Schumer got a much needed cheering up via FaceTime from Dave Chappelle on Wednesday.\nThe 35-year-old posted a screengrab from her phone to Instagram after she answered a call to from her fellow stand-up.\n'I love you Dave': Amy Schumer got a much needed cheering up via FaceTime from Dave Chappelle on Wednesday\n'This guy knows right when to give a gal a call,' she wrote. 'I love you Dave.'\nThe snap shows the Chappelle Show legend - in a very red-hued-background - unleashing his infectious trademark grin.\nAnd sure enough, Amy can be seen responding in kind in her tiny mirrored screen.\nThe Trainwreck star was in need of cheering up as she continues her ongoing fight against internet haters.\nEarlier on Wednesday, Amy attended the New Directors/New Films 2017 Opening Night of Patti Cakes$ at the MoMA in New York (pictured with Danielle Macdonald and Bridget Everett)\nThe Trainwreck star is embroiled in an ongoing fight against internet haters\nAfter a flood of negative reviews for her latest Netflix comedy show The Leather Special, Amy pointed to an organized effort from trolls on the alt-right to damage her career.\n'The alt right organized trolls attack everything I do,' she wrote in a lengthy Instagram post.\n'They organize to get my ratings down. Meeting in sub Reddit rooms. They tried on my book and movies and tv show.'\nThe comic said she was undeterred by the cabal against her, thanking the trolls for making her feel 'so powerful and dangerous and brave' that they have to go to such lengths to try and dim her spotlight.\nTrolls: After a flood of negative reviews for her latest Netflix comedy show The Leather Special, Amy pointed to an organized effort from trolls on the alt-right to damage her career\n'It reminds me what I’m saying is effective and bring more interest to my work and their obsession with me keeps me going,' she said. 'It fills me with hope and power to see you all furiously posting so as always accuse me of whatever lies you want.'\nSchumer did not have as harsh words for the trolls as she wrote: 'Call me a whale. Call me a thief and I will continue to rise and fight and lead. I know who I am. I am strong and beautiful and will use my voice my whole time on this earth.'\nShe also pointed to a Splitsider article that noted the presence of multiple pro-Donald Trump Reddit pages urging users to add negative feedback to Schumer's projects .\nEarlier on Wednesday, Amy attended the New Directors/New Films 2017 Opening Night of Patti Cakes$ at the MoMA in New York.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319024/Dave-Chapelle-cheers-Amy-Schumer-FaceTime.html"}
