{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 00:07:47","date_modify":"2018-10-23 00:07:47","date_publish":"2016-01-28 13:37:35","description":"The former footballer says he wants to 'push the definition of bodywear' with his range of cosy knits and casual white T-shirts.","filename":"data/vaneerConsumption/DavidBeckhamshowsoffhisbicepsasheunveilshislatestdesignsforHM.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA787100000578-0-image-a-24_1453985834011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420906_A-smouldering-David-Beckham-shows-biceps-growing-tattoo-collection-unveils-latest-designs-H-M_1540253267.html","title":"David Beckham shows off his biceps as he unveils his latest designs for H&M","title_page":"David Beckham shows off his biceps as he unveils his latest designs for H&M | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Even when he's lounging around in his casuals, David Beckham still manages to look good.\nThe father-of-four, 40, has unveiled his latest bodywear designs for H&M - and shows off his best blue steel pose in the campaign shots.\nThe former footballer says he wants to 'push the definition of bodywear' with his range of cosy knits and casual white T-shirts.\nDavid Beckham shows off his biceps and growing tattoo collection as he unveils his latest designs for H&M\nSpeaking about the range, which will land in-store in February, David said: 'Everything about my Bodywear for H&M has to be authentic. If I wouldn’t wear it then it doesn’t go in the collection!\n'I want to choose a range that has great quality and design but is affordable. I’m always trying to evolve the Bodywear collection, and include classic pieces like sweaters and track pants that I would wear out or at home.'\nThe range, which has been in production since 2012 and one of the store's most successful to date, ties in with his underwear brand.\nIt was revealed this week that young men are feeling under pressure to match sexualised images of male models - like Beckham - and their perfectly sculpted pecs and six packs.\nThe father-of-four, 40, has unveiled his latest bodywear designs, which were created to allow men to look cool whilst looking casual\nThe range, which has been in production since 2012, is one of the store's most successful to date\nThe idea of using men as sex objects to sell everything from underpants to cars has been labelled ‘Hunkvertising'.\nHistorically, advertising images of beautiful women wearing very little have become vilified as sexist and oppressive.\nBut the advertising industry is now routinely using men in campaigns that idealise the male form, are deliberately sexy and ‘a bit of fun’.\nExamples include David Beckham in his H&M or Armani underpants and David Gandy in his swimming trunks for Marks & Spencer.\nResearch by Mintel found more than a quarter of Britain's males complain that men are sexualised in adverts.\nAnd one in six - 17 per cent - of men aged 16-24 agree that ‘ripped’ male models featured in advertising campaigns have made them more self-conscious.\nMintel said one quarter of all males find it hard to identify with men that are shown in adverts, whilst 22 per cent say the images are an unrepresentative stereotype.","url":"https://www.dailymail.co.uk/femail/article-3420906/A-smouldering-David-Beckham-shows-biceps-growing-tattoo-collection-unveils-latest-designs-H-M.html"}
