{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 05:00:15","date_modify":"2018-10-23 05:00:15","date_publish":"2016-01-11 18:10:58","description":"George Underwood, David Bowie's bandmate and one-time love rival, says he is devastated at the loss of his lifelong friend. George, from East Sussex, had been friends with the star since the age of nine.","filename":"data/vaneerConsumption/DavidBowiesfriendwhogavehimhisalieneyesaysstarsupportedHIMthroughcancer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DF07900000578-0-image-a-2_1452540967979.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394319_David-Bowie-s-lifelong-friend-responsible-different-coloured-eye-reveals-star-thanked-giving-unique-look_1540270815.html","title":"David Bowie’s friend who gave him his alien eye says star supported HIM through cancer","title_page":"David Bowie’s friend who gave him his alien eye says star supported HIM through cancer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The man responsible for David Bowie's distinctive eye has paid tribute to his lifelong friend.\nGeorge Underwood, Bowie's bandmate and one-time love rival, is in 'shock' having not known of the star's cancer until he passed away.\nBowie, who died just three days after releasing his 25th studio album, kept his 18-month battle with cancer so private that even close friends weren't aware of his struggle.\nUnderwood, who was supported by Bowie through his own fight with prostate cancer, was devastated at the loss of the friend he has known since he was aged nine.\nScroll down for video\nDavid Bowie (left) and life long friend George Underwood (right). Underwood, from Uckfield in East Sussex said he was in 'shock', having not known of the star's cancer until he passed away\nHe said today: 'Someone texted me this morning. I couldn't believe it, then I switched on the radio. I'm still in shock.\n'I wasn't aware of his illness at all. We were in contact by email. I knew he was working on a new album so I thought I better leave him to it.\n'It's a bit of a shock, I can't get my head around it. I didn't know he was ill.\n'He bought so much happiness and joy to so many people, that's the fantastic legacy he's left behind. He will go down in history.\n'He was such a lovely guy. He makes me laugh, I'm going to miss him.\n'I sent a painting to him on his birthday. I hope he was awake for it.'\nUnderwood, now 68, recorded an album with Bowie with their outfit The King Bees and even created the distinctive artworks that appeared on albums Hunky Dory, and The Rise and Fall of Ziggy Stardust and the Spiders from Mars.\nThe pair met while enrolling for cub scouts and attended Bromley Technical School where they discovered a love for music together alongside classmate Peter Frampton.\nUnderwood, speaking from his home near Uckfield, in East Sussex, said: 'People ask what he was really like but I don't think anyone will ever know unless you know him like me.\n'I have known him since I was nine years old. We were enrolling for cubs on the same day that's how we met and we became friends ever since.\n'We then went to the same secondary school and were in various bands together. It's a sad old day.'\nUnderwood was devastated that he did not get a chance to say goodbye to his friend and was surprised he hadn't been told of his illness as Bowie had been diagnosed 18 months ago.\n'He later thanked me': Bowie's distinctive eye was caused by a condition known as Aniscoria\nHe said: 'I have been in contact with him via email since then.\n'When I had prostate cancer he was very concerned about me. He kept that to himself though didn't he?\n'He looked well. I wonder if it's just come out of nowhere, an aggressive cancer that's suddenly come up.\n'Usually cancer is a long slow process and you get very tired but he's been so active.'\nHe also said that Bowie's latest album Blackstar, along with single Lazarus - released two days before his death - now take on a 'more haunting' meaning.\nHe said: 'There's obviously a message there with Lazarus. He must've had some kind of inkling he wouldn't be alive for much longer.\n'I was listening to the whole album yesterday - it's even more haunting now.\n'When you realise this has happened it gives you a different outlook on it..'\nUnderwood punched Bowie during a row over a girl when they were just 15, which left one pupil permanently dilated - a condition called Aniscoria.\nMedics reckon Bowie was caught in the eye by George's fingernail, which left his left eye looking like it was a different colour.\nBut despite leaving his friend with a permanent disorder, Underwood revealed that the singer later thanked him for giving him his famed look.\nHe said: 'He later told me I did him a favour.'\nWell-wishers have flocked to the Bowie mural in Brixton, London, to pay their respects following the announcement of his death","url":"https://www.dailymail.co.uk/news/article-3394319/David-Bowie-s-lifelong-friend-responsible-different-coloured-eye-reveals-star-thanked-giving-unique-look.html"}
