{"authors":["Press Association"],"date_download":"2018-10-23 00:44:41","date_modify":"2018-10-23 00:44:41","date_publish":"2016-01-29 14:03:51","description":"David Cameron has insisted he would be \"very happy\" for the European Commission to examine the UK's controversial tax deal with Google. The Prime Minister ag...","filename":"data/vaneerConsumption/Davidcameronveryhappyforeutoinvestigategoogles130mtaxdeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-2f9a8709-3505-4342-9ff0-60f07cd5e06d-3bmscybNe842cce83474b565d3f9-507_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422411_David-Cameron-happy-EU-investigate-Googles-130m-tax-deal_1540255481.html","title":"David cameron 'very happy' for eu to investigate google's £130m tax deal","title_page":"David cameron 'very happy' for eu to investigate google's £130m tax deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron 'very happy' for EU to investigate Google's £130m tax deal\nDavid Cameron has insisted he would be \"very happy\" for the European Commission to examine the UK's controversial tax deal with Google.\nThe Prime Minister again defended the agreement, under which the internet giant handed over £130 million in back taxes covering the last decade, as a \"success\" and stressed the firm was now subject to tougher rules.\nAsked on BBC Radio Scotland about the EU competition commissioner's suggestion that she could consider whether the deal amounted to state subsidy, Mr Cameron said: \"I am very happy for the EU to see what role it can play.\nGoogle agreed to pay £130m in back taxes in the UK\n\"I think the most important thing is to get countries to cooperate and I put this on the agenda at the G8 in Northern Ireland back in 2012 so that we exchange information about who is moving money where and who is paying taxes where.\"\nMr Cameron, who has been visiting Aberdeen, said his administration had d one more on bolstering international tax arrangements than \"almost any government anywhere in the world\".\n\"I would say it (the deal) is a success because previously Google was not paying any tax at all,\" he said.\n\"We've achieved this payment and now we want to see these companies pay more in future.\"\nTransport Secretary Patrick McLoughlin defended the deal as a \"move in the right direction\" but said it was open to the National Audit Office (NAO) to examine it.\n\"The truth is it's a move in the right direction. There is more for them to pay and I want them to pay more in future,\" he said.\nAppearing on BBC1's Question Time, he said: \"We have started to receive tax from Google, which is something that hasn't happened for the 10 years they have so far been established here, so in that position the Chancellor was right to say that it was a move in the right direction.\n\"Of course I would like to see Google make more payments to the country. I would like to see them employ more people in this country.\n\"They do employ 3,000 people, top end jobs, they are doing a lot of investment in this country as well, which is actually good for the long-term economic future of the country.\n\"I believe in a low tax base, I believe in attracting companies here, but I believe when those companies are here they should pay their tax which is rightly collected.\n\"But companies can and have found ways around paying taxation and we have made a lot of changes to the taxation system that actually will make them pay more over years to come.\"\nThe Cabinet minister said he expected the NAO to come under pressure to examine the deal.\n\"The direct negotiations between HMRC and the company are confidential, but the NAO can do an investigation, can do an audit, and I'm sure they will do,\" he said.\n\"I'm sure the pressure will come on them to do it.\"\nHe added: \"If the NAO decided to do it, it wouldn't be something George could stop.\"\nMr McLoughlin said a review commissioned by the NAO into five large tax deals, which reported in 2012, found that HMRC had acted reasonably in each case.\nCompetition commissioner Margrethe Vestager has indicated she is ready to look into complaints from Labour and the SNP that the settlement breached EU rules.\nShadow chancellor John McDonnell said: \"We believe £130 million to be significantly lower than a fair or reasonable assessment of Google's UK turnover and profits would suggest, with experts suggesting that Google has been levied an effective tax rate of around 3%,\" he said.\n\"I am therefore requesting an investigation under EU competition law, since we are concerned that, first, the deal is arguably not compliant with state aid rules, creating a favourable treatment for a particular company; second, that if the deal is generalised, it could constitute a serious potential threat to the ability of other EU members to levy taxes in their jurisdiction.\"\nExecutives from Google and HMRC bosses are to be grilled on the deal by the PAC on February 11 in the latest of a series of hearings by the influential spending watchdog into multinationals' tax affairs.\nDowning Street confirmed that Google had not had to make payments under the new diverted profits tax, introduced by Chancellor George Osborne last year to target companies which artificially shift revenues overseas to avoid paying tax in the UK.\nThe measure was nicknamed the \"Google tax\" after Mr Osborne said it was designed to put a stop to technology companies going to \"extraordinary lengths to pay little or no tax here\".\nCritics have accused the internet search giant of shifting billions of pounds worth of profit generated in the UK to low-tax Ireland.\nBut a Number 10 spokesman said that diverted profits tax was being applied only to those companies which fail to pay corporation tax at the appropriate level. HM Revenue and Customs has said that Google has paid the taxes due, he said.\nAsked whether Google had paid the \"Google tax\", the Downing Street spokesman said: \"Companies which divert profits from the UK will either have to change their behaviour and declare the correct amount of profits and pay corporation tax on all those profits, or, if they don't do that, they risk paying a higher amount of diverted profits tax.\n\"Diverted profits tax is only there to capture tax from those organisations that don't pay corporation tax on their profits in the UK. HMRC have made clear that Google have paid the taxes that they are due to pay.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3422411/David-Cameron-happy-EU-investigate-Googles-130m-tax-deal.html"}
