{"authors":[],"date_download":"2018-10-23 01:56:32","date_modify":"2018-10-23 01:56:32","date_publish":"2017-03-10 10:32:04","description":"Australia assistant coach David Saker says it is 'a huge honour' to take charge for their one-day international tour of India later this year, allowing head coach Darren Lehmann to take a break.","filename":"data/vaneerConsumption/DavidSakerinchargeofAustraliaODIseriesinIndia.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22440D00000578-0-image-a-14_1489149201229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4300766_David-Saker-charge-Australia-ODI-series-India_1540259792.html","title":"David Saker in charge of Australia ODI series in India","title_page":"David Saker in charge of Australia ODI series in India | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Assistant coach David Saker will take charge of Australia for their one-day international tour of India later this year, allowing head coach Darren Lehmann to take a break.\nAustralia's coaching set-up has seen former cricketers take turns to fill in for Lehmann, who recovered from deep vein thrombosis last year after being hospitalised for the condition.\n'It's a huge honour to be even considered to be a coach of an Australian team, and to be given the opportunity is fantastic,' Saker, who has also worked as England's bowling coach, was quoted as saying on Cricket Australia's website.\nAustralia assistant David Saker - who previously worked with England - will take charge\nDarren Lehmann will be afforded time away who suffered from deep vein thrombosis last year\n'I'm going to look forward to it a lot, and my ambition is to coach Australia.'\nThe Australia test side are involved in an ongoing four-match series in India which is tied at 1-1 after two Tests, while the final details of the one-day international tour, pencilled in for October, have yet to be confirmed.\nThe third Test takes place in Ranchi, starting March 16 with the fourth Test taking place at the Himachal Pradesh Cricket Association Stadium in Dharmasala on March 29.","url":"https://www.dailymail.co.uk/sport/cricket/article-4300766/David-Saker-charge-Australia-ODI-series-India.html"}
