{"authors":["Hugo Gye","Steph Cockroft","Mark Duell For Mailonline"],"date_download":"2018-10-22 23:38:59","date_modify":"2018-10-22 23:38:59","date_publish":"2016-01-11 06:53:04","description":"The iconic singer, whose new album came out just last week, died from cancer aged 69 in New York City yesterday surrounded by his family.","filename":"data/vaneerConsumption/DavidBowiedeadaged69afterbattlewithcancer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/12/05/3011FDA700000578-0-image-a-21_1452574950145.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393470_David-Bowie-dies-18-month-battle-cancer_1540251539.html","title":"David Bowie dead aged 69 after battle with cancer","title_page":"David Bowie dead aged 69 after battle with cancer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Last picture: David Bowie attended the premiere of the musical Lazarus, based on his songs, in New York City on December 7\nSomber tributes turned to wild parties as fans all over the world set up impromptu shrines to the late David Bowie after the rock star's death was announced yesterday.\nThe iconic singer, whose new album came out just last week, died from liver cancer aged 69 in New York on Sunday surrounded by his family.\nAnd only a week ago he sent frequent collaborator Brian Eno a farewell email saying: 'Thank you for our good times, Brian, they will never rot.'\nFollowing an outpouring of grief from celebrities, public figures and music fans, several significant sites in Europe and the US were transformed into memorials for the rocker, who had secretly battled illness for 18 months and was said to have suffered six heart attacks in the past few years.\nHis childhood home in South London, his apartment building in New York, a Dutch museum hosting a Bowie exhibition and the spot where the Ziggy Stardust album cover was captured were among the areas to host vigils.\nSeveral fans burst into tears while laying flowers at a mural dedicated to the star in his birthplace of Brixton, with many saying his death - announced yesterday morning - felt like losing someone close to them.\nIn Brixton, south London, where he was born, hundreds of fans donned the iconiclightning face paint from album Aladdin Sane, as the somber mood turned into a party atmosphere into the early hours.\nThousands of people gathered outside the Ritzy cinema, dancing and playing his music throughout the night to pay tribute the the legendary musician.\nBowie's passing came just three days after the release of a music video which featured chilling footage of the singer confined to a hospital bed with his eyes covered by a bandage. Also yesterday, following his death:\nScottish Nationalists trolled Bowie because he pleaded for Scotland to stay part of the UK\nThe friend who left Bowie with a damaged pupil after punching him in a school fight revealed the star supported him through cancer\nBowie's son Duncan made a touching tribute to his father as 4.3million tweets were dedicated to the star, who had largely stayed out of the public eye since undergoing emergency heart surgery in 2004\nAngie Bowie decided to stay in the Celebrity Big Brother house after bosses told her off-camera of her ex-husband's death\nA Heart FM newsreader accidentally announced that Prime Minister David Cameron had died instead of Bowie\nMadonna was accused of using her Twitter tribute to Bowie to help promote her latest tour after using her 'rebelheart' hashtag\nHis producer Tony Visconti suggested that Bowie knew for a year that his cancer was incurable, and added that his final album Blackstar - recorded in early 2015, after the singer's diagnosis - was 'a parting gift' to the world.\nBiographer Wendy Leigh told BBC News: 'He had six heart attacks in recent years - I got this from somebody very close to him.'\nAfter Bowie's death a flood of celebrities and other public figures such as politicians and even the Archbishop of Canterbury rushed to pay tribute to the impact he had on the cultural landscape of his era.\nA spokesman for the singer said yesterday: 'David Bowie died peacefully surrounded by his family after a courageous 18-month battle with cancer.\n'While many of you will share in this loss, we ask that you respect the family’s privacy during their time of grief.'\nAt the vigil in Brixton, Rosie Lowery, 21, who painted her face with a lightning bolt in tribute, was crying as she laid flowers in Bowie's memory.\n'I woke up this morning to my dad ringing me and he told me the news,' she said. 'I was so sad. I felt like I'd lost someone I knew - even though I hadn't even seen him live.'\nRebel Rebel: A reveler mounts the statue of Henry Tate as the party looks to liven up in Brixton following the death of local boy Bowie\nMark of an icon: Hundreds of fans donned the lightning face paint that characterised one of the most iconic images of the late musician\nGathering: Crowds in Brixton, South London, read and place floral tributes beneath a mural of David Bowie yesterday following his death\nWild is in the wind: There was a police presence in the area to make sure things didn't get out of hand as thousands gathered in Brixton\nRemembering his music: People listen to audio as they look at tributes near a mural for British singer Bowie by artist Jimmy C in Brixton\nOh! You Pretty Things: More fans wore the face paint that he was so famous for, at the part in Brixton. In the background, the Henry Tate statue can be seen on a pillar, which was also painted with the lightning\nSeen from above: A crowd gather outside the Ritzy Cinema in Brixton in tribute to Bowie after his death was announced yesterday\nGround control: Revellers sit and stand on top of a telephone box as crowds gather outside the Ritzy Cinema in South London\nLet's Dance: Crowds gather outside the Ritzy cinema in South London to sing and pay homage to Bowie\nStarman: A woman stands next to the altered statue of Sir Henry Tate outside the Ritzy Cinema, both of them wearing trademark face paint that characterised one of the most iconic images of the late musician\nParty: Bowie fans Phoebe Manley (left), 18, of Hammersmith, and music student Emily Strange (right), 17, of Stoke Newington, in Brixton\nTaking a look: Well-wishers have flocked to the Bowie mural in Brixton to pay their respects following the announcement of his death\nLarge fanbase: Bowie's ground-breaking music inspired generations during a career spanning six decades. Brixton is pictured\nCelebration: Crowds gather outside the Ritzy cinema in South London to pay homage to British singer Bowie following his death\nAnd Brendan McGowan, 53, a lifelong fan of the singer, also said at the memorial in South London: 'I was absolutely stunned.\n'The guy just brings out a new album, which will obviously go to number one now, and you're thinking - great - there's more music in him.\n'You just don't imagine a guy with that much energy and creativity and commitment to music is going to die.\n'The truth is, he's had this cancer for eighteen months, so he recorded this album while he knew he was dying.\n'People will start listening to that album and looking at it in a completely different way.'\nAlso in Brixton, 47-year-old Bowie fan Pete Rogers added: 'He gave oxygen to outsiders. He was so \"other\".\nLondon remembers Bowie: People gather next to tributes placed near a mural for the singer in Brixton following his death from cancer\nTaking photos: Fans gather at the Bowie mural in Brixton to lay flowers and leave messages after he passed away on Sunday aged 69\nHuge crowds: Floral tributes at a mural of Bowie near Brixton Underground station in South London, where he was born\nOutpouring: Crowds sing as they gather outside the Ritzy Cinema in South London following the announcement of Bowie's death\nSinging in Brixton: Bowie died of cancer at the age of 69, drawing an outpouring of tributes for the innovative star\nDeep in thought: A man paused as fans of Bowie converged in Brixton last night to remember and celebrate the musician's life\nTears for an iconic singer: Rosie Lowery, 21, cried yesterday as she paid tribute to Bowie at the mural in South London\nSad: Two fans were among those overcome with emotion yesterday at the site in South London near to where Bowie was born\nEmbrace: Mourners at the Groninger Museum in the Netherlands, where an exhibition on Bowie's life and work is currently on display\nHome: Flowers were placed - and prayers offered - at the entrance to Bowie's apartment building in the Nolita area of Manhattan, New York\nGerman fans: Flowers, candles and photographs are placed in front of the apartment building where Bowie once lived in Berlin\n'It's just something you can't put your finger on, just different, more than anyone else I've ever known.\n'It's amazing how prolific he has been. I think he had a sense of his mortality. There's always something about death in his music.'\nBlackstar was recorded while Bowie was gravely ill and released last Friday, his 69th birthday, but he had rarely appeared in public in recent years.\nHe was seen by fans for the last time on December 7, attending the premiere in New York of a musical based on his songs, called Lazarus.\nIn the summer of 2014, Bowie made a low-key trip to his hometown with his wife Iman and their daughter Lexi, after jetting into London Luton Airport.\nThey visited hotspots such as the London Eye but Bowie went unrecognised, and also went to the house where he grew up in Beckenham.\nTributes in California: A woman places a candle by the star of Bowie on the Hollywood Walk of Fame in Los Angeles yesterday\nAmerica remembers Bowie: A man lies face down next to the David Bowie star on the Hollywood Walk of Fame in California yesterday\nLight: Fans left dozens of candles around the star which is dedicated to Bowie on the Hollywood Walk of Fame in Los Angeles\nIconic: This photograph of Bowie in character for the album Aladdin Sane is one of the most recognisable images of the 1970s\nGrief: An unnamed woman, left, and Miss Lowery, right, could not contain their emotions at the Brixton vigil\nHeaps: The pile of flowers and other gifts continued to grow as fans attended the scene\nHomegrown: A cinema in Brixton called Bowie 'our Brixton boy' after his death\nPause for thought: A cyclist stops outside the home where Bowie grew up in Brixton in the 1950s\nEmotion: One fan's note read 'The stars look very different today', a line from the song Space Oddity\nFamous: The street in London where the Ziggy Stardust album cover photograph was taken became another focus of mourning\nBeloved: The building in Berlin where Bowie once lived was also besieged by fans yesterday\nBowie's son Duncan Jones, who is also known as Zowie Bowie, confirmed the news of his death, writing on Twitter: 'Very sorry and sad to say it's true. I'll be offline for a while. Love to all.'\n'THE STRUGGLE IS REAL, BUT SO IS GOD': BOWIE'S WIFE IMAN POSTS HER OWN MESSAGE ON THE DAY HER HUSBAND DIED David Bowie's wife Iman posted a moving message on social media on the day of her husband's death. The 60-year-old supermodel shared an image on Twitter saying, 'The struggle is real, but so is God,' along with the caption 'Rise'. Other cryptic tweets posted by Iman, pictured, over the weekend included the message: 'Sometimes you will never know the true value of a moment until it becomes a memory.' The Somali-born model was married to Bowie for nearly 24 years, and the couple had one daughter, 15-year-old Alexandria Zahra, known as Lexi. Before his marriage to Iman, Bowie was married to Angie Barnett from 1970 to 1980, with their son Duncan, originally known as Zowie Bowie, born in 1971. Duncan Jones is now a successful film director whose works include 2009's Moon and Source Code, starring Jake Gyllenhaal, from 2011.\nMr Visconti wrote on Facebook: 'He always did what he wanted to do. And he wanted to do it his way and he wanted to do it the best way. His death was no different from his life - a work of art.\n'He made Blackstar for us, his parting gift. I knew for a year this was the way it would be.\n'I wasn't, however, prepared for it. He was an extraordinary man, full of love and life. He will always be with us. For now, it is appropriate to cry.'\nMr Eno, who produced several Bowie albums, said: 'David's death came as a complete surprise, as did nearly everything else about him. I feel a huge gap now.\n'I received an email from him seven days ago. It was as funny as always, and as surreal, looping through word games and allusions and all the usual stuff we did.\n'It ended with this sentence: \"Thank you for our good times, Brian, they will never rot.\" And it was signed \"Dawn\". I realise now he was saying goodbye.'\nFigures from the music world suggested that 'rumours about him not being well' had been floating around for some time.\nIn the later parts of his life the singer lived primarily in New York with his wife Iman and their 15-year-old daughter Alexandria, also known as Lexi.\nBowie's first wife Angie, who is currently appearing on Celebrity Big Brother, was yesterday told of her ex-husband's death and decided to continue her stint on the Channel 5 reality show.\nA spokesman for Celebrity Big Brother said: 'Following the very sad news of David Bowie's death, we can now confirm that Angie Bowie has been informed off camera by her representatives.\n'She has taken the decision to continue in the programme.'\nThe former couple's son Duncan, 44, is a film director based in Los Angeles. His wife Rodene Ronquillo underwent her own cancer battle three years ago when she had a double mastectomy after being diagnosed with breast cancer.\nSinger-songwriter Midge Ure said he had heard 'rumours' about Bowie's illness but was still shocked by the news of the rock legend's death.\n'I think people within the industry had heard rumours about cancer, we’d heard rumours about him not being well,' he told ITV's Good Morning Britain.\n'We all knew something was amiss but this is more than just turning on your phone in the morning or turning on the television and finding out that another celebrity has passed on.\n'I’m standing here, my hands are shaking, I feel as though I’ve lost something, I’ve lost something incredibly important today.'\nA host of stars paid tribute to the British singer, led by Madonna who wrote: 'I'm devastated! This great artist changed my life! First concert I ever saw in Detroit! Talented.\n'Unique. Genius. Game changer. The Man who Fell to Earth. Your spirit lives on forever!'\nIggy Pop, a close friend of Bowie who frequently collaborated with him, said yesterday morning: 'David's friendship was the light of my life. I never met such a brilliant person. He was the best there is.'\nSir Paul McCartney added: 'Very sad news to wake up to on this raining morning. David was a great star and I treasure the moments we had together.\n'I send my deepest sympathies to his family and will always remember the great laughs we had through the years. His star will shine in the sky forever.'\nAnd Rolling Stones frontman Sir Mick Jagger said: 'David was always an inspiration to me and a true original.'\nHe called Bowie's music 'wonderfully shameless', adding: 'He was my friend, I will never forget him.'\nIn memory: Well-wishers look at tributes to Bowie laid outside a restaurant in Beckenham, South London, following his death\nPoignant: Flowers and tributes lie at a bandstand named after Bowie in Beckenham where he once performed in South London\nGathering: Fans photographing the display outside Bowie's former residence in Berlin after a day of tributes\nGraffiti: Belgian artist Lucien Gilson drew this portrait of Bowie in a shopping mall in Brussels\nUS fan: Diana Arango lights a candle at a makeshift memorial surrounding David Bowie's star on the Hollywood Walk of Fame\nNews: Bowie's death was announced by his management on his website and social media yesterday morning\nSadness: Bowie's son Duncan Jones confirmed the news and posted a touching photograph of himself with his father\nTransformation: Bowie went from a clean-cut young musician in the 1960s, left, to a glam rock icon during the 1970s, right\nLAST ALBUM SET TO SOAR TO NO. 1 Vinyl copies of David Bowie's final album are selling for up to £150 on eBay. CDs of the album Blackstar are also selling for five times their value on the site. The album, which is on the 'new and trending' list on HMV, has sold out on its online shop, while there are only a few copies left on Amazon. The Best of Bowie double CD, which was released in 2002, is also out of stock on Amazon and the online shop at WHSmith. Blackstar was on course to reach number one in the album charts even before the news of Bowie's death, and has so far sold more than twice as many copies as its nearest competitor. The Official Charts Company suggested that many of his hits were likely to enter the singles chart too as fans rush to rediscover his back catalogue. Bowie first entered the charts in July 1969 with his track Space Oddity, and scored 25 top 10 singles and 29 top 10 albums in his career.\nKanye West wrote: 'David Bowie was one of my most important inspirations, so fearless, so creative, he gave us magic for a lifetime.' Mark Ruffalo described him as 'father of all us freaks'.\nSinger and producer Pharrell Williams called Bowie 'a true innovator, a true creative', and actor Joseph Gordon-Levitt quoted from his song Eight Line Poem writing: 'But the key to the city is in the sun that pins the branches to the sky...'\nDavid Beckham called Bowie 'a creative genius and influence over us all', adding: 'Rest In Peace STARMAN'.\nTim Peake, the British astronaut whose nickname 'Major Tim' derives from the song Space Oddity, said: 'Saddened to hear David Bowie has lost his battle with cancer - his music was an inspiration to many.'\nRicky Gervais tweeted, 'I just lost a hero. RIP David Bowie,' while Eddie Izzard wrote: 'Please could every radio station around the globe just play David Bowie music today - I think the world owes him that.'\nBilly Idol was one of many people to suggest that Bowie's death was a moment of unusually powerful grief, writing on Twitter: 'Nearly brought to tears by sudden news of David Bowie's passing.'\nCricketer Shane Warne added: 'We can be \"Heroes\".. You were one of mine. Bowie tunes will be played loud in the Warne house tonight.'\nAs well as celebrating his musical career, some chose to focus on his image as a perennial rebel who refused to fit in with society's expectations - Arsenal football manager Arsene Wenger said: 'The message he gave to my generation was important - be strong enough to be yourself.'\nA large number of British politicians also joined the tributes, including Prime Minister David Cameron who said: 'I grew up listening to and watching the pop genius David Bowie. He was a master of re-invention, who kept getting it right. A huge loss.'\nLabour leader Jeremy Corbyn told the BBC: 'As soon as I heard of his death, very, very sad, Life On Mars comes flowing back into my mind. Wonderful song, wonderful guy.'\nCouple: Bowie with his wife Iman, whom he married in 1992 and with whom he had a daughter\nIcon: Bowie was known for his dramatic costumes and frequent transformations; he is pictured with Twiggy in 1973\nVersatile: Bowie pictured left in the music video for 1980's Ashes to Ashes, and right performing in 1990\nOutpouring: Madonna (left) paid tribute to Bowie in a string of emotional tweets, while David Beckham (right) shared this picture of Bowie\nSupermodel: Kate Moss was pictured walking in London yesterday as she wore a T-shirt with a black and white image of Bowie's face on the front of it. She also wore a pair of purple metallic platform boots similar to those once sported by the singer\nMayor of London Boris Johnson described Bowie as a 'genius', saying: 'Terrible news to hear Brixton-born David Bowie has died. No one in our age has better deserved to be called a genius.'\nBOWIE SENT A 'GOODBYE' EMAIL TO HIS FRIEND BRIAN ENO A WEEK AGO Collaborator Brian Eno, who worked with the singer multiple times, reflected on an email Bowie sent him just one week ago. He said: 'It was as funny as always, and as surreal, looping through word games and allusions and all the usual stuff we did. 'It ended with this sentence: \"Thank you for our good times, Brian. they will never rot\". And it was signed \"Dawn\". I realise now he was saying goodbye.'\nNicola Sturgeon, the First Minister of Scotland, added: 'What dreadful news about David Bowie. A hero for so much more than just one day.'\nAnd Tony Blair said: 'I am so sorry to hear the news of David Bowie’s death. I was a huge fan.\n'From the time I saw his Ziggy Stardust concert as a student, I thought he was a brilliant artist and an exciting and interesting human being.'\nCanadian Prime Minister Justin Trudeau wrote on Twitter: 'I'll never forget hearing Under Pressure for the first time - David Bowie was a fearless original with the power to charm. We'll miss him.'\nArchbishop of Canterbury Justin Welby told the BBC Radio 4 Today programme he became a Bowie fan during the singer's early rise to prominence.\n'I'm very, very saddened to hear of his death,' he said. 'I remember sitting listening to his songs endlessly in the '70s particularly and always really relishing what he was, what he did, the impact he had. Extraordinary person.'\nOne of the more unusual tributes to Bowie's career came from Cardinal Gianfranco Ravasi, the Vatican City's culture chief, who quoted lines from Space Oddity which include the phrase 'may God's love be with you'.\nThe eyes have it: A train passenger takes a virtual journey through the life of Bowie, which is exhibited in a 'Virtual Bowie Coupe' in the train from Zwolle to Groningen in the Netherlands\nViewing: The train in the Netherlands is travelling on a additional service after Bowie died at the age of 69 following a battle with cancer\nRelease: David Bowie in the music video for his recent single Lazarus, recorded while he was suffering from cancer and seen by the public for the first time on Thursday\nHaunting: Bowie's final music video, Lazarus, shows him in a hospital bed with his eyes covered by a bandage in an apparent premonition of his death\nFootage: The video features Bowie writhing around while singing 'Look up here, I’m in heaven'\n'LOOK UP HERE, I'M IN HEAVEN': POIGNANT LYRICS OF BOWIE'S FINAL SONG LAZARUS Look up here, I’m in heaven I’ve got scars that can’t be seen I’ve got drama, can’t be stolen Everybody knows me now Look up here, man, I’m in danger I’ve got nothing left to lose I’m so high it makes my brain whirl Dropped my cell phone down below Ain’t that just like me By the time I got to New York I was living like a king Then I used up all my money I was looking for your ass This way or no way You know, I’ll be free Just like that bluebird Now ain’t that just like me Oh I’ll be free Just like that bluebird Oh I’ll be free Ain’t that just like me\nThe video for the song Lazarus, released last Thursday, has been seen as a premonition of his untimely death - it begins with the singer stepping out of a closet into the confines of a dark hospital where he becomes trapped in a feverish nightmare.\nThe footage continues with him lying in a hospital bed, his frail body wrapped in a blanket and his eyes, which are depicted by buttons, covered by a bandage.\nThe opening line reads: 'Look up here, I'm in heaven. I've got scars that can’t be seen. I’ve got drama, can’t be stolen. Everybody knows me now.' It ends with the words: 'This way or no way, you know, I'll be free.'\nThe video was made by Johan Renck, a Swedish director behind Breaking Bad and The Walking Dead. He also worked with Bowie on the video for Blackstar, the album’s title track.\nAmong those who pointed to the lyrics of Lazarus as a premonition of Bowie's death were JK Rowling, who shared the words along with the message: 'I wish he could have stayed on earth longer.'\nThousands of fans expressed their grief at the star's unexpected death, sharing his song lyrics online and reminiscing about memories of him - one enthusiast wrote: 'Didn't occur to me that David Bowie could die.'\nDespite his relatively low profile over the past few years, Bowie gave no hint that he was gravely ill before the announcement of his death.\nBowie, who was born David Jones in Brixton and brought up in the suburb of Bromley, began his career as a novelty musician before finding fame in 1969 with the hit Space Oddity.\nDuring the 1970s, Bowie was regarded as one of the most radical and ground-breaking musicians in the world, ushering in the glam rock era with his Ziggy Stardust persona.\nHe continued to mix experimental concepts with traditional pop songs in albums such as Heroes, Low and Diamond Dogs, as well as acting in films such as The Man Who Fell to Earth and The Last Temptation of Christ.\nIn recent years Bowie's career revived once again despite his keeping a relatively low public profile - three years ago The Next Day was a best-seller, while new album Blackstar - tipped to go straight to number one this week - has received positive reviews.\nAt the height of his fame in 1970 he declared that he was bisexual, instantly propelling him to the status of gay icon.\nBowie was married twice - he wed first wife Angie in 1970, and the couple's son Duncan was born the next year before they divorced in 1980.\n'A true original' Mick Jagger posted this poignant photograph with David Bowie, saying he was an 'inspiration'\nTributes: Stars from the world of showbiz and beyond were quick to express grief at the news\nMemories: The band Pixies shared a photograph of Bowie with other musicians including The Cure's Robert Smith and Billy Corgan from Smashing Pumpkins\nHe later married supermodel Iman, having a daughter named Alexandria who is now 15.\nBowie's cultural impact became apparent when the Victoria and Albert Museum in London dedicated a blockbuster exhibition to his life, work and style in 2013.\nHe also made financial history in 1997 when he sold off the rights to some of his future earnings by packaging them up in 'Bowie Bonds', issuing $55million (£38million) of the securities.\nAlthough he generally stayed away from political controversy, Bowie made a high-profile intervention in the Scottish independence debate ahead of the 2014 referendum when he sent friend Kate Moss to collect a Brit Award on his behalf with a speech which concluded: 'Scotland, stay with us.'\nHowever, despite his towering fame he remained willing to poke fun at himself - he made cameo appearances in comedies such as Zoolander, where he adjudicated a runway competition, and TV's Extras, where he performed a song mocking Ricky Gervais' character.\nMeanwhile Bromley Council pledged to ‘redouble’ its efforts to make the renovated Beckenham bandstand a ‘fitting and enduring tribute’ to Bowie's memory.\nThe bandstand was ‘indelibly linked’ to the singer after he performed there in 1969, Councillor Colin Smith said. He said Bowie was at the ‘absolute cutting edge’ of an inspirational generation.\nMr Smith added: ‘Those of us in our 50s and 60s in particular I suspect but many, many, more as well, have long since been very proud of our adopted Beckenham (and Bromley) boy's roots and what he went on to achieve and like multitudes of others, now mourn his passing with great sadness.\n‘He may be gone, but his music and legend will live on.’\nThe Beckenham Recreation Ground was left unlocked last night to allow for mourners to lay flowers and gather to pay their respects.\nBowie's life full of Stardust: How a boy from Brixton grew up to be a global superstar with bisexual affairs and drugs along the way\nBy Simon Tomlinson for MailOnline\nKing of glam rock: David Bowie enjoyed a glittering career spanning six decades that saw him become one of the biggest recording artists of all time\nOne of Britain's most successful, pioneering and sexually liberal musicians, David Bowie enjoyed a glittering career spanning six decades that saw him become one of the biggest recording artists of all time.\nThe chameleonic figure, who first changed his name and then transformed into Ziggy Stardust, continued to reinvent himself and his music and maintained a reputation as an innovative and uncompromising artist.\nThe figures alone illustrate the magnitude of a spectacular career. In total Bowie released 111 singles – including five UK number ones – 26 studio albums, 46 compilation albums, five EPs and three soundtracks.\nHe collected dozens of awards, including two Brits Awards, two Grammys and three MTV awards and transferred his artistry to film in 51 music videos.\nHe took leading roles in blockbuster films, from The Man Who Fell To Earth in 1976 to a cameo in 2001's Zoolander and was also recognised for his sartorial edge by GQ magazine.\nHis liberal sexual prowess was also legendary, seducing male and female lovers alike including a Playboy model, singer Nina Simone, Charlie Chaplin's widow and a transsexual among others, sometimes 'bisexually multi-timing' his partners, as one ex described it.\nIn an interview with Jonathan Ross some years ago he avoided answering the question of whether he was gay or bisexual, simply to say: 'I just got my leg over a lot.'\nSome star names including Oscar winner Susan Sarandon and singer Lulu have said they had dalliances with him.\nBorn David Robert Jones on January 8, 1947, in Brixton, south London, to mother Margaret 'Peggy', a waitress, and charity worker Haywood 'John' Jones, Bowie's musical talent was clear from an early age and he had his first taste for rock music through the record collection of his older brother, Terry.\nThe family moved to south east London, where he graduated from Bromley Technical High School at 16.\nHe formed a number of bands and led a group calling himself Davy Jones, later changing his name to David Bowie to avoid confusion with the Davy Jones from the Monkees.\nThe name was said to be inspired by a knife developed by the 19th century American pioneer Jim Bowie.\nHe decided to set out on his own as a solo artist, releasing three singles for Pye Records and his debut album, The World Of David Bowie.\nBut the records did not achieve the huge success he would go on to experience and he retreated to a Buddhist monastery in Scotland in 1967\nAfter returning to London he started arts troupe Feathers in 1968.\nAs the group eventually separated, he helped create the Beckenham Arts Lab in 1969 before releasing the hit Space Oddity on July 11 that year, his first UK number one.\nAs a Seventies superstar, he trumpeted to the press that he was gay at a time when even Elton John was still in the closet, then amended it to bisexual. Many have enjoyed speculating – as his first wife Angie once did – that David and Mick Jagger (above) were lovers\nDavid Bowie outside Bromley Registry office on March 20 1970 after marrying Angie Barnett (right), seen here with her mother\nBowie with his wife Angie Bowie with son Zowie Bowie now Duncan Jones in February 1974 in Amsterdam\nBowie with his son, Zowie Bowie – a film director now known as Duncan Jones – at the 8th Annual Tribeca Film Festival's premiere of 'Moon' at BMCC Tribeca Performing Arts Centre in New York in 2009\nLANDMARK ALBUMS IN DAVID BOWIE'S CAREER David Bowie (1967) Bowie's first solo album was released shortly after his novelty single The Laughing Gnome and failed to ignite the imagination of the record-buying public. Space Oddity (1969) Despite the hit single, the record was not a commercial success on its first release. Hunky Dory (1971) Now considered one of the great albums of the 1970s, Hunky Dory was not a huge commercial success at the time. It features classic tracks including Life On Mars and Changes. It became a much bigger success when it was re-released following the rise of Bowie's Ziggy Stardust incarnation. The Rise And Fall Of Ziggy Stardust And The Spiders From Mars (1972) Bowie's concept album about an alien rock star is still considered his seminal work and, together with the Ziggy Stardust alter-ego he created, the album catapulted him into the stratosphere of rock and pop stardom. The Berlin Trilogy The albums Low (1977), Heroes (1977) and Lodger (1979) were made when Bowie moved from the United States to Berlin and marked another sharp change for the singer. Let's Dance (1983) One of Bowie's most commercially successful albums and seen as his most mainstream creation. Tin Machine (1989) Bowie created a traditional four-piece rock band in an effort to rejuvenate his career and return to a more straightforward style. The Next Day (2013) Bowie surprised the world with this release on his 66th birthday - a decade after his last album. It received widespread critical acclaim. Blackstar (2016) Released only two days before his death on his 69th birthday. The album was already well received by critics and is now being scoured for references to his illness.\nA string of albums followed before 1972's The Rise And Fall Of Ziggy Stardust And The Spiders From Mars made him an international star.\nThe album, which tells the story of an alien rockstar, saw Bowie indulge his eye for the theatrical with a string of live shows and television appearances that saw him conquer America and create an otherworldly reputation that still clings to him.\nAt the same time, he was producing albums for Lou Reed and Iggy Pop and writing one of his greatest songs – All The Young Dudes – which he promptly gave away to Mott The Hoople who had a massive hit with it.\nBowie's announcement – during a London gig – that he was retiring Ziggy did not stop the commercial success and the hits kept coming as he toured and recorded albums including Aladdin Sane, Diamond Dogs and his tribute to the swinging London scene that inspired him, Pin Ups.\nHis soul-inspired Young Americans saw him change direction again and gave him his first US number one when his collaboration with John Lennon on Fame topped the charts in 1975.\nBowie played on his alien alter-ego with a successful move into acting – playing the lead character in the science fiction film The Man Who Fell To Earth, before moving to Berlin.\nThe influence of the then divided city inspired a trio of albums – Low, Heroes and Lodger – which produced hits including Sound And Vision and Boys Keep Swinging and are widely regarded as among his finest work.\nIn March 1970, he married Angie and the pair had a son, Zowie Bowie — a film director now known as Duncan Jones.\nA decade later, he split from his wife, reportedly over rumours about his sexuality.\nAngie, who is currently a contestant on Celebrity Big Brother, has not spoken to the singer for nearly 40 years.\nIn an interview published in the Daily Mail today, she claims he forced her into an open marriage and turned their son against her.\nDuncan has not spoken to Angie all this time either.\n'That is because David poisoned the boy against me,' she said.\nBeing shunned by both Bowie men has, Angie told her housemates, left her with a broken heart.\n'My job was managing David and when I was offloaded I couldn't work with anyone else as a manager.\n'That's the reason why I was heartbroken; I had no work and a son. So I wasn't interested in fighting David for custody because I didn't have a job,' she explained.\nBoth were bisexual and wildly promiscuous, with a marriage as open as a Saturday morning sweetshop, but Angie says it was not what she wanted.\nAngie told The Daily Mail's Jan Moir: 'I was a little suspect of him. He did a lot of cavorting.\n'When we got married, it soon became apparent that it had to be an open marriage if it was going to work for him.\n'I liked him, loved him, cared about him, but I was not going to be humiliated and not treated with dignity and respect.\n'So I made sure I did plenty of cavorting myself because that means the playing field was levelled.'\nThe 1980s saw Bowie combine his rock career with appearances in films including Merry Christmas, Mr Lawrence and Absolute Beginners.\nThe rise of the New Romantic scene in the UK betrayed an obvious Bowie influence and he continued to record and tour filling massive US stadiums and selling albums by the million.\n1988 brought a new venture – and what many fans thought was a new low – when he returned as one quarter of rock band Tin Machine.\nTheir initial success soon faded and by 1993 Bowie was back on his own with the solo album Black Tie White Noise.\nBowie played on his alien alter-ego Ziggy Stardust with a successful move into acting - playing the lead character in the science fiction film The Man Who Fell To Earth (above)\nThe 1980s saw him combine his rock career with appearances in films including Merry Christmas, Mr Lawrence and Absolute Beginners\nHe had married supermodel Iman a year earlier and settled in New York but continued to tour and record until 2003 when he released Reality.\nIt was his 23rd – and many assumed last – studio album and was followed by some low-key live appearances, an acting role in the 2006 film The Prestige, but no new music until last year when he returned with the widely acclaimed The Next Day.\nThe album won praise and earned him a place on the Mercury Prize shortlist, although he missed out to James Blake.\nIn her explosive memoirs released last week, Bowie's former landlady told how he seduced her over tea, music and cannabis one afternoon in 1969.\nMary Finnigan, a single mother-of-two who at 30 was seven years his senior, lifted the lid on on an extraordinary period when, for six psychedelic months, Bowie perked up not just the 'commuter dormitory' of Beckenham, but also her home, suburban family life and bed with his 'very horny' and 'sexually sophisticated' attentions until everything was 'fizzing with excitement and activity'.\nThen his good friend Angie Barnett, who later became his wife, all but moved in to join the fun.\nMary later discovered that he was not only unfaithful, but was also bisexual and polyamorous.\n'He had been bisexually multi-timing me for the entire period of our relationship,' Mary said earlier this week.\n'I was just one among many of whom Angie was probably the principal.'\nHe would also dally with English aristocrat Sabrina Guinness, but for much of the decade, the love in his life was dancer Melissa Hurley, 20 years his junior.\nThey were engaged, but split in 1990, and that October, at a friend's party in Los Angeles, Bowie met Iman.\nBowie continued to tour and record until 2003, when he released Reality.\nThe same year he sparked headlines when he turned down a knighthood in the Queen's New Year honours because he reportedly viewed the honours as a 'waste of time'.\nThen during his tour in 2004, Bowie suffered a major health scare when he had a heart attack on stage in Germany.\nThe rest of the tour was cancelled as the singer recuperated, reducing his musical output for the next two years.\nDuring this time he worked on music for films such as Shrek 2 and Stealth, and collaborated with Canadian band Arcade Fire and Lou Reed.\nIn 2006, Bowie returned to acting, playing the part of scientist and inventor Nikola Tesla in the Chris Nolan-directed film The Prestige.\nBowie with his wife Iman at the opening night of the Metropolitan Opera at Lincoln Centre in New York in 2006\nA year later, he starred as himself in an episode of Ricky Gervais's comedy series Extras.\nHe received the Grammy Lifetime Achievement Award in 2006.\nIn November of that year, he performed alongside Alicia Keys at the Black Ball, a New York benefit for Keep A Child Alive.\nThis was the last time he performed live, despite constant hope from his fans that he would reverse his decision to quit live performances.\nOn his 66th birthday in January 2013, Bowie revealed he had been back in the studio and would be releasing his first album of new material.\nIn time with the announcement he released the single Where Are We Now? and the full album followed in March that year.\nThe record was Bowie's first featuring new material for 10 years and was received warmly by critics and fans, becoming his first album to reach number one since Black Tie White Noise, released in 1993.\nWhere Are We Now? was recognised with a Brit Award in 2014, making Bowie the oldest ever recipient when he collected the prize for Best British Male, although the gong was collected on his behalf by supermodel Kate Moss.\nHis classic record Let's Dance was re-released in July last year and he released his 25th and final studio album, Blackstar, last Friday.\nDavid Bowie (top row, second left) pictured as a pupil at Burnt Ash Primary School in Bromley, Greater London\nA view of the house in Stansfield Road (centre), in Brixton, south London, where David Bowie was born\nProducer Tony Visconti, who worked with Bowie on his last studio album, Blackstar, said: 'He always did what he wanted to do.\n'And he wanted to do it his way and he wanted to do it the best way. His death was no different from his life – a work of art.\n'He made Blackstar for us, his parting gift. I knew for a year this was the way it would be.\n'I wasn't, however, prepared for it. He was an extraordinary man, full of love and life. He will always be with us. For now, it is appropriate to cry.'\nHe leaves son Duncan, 44, daughter Alexandria, 15, and Iman, 60.\nDavid Bowie's lifelong friend who was responsible for his different coloured eye after a teenage fight over a girl reveals the star later thanked him for giving him a unique look\nThe man responsible for David Bowie's distinctive eye has paid tribute to his lifelong friend.\nGeorge Underwood, Bowie's bandmate and one-time love rival, is in 'shock' having not known of the star's cancer until he passed away.\nBowie, who died just three days after releasing his 25th studio album, kept his 18-month battle with cancer so private that even close friends weren't aware of his struggle.\nUnderwood, who was supported by Bowie through his own fight with prostate cancer, was devastated at the loss of the friend he has known since he was aged nine.\nDavid Bowie (left) and life long friend George Underwood (right). George, from Uckfield in East Sussex siad he was in 'shock', having not known of the star's cancer until he passed away\nHe said yesterday: 'Someone texted me this morning. I couldn't believe it, then I switched on the radio. I'm still in shock. I wasn't aware of his illness at all. We were in contact by email. I knew he was working on a new album so I thought I better leave him to it.\n'It's a bit of a shock, I can't get my head around it. I didn't know he was ill. He bought so much happiness and joy to so many people, that's the fantastic legacy he's left behind. He will go down in history. He was such a lovely guy.\n'He makes me laugh, I'm going to miss him. I sent a painting to him on his birthday. I hope he was awake for it.'\nUnderwood, now 68, recorded an album with Bowie with their outfit The King Bees and even created the distinctive artworks that appeared on albums Hunky Dory, and The Rise and Fall of Ziggy Stardust and the Spiders from Mars.\nThe pair met while enrolling for cub scouts and attended Bromley Technical School where they discovered a love for music together alongside classmate Peter Frampton.\nUnderwood, speaking from his home near Uckfield, in East Sussex, said: 'People ask what he was really like but I don't think anyone will ever know unless you know him like me. I have known him since I was nine years old.\n'We were enrolling for cubs on the same day that's how we met and we became friends ever since. We then went to the same secondary school and were in various bands together. It's a sad old day.'\n'He later thanked me': Bowie's distinctive eye was caused by a condition known as Aniscoria\nUnderwood was devastated that he did not get a chance to say goodbye to his friend and was surprised he hadn't been told of his illness as Bowie had been diagnosed 18 months ago.\nHe said: 'I have been in contact with him via email since then. When I had prostate cancer he was very concerned about me. He kept that to himself though didn't he? He looked well. I wonder if it's just come out of nowhere, an aggressive cancer that's suddenly come up.\n'Usually cancers is a long slow process and you get very tired but he's been so active.'\nHe also said that Bowie's latest album Blackstar, along with single Lazarus - released two days before his death - now take on a 'more haunting' meaning.\nHe said: 'There's obviously a message there with Lazarus. He must've had some kind of inkling he wouldn't be alive for much longer. I was listening to the whole album yesterday - it's even more haunting now. When you realise this has happened it gives you a different outlook on it..'\nUnderwood punched Bowie during a row over a girl when they were just 15, which left one pupil permanently dilated - a condition called Aniscoria.\nMedics reckon Bowie was caught in the eye by Underwood's fingernail, which left his left eye looking like it was a different colour.\nBut despite leaving his friend with a permanent disorder, Underwood revealed that the singer later thanked him for giving him his famed look.\nUnderwood said: 'He later told me I did him a favour.'\nDavid Bowie's haunting lyrics to his last song Lazarus appear to be a farewell from a man who knew he was dying\nDavid Bowie used the haunting lyrics of his swansong album to say goodbye to his fans following a secret 18-month battle with cancer.\nThe singer, who died on Sunday, penned seven tracks for his latest album Blackstar which were full of cryptic lyrics that hinted at the terminal nature of his condition.\nPerhaps the most moving track on the record is Lazarus, which became posthumously poignant yesterday as he told fans: 'Look up here, I'm in heaven.'\nJust three days before he died, the avant-garde artist had released the video for the song, which showed the singer trapped in a hospital bed, his frail body shaking beneath the covers and his eyes covered in bandages.\nYesterday, Bowie's producer suggested the artist knew for a year that his cancer was incurable, describing Blackstar as his 'parting gift'. He added that Bowie had made his death - as he did his life - 'a work of art'.\nAs he writhes around in a tortured fashion (left and right), levitating above the mattress, a hand reaches out from under the bed.\nThe album, which was released just two days before he died, was Bowie's 25th album but the only one that has not featured his photo on the cover. Instead, it features a lone black star.\nIt has now charged into the top spot and could become Bowie's 10th chart-topping album, if it stays at number one until the charts are announced on Friday.\nPaying tribute to the musician, Tony Visconti - who produced the star's music dating back to the 1960s - said: 'He always did what he wanted to do. And he wanted to do it his way and he wanted to do it the best way.\n'His death was no different from his life - a work of Art.\n'He made Blackstar for us, his parting gift. I knew for a year this was the way it would be. I wasn't, however, prepared for it.'\nHe added: 'He was an extraordinary man, full of love and life. He will always be with us. For now, it is appropriate to cry.'\nThe video for Lazarus - named after a biblical character who was raised from the dead four days after he died by Jesus - was released on Thursday and is full of haunting images alluding to death.\nThe bleak video begins with the singer - a blind man whose eyes are depicted as buttons - stepping out of a closet into a dark hospital where he becomes trapped in a feverish nightmare.\nThe singer is then seen dancing in his room before manically poring over his journal, at a desk in the ward\nThe haunting footage continues with him confined to a hospital bed, shrouded in darkness, as he vulnerably clutches onto his bed sheets and writhes around in a tortured fashion.\nAs Bowie levitates above the mattress, a hand then reaches out from under the bed - perhaps a symbol of being lifted towards heaven.\nAnother Bowie then appears - a stronger, freer version of the singer - and he starts dancing in the room.\nHe then retreats to a desk, where he manically pores over a notebook. As he continues to write frantically, a skull can be seen sitting on the desk - perhaps a sign of his impending death.\nThe song then reaches its climax and Bowie walks back to the wardrobe and shut the door behind him, seemingly bidding farewell for the final time.\nThe song was released on the Steve Lamacq show on BBC 6 Music on December 17.\nThe opening line reads: 'Look up here, I'm in heaven.'\nHe then makes a veiled reference to his musical legacy transcending his death, singing: 'I've got scars that can't be seen. I've got drama, can't be stolen. Everybody knows me now.'\nAs the song ends, Bowie sings: 'This way or no way, you know, I'll be free. Just like that bluebird, Oh I'll be free.'\nThe track is a pseudo sequel to the 1976 film he starred in, The Man Who Fell To Earth, and is also the title track of the artist's off-Broadway musical Lazarus.\nThe video was made by Johan Renck, a Swedish director behind Breaking Bad and The Walking Dead. He also worked with Bowie on the video for Blackstar, the album's title track.\nIn Blackstar, Bowie once again features as the blind man but the ten-minute video opens with an eerie scene, in which a spaceman in a space suit is found lying lifelessly on the ground.\nSeveral observers have suggested the spaceman could be a throwback to Bowie's intergalactic back catalogue or a direct reference to Major Tom, who has featured heavily in Bowie's music.\nA young woman then walks up to him and lifts his helmet, revealing a skull laden with jewels, perhaps a symbol for death. There appear to be several further references to death throughout the film, including scenes showing crucifixes and burials.\nThe lyrics also allude to death, as he sings: 'Something happened on the day he dies. Spirit rose a metre and stepped aside.'\nIn a statement released last week, Mr Renck said: 'One could only dream about collaborating with a mind like that; let alone twice. Intuitive, playful, mysterious and profound.\n'I have no desire to do any more videos knowing the process never ever gets as formidable and fulfilling as this was. I've basically touched the sun.\nThe video begins with the singer stepping out of a closet into a dark hospital. He returns to the closet at the end\nAsked about symbolism in November, Mr Renck told Vice magazine: 'Most things like this are for the eyes of the beholder, you know? You make of it whatever you want.\n'What I can say, on one side of things there is no deliberate, underlying, firm quest to have any references to past times.'\nThe rest of the album - which features just seven tracks - is also now seen as a reference to Bowie's own mortality.\nThe outro of the penultimate song of the album Dollar Days repeats: 'I'm dying to. I'm trying to,' as the music fades.\nOn the final track I Can't Give Everything Away, Bowie sings: 'I know something is very wrong, The pulse returns the prodigal sons, The blackout hearts, the flowered news, With skull designs upon my shoes.'\nFollowing news of his death, the Official Charts Company said the album was almost guaranteed to be in the number one spot at the end of the week.\nIt currently has combined sales of more than 43,000, which puts Bowie 25,000 ahead of his closest competitor, Elvis Presley.\nOfficial Charts Company chief executive Martin Talbot said: 'Today is an awful day for all lovers of music.\n'And the fact that David Bowie's new album Blackstar was on course for number one this week, even before today's terrible news, says everything about his continuing relevance - over 40 years since his first hit records.\n'We are expecting a huge surge for a wide range of Bowie albums in this week's Official Albums Chart. Bowie made so many great albums, constantly reinventing himself, that everyone has their own favourites and fans are clearly reminding themselves of his massive contribution to popular music by buying these great, iconic works.'\nBowie first entered the charts in July 1969 with his track Space Oddity, and scored 25 top 10 singles and 29 top 10 albums across his career.\nSeveral of his songs are expected to re-enter the singles chart this week as fans pay tribute to the singer.\nDavid Bowie's final decade was beset by health problems after he first suffered a heart attack backstage at a gig in Germany in 2004\nYears of health problems: Bowie in September 2006 in New York\nDavid Bowie suffered years of ill-health before his death from cancer at the age of 69 - but he hid how serious his condition was for at least 18 months.\nThe star is believed to have told friends that his illness was incurable around a year ago, and is said to have suffered six heart attacks over the past few years.\nHe had largely stayed out of the public eye since undergoing emergency heart surgery in 2004, prompting speculation that he might have retired from music altogether.\nHowever, Bowie made a surprise comeback three years ago, releasing a critically acclaimed album which he followed up with another new record just two days before his death.\nEven during his late flowering since 2013 he kept a low public profile, refusing to perform live or carry out interviews with the Press, as he brought up daughter Lexi with his second wife Iman.\nBowie's health problems began in 2004, when he was performing in Germany during what would turn out to be his last ever tour.\nThe singer collapsed backstage at a gig in Schessel, suffering from what was initially believed to be a trapped nerve but turned out to be a blocked coronary artery.\nHe never again performed a full concert, but made a handful of guest appearances alongside other artists over the next couple of years.\nTowards the end of the last decade Bowie more or less disappeared from public life, leading to persistent speculation about the state of his health.\nThere was a 10-year gap between his 2003 album Reality and the follow-up record, The Next Day - time which Bowie used to become a 'family man', according to one of musician's biographers.\nPaul Trynka said: 'He walked Lexi to school every day - something he had missed with Duncan [his son], which was something he deeply regretted.'\nThe Next Day was released in January 2013, on Bowie's 66th birthday, with almost no advance warning or publicity.\nThe album was hailed as a triumphant return to form, which saw the star reflecting on his own life, and was nominated for the Mercury Music Prize among other prestigious awards.\nBut the next year, Bowie was diagnosed with cancer and began his secret battle with the disease which would take his life.\nHis illness was hidden from the public, but music industry insiders were aware that the star was seriously ill, while Bowie's close friends knew exactly how grave his condition was.\nDJ Paul Gambaccini said: 'We knew inside the business... but he did keep it publicly private and kept working to the end.'\nMidge Ure added: 'I think people within the industry had heard rumours about cancer, we'd heard rumours about him not being well.'\nTony Visconti, who produced most of Bowie's albums, dismissed fears about his health at the time, saying he 'couldn't have done two years' work if he was a sick man'.\nAsked in 2014 about rumours that the star was suffering from Alzheimer's disease, Mr Visconti said: 'He is as sharp as a tack. He is sharper than ever. This boy has not lost a single brain cell.\n'People thought he was dying. He's not dying any time soon, let me tell you... He had the heart operation and that's it. He's long since recovered from that.'\nBowie performs in a concert during his 'A Reality Tour' at the T-Mobile Arena in Prague, Czech Republic, in June 2004\nBut paying tribute to his friend yesterday, Mr Visconti admitted that he had known for a year that Bowie was suffering from terminal cancer while he made his final album Blackstar, released last Friday.\n'His death was no different from his life - a work of Art,' the producer said. 'He made Blackstar for us, his parting gift. I knew for a year this was the way it would be. I wasn't, however, prepared for it.'\nWendy Leigh, who published a biography of the star 18 months ago, claimed yesterday that Bowie had 'six heart attacks' in the years leading up to his death.\nHowever, the musician continued to work throughout his cancer battle - with Blackstar now seen as a possible premonition of his death thanks to lyrics such as 'Look up here, I'm in heaven.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393470/David-Bowie-dies-18-month-battle-cancer.html"}
