{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-23 00:24:52","date_modify":"2018-10-23 00:24:52","date_publish":"2016-01-28 14:12:41","description":"David Gest wants to make a sensational return to CBB in a bid to help Stephanie Davis choose between her fellow contestant Jeremy McConnell and Sam Reece.","filename":"data/vaneerConsumption/DavidGestwantstoreturntoCBBtogiveStephanieDavisloveadvice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AADD4F00000578-0-image-a-34_1453990948304.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421023_David-Gest-wants-return-Celebrity-Big-Brother-house-Stephanie-Davis-advice-tricky-love-triangle_1540254292.html","title":"David Gest wants to return to CBB to give Stephanie Davis love advice","title_page":"David Gest wants to return to CBB to give Stephanie Davis love advice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He walked out of the Celebrity Big Brother house early due to medical reasons.\nBut David Gest has now revealed he wants to make a sensational return to locked-up abode in a bid to help Stephanie Davis choose between her fellow contestant Jeremy McConnell, and her boyfriend in the real world, Sam Reece.\nThe 62-year-old music producer was forced to quit the reality TV show last Monday after being taken severely ill, suffering from tonsillitis, swollen neck glands and extremely high blood pressure, much to his disappointment.\nScroll down for video\nSet for a comeback? David Gest has revealed he wishes to return to the Celebrity Big Brother house to coach Stephanie Davis on her tricky love triangle situation\nBut now, having been out of the house for a week and a half, he is back to good health and wishes to stage a comeback, mostly to help former Hollyoaks actress Stephanie with her romantic conundrum.\nHe has been a friend of the 22-year-old for the past three years and tried to help her to try to deal with her strong feelings for Jeremy while he was still in the house, even though some of his words of wisdom were tough.\nStephanie has gripped viewers with her antics with the 25-year-old tattooed Irish hunk, showing her passionate affections for him while being torn over her feelings for model Sam, who she has had no contact with in three weeks.\nSpeaking to BANG Showbiz, David said: 'I have been watching the show to see what's happening with Stephanie and Jeremy for myself.\nSee the latest from the CBB house with more on Stephanie's romance with Jeremy\n'She is just like a child': David, 62, said he thinks the 22-year-old can be immature at times - she has been indulging in a romance with Jeremy McConnell while still in a relationship with long-term boyfriend Sam Reece\n'Since I have been out a few of our mutual friends have informed me of certain circumstances I was unaware of and that Stephanie never told me. I think I was a little too harsh on Stephanie when I was in there but only because of what she never told me.'\nHe continued: 'There may be more to the story than meets the eye. She's a great girl but just not mature for her age.\n'Sometimes she is just like a child. It's hard for her to take guidance. Matters of the heart are strong and she needs some one-on-one advice. There are great qualities in each of these guys from what I know.'\nDavid was one of the favourites to be crowned the CBB champion and fans were dismayed when he had to leave after being struck down with illness.\nNew opinion: The music producer admitted 'I think I was a little too harsh on Stephanie when I was in there', but that now he has heard new details that have changed his mind\nHot favourite: David lasted just over a week in the CBB house before being taken ill, having to leave, although he was previously a favourite to win\nMany viewers believed he was going to make a comeback when host Emma Willis promised them a 'special guest' was going in to the house and were left bitterly disappointed when TV health expert Gillian McKeith was revealed to be going in to deal with the 'toxicity' between the contestants.\nDavid, who has also appeared on I'm A Celebrity... Get Me Out Of Here!, had lots of support to win with even Phillip Schofield stating on This Morning that the American star was his favourite to win.\nMeanwhile, since being out of the house he became one of the most memorable guests in recent months on Loose Women, when he had Coleen Nolan reluctantly wish his 40-year-old cousin Uranus Hertz a happy 40th birthday, leaving the studio audience in stitches.\nOo-er: One moment in the house saw him indulge in a very steamy kiss with Irish hunk Jeremy\nHe also appeared on Celebrity Big Brother's Bit On The Side, and was so funny host Rylan Clarke proclaimed he was his favorite ever guest.\nMeanwhile, the not-quite-couple have now been seen indulging in their first passionate kiss - despite a contact ban - in the Big Brother house.\nStephanie dramatically declared that she wanted to be single the previous day, saying in front of the cameras that her boyfriend Sam was not right for her.\nIt's doubtful that model Sam will be waiting for after Celebrity Big Brother ends, since the most recent footage shows Jeremy and Stephanie snogging in the dark, days after they professed their love for each other.\nIn scenes due to air on Thursday, Jeremy is seen stroking the brunette's head and telling her 'what's done is done' as they found themselves alone in the detox room, after-hours, on Wednesday night.\nSteamy: Stephanie and Jeremy have been putting on plenty of loved-up displays in the house and, despite a contact ban, found the time to get intimate","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421023/David-Gest-wants-return-Celebrity-Big-Brother-house-Stephanie-Davis-advice-tricky-love-triangle.html"}
