{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 00:59:50","date_modify":"2018-10-23 00:59:50","date_publish":"2017-03-10 08:21:27","description":"ITV footage showed the former prime minister looking exasperated as he gestured at Defence Secretary Sir Michael Fallon during the unveiling of a new war memorial.","filename":"data/vaneerConsumption/DavidCameronrantsatPhilipHammondsBudget.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E1EAEFF00000578-0-image-a-15_1489134079879.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300266_David-Cameron-ranting-Philip-Hammond-s-Budget_1540256390.html","title":"David Cameron rants at Philip Hammond's Budget","title_page":"David Cameron rants at Philip Hammond's Budget | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron has been caught on camera apparently having a rant at a Cabinet minister over the Tory plan to hike National Insurance, calling it 'stupidity', MailOnline can reveal.\nITV footage showed the former prime minister looking angry as he gestured at Defence Secretary Sir Michael Fallon during the unveiling of a new war memorial.\nProfessional lipreader Tina Lannin, whose company 121 Captions specialises in forensic lipreading for the police and CPS, told MailOnline she is certain Mr Cameron said: 'Breaking a manifesto promise is stupidity.’\nThis is undoubtedly a reference to Philip Hammond’s decision to raise National Insurance contributions in Wednesday’s Budget - but Mr Cameron's office today said it would not comment on a 'private conversation'.\nMaking his point: David Cameron was filmed saying: 'Breaking a manifesto promise is stupidity', a forensic lipreader has told MailOnline\nNot happy: The former PM, who quit over Brexit last year, was very animated in his discussions with Defence Secretary Sir Michael Fallon\nArmed Forces Minister Mike Penning was also party to the conversation at the VIP stand in Horse Guards Parade.\nThe Tories pledged four times in their 2015 general election manifesto not to increase the contributions, warning that a rise would ‘harm our economy’ and ‘reduce living standards’.\nPromise: The Tories pledged four times in their 2015 general election manifesto not to increase the contributions, warning that a rise would ‘harm our economy’ and ‘reduce living standards’\nDavid Cameron unveiled the policy as part of a ‘tax lock’ that aides have since admitted was ‘cooked up on the hoof’ in the final weeks of the campaign.\nBut Mr Hammond announced in his first budget as Chancellor that 2.5million self-employed would lose an average £250 a year as their a National Insurance rises from 9 to 10 per cent.\nTheresa May was last night forced to hit the pause button on Philip Hammond’s controversial tax raid on the self-employed as she tried to placate furious Tory MPs.\nThe Prime Minister moved to delay legislation on the £2billion increase in National Insurance on solo workers until the autumn, after Tory whips warned her they ‘didn’t have the numbers’ to push the Budget measure through the Commons.\nSpeaking in Brussels, Mrs May tried to shore up her beleaguered Chancellor by defending the tax raid, which breaks the Tories’ manifesto pledge not to raise NI. She said the change made taxation ‘simpler, fairer and more progressive’.\nThe PM also insisted ministers had not broken the promise – which appeared four times in the manifesto and pledged there would be ‘no increases in VAT, National Insurance contributions or income tax’.\nShe bought time for a potential climbdown by delaying the legislation, which had been expected this spring, until the autumn, when Mr Hammond will have the chance to offer concessions in a second Budget. But the move is unlikely to calm Tory fury over the issue.\nClose: Mr Cameron stood behind the Chancellor before his rant about Philip Hammond’s decision to raise National Insurance contributions in Wednesday’s Budget\nThe Prime Minister moved to delay legislation on the £2 billion hike in National Insurance on solo workers until the autumn\nThe Prime Minister also ordered Mr Hammond (pictured) to ‘listen to the concerns’ of MPs and businesses, who have reacted with fury to the tax raid\nMrs May also ordered Mr Hammond to ‘listen to the concerns’ of MPs and businesses, who have reacted with fury to the tax raid.\nShe said the measures would be packaged together with new rights for the self-employed on things such as maternity pay, following a review this summer by Matthew Taylor, a former Downing Street adviser to Tony Blair.\nThe delay means the row will rumble on for months, ending any prospect of Mrs May calling a snap election.\nHer intervention came after Tory MPs lined up to publicly condemn the NI rise.\nMr Hammond, who was accused of ‘lying’ to the voters yesterday, insisted that he had not broken the small print of the manifesto pledge, as set out in ‘tax lock’ legislation after the election.\nBut in a sign of the anger over the issue on Tory benches, one minister took the extraordinary step of offering a public apology for the broken promise. Wales Office minister Guto Bebb said: ‘I believe we should apologise. I will apologise to every voter in Wales that read the Conservative manifesto in the 2015 election.’\nIn an indication of the Government’s weakness on the issue, Downing Street refused to rebuke Mr Bebb.","url":"https://www.dailymail.co.uk/news/article-4300266/David-Cameron-ranting-Philip-Hammond-s-Budget.html"}
