{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-22 23:43:43","date_modify":"2018-10-22 23:43:43","date_publish":"2017-03-10 04:14:02","description":"He's the charismatic Nine Today Extra host and successful singer. And David Campbell put his pipes to work during Nova FM's Friday rap battle with Fitzy And Wippa with his first ever rap attempt.","filename":"data/vaneerConsumption/DavidCampbellSLAMSNovaFMsWippainrapbattle.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EFBDF00000578-0-image-a-28_1489106332095.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299456_David-Campbell-SLAMS-Nova-FM-s-Wippa-rap-battle_1540251823.html","title":"David Campbell SLAMS Nova FM's Wippa in rap battle","title_page":"David Campbell SLAMS Nova FM's Wippa in rap battle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the charismatic host of Today Extra on Channel Nine with a successful singing career.\nAnd David Campbell put his pipes to work as he attempted his very first rap battle with Nova FM's Fitzy And Wippa.\nThe 43-year-old versed host Wippa (Michael Wipfli), slamming the radio presenter in a series of harsh quips, including: 'Can someone tell him his brain is expired?'\n'Can someone tell him his brain is expired?' Today Extra's David Campbell SLAMS Nova FM's Wippa in quick quipped rap battle on Nova's Fitzy And Wippa on Friday morning\nThe short 35-second rap was packed full of digs at the star, making reference to his weight, hair loss and his taste.\n'You've got less fans than President Trump' and 'You've got less taste than Victoria Bitter' were two ways David chose to describe the radio personality.\nHe also launched a personal attack on his appearance: 'You're hair loss is gaining!'\nOh, snap! The short 35-second rap was packed full of digs at the radio star, making reference to his weight, hair loss and his taste\n'You've got less fans than President Trump': David also made a dig at Wippa's popularity\nThe stage performer was acting in defense to Wippa's original rant, which implied David was a 'mad man' who would 'ramble'.\nWippa also claimed his Dancing With The Stars debut in 2007 was 'not worth the view.'\nWhile David was hurling his insults towards Wippa, Fitzy was gasping, laughing, clapping and screaming 'owww'.\nOn the offense: Wippa, who started the rap battle, likened David's chatter to a 'mad man's ramble' and suggested his appearance on Dancing With The Stars was 'not worth the view'\nLapping it up! While claiming he was new to rapping, the father-of-three managed to receive a roaring applause at the end of his winning performance\nWhile claiming he was new to rapping, the father-of-three managed to receive a roaring applause at the end of his performance.\nRyan 'Fitzy' Fitzgerald even took to planking and dabbing in an early celebratory manner before announcing David had won.\nWippa, who has never won a rap battle during the show's segment, took the defeat well, admitting: 'I got owned!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299456/David-Campbell-SLAMS-Nova-FM-s-Wippa-rap-battle.html"}
