{"authors":["William Lee Adams For Mailonline"],"date_download":"2018-10-23 03:54:18","date_modify":"2018-10-23 03:54:18","date_publish":"2016-01-29 19:24:58","description":"Victoria Beckham's husband showed off his fashion cred on Thursday, slipping into a three-piece suit for an Oxfordshire photo shoot. He looked very English gent as he worked a variety of looks.","filename":"data/vaneerConsumption/DavidBeckhamissuitedandbootedforfootballpitchphotoshoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E15C00000578-0-image-a-19_1454094935959.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423195_David-Beckham-suited-booted-football-pitch-photoshoot_1540266858.html","title":"David Beckham is suited and booted for football pitch photoshoot","title_page":"David Beckham is suited and booted for football pitch photoshoot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He recently showed off his tattooed torso in a photo shoot for his latest fragrance David Beckham Beyond.\nBut on Thursday, footballer David Beckham kept his gym-fit body covered as he posed for photos in Oxfordshire while wearing a dapper three-piece suit.\nThe 40-year-old father-of-four looked every inch the English gentleman as he carried an Adidas holdall that clashed with his tailored grey ensemble with white pocket handkerchief.\nScroll down for video\nThe look suits him: On Thursday, footballer David Beckham kept his gym-honed body covered as he posed for photos in Oxfordshire wearing a dapper three-piece suit\nThe classic suit hugged David in all the right places, showing off a sporty physique honed through years of competitive sport.\nHe may cut an athletic figure, but locals spotted David standing outside of a fish 'n chips shop earlier in the afternoon.\nThe Oxford Mail reported that he was in Oxfordshire as part of a GQ photo shoot.\nSee David Beckham updates as he poses up a storm for football pitch photoshoot\nScore: The tailored suit hugged David in all the right places, showing off his athletic physique\nEnglish gent: The 40-year-old father-of-four carried an Adidas holdall throughout the photo shoot\nSuave: His ensemble included a crisp white shirt, a white pocket handkerchief and a dark grey tie\nSeasoned model: David worked a variety of expressions during the shoot, but he leaned toward the brooding and contemplative. He also demonstrated his comfort with movement, as seen here\nHe wore his hair swept up and back, making his strong jawline even more prominent, while also drawing attention to his designer stubble.\nClearly at ease on the pitch, David worked a variety of expressions during the shoot, but he leaned toward the brooding and contemplative - looks he previously mastered in campaigns for Belstaff, Breitling for Bentley and H&M.\nHe recently dropped similarly smouldering looks in a photo shoot for his new fragrance David Beckham Beyond.\nBehind-the-scenes stills from the shoot show he is very comfortable with up-close beauty shots.\nHis fragrance has notes of grapefruit, black pepper and leather, which may have helped trigger some of his more sensual expressions.\nSpeaking to People, he said the new fragrance stems from the act of dreaming and thinking big.\n'Whether you’re young or old, we all have dreams,' he said.\n'I’m no different and I have always carried a lot of passion into what I do, but that means you have to work hard too.'\nSomething to say: Talking about his latest venture, the husband of Victoria Beckham said: 'Incredible things happen when you dream big'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423195/David-Beckham-suited-booted-football-pitch-photoshoot.html"}
