{"authors":["Chris Weller"],"date_download":"2018-10-30 22:10:50","date_modify":"2018-10-30 22:10:50","date_publish":"2016-12-15 00:00:00","description":"A 1930 prediction that humans would be working 15-hour weeks by the end of the 20th century didn't come true. David Graeber explains what happened instead.","filename":"data/vaneerConsumption/DavidGraeberTheworldsbullsjobsshouldalldisappear.json","image_url":"https://amp.businessinsider.com/images/5796047f4321f171088ba6c7-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_david-graeber-jobs-should-disappear-2016-12_1540937450.html","title":"David Graeber: The world's 'bulls---' jobs should all disappear","title_page":"    David Graeber: The world's 'bulls---' jobs should all disappear - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Twentieth Century Fox Film Corporation There is a job epidemic in America, anthropologist David Graeber says. And not because there are too few jobs, but because there are too many.\n\"Huge swaths of our economy are completely unnecessary,\" Graeber, an anthropologist and professor at the London School of Economics, said in a 2015 interview with London Real, which was recently spotted by Natalie Shoemaker at Big Think.\nGraeber was referring to the many telemarketers, middle managers, and people in clerical roles who make up a sizable chunk of the US economy. They are jobs in which employees don't find great meaning and are often embarrassed to talk about, Graeber said.\nHis initial complaint about the surplus of meaningless work emerged in 2013, when he published an essay called \"On the Phenomenon of Bullshit Jobs.\" (The essay has since been taken down.) His argument revolved around the prediction John Maynard Keynes made in 1930 that humans would be so technologically advanced by the end of the 20th century that we'd only have to work 15-hour weeks.\nIt should have come true, Graeber said. But it didn't.\nInstead, as America moved into the Digital Age, menial factory jobs gave way to their white-collar equivalents — tasks that require filling in spreadsheets, filing, scheduling, and managing databases. Graeber likened that to the Soviet approach of guaranteeing people a job, no matter how redundant or inefficient their duties.\n\"Technology has been marshaled ... to figure out ways to make us all work more,\" Graeber wrote. \"In order to achieve this, jobs have had to be created that are, effectively, pointless.\"\nGraeber's wish to see more leisure time might soon come true, however, since economists don't see many jobs lasting much longer. A PwC report from earlier this May, for instance, found that drones could replace $127 billion worth of human labor, primarily in infrastructure and agriculture. A few years prior, an Oxford report estimated that 50% of jobs will disappear as early as 2033.\nAutomating a large portion of the labor force could have two big effects: Society would have more wealth (since over time, automated systems are cheaper than human workers) and people would get less work-based income.\nFor Graeber, that new reality should force governments to consider whether they'll change their approaches to wealth distribution. They can either choose to invent new jobs for those who lose them, or stop treating unemployment as a problem and instead create new systems that force the people and companies generating this newfound wealth to share it.\nThe second path leads to the Keynesian ideal of only working 15-hour weeks, not 40-plus. But that transition may be tough since work is an important part of American culture, and wealth redistribution often comes in the form of higher taxes.\n\"It seems to be this idea that work is a value in itself,\" Graeber told London Real.\nThe other option, however — replacing positions lost to automation with even more unnecessary, human-driven jobs — might be even worse.\n\"The moral and spiritual damage that comes from this situation is profound,\" his 2013 essay said. \"It is a scar across our collective soul.\"","url":"https://www.businessinsider.com/david-graeber-jobs-should-disappear-2016-12"}
