{"authors":["Madlen Davies For Mailonline"],"date_download":"2018-10-23 02:02:01","date_modify":"2018-10-23 02:02:01","date_publish":"2016-01-11 13:34:40","description":"Prime Minister David Cameron urged medics 'at this late stage' to get back around the table before the proposed walkout, which starts at 8am tomorrow.","filename":"data/vaneerConsumption/DavidCameronurgesjuniordoctorsnottostriketomorrow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/2FE3AE6900000578-0-image-a-4_1452519210068.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3393884_Don-t-strike-tomorrow-David-Cameron-urges-medics-Walkout-junior-doctors-damaging-cause-real-difficulties-patients_1540260121.html","title":"David Cameron urges junior doctors not to strike tomorrow","title_page":"David Cameron urges junior doctors not to strike tomorrow | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron has pleaded with England's junior doctors to call off their 'damaging' strike, saying it will cause 'real difficulties' for patients and 'potentially worse' scenarios.\nThe Prime Minister today urged medics 'at this late stage' to get back around the table before the proposed walkout, which starts at 8am tomorrow.\nMr Cameron said: 'This strike is not necessary, it will be damaging.\n'We are doing everything we can to mitigate its effects but you can't have a strike on this scale in our NHS without there being some real difficulties for patients and potentially worse.'\nDavid Cameron has urged England's junior doctors to call off their 'damaging' strike, saying it will cause 'real difficulties' for patients and 'potentially worse'\nDoctors union the BMA said it 'deeply regretted' the disruption the industrial action would cause patients, but insisted it was necessary because the proposed contract changes would 'damage patient safety'\nMr Cameron's official spokeswoman also told a Westminster media briefing: 'We are concerned about the situation.\n'We are doing everything we can to ensure that patient safety is protected and to provide the urgent care that patients need.\n'There have been a number of contingency planning meetings in the run-up to this strike going ahead. The Department of Health will be closely monitoring the situation and working with NHS England.'\nJunior doctors are set to provide emergency care only for 24 hours from 8am on Tuesday.\nThis will be followed by a 48-hour stoppage and the provision of emergency care only from 8am on January 26.\nOn February 10, there will be a full withdrawal of staff from 8am to 5pm.\nNHS England said hospitals will be under 'additional pressure' as thousands of junior doctors go on strike in the dispute over pay and a new contract.\nAround 100 picket lines are being put in place for tomorrow's strike, with a large concentration in and around London.\nNHS England said 1,425 inpatient operations and procedures were being cancelled as a result of the strike along with 2,535 outpatient ones.\nIt said there are around 4,000 cancellations in total, of which 3,400 will occur tomorrow.\nSome 654 cancellations - 192 inpatients and 462 day cases - are in London.\nLabour leader Jeremy Corbyn has said it is vital that an agreement is reached 'quickly' in the dispute, which could lead to four days of industrial action in all.\nWHEN WILL DOCTORS STRIKE? 12 January 2016 (24 hours) - Emergency care only between 8am on Tuesday, January 12 and 8am on Wednesday, January 13. 26 January 2016 (48 hours) - Emergency care only between 8am on Tuesday, January 26 and 8am on Thursday, January 28. 10 February 2016 - Full withdrawal of labour, including A&E, from 8am to 5pm on Wednesday, February 10.\nIn advice to patients, NHS England said: 'Urgent and emergency care services will be available as normal but hospitals are expected to be under additional pressure.\n'Where possible, people should contact their GP, seek advice from their local pharmacist, call NHS 111 or consult the NHS Choices website.'\nIt added: 'People should be particularly attentive to their health over this period and look out for more vulnerable members of their families and communities.'\nTalks aimed at resolving the dispute over a new contract failed on Friday, although further talks will continue.\nJunior doctors are set to provide emergency care only for 24 hours from 8am on Tuesday.\nThis will be followed by a 48-hour stoppage and the provision of emergency care only from 8am on January 26.\nOn February 10, there will be a full withdrawal of labour from 8am to 5pm.\nThis morning, Mr Corbyn told the BBC Radio 4 Today programme: 'We should recognise that junior doctors are qualified, extremely hard-working, deserve to be treated properly and (Health Secretary) Jeremy Hunt should now come to an agreement with them.'\nHe added: 'I hope that Jeremy Hunt realises the need to come to an agreement very quickly.'\nThe basis for the current round of negotiations is the Government's offer from early November, including an 11 per cent rise in basic pay for junior doctors.\nThe BMA is due to stage the first of three successive walkouts by junior doctors tomorrow – leading to the cancellation of thousands of operations and appointments. Pictured, junior doctors demonstrating last year\nHealth Secretary Jeremy Hunt said 'no government' wanted to cut doctors' pay but changes must be made to increase weekend staffing levels\nThis is offset by plans to cut the number of hours on a weekend for which junior doctors can claim extra pay for unsocial hours.\nCurrently, 7pm to 7am Monday to Friday and the whole of Saturday and Sunday attract a premium rate of pay.\nUnder the Government's offer, junior doctors would receive time-and-a-half for any hours worked Monday to Sunday between 10pm and 7am, and time-and-a-third for any hours worked between 7pm and 10pm on Saturdays and 7am and 10pm on Sundays.\nWHAT THEY WERE OFFERED An 11 per cent rise in basic pay\nHigher rates for evenings and weekends – time and a half for 10pm to 7am, time and a third for Saturday evenings and Sundays\nSaturday day rate to remain the same rather than time and a half or a third\nIncentives for trainees in 'unpopular' careers such as general practice and A&E\nLimit of 72 working hours a week – down from 91 hours\nNo more than four night shifts in a row\nThe BMA has said there are still several areas of dispute, despite Mr Hunt saying the only sticking point is weekend pay.\nEngland's Chief Medical Officer, Dame Sally Davies, said on Sunday that the strike would 'lead to patients suffering'.\nJonathan Isaby, chief executive of the TaxPayers' Alliance, said: 'The BMA should call off this dangerous strike and return to the negotiating table before patients suffer, not least because they insist that patient safety is their paramount concern.'\nIn an interview over the weekend, Mr Hunt said the Government was going through the 'exhaustive process' of contacting every A&E department in the country to establish whether they would have enough staff to stay open.\nBut he admitted 'hospitals are stretched at the moment'.\nSpeaking last week, Roger Goss of the Patient Concern group said: 'Patients will be devastated to have their operations cancelled. They should not be made to be the 'piggy in the middle' of an argument that has nothing to do with them.\n'When you go into hospital for an operation, you have to build yourself up emotionally. You have to be prepared to go into hospital for something that – God forbid – you might only come out of in a box.\n'To have these operations cancelled at the last minute is a psychological blow for the thousands of people affected. It will leave them in pain, and suffering anxiety.'","url":"https://www.dailymail.co.uk/health/article-3393884/Don-t-strike-tomorrow-David-Cameron-urges-medics-Walkout-junior-doctors-damaging-cause-real-difficulties-patients.html"}
