{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:13:45","date_modify":"2018-10-22 20:13:45","date_publish":"2016-01-28 00:35:26","description":"The 66-year-old record producer showed support for his supermodel stepdaughters, Gigi and Bella Hadid and attended their Versace and Chanel fashion shows in Paris this week","filename":"data/vaneerConsumption/DavidFostergetssmoochfromGigiandBellaHadidatParisFashionShow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/23/30A5AE1900000578-0-image-a-4_1453938206721.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420128_Step-Love-David-Foster-gets-smooch-stepdaughters-Gigi-Bella-Hadid-shows-support-Paris-Fashion-Show_1540239225.html","title":"David Foster gets smooch from Gigi and Bella Hadid at Paris Fashion Show","title_page":"David Foster gets smooch from Gigi and Bella Hadid at Paris Fashion Show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His relationship with Yolanda Foster might be over.\nBut David Foster's love for stepdaughters Gigi and Bella Hadid remain as he showed support for the girls at a Chanel runway show during Paris Fashion Week.\n'Step-Love #theykilledit #paris #chanel,' the 66-year-old record producer wrote alongside a sweet snap of the beauties smooching their doting stepdad's cheeks.\nScroll down for video\n'Step-Love': David Foster, 66, showed support and gets a smooch from stepdaughters Gigi and Bella Hadid in sweet Instagram snap\nThe You're the Inspiration hit-maker shared the heartwarming photo on Wednesday as he attended the star-studded presentation.\nIt may be hard to believe but the 16-time Grammy Award-winner had never attended a fashion show until Sunday when he sat front row to watch Gigi Hadid, 20, rock the catwalk at Versace.\n'My first fashion show ever!!! Starting at the top with this one @gigihadid leading the pack!!! It was amazing and so was she!!! #proudstepdad,' he wrote of an Instagram picture.\nOn Tuesday it was off to the Chanel show where the supermodel sisters strutted their stuff at as part of Paris Haute Couture.\nSee more pictures of Gigi and Bella Hadid as they model at the Chanel show in Paris\nSupportive stepdad: He attended his first ever set of fashion shows and showed support for the girls at Chanel and Versace runway show during Paris Fashion Week\nFoster posted an image of Bella and gushed: 'this one @bellahadid came out of the gate like a race-horse!!!-so incredible!!! #proudstepdad - Looks to me like all the others are staring at her!!! :)'\nHis estranged wife did not attend the runway events but showed support to her two daughters, Gigi and Bella, 19, on Tuesday morning via social media.\n'Words are not enough to express how proud I am of my baby girls..... #DreamsDoComeTrue #HardWorkDoesPayOff,' she wrote.\nThe 52-year-old reality star likely stayed home as she continues her battle with Lyme disease, which she was diagnosed with back in 2012.\nFormer flames: David split from Yolanda Foster - who is mother to Gigi and Bella Hadid - as the couple released a joint statement last December and announced they had decided to end their four-year marriage\nOn December 1, David and Yolanda released a joint statement as they announced they had decided to end their four-year marriage.\n'Sadly we have decided to go our separate ways,' the couple told People magazine.\n'We've shared 9 beautiful and joyous years together. During that time we experienced love, friendship and the inevitable challenges that come with managing a marriage, careers, blended families and health issues.'\nAnd the statement concluded: 'We are grateful for the years we've spent together and believe wholeheartedly that we did our best.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420128/Step-Love-David-Foster-gets-smooch-stepdaughters-Gigi-Bella-Hadid-shows-support-Paris-Fashion-Show.html"}
