{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 00:13:20","date_modify":"2018-10-23 00:13:20","date_publish":"2016-01-11 09:13:27","description":"Today, Bowie's director said the album Blackstar - which he recorded while battling the terminal illness - was his 'parting gift' and that the avant-garde singer had made his death 'a work of art'.","filename":"data/vaneerConsumption/DavidBowiesLazarusvideoisapartinggifttohisdevastatedfans.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/30072D7900000578-0-image-a-26_1452507957775.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393599_Look-m-heaven-David-Bowie-s-haunting-lyrics-song-Lazarus-appear-farewell-thoughts-man-knew-dying_1540253600.html","title":"David Bowie's Lazarus video is a 'parting gift' to his devastated fans","title_page":"David Bowie's Lazarus video is a 'parting gift' to his devastated fans | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Bowie used the haunting lyrics of his swansong album to say goodbye to his fans following a secret 18-month battle with cancer.\nThe 69-year-old singer, who died yesterday, penned seven cryptic tracks for his latest album Blackstar which hinted at the terminal nature of his condition.\nPerhaps the most moving track on the record is Lazarus, which became posthumously poignant today as he told fans: 'Look up here, I'm in heaven.'\nJust three days before he died, the avant-garde artist had released the video for the song, which showed the singer trapped in a hospital bed, his frail body shaking beneath the covers and his eyes covered in bandages.\nToday, Bowie's producer suggested the artist knew for a year that his cancer was incurable, describing Blackstar as his 'parting gift'. He added that Bowie had made his death - as he did his life - 'a work of art'.\nScroll down for video\nThe poignant lyrics to David Bowie's final song reveal how the singer was preparing to say goodbye, as he tells fans: 'Look up here, I'm in heaven'. The video features Bowie trapped in a hospital bed\nLazarus, which was released last month, includes moving lyrics about having 'nothing left to lose' before the singer promises that he will be 'free like a bluebird'. The video (pictured) was released last week\nRelease: Bowie in the music video for his recent single Lazarus, recorded while he was suffering from cancer\nThe album, which was released just two days before he died, was Bowie's 25th album but the only one that has not featured his photo on the cover. Instead, it features a lone black star.\nIt has now charged into the top spot and could become Bowie's 10th chart-topping album, if it stays at number one until the charts are announced on Friday.\n'LOOK UP HERE, I'M IN HEAVEN': POIGNANT LYRICS OF BOWIE'S FINAL SONG LAZARUS Look up here, I'm in heaven I've got scars that can't be seen I've got drama, can't be stolen Everybody knows me now Look up here, man, I'm in danger I've got nothing left to lose I'm so high it makes my brain whirl Dropped my cell phone down below Ain't that just like me By the time I got to New York I was living like a king Then I used up all my money I was looking for your ass This way or no way You know, I'll be free Just like that bluebird Now ain't that just like me Oh I'll be free Just like that bluebird Oh I'll be free Ain't that just like me\nPaying tribute to the musician, Tony Visconti - who produced the star's music dating back to the 1960s - said: 'He always did what he wanted to do. And he wanted to do it his way and he wanted to do it the best way.\n'His death was no different from his life - a work of Art.\n'He made Blackstar for us, his parting gift. I knew for a year this was the way it would be. I wasn't, however, prepared for it.'\nHe added: 'He was an extraordinary man, full of love and life. He will always be with us. For now, it is appropriate to cry.'\nThe video for Lazarus - named after a biblical character who was raised from the dead four days after he died by Jesus - was released on Thursday and is full of haunting images alluding to death.\nThe bleak video begins with the singer - a blind man whose eyes are depicted as buttons - stepping out of a closet into a dark hospital where he becomes trapped in a feverish nightmare.\nThe haunting footage continues with him confined to a hospital bed, shrouded in darkness, as he vulnerably clutches onto his bed sheets and writhes around in a tortured fashion.\nAs Bowie levitates above the mattress, a hand then reaches out from under the bed - perhaps a symbol of being lifted towards heaven.\nAnother Bowie then appears - a stronger, freer version of the singer - and he starts dancing in the room.\nHe then retreats to a desk, where he manically pores over a notebook. As he continues to write frantically, a skull can be seen sitting on the desk - perhaps a sign of his impending death.\nThe song then reaches its climax and Bowie walks back to the wardrobe and shut the door behind him, seemingly bidding farewell for the final time.\nThe song was released on the Steve Lamacq show on BBC 6 Music on December 17.\nThe opening line reads: 'Look up here, I'm in heaven.'\nThe haunting footage continues with him confined to a hospital bed, his frail body wrapped in a blanket and his eyes - which are depicted by buttons - covered by a bandage\nAs he writhes around in a tortured fashion (left and right), levitating above the mattress, a hand reaches out from under the bed.\nHe then makes a veiled reference to his musical legacy transcending his death, singing: 'I've got scars that can't be seen. I've got drama, can't be stolen. Everybody knows me now.'\nAs the song ends, Bowie sings: 'This way or no way, you know, I'll be free. Just like that bluebird, Oh I'll be free.'\nHis death was no different from his life - a work of Art. He made Blackstar for us, his parting gift Tony Visconti\nThe track is a pseudo sequel to the 1976 film he starred in, The Man Who Fell To Earth, and is also the title track of the artist's off-Broadway musical Lazarus.\nThe video was made by Johan Renck, a Swedish director behind Breaking Bad and The Walking Dead. He also worked with Bowie on the video for Blackstar, the album's title track.\nIn Blackstar, Bowie once again features as the blind man but the ten-minute video opens with an eerie scene, in which a spaceman in a space suit is found lying lifelessly on the ground.\nSeveral observers have suggested the spaceman could be a throwback to Bowie's intergalactic back catalogue or a direct reference to Major Tom, who has featured heavily in Bowie's music.\nA young woman then walks up to him and lifts his helmet, revealing a skull laden with jewels, perhaps a symbol for death. There appear to be several further references to death throughout the film, including scenes showing crucifixes and burials.\nThe lyrics also allude to death, as he sings: 'Something happened on the day he dies. Spirit rose a metre and stepped aside.'\nIn a statement released last week, Mr Renck said: 'One could only dream about collaborating with a mind like that; let alone twice. Intuitive, playful, mysterious and profound.\nThe singer is then seen dancing in his room before manically poring over his journal, at a desk in the ward\nThe video begins with the singer stepping out of a closet into a dark hospital. He returns to the closet at the end\n'I have no desire to do any more videos knowing the process never ever gets as formidable and fulfilling as this was. I've basically touched the sun.'\nAsked about symbolism in November, Mr Renck told Vice: 'Most things like this are for the eyes of the beholder, you know? You make of it whatever you want.\nFANS RUSH TO BUY LATEST ALBUM Vinyl copies of David Bowie's final album are selling for up to £150 on eBay, as fans rush to get a copy of his last album. Blackstar CDs are also selling for five times their value on the site. The album, which is on the 'new and trending' list on HMV, has also sold out on its online shop. The Best of Bowie double CD, which was released in 2002, is also out of stock on Amazon and the online shop at WHSmith.\n'What I can say, on one side of things there is no deliberate, underlying, firm quest to have any references to past times.'\nThe rest of the album - which features just seven tracks - is also now seen as a reference to Bowie's own mortality.\nThe outro of the penultimate song of the album Dollar Days repeats: 'I'm dying to. I'm trying to,' as the music fades.\nOn the final track I Can't Give Everything Away, Bowie sings: 'I know something is very wrong, The pulse returns the prodigal sons, The blackout hearts, the flowered news, With skull designs upon my shoes.'\nFollowing news of his death, the Official Charts Company said the album was almost guaranteed to be in the number one spot at the end of the week.\nIt currently has combined sales of more than 43,000, which puts Bowie 25,000 ahead of his closest competitor, Elvis Presley.\nOfficial Charts Company chief executive Martin Talbot said: 'Today is an awful day for all lovers of music.\nIn Blackstar, Bowie once again features as the blind man (pictured). The dramatic video runs for ten minutes\nThe video, from the album's title track, opens with a dead spaceman wearing a space suit lying on the ground\nA woman then walks up to the spaceman and reveals a skull - a symbol for death - which is covered in jewels\nThere appear to be several references to death throughout the film, including crucifixes and burials\n'And the fact that David Bowie's new album Blackstar was on course for number one this week, even before today's terrible news, says everything about his continuing relevance - over 40 years since his first hit records.\n'We are expecting a huge surge for a wide range of Bowie albums in this week's Official Albums Chart. Bowie made so many great albums, constantly reinventing himself, that everyone has their own favourites and fans are clearly reminding themselves of his massive contribution to popular music by buying these great, iconic works.'\nBowie first entered the charts in July 1969 with his track Space Oddity, and scored 25 top 10 singles and 29 top 10 albums across his career.\nSeveral of his songs are expected to re-enter the singles chart this week as fans pay tribute to the singer.\nMusical genius David Bowie has died after an 18-month battle with cancer. His death was announced today\nLast picture: Bowie attended the premiere of the musical Lazarus, based on his songs, in New York last month (left). He enjoyed a glittering career spanning six decades that saw him become one of the biggest recording artists of all time\nSadness: Bowie's son Duncan Jones confirmed the news and posted a touching photograph of himself with his father","url":"https://www.dailymail.co.uk/news/article-3393599/Look-m-heaven-David-Bowie-s-haunting-lyrics-song-Lazarus-appear-farewell-thoughts-man-knew-dying.html"}
