{"authors":["Gabe Bergado"],"date_download":"2018-10-30 23:30:10","date_modify":"2018-10-30 23:30:10","date_publish":"2014-08-13 17:48:23","description":"Finally, there's a documentary about fangirls. Some beasts are so legendary, so terrifying, that tales and myths about their being are only whispered about around campfires and posted about on the depths of Reddit. These mysterious creatures are…","filename":"data/vaneerConsumption/DavidAttenboroughObservesFangirlsTheMockumentaryRevealsJustHowVicioustheObsessedTeenCanBe.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3fa885c3-ca39-4b13-a040-c87dbd39b267.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35624-david-attenborough-observes-fangirls-the-mockumentary-reveals-just-how-vicious-the-obsessed-teen-can-be_1540942210.html","title":"David Attenborough Observes Fangirls: The Mockumentary Reveals Just How Vicious the Obsessed Teen Can Be","title_page":"David Attenborough Observes Fangirls: The Mockumentary Reveals Just How Vicious the Obsessed Teen Can Be","title_rss":"NULL","source_domain":"bustle.com","text":"Finally, there's a documentary about fangirls. Some beasts are so legendary, so terrifying, that tales and myths about their being are only whispered about around campfires and posted about on the depths of Reddit. These mysterious creatures are often rooted in rumor, their true existence even questioned. Only if they're significant enough will a documentary chronicling their history is made. The Loch Ness monster, Bigfoot, and Mothman all have films on the quest for truth. But now, it is the fangirl's chance in the spotlight.\nIn a hilarious video from YouTube user Ali Jardz, the fangirl has become David Attenborough's latest subject. In actuality, it's just a fun video mashing together an Attenborough narration and footage from London's 2014 Summer in the City YouTube festival. But at first glance, this documentary could totally be a real thing. Fangirls are one of the strongest forces on this planet at the moment. You don't want to piss off any fandom on Tumblr, especially the hordes of Doctor Who and One Direction fangirls. If you test their tempers, you'll face a flurry of hate mail and public heckling. One scene from the trailer even has a savage pack of the predators on the attack when a male prey enters the room.\nCheck out just how vicious fangirls can be in the video below. Between the braces, not so subtle dye jobs, and ear-piercing shrieks, they're definitely rank as terrifying as the Loch Ness monster.\nAli Jardz on YouTube\nImages: Ali Jardz/YouTube","url":"https://www.bustle.com/articles/35624-david-attenborough-observes-fangirls-the-mockumentary-reveals-just-how-vicious-the-obsessed-teen-can-be"}
