{"authors":[],"date_download":"2018-10-30 20:58:27","date_modify":"2018-10-30 20:58:27","date_publish":"2014-05-04 04:00:00","description":"In his bid for the U.S. Senate, David Perdue portrays himself as a Fortune 500 CEO who helped grow some of America’s most recognizable companies.","filename":"data/vaneerConsumption/DavidPerduesbusinessrecordmixed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/05/04/Images/photos.medleyphoto.5196356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_david-perdue-business-record-mixed__1540933107.html","title":"David Perdue’s business record mixed","title_page":"David Perdue’s business record mixed","title_rss":"NULL","source_domain":"ajc.com","text":"In his bid for the U.S. Senate, David Perdue portrays himself as a Fortune 500 CEO who helped grow some of America’s most recognizable companies.\nBut the Republican’s track record as a corporate turnaround wizard has hit a few rough patches.\nA review of court and investor records by The Atlanta Journal-Constitution shows one company Perdue led went under soon after he departed. Another paid out $42 million in to settle lawsuits alleging Perdue lined his own pockets as part of a leveraged buyout deal, shortchanging shareholders.\n» More Georgia politics and government coverage\nWhile the other major candidates running in the crowded GOP field to replace U.S. Sen. Saxby Chambliss all have lengthy records as elected officials, Perdue’s own resume has been cloaked in the relative privacy of the business world.\nOn the campaign trail, Perdue talks up his business experience saying it’s sorely needed in the Senate to spur the economy, create jobs and tackle tax issues.\n“I’ve spent my career running toward burning buildings.” Perdue told The AJC. “I’ve taken risks. They haven’t all been five-star successes.”\nOne thing is clear: the private sector has made Perdue a wealthy man.\nTax returns reviewed by The AJC show that over 10 years Perdue earned $55 million and paid 38 percent of that, or $21 million, in taxes. A federal financial disclosure, which uses broad categories of wealth, estimated Perdue’s current worth at between $11 and $48 million.\nPerdue’s most visible venture into public service was in April 2010 when he was appointed by his cousin, then-Gov. Sonny Perdue, to a seat on the powerful board of the Georgia Ports Authority.\nRecords show that for the three-plus years he served in the ports board, the businessman failed to file a required affidavit with the state ethics commission swearing he had taken no action on the board that would impact his private financial or business interests.\nPerdue filed the required paperwork last week after the AJC inquired about it. His campaign called the failure to do so earlier an oversight.\nPerdue entered the business world after graduating from Georgia Tech, starting off as a management consultant before moving into the corporate world.\nHe worked in Texas for clothing maker Haggar and went to Asia as a top executive with Sara Lee. But it was at athletic shoemaker Reebok where he first earned the title chief executive officer. Perdue joined the company in 1998 and worked his way up to CEO in 2001. During that time sales and revenue both grew.\nHe’s credited with revitalizing the company’s brand and helping it compete with behemoth Nike by signing on top athletes and musicians to hawk Reebok sneakers. Perdue took his leave when German shoemaker Adidas bought out Reebok.\nIn 2002, he took a gambit and signed on as new chief executive officer of Pillowtex, a troubled textile manufacturer based in Kannapolis, N.C. Perdue was brought in to grow the company, which was emerging from bankruptcy protection.\nIt didn’t end well. The company folded just a few months after Perdue departed.\nTax records reviewed by the AJC records show Perdue was paid $1.3 million in the same year Pillowtex went under, leaving thousands of workers jobless.\nMany of those workers made $11 or $12 an hour and lacked skills to find another decent-paying job, said Harris Raynor, Southeast regional director of the union that represented three-quarters of the company’s 8,000 workers.\nRaynor said Perdue lacked vision and called the company “fairly directionless” under his leadership.\n“The big thing is, here’s a man who is selling himself to the voters on his record as a businessman. He may have had success, but he doesn’t even mention Pillowtex,” Raynor said. “It’s like a pitcher only talking about the games he won. He fiddled while Rome burned. He did not lead.”\nBut Mike Harmon, who was chief financial officer under Perdue at Pillowtex, blamed a giant pension deficit — not Perdue — with Pillowtex’s demise.\n“I don’t blame David for the downfall,” Harmon said. “In my opinion, David got caught in a bit of a bad situation.”\nHarmon said the full extent of the pension shortfall — estimated at between $50 and $80 million — wasn’t fully known until after Perdue came aboard and the owners then made the decision to abandon the expansion plans they had hired him to implement.\nPerdue landed next at Dollar General, a family owned chain of discount stores. Perdue was the first person outside the Turner family to lead the Nashville-based company and it grew from 5,900 to 8,500 stores during his tenure. He helped engineer a leveraged buyout by KKR, a private equity giant. Tax records show Perdue took in $42 million from Dollar General in 2007 and 2008 after that deal. He had to pay a special “golden parachute” tax in 2008 on the money he was paid when the left the company.\nDollar General is performing well now. But the discount chain paid out $42 million in 2009 to settle several lawsuits alleging Perdue and other top executives earned big profits and gave stockholders $22 a share when it should have been worth more.\nPerdue’s campaign noted that 99 percent of stockholders OK’d the deal.\nWayne Hood, a financial analyst in Atlanta at BMO Capital Markets, says Perdue modernized Dollar General and freed up working capital.\n“I’d say he was an important cog in improving the financial outlook of the company,” Hood said.\nWhen he left Dollar General, Perdue did consulting work for firms in India, earning nearly more than $900,000 from the work in 2007 and 2008.\nAfter Sonny Perdue left the governor’s mansion, he and his cousin opened Perdue Partners in 2011. The company conducts business consulting and export services. A big piece of their business is in trucking. The Perdue camp said the company has done no business with the Georgia ports while David Perdue was on the board or afterward. An open records request filed with the Georgia Ports showed no activity with Perdue Partners.","url":"https://www.ajc.com/news/david-perdue-business-record-mixed/OqSkOGrbF33n6MmOCWqKZM/"}
