{"authors":["Sharnaz Shahid For Mailonline"],"date_download":"2018-10-22 21:55:27","date_modify":"2018-10-22 21:55:27","date_publish":"2016-01-28 09:30:09","description":"The couple put on a show of affection as they happily posed for several pictures at the premiere of FX's American Crime Story in Los Angeles, on Wednesday.","filename":"data/vaneerConsumption/DavidSchwimmerandwifeZoeBuckmanattendFXsAmericanCrimeStorypremiere.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A822D900000578-0-image-a-60_1453972679956.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420557_David-Schwimmer-looks-sharp-tailored-silver-suit-wife-Zoe-Buckman-steals-limelight-daring-thigh-high-slit-dress-FX-s-American-Crime-Story-premiere_1540245327.html","title":"David Schwimmer and wife Zoe Buckman attend FX's American Crime Story premiere","title_page":"David Schwimmer and wife Zoe Buckman attend FX's American Crime Story premiere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have been together for over eight years, so it’s no wonder David Schwimmer made sure he brought his wife Zoe Buckman to the premiere of his latest venture.\nStanding side by side, the couple put on a show of affection as they happily posed for several pictures at the premiere of FX's American Crime Story in Los Angeles, on Wednesday.\nThe 49-year-old actor cut a handsome figure in a tailored silver suit by Nigel Curtiss and a dark blue shirt, while his stunning wife stole the limelight in a daring animal-print gown.\nScroll down for video\nShe's his lobster! David Schwimmer and his wife Zoe Buckman posed for several pictures at the premiere of FX's American Crime Story in Los Angeles, on Wednesday\nThe sizzling ensemble, which featured full-length sleeves and a sexy thigh-high slit, drew heaps of attention to her slender limbs and statuesque frame.\nShe wore her golden-tinted tresses loose in tousled waves, while accentuating her striking complexion with smokey eyewear, bronzed cheeks and glossy lips.\nOther attendees at the special screening included John Travolta, Cuba Gooding Jr. and Selma Blair, who looked elegant in a white pleated gown.\nStylish duo: The 49-year-old actor cut a handsome figure in a tailored silver suit by Nigel Curtiss and a dark blue shirt, while his stunning wife stole the limelight in a daring animal-print gown\nDoing his thing: The Friends star - who plays defense lawyer Robert Kardashian in the new series - happily stopped to sign autographs for fans\nBig character: David plays attorney Robert Kardashian, who fathered Kim, Khloe, Kourtney and Robert Jr, in the upcoming TV mini-series American Crime Story\nStar-studded: he joined fellow actress Angela Bassett at the after-party\nThe new TV series centres around the OJ Simpson trial which took place from 1994 to 1995, and will see Cuba Gooding Jr. play the role of O.J. and Travolta as defense lawyer Robert Shapiro.\nFormer friends star David portrays defense lawyer Robert Kardashian and Selma his wife Kris, now known as Kris Jenner.\nProducer Nina recently teased in an interview with MTV News: 'For us, the O.J. story is so much more about race in America, the relationship between white police and a black community, the birth of a 24-hour news cycle, and of reality TV.\nTeam effort: Sarah Paulson and director John Singleton were also in attendance\nStellar line-up: Courtney B. Vance and Cuba Gooding Jr. appear in the series as well\nOld Hollywood glam: Selma Blair - who plays Kris Jenner in the series - looked elegant in a white pleated gown\nThe momager before reality TV: Selma Blair plays Kris Jenner\nScientologist couple: Also posing on the Westwood Village Theatre red carpet was Selma's co-star John Travolta alongside his wife of 24 years, Kelly Preston\nQuite a transformation: Travolta, left, had the looks and the nuances down as legal defender Robert Shapiro, right in 1994\n'The violence is very sobering, but it is very, very restrained, because the story is much more about the trial and the circumstances and the cultural response, two years after the L.A. riots, and how the city and the country and the world responded to these events.\n'It’s a very, very different show than American Horror Story, and very respectful of the people involved.'\nThe 10-episode true-crime anthology series American Crime Story: The People v. O.J. Simpson premieres February 2 on FX.\nComing soon: The 10-episode true-crime anthology series American Crime Story: The People v. O.J. Simpson premieres February 2 on FX","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420557/David-Schwimmer-looks-sharp-tailored-silver-suit-wife-Zoe-Buckman-steals-limelight-daring-thigh-high-slit-dress-FX-s-American-Crime-Story-premiere.html"}
