{"authors":["Lianna Brinded"],"date_download":"2018-10-30 23:03:55","date_modify":"2018-10-30 23:03:55","date_publish":"2016-12-09 00:00:00","description":"A transition deal would mean Britain would be eased into leaving the EU, instead of a sudden departure.","filename":"data/vaneerConsumption/DavidDavisagainstBrexittransitiondealtoeaseprocess.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_david-davis-against-brexit-transition-deal-to-ease-process-article-50-2016-12_1540940635.html","title":"David Davis against Brexit transition deal to ease process","title_page":"    David Davis against Brexit transition deal to ease process - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain's Secretary of State for Leave the EU David Davis. Reuters LONDON — Britain's chief Brexit negotiator poured water on hopes that the country will seek a transition deal in the event of a \"hard Brexit,\" according to details of a private meeting between the UK and the City of London Corporation.\nThe Financial Times reported that David Davis, the Secretary of State for Leaving the EU, is \"not really interested\" in a transition deal that could keep Britain in the single market for at least a couple of years.\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation on when the new prime minister, Theresa May, will trigger Article 50 and start the official two-year negotiation process for Britain to leave the EU. March 2017 is the current target date.\nMay said she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.\nWith this in mind, the Bank of England governor Mark Carney floated the idea for a transitional period to phase in any Brexit deal agreed.\nThis is because a transitional deal could maintain the UK's single market status until at least 2021, if Article 50 is triggered next year as planned. Even the Irish Prime Minister Enda Kenny told Sky News last month that a transitional deal between the UK and EU would be \"inevitable.\"\nKenny said: \"I think it will be impossible to do the negotiations within the contemplated two-year period. That's why I think there's a growing feeling in Europe that there should be a transition period, and that the transition period will be longer than those two years - I think it will be.\"\nA transition deal is important to the City because it would help financial services firms continue to do business in light of a lack of a trade deal and the loss of passporting rights— all of which are entirely plausible risks in the event of a \"hard Brexit.\"\nThe loss of passporting rights following Brexit is one of the biggest fear's in the City of London. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues. Around 5,500 firms registered in the UK rely on the European Union's passporting rights for the financial services sector, and they turn over about £9 billion in revenue.\nThe relationship between Britain's Brexit ministers and the EU have already hit a low, after Boris Johnson and David Davis were branded arrogant and clueless by officials with exit talks on the horizon.\nIn a particularly damning statement, EU parliamentarian Manfred Weber described Boris Johnson as \"unbelievable.\" One senior EU official source told the FT that the that \"there is a denial of reality in London.\"\nAnother apparently said \"I'm fed up with British politicians . . . they have no clue.\"\nTo read the full FT story, click here.","url":"https://www.businessinsider.com/david-davis-against-brexit-transition-deal-to-ease-process-article-50-2016-12"}
