{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 01:55:07","date_modify":"2018-10-23 01:55:07","date_publish":"2017-03-16 12:08:17","description":"A 2001 Ferrari 360 Spider once owned by former Manchester United and England footballer David Beckham is to go up for auction later this month and could fetch up to £95,000.","filename":"data/vaneerConsumption/DavidBeckhamsoldFerrariSpidertogoonsale.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53CF6500000578-0-image-a-87_1489665286451.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319834_David-Beckham-s-old-Ferrari-Spider-sale_1540259707.html","title":"David Beckham's old Ferrari Spider to go on sale","title_page":"David Beckham's old Ferrari Spider to go on sale | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A sports car once owned by David Beckham is going up for sale alongside a fleet of Ferraris and could fetch as much as £95,000.\nThe former Manchester United and England star owned the 2001 360 Spider up until 2003 when he left the England in a big money move to Real Madrid.\nHe kitted the motor out with an F1-style gearbox, carbon fibre backed racing seats, tinted windows and custom bodywork.\nDuring his ownership the black motor sported custom number plate 'D7 DVB' and the racy modifications complemented the vehicle's already impressive specifications.\nA 2001 Ferrari 360 Spider once owned by former England football captain David Beckham, pictured with the vehicle in 2002, is to go on sale at auction alongside a fleet of supercars, and is expected to fetch £95,000. It is believed Beckham paid more than £120,000 for the vehicle, which he sold in 2003 before leaving England for Real Madrid in a big money move\nThe Ferrari, pictured being driven by the former Manchester United midfielder, was kitted out by Beckham with an F1-style gearbox, carbon fibre backed racing seats, tinted windows and custom bodywork. According to auctioneers H&H Classics, it has run up just 7,600 miles during its lifespan\nThe Spider, pictured, also had a customised number plate installed by Beckham reading 'D7 DVB' - which the auctioneers realised was proof of the footballer's past ownership. The vehicle, which has a 3.6litre V8 engine, can reach 0-60mph in just 4.2 seconds and has a top speed of 180mph\nIts 3.6 litre V8 engine propels the Ferrari from 0-60mph in just 4.2 seconds and a top speed of 180mph.\nHaving run up only 7,800 miles, it is expected to fetch £95,000 when it goes under the hammer - a third cheaper than what Beckham would have paid.\nAs well as this model the former England captain has also owned an F430 and F550 from the Italian brand.\nIn 2005 he famously turned down the offer of a free motor from Ferrari chairman Luca di Montezemolo because he already had one.\nBeckham's collection has also included the likes of Lamborghini, Bentley, Aston Martin and Porsche.\nHis former Ferrari Spider is being sold by auctioneers H&H Classics, which is offering 10 other Ferraris at the same auction.\nThe fleet's combined worth is a whopping £2.2million.\nThe Spider is going up for sale alongside 10 other Ferraris at the Imperial War Museum in Duxford, Cambridgeshire, on March 29. Pictured is a 1995 Ferrari 512 M that is expected to be sold for around £190,000\nFerrari is celebrating its 70th anniversary this year, with the auctioneers expecting an increase in demand for the classic brand as a result. Pictured is an 'exceptionally rare' 1964 330GT Nembo Spider, valued at £500,000, that will be part of the auction later this month\nThis 1965 Ferrari 330 GT, pictured, is expected to fetch as much as £240,000 at the auction on March 29. The combined worth of the fleet is around £2.2million, with the auctioneers describing them as 'each having their own magic'\nOne of the cheaper vehicles going on sale is this 1984 Ferrari 308 GTS QV, valued at around £60,000, although it is very much expected to attract interest from collectors\nDamian Jones, of H&H Classics, said: 'A celebrity connection always adds an element of intrigue to a sale, especially when it's someone so iconic as David Beckham.\n'It's difficult to say quite how much difference, or in fact value, it adds but it's undoubtedly interesting.\n'In the past such links have literally increased a car's value by ten times.\n'We know it belonged to Beckham because a check showed it having worn the private number plate that he was known to own.\n'This 360 is a lovely example and in very good condition with amazingly low mileage.'\nHe added: 'This sale provides eleven opportunities to buy and own a fabulous Ferrari in the year that the fabled Italian marque celebrates its 70th anniversary.\n'Each has its own magic and the collection encompasses everything from a 'garage find' through to exhibition standard motors.'\nThis 1992 Ferrari 348 TS is valued at around £40,000 and will make up part of the impressive fleet of vehicles on sale at the Imperial War Museum\nWith a design straight out of the 1980s, this 1981 Ferrari Mondial 8 is another of the cheaper models, expected to sell for around £35,000\nAt the other end of the scale, this 1995 Ferrari 512, pictured, could fetch as much as £155,000, even though the model was labelled one of the 'worst designs of all time' in press reports at the time\nAside from Beckham's Ferrari the pick of the bunch is a 250GT PF Coupe re-bodied as a LWB California Spyder, estimated to fetch £800,000.\nThere is also an exceptionally rare 1964 330GT Nembo Spider, valued at £500,000.\nInterestingly its late owner, racing driver and car dealer Richard Allen, left it to the East Anglian Air Ambulance Service when he died last year.\nCompleting the collection is a 1965 330 GT, 1981 Mondial 8, a 1982 Mondial 8, 1984 Ferrari 308, a 1992 Ferrari 348, a 1993 Ferarri 512, a 1995 Ferrari 512 and another 2001 360 Spider.\nThey will be sold from the Imperial War Museum in Duxford, Cambridgeshire, on March 29.\nThe vehicle expected to be the most expensive in the fleet, and the one described as the 'pick of the bunch' by the auctioneers is this 1958 Ferrari 250GT PF Coupe, re-bodied as a LWB California Spyder, pictured, valued at £800,000\nAnother Spider model, the Ferrari 360 Spider F1, pictured, in the firm's classic red design, is likely to sell for £75,000","url":"https://www.dailymail.co.uk/news/article-4319834/David-Beckham-s-old-Ferrari-Spider-sale.html"}
