{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 03:45:38","date_modify":"2018-10-23 03:45:38","date_publish":"2016-01-11 16:44:27","description":"The Prime Minister has sent a memo to all of his ministers spelling out the details of his decision to suspend collective cabinet responsibility for the duration of the referendum.","filename":"data/vaneerConsumption/DavidCameronmakespleatohisministersoverBritainsEUmembership.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300A207E00000578-0-image-a-24_1452530598137.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394222_David-Cameron-makes-extraordinary-plea-ministers-remember-run-country-fight-bitter-battle-Britain-s-EU-membership-summer_1540266338.html","title":"David Cameron makes plea to his ministers over Britain's EU membership","title_page":"David Cameron makes plea to his ministers over Britain's EU membership | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron has set out the rules of engagement for ministers in the EU referendum and pleaded for them to remember to keep running the country during the historic poll.\nThe Prime Minister has sent an extraordinary memo to all of his ministers spelling out the details of his decision to suspend collective cabinet responsibility for the duration of the referendum.\nAhead of a campaign expected to see bitter divisions with the Tory Party, Mr Cameron urged his colleagues to remain 'despite differences on this one issue, a united, harmonious, mutually respectful team'.\nScroll down for video\nDavid Cameron, pictured today, at a major speech, has pleaded with his ministers to maintain harmony on other issues while they fight the referendum\nMr Cameron has already come under fire for the rules surrounding his decision as avowed eurosceptics are barred from making their case until the renegotiation is complete.\nBut ministers in favour of staying in are taking advantage of the current policy - to support work towards a 'successful' renegotiation with the hope of recommending Britain stays in - to make the case to stay within the European Union.\nMr Cameron has repeatedly said he 'rules nothing out' but is expected to lead the fight to keep Britain in Europe.\nSeveral cabinet ministers, including work and pensions secretary Iain Duncan Smith, Northern Ireland secretary Theresa Villiers and Commons leader Chris Grayling are thought highly likely to join the Out campaign regardless of what Mr Cameron brings back from Brussels.\nIn his memo, Mr Cameron said he hoped the rules would 'provide the right framework for a fair and balanced debate' during the campaign - which is expected to conclude with the historic referendum as soon as June.\nHe said the cabinet would discuss the rules after the renegotiation was finished, which Mr Cameron hopes to achieve at February's EU summit.\nMinisters are all under orders to support current policy until that meeting.\nAfter this, Mr Cameron said a 'wholly exceptional' policy will come into force whereby ministers are allowed to disagree with the Prime Minister on the referendum.\nThe Government is due to make a firm recommendation one way or other following Mr Cameron's talks, which are focussed on four areas with a key sticking point relating to migrant benefits.\nMr Cameron said 'common sense' would extend to ministers speaking at the Commons despatch box, where they are always expected to stick to Government policy.\nThe rules will not apply to wider EU policy, Mr Cameron said, and on all other areas cabinet collective responsibility will continue to apply.\nCivil servants will not be allowed to help ministers disagreeing with the government line but they will keep access to their special advisers, Mr Cameron said.\nWork and pensions secretary Iain Duncan Smith, left, and Commons leader Chris Grayling, right, are among those expected to campaign against Mr Cameron in the referendum\nHe concluded: 'It will be very important during this period for ministers on both sides of the debate to treat each other with appropriate respect and courtesy.\n'We all recognise the UK's membership of the EU is an issue on which some colleagues have long standing, deeply held positions of conviction - hence my decision to set aside, on a highly exceptional basis the normal rules of collective responsibility.'\nYesterday, Matthew Elliott, chief executive of the Vote Leave campaign, said: ‘Cameron has never asked for serious changes from the EU – he gave up before he started.\nHe’s asked for trivia and he’ll get everything he’s asked for. It’s spin and nobody should believe him.\n‘If you want British laws to be made by people you can vote out, the only way is to Vote Leave and take back control.’\nProminent Eurosceptic David Davis, a former Tory leadership candidate, told the BBC’s Sunday Politics: ‘He [Mr Cameron] said there’s no plans for Brexit.\n‘Now, this is actually disgraceful. Because you know, you’ve got two moderately likely outcomes, we don’t know which it will be.\n‘There are no plans for Brexit and that’s really, really serious, because it’s a very complicated operation to carry out, if it happens.’\nIn an interview on the BBC’s Andrew Marr Show, Mr Cameron insisted that it was right to stop Eurosceptic ministers such as Work and Pensions Secretary Iain Duncan Smith speaking out before the result of the renegotiation is known.","url":"https://www.dailymail.co.uk/news/article-3394222/David-Cameron-makes-extraordinary-plea-ministers-remember-run-country-fight-bitter-battle-Britain-s-EU-membership-summer.html"}
