{"authors":["Matt Dathan","Mailonline Political Correspondent"],"date_download":"2018-10-23 00:08:43","date_modify":"2018-10-23 00:08:43","date_publish":"2016-01-28 13:50:01","description":"PM also announced a £2million fund to fix the Lake District's bridges, walls and paths but Labour and the Lib Dems dismissed the funding package as 'a drop in the ocean'.","filename":"data/vaneerConsumption/DavidCameronpledges1millionPRcampaigntopromotenorthernEngland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB0ECD00000578-0-image-a-62_1453993214890.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420919_David-Cameron-pledges-1million-PR-campaign-promote-northern-England_1540253323.html","title":"David Cameron pledges £1million PR campaign to promote northern England","title_page":"David Cameron pledges £1million PR campaign  to promote northern England | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Damage to Cumbria estimated at £500m and £20m in Lake District alone\nPM has pledged £2million to repair hundreds of bridges and paths damaged by the floods\nFamilies are being encouraged to spend their Easter holidays in the north of England with a £1million PR campaign launched by David Cameron today.\nIt is part of the Government's efforts to rebuild the tourism industry across large parts of northern England that were hit by devastating floods over the Christmas period.\nA further £2million will be spent on fixing the Lake District's 1,400 bridges and 2,000 miles of path and 180 apprentices will be employed to help with the repairs.\nBut Kerry McCarthy, Labour's shadow environment secretary, told MailOnline that the funding package was 'a drop in the ocean' and again appealed to the Prime Minister to apply for disaster relief aid from the EU's Solidarity Fund.\nAnd Stewart Young, the leader of Cumbria Council, said the money pledged was 'nowhere near enough' to get the county back on its feet, while Lib Dem leader and Cumbria MP Tim Farron dismissed the funding package as 'woefully inadequate'.\nThe overall cost of the floods that hit parts of northern England, Scotland and Northern Ireland over the Christmas period have been estimated at more than £5billion by insurance experts.\nThe Prime Minister will visit parts of flood-hit Cumbria and Lancashire today to kick-start the campaign, coordinated by VisitEngland, urging British families to book their spring breaks in the north.\n'From York Minster to Honister Mine, Carlisle Castle to the Leeds Armories, the North has some of the most iconic tourist attractions the UK has to offer,' Mr Cameron said ahead of his visit.\n'So it is absolutely right that we do everything we can to make sure these businesses feel supported and ready to receive visitors.\n'The measures we've announced today are an important step, showcasing the best the region's tourist industry has to offer while helping one of its key attractions in the Lake District National Park get back on its feet.'\nScroll down for video\nThe 300-year-old bridge in Tadcaster, North Yorkshire, pictured, crumbled in a surge of water during the flooding that devastated the county over the Christmas period\nThe overall cost of the floods that hit parts of northern England, Scotland and Northern Ireland over the Christmas period is estimated to reach £5billion. Cameron, pictured speaking to local children from Grasser Primary School in Grasmere, launched a PR campaign to promote the north today\nMr Young said the funds represented just a tenth of the estimated £20million cost of damage in the Lake District and demanded an urgent face-to-face meeting with ministers to discuss a more substantial amount of money for the region.\n'This money is nowhere near enough to get Cumbria back on its feet following the floods,' Mr Young said.\n'With an estimated £500 million of damage to our infrastructure, including £20 million in the Lake District National Park alone, today's funding announcement is totally inadequate.'\nMs McCarthy said: 'All resources are welcome for communities devastated by the floods but with flood damage in the county estimated at in excess of half a billion pounds, this is but a drop in the ocean.\nWith flood damage in the county estimated at in excess of half a billion pounds, this is but a drop in the ocean Kerry McCarthy, Shadow Environment Secretary\n'With water levels rising again and more homes and businesses at risk, communities devastated by the floods feel let down by David Cameron.\nUrging Mr Cameron to apply for funds from the EU's insurance fund, she added: 'Up to £23 million more could be made available immediately to British homes and businesses devastated by the floods through an EU insurance fund, with millions more available in further payouts.\n'But despite the fact it will cost the Government nothing, Ministers have so far refused to make a claim, even though we have paid in some £300 million since the fund was set up.\n'With only a 12 week window to apply, time is running out.'\nStewart Young, the leader of Cumbria Council said the funding package announced by Cameron today was 'nowhere near enough to get Cumbria back on its feet' and demanded a face-to-face meeting with ministers\nCameron visited flood-hit areas in Cumbria and Lancaster today. Above, he is pictured visiting volunteers in York at the end of December\nFlooding in December caused long-term damage to the Lake District's 2,000 miles of paths. Above, a tree is submerged in Ullswater, Glenridding\nCulture Secretary John Whittingdale said the PR campaign promoting northern England will 'showcase the many fantastic places that are ready to welcome visitors in the coming weeks and months'.\nThe Government's announcement came as a new poll found that the majority of people are critical of the Government's handling of the floods this winter and want ministers to do more to prevent future flooding, a survey has found.\nAlmost two-thirds thought the Government had handled the flooding very or fairly badly - including two-fifths of Conservative voters quizzed in the poll for Greenpeace.","url":"https://www.dailymail.co.uk/news/article-3420919/David-Cameron-pledges-1million-PR-campaign-promote-northern-England.html"}
