{"authors":["Kate Ferguson","Political Correspondent For Mailonline"],"date_download":"2018-10-23 02:22:19","date_modify":"2018-10-23 02:22:19","date_publish":"2017-04-26 13:23:33","description":"David Cameron used a speech in Bangkok to back calls for Britain to pay more money into the EU's coffers.","filename":"data/vaneerConsumption/DavidCameronsaysUKshouldsettleBrexitdivorcebill.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9EA95E00000578-0-image-a-32_1493209369285.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447476_David-Cameron-takes-aim-Donald-Trump-speech_1540261339.html","title":"David Cameron says UK should settle Brexit divorce bill","title_page":"David Cameron says UK should settle Brexit divorce bill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron today risked enraging his Tory party colleagues by saying Britain should settle the terms of its Brexit 'divorce bill' before trade talks can start.\nThe former PM made the intervention just hours before Theresa May has her first face-to-face meeting with the bloc's chief negotiator, Michel Barnier.\nMr Barnier has warned that the UK must 'settle the accounts' amid threats that Brussels could demand £50bn exit fee from Britain.\nThe pair will meet alongside European Commission president Jean-Claude Juncker at Downing Street this evening.\nDavid Cameron took aim at Donald Trump as he delivered the speech at the global summit\nBut in a move which risks weakening Mrs May ahead of the talks, Mr Cameron backed calls from Brussels for Britain to agree payments into the EU's coffers.\nSpeaking at the World Travel and Tourism Council's global summit in Bangkok, he said: 'I would hope that we will be able to agree, as it were, the first bits of divorce - it's a bit like a divorce, you have to deal with the money and then access to the children afterwards.'\nThe former prime minister said he thought both sides could agree that 'of course we accept some liabilities for this membership we've had for 40 years, just as we have a claim on some of the assets that we've paid into.\nTheresa May, pictured today outside No 10, is hosting Michel Barnier and Jean-Claude Juncker at Downing Street for talks tonight\n'And I think we can settle the principles of that and then get on with the nature of the relationship.'\nMr Cameron told MailOnline later that 'principles' did not mean paying in full.\n'I am absolutely not saying the UK needs to pay up before trade talks begin,' he said.\nMr Barnier has taken a hard-line stance towards Britain's departure from the European Union.\nHe has said: 'When a country leaves the union, there is no punishment. There is no price to pay to leave, but we must settle the accounts.\n'No more, no less. We will not ask the British to pay a single euro for something they have not agreed to as a member.”\nMr Cameron - who backed remain in the referendum and quit after losing the historic vote - also used the appearance to take aim at Britain's ally Donald Trump, whose state visit to Britain is expected to take place this autumn.\nHe hit out at Mr Trump's attempts to ban people from six mainly Muslim countries from travelling to the US, warning that this played into the hands of extremists.\nFederal judges blocked the ban and the president's revised executive order, issued in March, to temporarily close US borders to refugees and nationals from six Muslim-majority countries.\nMr Cameron said the ban alienated Muslim moderates and allies.\nHe said that violent Islamism is 'the biggest threat to our world' but that leaders should not promote policies that embolden extremists.\nHe said: 'That was my biggest problem with the Trump travel ban.'\nThe former PM said that 'labelling whole countries as extreme and dangerous because they were predominantly Islamic' encourages a negative view that the western world is in a clash of civilisations with Islam.\nHe said that trying to ban people from key western allies like Iraq, which is bearing the brunt of fighting with terror group IS was 'not the action of a friend'.\n'I thought it (the ban) was misconceived from the outset,' he said.\nThe former Prime Minister has embarked on the lucrative career since leaving No 10 last June - raking in as much as £120,000 for a one-hour speech.\nIt is unclear how much Mr Cameron may have been paid for the speech, but it comes after he has been raking in cash delivering talks drawing on his time in Downing Street.\nMr Cameron and his close chum and former chancellor George Osborne - pictured together in the Commons - have earned hundreds of thousands of pounds for their speeches\nIn February he was paid around £100,000 for a speech to American bank Morgan Stanley - earning in just a few hours almost as much as the £143,462 he was paid in a whole year as PM.\nHis close friend and fellow millionaire George Osborne has also been making eye-watering sums on the speech circuit since he was booted out of government last year.\nThe former chancellor made than £187,000 for just four speeches in the month of November alone.\nMr Osborne was pilloried after taking on six jobs - including advising city investment giant BlackRock and being made editor of the London Evening Standard.\nHe has since announced he is standing down as MP for Tatton at the forthcoming General Election.","url":"https://www.dailymail.co.uk/news/article-4447476/David-Cameron-takes-aim-Donald-Trump-speech.html"}
