{"authors":["Press Association"],"date_download":"2018-10-23 04:00:45","date_modify":"2018-10-23 04:00:45","date_publish":"2016-01-28 19:47:01","description":"The UK Government is making £20 million of cash available for surveys in the North Sea in a bid to aid the struggling oil and gas sector. Prime Minister Davi...","filename":"data/vaneerConsumption/Davidcameronannounces20moffundingtoboostnorthseaindustry.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-6ab4b472-60a3-4fbf-8e05-27cbd94d8e93-4PuZeKVXE7cd9005b2c8760dfca1-912_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420170_Deal-provides-250m-funding-boost-north-east-Scotland_1540267245.html","title":"David cameron announces £20m of funding to boost north sea industry","title_page":"David cameron announces £20m of funding to boost north sea industry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron announces £20m of funding to boost North Sea industry\nThe UK Government is making £20 million of cash available for surveys in the North Sea in a bid to aid the struggling oil and gas sector.\nPrime Minister David Cameron announced the funding as he visited Aberdeen to hear from industry leaders about the challenges it is facing.\nPlummeting oil prices have resulted in thousands of job losses, but now the UK Government hopes the funding for seismic surveys will help uncover new oil reserves, with the data that is uncovered to be made publicly available.\nThe UK Government hopes its funding for seismic surveys will help uncover new oil reserves\nA total of £1 million of the fund will then be awarded to innovative uses of the data to help unlock new fields.\nIn addition, an oil and gas ambassador will be appointed to promote the North Sea around the world and boost inward investment.\nUK Energy Secretary Amber Rudd said the measures show \"the UK Government is backing our oil and gas industry, the hard-working people it employs and the families it supports.\"\nShe also welcomed news that Total is to drill a new exploration well later this year to the east of the Shetland Islands, saying: \" This shows the North Sea is open for business and this Government is clear that the broad shoulders of the UK are firmly behind it.\"\nTo promote new opportunities in the sector, the Oil and Gas Authority will publish a decommissioning plan for the UK Continental Shelf by early summer, which ministers hope will help Aberdeen become a centre of expertise and ensure UK firms can capitalise on this future source of income.\nThe Government is also setting out its own strategy to maximise the amount of oil and gas that can be extracted from the North Sea.\nMs Rudd said: \"We're stepping in to provide the extra support needed now with £20 million of funding for seismic exploration to help industry find new oil and gas reserves.\n\"But we're also determined to build a bridge to the future and make sure the expertise we hold in areas such as decommissioning can become a UK success story, boosting our economy, supporting jobs and creating more financial security for families.\"\nThe assistance was announced on the same day as the UK and Scottish governments signed a city deal for Aberdeen and the surrounding area, which includes plans for innovation in the oil and gas industry.\nBoth administrations contribute £125 million to the fund, although the Scottish Government has also pledged a further £254 million to improve infrastructure in the area.","url":"https://www.dailymail.co.uk/wires/pa/article-3420170/Deal-provides-250m-funding-boost-north-east-Scotland.html"}
