{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 03:38:49","date_modify":"2018-10-23 03:38:49","date_publish":"2016-01-11 16:25:47","description":"Duncan Jones, known as Zowie Bowie, confirmed today that his father had died, telling fans: 'It's true.' He posted it underneath a touching picture of him being carried by Bowie as a toddler,","filename":"data/vaneerConsumption/DavidBowiessonDuncanstributetohisHeroessingerfatherrevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300D138900000578-0-image-a-2_1452531381759.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394154_David-Bowie-s-son-Duncan-s-touching-tribute-Heroes-singer-father-loved-fans-world_1540265929.html","title":"David Bowie’s son Duncan’s tribute to his Heroes singer father revealed","title_page":"David Bowie’s son Duncan’s tribute to his Heroes singer father revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Bowie's son today posted a moving photo of him sat on his father's shoulders as he broke the news of the rock star's death.\nDuncan Jones, known as Zowie Bowie, confirmed this morning that his father had died, telling fans: 'It's true.'\nUnderneath a touching picture of him being carried by Bowie as a toddler, he wrote: 'Very sorry and sad to say it's true. I'll be offline for a while. Love to all.'\nDavid Bowie's son today posted a moving photo of him sat on his father's shoulders as he broke the news of the rock star's death\nHis father's death from cancer comes two years after his wife beat the same disease.\nRodene Ronquillo, a photographer, underwent chemotherapy and a double mastectomy after being diagnosed with breast cancer in 2012.\nDuncan, who is based in Los Angeles, found the lump on his wife's breast while they were together in bed. It was later diagnosed as Stage Two breast cancer.\nThe 44-year-old told how, just hours after his wife was diagnosed, he rushed to the court house to marry her.\nHe later shaved his head in support, before posting a statement encouraging people to check themselves for cancer.\nHe tweeted: 'I love my wife more than anyone. She's young as can be. Women are getting breast cancer younger & younger. Women? check yourselves! ..& men?'\nZowie, the only son of Bowie and his first wife Angie (pictured right in 1974), enjoyed an incredibly close relationship with his father (pictured together left)\nZowie, the only son of Bowie and his first wife Angie, was christened Duncan Zowie Haywood Jones. Zowie was a corruption of the girls' name Zoe, the Greek word for life, and it was how he was known throughout his childhood.\nHis father wrote the song Kooks for him and it appeared on the album Hunky Dory. It contained the line: 'If you stay with us, you're gonna be pretty kooky too.'\nAfter Bowie split from Angie in 1980 following ten years of marriage, Bowie was given custody of Duncan, who was aged nine at the time.\nThe pair went on to have an incredibly close relationship. Duncan was his father's best man when he married his step-mother Iman Abdulmajid in 1992.\nHe later attended Gordonstoun, the harsh Scottish boarding school attended by Prince Charles, where he became known as Joey or Joe.\nWhen he was 18, he started being known as Duncan and became a successful film director, whose works include 2009's Moon and Source Code, starring Jake Gyllenhaal, from 2011.\nDuncan was his father's best man when he married his step-mother Iman Abdulmajid in 1992. He is pictured four years later during a concert in Vienna, Austria\nDuncan's mother, currently a contestant in Celebrity Big Brother, recently claimed Bowie had stopped her seeing her son.\nSpeaking to US TV personality David Gest on the show, Angie said: 'No, I don't see [Duncan] at all, he doesn't like me. But my daughter likes me. I guess David told him not to [talk to me]. It does seem odd.'\nBowie became a father for the second time in 2000, when wife Iman gave birth to their daughter Alexandria 'Lexi' Zahra Jones.\nYesterday, Iman posted a moving message on social media saying: 'The struggle is real, but so is God,' along with the caption 'Rise'.\nOther cryptic tweets posted by Iman over the weekend included the message: 'Sometimes you will never know the true value of a moment until it becomes a memory.'\nThe singer's biographer Paul Trynka said the decade between his 23rd album Reality in 2003 and The Next Day in 2013 gave Bowie time to be 'a family man'.\n'He walked Lexi [his daughter] to school every day – something he had missed with Duncan [his son] which was something he deeply regretted,' he said.\nLast picture: Bowie attended the premiere of the musical Lazarus, based on his songs, in New York last month\nHaunting: Bowie's final music video, Lazarus, shows him in a hospital bed with his eyes covered by a bandage\nIn an interview in 2007, Bowie himself spoke frankly about how he had made 'mistakes' that he did not want to repeat in regards to family life.\n'I don't have that sense of loneliness I had before, which was very strong. I'm very at ease, and I like it,' he said.\nKing of glam rock: David Bowie enjoyed a glittering career spanning six decades that saw him become one of the biggest recording artists of all time\n'I never thought I would be such a family–oriented guy I didn't think that was part of my make–up.\n'But somebody said that as you get older you become the person you always should have been, and I feel that's happening to me. I'm rather surprised at who I am, because I'm actually like my dad.'\nYears earlier, he had also alluded to his own mortality, and discussed the impact that had on his work and understanding of fatherhood.\nHe told John Wilson on Front Row: 'Age doesn't bother me, it's the lack of years left that weighs far heavier on me.\n'It's having to let go of it all, even more so now. It's so much more poignant [since the birth of his daughter].\n'There's such a cloud of melancholia about knowing I'm going to have to leave my daughter on her own. It just doubles me up in grief.'\nLast year, ahead of Father's Day, Duncan posted a picture to Twitter which showed the card he planned to give his father.\nThe message inside read: 'You may not be the coolest dad, but you're definitely one of the greatest.'\nDuncan tweeted: 'Father's Day coming up soonish. Found the perfect card.'\nBut his tweet was met with bemusement.\n'If your dad is only pretending to be cool the rest of us are f****** doomed,' one follower tweeted at Jones.","url":"https://www.dailymail.co.uk/news/article-3394154/David-Bowie-s-son-Duncan-s-touching-tribute-Heroes-singer-father-loved-fans-world.html"}
