{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 01:29:42","date_modify":"2018-10-23 01:29:42","date_publish":"2016-01-28 15:51:21","description":"The Prime Minister today insisted he did not accept the phrase, which he used at yesterday's PMQs, was unacceptable - insisting he was making a 'clear point' about Jeremy Corbyn's migrant policy.","filename":"data/vaneerConsumption/DavidCameronrefusestoapologiseforsayingbunchofmigrants.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/13/30A11E9700000578-0-image-a-40_1453899658259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421209_David-Cameron-dismisses-critics-slammed-bunch-migrants-jibe-says-right-highlight-Jeremy-Corbyn-s-open-door-immigration-policy_1540258182.html","title":"David Cameron refuses to apologise for saying 'bunch of migrants'","title_page":"David Cameron refuses to apologise for saying 'bunch of migrants' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron said he did not need to apologise today after he was slammed for describing refugees in Calais as a 'bunch of migrants'.\nThe Prime Minister insisted he did not accept the phrase, which he used at yesterday's PMQs, was unacceptable.\nSpeaking today, Mr Cameron said: 'I don't accept that at all. I was making a clear point that what Jeremy Corbyn was doing was talking with migrants and telling them they could come to Britain.'\nDavid Cameron, pictured in the Lake District today, has rejected criticism of his use of the phrase 'bunch of migrants' at yesterday's Prime Minister's Questions\nControversial: David Cameron, pictured during the row at the Commons despatch box, referred to a 'bunch of migrants' at PMQs in a heated exchange with Jeremy Corbyn, also pictured in the Commons\nThe Prime Minister told Sky News: ‘I was very clear I meant Labour have an open door migration policy.’\nThe Prime Minister insisted ‘those people in France should be claiming asylum in France’ – pointing out France was a ‘safe’ country for refugees.\nMr Cameron was branded 'shameful' and 'callous' by senior Labour MPs and criticised by the Refugee Council for his remark.\nMr Corbyn even wrote to the Prime Minister hours after the exchange to rebuke him for the 'dismissive' language.\nHe told the PM: 'I have to say I found it shameful that you referred to the people in those camps as “a bunch of migrants”, escalating the tensions on such a serious issue.\n'It is clear that many are fleeing conflict and human rights abuses that you and I cannot begin to imagine.'\nJunior ministers immediately defended Mr Cameron insisting he was making clear his opposition to handing migrants in Calais a 'free pass' to enter the UK and Speaker John Bercow later ruled his language had not been 'unparliamentary'.\nThe clash happened when Mr Cameron lost his temper with the Labour leader and Shadow Chancellor John McDonnell after they criticised Google's controversial £130million tax deal.\nMr Cameron said: 'They met with a bunch of migrants in Calais and said they could come to Britain - the only people they never stand up for are hardworking British families.'\nBut Labour's Chuka Umunna led criticism when he said: 'The PM refers to 'a bunch of migrants' in Calais at the Dispatch box just now. Inflammatory and unbecoming of his office. Shameful.'\nComedian David Baddiel was among those to protest the remarks outside Parliament.\nHe said: 'Not the right day #HolocaustMemorialDay for the bunch of migrants thing.'\nLisa Doyle, the Refugee Council's head of advocacy said: 'When we are facing the greatest refugee crisis of our time, it is disappointing the Prime Minister is using flippant remarks to score political points.\n'We have all seen the pictures of the desperate conditions people are living in across Europe, including just miles from the UK's border.\n'The Prime Minister should be showing political leadership and work with other European countries to ensure that people can live in safety and dignity.'\nShadow Scotland Secretary Ian Murray said: 'PM barks 'he (corbyn) met a bunch of migrants at Calais'. He met terrified unaccompanied kids in danger of exploitation. Dispassionate PM.'\nDavid Baddiel was among the critics of the Prime Minister's remarks - highlighting it was Holocaust Memorial Day. Chuka Umunna was among Mr Cameron's harshest critics in Parliament\nThe Prime Minister's remark drew an immediate reaction from Labour MPs on Twitter as Chuka Umunna said the language was 'inflammatory'\nShadow international development secretary Diane Abbott said Mr Cameron was being 'callous' with his use of language\nShadow international development secretary Diane Abbott immediately branded the remark 'shameful' and added: 'So Cameron refers to refugees in #CalaisJungle as 'bunch of migrants'.'\nAfter the clash, the Prime Minister's official spokesman defended Mr Cameron.\nWhen asked if it was wrong for the Prime Minister to use the 'pejorative' term, 'a bunch of migrants', he said: 'He very strongly disagrees with the approach Labour wants at Calais and that's to open the doors and let people into Britain because he believes it will make the situation worse and bring even more people to Calais'.\nLater, Tory business minister Anna Soubry said: 'He was using the language of ordinary people.\n'You are damned if you do and damned if you don't. I'm sure he meant to say group'.\nMr Cameron was vigorously defended by Tory MP Andrew Percy - suggesting 'left types' should thank Mr Cameron for giving them something to be 'smug and self righteous over'.\nHe added: 'The left really are ridiculous and getting more ridiculous.'\nSpeaking to ITV on Monday following his visit, Mr Corbyn called for a humane response to the migration in Calais.\nHe said: 'I'm not saying all 9,000 should come. Start with those that have a British connection and a British passport - that's an obvious one.\n'And the Home Office can let up a bit and be reasonable in those cases.'\nMr Corbyn said he had been 'surprised' by how many people at the camp he had met who held British passports.\nHe rejected the suggestion he was 'naive' about the implications of dramatically increasing the number of refugees it takes in.\nHe said: 'Germany has taken several hundred thousand people already, Austria less but taken a lot.\n'Britain is taking 20,000 over five years - that is the equivalent of a few tube trains.\n'There is a refugee crisis on Europe's borders, there is a refugee crisis in the world. We can't ignore it, we can't wish it away.\n'We have to deal with the political causes - the war in Afghanistan, the war in Iraq, the war in Syria, the war in Libya.\n'But in the mean time we cannot just ignore the fact that are a large number of people in a very serious, deeply depressed state and they need our help.'\nLast July, Mr Cameron sparked a major political row after describing hundreds of migrants in Calais as a 'swarm'.\nLabour's then acting leader Harriet Harman said the Prime Minister should remember he is talking about 'people, not insects' as tensions mounted over the government's response to the crisis.\nBut political opponents accused him of 'dog-whistle' politics and the Refugee Council condemned the 'awful, dehumanising language'.\nSpeaking to ITV about the migration crisis, he said: 'This is very testing, I accept that, because you have got a swarm of people coming across the Mediterranean, seeking a better life, wanting to come to Britain because Britain has got jobs, it's got a growing economy, it's an incredible place to live.\n'But we need to protect our borders by working hand in glove with our neighbours the French and that is exactly what we are doing.'\nMr Corbyn visited Calais on Saturday to see for himself the conditions thousands of migrants were living in northern France\nDetritus: A mattress, sleeping bags, clothes and other belongings have been discarded in the Dunkirk camp, close to where migrants are living","url":"https://www.dailymail.co.uk/news/article-3421209/David-Cameron-dismisses-critics-slammed-bunch-migrants-jibe-says-right-highlight-Jeremy-Corbyn-s-open-door-immigration-policy.html"}
