{"authors":["Robert Davi"],"date_download":"2018-10-30 20:46:56","date_modify":"2018-10-30 20:46:56","date_publish":"2015-11-16 14:03:44","description":"As every Christmas season approaches, I wait for what new scheme secularists come up with to test the waters in their deliberate and incremental eradicating of Christmas in our country. This has been going on for years, like a creeping fog that slowly roles in during dead of night so that when you wake there is no trace of the most Joyous holiday to mankind.","filename":"data/vaneerConsumption/DAVIToDefeatRadicalIslamtheWestMustStandforSymbolsofTradition.json","image_url":"https://media.breitbart.com/media/2015/11/Nativity-scene-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_16__1540932416.html","title":"DAVI: To Defeat Radical Islam, the West Must Stand for Symbols of Tradition","title_page":"DAVI: To Defeat Radical Islam, the West Must Stand for Symbols of Tradition | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As every Christmas season approaches, I wait for what new scheme secularists come up with to test the waters in their deliberate and incremental eradicating of Christmas in our country. This has been going on for years, like a creeping fog that slowly roles in during dead of night so that when you wake there is no trace of the most joyous holiday to mankind.\nSeveral years ago, a Nativity scene displayed in Santa Monica was removed. This was an inspiring, lovely series of scenes that ran along Ocean Drive. No one made a big deal that it had been removed. I wrote about it here and asked folks to join me for a Candlelight Vigil hoping to bring to light that a 60-year tradition had been taken down because of an atheist and the Santa Monica City Council.\nI envisioned hundreds of people walking with candles. Only two people met me at the Statue on a cold rainy night: actor Adam Baldwin and young PR-social media agent Verena King. It didn’t make the Blaze , It didn’t make O’Reilly. Actually, it was a non-event. Perhaps if I had added “cops are pigs” more people would have showed up, but this was only about faith and the celebration of a Christian historical event.\nIn any case, it did make the local Santa Monica paper and Fox and Friends, afterwards. This led to a private citizen helping put it on the premises at a local church. Now, just last week I heard about how someone at Simon Properties came up with the idea of “Let’s try a few properties and dump the tradition and do something that will appeal to the Millenials!”\nCan you imagine that meeting? Some young marketing genius who is probably not even from America comes up with an idea to have Santa sitting on a cold, sterile impersonal Glacier with a light show that is out of a low-budget Sci-Fi movie and dump the Christmas tree, traditional lighting, music, etc. NO more Christmas–we can’t offend anyone and must be politically correct.\nWell, Im happy to say there was an uproar and folks WANTED and looked forward to Christmas, hence the 30-plus stores stripped of the charm and warmth of Merry Christmas were turned back to tradition because of the pubic outcry. This leads me to one of the latest attempts to subtly test the waters in eradicating Merry Christmas: The Starbucks Red Cup.\nWhile some folks were upset about the Starbucks change in Cup, others didn’t think it was such a big deal; the Blaze and O’Reilly went out of their way to say it was a non-issue. Here is why it is: We are living through a time when the culmination of the communist left’s threat of destroying America is reaching a tipping point.\nWe have a Nation confused, indulgent, misguided and a youth that has been castrated of its ability to think. We are seeing institutions of higher education finally becoming the subversive playground of the left’s experiment that started with child psychology. No longer is critical thinking allowed, just indoctrination.\nWhat is tragic is we were warned of this 60 years ago, but no one listened. No one heard, or if they did, it was just a” Red Cup” that really held no significance and those who may have seen the danger lurking and understood what was behind the scrubbing of America ‘s traditional values and family structure were ridiculed and minimized.\nWe have a very big problem. The youth today are a crippled generation, and we are to blame. Political Correctness is a subversive religion of the left. It is creating mind control and killing the creative thought of the individual.\nThe attack on Christmas was another brilliant stroke by the left and most of the right has failed to see the danger. While a writer Matt Walsh for Glenn Beck did a major piece ridiculing the concern for the Red Cup—as if speaking for all Christians—titled “No, Serious Christians Aren’t Worried About The Stupid Starbucks Cup,” and even Bill O’Reilly who usually is a big defender of Christmas failed to see the significance of this.\nAll across America—in the town square, in the schools, in the media—the attack on Christ, Christmas, and Judeo-Christian values is the most devious, insipid strategy for destroying our nation. When a spiritual void is created in our society it creates an addicted, entitled populace.\nWe have more drug addiction in our nation then ever before. We have made ” it makes me feel uncomfortable,” “it is not appropriate,” “I don’t have to if I don’t want to” the battle cry for our youth, “I’m a minority and deserve better treatment,” “I need to feel SAFE.” To strip and lobotomize what America stands for and the historical significance of our common values is leading to the most perilous crisis.\nWhat we just saw happen in Paris is just the beginning. Unless we demand the “Red Cup” have MERRY CHRISTMAS written on it . You see, I live in America. I grew up with stores and media, TV, the town square wishing all of us a Merry Christmas. Why has it been ok for this to be slowly eradicated?\nThere are women in America walking around in Burkas. This is religion in the town square. But does anyone care? No. But saying Merry Christmas has become so Politically incorrect that all across America it is being erased. “Dreaming of a White Christmas” has been replaced with “Dream a little Dream.” Instead of Merry Christmas we see “Joy,” “peace.” While we become more tolerant of a religion thats screams for the destruction of anyone who does not agree with them, while the drugged up academia and political left preach heresy and brainwash and misguide our youth into a weak Army of the Absurd, we have radicals who will crush the West because we lack moral clarity, tradition, and faith.\nWhile we have those who piss on religion or spirituality, while Europe has slowly turned its own back on Judeo-Christian values, we will see the death of freedom.\nWe have so separated our nation into special interests that we no longer have a national consciousness. Do you not see it? Our Judeo-Christian values are the glue that holds our nation together. The whole existence of the left was to destroy this. To fight ISIS is absurd. In the film, Viva Zapata, when Emiliano Zapata is killed it is his idea that lives on and becomes more powerful. ISIS will morph into something else, just as al Qaeda has. A new head will grow each time it is cut off.\nWe must have a worldwide summit with world leaders both political and religious, televised for all to watch: The topic is one issue and it’s not global warming. The summit must deal with Islam–only Islam–and the denouncing of Radicalism and the establishing of a universal and coherent reformation of the principles of Islam in the 21st century. Let’s stop fooling ourselves.\nThis is what must be done. All the bombing, all the killing will never stop until Islam defines what it is to the world. This will give the moderates cover and protection. Then we can stop this absurd denial of what it is that has hijacked a religion. If the world were serious about stopping the killing, this is what it would do . Why has no one asked for this–except El-Sisi in Egypt, but he was ignored. You see, Islam has its “Red Cup,” the difference is they are willing to kill to defend it, while we in the West lose our identity and will to defend it. We are pathetic pawns in a Global Dance. Merry Christmas.","url":"https://www.breitbart.com/entertainment/2015/11/16/davi-to-defeat-radical-islam-the-west-must-stand-for-symbols-of-tradition/"}
