{"authors":["Daniel Martin Chief Political Correspondent For The Daily Mail"],"date_download":"2018-10-22 21:35:02","date_modify":"2018-10-22 21:35:02","date_publish":"2016-01-11 00:57:21","description":"David Cameron said he would not resign even if the public voted against his recommendation that the UK should not leave the European Union, he added that he would just have to 'make it work'.","filename":"data/vaneerConsumption/DavidCameronhasnocontingencyplanforUKleavingtheEU.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/2FFB066700000578-0-image-a-11_1452473822311.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393167_Backlash-PM-claims-leaving-EU-isn-t-right-answer-Cameron-says-no-contingency-place-UK-votes-Brexit_1540244102.html","title":"David Cameron has no contingency plan for UK leaving the EU","title_page":"David Cameron has no contingency plan for UK leaving the EU | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron infuriated Eurosceptics yesterday by insisting that leaving the EU was ‘not the right answer’ – even though he is still trying to renegotiate Britain’s role in the Union.\nThe Prime Minister said he had put no contingency plans in place in case the UK votes for a ‘Brexit’.\nMr Cameron said he would not resign even if the public voted against his recommendation, adding merely that he would have to ‘make it work’ if that is how the referendum goes.\nScroll down for video\nPrime Minister David Cameron, pictured on The Andrew Marr Show, said an EU exit wasn't the 'right answer'\nAnd he claimed it was better to stay in the EU because it made Britons safer from terrorism.\nLast night there was anger from anti-EU campaigners about Mr Cameron’s pro-Europe tone, before the renegotiation is completed.\nCritics suggested his words showed that he had already made his mind up about which way to campaign.\nMatthew Elliott, chief executive of the Vote Leave campaign, said: ‘Cameron has never asked for serious changes from the EU – he gave up before he started.\nHe’s asked for trivia and he’ll get everything he’s asked for. It’s spin and nobody should believe him.\n‘If you want British laws to be made by people you can vote out, the only way is to Vote Leave and take back control.’\nProminent Eurosceptic David Davis, a former Tory leadership candidate, told the BBC’s Sunday Politics: ‘He [Mr Cameron] said there’s no plans for Brexit.\n‘Now, this is actually disgraceful. Because you know, you’ve got two moderately likely outcomes, we don’t know which it will be.\n‘There are no plans for Brexit and that’s really, really serious, because it’s a very complicated operation to carry out, if it happens.’\nIn an interview on the BBC’s Andrew Marr Show, Mr Cameron insisted that it was right to stop Eurosceptic ministers such as Work and Pensions Secretary Iain Duncan Smith speaking out before the result of the renegotiation is known.\nMany Tory backbenchers say this is unfair, because other Cabinet ministers have been given free rein to talk about their belief that Britain should stay in the EU.\nMr Cameron, pictured on the Marr show, said staying in the EU would keep Britons safer from terrorism\nMr Cameron made clear that his preference was to hold an in-out referendum on reformed membership terms this summer – but hinted that he could delay it until next year if a new package is not finalised soon.\nHe said he was ‘confident we can get a good outcome’ from the haggling with EU counterparts, and he still ‘hoped’ a package could be finalised by the next Brussels summit on February 18. If that timetable slipped the referendum could take place in September ‘or later’.\nAsked whether the Government was preparing contingency plans for Brexit, the Prime Minister said: ‘I don’t think that is the right answer.\n'Were that to be the answer we would need to do everything necessary to make that work. The Civil Service are working round the clock to support my negotiation.’\nHe would not resign if the country voted for the UK to leave the EU – because the referendum was about Europe and not him.\nMr Cameron also said: ‘We can help to keep our people safe by staying together with our close allies and partners as we confront extremism and terrorism.’","url":"https://www.dailymail.co.uk/news/article-3393167/Backlash-PM-claims-leaving-EU-isn-t-right-answer-Cameron-says-no-contingency-place-UK-votes-Brexit.html"}
