{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 00:42:33","date_modify":"2018-10-23 00:42:33","date_publish":"2016-01-11 10:22:11","description":"The TV presenter put up the sign near her eight-bedroom mansion near the upmarket village of Wadhurst in East Sussex. She says she'll give CCTV evidence to the police","filename":"data/vaneerConsumption/DavinaMcCallputsupsignurginglocalsnottousepathbyhomeasatoilet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/15/15/2FE9D51800000578-0-image-a-9_1452871769037.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393628_Davina-McCall-puts-sign-urging-locals-not-use-path-country-home-toilet_1540255353.html","title":"Davina McCall puts up sign urging locals not to use path by home as a toilet","title_page":"Davina McCall puts up sign urging locals not to use path by home as a toilet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Davina McCall has put up an angry sign telling people not to use a path next to her country home as a toilet.\nThe TV presenter, 48, lives in a £3.2million, eight-bedroom mansion in East Sussex.\nBut her enjoyment of her rural retreat has been hampered by walkers and passengers from the local station spoiling the path which runs across her land.\nTV presenter Davina McCall has been left furious by people using a path near her country home as a toilet\nShe has now put up a sign next to stairs leading to the path, warning people she'll film their acts and give the CCTV evidence to the police.\nThe sign reads: 'Members of the public who feel it is acceptable to use the top of these stairs and surrounding area to DEFECATE and URINATE, could you STOP!\n'We have CCTV footage of everyone which has been passed on to the TRANSPORT POLICE.'\nA number of words in the black text notice have been changed to red to add emphasis.\nThe Sun reported that the route is used as a right of way by commuters and people returning from London, despite being on McCall's land.\nThe British Transport Police has condemned the actions and threatened fines of up to £1,000 for anyone caught.\nMcCall, who is currently preparing to present the new series of TV show The Jump, moved into the property with husband Matthew Robertson, 37, and their three children in 2009.\nThe eight-bedroom mansion, which is set back from the roadside down a long driveway, features five bathrooms, five reception rooms and a huge conservatory.\nThe house, which was once a medieval nunnery, also has a separate lodge for staff, two swimming pools, a paddock and a tennis court.\nMcCall, the mother of Holly, 14, and Tilly, 12, and son Chester, nine, recently told how her life is a juggling act and she often has 'mummy guilt' about being away from home.","url":"https://www.dailymail.co.uk/news/article-3393628/Davina-McCall-puts-sign-urging-locals-not-use-path-country-home-toilet.html"}
