{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 22:07:52","date_modify":"2018-10-22 22:07:52","date_publish":"2016-01-11 02:24:25","description":"The attack happened around 9pm last night and in one post the hacker poked fun at Mr Corbyn's well-known opposition to Trident, Britain's nuclear deterrent, by writing: '**** trident.'","filename":"data/vaneerConsumption/DavidCameronbrandedapieonJeremyCorbynshackedTwitteraccount.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/30020B5200000578-0-image-a-33_1452478962876.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393273_Cameron-pie-Hackers-Corbyn-s-Twitter-account-series-offensive-tweets_1540246072.html","title":"David Cameron branded a 'pie' on Jeremy Corbyn's hacked Twitter account","title_page":"David Cameron branded a 'pie' on Jeremy Corbyn's hacked Twitter account | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Labour leader Jeremy Corbyn's Twitter account was filled with offensive messages after being hacked last night.\nIn one post the hacker poked fun at Mr Corbyn's well-known opposition to Trident, Britain's nuclear deterrent, by writing: '**** trident.'\nOther messages which appeared on the Twitter feed included: 'Davey Cameron is a pie' and : 'Here we... here we... here we ****ing go!'\nLabour leader Jeremy Corbyn's Twitter account was filled with offensive messages after being hacked\nIn one post the hacker poked fun at Mr Corbyn's well-known opposition to Trident, Britain's nuclear deterrent, by writing: '**** trident\nOther messages which appeared on the Twitter feed included: 'Davey Cameron is a pie'\nThe Labour leader's account appeared to be infiltrated shortly after 9pm, when it started broadcasting the bizarre messages to his 384,000 followers.\nLater a spokesman for Mr Corbyn said the situation was now back 'under control'.\nWhile he is one of the most high-profile, he is not the first politician to have fallen victim to hackers.\nRobert Halfon, Conservative MP for Harlow, allegedly tweeted in 2012: 'Sad news: Jimmy Savile dead: Jim'll Fix It presenter dies at home aged 84.'\nHowever, in 2014 he deleted the tweet and later complained that his account had been hacked.\nIn November 2014, Lincolnshire MP Karl McCartney claimed that his account had been hacked after a Labour Councillor pointed out that he had favourited a pornographic image.\nBanbury Labour Councillor Mark Cherry also said he was hacked in May 2014, adding that he was 'horrified' when he saw the tweet linking Conservative policy on disabled housing to Nazi concentration camps.","url":"https://www.dailymail.co.uk/news/article-3393273/Cameron-pie-Hackers-Corbyn-s-Twitter-account-series-offensive-tweets.html"}
