{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 01:02:18","date_modify":"2018-10-23 01:02:18","date_publish":"2016-01-28 15:09:37","description":"The proposal will be the subject of Mr Cameron's surprise talks with EU Commission president Jean Claude Juncker in Brussels tomorrow.","filename":"data/vaneerConsumption/DavidCameronisofferedanemergencybrakebytheEUforbenefits.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB0F1500000578-0-image-a-30_1453993755624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421071_David-Cameron-offered-emergency-brake-EU-allow-Britain-cancel-benefits-migrants-Brussels-bureaucrats-agreed_1540256538.html","title":"David Cameron is offered an 'emergency brake' by the EU for benefits","title_page":"David Cameron is offered an 'emergency brake' by the EU for benefits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Cameron, pictured today on a visit to Cumbria, will discuss the emergency brake with Jean Claude Juncker tomorrow\nThe EU will offer Britain an 'emergency brake' on migration as an alternative to David Cameron's proposed four year ban on migrants claiming in work benefits, it emerged today.\nThe proposal will be the subject of Mr Cameron's surprise talks with EU Commission president Jean Claude Juncker in Brussels tomorrow.\nThe 'brake' would allow an EU country to suspend migrants' access to in work benefits for four years - but only once the country had persuaded the EU Commission their welfare state was under too much pressure.\nIf agreed, Mr Cameron make progress on a draft deal with EU Council president Donald Tusk, who he is due to meet in London on Sunday.\nAssuming the talks go well, Mr Tusk will outline the offer for Britain and send it to all EU leaders next week - paving the way for Mr Cameron to complete his renegotiation of Britain's membership at next month's EU summit.\nSealing a deal there is expected to trigger a summer referendum, thought likely to be held on June 23.\nLast week, Czech leader Bohuslav Sobotka revealed he and Mr Cameron had been discussing an 'emergency brake' as an alternative to the Prime Minister's demands.\nThe Czech leader admitted the four-year benefits ban may not fair on EU citizens but hinted he could back the 'emergency brake'.\nSeveral European countries - particularly in former eastern bloc - have expressed grave concerns about Mr Cameron's proposal to ban new migrants from claiming benefits.\nGerman Chancellor Angela Merkel has insisted throughout the renegotiation nothing agreed will be allowed to undermine the freedom of movement principle at the heart of the European Union.\nThe emergency brake policy would allow Britain and other EU states to cut off the flow of benefits to migrants if there was 'immense pressure on its social welfare system', he said.\nHe added: 'The UK has introduced their proposal... we discussed other possible alternatives to meet the same objective... make it possible for the UK government to respond to the mass influx of workers'.\nHe said: 'It is very important for us that any solution that is adopted on a European level does not discriminate.'\nThe brake would be controversial Britain would probably have to prove there were difficulties in its labour market or economy before Brussels would allow the brake to be applied.\nA blanket four-year ban would give Mr Cameron the control he wants over benefits.\nMr Cameron will meet Commission president Mr Juncker, left, in Brussels tomorrow before further talks with Council president Mr Tusk, right, in London on Sunday\nAt a joint press conference Mr Cameron said he had not dumped his four-year rule - a key plank of his renegotiation - but admitted he was a 'practical man' and 'welcomed' alternatives.\nHe said any other deal would have to have the same effect.\nLast month his four-year wish looked dead in the water after EU President Donald Tusk said the four-year plan 'seems unacceptable' - and Commission boss Jean-Claude Juncker sadi: 'The commission is ready to look for other options.'\nThe hopes for a deal at the February summit had appeared to be fading because of the European migrant crisis.","url":"https://www.dailymail.co.uk/news/article-3421071/David-Cameron-offered-emergency-brake-EU-allow-Britain-cancel-benefits-migrants-Brussels-bureaucrats-agreed.html"}
