{"authors":["Robert Kraychik"],"date_download":"2018-10-30 18:03:31","date_modify":"2018-10-30 18:03:31","date_publish":"2018-08-16 02:31:51","description":"David Clarke described Omarosa Manigault-Newman as a \"rat bastard\" and \"snake\" during an interview with Breitbart News Tonight.","filename":"data/vaneerConsumption/DavidClarkeonOmarosaWhataRatBastard.json","image_url":"https://media.breitbart.com/media/2018/08/david-clarke-omarosa-getty-images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2018_08_15__1540922611.html","title":"David Clarke on Omarosa: 'What a Rat Bastard'","title_page":"Exclusive - David Clarke on Omarosa: 'What a Rat Bastard'","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Milwaukee Sheriff David Clarke described Omarosa Manigault-Newman as a “rat bastard” and “snake” during a Tuesday interview with Breitbart News Senior Editors-at-Large Rebecca Mansour and Joel Pollak on SiriusXM’s Breitbart News Tonight.\nClarke rejected Manigault-Newman’s framing of President Donald Trump as a “racist.”\nLISTEN:\n“My experience with the president, I worked with him on the campaign [and] got to know him very well,” said Clarke. “After he was sworn in he still kept in touch with me and I kept in touch with him. I know him, and he doesn’t have a racist bone in his body. We all know this is political.”\nClarke spoke of his familiarity with Manigault-Newman. “Speaking to Omarosa, I know her well,” he said:\nI know her personally. I met her on the campaign — talked to her a lot, met her after the inauguration when she was in the White House, I got to know both [Donald Trump and Omarosa Manigault-Newman]. When I heard the other day that she was coming out with this book and some of the accusations she made, I thought: I don’t know if I can say this but I’m going to say it anyway, what a rat bastard, because the president has been nothing but loyal to her. She feigned loyalty to him, and then all of a sudden, when things didn’t go her way, she crapped on him. It’s despicable. The woman’s not believable. She’s always been a hanger-on. She’s always had a flair for the dramatic.\nClarke added, “She’s trying to sell a book. We all know what happens when you sell a book. … What people want to know when you’re on a book tour for a non-fiction book, they want to know if you’re believable. They want to know that your heart is pure and they want to know that your hands are clean if you’re going to make some scurrilous accusation, especially the kind that she’s making. I think right away people saw right through it.”\nClarke continued, “Bite the hand that feeds you. He’s carried her his whole career. To turn around and backstab him like she did, I thought was despicable. I think all of America sees it. This book tour has been a disaster, and rightfully so. … The president has done nothing but good for her.”\nClarke remarked, “This is the person I know. This is the Omarosa that I know, so I wasn’t shocked [or] surprised. As soon as I found out that she either left the White House or was fired … I said to myself, ‘Oh boy, here we go,’ because I know the kind of person she is, and I knew that she was going to turn around.”\nClarke likened Manigault-Newman as a “snake,” echoing earlier tweets of his:\nWas asked on @NewsmaxTV America Talks Live how Omarosa could turn on @realDonaldTrump after everything he did for her career. I said she’s a snake and snakes slither around and are hard to detect until they strike out. Also call out Antifa as insurgents. https://t.co/mnoH3mqPix — David A. Clarke, Jr. (@SheriffClarke) August 13, 2018\nThere is a term used for someone who CLAIMED to be loyal like @OMAROSA had toward @realDonaldTrump but engages in behavior that contradicts same. It’s called being a RAT BASTARD. This SNAKE-IN-THE-GRASS was planning this all along. This might be CRIMINAL. https://t.co/y3R5qmFFuQ — David A. Clarke, Jr. (@SheriffClarke) August 12, 2018\nClarke said:\nDonald Trump tried to kick-start her career for her. … Some of the behavior she exhibits. I’m not surprised by that at all. She knows that she’s got one big day. I think she knew that going into inauguration day. She could into the White House … she probably knew it was going to be a book. She probably didn’t think she was going to get fired, but at the same time she was always going to come out with some tell-all book with the crazy accusations, and she knew that there would be a publisher out there.\nClarke added, “The left-aligned media is using her to smear the president, but at the same time, when they’re done with her, they toss her out like used Kleenex because they know she has no credibility, so they squeeze what they can out of her and then they throw her away. … It blew up in her face.”\nClarke concluded, “I never trusted [Omarosa Manigault-Newman]. She exploits situations.”\nBreitbart News Tonight broadcasts live on SiriusXM Patriot 125 weekdays from 9 p.m. to midnight Eastern (6 p.m. to 9 p.m. Pacific).\nFollow Robert Kraychik on Twitter.","url":"https://www.breitbart.com/radio/2018/08/15/exclusive-david-clarke-on-omarosa-what-a-rat-bastard/"}
