{"authors":["Associated Press"],"date_download":"2018-10-22 22:17:08","date_modify":"2018-10-22 22:17:08","date_publish":"2016-01-28 10:11:04","description":"SAN DIEGO (AP) — The best season of Jason Day's career began at the Farmers Insurance Open when he won a four-man playoff, the first of his five victories th...","filename":"data/vaneerConsumption/DayhopefulofdefendingtitleatTorreyPines.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:f4fa881074d6416f91fafcf1a6512846-4vVdYopwYQ7f641721b07ab9e79a-788_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420658_Day-hopeful-defending-title-Torrey-Pines_1540246628.html","title":"Day hopeful of defending title at Torrey Pines","title_page":"Day hopeful of defending title at Torrey Pines | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Day hopeful of defending title at Torrey Pines\nSAN DIEGO (AP) — The best season of Jason Day's career began at the Farmers Insurance Open when he won a four-man playoff, the first of his five victories that for a brief time took him to No. 1 in the world.\nBefore he can defend his title, however, Day has to get to the first tee.\nThe Australian pulled out of the pro-am on Wednesday at Torrey Pines because of the flu. Still to be determined was whether he was fit enough to play.\nFILE - In this Jan. 24, 2013, file photo, Phil Mickelson grimaces as he watches his tee shot on the 10th hole of the north course at the Torrey Pines Golf Course during the first round of the Farmers Insurance Open golf tournament, in San Diego. The best thing about playing Torrey Pines for Phil Mickelson is that it's his hometown event on the PGA Tour. That might be the only thing he finds favorable. (AP Photo/Gregory Bull, File)\nDay said Torrey Pines was special to him because he came here for the junior world championship at age 16.\nIf he can play, it would be the first time Day is at a tournament that does not have either Jordan Spieth (playing in the Singapore Open) or Rory McIlroy (week off before he plays in Dubai). That won't make it any easier.\nRickie Fowler is coming off a victory in Abu Dhabi, his fourth title worldwide in the last eight months that took him to a career-best No. 4 in the world. Also in the field is Dustin Johnson, Patrick Reed, and the hometown favorite, Phil Mickelson.\nHere's how the opening round is shaping up on Thursday:\nWHAT WILL PHIL DO NEXT?: Mickelson has a love-hate relationship with Torrey Pines, which he knows better than anyone in the field from growing up in San Diego and entering his 25th year on the U.S. PGA Tour.\nHe loves Torrey Pines because its home and he won here three times. He's not so fond of the work Rees Jones did to the South Course to prepare for the 2008 U.S. Open. Mickelson hasn't won in 15 years.\nAnd even the North Course brings back not-so-fond memories. Mickelson was supposed to redesign the course, and had grandiose plans to bring the gorgeous canyons into view, only for the California Fair Political Practices commission to rule that anyone involved in the design of a project cannot follow through on the work.\n\"It's certainly disappointing for me, but I understand the politics of it all,\" he said Wednesday. \"Actually, I don't understand the politics of it all. It makes no sense.\"\nAs for his game? He has a new coach, and began the season with a tie for third last week at the CareerBuilder Challenge.\nHAVE GAME, WILL TRAVEL: Spieth said he was tired after his tie for fifth last week in Abu Dhabi, having played twice in Asia, once in Australia, once in the Bahamas, once in Hawaii, and once in the Middle East in the last four months.\nImagine how Fowler feels.\nEven though he grew up an hour away, he traveled the farthest to get here. Fowler left Abu Dhabi after his victory on Sunday and arrived early Monday in San Diego in time to host a junior clinic. He says he can't wait to play again, which is Thursday. And winning tends to negate fatigue.\nAUSSIE DEBUT: The tour debut of 17-year-old Ryan Ruffels just got a lot more interesting.\nThe Aussie teen told a tale to the Sydney Morning Herald about playing with Mickelson at Torrey Pines last month and winning $5,000 off of him. Two days later, Ruffels said the story wasn't accurate. He wanted to point out that no NCAA rules were violated (he was an amateur playing with Mickelson and his brother, Arizona State University golf coach Tim Mickelson) and that the amount was \"out of proportion.\"\nMickelson didn't take too kindly to it all.\n\"He's young, and he's got some things to learn,\" Mickelson said. \"One of them is you don't discuss certain things. You don't discuss specifics of what you play for. And you certainly don't embellish and create a false amount just for your own benefit. So those things right there are ... that's high school stuff.\"\nROSE BEGINS: Justin Rose is the highest-ranked player at No. 7 in the world to have not played this year.\nThat changes on Thursday.\nRose last played at the World Challenge on Dec. 6 and he closed with a 62. That's a nice way to go into his winter hibernation.","url":"https://www.dailymail.co.uk/wires/ap/article-3420658/Day-hopeful-defending-title-Torrey-Pines.html"}
