{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:26:11","date_modify":"2018-10-30 21:26:11","date_publish":"2015-07-02 16:23:20","description":"On June 30, Daytona International Speedway President Joie Chitwood said the Confederate flag will not be banned at the July 5 Coke Zero 400.","filename":"data/vaneerConsumption/DaytonaSpeedwayWillNotBanConfederateFlagfromCokeZero400.json","image_url":"https://media.breitbart.com/media/2015/07/race-car-confederate-flag-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_07_02__1540934771.html","title":"Daytona Speedway Will Not Ban Confederate Flag from Coke Zero 400","title_page":"Daytona Speedway Will Not Ban Confederate Flag from Coke Zero 400 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On June 30, Daytona International Speedway President Joie Chitwood said the Confederate flag will not be banned at the July 5 Coke Zero 400.\nBut Chitwood made clear that this could change for races held at the Speedway in the future.\nAccording to NBC Sports, Chitwood said the Confederate flag will be allowed on July 5, but an “exchange” will be in place, where those flying a Confederate flag will be able to swap it for an American flag if they so choose. He added, “Going forward, (we) really have to look at where that other flag goes because it doesn’t have a place in our sport. We’ve got to take a thoughtful process on how we get to that point.”\nChitwood then spoke of NASCAR’s desire to be “inclusive,” saying, “I think the goal of any NASCAR event, and specifically Daytona, we want to be inclusive to everyone.” He did not specify whether “everyone” includes the myriad of NASCAR fans who fly the Confederate flag at races.\nThis is a short term decision and comes on the heels of Dale Earnhardt, Jr., and NASCAR Chairman Brian France expressing their disdain for the flag and their hopes to get the flag barred or otherwise removed from race events.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/sports/2015/07/02/daytona-speedway-will-not-ban-confederate-flag-from-coke-zero-400/"}
