{"authors":[],"date_download":"2018-10-22 21:20:20","date_modify":"2018-10-22 21:20:20","date_publish":"2014-06-05 00:30:11","description":"A Washington, D.C., principal was met with raucous cheers as he came out to his students as gay during a Pride Day event.","filename":"data/vaneerConsumption/DCHighSchoolPrincipalComesOutasGayDuringPrideDay.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_d-c-high-school-principal-comes-out-gay-during-pride-n123071_1540243220.html","title":"D.C High School Principal Comes Out as Gay During Pride Day","title_page":"D.C High School Principal Comes Out as Gay During Pride Day","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCWashington.com\nA Washington, D.C., principal was met with cheers as he came out to his students as gay during a Pride Day event that drew protest threats from Westboro Baptist Church.\n\"I turned 50. I'm tired of hiding,\" Principal Pete Cahall said before praising Wilson High School's students for the supportive environment they've created since Westboro Baptist Church made their plans known.\nThis is the first time Cahall, who has been the principal at Wilson for six years, has come out publicly. D.C. Mayor Vincent Gray was informed of his decision just moments before.\nThe school held its second annual Pride Day event Wednesday, bringing together over 20 organizations that support the needs of LGBTQ youth.\nWestboro, known for its public crusade against gay people at military funerals, announced plans to protest the school's Pride celebration on June 9 and called the school's support of gay and lesbian students a \"shame.\" That protest is just one of 12 the church has planned in the D.C. area over the next few days.\nAfter Westboro made its intentions known, students at Wilson began planning a peaceful counter-protest, The Washington Post reported. Around 1,000 students volunteered to participate in the silent protest.\nCahall's announcement was also met with support from local politicians, like D.C. Councilmember David Catania, who is openly gay.","url":"https://www.nbcnews.com/news/us-news/d-c-high-school-principal-comes-out-gay-during-pride-n123071"}
