{"authors":["Abigail Miller For Dailymail.Com"],"date_download":"2018-10-22 21:12:27","date_modify":"2018-10-22 21:12:27","date_publish":"2017-04-26 01:21:35","description":"Local governments in Washington, DC and the surrounding area will conduct a 'full scale' drill Wednesday to prepare in the event of a terrorist attack.","filename":"data/vaneerConsumption/DCplansafullscaleterrorattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B518900000578-0-image-a-12_1493165570897.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445944_DC-plans-scale-terror-attack_1540242747.html","title":"DC plans a 'full-scale' terror attack","title_page":"DC plans a 'full-scale' terror attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Local governments in Washington, DC and the surrounding area will conduct a 'full scale' drill Wednesday to prepare in the event of a terrorist attack.\nIt will take place between 7.30 and 8.30am on Wednesday across six cities in the capital area, including some in Northern Virginia and Maryland.\nThe Metropolitan Washington Council of Governments announced the exercise Tuesday, and has said that it will include hundreds of volunteer actors, emergency medical personnel, police and fire officials.\nLocal governments in Washington, DC and the surrounding area will conduct a 'full scale' drill Wednesday to prepare in the event of a terrorist attack (stock image)\n'Law enforcement officials practice and exercise their skills on their own regularly because that's the best way to ensure we are always ready to respond quickly and professionally,' Scott Boggs, the Council of Government's Managing Director of Homeland Security and Public safety said in the release.\n'On April 26, we'll go one step further and stage a very realistic emergency event involving multiple sites and actors posing as the casualties\n'However, there is no reason for residents to be alarmed because the exercise will occur in a controlled environment,' the statement continued.\nThis drill comes as international tensions rise following some of the President's more aggressive military policies and actions.\nThe Metropolitan Washington Council of Governments announced the exercise Tuesday, and has said that it will include hundreds of volunteer actors, emergency medical personnel, police and fire officials (stock image)\nThis drill comes as international tensions rise following some of the President's more aggressive military policies and actions. President Trump is pictured on April 25 before signing a new executive order\nEarlier this month, Trump ordered attacks on forces in both Syria and Afghanistan.\nTensions are especially high between the United States and North Korea. Timing may be coincidental, but the drill comes as the Trump administration works to address concerns about the socialist country's missile capabilities.\nThe President also called a special 'North Korea briefing' for all 100 US Senators at the White House on Wednesday afternoon.\nThe Trump administration has warned that all options, including a military strike, are on the table if they feel a real impending threat from North Korea.","url":"https://www.dailymail.co.uk/news/article-4445944/DC-plans-scale-terror-attack.html"}
