{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:59","date_modify":"2018-10-30 22:13:59","date_publish":"2015-05-19 18:05:57","description":"In July, Breitbart News reported that federal Judge Frederick J. Scullin Jr., ruled that DC's ban on carrying firearms in public for self-defense was unconstitutional. Scullin then gave the city a 90-day stay in which to figure out how to respond to the ruling.","filename":"data/vaneerConsumption/DCsRestrictionsonConcealedCarryUnconstitutional.json","image_url":"https://media.breitbart.com/media/2015/03/concealed-carry-gun-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_19__1540937639.html","title":"DC's Restrictions on Concealed Carry Unconstitutional","title_page":"Judge: DC's Restrictions on Concealed Carry Unconstitutional","title_rss":"NULL","source_domain":"breitbart.com","text":"In July, Breitbart News reported that federal Judge Frederick J. Scullin Jr., ruled that DC’s ban on carrying firearms in public for self-defense was unconstitutional. Scullin then gave the city a 90-day stay in which to figure out how to respond to the ruling.\nThe city responded by putting a “may issue” concealed permitting process in place, whereby DC residents who proved a need for a gun could acquire the permit to carry one for self-defense.\nOn May 18, Judge Scullin took exception to the requirement that citizens must show a “good reason” for carrying a gun before getting a permit. Scullins ruled that this requirement “impinges on Plaintiffs’ Second Amendment right to bear arms.”\nAccording to The Washington Post, Scullin ruled that “the issue here is not whether the… requirement is a reasonable or wise policy choice. Rather, the issue is whether this requirement, no matter how well intended, violates the Second Amendment.”\nOn February 13, 2014, Ninth Circuit Court of Appeals Judge Diarmuid O’Scannlain wrote the majority opinion for a similar ruling against a “good cause” requirement in California. He stressed that “the right to bear arms includes the right to carry an operable arm outside the home for the lawful purpose of self-defense,” and made clear that requiring a “good cause” for so doing violates this right.\nDC Attorney General Karl A. Racine did not say whether there will be an appeal of Scullin’s ruling, but he did stress his belief that the law containing the “good reason” requirement “is constitutionally valid.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/05/19/judge-declares-dcs-good-reason-requirement-for-concealed-carry-unconstitutional/"}
