{"authors":[],"date_download":"2018-10-22 21:42:30","date_modify":"2018-10-22 21:42:30","date_publish":"2014-06-03 20:26:55","description":"Millions of Americans tour the sites of D-Day, launched 70 years ago today. The vast majority were not yet born. Somber reasons entice them to come.","filename":"data/vaneerConsumption/DDayDrawWhyNormandyStillLuresAmericans70YearsLater.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485246/140603-normandy-dday-cover-1547_02a724b53cb61919f70bfa8e8e928368.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_d-day-draw-why-normandy-still-lures-americans-70-years-n121671_1540244550.html","title":"D-Day Draw: Why Normandy Still Lures Americans, 70 Years Later","title_page":"D-Day Draw: Why Normandy Still Lures Americans, 70 Years Later","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAmericans still arrive by the score on the sands of Normandy more than 70 years after Allied forces stormed the shore there -– drawn by a desire to connect with the audacious landing that happened, for many, well before they were born.\nNormandy’s beaches, cliffs, gun bunkers and cemeteries -– site of the June 6, 1944 Allied landings that turned the tide of World War II –- mark a place where Americans truly stood together, according to sightseers and guides.\n“We won there, but we won at tremendous sacrifice,” said Thom Cartledge, who visited Normandy in 2011 to honor his uncle, Thomas J. Sullivan –- an Army private killed in action during the operation.\n“To make all of that possible, folks back in America had produced airplanes and ships at record speed. They worked overtime. They didn’t demand extra wages. Everybody pulled together. That’s not a sentiment we see a lot today,” Cartledge added. “Some people come because, for them, that’s also what Normandy represents –- it dawns on them that America really is a pretty cool country.\"\nOr, as Edward Piegza, founder of Classic Journeys travel firm, describes Normandy: “It’s a unifying place for our country, an uplifting place where there is a common feeling of right over wrong.”\nEach year, about 1 million people stroll the Normandy American Cemetery overlooking Omaha Beach, according to the American Battlefield Monuments Commission. That makes the memorial, the final resting place for 9,387 troops, the most visited graveyard among the 25 cemeteries tended by that federal agency.\n“There are so few battlefields that Americans can name. But everybody knows the Normandy beaches,” said Mark Sullivan, France editor for Fodor’s Travel Guides.\nSome of that historic resonance flows from the miles of film shot on D-Day, the largest seaborne invasion in history. That morning in 1944, some 60,000 Americans, Brits, Canadians and other Allies stormed a 50-mile swath of the Nazi-fortified coastline from more than 5,000 ships and 13,000 aircraft.\nMost who visit the Normandy coast have seen the footage: troops huddled in landing crafts; iron-spiked “Czech hedgehogs” dotting the beach, meant to rip open boats; waves of men sprinting, crawling, shooting and dying on the sand; and waves of English Channel water turned red by German gunfire.\nBest-selling books and popular movies, such as “Saving Private Ryan,” later brought the sights, sounds and pitched violence of that battle into American homes. And many survivors passed their accounts down to children and grandchildren.\n“There’s this sort of chemistry of being able to physically tap into our collective history,” said Piegza, who has organized five Normandy excursions this year alone. “Even if you’re fuzzy on the details, the place still draws you to become a part of it.”\nHis guests tend to range from their mid-40s to mid-60s, meaning they were born after D-Day. They quietly stroll the sandy landing zones –- once code named “Omaha,” “Utah,” “Gold,” “Juno” and “Sword.”\n“For Americans, these beaches are like holy sites, sacred ground,” said Dominique Eudier, a French woman who serves as the Normandy guide for Classic Journeys.\n“They want to go to the sites where soldiers died for that generation and for the generation now,” said Eudier. Her 92-year-old mother, she said, unknowingly worked for the French resistance, carrying grocery lists by bicycle to nearby markets, and returning home to her own mother with baskets full of bread, eggs, and cheese –- plus secret messages for the French underground working to sabotage the Nazis.\nOn the bluffs above the beaches, many visiting Americans pause at the Normandy American Cemetery, Piegza said.\n“It’s the place that just stops them in their tracks in a way they don’t expect,” Piegza said. “It just hits everybody: All of those crosses and stars of David, a palpable reminder that none of these guys came home.”\nIn that graveyard, Massachusetts tourist Thom Cartledge found the burial plot for his uncle Thomas, his mother’s youngest brother and one of five siblings. It was a visit Cartledge had wanted to make for much of his life.\nThomas J. Sullivan was in his late 20s when he was killed on June 7. According to one historic account, part of Sullivan’s unit that day made an assault on German machine gunners firing from high ground. At least a dozen men from that infantry unit were killed. Sullivan's ancestors don't know exactly how or where he died, Cartledge said.\nIn the grass in front of the marker, Cartledge planted an American flag and a French flag. His escort, a young French girl, used a bucket of sand and a damp sponge to scrub the white cross, darkening the engraved name, unit, rank and date.\n“Then,” Cartledge said, “I asked the young girl how long we could say there. Her answer absolutely blew me away. She said:\n“Your uncle gave his life so that we can be free. You can stay as long as you want.”","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/d-day-draw-why-normandy-still-lures-americans-70-years-n121671"}
