{"authors":[],"date_download":"2018-10-22 21:42:42","date_modify":"2018-10-22 21:42:42","date_publish":"2014-06-05 14:13:20","description":"Veterans who fought on D-Day returned to Omaha Beach and other key sites of World War II with students from College of the Ozarks.","filename":"data/vaneerConsumption/DDayHistoryLessonVeteransTeachStudentsAboutWorldWarII.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/491236/140605-normandy-vets-jms-2043_9e73adb733010b00d03bca040583a406.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_d-day-history-lesson-veterans-teach-students-about-world-war-n123441_1540244562.html","title":"D-Day History Lesson: Veterans Teach Students About World War II","title_page":"D-Day History Lesson: Veterans Teach Students About World War II","title_rss":"NULL","source_domain":"nbcnews.com","text":"That’s certainly true for Jake Howdeshell, 19, who was assigned to Cipolla for this year’s trip. His family in Cherryville, Missouri (pop. 300), holds the military in high regard. Patriotism is a “big thing in my household”; his family throws 90-person reunion parties every July 4th. This trip, in particular, struck a nerve with Howdeshell: his great-grandfather flew over Normandy on D-Day and died in the Battle of the Bulge. Everyone in his family knows about the moment when a serviceman approached his great-grandmother shucking peas and informed her that her husband was dead. She started screaming, and Howdeshell’s grandfather, who was six at the time, hid under the stove.\nHowdeshell sees this trip as an opportunity to hear the stories his great-grandfather never got to tell him.\n“It’s the closest I’m ever going to get to meeting him, so I thought that would be really interesting to see the land he was fighting on,” he said. This week traveling to France was the first time Howdeshell boarded a plane.\n\"You can read about it all you want, but seeing real people who were there in real places—that’s different.”\nCipolla got a chance to chat with Howdeshell at a lunch preceding the last orientation, which took place a few weeks before D-Day. Cipolla, who’d flown in from Rochester, New York, was flanked by Howdeshell on one side and Whitney Garrison, a third-year nursing student, on the other. Both of them spent the meal absorbed by Cipolla’s anecdotes. Garrison, in particular, peppered the veteran with questions about what he remembered and how he felt. Her great-grandfather also fought in World War II, but he never talked about it.\n“He wasn’t very open about it unless you asked pinpoint questions,” she said. “He had mementos on the wall, but especially when he first came back, [my parents said] he didn’t talk about it at all.”\nCipolla used to be like that, too. His parents didn’t ask questions when he returned from Europe, “maybe because they were afraid of learning about the darker moments,” he said. And there were many of those. Besides the more glamorous stories of D-Day and the Battle of the Bulge, Cipolla’s outfit liberated several concentration camps. He remembers the piles of bodies in the trenches, sprayed with bullets by fleeing Germans, and a few people folded among the corpses, still alive, moaning for help.","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/d-day-history-lesson-veterans-teach-students-about-world-war-n123441"}
