{"authors":[],"date_download":"2018-10-22 21:47:51","date_modify":"2018-10-22 21:47:51","date_publish":"2014-06-06 08:01:02","description":"Flags flew at half staff on Omaha Beach, which U.S. troops had the responsibility of assaulting on D-Day.","filename":"data/vaneerConsumption/DDayAnniversaryBarackObamaJoinsWorldLeadersVetsatOmahaBeach.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/491761/140606-obama-normandy-mn-820_eac9d894297cf74af36dfa0ea34a3973.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_d-day-anniversary-barack-obama-joins-world-leaders-vets-omaha-n124261_1540244871.html","title":"D-Day Anniversary: Barack Obama Joins World Leaders, Vets at Omaha Beach","title_page":"D-Day Anniversary: Barack Obama Joins World Leaders, Vets at Omaha Beach","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama paid tribute to American and Allied forces who fought and died in the D-Day landings 70 years ago Friday, describing the shores of Normandy as \"democracy's beachhead.\"\nThe president addressed a crowd of almost 15,000 gathered under calm blue skies at Colleville-sur-Mer, a cemetery close to Omaha beach, where some 2,500 U.S. servicemen died in the invasion. More than 200 veterans of the invasion were on hand for the ceremony.\nThere are 9,387 U.S. personnel buried at the cemetery, which played host to one of the numerous services across northern France commemorating the 70th anniversary of the bloody amphibious assault that turned the tide of World War II on June 6, 1944.\n\"They left home barely more than boys and returned home heroes,\" Obama said at Omaha where the fighting was so fierce it earned the name \"Hell’s Beach.\"\n\"Normandy, this was democracy's beachhead. And our victory in that war decided not just a century, but shaped the security and well-being of all posterity,\" Obama said. \"Whenever the world makes you cynical - stop and think of these men.\"\nIn an exclusive interview with NBC's Brian Williams, Obama marveled at the Allied troops who stormed the beaches and liberated Europe — men who he said \"showed such extraordinary courage,\" then returned home and \"didn't really make a fuss about it.\"\nObama also reflected on his own grandfather, the late Stanley Dunham, who crossed the English Channel in a supporting wave of troops six weeks after D-Day.\n“My grandfather passed away over 20 years ago,” the president said. “This is one of those days where I thought to myself, ‘It would have been nice to have him here.’”\nThe extended interview with Obama airs Friday night on \"NBC Nightly News.\"\n\"So many of us have in our families, you know, these men who were so young when they came here and showed such extraordinary courage and capacity and changed the world, and then go back home and settle down and didn't really make a fuss about it,\" Obama said.\nDunham, the president's maternal grandfather, died in 1992. He was a supply sergeant in the U.S. Army Air Forces in 1944. He and his maintenance company followed the Allied front across France.\nDuring Obama's speech at Omaha on Friday, French and American flags fluttered in a gusty breeze behind the president, who together with French President Francois Hollande addressed an audience seated against a backdrop of rows upon rows of headstones.\nAfter Obama arrived via helicopter from Paris, where he had met Hollande for dinner on Thursday night, a military band played the French and U.S. national anthems.\nLater the two world leaders walked to an observation deck at Omaha and looked across the beach for a few moments. Obama then met veterans from World War II and the Iraq and Afghanistan wars, several of whose stories he had mentioned in his speech.\nOther services of varying sizes were going on in and around the five landing sites of the invasion to honor the more than 150,000 American, British, Canadian and other Allied D-Day troops who risked and gave their lives to defeat Adolf Hitler's Third Reich.\nBritain's Queen Elizabeth II attended a separate event at Bayeux cemetery, before meeting Obama and Hollande ahead of a group lunch at the nearby Chateau de Benouville.\nAlso at the lunch was Russian President Vladimir Putin and German leader Chancellor Angela Merkel, among others, and before sitting down to dine the group posed for a carefully choreographed group photo.\nAlthough Obama and Putin were several places away from each other at both the photo opportunity and the dinner table, the White House confirmed the leaders used the opportunity to have their first face-to-face discussion since the deterioration of U.S.-Russian relations following the outbreak of the Ukraine crisis.\nPutin, Merkel, and the newly elected Ukraine President Petro Poroshenko also met on the sidelines, with the Kremlin saying the threesome spoke of a mutual desire to end the bloody conflict still raging in the east of Ukraine.","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/d-day-anniversary-barack-obama-joins-world-leaders-vets-omaha-n124261"}
