{"authors":[],"date_download":"2018-10-22 21:50:47","date_modify":"2018-10-22 21:50:47","date_publish":"2014-06-06 17:51:41","description":"In 1984, on the 40th anniversary of D-Day, Tom Brokaw met with World War II vet Leonard Lomell to discuss what some had called a \"suicide mission.\"","filename":"data/vaneerConsumption/DDayLookBackTomBrokaws1984ConversationWithWWIIHero.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/492946/x_30_nn_lomell_140606_280eaa3207bc348860c701d96ac17d03.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_d-day-look-back-tom-brokaws-1984-conversation-wwii-hero-n124676_1540245047.html","title":"D-Day Look Back: Tom Brokaw's 1984 Conversation With WWII Hero","title_page":"D-Day Look Back: Tom Brokaw's 1984 Conversation With WWII Hero","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn 1984, Tom Brokaw traveled to the beaches of Normandy to mark the 40th anniversary of D-Day. During that trip, he spoke with World War II veteran Leonard Lomell about the day he helped save Utah Beach from what could have been a massacre.\n1st Sgt. Lomell was just 24 when he and other soldiers in the 2nd Ranger Battalion, D-Company were charged with scaling a cliff at Pointe du Hoc to destroy large German guns that were believed to be stationed there.\nBut it turned out the coastal guns had been moved. His battalion eventually found them, and discovered they were all aimed at Utah Beach.\n\"It was perhaps one of the most important missions of D-Day,\" said Lomell.\nHe and the other Rangers disabled the guns, and in doing so, gave the Allies a much-needed win. Tom Brokaw wrote about Lomell's heroism in his book, \"The Greatest Generation.\"\nLomell died in 2011, but is survived by his wife, Charlotte Lomell, and their three children, as well as several grandchildren and great-grandchildren.\nIn a statement on the 70th anniversary of D-Day, Lomell’s family said:\n\"On D-Day we remember all the brave men who dared and those who died. We miss Dad and his Ranger brothers. We treasure the hospitality and generosity of our friends in Normandy who continue to honor their memory with flowers, ceremonies, and memorials. \"\nBelow, hear more from Lomell in his 1984 conversation with Tom Brokaw.","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/d-day-look-back-tom-brokaws-1984-conversation-wwii-hero-n124676"}
