{"authors":[],"date_download":"2018-10-22 21:54:03","date_modify":"2018-10-22 21:54:03","date_publish":"2014-06-06 20:44:55","description":"See rare pictures from Normandy taken by a U.S. Army technician who carried a Kodak camera onto the battlefield.","filename":"data/vaneerConsumption/DDaySurvivorsPhotosFromtheBattlefield.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/493606/x_30_nn_maurysstory_140606_991cf76dd9cde3001117a9b4b822aa12.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_d-day-survivors-photos-battlefield-n124896_1540245243.html","title":"D-Day Survivor's Photos From the Battlefield","title_page":"D-Day Survivor's Photos From the Battlefield","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMaurice Solomon, 91, was just a 20-year-old kid from Brooklyn when he joined the Army. Almost all the young men in his high school graduating class went on to join the service, driven by patriotism and the desire to participate in World War II.\nOn his journey to Europe, he brought along a camera: an old Kodak that had been in the family for years.\nHe joined the 294th Joint Assault Signal Company and was part of a team specializing in communications.\nEarly in the morning of D-Day, Solomon had the old camera in his pocket. It weighed about a pound and could only take eight pictures per roll. It was cumbersome and re-loading the film was difficult. But as his group approached the shore of Omaha Beach that morning, he started snapping photos.\nOver the next few days he took pictures of the scenes he thought were most interesting, not realizing he was capturing images from one of the most significant events in recent history.\nIn the midst of it all, he refused to photograph his fallen brothers out of respect for them and the lives they had given for their country.\nSometime later, a relative mailed Solomon photo-developing chemicals. He rigged a system under the night sky on the battlefield, mixing some of the chemicals in his helmet and more in a buddy’s helmet.\nLo and behold, he was able to print negatives of that important day -- and the weeks that followed D-Day. It wasn’t until he got back to the United States that he could finally turn those negatives into photographs.\nToday, Solomon still has that old camera, and a roll of film. But even more than that, he has the memories of a historical conflict -- in the form of photographs -- that he has been able to share with friends, family and colleagues who survived World War II.","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/d-day-survivors-photos-battlefield-n124896"}
