{"authors":[],"date_download":"2018-10-22 20:28:43","date_modify":"2018-10-22 20:28:43","date_publish":"2014-06-01 20:36:25","description":"A bomb blast targeting a television viewing center for football in Nigeria killed an unknown number of people on Sunday, a security source said.","filename":"data/vaneerConsumption/DeadlyBombHitsFootballTVShowinginNortheastNigeriaReports.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_deadly-bomb-hits-football-tv-showing-northeast-nigeria-reports-n119806_1540240123.html","title":"Deadly Bomb Hits Football TV Showing in Northeast Nigeria: Reports","title_page":"Deadly Bomb Hits Football TV Showing in Northeast Nigeria: Reports","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA bomb blast targeting a television viewing center for football in northeast Nigeria killed an unknown number of people on Sunday, a security source and resident said.\nThe bomber struck the town of Mubi in Adamawa state in the evening, said resident Emmanuel Akinyele, a church pastor.\nA military source said several bodies had been recovered, and the dead and wounded were still being evacuated from the area. The death toll was not clear, the source said.\nThere was no immediate claim of responsibility. Islamist militant group Boko Haram, whose struggle for an Islamic state is concentrated in the northeast, would be the prime suspect.\nThe group has set off several bombs across north and central Nigeria in the past two months.\nLast weekend, a suicide bomber set out to strike an open-air viewing of a football match in the central city of Jos, but his car blew up before reaching the target, killing three people.\nA suicide bombing the week before in Jos killed 118 people, and two bombs on the outskirts of Abuja in April killed 95 between them.\nThe group is still holding more than 200 girls that it abducted on April 14.\n- Reuters","url":"https://www.nbcnews.com/news/world/deadly-bomb-hits-football-tv-showing-northeast-nigeria-reports-n119806"}
