{"authors":[],"date_download":"2018-10-22 22:13:12","date_modify":"2018-10-22 22:13:12","date_publish":"2014-05-09 14:15:20","description":"Armed groups described as “the more extreme kind” have taken over a military airport where some of Syria's chemical materials were being stored.","filename":"data/vaneerConsumption/DeadlyChemicalsinExtremistHandsFearsGrowinSyria.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_deadly-chemicals-extremist-hands-fears-grow-syria-n101386_1540246392.html","title":"Deadly Chemicals in Extremist Hands? Fears Grow in Syria","title_page":"Deadly Chemicals in Extremist Hands? Fears Grow in Syria   ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nExtremist Syrian rebels may have taken over an airport where 16 containers of chemical components that could be used make the nerve agent Sarin and Mustard Gas are being stored, according to the Organization for the Prohibition of Chemical Weapons.\nThe armed groups had surrounded the base close to Damascus are \"the more extreme kind,\" Sigrid Kaag, the head of the mission responsible for disposing Syria's chemical weapons arsenal told The Associated Press on Thursday. \"Global jihad has come to Syria.\"\nIt is not possible at the moment to arrange a cease-fire and get to the large military airfield by road, she added, according to the AP.\nIt is very difficult for journalists to work in Syria, which is in its third year of a brutal civil war, and NBC News was not able to verify the Kaag's claims.\nIt would take \"less than a working week\" to pack the most dangerous chemicals into five containers and the less toxic chemicals into 11 containers, put them on a convoy and get them to the port of Latakia, the AP quoted her as saying. Danish and Norwegian ships are waiting in the port city to take the containers to a U.S. vessel for destruction.\nEarlier this week Reuters reported that activists said the fighters surrounding the base near Damascus are from the Islamic Front - one of the largest and most powerful Islamist rebel coalitions - the Rahman Corps and Ahmad Abdo Brigades.\nSyria has been removing 1,300 metric tons of chemical weapons under a deal reached last year, which averted Western military strikes, after a sarin gas attack on rebel-held suburbs around the Syrian capital in August.\nSyria's government has missed several deadlines to ship out the toxins - the last of which was April 27 - and has said the site referred to by Kaag is difficult to reach because of the fighting.\nReuters and The Associated Press contributed to this report.\n-Henry Austin and Charlene Gubash","url":"https://www.nbcnews.com/news/world/deadly-chemicals-extremist-hands-fears-grow-syria-n101386"}
