{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:10:35","date_modify":"2018-10-30 19:10:35","date_publish":"2016-02-17 16:28:58","description":"A new CNN/ORC Poll shows a seat heat between Hillary Clinton (48%) and Bernie Sanders (47%) in Nevada.","filename":"data/vaneerConsumption/DeadHeatClintonSandersTiedinNewNevadaPoll.json","image_url":"https://media.breitbart.com/media/2016/02/Dem-debate-Wisconsin-Morry-Gash-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_17__1540926635.html","title":"Dead Heat: Clinton, Sanders Tied in New Nevada Poll","title_page":"Dead Heat: Clinton, Sanders Tied in New Nevada Poll | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new CNN/ORC Poll shows an almost even split between likely Democratic caucusgoers in Nevada in their support for Hillary Clinton (48%) and Bernie Sanders (47%) ahead of this Saturday’s caucuses.\nSanders gained tremendous traction since he announced his candidacy last year and enjoys the support of millennials, while Clinton has the majority backing of women and voters over the age of 55.\nThe economy remains the overwhelmingly top-rated issue among likely Democratic voters polled by CNN/ORC, receiving 42%. However, when asked who would better handle the economy, Clinton received 48%, while Sanders, who has made a taxing Wall Street a main point of his platform, received nearly the same amount of support, 47%.\nThe largest gap between the Democratic presidential candidates came on the issue of foreign policy. Asked who would better handle that arena, Clinton, a former secretary of state, received an overwhelming 68% of the vote, while Sanders received 28%. Clinton also led Sanders on the issues of race relations, health care and immigration.\nLatinos and blacks are expected to make up about one-third of voters in the Nevada caucuses.\nAsked which candidate “best represents the values of a Democrat like yourself,” Clinton received 50% and Sanders 49%, and it was 50% to 47% for which candidate would best represent the middle class. Sanders consistently suggested his ideas “are not radical” and has insisted that he will make Wall Street bail out the middle class.\nCNN’s poll points out that Clinton will likely fare better among voters who have both participated in caucuses in the past, as well as those who said they would “definitely” be participating this Saturday. Meanwhile, Sanders has the backing of newer voters in addition to those who are slightly less certain whether they will show up on Saturday.\nThe poll was conducted by telephone between February 10-15 among 1,006 randomly-selected adults who reside in Nevada. CNN/ORC notes that results among the 282 likely Democratic primary voters include a margin or error that is plus or minus 6 percentage points. The full poll can be found here.\nFollow Adelle Nazarian on Twitter @AdelleNaz.","url":"https://www.breitbart.com/politics/2016/02/17/3061821/"}
