{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:45:06","date_modify":"2018-10-30 18:45:06","date_publish":"2015-03-30 17:39:53","description":"Deadline co-editor-in-chief Mike Fleming Jr. apologized Sunday for his outlet's publishing of a much-maligned piece that suggested television pilots' increased casting of minority actors in the 2015 season represented \"too much of a good thing.\"","filename":"data/vaneerConsumption/DeadlineApologizesforEthnicCastingsArticle.json","image_url":"https://media.breitbart.com/media/2015/03/Empire-Season-1-Fox.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_30__1540925106.html","title":"Deadline Apologizes for 'Ethnic Castings' Article","title_page":"Deadline Apologizes for 'Ethnic Castings' Article | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Deadline co-editor-in-chief Mike Fleming Jr. apologized Sunday for his outlet’s publishing of a much-maligned piece that suggested television pilots’ increased casting of minority actors in the 2015 season represented “too much of a good thing.”\nThe article, titled “Pilots 2015: The Year of Ethnic Castings – About Time or Too Much of a Good Thing?” written by Deadline editor Nellie Andreeva, touched off a firestorm of criticism from media outlets and ethnic media groups after it was posted early last week.\n“That original headline does not reflect the collective sensibility here at Deadline,” Fleming wrote in his weekly column at the site. “The only appropriate way to view racial diversity in casting is to see it as a wonderful thing, and to hope that Hollywood continues to make room for people of color.” The column goes on:\nThe missteps were dealt with internally; we will do our best to make sure that kind of insensitivity doesn’t surface again here. As co-editors in chief, Nellie and I apologize deeply and sincerely to those who’ve been hurt by this. There is no excuse. It is important to us that Deadline readers know we understand why you felt betrayed, and that our hearts are heavy with regret. We will move forward determined to do better.\nFleming also wrote that he struggled with whether or not to take down the offending article, but ultimately decided that “the damage was done.”\nI don’t believe you can can make an unwise story disappear and pretend it didn’t happen. I observed how Amy Pascal raced around with knee-jerk apologies to anyone who’d listen, after those stolen Sony e-mails surfaced. Her actions felt like panicked damage control to me; we decided to face the consequences and take our lumps. We did that in the comment tail following that story, where over 700 readers teed off on us. Nellie is trained in the sciences and used those sensibilities to analyze a data sample; the word “ethnic” is commonly used by casting agents. None of that works when talking about people, and race. Our writers, and editors, can be so focused on the trees they sometimes forget to look at the forest, or in this case, the readers who are much more than statistics. A perfect storm of events left us vulnerable, including me choosing the worst time to be zonked from a 22-hour return flight from New Zealand, and normally smart editors on duty failing to respond decisively even after a torrent of hostile comments rolled in.\nThe article drew widespread condemnation from celebrities, ethnic media groups, and media outlets alike after its publication. Scandal showrunner Shonda Rhimes was one of the first to respond, calling the article “ignorant,” while the Washington Post‘s Alexandra Petri called it “an insult to all TV viewers.”\nA coalition of ethnic media groups, including the NAACP and the National Hispanic Media Coalition, blasted the article last week, calling it full of “inaccuracies and misconceptions.”","url":"https://www.breitbart.com/entertainment/2015/03/30/deadline-apologizes-for-ethnic-castings-article/"}
