{"authors":[],"date_download":"2018-10-22 21:47:24","date_modify":"2018-10-22 21:47:24","date_publish":"2014-05-08 13:36:28","description":"Police were continuing to probe the mysterious deaths in the exclusive Tampa enclave of Avila, where a fire ripped through a mansion on Wednesday.","filename":"data/vaneerConsumption/DeadlyTampaFireatJamesBlakesHomeUnderInvestigation.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/428721/avila2-ejo-50714_71792fd1862df1293dff6c1b07be6763.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_deadly-tampa-fire-james-blakes-home-under-investigation-n100256_1540244844.html","title":"Deadly Tampa Fire at James Blake's Home Under Investigation","title_page":"Deadly Tampa Fire at James Blake's Home Under Investigation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA man who died with his wife and two children in a Florida house arson fire Wednesday outside Tampa purchased fireworks over the weekend like those found at the scene.\nAuthorities have said they think the fire at the five-bedroom home was intentionally set but stopped short of calling the case a murder-suicide.\nDarrin Campbell, his wife Kimberly and their two teenagers died in the blaze at the home owned by former professional tennis player James Blake.\nThe mysterious deaths have stunned Tampa’s exclusive country club community of Avila, where sheriff's deputies returned Thursday morning. Gruesome details in the Wednesday morning inferno revealed that firefighters found fireworks and accelerant amid the rubble, reported NBC affiliate WFLA.\nThe Hillsborough County Sheriff’s Office said Blake was leasing the home for the past two years to the Campbell family.\n“We’re still going to have to wait for the medical examiner to determine the exact cause of death and what those particular injuries were,” sheriff’s Col. Donna Lusczynski told reporters.\nTwo of the victims were found with upper-body trauma, Lusczynski said without elaborating. The adults were found in one room, while the teenagers were found in two separate rooms.\nThe blaze was called in before 6 a.m., when neighbors said they heard a “popping” noise coming from the home.\n“I was walking my dog and the house just exploded,” a frantic caller said in a 911 call.\n“The house is engulfed in flames!” she added.\nOfficials said small commercial fireworks found at the scene were the likely cause of the explosion.\nDarrin Campbell purchased the fireworks on Sunday, William Weimer, vice president of Phantom fireworks, told The Associated Press on Thursday by telephone from the company's Ohio headquarters.\nCampbell bought six packages of small firecrackers and about that many packs of aerial fireworks designed to shoot into the air, said Weimer, who described them as backyard fireworks someone would shoot off on the Fourth of July. He said the fireworks could have started a fire but it would have spread slowly.\nThe amount of powder inside the fireworks was smaller than the size of an aspirin, he said.\nHeavy winds made fighting the fire difficult as flames ripped through the two-story, 6,000-square-foot-plus home. At first, crews located two bodies. Then a third, and then a fourth.\n“It’s a very arduous task and takes some time just because of the debris from the fire and water damage that was there,” Lusczynski said of sifting through the home, adding that there is still evidence remaining that wasn’t destroyed.","url":"https://www.nbcnews.com/news/us-news/deadly-tampa-fire-james-blakes-home-under-investigation-n100256"}
