{"authors":["Press Association"],"date_download":"2018-10-22 21:30:56","date_modify":"2018-10-22 21:30:56","date_publish":"2016-01-28 07:50:15","description":"Three dead sperm whales which washed up on the Lincolnshire coast have been removed in a five-hour operation. A team of 14 workers started the process at Ske...","filename":"data/vaneerConsumption/Deadwhalesremovedfromskegnessbeach.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-d4777768-3a57-4e6e-a7c8-562e22e9fe6c-4vVdYopwYQ7f641721b07aa72042-35_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420287_Dead-whales-removed-Skegness-beach_1540243856.html","title":"Dead whales removed from skegness beach","title_page":"Dead whales removed from skegness beach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dead whales removed from Skegness beach\nThree dead sperm whales which washed up on the Lincolnshire coast have been removed in a five-hour operation.\nA team of 14 workers started the process at Skegness just after 8pm on Wednesday.\nThe whales, believed to weigh around 30 tons, were found on the beach at the weekend and are believed to be part of the same pod as others found in Hunstanton, Norfolk, and Wainfleet, Lincolnshire.\nWork begins to remove of one of the sperm whales at Skegness\nContractor Jan Smith had said he expected the job to take up to eight hours but it was smoother than expected, finishing at 1.30am.\nHe said: \"It's gone very well really. The last one where the flaps had been cut open for the autopsy was hard work.\n\"You can't really plan what you are going to do because you don't know if they are likely to blow up or something. All that you can do is treat them with the utmost respect.\"\nHundreds of people have been to see the whales in the town since they were discovered.","url":"https://www.dailymail.co.uk/wires/pa/article-3420287/Dead-whales-removed-Skegness-beach.html"}
