{"authors":["Associated Press"],"date_download":"2018-10-23 00:21:42","date_modify":"2018-10-23 00:21:42","date_publish":"2017-04-26 10:00:30","description":"PALAMPUR, India (AP) - Women wailed as Indian soldiers carried a flag-draped coffin holding the body of one of their colleagues killed this week in a deadly...","filename":"data/vaneerConsumption/DeadlyambushraisesfearsofrebelresurgenceinIndia.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/10/wire-464293-1493199930-719_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446894_Deadly-ambush-raises-fears-rebel-resurgence-India_1540254102.html","title":"Deadly ambush raises fears of rebel resurgence in India","title_page":"Deadly ambush raises fears of rebel resurgence in India | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PALAMPUR, India (AP) - Women wailed as Indian soldiers carried a flag-draped coffin holding the body of one of their colleagues killed this week in a deadly ambush by autonomy-seeking Maoist rebels.\nThe attack, which killed 25 soldiers, has raised fears that the five-decade insurgency is seeing a revival. This year is already one of the bloodiest in recent years, with 72 soldiers killed in the rebel heartland of Chhattisgarh. By comparison, 36 were killed during all of last year.\n\"You let him die,\" Kumar's 15-year-old daughter cried to the soldiers carrying the body of her father to his home in the northern hill town of Palampur on Tuesday night. \"Why didn't you do something?\"\nWomen grieve as they await the arrival of the body of Indian paramilitary soldier Sanjay Kumar at his home in Palampur, about 40 kilometers (25 miles) south of Dharmsala, India, Tuesday, April 25, 2017. Kumar was among 25 Indian paramilitary soldiers who were killed by Maoist rebels in central India on Monday in one of the worst attacks on the country's security forces in recent years. (AP Photo/Ashwini Bhatia)\nIndian soldiers have been battling the rebels across several central and northern states since 1967, when the militants - also known as Naxalites - began fighting to demand more jobs, land and wealth from natural resources for the country's poor indigenous communities. The government has said the insurgents, inspired by Chinese revolutionary leader Mao Zedong, pose the country's most serious internal security threat.\nBefore this year, the deadliest Maoist attack was in 2010, when rebels killed 76 soldiers in Chhattisgarh, one of India's poorest states despite vast mineral riches. Rebel attacks in other Indian states are less frequent, but also sometimes result in casualties.\nAnalysts said Prime Minister Narendra Modi's government is slipping in its commitment to fight the rebels, and that authorities should be deploying more police and paramilitary troops while simultaneously focusing on boosting economic development for poor villagers who may be moved to support the rebels.\n\"It's as if no lessons have been learned from similar attacks in the past,\" said Ajai Sahni, a security analyst in New Delhi.\nThe troops attacked on Monday had been having lunch along a partially built road cutting through scrubland, taking a break from scouting the area ahead of a construction team, when they were ambushed by about 300 armed rebels, touching off a three-hour gunbattle.\n\"I find it incomprehensible that the Indian state cannot deploy enough soldiers to protect 70 kilometers of road within the country,\" Sahni said.\nFacing a resurgence in the rebellion, the government should change its standard deployment and surveillance tactics, he said. Authorities also need to improve living standards for local villagers, noting that none had warned the troops about the presence of hundreds of armed rebels moving through the region.\nYears of neglect - marked by a lack of jobs, school and health care clinics - have helped to isolate the local villagers, making them open to overtures by the rebels, who speak their tribal languages and have promised to fight for a better future with more education and job opportunities.\nThe \"government needs to reduce the economic deprivation, which has led to an alienation of the local people,\" Lt. Gen. (Ret.) Raj Kadyan, a defense analyst, told India Today television channel.\nOther analysts noted that Monday's attack occurred when the soldiers deviated from the standard operating procedures by sitting as a group for lunch, without anyone standing watch, as reported by soldiers who survived the attack.\nOne survivor said they'd first been approached by villagers, whom the rebels then followed.\n\"We thought it was a group of villagers coming toward us, when the rebels began firing from behind,\" said Sher Bahadur, who was among six soldiers injured.\nThe rebels then opened fire from another flank, at which point the soldiers retaliated, killing or injuring an unknown number, he said. When paramilitary reinforcements arrived, the rebels scattered and fled back into the wild, carrying the bodies of the fallen militants with them.\nState officials said the military retaliation was slowed by the fact that the Maoists were using villagers as human shields. Federal Home Minister Rajnath Singh described the killings as \"cold-blooded murder\" carried out in an attempt to destabilize the state government.\n\"It's a desperate attempt to block development in the state,\" Singh said, suggesting the rebels were trying to stop roads from being built to improve transportation and access for villagers and thus diminish the rebels' influence. He said the government would not be deterred.\n\"The government will take this strike as a challenge,\" he said.\nThe tough talk and promises of military retribution offered little comfort to the mourners at Kumar's funeral Tuesday night.\nHis brother said Kumar was brave in facing the rebel danger.\n\"He used to say that every time he went on an operation in the jungle, he didn't know if he would come back alive,\" said Vijay Kumar. \"His fears have become a reality with this attack.\"\n___\nGeorge reported from New Delhi.\n___\nFollow Nirmala George on Twitter at twitter.com/NirmalaGeorge1","url":"https://www.dailymail.co.uk/wires/ap/article-4446894/Deadly-ambush-raises-fears-rebel-resurgence-India.html"}
