{"authors":[],"date_download":"2018-10-22 22:24:21","date_modify":"2018-10-22 22:24:21","date_publish":"2016-01-11 03:01:48","description":"A missile strike on a Doctors Without Borders clinic in Yemen killed at least four people, the group said, condemning what it called a \"worrying pattern\" of ...","filename":"data/vaneerConsumption/DeadlystrikeonYemenMSFclinicdrawscondemnation.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z1c8-3bWLCvS3pZb5eb4fce05c5f68763-353_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3392628_Strike-MSF-Yemen-clinic-kills-four_1540247061.html","title":"Deadly strike on Yemen MSF clinic draws condemnation","title_page":"Deadly strike on Yemen MSF clinic draws condemnation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Deadly strike on Yemen MSF clinic draws condemnation\nA missile strike on a Doctors Without Borders clinic in Yemen killed at least four people, the group said, condemning what it called a \"worrying pattern\" of such attacks.\nThe raid was the third of its kind in four months in the war-ravaged country, where a Saudi-led coalition has been battling Shiite Huthi rebels who have seized territory from the internationally-recognised government.\nIt also follows a US strike in Afghanistan on a facility run by the Paris-based medical humanitarian organisation, known by its French acronym MSF, which killed 42 people.\nA missile has hit a health centre operated by Doctors Without Borders (MSF) in northern Yemen, killing three people and wounding 10 others\nMSF could not specify whether the medical facility was hit in an air strike by the Saudi-led coalition or by a rocket fired from the ground.\nThree MSF staff were among 10 people wounded in the Yemen strike, and two other members of staff were in \"critical condition\", MSF said in a statement.\n\"The numbers of casualties could rise as there could still be people trapped in the rubble,\" it said, adding that the missile hit the medical facility in the Razeh district of Saada province.\nAll staff and patients had been evacuated, with the patients being transferred to another MSF-supported hospital in Saada, it said.\nMSF director of operations Raquel Ayora denounced the strike and repeated that the organisation constantly shares the coordinates of its facilities with those fighting in Yemen.\n\"There is no way that anyone with the capacity to carry out an air strike or launch a rocket would not have known\" that the clinic was a functioning health facility supported by MSF, Ayora said.\n\"We strongly condemn this incident that confirms a worrying pattern of attacks to essential medical services and express our strongest outrage as this will leave a very fragile population without healthcare for weeks,\" said Ayora.\n\"Once more it is civilians that bear the brunt of this war,\" she added.\n- MSF hospitals hit -\nMSF last month accused the coalition of bombing its clinic in Taez, southwest Yemen, wounding nine people including two staff members.\nThe coalition said it would investigate that claim although it has repeatedly insisted it does not attack civilians.\nAnd in October, air strikes hit another hospital run by MSF near Saada without causing any deaths.\nMSF facilities have also been hit elsewhere, with the deadliest recent strike coming during a US air raid on the hospital in the Afghan city of Kunduz.\nWashington has said the October strike, which came as NATO-backed Afghan forces clashed with insurgents for control of the northern provincial capital, was \"caused primarily by human error\".\nThe EU led international condemnation of the latest strike, describing it as an \"unacceptable attack\".\nSaada is the heartland of the Shiite Huthi rebels that the coalition has been bombing since March in support of Yemen's beleaguered government.\nMore than 5,800 people have been killed in Yemen since the start of the bombing campaign, about half of them civilians, according to the United Nations.\nAt least 27,000 people have been wounded and 80 percent of the population is in need of humanitarian aid, according to UN figures.\nThe UN envoy for Yemen, Ismail Ould Cheikh Ahmed, arrived in Sanaa on Sunday to convince the rebels and their allies to attend a new round of peace talks.\nHe had met with Yemeni government officials temporarily based in Riyadh, before he headed to Sanaa.\nForeign Minister Abdel Malak al-Mekhlafi told AFP the talks, initially scheduled to start on January 14 had been postponed until January 20 or 23.\nThe government sat down with the rebels and their allies last month in Switzerland for six days of talks that ended without a major breakthrough.\nAlso on Sunday, Yemeni intelligence colonel Ali Saleh al-Nakhibi was shot dead by unidentified gunmen in second city Aden, a security official said.\nMSF in Yemen: 2015 ©Laurence Saubadu (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3392628/Strike-MSF-Yemen-clinic-kills-four.html"}
