{"authors":[],"date_download":"2018-10-30 20:53:04","date_modify":"2018-10-30 20:53:04","date_publish":"2018-07-16 16:56:00","description":"Gov. Nathan Deal endorsed Lt. Gov. Casey Cagle on Monday in the race to succeed him, giving the Republican candidate key support from a popular incumbent in his July 24 race against Secretary of State Brian Kemp.","filename":"data/vaneerConsumption/DealendorsesCaseyCagle.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/16/Videos/4439352.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_4dc58426831a5bde13acebd6756bd8eb__1540932784.html","title":"Deal endorses Casey Cagle","title_page":"Georgia governor election 2018: Deal endorses Casey Cagle","title_rss":"NULL","source_domain":"ajc.com","text":"Gov. Nathan Deal endorsed Lt. Gov. Casey Cagle on Monday in the race to succeed him, giving the Republican candidate key support from a popular incumbent in his July 24 race against Secretary of State Brian Kemp.\nThe governor called Cagle the best candidate to continue his “tradition” of conservative leadership, making the announcement during a question-and-answer session at the end of an unrelated press conference at the state Capitol.\n“My point of view is not personal. I have known both of these candidates in our Republican runoff, and I think very highly of both of them,” Deal said. “My concern is, let’s not undo, or transform in a negative fashion, the good reforms that we’ve put in place.”\nThe governor added: “That will be the challenge for the next governor of this state: To not go backwards, but to go forward. And for that reason, I believe Casey Cagle will be the best candidate.”\nFor Cagle, the decision was a shot in the arm after a trying week. Kemp’s campaign released another damaging snippet of the secretly made recording that has jolted the race. And an Atlanta Journal-Constitution/Channel 2 Action News poll showed him narrowly trailing Kemp.\nHe’s aiming to rebound strongly in the final stretch of the race, which included boisterous weekend rallies with the National Rifle Association’s president-elect, Oliver North, and a sharp rebuttal to Kemp’s attacks about the recording during Sunday’s final televised debate on Channel 2.\n“This is a man with great integrity and great character,” said Cagle, who cast himself as an extension of Deal’s legacy. “To have his confidence reflects exactly the type of governor that I’ll be.”\nKemp, meanwhile, aims to counter with his own burst of momentum. Former state Sen. Hunter Hill, who finished in third place in the primary with 18 percent of the vote, will endorse Kemp at a Tuesday rally.\nKemp’s campaign said it was a “last-minute attempt’ by Cagle to distract from the covertly recorded audio of the lieutenant governor, who is heard saying the Republican race is a competition over “could be the craziest.”\nBoth Cagle and Kemp had jockeyed for Deal’s support for the past year. At campaign stops, Cagle talks about the “Deal-Cagle team” and invokes the governor’s legacy every chance he gets. Kemp has pledged to build on the governor’s economic policy and adapted Deal’s “No. 1 state in the nation for business” mantra.\nThe governor had long stayed studiously quiet on the sidelines as the race for his job has evolved, warning only through his top aide that he’ll respond harshly to any candidate who critiques his legacy.\nThat started to change in recent weeks as some of Cagle’s key supporters – many of whom were also Deal’s early allies – urged him to endorse the lieutenant governor.\nChannel 2 hosted Casey Cagle and Brian Kemp at the debate.\nAnd Deal recently met privately with roughly three dozen executives in bank boardroom in Gainesville – the hometown of both Deal and Cagle – telling them they should step up for Cagle if they wanted the North Georgia town to retain its outsized political influence.\nA pair of Atlanta Journal-Constitution/Channel 2 Action News polls earlier this year showed why Deal’s help was so coveted.\nOne showed roughly half of Democrats approve of the way he’s handled his job as governor. In a separate poll of Republicans, a whopping 85 percent gave him positive reviews.\nThat makes him far more popular than President Donald Trump, who earned an 80 percent approval rating from Republicans — and only about 7 percent from Democrats. And Deal is towering over institutions such as Congress and the state Legislature.\n‘Silent majority’\nThough the two both live in Hall County and have similar political bases, Deal’s endorsement of Cagle was not a given.\nAfter Deal’s veto of a “religious liberty” bill, Cagle said a “silent majority” of voters backed the measure. And Deal’s allies seethed when Cagle effectively spiked a tax break on jet fuel supported by the governor after Delta Air Lines cut marketing ties with the NRA.\nAnd there’s a history of incumbents staying neutral in Republican runoffs: Then-Gov. Sonny Perdue never formally endorsed Deal or his rival, Karen Handel, in the acrimonious 2010 runoff even though he was long seen as a Handel ally. “Either way, we can’t go wrong,” Perdue said days before that vote.\nThe lieutenant governor worked to mend fences. He’s hired former aides to the governor to advise his campaign and recruited many of his heftiest donors. And he talks about the pair as a team who worked in lockstep to further conservative causes, such as tax breaks and the criminal justice overhaul.\nIt’s not immediately clear to what extent Deal will be involved in Cagle’s bid for office, such as whether he’ll appear at campaign rallies or in TV ads. But he could be particularly influential in Hall County, a Republican stronghold where Deal racked up huge margins – and Cagle underperformed in the primary May 22.\nHill’s decision, meanwhile, is no surprise given his icy relationship with Cagle.\nDuring the primary, Cagle relentlessly attacked Hill because he favored a showdown against Kemp in the runoff. And Hill’s decision was surely made easier by the secretly made recording, where Cagle is heard saying he supported what he described as “bad public policy” to deprive Hill of key outside support.\nStill, Cagle’s campaign hoped he would stay neutral in the contest – and his allies were pressuring Hill to remain on the sidelines. That’s because Hill, who represented an Atlanta-based state Senate district, performed well in parts of the state where Cagle hopes to dominate.\nHe finished in second place to Cagle in Cobb and Fulton counties, edging out Kemp in those vote-rich territories. He also came within a whisker of winning some conservative northwest Georgia territories. And he narrowly carried Glynn County, where some affluent GOP donors have second homes.","url":"https://www.ajc.com/news/state--regional-govt--politics/deal-endorses-cagle-georgia-gov-race/o3J1M2hJOEUdhRRYLEtJlN/"}
