{"authors":["Adrien Begrand"],"date_download":"2018-10-22 20:34:16","date_modify":"2018-10-22 20:34:16","date_publish":"2014-09-04 00:00:00","description":"Like it or not, Babymetal — a trio of teenage Japanese singers who fuse bubbly pop with heavy riffs — is one of the biggest stories in heavy metal in 2014.","filename":"data/vaneerConsumption/DealWithItHeadbangersBabymetalIsHere.json","image_url":"https://media.npr.org/assets/img/2014/09/04/babymetal_timsnow_20140809-15_wide-667c512f63e05f56c65ce93b322f22bc9bf8dfa6.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_therecord_2014_09_04_345778225_deal-with-it-headbangers-babymetal-is-here_1540240456.html","title":"Deal With It, Headbangers - Babymetal Is Here","title_page":"Deal With It, Headbangers — Babymetal Is Here : The Record : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Deal With It, Headbangers — Babymetal Is Here\nEnlarge this image toggle caption Tim Snow Tim Snow\nOn Saturday, Aug. 9, more than 40,000 people descended upon Montreal's Parc Jean-Drapeau for the first day of Heavy Montreal, North America's biggest heavy metal festival. The main draw was headliner Metallica; respected veterans in Anthrax, Voivod and Overkill; and upstarts like Municipal Waste and Protest the Hero featured on the eclectic undercard. Early in the day though, it was a performance by a trio who performed a confounding, surreal fusion of bubbly Japanese pop and edgy heavy metal that attracted the crowd's attention.\nThe metal scene loves to wring its hands over anything that upsets the status quo, and Babymetal have been especially polarizing in 2014. After all, co-opting metal music and juxtaposing it with J-pop melodies and Japanese \"idol\" fashion, choreography, and marketing will do that. The cries of foul have been predictable, skeptics up in arms about the act's seeming lack of sincerity, its \"corporate\" approach, its prefab quality. It's a common complaint in an era when the mainstream side of heavy metal is stuck between the nostalgic and the milquetoast. The best-selling metal acts of the past 12 months are a hodgepodge of old-school heroes (Black Sabbath), late-'90s holdovers (Korn, Godsmack), younger bands that pander to the lowest common denominator (Avenged Sevenfold, Five Finger Death Punch) and the odd mild bright spot (Volbeat). It's as if post-millennial mainstream metal doesn't know where to go next. There's little galvanizing the entire metal scene anymore: The older metal crowd has its favorites, the kids have theirs, the underground carries on and never the twain shall meet. The fact that the sudden notoriety of this shrewdly marketed trio of teenaged Japanese singers has brought people together in a combination of excitement, confusion and revulsion is not a bad thing at all.\nWhat Babymetal's naysayers tend to forget is that heavy metal is no stranger to contrivance and gimmickry. Some of the most popular heavy metal albums ever released were awfully contrived, whether the carefully honed sleaze of Mötley Crüe's Shout at the Devil and Guns N' Roses' Appetite for Destruction, Metallica's made-for-the-masses Black Album and Def Leppard's similarly intended Pyromania, or the calculated cathartic sounds of Pantera's Vulgar Display of Power and Korn's Follow the Leader. Even today's extreme metal is laden with gimmicks; just look at the cartoonish Satanism of Watain and the Viking shtick of Amon Amarth. Heavy metal is as much about contrivance as it is about substance, and often its best bands have been able to skillfully combine the two. What makes metal so uniquely charming is that the bands and their audiences buy into those contrivances and gimmicks fully, without irony.\nYouTube\nBabymetal doesn't hide its contrivances at all. A product of the Japanese pop idol stable Sakura Gakuin and the vision of producer and longtime metal fan Key \"Kobametal\" Kobayashi, the project embraces metal's most enduring and endearing tenets — fantasy, escapism, theatrics, bombast and sheer volume — and that solid, skillfully played metal foundation cleverly grounds a wildly eclectic sound that incorporates elements from trance to synth-pop, to dubstep, to reggae, to J-pop at its most manic and overtly \"cute.\" It's also brilliantly self-referential, the group's manga-style fantasy storyline involving some wonderful parodies of metal's \"Big Four\" of Metallica, Slayer, Anthrax, and Megadeth. Speaking to Metal Hammer magazine, Kobayashi eloquently explained the method to his madness:\n\"As a longtime metal fan, I always used to say 'That's not real metal so I'm not listening to it!' I'm a metal purist too, to be honest. But I realized that the scene isn't really getting any bigger. All the old-school metal bands are still around and there's still a fanbase, but it's all getting smaller. So to bring Japanese metal around the world, it has to be something different and original. It's like sushi! Sushi came from Japan and people had never eaten it before, and now everyone eats sushi all over the world.\"\nA good number of those people singing Babymetal's praises are old enough to remember when heavy metal was contrived and awesome because of it. Jeff Walker of death metal legends Carcass has been effusive in his praise, and Metallica are reportedly fans. In the metal media, veteran writers like Metal Hammer's Dom Lawson, Metal Rules' JP Wood and Metalsucks' Vince Neilstein have all gotten on board. Not all old-schoolers have gravitated to the squeaky voices of 16 year-old Su-Metal and 15 year-olds Moametal, and Yuimetal, but those who have recognize that undeniable element of fun that somehow has become lost over the years in a sea of equally contrived darkness, hostility and antisocial sentiment. The bearded dude in the patch vest might not want to admit it, but in metal, it's okay to smile once in a while.\nThe broad appeal of Babymetal's stylistic free-for-all to younger audiences is key. Having never known a world without the Internet, where every form of music is easily accessible in seconds, the millennial generation doesn't give a damn about genre boundaries whatsoever, and that ultimately could fuel metal's next sea change. With much of the genre recycling formulas, clichés, and tropes in ouroboros-like fashion, metal is poised to head in two opposite directions at once, splitting between becoming a strictly traditionalist genre, or completely embracing non-traditional styles of music and instrumentation. The latter is happening more and more, above ground and below: Finland's Oranssi Pazuzu incorporates krautrock elements into its black metal sound. Tristan Shone's Author & Punisher creates otherworldly industrial metal using his clever inventions. Deafheaven scored a crossover hit in 2014 by meshing searing black metal with contemplative shoegaze. Enter Shikari has attracted a large youth audience with its blend of metalcore and electronic music.\nThe traditional side of metal, whose myriad subgenres are separated by strict limitations, will always flourish, but metal's future evolution lies beyond those self-imposed walls. While Babymetal's shelf life remains to be seen — their swift success is also an apt reflection of contemporary pop music's highly ephemeral quality — its emblematic of a mindset in metal that will only become more common in the years to come. This is only the beginning.\nMany in the big crowd that Saturday afternoon in Montreal were mostly curious about what Babymetal would be like, how this music could be pulled off live. The feeling of uncertainty was palpable as the backing band, clad in robes and kabuki-style facepaint, strode onstage, followed by the three pixie singers. Clad in matching schoolgirl/warrior outfits that serve as an apt visual representation of that J-pop/metal hybrid, the trio's playful yet badass choreography felt awkward initially. Like any band that emphasizes the more theatrical side of the music, it's best experienced in a setting more controlled than an open-air festival. Plus there were a couple technical glitches, and poor Yuimetal was smacked when Su-Metal's thrown fox mask boomeranged into her face, but the three young women didn't miss a beat, remaining in character while the crack supporting musicians played some scorching music accentuated by backing tracks.\nYouTube\nBefore long the band and singers, the music and choreography, started to coalesce, and the crowd had bought into the gimmick of it all, jumping, raising fists, singing along to hit singles \"Megitsune\" and \"Gimme Chocolate!!\" In an inspired tongue-in-cheek moment, an accompanying video implored the mosh pit to stage a \"wall of death\", stating wryly, \"If you show true courage, we will show true metal.\" The crowd divided in two, the mellow intro to \"Ijime, Dame, Zettai\" started, and as soon as the speed metal riffs kicked in, both sides of the crowd sprinted into each other, bodies flying, thrashing, dancing. Only unlike a Lamb of God or Slipknot show, the aggression wasn't negative, but a reflection of pure joy. Everyone had a smile on his or her face as a fire hose shot plumes of water high in the air, cooling off the euphoric throng.\n\"We are!\" shouted the girls.\n\"BABYMETAL!\" replied the crowd in unison.\n\"We are!\"\n\"BABYMETAL!\"","url":"https://www.npr.org/sections/therecord/2014/09/04/345778225/deal-with-it-headbangers-babymetal-is-here"}
