{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:59:11","date_modify":"2018-10-30 21:59:11","date_publish":"2015-02-16 21:06:31","description":"The Daily Beast published a piece by Dean Obeidallah titled “Yes There Are Christian Terrorists” as 21 Egyptian Christians were slaughtered.","filename":"data/vaneerConsumption/DeanObeidallahGoesAfterChristianTerroristsontheDayISISBeheads21Christians.json","image_url":"https://media.breitbart.com/media/2015/02/AP581311958714.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_16__1540936751.html","title":"Dean Obeidallah Goes After 'Christian Terrorists' on the Day ISIS Beheads 21 Christians","title_page":"Dean Obeidallah Goes After 'Christian Terrorists' on the Day ISIS Beheads 21 Christians | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the same day that 21 Christians were slaughtered at the hands of the Islamic State terrorist group in Libya, the Daily Beast published a piece by Dean Obeidallah titled: “Yes, There Are Christian Terrorists.”\nObeidallah, who recently met with President Barack Obama as a “leader” of the Muslim community to discuss the “alarming rise in anti-Muslim bigotry in America,” insists that Islamic terrorism is disproportionately featured in the media.\nThe Daily Beast writer posits the following hypothetical scenario:\n“There are still nine Christians here. We will capture them. We will kill them. When we finish here, we will go to the next village and kill the Christians there, too.” If an ISIS leader made a statement like this publicly, Fox News would probably cut into their programming bring you a special report about the Muslims’ “religious war” against Christians. Mainstream media outlets would most likely cover it as well.\nIf the Daily Beast’s resident comedian had once read the propaganda that is espoused by the Islamic State on a daily basis, he would surely find that the terrorist group sees the Christian people as its mortal enemy. In its most recent publication of Dabiq, ISIS’s propaganda magazine, the words “Crusaders” and “Christians” combined for over 100 mentions in the publication. In July, ISIS marked the houses of Iraqi Christians with an Arabic “N” to threaten imminent death upon the “Nazarene” people, should they refuse to live under the Muslim terror army. In the past year, over 125,000 Middle East Christians have been forced to flee their homes. There is no need for an “if” scenario when ISIS routinely makes such public proclamations.\nObeidallah continues:\nBut that statement was indeed uttered in 2014. Except there was one simple word difference: “Christian” was replaced with “Muslim”. That is exactly what a Christian terrorist said about his militia’s plan to exterminate the remaining nine Muslims in a village in Central Africa Republic (CAR). But, of course, stuff like that doesn’t really make news here in our country.\nThe Daily Beast writer makes the blunt assertion that news outlets don’t cover the ongoing civil war in the Central African Republic (which he incorrectly names The Central Africa Republic) simply because a militia of Christians are one of the warring factions committing heinous acts. Apparently, this means that the American media doesn’t care about when Christians do bad things. However, Breitbart News has reported on the country’s ongoing civil war dozens of times since its commencement in 2012, so the claim that “stuff like that doesn’t really make news” remains untrue at the pages of Breitbart.com.\nObeidallah continues, recycling talking points about abortion clinic bombings that took place decades ago to prove the strawman wrong and demonstrate once and for all that “Christian Terrorists” exist. Obeidallah is right about one thing — that there are documented instances of people committing acts of terrorism in the name of all sorts of religions. No one can deny that. But in doing so, he tries to make a moral equivalence between all of those who conduct terrorism in the name of their respective religions.\nHe concludes: “But we can’t deny reality. There are people who commit acts of terrorism in the name of every faith, whether it is Christianity, Judaism, Buddhism or Islam, even if its just terrorist adherents of the latter that gets all the media attention.”\nBut Obeidallah’s moral equivalence falls flat, because modern-day geopolitical events reveal that there is only one religion that is slaughtering thousands of people on a weekly basis in the name of its God. Only in very rare instances do we ever hear that a massacre was committed in the name of Jesus, Moses, or Buddha. And for the most part, the Christian, Jewish, and Buddhist communities overwhelmingly condemn such violence. However, too often in the 21st century, we hear the daily chants of “Allahu Akbar” (Allah is Greater) after an Islamic army has gunned down their enemies on the battlefield, praising God for their bloody conquest.\nWhether i its the Iranian regime hanging hundreds of innocents from a crane to prove that resistance is futile in an “Islamic Republic,” or the Islamic State terror group butchering “the enemies of Allah,” or Islamist terrorists killing cartoon artists to “avenge the Prophet,” acts committed in the name of the Koranic religion remain an exponentially more frequent undertaking in the present day.","url":"https://www.breitbart.com/national-security/2015/02/16/dean-obeidallah-goes-after-christian-terrorists-on-the-day-isis-beheads-21-christians/"}
