{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 05:11:31","date_modify":"2018-10-23 05:11:31","date_publish":"2017-03-16 16:12:02","description":"Alison Farr-Davies, 42, who was also addicted to Class A drugs, was found dead at the flat they shared in Swansea, south Wales, on September 13 last year.","filename":"data/vaneerConsumption/DeanJonesjailedforkillingpartnerAlisonFarrDavies.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/17/3E55963100000578-0-image-a-2_1489684062907.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320812_Dean-Jones-jailed-killing-partner-Alison-Farr-Davies_1540271491.html","title":"Dean Jones jailed for killing partner Alison Farr-Davies","title_page":"Dean Jones jailed for killing partner Alison Farr-Davies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A drug addict who killed his privately educated solicitor girlfriend - who had also turned to drugs in a tragic fall from grace - has been jailed for more than 13 years.\nDean Jones, 38, left Alison Farr-Davies to die after violently attacking her and did not get medical help until the next day, Swansea Crown Court heard.\nMs Farr-Davies, 42, was found dead at the flat they shared in Swansea, south Wales, on September 13 last year.\nJones, who has previous convictions for violence, was jailed for 13-and-a-half-years, with a further four on licence, by Judge Keith Thomas.\nDean Jones (right), admitted killing his solicitor girlfriend Alison Farr-Davies (right) and has been jailed for more than 13 years\nProsecutor Christopher Quinlan QC said on the previous afternoon, a neighbour went to the flat after hearing the sound of what she thought was someone falling down the stairs.\nShe peered through the letterbox and saw Ms Farr-Davies sitting on the floor at the bottom of the stairs.\nMr Quinlan said Jones appeared and told the neighbour that there 'was nothing wrong' and promised to call an ambulance but did not do so for 'an appreciable time thereafter'.\nAn ambulance was not called until the following day, by which time Ms Farr-Davies was dead.\nA post-mortem examination concluded it was 'difficult to envisage how injuries could have been caused by falling downstairs' and she survived for some hours after the fatal attack.\nMs Farr-Davies, 42, was found dead at the flat they shared in Swansea, south Wales, on September 13 last year\nOther injuries suffered by Miss Farr-Davies included multiple fractures to ribs and a left arm, a bowel injury and bite marks.\nDuring interviews with police, Jones never offered any explanation for why he attacked her.\nJones, of Hafod, Swansea, had been due to stand trial accused of murder but pleaded guilty to his girlfriend's manslaughter on the basis he did not intend to kill her.\nSarah Elliott QC, defending, said prior to the fatal events, there was nothing to suggest their relationship had been violent.\n'His life has been blighted by an addiction to Class A drugs,' she said.\n'There were signs his life were looking up with Ms Farr-Davies if they could have ended their addiction to drugs but it ended up in tragedy.\n'It will be of no comfort to the family of Ms Farr-Davies, but he bitterly regrets his conduct on that night.\n'He is genuinely shocked and remorseful and expresses a wish to use his time in prison constructively.'\nThe court heard Ms Farr-Davies was born in Carmarthen and was schooled at the plush Haberdashers' Monmouth Girls school before studying law at university and qualifying as a solicitor in 2001, practising in Cardiff and cities in England.\nIt is believed Ms Farr-Davies (pictured) had been living in Luton, Bedfordshire, but grew up in Carmarthen, Wales, where she was visiting at the time of her death\nShe had overcome her drug addiction but suffered a relapse in 2015 and met Jones when she was sleeping rough in Swansea. They started a relationship and moved into to the flat in together.\nA post-mortem report found Ms Farr-Davies suffered a brain haemorrhage and possibly survived 12 to 18 hours after being injured.\nMs Farr-Davies was killed by Jones just days before her 43rd birthday - a birthday she shared with her mother.\nNeighbours had witnessed her looking distressed in the days leading up to her death and one passerby said they saw a male 'dragging a person by her hair.'\nOn September 13, 2016, Jones ran into the road wearing just boxer shorts and shouted for help - despite knowing Ms Farr-Davies was already dead.\nIn a victim impact statement, Ms Farr-Davies' sister Louise Staples, said: 'I still have not told my daughters their auntie has died. How can you tell them what happened to her?\n'I have never felt pain like this before.\n'From the moment I get up I can't wait for it to be night again, so I can be alone in the dark.'\nHer mother, Linda Farr-Davies said in statement: 'I keep looking forward to Ali visiting, and it is hard to think she will never be able to do that again.\n'I do not go out. I stay at home and do not want to see people. I pretend I am getting better, but I am not. I will never be the same again. I just want her back.'\nThe court heard how Jones, right being led to court, shouted at drivers to help after running out of the house (left) half-naked moments after he had killed his girlfriend\nJudge Thomas said no sentence he could pass could bring Miss Farr-Davies back or cure the anguish of her family.\n'This was a wholly unprovoked and senseless attack,' he said.\n'Your attack upon Ms Farr-Davies was sustained and prolonged, which was not diminished by your lack of any intent. You do pose a risk of injury to other people when you are at large in the community.'\nJones was also ordered to serve an additional four years on licence.\nSpeaking afterwards, Mrs Staples added: 'As a family, we are totally devastated at the loss of our beautiful daughter, sister, aunt, niece and cousin.\n'What he has done has destroyed us all. I try to tell my two daughters that monsters don't exist, but they do, it's him, he is a monster for what he did to Ali.\n'He has robbed us of such a beautiful person. We all miss her so much.'","url":"https://www.dailymail.co.uk/news/article-4320812/Dean-Jones-jailed-killing-partner-Alison-Farr-Davies.html"}
