{"authors":[],"date_download":"2018-10-30 18:16:09","date_modify":"2018-10-30 18:16:09","date_publish":"2016-07-18 13:26:39","description":"Breitbart's Dangerous Faggot, Milo Yiannopoulos wants Governor Mike Pence to come party with the gays in Cleveland.","filename":"data/vaneerConsumption/DearGovPencePleaseComeToOurBigGayPartyforTrump.json","image_url":"https://media.breitbart.com/media/2016/07/DSC00246-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_18__1540923369.html","title":"Dear Gov Pence: Please Come To Our Big Gay Party for Trump!","title_page":"Dear Gov Pence: Please Come To Our Big Gay Party for Trump! | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"It’s no secret that Donald Trump is the most LGBT-friendly presidential candidate the GOP has ever fielded, and one of the most gay friendly presidential hopefuls of all time. But if, in my capacity as the glittering leading light of the conservative gay movement, I was to give his VP pick a patented Daddy Trump nickname, I might have to call him “Wobbly Pence.”\nI do understand the selection of Mike Pence as Vice President. He has the Washington experience that Daddy doesn’t and will bring goodwill with Capitol Hill, where he was well-liked. Lots of people have told me they like him and that he’s a good guy.\nPence also appeals to conservative Christians, and has a calm Midwestern demeanour that will play well on screen with Daddy, who, like your humble correspondent, can occasionally be a bit theatrical.\nPence will appeal to Cruz Republicans— he has many of Ted Cruz’s good qualities without the constant lying, booger-eating and that whole “Zodiac Killer” vibe.\nNow, I know what you’re going to say. Gays on the right and those on the fence (minds out of the gutter, please!) are distressed by Pence’s stance on gay rights. He has opposed same-sex marriage, gays in the military, and of course is most well known for the kerfuffle over Indiana’s Religious Freedom Restoration Act.\nIronically, I agree with all of those positions to varying degrees, but I recognize that these and similar positions he’s held make gays question a Trump-Pence ticket’s commitment to them.\nUnlike the regressive left or those #NeverTrump idiots, I’m not going to wail, gnash my teeth and clutch my pearls, fetching though my pearls are. I’m going to offer a solution. In essence, my goal is to make Trump’s VP right as ninepence with LGBT conservatives and independents.\nGovernor Pence: you haven’t seen eye-to-eye with the gay community, but everyone can change. After all, you changed from supporting Ted Cruz to supporting Donald Trump! The LGBT community loves Trump so much, that we are throwing a party for him called WAKE UP! , our message to gays who haven’t seen the light yet.\nGovernor, this column is your invitation to join us, and learn what makes LGBT conservatives a vibrant and fabulous branch of the big-tent coalition that Daddy Trump is building.\nWe want you to meet some of the most courageous people in the war for the future of America. Men like Geert Wilders, fighting for freedom in a fading Europe, and women like Pam Geller, who has faced an assassination plot from Islamists.\nYou can compare notes with Peter Thiel, who fearlessly stood up against the hyper-liberal Silicon Valley to be a Trump delegate in Cleveland, and of course little old me, who will shortly be embarking on a pride parade through Sweden’s worst Muslim neighborhoods.\nI think this event will help open your eyes to why Donald Trump is right about Muslims. And trust me, Governor Pence, a gay party with everyone who is anyone attending is a lot more fun than some iftar dinner with a roomful of jihadis who secretly want you dead.\nYou already have rugged good looks — like an older Anderson Cooper who isn’t a vain shill for the globalist agenda. Imagine how your game will be upped when you get a little Milo eye for the straight guy. We’ll tszuj you up so well that next time Daddy plays a song for you, it won’t be “You Can’t Always Get What You Want” but something like “Queen of the Night” or “Fierce.”\nMaking Mike Pence Fabulous Again goes hand in hand with making America great again. You can trust me, I’m Daddy’s favorite adopted son.\nDonald Trump is the natural choice for gays. Look at who he is running against– there is no question who put twenty pence in Hillary Clinton: it’s the Saudis and friends! Donald Trump speaks for himself and America, and Governor Pence won’t slow down the Trump train.\nMany of you will recall my initial reaction to the announcement:\nDoes anyone care who Trump picks as VP? IT'S TRUMP and he's here to save America. I mean, does anyone remember Abraham Lincoln's VP? — Milo Yiannopoulos ひ✘ (@Nero) July 15, 2016\nBut there is something to consider. Daddy Trump will live forever in our hearts and minds, but he is seventy years old, and has already faced an assassination plot (by a fellow Brit no less). Mike Pence could become our president, so even if the Vice President isn’t important compared to the president, he needs to mend fences with gays, and get to know us better.\nCome party with us Governor! Gays are all about symbolism, and your appearance will go a long way to mending the fences.\nNow that I’ve put in my tuppence worth, I can get down to the really important stuff— planning my Cleveland wardrobe! See you all at the Citizens for Trump rally this afternoon.\nFollow Milo Yiannopoulos (@Nero) on Twitter and Facebook. Hear him every Friday on The Milo Yiannopoulos Show. Write to Milo at milo@breitbart.com.","url":"https://www.breitbart.com/social-justice/2016/07/18/mike-pence-needs-wake-value-lgbt-conservatives-cleveland/"}
