{"authors":[],"date_download":"2018-10-30 01:07:24","date_modify":"2018-10-30 01:07:24","date_publish":"2018-10-29 18:06:29","description":null,"filename":"data/vaneerConsumption/DearMrPresidentAnOpenLetter.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/640px-Donald_Trump_State_of_the_Union_2018_39974382192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861644.html","title":"Dear Mr. President: An Open Letter","title_page":"Dear Mr. President: An Open LetterThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In 2018, you delivered a fabulous State of the Union. As seen here on YouTube there are three short videos that capture exactly the reaction that night. First is a White House video that highlights excerpts from the speech. Next is the media reaction that was amazingly — overwhelmingly positive… even on CNN. Clearly the American people were behind you. Last is an amusingly revealing capture of West Virginia’s Democrat Senator Joe Manchin. As applause breaks out for you Manchin is clapping and starts to rise — then realizes his fellow Democrats are doing neither… so he instantly stops applauding and sits back down. Talk about a profile in courage — not!!!\nThe videos are all available here on the website of the Frontiers of Freedom — along with a letter to RNC Chair McDaniel. The letter, signed by George Landrith, the group’s president and CEO, says, in part, this:\nAs a nationwide poll released Thursday by McLaughlin Associates shows: If Republicans develop a strong national message in the final week of the campaign, then an historic victory is at hand. In persuading undecideds and motivating pro-Trump voters that national message must bring home the tremendous accomplishments of President Trump, but also emphasize the great danger to further progress posed by the slavish adherence of democratic Members of Congress to their extremist liberal leadership. We believe, Chairwoman McDaniel, that you are uniquely positioned to assist the party in achieving both ends. Please let us explain. We believe nothing will help accomplish the objective stated above and do more to assist Republican candidates then reminding the public that shining moment in American history earlier this year when President Trump delivered perhaps the greatest and most moving State of the Union address in modern history.\nLandrith goes on to ask the RNC Chair to give some real play to these videos on social media. I agree.\nThe videos are very instructive about the nature of your opponents. There you were giving an incredibly uplifting speech — a speech of unity — and as captured in that third video of “Jumping Joe Manchin” they were determined to sit on their hands — which in turn made Manchin do the same. The next day polls were showing overwhelming support for your speech.\nNot only was your State of the Union a great speech doing exactly what your critics demand that you do — lead and unify — but it is a stark reminder that what they are about is the opposite. When you do exactly as they demand — they still attack you. Which in turn says everything the American people need to know.\nThank you, Mr. President. You are doing great. Keep going!","url":"https://spectator.org/dear-mr-president-an-open-letter/"}
