{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:18:55","date_modify":"2018-10-30 23:18:55","date_publish":"2014-08-13 20:10:46","description":"When something historic and troubling is happening in the U.S., it can be frustrating to realize that not everybody is paying attention to it. When two iconic celebrities die in quick succession during the same week as those historic events, it can…","filename":"data/vaneerConsumption/DearWhitePeoplesPSAsArePitchPerfectSatiresAddressingCruciallyRelevantRaceIssuesVIDEOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/140287e7-12a8-4290-ba54-efe3beb09f23.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35650-dear-white-peoples-psas-are-pitch-perfect-satires-addressing-crucially-relevant-race-issues-videos_1540941535.html","title":"'Dear White People's PSAs Are Pitch-Perfect Satires Addressing Crucially Relevant Race Issues - VIDEOS","title_page":"'Dear White People's PSAs Are Pitch-Perfect Satires Addressing Crucially Relevant Race Issues — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"When something historic and troubling is happening in the U.S., it can be frustrating to realize that not everybody is paying attention to it. When two iconic celebrities die in quick succession during the same week as those historic events, it can feel especially like your Facebook newsfeed has its priorities a little out of whack. Which is why it can feel like a small but welcome relief when you find something that bridges the gap between politics and pop culture. That's how I feel about Dear White People 's promotional campaign. I wish it weren't as relevant to what's going on in Ferguson, MO as it is.\nPart of the brilliance of Dear White People — and part of what makes it so very, very necessary — is that it's never really not been relevant to life in the United States. It channels the familiar language of satire into topics that big portions of the U.S. ignore on a day-to-day basis. The series depicts what it means to be \"a black face in a white place.\"\nIt's an everyday experience for most black people in the U.S. — and this week it's cropped up in a big, violent way. Which is what makes Dear White People's most recent \"PSA,\" about the lie of black-on-black crime, all the more poignant.\nDear White People on YouTube\nThe most recent race catastrophe — the shooting of unarmed black teen Mike Brown in Ferguson and the ensuing protests and continued police brutality — isn't black-on-black crime in the least, but white-on-black crime.\nOf course, we've also got Dear White People's July 21 PSA, \"Why Black People Are Afraid Of 'The Man,'\" which stings for the obvious reasons:\nDear White People on YouTube\nAnd the rest of their videos serve as continued proof that there's a lot to talk about when it comes to black identity — including but not limited to the societal pressures that created it and that, well, there's no such thing as one black experience.\nTake this one on the stereotype of black athletes:\nDear White People on YouTube\nAnd this one on fried chicken:\nDear White People on YouTube\nI know how urgent it is that we bring conversations about race to the masses. And so I know I'm grateful Dear White People, and its movie, exist.\nDear White People on YouTube\nImage: Code Red Films","url":"https://www.bustle.com/articles/35650-dear-white-peoples-psas-are-pitch-perfect-satires-addressing-crucially-relevant-race-issues-videos"}
