{"authors":[],"date_download":"2018-10-30 01:08:06","date_modify":"2018-10-30 01:08:06","date_publish":"2018-09-06 12:55:19","description":null,"filename":"data/vaneerConsumption/DearAnonymousInTheNameOfGodGo.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Obama_and_Trump_administration_officials_hold_meeting_at_White_House.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861686.html","title":"Dear Anonymous: In The Name Of God, Go!","title_page":"Dear Anonymous: In The Name Of God, Go!The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The President has no idea what he’s doing.\n“He displayed little knowledge or even curiosity about” international affairs. He “tuned out” when being briefed. His attention flagged in meetings, causing him to doodle. When it came to the deadly serious business of nuclear weapons he never understood what “this throw weight business was all about.” In fact, he had demonstrated repeatedly he had little interest and less understanding of the details of issues ranging from arms control to tax cuts. He fell asleep in Cabinet meetings. Indeed, said one congressman, “it was sinful” that he ever became President in the first place and was the “worst” President in American history.\nNo, this isn’t a description of President Donald Trump. It is a collection of behind-the-scenes observations about… President Ronald Reagan. That would be the very same Ronald Reagan whom British Prime Minister Margaret Thatcher later hailed as having won the decades-long Cold War “without firing a shot,” the man whose policies unleashed a quarter century of American prosperity and whose name now graces Washington’s Reagan National Airport and the Reagan Building on Pennsylvania Avenue, not to mention lists of “great” American presidents.\nThese memories come to mind in reading the petty complaints of some disgruntled Trump Administration “senior official” in the New York Times. The article was breathlessly titled:\nI Am Part of the Resistance Inside the Trump Administration I work for the president but like-minded colleagues and I have vowed to thwart parts of his agenda and his worst inclinations.\nWell, aside from the arrogance on display here? In which the writer presumes that somehow he or she was elected President of the United States in 2016? What we see on display in this one article alone is exactly the reason Donald Trump was placed in the Oval Office in the first place.\nThis “senior official” has no principles beyond his or her own well-honed sense of self-importance. The idea is plain. Like various Reagan advisers or Members of Congress in the 1980s, the writer believes himself/herself to be smarter than the man in the Oval Office. That man is just not doing things the Washington Way — and God forbid that someone like that have the nerve to disrupt the system!\nThe country is “bitterly divided” over the President’s leadership says “Anonymous.” And? Perhaps the writer should take a spin across the Mall to that big marble temple where the statue of the most bitterly divisive President in American history rests. That would be Abraham Lincoln. Seven states departed the union simply because he was elected, with another four to follow. Back in the ancient year of 2013, the Atlantic ran a very interesting article by correspondent Mark Bowden titled:\n‘Idiot,’ ‘Yahoo,’ ‘Original Gorilla’: How Lincoln Was Dissed in His Day The difficulty of recognizing excellence in its own time.\nThe article begins:\nBy nearly any measure — personal, political, even literary — Abraham Lincoln set a standard of success that few in history can match. But how many of his contemporaries noticed? Sure, we revere Lincoln today, but in his lifetime the bile poured on him from every quarter makes today’s Internet vitriol seem dainty. His ancestry was routinely impugned, his lack of formal learning ridiculed, his appearance maligned, and his morality assailed. We take for granted, of course, the scornful outpouring from the Confederate states; no action Lincoln took short of capitulation would ever have quieted his Southern critics. But the vituperation wasn’t limited to enemies of the Union. The North was ever at his heels. No matter what Lincoln did, it was never enough for one political faction, and too much for another. Yes, his sure-footed leadership during this country’s most-difficult days was accompanied by a fair amount of praise, but also by a steady stream of abuse — in editorials, speeches, journals, and private letters — from those on his own side, those dedicated to the very causes he so ably championed. George Templeton Strong, a prominent New York lawyer and diarist, wrote that Lincoln was “a barbarian, Scythian, yahoo, or gorilla.” Henry Ward Beecher, the Connecticut-born preacher and abolitionist, often ridiculed Lincoln in his newspaper, The Independent (New York), rebuking him for his lack of refinement and calling him “an unshapely man.” Other Northern newspapers openly called for his assassination long before John Wilkes Booth pulled the trigger. He was called a coward, “an idiot,” and “the original gorilla” by none other than the commanding general of his armies, George McClellan.\nBowden goes on to note that abolitionist Elizabeth Cady Stanton called Lincoln “Dishonest Abe” and “bemoaned the ‘incapacity and rottenness’ of his administration to Susan B. Anthony, worked to deny him renomination, and swore to (fellow abolitionist Wendell) Phillips that if he ‘is reelected I shall immediately leave the country for the Fijee Islands.’” Other descriptions from intimates in the Lincoln administration or in his own party included saying the President was “timid vacillating & inefficient” (Senator Zachariah Chandler of Michigan), with Ohio Republican William M. Dickson writing that Lincoln “is universally an admitted failure, has no will, no courage, no executive capacity… and his spirit necessarily infuses itself downwards through all departments.”\nBowden notes that “Charles Sumner, a Republican senator from Massachusetts, to whom Lincoln often turned for advice, opposed the president’s renomination in 1864: ‘There is a strong feeling among those who have seen Mr. Lincoln, in the way of business, that he lacks practical talent for his important place. It is thought that there should be more readiness, and also more capacity, for government.’ William P. Fessenden, the Maine Republican, called Lincoln ‘weak as water.’”\nAnd then there was this charmer. “… In the days after Lincoln’s assassination, (noted abolitionist) William Lloyd Garrison Jr. called the murder “providential” because it meant Vice President Andrew Johnson would assume leadership.” Johnson, it should be noted, instead became the first president to be impeached.\nIn other words, the man history records overwhelming today as the greatest of U.S. Presidents was routinely savaged in exactly the same style as Ronald Reagan in the 1980s and, yes indeed, as Donald Trump today.\nQuite obviously what history records of the Trump presidency will not be thoroughly evaluated until long after he is gone from the White House, as is routinely true of all presidents. And yes, the President has every right to celebrate his record thus far, whether on the booming Trump economy or beating the hell out of ISIS and bringing recognition to seriously bad U.S. trade deals which he is in the process of getting renegotiated.\nBut the real eye-opener here is not just that President Trump is being assailed by some nominal member of his own team, as were Lincoln and Reagan and other presidents. No, the real eye-opener here is the degree to which Washington insiders possess such utter arrogance — make that an authoritarian-minded arrogance — that casts themselves as entitled to their power and position.\nThe author and others in this so-called “Resistance” are really about entitlement. They could care less about the American people. They are exactly the embodiment of what Trump said in his inaugural address:\nFor too long, a small group in our nation’s Capital has reaped the rewards of government while the people have borne the cost. Washington flourished — but the people did not share in its wealth. Politicians prospered — but the jobs left, and the factories closed. The establishment protected itself, but not the citizens of our country. Their victories have not been your victories; their triumphs have not been your triumphs; and while they celebrated in our nation’s capital, there was little to celebrate for struggling families all across our land. That all changes — starting right here, and right now, because this moment is your moment: it belongs to you.\nIndeed. And that is exactly the real reason for the furious nature of this New York Times article — the President is succeeding at the expense of people like the article writer. And he/she and his/her insider buddies don’t like it one bit.\nThe Atlantic’s Bowden closed out his essay on Lincoln and his critics by saying this:\nImagine all those critical voices from the 19th century as talking heads on cable television. Imagine the snap judgments, the slurs and put-downs that beset Lincoln magnified a million times over on social media. How many of us, in that din, would hear him clearly? His story illustrates that even greatness — let alone humbler qualities like skill, decency, good judgment, and courage — rarely goes unpunished.\nAnd not to put too fine a point on it? If this “anonymous” Resister had the courage of his/her convictions he/she would have the guts — not the mention the sense of honor — to simply resign.\nBut that’s not what happened. Which, in addition to his/her arrogance showcases nothing more than that the writer is a gutless and seriously dishonorable coward. In the words of a Member of Parliament, who memorably said this as British Prime Minister Neville Chamberlain’s government toppled around him after years of appeasing Hitler:\n”You have sat too long here for any good you have been doing. In the name of God, go!”\nExactly.\nGo, Anonymous. In the name of God, go! And don’t let the door hit you on the way out.","url":"https://spectator.org/dear-anonymous-in-the-name-of-god-go/"}
