{"authors":[],"date_download":"2018-10-22 22:20:10","date_modify":"2018-10-22 22:20:10","date_publish":"2014-05-09 21:19:25","description":"Walk into any kindergarten class this week and you're likely to see a similar theme. Kids who can't wait to tell you all about that special person.","filename":"data/vaneerConsumption/DearMomHeresWhatIWantYoutoKnow.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/433276/ellis_school_sd_29-97i-01_e57b9f6ab2ce0101a24c7553ccb640d9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_dear-mom-heres-what-i-want-you-know-n101851_1540246810.html","title":"Dear Mom: Here's What I Want You to Know","title_page":"Dear Mom: Here's What I Want You to Know","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWalk into any kindergarten class this week and you’re likely to see a similar SCENE. Mother’s Day is right around the corner and bright-eyed children are talking about mom.\nWhen I visited a school in Brooklyn, New York, the classroom full of 5- and 6-year-olds couldn’t wait to share their enthusiasm.\nI met Elijah who told me about his mom. “She loves to eat gingerbread. My mom loves to wear the necklace her mom gave her.”\nHe went on to say, “My mom loves to say, ‘I love you and I like you.’”\nI also met Abena, who told me, “When I look at my mom, the first thing I think of is me and my mom hugging and kissing each other.”\nLittle Maddy said she was going to do things for her mom. “I’m going to set the table, take my dog on a walk and help her.”\nFive-year-old Stella wiggled in her chair for a little bit and looked around the room, as kids do, and then said, “I’m going to make my mom a special dinner and a special Mother’s Day cake and I’m going to give her a kiss.”\nIt’s simple and powerful hearing children talk about what matters most to them about their moms.\nLike 6-year-old Elysa in an art class at the 92nd Street Y in Manhattan. She was making a beautiful card for her mom.\n“How many years have you been celebrating Mother’s Day?” I asked.\n“Uhm, I think two. I don’t know,” she said shyly.\n“Two? But, you’re 6 years old”,\n“Maybe 5? I have no idea. I don’t know.”\nBut I know it was one of those moments when kids say the kind of things that Art Linkletter built his career around.\nAnd that’s OK.\nThis is the weekend when mothers get extra special attention.","url":"https://www.nbcnews.com/nightly-news/dear-mom-heres-what-i-want-you-know-n101851"}
