{"authors":["Associated Press"],"date_download":"2018-10-23 00:51:03","date_modify":"2018-10-23 00:51:03","date_publish":"2016-01-29 14:21:10","description":"ATLANTA (AP) — Lawyers for an inmate set to be executed in days are asking a federal appeals court to weaken Georgia's law that keeps secret the source of th...","filename":"data/vaneerConsumption/DeathrowinmatescasetargetsGeorgiasstrictsecrecylaw.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:5e9ea603002b4690830c6f331b14d80f-4PuZeKVXE7cd9005b2c876aea5c7-625_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422848_Death-row-inmates-case-targets-Georgias-strict-secrecy-law_1540255863.html","title":"Death row inmate's case targets Georgia's strict secrecy law","title_page":"Death row inmate's case targets Georgia's strict secrecy law | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Death row inmate's case targets Georgia's strict secrecy law\nATLANTA (AP) — Lawyers for an inmate set to be executed in days are asking a federal appeals court to weaken Georgia's law that keeps secret the source of the state's lethal injection drug. It's the toughest of a number of secrecy laws passed in recent years by U.S. states eager to stabilize their execution drug supplies.\nStates say the laws protect companies that fear retaliation for their association with the death penalty. Most were enacted after drug manufacturers, many of them in Europe, stopped selling their products for executions, citing ethical concerns.\n\"There are certainly secrecy laws in other states, and some of them create extraordinary secrecy, but nothing reaches the level of Georgia,\" said Megan McCracken, a death penalty expert at the University of California at Berkeley.\nIn this undated image made from video and released by the Georgia Department of Corrections, shows white chunks that had formed in the lethal injection drug the state intended to use for the execution of Kelly Gissendaner, which was scheduled for March 2, 2015. The solution is supposed to be clear and when corrections officials realized the compounded pentobarbital had precipitated, they stopped the execution and temporarily suspended all executions in the state until they could investigate what went wrong with the drug.(Georgia Department of Corrections via AP)\nAny ruling by the full appeals court would be significant as it would be binding in Georgia pending any appeal to the U.S. Supreme Court, said Robert Dunham with the Death Penalty Information Center, which tracks issues related to capital punishment. It also could serve as a reference for lawmakers in other states and would have persuasive, though not binding, authority in other federal courts, he said.\nGeorgia stopped a lethal injection in March because of a problem with the drug, the barbiturate pentobarbital made by a compounding pharmacy. A Department of Corrections video shows solid white chunks falling against the syringe's plunger in a solution that should be clear. Citing this example, some 11th U.S. Circuit Court of Appeals judges have expressed concern about Georgia's secrecy law.\nLawyers for death row inmate Brandon Astor Jones, convicted of killing a convenience store manager in 1979 and scheduled to die Tuesday, argue that Georgia's execution method carries \"a substantial risk of significant harm,\" violating his constitutional right against cruel and unusual punishment.\nBut because of the secrecy law, they say, they don't have enough information to make that claim, which violates his due process right.\nSimilar arguments have been rejected by three-judge panels of the 11th Circuit.\nGeorgia's law says the identifying information of any entity or person participating in an execution is a \"confidential state secret,\" meaning it can't be revealed, not even for a judge's review or under seal in a court case.\nAfter the defective drug halted Kelly Gissendaner's execution in March, officials investigated and took steps to ensure it wouldn't happen again, state lawyers argued in response to Jones' complaint. The problem was clearly rectified as Gissendaner and two other inmates were executed last year with no sign of pain, state lawyers wrote.\nBut Jones' lawyers say the investigation lacked transparency, and they aren't convinced officials determined the problem's cause.\nGissendaner's lawyers, including at least one now representing Jones, raised similar arguments before her rescheduled execution in September. A three-judge panel of the 11th Circuit rejected those claims, but in a dissenting opinion Circuit Judge Adalberto Jordan said the state's secrecy was troubling.","url":"https://www.dailymail.co.uk/wires/ap/article-3422848/Death-row-inmates-case-targets-Georgias-strict-secrecy-law.html"}
demned inmate and again raised constitutional concerns about the law.\nJordan was on that panel, too. This time, he conceded the challenge was barred by circuit precedent but said he believed that precedent was incorrect. Circuit Judge Beverly Martin, also on the panel, agreed.\n\"Of course, I recognize the State's need to obtain a reliable source for its lethal injection drugs,\" Martin wrote. \"But there must be a way for Georgia to do this job without depriving ... condemned prisoners of any ability to subject the State's method of execution to meaningful adversarial testing before they are put to death.\"\nMartin also worried about the lack of court access to the information. Federal courts routinely keep secret information revealed in judicial proceedings — for example, in the grand jury process or in trade secret cases — so surely there's a way to do so for death penalty cases, she wrote.\nState lawyers say Jones doesn't have a right to know every detail of the execution method, an argument that's been made in 11th Circuit opinions. State lawyers also say the law protects the source of the drugs from \"rabid manipulations of death penalty opponents.\"\nCiting the doubts raised by Jordan and Martin — as well as a 2014 opinion by 11th Circuit Judge Charles Wilson noting \"the disturbing circularity problem created by Georgia's secrecy law\" — Jones' lawyers argue that three judges on that federal appeals court have now suggested that law doesn't comply with the Constitution.\nIf the distribution of judges on the panels had been different, their opinion might be precedent, Jones' lawyers argue. They're requesting a full-court review by the 11th Circuit, which could overturn the established precedent.","url":"https://www.dailymail.co.uk/wires/ap/article-3422407/Death-row-inmates-case-targets-Georgias-strict-secrecy-law.html"}
