{"authors":[],"date_download":"2018-10-23 02:10:54","date_modify":"2018-10-23 02:10:54","date_publish":"2017-04-26 13:01:25","description":"The death toll from a roadside bomb targeting a passenger vehicle in Pakistan's northwest rose to 13 on Wednesday after three critically injured people died...","filename":"data/vaneerConsumption/DeathtollinPakistanroadsidebombrisesto13officials.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465035-1493208088-261_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447524_Death-toll-Pakistan-roadside-bomb-rises-13-officials_1540260654.html","title":"Death toll in Pakistan roadside bomb rises to 13: officials","title_page":"Death toll in Pakistan roadside bomb rises to 13: officials | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Pakistani bombing victim is treated at a hospital in the tribal district of Kurram on April 25, 2017\nThe death toll from a roadside bomb targeting a passenger vehicle in Pakistan's northwest rose to 13 on Wednesday after three critically injured people died overnight in hospital, officials said.\nThe incident, which occurred in the Godar area of Kurram tribal district early Tuesday, has been claimed by both the Jamaat-ul-Ahrar (JuA) faction of the Pakistani Taliban and the Islamic State group (IS).\nThree women, a six-year-old girl and a boy aged nine were among the dead, Baseer Khan, a top government official in Kurram tribal district, told AFP -- adding that the passengers were targeted because they belonged to the Shiite religious minority.\nThe Kurram tribal district is known for sectarian clashes between Sunnis and Shiites, who make up roughly 20 percent of Pakistan's population of 200 million. It has also been a stronghold of the Pakistani Taliban as well as its factions.\nJuA pledged allegiance to IS in 2014, but a year later said it had rejoined the Pakistani Taliban -- which in turn is allied to Al-Qaeda, a foe of IS.\nHowever since 2016 JuA and IS have both laid claim to several attacks, notably a suicide bombing at a hospital in the southwestern city of Quetta last year that killed 73 people.\nThe joint claims have raised the possibility they are colluding -- or that JuA, which has foot soldiers on the ground, is allowing IS also to take credit to achieve propaganda goals.\nOn Wednesday the army released a video showing a confessional statement by JuA's former spokesman Ehsanullah Ehsan, in which he called on the Taliban to lay down their arms and urged young people to steer clear of extremism.\nThe army announced last week that Ehsan, who was spokesman for the main Pakistani Taliban group before JuA broke away, had given himself up to the military. It gave no details on the circumstances or timing of the surrender.\nDuring the five-minute clip, shot in military custody, Ehsan stated his real name was \"Liaqat Ali\" and said JuA was given financial and logistical assistance by the intelligence agencies of India and Afghanistan -- a claim often made by the army.\nPakistani authorities had placed a $1 million bounty on Ehsan's head after he boasted that the Taliban were behind the 2012 attempt on the life of schoolgirl activist Malala Yousafzai.","url":"https://www.dailymail.co.uk/wires/afp/article-4447524/Death-toll-Pakistan-roadside-bomb-rises-13-officials.html"}
