{"authors":["Rebecca Hersher"],"date_download":"2018-10-22 23:17:21","date_modify":"2018-10-22 23:17:21","date_publish":"2016-12-21 00:00:00","description":"In 2016, 30 people were sentenced to death in America, and 20 people were executed. Both numbers are the lowest in decades, but voters in three states also voted to keep execution on the books.","filename":"data/vaneerConsumption/DeathSentencesAndExecutionsAreDownButVotersStillSupportDeathPenaltyLaws.json","image_url":"https://media.npr.org/assets/img/2016/12/20/ap_16326848812553_wide-8d023ca3c4125ae6c49dd7d821a076113f69dc42.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_12_21_506183108_death-sentences-and-executions-are-down-but-voters-still-support-death-penalty-l_1540250241.html","title":"Death Sentences And Executions Are Down, But Voters Still Support Death Penalty Laws","title_page":"Death Sentences And Executions Are Down, But Voters Still Support Death Penalty Laws  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Death Sentences And Executions Are Down, But Voters Still Support Death Penalty Laws\nEnlarge this image toggle caption Eric Risberg/AP Eric Risberg/AP\nIn 2016, 30 people were sentenced to death in America, and 20 people were executed.\nThose numbers are the lowest in decades, according to a report by the Death Penalty Information Center, which collects data on capital punishment in the United States, and advocates against the death penalty.\nThe 2016 numbers fit with a multi-decade trend. Death sentences and executions have been declining steadily since the mid-1990s.\nBut 2016 also generated seemingly contradictory information about how the public views capital punishment. Even as jurors have increasingly voted for life in prison instead of execution, voters in three states rejected propositions that would have eliminated the death penalty.\nIn California, Nebraska and Oklahoma — states with widely varying electorates – people voted by large margins to retain the death penalty.\nGeographic Isolation\nAnother trend is clearer than ever: for years, just a handful of states have accounted for most of the death sentences in America. In 2015 and 2016, Texas, Georgia and Missouri carried out 85 percent of executions.\nIn fact, the geographical isolation of capital punishment in America goes down to the county level. This year, just 27 of the more than 3,000 U.S. counties are responsible for every death sentence this year.\nEven in states that impose the most death sentences, the overall trend away from capital punishment holds true. \"Texas juries imposed only four new death sentences in 2016, and juries in Georgia and Missouri did not impose any [new death sentences] in 2015 or 2016,\" the report notes.\nDeath Row Numbers Down\nOverall, the number of people on death row – who are waiting to be executed after being sentenced to die – decreased this year, because the number of prisoners either dying in custody or having their sentences reversed outpaced the number of new death sentences.\nCalifornia has by far the most people on death row, with 741, followed by Florida with 396, Texas with 254 and Alabama with 194. However, when you consider each state's population, Alabama rises to the top, with nearly 4 people on death row for every 100,000 residents. In Texas, which the Marshall Project has reported carried out more than a third of nationwide executions since 1976, that population-adjusted number is less than one per hundred thousand.\nThe Marshall Project tracks the cases of those on death row in Alabama, Arizona, Arkansas, Florida, Georgia, Missouri, Ohio, Oklahoma, Texas and Virginia.\nSentencing Challenges\n2016 was also a busy year for court challenges related to the death penalty. In January, the U.S. Supreme Court struck down Florida's death penalty sentencing system, which allowed judges to disregard the jury's sentence to impose the death penalty even if jurors recommended life in prison.\nIn October, Florida's Supreme Court ruled that juries must vote unanimously in order to sentence someone to die. \"It's not clear how many people on Florida's death row will get the opportunity to change their death sentence to life in prison,\" as a result of the decision, Nick Evans of member station WFSU reported.\nAt the beginning of this year, Delaware and Alabama were the other two states that allowed judicial overrides of jury decisions in death penalty cases. In the wake of the U.S. Supreme Court decision, Delaware's court struck down its law, and this month the state's Supreme Court said all 12 men on Delaware's death row would have their sentences automatically converted to life in prison.\nIn contrast, the Alabama Supreme Court upheld the constitutionality of the judicial override statute in September, reported Kent Faulk for The Marshall Project. If Alabama followed Florida's lead, and required a unanimous jury decision to impose the death penalty, it could have a large effect on the number of death sentences in the state.\n\"Of the 57 executions in Alabama since the death penalty was reinstated in 1983, 29 involved non-unanimous jury votes, ranging from 11 to 1 for death to 11 to 1 for life, according to an AL.com, Marshall Project review of each case,\" Faulk reported.\nLethal Injection Protocol\nStates also struggled with challenges to lethal injection protocols, and with where to get the drugs used in executions.\nIn May, Pfizer joined other drug companies in its decision not to allow its drugs to be used for lethal injections. Pfizer was the last open-market source for execution drugs, as we reported. More than 20 other U.S. and European drugmakers had already blocked their drugs from being used to kill prisoners.\nAfter the U.S. Supreme Court ruled that using the sedative midazolam was constitutional in 2015, multiple states moved forward with executions using that drug as part of multi-chemical protocols for executing people.\nThe Death Penalty Information Center says three executions used the drug this year – one in Florida and two in Alabama. As we have reported, the Alabama defendant Ronald Smith, \"unsuccessfully argued that midazolam was an unreliable sedative and could cause them to feel pain, citing its use in problematic executions including the botched execution of an Oklahoma man in 2014. A federal judge dismissed the case in November.\"\nSmith was executed in December. Witnesses said he, \"appeared to be struggling for breath and heaved and coughed and clenched his left fist,\" for 13 minutes after he was injected with midazolam. It took 34 minutes for Smith to die.\nOn Tuesday, Arizona announced it would stop using midazolam for executions. In 2014, Arizona prisoner Joseph Randolph Wood died slowly, over the course of nearly two hours during which he gasped and snorted after he had been injected with the drug.\nAnd, after a botched execution in Oklahoma in 2015, a state investigation released this year found prison authorities had \"ordered the wrong execution drugs\" from a pharmacist.","url":"https://www.npr.org/sections/thetwo-way/2016/12/21/506183108/death-sentences-and-executions-are-down-but-voters-still-support-death-penalty-l"}
