{"authors":[],"date_download":"2018-10-30 14:08:42","date_modify":"2018-10-30 14:08:42","date_publish":"2018-10-30 13:55:11","description":"A death row inmate cracked a joke moments before his execution Monday night in South Dakota, the&nbs...","filename":"data/vaneerConsumption/DeathrowinmateinSouthDakotacracksjokebeforeexecution.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Images/file6501250746744-U07251554088dMR-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_death-row-inmate-south_5307ce3fcf2d9b0b8f1553fde0a4d0cb__1540908522.html","title":"Death row inmate in South Dakota cracks joke before execution","title_page":"Death row inmate in South Dakota cracks joke before execution","title_rss":"NULL","source_domain":"ajc.com","text":"A death row inmate cracked a joke moments before his execution Monday night in South Dakota, the Sioux Falls Argus Leader reported.\n>> Read more trending news\n“The warden asked if he had any last words to say and the first thing he said was, ‘Sorry for the delay, I got caught in traffic,’” witness Don Jorgensen, a reporter for KELO, told members of the media, recalling the final remarks of convicted killer Rodney Scott Berget.\nBerget was executed by lethal injection at 7:37 p.m. after a five-hour delay as he waited on an appeal ruling from the U.S. Supreme Court, the Argus Leader reported. Supreme Court Justice Neil Gorsuch rejected a last-minute appeal based on Berget's mental capabilities, the Mitchell Daily Republic reported.\nHis other comments did not mention prison guard Ronald “R.J.” Johnson, whom Berget murdered in 2011 during a failed prison escape.\nJohnson's widow and children said the pain will never go away.\n\"My kids, when they were 11, saw autopsy pictures from the day that my dad was considered a crime scene,” Johnson’s daugher, Missy Schafer, told KELO. “Those memories sit with us and haunt us to this day.”\nAfter making his joke, Berget told several people that he loved them. Witness Dani Ferguson told the Argus-Leader that Berget’s last words were “I love you and I’ll meet you out there.”\nBerget was then strapped onto a gurney and was injected at 7:25 p.m. The execution took 12 minutes, the newspaper reported.","url":"https://www.ajc.com/news/death-row-inmate-south-dakota-cracks-joke-before-execution/ZF9CV1pQH6YwVbQPdEtwgO/"}
