{"authors":["John Hayward"],"date_download":"2018-10-30 18:13:49","date_modify":"2018-10-30 18:13:49","date_publish":"2017-02-09 14:40:40","description":"Welfare is much worse than a way of life for many Americans—it now appears to be a new way of death, according to an expanding body of data and social studies. | Politics","filename":"data/vaneerConsumption/DeathRatesRisingfor30YearOldsasWelfareDespairConsumesaGeneration.json","image_url":"https://media.breitbart.com/media/2017/02/AP_263832994194.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_09__1540923229.html","title":"Death Rates Rising for 30-Year-Olds as Welfare Despair Consumes a Generation","title_page":"Death Rates Rising for 30-Year-Olds as Welfare Despair Consumes a Generation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Welfare is much worse than a way of life for many Americans—it now appears to be a new way of death, according to an expanding body of data and social studies.\n“White Death” is the shorthand way of describing the frightening rise in mortality rates for middle-aged, middle- and low-income white Americans. Since the trend was first propelled into the headlines in the fall of 2015, we’ve gradually recognized it as a symptom of generational despair, with drug abuse and death serving as the exit from lives without hope.\nThis is a cultural horror, and as a new Lancet study reported by Business Insider noted, it’s affecting American Indians and Alaska natives as well:\n“Death at any age is devastating for those left behind, but premature death is especially so, in particular for children and parents,” said senior study author Amy Berrington of the National Cancer Institute in a press release. The study, which analyzed death certificate data ranging from 1999 to 2014, found that mortality rates for 30-year-old white women rose up to 2.3% per year over that time period; those for 30-year-old white men rose .6% per year; annual rates for 30-year-old Native Americans rose 4.3%; and rates for 30-year-old Alaska Natives rose 1.9% per year. For white Americans, that represents a reversal, but the authors write that premature death rates for middle-aged American Indians and Alaska Natives have risen for every birth cohort since 1948. The researchers write that these sorts of increases are “extremely unusual in high-income countries.” They say increases this high are on par with premature mortality spikes at the height of the AIDS epidemic in the US (mid-80s to mid-90s) or in Russia in the post-economic crisis late-1990s.\nThe study went on to observe that mortality rates for many other groups have fallen since the turn of the century, including Hispanics, Asians, Pacific Islanders, and most dramatically black Americans, although their death rates remain generally much higher than whites. The study that originally highlighted rising mortality rates in 2015 explained it was really more a matter of the rates for white Americans of recent generations “flattening out,” while most other groups saw significant improvement over the past 15 years. The improvements have been attributed to successful crusades against smoking, drug abuse, and other unhealthy lifestyle choices, combined with expanded treatment for maladies like HIV.\nAt the close of 2016, the Centers for Disease Control reported that the overall U.S. life expectancy dropped for the first time since 1993, with the under-65 demographic hit particularly hard. The 1993 dip came at the height of the AIDS epidemic.\nReporting on this development, NPR quoted researchers who blamed an “epidemic” of obesity—which leads to increased deaths from “heart disease, strokes, diabetes, and possibly Alzheimer’s”—as well as “the epidemic of prescription opioid painkillers and heroin abuse.”\nAgain, such broad behavioral trends demand a cultural explanation. Why are so many people in certain demographic groups behaving in ways that reduce their lifespans, at a time when medical science is pushing average lifespan ever higher? University of Pennsylvania sociologist Irma Elo suggested rising mortality could be “related to the economic circumstances that many Americans have experienced in the last eight years, or so, since the recession.”\nBut certainly we’ve faced far more dire “economic circumstances” in the past, without such an increase in mortality. The White Death isn’t about people starving. On the contrary, according to the researchers quoted by NPR, rampant obesity is a significant factor.\nPastor Paul Grodell spoke of despair in a December New York Post article on the opiate epidemic in rural and post-industrial America:\n“The root of the addiction comes from the hopelessness that people feel in towns like Elyria,” said Grodell. “When you are in a state of hopelessness, you reach for something that gives you relief, that helps you escape.” Too often government programs and the political rhetoric that promotes them keep people trapped in that hopelessness, tethering them to the life of handouts and government dependency.\nGrodell was himself a heroin addict, whose gateway drug was prescription pain pills to manage the pain from powerlifting competitions. Many studies of the rise in mortality rates point to the easy availability of prescription pain medication as the first step toward serious addiction; it has been theorized that working-class whites were hit so hard because they’re more likely to visit a doctor, complain about chronic pain, and be given painkillers.\nNew York Post author Salena Zito postulated that Donald Trump’s presidential campaign was one of the first times our political elite deigned to notice the devastation in post-industrial America and promise to do something about it. Those communities are usually dismissed in a way the inner cities are not. Their residents have been told to suck it up and accept their diminished prospects as the price of prosperity for diverse others. They’re told to think of themselves as “privileged” simply because of their skin color, and that means they aren’t permitted to complain about government policies or cultural trends that put them at a disadvantage.\n(Not that it’s better to have the full “benevolent” attention of the Nanny State turned upon you, as the situation in the inner cities demonstrates. Inter-generational welfare dependence is precisely what the creators of the Great Society promised would not happen, back when they swore the success of their programs would be measured by how many people no longer needed them. Today, defenders of the welfare state insist its success should be measured by how comfortable and sustainable poverty has become.)\nA December guest editorial at ZeroHedge described the growing sense that “the American Dream is fading,” specifically citing stagnant income and social mobility, declining home ownership, and studies that show children often fare worse than their parents.\nPerhaps one reason that sense weighs so heavily upon the last couple of generations is the growth of mass media and the Internet, giving even the poorest Americans a sense of cultural awareness—including keen awareness of their own plight—that wasn’t possible in the days when there were only a handful of stations on the TV set.\nStudents of poverty often point to the general increase in our material standard of living, coupled with generous welfare assistance, to note that “poverty” in the 21st Century is often objectively better than middle-class life 75 or 100 years ago. And yet, we have a generation killing itself—often actively killing itself, given the rise in suicide rates. That didn’t happen in far more hardscrabble times, although it would be fair to note that lower average life expectancies and more primitive data-gathering methods would have made a mortality spike more difficult to detect, if one did occur.\nMaybe what we’re missing most acutely are the resources for coping with despair—resources of family, community, and church that were more plentiful in times gone by. Ronald Bailey touched on this in a Reason article from January, written after his return to McDowell County, West Virginia some four decades after his family moved away.\nMcDowell County has the lowest average life expectancy for males in the United States, a problem attributed to poverty, drug and alcohol abuse, suicide, and murder. The poverty is largely due to the ongoing collapse of the coal industry, and the mechanization of the work that remains. The place has so few jobs that WalMart closed its store at the county seat.\nBailey noted that McDowell County has a “surfeit of social services agencies and programs,” with a staggering 47 percent of the county’s income coming from Social Security, disability insurance, and the food-stamp program. One of the officials responsible for administering these programs told Bailey that residents have developed an “entitlement mentality,” believing that “everybody owes them a living, housing, clothing, and food.”\nIt is further noted that the provision of such extensive welfare payments creates a “poverty trap” that prevents the remaining impoverished citizens of McDowell County from moving away, as so many others have already done. In other words, every form of ambition has been destroyed, leaving behind an atmosphere of sustained despair, and government money will ensure it grinds on forever.\nSome of the most interesting, and horrible, passages of Bailey’s account concern the demise of families. Young people in their 20s and 30s are described as “strung out and walking around like zombies” instead of working and raising their children. Their parents failed to pass along parenting skills, and the moral imperative to use them. Instead, the cycle of drug addiction is the most likely inheritance for kids to get from their families. Evidently, almost half the children in the country are living with someone other than their biological parents—often grandparents or other family members, stepping in to raise the children of broken homes. Seventy-seven percent of these children live in households where no one has a job.\nAnd there are plenty of those children, even though subsidized birth control is readily available. Teens and twentysomethings simply aren’t bothering to use it, because they know their families and the government will take care of accidental children, and besides, a semi-accidental pregnancy might provide them with some emotional purpose in life.\nIt’s not just the children who suffer from the demise of traditional families and the loss of good parenting skills. The parents find themselves hitting middle age without the financial, social, and emotional resources of an intact family—without children to give them purpose as they begin productive adult lives, without grown sons and daughters to help them as they get older, without financial assets accumulating from one generation to the next.\nBailey quotes from Hillbilly Elegy author J.D. Vance: “Growing up around a lot of single moms and dads and living in a place where most of your neighbors are poor really narrows the realm of possibilities. It means that you don’t have people to show you by example what happens when you work hard and get an education.”\nThat’s the exact opposite of what fashionable liberals have told us for generations now: marriage is a silly formality, there’s nothing special about marriage between men and women, the nuclear family is obsolete, it’s monstrous for society to expect women to sacrifice their career ambitions to focus on raising kids, and single parenting is every bit as good as the traditional family (with a little help from Big Government to cover for Dad’s missing paycheck). Those who warned about the dangers of family breakdown three decades ago were relentlessly mocked for their obsession with outmoded, overrated, narrow-minded “family values.”\nWhat joy and purpose await the dissolute 20- and 30-year-old substance-abusing absentee parents of Bailey’s story when they roll into late middle age? What do they have to look forward to, beyond more of the damaging lifestyle their bodies can no longer sustain? They don’t even have the meager spiritual nourishment of waging a successful struggle to stay alive. When benevolent social programs ensure that survival is no struggle at all, there is nothing left to accomplish, and oblivion is easy to accept.\nWe were mad to think we could “fix” poverty with public money. Money is not the antidote to despair. On the contrary, as the above examples show, money can incubate despair. The true antidotes are not for sale at any price.","url":"https://www.breitbart.com/politics/2017/02/09/death-rates-rising-30-year-olds-despair-consumes-generation/"}
