{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:16:04","date_modify":"2018-10-30 23:16:04","date_publish":"2014-08-13 21:24:18","description":"Sad news for Death Cab For Cutie and fans of the band: According to Rolling Stone, longtime member and band cofounder Chris Walla is leaving Death Cab For Cutie after 17 years, effective after the group finishes their current bunch of tour dates at…","filename":"data/vaneerConsumption/DeathCabForCutieFansWeveGotSomeGoodNewsSomeBadNews.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b23831f1-1bc4-44c9-afb9-1fb6654d2ed3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35686-death-cab-for-cutie-fans-weve-got-some-good-news-some-bad-news_1540941364.html","title":"Death Cab For Cutie Fans: We've Got Some Good News & Some Bad News","title_page":"Death Cab For Cutie Fans: We've Got Some Good News & Some Bad News","title_rss":"NULL","source_domain":"bustle.com","text":"Sad news for Death Cab For Cutie and fans of the band: According to Rolling Stone, longtime member and band cofounder Chris Walla is leaving Death Cab For Cutie after 17 years, effective after the group finishes their current bunch of tour dates at festivals across the world. No specific reason was given for Walla's departure, but it doesn't sound like there was any animosity between Walla and the group: Both parties released affectionate statements about their time together, and Walla specified that he wants to pursue other opportunities in the music industry.\n\"I will miss being a quarter of this band and will support whatever course Death Cab for Cutie chooses from here,\" Walla said. \"I am profoundly grateful to Ben, Nick, and Jason for the experiences that define my adult life. Truly grateful, beyond words. Thank you.\" Walla was heavily involved in producing Death Cab's signature sound, so this is a huge loss — and super sad for anyone who has ever loved a Death Cab song/seen The O.C.\nWalla's statement continued: \"Deciding to leave the band was not, and is not, easy.... It’s really, really sad. I love my bandmates, and I’m proud of what we’ve done, and mercifully, those things don’t change with my departure. Moving forward, my plans are simply to continue making music, producing records, and erring on the side of benevolence and beauty whenever possible. Darkness may find me, but I shall never choose it.\"\nGod. That is so Death Cab.\nSad news, but fret not, Death Cab fans! There is some good news to make you feel a little less sad: The band is putting the finishing touches on their eighth studio album, and it should be released next year. It's not that far off, and Walla was included during the recording process, so hopefully it'll provide some comfort.\nRemaining members Ben Gibbard, Nick Harmer, and Jason McGerr also released a statement about Walla's departure: \"We've had an incredible 17 years of making music with Chris and are very proud of what we've accomplished together, including our eighth studio album, which we have just put the finishing touches on.... We will miss Chris and wish him all the best in the next chapter of his career. We're excited about sharing new music and seeing all of you very soon.\"\nDeath Cab's new album is still without a name, but will be released in 2015.\nImage: Mashable","url":"https://www.bustle.com/articles/35686-death-cab-for-cutie-fans-weve-got-some-good-news-some-bad-news"}
