{"authors":["Gerard Wright","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:45","date_modify":"2018-10-30 22:52:45","date_publish":"2016-11-04 08:00:00","description":"Money changes everything, it is said, and that adage hovers conspicuously over two clashing death penalty proposals that Californians will weigh in next","filename":"data/vaneerConsumption/DeathpenaltydilemmaWillvoteonProps62and66hingeoncosts.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/San_Quenten_Lethal_Injection_Chamber.Wally_Skalij-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939965.html","title":"Death penalty dilemma: Will vote on Props. 62 and 66 hinge on costs?","title_page":"Death penalty dilemma: Will vote on Props. 62 and 66 hinge on costs? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Money changes everything, it is said, and that adage hovers conspicuously over two clashing death penalty proposals that Californians will weigh in next week’s election.\nProposition 62 asks voters to abolish the state’s death penalty after 38 years. The other measure, Proposition 66, promotes a streamlining of legal proceedings so the term “capital punishment” means what it says.\nMixed with the traditional ethical and legal arguments on this sobering subject is the issue of cost—what taxpayers spend on a system with nearly 800 condemned prisoners and not a single execution in more than a decade. Their otherwise warring arguments aside, the opposing camps agree on one thing: that capital punishment costs too much.\nProponents of Prop. 62, the Death Penalty Initiative Statute, say their measure would save money by ending capital prosecutions and converting death sentences to life imprisonment without parole. Backers say the sheer cost of trying a capital case, proving it to the extraordinary standards set by the U.S. Supreme Court and keeping the convicted on Death Row for decades amounts to an empty promise to the families of victims.\nProp. 66, the Death Penalty Reforms and Savings Act, would retain the death penalty and speed things up, proposing to shrink death row by breaking the expensive procedural logjam that routinely delays executions by 20 years or more. Proponents say the state has simply lacked the political will to fix a broken system.\nOutside analysts estimate that abolishing the death penalty could save as much as $150 million a year, the same figure Prop. 62 proponents have adopted. By contrast, although Prop. 66 backers say their measure would save $30 million a year, the analysts say there are too many variables to accurately compute the financial effects of speeding up executions.\nIn the balance is the fate of 749 men on death row at San Quentin State Prison, which houses California’s only execution facility, and 20 condemned women held elsewhere. If both propositions pass, the one with the most votes becomes law.\nProp. 62\nCalifornia’s last execution occurred at San Quentin in January 2006. That year, state and federal courts ruled unconstitutional the three-drug “cocktail” used for lethal injection, an issue that remains unresolved.\n“In a sense, we don’t have the death penalty,” said John J. Donohue, a Stanford University law professor and Prop. 62 supporter.\nCalifornians defeated a repeal of the death penalty only four years ago, rejecting a ballot measure after New Jersey and New Mexico had ended their death penalties and Maryland was about to do so. The winning arguments in those states were largely financial, paired with the risk of executing those wrongly convicted.\nNatasha Minsker, California director of the American Civil Liberties Union, ran the 2012 campaign for the repeal measure, Proposition 34, and introduced the cost issue then. She said fiscal arguments could break through the stalemated morality debate.\n“It’s a very complex issue,” Minsker said recently. “When you focus on morality, it turns people into good guys or bad guys.”\nBetter to look for common ground, she said, “where our vision of justice might align” and the suggestion that state money could be better spent might at least be heard.\nThad Kousser, a political science professor at UC San Diego, agreed, saying most Californians already hold a moral position on the death penalty.\n“It’s hard to swing people on a moral issue when they’ve already decided, so Yes On 62 is taking a financial approach,” he said.\nIn 2008, a commission appointed by the state Senate to study the failures of California’s death penalty put the annual cost of the capital punishment system at $137 million. The panel—which included then-Attorney General Jerry Brown—called that figure rough and conservative. A seminal 2011 study by two experts pegged the expense at $150 million, now adjusted to $200 million. Their figure includes trial costs, appeals, $42 million in death row expenses, and other functions.\nPaula Mitchell, an adjunct professor at Loyola Law School in Los Angeles, executive director of the Alarcon Advocacy Center and Legal Director of the Loyola Project for the Innocent, wrote the 2011 study with Judge Arthur Alarcon, a onetime prosecutor and a former member of the U.S. Court of Appeals Ninth Circuit who died last year. They estimated the death penalty had cost the state a cumulative $4 billion and the federal government a further $775 million. The overall bill is now $5 billion, Mitchell said.\nBreaking down death penalty costs\nThe nonpartisan state Legislative Analyst’s Office, a budget watchdog, estimates that passage of Prop. 62 would eventually save $150 million a year, including legal, judicial, administrative and housing costs. Too much is unknown to present a precise breakdown, the agency says, with the exception of $55 million for the judicial and other agencies involved in death penalty challenges. Overall savings could ultimately be larger, or smaller, by tens of millions of dollars, the LAO says.\nIf voters pass the initiative, California will join 20 other states that have repealed the death penalty.\nProp. 66\nIn 1976, the U.S. Supreme Court ruled that the accused in capital cases must be granted what a legal scholar later described as “super due process.” In California, this gradually transformed the death penalty system into a legal labyrinth that wends its way from a finding of guilt and a sentence to execution in Superior Court, through an automatic appeal to the state Supreme Court, which reviews the trial record.\nIf that appeal fails, further state and federal proceedings can be requested to review issues outside of the trial record, such as allegations of prosecutorial or defense misconduct or ineffectiveness, as well as the defendant’s life and circumstances. These and other steps can take decades, during which the state pays for lawyers to represent most prisoners, who typically have few resources or quickly exhaust those they have.\nDeath-sentence appeals would still be heard in the Supreme Court under Prop. 66, but they would have to be adjudicated within five years. The measure would also impose a five-year limit on state resolution of constitutional issues—those outside the trial record—and further require them to be heard in the Superior Court already familiar with the case, rather than in the Supreme Court.\n“This compresses the process,” said Michael Rushford, president and CEO of the San Francisco-based Criminal Justice Legal Foundation, which supports Prop. 66 and opposes Prop. 62.\nExpansion of the courts would be needed to accommodate the Prop. 66 timeline, and that would come with costs, analysts say. The Superior Courts complain that they are chronically understaffed; a new report from a state judicial advisory committee says the system needs 189 more judges to handle even its current workload.\nKent Scheidegger, general counsel of the San Francisco organization, said the number of cases Prop.66 would add to the workload “is not large in the big picture of things.\nHowever, the LAO estimates that Prop. 66 would initially cost taxpayers money, mostly for lawyers to deal with the backlog of capital cases and other significant spending within the judicial system.\nThe annual cost of processing hundreds of challenges to the death penalty would be “in the tens of millions for many years,” depending on how courts addressed the increased workload, with savings in the longer term on inmate housing and supervision that could “potentially reach” the same figure.\nWhere death row prisoners come from\nIt is not clear how long it would take for things to even out.\nThe analyst says long-term courts costs are uncertain because of the varying complexity of legal challenges and how courts would handle them, as well as an unknown need for and availability of more attorneys. The judicial branch itself has no projections for what Prop. 66 would cost, a spokesman said, citing a state prohibition on involvement in ballot measures before voters have spoken.\nShortening the appeals process would shorten condemned prisoners’ lifetimes—and therefore their expense to the state, Scheidegger said.\n“Inmates will typically be executed in middle age or earlier, rather than being kept to the last day of their natural life,” Scheidegger said by email.\nRushford said the model for speed and lethality would be Virginia. That state has carried out 111 executions since 1982, and nobody sits on death row there for more than 10 years.\nCALmatters contributor Gerard Wright is a freelance journalist based in Pasadena.","url":"https://calmatters.org/articles/can-cost-change-voters-minds-about-the-death-penalty-backers-of-props-62-and-66-hope-so/"}
