{"authors":[],"date_download":"2018-10-30 01:11:00","date_modify":"2018-10-30 01:11:00","date_publish":"2018-10-29 00:05:18","description":"Pray for us, I will call you later.”That was the text message we received from our 16-year-old daughter at 10:16 a.m. on Saturday morning as we drove down Liberty Avenue toward Pittsburgh’s Strip District.My wife called her immediately. “Are you okay? Were you in an accident? What’s happening?”","filename":"data/vaneerConsumption/DeathattheTreeofLifeSynagogue.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/TreeOfLifeStreet.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861860.html","title":"Death at the Tree of Life Synagogue","title_page":"Death at the Tree of Life SynagogueThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“Pray for us, I will call you later.”\nThat was the text message we received from our 16-year-old daughter at 10:16 a.m. on Saturday morning as we drove down Liberty Avenue toward Pittsburgh’s Strip District.\nMy wife called her immediately. “Are you okay? Were you in an accident? What’s happening?”\nI heard a gasp from my wife and braced myself.\nIn a hushed voice, my daughter explained that she and our second daughter and three friends, along with an adult friend of ours, were hiding in their van across the street from the Tree of Life synagogue in Pittsburgh’s Squirrel Hill section, the wonderful historic Jewish section of Pittsburgh. They were there for a Saturday morning retreat at an Opus Dei house. They had arrived at 9:55 a.m. They initially stopped the van directly across from the synagogue, on Shady Avenue, which would have been straight in the line of fire between the police and the shooter, who did his dirty work both outside and inside. They were planning to hop out and walk to the house. Mercifully, the driver, our friend Suzy, decided almost on a whim (a gut-feel, she later conceded) to find a parking spot so she could walk the girls inside. Just as she moved to a spot a little further away, police cars began flying in, and out poured officers brandishing serious weaponry.\nAs the girls struggled to assess the chaos, the police parked sideways so the officers, now in combat readiness, could use their vehicles as shields for the shoot-out. The girls’ van was hemmed in. The street was instantly closed off, like an action scene right out of Hollywood. Suzy told the girls not to get out, and to duck. They all sat on the floor of the van and listened and prayed and worried.\nWe received the text message about 20 minutes later.\nShortly after we talked to our daughter, Suzy and the girls made a careful decision to try to drive a little further away. She did a U-turn and went down the street just enough to pull into a driveway that allowed them to put a few houses and buildings of separation between them and the synagogue — and the gunfire. More and more police streamed in.\nWith none of us having an idea why this was happening, my wife and I headed to St. Paul’s Cathedral in the Oakland section of Pittsburgh, closer to the girls and to a church. We sat in that parking lot and prayed and worried, and alerted family and friends. We checked websites, radio, any source for information.\nAfter nearly an hour of confusion and concern, the girls decided to abandon the van. They dashed across backyards and over fences to meet a relative of Suzy who lived down the street. They met him in his getaway car.\n“I was really surprised that we heard gunfire,” Suzy would later say of their escape. She had hoped the shooting had ended. “I didn’t expect that. That was scary.”\nThe whole thing was scary. It was also evil — an act of evil against our beloved Jewish brothers and sisters at a peaceful Saturday worship service.\nI followed a roundabout route to the house of Suzy’s relative, barely avoiding the blocked off crime scene and eluding police cars screeching past. We picked up all the girls. All were safe. My 16-year-old had merely a small cut on her hand and a ripped sweater from jumping a fence.\nThe same cannot be said, of course, for all the people inside that synagogue, 11 of which were murdered, nor for the injured police who risked their lives to save many others. My wife and I gave thanks to God that our loved ones didn’t get caught in the crossfire. I imagine, however, that many of the families of the victims are asking why God hadn’t protected their loved ones. That’s one of those timeless questions that the Jewish people in particular, and believers of all stripes, have often asked since literally the time of Job. It’s a mystery why some leave this world in a violent way, seemingly prematurely, while others stay longer in this valley of tears and sorrow. I have no answer there, though I know that God is the Author of Life, and God wasn’t pulling the trigger in that synagogue. That was a malicious act of evil by a warped human being, not an act of benevolence by a loving God.\nI also feel confident in saying this: the true Tree of Life is not an earthly one but an eternal one. This world, unlike the heavenly paradise we seek, is full of sin and rot. Trees in this world decay and die. Like people, they face mortality in this realm. Eternal life and perfect bliss is not reachable in this world. It comes in the next.\nWe live not so much for this world — though we strive to make it better — but above all for the next. Those who permanently departed the Tree of Life synagogue on Saturday morning, October 27, 2018, now enjoy a Tree of Life truly greater and truly everlasting. That may be small consolation to their grieving and hurting loved ones, but I think it’s truly the best we can say.","url":"https://spectator.org/death-at-the-tree-of-life-synagogue/"}
