{"authors":["Australian Associated Press","Leith Huffadine For Daily Mail Australia"],"date_download":"2018-10-22 20:47:23","date_modify":"2018-10-22 20:47:23","date_publish":"2016-01-28 03:48:23","description":"Four-month-old Baby Ebony had more than 50 injuries when she was found after being left dead in a cot for a week in Adelaide in 2011. A coroner has slammed authorities for failing her.","filename":"data/vaneerConsumption/DeathofbabyEbonyleadstocoronertoslamauthorities.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6AE7400000578-0-image-a-4_1453955016339.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420276_Coroner-slams-authorities-calls-national-child-protection-database-horrific-death-baby-Ebony_1540241243.html","title":"Death of baby Ebony leads to coroner to slam authorities","title_page":"Death of baby Ebony leads to coroner to slam authorities | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A coroner has lambasted authorities for failing a four-month-old baby who died from horrific injuries at her father's hands in 2011.\nBaby Ebony was left dead in her cot in Adelaide for a week after she died before her parents alerted Families South Australia.\nShe had over 50 injuries, including 48 healing fractures and other recent injuries when she was found.\nScroll down for video\nBaby Ebony, who died aged four months and was found dead with over 50 recent and healing injuries to her body\nSouth Australia deputy coroner Anthony Schapel slammed authorities for not failing baby Ebony, whose death was avoidable, he said\nSouth Australian deputy coroner Anthony Schapel said authorities failed to investigate baby Ebony's parents (left and right) properly\nSouth Australian deputy coroner Anthony Schapel said the death of Ebony, who was 'serially brutalised' by her father, was 'preventable' and authorities failed to take action when she was hospitalised with a broken femur aged only five weeks.\nThat injury should have resulted in her being taken off her parents, 9 News reported him as saying.\n'In my view, the evidence demonstrates that the investigation was a truncated and ill-informed affair that lacked proper cohesion, and which wholly failed to protect Ebony.'\nHe said it was 'absurd' for Families SA to think the baby girl was not at risk from her father, who was 17 at the time.\nMr Schapel said it was absurd for Families SA to think baby Ebony was not at risk from her father, who had a history of child abuse\nDeputy Coroner Anthony Schapel made his statements on thursday at the end of an inquest into baby Ebony's death\nEbony also received multiple bone fractures to her torso and limbs before dying from blunt force trauma, 9 News reported.\nBoth of her parents had histories of child abuse that were not taken into account, he said.\nFamilies SA and SA Police failed to investigate Ebony's father properly, who has been jailed after pleading guilty to criminal neglect even after he admitted to causing Ebony to break her leg while under the influence of drugs, according to Mr Schapel.\nHer mother had been under the guardianship of the New South Wales government - where both parents were from, the ABC reported.\nMr Schapel also called for a national child protection database to be be established to prevent further deaths at the hands of violent and neglectful parents.\nHe made his recommendation on Thursday at the conclusion of an inquest into the death of baby Ebony.\nThe database would ensure immediate access to interstate records, the ABC reported.\nAnother recommendation was an alert to be sent out when contact with a child's parents was lost.","url":"https://www.dailymail.co.uk/news/article-3420276/Coroner-slams-authorities-calls-national-child-protection-database-horrific-death-baby-Ebony.html"}
