{"authors":["Mia De Graaf For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 03:33:00","date_modify":"2018-10-23 03:33:00","date_publish":"2016-01-28 19:06:06","description":"The New York company beat more than 15,000 other small businesses in voting by the public and Intuit employees to promote its product during the most-watched television event in the US.","filename":"data/vaneerConsumption/DeathWishCoffeewinsSuperBowl2016commercialspot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:0827535a0a154a4093e8451cbae3caee-2vdWmEltwXfba0ce28e632bdf6d9-99_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421004_A-coffee-named-Death-Wish-wins-Super-Bowl-commercial_1540265580.html","title":"Death Wish Coffee wins Super Bowl 2016 commercial spot","title_page":"Death Wish Coffee wins Super Bowl 2016 commercial spot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A small coffee firm has landed a coveted commercial spot in next week's Super Bowl 50.\nDeath Wish Coffee Co. won a competition held by software maker Intuit for a 30-second ad during the third quarter of the big game on February 7.\nNormally, businesses have to pay $5million for air time during the most-watched television event in the U.S.\nLast year more than 114million people tuned in to the big game.\nMichael Brown, owner of Death Wish Coffee Company, won a competition held by software maker Intuit for a 30-second spot during the third quarter of the Super Bowl on February 7, 2016\nThe New York company, which claims to brew the 'strongest coffee in the world', beat more than 15,000 other small businesses in voting by the public and Intuit employees to promote its product.\nIts commercial stars Irish actor Diarmaid Murtagh, known for The Monument Men.\nThe ad shows a Viking galley ship in stormy waters with the crew exhorted to keep rowing; the ship and the sea end up in a cup of Death Wish coffee downed by a man in his 21st-century kitchen.\nSuper Bowl commercials are usually bought by high-profile brands like Chevrolet, Doritos and Budweiser.\nDeath Wish was founded in 2012 by Mike Brown, who owns a coffee house in Saratoga Springs, New York, and wanted to find a strong, highly-caffeinated brew.\nPackaged in a black bag with a skull and bones label, the coffee, a blend that Brown created, is sold in a handful of stores and online.\nDeath Wish currently sells about 1,000 pounds a day, a number expected to increase considerably after the Super Bowl spot runs.\nBrown recently hired two employees to prepare for a jump in business, giving him a staff of 12.\n'If even half a percent of the people who watch the commercial decide to buy a bag and give it a try, and 90 percent of them recommend it to others, we could have some amazing growth in the future,' he said.\nSome spots have been used to showcase younger but fast-growing companies, most notably Apple, whose 1984 commercial creating buzz about its Macintosh computer is seen as the gold standard of Super Bowl ads.\nDeath Wish is the second company that Intuit has bought an ad for. In 2014, it paid for a spot for GoldieBlox, a toy for girls, after holding a similar competition.\nThe Super Bowl is the most-watched event in the U.S. Last year's game between the New England Patriots and Seattle Seahawks had an audience of over 114 million people.\nThe ad shows a Viking galley ship in stormy waters with the crew exhorted to keep rowing; the ship and the sea end up in a cup of Death Wish coffee downed by a man in his 21st-century kitchen\nThe commercial stars Irish actor Diarmaid Murtagh, known for The Monument Men\nThe New York company, which claims to brew the 'strongest coffee in the world', beat more than 15,000 other small businesses in voting by the public and Intuit employees to promote its product\nThis was the story board Death Wish Coffee submitted to Intuit\nThe ads get almost as much attention as the game itself. Viewers post comments on social media during the game, and the commercials are a topic of conversation the day after.\nThe big game between the Denver Broncos and the Carolina Panthers is more than a week away but teasers have already been released for some of the star-studded advertisements.\nBud Light is creating its own fake political party with actors Amy Schumer and Seth Rogen, with the bizarre teaser showing them getting dressed.\nMeanwhile first-time advertiser Amazon's teaser - for its wireless speaker and command gadget, Echo - shows Alec Baldwin and Dan Marino planning a Super Bowl party.\nHyundai's adverts will have Kevin Hart and Ryan Reynolds starring in them, but their teasers did not picture the pair.\nOne, called Ryanville, shows two women stopping their car to ogle at someone, presumably Reynolds.","url":"https://www.dailymail.co.uk/news/article-3421004/A-coffee-named-Death-Wish-wins-Super-Bowl-commercial.html"}
