{"authors":["Associated Press"],"date_download":"2018-10-22 21:17:24","date_modify":"2018-10-22 21:17:24","date_publish":"2016-01-29 06:01:05","description":"DES MOINES, Iowa (AP) — It was clear, even before it started, that Thursday night's Republican presidential debate would be dramatically different. GOP front...","filename":"data/vaneerConsumption/DebatetakeawaysTrumpabsenceboostsGOPrivals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:7e5e038c80fa4848b3ea036b180b3101-4PuZeKVXE7cd9005b2c87657773d-535_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422202_Debate-takeaways-Trump-absence-boosts-GOP-rivals_1540243044.html","title":"Debate takeaways: Trump absence boosts GOP rivals","title_page":"Debate takeaways: Trump absence boosts GOP rivals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Debate takeaways: Trump absence boosts GOP rivals\nDES MOINES, Iowa (AP) — It was clear, even before it started, that Thursday night's Republican presidential debate would be dramatically different.\nGOP front-runner Donald Trump had voluntarily given up his regular place at center stage. He skipped the debate, preferring to mount a rally across town to punish Fox News Channel for \"toying\" with him.\nThe billionaire businessman's absence was addressed early and then his Republican rivals quickly moved on, getting a far better opportunity to shine. Overall, the two-hour affair featured a sober tone focused more on substance than personality.\nRepublican presidential candidates (L-R) New Jersey Gov. Chris Christie, Sen. Marco Rubio, R-Fla., former Florida Gov. Jeb Bush and Sen. Ted Cruz, R-Texas, talk after the Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nThere were exceptions, of course, as Ted Cruz defended his authenticity and Marco Rubio faced pointed questions on immigration.\nBut just days before Iowa's leadoff caucuses, there were none of the breakout moments that have sometimes characterized the more colorful debates featuring Trump, battling Cruz for first place in the 2016 primary season's opening contest.\nSome takeaways from Thursday's Republican debate:\n__\nELEPHANT NOT IN THE ROOM\nTrump has repeatedly demonstrated his ability to dominate the stage. There is little doubt he helped his rivals by not showing up.\nHe was mocked early and largely forgotten. Cruz set the tone with a sarcastic impression of his top rival: \"I'm a maniac and everyone on this stage is stupid, fat and ugly,\" Cruz said. Then he thanked his fellow candidates for showing Iowa voters respect by showing up.\n\"I kind of miss Donald Trump; he was a teddy bear to me,\" said former Florida Gov. Jeb Bush, a frequent target of Trump.\nBeyond a few playful jabs, the two-hour debate was a Trump-free zone, one of the few such events in the race so far.\n__\nCRUZ THE FRONT-RUNNER\nCruz fought to make sure he was positioned at center stage in Trump's absence. And he embraced the role of de facto front-runner at the outset, pointing out that he was being attacked by several rivals — even before there were any pointed exchanges.\nCruz later faced sharp questions on immigration, national security and, perhaps most importantly, whether he was trustworthy. Trust is the theme of the fiery conservative's campaign, and several candidates questioned his authenticity.\n\"Ted, throughout this campaign, you've been willing to say or do anything in order to get votes,\" Rubio charged.\nCruz fought back by accusing Rubio of bending to the will of donors on immigration.\n__\nNO AMNESTY FOR RUBIO\nRubio did not help himself among the conservatives who question his position on immigration. The issue is by far his greatest vulnerability as he tries to convince skeptical GOP activists that he doesn't support so-called amnesty.\nThe debate moderators played a series of video clips highlighting Rubio's apparent shift on the issue, which put the first-term senator on the defensive at the outset of a key exchange.\nAt best, Rubio may have clouded the issue of whether he had backed off his earlier calls for comprehensive legislation that includes a pathway to citizenship.\nBut rival Jeb Bush seemed to get the best of him in an exchange in which Bush questioned Rubio's retreat on the issue.\n\"You shouldn't cut and run,\" Bush charged.\n___\nBUSH CLOUDS LANE\nBush repeatedly beat back questions about his long-term viability in the 2016 contest, insisting he has a path to the nomination and would ultimately defeat leading Democrat Hillary Clinton.\n\"We're just starting. The first vote hasn't been counted. Why don't we let the process work?\" Bush said.\nOverall, Bush had more success on the debate stage without having to contend with Trump. His strength — and full-steam-ahead approach — was a pointed reminder that the fight for the party's mainstream wing is far from over.\nBush and Rubio are competing with New Jersey Gov. Chris Christie and Ohio Gov. John Kasich to win over the GOP's centrist wing. Some party officials hoped Rubio would have emerged as the consensus choice by now.\nBush defended rounds of anti-Rubio attack ads.\n\"This is beanbag compared to what the Clinton hit machine is going to do to the Republican nominee,\" Bush said.\n___\nTRUMP'S COUNTERPROGRAMMING\nIt was a risky move politically, but Donald Trump helped raise $6 million to benefit veterans at an event three miles away from the debate stage.\nInstead of going after his rivals on national television, Trump read out the names of wealthy friends who'd pledged major contributions to veterans' causes. When he announced he'd pledged $1 million himself, the crowd erupted into cheers.\nHe explained to the Drake University crowd that he had little choice but to skip the debate. Trump admitted he didn't know if the decision would hurt him in the polls, but tried to cast it as a sign of strength.\n\"You have to stick up for your rights. When you're treated badly, you have to stick up for your rights,\" he said.\nAs for the debate, Trump predicted it would have far fewer viewers without him on the stage. That may be true, but Iowa voters will decide in four days whether Trump hurt his chances in the 2016 race simply to prove a point.\n____\nFollow Steve Peoples on Twitter at: http://twitter.com/sppeoples\nTed Cruz, right, talks to Jeb Bush after a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)","url":"https://www.dailymail.co.uk/wires/ap/article-3422202/Debate-takeaways-Trump-absence-boosts-GOP-rivals.html"}
