{"authors":["Richard Shears For Mailonline"],"date_download":"2018-10-22 23:46:17","date_modify":"2018-10-22 23:46:17","date_publish":"2016-01-29 12:12:46","description":"A large chunk of metal was found washed up on a beach in north east Malaysia near the area where villages reported hearing a low-flying aircraft on the night in March 2014 when MH370 disappeared.","filename":"data/vaneerConsumption/DebriswashedupinMalaysiaseastcoastisnotpartofmissingMH370.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/26/08/3083874C00000578-0-image-a-5_1453797332613.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422628_Second-piece-metal-debris-believed-missing-MH370-washes-time-near-Malaysian-village-low-flying-jet-seen-day-vanished_1540251977.html","title":"Debris washed up in Malaysia's east coast is not part of missing MH370","title_page":"Debris washed up in Malaysia's east coast is not part of missing MH370 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Malaysia's officials have said that a large chunk of metal found washed up on a beach in the Gulf of Thailand was not from missing Malaysia Airlines flight MH370.\nIt was the second time in a week authorities have dismissed speculation that wreckage from the jet had been found, after a similar piece of ocean debris recovered from a beach in Southern Thailand on Jan 23 proved not to be from MH370.\nWithin 24 hours it was revealed that the part was actually from a Japanese rocket.\nScroll down for video\nFind: A piece of suspected aircraft debris was discovered by fishermen on January 23, at a beach in the southern province of Nakhon Si Thammarat, Thailand\nSearch: The barnacle-covered piece of metal has some identifying features, which should help narrow down whether or not it came from a plane\nMalaysia's transport minister Liow Tiong Lai said the two-metre-long object found in the eastern state of Terengganu on Thursday had been examined by officials from the ministry, the Department of Civil Aviation and Malaysia Airlines.\n'The assessment found that the debris does not match those of a Boeing 777, thus confirming that the debris is not from MH370,' he said in a statement.\nThe minister did not elaborate further.\nBoth objects had been found in the region embracing south east Thailand and north east Malaysia, causing excitement that the waters where the Malaysia Airlines plane crashed had finally been located.\nThe second large chunk of metal, found washed up on Wednesday on a beach in north east Malaysia, the area where several villages had reported hearing a low-flying aircraft on the night in March 2014 when MH370 disappeared.\nMalaysian newspapers - the New Straits Times and The Star - reported that several experts, including investigators who have been involved with the MH370 disappearance, arrived at the Besut police station Friday to examine the metal object which had been found by local fishermen.\nMystery: According to Patthikongpan, local 'fishermen said it could have been under the sea for no more than a year, judging from barnacles on it'. The edges of the piece of metal appear to reveal a 'honeycomb' structure, which is widely used in aircraft and rockets due to its light weight\nOfficial: Thai soldiers carry a piece of suspected aircraft debris after it was found by fishermen on January 23, at a beach in the southern province of Nakhon Si Thammarat\nSpeculation: Villagers discovered the piece of metal (pictured), before reporting it to the authorities to help identify it, said Tanyapat Patthikongpan, head of Pak Phanang district\nMeasuring about eight feet in length, it has led to villagers speculating that it could have come from an aircraft.\nAfter examining the metal piece, the team of investigators then travelled to the beach where it was first discovered just 50 yards from the shore.\n'We would urge the public not to make any speculation about its origins,' said a police spokesman.\nThe Malaysian team have yet to make any comment on their findings.\nDespite excitement being raised about the discoveries off the coastlines facing the Gulf of Thailand, the official search for MH370 continues in the southern Indian Ocean, south west of Australia.\nLast July a two-metre-long wing part known as a flaperon washed up on a beach on the French-held Indian Ocean island of Reunion, thousands of kilometres from Thailand.\nFrench authorities subsequently confirmed 'with certainty' two months later than the wing part found on the remote island was from MH370.\nMissing: A map showing the fated plane's flight path from Kuala Lumpur to Beijing; where the last radar contact was received from the plane; the wreckage discovered this week in Nakhon Si Thammarat province, Thailand; and the wreckage discovered on La Reunion island in July 2015, which was confirmed to be from the MH370\nGenuine: French prosecutors confirmed 'with certainty' in September that the wing part (above) found on a remote Indian Ocean island, La Reunion, in July was from missing flight MH370\nTests were carried out on the flaperon, which was found on La Reunion in July, by the French body responsible for civil aviation accident investigations.\nAt the time of the discovery on the French territory last month, Malaysian officials said it was 'almost certain' the wing flap came from a Boeing 777 – the same model as the Malaysian airlines jet.\nThe 6ft-long wing flap washed up 3,500 miles from the doomed jet's last-known location, fuelling hopes across the world that one of aviation's greatest mysteries could finally be solved.\nThe search for the plane is due to end in June this year, despite the Chinese relatives pleading for it to be expanded.","url":"https://www.dailymail.co.uk/news/article-3422628/Second-piece-metal-debris-believed-missing-MH370-washes-time-near-Malaysian-village-low-flying-jet-seen-day-vanished.html"}
