{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-23 05:26:32","date_modify":"2018-10-23 05:26:32","date_publish":"2016-01-11 18:28:50","description":"The Delta Airlines flight was taking off from Ben Gurion Airport, heading to New York JFK Airport. It is the second time debris has fallen off a Delta plane there in less than three months.","filename":"data/vaneerConsumption/DebrisfromDeltaAirlinesplanethatfelloffdownrunwayinIsraelpictured.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/30063D4200000578-0-image-a-31_1452530682481.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3394112_Pictured-Debris-passenger-plane-fell-hurtled-runway-Israel_1540272392.html","title":"Debris from Delta Airlines plane that fell off down runway in Israel pictured","title_page":"Debris from Delta Airlines plane that fell off down runway in Israel pictured | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This photo shows the parts of a plane that fell off during take-off in Israel.\nThe Delta Airlines flight was taking off from Ben Gurion Airport, heading to New York JFK airport.\nHowever moments after its wheels lifted off the tarmac, various parts of the aircraft dropped to the runway.\nChannel 2 in Israel showed the parts of the Delta Airlines plane that fell off on take-off\nThe debris remained on the runway, after it originally went undetected by CCTV cameras. At least five planes are believed to have left the runway in the time it took to be discovered.\nThe incident was reported by Israeli television station Channel 2 on Saturday.\nAn alarm did alert the control tower that something was on the runway, but that was declared as a false alarm as the controller couldn't find anything on patrol.\nChanneI 2 claim that many of the cameras used to scan the runway are not fully operational.\nHowever, Ben Gurion's CEO Shmuel Zakai blamed the incident on human error, telling the Times of Israel: 'The system meets required international standards.\n'In this safety incident, the radar identified the plane parts that fell, [but] the employee on station did not act according to regulations — and the labor union refused to allow the employee to participate in the investigation that should have taken place.'\nA warning of the debris on the runway was sounded to the control tower, but an initial search didn't discover where the parts were\nA spokesperson for Delta told MailOnline: 'During a routine runway inspection on January 9, at Ben Gurion Airport, a small part was found and identified as belonging to a Delta aircraft.\n'Delta’s flight DL408 to New York-JFK took off and later landed without incident in New York. No other flights have been affected by this. The safety of Delta's passengers and crew is the airline’s number one priority.'\nMailOnline has contacted Ben Gurion Airport for comment.\nIn October last year a Delta flight out of Ben Gurion was delayed when a wheel fell off the aircraft.\nDespite the incident, the plane flew on to JFK Airport in New York, and made a successful landing. Again, a warning was given to the control tower, but the wheel was not found straight away.\nBack in March 2014, a Delta plane had a lucky escape after part of its wing broke off during a flight from Florida to Georgia.\nPassengers on board Flight 2412, from Orlando to Atlanta, were shocked when they looked out of the window to see a large panel missing from the wing, exposing a tangle of wires and hydraulic machinery to the elements.\nWithin minutes of a passenger spotting the damage, the pilot of the Boeing 757 decided to make an emergency landing.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3394112/Pictured-Debris-passenger-plane-fell-hurtled-runway-Israel.html"}
