{"authors":[],"date_download":"2018-10-30 20:24:16","date_modify":"2018-10-30 20:24:16","date_publish":"2015-11-09 13:49:55","description":"A Buckhead motorist died early Monday after slamming into a tree brought down by the morning’s gusty wind and saturated soil.","filename":"data/vaneerConsumption/Decaturman81killedafterdrivingintofallentreein.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/09/Images/photos.medleyphoto.8368503.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_decatur-man-killed-_c777f68a659a9291a24b246e21454849__1540931056.html","title":"Decatur man, 81, killed after driving into fallen tree in...","title_page":"Decatur man, 81, killed after driving into fallen tree in...","title_rss":"NULL","source_domain":"ajc.com","text":"A Buckhead motorist died early Monday after slamming into a tree brought down by the morning’s gusty wind and saturated soil.\nThe incident happened in the 3400 block of Woodhaven Road, just off West Paces Ferry Road behind the Governor’s Mansion.\nAtlanta fire spokesman Cortez Stafford said the man, who was driving a sport utility vehicle, hit the 50- to 60-foot tall, 2-foot diameter tree in the predawn darkness shortly before 6 a.m.\nThe SUV slid mostly under the tree and the man, later identified as 81-year-old Decatur resident Marion Webb, died at the scene.\nThe tree was one of many felled across metro Atlanta by the combination of the 20 mph wind gusts and the ground that was saturated by more than an inch of weekend rain.\nOther trees were reported down around daybreak Monday on Tilden Road, Peyton Road and Beechwood Drive in Atlanta, on Lower Roswell Road near Lindsay Road and on Whitlock Avenue near John Ward Road in Cobb County, on Johnson Road at Suwanee Dam Road and on Hood Road near Cedars Road in Gwinnett County and on Drew Valley Road at Nesbitt Drive, Brandon Mill Road at Dalrymple Road and Grapevine Run near Dunwoody Club Drive in Fulton County.\nGeorgia Power officials reported about 3,200 customers without electricity statewide at 8 a.m. Monday.","url":"https://www.ajc.com/weather/decatur-man-killed-after-driving-into-fallen-tree-buckhead/fo8qoi157JrAMF298tojCM/"}
