{"authors":["Matt Turner"],"date_download":"2018-10-30 21:04:57","date_modify":"2018-10-30 21:04:57","date_publish":"2016-12-22 00:00:00","description":"The annual decathlon event, where the financial industry's finest compete in events inspired by the NFL Scouting Combine and the Olympic Decathlon, is some way off.","filename":"data/vaneerConsumption/DecathloncompetitionlineupBusinessInsider.json","image_url":"https://amp.businessinsider.com/images/5858132aa1a45ef4008b6cd9-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_decathlon-competition-line-up-2016-12_1540933497.html","title":"Decathlon competition line-up - Business Insider","title_page":"    Decathlon competition line-up - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Five-time champion Mark Rubin is not returning Kevin McCarthy Meet the men and women aiming for the title of 'Wall Street's Best Athlete.'\nThe annual decathlon event, where the financial industry's finest compete in events inspired by the NFL Scouting Combine and the Olympic Decathlon, is some way off. The New York event isn't scheduled until June.\nBut already many of the competitors are in training.\nThe big news is that Mark Rubin, the five-time winner and defending champion, is not planning to return.\n\"I don't blame him after five in a row and last year's story-book ending,\" Randy Giveans, who placed third in the 2016 edition behind Rubin, told Business Insider.\nThe Goldman Sachs' team led by Tom Tesauro and Melvis Langyintuo that won back-to-back titles in 2015 and 2016 isn't returning either. That opens up the field for those hoping to take the men's title and the team title.\nThe event has raised close to $8 million for charity, and now has regional events in Boston, Houston, Chicago, and San Francisco. It's also shown on TV on NBCSN. The events are: 400m run, football throw, pull-ups, 40yd dash, dips, 500m row, vertical jump, 20yd shuttle sprint, bench press, and 800m run.\nHere's a look at some of those hoping to take a title in the 2017 edition:","url":"https://www.businessinsider.com/decathlon-competition-line-up-2016-12"}
