{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:46:52","date_modify":"2018-10-30 21:46:52","date_publish":"2016-10-21 14:54:24","description":"A Pan-Asian favorite in Decatur has rebranded to focus on craft ramen.","filename":"data/vaneerConsumption/DecatursMakanbecomesTaiyoRamenmenutofocusoncraftramen.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/21/Images/WPIMAGE_cmgajcfoodandmore_11385.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_de_6b88758a30e2403f6c637cbdc52f3ec2__1540936012.html","title":"Decatur's Makan becomes Taiyo Ramen; menu to focus on craft ramen","title_page":"Decatur's Makan becomes Taiyo Ramen; menu to focus on craft ramen","title_rss":"NULL","source_domain":"ajc.com","text":"A Pan-Asian favorite in Decatur has rebranded to focus on craft ramen.\nMakan, which opened at 130 Clairmont Ave. in Decatur in 2014, is now Taiyo Ramen. The restaurant previously featured ramen on its menu, in addition to dishes that drew from Asian street food and Chinese family dinners. The team behind the restaurant -- partners Michael Lo and George Yu -- will remain on board.\nLo said in an email that \"it was only natural\" to shift the menu's focus to ramen due in part to the Lo and Yu's opening of Suzy Siu's Baos at Krog Street Market next month.\nThe Taiyo Ramen menu doubles the restaurant's ramen options -- including tonkotsu ramen, shio ramen made with local Beautiful Briny Sea salt, Hokkaido-style seafood ramen, duck ramen, a Korean-style beef and kimchi ramen and a fall vegetable ramen -- and keeps on a few favorites from the old menu, including pork belly buns and dumplings.\n\"What's important to us is that we didn’t change what has made Makan great before,\" Lo said.\nSuzy Siu's Baos -- previously known as Betty Hsu's Baos -- will serve steamed buns, including the pork belly and roasted duck buns from Makan’s menu, along with new seafood and vegetarian steamed bun options and other seasonal dishes.\nTaiyo Ramen, 130 Clairmont Ave., Decatur. 404-996-6504, taiyoramen.com/\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now","url":"https://www.ajc.com/blog/atlanta-restaurants/decatur-makan-becomes-taiyo-ramen-menu-focus-craft-ramen/sqx9GAOkStpAdHXMjA4N8N/"}
