{"authors":[],"date_download":"2018-10-30 19:38:53","date_modify":"2018-10-30 19:38:53","date_publish":"2018-10-30 09:23:06","description":"Decatur officials believe they’re close to solving extreme traffic delays that have inspired c...","filename":"data/vaneerConsumption/Decatursayslightsrunningsmootherattwocomplexintersections.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23317130_FlashingYellowArrow.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_decatur-says-lig_70bd748fcfedc3a61e3e9ce24a249427__1540928333.html","title":"Decatur says lights running smoother at two complex intersections","title_page":"Decatur says lights running smoother at two complex intersections","title_rss":"NULL","source_domain":"ajc.com","text":"Decatur officials believe they’re close to solving extreme traffic delays that have inspired considerable public angst over the last two weeks.\nOn Oct. 18, after a long wait, the Georgia Department of Transportation installed two state-of-the art traffic signal cabinets, one at the intersection of East College Avenue and North McDonough Street and the other at East College/Candler Street.\nThe critical innovations are these: three new protected left-hand turns (or solid green arrows): one heading north on Candler and turning left onto College, and two in both directions on College turning left onto North McDonough. Also there are now flashing yellow arrows at all intersections, meaning drivers can turn left after yielding to oncoming traffic and pedestrians (oncoming traffic still has the green light).\nBut early on drivers complained the delays, particularly during the 4:30-6:30 rush hour span, were worse than ever and that the yellow arrows were confusing.\n“The timing wasn’t working as designed,” said Deputy City Manager Hugh Saxon. “It’s improved quite of bit [as of late last week]. We keep adjusting and keep taking traffic and turn counts. The next thing we want to do is get the timing down for non-rush hour periods.”\nThe flashing yellows are the first in Decatur and a technology quite new statewide. Saxon says they will become more common in the next few years, with the hope flashing yellows will both reduce cheating to turn left and prevent motorists from getting stuck in the middle of intersections.\nAccording to GDOT, studies show that flashing yellow arrows “help reduce” left turn crashes by 35 percent, “move more traffic through an intersection, easing traffic congestion,” and “reduce vehicle idling and air pollution.”","url":"https://www.ajc.com/news/local/decatur-says-lights-running-smoother-two-complex-intersections/rIKD16vZZX6cqsLAz9Kr2J/"}
