{"authors":[],"date_download":"2018-10-30 01:06:40","date_modify":"2018-10-30 01:06:40","date_publish":"2014-11-21 00:00:00","description":null,"filename":"data/vaneerConsumption/DecapitatingISIS.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_11_decapitating_isis_comments_1540861600.html","title":"Decapitating ISIS","title_page":"Blog: Decapitating ISIS","title_rss":"NULL","source_domain":"americanthinker.com","text":"“Our thoughts and prayers for the families,” the hackneyed response by officials in reaction to beheadings by ISIS, is cloaking the simmering outrage building in America. Obama has chosen to ignore the feelings of the people and do what he does best – equivocate. As George W. Bush realized after 9/11, something had to be done to address the need for revenge. Bush chose the invasion of Iraq, in retrospect the right move. Had Obama continued to support the U.S. presence there, would ISIS (or ISIL, the Islamic State of Syria and the Levant) have mutated into a powerful entity? Unlike Bush, Obama did nothing substantive in reaction to the decapitation of three American citizens. Now the situation on the ground in Iraq and Syria has escalated to the macabre. As heads topple, Obama refuses to act as a decisive leader of a great and strong nation. As if the ISIS crisis is a slight distraction, he sends a few advisors to the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/11/decapitating_isis_comments.html"}
s a priority and the Middle East disaster a nuisance to his main goal: securing his legacy as the world’s black Messiah.\nThe beheadings are too heinous and horrible to countenance with rhetoric. The caring community that insists that murders are carried out by otherwise ordinary people who kill because they were mistreated in their youth by abusive parents or societal discrimination is eerily dumbstruck. The ISIS executioners don’t claim they were not properly potty-trained. They cut off heads to taunt the U.S. and the West, knowing we will not retaliate in a meaningful way. They are simply killers. And like Abou Ben Adhem, in the famous poem by Leigh Hunt, their tribe is increasing. So is their appeal to disaffected young people worldwide, who seek adventure and a cause to absorb their restlessness. ISIS recruitment probably picked up recently when Mandy Patinkin, who plays a wise CIA officer in the hit series Homeland – a series about Muslim terrorism – was interviewed on CBS’s 60 Minutes. Patinkin said the new season of Homeland, which opens with U.S. rockets wiping out a Muslim family in Afghanistan attending a wedding ceremony, hints that America may be at fault in the war on terror. I bet he and the network wish they had edited Patinkin’s comment. Just an hour or so before, CBS Evening News covered the latest beheading by ISIS. In America, money rules the media and its newscasts. Viewers learned that CBS owns Showtime, which explains why Patinkin was interviewed: The new season of Homeland is flopping, so the network pulls out its biggest guns to help the series regain traction. No wonder Americans are dazed and confused. A band of homicidal maniacs decapitates U.S. citizens, our president can only send “advisors,” and a major network plants the seeds of doubt that perhaps the jihadists have a point. The U.S. can face facts and realize we have been elected by history to, as Woodrow Wilson’s phrase put it, “make the world safe for democracy.” Our radical academics have poisoned the well of realpolitik by labeling geopolitics “imperialism.” But a dollop of imperialism is needed now in Iraq and Syria before ISIS targets Israel and the U.S. is drawn in for a battle of biblical proportions. U.S. troops should surround ISIS-held territory and establish a cordon sanitaire that chokes off the murdering fanatics where they are – in effect, decapitate ISIS in its manger.","url":"https://www.americanthinker.com/blog/2014/11/decapitating_isis.html"}
