{"authors":[],"date_download":"2018-10-30 21:25:40","date_modify":"2018-10-30 21:25:40","date_publish":"2018-07-05 04:00:00","description":"Metro Atlanta restaurant review: The White Bull fills the plate with fresh, local fare, but some dishes miss the bull's-eye","filename":"data/vaneerConsumption/DecaturrestaurantreviewTheWhiteBull.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/05/Images/newsEngin.22380873_070618-PD-14-U67445160085QEy-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_white-_4657c46f18a38f98032ae95e7e2c9898__1540934740.html","title":"Decatur restaurant review: The White Bull","title_page":"Decatur restaurant review: The White Bull","title_rss":"NULL","source_domain":"ajc.com","text":"Making something out of nothing is what creative types do. There is a thrill about starting from zero, but it can also be paralyzing.\nHemingway understood that about the writing process, calling the challenge of the blank page “the white bull.”\nThe White Bull, a new farm-to-table restaurant on Decatur Square, takes inspiration from Hemingway’s mantra. It’s a place that serves as a blank slate for the culinary aspirations of owners Pat Pascarella, Pat Siciliano and Gabriele Besozzi.\nPascarella is a 20-year veteran of kitchens, having worked most recently as executive chef at the Optimist before embarking on his own endeavor. Sharing the kitchen with him is Siciliano, the White Bull’s sous chef and Pascarella’s cousin. Besozzi, a native of Milan, has worked in the hospitality industry for years and serves as the restaurant’s general manager. He, like a handful of others on the White Bull staff, clocked time together at the Optimist.\nThe way the team faces their white bull is through a menu of a dozen and a half small plates. Three-quarters of the menu falls in the New American realm; the remaining is loosely Italian in the form of house-made pastas.\nThe dining room, one that has seen concept after concept come and go in short order, is newly renovated. Breezy, bright and comfortable — a long banquette holding poufy pillows that invite an unhurried stay — this, too, is part of the clean slate on which to create an experience for diners.\n<","url":"https://www.ajc.com/entertainment/dining/white-bull-fills-plate-with-fresh-fare-but-some-dishes-miss-bull-eye/gkbWIhh0pTxLlTnrQzXy2N/"}
