{"authors":[],"date_download":"2018-10-30 01:08:00","date_modify":"2018-10-30 01:08:00","date_publish":"2018-08-15 18:24:18","description":null,"filename":"data/vaneerConsumption/DeepStateFailureJohnBrennanDownandOut.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/04/CIA_Director_John_O._Brennan.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861680.html","title":"Deep State Failure: John Brennan Down and Out","title_page":"Deep State Failure: John Brennan Down and OutThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In a White House press briefing earlier today, Sarah Huckabee Sanders read a press release from President Trump that stated that former CIA director John Brennan has officially had his security clearance revoked.\nWhile Brennan is no longer a government employee, this action was unusual. As the statement noted, “Historically former heads of intelligence and law enforcement agencies have been allowed to retain access to classified information after their government service so that they can consult with their successors.”\nThis will not be the case with Brennan, as “any benefit that senior officials might glean from consultations with Mr. Brennan are now outweighed by the risks posed by his erratic conduct and behavior.”\nCalling John Brennan’s actions “erratic behavior and conduct” is quite mild. The former communist supporter somehow managed to make his way into the highest office of the world’s premier intelligence agency under President Obama. During the end of his tenure, when it became increasingly clear that Donald Trump had a real shot at the White House, Brennan set his lackeys on a highly questionable probe into the Trump Campaign, and he colluded with foreign spies to get the job done. We likely would have never known about his deep abuse of power had President Trump not been elected.\nBrennan issued a brief response to the revocation on Twitter:\nThis action is part of a broader effort by Mr. Trump to suppress freedom of speech & punish critics. It should gravely worry all Americans, including intelligence professionals, about the cost of speaking out. My principles are worth far more than clearances. I will not relent. https://t.co/TNzOxhP9ux — John O. Brennan (@JohnBrennan) August 15, 2018\nTo Brennan, the revocation is an attack on free speech and American democracy. How deluded do you have to be to believe that attacking a political opponent’s campaign with the weight of the intelligence community would be considered acceptable by the very person you spied on? And still, Brennan vows to not give up in his war on the sitting President of the United States.\nBetween this news and the firing on panhandling cheater Peter Strzok, the Deep State has had a very bad week.","url":"https://spectator.org/deep-state-failure-john-brennan-down-and-out/"}
