{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:36:20","date_modify":"2018-10-30 20:36:20","date_publish":"2015-02-03 22:12:21","description":"WASHINGTON -- The head of the U.S. Defense Intelligence Agency (DIA) said that at least one of the five high-level Taliban detainees transferred from Guantanamo Bay to Qatar in exchange for Sgt. Bowe Bergdahl “could be expected” to re-engage in terrorist activities. |","filename":"data/vaneerConsumption/DefenseIntelChiefAtLeastOneTradedTalibanDetaineeCouldReturntoFight.json","image_url":"https://media.breitbart.com/media/2014/11/Released-Taliban-and-Bergdahl.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_03__1540931780.html","title":"Defense Intel Chief: At Least One Traded Taliban Detainee Could Return to Fight","title_page":"Defense Intel Chief: At Least One Traded Taliban Detainee Could Return to Fight | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON — The head of the U.S. Defense Intelligence Agency (DIA) said that at least one of the five high-level Taliban detainees transferred from Guantanamo Bay to Qatar in exchange for Sgt. Bowe Bergdahl “could be expected” to re-engage in terrorist activities.\nDIA Director Lt. Gen. Vincent Stewart made those comments while testifying before the House Armed Services Committee on Tuesday.\nCNN reported on January 29 that U.S. military and intelligence officials suspect that one of the five detainees traded for Bergdahl, who has been accused of desertion, “has returned to militant activity.”\nThe detainee is believed to have made contact with suspected Taliban members in Afghanistan.\nOn Monday, Reuters reported that the Qatari government has denied that one of the five Taliban detainees has returned to terrorist activities.\nLt. Gen. Stewart told the House panel that there is not much his agency can do about protecting American troops from those detainees swapped for Bergdahl who do return to the battlefield in Afghanistan.\n“We continue to look at monitoring the number of sources that would tell us when these individuals have gone back in the business,” testified the military intelligence chief. “Directly, though, besides notifying folks that these terrorist have gone in the business, there is very little at this point the DIA could do, besides warning of their continued operations.”\nHe said that over the last four or five years, an estimated “18 percent” of released Guantanamo Bay detainees have re-engaged in terrorist activities, which he referred to as “the business.”\n“About 11 percent are suspected of having gone back in the business,” he continued. “So if those numbers translate — of the five who were transferred, probably one in five could be expected to go back into the business.”\nDuring a forum sponsored by The Atlantic magazine on Monday, Khaled al-Attiya, Qatar’s foreign minister, said that none of the Taliban detainees transferred from Guantanamo to Qatar in exchange for Bergdahl have attempted to re-engage in militant activity.\n“It’s totally false,” Foreign Minister Khaled al-Attiya said. “They are living according to the agreement we signed with the United States.”\n“I can assure you, no one has made an attempt to go back” to Afghanistan,\nThe Pentagon intelligence chief told the House panel that his agency has been on the “periphery” to observe those detainees who are transferred out of Guantanamo Bay with conditions.\nIn May 2014, President Obama released five Taliban detainees from the U.S. Military prison in Guantanamo Bay, Cuba to Qatar in exchange for Sgt. Bergdahl.\nBergdahl was captured by the Taliban in 2009 after he allegedly walked away from his post in Afghanistan.\nSoldiers who served alongside Bergdahl say he should be court-martialed for desertion.\nThe Obama administration has defended the exchange following reports that one of the detainees has returned to terrorist activities.","url":"https://www.breitbart.com/national-security/2015/02/03/defense-intel-chief-at-least-one-traded-taliban-detainee-could-return-to-fight/"}
