{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:34:25","date_modify":"2018-10-30 20:34:25","date_publish":"2015-02-04 01:15:04","description":"WASHINGTON -- The Taliban in Afghanistan will be able to carry out attacks in the country’s urban areas through at least 2018, two years after the scheduled withdrawal of all U.S. troops. |","filename":"data/vaneerConsumption/DefenseIntelChiefTalibanWillBeAbletoCarryOutAttacksinAfghanistanThrough2018.json","image_url":"https://media.breitbart.com/media/2014/12/taliban-ammo-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_03__1540931665.html","title":"Defense Intel Chief: Taliban Will Be Able to Carry Out Attacks in Afghanistan Through 2018","title_page":"Defense Intel Chief: Taliban Will Be Able to Carry Out Attacks in Afghanistan Through 2018 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON — The Taliban in Afghanistan will be able to carry out attacks in the country’s urban areas through at least 2018, two years after the scheduled withdrawal of all U.S. troops.\nThat prediction can be found in written congressional testimony prepared by the director of the Defense Intelligence Agency (DIA).\nU.S. Marine Lt. Gen. Vincent Stewart, the DIA director, testified before the House Armed Services Committee during the panel’s World Wide Threat Assessment hearing on Tuesday.\n“The development of [Afghan Security Forces] capabilities in 2015 will be critical as the insurgency will again attempt to increase its influence in rural areas, operate in larger formations, and continue to test security forces by temporarily seizing a number of vulnerable rural Afghan checkpoints and district centers,” testified the DIA director.\n“This will include increased high profile attacks, particularly in Kabul, where the Taliban seeks to undermine perceptions of Afghan security,” he continued. “The Taliban will probably sustain the capability to propagate a rural-based insurgency that can project intermittent attacks in urban areas through at least 2018.”\nLt. Gen. Stewart anticipated that the Taliban, al-Qaeda, and other terrorist groups in Afghanistan will take advantage of the expected drawdown of U.S.-led coalition troops this year.\n“In 2015, we expect the ANSF to maintain stability and security in Kabul and key urban areas while retaining freedom of movement on major highways,” he testified. “However, the Taliban, al- Qa‘ida, and their extremist allies will likely seek to exploit the reduced Coalition presence by pressuring ANSF units in rural areas, conducting high profile attacks in major population centers, and expanding their safe havens.”\nLt. Gen. Stewart also predicted that the ANSF, which include army and police units, will “struggle” in the absence of U.S.-led coalition “enablers.”\n“As NATO and our allies carry out their scheduled drawdown, the ANSF will struggle to effectively replace these lost enablers, deal with interoperability challenges between the army and police, and address persistent maintenance and logistical issues,” the top military intelligence official told lawmakers.\nThere are currently an estimated 9,500 U.S. troops serving in Afghanistan.\nPresident Obama plans to cut that number in half by the end of 2015 and by the end of 2016 the U.S. military footprint is scheduled to be reduced to a small force at the U.S. Embassy in Kabul.\nAfghan President Ashraf Ghani suggested that Obama “re-examine” his withdrawal plan.\nThe Associated Press revealed that Ashton Carter, the nominee to replace Chuck Hagel as Obama’s fourth Secretary of Defense, said he would consider making changes to the plan of removing U.S. forces from Afghanistan by the end of next year if security conditions worsen.\nLt. Gen. Stewart told the House panel that the Afghan forces “remain stalemated with the Taliban-led insurgency.”\nLast year was the deadliest year of the ongoing Afghanistan war for the country’s forces and civilians. The conflict began more than 13 years ago on Oct. 7, 2001.\n“A total of 2,216 U.S.military personnel have died in Afghanistan—83% of whom were killed in action—and 19,950 were wounded as of December 30, 2014,” reported the Special Inspector General for Afghanistan Reconstruction.","url":"https://www.breitbart.com/politics/2015/02/03/defense-intel-chief-taliban-will-be-able-to-carry-out-attacks-in-afghanistan-through-2018/"}
