{"authors":[],"date_download":"2018-10-30 01:03:42","date_modify":"2018-10-30 01:03:42","date_publish":"2014-09-26 08:00:00","description":null,"filename":"data/vaneerConsumption/DefeatingISIStheWorldWarOneWay.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/09/640px-John_Pershing1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861422.html","title":"Defeating ISIS the World War One Way","title_page":"Defeating ISIS the World War One WayThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Many people, even alleged conservatives, blame the West when it comes to explaining Islamic terrorism. If it wasn’t the crusades, it was the end of World War One, when Winston Churchill and T. E. Lawrence (of Arabia), among others, carved up the map of the modern Middle East.\nBut if the collapse of the Ottoman Empire and the creation of modern Iraq, Syria, Jordan, and Palestine (eventually Israel) were a cause of movements like ISIS, why was the region relatively quiescent after the First World War? Indeed, Lawrence, in 1922, predicted that even among the ever restless Arabs, there would “be no more serious trouble for at least seven years,” which, in those territories for which Britain was responsible, proved broadly true. In 1935, he wrote to Robert Graves, “How well the Middle East has done: it, more than any other part of the world, has gained from the war.”\nLawrence thought that West had little to fear from Arab nationalism, because the Arabs were “even less stable than the Turks” and if “properly handled [the Arabs] would remain in a state of political mosaic, a tissue of small jealous principalities incapable of cohesion and yet always ready to combine against an outside force.”\nThe British were used to putting down jihadists, whether in the Sudan, or in India, or even 1920s Iraq, and did so with an eye on frugality. Crushing jihadists, it was thought (and proved), needn’t be expensive. When Lawrence noted a “Wahhabi-like Moslem form of Bolshevism” welling up in Southern Iraq, it was the RAF that dispelled it, using on-the-ground spotters like John Bagot Glubb, whose Southern Desert Camel Corps, made up of Iraqi border Arabs, later patrolled the border to keep the Wahhabist Ikhwan out.\nThe British were used to having jihads called against them — the Ottoman Empire did that in World War One (part of Lawrence’s goal in the desert revolt was to divide the Islamic Caliphate between Turkey and Arabia) — and they knew that Islam was always and forever prone to that sort of thing. You accepted it, worked around it, when necessary biffed it, and you also made use of it when you could (Muslims could make loyal soldiers). It wasn’t imperialism that created modern Islamic terrorism; it was the retreat of the West as a ruler and Western Civilization as a model that revived it.\nBut we also shouldn’t neglect our own history in putting down jihadists. General John J. “Blackjack” Pershing, the commander of the American Expeditionary Forces in World War One, had not only fought Indians in his time, he had fought fanatical, jihadist Moros in the Philippines. Many Moros took an oath to become blade-wielding assassins of infidels (sound familiar?). They drugged themselves and wrapped themselves so tightly in binding cloths that they could charge right through rounds fired from an Army issue .38 caliber revolver. The Army responded by issuing .45 caliber pistols, which packed enough punch to stop a Moro permanently.\nIn dealing with the Moros, Pershing acted as both reformer and tamer. In destroying the jihadist menace, he was always prudent to avoid unnecessary casualties to his own men — and he always aimed to kill as few of the enemy as possible. In all his campaigns, he sought to destroy hardened jihadists, but left escape routes for women, children, and Moros disinclined to fight to the death; he measured victory in terms of conciliation, not body counts.\nPershing did not try to change the Moros; he did not campaign against polygamy or slavery or any other aspect of their culture; instead, he turned their culture to his advantage, asking them to deliver malefactors’ heads, which they happily did. Pershing buried slain jihadists with pigs so that they faced the prospect of going straight to hell (according to their Mohammedan beliefs) rather than inheriting a paradise of virgins. And he did, with Moro cooperation, all those “white man’s burden” things: building schools, leveling roads, setting up medical clinics. The Moros came to admire him so much, they made him a chief; and in World War II they hunted Japanese.","url":"https://spectator.org/60500_defeating-isis-world-war-one-way/"}
