{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:34:47","date_modify":"2018-10-30 20:34:47","date_publish":"2016-08-07 12:10:45","description":"News of a statement by the Defense Ministry slamming Pres. Barack Obama for the Iran deal took Prime Minister Benjamin Netanyahu by surprise.","filename":"data/vaneerConsumption/DefenseMinistryStatementComparingIranDealToDealWithHitlerCaughtNetanyahuBySurpriseAideTellsUSAmbassador.json","image_url":"https://media.breitbart.com/media/2015/06/obama_netanyahu-Jim-Young-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_07__1540931687.html","title":"Defense Ministry Statement Comparing Iran Deal To Deal With Hitler Caught Netanyahu By Surprise, Aide Tells U.S. Ambassador","title_page":"Defense Ministry Statement Comparing Iran Deal To Deal With Hitler Caught Netanyahu By Surprise, Aide Tells U.S. Ambassador","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – News of a statement by the Israeli Defense Ministry slamming President Barack Obama for the Iran deal took Prime Minister Benjamin Netanyahu by surprise, his aide told U.S. Ambassador to Israel Dan Shapiro on Friday.\nNetanyahu’s senior aide called Shapiro and informed him that Defense Minister Avigdor Lieberman did not brief the prime minister on the statement, Haaretz reported.\nIn the harshly-worded statement, the Defense Ministry countered Obama’s claim that Israeli officials believe the U.S.-led deal with Iran will have a “positive outcome” in the region. It further compared the deal to the 1938 Munich Agreement with Hitler.\n“The Israeli defense establishment believes that agreements have value only if they are based on an existing reality, and that they have no value if the facts on the ground are completely the opposite of [the concepts] on which an agreement is based,” the ministry said.\nThe Munich agreement did not prevent the Second World War and the Holocaust, precisely because its basic assumption, that Nazi Germany could be a partner to any kind of agreement, was wrong, and because the leaders of the world at that time ignored the explicit statements by Hitler and the rest of the leaders of Nazi Germany.\nAccording to Haaretz, the aide told Shapiro that Netanyahu learned about the remarks from the media. His office subsequently released a statement distancing the prime minister from the Defense Ministry’s remarks.\n“The Israeli position on the Iran deal remains the same, but the prime minister staunchly believes that Israel has no ally more important than the U.S.,” the message said.\nDuring a press conference at the Department of Defense on Thursday, Obama noted that even senior Israeli defense officials acknowledge that the nuclear deal with Iran has had a positive outcome. He was apparently referring to remarks from IDF chief Gadi Eisenkot. Over the past year, Eisenkot has expressed his opinion on multiple occasions that the deal has decreased the threat level faced by Israel.\n“By all accounts, it has worked exactly the way we said it was going to work. [The] Israeli military and security community … acknowledges this has been a game changer,” Obama said. “The country that was most opposed to the deal.”","url":"https://www.breitbart.com/middle-east/2016/08/07/defense-ministry-statement-comparing-iran-deal-agreement-hitler-caught-netanyahu-surprise-aide-tells-u-s-ambassador/"}
