{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:25:00","date_modify":"2018-10-30 19:25:00","date_publish":"2016-06-28 00:00:00","description":"This is the final piece of a 12-part series previewing Arkansas' 2016 football opponents.","filename":"data/vaneerConsumption/DefenseexpectedtocarryMizzou.json","image_url":"https://media.arkansasonline.com/img/photos/2016/06/28/CharlesHarris_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jun_28__1540927500.html","title":"Defense expected to carry Mizzou","title_page":"Defense expected to carry Mizzou","title_rss":"NULL","source_domain":"arkansasonline.com","text":"This is the final piece of a 12-part series previewing Arkansas' 2016 football opponents.\nAfter back-to-back SEC East titles, Missouri took a step back last year, going 5-7 and missing a bowl thanks to a season-finale 28-3 loss at Arkansas. The Tigers went 1-7 in SEC play, finishing sixth in the eastern division.\n2016 outlook\nMissouri travels to SEC East-favorite Tennessee the week before ending the regular season with a home game against Arkansas on Nov. 25, the day after Thanksgiving.\nThe Tigers are expected to finish near the bottom of the SEC again in 2016. ESPN’s Football Power Index projects them to win only 5.5 games. The FPI also ranks Missouri 50th in the country and 12th in the SEC, ahead of only South Carolina and Kentucky.\nWhen 5Dimes, an offshore sportsbook, released SEC over/under win totals last month, it did not list Missouri.\nSignificant departures\nSeveral of the key players from Missouri’s back-to-back division titles are no longer in Columbia.\nMost notably, quarterback Maty Mauk (51.8 percent, 654 yds., 6 TD, 4 INT in 5 games) transferred to Eastern Kentucky after being kicked off the team in January. He had been suspended multiple times during the season because of drug- and alcohol-related violations of team rules.\nThe Tigers also lost four of their five starting offensive linemen. Center Evan Boehm, who started a school-record 52 straight games, was a fourth-round pick in the NFL Draft, while left tackle Connor McGovern, who started 40 consecutive games, was a fifth-round pick. Right guard Mitch Hall (17 career starts) and right tackle Taylor Chappell (20 career starts) graduated. Hall, Chappell and McGovern were fifth-year seniors.\nRunning back Russell Hansbrough (111 car., 465 yds., 1 TD), who rushed for more than 2,000 yards in his career, was also a senior.\nDefensively, the biggest loss for is linebacker Kentrell Brothers (152 tackles, 12 TFL, 2.5 sacks, 2 INT). The fifth-year senior led the nation in tackles and earned first-team all-SEC honors last season.\nKey returners\nWhen Mauk was suspended in 2015, Drew Lock filled in at quarterback. The true freshman started the final eight games of the season, but was inconsistent. He completed only 49 percent of his passes for 1,332 yards, four touchdowns and eight interceptions.\nHis second season will be aided by the return of the Tigers’ top two receivers – J’Mon Moore (29 rec., 350 yds., 3 TD) and Nate Brown (27 rec., 326 yds., 4 TD) – and their starting tight end, Sean Culkin (16 rec., 139 yds., 1 TD).\nLeading rusher Ish Witter (126 car., 518 yds., 1 TD) is also back. He was one of five players with a rushing touchdown last season, but each had only one.\nThe only returning starting offensive lineman is left guard Nate Crawford (8 career starts), although Alec Abeln has experience rotating with Crawford and three career starts.\nIt appears that defense will again be Missouri’s strength this fall.\nThe unit is led by defensive end Charles Harris (56 tackles, 18.5 TFL, 7 sacks, 10 QBH), who is rated as the 13th-best player in college football by Pro Football Focus. On the other side of Harris is freshman all-American defensive end Walter Brady (40 tackles, 12.5 TFL, 7 sacks, 7 QBH).\nWhile Brothers is gone, the Tigers other two starting linebackers – middle linebacker Michael Scherer (93 tackles, 9 TFL) and strongside linebacker Donavin Newsom (63 tackles, 9 TFL, 2.5 sacks) – are back.\nIn the secondary, cornerback Aarion Penton (59 tackles, 8 PBU, 1 INT) and safety Anthony Sherrils (64 tackles, 6 PBU, 1 INT) are the best returning players.\nPenton is also the Tigers’ punt returner, with one punt return for a touchdown to his name.\nPunter Corey Fatony (81 punts, 42.9 yds./punt, 23 inside 20-yard line) set a school record for punts in a single season as a freshman last year.\nNotable additions\nMissouri’s 2016 signing class was one of the worst in the SEC, coming in at No. 47 in the country, according to Rivals.\nTwo of the three four-star prospects the Tigers signed are running backs: Nate Strong and Damarea Crockett. Strong is No. 13 on Athlon Sports’ list of the top 25 impact junior college transfers and Crockett was a late flip from Boise State.\nThe Tigers also brought in a graduate transfer at running back: Alex Ross from Oklahoma. In three seasons with the Sooners, the former four-star prospect rushed 123 times for 786 yards (6.4 avg.) and five touchdowns. He also made an impact as a kickoff returner, returning 53 kicks for 1,363 yards (25.7 avg.) and two touchdowns.\nThe other four-star player Missouri signed was defensive end Tre Williams.\nAlthough Lock seems to have the inside track to the quarterback job, junior college transfer Jack Lowary could make a push for the backup role.\nThree-star kicker Tucker McCann will likely be asked to start immediately in the place of graduated kicker Andrew Baggett.\nCoaching staff\nFor the first time since 2001, Missouri will have a new coach roaming the sideline this fall. Long-time assistant Barry Odom is taking over the program after Gary Pinkel retired in November.\nOdom was the Tigers’ defensive coordinator in 2015 and had the same position at Memphis the three years prior to that. He also played at Missouri from 1996-1999 and was on the Tigers’ staff in some capacity for nine straight years before leaving for Memphis.\nDespite Missouri’s subpar season, it was ninth in the country in total defense under Odom’s watch.\nAt the coordinator positions, Josh Heupel and DeMontie Cross enter their first season as offensive and defensive coordinator, respectively.\nHeupel, a national champion quarterback at Oklahoma in 2000, was the offensive coordinator at Utah State last season. Before that, he was the co-offensive coordinator for the Sooners for four seasons and quarterbacks coach for five seasons before that.\nCross was the linebackers coach at TCU for three seasons, including the last as the co-defensive coordinator, before joining the Tigers’ staff. He was on Bret Bielema’s staff at Wisconsin in 2011 as special teams coordinator and safeties coach.\nRyan Walters is also listed as a co-defensive coordinator on Missouri’s official website. He is in his second season with the Tigers, after serving as only the safeties coach last season.\nSeries history\nDespite the game being dubbed the “Battle Line Rivalry (presented by Shelter Insurance),” Arkansas and Missouri have played only seven times.\nThey have played twice as SEC opponents and twice in bowl games (2008 Cotton Bowl and 2003 Independence Bowl), as well as in 1963, 1944 and 1906. The Tigers hold a 4-3 edge in those games.\nArkansas ties\nThe Tigers signed a pair of Little Rock products this year: running back Damarea Crockett (Little Rock Christian) and defensive lineman Markell Utsey (Little Rock Parkview). Both players flipped to Missouri just before signing day, after being committed to Boise State and Arizona, respectively.\nArkansas also dipped into Missouri’s backyard this recruiting class, signing Columbia Rock Bridge High fullback Hayden Johnson. The Razorbacks also have five other Missouri natives on their roster, including quarterback Rafe Peavey (Bolivar High) and running back Kody Walker (Jefferson City High).\nJohnson was coached by A.J. Odofile, who was hired as Missouri’s director of recruiting this offseason, at Rock Bridge High. The Tigers tried to get Johnson to flip his commitment late in the process, but he stuck with the Razorbacks.\nJohnson also played with Missouri offensive lineman Jonah Dubinski, defensive lineman Tre Williams and defensive lineman A.J. Logan at Rock Bridge High.\nWalker and Missouri linebacker Joey Burkett played together at Jefferson City High.\nMissouri cornerback Aarion Penton was teammates with Arkansas offensive lineman Brian Wallace and defensive lineman Armon Watts at Christian Brothers College High in St. Louis.\nArkansas defensive back Nate Dalton played with Missouri linebacker Trey Baldwin at Cypress Falls High in Houston.\nThoughts from a beat writer\nTo get an even better idea of what Missouri will look like in 2016, WholeHogSports reached out to Dave Matter, who covers the Tigers for the St. Louis Post-Dispatch. We asked him several questions about Missouri. Here are his responses:\nWHS: What would you consider reasonable expectations for Missouri in Barry Odom's first season?\nDM: Making a bowl game — any of them. As much as Missouri struggled on offense last season, expecting subtle progress under a new offensive staff isn’t too much to expect. With several key pieces back from a defense that ranked in the top 10 in most categories, it’s reasonable to expect this team to improve by a game or two in the win column — even though the road schedule is brutal. At West Virginia. At LSU. At Florida. At Tennessee. With a first-year head coach, a rebuilt offensive line and big questions at receiver and running back, a .500 record and bowl invitation would be something the program could build on for 2017 and beyond.\nWHS: With Maty Mauk gone, what does the quarterback position look like? How has Drew Lock improved and where does he still need to improve?\nDM: The job is Lock’s to lose. Marvin Zanders, more of a running threat, had the chance to challenge him in the spring but Lock seemed to distance himself as the clear leader heading into preseason camp. After a few promising series early in the year, Lock looked like a typical wide-eyed freshman once he took over the starting job. His mechanics were a mess. He struggled against the pass rush. His accuracy was pretty poor. But, for the brief amount of practice time we got to watch this spring, he looked more poised and more deliberate with his reads and throws. He also put on 20 pounds of muscle, so he should be able to hold up better physically against SEC defenses. Working with a proven quarterback coach in Josh Heupel could translate Lock’s raw talent into better production. He’s got all the tools — size, arm strength, athleticism, intelligence — but he’s far from a finished product.\nWHS: Which players, offensively and defensively, do you think the Tigers will lean heavily on?\nDM: Newly added running back Alex Ross, a graduate transfer from Oklahoma, is exactly the kind of proven playmaker the offense needed. MU has only one other returning running back who’s played in a college game. That’s Ish Witter, last year’s leading rusher who’s probably better suited in a platoon system. At receiver, Mizzou needs some reliable playmakers to emerge. Maybe that’s newcomer Chris Black, a graduate transfer from Alabama, who took over as the No. 1 slot receiver the day he stepped on campus. Outside receivers Nate Brown and J’Mon Moore are the most experienced wideouts but they could be pushed by younger options. Tight ends Sean Culkin and Jason Reese figure to play vital roles as blockers and receivers.\nOn defense, Charles Harris is poised to become MU’s next star along the defensive line. He’s a lethal edge rusher and already established as one of the team’s most respected leaders. If D-tackle Terry Beckner Jr. can recover from November knee surgery he’ll be among the best interior linemen the program has produced. At linebacker, MU needs to replace the production of 2015 NCAA tackles leader Kentrell Brothers, but seniors Michael Scherer and Donavin Newsom are both proven players.\nWHS: Are there any newcomers that will make an immediate impact?\nDM: Both graduate transfers, Black and Ross, are expected to provide an instant impact. Ross is a welcome addition for the nation’s worst kickoff return unit from 2015. Freshman running back Damarea Crockett could work himself into the rotation. MU needs depth help along the offensive line. Kyle Mitchell, a junior college transfer, could work into the two-deep at guard, as well as a couple freshmen.\nWHS: How do you think Missouri will fair against Arkansas in the final week of the season?\nDM: Missouri should have the front seven on defense to match up with Arkansas’ physical style, but MU needs to progress offensively throughout the season to hold its own against the Razorbacks’ experienced defense. It certainly helps MU’s chances that the game is in Columbia, and if a bowl berth is on the line for MU, Odom and his rebuilt staff shouldn’t have any trouble getting the Tigers up for the game. If Missouri has a credible offense — and that’s a big if after the disaster that unfolded last year — this looks like one of several toss-up games for Mizzou, along with visits from Kentucky and Vanderbilt.","url":"https://www.arkansasonline.com/news/2016/jun/28/defense-expected-carry-mizzou/"}
