{"authors":["Dail Mail Online Reporter"],"date_download":"2018-10-23 04:48:01","date_modify":"2018-10-23 04:48:01","date_publish":"2016-01-28 20:54:43","description":"Defiant rancher Cliven Bundy, pictured, has urged militiamen to continue in their stand-off with police at the Malheur National Wildlife Reserve in Oregon despite his own son telling followers to stand down.","filename":"data/vaneerConsumption/DefiantClivenBundytellsOregonmilitiamentobattleon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30A5EBE400000578-0-image-a-16_1454014201805.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421685_Defiant-Cliven-Bundy-tells-remaining-Oregon-militiamen-battle-despite-two-sons-arrested-one-shot-police_1540270081.html","title":"Defiant Cliven Bundy tells Oregon militiamen to 'battle on'","title_page":"Defiant Cliven Bundy tells Oregon militiamen to 'battle on' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eleven militiamen have been arrested so far\nThey want all charges to be dropped before they will leave\nDefiant rancher Cliven Bundy has urged militiamen to continue in their stand-off with police at the Malheur National Wildlife Reserve in Oregon despite his own son telling followers to stand down.\nBundy senior was interviewed by CNN at his Nevada ranch on Thursday after his son Ammon told followers to stand-down in the 27 day saga.\nContradicting his son, who was arrested alongside his brother Ryan, Cliven Bundy called for the fight to continue.\n'I’ll tell you one thing, we’re dang sure going to have to fight this battle over and over if we just give up right today,' he said.\nBattle on: Cliven Bundy urged militiamen to keep up their stand-off with police at the Malheur National Wildlife Reserve on Thursday\nDefiant: Bundy senior directly contradicted his own son and militia leader Ammon, who told his followers from jail to stand down\nHis comments come as only four militiamen remain on the Malheur National Wildlife Reserve.\nThey refuse to leave unless authorities assure them they won't be arrested. At least one of the remaining protesters has a warrant out for his arrest while 11 other militiamen have been arrested so far.\nThe 27-day stand-off has left one dead and has brought widespread condemnation from the local community.\nRobert 'LaVoy' Finicum, 55, was shot dead on Tuesday after fleeing a police cordon. Authorities claim he was reaching for a weapon when SWAT team members shot him dead.\nIn a live video broadcast from the Oregon ranch this week, one of the last militiamen, said he believes the FBI is 'going to kill them' all, but refused to leave unless the authorities would meet their demands.\nAnother militiaman added he is 'willing' to die in a final bloody siege with the authorities if negotiations fail. Their comments come after the last leader of the occupation voluntarily handed himself in at a police checkpoint.\nMurder: This militiaman appeared on a YouTube video accusing the FBI of plotting to kill the remaining demonstrators\nBlackout: The armed protester claimed the FBI had ordered the media away from the nature reserve so the 'killings' wouldn't be recorded\nA video posted Thursday to the YouTube channel DefendYourBase, which the group has been using to give live updates says the occupiers want assurances they won't arrested.\nA speaker believed to be David Fry said: 'We're stuck here, four of us. They're telling us it's safe to leave, but it's not safe.'\nGroup co-leader Jason Patrick, 43, of Bonaire, Georgia, was arrested on Wednesday along with two other militiamen.\nEight members were already under arrest following the stand-off and fatal shooting of rancher Robert 'LaVoy' Finicum, 55, on Tuesday.\nMilitia leader Ammon Bundy was among those seized after the bloody traffic stop on Highway 395.\nAuthorities claim father-of-11 Finicum reached for a gun in his waistband after fleeing in his vehicle from a police cordon and was promptly shot dead by officers.\nBundy's brother, Ryan, was also shot in the arm during the incident.\nThe remaining militiamen have spoken of their dismay at the death of Finicum.\nIn another live video rant, one militia member angrily blasted the FBI as 'murderers'.\n'The media has been ordered to leave that means they're coming to kill us, they don't want them to see that. They're going to murder all of us... The American people better wake up,' he said.\nAnother said: 'If I die, I died for my country, I died a free man. That's how I want to die.'\nAnd in an interview with the Plain Dealer on Wednesday, Fry said: 'I'll pass on and move on to the next life. I don't know (how it will end), but I'm willing to go that far.\n'Obviously they are murdering people at this point. They've been doing it for a long time now, and you guys are watching it.'\nShot dead: Rancher Robert 'LaVoy' Finicum, pictured, was shot in a clash with police on Tuesday\nFamily man: Finicum (center) and wife Jeanette (right) had been married for 23 years. He had 11 children\nThe final four are refusing to leave unless authorities assure them they will all be free to return home.\nThe Oregonian reported on Thursday that the group is concerned about a warrant out for militiaman Sean Anderson's arrest and they want it dropped before they leave.\nSo far 11 members of the militia have been arrested.\nLeader Ammon Bundy and his brother, Ryan Bundy were seized on Tuesday alongside Shawna Cox, 59, Brian Cavalier, 44, Ryan Payne, Joseph O'Shaughnessy and Peter Santilli. Jon Ritzheimer, 32, was arrested in Peoria, Arizona, after turning himself in to police\nDuane Leo Ehmer of Irrigon, Oregon, Dylan Wade Anderson, 34, of Provo, Utah and Patrick, 43, were arrested on Wednesday.\nThe arrests follow the release of federal court documents which claim that the militiamen were equipped with night vision goggles and explosives.\nArrested leader Bundy called on his followers to pull out of the wildlife reserve in a statement released through his lawyer Mike Arnold.\nHe said: 'To those remaining at the refuge, I love you. Let us take this fight from here. Please stand down. Go home and hug your families. This fight is ours for now in the courts.'\nAuthorities also vowed to continue in their quest to bring the protest to a peaceful conclusion.\nSpecial agent Greg Bretzing of the FBI's Portland office said: 'We will continue to look for safe, peaceful procedures on how to bring this to a peaceful conclusion.'\nHarney County Sheriff David Ward said he regretted the death of Finicum and wants a peaceful end to the stand-off.\n'I'm disappointed that a traffic stop that was supposed to bring peaceful resolution to this ended badly,' he said. 'Multiple law enforcement agencies put a lot of work into putting together the best tactical plan they could, to take these guys down peacefully... If it was as simple as just waiting out some folks down there to get out of some buildings, we could have waited a lot longer.\n'Please go home': Ammon Bundy, pictured earlier this month, released a statement through his attorney Wednesday asking the remaining four protesters to leave the site of their armed anti-government protest\nArrested: Oregon militia leader Ammon Bundy (left) and his brother, Ryan Bundy (right), were arrested Tuesday night\nCharged: Shawna Cox (left), 59, was taken to Multnomah County Jail along with the other detained militia members Tuesday. Jon Ritzheimer (right), 32, was arrested in Peoria, Arizona, after turning himself in to police\nBusted: Brian Cavalier, 44 (left), and Ryan Payne (right) were charged along with the others with conspiracy to impede federal officers\nFacing jail: Joseph O'Shaughnessy (left) and Peter Santilli (right) were arrested in Burns, Oregon, a short time after the traffic stop and shoot-out\n'But this has been tearing our community apart. It's time for everybody in this illegal occupation to move on. There doesn't have to be bloodshed in our community.'\nWard said if the occupiers had legitimate grievances with the government, they should use the 'appropriate manner' to address them.\n'This can't happen anymore. This can't happen in America and it can't happen in Harney County,' he said.\nAuthorities declined to divulge details of what led to the fatal shooting of Finicum.\nHowever, various onlookers say Finicum took off in his vehicle at high speed from a traffic stop.\nWhen curtailed by a roadblock, he stopped and exited the vehicle. FBI sources told CNN that he then reached to his waistband for his gun and the SWAT team opened fire.\nBundy's brother, Ryan, was also shot in the arm in the incident.\n'Let me be clear: It is the actions and choices of the armed occupiers of the refuge that have led us to where we are today,' Bretzing said.\n'They had ample opportunity to leave the refuge peacefully and, as the FBI and our partners have clearly demonstrated, actions are not without consequences.'\nAnother eyewitness account claims Finicum, of Cane Beds, was gunned down after charging at law enforcement officials.\nMike McConnell, who claimed to have been behind the wheel of one of the vehicles heading to a community meeting in the town of John Day Tuesday, posted an eight-minute video on his Facebook page recounting what happened during the confrontation between the militiamen and the authorities.\nFinicum, a Mormon rancher from Arizona, was a father of 11 and grandfather of 19 who was married to his wife, Jeanette, for 23 years.\n'LaVoy was passionate about this, about the movement,' McConnell said.\nIn an interview with MSNBC three weeks ago, Finicum declared that he would rather die than face arrest.\n'There are things more important than your life, and freedom is one of them,' he said at the time. 'I'm prepared to defend freedom.'\nHe sounded a similar note when speaking to CNN earlier this month.\n'I'm just not going to prison,' Finicum said. 'Look at the stars. There's no way I'm going to sit in a concrete cell where I can't see the stars and roll out my bedroll on the ground.\n'I want to be able to get up in the morning and throw my saddle on my horse and go check on my cows. It's OK. I've lived a good life. God's been gracious to me.'\nOrders: Ammon Bundy's lawyer Michael Arnold, left, read out a statement from his client where he urged the remaining militiamen still at the Malheur National Wildlife Refuge stand down and go home\nEmotional: A visibly shaken Harney County Sheriff Dave Ward told reporters on Wednesday the standoff with the Oregon militia has been tearing the local community apart\nRoadblock: Police officers block the turnout to Sodhouse Lane, which is the main road leading to the Malheur National Wildlife Refuge headquarters Wednesday\nShooting: An Oregon State police officer was pictured on Highway 395 after the fatal shooting of Finicum\nHe joined the protest when it began on January 2 and was an outspoken member of the militia group throughout.\nAt one point he personally climbed up a pole to dismantle surveillance cameras in an apparent show of defiance against the government.\nLast year, he told the St George News that he complied with federal land controls until Cliven Bundy's stand-off in Nevada in 2014.\nThe episode, he said, struck a chord with him.\nHe joined the Bundys and 'did a lot of soul-searching' until he 'realized that Cliven Bundy was standing on a very strong constitutional principle - and yet, here I was continuing to pay a grazing fee to the BLM (Bureau of Land Management).'\nAll detained militia members were being held at Multnomah County Jail without bail and will appear in court late Thursday or Friday.\nThe group took over the wildlife refug after a peaceful protest in nearby Burns, Oregon, over the conviction of two local ranchers on arson charges.\nDwight Hammond, 73, and his son Steven Hammond, 46, said they lit fires on federal land in 2001 and 2006 to reduce the growth of invasive plants and protect their property from wildfires.\nThe two were convicted three years ago and served time - the father three months, the son one year.\nBut in October, a federal judge in Oregon ruled their terms were too short under U.S. law and ordered them back to prison for about four years each. Among the demands by the Bundy group is for the Hammonds to be released.","url":"https://www.dailymail.co.uk/news/article-3421685/Defiant-Cliven-Bundy-tells-remaining-Oregon-militiamen-battle-despite-two-sons-arrested-one-shot-police.html"}
