{"authors":["Ben Nagle For Mailonline"],"date_download":"2018-10-23 01:20:48","date_modify":"2018-10-23 01:20:48","date_publish":"2017-04-26 11:43:04","description":"The Sunderland star, who has scored 14 goals in the league this season, sat down for a healthy dinner as he continued preparations for a huge match on Wednesday night.","filename":"data/vaneerConsumption/Defoetucksintonutritiousmealaheadofhugegame.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9DB63D00000578-0-image-a-22_1493202607585.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447120_Defoe-tucks-nutritious-meal-ahead-huge-game_1540257648.html","title":"Defoe tucks into nutritious meal ahead of huge game","title_page":"Defoe tucks into nutritious meal ahead of huge game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jermain Defoe has given fans a glimpse at the secret behind his success, posting a picture of his nutritious meal to Instagram.\nThe Sunderland star, who has scored 14 goals in the league this season, sat down for a healthy dinner as he continued preparations for a huge match on Wednesday night.\nThe Black Cats head to the Riverside for a relegation clash with Middlesbrough as their Premier League status hangs firmly in the balance.\nJermain Defoe shared a picture of his nutritious meal in the build-up to the Middlesbrough tie\nSunderland face Middlesbrough on Wednesday with Defoe likely to lead the Black Cats' line\nSunderland are currently bottom of the league, 12 points from safety, and Defoe will need to be at the top of his game if his side are to get anything from the match.\nIn preparation, Defoe tucked into a large two-plate meal including pasta, sweet potato wedges, beetroot and tenderstem broccoli on Tuesday evening.\nSitting in his kitchen wearing a Jermain Defoe Foundation vest, the now-vegan footballer's meal was accompanied by a ginger and apple drink from Pret A Manger, as well as a bottle of sweet chilli sauce on the side.\nHe has been instrumental this season but Sunderland have still struggled and are bottom\nDefoe's new vegan diet has coincided with him receiving a recall to the England set-up\nIt is not the first time Defoe has posted a snap of his healthy meal - last season, the striker shared a picture of his tuna steak and tagliatelle combination.\nNow, though, there was no fish or meat on show as Defoe continued his new health regime in the North East.\nAfter Sunderland's tie with Boro, they face Bournemouth, Hull and Swansea - three other sides in a battle against the drop - before two final matches away at Arsenal and Chelsea.","url":"https://www.dailymail.co.uk/sport/football/article-4447120/Defoe-tucks-nutritious-meal-ahead-huge-game.html"}
