{"authors":[],"date_download":"2018-10-30 18:36:35","date_modify":"2018-10-30 18:36:35","date_publish":"2015-11-30 14:30:58","description":"The pay range for DeKalb County government employees is at least 10 percent to 15 percent lower than workers in similar jobs in other jurisdictions, according to preliminary results of a study conducted for the county.","filename":"data/vaneerConsumption/DeKalbemployeepayscalesarelowstudyfinds.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_b34518a348b68aa9aaa7d4c762d718a2__1540924595.html","title":"DeKalb employee pay scales are low, study finds","title_page":"DeKalb County employee pay ranges are below market, study says","title_rss":"NULL","source_domain":"ajc.com","text":"The pay range for DeKalb County government employees is at least 10 percent to 15 percent lower than workers in similar jobs in other jurisdictions, according to preliminary results of a study conducted for the county.\nThe study also said the pay rate for a “significant proportion” of the county’s 6,000-plus employees is 25 percent to 30 percent less, including those in jobs like fleet service technicians, electricians, crew supervisors, auditors, detention officers and property appraisers.\nBut DeKalb employees shouldn’t count on getting a raise, said county officials and their consultant, The Archer Company.\n“The pay and class study is not about giving employees additional compensation,” said Benita Ransom, director of the DeKalb’s Human Resources Department, in a Nov. 12 presentation to county commissioners.\nShe said the study’s purpose is to assess DeKalb’s competitiveness in comparison with other governments.\nIf the county raises its pay ranges, employees on the low end of the pay scale would receive a raise, said Chip King of The Archer Company.\n“Employees automatically start thinking pay raise,” King said. “They’re just convinced that there’s going to be a big windfall at the end of the process. … It may or may not include pay increases.”\nPay ranges for police and other public safety employees are generally aligned with market rates, King said. But low staffing levels and heavy workloads contribute to public safety workers leaving DeKalb, county officials said.\nCommissioner Stan Watson said he wants to know whether the county would need to increase taxes to implement higher pay ranges.\n“It’s important to know the dollar amount it’s going to cost us for implementation,” Watson said. “I need to know that up-front.\nKing said he’ll soon provide commissioners with more information about costs and scenarios.\nHe recommended adopting new pay ranges that are more closely aligned with neighboring jurisdictions, eliminating automatic promotions that are based on time of employment and increasing the number of salary grades.\nCommissioner Jeff Rader said he was concerned about costs.\n“If we go wholesale adopting this plan, I think we’ll have a tax increase next year, and a big one,” Rader said. “We need to be able to look at alternatives.”\nOptions for pay adjustments will be included in the county’s 2016 budget proposal, which Interim DeKalb CEO Lee May will deliver Dec. 15.\nFull-time DeKalb County employees received a 3 percent pay raise last year, their first in seven years.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-employee-pay-scales-are-low-study-finds/7QF5ty02JM2hXd8HFbPOuJ/"}
