{"authors":[],"date_download":"2018-10-30 01:19:50","date_modify":"2018-10-30 01:19:50","date_publish":"2018-06-22 19:17:00","description":"The company expected to be hired to manage SPLOST projects in DeKalb County has done similar work in Gwinnett, Cobb and Douglas counties.","filename":"data/vaneerConsumption/DeKalbchoosesfirmforSPLOSTprogrammanagement.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/06/07/Images/newsEngin.21982717_10-18-17-dek-splost-presser-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_2753331967d09706e1e6f5889e60c7f0__1540862390.html","title":"DeKalb chooses firm for SPLOST program management","title_page":" DeKalb chooses firm for SPLOST program management","title_rss":"NULL","source_domain":"ajc.com","text":"UPDATE: The program management contract with Moreland Altobelli Associates was approved on June 26.\nThe company expected to be hired to manage SPLOST projects in DeKalb County has done similar work in Gwinnett, Cobb and Douglas counties.\nMoreland Altobelli Associates, LLC scored the highest number of points during the evaluation process and beat out two other bidders: Atkins North America and a join venture between CBRE Heery, Inc. and H.J. Russell & Company.\nThe DeKalb Board of Commissioners is expected to sign off on Tuesday on a contract with Moreland Altobelli worth roughly $15 million over six years. The Planning, Economic Development & Community Services Committee gave preliminary approval to the deal on Thursday with five of seven members present.\nThe program manager will help make sure projects paid for using SPLOST dollars are finished on time and on budget, county deputy COO Ted Rhinehart said.\n“If you think about this like a football game, the program manager is quarterback of our team now that we are taking the field,” he said.\nCEO Mike Thurmond has said hiring a program manager is a major key in getting SPLOST projects underway. Once that team is in place, the county also will begin holding meetings with a citizens advisory committee for SPLOST implementation.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-ready-chose-firm-for-splost-program-management/VvteNda2qfqqMoKU1JMRjK/"}
