{"authors":[],"date_download":"2018-10-30 19:54:12","date_modify":"2018-10-30 19:54:12","date_publish":"2018-10-30 19:45:00","description":"A DeKalb County early voting polling center will stay open until 8 p.m. after it opened later than expected, officials posted on the county’s Facebook page.","filename":"data/vaneerConsumption/DeKalbpollingplacewillbeopenanhourlaterafterdelayedopening.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/27/Images/newsEngin.23291662_102818-ELX-saturday-vote--1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-polling-p_3fbfbda62a91a41574010f62841b13aa__1540929252.html","title":"DeKalb polling place will be open an hour later after delayed opening","title_page":"After delayed opening, DeKalb polling place will be open an hour later","title_rss":"NULL","source_domain":"ajc.com","text":"A DeKalb County early voting polling center will stay open until 8 p.m. Tuesday after it opened later than expected, officials posted on the county’s Facebook page.\nBriarwood Recreational Center was scheduled to open at 7 a.m. Tuesday and close at 7 p.m.\nThe Atlanta Journal-Constitution has reached out to DeKalb elections officials about the late opening, but have not heard back.\nREAD|Election 2018: Where to vote early in DeKalb County\nMORE|DeKalb sees ‘historic’ weekend early voting totals\nThe polling place was just one of five that opened this week to accommodate DeKalb residents hoping to vote early.\nDeKalb has seen record voter turnout with weekend early voter totals up 67 percent from 2014 midterm elections.\nTo date, more than 96,700 ballots have been cast in this year’s election season, including more than 12,600 absentee ballots.\nLast week, the state Democratic party claims there are 4,700 registered voters in DeKalb who have submitted absentee ballot applications but still have not received their ballots.\nThe county elections board and Secretary of State’s office have said there is no evidence of missing or lost ballot applications in the county.\nIn other news:","url":"https://www.ajc.com/news/local/dekalb-polling-place-will-open-hour-later-after-delayed-opening/RzOoWxuUdO8km62SHqNnyM/"}
