{"authors":[],"date_download":"2018-10-30 18:30:48","date_modify":"2018-10-30 18:30:48","date_publish":"2017-03-08 16:16:00","description":"Chalante Thomas, a 21-year-old Decatur woman accused of murder outside a local Kroger, was released with conditions.","filename":"data/vaneerConsumption/DeKalbletswomanaccusedofmurdernearKrogeroutofjail.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/11/Images/Thomas,%20Chalante_461x289.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-lets-woma_6d0d534f0ce087b7ce7a1062917f6141__1540924248.html","title":"DeKalb lets woman accused of murder near Kroger out of jail","title_page":"Woman accused of murder near a DeKalb Kroger freed from jail","title_rss":"NULL","source_domain":"ajc.com","text":"Chalante Thomas, a 21-year-old Decatur woman accused of murder outside a local Kroger, has been freed from jail.\nThe DeKalb County Sheriff’s Office revealed the release late Tuesday while announcing the recent arrest of her co-defendant in the Jan. 13 killing.\nJail records show Thomas was granted $150,000 bond and released with conditions, including that she report to authorities weekly and submit to drug screenings.\nAvailable court records didn’t say which judge had granted the bond.\nThomas was released Saturday.\nDemario Cotton, 28, of Decatur has no bond. Both are charged with murder in the death of Daryl Phillips, who was shot in the back near the grocery store on Wesley Chapel Road.\nThomas and Cotton presented themselves to officers as witnesses to only the aftermath of the shooting, according to a police report.\nThey said they heard gunshots while waiting for Phillips, and then he came running saying he’d been shot.\nDeKalb police haven’t said exactly why, but Thomas and Cotton were later identified as suspects.\nWarrants say the shooting was caught on video and that Phillips was shot several times in the back.\nThomas and Cotton are also charged with armed robbery for allegedly stealing more than an ounce of marijuana with a handgun at the time of the shooting.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/dekalb-lets-woman-accused-murder-near-kroger-out-jail/KOlhsbYmiRK2IRMfVHI3EJ/"}
