{"authors":[],"date_download":"2018-10-30 18:26:20","date_modify":"2018-10-30 18:26:20","date_publish":"2015-01-03 05:00:00","description":"Troubled from the start, the vast and expensive upgrade of DeKalb County’s water and sewer system will plow ahead this year, with officials scheduling the most significant work yet as they attempt to keep the project on track.","filename":"data/vaneerConsumption/DeKalbsewerprojectenterscriticalstage.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/04/12/Images/sewer_0103.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_64ae6db45d6c6896955a23740624285b__1540923980.html","title":"DeKalb sewer project enters critical stage","title_page":"DeKalb sewer project enters critical stage","title_rss":"NULL","source_domain":"ajc.com","text":"Troubled from the start, the vast and expensive upgrade of DeKalb County’s water and sewer system will plow ahead this year, with officials scheduling the most significant work yet as they attempt to keep the project on track.\nParts of the $1.35 billion effort have been delayed because of shoddy work, but county officials say they’re within budget and only slightly behind schedule.\nSome residents question whether DeKalb can get the job done as planned, given its recent history.\nSuspicions surrounding county contracting for the project led DeKalb District Attorney Robert James to request that a special grand jury investigate. After a yearlong inquiry in 2012, the special grand jury found evidence of fraud and incompetence surrounding the project, and it recommended criminal investigations of 12 individuals.\nAs a result, DeKalb CEO Burrell Ellis was indicted on charges that he allegedly pressured contractors for campaign contributions. Ellis has denied wrongdoing. A jury couldn’t reach a unanimous verdict in October, and a retrial is scheduled for June.\nDeKalb officials said the largest piece of the project — replacing the outdated Snapfinger wastewater treatment plant — is being rebid after the county halted work in September 2013 because of subpar construction, including a structurally unsound retaining wall meant to protect the plant expansion. That job was run by Desmear Systems, a Tucker company that won a $7.7 million contract.\n“My fear is that it’s going to continue to stumble,” said Sally Sears, the co-chairwoman of a citizen advisory committee for the project. “We’ve had problems with finding competent people to run things.”\nIt’s estimated that construction at the Snapfinger plant will cost about $319 million over the next few years, a decrease of $56 million from the county’s initial projections despite the expense of having to redo some of the work, according to government finance documents.\nDeKalb plans to spend $318 million this year alone on water and sewer infrastructure, the highest amount since the county and the U.S. Environmental Protection Agency agreed to a court-ordered cleanup in 2010. Repairs of the aging system must be finished by June 2020.\nDespite reducing the number of sewage spills in each of the last three years, the system still spills hundreds of thousands of gallons of sewage each year.\n“Everyone is concerned that the work would be done properly,” said Juliet Cohen, a member of the advisory committee and the executive director for Chattahoochee Riverkeeper, an environmental organization that helps protect the river.Chattahoochee River. “The county has been embroiled in significant governmental problems, and that puts us all in a heightened state of awareness.”\nBut DeKalb officials say they hope past difficulties are behind them. Ellis is suspended, and DeKalb’s watershed department is under new management.\n“It’s under a lot more control than what it was before,” said Ken Saunders, assistant director for the county’s capital improvement program. “We didn’t have enough hands on board. We’ve put more staff in place. … We can define things better rather than just saying, ‘We have a pile of money here and let’s work with it the best we can.’”\nBesides the Snapfinger debacle, DeKalb is still dealing with several other issues.\nThe county initially estimated that replacing old water lines would cost $5 million, but that amount surged to $280 million once the county more thoroughly evaluated costs.\nSaunders called that a “significant oversight” by the prior administration. He couldn’t explain how the county’s estimates were so grossly inaccurate.\nThe overall budget for the project hasn’t increased. Some work came in under budget or will be taken up in the future.\nThe cooking waste that clogs sewer lines — causing nearly 70 percent of spills when congested pipes burst — has been reduced through an county ordinance that regulates restaurants. However, a program targeting grease disposal from apartment complexes has stalled.\n“We have got to make sure we’re doing a better job,” said DeKalb Commissioner Stan Watson, the chairman of the county’s Public Works and Infrastructure Committee.\nDeKalb residents and businesses are funding the repairs. The county increased water and sewer billing rates by 16 percent in 2011 and by 11 percent in each of the followingthree years. The county is conducting a study to evaluate whether additional hikes are needed.\nThe county has complied with the terms of its agreement so far, said Dawn Harris-Young, a spokeswoman for the EPA.\nWhile DeKalb’s water and sewer undertaking is the largest public works project in the county’s history, it’s smaller than a similar infrastructure project undertaken nearby in the city of Atlanta.\nAtlanta’s work has cost $1.8 billion to fulfill the obligations of its court-ordered sewer cleanup so far, and remaining work will cost more than $600 million over the next 13 years, said Glennis Curry, a spokesman for the city.\nBy comparison, the portion of DeKalb’s work that’s required to satisfy its federal requirements amounts to $326 million. The remaining $1 billion is being spent on related system improvements, such as replacement water mains, pumping stations and treatment plants.\nThe county failed to properly maintain its water and waste systems, and now the bill is coming due, said John Miller, a retired civil engineer and the co-chairman of the project’s citizen advisory committee.\n“We didn’t do squat for decades, and now we’re having to pay the piper,” Miller said.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-sewer-project-enters-critical-stage/gMrs2OOdyPHPATtMEjZy5L/"}
