{"authors":[],"date_download":"2018-10-30 18:44:55","date_modify":"2018-10-30 18:44:55","date_publish":"2017-01-11 16:29:02","description":"DeKalb County is launching a court geared toward veterans with substance and mental health issues contributing to their crimes.","filename":"data/vaneerConsumption/DeKalbbeginsputtingmilitaryveteransthroughspecialcourt.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/09/14/Images/photos.medleyphoto.11368423.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-begins-pu_055f61e1c1bf8f8c8e6a8798d9c7de6f__1540925095.html","title":"DeKalb begins putting military veterans through special court","title_page":"DeKalb begins putting military veterans through special court","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County is launching a court for veterans with substance and mental health issues contributing to their crimes.\nSuperior Court Judge J. P. Boulee initiated the program, which is akin to other alternative courts such as DUI and drug courts. Participants of the two-year program must attend counseling, get a veteran mentor, submit to random drug screens and appear weekly in court in front of Boulee.\n“DeKalb recognizes that our veterans are returning home and not in the same condition, mentally and physically, in which they left,” a news release from the county said. “The (court) is an opportunity for DeKalb to deal with the revolving door of the criminal justice system that waits for veterans who are suffering from untreated and unmanaged substance use and/or co-occurring disorders.”\nThe judge said he’s excited to have the court up and running, and is hopeful its alternative sentencing and oversight mechanisms will work.\nThe purpose is “to help give those who have bravely served us all a second chance at leading healthy, productive lives,” he said in a news release.\nThe court, whose founding was a collaborative effort with multiple county departments, is made possible by a $117,000 grant from the Council of Accountability Court Judges. DeKalb County Superior Court has put in nearly $13,000.\nTo be eligible for the new the court instead of the traditional system, a defendant must be a veteran charged with a felony, where the cause of the behavior is related to a substance use and/or a mental disorder. High felonies, such as murder and rape, would disqualify them.","url":"https://www.ajc.com/news/local/dekalb-begins-putting-military-veterans-through-special-court/VYPbildn5nRrOUG8IB8QfP/"}
