{"authors":[],"date_download":"2018-10-30 18:48:57","date_modify":"2018-10-30 18:48:57","date_publish":"2016-12-10 00:02:00","description":"Burrell Ellis can be reinstated to office after the Georgia Supreme Court threw out his convictions, meaning a return to DeKalb County government.","filename":"data/vaneerConsumption/DeKalbCEOBurrellEllismaysoonretakepower.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/12/Images/120216%20ellis%20kdj01_2687x1681.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_35274a8c1fa30b8d3471d54efb87d1e1__1540925337.html","title":"DeKalb CEO Burrell Ellis may soon retake power","title_page":"DeKalb County CEO Burrell Ellis may return to DeKalb office","title_rss":"NULL","source_domain":"ajc.com","text":"UPDATE: DeKalb County CEO Burrell Ellis was reinstated Monday after the Georgia Supreme Court overturned his conviction. Read more here.\n(Original story published Dec. 9)\nDeKalb CEO Burrell Ellis may return to power as soon as Monday because the Georgia Supreme Court has overturned his convictions for attempted extortion and perjury, according to a legal opinion released Friday.\nEllis, who has been suspended from office since he was indicted in July 2013, will resume his elected position as the county’s chief executive when the case is officially sent back to the trial court, wrote DeKalb County Attorney O.V. Brantley.\nWith three weeks left in his four-year term, Ellis could retake control of a county government with a $1.38 billion budget and more than 6,000 employees.\nNewly elected CEO Mike Thurmond will take over in January. Interim DeKalb CEO Lee May will leave office when Ellis is reinstated.\nEllis would also be entitled to back pay that has been withheld since a jury found him guilty in July 2015. With an annual salary of $157,000, Ellis could be owed more than $220,000.\nHe will be immediately reinstated once the Georgia Supreme Court clerk transfers jurisdiction back to DeKalb, Brantley wrote. It’s unclear when that document will be sent, but it could come as soon as Monday.\nEllis and his lead defense attorney Craig Gillen could not be reached Friday evening.\nMay, who didn’t seek election this year, is ready to make the transition to Ellis, said spokesman Erik Burton.\n“We’re definitely prepared for that possibility,” Burton said. “We are taking all the necessary steps to be ready.”\nAnother transition of power, from Ellis to Thurmond, would take place soon afterward at the beginning of January.\nThough the Supreme Court reversed Ellis’ convictions, the criminal charges alleging that Ellis shook down contractors for campaign contributions haven’t been dismissed. Incoming DeKalb District Attorney Sherry Boston will have to decide whether to seek a retrial or drop the case.\nIt already took two trials before a jury reached its verdict against Ellis last year. He served eight months in prison.\nEllis was found guilty of trying to shake down Power and Energy Services for a $2,500 campaign contribution and threatening to end its $250,000 contract with the county. Ellis was also convicted of perjury for lying under oath about his role in awarding county contracts.\nIn a unanimous decision Nov. 30, the Supreme Court threw out Ellis’ convictions because he didn’t receive a fair trial. The court ruled that the trial judge shouldn’t have prohibited Ellis’ defense team from seeking testimony from contractors who didn’t feel threatened after they declined to donate to his campaign.\nEllis hasn’t spoken about his future and declined to respond to questions at a press conference Dec. 1.\n“I am grateful to live in a country that was founded upon fundamental beliefs and protection of civil liberties and trust in God,” Ellis said as he read prepared remarks at the press conference.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-ceo-burrell-ellis-may-soon-retake-power/2Fnuje0pj5J5v9nMnIT9DO/"}
