{"authors":[],"date_download":"2018-10-30 18:28:49","date_modify":"2018-10-30 18:28:49","date_publish":"2017-03-09 20:06:00","description":"Somewhere between 15 and 20 percent of the 33,000 inmates taken into the DeKalb County jail each year are diagnosed with a mental illness.","filename":"data/vaneerConsumption/DeKalbjailsaysitsthebiggestmentalhealthproviderinthecounty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/07/Images/Dekalb%20County%20jail%20file.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-jail-says_3f2c162a0c4738c8c423787facba2ca0__1540924129.html","title":"DeKalb jail says it's the biggest mental health provider in the county","title_page":"DeKalb jail says it's the biggest mental health provider in the county","title_rss":"NULL","source_domain":"ajc.com","text":"Somewhere between 15 and 20 percent of the 33,000 inmates taken into the DeKalb County jail each year are diagnosed with a mental illness.\nWith those stats, the sheriff’s office, which runs the jail, calls itself the “largest mental health services provider in DeKalb County.”\n“This,” Sheriff Jeff Mann said, “means that our staff must also have awareness and skills related to inmate behavior resulting from mental illness.”\nSo, as detailed in a Thursday news release, Mann is requiring training for deputies and officers who have contact with suspects or with inmates. They must complete the 40-hour Georgia Crisis Intervention Team Training Program.\nClassroom instruction is provided by the Georgia National Alliance on Mental Illness, mental health service providers, folks in recovery, law enforcement and judicial system workers.\n“Learning strategies, techniques and options for dealing with these very personal situations will help us do a better job of safely making arrests and safely securing inmates,” said Mann.\nNearly half of the sheriff’s office’s eligible deputies and officers have finished the training.\nThe jail offers “comprehensive mental health services,” such as intake assessment, separate housing facilities and special programs including voluntary group therapy sessions for inmates.","url":"https://www.ajc.com/news/local/dekalb-jail-says-the-biggest-mental-health-provider-the-county/qQ4eeyHSJOw7k7yyfEdevJ/"}
