{"authors":[],"date_download":"2018-10-30 18:23:15","date_modify":"2018-10-30 18:23:15","date_publish":"2017-03-04 00:28:00","description":"The Georgia Senate approved a bill Friday that corrects flawed language that had prevented a sales tax for infrastructure in DeKalb County.","filename":"data/vaneerConsumption/DeKalbCountysalestaxproposalsmoveforwardinLegislature.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/03/Images/Georgia%20state%20Capitol%20bs1.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_s_41cc9d12b121d6478dfda8aa7c4e022c__1540923795.html","title":"DeKalb County sales tax proposals move forward in Legislature","title_page":"DeKalb County sales tax proposals move forward in Legislature","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia Senate approved a bill Friday that paves the way for a sales tax increase to pay for repairing bumpy roads and other infrastructure.\nSenate Bill 143 passed 51-0 and now advances to the state House of Representatives.\nThe legislation could lead to a referendum in November on raising DeKalb’s sales tax rate from 7 percent to 8 percent.\nProceeds from the special purpose local option sales tax (SPLOST) would go toward road resurfacing, police and fire stations and other facilities. It could raise more than $100 million annually that would be distributed to county and city governments.\n“That kind of money infused into the county will go far toward improving infrastructure,” said Sen. Emanuel Jones, D-Decatur, the bill’s sponsor.\nThe measure corrects wording that prevented a SPLOST from previously appearing on the ballot. The ambiguous wording, contained in legislation that passed in 2015, would have triggered an unintentional property tax increase if the SPLOST had passed.\nThe bill approved Friday ensures that a property tax break for homeowners, known as the frozen exemption, remains in place.\nJones said SB143 has broad support from DeKalb’s House representatives, and he expects it to pass.\nThis is the second DeKalb sales tax bill that’s advancing in the Georgia General Assembly.\nThe Senate on Monday approved another measure, Senate Bill 156, that would limit a new sales tax so that its proceeds could only fund transportation and public safety projects. The legislation also prohibits any future increases in sales taxes for MARTA expansion in the county.","url":"https://www.ajc.com/news/local-govt--politics/senate-advances-dekalb-sales-tax-for-roads/aH9uItMPJPD5w4C0lK8KVL/"}
