{"authors":[],"date_download":"2018-10-30 19:48:48","date_modify":"2018-10-30 19:48:48","date_publish":"2018-07-11 20:51:00","description":"Kentae Williams, a 10-year-old autistic DeKalb County boy who spent nearly his whole life in DFCS care, died at the hands of his adoptive father, the defense acknowledges.","filename":"data/vaneerConsumption/DeKalbdadclaimsautisticson10killedhimselfthenadmitslie.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/11/Videos/4435972.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-dad-claim_7ba6a2adee18105f10579b69bb4dfdcd__1540928928.html","title":"DeKalb dad claims autistic son, 10, killed himself - then admits lie","title_page":"DeKalb dad claims autistic son, 10, killed himself — then admits lie","title_rss":"NULL","source_domain":"ajc.com","text":"After his 10-year-old adopted autistic son drowned, Leon Williams told DeKalb County police a series of falsehoods so shocking they prompted tears when heard in court Wednesday. One persistent lie: this was all Kentae’s fault — the boy killed himself.\nThe interview, conducted three hours after the child’s death, was played for the jury in the murder trial for Williams, 44, a former longtime state worker. The interrogation took an hour and 20 minutes and ended with Williams revealing that he’d lied repeatedly. He said he’d actually held the child underwater in the bathtub for 30 or 45 seconds twice as punishment, which prosecutors believe is the truth, but not the whole truth.\nAt the start of the audio, Williams could be heard crying while wondering if he’d get locked up. He then detailed his version of Kentae’s last day, April 28, 2017.\nWilliams, who worked for the Georgia Department of Administrative Services, said he’d been down on Jekyll Island to speak at a conference a few days. He’d told Kentae, who had ADHD and other mental and behavioral troubles, that if the boy was good, they’d make cookies and brownies when Williams got home.\nBy the time Williams picked the child up from Atlanta Preparatory Academy that day, the dad said he’d heard Kentae hadn’t been good.\n“He had a very, very bad week,” Williams, who’d adopted the boy months earlier, told the two detectives. “He kicked the teacher a couple times. He called the teacher (an expletive). He bucked up at my mother like he was going to fight her.”\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nREAD: Meth, ‘the Devil’s drug,’ is back and killing more people than ever\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nAt their home outside Decatur, Williams said he lectured the child in the bathroom while Kentae got in the tub. Kentae, who’d been in state custody since birth had always found solace in water according to a child services employee, splashed.\nThen Williams, who’d long stopped crying in the interview, said he left the room a minute and a half or so to change clothes and got concerned when he didn’t hear Kentae making noise. He found the boy facedown in the tub, unresponsive.\nWilliams did CPR, he said.\nWilliams fought back tears recalling finding out at the hospital his son was dead. He also remembered thinking he would be blamed. Williams said he'd long worried he’d get in trouble because the boy often hurt himself.\nThe detectives were incredulous that a 10-year-old could accidentally drown in a foot of water so quickly. They also asked Williams why Kentae had burns on his feet that appeared to come from scalding water.\nWilliams said he didn’t know.\n“Do you think somebody would stay in water that hot?” detective Casey Benton asked.\n“He would because he did self-harm behavior,” the dad said, mentioning a time when Kentae allegedly put his head through a wall when he didn’t get a birthday party. Williams said he thought Kentae might’ve also put his face under water and drowned himself.\nWhen Williams appears to sense a shift in the tone of the interview, he tells police, “Now I’m feeling like y’all are trying to make it seem like I did something to him.”\nThey already believed Williams did something to Kentae. Benton had seen the body at the hospital and noticed bruises that seemed to be from belt lashes on the child, and he noticed the burns.\n“I’m just gonna be honest with ya, man,” Benton said. “What you’re telling me doesn’t make any sense.”\nDuring the rest of the interview Williams revealed things he said he’s forgotten: holding Kentae under the water in anger, hitting him with the belt, making a “joke” in front of a neighbor that Kentae was “going to die tonight.”\nHe told police he thought he could’ve killed the boy, but that it was an accident.\nNow he was crying hard, his voice cracking, when he said: “I don’t want to go to jail.”\nWhat he didn’t say, but prosecutors have suggested would later be shown during the trial, is that authorities think Williams held Kentae underwater longer than 30 or 45 seconds and burned his feet on purpose.\nAs the tape played, the courtroom was captivated and somber. One of Kentae’s former foster parents stared straight ahead and listened. A former Division of Family and Children Services worker who’d once considered adopting Kentae herself sobbed so hard her body shook.\nA female juror’s face glistened with tears and she raised her hand. Judge Daniel Coursey Jr. asked if she needed a break.\nShe nodded yes.\nWhen court resumed, defense attorney Daryl Queen, who has acknowledged Williams caused the death in a moment of frustration but said that he is not guilty of murder, had a chance to cross-examine detective Benton.\nQueen said he had no questions.\nLike DeKalb County News Now on Facebook | Follow on Twitter","url":"https://www.ajc.com/news/local/dekalb-dad-claims-autistic-son-killed-himself-then-admits-lie/6LJE1o0tDNweqL4GqV3ZXI/"}
