{"authors":[],"date_download":"2018-10-30 19:47:34","date_modify":"2018-10-30 19:47:34","date_publish":"2018-07-11 21:29:44","description":"Riki Albury, who has a Jonesboro address, is charged with malice murder in the June 28 death of Ronald Thomas-Roach. The victim was found dead in his bedroom early in the morning at Flats of East Atlanta on Flat Shoals Road, DeKalb County police said.","filename":"data/vaneerConsumption/DeKalbteenstabbedmanmorethan30timeskillinghimcopssay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/11/Images/RIKI%20ALBURY_698x437.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-teen-stab_4263c61aad516c0f68b761db7cc7706e__icmp=np_inform_variation-control_1540928854.html","title":"DeKalb teen stabbed man more than 30 times, killing him, cops say","title_page":"DeKalb teen stabbed man more than 30 times, killing him, cops say","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County authorities have arrested an 18-year-old accused of killing a 50-year-old man by stabbing him more than 30 times with “an unknown object,” according to a warrant released Wednesday.\nRiki Albury, who has a Jonesboro address, is charged with malice murder in the June 28 death of Ronald Thomas-Roach. The victim was found dead in his bedroom early in the morning at Flats of East Atlanta on Flat Shoals Road, police told The Atlanta Journal-Constitution.\nThe motive, police said, was robbery. The victim’s car and phone were stolen. It isn’t clear why Thomas-Roach would’ve been targeted for a robbery.\nREAD: DeKalb dad claims autistic son, 10, killed himself — then admits lie\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nREAD: Meth, ‘the Devil’s drug,’ is back and killing more people than ever\nAlbury was booked in jail Tuesday, two days after a detective obtained the warrant. The section of the warrant that tends to include more information about crimes was redacted.\nAlbury remains in jail.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/dekalb-teen-stabbed-man-more-than-times-killing-him-cops-say/aRe3ku5cf3rw6pHd7bc01J/?icmp=np_inform_variation-control"}
