{"authors":[],"date_download":"2018-10-30 18:26:01","date_modify":"2018-10-30 18:26:01","date_publish":"2017-03-30 14:05:00","description":"DeKalb CEO Mike Thurmond says he’s focusing on fixing the county's biggest problems: water overbilling and sewer repairs.","filename":"data/vaneerConsumption/DeKalbCEOMikeThurmonddelivershisfirstStateoftheCountyspeech.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/30/Images/033117-dek-thurmond-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_9fff8eb3393059c2a8c4677545c2330c__1540923961.html","title":"DeKalb CEO Mike Thurmond delivers his first State of the County speech","title_page":"DeKalb CEO Mike Thurmond delivers his first State of the County speech","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb CEO Mike Thurmond says he’s bringing county government back to basics by fixing its most pressing problems: water overbilling and sewer service.\nThurmond, delivering his first State of the County address three months after taking office, said Thursday he’s working to make water bills more accurate and ensure sewer capacity for future growth.\n“We have neglected and mismanaged DeKalb’s most important resource, which is its water and sewer system,” Thurmond said. “This current state of affairs will not be allowed to continue under my administration.”\nHe highlighted several steps he’s taken in his speech Thursday to business leaders at the event hosted by the Council for Quality Growth and the DeKalb Chamber of Commerce.\nThurmond proposed — and the DeKalb Commission passed — an annual budget that includes $1.5 million in additional funding for staffing, training and auditing of excessive water bills.\nSince taking office, he has also started a $2.6 million effort to clean litter and unclog storm drains across the county.\nIn addition, he launched a $700,000 program to provide summer internships to reduce unemployment among people ages 14 to 24.\nPlease read the full story about Thurmond’s address on MyAJC.com.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-ceo-thurmond-says-fix-water-overbilling-and-sewer-limitations/h1OolLmJFLBzN4gkSD1M1I/"}
