{"authors":[],"date_download":"2018-10-30 18:24:05","date_modify":"2018-10-30 18:24:05","date_publish":"2017-01-13 22:39:00","description":"DeKalb County CEO Mike Thurmond delivered a forceful speech touching on unity, Stone Mountain and problem-solving","filename":"data/vaneerConsumption/DeKalbCEOMikeThurmondseekstoovercomecountysdivides.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/13/Images/newsEngin.17331064_IMG_1797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_f595180480044df65242808ef3e6ab2e__1540923845.html","title":"DeKalb CEO Mike Thurmond seeks to overcome county’s divides","title_page":"DeKalb County CEO Mike Thurmond calls for unity as he's sworn in","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb CEO Mike Thurmond delivered a forceful call for a unified, fresh start during his swearing-in ceremony Friday, asking residents to overcome the county’s troubles and embrace “our great opportunity.”\n“We will not allow the past to define us or prohibit us,” said Thurmond, surrounded by a crowd that several times rose in standing ovations. “We will learn from our mistakes, but we are not going to dwell on them. The enemy wants you stuck in the past and not focused on the future.”\nThurmond, who officially took office Jan. 1 and was sworn in beforehand, will oversee DeKalb’s government after a campaign that emphasized inclusiveness and integrity after years of corruption allegations.\nHe told the crowd they need to work together to make DeKalb an example of diversity and cooperation for the country.\n“This old north-south, black-white, us-versus-them foolishness is obsolete, and as your CEO I totally and completely reject it,” said Thurmond, the state’s former labor commissioner and the county’s former school superintendent.\nSurrounded by other newly elected DeKalb officials, they together raised their right hands and swore to do their best. Many in the group — including District Attorney Sherry Boston, Commissioner Steve Bradshaw and Commissioner Greg Adams — won election last year by running on similar themes of honest, accountable government.\nThurmond said he wants to find a way to transform Stone Mountain’s image so that it can be an inclusive attraction to all residents, despite the Confederate figures carved on its face.\n“We’re going to turn what has been a symbol of racism and division, which is Stone Mountain, and we’re going to turn it into a symbol of hope and opportunity,” Thurmond said.\nHanging behind Thurmond were signs declaring a “new day for DeKalb,” with an image of the sun rising behind the blue profile of the walkable side of Stone Mountain.\nHe didn’t detail plans for Stone Mountain, but previous efforts have included erecting a bell tower to reference Martin Luther King Jr.’s “I Have a Dream” speech or building a museum recognizing the role of African-Americans in the Civil War.\nThurmond said it will take a joint effort to fix DeKalb’s biggest problems, from inaccurate water bills to pothole-filled roads and blighted communities.\n“If we come together, if we work together, there are no limitations to what we can accomplish,” he said. “We will transform this county, this state and our nation.”","url":"https://www.ajc.com/news/local-govt--politics/dekalb-ceo-mike-thurmond-seeks-overcome-county-divides/nEAABtkFP4vLGiC6vRStkL/"}
