{"authors":[],"date_download":"2018-10-30 01:20:12","date_modify":"2018-10-30 01:20:12","date_publish":"2018-06-27 15:50:00","description":"DeKalb Solicitor General Donna Coleman-Stribling said she has not yet decided whether to bring charges against Board of Commissioners members for violating the open meeting law.","filename":"data/vaneerConsumption/DeKalbsolicitorgeneralundecidedaboutchargingcommissioners.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/27/Images/dek%20solicitor%20cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_1c4eaee67d5faf0e73b2dea345eecafb__1540862412.html","title":"DeKalb solicitor general undecided about charging commissioners","title_page":"DeKalb solicitor general undecided about charging commissioners","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb Solicitor-General Donna Coleman-Stribling said she has not yet decided whether to bring charges against Board of Commissioners members for violating the open meeting law.\nAttorney General Christopher Carr wrote a letter to the county last week outlining why he believes commissioners’ February vote to raise their base pay by 60 percent broke the law because the matter was never included on the agenda.\nVIDEO: Previous coverage on DeKalb pay raise voting\nIf approved, those raises will go into effect in January of 2019.\nCarr said it was too late for the courts to reverse the board’s decision, but he said civil or criminal charges could be brought against anyone who participated in or conducted the meeting. An open meeting law violation is punishable by a fine up to $1,000.\n“I will thoroughly review the information and decide if any further action is needed,” Coleman-Stribling said in a statement. “I believe in transparency, and I am committed to do what is best for the citizens of DeKalb County.”","url":"https://www.ajc.com/news/local-govt--politics/dekalb-solicitor-general-undecided-about-charging-commissioners-for-violating-open-meeting-law/P6UylO8nwxgREMIeC7hi7N/"}
