{"authors":[],"date_download":"2018-10-30 20:37:53","date_modify":"2018-10-30 20:37:53","date_publish":"2015-10-05 18:58:55","description":"A 10-year veteran of the DeKalb County fire department has been arrested on a charge of arson, accused of setting a car on fire for insurance purposes.","filename":"data/vaneerConsumption/DeKalbfirefighteraccusedofsettingcaronfirefor.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/05/Images/photos.medleyphoto.8237280.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_dekalb-fire_f761eeb9de56906348bae6212bbd121a__1540931873.html","title":"DeKalb firefighter accused of setting car on fire for...","title_page":"DeKalb firefighter accused of setting car on fire for...","title_rss":"NULL","source_domain":"ajc.com","text":"A 10-year veteran of the DeKalb County fire department has been arrested on a charge of arson, accused of setting a car on fire for insurance purposes.\nJairius Hardaway, 30, of Lithonia, was arrested Friday in connection with the Jan. 6 incident on River Road, DeKalb Fire Rescue Chief Darnell Fullum said Monday during an afternoon news conference.\nMalasta Hill, a second man charged in the arson, was a MARTA police officer for seven years until January, said Alisa Jackson, a spokeswoman for the transit authority.\nHill transferred to MARTA’s computer maintenance department, she said. Jackson did not know immediately why Hill had transferred from the police department.\nAttempts to reach Hill or Hardaway’s family members for comment were unsuccessful.\nFullum would not say what evidence was recently discovered that led to Hardaway’s arrest. Hardaway, who is being held in the DeKalb County jail, was placed on paid administrative leave.\nHill was expected to surrender later Monday, Fullum said.\n— Please return to AJC.com for updates.","url":"https://www.ajc.com/news/crime--law/dekalb-firefighter-accused-setting-car-fire-for-insurance-money/xFbgawxhTp2lffjUR4FtSI/"}
