{"authors":[],"date_download":"2018-10-30 18:49:08","date_modify":"2018-10-30 18:49:08","date_publish":"2016-12-08 16:27:00","description":"See how your DeKalb County School scores on Georgia's 2016 College and Career Ready Performance Index (CCRPI).","filename":"data/vaneerConsumption/DeKalbCountySchoolsratings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/08/Images/newsEngin.17072854_dunwoody.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_dekalb_e6138c6a9402b41708d24eaa7f478044__1540925348.html","title":"DeKalb County Schools ratings","title_page":"CCRPI 2016: DeKalb County Schools ratings","title_rss":"NULL","source_domain":"ajc.com","text":"Many DeKalb County Schools saw sharp declines on the state’s College and Career Ready Performance Index in 2016, information released by the Georgia Department of Education this morning.\nThe district’s average scores on the CCRPI — a 110-point school report card that grades schools on several factors, including student performance on standardized state tests — were 63.1 for elementary schools, 65.1 for middle schools and 74.1 for high schools. Last year, the district averaged 65.7 for elementary schools, 66.6 for middle schools and 72.2 for high schools. According to the state, 60 or below on the test is considered failing.\nEighty of the district’s 138 reporting agencies saw their scores drop this year, about 58 percent of the programs.\nVIEW GEORGIA'S 2016 CCRPI SCORES\nThe test has been a guide the last few years for school districts as Gov. Nathan Deal sought to to establish a state-operated school district using schools with CCRPI scores below 60 at some point in the previous three years. Voters in November did not approve the resolution seeking what Deal called the Opportunity School District. The plan would have allowed the state to take up to 20 schools from that list of schools each year and close them, run them itself or convert them to charter schools.\nSuperintendent Steve Green’s plan to turn around poor performing schools calls for a sharp focus on curriculum, heavy parental involvement and millions of dollars to get top teachers in struggling schools. It includes a team of administrators observing and tweaking the way students are taught in the classroom, providing tutors and mentors for assistance ahead of Georgia Milestones testing and pushing for more parent involvement.\nThe AJC has created the The Ultimate Atlanta School Guide that lets you look at and compare critical data for every school in Georgia. You can find it at http://schools.myajc.com/#/schools.\nRELATED: How did City of Decatur Schools fare on the CCRPI 2016?\nRELATED: 10 most improved metro Atlanta school scores CCRPI 2016","url":"https://www.ajc.com/news/local-education/dekalb-county-schools-see-declines-state-report-card/xLtITeex9moO5MMSHI3iFL/"}
