{"authors":[],"date_download":"2018-10-30 19:43:45","date_modify":"2018-10-30 19:43:45","date_publish":"2018-08-20 16:25:27","description":"DeKalb County School District parents will have another opportunity to earn their GED through a free program, the district announced.","filename":"data/vaneerConsumption/DeKalbparentscangettheirGEDfree.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyStatesman/2018/01/08/Images/newsEngin.20894868_JLR-SFC-Apoko-04.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-parents-can-get-their-ged-free__1540928625.html","title":"DeKalb parents can get their GED - free","title_page":"DeKalb parents can get their GED — free","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County School District parents will have another opportunity to earn their GED through a free program, the district announced.\nDCSD’s Family IMPACT Hub, headed by the Department of Parent and Family Engagement, is partnering with local higher education institutions to continue offering a free GED program in fall 2018.\nThe program will begin with an information session and class on Aug. 27 at 10 a.m. and 6 p.m. The session will take place at the Family IMPACT Hub, located at 1701 Mountain Industrial Boulevard, Stone Mountain.\nREAD: Popular Dunwoody Mexican spot fails inspection with ‘slime substance’\nREAD: Fake ‘City of Atlanta’ Facebook page back after Stone Mountain prank\nREAD: 13 events to find a job this month in DeKalb\nParticipants must be 23 or older and have a state-issued photo ID. They must also be a parent or guardian of a current DCSD student.\nRegistration is encouraged but not required. To RSVP, complete the form at http://bit.ly/DCSDParentEd.\nFor more information, contact Narva Dunlap at narva_dunlap@dekalbschoolsga.org or 770-865-3750.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/dekalb-parents-can-get-their-ged-free/zrLH9q7lljVMZdazr3CO1J/"}
