{"authors":[],"date_download":"2018-10-30 18:24:57","date_modify":"2018-10-30 18:24:57","date_publish":"2017-04-12 00:22:00","description":"DeKalb CEO Mike Thurmond met with about 100 residents to tell them his plans for fixing the county's problems with high water bills.","filename":"data/vaneerConsumption/DeKalbCEOMikeThurmondtellsresidentshellfixhighwaterbills.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/12/Images/newsEngin.18282341_041217-dek-water-bill-03.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_a55fbb32e7995f7d60ddf04fe70bcfb7__1540923897.html","title":"DeKalb CEO Mike Thurmond tells residents he'll fix high water bills","title_page":"DeKalb CEO Mike Thurmond tells residents he'll fix high water bills","title_rss":"NULL","source_domain":"ajc.com","text":"As thousands of frustrated residents are facing high water bills, DeKalb CEO Mike Thurmond apologized Tuesday for the county’s mistakes and told them to expect relief.\nThurmond, speaking to about 100 water customers at a public meeting, said he’s taking responsibility for verifying billing accuracy and improving customer service.\nThey hope they are getting closer to getting answers about high water bills. (www.accessatlanta.com)\n“It’s going to be a journey from incompetence, from negligence, from lack of oversight, management and leadership to a system all of us can be proud of,” Thurmond told the audience.\nResidents shouted questions to Thurmond, asking for specifics about his plans and calling for the county to hire more customer service representatives and meter readers.\nThurmond, who took office Jan. 1, asked them to give him a chance to implement both immediate plans and long-term solutions, which could take two or three years.\nStarting this week, the county is beginning to mail some of the 37,000 water and sewer bills that have been withheld since last fall because they couldn’t be justified. Thurmond said 8,000 of those bills from January and February have now been checked for accuracy based on meter readings. The rest are still being evaluated.\nIn addition, the DeKalb Commission budgeted $1.5 million in February to hire staff, retrain technicians, audit billing systems and review outsized bill amounts.\nSome of those in attendance said they’ll give Thurmond an opportunity to correct the problem, but they’ve already been fighting the county for months.\n“I just want them to fix this,” said Tess Snipes, who lives near Stone Mountain and saw her bill jump from less than $100 to more than $300 last year. “Water is basic, but metering and billing is more complex. I want things to work.”\nThere are many reasons for inexplicable bills, from malfunctioning meters to employees who estimated water consumption instead of actually reading meters, he said.\nIn other cases, meters have been improperly installed and data has been incorrectly entered into billing systems.\nDawn Fredericks, who manages a personal care home with five residents outside Decatur, said their bill rose from an average of about $350 to more than $1,000 this month.\n“It was surprising. I saw the bill and said, ‘This is wrong,’” she said. “This one was upsetting.”\nThurmond welcomed their skepticism. He said the county’s water billing problems have accumulated over the years.\n“We make no excuses for what has occurred. It’s unacceptable. It should not have happened. It did happen,” Thurmond said. “I can’t change the past, but we can direct and transform the future, and that’s what we are about.”\nWhile disputed bills can be rectified and more customer service staff hired, permanent solutions will take more time.\nThe county plans to replace water meters for its 194,000 customers and replace its computer billing system. When that’s finished, water usage will be sent wirelessly to the government, reducing human errors, Thurmond said. Contracts for those upgrades will be awarded in the coming months.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-residents-seek-water-billing-answers-from-ceo-michael-thurmond/n9oCBEHlK6pkictG98tnyN/"}
