{"authors":[],"date_download":"2018-10-30 18:39:58","date_modify":"2018-10-30 18:39:58","date_publish":"2017-01-19 17:09:00","description":"DeKalb County is looking for 80 volunteers to help with the annual overnight count of local homeless people on Jan. 26.","filename":"data/vaneerConsumption/DeKalbneedshelpcountinghomelessresidents.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/11/25/Images/photos.medleyphoto.12278408.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-needs-help-counting-homeless-residents__1540924798.html","title":"DeKalb needs help counting homeless residents","title_page":"DeKalb needs help counting homeless residents","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County is looking for 80 volunteers to help with the annual overnight count of local homeless people on Jan. 26.\n“The U.S. Department of Housing and Urban Development requires each community to conduct a biennial point-in-time homeless count,” said Allen Mitchell, director of Community Development. “For the past five years, DeKalb has conducted an annual count in order to identify the scope of homelessness, document the impact of actions to address homelessness and identify any additional resources that are required.”\nVolunteers will meet at their designated deployment locations for training and assignments at 9 p.m. The teams will have a driver, navigator, recorder and surveyor.\nUtilizing a smartphone app and real-time mapping from DeKalb County’s GIS department, participants will track the location and demographic information of homeless people.\nAnyone can volunteer, though minors would need to be with a parent or guardian or have a permission slip signed. Volunteers are asked to bring fully charged cell phones and a car charger. Volunteers willing to drive their own vehicles with their assigned teams are especially needed.\nTo register for the count, click here. For more information, call Josie Parker, project manager, at 404-704-2958.","url":"https://www.ajc.com/news/local/dekalb-needs-help-counting-homeless-residents/VPcsr4AsjvMt3n200ARh4N/"}
