{"authors":[],"date_download":"2018-10-30 18:33:31","date_modify":"2018-10-30 18:33:31","date_publish":"2017-02-14 19:16:00","description":"The Miller Grove High Wind Symphony has the invite of a lifetime: to play at legendary Carnegie Hall. But there’s a problem: money.","filename":"data/vaneerConsumption/DeKalbschoolbandneedshelppayingfortriptoplayCarnegieHall.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/14/Images/DeKalb%20symphany.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-school-ba_110233b3ef193bc3408e0880827cf95b__1540924411.html","title":"DeKalb school band needs help paying for trip to play Carnegie Hall","title_page":"DeKalb school band needs help paying for trip to play Carnegie Hall","title_rss":"NULL","source_domain":"ajc.com","text":"The Miller Grove High Wind Symphony has the gig of a lifetime: Carnegie Hall in New York City.\nBut there’s a problem: some of the cornerstone players can’t afford the trip in spite of a number of fundraisers held throughout the year.\nNow one more campaign is underway on GoFundMe to help them make the April 10 performance. The DeKalb County School District confirmed that the fundraiser is for the students, though it wasn’t created by the district.\nMiller Grove is a Title I school, where many students’ families struggle financially. Some kids find solace and purpose in music.\n“Our band program is quite unique. It is not just a class or extracurricular activity,” the fundraiser page said. “It's the joy, the life, and a safe haven for the students. It is a place where they can express themselves in one of the most beautiful art forms.”\nEach student needs at least $750 to participate in the trip.\nBy Tuesday afternoon, only $2,585 of the $10,000 goal had been raised.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/dekalb-school-band-gets-gig-lifetime-but-can-afford-the-trip/QqqmOzrr8YNP8d2bsUY4cN/"}
