{"authors":[],"date_download":"2018-10-30 19:51:01","date_modify":"2018-10-30 19:51:01","date_publish":"2018-07-13 18:54:00","description":"A DeKalb County jury on Friday convicted a former longtime state worker of murder for drowning his autistic 10-year-old adopted son last year.","filename":"data/vaneerConsumption/DeKalbdadfoundguiltyofmurderindrowningofautisticson10.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/11/Videos/4435972.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_breaking-dad-fou_27681fa02cc89e4a1579033eba020b2d__icmp=np_inform_variation-control_1540929061.html","title":"DeKalb dad found guilty of murder in drowning of autistic son, 10","title_page":"DeKalb dad found guilty of murder in drowning of autistic son, 10","title_rss":"NULL","source_domain":"ajc.com","text":"A DeKalb County jury on Friday convicted a former longtime state worker of murder for drowning his autistic 10-year-old adopted son last year.\nLeon Williams, 44, whose attorney said he adopted the child to fill a “void,” had admitted repeatedly lying to police before finally revealing that he’d held Kentae Williams under bathtub water. The father was angry at the son for allegedly acting out in school and had just been heard by a neighbor telling Kentae he was “going to die tonight.”\nJudge Daniel Coursey Jr. set Williams’ sentencing for Aug 3.\nDefense attorney Daryl Queen had done his best to portray the father as a good man who’d been responsible for his son’s death only by accident. Queen said Williams held the child under water only as a punishment, not thinking it would kill the child who had been a ward of the state since birth and had communication issues as well as myriad mental challenges.\nTape of Williams speaking to investigators in the hours after his son’s death complicated that picture.\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nREAD: Meth, ‘the Devil’s drug,’ is back and killing more people than ever\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nAs Williams would later acknowledge, he lied repeatedly and tried to blame the child for the April 28, 2017, death, citing a tendency toward “self-harming” behavior.\nWilliams, who at the time worked for the Georgia Department of Administrative Services, finally said he held the child under the water for 30 to 45 seconds twice and that it could’ve killed him. He also admitted hitting him with a belt.\nHe denied burning the child’s feet with scalding water, but police told him they didn’t believe him.\nThe ultimate cause of death was drowning, which prosecutors said took longer than Williams claimed he held the child down.\nAt the end of the police interview, Williams cried hard and said, “I don’t want to go to jail.”\nHe faces between 47 years and life without parole in prison.\nLike DeKalb County News Now on Facebook | Follow on Twitter","url":"https://www.ajc.com/news/local/breaking-dad-found-guilty-murder-drowning-autistic-son/ImnOjjWM8DCYhVa7c2yRCL/?icmp=np_inform_variation-control"}
