{"authors":[],"date_download":"2018-10-30 19:49:59","date_modify":"2018-10-30 19:49:59","date_publish":"2017-03-07 16:02:00","description":"DeKalb County school bus drivers had more than 400 accidents in 2016, according to updated records submitted by the school district to the DOE.","filename":"data/vaneerConsumption/DeKalbCountyHasyourchildsschoolbuscrashedin2017.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/09/Images/schoolbus.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_dekalb_29d1f5ede84dff352e761e121cd8ab9c__1540928999.html","title":"DeKalb County: Has your child’s school bus crashed in 2017?","title_page":"DeKalb County: Has your child’s school bus crashed in 2017?","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County school bus drivers had more than 400 accidents in 2016, according to updated records on bus accidents submitted by the school district to the Georgia Department of Education.\nFor 2016, the DeKalb County School District reported 432 accidents to state officials, about 1.2 accidents daily. That’s more than any other metro Atlanta school district, according to state data.\nINTERACTIVE: HAS YOUR CHILD’S BUS HAD AN ACCIDENT?\nUse our locator map below to see which buses have reported incidents in 2017.\nTELL US: Do you have concerns about your child’s safety on DeKalb’s school buses? Email Marlon A. Walker\nInitially, the district reported 206 accidents to the state between July 21 and Dec. 1.\nThe DeKalb County School District did not report any crashes in 2014 and only two in 2015. It learned of the yearly discrepancies from an inquiry by The Atlanta Journal-Constitution.\nDistrict officials submitted 230 accident reports to the state for 2014 and 267 for 2015 after the discrepancy was discovered.\nSchool districts are required to report every accident within 45 days to the Georgia Department of Education through an online portal. But some districts report crashes sparingly if at all, state officials said.\nDistrict officials said in December that reports would be retroactively submitted to the state to ensure data was as accurate as possible.\n“Since learning that the accidents were not reported in the last two years, we started pulling weekly reports of what is reported to the state,” district officials said in the statement. “A bus accident report is now produced once per week to verify that we are reporting accidents.”\nState officials said the data was used to tailor annual required training sessions, but did not offer specifics on how the data impacted training.\nInvestigators are going over the path of the bus and looking into how fast the driver may have been going.\nIn Georgia, school bus drivers can be as young as 18, as long as they have passed a driving skills test and other requirements. Some districts require drivers to be 21 or older. Georgia’s laws do not mention mental health checks.\nConcern about school bus safety grew after six Chattanooga elementary school children were killed days before Thanksgiving when a bus driver said he lost control of the vehicle and it flipped, crashing into a utility pole and a tree. Police charged the driver, Johnthony Walker, 24, with vehicular homicide, saying he drove “well above the posted speed limit of 30 mph.”","url":"https://www.ajc.com/news/local-education/dekalb-county-has-your-child-school-bus-crashed-2017/WisdAMthDi3Q42REQ8kWQM/"}
