{"authors":[],"date_download":"2018-10-30 18:34:48","date_modify":"2018-10-30 18:34:48","date_publish":"2016-06-27 18:16:44","description":"The biggest spending increase in DeKalb proposed government budget is $48 million for water and sewer construction.","filename":"data/vaneerConsumption/DeKalbspendsonwaterandsewerupgrades.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_0bba2cccf84b5e2a815437b734d491a5__1540924488.html","title":"DeKalb spends on water and sewer upgrades","title_page":"DeKalb pays for water and sewer upgrades in 2016 midyear budget","title_rss":"NULL","source_domain":"ajc.com","text":"The biggest spending increase in DeKalb proposed government budget is $48 million for water and sewer construction.\nOverall, Interim DeKalb CEO Lee May’s recommended $1.38 billion midyear 2016 budget is $57.6 million, or 4.4 percent, larger than the county’s spending plan that was approved in February.\nThe water and sewer improvements are part of the county’s long-term project to reduce sewage spills and increase capacity. The capital improvements are costing utility customers $1.35 billion.\nDeKalb Budget Director Jay Vinicki said during a Monday budget meeting that the county’s budget increase is only $9 million, or 0.7 percent, after adjusting for the water and sewer costs.\nThat money would primarily go toward 4 pay raises for DeKalb employees retroactive to May.\nThe midyear budget would spend $6.3 million to finish giving raises to the county’s 6,000 employees after $5.1 million was allocated in the February budget. The raises would cost $17.1 million annually.\nThe county government has more money to spend because of rising tax collections as property values continue to rise.\nThe DeKalb Board of Commissioners plans to vote on the midyear budget next month.","url":"https://www.ajc.com/news/local-govt--politics/dekalb-spends-water-and-sewer-upgrades/9RwNZ0Gwhx9LpZliX9hIAJ/"}
