{"authors":[],"date_download":"2018-10-30 20:57:59","date_modify":"2018-10-30 20:57:59","date_publish":"2015-11-30 10:49:27","description":"Dickens said the law is an ass. Boy, is it ever. Malcolm Jamal Brown, a reputed Bloods gang leader, allegedly ordered three underlings to kill two young women after one of them “disrespected” him.","filename":"data/vaneerConsumption/DeKalbjudgeletsallegedgangleaderbondout.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/11/30/Images/photos.medleyphoto.8440962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_alleged-bloods-l_5ae6a2abde757b7cc59910fdd3f3d55e__1540933079.html","title":"DeKalb judge lets alleged gang leader bond out","title_page":"DeKalb judge lets alleged gang leader bond out","title_rss":"NULL","source_domain":"ajc.com","text":"Dickens said the law is an ass. Boy, is it ever.\nMalcolm Jamal Brown, a reputed Bloods gang leader, allegedly ordered three underlings to kill two young women after one of them “disrespected” him. More precisely, she disregarded his romantic advance and then told him off.\nBrown, known on the streets as “Dot,” is now out on $75,000 bond. The three members of his alleged hit squad have been granted even lower bonds, although their families haven’t been able to come up with the scratch to free them.\nDeKalb County court records indicate the defendants’ attorneys believe the state has a thin case against their clients, that it’s largely based on the testimony of a woman who hangs with these players.\nBut it might be interesting to know that before he was released, Brown spent six months and a dozen phone calls trying to track down the star witness to get her to change her story, prosecutors say. They told the judge the witness is in “imminent danger.”\nThat was back when Brown was behind bars with authorities listening in on his calls. Now he’s out.\nPerhaps the witness shouldn’t fear. The alleged gang leader, who is facing life in prison if convicted, has been told to stay at home, steer clear from his gang buddies and leave the witness alone. I mean, what can go wrong? He has gotten a stern warning from a judge, after all.\nFor the record, that’s Superior Court Judge Linda Hunter, who did not return calls for this story. The district attorney’s office would not comment, citing an open case.\nMiguel Camacho is appalled by it all.\nFirst, he was devastated to hear his daughter, Shaniqua, 20, was shot to death outside a south DeKalb apartment complex. A few feet away was the body of Sonia Williams, the woman who allegedly dissed Malcolm Jamal “Dot” Brown.\n‘I can’t believe the judge set bond’\nShaniqua Camacho’s death was the quintessential “wrong place, wrong time” tragedy. The South Carolina resident was visiting Atlanta and didn’t even know Brown or his pals. She had reconnected with Williams, a friend from middle school, and was out socializing the night of May 18, 2014, when she was a bystander to this bizarre and troubling dispute.\nMr. Camacho has sat through several court hearings and believes the defendants getting bond is due to Judge Hunter “punishing” the prosecution for appealing one of her rulings.\n“I can’t believe the judge set bond even though (Brown) was trying to contact the state’s witness,” Camacho said. “It’s like she has a beef with the DA. Now this guy is out. God knows what he’s going to do.”\nBrown’s lawyer, Morris Fair Jr., said in court Brown is a father and works for a moving company. He told me last week that he thinks the judge decided to set bond because the state has dragged out the case.\nProsecutor Antonio Veal tried to introduce an indictment from another case as evidence to explain the wide reach of the Bloods street gang and how it operates. “The similarities are striking,” Veal said.\nBrown, as well as his co-defendants Frankland Henderson (a.k.a. “Bad News”), Michael Hasker Jenkins (“Slim”) and Demetre Mason (“Assassin”), are said to be tatted up with Blood gang symbols, talk the vernacular and/or wear red to show their allegiance. Prosecutors believe Mason and Henderson were the gunmen and Jenkins was the driver.\nVeal told the judge he needed to introduce evidence about how it all works because people are disbelieving when told gangs operate in DeKalb.\n2014 headline: ‘DeKalb anxious about gangs’\nCommunities hate to admit they have gangs. Coincidentally, on May 18, 2014, the last day of Shaniqua Camacho’s and Sonia Williams’ lives, I co-wrote a story headlined, “DeKalb anxious about gangs.”\nThe story was about five killings in a week. In one, a young woman who witnessed a murder was beaten with a brick and fatally shot. Hours later, police said, her friends kicked in the door of the killers’ family home and shot three women and a 9-month-old boy, killing the baby.\nJudge Hunter told the prosecutor that introducing info from another case was “highly prejudicial.” Instead, she said, the DA could bring in a gang expert to tell the jury the ins and outs of the Bloods.\n“I don’t mean any disrespect,” she told him. “But I have sat through more street gang cases than you’ve even read. I feel that the sole purpose is to prejudice these defendants, guilt by association.”\nVeal appealed her decision to the state Supreme Court, which is set to hear arguments in January. But since the defendants would be jailed for a while on charges that are still unproven, the law allows for consideration of bond.\nI talked to a former prosecutor who called Veal’s argument to introduce that evidence “a stretch.” But the same lawyer was surprised to hear the alleged Bloods leader got bond.\nHere’s why.\nIn January, Brown allegedly called a gang associate and told him to contact the woman who implicated Brown. Get her to change her statement, he said. A week later, the man told Brown that he had obtained the woman’s phone number and location but that she is afraid of Brown.\n‘They could have charged him’\nLater, the two discussed finding the woman through gang associates and even talked about paying her to change her statement. Later, he said he needed to get released “by any means necessary.”\nBy July, that same gang associate complained to Brown that the witness was no longer answering her phone.\nHearing all that, prosecutors apparently started worrying and described all those calls in an “emergency motion for a deposition to preserve testimony of a material witness,” saying the woman is likely to flee the state “for fear of injury to her, her children and her family.”\nMorris Fair, Brown’s attorney, said prosecutors are “mischaracterizing” some of the tapes. He said his client has not intimidated any witnesses and, tellingly, has not been charged with doing so. “If they felt he intimidated her, they could have charged him,” he said.\nThe case is largely built on her statements to police. Prosecutors said the woman was dating one of the defendants and has “first-hand, exclusive and detailed knowledge,” including hearing Brown tell his three co-defendants “to go kill the victims.”\nAfter an Aug. 31 hearing, Judge Hunter denied the state’s request to depose the witness. Prosecutors did not, the judge wrote, provide “sufficient, competent and admissible evidence” that the witness was being threatened. She even noted that the state’s own motion stated that “neither defendant Brown or (his associate) directly communicated a threat” to the witness.\nNot directly, I suppose, but she darn sure knows they’re thinking about her. A lot.\nTwo weeks after the hearing, Brown was granted bond.","url":"https://www.ajc.com/news/local/alleged-bloods-leader-free-bond-double-murder-case/DXer7duujrmbE8SzQyf09J/"}
