{"authors":[],"date_download":"2018-10-30 18:28:37","date_modify":"2018-10-30 18:28:37","date_publish":"2017-03-06 22:41:00","description":"A DeKalb County Police Department officer was arrested after tampering with a crime scene, the agency announced Monday.","filename":"data/vaneerConsumption/DeKalbpoliceCoparrestedfortamperingwithcrimescene.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/06/Images/AJAMIA%20GUYTON1_287x179.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-police-co_aa14f1a04fa4d911bc5c49abad050594__1540924117.html","title":"DeKalb police: Cop arrested for tampering with crime scene","title_page":"DeKalb police: Cop arrested for tampering with crime scene","title_rss":"NULL","source_domain":"ajc.com","text":"A DeKalb County Police Department officer was arrested after tampering with a crime scene, the agency announced Monday.\nAjamia Guyton, 28, resigned immediately after the investigation started.\n“It’s very upsetting to me when an officer crosses that line, but what I do take great pride in is that our own officers recognized the wrongdoing, initiated the investigation and made the arrest of someone undeserving to wear the badge,” Chief James Conroy said in a news release.\nThe charges of theft by taking, tampering with evidence and violation of oath of office are related to a forced entry call on Saturday. Police responded to an apartment at 2795 Evans Mill Road, Lithonia.\nOfficers found suspected narcotics, firearms and currency in view, police said. Three suspects were detained and Guyton was assigned to secure the scene while other officers worked to get a search warrant.\nWhen detectives returned with the warrant, they noticed items had allegedly been moved.\nDetectives immediately started an investigation that led to the arrest of Guyton and the recovery of $231, police said.\nGuyton began working with the department in December 2015.\nGuyton remained in the county jail on $500 bond Monday, according to booking records.","url":"https://www.ajc.com/news/local/dekalb-police-cop-arrested-for-tampering-with-crime-scene/xGa1mrvCz2Dh2el5FIXCKO/"}
