{"authors":[],"date_download":"2018-10-30 18:47:41","date_modify":"2018-10-30 18:47:41","date_publish":"2016-09-12 19:18:59","description":"Commissioner Larry Johnson said, despite a fellow commissioner's criticism, he's been working on Creekside Forest apartments for some time.","filename":"data/vaneerConsumption/DeKalbofficialfiresbackatcriticsonCreeksidecomplex.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-official-_9ddbf4e99f018584d6dec9a1c36f8491__1540925261.html","title":"DeKalb official fires back at critics on Creekside complex","title_page":"DeKalb official fires back at critics on Creekside complex","title_rss":"NULL","source_domain":"ajc.com","text":"Last week, DeKalb County Commissioner Nancy Jester stepped out of her district to meet with media at Creekside Forest Apartment Homes, a complex off I-20 plagued by crime, garbage and squatters. She didn’t hesitate to note the absence of the representative for the area, the county's presiding officer Commissioner Larry Johnson.\nBut Johnson released a lengthy, pointed statement Sunday night, firing back at Jester and any critics who would suggest his response has been slow.\n“As with most issues, Commissioner Jester does not acquaint herself with the facts before contacting the media; her approach is akin to walking into the middle of a movie and trying to explain the plot,” Johnson said, suggesting that Jester takes pleasure in giving the county a \"black eye.\" “Truth be told, I have a long history with advocating for assistance with Creekside Apartments.”\nJester – who's also been at odds with Johnson on other issues – in turn released a statement through her communications director Sunday night, claiming Johnson had failed south DeKalb and suggesting he resign \"immediately\" if he couldn't accept or admit that the conditions at the complex are dangerous.\n\"The truth is, there is no excuse for Larry Johnson not to have demanded years ago that the people victimized by the deplorable conditions at this property get help and relief because of the severe health and public safety threats they face on a daily basis,” the statement said.\nRelated: At Issue: What should DeKalb do about blighted rental properties?\nAfter last week’s media coverage, changes appeared to speed up. Grappling trucks arrived to pick up trash, and county officials said the owner agreed to turn over the leasing office to use as a service center to help residents find new housing. The county also released a preliminary plan action plan for the property, dated the day after Jester’s visit.\nCleaning up the complex, of course, will involve much more than picking up the garbage on the ground. The buildings are all boarded up, damaged severely by water leaks or vandals.\nJohnson said he remains committed to helping the tenants, particularly because of his history at the complex: Some 20 years ago, when his family moved to the area, they lived there.\n“It has undergone many changes since that time; however, it was home to me for a short while so I have a special and vested interest in ensuring that this issue is appropriately resolved,” he said.","url":"https://www.ajc.com/news/local/dekalb-official-fires-back-critics-beleaguered-apartment-complex/BkPyXt4RWu7r6WW9wjvVQP/"}
