{"authors":["Matt Barlow For Mailonline"],"date_download":"2018-10-23 01:03:39","date_modify":"2018-10-23 01:03:39","date_publish":"2016-01-29 14:50:27","description":"The chairman of Milton Keynes Dons had been told for years about the special talent developing within the club's youth system - but no-one knew how Dele Alli would cope with the fame and fortune.","filename":"data/vaneerConsumption/DeleAllihasnotbeenaffectedbyfameandfortuneofthePremierLeagueandcanbetheplayerofagenerationforEnglandsaysMKDonschairmanPeteWinkleman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30A1D05800000578-0-image-a-51_1454078676541.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422906_Dele-Alli-not-affected-fame-fortune-Premier-League-player-generation-England-says-MK-Dons-chairman-Pete-Winkleman_1540256619.html","title":"Dele Alli has not been affected by fame and fortune of the Premier League and can be the player of a generation for England, says MK Dons chairman Pete Winkleman","title_page":"Dele Alli has not been affected by fame and fortune of the Premier League and can be the player of a generation for England, says MK Dons chairman Pete Winkleman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"By the time he sold Dele Alli to Tottenham there was only one question lingering in the mind of Pete Winkelman.\nThe chairman of Milton Keynes Dons had been told for years about this special talent developing within the club's youth system - but no-one knew how the teenager would cope with the fame and fortune of the Barclays Premier League.\nSince moving to White Hart Lane for £5m, all doubts have been erased. Alli burst into the Spurs team, scored for England and shows no sign of slowing down having scored what deserves to be the goal of the season, last weekend at Crystal Palace.\nTottenham midfielder Dele Alli has excelled at White Hart Lane since joining the club from MK Dons\nMK Dons chairman Pete Winkleman insists Alli become an important England player for the current generation\nWinkelman said: 'The only question mark was whether he could take the glamour and the money they get stepping up from us.\n'So many players go wrong at that point, thinking: \"Oh I've made it, I've got all this money, I can go and do that, I can have that extra food here, I don't have to do that extra run,\" And they don't fulfil their potential.\n'The thing is that Dele's adoptive parents, the Hickfords, are grounded, bright, hard-working and dedicated people. Dele could so easily have gone wrong. They put him on the straight and narrow, and you can see the quality of boy he has become.\n'If he can keep it together he will become generationally important for England. There's no way you can't play him for England at the moment.\nAlli joined the Championship club at the age of 11 before making his first-team debut just five years later\n'Dele can give you something special. And, when he's not doing something special, he's really hard-working, and aggressive, he tackles and he's not afraid of anything. He has all the attributes to make a normal Premier League footballer. Plus this little piece of genius.'\nAlli was born in Milton Keynes and joined the club at the age of 11. Manager Karl Robinson plunged him into the first-team at 16 and he helped them into the Championship. He signed for Tottenham last January and returned on loan for the rest of the season. He is still only 19.\n'I told everybody he'd be this good,' said Winkelman. 'I've watched this kid for years. Karl and the Academy boys were raving about him for years. Karl started him when he was 16. All I've known is how good Dele Alli is.\n'Everyone's excited about the goal at Crystal Palace. I saw him play a pass that was probably the greatest pass I've seen to Benik Afobe, last year. It was 75 yards from one penalty area, onto Benik's foot. One to see the run, and think about the pass, and then it was so accurate. That wasn't luck. You can't do that with luck. I'm not surprised by what he's done this season. I knew.'\nWinkleman was pleased to see Alli impressing in the Premier League with a wonder goal at Crystal Palace\nTottenham have been rewarded for having the faith to identify lower-league talent. Other big clubs dithered, including Liverpool, who were very close to signing Alli in the summer of 2014, six months before he signed for Spurs.\nWinkelman added: 'I was so keen for him to go to Spurs because I really like Mauricio Pochettino.\n'He came to see Dele here. He's a great guy and he's not afraid of using young players and letting them make a mistake, even though he knows it might cost him a few points. Equally, Dele can do what he did at Crystal Palace.","url":"https://www.dailymail.co.uk/sport/football/article-3422906/Dele-Alli-not-affected-fame-fortune-Premier-League-player-generation-England-says-MK-Dons-chairman-Pete-Winkleman.html"}
