{"authors":[],"date_download":"2018-10-30 01:15:23","date_modify":"2018-10-30 01:15:23","date_publish":"2016-05-24 05:00:20","description":null,"filename":"data/vaneerConsumption/DelegitimizingIsraelinOurClassrooms.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/05/Declaration_of_State_of_Israel_1948_1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862123.html","title":"Delegitimizing Israel in Our Classrooms","title_page":"Delegitimizing Israel in Our ClassroomsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The New York Times does its lucrative part at taxpayer expense.\nThe New York Times Upfront magazine, distributed by paid subscription to approximately 1 million American 8th to 12th graders, recently included an article, “How the Middle East Got that Way.” Author Joseph Berger, former Times reporter, blames the Sykes-Picot Agreement of 1916 for the current mess in the Middle East.\nIn his view, “a century ago, two diplomats carved out lines on the Middle East map, creating new nations and sowing the seeds for much of the strife in the region today.”\nReferring to the Arab-Israeli conflict, Berger tells students, “Most Arabs opposed the Zionist movement, which called for a Jewish state in Palestine. But world pressure to create a Jewish homeland increased after World War II… because 6 million Jews were murdered in the Holocaust.”\nThe article emphasizes that Western imperialism created the Arab-Israeli conflict because Sykes (British) and Picot (French) disregarded the wishes and rights of the indigenous Arab population and, Berger writes, “Arab leaders were angry” and “felt betrayed.”\nThe article continues, “In 1947, Britain, with approval from the United Nations, came up with a partition plan (to) create the nations of Israel and Palestine…. The Palestinians and surrounding Arab countries rejected it… (and) fought an unsuccessful war…. In the 1967 Six-Day War, Israel expanded territory…by capturing lands where many Palestinians were living…. The occupied Palestinians continue to demand a state of their own.”\nReading this description of historical events, young students, with little pre-existing knowledge about the topic, have no idea why the Jews would want a nation-state in the Middle East, which Berger characterizes as “Arab.” The author portrays the Arabs as victims of Western domination, legitimizing their 1948 rejection of a Jewish state and their subsequent war against newly declared Israel.\nNeither the article nor the teacher’s guide or handouts mention the 3,000-year historical connection of the Jews to the area, the continuous Jewish presence in this land, the Jewish immigration to their historic homeland in the late 19th and early 20th century or the promise made to the Jews for a national homeland in Palestine in the 1917 Balfour Declaration. Also lacking is information about the 1922 League of Nations’ Mandate for Palestine to create a Jewish national home in today’s Israel, the “West Bank” and Sinai and the UN’s assumption of that international legal commitment.\nThe article’s failure to provide historical and legal context for the Jewish presence in the Middle East and the establishment of the Jewish state delegitimizes the creation of Israel. The Jews are made to look like foreign colonialists taking Arab land — the false narrative promoted by Arabs and Western progressives.\nSince 1999, the NYT, in partnership with Scholastic Inc., has been offering Upfront magazine to social studies and English/language arts teachers. According to the New York Times website, “The idea was to combine the… Times journalistic resources… with Scholastic’s ability to create magazines that meet the curricular needs of high school students.” It’s a mutually beneficial relationship — Scholastic generates revenue and the Times grooms young teens into future subscribers.\n“How the Middle East Got That Way” promotes the well-known Times anti-Israel agenda. That agenda has been documented by two media watchdogs, CAMERA and HonestReporting. Times headlines during the 2014 Gaza conflict display that bias: “Israel Has Overreacted to the Threats it provoked,” “U.S. Should Stop Funding Israel,” and “Israel’s Colonialism Must End.” Even Margaret Sullivan, responding as the Times Public Editor, suggested that her newspaper could provide more accurate historical and geopolitical context.\nUpfront magazine teaches young, impressionable teenagers political ideology masquerading as scholarship and we, the taxpayers, are subsidizing this effort. According to Fortune magazine, “a majority of Scholastic’s magazines are paid for by school districts.” Additionally, government funding for Upfront subscriptions comes from Federal Title 1A education programs and state education budgets.\nThe New York Times is one of dozens of newspapers providing educational materials to our students. It is our job as parents, taxpayers, and citizens to see that these “educational” programs provide accurate and unbiased information. There is no place for propaganda from the left or the right in our classrooms.","url":"https://spectator.org/delegitimizing-israel-in-our-classrooms/"}
