{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 20:34:56","date_modify":"2018-10-30 20:34:56","date_publish":"2016-12-29 00:00:00","description":"A survey of 119 CFOs found that 27% said they were more optimistic about their businesses.","filename":"data/vaneerConsumption/DELOITTEUKCFOsurveypostBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deloitte-uk-cfo-survey-post-brexit-2016-12_1540931696.html","title":"DELOITTE: UK CFO survey post-Brexit","title_page":"    DELOITTE: UK CFO survey post-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Children leap into a tidal pool as temperatures soar at Camps Bay beach in Cape Town, South Africa, December 11, 2016. REUTERS/Mike Hutchings Chief financial officers of UK companies are more optimistic than at any time in the past 18 months despite high levels of uncertainty, according to a report by Deloitte.\nA survey of 119 CFOs found that 27% said they were more optimistic about their businesses, compared with 22% that said they were less optimistic, giving a balance of +5%.\nThat's a big swing back to positive figures, with balances of -31% for the last quarter and -70% for the period just after the UK's vote to leave the European Union, according to a report by Bloomberg News.\nIt seems businesses are beginning to view political uncertainty as an opportunity. Britain's benchmark share index, the FTSE 100, closed at an all-time high on Wednesday, the first day of trading after the Christmas break.\n\"In the wake of the vote, in late June, optimism dropped to the lowest level since the global financial crisis,\" Deloitte said. \"CFOs battened down the hatches, pulling back on investment and spending. Since then the UK has proved more resilient than expected and talk of the UK falling into recession has abated.\"\nAround two-thirds of those surveyed said they are worried about the economic impact of Brexit compared with 14% expecting higher rates of growth.\nDeloitte had its own Brexit-related problems after being made to withdraw from making any Whitehall contract bids for six months after a two-page memo on Brexit was leaked, according to the Times.\nThe memo suggested that the government was woefully underprepared and understaffed for Brexit, and criticised Prime Minister Theresa May for \"drawing in decisions and details to settle matters herself,\" which reportedly offended the prime minister.","url":"https://www.businessinsider.com/deloitte-uk-cfo-survey-post-brexit-2016-12"}
