{"authors":["Thomas Colson"],"date_download":"2018-10-30 21:17:10","date_modify":"2018-10-30 21:17:10","date_publish":"2016-12-21 00:00:00","description":"Deloitte won't pitch for tens of millions of pounds worth of contracts across a number of central government departments, including the Brexit department.","filename":"data/vaneerConsumption/DeloitteforfeitsgovernmentcontractsoverleakedBrexitmemo.json","image_url":"https://amp.businessinsider.com/images/585a507ddd08953f208b4878-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-deloitte-theresa-may-leaked-memo-firm-forfeit-millions-contracts-2016-12_1540934230.html","title":"Deloitte forfeits government contracts over leaked Brexit memo","title_page":"    Deloitte forfeits government contracts over leaked Brexit memo - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Prime Minister Theresa May. Reuters / Stefan Wermuth LONDON — The consultancy firm behind a leaked Brexit memo is to withdraw from making any Whitehall contract bids for six months in an attempt to draw a line under the incident, according to the Times.\nA two-page Brexit assessment prepared by Deloitte for \"internal audiences\" was leaked to newspapers in November, provoking fury in Downing Street.\nThe memo suggested that the government was woefully underprepared and understaffed for Brexit, and criticised Prime Minister Theresa May for \"drawing in decisions and details to settle matters herself,\" which reportedly offended the prime minister.\nA statement released by Deloitte on Tuesday to the Times said it had come up with a plan to \"work with central government to put this matter behind us.\" Deloitte will hold off from pitching for government contracts for six months, losing out on potentially tens of millions of pounds worth of business across a number of central government departments, including the Brexit department.\nThe decision was reportedly reached after meetings between Deloitte representatives and the UK's most senior civil servants, cabinet secretary Sir Jeremy Heywood and civil service chief executive John Manzoni. Deloitte reportedly feared a more draconian punishment unless it made an offer first.\nA statement from Deloitte on Tuesday said: \"Deloitte regrets the publication of the two-page note, and has apologised for the unintended disruption it caused government. The note was for internal audiences and was not a Deloitte point of view.\"\nDowning Street declined to comment, but government sources told the Times that the move was a \"reset\" of relations, rather than a punishment.","url":"https://www.businessinsider.com/brexit-deloitte-theresa-may-leaked-memo-firm-forfeit-millions-contracts-2016-12"}
