{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:20:45","date_modify":"2018-10-22 23:20:45","date_publish":"2017-03-10 02:48:31","description":"She's the singing sensation currently unearthing the next biggest thing in music as a Voice coach.","filename":"data/vaneerConsumption/DeltaGoodremunveilsherfirstperfumead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EFA8600000578-0-image-a-78_1489106442785.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299610_Delta-Goodrem-unveils-perfume-ad_1540250445.html","title":"Delta Goodrem unveils her first perfume ad","title_page":"Delta Goodrem unveils her first perfume ad | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the singing sensation currently unearthing the next biggest thing in music as a Voice coach.\nAnd Delta Goodrem can now call herself a musical scent-sation as well, after unveiling her just finished perfume, aptly titled Delta.\nOn Friday, the 32-year-old songstress shared her first advertising campaign photo for the product, gushing to fans 'I know you are going to love it'.\nScroll down for video\nShe's a singing SCENT-sation! Delta Goodrem unveils her perfume after describing the creative process behind the fragrance as empowering\nThe stunning ad shows a bronzed Delta posing for the camera with tousled sun-kissed hair.\nThe songstress wears a cleavage baring gold sequin ensemble with flowing chiffon sleeves.\nBehind the scenes photos from the advertising campaign show Delta striking poses in an array of outfits.\nStrike a pose! The stunning ad shows a bronzed Delta posing for the camera with tousled sun kissed hair\nWorking it! Behind the scenes photos from the advertising campaign show Delta striking poses in an array of outfits\nEarlier this week, Delta shared a video with her 396,000 Instagram fans gushing about the new fragrance.\n'I can't wait to share it with you all, I know you are going to love it,' the Lost Without singer said. 'I do!'\nThe fragrance will retail for $49.99 and will be sold at Australian chemists.\nExcited! Earlier this week Delta shared a video with her 396,000 Instagram fans gushing about the new fragrance\nLast month, Delta told the Herald Sun that the creation of her fragrance had been an empowering experience.\n'These last few years have been such a creative time for me personally and professionally and it’s given me a sense of empowerment as a woman,' she said.\n'... That’s my inspiration and purpose — we all have our journey in life and a favourite scent gives us all memories, purpose and confidence.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299610/Delta-Goodrem-unveils-perfume-ad.html"}
