{"authors":["William Bigelow"],"date_download":"2018-10-30 19:30:50","date_modify":"2018-10-30 19:30:50","date_publish":"2015-08-05 19:42:03","description":"The delta smelt may disappear from California because of the extreme drought.","filename":"data/vaneerConsumption/DeltaSmeltMayDisappearDuetoDrought.json","image_url":"https://media.breitbart.com/media/2015/08/Delta-Smelt-Rich-Pedroncelli-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_08_05__1540927850.html","title":"Delta Smelt May Disappear Due to Drought","title_page":"Delta Smelt May Disappear Due to Drought","title_rss":"NULL","source_domain":"breitbart.com","text":"The delta smelt may disappear from California because of the extreme drought. Farmers in the Central Valley may soon receive the water denied them for years because of environmentalists’ desire to flush fresh water out to sea for the smelts’ sake.\nPeter Moyle, a fish biologist at the University of California, Davis, told the Fresno Bee, “The delta smelt is basically on its last legs right now. We’ll be lucky if it survives the coming year.”\nThe delta smelt, which resides in the Sacramento-San Joaquin River Delta, from which Central Valley farms obtain their water, has been a giant thorn in the side of farmers for years. It was listed as a threatened species under the U.S. Endangered Species Act in 1993 and state law in 2010, which triggered the government to reduce water to the farms from the delta so the pumps transporting water south to the farms would not suck the fish in.\nThat is only part of the story. As The Wall Street Journal reported in April, “To protect smelt from water pumps, government regulators have flushed 1.4 trillion gallons of water into the San Francisco Bay since 2008. That would have been enough to sustain 6.4 million Californians for six years.”\nIn 2008, the U.S. Fish and Wildlife Service identified delta pumps as a major culprit in the dwindling number of smelt. The agency then reduced the water pumping. In 2009, Central Valley farmers sued the Fish and Wildlife Service, saying the agency had failed to use the “best available science,” prompting federal Judge Oliver Wanger to rule in 2010 that the agency should jettison its “arbitrary, capricious and unlawful” regulations. But in 2014, the Ninth Circuit of Appeals reversed Wanger’s decision, even though it admitted that the U.S. Fish and Wildlife Service’s opinion was a “jumble of disjointed facts and analyses.”\nThe Los Angeles Times reported in January that lawyers for the Metropolitan Water District of Southern California had asked the U.S. Supreme Court to reconsider the federal law dating from the 1970s that required reducing water diversions to protect the delta smelt and other imperiled species.\nThe Bee reported that longfin smelt, green sturgeon and winter-run Chinook salmon are also endangered by the four-year drought, adding that a key index of delta smelt abundance plunged to zero for the first time.\nThe UC Davis Fish Conservation and Culture Laboratory in Byron recently received $10 million from a federal grant to breed smelt in captivity for scientific research, later releasing them back into nature.","url":"https://www.breitbart.com/local/2015/08/05/delta-smelt-farmers-nemesis-may-disappear-due-to-drought/"}
