{"authors":["Kelly Yamanouchi"],"date_download":"2018-10-30 14:07:46","date_modify":"2018-10-30 14:07:46","date_publish":"2018-10-30 12:32:00","description":"Delta chief executive officer Ed Bastian contends that a permanent jet fuel tax exemption would make Georgia more competitive with other states.","filename":"data/vaneerConsumption/DeltaCEOpushesforpermanentjetfueltaxexemption.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/Ed%20Bastian%20A220.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_airport_delta-ceo-bast_6c58efd6b0fefda7dbd878cd9034bc15__1540908466.html","title":"Delta CEO pushes for permanent jet fuel tax exemption","title_page":"Delta CEO pushes for permanent jet fuel tax exemption","title_rss":"NULL","source_domain":"ajc.com","text":"With Georgia legislators set to convene a special session in November where they could support or reject a tax break for Delta Air Lines, the carrier’s CEO said a permanent jet fuel tax exemption would make Georgia more competitive with other states.\nAt an event for the 10th anniversary of the merger between Delta and Northwest, Delta CEO Ed Bastian on Monday said he’d like to see the jet fuel tax “permanently go away so that we can have a competitive tax environment here in Georgia similar to the states that we compete with around the country.”\n“We’re also going to be able to use the investment dollars that it gives us to grow more service here in Atlanta,” said Bastian said.\nEarlier this year, the Georgia General Assembly was considering a tax break on jet fuel worth $40 million annually to Delta.\nBut then, amid a debate over gun control after the Parkland, Fla. high school shooting, Delta discontinued a discount for National Rifle Association members traveling to their national convention.\nLt. Gov. Casey Cagle, who is president of the state Senate and at the time was a Republican candidate for governor, vowed to block the legislation. The tax break , which Gov. Nathan Deal had supported, was killed.\nBut over the summer, Deal signed an executive order to temporarily suspend the collection of local sales taxes on jet fuel.\nDeal called for a special session to be convened Nov. 13. State law requires the General Assembly to take up executive orders signed by the governor since the previous session.\nLast week, both Republican Brian Kemp and Democrat Stacey Abrams said they supported the jet fuel tax exemption.","url":"https://www.ajc.com/blog/airport/delta-ceo-bastian-pushes-for-permanent-jet-fuel-tax-exemption/Zj6JzGiuR2vHm0Rx508SpM/"}
