{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 23:03:47","date_modify":"2018-10-30 23:03:47","date_publish":"2016-12-09 00:00:00","description":"Delta is offering free meals in economy class on some flights.","filename":"data/vaneerConsumption/DeltaAirLinesmaybringbackfreemealsineconomy.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_delta-bring-back-free-meals-economy-2016-12_1540940627.html","title":"Delta Air Lines may bring back free meals in economy","title_page":"    Delta Air Lines may bring back free meals in economy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Delta Airlines Airbus A321 interior. Delta This week, Delta Air Lines announced that it had begun testing complimentary meals in economy class on certain flights between New York and California.\nAccording to the Atlanta-based airline, the test period began November 1 on Los Angeles- and San Francisco-bound flights and would conclude next Thursday.\n\"We are constantly actively listening to our customers and employees, gathering their feedback and testing new products on board to continuously improve the overall experience,\" Delta's senior vice president of in-flight service, Allison Ausband, said in a statement on Wednesday. \"Testing meals on Transcon flights is part of our commitment to be thoughtful about our offerings and make decisions based on customers' needs.\"\nDelta will evaluate whether to keep serving free meals at the end of the test.\nOn Morning flights, Delta is testing a breakfast sandwich and a \"Luvo Breakfast Medley.\" Afternoon flights will offer a turkey sandwich and a vegetable wrap.\nOnce commonplace on domestic flights in the US, economy-cabin in-flight meals fell victim to cost-cutting measures during the recession.\nThe potential return of in-flight meals is the latest example of how US airlines including Delta are beginning to walk back on some cuts. In July, Delta began offering free streaming entertainment on all Wi-Fi equipped flights. In February, American Airlines brought back free snacks in economy class along with expanded complimentary in-flight entertainment options.\nDelta said Thursday that it would revamp its snack selection in economy with larger portions and brand-name offerings, as opposed to its current airline-branded items.","url":"https://www.businessinsider.com/delta-bring-back-free-meals-economy-2016-12"}
