{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 20:52:51","date_modify":"2018-10-30 20:52:51","date_publish":"2016-12-26 00:00:00","description":"Here's how to ensure you have great in-flight meal, according to Delta.","filename":"data/vaneerConsumption/Deltarevealsthedishesyoushouldeatonaplane.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_delta-airline-food-to-eat-2016-12_1540932771.html","title":"Delta reveals the dishes you should eat on a plane","title_page":"    Delta Air Lines reveals the dishes you should eat on a plane - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Delta One ravioli. Delta Although in-flight meals have largely disappeared on domestic flights, they are still alive and well on board international flights.\nAnd to be honest, airplane food has not always had the best reputation.\nThere's a good reason for that.\nFresh ingredients are cooked, packaged, transported to the plane, and then reconstituted mid-flight in a convection oven, Delta Air Lines' general manager of product development, Dan Mord, told Business Insider in an interview.\n\"We are essentially torture-testing food here,\" Mord added. \"A lot of things that work in a restaurant may simply do not work on board a plane.\"\nThe low air pressure and dry atmosphere of an aircraft pressurized to mimic the conditions at 8,000 feet of altitude also numb our ability to perceive a food's taste and texture. That explains complaints about dry and bland dishes.\nBut there are certain dishes and characteristics to seek out if you want a pleasant dining experience on a flight.\n\"Moisture in the air is what transfers the flavor and airplane air is dry,\" Mord said. \"So dishes with heavier and sweeter flavors work well at altitude.\"\nIn addition, the reheating process also threatens the moisture content and the overall texture of the food.\nDishes such as curries, braised short ribs, lamb, and pasta are good choices because their flavorful sauces help preserve the taste and texture of the meal, Delta's director of on-board services, Brian Berry, told us.\nDelta One meatballs. Delta If you are in the mood for a steak, Berry and Mord both recommend a filet mignon because of the relatively lean cut's good fat consistency.\nThe airline recently pulled a rib eye from its menu because the high fat content of the cut made the texture too tough when reheated.\nOne course that always works is dessert.\nDelta One filet mignon. Delta According to Berry and Mord, the sweetness of the dishes translates well to in-flight service and make them relatively foolproof. Plus, people like to indulge when they are on board, especially if they are in first class, Berry added.\nPopular choices include apple crisps, mini pies, tiramisu, and ice-cream sundaes. While warm desserts such as bread pudding proved to a successful offering for winter flights.\nSo there you have it. A few pointers to go by the next you order an in-flight meal.","url":"https://www.businessinsider.com/delta-airline-food-to-eat-2016-12"}
