{"authors":[],"date_download":"2018-10-30 01:00:18","date_modify":"2018-10-30 01:00:18","date_publish":"2015-05-22 00:00:00","description":null,"filename":"data/vaneerConsumption/DelusionalObamalinksclimatechangeandterrorism.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_delusional_obama_links_climate_change_and_terrorism_comments_1540861218.html","title":"Delusional Obama links climate change and terrorism","title_page":"Blog: Delusional Obama links climate change and terrorism","title_rss":"NULL","source_domain":"americanthinker.com","text":"President Obama’s assertion in his commencement address to cadets at the U.S. Coast Guard Academy that the rise of ISIS in Syria and Boko Haram in Nigeria, and the brutality of both, is somehow linked to climate change shows just how dangerously detached from reality U.S. foreign policy has become. For those who wondered why upwards of two hundred thousand have died in Syria, Boko Haram abducts Christian schoolgirls, and ISIS beheads and burns people alive in its reign of terror, the president placed a major part of the blame on fossil fuels and your SUV. I understand climate change did not cause the conflicts we see around the world, yet what we also know is that severe drought helped to create the instability in Nigeria that was exploited by the terrorist group Boko Haram. It's now believed that drought and crop failures and high food prices helped fuel the early unrest in Syria, which descended into civil war in the heart of the Middle East. Believed by whom?... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/delusional_obama_links_climate_change_and_terrorism_comments.html"}
d a pivotal role in world history, from the defeat of the Spanish Armada to Napoleon’s retreat from Moscow to the Normandy invasion and Battle of the Bulge in World War II. But it does not create tyranny and evil.\nThere was no violence, there were no beheadings, there was no burning people alive during the American Dust Bowl of the 1930s. Groups like ISIS and Boko Haram are not out foraging for food. They are poster children for the evil that lurks in the world and that advances as we retreat from our global responsibilities and indulge in these irresponsible fantasies.\nNot long ago, State Department spokesperson Marie Harf opined on MSNBC’s Hardball that the rise of terrorist groups like ISIS could be prevented by a good jobs program. “We need … to go after the root causes that leads people to join these groups, whether it’s lack of opportunity for jobs, whether …,” Harf told host Chris Matthews, who interrupted her at this point to remind her there will always be poor Muslims.\nHarf persisted, insisting that the U.S. should work with other countries “to help improve their governance” and “help them build their economies so they can have job opportunities for these people.” Harf added: “If we can help countries work at the root causes of this – what makes 17-year-olds pick up an AK-47 instead of trying to start a business?”\nAnd to think we are only a few Walmarts in Damascus and Baghdad away from world peace, or that solar panels in the Sinai will make the lion lie down with the lamb. Who knew? It is fairly certain that the burning alive of a Jordanian pilot in a cage was not caused by rising levels of carbon dioxide, and that the beheading of Coptic Christians on a beach in Libya was not caused by that coal plant in West Virginia.\nPresident Obama gets both his conclusions and his facts wrong – particularly regarding droughts and their frequency and intensity, as evidenced by the testimony of Dr. Roger Pielke before Congress, as cited by Investor’s Business Daily:\nPielke, a professor at the University of Colorado, told the Senate environment and public works subcommittee in July 2013 that droughts have \"for the most part become shorter, less frequent and cover a smaller portion of the U.S. over the last century.\" Globally, he said, \"there has been little change in drought over the last 60 years.\"\nThe fact is that global temperatures have essentially flat-lined over the last two decades. As John Fund noted in National Review last September, the only thing heating up is climate-change rhetoric:\nOne reason the rhetoric has become so overheated is that the climate-change activists increasingly lack a scientific basis for their most exaggerated claims. As physicist Gordon Fulks of the Cascade Policy Institute puts it: “CO2 is said to be responsible for global warming that is not occurring, for accelerated sea-level rise that is not occurring, for net glacial and sea-ice melt that is not occurring . . . and for increasing extreme weather that is not occurring.” He points out that there has been no net new global-warming increase since 1997 even though the human contribution to carbon dioxide in the atmosphere has risen by 25 percent since then. This throws into doubt all the climate models that have been predicting massive climate dislocation.\nAs the Cato Institute’s Patrick J. Michaels points out, President Obama’s war on coal and other draconian regulations pushed by the Environmental Protection Agency will hardly move the global temperature by any measurable amount, much less score a victory in the war on terror:\nThe EPA’s own model, ironically acronymed MAGICC, estimates that its new policies will prevent a grand total of 0.018ºC in warming by 2100… In fact, dropping the carbon dioxide emissions from all sources of electrical generation to zero would reduce warming by a grand total of 0.04ºC by 2100.\nPresident Obama genuinely believes that climate change is a greater threat than terrorism and is targeting coal plants with greater vigor than we are allegedly degrading and destroying ISIS. Look on the bright side, Mr. President. If sea levels rise high enough, maybe ISIS and Boko Haram will drown.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine, and the Chicago Sun-Times, among other publications.","url":"https://www.americanthinker.com/blog/2015/05/delusional_obama_links_climate_change_and_terrorism.html"}
