{"authors":["Nicholas Rossolillo","The Motley Fool"],"date_download":"2018-10-31 00:24:42","date_modify":"2018-10-31 00:24:42","date_publish":"2016-12-01 00:00:00","description":"Investors have been forced to grapple with big political and economic uncertainty this year.","filename":"data/vaneerConsumption/Demandfortravelremainedsteadydespiteglobaleconomicandpoliticaluncertaintyin2016.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_traveling-during-global-economic-political-turmoil-2016-2016-11_1540945482.html","title":"Demand for travel remained steady despite global economic and political uncertainty in 2016","title_page":"    Demand for travel remained steady despite global economic and political uncertainty in 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images / Irina Dobrolyubova\nOnline travel conglomerate Priceline Group reported strong results for the third quarter in early November, and the stock is once again near all-time highs.\nThe company's results fly in the face of global political and economic uncertainty, and management continues to implement its growth strategy unabated.\nBrexit and U.S. elections can't hold Priceline back\nInvestors have been forced to grapple with big political and economic uncertainty this year.\nTopping the headlines were the United Kingdom's roiling June decision to exit the European Union and the November elections in the U.S., which have left the world scrambling to figure out what the policies of a new American president will mean for global trade and relations.\nPriceline makes its money from people who travel and though people around the globe might be feeling uncertainty, which might seem like a reason to cut back on travel, the situation hasn't slowed things for Priceline, which saw accelerating growth in the late summer and early fall months.\nTotal revenue and gross profit after cost of revenue increased 19% and 22%, respectively, in the the third quarter. Net profits fell 58% from a large impairment charge related to the Open Table business. Excluding that item, profit rose 21%.\nThe year-over-year increases demonstrate the power of the travel group's technology platform and the demand for it from travelers, even as global events cause anxiety to rise. Ultimately, Priceline's growth is dependent upon its own ability to execute.\nRecent developments for new business\nThe big highlight from the third quarter was the loss from the OpenTable business, which was acquired in 2014 for about $2.6 billion. Priceline realized a loss of $941 million related to goodwill impairment, which occurs when the fair value of a business is less than the value being accounted for on the books.\nSpecific numbers for OpenTable were not given in the Priceline press release, but management said the loss resulted from a \"change in business strategy\" related to OpenTable's international expansion and \"other growth opportunities.\" OpenTable will continue to grow at a more measured pace in the years to come, management said.\nHowever, offsetting that negative item was acceleration in both room nights booked and rental-car days. Booked rooms grew 29% year over year, driven primarily by the company's largest subsidiary, Booking.com.\nThe accommodations agent is still growing its available properties, which reached 1 million worldwide this summer. New rollouts for the Booking.com platform include Booking for Business, and the addition of non-hotel accommodations like condos, apartments, and private homes.\nAP Photo/LM Otero\nGrowth of rental-car days also accelerated back into the double digits with nearly 13% year-over-year growth. Rentalcars.com faltered last quarter and posted only 8% growth, a metric that had been in the double digits for the last few years. The higher rate was welcome news, as rental cars are a key driver of Priceline's growth.\nThe KAYAK business announced its expansion into both Latin America and Asia. Booking.com will be breaking ground on new headquarters of 753,000 square feet in Amsterdam; besides increasing efficiency by bringing all staff together in one location, management feels the real estate will be a good investment for its international cash.\nWhat investors should look for next\nAfter a knockout quarter for top-line growth, Priceline management sees booked room-nights growth slowing down in the fourth quarter.\nThe primary catalyst for expansion isn't expected to suffer from global uncertainty so much; it is just a slower time of year for travel. The company sees gross profit increasing 13% to 18% in the fourth quarter, fueling a net profit increase of 14% to 20% year over year.\nThe third quarter showed \"broad-based strength, and the macro environment feels relatively healthy for us,\" CFO Daniel Finnegan said in the conference call with analysts. \"That same story has continued thus far in Q4.\"\nWith business humming along, Priceline's management is not concerned with politics, and investors shouldn't be either.","url":"https://www.businessinsider.com/traveling-during-global-economic-political-turmoil-2016-2016-11"}
