{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:31:19","date_modify":"2018-10-30 19:31:19","date_publish":"2016-06-22 04:26:20","description":"Guilty was the verdict on all 29 federal corruption charges against Democrat Rep. Chaka Fattah Sr. (PA), a lobbyist, a member of Fattah’s congressional staff, and associates on Tuesday.","filename":"data/vaneerConsumption/DemCongressmanGuiltyofBriberyFraudRacketeering.json","image_url":"https://media.breitbart.com/media/2016/06/Chacka-Fattah-NBC-0.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_21__1540927879.html","title":"Dem Congressman Guilty of Bribery, Fraud, Racketeering","title_page":"Dem Congressman Guilty of Bribery, Fraud, Racketeering","title_rss":"NULL","source_domain":"breitbart.com","text":"Guilty was the verdict on all 29 federal corruption charges against Democrat Rep. Chaka Fattah Sr. (PA), a lobbyist, a member of Fattah’s congressional staff, and associates on Tuesday.\nThe US Attorney’s Office, Eastern District of Pennsylvania announced the verdict against Fattah and associates on Tuesday afternoon.\n“Tough day,” Fattah told reporters following the verdict according to NBC10 Philadelphia. Fattah’s wife was an anchor for the news outlet until her departure in February. She was named, but not charged in the case. Fattah has held office in the U.S. Congress for 20 years with almost 12 years in the Pennsylvania legislature just prior. He became the first U.S. House of Representatives incumbent to lose his seat in the course of the 2016 primary election cycle according to Politico.\nThe 29 charges listed in the July 2015 indictment include: participating in a racketeering conspiracy, money laundering, wire fraud, bribery, bank fraud, conspiracy charges, mail fraud, false statements to financial institutions, and falsification of records.\n“As charged in the indictment, Congressman Fattah and his associates embarked on a wide-ranging conspiracy involving bribery, concealment of unlawful campaign contributions, and theft of charitable and federal funds to advance their own personal interests,” said Assistant Attorney General Caldwell upon announcement of the charges in July of last year.\nOn Tuesday Caldwell said, “Congressman Fattah corruptly abused his office for his own personal and political gain.”\nLobbyist Herbert Vederman, Fattah’s Congressional District Director Bonnie Bowser, 69-year-old Robert Brand of Philadelphia, Pennsylvania and 57-year-old Karen Nicholas of Williamstown, New Jersey were Fattah’s four associates named in the 29-count indictment.\nThe U.S. Department of Justice detailed that Fattah and associates,\nIn connection with his failed 2007 campaign to serve as mayor of Philadelphia, Fattah and certain associates borrowed $1 million from a wealthy supporter, and disguised the funds as a loan to a consulting company. After he lost the election, Fattah returned to the donor $400,000 that the campaign had not used, and arranged for Educational Advancement Alliance (EAA), a non-profit entity that he founded and controlled, to repay the remaining $600,000 using charitable and federal grant funds that passed through two other companies, including one run by Brand. To conceal the contribution and repayment scheme, the defendants and others created sham contracts and made false entries in accounting records, tax returns and campaign finance disclosure statements.\nFattah was also found guilty of entering into an agreement with a political consultant to provide federal grant funds in exchange for the consultant eliminating $130,000 in political campaign debt from Fattah’s failed 2007 bid to become mayor of Philadelphia. The consultant was directed to apply for a $15 million grant that, while Fattah had agree to work to secure for the consultant, was not ultimately awarded to that individual.\nFattah misappropriated campaign funds to pay off his son’s student loan debt in an arrangement with a political consulting company. That company is listed in the court documents as having made 34 payments to Fattah’s son’s loan for an approximate total of $23,000 between 2007 and 2011. Fattah was said to have arranged for his campaigns to make payments to the consulting company.\nFattah also communicated with both the legislative and executive branches of the government seeking to secure an ambassadorship or U.S. Trade Commission appointment for the lobbyist Vederman in exchange for cash and items of value.\n“The corruption demonstrated by Congressman Fattah and his co-defendants is yet another sad example of the type of behavior that corrodes citizens’ faith in their government,” said FBI Special Agent-in-Charge William Sweeney.\nThe criminal actions appear to run in the family. In November 2015 a federal jury convicted Fattah’s then 32-year-old son Chaka Fattah, Jr. on 22 of 23 charges of “a scheme to defraud banks, the Internal Revenue Service, and the Philadelphia School District of hundreds of thousands of dollars,” according to the U.S. Attorney’s Office, Eastern District of Pennsylvania.\nFattah, Jr. was sentenced to 60 months in prison for his crimes and ordered to pay over $1.1 million in restitution.\nHe told NBC 10 News that he wouldn’t face any prison time; however, he was taken into custody directly after the sentencing was announced. Fattah, Sr. responded to reporters, “they’ve taken my only son, and I guess they suggested this was justice.” Assistant U.S. Attorney Paul Gray said the judge agreed that evidence against Fattah, Jr. was overwhelming.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/06/21/democrat-congressman-guilty-bribery-fraud-money-laundering-racketeering/"}
