{"authors":["Kelvera At Dailymail.Com"],"date_download":"2018-10-22 23:47:21","date_modify":"2018-10-22 23:47:21","date_publish":"2017-04-26 08:37:30","description":"She was named one of Time's 100 most influential people. But that didn't stop the elements from trying to get the better of Demi Lovato on Tuesday while arriving at the Time 100 gala during a storm.","filename":"data/vaneerConsumption/DemiLovatobattlesroughweatheringownatTime100Gala.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CDAC100000578-0-image-a-17_1493187653124.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446488_Demi-Lovato-battles-rough-weather-gown-Time-100-Gala_1540252041.html","title":"Demi Lovato battles rough weather in gown at Time 100 Gala","title_page":"Demi Lovato battles rough weather in gown at Time 100 Gala | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was named one of Time's 100 most influential people.\nBut that didn't stop the elements from trying to get the better of Demi Lovato on Tuesday.\nWhile arriving at the VIP gala, the 24-year-old talent struggled against the wind and rain, leaving her uncharacteristically unkempt before her red carpet appearance.\nRainy day blues! Demi Lovato braved the elements before Tuesday's Time 100 Gala in New York\nThe Disney starlet gritted her teeth as she trudged through the storm to get to her destination.\nWalking in to the Time 100 celebration at Lincoln Center, gusts were so strong that they swept Demi's raven waves into a tangle.\nIt looked like an expletive was lingering on Demi's lips as she made her way towards the theater.\nCurse this weather! The 24-year-old starlet looked frustrated as she made her way through the rain before the upscale gala\nStorm's brewing: The Disney beauty's raven locks got twisted into wild chunks by the wind while Demi held up her skirt in an effort to keep it dry from the rainfall\nPulling up the train of her elegant Zuhair Murad gown, the star tried her hardest to keep her cobalt blue frock dry.\nThe gown's beautiful neckline left the Camp Rock beauty's cleavage vulnerable to the elements.\nNormally a red carpet necessity, Demi's heels seemed like more of an inconvenience than anything in the stormy weather.\nCleans up nicely! Demi made a swift transformation after finding shelter, emerging onto the red carpet looking polished as ever\nPicture perfect: Although the weather almost got the better of her, the Camp Rock beauty's hair was curled and her skin glowed once she finally set foot on the red carpet\nAfter finding shelter from the storm, Demi made a remarkable transformation before stepping out onto the red carpet.\nHer unkempt entrance was erased as the Confident singer emerged with perfect poise and even better style.\nThe Sonny With A Chance actress's previously tousled locks were now elegantly curled while her makeup was polished and full of glow.\n'Remarkable': Demi was named one of Time Magazine's most influential people this year. The starlet was honored by having Arianna Huffington pen her profile in the annual issue\nThis year, Demi made the list of Time's 100 most influential people along with the likes of star like John Legend, Viola Davis, Simone Biles, Ed Sheeran, James Corden, Margot Robbie, and Sarah Paulson.\nThe New Mexico native was honored by having media legend Arianna Huffington pen her profile for the annual Time Magazine issue, where shecalled Demi 'a remarkably talented artist and performer.'\n'But her courage, honesty and willingness to use her own experiences to help others are what make her a true star,' wrote Arianna.\nTime's annual 100 Most Influential People issue is on newsstands now.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446488/Demi-Lovato-battles-rough-weather-gown-Time-100-Gala.html"}
