{"authors":["Laurel Rosenhall","Dan Morain","Ben Christopher"],"date_download":"2018-10-30 22:56:37","date_modify":"2018-10-30 22:56:37","date_publish":"2015-09-14 08:00:00","description":"Sharing. It sounds so simple, but as an economic trend, sharing is a divisive issue for Democrats. Tension over the so-called “sharing economy” has been","filename":"data/vaneerConsumption/Democratstornbetweenshinynewventuresandoldschoolallies.json","image_url":"https://calmatters.org/wp-content/uploads/tech_lobbyists.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940197.html","title":"Democrats torn between shiny new ventures and old-school allies","title_page":"Democrats torn between shiny new ventures and old-school allies | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Sharing.\nIt sounds so simple, but as an economic trend, sharing is a divisive issue for Democrats.\nTension over the so-called “sharing economy” has been on full display in Sacramento, with Democrats who control the Legislature facing mounting pressure. On one side are trendy tech ventures that are gearing up their political lobbies. On the other: Democrats’ traditional allies in organized labor, who remain highly influential.\nCalifornia-based companies that allow people to make money by “sharing” their homes and cars have hit the mainstream. Uber, the smartphone-based ride-hailing service, operates in 300 cities globally. And Airbnb, a website that allows homeowners to rent a room to vacationers, now has 55 million users around the world.\nThe expansion has sparked predictable pushback from the traditional providers of rides and rooms: the taxi and hotel industries. Now union leaders are trying to convince Democrats that the trend in economic “sharing” represents a fundamental shift that will harm workers.\n“Is this the future of our economy, where you have no security of getting a regular paycheck, no security… if something happened to you on the job?” said Angie Wei, a lobbyist for the California Labor Federation.\nHer group represents several unions, including those for hotel workers and cab drivers. These old-school industries have longtime ties to many Democrats in the Legislature today. Taxi companies, for example, routinely give political donations in local races, leading to relationships with politicians who advance from city councils to seats in Sacramento. Hotel worker unions are big donors in legislative races, with one group spending $1.2 million in California during the last election cycle.\nDespite the clout, Wei worries “we’re losing on this issue. … Uber has romanced legislators [into thinking] that they are a new, innovative company and that if you oppose Uber or their model, you’re opposing innovation.”\nLegislation related to the “sharing economy” The California Legislature has debated several bills that would impact ride-sharing and home-sharing businesses like Uber and Airbnb. Here are the most significant ones from this year: AB 24 by Assemblyman Adrin Nazarian, (D-Sherman Oaks): Would require drivers for ride-share companies to go through drug and alcohol testing. Opposed by Uber, Lyft. Status: Held in committee. AB 229 by Assemblywoman Ling-Ling Chang (R-Diamond Bar): Would allow state employees to be reimbursed for using ride-sharing or home-sharing services while traveling for work. Supported by the Internet Association. Status: Passed to governor. AB 828 by Assemblyman Evan Low (D-Campbell): Would exempt ride-sharing companies from commercial license plate requirements. Supported by Uber, Lyft. Status: Held in committee. AB 1360 by Assemblyman Phil Ting (D-San Francisco): Would make it easier for ride-sharing companies to serve carpools by allowing them to split fares. Supported by Uber, Lyft. Status: Held in committee. SB 593 by Sen. Mike McGuire (D-Healdsburg): Would make it easier for cities to track which homes are used as vacation rentals through online home-sharing services and collect taxes on the transactions. Opposed by Airbnb. Status: Held in committee.\nThe Internet-based companies are relative newcomers when it comes to political influence in Sacramento. But they’re showing they can play the game:\n– Ride-sharing company Lyft began making political contributions in California last year, including $15,000 to Gov. Jerry Brown’s ballot measure committee and $4,100 to Senate President pro Tem Kevin de León (D-Los Angeles). Uber spent nearly $200,000 on lobbyists in Sacramento so far this year – more than Walmart and Bank of America, as the Los Angeles Times has noted.\n– Airbnb recently hired Chris Lehane, a well-known Democratic political consultant who worked in the Clinton White House. The company also retained its first Sacramento lobbyist this year.\n– A national trade group called the Internet Association opened a Sacramento office for the first time last year. It has hosted numerous events for California lawmakers, including a $16,000 reception at the state Democratic convention in Anaheim last spring.\nRobert Callahan, the association’s lobbyist, said lawmakers’ familiarity with internet-based brands has helped the new industry break in.\n“Legislators are waking up and searching Twitter and going on Instagram and posting on Facebook and sending Gmail. They have a personal attachment with our companies,” he said. “That helps us when we go in and say, ‘We have an issue we think you should resolve.’”\nA recent example was a bill that would allow state employees to be reimbursed for using companies like Uber and Airbnb when they travel for work. The bill sparked a heated debate between Democrats on the Senate floor last week.\n“Why does this industry deserve a special status?” said Sen. Ben Hueso (D-San Diego), who worked in his brothers’ taxi business for 15 years before he was elected. “Why do they deserve protection from the Legislature?”\nThe bill, AB 229, is now on the governor’s desk after it passed the Senate with the support of all Republicans and less than half of the Democrats.\nThe new companies don’t always get their way, though. Two bills backed by Uber stalled in the Senate committee chaired by Hueso. His spokeswoman said he plans to hold a hearing this fall to deal with ride-sharing issues more comprehensively.\nOn the home-sharing front, Airbnb fought back legislation that sought to make it easier for cities to collect taxes on vacation rentals made through web-based services.\nSen. Mike McGuire (D-Healdsburg), the bill’s author, said the trend has been a burden on his wine country community, with wild parties and public drunkenness reported at houses booked through the sites. Still, the measure stalled in a committee. McGuire said he will try again next year.\nAirbnb’s vast user network is an obstacle he’ll have to confront. Lehane said its customers flooded the statehouse this spring with more than 769,000 emails asking lawmakers to reject McGuire’s bill.\n“When people find out about issues, they really mobilize,” Lehane said. “This is a company that is, at some level, redefining capitalism.”","url":"https://calmatters.org/articles/democrats-torn-between-shiny-new-ventures-and-old-school-allies/"}
