{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:47:52","date_modify":"2018-10-30 19:47:52","date_publish":"2015-03-03 18:34:34","description":"Senior Sen. Robert Menendez (D-NJ) blasted the Obama administration’s Iran policy while delivering a speech at the AIPAC national conference.","filename":"data/vaneerConsumption/DemocratSenMenendezBlastsObamasIranPolicyatAIPAC.json","image_url":"https://media.breitbart.com/media/2015/03/Robert-Menendez-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_03__1540928872.html","title":"Democrat Sen. Menendez Blasts Obama's Iran Policy at AIPAC","title_page":"Democrat Sen. Menendez Blasts Obama's Iran Policy at AIPAC | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON — Senior Sen. Robert Menendez (D-NJ) blasted the Obama administration’s Iran policy while delivering a speech at the American Israel Public Affairs Committee (AIPAC) national conference.\nThe AIPAC crowd cheered when Menendez, the ranking member of the Senate Foreign Relations Committee, vowed to stand up for Israel even when he faces opposition from “political friends.”\n“When it comes to defending the U.S.-Israel relationship, I am not intimidated by anyone–not Israel’s political enemies, and not by my political friends when I believe they’re wrong,” declared Sen. Menendez before an enthusiastic AIPAC crowd.\n“As long as I have an ounce of fight left in me, as long as I have a vote and a say and a chance to protect the interest of Israel, the region, and the national security interests of the United States–Iran will never have a pathway to a weapon,” he later added. “It will never threaten Israel or its neighbors, and it will never be in a position to start a nuclear arms race in the Middle East. Not on my watch.”\nThe New Jersey Senator spoke minutes after President Obama’s National Security Adviser Susan Rice, who earlier in the week criticized Prime Minister Benjamin Netanyahu for accepting House Speaker John Boehner’s invitation to address Congress on March 3.\nNetanyahu’s speech, she argued, would be “destructive” to the U.S. relationship with Israel.\n“I may agree with some Democrats that the political timing of Prime Minister Netanyahu’s invitation to speak to Congress tomorrow may have been unfortunate, and that we must work fervently to keep the U.S.-Israel relationship a strong bipartisan endeavor,” said Sen. Menendez at the AIPAC national convention. “But I take issue with those who say the Prime Minister’s visit to the United States is ‘destructive’ to U.S.-Israel relations.”\nRice’s speech at the AIPAC conference was received with open disdain. The crowd applauded in favor of the policies with which she expressed disagreement.\nIn a recent interview with Reuters, President Obama downplayed the tensions over Netanyahu’s speech to Congress, saying it would not be “permanently destructive” to the U.S.-Israeli relationship.\nNevertheless, Obama strongly criticized Netanyahu’s position, emphasizing that a “substantial disagreement” exists between them on how to prevent Iran from acquiring a nuclear weapon.\nPresident Obama told Reuters that he wants Iran to verifiably freeze their nuclear activity for at least ten years.\nIsrael, throughout the P5+1 talks with Iran, has stressed that it supports dismantling Iran’s uranium enrichment capacity.\nSen. Menendez agrees with Israel, saying that simply reducing enrichment, as Obama proposes, is “not good enough.”\n“It is not a good deal if it leaves Iran as a threshold nuclear state, or if Iran decides to kick out inspectors,” said Menendez during the 2015 AIPAC conference. “It’s not a good deal if Iran proceeds on a covert path and we have no more than a year to respond. It’s not enough time for us to do anything other than exercise a military option.”\n“Let us do all we can now to get an agreement that dismantles Iran’s illicit program and ensures that it will not have to be a military response,” he added.\nMinutes earlier, Rice warned against setting conditions to completely dismantle Iran’s nuclear program, saying, “We cannot let a totally unachievable ideal stand in the way of a good deal.”\nSen. Menendez explained:\nIf what the published reports describe are true–and it is a deal where Iran remains a threshold nuclear power for the next 10 years–with the potential to build up its nuclear infrastructure–in exchange for large scale sanctions relief and access to currently frozen assets–especially in the last 5 years, that essentially makes this a 5 year deal, not a 10 year deal, let alone the 20 years we were originally seeking–if that’s the case, then we’ve gone too far toward Iran’s positions.\n“Here we are, near the end of negotiations, and the goal posts have moved from dismantlement to reconfiguration. From a peaceful nuclear program to just enough to detect break out. From no right-to-enrichment to getting an alarm system,” he later added.","url":"https://www.breitbart.com/national-security/2015/03/03/democrat-sen-menendez-blasts-obamas-iran-policy-at-aipac/"}
