{"authors":[],"date_download":"2018-10-30 20:53:39","date_modify":"2018-10-30 20:53:39","date_publish":"2018-08-08 18:47:00","description":"The press conference was held almost exactly a week after the Gwinnett County Commission voted to hold a referendum on joining MARTA in March, rather than during November's general election.","filename":"data/vaneerConsumption/DemocraticlawmakerscallforGwinnetttomoveupMARTAreferendum.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/08/Images/pedropresser.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_6ae715c2579e8e72ac95653dfcdb4f6b__1540932819.html","title":"Democratic lawmakers call for Gwinnett to move up MARTA referendum","title_page":"Democratic lawmakers call for Gwinnett to move up MARTA referendum","title_rss":"NULL","source_domain":"ajc.com","text":"A handful of Democratic lawmakers from Gwinnett held a press conference Wednesday to again question the motives behind the county commission’s decision to delay a MARTA referendum until next year — and to ask that the vote be moved to November’s general election.\nCounty leadership, meanwhile, said it’s already too late for the latter.\nState representatives Pedro Marin, Dewey McClain, Brenda Lopez and Karen Bennett, as well as a few candidates for other state and local offices, timed their press conference to be almost exactly a week after the commission’s historic — but controversial — vote.\n“Our leadership has failed us, and we need to make sure they know they failed us,” said McClain, whose District 100 includes parts of Lawrenceville and Lilburn.\nIN-DEPTH: Gwinnett’s monumental MARTA vote mirrors region’s changing attitudes\nGwinnett’s Board of Commissioners voted Aug. 1 to approve a provisional contract with MARTA to and to give voters a chance to ratify the agreement — and opt into a one-cent transit-funding sales tax — during a special election held March 19, 2019. The date came as a surprise, as leaders had indicated such a referendum would likely be held this November.\nThe backlash was immediate. Democrats and transit advocates accused the all-Republican commission of playing politics, of scheduling the transit vote for March in order to limit the Democratic turnout in November.\nCommission Chairman Charlotte Nash, who has led the charge for transit expansion in Gwinnett, has said the later referendum date was a concession made in order to get as much support from her fellow commissioners as possible. District 4 Commissioner John Heard publicly stated his opposition to MARTA prior to last week’s meeting on the issue, but ultimately voted yes.\nDistrict 3 Commissioner Tommy Hunter voted against the contract with MARTA but in favor of holding a referendum.\nGwinnett leaders delayed a vote on a referendum until next year\nThe lawmakers present at Wednesday’s press conference did not back down from their criticism. If anything, they ramped it up.\nMarin said he had “concerns about the clarity and the sincerity of the commission.” Lopez called their decision “a political compromise at the expense of Gwinnett County tax dollars.”\n“Our Gwinnett County commissioners are putting politics over people,” said Bennett, who represents part of Gwinnett’s U.S. 78 corridor.\nCounty officials have confirmed that a standalone March election would likely cost around $500,000, even before decisions are made about things like how much advance voting to offer on weekends and at locations besides the elections office.\nPrior to last week’s commission vote, Nash had said tweaks to the existing MARTA Act allowed the county to call a referendum on the issue as late as 30 days prior to an election. She had also said that, practically speaking, the referendum call for a November vote would need to be made in August.\nOn Wednesday, she offered a different view.\n“Our attorneys advised us last month that the statutory requirements governing special elections and the provisions within [regional transit legislation] HB 930 must be considered together when determining the time table for calling a referendum that will be held in conjunction with a state-wide general election,” Nash wrote in an email.\n“They further advised that, based on the special elections law, action by both the Board of Commissioners and the Board of Elections to call the referendum and the publishing of a notice of the call in the newspaper had to be done at least 90 days in advance of the election date. Thus, it is not possible now to call a referendum for November 2018.”\nWednesday marked 90 days before the Nov. 6 election.\nTransit advocates and officials alike have said they still believe the support for a MARTA referendum would be there in March. But the standalone election — which could see 20 percent of the turnout of November’s election — makes it a more tenuous proposition.\nNash said she was looking forward “to talking with the entire community about the [MARTA] contract, the transit development plan and the opportunity that Gwinnett has as we prepare for the March referendum.”","url":"https://www.ajc.com/news/local-govt--politics/democratic-lawmakers-call-for-gwinnett-reschedule-marta-referendum/dCHLgFAVnMreI4BUt3hCBP/"}
