{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:15:07","date_modify":"2018-10-30 18:15:07","date_publish":"2016-08-31 12:08:25","description":"Jorge Herrera unloaded on the Democratic Party: despite pretending they are \"all-inclusive,\" they are \"racist\" and \"don't care about us.\"","filename":"data/vaneerConsumption/DemocratsareRacistDontCareAboutUs.json","image_url":"https://media.breitbart.com/media/2016/08/Slack-for-iOS-Upload-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_31__1540923307.html","title":"Democrats are 'Racist', 'Don't Care About Us'","title_page":"Hispanic Activist: Democrats are 'Racist', 'Don't Care About Us'","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES — Jorge Herrera, 31, an American-born Hispanic activist, unloaded on the Democratic Party this week, detailing his belief that despite pretending they are “all-inclusive” and the party for minorities, in reality Democrats are “racist” and “don’t care about us.”\nHerrera told Breitbart News, “I think it’s pretty racist that the media, especially the left and the Hillary Clinton campaign, only thinks of the illegals as Hispanic. But they never talk about the illegals from the European areas and Asia. They only talk about the illegals from Hispanic countries because they are pandering and want the votes. They don’t care about us. The Hispanic and black communities are suffering.”\nHe said the way the Democratic Party retains power is by pandering to Hispanics, African-Americans and minorities. “And if you read Clinton’s college thesis, she practices Saul Alinsky’s practice of targeting minority communities.”\nHerrera, who is a member of “Latinos for Trump,” blasted Democratic leadership over Democratic National Committee (DNC) emails released by WikiLeaks, in which they referred to Hispanics as “taco bowls” (after an infamous Donald Trump tweet). “Within their leadership, they were talking about mopping up taco bowl engagement. Trump doesn’t refer to us as ‘taco bowl engagement,'” he said of Hispanics, noting that he simply has a picture of food that was created by Hispanics whom he employed and to whom he gave job opportunities.\n“The left will take any little comment and spin it into something that it’s not. And now they are referring to us as ‘taco bowl engagement,'” Herrera said. “It’s inappropriate and racist in our book. It’s not right.”\nHe added, “The whole point is, we are addressing the language of the DNC. One of the emails says that in terms of Hispanics, they look at us as a product or an object they are thinking that they can acquire.” He called the leaked DNC email “latently racist” and said the Democrats “are targeting Hispanics as a brand. Thank goodness for WikiLeaks.”\nHerrera elaborated on how his lower middle-class family’s struggles pushed him to work harder to uplift himself. On the topic of welfare, he said it is merely a tool being used by the Democratic Party to keep Hispanics and African-Americans down.\n“The minorities think they’re being helped but if you look at cities like Chicago, Baltimore and Detroit, they are proof that their handouts and entitlements don’t work.” He said the Democrats “have manipulated people. They keep people ignorant by making them think that handing them entitlement programs and welfare and benefits helps them out, economically speaking. But in reality, when you look at statistical data — Chicago, Baltimore and Detroit — they are never able to leave the ghetto and the lower socioeconomic demographic.”\nHe added:\nI was from a lower middl- class family. My parents always held full time jobs. We struggled when I was growing up and I watched my dad work two jobs to make ends meet and that’s what woke me up. They came to this country legally and it’s time for me to step it up and use the opportunity they gave me to step it up from the struggle they experienced as a lower middle-class family. I chose to go to school and now I make a living and I’m successful. I didn’t want to accept welfare. I chose to leave “the plantation.” so to speak.\nHerrera said his message to Hispanic voters is “just stop falling victim and stop listing to the mainstream media lies in terms of what Univision’s Jorge Ramos and pro-Hillary people are pushing.” He added, “It’s time for people to wake up and inform themselves of the lies of the Democratic Party and realize the Republican Party is the party that wants to support Hispanics and to wean them off the government teat.”\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/politics/2016/08/31/hispanic-activist-the-democrats-are-racist-and-dont-care-about-us/"}
