{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 21:39:54","date_modify":"2018-10-30 21:39:54","date_publish":"2016-12-08 00:44:39","description":"Democrats are calling on President Obama to pardon illegal immigrants brought to the United States as children in order to protect them from deportation under President-elect Donald Trump. | Politics","filename":"data/vaneerConsumption/DemocratsCallingonObamatoPardonIllegalImmigrants.json","image_url":"https://media.breitbart.com/media/2015/11/DREAMer-HCSO-Protest-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_07__1540935594.html","title":"Democrats Calling on Obama to Pardon Illegal Immigrants","title_page":"Democrats Calling on Obama to Pardon Illegal Immigrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democrats are calling on President Obama to pardon illegal immigrants brought to the United States as children in order to protect them from deportation under President-elect Donald Trump.\nDemocrats penned a second letter in a month with 60 signatures asking Obama to take action immediately, the Hill reported.\nLawmakers say their last letter was misinterpreted as giving legal status to participants of the Deferred Action for Childhood Actions program (DACA), which gives two-year work permits and deferred deportation action.\nLawmakers insist, however, that giving these program participants legal status is not the purpose of the pardon.\n“We clearly understand such a pardon will not grant legal status and that is not the intent of our request,” said Rep. Lucille Roybal-Allard (D-Calif.). “We are simply asking the president to protect the nearly 750,000 DACA recipients who are living in fear of immediate deportation because they trusted our government.”\nHouse Minority Leader Nancy Pelosi joined party calls for Obama to take action, and expressed her concern about a Trump administration handling DACA recipients’ information because of what she calls “hateful statements against immigrants” being made during Trump’s campaign.\n“Today, thousands of young Dreamers are stuck in a terrible limbo, left to dread the possibility of President Trump deporting them from the only home they have ever known,” she said. “President Obama should use every possible measure to protect our Dreamers and their data,” she said.\nTrump has promised to repeal all of Obama’s executive orders, including the one that established DACA.\nBreitbart previously reported that illegal aliens who signed up for DACA could be the first to be deported in the new administration because of the data the government would have on those illegal aliens living in this country.\nObama has only pardoned 70 people since taking office, but has commuted the sentences of more than 1,000 federal prisoners.","url":"https://www.breitbart.com/politics/2016/12/07/democrats-calling-on-obama-to-pardon-illegal-immigrants/"}
