{"authors":[],"date_download":"2018-10-30 14:12:24","date_modify":"2018-10-30 14:12:24","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/DemocratsUsingEveryEvilPlayintheBooktoSilenceAmericans.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208246.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_10_democrats_using_every_evil_play_in_the_book_to_silence_americans_comments_1540908744.html","title":"Democrats Using Every Evil Play in the Book to Silence Americans","title_page":"Blog: Democrats Using Every Evil Play in the Book to Silence Americans","title_rss":"NULL","source_domain":"americanthinker.com","text":"The fake news media and Democratic Party dirty tricks just keep on coming. A crazy man sent package bombs to prominent Democrats. Fake news media and the demonic Democratic Party viewed the mentally ill man's actions as a gift from the gods of liberalism. They immediately flooded the airwaves with their absurd narrative that Trump was responsible for the package bomber's behavior because he told the truth about CNN and their fellow fake news liars. Fake news media and Democrats outrageously said Americans who cheer and applaud Trump at his rallies are also responsible for the package bombs. Democrats and fake news media demand, \"Trump must tone down his rhetoric!\" Folks, Democrats and fake news pull this insidious trick over and over again. After every tragic shooting, leftists never blame the actual shooter. Democrats rush to microphones to blame every law-abiding gun-owner in America for the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2018/10/democrats_using_every_evil_play_in_the_book_to_silence_americans_comments.html"}
ot kill black people.\nLeftists attempt to exploit every incident to further their agenda and demonize everyday traditional-minded Americans. Outrageously, Democrats and fake news said Christians who spoke out against redefining marriage caused a gunman to massacre homosexuals in an Orlando night club. Omar Mateen, the shooter, was a Muslim. Christians lovingly try to lead homosexuals to Jesus. Muslims routinely execute them.\nLeftists pulled this same dirty trick on Brett Kavanaugh. They said if we did not believe Dr Ford's evidence-less accusation against Kavanaugh, we support the rape and abuse of women.\nSince winning the W.H. in 2016, Trump has been fearlessly exposing fake news media as the lying Democratic Party leftist agenda operatives they truly are. Leftists have tried every weapon in their take-out-a-Republican arsenal to tame, silence, and destroy Trump. Nothing has worked. Trump keeps telling the truth about fake news media and Democrats, educating the American people about leftists' lies and deceptions. Trump has made Americans more aware than ever.\nSo when this package bomber came along, leftists saw a golden opportunity to demand that Trump \"tone down his rhetoric,\" which is leftists' code for \"stop telling the truth about us.\"\nFolks, leftists' arrogance and blatant hypocrisy are off the chain. These people thrive on encouraging violence against anyone who dares to disagree or oppose their anti-America and anti-Christian agenda.\nI hate hearing conservative and Republican TV talking heads falling for leftists' narrative that Trump must tone down his rhetoric. How on Earth can anyone logically say Trump truthfully calling CNN fake news is equal to the bold clarion calls for violence, hateful, and divisive language coming out of leftists' Trump Resistance movement?\nPlease allow me to recap Democrats' and fake news media's hypocrisy.\nDemocrat Andre Carson said the Tea Party wants to see black people hanging from a tree. Democrats Obama and Hillary Clinton praise Black Lives Matter to the high heavens. This racist hate group boldly declared it \"open season\" on whites and cops. BLM warned white America to prepare to be \"picked off.\" Democrat Maxine Waters called for mob assaults on members of Trump's administration whenever they are seen in public. Hillary Clinton told Democrats to keep up their lawless, violent, and crazy behavior until Democrats are back in power.\nHere are more examples of leftists' attempts to generate violence against Trump and his voters who were ignored or supported by fake news media and Democrats. Snoop Dogg shot Trump in the head in his music video. Kathy Griffin held a severed bloody head of Trump. Madonna expressed her desire to blow up the White House. Neither Democrats nor fake news media denounced these obvious leftist clarion calls to enact violence against our president and his supporters.\nThe divisive, evil American left is selling its lie that the thousands of grandparents, kids, families and everyday Americans who cheer and wave U.S. flags at Trump rallies are receiving subliminal marching orders to inflict violence on media and Democrats. Folks, that is pure hogwash – another leftist tactic to silence and eventually criminalize telling the truth. Americans knowing the truth about various issues scares the heck out of Democrats and leftists.\nI pray that President Trump will continue trusting his instincts and being himself. At a recent rally, Trump asked the audience of thousands if they want him to tone down his rhetoric. The crowd responded with a loud, passionate \"No!\" The American people get it. They know fake news and Democrats' \"Trump must tone down his rhetoric\" narrative is simply another dirty trick to tame, silence, and control Trump – and also silence dissenting voices of all Americans.\nTwo years ago, my wife Mary and I met with the Conservative Campaign Committee to prepare for the midterm elections. We studied candidates to decide how best to focus our efforts to keep the GOP in control of Congress. We've been away from our West Virginia home traveling for much of the past two years. We are currently in Nevada with our Conservative Campaign Committee team, campaigning for Republican senator Dean Heller.\nBottom line, folks: Please do not allow Democrat dirty tricks to take your attention away from getting everyone you know to vote Republican on November 6.\nUpon completing this article, my wife Mary yelled to me, \"Your Facebook page has been taken down!\" Oh, well. I trust God. We must defeat these people on the left. Everyone who supports Trump's agenda must vote.","url":"https://www.americanthinker.com/blog/2018/10/democrats_using_every_evil_play_in_the_book_to_silence_americans.html"}
