{"authors":[],"date_download":"2018-10-30 14:21:00","date_modify":"2018-10-30 14:21:00","date_publish":"2016-04-01 00:00:00","description":null,"filename":"data/vaneerConsumption/DemocratsutterlyhypocriticalcriticizingGOPrhetoric.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_04_democrats_utterly_hypocritical_criticizing_gop_rhetoric_comments_1540909260.html","title":"Democrats utterly hypocritical criticizing GOP rhetoric","title_page":"Blog: Democrats utterly hypocritical criticizing GOP rhetoric","title_rss":"NULL","source_domain":"americanthinker.com","text":"Over the past weeks, the media, President Obama, and Hillary Clinton have lectured Republican presidential candidates that they should change their tone and talk about substance. Republicans are also accused of pitting groups against each other. We are also continually told that what candidates do in their personal lives should be off limits. I thought it might be helpful to examine some of what Democrats have done in the past, including the recent past. In 2000, the NAACP ran ads against George Bush showing black men being dragged behind a truck. They ran this ad implying that Bush would allow black men to be dragged because he was against hate crimes legislation. Bush supported the death penalty for the actual dragging death of James Bird. In order to win his U.S Senate race in 2004, Obama went after the personal lives of his Democrat opponent Blair Hull and his Republican opponent Jack Ryan. In both cases, David Axelrod’s former... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/04/democrats_utterly_hypocritical_criticizing_gop_rhetoric_comments.html"}
election, and then the Tribune leaked that there was an order of protection from 1998. Both Hull and his wife opposed the release of the records. The story is similar on Jack Ryan. Ryan had released his tax records and the divorce records, but both he and his ex-wife sought to keep the custody case sealed. Before the release of the Ryan records, it appeared he would handily beat Obama. Ryan dropped out of the race four days after the custody records were released. I thought personal lives were supposed to be off limits.\nIn June 2008, Obama said, “If they bring a fight, we bring a gun.” In September 2008, Obama said to his supporter, argue with people, get in their faces. I do not remember the media complaining that Obama was inciting violence.\nIt was a Clinton supporter who started the rumor that Obama was not born in America, not a Republican. The media has always pushed this as a rumor started by Republicans.\nIn 2008, when speaking to an audience in San Francisco, Obama, talking about people from small towns in the Midwest said, “And it is not surprising that they get bitter, they cling to guns or religion or antipathy toward people who aren’t like them or anti-immigrant sentiment or anti-trade sentiment as a way to explain their frustrations.” Obama was obviously stereotyping and pitting people against each other.\nThe Obama campaign accused Bill Clinton of being a racist in 2008.\nA liberal group, The Agenda Project, ran an ad in 2011 showing Paul Ryan pushing Grandma off a cliff. This ad was run repeatedly. This ad was meant to scare seniors that Republicans were going to cut off their health care and let them die.\nIn 2012, Harry Reid went to the Senate floor and without any evidence accused Romney of not paying taxes for ten years. The media was glad to report the story.\nIn 2014, the Democrats ran ads that essentially said Republicans were racists. This New York Times article says, “In the final days before the election, Democrats in the closest Senate races across the South are turning to racially charged messages – invoking Trayvon Martin’s death, the unrest in Ferguson, Mo and Jim Crow-era segregation-to jolt African Americans into voting and stop a Republican takeover in Washington.”\nIn 2015, when talking about events in Charleston, S.C., Obama told reporters that “today’s Tea Party members in the United States very closely fit the U.S. Government’s profile for domestic terrorists.” He seems to take his political opponents more seriously than he takes actual terrorists.\nIn 2015, Hillary compared Republicans to terrorist groups when she was speaking about women’s health issues.\nDuring a debate in October 2015, Hillary said she was proud of the fact that she has made enemies out of Republicans.\nCurrently, the media is glad to report on a front-page story in the National Enquirer about a rumor that Cruz has had five affairs. There are no actual facts or named women to support the story, so why have the networks covered it? There have been stories about Obama affairs and Hillary affairs on the Enquirer front page also, but somehow they have not been covered by the networks. Why?\nIt would be nice if the media reported how hypocritical it is of Obama and Hillary to claim the high ground instead of just repeating the talking points.\nThe flagrant media bias is more obvious every day.","url":"https://www.americanthinker.com/blog/2016/04/democrats_utterly_hypocritical_criticizing_gop_rhetoric.html"}
