{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:44:32","date_modify":"2018-10-30 21:44:32","date_publish":"2016-11-05 02:45:41","description":"In yet another embarrassing email to come out of the Clinton campaign messages released by WikiLeaks, Clinton campaign chief John Podesta seems to agree that Chelsea Clinton is \"not smart\" for leaking insider Clinton Foundation information to the children of George W. Bush. | Politics","filename":"data/vaneerConsumption/DemocratMemoSaysCallingChelseaClintonNotSmartisanUnderstatement.json","image_url":"https://media.breitbart.com/media/2016/11/Chelsea-Clinton-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_04__1540935872.html","title":"Democrat Memo Says Calling Chelsea Clinton 'Not Smart' is an 'Understatement'","title_page":"Democrat Memo Says Calling Chelsea Clinton 'Not Smart' is an 'Understatement' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In yet another embarrassing email to come out of the Clinton campaign messages released by WikiLeaks, Clinton campaign chief John Podesta seems to agree that Chelsea Clinton is “not smart” for leaking insider Clinton Foundation information to the children of George W. Bush.\nIn a January 2012 email, Podesta wrote to Clinton operative Doug Band and several other Clinton staffers that calling Chelsea’s loose lip merely “not smart” was a major “understatement.”\nClinton insider Doug Band had written to Podesta to complain that Chelsea was telling “one of the Bush 43 kids” about an internal investigation of financial problems inside the Clinton Foundation. Band went on to note that the “Bush kid” then told someone, who then told an operative within the Republican Party.\nBand ended his missive saying, “I have heard more and more chatter of [Chelsea]… talking about lots of what is going on internally to people.” To which he concluded, “Not smart.”\nThe email was forwarded by Podesta, Clinton’s top man, with one line added as an endorsement of Band’s concerns.\n“You are perfecting your skills for understatement,” Podesta said.\nThe email chain was sent during the time the former first daughter was working for NBC as a “special correspondent,” the job that earned her the title of the “one of the most boring people of the era.”\nChelsea later quit her $600,000 per year job, having made so few reports that by one account she made $26,724 for each minute she appeared on the air.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/11/04/democrat-memo-says-calling-chelsea-clinton-not-smart-is-an-understatement/"}
