{"authors":["Matthew Boyle"],"date_download":"2018-10-30 17:50:31","date_modify":"2018-10-30 17:50:31","date_publish":"2018-10-30 15:35:35","description":"Democrats admit their mistreatment of now Supreme Court Justice Brett Kavanaugh harmed their chances in the midterm elections.","filename":"data/vaneerConsumption/DemocratsAdmitKavanaughMistreatmentBackfiringinMidterms.json","image_url":"https://media.breitbart.com/media/2018/09/Schumer-grasping-anti-kavanaugh-rally-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30__1540921831.html","title":"Democrats Admit Kavanaugh Mistreatment Backfiring in Midterms","title_page":"Democrats Admit Kavanaugh Mistreatment Backfiring in Midterms","title_rss":"NULL","source_domain":"breitbart.com","text":"Democrat strategists are now publicly admitting that the Senate Democrats’ mistreatment of now Supreme Court Justice Brett Kavanaugh harmed their chances in the midterm elections. The damage hit both their once-long-shot-but-now-virtually-non-existent odds at retaking the Senate and their very real shot at retaking the House.\n“The Kavanaugh hearings did set us back, but it depended on geography,” Democrat pollster Ben Tulchin said in an on-record quote to Politico for a piece published Tuesday. Tulchin argued that Democrats were hurt in rural and suburban areas by the way they treated Kavanaugh, while bolstered in inner cities they were already set to win, saying “the more upscale districts, where we’ve done well all cycle, it was to our benefit there, and in more downscale districts with rural pockets, it was a challenge.”\nPolitico, in its piece, summarizes just how bad the polling shifted against Democrats in the wake of the Kavanaugh hearings:\nAfter the Kavanaugh hearings, public and private polling in Iowa, North Carolina and West Virginia did show Republicans regaining ground in a slate of districts deep in Trump country. Rep. Rod Blum (R-Iowa) got $1 million in TV air cover from Congressional Leadership Fund, the House GOP-aligned super PAC, after initially being written off by national Republicans. Polls conducted by the New York Times and Siena College showed Rep. Mike Bost (R-Ill.) jumping out to a 10-point October lead after being tied with his Democratic opponent in September.\nInterestingly, the Politico piece is headlined: “Dems regain momentum in final days of battle for House.” But, if anything, the evidence contained throughout the story–which was filed from North Carolina’s ninth congressional district, where Republican Dr. Mark Harris faces Democrat Dan McCready–shows the exact opposite.\nDemocrats seem to have been caught off guard by the awakened GOP base post-Kavanaugh confirmation, energy President Donald Trump and Republicans have been keen to keep alive. “This will be the election of the Kavanaughs and the caravans,” Trump said during a Charlotte rally, referencing his newly confirmed Supreme Court Justice and the caravan of thousands of prospective illegal aliens bearing down on the U.S. border with Mexico right now.\nIn North Carolina, where Trump campaigned last week, there were three GOP-held seats considered to be within range of potential Democrat pickup before the Kavanaugh situation. In the ninth district, McCready was bearing down on Harris–who defeated incumbent GOP Rep. Robert Pittenger (R-NC) in a primary earlier this year–Republicans were particularly worried. But in the 13th district, Rep. Ted Budd (R-NC) faces a stronger-than-expected Democrat challenge as does Rep. George Holding (R-NC) in the second district. Those two, particularly the second district, seem to have swung back in the GOP’s direction per recent polling, leaving the ninth district as the state’s main battleground.\nHere’s a key excerpt from the Politico piece explaining the ninth district race from McCready’s perspective:\nMcCready acknowledged that the race is “dead even” in remarks he delivered to two-dozen campaign volunteers at his campaign office, where the walls are decorated with homemade signs declaring “Trust Dan’s Moral Compass” and “Send in a Marine.” And the National Republican Congressional Committee is airing its first TV ads in the district in the last week of the election, spending nearly $800,000 in a late bid to keep the district. But the House seat McCready and Harris are battling over — a gerrymandered boomerang stretching from the Charlotte suburbs along the conservative rural border counties splitting North and South Carolina — arguably never should have been competitive in the first place. Democrats have not mounted a major challenge for the district before, and Trump remains popular there after carrying the district by 11 percentage points in the presidential election.Yet McCready has vowed not to support House Minority Leader Nancy Pelosi for speaker and has run on his Marine and business background, and he has consistently outraised Harris, allowing the Democrat to saturate the district with TV ads sounding nonpartisan themes. “I think people in North Carolina feel that those hearings were another example of how broken Washington is now,” McCready said in an interview. “For me, putting country over party, Democrats and Republicans working together, that’s the leadership we need right now.”\nPolls currently have the race all over the place, and it remains to be seen what happens. But one of McCready’s own volunteers–who claims to be an independent despite working for the Democrat candidate–sums it up succinctly by saying he thinks McCready is “the underdog” and does not feel good about his own candidate’s chances.\n“I’m a little nervous because it feels like the momentum has shifted, and McCready feels like the underdog,” Mike Stieglitz, a Southwest Charlotte man and “an unaffiliated voter” who volunteers for the Democrat’s campaign, told Politico. “To me, it’s the fear that’s pushing everyone apart.”","url":"https://www.breitbart.com/politics/2018/10/30/democrats-admit-kavanaugh-mistreatment-backfiring-in-midterms/"}
