{"authors":["Ben Shapiro"],"date_download":"2018-10-30 20:10:41","date_modify":"2018-10-30 20:10:41","date_publish":"2015-09-23 00:38:44","description":"Senate Democrats protected Obama from having to veto a bill that would have made abortion illegal after the 20th week of fetal development.","filename":"data/vaneerConsumption/DemocratsProtectAbortionPast20WeeksShoutYourAbortionTrends.json","image_url":"https://media.breitbart.com/media/2015/09/abortion-activists-at-roe-v-wade-anniversary-washington-dc-march-for-life-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_22__1540930241.html","title":"Democrats Protect Abortion Past 20 Weeks, #ShoutYourAbortion Trends","title_page":"Democrats Protect Abortion Past 20 Weeks, #ShoutYourAbortion Trends | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday, Senate Democrats protected President Obama from having to veto a bill that would have made it illegal to murder an unborn child after the 20th week of fetal development.\nSenate Republicans proposed the Pain Capable Unborn Child Protection Act, pointing out that children can feel tremendous pain as they are dismembered or poisoned in the womb. Senate Democrats didn’t let the act come up for a vote, with just three Democrats supporting the bill itself. Approximately 18,000 children are killed every year after the 20th week of development. Children can survive outside the womb at 22 weeks.\nNaturally, Democrats have celebrated ecstatically. 2016 Democratic presidential frontrunner Hillary Clinton said in July that any attempts to stop abortions after 20 weeks were “extreme and unacceptable.” On Sunday, Clinton said, “I think the kind of late-term abortions that take place are because of medical necessity… This gets back to whether you respect a woman’s right to choose or not.”\nTo choose what? The definition of human life? Because it is incredibly difficult to argue that a baby after 20 weeks is not a baby, yet Hillary and her fellow Democrats believe that child should be killed anyway.\nApparently, the answer is a resounding yes: Democrats and their allies believe that women get to redefine human life based on their personal convenience. That’s why vaunted leftist hero Sen. Elizabeth Warren (D-MA) labeled the rejected bill an “assault” on women—but not the actual assault of chopping up the heads of babies.\nDemocrats continue to label efforts to save the unborn a “war on women,” even as they declare a war on the most innocent creatures on the planet. You don’t have to be a woman to fight against abortion any more than you had to be a slaveholder to fight against slavery. Moral evils ought to be fought.\nBut Democrats fight on behalf of such evils.\nMeanwhile, on Twitter, feminists celebrated abortion with the trending hashtag #ShoutYourAbortion, encouraging women to tell their beautiful stories of killing their own children to the world. Activist Amelia Bonow, who launched the hashtag, explained herself thusly:\nPlenty of people still believe that on some level – if you are a good woman – abortion is a choice which should [be] accompanied by some level of sadness, shame, or regret. But you know what? I have a good heart and having an abortion made me happy in a totally unqualified way. Why wouldn’t I be happy that I was not forced to become a mother?\nBonow obviously doesn’t have a good heart—her writing is proof of that. No pro-life person “forces” a woman to become a mother, any more than murder laws “force” unhappy wives not to kill their husbands. Our moral default is not that you get to redefine other human beings so as to “choose” what to do with them and then call it self-definition.\nNonetheless, the hashtag trends. Fellow activist Lindy West tweeted, “My abortion was in ’10 & the career I’ve built since then fulfills me & makes me better able to care for kids I have now. #ShoutYourAbortion.” Presumably her current kids are lucky she didn’t decide to work those extra hours for a raise, or they would have been sucked into a sink somewhere.\nAnother online user tweeted that she had had three abortions, but that her “shame and silence ends today.” Using abortion as birth control: it’s the new leftist agenda.\n#ShoutYourAbortion should be the new Democratic party slogan. In accepting his nomination at the Democratic National Convention in 1996, then-President Bill Clinton said, “Abortion should not only be safe and legal, it should be rare.” But clearly that was a lie: Democrats don’t care whether abortion is rare. Why should they? If it’s merely a life choice with no moral content, why insist upon its scarcity? No one says that receiving an appendectomy should be “safe, legal, and rare.” And in recent years, Democrats have removed the mask, championing abortion culture as a moral good, mainstreaming a completely immoral act.\nAnd the babies continue to die. They suffer, they feel pain, and they end their lives desperately thrashing in the wombs of the women who should be their greatest protectors—all because the media insist on euphemisms from which Democrats benefit. Euphemisms are the last resort of the morally obtuse; “abortion” is a euphemism, “termination” is a euphemism, and “pro-choice” is a euphemism. Those euphemisms end in death.\nBen Shapiro is Senior Editor-At-Large of Breitbart News and The New York Times bestselling author, most recently, of the book, The People vs. Barack Obama: The Criminal Case Against The Obama Administration (Threshold Editions, June 10, 2014). Follow Ben Shapiro on Twitter @benshapiro.","url":"https://www.breitbart.com/politics/2015/09/22/democrats-protect-abortion-past-20-weeks-shoutyourabortion-trends/"}
