{"authors":["Neil Munro"],"date_download":"2018-10-30 19:04:55","date_modify":"2018-10-30 19:04:55","date_publish":"2015-12-19 07:01:21","description":"Democrat Leaders Dance, Gloat, Declare Speaker Paul Ryan 'Gave Away The Store'","filename":"data/vaneerConsumption/DemocratsDeclareSpeakerPaulRyanGaveAwayTheStore.json","image_url":"https://media.breitbart.com/media/2015/12/GettyImages-500444262-schumer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_18__1540926295.html","title":"Democrats Declare Speaker Paul Ryan 'Gave Away The Store'","title_page":"Democrats Declare Speaker Paul Ryan 'Gave Away The Store'","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic leaders are unanimous in declaring a complete victory over House Speaker Paul Ryan and his close allies, who wrote the $1.1 trillion omnibus budget without asking House conservatives for any input — or even for some public objections to help their closed-door negotiations.\nThe Democrats’ victory, and Republican Ryan’s defeat, was garishly displayed when his omnibus got more Democratic votes in the House and in the Senate than it got Republican votes.\n“I said I would not accept a lot of [conservative] ideological riders that were attached to a big budget deal,” President Barack Obama said Friday, at his end-of-year press conference. “And because of some terrific negotiations by the Democrats up on Capitol Hill and I think some pretty good work by our legislative staff here… it was a good win,” he said. “We met our goals,” he said.\nIn 2015, “we wanted to get rid of sequestration, we were able to do that,” gloated the Democrats’ leader in the Senate, Sen. Harry Reid. “We wanted to make sure there is parity between defense and the middle class, we wanted to make sure that we kept these poison pills off the legislation… All three goals we had, we accomplished,” he said. Ryan’s omnibus deal “caps off a successful year for Senate Democrats,” he added.\n“Well, if you would’ve told me this year that we’d be standing here celebrating the passage of an omnibus bill, with no poison pill riders, at higher [spending] levels above sequesters than even the president requested, I wouldn’t have believed it, but here we are,” Democratic Sen. Chuck Schumer told reporters shortly after the $1.1 trillion omnibus bill was passed.\n“Almost anything, the Republican leadership in the Senate achieved this year, they achieved on Democratic terms… Democrats had an amazingly good year,” he declared.\nOver in the House, the Democrats’ upbeat press conference began with laughter, according to the transcript.\n(Leader Pelosi. Good morning, everyone. Good morning. I know you’re out there. I see you. [Laughter] Some of you, for the second time this morning – thank you for coming by. We’re very pleased to say that today, we delivered sweeping victories for hard-working American families. The Omnibus bill makes vital investments that will create jobs, strengthen our future and grow the paychecks of American people… We passed the best possible, under the circumstances, appropriations bill… the Republicans’ obsession with lifting the oil-export ban, they really gave away the store. Democrats were able to strip scores and scores of poison pills, destructive poison pills, some of which they had to have, which they ended up with not having… it is a monumental improvement… But again, we feel very, very good about what it is.… and thank the Speaker for his cooperation.\nYou can watch it all here, including the claim by Maryland Rep. Steny Hoyer, the Democrats’ deputy leader, that “this was an extraordinarily big victory.”\nThe Washington Post scored the results, and kindly give only 10 victories to the Democrats, and then four to Ryan.\nAt his press event, Ryan claimed a victory, but had little evidence to prove his point. “Today, the House came together to ensure our government is open and working for the American people,” he said in a statement. “This bipartisan compromise secures meaningful wins for Republicans and the American people, such as the repeal of the outdated, anti-growth ban on oil exports,” said the statement.\nWhat did he trade to get that one win? — “scores and scores of poison pills, destructive poison pills, some of which they had to have, which they ended up with not having,” according to Pelosi.\nSo Ryan claimed “meaningful wins,” but very few of them.\n“The legislation strengthens our military and protects Americans from terrorist threats, while limiting the overreach of intrusive government bureaucracies like the IRS and the EPA,” he said, weakly, before changing the subject by promising to do better in 2016. “Congress can now move into 2016 with a fresh start and a plan to return to regular order in order to better protect taxpayer dollars,” he claimed.\nOn the Michael Medved radio show, Ryan defended stepped up his claims — with a stronger adjective, but not more evidence.\nWe scored major policy wins for conservatives—for our country—in this bill. We advanced our principles. Did we advance all of our principles as far as we want to go? No, because we’re in divided government. But we did advance them in the right direction. So the way I look at these things, is take what you can get now, and then go fight for more later. And I think we’ve set ourselves up for more success in 2016.\nRyan didn’t tout one of the most unpopular inserts in the bill — the GOP-approved legislation to import up to 200,000 extra foreign workers to take American’s blue-collar jobs.\nRyan’s main claim to success was the removal of the barrier to the export of crude oil — and to get that win, he gave up a huge list of conservative priorities.\n“If you take a look at what’s in this bill, at what this bill actually does, it has a permanent lift—a permanent removal—of the ban on petroleum exports, on crude oil exports. That’s something we’ve been trying to do for 40 years in this country. Think of what we get by removing the ban. And the Obama administration, on oil exports—when America can export its oil, that means we can compete with OPEC. We can put OPEC out of the business of controlling the world’s oil markets. We can take Putin out of business with respect to selling oil and gas to his customers. We can create more jobs. We can become more independent. We can keep our prices low by having more control over the marketplace and create more jobs right here in America. It’s fantastic for our foreign policy. It’s really good for American jobs. And it’s something we’re actually getting done that we haven’t been able to do for decades.”\nThe commenters on his website tend to disagree with Ryan’s claim of “meaningful wins.”\n“Ryan… just spit in the face of his constituents,” said one. “Why vote Republican? The Democrats claim this bill as a great victory for their priorities and party! Did Republicans cut the budget? NO,” said the next commenter. “And they wonder why Trump is beating them. I suppose now that they’ve funded all of Obama’s priorities through 2018, they can play “Pretend Opposition Party” in 2016 and hope we’ll forget how they boned us,” said the next comment.\nMany GOP politicians — especially the roughly 100 Representatives and Senators who voted against the deal — are very unhappy, including Sen. Tom Cotton, who posted this statement on his website:\nA rotten process yields a rotten result, and this 2,000-page, trillion-dollar bill is rotten to its core, resulting from secret, backroom negotiations and getting dumped in the dead of the night on Americans with barely two days before the vote. Corporate lobbyists had a field day, but working Americans lost out. Take just one sordid example: this bill will quadruple the number of foreign guest-worker visas at a time when millions of Americans are still looking for full-time work and working-class wages remain stagnant.\nAt the Senate Democrats’ press conference, Schumer gloated at length and in great detail, unlike Ryan. He’s always worth listening to, if only because he’s expected to take over Sen. Reid’s leadership position in January 2017.\nThis bill is a great victory for the principles Democrats stand for. And as we look back in the year of the Senate, I think there have been three major trends, two of which are getting noticed, but the third is getting overlooked. First, the Senate is getting things done. Second, we are getting them done, because Democrats are not obstructing the same way Republicans did when they were in the minority, and those two points have been talked about in the media and elsewhere. But third, the point that has been missed is that the bills were passing reflect Democratic values. We are getting, even though were in the minority, we are passing a program that we have been for all along. Today’s omnibus vote is a metaphor for that. The vote marks the end of the road the Democrats began mapping out last spring. When Republicans made clear they were going to try to jam through partisan appropriation bills through the senate. [GOP] Senator [Mitch] McConnell thought he could jam the defense appropriation bill through, but Democrats stood firm and blocked him. Sen. McConnell said over and over again he wants to stay at sequestration levels. He said over and over again, that he wanted to put much more money into defense than into the nondefense. He didn’t get either of those, and we said the opposite, and we got what we wanted. The relief from devastating cuts knowns as sequestration, the relief that was equal, no poison pill riders, the three principles Democrats laid out, Republicans opposed, are all laid out, are all in that bill today. The bill were passing today, passes the test of Democratic values with flying colors and fits the framework we laid out years ago. And if you need any proof of this, look what happened on the floor a few minutes ago. Senator McConnell offered an amendment to strip out the omnibus portion of the bill, and a majority of Republicans voted for it. They don’t like it. But, our strategy worked. And the idea that we’d let people know that if the government was shut down, it would be because of their intransigence, maybe both Speaker Ryan and Leader McConnell understand that they couldn’t shut down the government and that meant they couldn’t make unreasonable demands and that meant we were going to have a budget with Democratic priorities. But it’s not just the budget. This has happened over and over again, take the transportation bill. Democrats demanded a long-term bill with increased investments. Republicans wanted a short term bill with flat funding. What’d we get? A long term bill with increased investments. How about the Export-Import bank? Senator McConnell said, no. Most of the Republicans said, no. We now have an export import bank. How about when Republicans sought to hold hostage funding [in early 2015] for the Department of Homeland Security and Democrats banded together to fully fund the department and protect the president’s order on immigration. And finally, the bill that Ranking Member [Democrat Sen. Patty] Murray mentioned the Education Bill, loaded with Democratic values, attempts to switch the funding formula, attempts to do all of these other things, didn’t happen. So, anything, almost anything, the Republican leadership in the Senate achieved this year, they achieved on Democratic terms. By sticking together, as we have been, we’ve been unified under Harry Reid’s leadership, by fighting for the middle class, which we have focused on like a laser, while Republicans carry the water for the special interests; Democrats had an amazingly good year, as a minority party. We can only hope that our Republican colleagues will be as a cooperative minority, as we were this year, when Democrats take back the senate in 2016.\nIn comparison, Ryan only declared “This bipartisan compromise secures meaningful wins for Republicans and the American people, such as the repeal of the outdated, anti-growth ban on oil exports.”\n“And I think we’ve set ourselves up for more success in 2016,” he says.","url":"https://www.breitbart.com/politics/2015/12/18/democrat-leaders-dance-gloat-declare-speaker-paul-ryan-gave-away-store/"}
