{"authors":["Associated Press"],"date_download":"2018-10-22 22:21:49","date_modify":"2018-10-22 22:21:49","date_publish":"2017-03-16 03:24:17","description":"BIG SUR, Calif. (AP) - Demolition work has resumed on a crumbling bridge along the California coast that has stranded residents in the popular Big Sur area...","filename":"data/vaneerConsumption/DemolitionresumesonCaliforniascrumblingBigSurbridge.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/03/wire-226139-1489634666-871_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318754_Demolition-resumes-Californias-crumbling-Big-Sur-bridge_1540246909.html","title":"Demolition resumes on California's crumbling Big Sur bridge","title_page":"Demolition resumes on California's crumbling Big Sur bridge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BIG SUR, Calif. (AP) - Demolition work has resumed on a crumbling bridge along the California coast that has stranded residents in the popular Big Sur area and closed part of iconic Highway 1.\nDepartment of Transportation spokesman Jim Shivers says crews are using a wrecking ball to bring down Pfeiffer Canyon Bridge. He says they may need to continue their work Thursday.\nA giant crane dropped a 6,000-pound wrecking ball on the span for about three hours Monday, but it only gently tapped the unstable bridge.\nDamage to the Pfeiffer Canyon Bridge on Highway 1 is seen in Big Sur, Calif., Wednesday, March 15, 2017. Demolition of the bridge, damaged by heavy rains, resumed Wednesday. The loss of the bridge has stranded residents and denied access to tourists in the popular Big Sur area and closed part of iconic Highway 1. (AP Photo/Haven Daley)\nHeavy rain damaged the bridge beyond repair, stranding more than 400 residents on one side. Helicopters are bringing in food, and people can use a footpath to cross the divide.\nCaltrans said it will take at least nine months to rebuild the bridge.\nDamage to the Pfeiffer Canyon Bridge on Highway 1 is seen in detail in Big Sur, Calif., Wednesday, March 15, 2017. Demolition of the bridge, damaged by heavy rains, resumed Wednesday. The loss of the bridge has stranded residents and denied access to tourists in the popular Big Sur area and closed part of iconic Highway 1. (AP Photo/Haven Daley)","url":"https://www.dailymail.co.uk/wires/ap/article-4318754/Demolition-resumes-Californias-crumbling-Big-Sur-bridge.html"}
