{"authors":[],"date_download":"2018-10-30 01:06:30","date_modify":"2018-10-30 01:06:30","date_publish":"2016-02-13 00:00:00","description":null,"filename":"data/vaneerConsumption/DemocratprimariesSovietstyle.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_02_democrat_primaries_soviet_style_1540861590.html","title":"Democrat primaries: Soviet style","title_page":"Democrat primaries: Soviet style","title_rss":"NULL","source_domain":"americanthinker.com","text":"Democrat primaries: Soviet style\nYour name is Hillary Clinton. You run for president. Six different dead-locked precincts tossing tie-breaking coins all fall your way. Per Las Vegas odds makers, six consecutive appearances of heads-or-tails is a statistical probability of 1.5%. That's 64-to-1 against, an exceedingly lucky outcome. For Democrats, there is no hand-wringing, no equivalent \"hanging chads\" controversy. Unlike Bush/Gore in 2000 in Florida, there are no recounts demanded, no cadre of lawyers dispatched to Iowa, no lawsuits filed. Mrs. Clinton claimed victory before all the results were tallied, ultimately managing a microscopic victory of four delegates. That's people, not percentage points. (Does she know something the rest of us don't?)\nIn New Hampshire, Bernie Sanders – an avowed Socialist who took his blushing bride to Russia for their honeymoon – gave Madame a real shellacking by 22 percent. A Donald Trump-like primary performance. That translates into 15 delegates for him to her 9. However, despite the Iowa virtual tie and the clear New Hampshire win, it turns out today that Bernie's been burnt. That's because in the all-important delegate count – the convention electors who ultimately select the Democrats' presidential nominee – she leads him going into Clinton-friendly South Carolina 394 to 44. Nonexistent in the Republican Party for the very good reason that they can easily thwart the voters' intentions, the discrepancy lies in little-understood Democrat super-delegates. These are the \"important\" people, party insiders like Bill Clinton (no nepotism there). Instituted in 1982 – no doubt due in large part to Ronald Reagan's landslide 1980 victory over unpopular incumbent Jimmy Carter – super-delegates are designed to prevent brokered conventions and their result: weak or insurgent candidates. They make up 712, a whopping 30% of the 2,382 delegates needed to secure the Democratic nomination. Importantly, unlike with Republicans, the Democrats' modern election \"process\" is ironically autocratic, not democratic. Super-delegates may ensure a unified decision-making process, but it is top-down and based upon the party's stamp of approval rather than a generalized expression of whom the voters want. In this way, a top-down process is antithetical to the traditional bottom-up process the Founding Fathers intended: common people choosing informed electors who in turn choose the nominee. But it's worse than that. Super-delegates beholden to no one – save the party itself – make this nominating process inherently corrupt, based upon backroom dealing completely removed from the American people's influence. Case and point is New Hampshire. With two uncommitted, six of the eight super-delegates support Hillary. That evens the scale in the contest to a tie of 15 apiece. Indeed, months before a single vote was cast, Hillary started the race with 15% of the total she needs. Simply put, Hillary wins even though she loses. Super-delegates prove that the fix is in; the creeping Clinton coronation is actually in full swing. Likewise, the MSM-moderated debates are a complete sham – extended political commercials peppered with softball questions. In the final analysis, how is this at all different from Russia when Vladimir Putin is the only name on the ballot? Apparently untroubled, debate handshaking Bernie comfortably plays his role in this \"Democratic\" farce that guarantees Hillary the nomination. David L. Hunter is on Twitter and blogs at davidlhunter.blogspot.com. He has previously been published in multiple in The Washington Post, The Washington Times, and FrontPage Mag, and extensively in Canada Free Press and American Thinker.","url":"https://www.americanthinker.com/blog/2016/02/democrat_primaries_soviet_style.html"}
