{"authors":[],"date_download":"2018-10-30 01:00:41","date_modify":"2018-10-30 01:00:41","date_publish":"2018-07-11 00:05:01","description":null,"filename":"data/vaneerConsumption/DemocraticLitmusTestsAbortionandNothingButAbortion.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Keep_Abortion_Legal_-_Protest_against_Focus_on_the_Familys_“Stand_for_the_Family”_event_15188351973.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861241.html","title":"Democratic Litmus Tests: Abortion and Nothing But Abortion","title_page":"Democratic Litmus Tests: Abortion and Nothing But AbortionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"There was a time in American history when people did not look to the Supreme Court to decide the legality of abortion. That didn’t stop Americans from debating the issue. By 1973, many states were liberalizing their laws. Even Ronald Reagan proved less than doctrinaire when he signed legislation dramatically loosening restrictions on abortion in the Golden State.\nAbsent judicial intervention, this process would have continued, state-by-state. National organizations might have joined local struggles, but no one would have been disenfranchised. Having lost a fair political battle, pro-lifers probably would not have developed the urgency, anger, and even fanaticism that sometimes characterized the later movement.\nHowever, in Roe v. Wade the Court casually made a decision which ranks among the high court’s most controversial. The 7-2 majority included Nixon appointee and Chief Justice Warren Burger. Opposed were only William Rehnquist and Byron White.\nThe justices appeared to believe that they would resolve the controversy and allow America to move on. Even the dissenters did not appear to grasp the gravity of the majority’s decision. Instead of quieting debate, the Court created one of the angriest and most bitter political feuds in American history. In 1992 the justices tried again, revising Roe to keep the practice legal while allowing increased restrictions. In Planned Parenthood v. Casey the high court acknowledged the “intensely divisive controversy” that had resulted, but rather than accept responsibility for its arrogant assertion of de facto legislative power, the Court plurality called on “the contending sides of a national controversy to end their national division by accepting a common mandate rooted in the Constitution.”\nHowever, Roe was controversial precisely because it really wasn’t about constitutional law. It continued a process of discovering grand new doctrines in the Constitution’s emanations and penumbras. The opinion read like a legislative report, dividing abortion into trimesters and detailing what the state could do during each period. Even my liberal constitutional law professor, who was no shrinking violet when it came to judicial activism, admitted that he couldn’t defend Roe as a constitutional decision, though he liked the policy outcome.\nUnsurprisingly, Republican critics insisted that the ruling should be overturned. During Ronald Reagan’s 1980 presidential run Democrats criticized the GOP platform for setting opposition to Roe as a litmus test. Outrageous! Imagine, insisting that a bad constitutional decision be overturned!\nToday, of course, Democrats love litmus tests. None is more basic than fealty to Roe. While pragmatic Democrats recognize the importance of appealing to people who are on the economic left but pro-life, hard-line activists insist on absolute loyalty. Even if it means killing a late term baby capable of surviving on its own. No matter how advanced, life cannot be recognized as an interest worthy of protection.\nMoreover, this precedent, and this one alone, is to stand for all time no matter what. The Left is all for overturning the historic conception of marriage. Well-settled protections for religious liberty. Any limitation on the reach of government. And so much more, including, of course, recognition that states can legislate on abortion. Toss them all overboard.\nBut not Roe.\nSen. Susan Collins explained that she would oppose a nominee committed to overturning Roe “because that would indicate an activist agenda that I don’t want to see a judge have.” That is, we should celebrate when activist judges make up new laws. Then we should insist that those who believe in the Constitution turn the new liberal interpretations into bedrock precedent. In the name of judicial deference, of course.\nThe starting point for considering a Supreme Court case should be whether the decision is correctly decided. If not, the obvious response should be to reverse or modify it, absent a good reason to the contrary. Jurists typically look at “reliance interests,” how have people behaved in response to the decision.\nStare decisis obviously is important in cases with broad economic impact, such as contract and tax law, upon which individuals and companies rely. By the time court membership had changed and another case was brought, most everyone would have adapted to the contested ruling. Without stability and certainty, it is hard to conduct business. Imagine investing when important economic policies changed every couple of years.\nA petition to overturn Obergefell v. Hodges would raise similar concerns. Millions of people will have acted in reliance on the legalization of same-sex marriage. However, there aren’t many rulings in this category. Roe certainly is not. (Actually, Roe no longer is the law, since it was modified by Casey.) Nor would even a full reversal result in abortion being illegal. States would have to enact new laws, and most Americans would remain reasonably close to a state which allowed abortion, preserving access, even if getting there became more costly and inconvenient. Moreover, as pharmaceutical research continues, pills increasingly may replace doctors in performing abortions.\nAbortion activists proclaim Roe to be a super-precedent because of politics, not jurisprudence. Most Supreme Court cases don’t resonate with voters and animate a sizable share of the electorate. Roe was a highly political decision and thus retains substantial popular support.\nIn fact, there are few cases less suited to being treated as sacred and untouchable than Roe. The opinion was awful, reflecting the reigning liberal zeitgeist rather than constitutional jurisprudence. Moreover, the majority failed to grapple with the essential issue: the value of life. While a baby — which is, after all, what we are talking about — may not be a “person” under the Constitution, it still could constitute an important, even “compelling” interest in the view of state governments. If so, that could warrant restricting or banning abortion.\nThis is the standard applied to racial discrimination. In general, the Constitution bans distinctions based on race. Laws can discriminate, but only if they advance a “compelling state interest.” Which means government must have a very good reason.\nOne could take a similar perspective toward abortion. The Constitution generally constrains government in limiting individual liberty. Interfering with a birth decision is a substantial abrogation of Americans’ basic freedoms. But does government have a compelling state interest in preventing some, many, or all abortions?\nAt least in Casey the Court recognized that abortion concerned more than one person, acknowledging the state’s “important and legitimate interest in potential life.” Surely the protection of life is an important value. Surely the unborn are alive. Surely at some point, one has advanced sufficiently on the continuum of life to be treated as the moral equivalent of a person. Yet, strangely, the Left, which routinely preens as defending the helpless and disadvantaged, has trouble imagining that children short of birth have any value.\nMoreover, real “choice” is exercised when deciding to have sex, not to abort a baby. Except in the case of rape (including sex with someone of diminished capacity who can’t consent), people choose to engage in an activity which might result in a baby, despite one’s best efforts otherwise. Having done so, is there then any responsibility for actions voluntarily taken? To answer yes does not mean one is a killjoy seeking to punish the sinful. Rather, it affirms the principle that freedom requires accountability. Which in this case means dealing with a baby.\nCertainly some abortion advocates do anything possible to dismiss the reality that babies have the potential to become people. One of the stranger attacks on the pro-life movement recently came from psychologist Valeri Tarico, who compared protection of the unborn to fascination with zombies (which “look like people even though they aren’t”). Really. Perhaps her article was a draft screenplay gone awry.\nWhile claims of the slippery slope are common and often overdone, treating life as a throwaway creates fearsome precedents. For instance, the Washington Post ran an article advocating the killing (okay, “abortion”) of babies with Down syndrome. After all, it “was not the child I wanted,” declared columnist Ruth Marcus. No word about what the child wanted. In fact, moral philosopher Peter Singer previously justified the right of parents to kill their severely disabled kids.\nBaby girls have died en masse worldwide because of this mindset. Males are viewed as more productive in poorer, especially agricultural, societies. Culture makes females costly to marry off and encourages wives to move in with their husbands’ families. So abortion and infanticide often have been used to enforce a preference for boys. By one count there are 130 million missing women worldwide. Does gendercide liberate women?\nWhile Western societies continue to set a bright life line at birth, even that principle is under attack. In Brazil, some Amazon tribes require (not just allow) families to kill children judged to lack souls (including the disabled and twins). This odious practice is violation of the most fundamental moral principles. However, some Brazilians have defended the tribes and opposed outlawing their practices. For instance, the National Indian Foundation declared that prohibiting infanticide “is in many cases an attempt to incriminate and express prejudice against indigenous peoples.” If we can’t prohibit the arbitrary killing of helpless children, what moral absolutes can we agree on?\nRestricting abortion is a significant limit on individual liberty and should never be undertaken lightly. Yet freedom does not exist in a vacuum. Without life there is no liberty. The decision to end another’s life, even “merely” potential, is freighted with moral consequences. If the state has a legitimate interest in doing anything, protecting lives and potential lives of those incapable of defending themselves would seem to be one.\nNo longer on the Left, however. President Bill Clinton once declared that abortion should be “safe, legal, and rare.” Today, however, what Democrat is willing to admit that abortion is not a good, let alone the preferred option? Any hint of disapproval has disappeared from the Democrats’ lexicon. Pro-life Democratic congressmen have become legislative unicorns. For the extremists who determine the Left’s political agenda, a dead baby appears to have become the symbol of liberation. Only those who believe in an unrestricted right to kill to be “a common mandate rooted in the Constitution” are believed suitable to sit on the Supreme Court.\nIronically, Roe’s formal reversal would be a Democratic political windfall. Today Republicans rally to overturn the decision. Then it would be angry Democrats organizing to return the favor. In fact, even a more conservative court, with Brett Kavanaugh the likely newest member, probably would further adjust rather than formally overturn Roe, largely for political reasons.\nJudges once were chosen for their qualifications, not their political views. The battle over Robert Bork’s nomination changed everything. The key to Kavanaugh’s confirmation is that he has said nothing to displease or embarrass Republican moderates. Such became the process once courts become the de facto third house of the legislature. Republicans are playing the judicial game according to the Democrats’ rules.\nDoug Bandow is a former Special Assistant to President Ronald Reagan. He is a graduate of Stanford Law School and member of the California and D.C. bars.","url":"https://spectator.org/democratic-judicial-litmus-tests-abortion-and-nothing-but-abortion/"}
