{"authors":[],"date_download":"2018-10-30 01:20:57","date_modify":"2018-10-30 01:20:57","date_publish":"2018-08-01 00:05:21","description":"Democrats dreaming of a liberal peak this November, should also remember the valleys.","filename":"data/vaneerConsumption/DemocratsMustWorryLiberalsWontShowAgain.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Chuck_Schumer_at_protest_32328519331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862457.html","title":"Democrats Must Worry Liberals Won’t Show Again","title_page":"Democrats Must Worry Liberals Won’t Show AgainThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Democrats dreaming of a liberal peak this November, should also remember the valleys. In efforts to keep the left ginned up, there is more at stake than just maximizing an upside. Democrats must also worry about downsides — both liberals’ and their own. In the past, liberals have failed to deliver; should this happen again, the Democratic establishment faces a double loss.\nConventional wisdom is that President Trump has given Democrats a winning lottery ticket, in the form of liberal outrage. Democrats have only to cash it in this November. With liberal energy only seeming to climb, the one remaining question is how much the ticket will pay out.\nThe problem with today’s conventional wisdom is its contradiction by historical evidence. In each of the last three midterm elections — 2006, 2010, and 2014 — liberals as a percentage of voters have fallen from their previous presidential level.\nNo other ideological group has been so fickle. Moderates have fallen in two of the last three (gaining in 2006), while conservatives have gained in two of the last three — falling only in 2006. On average, liberals and moderates have fallen 1.7 percent in midterms, while conservatives have gained 2.7 percent.\nLiberals’ poor midterm performance is particularly problematic because they are also America’s decided ideological minority. Over the last three midterm elections, liberals have averaged just 21 percent of the electorate. In contrast, moderates and conservatives are almost twice as large — moderates averaging 42 percent and conservatives 37 percent in those three midterms.\nJust how much of a concern this should be for Democrats can be gauged three ways. At best, they can only mitigate, not eliminate, the worry.\nFirst is from what baseline this decline is measured. Liberals were 26 percent of 2016’s voters. If their last three midterms’ 1.7 percent average decline is subtracted, they fall to 24.3 percent of 2018’s voters. If liberals’ last three midterms’ average percentage of voters, 21 percent, is used, then liberals would drop 5 percent in 2018.\nSecond is the disproportionate support levels liberals and conservatives give to Democrats and Republicans, respectively. In 2016, 84 percent of liberals voted for Clinton, while 81 percent of conservatives voted for Trump. These high support levels mean each party feels a disproportionate impact from movements in these groups’ participation.\nFinally is the fact that over the last three midterms, liberals’ and conservatives’ average movements have been in opposite directions. The electoral impact has therefore not been just liberals’ significant decline on Democrats, but the combined impact of conservatives’ increasing too. Liberals’ 1.7 percent average decline and conservatives’ average 2.7 percent average increase create a potential 4.4 percent midterm gap for Democrats.\nIf this gap seems small, consider that Clinton’s 2016 popular vote win over Trump was just over two percentage points. And she still decisively lost the electoral college vote. The point is twofold: Small popular vote percentages do matter, and Republicans’ territory yields a better electoral impact with the popular votes they get.\nAs Democrats trumpet liberals’ energy, there is more than upside maximization involved; there is downside minimization too. Certainly, the Democrat establishment have obvious reasons for both. They also have a less obvious one.\nLiberals have put the Democratic establishment in an unenviable situation. If liberals underwhelm this November, the Democratic establishment is poised to take the blame, despite past precedent.\nAny liberal drop will be attributed to the Democratic establishment’s failure to motivate: How it squandered the left’s momentum, two years in the building. It will be said the establishment forced its candidates on liberals — just as it did with Hillary in 2016. It will be lambasted for running poor campaigns — just as Clinton has been. And it will be accused of being too timid and not confrontational enough — just as the left has already been doing.\nWhat is certain is where blame will not lie: With liberals themselves. Democrats are too dependent on them.\nThis sets up a potentially vicious cycle. If liberals fail to show up again this November, Democrats perform below expectations and their establishment gets the blame. Liberals then become even more disengaged from the establishment and the conventional process.\nNovember presents Democrats with three worries. They must worry liberals fail to vote in the numbers expected — again. They then must worry about losing the left. And finally if liberals do break from past pattern and show up, the Democratic establishment will be beholden to them like never before. And the left will know it all too well.","url":"https://spectator.org/democrats-must-worry-liberals-wont-show-again/"}
