{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:04:38","date_modify":"2018-10-30 19:04:38","date_publish":"2017-03-06 23:59:50","description":"Two Democrat California legislators filed a request with the federal government seeking “information about recent Department of Homeland Security (DHS) policies and Immigration and Customs Enforcement (ICE) activities.”","filename":"data/vaneerConsumption/DemocratCALawmakersFishingIntoRecentDHSPoliciesICEActivities.json","image_url":"https://media.breitbart.com/media/2017/03/532424328.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_03_06__1540926278.html","title":"Democrat CA Lawmakers Fishing Into ‘Recent DHS Policies, ICE Activities’","title_page":"Democrat CA Lawmakers Fishing Into ‘Recent DHS Policies, ICE Activities’","title_rss":"NULL","source_domain":"breitbart.com","text":"Two Democrat California legislators filed a request with the federal government seeking “information about recent Department of Homeland Security (DHS) policies and Immigration and Customs Enforcement (ICE) activities.”\nOne of the assemblymen recently said during a hearing on a bill to make California a sanctuary state that “half his family” was in the country illegally and were “eligible for deportation.”\nThese lawmakers write, “In recent weeks there was an apparent surge in ICE enforcement activities in California.” They say they “urgently need this information in order to inform our colleagues in the California Legislature and the public at large about the activities of ICE.”\nThe California officials reason that they are entitled to this information because “it is our responsibility as representatives of the people of California to ensure that we have full information regarding the activities that are happening in our state.” They add, “California is home to 5.4 million non-citizen residents,” and “74 percent of all noncitizens live in a household that also includes citizens.” “All of these parents and children are potentially at risk of separation at the hands of ICE. To set the community’s fear to rest, much greater clarity is needed about what ICE’s enforcement policies, procedures, and priorities will be going forward.” They ask for “expedited processing” of their document requests.\nAmong recent ICE activities alleged, the Democrat officials site a woman, the mother of two U.S. citizens, who was deported “for the crime of using a fake Social Security number to find work after eight consecutive years in which she checked in with ICE annually per their orders.”\nCalifornia Senate President Pro Tem Kevin Léon (D-Los Angeles) and Speaker of the Assembly Anthony Rendon (D-Southeastern Los Angeles County) filed the extensive Freedom of Information Act (FOIA) request.\nDe Leon and Rendon seek the production of “all ICE records created or transmitted on or between January 20, 2017, and February 20, 2017” that pertain to national or California ICE field office policies regarding:\nICE enforcement activity at or around churches, schools, hospitals, medical clinics, community centers, courts, and government offices;\nthe access those detained may have with lawyers, community organizations, elected officials or members of the public; and\npolicies regarding ICE treatment of individuals registered under the Deferred Action for Childhood Arrivals (DACA) program if they are present during an ICE operation targeting non-DACA immigrants.\nAn official with ICE provided a link to the DHS website and said that current ICE policy directs agency personnel to avoid conducting enforcement activities at “sensitive locations” unless they have prior approval from an appropriate supervisory official or there are exigent circumstances. These areas include churches and hospitals.\nIn addition, their FOIA request asks for documents relating to the “Implementation, including sanctuary jurisdictions, as described in the Executive Order signed January 25, 2017, and entitled ‘ENHANCING PUBLIC SAFETY IN THE INTERIOR OF THE UNITED STATES.’”\nThe California officials also want documentation relating to “ICE enforcement activities undertaken by ICE field offices in California on or between February 1, 2017, and February 20, 2017,” that address:\nwhether these ICE enforcement activities were planned before January 20, 2017;\nfigures reflecting the number and types of violent crimes claimed by ICE to have been committed by those detained;\nthe locations of the activities by the California field offices during these time periods;\nrecords that show how many people were detained, deported, and the timing of their deportations; and\nhow many detained in these operations claimed protection under the DACA program.\nThe California lawmakers refer to the February 20 memorandum issued by DHS Secretary John F. Kelly titled “Enforcement of the Immigration Laws to Serve the National Interest.”\nBreitbart News reported that this memo and another memo entitled “Implementing the President’s Border Security and Immigration Enforcement Improvement Policies” “end[ed] President Barack Obama’s catch-and-release border policies.”\nAs reported the memos directed officials at DHS to: deport illegal border crossers while their appeals for entry are pending; prosecute illegal aliens who hire human traffickers to bring their children into the U.S., and to initiate an expedited repatriation process for any illegal alien who has been in the U.S. for more than two years. The memorandums also make clear that state and local jurisdictions will work with ICE agents in a partnership under the 287(g) program. The program was effectively neutered by the Obama administration, as reported by Breitbart Texas.\n“Aliens granted deferred action from deportation who are subsequently found to pose a threat to national security or public safety may have their deferred action terminated at any time and DHS may seek their removal from the United States. This includes those who have been arrested or convicted of certain crimes. Since the start of the Deferred Action for Childhood Arrivals program in 2012, approximately 1,500 recipients have had their deferred action terminated due to a criminal conviction, gang affiliation, or a criminal conviction related to gang affiliation,” ICE officials said in a statement obtained by Breitbart Texas.\nOfficials with ICE also provided a fact sheet of an ERO (Enforcement Removal Operations) expanded enforcement operation conducted in the Los Angeles area last month. The operation, reported by Breitbart California’s Michelle Moons, resulted in a total of 161 illegal aliens were taken into custody during the first week in February. The arrests were made during a five-day enforcement operation by ICE agents “targeting at-large criminal aliens, illegal re-entrants, and immigration fugitives.” Of those arrested, 151, or 94 percent, had prior criminal convictions.\nOfficials say the operation “targeted public safety threats, such as convicted criminal aliens and gang members, and individuals who have violated our nation’s immigration laws, including those who re-entered the country after being deported and immigration fugitives ordered deported by federal immigration judges.” The majority of the 154 men/seven women arrested were from Mexico (121), but 31 were from Central American countries, and two each were from China and Jamaica, and one each was from Philippines, Australia, Brazil, Israel, and South Korea.\nLaw enforcement officials do not provide advance information about an agency’s planned enforcement actions to avoid compromising operational security and officer safety.\nBreitbart Texas’ Bob Price reported on February 20 that Secretary Kelly authorized the hiring of an additional 10,000 ICE agents and enforcement officers. Kelly instructed the director to begin the process of hiring these officers immediately.\nThe actions taken by the newly appointed DHS secretary deliver on President Donald Trump’s campaign promises to increase immigration enforcement and deport illegal aliens who have committed crimes against Americans.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/local/2017/03/06/democrat-ca-lawmakers-fishing-recent-dhs-policies-ice-activities/"}
