{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:23:10","date_modify":"2018-10-30 19:23:10","date_publish":"2015-01-27 01:23:48","description":"Feinstein's move is largely seen as an extension of President Obama's belief that Iran's nuclear program is being used solely for \"peaceful purposes\" and the approach of diplomacy to negotiate a resolute end.","filename":"data/vaneerConsumption/DemocraticSenatorsIntroduceResolutiontoBlockSanctionsonIran.json","image_url":"https://media.breitbart.com/media/2015/01/Feinstein.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_26__1540927390.html","title":"Democratic Senators Introduce Resolution to Block Sanctions on Iran","title_page":"Democratic Senators Introduce Resolution to Block Sanctions on Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"Sens. Dianne Feinstein (D-CA) and Chris Murphy (D-CT) introduced a resolution on Monday to counter one placed forth by Sens. Bob Menendez (D-NJ) and Mark Kirk (R-ILL) and which would prevent the immediate implementation of additional sanctions on Iran should talks fail. Feinstein’s move is largely seen as an extension of President Obama’s belief that Iran’s nuclear program is being used solely for “peaceful purposes” and the approach of diplomacy to negotiate a resolute end.\nIn a written statement, Feinstein explained that her resolution finds it “appropriate for Congress to swiftly pass sanctions” if, and only if, negotiations with Iran fail “or if Iran violates any agreement.” The resolution stands in stark contrast with the bill co-authored by Menendez and Kirk which would immediately impose new sanctions against Iran if the talks fail by the June 30 deadline. Menendez’s bill will be presented to the Senate Banking Committee on Thursday.\n“For those who agree that the sanctions bill in the Banking Committee is detrimental, this resolution provides an option in support of diplomacy,” Feinstein wrote. Co-author Sen. Murphy cited “a comprehensive diplomatic agreement” as being the “best way to prevent Iran from developing a nuclear weapon.” He also stated that passing a bill for new sanctions prior to the conclusion of talks with Iran “would be counterproductive.”\n“But this resolution makes clear that if Iran walks away from the table, or if talks fall through because they’re no longer negotiating in good faith, the United States will not hesitate to respond with debilitating new sanctions,” Murphy wrote.\nThe White House has expressed its disapproval of Menendez’s bill, suggesting it could derail talks with Iran which the president believes have helped to scale back Iran’s nuclear program. Not only has Iran not scaled back its nuclear production, the Islamic Republic announced the addition of two two new nuclear plants last week. Additionally, Iran has in at least five ways explicitly violated the interim agreement placed forth in the nuclear talks. Menendez is the highest ranking Democrat on the Senate Foreign Relations Committee.\nFollow Adelle Nazarian on Twitter: @AdelleNaz.","url":"https://www.breitbart.com/politics/2015/01/26/dem-senators-introduce-counter-resolution-to-block-immediate-sanctions-on-iran/"}
