{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:26:47","date_modify":"2018-10-30 18:26:47","date_publish":"2018-06-28 22:30:50","description":"Rep. Katherine Clark (D-Mass.), Sen. Chris Murphy (D-CT), Gabby Giffords' gun control group, and other Democrats began calling for gun control before the facts in the Annapolis newspaper shooting were even known.","filename":"data/vaneerConsumption/DemocratsCallforGunControlBeforeFactsKnowninAnnapolisShooting.json","image_url":"https://media.breitbart.com/media/2018/06/wi/ap/28/34f4bb_shootings-newspaper-20374-maryland-police-officers-patrol-area-multiple-e1530224788243.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_28__1540924007.html","title":"Democrats Call for Gun Control Before Facts Known in Annapolis Shooting","title_page":"Democrats Call for Gun Control Before Facts Known in Annapolis Shooting | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Katherine Clark (D-MA), Sen. Chris Murphy (D-CT), Gabby Giffords’ gun control group, and other Democrats began calling for gun control before the facts in the Annapolis newspaper shooting were even known.\nWith no report of the identity of the attacker, and even before the number of dead and wounded had been confirmed, Giffords’ group already tweeted, “A summer intern shouldn’t have to tweet for help. We must do better. We must never stop fighting to end gun violence.”\nMinutes later they followed with a second tweet:\nReporters shouldn't have to hide from bullets while doing their jobs. This is not normal. We have a problem in this country, and we have to do something about it. #Annapolis https://t.co/uNpi3h7JLc — Giffords (@GiffordsCourage) June 28, 2018\nRep. Clark followed the Giffords’ group, tweeting:\nAbsolutely heartbroken. I stand with those impacted (once again) by mass gun violence. Congress must stop sidestepping this American epidemic and act- NOW. #Annapolis https://t.co/sjWhLxpZqn via @nbcnews — Katherine Clark (@RepKClark) June 28, 2018\nThen Sen. Chris Murphy tweeted, implying Congress somehow encourages such acts by refusing to pass more gun control:\nPulling for everyone at the Capital Gazette. Horrible. So awful that my colleagues still don't understand their unconscionable silence has become a green light for would-be shooters, who perceive inaction as endorsement. — Chris Murphy (@ChrisMurphyCT) June 28, 2018\nBut in reality, Maryland has some of the more stringent gun controls in the country. Those controls include an “assault weapons” ban, a “high capacity” magazine ban, a bump stock ban, and gun violence restraining orders. (Such orders began to be pushed as a way to prevent mass public shootings following the May 23, 2014, Santa Barbara, California, attack.) The Baltimore Sun reports that Maryland also has a “licensing system that requires prospective handgun buyers to provide their fingerprints and undergo training.”\nYet before the identification or motive of the Annapolis attacker had been revealed—and before specifics on the weapon used had been reported—Democrats were calling for more gun control.\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.","url":"https://www.breitbart.com/politics/2018/06/28/democrats-call-gun-control-before-facts-known-annapolis-shooting/"}
