{"authors":[],"date_download":"2018-10-22 21:45:09","date_modify":"2018-10-22 21:45:09","date_publish":"2016-11-16 00:00:00","description":"David Greene talks to Neera Tanden, president of the progressive think tank Center for American Progress, about how the Democratic Party regroups after losing the presidential election.","filename":"data/vaneerConsumption/DemocratsMustReconnectWithWhiteWorkingClassVotersTandenSays.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=502274790_1540244709.html","title":"Democrats Must Reconnect With White Working-Class Voters, Tanden Says","title_page":"Democrats Must Reconnect With White Working-Class Voters, Tanden Says : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nWe have been listening to Democrats think through the road ahead. Neera Tanden leads the Center for American Progress, a left-leaning think tank. She's been a close adviser to Hillary Clinton and also to President Obama. And I asked her if she thinks the party has work to do reconnecting with the working-class voters who went for Donald Trump this time around.\nNEERA TANDEN: Well, I agree that we need a economic and political reform message that addresses the needs of working-class voters of all colors, not just the white working class, but working families who happen to be people of color as well. So...\nGREENE: Economic political reform message - that sounds like political speak. Like, what exactly would that mean?\nTANDEN: A better, sharper message that addresses the economic concerns of working-class families. I also think that this election was in part a repudiation of the status quo in Washington. And as progressives, we need to have a message that responds to both concerns. People are obviously concerned that this economy isn't working for them. And I think people are - were very frustrated - are very frustrated with Washington's inability to solve problems.\nGREENE: So I asked Tanden whether that frustration from voters was causing her to rethink how some might see her organization. Do you worry that even an organization like yours sort of embodies this image of the liberal elite that working-class voters see? I mean, people in Washington, at a think tank, coming up with solutions but not really getting out there, nitty gritty, and helping people when they feel like they're suffering.\nTANDEN: You know, what I would say to that is that the work we're proudest of is to raise issues like how raising the minimum wage is a challenge for all families, and it's really a challenge in this economy.\nGREENE: And now for another issue; Tanden had a hand in crafting the Affordable Care Act, Obamacare as it's known. And I asked her if Democrats would join with a Republican White House and Congress in an overhaul of that law if that helps to save some of it.\nTANDEN: President Obama has said over the last five years he's willing to talk to any Republican about how to fix the law. You know, the challenge has been Republicans have been hellbent on tearing the law out from its roots. I think any Democrat would sit down with any Republican and try to address fixes to the law. At the same time, what we're looking at is throwing 20 million people off health care. And that is - that is a big challenge that Democrats have to respond to.\nGREENE: But what if under a revamped Republican version, those 20 million kept their coverage, but the law was no longer considered an Obama achievement?\nTANDEN: If there's a solution here and they want to rename it, I'm happy if they want to call it Trumpcare (laughter) and people keep their coverage. That's - this is not an issue about credit. This is an issue about who - you know, people who have insurance and are deeply anxious they're going to lose it. And if we can reform the law so it works more effectively and people keep their coverage, that's fantastic. But our deep anxiety is that that is not what's - what's unfolding on Capitol Hill.\nGREENE: That's Neera Tanden, president of the Center for American Progress, a left-leaning think tank.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=502274790"}
