{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:20:47","date_modify":"2018-10-30 19:20:47","date_publish":"2015-08-04 19:56:35","description":"Dem Senators Push 'CECIL Act' To Bar Import Of Trophy Animals","filename":"data/vaneerConsumption/DemocratSenatorsPushCECILActtoBarImportofTrophyAnimals.json","image_url":"https://media.breitbart.com/media/2015/08/ap_ap-photo10-1024x698.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_08_04__1540927247.html","title":"Democrat Senators Push 'CECIL Act' to Bar Import of Trophy Animals","title_page":"Democrat Senators Push 'CECIL Act' to Bar Import of Trophy Animals | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Amid the anti-trophy hunting hysteria sweeping certain parts of the country following the death of Cecil the Lion, Democrat senators have introduced the Conserving Ecosystems by Ceasing the Importation of Large (CECIL) Animal Trophies Act.\nAlthough the act overlooks the fact that hunting serves as a key part of conservation, the measure surely receives applause from people outraged over the idea of hunting to begin with.\nAccording to Time, bill sponsor Senator Bob Menendez (D-NJ) said, “Let’s not be cowardly lions when it comes to trophy killings.” He said the CECIL Act is “a necessary and prudent step that creates a disincentive for these senseless trophy killings and advances our commitment in leading the fight to combat global wildlife trafficking.”\nThe CECIL Act is co-sponsored by Senators Cory Booker (D-NJ), Richard Blumenthal (D-CT), and Ben Cardin (D-MD).\nDelta airlines took unilateral action on August 3 by banning the shipment of big-game trophy animals anywhere in the world. Breitbart News reported that Delta ordered the immediate implementation of a ban on “lion, leopard, elephant, rhinoceros and buffalo trophies worldwide as freight.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/sports/2015/08/04/democrat-senators-push-cecil-act-to-bar-import-of-trophy-animals/"}
