{"authors":["Associated Press"],"date_download":"2018-10-23 03:58:44","date_modify":"2018-10-23 03:58:44","date_publish":"2017-03-16 15:09:15","description":"WASHINGTON (AP) - Democrats predictably slammed President Donald Trump's Thursday budget request, which mixed increases for the military and border security...","filename":"data/vaneerConsumption/DemocratsslamTrumpbudgetGOPoffersfaintpraiseornone.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229137-1489676960-420_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320624_Democrats-slam-Trump-budget-GOP-offers-faint-praise-none_1540267124.html","title":"Democrats slam Trump budget, GOP offers faint praise or none","title_page":"Democrats slam Trump budget, GOP offers faint praise or none | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Democrats predictably slammed President Donald Trump's Thursday budget request, which mixed increases for the military and border security with remarkable austerity for many domestic programs. Perhaps more telling, however, was the reaction from Republicans, who gave it polite praise or none at all.\nHere's a sampling:\nREPUBLICANS\nCopies of President Donald Trump's first budget are displayed at the Government Printing Office in Washington, Thursday, March, 16, 2017. Trump unveiled a $1.15 trillion budget on Thursday, a far-reaching overhaul of federal government spending that slashes many domestic programs to finance a significant increase in the military and make a down payment on a U.S.-Mexico border wall. (AP Photo/J. Scott Applewhite)\nSenate Majority Leader Mitch McConnell, R-Ky.: \"I'm pleased to see an increased focus on our national security and veterans budgets. These are positive steps in the right direction. I look forward to reviewing this and the full budget when it is released later this spring.\"\nHouse Speaker Paul Ryan, R-Wis.: \"I welcome the president's blueprint for next year's budget, which turns the page from the last eight years .... I look forward to reviewing this with the Appropriations Committee and our entire conference.\"\nHouse Armed Services Committee Chairman Mac Thornberry, R-Texas.: \"The Administration's budget request is not enough to repair that damage and to rebuild the military as the President has discussed.\"\nDEMOCRATS\nHouse Leader Nancy Pelosi, D-Calif: \"President Trump is not making anyone more secure with a budget that hollows out our economy and endangers working families. Throwing billions at defense while ransacking America's investments in jobs, education, clean energy and lifesaving medical research will leave our nation weakened.\"\nSenate Minority Leader Charles Schumer, D-N.Y.: \"The President's proposed budget cuts are devastating to the middle class. Once again the Trump administration is showing its true colors: talk like a populist but govern like a special interests zealot. This budget shifts the burden off of the wealthy and special interests and puts it squarely on the backs of the middle class and those struggling to get there.\nRep. Nita Lowey, N.Y., top House Appropriations Democrat: \"The $1.4 supplemental request for Homeland Security to construct a wall on the southern border is a nonstarter - it would be a multi-year, multi-billion dollar boondoggle. This unjustified request is based on nothing more than a campaign promise.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4320624/Democrats-slam-Trump-budget-GOP-offers-faint-praise-none.html"}
