{"authors":["Associated Press"],"date_download":"2018-10-23 00:48:09","date_modify":"2018-10-23 00:48:09","date_publish":"2017-03-10 07:49:07","description":"SEATTLE (AP) - In stepping up legal challenges to President Donald Trump's revised travel ban, Democratic attorneys general are trying to use the court...","filename":"data/vaneerConsumption/DemocraticAGsstepuplegalfightagainstTrumptravelban.json","image_url":"https://i.dailymail.co.uk/1/2017/03/11/01/wire-198995-1489195765-181_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300304_Democratic-AGs-mount-fight-against-Trump-travel-ban_1540255689.html","title":"Democratic AGs step up legal fight against Trump travel ban","title_page":"Democratic AGs step up legal fight against Trump travel ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEATTLE (AP) - In stepping up legal challenges to President Donald Trump's revised travel ban, Democratic attorneys general are trying to use the court system to thwart the executive branch in the same way their GOP counterparts did under President Barack Obama.\nWashington state Attorney General Bob Ferguson said Thursday he was asking a federal judge to find that his order last month halting the old travel ban applies to the new one, too.\nFerguson's action came a day after Hawaii launched its own lawsuit. Washington, Minnesota, Oregon, New York and Massachusetts planned to file a new complaint challenging the revised travel ban Monday. Maryland Attorney General Brian Frosh announced in a statement Friday that Maryland plans to join the lawsuit filed by Washington state.\nWashington State Attorney General Bob Ferguson speaks at a news conference about the state's response to President Trump's revised travel ban Thursday, March 9, 2017, in Seattle. Legal challenges against Trump's revised travel ban mounted Thursday as Washington state said it would renew its request to block the executive order. It came a day after Hawaii launched its own lawsuit, and Ferguson said both Oregon and New York had asked to join his state's legal action. (AP Photo/Elaine Thompson)\n\"My message to President Trump is: Not so fast,\" Ferguson said.\nFerguson and his fellow Democratic attorneys general are now doing what Republicans did when Obama was in office - filing lawsuits to block policies. Republican attorneys general took Obama to court over a variety of issues, most notably his health care legislation.\nAttorneys general are the chief lawyers for state governments and can sue more broadly on behalf of their states. Most are elected and can act independently of their legislatures or governors, although Ferguson, for example, has the support of Washington Gov. Jay Inslee, also a Democrat.\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen. It also temporarily shuts down the U.S. refugee program.\nUnlike the initial order, the new one says current visa holders won't be affected, and removes language that would give priority to religious minorities.\nHawaii Attorney General Doug Chin said that the state could not stay silent on Trump's travel ban because of Hawaii's unique culture and history. Hawaii depends heavily on tourism, and the revised ban would hurt the state's economy, he said.\nThe courts need to hear \"that there's a state where ethnic diversity is the norm, where people are welcomed with aloha and respect,\" Chin said.\nIn the original lawsuit targeting the first ban, Ferguson said it was unconstitutional and hurt the state's businesses and universities.\nFerguson said it's not the government, but the court, that gets to decide whether the revised order is different enough that it would not be covered by previous temporary restraining order.\n\"When a court enjoins a defendant from implementing policies, the defendant cannot evade that injunction simply by reissuing the same basic policies in a new form,\" Washington state Solicitor General Noah Purcell said in the state's new court filing. \"Courts do not issue injunctive relief in a game of whack-a-mole, forced to start anew at a defendant's whim.\"\nWhite House spokesman Sean Spicer said Thursday the administration believed the revised travel ban will stand up to legal scrutiny.\n\"We feel very confident with how that was crafted and the input that was given,\" Spicer said.\nFerguson said he was pleased other that attorneys general had sought to take part in the legal action. On Thursday, the Seattle judge granted Oregon's request to join Washington and Minnesota in the case opposing the travel ban; New York and Massachusetts say they'll also join the case.\nAll of those states except Pennsylvania and Iowa were won by Trump's Democratic challenger, Hillary Clinton, in last year's presidential election.\n\"We have a strong case and they are willing to join our efforts,\" Ferguson said of his fellow Democrats. New York Attorney General Eric Schneiderman in a statement called the executive order \"a Muslim ban by another name.\"\nOther states that have filed briefs supporting Washington's initial lawsuit include California, Connecticut, Delaware, Illinois, Iowa, Maine, Maryland, New Mexico, Pennsylvania, Rhode Island, Vermont and Virginia.\n___\nSinco Kelleher reported from Honolulu. Associated Press writers Tarek Hamada in Phoenix and Gene Johnson in Seattle contributed to this report.\nHawaii Attorney General Douglas Chin speaks at a news conference Thursday, March 9, 2107, in Honolulu. Chin's office filed an amended lawsuit against President Donald Trump's revised travel ban. (AP Photo/Marco Garcia)\nWashington State Attorney General Bob Ferguson listens to a question at a news conference the state's response to President Trump's revised travel ban Thursday, March 9, 2017, in Seattle. Legal challenges against Trump's revised travel ban mounted Thursday as Washington state said it would renew its request to block the executive order. It came a day after Hawaii launched its own lawsuit, and Ferguson said both Oregon and New York had asked to join his state's legal action. (AP Photo/Elaine Thompson)\nWashington State Attorney General Bob Ferguson smiles when asked a question at a news conference about the state's response to President Trump's revised travel ban Thursday, March 9, 2017, in Seattle. Legal challenges against Trump's revised travel ban mounted Thursday as Washington state said it would renew its request to block the executive order. It came a day after Hawaii launched its own lawsuit, and Ferguson said both Oregon and New York had asked to join his state's legal action. (AP Photo/Elaine Thompson)\nWashington State Attorney General Bob Ferguson, right, arrives for a news conference about the state's response to President Trump's revised travel ban with Solicitor General Noah Purcell, left, and Civil Rights Unit Chief Colleen Melody, Thursday, March 9, 2017, in Seattle. Legal challenges against Trump's revised travel ban mounted Thursday as Washington state said it would renew its request to block the executive order. It came a day after Hawaii launched its own lawsuit, and Ferguson said both Oregon and New York had asked to join his state's legal action. (AP Photo/Elaine Thompson)\nFILE - In this Feb. 9, 2017 file photo, a security camera warning sign is seen at the Muslim Association of Hawaii in Honolulu. The state of Hawaii has become the first state to sue to stop President Donald Trump's revised travel ban. Attorneys for the state filed the lawsuit Wednesday, March 8, 2017, in federal court in Honolulu. The state had previously sued over Trump's initial travel ban, but that lawsuit was put on hold while other cases played out across the country. (AP Photo/Jennifer Sinco Kelleher, File)\nFILE - In this Feb. 3, 2017, file photo, Hawaii Attorney General Doug Chin speaks at a news conference in Honolulu announcing the state of Hawaii has filed a lawsuit challenging President Donald Trump's travel ban. The state of Hawaii has become the first state to sue to stop Trump's revised travel ban. Attorneys for the state filed the lawsuit Wednesday, March 8, 2017, in federal court in Honolulu. The state had previously sued over Trump's initial travel ban, but that lawsuit was put on hold while other cases played out across the country. (AP Photo/Audrey McAvoy, File)\nIsmail Issack, father of Miski Shalle, 11, and Muzamil Shalle, 14, embraces his children as their mother Halima Mohamed, far left, looks on as they reunite for the first time in seven years at John F. Kennedy International Airport in New York Wednesday, March 8, 2017. The parents, who have been living in Mechanicsburg, Pa., were originally scheduled to receive the children earlier this year, but the process was delayed due to a security check expiring as a result of delayed travel caused by the January executive order of the travel ban by President Donald Trump. (AP Photo/Craig Ruttle)","url":"https://www.dailymail.co.uk/wires/ap/article-4300304/Democratic-AGs-mount-fight-against-Trump-travel-ban.html"}
