{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:26:45","date_modify":"2018-10-30 18:26:45","date_publish":"2018-06-28 21:55:46","description":"During MSNBC's coverage of the shooting in Annapolis, MD, Representative Anthony Brown (D-MD), who represents the district where the shooting took place, | Video","filename":"data/vaneerConsumption/DemRepBrownISupportMoreGunRegulationsButWeNeedtoWaitforFactsinAnnapolisShooting.json","image_url":"https://media.breitbart.com/media/2017/01/AP_16105616528287.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_06_28__1540924005.html","title":"Dem Rep Brown: I Support More Gun Regulations, But We Need to Wait for Facts in Annapolis Shooting","title_page":"Dem Rep Brown: I Support More Gun Regulations, But We Need to Wait for Facts in Annapolis Shooting | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During MSNBC’s coverage of the shooting in Annapolis, MD, Representative Anthony Brown (D-MD), who represents the district where the shooting took place, said that while he is a proponent of more regulations on guns, it’s important to wait until we know the facts about the Annapolis shooting “before we start reaching conclusions or making arguments about what the best approach is.” Brown also stated that conversation needs to be followed by action.\nBrown said, “I’ve been a big proponent of more gun regulations, because I think that is part of addressing the problem, right now, we don’t know motive. We don’t know what type of weapon was used. We don’t know the circumstances under which the weapon was acquired by the shooter. So, I certainly would caution all of us, let’s understand what we have here, as we are all, I’m sure, prepared to continue the conversation, the very important conversation, that needs to be followed by action, which are those steps to reduce guns in our community. But I think it’s very important to understand what do we have here before we start reaching conclusions or making arguments about what the best approach is.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2018/06/28/dem-rep-brown-i-support-more-gun-regulations-but-we-need-to-wait-for-facts-in-annapolis-shooting/"}
