{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:40:19","date_modify":"2018-10-30 21:40:19","date_publish":"2015-05-27 17:26:21","description":"Democrat Representative Ann Kirkpatrick is looking to boot John McCain from elected office and take his seat in the U.S. Senate, launching her bid with campaign calls on Monday, Memorial Day, and a Tuesday video announcement.","filename":"data/vaneerConsumption/DemRepAnnKirkpatrickLaunchesChallengetoBootMcCainfromSenateSeat.json","image_url":"https://media.breitbart.com/media/2014/11/John-McCainpng.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_27__1540935619.html","title":"Dem. Rep. Ann Kirkpatrick Launches Challenge to Boot McCain from Senate Seat","title_page":"Dem. Rep. Ann Kirkpatrick Launches Challenge to Boot McCain from Senate Seat | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democrat Representative Ann Kirkpatrick is looking to boot John McCain from elected office and take his seat in the U.S. Senate, launching her bid with campaign calls on Monday, Memorial Day, and a Tuesday video announcement.\n“I respect John McCain’s service to our nation, I just believe our state is changing,” Kirkpatrick tells potential supporters in her video declaration. According to Roll Call, Kirkpatrick began making calls on Monday to make her plans known. Honing in on McCain’s veteran supporters, Kirkpatrick lauded her service on the House Veteran’s Affairs Committee.\nKirkpatrick may or may not end up directly facing McCain in November 2016. That would depend on whether a challenger can prevail in the Republican primary and whether Kirkpatrick secures the Democrat nomination.\nEvents in recent years have left McCain increasingly vulnerable, his own party members censuring him in January of last year.\nFresh in the minds of Arizonans and Americans concerned with border security is a campaign ad McCain ran in 2010 when he faced primary challenger J.D. Hayworth. Build “the danged fence” is an ad still featured on McCain’s own YouTube page and post-McCain re-election has left a plethora of Americans quizzically asking, where’s that danged fence?\nWavering voting records have displayed the Washington-entrenched Senator’s proclivity to wax conservative going into election years.\nMcCain hasn’t been shy about voicing concern over his re-election and appears to be sending his allies to take out those in his own party that have publicly opposed him. In the days leading up to his re-election effort announcement, worried fundraising emails pleaded for money. McCain no longer holds war chest leftovers from his 2008 bid for the Presidency like he did when facing a challenger in 2010.\nPublicly McCain has spoken of the expectation of a primary challenger. Those who have opposed him, and particularly those that took part in the Republican censure of McCain’s performance in elected office, have been facing political backlash. McCain allies have mounted efforts to purge political opponents from their party positions. Politico reported in late 2014 that McCain’s team is, “engaging in an aggressive and systematic campaign to reshape the state GOP apparatus by ridding it of conservative firebrands and replacing them with steadfast allies.”\nArizona State Senator Kelli Ward (R-Lake Havasu City) opened an exploratory committee in April to see if a challenge is feasible for her. She has called the potential task as a David vs. Goliath level campaign effort. Many in her own party have called her a rising star.\nRepresentative Matt Salmon (R-Gilbert) has also been pegged as a potential McCain challenger but is keeping the air of mystery thus far, allowing speculation to build. Insiders say he could delay a decision until the fall of 2015.\nRoll Call noted that Kirkpatrick’s announcement leaves her 1st district Arizona House seat open, a seat that typically leans Republican. Within hours state Senator Catherine Miranda announced she would explore a run for Kirkpatrick’s seat, reported the Associated Press (AP). A number of others have been named as potential contenders for the seat.\nThe moves stand to further shift the 2016 race in Arizona politics. Redistricting may further compound the issue. The AP reported that a case currently pending with the Supreme Court could leave Arizona’s Republican majority legislature redrawing lines, should the decision come down against lines drawn by the state’s Redistricting Commission. This could leave Republicans with an advantage in districts such as Kirkpatrick’s and even possibly drive additional Democrats into races like the McCain race.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/05/27/dem-rep-ann-kirkpatrick-launches-challenge-to-boot-mccain-from-senate-seat/"}
