{"authors":[],"date_download":"2018-10-30 14:21:07","date_modify":"2018-10-30 14:21:07","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/Demsenatorsgathertolearnhowtotalktorealpeople.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_dem_senators_gather_to_learn_how_to_talk_to_real_people_comments_1540909267.html","title":"Dem senators gather to learn how to talk to 'real people'","title_page":"Blog: Dem senators gather to learn how to talk to 'real people'","title_rss":"NULL","source_domain":"americanthinker.com","text":"In 2018, Democrats in the Senate will be forced to defend 23 seats – 9 of which are in states won by Donald Trump. Republicans, on the other hand, need only to defend 8 seats. That daunting math colored a gathering of Democrats in West Virginia who attended sessions on how to avoid electoral catastrophe in 2018. Among the panel discussions: Former Kentucky Gov. Steve Beshear (D), along with Sens. Heidi Heitkamp (D-N.D.) and Michael Bennet (D-Colo.), held a session on “speaking to those who feel invisible in rural America,\" according to the schedule. Other sessions were along similar lines: “Listening to those feel unheard” and “Rising America — They feel unheard too.” On Thursday Sen. Chris Van Hollen (D-Md.) will discuss political tactics for the midterm election and Democrats will strategize on how to define themselves and Trump. Sens. Elizabeth Warren (D-Mass.), Tim Kaine (D-Va.) and Joe Donnelly (D-Ind.)... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/dem_senators_gather_to_learn_how_to_talk_to_real_people_comments.html"}
de. Finally, Sen. Dianne Feinstein (D-Calif.) will prep Democrats on how to engage against Republicans over Trump's Supreme Court pick, which is expected to come as soon as next week. On Wednesday evening, Sen. Brian Schatz (D-Hawaii) led a wine and cheese reception, then got a history show about Harper’s Ferry called “September Suspense: Lincoln’s Union in Peril.” Democrats did not allow reporters to attend.\nDemocrats are not used to talking to \"real people\" in a substantive way. They just assume that these voters will robotically accept their flawed assumptions and vote for them. There has never been any effort to engage white working-class voters in the same way that Dems try to engage minorities, or women, or any other class of \"victims\" of the \"white male power structure.\"\nSo Democrats will have learn a new vocabularly. Words like \"liberty\" and \"patriotism\" will no longer stick in their throats, although they may sound strange and alien coming from a Democrat.\nDemocrats will also have to soft-pedal their class warfare mantra. Trump's comments about the rich were more in the context of them taking advantage of the system rather than wealthy people \"stealing\" from anyone as Democrats are wont to state. And whatever they do or say, they should give up on the notion that \"they didn't build that\" is a winning campaign slogan. Most Trump voters voted for him because he did, indeed, \"build that\" and was successful in doing so.\nThe trick for Democrats will be to stop treating ordinary people like aliens from another planet, although in a way, they will be like explorers planting a flag in unfamiliar territory. They are going to have to learn to communicate with the natives or end up in the cooking pot.","url":"https://www.americanthinker.com/blog/2017/01/dem_senators_gather_to_learn_how_to_talk_to_real_people.html"}
