{"authors":[],"date_download":"2018-10-22 21:32:15","date_modify":"2018-10-22 21:32:15","date_publish":"2014-05-07 16:04:39","description":"\"This is nothing more than a kangaroo court in the making,\" says one top Democrat.","filename":"data/vaneerConsumption/DemsSlamUnfairBenghaziProbePlan.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/426496/pelosi-pjg_af06571e612ac6d67fef989412053f04.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_dems-slam-unfair-benghazi-probe-plan-n99371_1540243935.html","title":"Dems Slam 'Unfair' Benghazi Probe Plan","title_page":"Dems Slam 'Unfair' Benghazi Probe Plan ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Democrats are threatening not to participate in a special select committee on Benghazi, accusing Republicans of making an “unfair” framework for the panel that underscores its partisanship.\n\"This is nothing more than a kangaroo court in the making,\"Democratic Caucus Chairman Xavier Becerra told reporters Wednesday. \"They have not explained to us on the Republican side what’s so important to do this over and over again.\"\nTop Democrats told GOP leaders in a letter last night that they reject the proposed makeup of seven Republicans and five Democrats on the panel, as well as its granting of subpoena authority only to chairman Republican Rep. Trey Gowdy.\n“If you truly want this new select committee to be bipartisan and fair – and to be taken seriously by the American people – we call on you to reconsider this approach before bringing this measure to the House floor for a vote,” they wrote.\nOther Democrats went even further, saying flatly that they should ignore the panel entirely.\n\"I would be dead-set against it,\" top Rep. Jim Clyburn of South Carolina said of a committee that didn't have equal representation of Republicans and Democrats. \"I'm not bringing a noose to my hanging.\"\nRepublicans will vote Thursday on a resolution to formally establish the rules for the special select committee. Democrats are expected to oppose that measure.\nHouse Speaker John Boehner insisted Wednesday that the special select committee is intended for “transparency and accountability,” not for political points.\n“This is all about getting to the truth,” he told reporters. “There's not going to be a side show, there's not going to be a circus, this is a serious investigation.”\nNBC's Carrie Dann and Andrew Rafferty contributed.","url":"https://www.nbcnews.com/politics/congress/dems-slam-unfair-benghazi-probe-plan-n99371"}
