{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-22 20:26:58","date_modify":"2018-10-22 20:26:58","date_publish":"2016-01-28 01:21:39","description":"The 41-year-old presenter was joined by her boyfriend Eddie Boxshall as they flew in from London on Wednesday to watch her close pal Kimberley tie the knot.","filename":"data/vaneerConsumption/DeniseVanOutenandEddieBoxshalllandinBarbadosforKimberleyWalshswedding.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A5EF4C00000578-0-image-a-6_1453943635979.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420234_Denise-Van-Outen-lands-Barbados-boyfriend-Eddie-Boxshall-Kimberley-Walsh-wedding_1540240018.html","title":"Denise Van Outen and Eddie Boxshall land in Barbados for Kimberley Walsh's wedding","title_page":"Denise Van Outen and Eddie Boxshall land in Barbados for Kimberley Walsh's wedding | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They first struck up a friendship when they climbed Mount Kilaminjaro together in 2009 for Comic Relief.\nAnd Denise Van Outen was spotted arriving in Barbados on Wednesday as she prepared to watch her close pal Kimberley Walsh walk down the aisle with her long-term partner Justin Scott this weekend.\nThe 41-year-old presenter was joined by her boyfriend Eddie Boxshall as they flew in from London, looking chic yet casual in a black vest top and matching leggings.\nScroll down for video\nArriving in style: Denise Van Outen and her boyfriend Eddie Boxshall were seen landing in Barbados on Wednesday ahead of Girls Aloud star Kimberley Walsh's nuptials\nDenise added a touch of class to her low-key look thanks to her Balmain slogan T-shirt with gold button detailing on the shoulders.\nShe completed her travelling ensemble with black pumps and a silver pendant necklace, wearing her hair pulled back in a ponytail.\nThe blonde beauty was joined by her stockbroker beau Eddie, who sported a very casual look including a black top and beige cargo pants.\nDesigner touch: The 41-year-old presenter was clad in a Balmain T-shirt and leggings, carrying a stylish dog print travel bag\nClose friends: Denise and Kimberley first became friends when they climbed Mount Kilaminjaro together in 2009 for Comic Relief, and their bond grew stronger during their time on Strictly Come Dancing in 2012\nDenise was also joined by her friend Kara Tointon, who competed alongside Kimberley and Denise on the 2012 series of Strictly Come Dancing.\nThe stars got on famously during the series and formed a lasting bond, at one point even planning a 'singing and dancing' show together, which never came to fruition.\nDenise and Kimberley were able to work together in the 1960s musical revival of Sweet Charity last year, and enjoyed every minute of it.\nThe final countdown! Cheryl Fernandez-Versini was all smiles as she arrived at Barbados airport on Wednesday ahead of her former Girls Alound bandmate Kimberley Walsh's wedding\nHere come the girls! Nicola Roberts, who will act as bridesmaid alongside Cheryl, was looking effortlessly stylish as she touched down from the UK\n'I love her to bits', Denise previously said of their special bond.\nAlso joining Denise and Kara at the airport was the Girls Aloud singer's former bandmates Cheryl Fernandez-Versini and Nicola Roberts, who will act as bridesmaids at the exotic ceremony.\nKimberley has been dating property developer Justin for 14 years, and they welcomed their first child, a son named Bobby, into the world in late 2014.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420234/Denise-Van-Outen-lands-Barbados-boyfriend-Eddie-Boxshall-Kimberley-Walsh-wedding.html"}
