{"authors":["Olivia Muenter"],"date_download":"2018-10-30 23:04:53","date_modify":"2018-10-30 23:04:53","date_publish":"2014-08-14 11:00:02","description":"Generally speaking, denim probably isn't the first thing that comes to mind when you dream of red carpet fashion. But throughout the years, denim has actually appeared at premieres and award shows more than you might expect. While the results of…","filename":"data/vaneerConsumption/DenimOnTheRedCarpetTheGoodTheBadAndTheHorriblyBedazzled.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ce4db43a-decc-477e-b9e4-6c2403b6be8b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35655-denim-on-the-red-carpet-the-good-the-bad-and-the-horribly-bedazzled_1540940693.html","title":"Denim On The Red Carpet: The Good, The Bad, And The Horribly Bedazzled","title_page":"Denim On The Red Carpet: The Good, The Bad, And The Horribly Bedazzled","title_rss":"NULL","source_domain":"bustle.com","text":"Generally speaking, denim probably isn't the first thing that comes to mind when you dream of red carpet fashion. But throughout the years, denim has actually appeared at premieres and award shows more than you might expect. While the results of combining denim and formal wear are sometimes scarring (yes, I'm talking about that Britney Spears and Justin Timberlake's red carpet denim moment), in other cases it just works.\nSomething about the juxtaposition of the casual, comfortable nature of denim with high-fashion, formal events provides an interesting corner of red carpet fashion that really hasn't been utilized as much as it could be. It's a risky choice to say the least, but fashion is about taking risks, right? And as bold a choice as it might be to wear a denim number on the red carpet, celebrities like Kate Hudson have made it pay off. And, well, even if it doesn't work, we can still learn lessons from the red carpet denim failures. We have to have examples of what not to do too, right? Exactly.\nSo to celebrate the few, brave souls who have worn denim on the red carpet, here is a list of some of the best, worst, and most confusing examples of red carpet denim.\n1. Iggy Azalea in Herve Leger, 2014\nTim P. Whitby/Getty Images Entertainment/Getty Images\nIf you think we've learned our lesson from the Justin/Britney denim debacle, think again. Personally, I think Azalea has killer style; I love her unique spin on high-fashion pieces. But this is certainly not my favorite look of hers. It reminds me of an adult, sexualized spin on a Limited Too dress I used to own in the third grade. I don't think that's a good sign.\n2. Tyler Hoechlin in John Varvatos, 2014\nMichael Buckner/Getty Images Entertainment/Getty Images\nNo. Just no.\n3. Kate Hudson in Balmain, 2013\nAlberto E. Rodriguez/Getty Images Entertainment/Getty Images\nOnce you hear that this is Balmain, it immediately makes more sense. The embellishments and the silhouette fit in perfectly with the brand's aesthetic. But . . . denim? A denim mini dress? A denim quilted mini dress? Yeah, it sounds completely crazy, but I think this actually works. In a weird, \"Look, I bedazzled my jeans, mom!\" kind of way . . . it works.\n4. Amanda Seyfried in Givenchy, 2013\nStephen Lovekin/Getty Images Entertainment/Getty Images\nJust like you wouldn't imagine red carpet and denim go together, you also wouldn't guess Givenchy and denim would complement each other, right? Well, even though I'm not completely sold on this denim look, it's hard to say Amanda Seyfried really looks bad. Ever. Period.\n5. Zoe Saldana in Balmain, 2013\nEthan Miller/Getty Images Entertainment/Getty Images\nIt's a denim jumpsuit on a red carpet (I mean, to be fair, it's a Comic Con step and repeat, but same idea). I don't know how I feel about this look as a whole (especially paired with the shoes), but maybe Balmain knows something we don't about denim. Also this looks like the most comfortable thing ever.\n6. Diane Kruger in Chanel, 2013\nPascal Le Segretain/Getty Images Entertainment/Getty Images\nNow this is how you do a denim dress. Ignore the weird hat and this look is perfect. Actually, it's Diane Kruger so it's still perfect. I'm just not cool enough to get the hat.\n7. Chloe Grace Moretz in Louis Vuitton, 2013\nJason Merritt/Getty Images Entertainment/Getty Images\nThis is adorable. From head to toe, I am obsessed.\n8. January Jones in Elizabeth and James, 2013\nTaylor Hill/Getty Images Entertainment/Getty Images\nI could take or leave the denim jacket on the red carpet look. Seems a little bit unnecessary to me, but the combination of materials and colors still looks great in this outfit.\n9. Ellen Pompeo in Lanvin, 2010\nAmy Sussman/Getty Images Entertainment/Getty Images\nThe problem with denim, I think, is that sometimes when worn on the red carpet it makes us say, \"Well . . . I would like it if it wasn't denim.\" This is a classic example. It sort of just looks like she cut up a pair of 4X mom jeans and wrapped them around herself. I'd say that's a red flag of some sort.\n10. Ciara, 2009\nJason Merritt/Getty Images Entertainment/Getty Images\nI'm not really OK with anything going on here in this outfit, but she looks like she's having fun. So I guess at least there's that.\n11. Britney Spears and Justin Timberlake, 2001\nLast, but not least — the biggest denim moment of maybe all time. Just take a second to take it all in, guys.\nImages: Getty Images (11); InfiniteZest/Tumblr","url":"https://www.bustle.com/articles/35655-denim-on-the-red-carpet-the-good-the-bad-and-the-horribly-bedazzled"}
