{"authors":["Annabel Fenwick Elliott For Mailonline"],"date_download":"2018-10-23 02:11:19","date_modify":"2018-10-23 02:11:19","date_publish":"2017-04-26 13:06:32","description":"In Hong Kong, 20-year-old Russian snapper Denis Krasnov shot the daring images, while the New York photos were taken by a mysterious daredevil known as @svvvk on Instagram.","filename":"data/vaneerConsumption/DenisKrasnovandsvvvkssnapsofHongKongandNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F6AC400000578-0-image-a-67_1493207006942.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4447352_Denis-Krasnov-svvvk-s-snaps-Hong-Kong-New-York_1540260679.html","title":"Denis Krasnov and @svvvk's snaps of Hong Kong and New York","title_page":"Denis Krasnov and @svvvk's snaps of Hong Kong and New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Not a fan of heights? Then buckle up for a series of stomach-drops.\nThese vertigo-inducing images were taken by daredevils in New York and Hong Kong, who risked their lives to explore the cities from a dizzying perspective.\nBrave 'rooftoppers' from Australia, China and Russia posed perilously on roof edges in Hong Kong with no safety equipment despite being just a footstep from certain death; while a mysterious photographer known as @svvvk on Instagram shot the New York snaps.\nThese vertigo-inducing images were taken by daredevils in Hong Kong (pictured) and New York who risked their lives to explore these cities from a dizzying perspective\nTwenty-year-old Russian photographer Denis Krasnov, who shot the staggering photos in Hong Kong, reveals: 'I used to travel to mountains a lot and I quickly learnt that I loved height when taking photos.\n'From this I decided to combine my passion for height and taking photos and became a rooftopper. When I first got into it, I would only climb small houses, but as time went on the height of the buildings increased.\n'I studied building plans and the security systems of skyscrapers. We try to test ourselves to get that adrenaline rush which is lacking in everyday life.'\nAccording to the New York photographer, who joins his fellow explorers on their climbs: 'It is dangerous, but the risk for the shot looking over the edge is always worth it to me.'\nA mysterious photographer known as @svvvk on Instagram posed perilously on roof edges in New York with no safety equipment, seen here over Times Square, despite being just a footstep from certain death\nA masked man hangs precariously from a soaring crane with an admittedly nice view of New York's sprawling Central Park\nPictured (left) is the spire on 70 Pine in New York's Financial District and (right) the spire of 40 Wall Street, 925 feet up\nThe snapper adds: 'If there's something out of reach or getting to dangerous, we have a friend lend a hand or call it off and move on. One photo isn't worth anyone's life.\n'My family are okay with what I do. I don't push my limits past what I know I'm capable of so I haven't been hurt from doing this.\n'I have been caught more than once by building security, but as long as you are polite and respectful to them, they will be the same.'\nHe concludes: 'People don't realise how much effort some people put into a photo.'\nTwenty-year-old Russian photographer Denis Krasnov (pictured) shot the staggering photos in Hong Kong, with views over the clustered high-rise buildings below\nHe gathered 'rooftoppers' from Australia, China and Russia to explore Hong Kong from a truly unique vantage point\nMr Krasnow and his companions, one pictured gazing over the Hong Kong skyline, remarks: 'We try to test ourselves to get that adrenaline rush which is lacking in everyday life'\nIn order to capture their shots, the Hong Kong team study the building plans and security systems of skyscrapers to gain access\nAccording to the New York snapper, who took this snap of a fellow rooftopper atop the Ghery building: 'I have been caught more than once by building security'\nHe adds: 'But as long as you are polite and respectful to them, they will be the same'. Pictured is a climber peering over Downtown New York\nTaken in Hong Kong, this man points his toe over the edge of this horrifyingly high glass-walled skyscraper\nMr Krasnov, pictured in Hong Kong, explains: 'I used to travel to mountains a lot and I quickly learnt that I loved height when taking photos'\nHe adds: 'From this I decided to combine my passion for height and taking photos and became a rooftopper'\nWhen Mr Krasnov first got into it, he would only climb small houses but as time went on, the height of the buildings increased\nA rooftopper perched on the ledge of a lit-up building casually checks his camera above Times Square in New York\nOne photographer who is even higher up than his friend captures him from a ledge above New York's Bryant Park\nLooking remarkably calm, another climber surveys New York's concrete jungle from the corner of a soaring rooftop\nAccording to the New York photographer, who shot this of his friend: 'It is dangerous, but the risk for the shot looking over the edge is always worth it to me'\nHe adds: 'If there's something out of reach or getting to dangerous, we have a friend lend a hand or call it off and move on. One photo isn't worth anyone's life'. Pictured, a climber overlooking New York and Brooklyn Bridge\nThe snapper claims his family are 'OK' with what he does, stating: 'I don't push my limits past what I know I'm capable of so I haven't been hurt from doing this'. Pictured, a group of climbers in Brooklyn\nGreat care was taken not to slip down the sides of this roof where the photographer sat close to the Chrysler Building","url":"https://www.dailymail.co.uk/travel/travel_news/article-4447352/Denis-Krasnov-svvvk-s-snaps-Hong-Kong-New-York.html"}
