{"authors":["Emily Sheridan For Mailonline"],"date_download":"2018-10-23 04:17:20","date_modify":"2018-10-23 04:17:20","date_publish":"2016-01-11 17:22:08","description":"She fled the winter weather for sunnier climes to see in the new year. So no wonder Denise Van Outen is sporting quite the glowing tan as she continued her Dubai holiday.","filename":"data/vaneerConsumption/DeniseVanOutenshowsoffhertaninpinkandbluebikiniinDubai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300CFE6C00000578-0-image-a-4_1452531872942.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394168_Denise-Van-Outen-shows-tan-pink-blue-bikini-soaks-sun-Dubai_1540268240.html","title":"Denise Van Outen shows off her tan in pink and blue bikini in Dubai","title_page":"Denise Van Outen shows off her tan in pink and blue bikini in Dubai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She fled the winter weather for sunnier climes to see in the new year.\nSo no wonder Denise Van Outen is sporting quite the glowing tan as she continued her Dubai holiday.\nThe actress and presenter, 41, showed off her curves in a pink and blue bikini as she enjoyed another day on the beach.\nBeach babe: Denise Van Outen shows off her tan in a pink and blue bikini as she poses with her pal Benji Rom on the beach in Dubai\nThree's no crowd: The mother-of-one headed to the Emirates with her boyfriend Eddie Boxshall, close pal Jemma Pike and her daughter Betsy to spend New Year's Eve\nThe mother-of-one headed to the Emirates with her boyfriend Eddie Boxshall, close pal Jemma Pike and her daughter Betsy to spend New Year's Eve.\nWhile staying at the Le Royal Meridien hotel, it looked like Denise had plenty of company with her pal Benji Rom and WAG Abbey Clancy also seeing in 2016 in the same city.\nNo doubt Denise had plenty to celebrate after finalising her divorce from Lee Mead just weeks before Christmas.\nLooking fabulous: Denise posted another bikini photo with her pal Jemma Pike earlier in the holiday\nDenise and Lee were granted a quickie divorce and shared custody of their five-year-old daughter following their split in July 2013.\nThe couple originally wed in the Seychelles in April 2009 following a whirlwind 18 month romance after meeting on TV talent show Any Dream I Do.\nDenise then started dating Eddie, a 42-year-old commodities trader from Essex in summer 2014.\nLoved up: Denise and boyfriend Eddie Boxshall welcomed in 2016 together in Dubai\nIn a recent interview, Denise spoke of her great relationship with Lee and said they would be spending Christmas together with their daughter.\nThe former Strictly Come Dancing star told Fabulous magazine recently: 'I've no regrets about getting married to Lee at all.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394168/Denise-Van-Outen-shows-tan-pink-blue-bikini-soaks-sun-Dubai.html"}
