{"authors":["Virginia Hale"],"date_download":"2018-10-30 18:42:13","date_modify":"2018-10-30 18:42:13","date_publish":"2018-08-02 08:54:13","description":"Muslims and left-wingers have rallied in the streets of Copenhagen to protest a niqab ban they claim is 'discriminatory' to minorities.","filename":"data/vaneerConsumption/DenmarkMuslimsLeftistsMarchtoProtestBurqaBan.json","image_url":"https://media.breitbart.com/media/2018/08/DENMARK-POLITICS-RELIGION-ISLAM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_02__1540924933.html","title":"Denmark: Muslims, Leftists March to Protest Burqa Ban","title_page":"Denmark: Muslims, Leftists March to Protest Burqa Ban | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Muslims and left-wingers have rallied in the streets of Copenhagen to protest a new law against wearing face coverings in public, which they claim is an attack on women’s right to dress as they please.\nWhen the ban came into force on Wednesday, Denmark became the latest European country to prohibit wearing the niqab, a garment which is linked to Islam’s fundamentalist Salafist movement, and covers the entire face except for its wearer’s eyes.\nThe law gives police the power to order women either remove their face coverings or go home if they are in breach of the law, which carries fines ranging from 1,000 Danish crowns (£120 GBP) for first-time offenders and up to 10,000 crowns for breaching the rules for a fourth time.\nThe ban also applies to other full face coverings, such as balaclavas.\nProtesters, many with children in tow, showed up on the capital’s streets at 5 pm to protest the ban. Sabina, a 21-year-old student, told Reuters that Muslims “need to send a signal to the government that we will not bow to discrimination”.\nSpeaking to left-liberal Vice News earlier in the week, the pro-niqab activist had claimed that “pure Islamophobia and hatred” had motivated the ban.\nA niqab-wearing 30-year-old identified only as ‘Sarah’, who was born in Denmark to Turkish parents, asserted that “hypocritical” politicians are removing “rights” from Muslims while permitting people to make critical comments about Islam.\n“I’ve realised that democracy doesn’t work. Politicians boast of freedoms and rights when they are making fun of Muslims and when they are drawing caricatures of the prophet. But when it comes to me, they take away my right to choose how I want to dress,” she told Berlinske.\nDanish MPs greenlighted the new restrictions in May, with the Ministry of Justice stating that it was obligatory for citizens to “meet each other properly — face to face” rather than hiding their identity, in order to participate in society.\nEarlier this week Vice reported from the Islamic Confederation headquarters in Copenhagen’s multicultural Nørrebro district, which it said was “colourful” as “a mixture of hijabis, niqabis, [and] dreadlocked left-wingers” were preparing signs and flyers at a “masking party” ahead of the protest.\nKaoutar Elhamss told the organisation that civil disobedience is “precisely what is needed” to fight the ban, and claimed it is “neither criminal nor disobedient” for citizens to call the government out when “a democratic country is not behaving democratically and denying citizens their fundamental rights”.\nShe added the government’s argument that it is important for people for people to see each other’s face as they communicate is invalid because veil-wearing Muslims “put much more energy and body language into their communication than other people because they know they are a minority and want other people to feel they can read them”.\nVeil-Wearing Muslims Leave Austria as the Niqab Ban Kicks In https://t.co/cuARdQ3Twh — Breitbart London (@BreitbartLondon) December 12, 2017\nOn Monday, Breitbart London reported a poll which showed less than half of Austrians are happy to see large numbers of people wearing headscarves in the nation’s cities.\nThe survey suggested a high level of public support for the tougher approach on integration shown by the country’s national conservative government, which like Denmark is one of several countries which have introduced a niqab ban recently.\nAustria has also proposed restrictions on wearing the hijab in kindergartens — an increasingly common but previously rare practice that has been criticised even in the Islamic world, as it sexualises children.\nAustria, France, Denmark, and More: Europe Rejects the Islamic Burqa https://t.co/RZdi5Zsq0o — Breitbart London (@BreitbartLondon) June 1, 2018","url":"https://www.breitbart.com/europe/2018/08/02/muslims-leftist-women-protest-burqa-ban/"}
