{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:59:32","date_modify":"2018-10-30 20:59:32","date_publish":"2015-08-05 17:03:46","description":"Dentist Who Shot Cecil 'Hire Armed Security' After Threats To Life, Property","filename":"data/vaneerConsumption/DentistWhoShotCecilHiresArmedSecurityAfterThreats.json","image_url":"https://media.breitbart.com/media/2015/08/lion-head-hunting-trophy-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_05__1540933172.html","title":"Dentist Who Shot Cecil 'Hires Armed Security' After Threats","title_page":"Dentist Who Shot Cecil 'Hires Armed Security' After Threats","title_rss":"NULL","source_domain":"breitbart.com","text":"As the anti-trophy hunting backlash continues in the wake of Cecil the lion’s death, one of Minnesota dentist Walter Palmer’s homes has been vandalized and he has been forced to hire armed security for himself.\nDuring the last week, Palmer has been vilified internationally and has reportedly received death threats in addition to real property damage.\nOn August 5, the Associated Press reported that Walter Palmer’s “$1.1 million” Marco Island, Florida, vacation home was vandalized–leaving the words “Lion Killer!” graffitied on the garage door and “at least seven pickled pigs’ feet” left lying in the drive.\nThis follows a homemade sign criticizing Palmer, which someone stuck in the yard of the vacation home last week.\nThe Daily Mail reports that Palmer received “death threats and abuse” sufficient to convince him to spend “thousands of dollars a day on armed security and covert CCTV cameras.” This includes hiring a security firm to put cameras in various locations,” [enabling them] to document all the license plates coming on [the] street” where the Florida home is located.\nMoreover, Palmer has left his main residence in Eden Prairie, Minnesota, which is now being “closely monitored by police.” He has also been forced to close his dental practice due to the threat level he now faces.\nIronically, on July 28 Sharon Osburne tweeted her hope that Palmer “loses his home, his practice & his money.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/08/05/dentist-who-shot-cecil-hires-armed-security-after-threats-to-life-property/"}
