{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-31 00:12:39","date_modify":"2018-10-31 00:12:39","date_publish":"2016-08-24 08:00:00","description":"As a bill named in memory of his 6-year-old son heads to Gov. Jerry Brown, Tim Sears looks at his family’s foray into Sacramento politics with mixed","filename":"data/vaneerConsumption/DentalvictorytemperedforgrievingfamilyHowmanymorekidshavetodie.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/DENTAL_photo-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944759.html","title":"Dental victory tempered for grieving family: \"How many more kids have to die?\"","title_page":"Dental victory tempered for grieving family: \"How many more kids have to die?\" | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As a bill named in memory of his 6-year-old son heads to Gov. Jerry Brown, Tim Sears looks at his family’s foray into Sacramento politics with mixed emotions.\n“I’m both happy and proud of the amount of progress we’ve made and I think this bill will really help,” said Sears, whose son Caleb died last year following surgery to remove a tooth.\n“But at the same time… how many more kids have to die before we change the practice?”\nSears, who lives in Albany, and his family believe that Caleb died from anesthesia administered during dental surgery, and have been advocating all year for a bill to address the issue. They’re fueled by a desire to prevent other families from experiencing their pain.\nYet as they’ve gone through the lengthy process of crafting and negotiating legislation, the Bay Area family has confronted a surprisingly powerful interest group: dentists. Groups representing dentists and oral surgeons spend huge sums on lobbying in Sacramento and making donations to lawmakers. They successfully blocked many changes the Sears family hoped to make, arguing that they were the wrong way to respond to a rare tragedy.\nThe family initially wanted a law that would require two providers during oral surgery—one to operate, and another who specializes in anesthesia. Dental lobbyists resisted, saying that could prevent some patients from getting care. The family scaled back its ambitions, and negotiated many versions of the bill before it was sent to the governor this week with the support of the dental lobby.\nThe final version doesn’t go as far as the Sears family had hoped, but it improves data collection, gives parents more information before their children undergo dental surgery, and lays the groundwork for more substantial changes in the future.\n“Stay tuned,” said its author, Democratic Assemblyman Tony Thurmond of Richmond. “We are going to keep pushing.”\nHis Assembly Bill 2235 has three main components. It gets at the state’s spotty collection of data about dental deaths by requiring dentists to complete a new form when a patient dies. It requires a study, now underway, to assess how California’s dental anesthesia regulations stack up to those in other states. And it requires that parents whose kids are undergoing dental surgery be notified that anesthesia is administered in different ways in different settings.\nOral surgeons are the only medical professionals allowed to both administer anesthesia and perform surgery. Those duties are separated in hospitals, where an anesthesia provider monitors the patient’s response to sedation while the surgeon operates.\nThe Sears family believes that the oral surgery model—with a single practitioner performing two complicated medical tasks—was a key factor in Caleb’s death.\nTheir advocacy is not the first time state regulators have been alerted to concerns about dental anesthesia. In 2012, Southern California dentist Michael Mashni wrote state officials several letters requesting information about deaths from dental anesthesia “so we can prevent them in the future.” His requests were denied.\nIn 2003, a panel recommended that the Dental Board of California create a committee to review deaths and injuries from anesthesia and make safety recommendations. Although the board confirmed it could find no record that such a committee was ever formed, spokeswoman Joyia Emard said it takes the issue seriously and has monitored dental anesthesia and sedation in other ways over the years.\n“There is no more time to waste,” Anna Kaplan, a doctor who is Caleb’s aunt, told the dental board this month.\nAnother doctor, representing the California branch of the American Academy of Pediatrics, asked the board to put a “moratorium” on the practice of allowing oral surgeons to also administer anesthesia.\nBut the California Dental Association said dental anesthesia deaths, while rare, happen in a variety of settings, including “incidents with a separate anesthesiologist present,” said a statement from spokeswoman Alicia Malaby.\nOral surgeons argue that there is no evidence of a widespread problem.\n“We estimate that the risk of a pediatric death in (an oral surgeon’s) office is less than one in a million,” Leonard Tyko, president of the Oral and Facial Surgeons of California, said in a recent presentation to the dental board. “Wholesale changes to our…model are not supported by any data and are therefore unwarranted.”\nBut the state’s data on the issue is incomplete—a fact state regulators acknowledged in a recent draft report to the dental board. Records showed that between 2010 and 2015, nine children died and 45 were hospitalized as a result of dental care in California. The report says the board’s staff could not review other cases because “files were not able to be located, or were purged pursuant to the Board’s records retention schedule.”\nNor does the report include a 3-year-old child who died in July following dental surgery in San Ramon. An investigation of that death is under way.","url":"https://calmatters.org/articles/dental-victory-tempered-for-grieving-family-how-many-more-kids-have-to-die/"}
