{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-22 23:56:19","date_modify":"2018-10-22 23:56:19","date_publish":"2016-01-11 07:48:41","description":"The 61-year-old actor was joined on stage by his family. His son Malcolm was working on his thesis at the American Film Institute.","filename":"data/vaneerConsumption/DenzelWashingtonheforgetshisglassesatGoldenGlobes2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005BA9200000578-0-image-a-115_1452496865186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393477_I-need-glasses-Denzel-Washington-prompted-wife-forgets-spectacles-Golden-Globes-offered-pair-Jamie-Foxx_1540252579.html","title":"Denzel Washington he forgets his glasses at Golden Globes 2016","title_page":"Denzel Washington he forgets his glasses at Golden Globes 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was the recipient of the Cecil B. DeMille Award.\nBut Denzel Washington accidentally left his glasses behind when he received the honour with his family on stage at the Golden Globes in Beverly Hills on Sunday night.\nThe 61-year-old's wife Pauletta Washington, 65, eventually came to his aid, as did Jamie Foxx, 48, who offered a pair of glasses from his seat in the audience.\nOh no! Denzel Washington accidentally forgot his reading glasses when he received the Cecil B. DeMille Award on stage beside his wife Pauletta and their children Katia, John David, and Olivia Washington at the Golden Globes on Sunday in Los Angeles\nHelp is here! Jamie Foxx offered to lend a pair spectacles of Washington, however the actor politely refused\nSurrounded by his wife and their children Katia, John David, and Olivia Washington, the actor was explaining that his son Malcom was absent because he was working on his thesis at the American Film Institute when his wife gently reminded him he needed his glasses.\nHowever, the actor didn't budge.\n'Nah, I can see without them,' he said before thanking those who helped him along his career path.\nHonoured: The actor relayed a comical early experience he had with the Hollywood Foreign Press\nThe actor also relived an early and comical experience he had with the Hollywood Foreign Press.\n'Thank you, I thank the Hollywood Foreign Press, Freddie Fields. Some of you may know Freddie Fields, he invited me to the first Hollywood Foreign Press luncheon, he said \"They're gonna watch the movie, we're gonna feed them, they're gonna come over, you're gonna take pictures with everybody, you're gonna hold the magazines, take the pictures, and you're gonna win the award.\"'\nThe actor added smugly to laughter, 'I won that year.'\nFamily first: The couple's son John David was no doubt proud of his accomplished father\nIt didn't take long for the actor to eventually encounter trouble as he continued reading his speech, at which point his wife once again came to his aid.\nAs the actor paused after thanking several supporters, his wife read, 'Ari.'\n'My wife's prompting me, Ari Emanual,' he said.\nA helping hand: Pauletta attempted to help her husband but admitted she forgot her glasses as well\nDenzel finally admitted he indeed needed his glasses when his wife whispered into his ear after he thanked his mother and his first two agents.\n'Yeah I do need my glasses!' he said with a smile. 'Come here, who else is on here?'\nPauletta then admitted, 'I don't have mine either.'\nMaking history: The Cecil B. DeMille Award was first handed out in 1952 at the 9th Annual Golden Globe Awards ceremony\n'Oh you don't have yours either!?' the actor said. 'Oh well anyway, huh?' Denzel paused as Jamie stood from the audience to offer him a pair of glasses.\nHowever, Denzel politely refused the spectacles, saying, 'Man that's alright!'\n'Any way, God bless you all. I didn't thank the family?' Denzel said before motioning towards his children and wife. 'Thank the family, and God bless you all!'\nThe Cecil B. DeMille Award was first handed out in 1952 at the 9th Annual Golden Globe Awards ceremony.\nThe Golden Globe was one of the first major awards Denzel won, when he scooped the Best Supporting Actor gong for his turn in 1989 American Civil War epic Glory. He later won the Academy Award in the same category for his performance.\nHe also won the Best Actor prize for 1999's The Hurricane, the biographical boxing film which was criticized for being extremely economical with the truth.\nLoved up: Denzel nuzzled up to his wife on stage","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393477/I-need-glasses-Denzel-Washington-prompted-wife-forgets-spectacles-Golden-Globes-offered-pair-Jamie-Foxx.html"}
