{"authors":[],"date_download":"2018-10-30 18:17:34","date_modify":"2018-10-30 18:17:34","date_publish":"2018-07-19 16:13:00","description":"Denzel Washington is very happy his actor son John David, 33, gave up his first post-college ca...","filename":"data/vaneerConsumption/DenzelWashingtongladhissonquitprofootballHeha.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/DaytonDailyNews/2018/07/18/Videos/4442165.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_celebrity-new_6f37fedfe2049f5bc298f78682a2ac31__1540923454.html","title":"Denzel Washington ‘glad’ his son quit pro football: 'He ha","title_page":"Denzel Washington ‘glad’ his son quit pro football: 'He ha","title_rss":"NULL","source_domain":"ajc.com","text":"Denzel Washington is very happy his actor son John David, 33, gave up his first post-college career, playing professional football, to turn to acting.\n“He’s had I don’t know how many concussions, a broken collar bone, a torn up knee and Achilles [tendon],” Washington told PEOPLE of his son’s brief NFL career. “No, I’m glad it’s over.”\nJohn David graduated from Morehouse College, where his record-breaking D2 college football career led to a brief stint playing in the NFL. He played for the St. Louis Rams in the 2006-07 season, and for the American team Rhein Fire in NFL Europa. When he gave up football for acting, he got his major breakthrough, ironically, by playing football star Ricky Jerret on HBO’s “Ballers.”\n» ‘Black Panther’ star Chadwick Boseman reveals Denzel Washington paid for him to study at Oxford\n“The Equalizer 2” star went on to say that he’s proud that his eldest son has made his own way in Hollywood — which in addition to “Ballers” includes a role in Spike Lee’s buzzed-about new film “BlacKkKlansman” — without relying on any major help from his dad.\n“That’s my son, I love my boy and I’m just happy he’s his own man, he’s independent,” says Washington. “He’s really good at what he does, and the fact that he’s been fighting to make his own mark, he didn’t want any help from me, I didn’t help him get onto ‘Ballers’ or anything like that. The only way I helped him get into ‘Ballers’ was introducing him to football as a kid, so maybe that helped. But I’m just proud of he and all my children (John David, Katia, 30, twins Olivia and Malcolm, 27). My wife did a great job, they are good kids. Humble, hard-working, not afraid of hard work, that’s all you can ask for.”\n“The Equalizer 2” opens in theaters Friday.","url":"https://www.ajc.com/entertainment/celebrity-news/denzel-washington-glad-his-son-quit-pro-football-had-don-know-how-many-concussions/vRkUabVydBklR6j5X535jM/"}
