{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:10:23","date_modify":"2018-10-31 00:10:23","date_publish":"2015-12-09 08:00:00","description":"Hours after Greg Campbell awoke from surgery in 2013, the phone rang in his Sacramento hospital room. It was Gov. Jerry Brown, calling to wish him a","filename":"data/vaneerConsumption/DepartureofpowerfulstaffercomesamidchangesinCapitol.json","image_url":"https://calmatters.org/wp-content/uploads/Greg_Campbell.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944623.html","title":"Departure of powerful staffer comes amid changes in Capitol","title_page":"Departure of powerful staffer comes amid changes in Capitol | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Hours after Greg Campbell awoke from surgery in 2013, the phone rang in his Sacramento hospital room. It was Gov. Jerry Brown, calling to wish him a speedy recovery from the operation that removed a large tumor from his brain.\nCampbell – a powerful, behind-the-scenes staffer in the Capitol – thanked Brown for the call. Then he seized the moment to lobby the governor to approve an important bill by his boss to expand the Medi-Cal health care system for the poor.\n“Greg says … ‘But Governor, the only reason I’m alive today is because I have good health insurance. There are one and a half million Californians who don’t have health insurance who could have insurance if you sign AB 1 x1,’” recalled former Assembly Speaker John A. Pérez, who was at Campbell’s bedside during the call.\nCampbell, 42, is leaving the Assembly next week after an 18-year career in which he rose from a student intern who answered phones and opened mail, to the chamber’s most powerful staff member. He served high-ranking positions for the last five assembly speakers, and was chief of staff to the last two.\nHis departure comes as new rules about term limits are changing relationships between Capitol staff and lawmakers. Senior staff gained influence after voters in 1990 approved a measure that limited lawmakers to six years in the Assembly and eight years in the Senate. As politicians were forced from office, political scientists have found that senior staff developed deep connections and expertise — and the clout that comes with longevity.\nNext year, for the first time in more than 20 years, the Assembly will swear in a new speaker with the opportunity to serve nearly a decade. The change reflects a 2012 ballot measure that allows legislators to serve 12 years in either chamber, potentially giving them time to gain expertise and rely less on staff.\n“The new speaker will have the time to develop his own institutional memory rather than borrowing it from the staff,” said Thad Kousser, a political science professor at University of California, San Diego, who has studied term limits. “It’s good for the system to have the power reside in people who have been elected.”\nCampbell is a leading example of the elite staff in Sacramento, whose years of experience with the Capitol’s issues, personalities and politics was influential with newly arriving lawmakers. They’re also paid more than their bosses. Campbell is the highest paid staffer in the Assembly, with an annual salary of $197,604 — more than double the $97,200 salary for legislators who are not part of the leadership. Roughly 300 Capitol staff are paid more than the lawmakers’ base salary.\nAs the speaker’s chief of staff, one of Campbell’s primary jobs was to manage a house with 80 legislators and about 1,300 employees. He had the authority to say “no” to lawmakers when they wanted to chair a committee, switch offices or boost their staff’s pay.\n“That person is doing the bidding of the speaker, but it arguably makes the job more powerful than even some elected members of the Legislature,” said former Assembly Speaker Fabian Núñez (D-Los Angeles).\nCampbell’s job wasn’t just administrative. He helped organize campaigns that elected some members to the Assembly. That work, which he is required by law to do outside his full-time service in the Capitol, helped Assembly Democrats win a two-thirds supermajority in 2012.\nCampbell — the son of two public school teachers who grew up as one of few Democrats in his Riverside County hometown — also strategized on policy issues. When he was chief of staff to Pérez, he helped get more Californians health care under Medi-Cal. He also worked with Pérez on a college scholarship program for middle-class families and helped current Assembly Speaker Toni Atkins (D-San Diego) win approval of a tax credit for the working poor.\n“Ultimately, the speaker makes the decision on the play that is called, and when that play is called I run it,” said Campbell, who played football at UC Davis. “But I clearly had the ability to be part of the discussion.”\nWhen Atkins became speaker last year, she said she kept Campbell as her chief of staff so she could “hit the ground running” because she will have to leave office next year.\n“I came in knowing I would be a very short-term speaker because of term limits,” she said. “I wanted someone who understood the Assembly and… he was uniquely situated to do that for me.”\nAtkins will step down as speaker in March, when Assemblyman Anthony Rendon (D-Lakewood) is scheduled to be sworn in. Rendon, who could hold office until 2024, hasn’t yet named his senior staffers.\n“I think there is a tremendous amount of value in having experienced staff. I also think there is tremendous value in members becoming experts,” Rendon said. “This is an opportunity to do that.”\nThough Campbell is leaving government, he’s likely to remain a presence around the Capitol. He plans to open a business working as a lobbyist and campaign consultant, a career path so common it’s called the revolving door. California law requires legislators who leave office to wait a year before they can register as lobbyists, but it doesn’t apply to staff.\nNow fully recovered from his non-cancerous brain tumor, Campbell is looking forward to being able to slow down.\n“I gave my life to this place,” Campbell said, glancing around his cramped office decorated with family photos and Seattle Seahawks mementos. “Almost literally.”","url":"https://calmatters.org/articles/departure-of-powerful-staffer-comes-amid-changes-in-capitol/"}
