{"authors":["Jack Hadfield"],"date_download":"2018-10-30 18:17:29","date_modify":"2018-10-30 18:17:29","date_publish":"2016-05-27 01:27:24","description":"After all, disrupting a peaceful speaker event by storming the stage and threatening violence is stressful work.","filename":"data/vaneerConsumption/DePaulWomensStudiesDeptCreatesSafeSpaceAfterMiloEvent.json","image_url":"https://media.breitbart.com/media/2016/05/10584676434_c9fee88d9a_k.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_05_26__1540923449.html","title":"DePaul Womens Studies Dept. Creates 'Safe Space' After Milo Event","title_page":"DePaul Womens Studies Dept. Creates 'Safe Space' After Milo Event","title_rss":"NULL","source_domain":"breitbart.com","text":"After the tumultuous events that unfolded at DePaul University on Tuesday night, when Black Lives Matter protesters rushed the stage at a Milo Yiannopoulos talk, the Women’s Studies Department has decided that because students are fragile, delicate human beings, they must create a safe space for them to recover.\nAn email sent from the department declared that they were “appalled that Milo Yiannopoulos was invited to speak … we are profoundly disturbed and distressed by the deep harm and damage this has caused to so many individuals, and to entire communities. We stand in solidarity with all of our students, and commit ourselves to working in partnership with you to respond to this intolerance and hate.”\nThe email went on to say that they want to “create a space in which we can come together … in the face of the hatred and attacks we’ve experienced against our identities and communities.” This so-called “healing space” would be used to “cultivate resilience, resistance and justice.”\nIt’s not surprising that the WS Department would come forward with such a plan, as safe spaces have been created after other Milo events before. After his appearance at Rutgers, where shrieking feminists smeared fake blood of their faces, they were so traumatised that they had to hold a group therapy session. One individual told the student newspaper that they “broke down crying” after the event, with another claiming that they felt “unsafe” on campus the next day.\nAt the University of Pittsburgh, the Student Government Board held a public meeting, with board members saying that they were “hurt.” Marcus Robinson, the president of the Pittsburgh Rainbow Alliance felt that “so many people in that room were in danger,” suggesting that councillors should have been provided in another area to help “traumatized” students.\nAt the end of the email, it was revealed that the department would be demanding a meeting with the DePaul University President, Dennis Holtschneider, along with filing a formal discrimination complaint. The full email can be read here.\nJack Hadfield is a student at the University of Warwick and a regular contributor to Breitbart Tech. You can follow him on Twitter here: @ToryBastard_.","url":"https://www.breitbart.com/social-justice/2016/05/26/depaul-womens-studies-department-organises-safe-space-milo-event/"}
