{"authors":[],"date_download":"2018-10-23 02:00:13","date_modify":"2018-10-23 02:00:13","date_publish":"2017-03-19 00:00:00","description":"Gahan speaks with NPR's Lulu Garcia-Navarro about making music in the context the 2016 presidential campaign in the US and Brexit in the UK.","filename":"data/vaneerConsumption/DepecheModesDaveGahanOnTheNewAlbumSpirit.json","image_url":"https://media.npr.org/assets/img/2017/03/15/photo-1-color---tour-poster---photo-credit-anton-corbijn_wide-d92c864ba4b4864064b88913551ef547ca1771d6.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=520273762_1540260013.html","title":"Depeche Mode's Dave Gahan On The New Album 'Spirit'","title_page":"Depeche Mode's Dave Gahan On The New Album 'Spirit' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"(SOUNDBITE OF DEPECHE MODE SONG, \"STRANGELOVE\")\nLOURDES GARCIA-NAVARRO, HOST:\nThe band Depeche Mode burst onto the scene in the 1980s with a new sound, synth pop, and an appeal to the dark and broody, the strangeness that we all carry in our souls.\n(SOUNDBITE OF SONG, \"STRANGELOVE\")\nDEPECHE MODE: (Singing) Strange love, strange highs and strange lows, strange love.\nGARCIA-NAVARRO: Songs like \"Strangelove\" and so many others took their cultish appeal mainstream. Their new album is called \"Spirit.\"\n(SOUNDBITE OF SONG, \"SO MUCH LOVE\")\nDEPECHE MODE: (Singing) There is something I can't hide. There is so much love in me.\nGARCIA-NAVARRO: Lead singer Dave Gahan joins us from our New York bureau. Welcome to the program.\nDAVE GAHAN: Nice to be here, I must say.\nGARCIA-NAVARRO: So nice to have you on. You live in the States, I take it.\nGAHAN: Yes, I live in New York City.\nGARCIA-NAVARRO: Yeah. So I'm assuming that this was written at a time when you were looking at the election, possibly. Is this a political album?\nGAHAN: Subject matter is definitely very social and pointing the finger in some places. Yes. I mean, the songs were written, I would say, you know, a good year, year and a half ago. But it was during a time of, you know, the elections and all the campaigning and all that kind of stuff that was going on. And also, we were kind of deeply affected by what was going on in our own home country, in the U.K., there with Brexit. The world in general, it's just kind of like, are we really listening?\nGARCIA-NAVARRO: Let's listen to a song that does seem to have a political bent to it. This is called \"The Worst Crime.\"\n(SOUNDBITE OF SONG, \"THE WORST CRIME\")\nDEPECHE MODE: (Singing) Misguided leaders, apathetic hesitation, uneducated readers for whatever reason.\nGARCIA-NAVARRO: So is this a call to arms, a lament?\nGAHAN: Actually, this is one of my favorite songs on the album. It has a beautiful melody, but lyrically it's pretty slamming the way we divide each other, you know, and racial divides and kind of calling out to really question that, to kind of check yourself, me included, everybody else included. Like, where do you really stand? You know, what are the choices you're really making? Do you really love thy neighbor, all that kind of stuff? And are you willing to accept the differences? We just seem to be slipping backwards.\nGARCIA-NAVARRO: Let's listen to another track off the album. This one's called \"Going Backwards.\"\n(SOUNDBITE OF SONG, \"GOING BACKWARDS\")\nDEPECHE MODE: (Singing) We can track it on the satellites, see it all in plain sight, watch men die in real time. We have nothing inside. We feel nothing inside, oh.\nGARCIA-NAVARRO: Speaking of going backwards, the band has a long history, back to the early '80s. But I read that you, quote, \"really had it out\" with your band mate Martin Gore during the recording process. What happened?\nGAHAN: Well, it's kind of gotten exaggerated more and more the more - and I've been asked that a lot.\nGARCIA-NAVARRO: Oh, really?\nGAHAN: And I wouldn't say - well, we definitely...\nGARCIA-NAVARRO: Well, kind of interesting, right? You guys have been together for so long.\nGAHAN: Yes. And, you know, Martin and I have had a strange relationship in all these years as well. I wouldn't say - look, we're not like bosom buddies. But at the same time we have a great deal of respect for each other as people and as musicians. It gets like that sometimes in the studio. A certain amount of tension I actually believe is very important when you're working on music. And - you know, and, of course, in the end we hugged it out and told each other how much we loved each other.\nGARCIA-NAVARRO: Aw.\nGAHAN: Got all soppy.\nGARCIA-NAVARRO: (Laughter).\nGAHAN: Look, we've been together for a long time.\n(SOUNDBITE OF SONG, \"YOUR MOVE\")\nDEPECHE MODE: (Singing) We had something, that was yesterday. Temptation's knocking at my door. You talk to me about the life we could've had, but we don't have that life no more. But I like the way you move.\nGAHAN: I think that this album is quite a special album. It was not one of the easiest albums to record, but, you know, most of them aren't. The good ones, they take a bit of work and they take a bit of diplomacy. And at the end of the day, you walk away and it's like, OK, what happened there? I don't really start to really understand what happened on the record until we start performing. And when we start performing certain songs that we recorded together in the studio, they start making a lot more sense to me. They take on a different life when the fans are there and the audience is there and they're participating in what is a concert and is kind of a spiritual event.\nGARCIA-NAVARRO: I have to tell this story because it was so amazing to me. Speaking of your fan base, you know, you were the soundtrack of my youth and of many of my peers' youth. And I was mentioning to one of our young producers that I was very excited for this interview, and she didn't know who you were. And I put this anecdote on Facebook and all of my friends flipped out. People were just so upset that they - that she didn't know who Depeche Mode was. And then they had all their Depeche Mode memories - the first time they saw you in concert. You inspire a great deal of loyalty still.\nGAHAN: Yeah. Well, you know, music's amazing like that. We've been fortunate enough to have been around for a long time. And first of all, thank you very much for that. But, you know, it does that for me. There's something that draws us together, the music and the fans. And I think that there's a - there's something in the music that appeals to one that's, like, feeling a little different - didn't quite fit in at school or at college or at work or the misfits. I mean, that's how we were. We didn't quite fit in. And we never really have, you know, musically, wherever it was - radio or whatever. It's always been like, what is this band? Where do they fit in? Are they a rock band? Are they a pop band? You know, it doesn't really matter. If it's good music it - you know, it's good music. And I think that we're fortunate that hopefully over the years we've made some good music.\nGARCIA-NAVARRO: Dave Gahan from Depeche Mode. Their new album is called \"Spirit.\" He joined us from our New York bureau. Thank you so much. This has been a real treat.\nGAHAN: Thanks, Lulu.\n(SOUNDBITE OF DEPECHE MODE SONG, \"COVER ME\")\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=520273762"}
