{"authors":[],"date_download":"2018-10-22 21:29:29","date_modify":"2018-10-22 21:29:29","date_publish":"2014-05-07 14:30:56","description":"While it is still illegal in the U.S., newsgathering drones are taking off in Latin American media.","filename":"data/vaneerConsumption/DeployingDronesforNewsGatheringinElSalvador.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/426431/140507-salvador-drones-1116_0765e7307477ec425dcd15bd77e194a4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_deploying-drones-news-gathering-el-salvador-n99226_1540243769.html","title":"Deploying Drones for News Gathering in El Salvador","title_page":"Deploying Drones for News Gathering in El Salvador","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSAN SALVADOR, El Salvador — At night on the western edge of this capital city, Borman Marmol looked like a middle-aged toy helicopter aficionado.\nHe leaned against his parked car, oversize remote control in hand, eyes to the sky. A deadly accident had cars backed up 25 miles on this part of the highway, and Marmol had a camera on the entire snaking traffic jam.\nSalvadoran newspaper La Prensa Grafica bought three unmanned aerial vehicles (UAVs) in January, becoming one of this country’s first media outlets to collect news with drones. When the word “drone” typically brings to mind raining death from above in modern warfare, photojournalist Borman Marmol is just taking pictures of stopped cars.\n“We’re showing the people what’s going on,” he said. “That way they can say, ‘Hey, I was there yesterday.’ Or ‘Oh, that’s why I was in traffic.’”\nOnlookers paused and gaped at the buzzing aircraft, with its flashing green and red lights. Most seemed to recognize it as the newspaper’s drone, at first marveling at the tool, then laughing as it flitted noisily over cars.\n“The New York Times can’t do what they’re doing,” said professor Matthew Waite of the Drone Journalism Lab at the University of Nebraska-Lincoln. “At least not without any serious legal hassle.”","url":"https://www.nbcnews.com/news/world/deploying-drones-news-gathering-el-salvador-n99226"}
