{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:17","date_modify":"2018-10-30 19:08:17","date_publish":"2018-07-24 05:56:16","description":"Family Separation Expands as ACLU Urge Children to File for Asylum","filename":"data/vaneerConsumption/DeportedMigrantsLeavingatLeast142ChildreninUSPerhapsHundreds.json","image_url":"https://media.breitbart.com/media/2018/07/GettyImages-986428800.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_23__1540926497.html","title":"Deported Migrants Leaving at Least 142 Children in U.S., Perhaps Hundreds","title_page":"Deported Migrants Leaving at Least 142 Children in U.S., Perhaps Hundreds | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The number of Central Americans migrants who have left their children in the United States has risen to at least 142 and may reach several hundred, according to a July 23 agency statement to a district court judge in California.\nThe rising total of self-separating families shows the foreign migrants are gaming the federal government’s asylum process to deliver their children to in-laws and relatives living in the United States. Once delivered by government officials, the migrants’ children can continue to apply for asylum, to attend Americans’ schools or and get jobs.\nThe same “Unaccompanied Alien Child” process has been used since at least 2010 to deliver more than 200,000 Central American children and youths to sponsoring relatives throughout the United States. In 2016, the Associated Press reported that at least 80 percent of the children were handed over to sponsors who are illegally in the United States. This agency cooperation with migrants is creating a semi-legal chain-migration pathway for foreign youths into the United States.\n“About half of the sponsors are a parent of the child, but the others are mostly close family members — aunts, uncles, that kind of relationship,” Kenneth Wolfe a spokesman for the Department of Health and Human Services, told Breitbart News. “It is not a deal-breaker” if the sponsor is in the United States illegally, he said.\nThe agency’s support for the parents’ children is shaped by President Barack Obama’s interpretations of the William Wilberforce Trafficking Victims Protection Reauthorization Act 0f 2008, whose text says it is designed “to combat trafficking in persons.”\nSo far, officials have not publicly challenged Obama’s interpretation of the 2008 law, even though officials are now telling migrants they have to take their children home with them. “All of these adults who left [the United States] without their kids, left based on a decision to leave their children,” Homeland Security secretary Kirstjen Nielsen said July 18 in an interview at the Aspen Security Forum. “So now we’re saying to them, ‘No, no, no, you have to take the children.’”\nThe numbers announced Monday are subsets of the 2,551 adults who were detained up to late June 27 by border agencies under President Donald Trump’s novel policy of enforcing border laws. The 2,551 migrants brought children aged five and older. However, the limited space at family-detention centers and the pro-migrant decisions by two judges — including U.S. District Judge Dana Sabraw — are forcing officials to release all migrant children after 20 days and to release most migrant groups as they come over the border.\nThe agency’s Monday statement to Sabraw said that 900 of those 2,551 adults have been ordered home with “final orders of removal,” 217 migrants have been released from detention, 879 migrants have been allowed to reunify with their children while in federal detention centers, and 917 adults are “either not, or not yet known to be eligible, for reunification.”\nThe legal memo says that 130 of the 2,551 parents “waived reunification” with their children, so leaving them in the United States. At least 12 deported adults in a prior group of 102 adults who carried children under four into the United States have also decided to leave their children behind.\nIn 463 cases, “case notes indicated adult is not in U.S., under review,” the statement says. This 463-strong group may include migrants who went home without formally waiving unification with their children.\nIn 64 cases, federal officials say they cannot release the child to the adult who brought the child into the United States. This group of 64 adults may include smugglers or criminals or parents with a criminal record. The document does not specify how many of their children will be allowed to stay in the United States.\nBREAKING: Trump admin releases new numbers on family reunifications. They still say more than 900 parents are \"ineligible\" to get their children back. For the first time, they disclose that more than 400 have been deported without their kids. pic.twitter.com/1faKDZQbtE — Alice Ollstein (@AliceOllstein) July 23, 2018\nThe document also mentions another group of 260 adults or children and noted that “many of these children have been discharged by ORR in appropriate circumstances. “ORR” is the Office of Refugee Resettlement at the Department of the Health and Human Services which is responsible for sheltering children for several weeks before delivering the migrant children to their sponsors in the United States.\nThe data suggest that the groups — 130 parents, 12 parents, 463 adults, 64 adults, and 260 adults or children — may result in roughly 700 children being placed in homes through the United States.\nACLU lawyers are asking Sabraw for more information about the migrants, partly so they can persuade the parents to separate from their children so ACLU can file asylum cases for the children. The ACLU-directed process can be used for the all 2,551-plus children once the parents have been set for deportation.\nThe Trump administration has 6 days to reunite the thousands of children it took from their parents. #FamiliesBelongTogether Here's what you need to know: pic.twitter.com/cRvS3MtmHR — ACLU (@ACLU) July 20, 2018\nIn 2017 and 2018, Democrats in the House and Senate have refused to reform this legal process. Business-first GOP leaders have refused to pressure Democrats to reform the process.\nMedia outlets are hiding the government-aided smuggling process under extensive and emotional coverage of “separated families.”\nThe media is also treating the dispute as if it only concerns 2,551 migrant adults and their children, but not the 330 million Americans who live in the United States.\nThe Washington Post, for example, reported the agency statement as if the parents are being forced to leave their children behind. Under the headline: “Government: 463 migrant parents may have been deported without their children,” the newspaper reported:\nThe Trump administration said in a court filing Monday that 463 parents of migrant children are no longer present in the United States, indicating that the number of mothers and fathers potentially deported without their children during the “zero tolerance” border crackdown could be far larger than previously acknowledged. The progress report to U.S. District Judge Dana M. Sabraw cautioned the 463 cases are “under review,” meaning the filing was not a definitive tally of all migrant parents who have been deported while their children remain in U.S. government shelters.\nHowever, the final paragraph briefly admitted:\nSo far, 130 of those parents have opted against a reunion, in some cases preferring their children be allowed to remain in the United States with another relative while their immigration appeals are pending.\nThe progressive TPM website ran with the headline, ‘”A Lot Of Work Left To Do’: Trump Admin Barrels Toward Deadline To Reunite Families”:\nThe Trump administration reported to a California federal judge on Friday afternoon that as of 7 a.m. that morning, 450 of the 2,551 migrant children older than age 5 who were taken from their parents have been reunited. U.S. District Judge Dana Sabraw, who previously took the government to task for missing reunification deadlines and making disingenuous arguments about the children’s welfare, gushed over the “great progress” made so far.\nThe child-smuggling route has been in operation since 2013 when District Judge Andrew S. Hanen slammed border agencies for working with people-smugglers. The Daily Caller reported in 2013:\nHomeland Security “successfully complet[ed] the mission of the criminal conspiracy” to smuggle the child across the border to her [illegal-immigrant] parent in Virginia, the judge wrote in an order issued on Dec. 13 … The smuggler, Mirtha Veronica Nava-Martinez, was arrested and the [client’s] child detained at a Texas border checkpoint when they were caught trying to use a birth certificate that belonged to Nava-Martinez’s daughter … “Customs and Border Protection agents stopped the Defendant at the border inspection point. She was arrested, and the child was taken into custody. The DHS officials were notified that [the Virginis-based mother] Salmeron Santos instigated this illegal conduct,” the judge continued. “Yet, instead of arresting Salmeron Santos for instigating the conspiracy to violate our border security laws, the DHS delivered the child to her — thus successfully completing the mission of the criminal conspiracy. It did not arrest her. It did not prosecute her. It did not even initiate deportation proceedings for her. The DHS policy is a dangerous course of action.” This was “the fourth case with the same factual situation this court has had in as many weeks,” Hanen wrote.\nThe Associated Press reported in 2016:\nIn response to a Freedom of Information Act request, the Department of Health and Human Services provided data showing that 80 percent of the 71,000 mostly Central American children placed between February 2014 and September 2015 were sent to sponsors who were not here legally. Another 6 percent were placed with adults who had temporary protected status, a U.S. government program that has let some Central American citizens stay and work in the country legally for more than a decade. Four percent were sponsored by American citizens and 1 percent by immigrants facing deportation proceedings. Many of the others were placed with sponsors who had other forms of legal status or who have filed immigration applications.\nMany of the 230,000 children and youths are being delivered by the federal government to their illegal-immigrant parents who are working illegally in underground economy jobs – despite the impact on Americans’ communities and schools. Some of the youths have been part of the murderous MS-13 gang.\nSince 2012, the Department of Homeland Security has referred at least 230,000 UACs to the HHS. Roughly 90 percent of them were released to sponsors throughout the United States, according to the HHS.\nThe loophole-plagued U.S. border law is understood by migrants, including José Ottoniel, who lives in a hilltop village in Guatemala, according to the Washington Post.\nThis summer, Ottoniel took his 10-year-old son up to the border hoping to get a U.S. job by using the boy to trigger the catch-and-release process. However, Trump’s novel zero-tolerance policy deported him — but not before he decided to leave the boy at an HHS-funded shelter in Texas:\n“It’s not that we don’t love him,” said José, 27. “It’s that we want him to have a better chance at life.” José and Elvia are pushing for Ervin to remain in the United States — away from the crushing poverty of his birthplace. Elvia, 31, has a cousin in Arkansas who agreed to take him in. The couple explained the situation to Ervin on the phone. They hung up, and they cried … “Right now, we think it’s best for him to have this opportunity in the United States, to get out of this place,” José said … One of the challenges in Ervin’s case is that his cousin in Arkansas is undocumented. He paints houses and does construction jobs, earning about $3,000 a month. He has two small children, both American citizens by birth. In the past, immigration authorities have been willing to release immigrant children to relatives in the country who do not have legal status …\nOttoniel borrowed $4,000 from a smuggler but earns only $21 per week in Guatemala. The family will likely lose their home to the bank to pay off the debt.\nSome deported migrants are glad to have their children back. In July, the U.S. government flew a one-year-old child back to his parents in Honduras after a judge ended his asylum hearing. According to the Associated Press, the boy’s father, Rolando Bueso Castillo, said:\nhe thought his [migration] plan was a beautiful one. He would escape his hard life in the tiny town of Libertad — Freedom, in Spanish. His children would not grow up in the same poverty that he had endured — he had dropped out of the fourth grade to sell burritos to help his single mom support him and his four siblings. His younger brother left the coffee-growing mountains of central Honduras for the United States seven years ago and thrived in Maryland with his wife and children. His sister followed, and also did well … He paid a smuggler $6,000, money his brother sent to him. Everything was supposed to be included — hotel stays, three meals daily and transport in an SUV with two other mothers and three children to the U.S. border … His wife, in her first trimester of pregnancy, would stay behind, working at her market stand selling Nike baseball hats, “California Dreaming” T-shirts and jewelry. In Maryland, their family would help mind Johan while Rolando worked. Adalicia would join them in a few months… He figured once he was processed he would be released with his son to fight his case in the courts. At worst, the two would be deported together back to Honduras.\nFour million Americans turn 18 each year and begin looking for good jobs in the free market — but the government provides green cards to roughly 1 million legal immigrants, temporary work-permits to roughly 3 million foreign workers, including at least 400,000 migrants seeking asylum.\nThe Washington-imposed economic policy of economic growth via mass-immigration shifts wealth from young people towards older people by flooding the market with foreign labor. That process spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions.","url":"https://www.breitbart.com/politics/2018/07/23/migrants-leave-at-least-142-children-us-perhaps-hundreds-more/"}
