{"authors":["Elizabeth Aguilera","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:31:31","date_modify":"2018-10-30 23:31:31","date_publish":"2017-04-19 19:41:13","description":"As immigration enforcement ramps up, so rises the fear of undocumented parents about the fate of their children if they are separated by deportation and","filename":"data/vaneerConsumption/DeportationsorphansWhocaresforchildrenwhenparentsareejected.json","image_url":"https://calmatters.org/wp-content/uploads/DEPORTABLE-PARENTS-Photo-1024x576.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540942291.html","title":"Deportation's orphans: Who cares for children when parents are ejected?","title_page":"Deportation's orphans: Who cares for children when parents are ejected? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As immigration enforcement ramps up, so rises the fear of undocumented parents about the fate of their children if they are separated by deportation and returned to their native country.\nWill the children stay in the United States? Who will care for them? Will someone transport the children to the parents wherever they are? Will U.S. authorities place them in foster care? And if so, will the parents be able to reclaim custody?\n“It is the worst-case scenario for families,” said Jorge-Mario Cabrera of the Coalition for Humane Immigrant Rights in Los Angeles. “It’s a horrible feeling, a horrible place to be to have to decide between the bonds that unite a family versus the future of those same loved ones.”\nThere are about 6 million U.S. citizen children with at least one parent who is in the country illegally. In California, nearly 2 million citizen children live with an unauthorized family member, according to a recent study by the Center for American Progress and the University of Southern California Center for the Study of Immigrant Integration.\nDeportation wreaks havoc on such families. Sudden displacement can leave one or both parents in another country—desperate to reunite with their youngsters or trying to make plans for their care from afar. Federal authorities do not transport anyone other than the deportee, so it’s up to the immigrant or the family to make arrangements to reunite later. Deportation can also mean the loss of a breadwinner, possibly forcing the remaining family members into deep poverty or even homelessness.\nThat’s why support groups encourage families with unauthorized parents to prepare for the possibility of deportation. Proper paperwork can lessen the risk of losing contact or, in the worst cases, of kids being placed in government custody or foster homes.\nWith renewed concern today, parents are now attending packed know-your-rights sessions or standing in long, early-morning lines to draft caregiver affidavits and temporary legal guardianship paperwork. They are selecting a family member or friend to take responsibility for their children if they are detained and/or deported.\nLucas Itzep and Maria Garcia arrived at the coalition’s Los Angeles offices pushing their 10-month-old son in a stroller. The couple want to ensure their family will remain intact, and worry if they were to be deported about the fate of their baby and their 3-year-old son. After 14 years in the U.S. from Guatemala, Itzep said separation from his young children is his main concern.\n“If I had to face it and I had to go back, then I must go with my children,” Itzep said. “We want to know if someone could take our children away. They have the right to be here but I cannot imagine if they were to be taken from me. If they separate us I think it’s something that we cannot go through.”\nThe couple are collecting birth certificates, getting passports for their children and ensuring they have the right documents to travel to and live in Guatemala. If they are separated from their boys, the couple will need those documents to prove their parenthood and reunite with their children.\nFor a child, there are several possible outcomes of parental deportation. They may be reunited with their parents in the home country; they may be left with family or friends; or—if they are home alone, no one picks them up from school, or care from friends of family family fails—they could end up in foster care. Some children may also be left with an older sibling, who is just out of high school or in college.\nIn a typical year the Coalition for Humane Immigrant Rights might have helped about 20 families create a plan for care of their children in case the parents are deported, according to Cabrera. But in just the three months since President Trump’s executive order was announced, he said, the organization has helped 300 families complete such a plan.\n“Millions of families had to face that circumstance under President Obama, but we were under the impression that some people were safe and that there could be a future beyond deportations of the ‘bad ones,’ ” Cabrera said. “Now there (are) no illusions. It’s very clear in the executive orders, in the way the leaders in Washington speak of immigrants, that no one is safe.”\nIn the first half of 2016, federal authorities deported nearly 15,000 people who said they were the parent of a U.S. citizen child, according to a report presented to Congress. The previous year, the Department of Homeland Security reported removing more than 30,000 such parents.\nBut recent studies by the Migration Policy Institute and the Urban Institute indicate that data is incomplete, and they estimate that the number of parents of citizen children deported each year is closer to 100,000. Most were fathers, and generally their children stayed in the United States with their mothers, or with relatives or friends.\nIt’s unknown how many children of deported parents are living with friends or relatives, or how many are in foster care, because government agencies do not keep track. But the studies show that deportation can plunge children, into deep poverty, homelessness, sickness and educational disparity.\n“Kids should not be bearing the brunt of what is happening with their parents,” said Heather Koball, a co-author of the studies and now director of family economic security for the National Center for Children in Poverty at Columbia University. “I feel like we are going backward in time.”\nSome who back more aggressive immigration enforcement say children should not be a consideration in deportation decisions.\n“However much people might empathize with the situation of the children of illegal immigrants, we must remember that the responsibility for their circumstances rests with the parents who knowingly violated the nation’s immigration laws and put their children in this difficult situation in the first place,” said Dave Ray, spokesman for the Federation for American Immigration Reform, which supports increased enforcement.\nSince 2013, the federal Immigration and Customs Enforcement agency has been taking a parenting or caregiver role into consideration when arresting someone. This is part of a directive known as “parental interests,” which also allows for a parent to call for childcare if a child is going to be left alone. The directive is still active, according to ICE.\nThe agency did not make someone available for an interview. However, spokeswoman Virginia Kice said in a statement: “ICE is committed to ensuring that the agency’s immigration enforcement activities, including detention and removal, do not unnecessarily disrupt the parental rights of alien parents and legal guardians of minor children.”\nThat same year in California, the Legislature passed the Reuniting Immigrant Families Act, designed to ease difficulties families were having trying to get kids back. The act says that a parent or relative cannot be disqualified from caring for the children because they are undocumented.\nIt also extended the period of time for child welfare agencies to locate deported parents and it helps establish agreements with foreign consulates to facilitate reuniting families. Those changes came in response to a 2011 study that estimated the number of children in foster care as a result of parental deportation to be about 5,000—and predicted the number would triple by 2016. In the report, researchers at the former Applied Research Center, now named Race Forward, found that the odds of reunification of deported parents and kids in foster care were very low.\nSetting up plans in advance helps, said Carmen Chavez, executive director of Casa Cornelia, a legal center for immigrants in San Diego.\n“If the state steps in, as far as reunification, that’s going to be a mighty feat if the parent is in Guatemala and lacks resources and the know-how of the legal system,” Chavez said. “It’s going to be hard to fight for parental rights from long distance. That means that potentially the relationship is lost.”\nOften parents want their children, especially the older ones, to stay in the United States with the other parent or a relative.\n“The thought was the parents had risked so much to come here and they did it to offer a better life for their kid—and they felt their kids would be better off if they could stay here and ultimately succeed,” said Koball, the researcher. “But it did mean they were separated from a parent.”\nWhen a parent or parents are deported, families are hit hard. If the removed parent is the sole breadwinner, the family—or just the children—are often left without resources and may become homeless.\n“The safety net for undocumented families is not that strong,” she said. “The family would face economic uncertainty and housing situations developed quickly under this high pressure situation. It is not very stable. The kids may not stay in one place for a long time.”\nThat’s what happened to David Torres, who was 11 when his stepfather was deported to Mexico in 2003. Within months his mother, who was also undocumented, moved the family to Mexicali to reunite with her husband.\nTorres, a citizen, had to leave middle school, his family apartment in Long Beach and his friends. In Mexicali he could not go to school, didn’t speak Spanish and had to work in fields of broccoli, melons and onions to help his family. He recalls how, for a time, they lived in an abandoned house and were robbed of the things they brought from the United States.\n“It was a very negative, very bad moment in my life,” said Torres, now 24. “My parents had to sell everything in Mexico to make a living. It’s really complicated.”\nAt 15, he returned to the United States alone, but he was so behind he could not attend regular high school. The family of a friend took him in and wanted to adopt him. During the time it took for the family to go through the adoption process, Torres was in the foster care system. By the time he was 18 one of his adopted brothers had been shot to death and Torres became homeless.\nTorres still lives on the street. He’s battled a drug addiction and lost his newborn to child protective services and the baby has since been adopted.\n“I lost a lot. Sometimes I feel like I wouldn’t have lost my kid if my mom was here. She took real good care of us,” said Torres, who has been getting help from the Youth Moving On program in Pasadena, which helps youth transitioning out of foster care. Through the program, he has an internship at a Kilt shop.\n“We would have never been homeless,” he said, his voice thick with emotion. “I know we would have still had everything.”\nThe State does not require counties keep data on how many kids in the system have a deported parent. Recently the Los Angeles County Department of Child and Family Services began tracking, via the hotline, if a child’s story includes a deported parent, said Cecilia Saco, supervising children’s social worker in the Special Immigrant Status Unit. Once a child is in custody, she said, caseworkers reach out to ICE if the parent is detained. If the parent has been deported, they will contact family members and try to reach the parent in the foreign country.\nParents hope to never be on the receiving end of that call.\nOn a recent Saturday morning in Los Angeles, Noe Perez, 32, arrived at the Coalition for Humane Immigrant Rights before 5 a.m. to get one of 20 coveted one-on-one legal consultation slots. The line behind him snaked down the block.\nHe’s been in the United States since he was 5 years old. Now he has a daughter that age. Perez is hoping to qualify for a visa for victims of crimes. Like many others he is exploring any legal standing he might have to stay. When he was about 7 years old, he said, an arsonist burned down his apartment building and several of his childhood friends died.\n“I will not leave her here,” he said of his daughter. “Why leave her in a country that is going to treat us so differently. When I came here, I didn’t know what was going on. My parents thought they were doing the right thing.”\nWhat Perez means is he would not leave his child in the U.S. to live indefinitely. If deported, and once in his native country. he would have to arrange for her to be reunited with him as ICE does not transport anyone except deportees.\nMaria Echeveria bundled up her 18-month-old son, Esras Daniel Elias, and waited in the dark morning air too. Her petition to stay in the United States recently expired and she has an appointment to report to federal immigration authorities in July.\nShe fears being deported back to El Salvador, she said in a teary whisper. “For my children that is the fear I have.”\nShe is terrified of being separated from her baby but worries about raising him in the violent country she fled. Echeveria’s pre-teen daughter came with her to the U.S., and the mother does not want to take her back to the dangerous conditions they left behind, where she says her girl was sexually molested —but also worries about leaving her behind, alone in the United States.\nGretchen Kuhner, director of the legal clinic Institute for Women in Migration in Mexico City, said the state where children are held often impacts the outcome. Several years ago, the institute tried to help two women who, after being deported, lost the children they left behind in Utah. Both children ended up in foster care, and then the parental rights were terminated and the children were adopted.\n“That’s why all of us are running around right now in the community organizations in the United States to make a family plan,” Kuhner said.\nKuhner said that unlike other states, California has consulate relationships and geography that sometimes allows parental visits on the border. “There are systems set up here that aren’t set up in other places,” she said. “Totally different if you have your kid an hour and a half away than if you are in Oaxaca and your kid is in Illinois.”","url":"https://calmatters.org/articles/deportations-orphans-cares-children-parents-sent-away/"}
