{"authors":["Carrie Kahn"],"date_download":"2018-10-22 21:22:24","date_modify":"2018-10-22 21:22:24","date_publish":"2018-07-20 00:00:00","description":"The Ramirez family tried to seek asylum in the U.S. The dad says he was deported, but his son and wife are being held in the U.S. in separate facilities.","filename":"data/vaneerConsumption/DeportedGuatemalanManDesperatelyAwaitsReturnOf9YearOldSonFromUSCustody.json","image_url":"https://media.npr.org/assets/img/2018/07/19/img_3657_wide-42d5d8bbea38b1f7ccbe3537e6004ec8c808d495.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_20_630459410_deported-guatemalan-man-desperately-awaits-return-of-9-year-old-son-from-u-s-cus_1540243344.html","title":"Deported Guatemalan Man Desperately Awaits Return Of 9-Year-Old Son From U.S. Custody","title_page":"Deported Guatemalan Man Desperately Awaits Return Of 9-Year-Old Son From U.S. Custody : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Deported Guatemalan Man Desperately Awaits Return Of 9-Year-Old Son From U.S. Custody\nEnlarge this image toggle caption Carrie Kahn/NPR Carrie Kahn/NPR\nThe Trump administration has one week left to meet a court-ordered deadline to reunite over 2,000 children separated at the border from their families suspected of entering the U.S. illegally.\nLogistically, it's going to be tough for the government. The children were sent to dozens of different shelters and foster homes around the United States, in many cases, thousands of miles from their detained parents.\nThen there are dozens more parents who've already been deported without their children, further complicating the reunification process.\nRudy Migdael Ramirez, 36, is one of those parents.\nHe opens the chain-link lock to his concrete house outside the town of Jutiapa in southern Guatemala to show NPR around.\n\"This is my son Rudy Jr.'s room, there's his bicycle and all his toys,\" Ramirez says of his 9-year-old. Asked why the boy doesn't have a bed in his room, he says, it's next door in his and his wife's room. They've always all slept in the same room, he says, not wanted to be apart, even for just a few hours.\nRamirez's hazel eyes are red and swollen. \"I just want them back here, with all of us sleeping together again. That's what I ask God for. Every night I ask God for mercy,\" he says, overcome with tears as he pauses. \"It's so painful not to have my son here, not to have my wife,\" he cries.\nRamirez says in early May, while they were in Guatemala, he and his wife began getting threatening phone calls from unknown people.\n\"First they called her phone, saying they were going to kill her. Then they called mine and said they would kill all of us,\" he says.\nRamirez reported the calls to the police. It's not uncommon for gangs to extort and threaten residents in Jutiapa, say local residents.\nThe calls didn't stop, so Ramirez says his family fled north, traveling through Mexico to the United States border. On June 8, he says, the family was attempting to cross into Texas, but somehow he and his son got separated from his wife. Soon he and Rudy Jr. were picked up by U.S. Border Patrol agents. Ramirez says he told them about the threats.\n\"They told me, 'why don't you apply for asylum in Mexico or Argentina, anywhere but here,' \" says Ramirez.\nThe following day, around 2 in the morning, the guards came for Rudy Jr. Ramirez says his son cried and cried, and he tried to comfort him, telling him he wouldn't go back to Guatemala without him. Rudy Jr. was sent to a shelter in New York City.\nRamirez says the officer gave him a bunch of papers to sign.\n\"I asked them if they were for my deportation, and they just laughed at me,\" he says.\nHe tried to show the officers the Guatemalan police forms he was carrying documenting the death threats. But according to Ramirez, the officer told him that the documents were not valid in the U.S. and that his son would be on the plane with him once he was deported.\nRudy Jr. wasn't on the plane. That was June 14. Ramirez hasn't seen his son. Nor has the boy's mother. She crossed into the U.S. a few days after her husband and son, hoping to reunite with them. She turned herself in to the Border Patrol. She's been in detention in Texas ever since.\nJodi Goodwin, her lawyer, says the mother is distraught. \"Oh my God, she is beside herself. She is deathly terrified that she might get deported and [Rudy Jr.] he might get stuck here and they will give her son to somebody else,\" says Goodwin.\nOn Thursday, the Trump administration said it has reunited 364 immigrant children with their families after they were separated at the border, but hundreds of minors still remain separated ahead of the July 26 deadline.\nGoodwin says it's unclear whether or how reunification will extend to parents already deported.\nImmigration and Customs Enforcement did not return requests for information about deported parents and how they will be reunited, nor about the Ramirez family's case. NPR could not independently confirm their story.\nIn the family's Guatemalan home town, the waiting has been excruciating.\nIn a sparse office overlooking Jutiapa's main plaza, Oscar Folgar, an official at Guatemala's Foreign Ministry, sees many parents going through what the Ramirez's are experiencing.\n\"At least 40 parents have been returned here and are waiting for their children to come back,\" says Folgar. He says he does his best to try to help them locate their loved ones and give them updates on when they will return.\nMaría Mendez Ramirez, the father's 62-year-old mother, hopes that day is soon.\n\"It's been two months, nearly two months since I've seen my baby,\" she says sobbing. She says she doesn't wish this anguish on any parent, or grandparent, and urges those leaving Jutiapa for the U.S. to reconsider their decision.\nThis week, Ramirez got word that his wife could soon be released.\nAs of Friday morning, she was still in detention waiting for Rudy Jr. to arrive from the shelter in New York.\nRelatives of the father in Guatemala said he was briefly hospitalized Thursday with symptoms of anxiety and unstable blood pressure.\nNPR international correspondent Carrie Kahn reported in Jutiapa, Guatemala.","url":"https://www.npr.org/2018/07/20/630459410/deported-guatemalan-man-desperately-awaits-return-of-9-year-old-son-from-u-s-cus"}
