{"authors":[],"date_download":"2018-10-30 21:56:51","date_modify":"2018-10-30 21:56:51","date_publish":"2016-11-07 15:32:00","description":"The 57-year-old man accused of killing a Peach County deputy and critically wounding a second has be...","filename":"data/vaneerConsumption/DeputyDarylSmallwoodcriticallyinjured.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/07/Images/newsEngin.16725556_crisp-county-prayers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_man-char_03264d829fb2f39f3e3835628ef93f27__1540936611.html","title":"Deputy Daryl Smallwood critically injured","title_page":"Deputy Daryl Smallwood critically injured","title_rss":"NULL","source_domain":"ajc.com","text":"The 57-year-old man accused of killing a Peach County deputy and critically wounding a second has been charged with murder and aggravated assault, the Georgia Bureau of Investigation said Monday afternoon.\nRalph Stanley Elrod allegedly shot both two deputies at close range Sunday afternoon when the two responded to an argument between neighbors, GBI Special Agent in Charge J.T. Ricketson said. Elrod appeared calm when the deputies confronted him, Ricketson said.\nBut when the deputies told Elrod he would be arrested for threatening to shoot a neighbor, Elrod pulled out a handgun from his waistband, Ricketson told The Atlanta Journal-Constitution.\n“The deputies were not on any kind of alert,” Ricketson said. “It appears to us that their guard was not up when they were confronting this guy.”\nElrod allegedly shot both Sgt. Patrick Sondron and Deputy Daryl Smallwood late Sunday afternoon near Byron, about 95 miles south of Atlanta. Within minutes, officers from the Byron police department arrived, and Elrod fired additional shots at officers, Ricketson said. Officers returned fire, wounding Elrod.\nSondron, 41, a married father, died at the Medical Center of Peach County. The county’s coroner, Kerry Rooks, told The AJC he was friends with the veteran deputy, who was a shift supervisor.\n“He was an asset to the Peach County Sheriff’s Office, and he was just a fine person,” Rooks said late Monday morning.\nRooks also knew Smallwood, who remained in critical condition at Navicent Health, formerly called Medical Center of Central Georgia, in Macon. Though optimistic Smallwood would recover, Rooks said the deputy may not survive.\n“It does not look very good at all,” Rooks said.\nSmallwood’s aunt posted on her Facebook page that he had been shot in the head. Monday afternoon, the aunt posted it would take a miracle for Smallwood to survive.\nSmallwood previously worked as a deputy with the Crisp County Sheriff’s Office, where deputies gathered Sunday night to hold hands and pray for his recovery.\nThe GBI said both deputies were responding to a dispute between two neighbors when the shooting happened. A man was upset about neighbors riding four-wheelers in the area and confronted them with a weapon, the GBI said.","url":"https://www.ajc.com/news/breaking-news/man-charged-with-murder-death-peach-county-deputy/6U3C1XhPC4Ew6DS1T2TRfI/"}
