{"authors":[],"date_download":"2018-10-22 20:43:23","date_modify":"2018-10-22 20:43:23","date_publish":"2014-06-02 20:17:22","description":"Charley Armendariz was found dead in his Phoenix home May 8 with evidence that was never turned over to the department, including traffic stop videos.","filename":"data/vaneerConsumption/DeputysSuicideComplicatesSheriffJoeArpaiosRacialProfilingCase.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2017_34/323801/140414-arpaio-jms-2155_ff8a9e1723924aa84eb711ceb3c3f225.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_deputys-suicide-complicates-sheriff-joe-arpaios-racial-profiling-case-n120626_1540241003.html","title":"Deputy's Suicide Complicates Sheriff Joe Arpaio's Racial Profiling Case","title_page":"Deputy's Suicide Complicates Sheriff Joe Arpaio's Racial Profiling Case","title_rss":"NULL","source_domain":"nbcnews.com","text":"PHOENIX — Inside the modest home belonging to a suicidal Maricopa County Sheriff’s deputy, investigators said they found a stash of evidence that was never turned over to the department: drugs, hundreds of fake IDs, personal information from drivers with Hispanic surnames and 900 hours of videotaped traffic stops.\nExactly why 40-year-old former deputy Ramon “Charley” Armendariz, who was found dead May 8 from an apparent hanging, amassed the collection remains a mystery. His sudden suicide has left loved ones who knew him as a man who proudly wore the uniform grappling with a motive.\n“This is all a shocker to us,” Armendariz’s cousin, Jennifer Canalda Talamantes, told NBC News on Monday. “There’s no closure, and it’s been very hard on everyone in the family.”\nWhile investigators try to unravel the bizarre actions that preceded Armendariz’s death, what he left behind could have implications for one person in particular — his former boss, controversial Arizona Sheriff Joe Arpaio.\nThe videos of the traffic stops, apparently taken from cameras mounted on Armendariz’s eyeglasses and dashboard, were supposed to be turned over in the racial profiling cases against Arpaio, the tough-talking Maricopa County Sheriff who has been accused of targeting Latino immigrants.\nBut for reasons still unknown, those videos were stored in Armendariz’s Phoenix home.","url":"https://www.nbcnews.com/news/latino/deputys-suicide-complicates-sheriff-joe-arpaios-racial-profiling-case-n120626"}
