{"authors":[],"date_download":"2018-10-30 14:13:11","date_modify":"2018-10-30 14:13:11","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/DerangedleftistmediawilldestroythecountryifRepublicansdontfight.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208668.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_10_deranged_leftist_media_will_destroy_the_country_if_republicans_dont_fight_comments_1540908791.html","title":"Deranged leftist media will destroy the country if Republicans don't fight","title_page":"Blog: Deranged leftist media will destroy the country if Republicans don't fight","title_rss":"NULL","source_domain":"americanthinker.com","text":"So hysterical is the left as the midterm elections approach that it has descended into unhinged moonbattery. Leftists fervently and viciously blame President Trump for the bad acts committed by mentally ill persons across the nation. They hoped and prayed that whoever was sending those fake bombs to prominent Democrats was a Trump-lover. When arrested, he was living out of a shiny white van plastered with suspciously looking like professionally applied pro-Trump decals and posters. According to the \"news,\" so often wrong, he registered as a Republican in 2016. But he had been a felon since 2004, so, in Florida, he could not have registered in either party. He had been a registered Democrat for many years prior. Considering how he lived, Cesar Sayoc may well not have been capable of finding the addresses of all those targets or of creating those ridiculously fake mail bombs that could not hurt... (Read Full Post)","url":"https://www.americanthinker.com/blog/2018/10/deranged_leftist_media_will_destroy_the_country_if_republicans_dont_fight_comments.html"}
It's possible he was someone's dupe, a plant, a victim of someone else's plan to harm Republican candidates in the upcoming election.\nWill we ever discover the truth? Not likely, but the FBI had better be investigating the finances of his family members, who are probably glad he is safely off the streets. Then came the worst murderous attack on a Jewish house of worship in U.S. history, at the Tree of Life Synagogue in Pittsburgh. Eleven people were killed while the killer shouted anti-Semitic screeds. This horrific act is also being blamed across the left media on President Trump. Apparently unaware that Trump's daughter and her family are Jewish, Julia Ioffe blamed him for the rise of anti-Semitism in America. How clueless can she be? Anti-Semitism is on the rise thanks to Barack Obama and his antipathy toward Israel, as well as the tenured radicals on our university campuses who hate Israel and embrace Islamists like Linda Sarsour, Keith Ellison, and Louis Farrakhan. Just how stupid do these Trump-haters think we are? They believe we are so incredibly clueless that we will not believe our lying eyes, will listen to them, and will think for one second that Trump has an iota of culpability for any of the crimes they are so quick to put on him, as though the actual perpetrator bore no responsibility. The left media has melted down so completely that they are incapable of realizing how pathetic they have become. They are figures of both derision and amusement. Watch the White House briefing. Sarah Sanders is a joy to behold when deflecting their foolish questions, so obviously meant to embarrass her and the president. She wins every time. Anyone paying attention, left or right, knows that the violence is all on the left, as is the violent rhetoric. Robert Creamer hired thugs to pick fights at Trump campaign rallies. Antifa is left and very violent. Occupy Wall Street was left and sometimes violent. Black Lives Matter is left and sometimes violent. There is simply no debate when it comes to this issue. Leftists feel duty-bound to commit violence in the furtherance of their agenda. They think they are winning hearts and minds, that millions of Americans agree with them. What they are doing is ensuring a red wave on November 6. The Democrats' behavior throughout the Kavanaugh hearings was not the beginning of normal Americans' contempt for leftist cruelty and lack of any semblance of ethics, but it sure kicked it into high gear. Blaming Trump and his supporters for fake mail bombs and the slaughter of Jews is beyond the pale – even Catherine the Great's anti-Semitic pale. Then there is the \"caravan\" that is actually a mob, including all that the word entails – gang members, human-traffickers, pedophiles, etc. Not one Democrat has spoken out against this invasion heading our way. This appears to have Soros's fingerprints all over it. He and his lefty pals in Latin America thought forcing more \"separation of families\" at the border would work against Trump. This is how stupid they are! This trick alone is winning over Hispanic and black voters to the GOP. Trump will use the U.S. military to prevent this harrowing re-enactment of Camp of the Saints. The left, both here and in Latin America, could not care less about the human beings they've encouraged to join this march with promises of entry into the U.S. They are just fodder for the left's pursuit of unending power and votes. The left media are so frenzied they will spend hours or days on Trump's use of a single word. He called himself a \"nationalist\" at a recent rally to distinguish himself from the globalists like Obama and the rest of the left, who feel guilty about America's success and power. One would think he admitted to being a member of the KKK; that is how absurd the response of nearly every anchor and guest on the leftist media was. They pretended he had said \"white nationalism,\" claiming that is what he meant. These not-journalists have been digging themselves into holes for years and need to learn to stop digging. The NYT and the WaPo have lost any sense of journalistic ethics; they've thrown them away altogether. No matter what event they \"report\" on, they will post an anti-Trump headline. So derisive of the president, they are willing to sacrifice everything that has made America great. Does anyone outside of the Beltway read these papers anymore? Not likely. These people write and publish for each other. They think the rest of us are irrelevant. The truth is that they, the mainstream left media, are irrelevant. The left and the leftist media are so furious at Trump's success – the economy, trade, defeating ISIS, two terrific SCOTUS justices, de-regulation, etc. – that they are prepared to do anything to stop him, no matter how devastating to the country. Vote next Tuesday to save the GOP majority. The thought of Pelosi, Maxine Waters, and Adam Schiff with gavels in hand is a Halloween horror story.","url":"https://www.americanthinker.com/blog/2018/10/deranged_leftist_media_will_destroy_the_country_if_republicans_dont_fight.html"}
