{"authors":["Jonny Singer For Mailonline"],"date_download":"2018-10-22 22:18:51","date_modify":"2018-10-22 22:18:51","date_publish":"2016-01-29 09:16:44","description":"Stephen Warnock says Derby are relishing the chance to take advantage of Manchester United's poor form and pile the pressure on Louis van Gaal.","filename":"data/vaneerConsumption/DerbydefenderStephenWarnocksaysManchesterUnitedaretheretobebeaten.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30919F1100000578-0-image-a-10_1454058969044.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422400_Derby-defender-Stephen-Warnock-says-Manchester-United-beaten_1540246731.html","title":"Derby defender Stephen Warnock says Manchester United are there to be beaten","title_page":"Derby defender Stephen Warnock says Manchester United are there to be beaten | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stephen Warnock says Derby are relishing the chance to take advantage of Manchester United's poor form and pile the pressure on Louis van Gaal.\nUnited have won just three of their last 13 games, prompting claims that Van Gaal was on the verge of leaving the club.\nAnd Warnock, who used to play for United's rivals Liverpool, says it is a good time to face the 11-time FA Cup winners, when they meet on Friday night.\nStephen Warnock (left) believes that Derby are playing Manchester United at a good time on Friday\nManchester United have won just three of their last 13 games, and Warnock thinks Derby can take advantage\n'We look at it as a good time to play United because they have been in a bad spell,' Warnock said. 'But they will look at Derby and think the same way.'\nDerby themselves are in the midst of a difficult run, with just one point from their last four league games, and Warnock knows what it is like to be desperate for a win in the cup.\n'To be honest, I don't take any pleasure from seeing United struggle,' he added.\n'Although I grew up in Liverpool, and it's one of those situations you'd love to have seen as a kid, when you ­understand how hard it is to get out of it, you realise how they must be feeling.'\nDespite having grown up in and played for Liverpool, Warnock says he is not enjoying Untied's struggles","url":"https://www.dailymail.co.uk/sport/football/article-3422400/Derby-defender-Stephen-Warnock-says-Manchester-United-beaten.html"}
