{"authors":[],"date_download":"2018-10-22 20:43:02","date_modify":"2018-10-22 20:43:02","date_publish":"2014-05-02 14:40:39","description":"In an exclusive interview, controversial trainer Rick Dutrow, banned from horse racing for 10 years, says, 'I've never cheated to win in my life.'","filename":"data/vaneerConsumption/DerbyWinnerinExileTrainerRickDutrowFightsforHisRacingLife.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/416706/140502-dutrow-big-brown-file-130p_04bc33cfd54ded72251184370e190358.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_kentucky-derby-2014_derby-winner-exile-trainer-rick-dutrow-fights-his-racing-life-n95636_1540240982.html","title":"Derby Winner in Exile: Trainer Rick Dutrow Fights for His Racing Life","title_page":"Derby Winner in Exile: Trainer Rick Dutrow Fights for His Racing Life","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRick Dutrow has sipped horse racing’s sweetest nectar, winning the 2008 Kentucky Derby with Big Brown. Now he’s tasting its bitterest dregs, fighting to overturn a 10-year suspension for two drug violations that branded him a “cheater.”\n“I’ve never cheated to win a race in my life,” the 54-year-old Dutrow insisted this week in an exclusive interview with NBC News, his first extensive comments about his case since he began serving his suspension on Jan. 17, 2013. “… I wouldn’t know the first thing about how to cheat to win a race.”\nThe colorful and controversial trainer, whose horses have won nearly $80 million in purses over his 24-year training career, has long been a polarizing figure in the so-called Sport of Kings. Few question his horsemanship, but many have been quick to conclude that he also had chemistry in his corner.\nWhen his 10-year suspension and a $50,000 fine were imposed last year, New York Times turf writer Joe Drape wrote that Dutrow “is seen by many as the face of much of what is wrong with racing.”\nDutrow already has appealed the suspension – levied for a drug “overage” in one of his horses and the discovery of prohibited syringes and needles in his barn at Aqueduct racetrack in Queens, N.Y. -- through horse racing’s administrative process and in New York state courts, losing each round. He is now pinning his hopes on a federal lawsuit that argues he was \"substantially and irreparably harmed\" by the suspension –- one of the most severe penalties ever imposed in American racing -- and deprived of due process under the law. In addition to reinstatement of his trainer’s license, Dutrow is seeking $20 million in damages.\nMany legal experts see it as an uphill battle, but the trainer of Derby and Preakness Stakes winner Big Brown and other top-flight racehorses like Saint Liam, Benny the Bull, Silver Train and Kip Deville says he’s determined to disprove the accusations against him.\n“I remember the very first phone call, when Mouse (assistant trainer Juan Rodriquez) …. said that they found needles in my barn,” said Dutrow, the son of legendary Maryland-based trainer Richard E. Dutrow Sr. “I said to myself, ‘Man, These people ain’t never, ever going to leave me alone. They’re just going to keep on and keep on and keep on. I said I’ve got to put my gloves on. I gotta go fight these people.”\nRick Dutrow gives a mint to Big Brown on April 17, 2008, after the colt won the Florida Derby. Marc Serota / Getty Images\nDutrow maintains he was targeted by New York racing authorities and other industry officials because of his penchant for making truthful but embarrassing comments about certain racing practices, a rowdy past that included drug abuse and his numerous successes “claiming” horses from other owners and improving them.\n“You know what my problem is? I won too (many) big races out there for these people,” he said. “They just can’t stand it and they decided to end it for me. So far they got a leg up on me, but we’re not done.”\nLee Park, a spokesman for the New York Gaming Commission, declined to comment on the lawsuit or Dutrow’s assertions, saying, “It would be inappropriate for the Gaming Commission to comment beyond noting that the facts and the records speak for themselves.”\nSpeaking from his home on New York’s Long Island, Dutrow’s demeanor was as changeable as the weather on a spring day during the 40-minute interview on Thursday -- resolute one minute, tearful the next as he recalled the experience of getting Big Brown ready to fly from Florida to Louisville, Ky., for the Derby.\n“I remember that when we were at Palm Meadows (training center) and we were just waiting on the plane to come pick him up,” he recalled. “… My God, it was so thrilling. …. My stomach was turning and I was so anticipating getting on that plane … and going there with Big Brown. … I want to do it again.”\nWhether that chance occurs before Dutrow’s suspension runs its course will depend on the U.S. District Court for Eastern New York.\nAnd even then, there would be no certainty that New York would be willing to relicense Dutrow, given the animosity that has built up over the years.\nWhen Dutrow’s suspension was finalized, John Sabini, then chairman of what was then the New York Racing and Wagering Board, issued a statement saying that racing had “no place or patience for Mr. Dutrow. His repeated violations and disregard of the rules of racing has eroded confidence in the betting public and caused an embarrassment throughout the industry.”\nThose views stemmed from Dutrow’s long record of violations -- more than 70 infractions at 15 racetracks in nine states -- and comments like the one that ignited a controversy during Big Brown’s Triple Crown campaign, where he admitted giving the colt the anabolic steroid Winstrol, a legal but seldom acknowledged practice at the time.\nFollow NBC News Investigations on Twitter and Facebook.\nDutrow acknowledges that he gave therapeutic medications to his horses, but denies that he overused or unnecessarily administered such drugs. Instead, he said, he focused on correcting their mechanics, working on their feet and giving them vitamins.\n“When I get a horse in my barn, man he gets that full court press,” he said. “… These horses need to be happy. We let them be happy, period.”\nRick Dutrow (L, with blue shirt) celebrates with jockey Kent Desormeaux after Big Brown wins the 134th running of the Kentucky Derby on May 3, 2008 at Churchill Downs in Louisville, Kentucky. Andy Lyons / Andy Lyons/Getty Images\nDutrow’s defenders –- and he has many -- suggest he was a convenient scapegoat for racing officials looking to strike an aggressive pose in the face of proposed federal legislation to regulate horse racing, which is currently handled at the state level.\nThey also note that most of the infractions on his record were relatively minor, such as showing up late in the paddock with a horse or failing to file foaling papers, and wonder why the New York Racing and Wagering Board originally imposed a 90-day suspension before reversing itself and levying the 10-year ban.\nAmong those who don’t think Dutrow always got a fair shake is Stephen Barker, who runs the state equine drug testing laboratory in Louisiana. He notes that the drug offenses on the trainer’s record are nearly all for “overages” – higher levels of legal therapeutic substances than are allowed by racing’s rules – not for illegal substances aimed at giving a horse a competitive edge.\n“He’s got an abrasive personality that sets a lot of people off,” Barker said of Dutrow. “… He did have a lot of drug positives, but almost all of them are therapeutic drugs, not the things that people use to cheat. … People in the stewards hearing and full commissions, they just weren’t inclined to cut him any breaks because he was a nice guy.”\nBarker testified as an expert witness for Dutrow before New York racing authorities, saying that the overage violation for the painkiller butorphanol, detected in urine tests on a Dutrow-trained horse named Fastus Cactus on Nov. 20, 2010, was detected in minuscule quantities that could not have improved the horse’s performance.\n“It was a low level, scientifically meaningless,” he told NBC News, adding that the positive could have resulted from accidental contamination.\nBut the state of New York also presented its own expert, state drug-testing lab director Dr. George Maylin, who testified that the detection of the drug in Fastus Cactus’ urine indicated the drug had been administered within 96 hours of the race -- inside the window prohibited by New York racing regulations. The racing officials who decided the case -- Chairman Sabini, Daniel Hogan and Charles Diamond -- sided with Maylin and found Dutrow guilty.\nMaylin told NBC News on Friday that he stands by his testimony, and noted that other racing jurisdictions subsequently adopted the lower threshold for butorphanol.\nThe drug positive alone would likely not have triggered a lengthy suspension, but the discovery of three hypodermic needles and syringes filled with the legal painkiller Rompun (also known as xylazine) in Dutrow’s barn at Aqueduct racetrack was more problematic. Racing regulations require that all such substances on the racetrack be administered by licensed veterinarians and bar trainers or other track workers from even possessing such gear.\nDutrow subsequently took a polygraph exam that indicated he was unaware of the source of the needles or the drug.\nBut in his interview with NBC News, Dutrow said he believes the needles were planted in a desk drawer of a barn office by racing investigators during what they described as a “training exercise” for new security personnel while he was out of town at the Breeders’ Cup.\n“Before (when) they’ve done a search in our barn, it took them two hours -- a proper barn search,” he said. “… But here they come along and they do a 10-minute barn search. … They walked down the barn, walked into one room. They made the blacksmith leave… and they pull out a box of stuff. It’s a joke.”\nDutrow says that an investigation of his veterinary records would have shown that he did not use the drug, a sedative that is typically used to calm unruly horses, but that none was ever conducted. He also contends that the needles were immediately removed from the barn and never tested for fingerprints or otherwise investigated to see if their source could be determined.\n“Instead of closing down my barn and investigating my barn, they leave,” he said. “… It’s all a set-up.” (Sidney Anthony, vice president for security with the New York Racing Association, did not respond to a request for comment.)\nWhile Dutrow continues to contest the facts of his case, his federal lawsuit hinges on the actions of the Kentucky-based Association of Racing Commissioners International , which took the unusual step of sending a letter and issuing a press release on Feb. 17, 2011 -- after the New York Racing and Wagering Board had suspended Dutrow for 90 days -- urging it to instead revoke his license due to his long history of violations.\n“At some point, an individual who continues to violate the rules of racing forfeits through his own actions the ability to be in the game,” said the letter, signed by ARCI President Edward Martin. “At some point, enough is enough.”\nThe lawsuit argues that Sabini, the chairman of the state board at the time, also served on the Board of Directors, the Executive Committee and as chairperson of the board-elect of ARCI and should have recused himself from reconsidering Dutrow’s punishment.\nInstead, it states, “Sabini was both accuser (through ARCI) and judge and executioner (through the state Racing and Wagering Board).” (Sabini and his fellow former commissioner, Diamond, could not be reached for comment by NBC News. Hogan declined to comment.)\nMartin did not respond to a request for comment, but Jeremiah Byrne, who is representing ARCI in the Dutrow lawsuit, provided this statement: “Throughout all the pleadings that Dutrow has filed, he has never denied that he has a history of cheating. Also, ARCI only gave information to the New York Racing Commission, and it was the racing commission that acted against him. We are confident we will prevail in the case.”\nThat confidence extends to the plaintiff’s table as well, as Dutrow says he expects to be back in his barn soon.\n“We just need an opportunity to prove our point, to prove our case,” he said. “Once we do, I’m confident that we’re going to be OK. How can I not feel confident? I mean I haven’t done any of this that they’re accusing me of.”","url":"https://www.nbcnews.com/storyline/kentucky-derby-2014/derby-winner-exile-trainer-rick-dutrow-fights-his-racing-life-n95636"}
