{"authors":["Sportsmail Reporter"],"date_download":"2018-10-22 23:05:22","date_modify":"2018-10-22 23:05:22","date_publish":"2016-01-29 10:51:30","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/DerbyCountyvsManchesterUnitedTeamnewskickofftimeprobablelineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30AC2A5400000578-0-image-a-4_1454064270324.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422526_Derby-County-vs-Manchester-United-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash_1540249522.html","title":"Derby County vs Manchester United: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash","title_page":"Derby County vs Manchester United: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Manchester United's trip to Championship side Derby County.\nTeam news\nDerby County\nPaul Clement has confirmed that Derby will be at full strength for the visit of Manchester United on Friday night.\nWill Hughes, Craig Forsyth and Max Lowe are all injury absentees, but Clement has no further injury concerns.\nProvisional squad: Grant, Christie, Bryson, Buxton, Keogh, Hendrick, Martin, Bent, Russell, Baird, Shackell, Johnson, Carson, Butterfield, Camara, Roos, Blackman, Ince, Weimann, Hanson, Calero, Olsson, Ssewankambo, Shotton, Thorne, Mitchell, Warnock\nPaul Clement has confirmed that Derby will be at full strength for the visit of Manchester United\nManchester United\nMidfielder Michael Carrick could return for the trip to Derby after four games out with a knee injury. The 34-year-old is now available again but is not ready to play 90 minutes.\nUnited will be without full back Matteo Darmian, who is sidelined after colliding with Southampton's Shane Long last week, while midfielder Bastian Schweinsteiger (knee) and defender Phil Jones (ankle) are still out. Marcos Rojo, Luke Shaw, Antonio Valencia and Ashley Young are long-term absentees.\nProvisional squad: De Gea, Romero, Varela, Borthwick-Jackson, Smalling, Blind, McNair, Schneiderlin, Herrera, Carrick, Fellaini, Depay, Lingard, Powell, Mata, Januzaj, Pereira, Martial, Rooney, Keane.\nMidfielder Michael Carrick could return for Manchester United's trip to Derby\nKey match stats (supplied by Opta)\nDERBY v MANCHESTER UNITED Kick-off: Friday, 7.55pm - BBC One Odds (subject to change): Derby 17/5 Draw 5/2 Manchester United 19/20 Referee: Anthony Taylor Managers: Paul Clement (Derby), Louis van Gaal (Manchester United)\nDerby have lost each of their last six FA Cup ties against Manchester United, conceding 19 goals in the process (3.2 goals per game).\nIndeed, the Rams haven’t won an FA Cup tie against Man Utd since February 1897.\nDerby last beat a top-flight side in the FA Cup in January 1998 (vs Southampton) . However, they haven’t beaten a top-flight side when out of the top league since 1984, winning 2-1 against Norwich.\nThe Red Devils have lost just one of their last 44 FA Cup games against lower-league opposition, falling at home to Leeds in January 2010 (W36 D7).\nCristiano Ronaldo (left) and Robbie Savage were in action when Manchester United faced Derby in the FA Cup fifth round at Pride Park in February 2009\nDerby have lost just one of their last 11 competitive home matches (W7 D3 L1), although this defeat came in their last game there – 0-3 versus Birmingham City.","url":"https://www.dailymail.co.uk/sport/football/article-3422526/Derby-County-vs-Manchester-United-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash.html"}
