{"authors":["Regina F. Graham For Dailymail.Com"],"date_download":"2018-10-22 20:18:11","date_modify":"2018-10-22 20:18:11","date_publish":"2016-01-29 01:02:46","description":"Authorities say Derek Loville, a former Super Bowl winning NFL player, has been busted as a member of an international drug trafficking ring alongside 21 others Thursday.","filename":"data/vaneerConsumption/DerekLovilleindictedininternationaldrugtraffickingandgamblingring.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE549500000578-0-image-a-14_1454031397201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422032_Ex-Super-Bowl-winning-NFL-player-indicted-international-drug-trafficking-gambling-ring-used-terrifying-scare-tactics_1540239491.html","title":"Derek Loville indicted in international drug-trafficking and gambling ring","title_page":"Derek Loville indicted in international drug-trafficking and gambling ring | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Authorities said the crimes occurred between June 2011 up until this month, and the operation reached as far afield as Mexico and Australia\nA former Super Bowl winning NFL player has been busted as a member of an international drug trafficking ring that would threaten debtors by playing them beheading videos, authorities say.\nAccording to an indictment, Derek Loville, 47, sold drugs in Arizona for the narcotics ring that also extended into Brooklyn, The New York Post reported.\nLoville won a pair of Super Bowls during his eight-year NFL career in which he played for teams like the Seattle Seahawks, Denver Broncos and San Francisco 49ers.\nHe was charged Thursday along with 21 others in a federal indictment that also included money laundering, racketeering conspiracy and illegal gambling.\nFormer NFL player Derek Loville, 47, has been busted as a member of an international drug trafficking ring that would threaten debtors by playing them beheading videos. Above he is pictured playing at the 1995 Super Bowl for the winning team, the San Francisco 49ers\nAuthorities say Loville (pictured in 1999 in the Denver Broncos) sold drugs in Arizona for the narcotics ring that also extended into Brooklyn\nAuthorities also nabbed the group's ringleader, Owen 'O-Dog' Hanson, who is a former University of Southern California football player last year.\nHanson, 33, was arrested last September while he finished playing a round of golf at an upscale California country club, the Post reported.\nAuthorities were able to arrest 19 of the defendants Thursday morning across the country, while Giovanni 'Tank' Brandolino, 41, was arrested by DEA agents last October in Brooklyn.\nThe Post reported that the last defendant in the case, Kenny Hilinski, is on the run in Peru.\nThe Los Angeles Times reported that some of the people allegedly involved in the ring were arrested in Los Angeles, Orange, Sacramento and San Diego counties. Others were caught by authorities in Louisiana and Virginia.\nAuthorities say Owen 'O-Dog' Hanson, who is a former University of Southern California football player, is the group's ringleader\nAuthorities said the crimes occurred between June 2011 up until this month, and that their operation was far-reaching with connections throughout the U.S., Mexico and even Australia.\nAccording to a man involved in the probe named Robin Hood 702, the drug operation ring, known as ODOG Enterprise, used the 'most terrifying scare tactics' to get people who owed them money to comply with their demands, the Post reported.\nHe told the Post that he became a target of the drug ring when they tried to get him to launder $20million.\nThe drug traffickers allegedly sent him a shocking DVD to his home in Santa Monica, California that showed two men being beheaded by a pair with a chain saw and a butcher's knife.\n'A family member opened the DVD thinking it was a video of her sister's newborn baby,' Robin Hood 702 told the Post. 'Then she watched it and freaked out. She had nightmares for years.'\nIn addition, Robin Hood 702 said he received a picture in the mail from Hanson showing himself in a Mexican wrestler's mask and holding a shovel in front of his parents' gravesite.\nThere was blood red paint splattered across his mother's tombstone, he told the Post.\n'When they desecrated my mother and father's gravesite, I knew I had to put these guys in jail for a long time,' Robin Hood 702 told the Post.\nHe earned the nickname Robin Hood 702 after donating thousands of dollars he has won at Las Vegas casinos to various organizations and people in need. He also made headlines for rescuing a man from a fire in 2014.\nRobin Hood 702 said the drug trafficking ring used 'the most terrifying scare tactics' to get people who owed them money to comply with their demands. Above he is pictured after he saved a man's life in a fire in 2014 in Santa Monica, California\nThe indictment against the ring also alleges they took bets on college, NFL football games and MLB games.\nHanson's attorneys disputed the accusations against him Thursday afternoon.\n'The specific allegations against Mr. Hanson are both surprising and spurious,' an email from attorneys Russell S. Babcock and Ryan T. Mardock said according to the Times.\n'Mr. Hanson, a former USC football player, has never engaged in violent or intimidating conduct beyond the football field.","url":"https://www.dailymail.co.uk/news/article-3422032/Ex-Super-Bowl-winning-NFL-player-indicted-international-drug-trafficking-gambling-ring-used-terrifying-scare-tactics.html"}
