{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:03:40","date_modify":"2018-10-30 22:03:40","date_publish":"2015-12-16 14:44:47","description":"A poll exploring public attitudes to different groups in the UK has found that the most disliked of all is young white men in their twenties","filename":"data/vaneerConsumption/DeridedYoungWhiteMenMostHatedGroupInBritain.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-16-at-13.22.59.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_16__1540937020.html","title":"Derided: Young White Men Most Hated Group In Britain","title_page":"Derided: Young White Men Most Hated Group In Britain","title_rss":"NULL","source_domain":"breitbart.com","text":"An extensive poll exploring public attitudes to different demographic groups in the UK has found that the most disliked of all is young white men in their twenties. The British public considers them the laziest, rudest, most promiscuous, drunken drug-taking people on these isles.\nYouGov, the polling agency, concluded that it is “clear that these [common prejudice] judgments are seldom racist in the traditional sense.” Gender proved to matter more than age or ethnicity in such judgments, with four of the top five groups being women. Age also trumped ethnicity in some cases.\nA fact not mentioned in almost any of the mainstream coverage of the survey was that Pakistani-born men in their twenties were seen as less likely than any other group to be honest or to help others. However, they came off better that Australian men, Black men and White women overall.\nYoung white men scored joint worst with young black Caribbean men for likelihood to take drugs, and outright bottom in all of the other negative categories including politeness. They also scored second worst on five positive traits.\nYoung Polish men, for example, are generally held in much higher regard that young white men.\nYouGov surveyed 48 different demographics for Prospect Magazine, in 48 separate surveys reduce the chances of respondents giving cautious and politically correct answers by comparing the groups.\nThe polling company asked people how likely it was that a group possessed five positive and five negative traits.\nPositive traits were intelligence, honesty, politeness, likelihood to work hard and likelihood to help others. The negative traits were proneness to violence, likelihood to travel without a ticket, likeliness to take drugs, drunkenness and likelihood to have many sexual partners.\nYoung can explore all of the data in an interactive table here.","url":"https://www.breitbart.com/europe/2015/12/16/derided-young-white-men-hated-group-britain/"}
