{"authors":["Robert Kraychik"],"date_download":"2018-10-30 21:43:36","date_modify":"2018-10-30 21:43:36","date_publish":"2018-10-29 22:08:14","description":"Ron DeSantis told Breitbart News that his Democrat opponent Andrew Gillum \"is basically a Bernie Sanders left-winger.\"","filename":"data/vaneerConsumption/DeSantisExplainsAndrewGillumsLeftismPatternofCorruption.json","image_url":"https://media.breitbart.com/media/2018/10/desantis-gillum-split.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_29__1540935816.html","title":"DeSantis Explains Andrew Gillum's Leftism, Pattern of Corruption","title_page":"DeSantis Explains Andrew Gillum's Leftism, Pattern of Corruption","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Ron DeSantis (R-FL) told Breitbart News that Andrew Gillum — his Democrat opponent in Florida’s gubernatorial race — “is basically a Bernie Sanders left-winger.” He offered his remarks in a Monday interview on SiriusXM’s Breitbart News Daily with host Alex Marlow.\nDeSantis said, “My opponent Andrew Gillum is basically a Bernie Sanders left-winger who will do a lot to destroy what’s made Florida great, so it’s a pretty clear contrast [between him and I].”\nLISTEN:\nDeSantis added, Andrew Gillum wants to abolish ICE. He wants to have open borders He believes in sanctuary cities and making Florida a sanctuary state. He is somebody who is openly hostile to law enforcement, and actually signed an anti-police pledge saying law enforcement should be defunded and the police and prisons have no place in justice.”\nSen. Bernie Sanders (I-VT) endorsed Gillum’s campaign, given Gillum’s support for “universal health care” and calls for abolition of Immigration and Customs Enforcement (ICE).\nDeSantis stated, “[Andrew Gillum] hates Trump so much, he’s so ideological that he would choose to jeopardize the safety of our communities rather than simply working constructively with the federal government,” noting Gillum’s refusal to commit to compliance with federal requests for detainers of criminal aliens if elected governor.\nDeSantis continued, “The media is not interested in exposing Gillum, at all, on any of this stuff. They’re trying to package him up as this good guy.”\nMarlow said, “[Andrew Gillum is] a far-left radical, He went to this training school that is sort of a Soros-funded group that produced Linda Sarsour and others to become left-wing revolutionaries. … This is a hard-left guy… He is a true radical revolutionary.”\n“[Andrew Gillum is] always supporting taxes across the board,” said DeSantis, adding, “That would be the end of Florida as we know it if we were go down that road.”\nDuring last Tuesday’s Florida gubernatorial debate, Gillum suggested that scrutiny of an FBI-led investigation of corruption in Tallahassee is is motivated by anti-black racism targeting him due to his race. “The goal is obviously to use my candidacy as a way to reinforce, frankly, stereotypes about black men,” said Gillum, ascribing racial motives to the publication of text messages and emails between himself and an undercover FBI agent.\nDeSantis said, “It’s not about black vs. white. It’s about right vs. wrong, and this is a guy who has consistently used public office to feather his own nest. It’s started on the commission. He would vote himself benefits. He voted himself over $80,000 in additional retirement benefits, and then he turned around and raised property taxes on people.”\nDeSantis concluded, “[Corruption] is a pattern with this guy, so I’m sure there are no limits to what he’s willing to do in using his office to benefit himself.”\nBreitbart News Daily broadcasts live on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nFollow Robert Kraychik on Twitter.","url":"https://www.breitbart.com/politics/2018/10/29/exclusive-desantis-explains-andrew-gillums-leftism-pattern-of-corruption/"}
