{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 19:50:23","date_modify":"2018-10-30 19:50:23","date_publish":"2017-04-21 16:24:40","description":"DeShone Kizer loves him some DeShone Kizer. | Sports","filename":"data/vaneerConsumption/DeShoneKizerClaimstoHavetheIntellectofTomBradyBodyofCamNewton.json","image_url":"https://media.breitbart.com/media/2017/04/deshone-kizer.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_04_21__1540929023.html","title":"DeShone Kizer Claims to Have the ‘Intellect’ of Tom Brady, ‘Body’ of Cam Newton","title_page":"DeShone Kizer Claims to Have the ‘Intellect’ of Tom Brady, ‘Body’ of Cam Newton | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"DeShone Kizer loves him some DeShone Kizer.\nThe former Notre Dame quarterback and current NFL draft prospect told USA Today that he embodies a combination of Tom Brady’s brain and Cam Newton’s body. Armed with that combo, Kizer says his ceiling is nothing less than being the greatest of all time.\n“Name a college quarterback who goes into the game-plan meetings on Monday and throws his notes at the coaches,” Kizer said. “No one else game plans the way I do. No one else prepares the way I do. No one else knows football the way I do. No one else is as big as I am. No one else is as powerful a runner as I am. Pat Mahomes might throw the ball 80 yards and I can only throw the ball 72, but I guarantee he can’t throw an out route the way I can.\n“No one else can do what I can do. And I’ve truly figured out in this process, if I can maximize all my potential in every aspect of the game – this is bold – I do have the ability to be the greatest quarterback to ever play. Imagine taking Brady’s intellect and Brady’s preparation and putting it on a guy with Cam Newton’s body. Why can’t I be the greatest? The only thing stopping me from it is me. That’s what’s driving me now.”\nIt is hard to tell how NFL teams will react to this. On the one hand, there’s no question Kizer possesses confidence, which is a key trait of any NFL quarterback or any successful person in general.\nHowever, claiming to be the mental and physical metaphorical offspring of the smartest and most athletically gifted quarterbacks to ever play the position might come off as a bit, shall we say, over the top?\nAlso, Kizer calling out draft prospect Pat Mahomes by name might turn off some teams, since a quarterback who so easily puts a fellow player on blast in the media might do the same thing in his career, when he has a receiver who drops the ball, or an offensive line that blows a protection.\nIn any event, if Kizer truly possesses the brain of Brady and the body of Newton, then I guess we can stop debating what the Browns are going to do with the first overall pick.\nFollow Dylan Gwinn on Twitter: @themightygwinn","url":"https://www.breitbart.com/sports/2017/04/21/deshone-kizer-claims-intellect-tom-brady-body-cam-newton/"}
