{"authors":["John Hayward"],"date_download":"2018-10-30 20:43:42","date_modify":"2018-10-30 20:43:42","date_publish":"2015-07-20 14:39:21","description":"Should Chattanooga killer Mohammad Youssef Abdulazeez have been under surveillance by counterterrorist authorities? Were there red flags?","filename":"data/vaneerConsumption/DespiteDrugUseandJihadiRedFlagsChattanoogaKillerFlewUnderPoliceRadar.json","image_url":"https://media.breitbart.com/media/2015/07/Tennessee-Shooter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_20__1540932222.html","title":"Despite Drug Use and Jihadi Red Flags, Chattanooga Killer Flew Under Police Radar","title_page":"Despite Drug Use and Jihadi Red Flags, Chattanooga Killer Flew Under Police Radar | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Questions are being asked about whether Chattanooga killer Mohammad Youssef Abdulazeez should have been under surveillance by counterterrorist authorities before he launched his deadly attacks, killing four Marines and a Navy petty officer before he was brought down in a gun battle with police. Were there “red flags” that should have tipped off investigators that Abdulazeez was a potential terrorist threat?\nAn article at The Washington Post judges that there was not, at least not in time to draw the attention of the FBI. The Post says investigators are confronting “the uncomfortable question of whether counterterrorism agencies are reaching the practical limits of what they can do to detect homegrown plots.”\nUntil recently, the biggest blip Abdulazeez produced on law-enforcement radar was getting busted for DUI on April 20, aka “420 Day” or “National Weed Day.” That is not the sort of thing that would normally draw the attention of the national-security apparatus … although maybe it should be. The Tsarnaev brothers in Boston were recreational-drug enthusiasts, too. Not that U.S. government agencies are likely to express thoughts like this out loud, for reasons of political sensitivity, but Muslim kids who get mixed up with drugs may become slightly more vulnerable to radicalization if they try to pull themselves out of the drug culture by growing more devout. Even if their initial contacts with strict Islam are basically well-meaning, radical influences might be lurking right behind them.\nAlso, there are uncomfortable questions to be asked about an ideology that tells people with self-destructive inclinations that they can make themselves useful, and guarantee entry to Paradise, by conducting “martyrdom operations.” Such thoughts seem to have been on Abdulazeez’ mind; ABC News reports his diary reveals that “as far back as 2013, he wrote about having suicidal thoughts and “becoming a martyr” after losing his job due to his drug use, both prescription and non-prescription drugs.”\n“In a downward spiral, Abdulazeez would abuse sleeping pills, opioids, painkillers and marijuana, along with alcohol,” a representative of the family told ABC. “Most recently, the 24-year-old was having problems dealing with a 12 hour overnight shift, and had to take sleeping pills, according to the representative. The young man was also thousands of dollars in debt and considering filing for bankruptcy.”\nThe family representative added that Abdulazeez was “susceptible to bad influences,” grew upset while watching news accounts of “children being killed in Syria,” and was struggling with “being a devout Muslim.” The family says they tried, unsuccessfully, to get him away from the group of friends he was drinking and smoking pot with.\nAs part of this effort, they sent him off on a seven-month trip to Jordan last year. This trip is the biggest question mark on his recent history. Actually, according to The New York Times, he made several trips to Jordan and Kuwait, where he had relatives.\nThe Times writes:\nBefore his stay in Jordan last year, Mr. Abdulazeez, who was a naturalized American citizen and made the trip on an American passport, had traveled at least four other times to the country, for two weeks to two months at a time, said federal law enforcement officials, who were not authorized to speak about the investigation.\n“They said he was in Jordan in the last weeks of 2005, in the summer of 2008, the summer of 2010, and the spring of 2013, when he also spent some time in Canada, returning to the United States in May.”\nU.S. investigators have reportedly reached out to Jordanian and Kuwaiti intelligence agencies to learn if Abdulazeez had contact with any radical elements or terrorist recruiters during his stay in those countries. Reuters reports that he returned from his last trip to Jordan “concerned about conflicts in the Middle East and the reluctance of the United States and other countries to intervene.” Reportedly, he was particularly upset about “the 2014 Israeli bombing campaign in Gaza and the civil war in Syria.”\nThe Wall Street Journal notes there have been “indications of some troubles at home,” including allegations that his father was abusive to his mother and the children, made in a divorce complaint his mother filed back in 2009. In addition to physical and verbal abuse, the filing accused Mr. Abdulazeez of sexually assaulting his wife, and telling her he intended to take a second wife, “as permitted under certain circumstances under Islamic law.” The divorce action was eventually dropped by Mrs. Abdulazeez, and the couple reconciled.\nMost of the events that look like conventional “red flags” occurred very recently, giving law enforcement very little time to reassess Mohammad Abdulazeez as a terrorist threat. ABC News writes of the deeply indebted youth renting a silver Mustang and showing up at the local mosque to take a friend on a joyride, bragging about the flashy car and how fast it could go. He recently launched a blog and made a few posts related to Islamic theology, although there were no explicit threats. A few hours before the attacks, Reuters reports that he texted an ominous verse to a friend: “Whosoever shows enmity to a friend of Mine, then I have declared war against him.” The friend did not think it was particularly alarming at the time.\nIt would be politically difficult for American security services to openly announce that they would devote enhanced scrutiny to troubled Muslim youth who travel abroad and return to the United States, or become more devout after long struggles with alcohol and drug abuse. The government will also be extremely reluctant to tell Americans, both Muslim and otherwise, that when friends say and do some of the vaguely ominous things Abdulazeez did, they should notify the authorities. But maybe putting all of these factors together, along with data such as Abdulazeez’ legal purchase of firearms, can refine the matrix used to spot persons of peripheral interest.\nOf course, that sort of thing is disturbing not only to Muslims, but to non-Muslim Americans worried about their government using advanced data-mining techniques to sort them out and flag them for enhanced scrutiny. There are serious questions of privacy versus security here. It is natural for the public to lean toward the latter after a high-profile attack, but civil libertarians will insist these are the moments we should be most on guard against the aggressive expansion of the Surveillance State.\nFor example, the Post article mentions fears of ISIS and al-Qaeda’s ability to use the Internet to radicalize followers in the United States, and says, “Authorities have expressed concern that their ability to detect such contact has been eroded by the spread of encrypted communication.” However, The New York Times quotes a congressional official, briefed on the investigation, who said that “it was not yet clear whether Mr. Abdulazeez’s computer or communications were encrypted, which would lengthen the time needed to pry clues out of them.” There are some who will be suspicious that some officials are rushing to use this incident as part of a conversation about the dangers of allowing civilians to encrypt their data, before it’s certain that such encryption played a role in this case.\nWe will likely debate for some time to come whether or not Abdulazeez should have pinged the counterterrorist radar, and if not, whether that radar should be fine-tuned to detect people like him. We will also have to come to terms with how swiftly radicalization can occur, and whether family and friends can reliably detect it–or will reliably report suspicions they might harbor. We must also confront the possibility that ISIS and other terror groups have finally created the sort of one-sided “lone wolf” recruiting system they always dreamed of: a way to reach out to disaffected Muslim youth and inspire them to conduct terrorist operations, without any of the two-way communication or organization that could alert security services.","url":"https://www.breitbart.com/national-security/2015/07/20/chattanooga-killer-flew-under-the-counterterrorist-radar/"}
