{"authors":["Minerva Canto","Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-30 22:53:05","date_modify":"2018-10-30 22:53:05","date_publish":"2016-09-07 08:00:00","description":"Affordable homes with ample lots lure many families to the town of Apple Valley in the Mojave Desert. But amenities are limited—no department stores, no","filename":"data/vaneerConsumption/DespitedireOBGYNshortagelawmakerswontexpandroleofnursemidwives.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/MIDWIVES1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939985.html","title":"Despite dire OB-GYN shortage, lawmakers won’t expand role of nurse-midwives","title_page":"Despite dire OB-GYN shortage, lawmakers won’t expand role of nurse-midwives | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Affordable homes with ample lots lure many families to the town of Apple Valley in the Mojave Desert. But amenities are limited—no department stores, no Costco and, more importantly, few affordable medical care options for pregnant women. For Cassandra Lindstrom, that meant scheduling the birth of her second baby at a hospital at least an hour away via busy Cajon Pass.\n“I was worried that I wouldn’t make it in time and give birth on the freeway,” she said.\nHer situation is mirrored by countless other women in a state with a severe shortage of obstetricians and gynecologists. Eight California counties—particularly those in the far north and east—lack even one licensed obstetrician-gynecologist, and 11 other counties have a handful or fewer, according to the state’s Health and Human Services Department.\nCertified nurse-midwives, who help ease the load, have been arguing that they could do more. But they are restrained by the fact that California is one of just six states requiring them to work only under a physician’s supervision. A bill that would have expanded their reach by permitting nurse-midwives to work independently almost cleared the Legislature, but failed in the waning hours of the legislative session, after fierce last-minute opposition from the doctors’ lobby.\nBut the idea will be back, promised Assemblywoman Autumn Burke (D-Marina del Rey), who sponsored AB 1306 with Assemblyman Mark Stone (D-Monterey Bay). “For me, this is about expanding women’s health care options,” said Burke, who calls it unacceptable that some California women must drive hours to see an OB-GYN.\nThe bill had previously cleared both chambers but fell short on a concurrence vote after it was amended to allow hospitals to hire certified nurse-midwives—a way to garner support from the hospital lobby. Doctors’ groups including the California Medical Association, which represents more than 41,000 physicians, contend that the bill failed to adequately protect patients by, for example, not mandating that midwives inform patients that they would be working without physician supervision. “Certified nurse midwives currently work as an important part of the care team to provide necessary reproductive health care to California women,” the association said in a statement. “However, AB1306 was a flawed bill.”\nThe doctors also argued that it was important to keep corporations from directly influencing patient care by barring hospitals from directly hiring midwives. “This concept is particularly important in today’s environment where businesses and hospitals, because of profit or through directives, are seeking to deny and limit access to reproductive healthcare,” the association said.\nAdvocates of the bill say it’s critically needed—particularly by women who live in remote regions or areas without an affordable obstetrician-gynecologist, or any OB-GYN at all.\n“If we’re going to meet the population’s needs, we’re going to need providers that can provide different levels of care,” said Linda Walsh, president of the California Nurse-Midwives Association. “Certified nurse-midwives know the scope of their care and they’re not going to go beyond that.”\nThe approximately 1,200 certified nurse-midwives in California hold master’s degrees and are trained to provide maternity care and primary care to women from puberty through menopause, including upper respiratory problems, Pap smears, and urinary tract infections. (They work in hospitals, clinics and birth centers, and are more highly trained than regular licensed midwives, who work primarily in homes and birthing centers.)\nAlthough certified nurse-midwives are hired and “supervised” by doctors, those doctors are not required to be physically present during clinic visits, births or hospitalizations. In other words, current law tethers nurse-midwives to where doctors practice, without providing for full oversight.\nWith the number of U.S. births projected to soar over the next decade, a scarcity of OB-GYNs is worsening. The American Congress of Obstetricians and Gynecologists figures that in just four years, the nation will be from 6,000 to 8,800 OB-GYNs short of meeting the need.\nState data suggest there may be troubling repercussions: California counties with few or no obstetrician-gynecologists, including Colusa, Del Norte, Glenn, Inyo, Siskiyou and Trinity, had among the highest preterm birth rates in recent years.\nThe OB-GYN shortage in rural California Nineteen California counties have five or fewer OB-GYNs. Source: Medical Board of California\nMany states have already responded to this shortage by relaxed requirements on nurse-midwives—about half of states allow them to practice with complete independence, according to a new Stateline report from the Pew Charitable Trusts. Consequently, the number of nurse-midwives has grown by nearly a third, reports the U.S. Bureau of Labor Statistics.\nAmong the potential benefits of having certified nurse-midwives attending at births? Fewer preterm births and use of epidurals, according to global studies researchers at Cochrane.\nWhile California lawmakers try to figure out how to allow certified nurse-midwives to furnish more care without sparking objection from hospitals or doctors, women in underserved areas must resign themselves to dealing with the disparities.\nThe statistics paint a stark picture. San Bernardino County, the fifth most populous county in the state, has 153 licensed obstetrician-gynecologists—one for every 14,000 people. The situation in two neighboring counties is vastly different: Los Angeles County has one per every 8,500 people and Orange County has one for every 7,000 people.\nIn Apple Valley, Lindstrom is thankful that her son was born in February without any complications despite having to trek “down the hill,” as locals call the Cajon Pass, to Loma Linda University Medical Center. The 27-year-old stay-at-home mom with a psychology degree recalls the difficulties she had seeking care after having an emergency cesarean section delivery with her first child three years ago: No local doctor who accepted her Medi-Cal coverage would allow her to have a vaginal birth after her C-section.\nLindstrom, who would like to have more children, says she and her husband are considering moving to Oregon or Idaho, where they think her options for medical care during pregnancy would be better. She said she wishes she had the option of receiving her health care from a local nurse-midwife.\nTeresa Lomas, a teacher’s aide in Imperial County, says it’s an option she also wishes the state would support. Instead, she worries about whether her delivery will go smoothly, considering she didn’t have the luxury of choosing from a long list of obstetricians to deliver her baby. Lomas and her husband, who works in construction, chose to live in Brawley, a rural city, because of its cheaper housing. The county, which borders Mexico, has nine licensed obstetrician-gynecologists for a population of more than 175,000—one gynecologist for every 19,000 people. Only one of those nine would take her insurance. He has delivered many babies, she said, but she didn’t feel comfortable with his rushed style and clipped answers to her questions.\n“If you have insurance and you’re fairly healthy, you have some choices. You can go to a doctor and have your baby in a hospital without too many worries,” Lomas said “But if you don’t, and there are many women around here like that, then you’re stuck with some bad choices.\nCALmatters is a nonprofit news outlet focused on coverage of state policy and politics. Minerva Canto is a freelance journalist and CALmatters contributor based in Southern California.","url":"https://calmatters.org/articles/state-faces-dire-ob-gyn-shortage-but-lawmakers-wont-expand-role-of-nurse-midwives/"}
