{"authors":["Associated Press"],"date_download":"2018-10-22 21:33:31","date_modify":"2018-10-22 21:33:31","date_publish":"2017-04-26 02:00:18","description":"OTTAWA, Ontario (AP) - Sweden's Erik Karlsson was the best player in the Ottawa Senators' opening-round series against the Boston Bruins, and that was while...","filename":"data/vaneerConsumption/DespiteheelinjuryKarlssonleadingSenatorsinpostseason.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/02/wire-462581-1493168421-171_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446024_Despite-heel-injury-Karlsson-leading-Senators-postseason_1540244011.html","title":"Despite heel injury, Karlsson leading Senators in postseason","title_page":"Despite heel injury, Karlsson leading Senators in postseason | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"OTTAWA, Ontario (AP) - Sweden's Erik Karlsson was the best player in the Ottawa Senators' opening-round series against the Boston Bruins, and that was while playing with two hairline fractures in his left heel.\nIf Ottawa's captain was that good playing injured, one has to wonder how much better he can be when healthier.\nThe Senators are going to find out as they take on the New York Rangers in the Eastern Conference semifinals, with Game 1 Thursday night in Ottawa.\nBoston Bruins' Drew Stafford (19) hugs Ottawa Senators' Erik Karlsson (65), of Sweden, after the Senators defeated the Bruins 3-2 during overtime in game six of a first-round NHL hockey Stanley Cup playoff series, Sunday, April 23, 2017, in Boston. (AP Photo/Michael Dwyer)\nDespite the injury, Karlsson led all players in ice time in the opening round of the playoffs in averaging 30:23. He sits third on the Senators and leads all defensemen in scoring with six assists. While still not 100 percent, Karlsson's heel has been improving as the postseason progresses.\n\"He's playing fantastic, he's doing what Erik Karlsson does and that's taking over games at times,\" defense partner Marc Methot said.\n\"Being clutch for us, coming down with key moments in games where he'll provide a nice pass or a timely goal and that's just what he does. He's a great leader and he's extremely competitive and it's showing through right now in his play and his determination.\n\"It's a credit to how badly he wants to win. You can't say enough about him.\"\nWhile injuries are usually kept hidden during the playoffs Karlsson surprised many, including his general manager, when he revealed what he had been battling through following the Senators' series-ending victory.\n\"I was tired of talking about it and it's something that probably is not going to affect me anymore moving forward,\" Karlsson said.\n\"It's something that's done with and I just felt like getting it out of the way instead of keep having it linger on and I'm not that much for secrets.\"\nThe Bruins struggled to contain Karlsson and there's little doubt the Rangers will do whatever possible to limit his chances, but the 26-year-old said he was fully prepared for the extra attention.\n\"This is the time of the year where everybody finishes their checks and everybody plays really hard every shift.\n\"That's why we play so hard all year to get to this point and it comes with the territory so it's not something that's new, it's not something that's going to change anything. It's just something you're going to have to deal with and something you're prepared to deal with.\"\nKarlsson will be going up against fellow Swede and good friend Henrik Lundqvist. The Rangers' goalie was solid in the opening round of the playoffs and Karlsson says the key to any success will be to frustrate Lundqvist.\n\"We're going to have to make it hard on him. If he sees the puck he's going to make most of the stops and we're going to make it hard in front of him by putting a lot of traffic in there and throw a lot of pucks at him. The more shots we have the more opportunities we're going to have for one to go in.\"\nThis will be the second playoff meeting between the Senators and Rangers. The two teams squared off in 2012 with the Rangers winning the series in seven games.\nFew players remain from either team, but Karlsson, who was part of the Senators roster, says he has a different feeling about this Ottawa team.\n\"I think everybody's had that all year, it's just been a long process of getting to where we are today and I think we worked extremely hard to be standing here today and we still have a lot left to do. We expected to win the first series and we expect to win this one too.\"\nThe Senators were 2-1-0 against the Rangers this season.\n___\nMore AP hockey: https://www.apnews.com/tag/NHLhockey","url":"https://www.dailymail.co.uk/wires/ap/article-4446024/Despite-heel-injury-Karlsson-leading-Senators-postseason.html"}
