{"authors":["Stephen Thompson"],"date_download":"2018-10-23 01:57:15","date_modify":"2018-10-23 01:57:15","date_publish":"2014-12-22 00:00:00","description":"Watch the singer and rapper perform \"Skeleton Key\" and \"The Good Fight\" with the VocalEssence choir.","filename":"data/vaneerConsumption/DessaSomethingOldAndSomethingNewSuitableForChoir.json","image_url":"https://media.npr.org/assets/img/2014/12/22/dessa-pc-kelly-loverud_wide-d2ece72a6ac1790ff742a4cdc37efba1ff8d1689.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2014_12_22_372369098_dessa-something-old-and-something-new-suitable-for-choir_1540259835.html","title":"Dessa: Something Old And Something New, Suitable For Choir","title_page":"Dessa: Something Old And Something New, Suitable For Choir : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Dessa: Something Old And Something New, Suitable For Choir\nEnlarge this image toggle caption Kelly Loverud/Courtesy of the artist Kelly Loverud/Courtesy of the artist\nDessa's list of credits includes work as a singer, poet, writer, speaker, rapper (both solo and with the Doomtree collective) and all-around entrepreneur. She constantly blurs the lines separating those roles, too, recasting her own work for new genres, settings and collaborators. On her 2011 album Castor, The Twin, for example, she took some of her best-known songs, stripped away the beats, and rebuilt each composition using live, frequently orchestral arrangements.\nAll of which is to say: When Dessa reworks her songs with the help of Minnesota's VocalEssence choir, it's not a surprise, so much as another fresh adventure for an artist who's made a career out of them. Here she is, performing her 2013 song \"Skeleton Key\" with VocalEssence at Orchestra Hall in Minneapolis on Oct. 26:\nYouTube\nAnd here's Dessa, again with VocalEssence at the same show, performing a new, as-yet-unreleased song called \"The Good Fight\":\nYouTube\n\"I make my living as an MC and a singer with Doomtree Records, a rap label,\" Dessa writes via email. \"But as a little kid, I didn't listen to a lot of rap. When I was a toddler, my dad was a lute player and the music I heard around the house was 300 years old. The sound of that sacred music, often melancholic, informs the pop music that I make and perform now. I'm particularly fond of voices moving in dynamic harmony, and to achieve that sound on my solo records, I layer my own voice a dozen times.\n\"When Philip Brunelle, the artistic director of VocalEssence choir, asked if I wanted to work together, my first thought was, 'When do I tell him I can't read music?' My second thought was, 'Say yes before you tell him you can't read music.'\n\"If you're not in the choral scene (and I'm just starting to learn my way around), suffice it to say that VocalEssence is a big deal; it's an internationally respected group. I scored major points at Thanksgiving when I shared the news of our collaboration.\n\"Months later, I performed two pieces with VocalEssence. The first is a choral version of my track 'Skeleton Key' (thanks to Andy Thompson for this arrangement, and to Lazerbeak for the original beat). The second is a new song called \"The Good Fight,\" which Andy and I also worked on together, sitting side-by-side at his piano while his toddler looked on.\"\nDessa appears on a new album with Doomtree, All Hands, which comes out Jan. 27.","url":"https://www.npr.org/sections/allsongs/2014/12/22/372369098/dessa-something-old-and-something-new-suitable-for-choir"}
