{"authors":["Lucia Peters"],"date_download":"2018-10-30 23:39:07","date_modify":"2018-10-30 23:39:07","date_publish":"2014-08-13 15:03:11","description":"Have you ever looked at the banana you packed to go along with your lunch and thought, “Gee, I wish this strange-looking piece of fruit was even stranger?” Have you longed for a way to kick your mid-afternoon snack up a notch? Have you sighed loudly…","filename":"data/vaneerConsumption/DestapaBananaLetsYouFillYourBananaswithChocolateCaramelorWhateverElseYourSugarLovingHeartDesires.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/9/a5c568f8-ef45-4b7b-b548-82da40d684e1-getty-632471088.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35593-destapabanana-lets-you-fill-your-bananas-with-chocolate-caramel-or-whatever-else-your-sugar-loving-heart-desires_1540942747.html","title":"DestapaBanana Lets You Fill Your Bananas with Chocolate, Caramel, or Whatever Else Your Sugar-Loving Heart Desires","title_page":"DestapaBanana Lets You Fill Your Bananas with Chocolate, Caramel, or Whatever Else Your Sugar-Loving Heart Desires","title_rss":"NULL","source_domain":"bustle.com","text":"Have you ever looked at the banana you packed to go along with your lunch and thought, “Gee, I wish this strange-looking piece of fruit was even stranger?” Have you longed for a way to kick your mid-afternoon snack up a notch? Have you sighed loudly while thinking how amazing it would be if your banana was full of chocolate or caramel? Good news: All of these things are now a possibility, thanks to a wacky new device called a “DestapaBanana.” Created by Sebastian Berger of Argentina, this little creation drills a hole through the middle of your banana and packs it with whatever your sugar-loving heart desires — all without removing it from its peel. It’s like magic!\nAs Foodbeast puts it, the DestapaBanana is essentially a “glorified syringe.” Happily, though, it looks a heck of a lot friendlier than most syringes do; furthermore, the knowledge that it will turn bananas — already awesome — into a slightly less bad for you candy bar makes it all the more inviting. It works pretty much the way you'd think it does, but in case you need a visual demonstration, here's a video for you:\nMiNDFOODMagazine on YouTube\nI don't know why no one thought of this sooner. It's brilliant. And also has some potential to be used for some incredibly inappropriate jokes, but whatever. It's still delicious.\nThe current filling choices offered by the company itself are dulce de leche, chocolate, and a mysterious, red goo called “frutilla” (which Google tells me is Spanish for “strawberry”) — but I think we can do better than that.\n1. Marshmallow\nSpecifically, Marshmallow Fluff. Regular marshmallows might have some consistency issues during the injection process.\n2. Peanut Butter\nBecause peanut butter and bananas were just meant to be.\n3. Marshmallow And Peanut Butter\nIt’s a Fluffernutter sandwich, minus the bread and plus a banana. What’s not to love?\n4. Nutella\nNutella wins out over plain ol’ chocolate every time.\n5. Homemade Strawberry Sauce\nAllow me to direct you towards this recipe for roasted strawberries. Let ‘em cook down long enough and you have a dessert sauce that puts all store-bought options to shame.\n6. Custard\nOr pudding. Or something similar. Bananas are great on top of custard, so it only stands to reason that they’d be excellent surrounding it, too.\n7. Boozy Hot Fudge\nRegular hot fudge is so last year. Add some rum to take it to a whole new level.\n8. Greek Yogurt\nWhy not?\n9. Coffee Crème\nI imagine something like the filling of those coffee-flavored Dunkin’ Donuts creations would be dynamite inside a banana.\n10. Pie Filling\nBlueberry, apple, pecan… anything goes. I’m sure it’ll all be fantastic.\nImages: Giphy (10)","url":"https://www.bustle.com/articles/35593-destapabanana-lets-you-fill-your-bananas-with-chocolate-caramel-or-whatever-else-your-sugar-loving-heart-desires"}
