{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:11:54","date_modify":"2018-10-30 18:11:54","date_publish":"2016-07-16 16:08:07","description":"Texas police detective Nick Selby penned an op-ed in which he described gun control pushes as misplaced, and argued for criminal control.","filename":"data/vaneerConsumption/DetectiveForgetGunControlFocusonCriminalControl.json","image_url":"https://media.breitbart.com/media/2015/01/anti-gun-control-rally-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_16__1540923114.html","title":"Detective: Forget Gun Control; Focus on Criminal Control","title_page":"Detective: Forget Gun Control; Focus on Criminal Control","title_rss":"NULL","source_domain":"breitbart.com","text":"On July 14, Texas police detective Nick Selby penned an op-ed in which he described gun control pushes as misplaced, arguing instead for criminal control.\nHe pointed out that every high-profile attack post-Sandy Hook Elementary School has been followed by a gun control push from Obama, yet the laws pushed are never realized, and in cities where such laws exist, no difference is made, such as in Chicago.\nWriting in The Washington Post, Selby conceded that he and his fellow officers would like the levels of gun violence diminished, but he stressed that the way to do it is not via gun control, but criminal control. He wrote:\nMass shootings remain outliers. Two-thirds of gun deaths are suicides. The tyranny of everyday shootings—the 12,000 homicides a year that happen so regularly that some people don’t even call 911 anymore—follow patterns completely divorced from the weapons used. These shootings have much more to do with the realities of life for the poor, the drug-addicted, the mentally ill and the criminal.\nHe contended that the way to combat these 12,000 deaths is not via more laws, but a greater focus on criminals and/or would-be criminals.\nSelby pointed to a program in Richmond, California, where “they identified the 50 people most likely to shoot someone and engaged with them, even paying them to participate.” He admitted the program took heat for paying participants, but observed that the program expanded between 2007 and 2012 without an expansion of funding. As it turned out, the money was not the most important part.\nHe said the program allowed law enforcement and mentors to work with would-be criminals in a way that encouraged paths other than violence and criminality, without even taking their guns away from them.\nSelby wrote:\nAmericans need to think beyond guns, and to confront the underlying social and economic problems that cause gun violence. Programs like these are proving it is possible to significantly reduce gun deaths without new gun-control measures — and without breaking the bank.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/07/16/detective-forget-gun-control-focus-on-criminal-control/"}
