{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 22:47:11","date_modify":"2018-10-30 22:47:11","date_publish":"2018-07-29 00:00:00","description":"Not since the Financial Crisis have we seen earnings warnings by the three Detroit automakers balled up like this. But this is far from the Financial Crisis — the economy is booming. And dim outlooks now have markets what will happen to automakers when the times are no longer this good.","filename":"data/vaneerConsumption/DetroitautoindustrysufferinginwaynotseensinceFinancialCrisis.json","image_url":"https://amp.businessinsider.com/images/5b5b60bb1982d81e008b46e5-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_detroit-auto-industry-suffering-in-way-not-seen-since-financial-crisis-2018-7_1540939631.html","title":"Detroit auto industry suffering in way not seen since Financial Crisis","title_page":"    Detroit auto industry suffering in way not seen since Financial Crisis - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Fiat Chrysler assembly workers work on partially assembled minivans at the Windsor Assembly Plant in Windsor, Ontario, February 9, 2015. Reuters\nIt's confession time among the Detroit automakers: GM, Fiat Chrysler, and Ford all got ugly, in unison, in one day, something we haven't seen since the Financial Crisis.\nBack at the end of May, GM shares (GM) were trading at $38 when it announced that SoftBank, the Japanese company that is blowing borrowed billions left and right, would invest $2.25 billion in GM's self-driving car unit Cruise. By June 11, GM shares had shot up to $45. But this morning they're at $37.16. That's a 17% plunge from June 11, including the 5% drop Wednesday and today.\nIn its earnings report Wednesday morning, it lowered its profit outlook for 2018 by 5% to 9%, as its operating profits in its North America business plunged 23% in the quarter. GM's \"adjusted\" profits had hit a record in 2017 of $12.8 billion. That record is now moving out of reach.\nIt blamed currency woes in Brazil and Argentina and raw materials, primarily steel and aluminum, whose prices - \"driven by a variety of market forces,\" as CFO Chuck Stevens said - rose more sharply than it had expected when it gave its guidance at the beginning of 2018.\nFiat Chrysler didn't help. Wednesday morning it announced earnings and slashed full-year earnings guidance by about 7%. Its shares (FCAU) on Wednesday and this morning have plunged 13% and are down 31% since April.\nFCA lost $114 million in Asia-Pacific region, mainly China, and blamed \"lower shipments from the China JV as a result of market decreases, particularly in the SUV segments, and increased competition from domestic brands in China.\"\n\"Clearly when you step back and look at our results for the quarter, the biggest challenges we face, and frankly we're going to face to some extent for the balance of the year, are all focused in China,\" said the new guy, CEO Mike Manley, who just filled the slot of Sergio Marchionne who passed away this week. He added, \"With duty changes that were announced, these particularly impacted Maserati, which resulted in a slowdown of sales and shipments to dealers.\"\nFord's turn to confess came Wednesday evening - and it was ugly. It's Q2 earnings plunged nearly 50% to $1.1 billion, as total revenues fell 2.4% to $38.9 billion. It slashed its earnings projections for the full year by about 11% and announced another restructuring program that could drag out for three to five years and cost $11 billion.\nOr whatever, because in April, CEO Jim Hackett, the new guy, had announced a rejiggering process that would cost $25.5 billion through 2022 that included abandoning all car lines in the US, except for the Mustang [Carmageddon for Cars: \"Cars\" Are Scheduled to Die].\nHackett said in the statement that his cost-cutting measures \"continue to take hold.\"\nFord blamed the current set of problems on a disruption at a supplier for its high-margin pickups, rising costs of commodities, particularly steel and aluminum, difficulties in Europe, where it had a $73 million operating loss in Q2, and collapsing sales in China, where it had a $483 million operating loss in Q2.\nBut the collapse of Ford's sales in China isn't a new thing. That started in 2016. The chart below shows deliveries (in thousands) of all models made by Ford and its Chinese joint ventures for the first half of each year (data via carsalesbase.com):\nWolf Street\n\"We're clearly committed to redesigning and restructuring the underperforming parts of our business,\" Hackett said, now three years into the collapse in China sales. \"This includes improving cost competitiveness with aggressive fitness actions, localizing more product in China, as well as recruiting more local talent to key management positions.\"\nFord shares (F) dropped over 5% this morning to $9.98, the lowest since 2012.\nNot since the Financial Crisis have we seen earnings warnings by the three Detroit automakers balled up like this, all in one day, in unison.\nBut this isn't the Financial Crisis. This is as good as it gets. The economy is growing. GDP in Q2 is projected to rise, depending on who is doing the projecting, between 2.8% and inexplicably 4.5%. Deliveries of new vehicles in the US peaked for the big three Detroit automakers in 2015 and have edged down since then, but they have raised prices on their profitable and hot trucks, SUVs, and crossovers, and in dollar terms, sales and profits in the US were solid - until now.\nSo these ugly outlooks hailing down on the good times are rattling nerves and leaving folks to wonder what will happen to the automakers when the times are no longer this good.","url":"https://www.businessinsider.com/detroit-auto-industry-suffering-in-way-not-seen-since-financial-crisis-2018-7"}
