{"authors":[],"date_download":"2018-10-22 20:52:40","date_modify":"2018-10-22 20:52:40","date_publish":"2014-06-03 13:14:43","description":"General Motors, Chrysler and Ford reported higher-than-expected new car sales in May, with consumer demand gathering steam after the cold winter.","filename":"data/vaneerConsumption/DetroitCarMakersReportSalesJumpinMayafterWinterBlues.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/483641/140603-140603-jeep-0916_2f46eb958fadb94a8efc169ba5e58e0e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_detroit-car-makers-report-sales-jump-may-after-winter-blues-n121121_1540241560.html","title":"Detroit Car Makers Report Sales Jump in May after Winter Blues","title_page":"Detroit Car Makers Report Sales Jump in May after Winter Blues","title_rss":"NULL","source_domain":"nbcnews.com","text":"Chrysler Group reported a 17-percent increase, with its Jeep brand soaring 58 percent and resulted in its best sales month ever. Chrysler extended its streak of year-over-year sales gains to 50 consecutive months in May.\n“Our Jeep sport-utility vehicles and Ram pickups continued to do well in May as our dealers reported brisk May sales over five weekends and the Memorial Day holiday,” said Reid Bigland, head of U.S. Sales.\nDespite the ongoing recall controversy, GM reported a 13-percent sales increase compared to a year ago, marking the company’s best May in seven years and its best total sales since August 2008. Retail sales increased 10 percent while fleet sales were up 21 percent and GM expects to increase its total market share year over year, said Kurt McNeil, U.S. vice president of sales operations.\n“The momentum we generated in April carried into May, with all four brands performing well in a growing economy and 17 vehicle lines posting double-digit retail sales increases or better,” McNeil said.\nDespite predictions the company’s sales would decline, Ford posted a 3-percent increase from a year ago. Retail sales set several model records with 174,889 vehicles sold – an increase of 6 percent.\n“Fusion and Escape had their best months ever, which helped us to our strongest May result since May 2004,” said John Felice, Ford vice president, U.S. Marketing, Sales and Service. “Explorer continued to gain ground in the midsize utility segment with its best monthly sales performance in nearly 10 years, while Lincoln MKZ saw its best May ever.”\nMeanwhile, Nissan reported a double-digit sales increase. “Nissan started the month with strong momentum and rode an outstanding Memorial Day weekend to capture our best May sales performance in the history of Nissan in the U.S.,” said Fred Diaz, senior vice president, Nissan Sales & Marketing and Operations.\nToyota also reported a 12.6-percent sales increase, while Audi sales went up 25 percent and Hyundai reported record sales for May.\nHowever, Volkswagen of America, despite brisk sales of its diesel-powered vehicles, continued to stumble, reporting a 15-percent decline in sales. So far this year VW sales have dropped 11.4 percent.\nPart of the healthy sales relied on the availability of credit and lower prices. TrueCar estimated today that the average transaction price for light vehicles in the U.S. was $30,646 in May 2014, down $149 (-0.5%) from May 2013 and down $1,174 (-3.7%) from April 2014.\n“Industry wide we saw industry transaction prices contract slightly in May,” noted Larry Dominque, TrueCar executive vice president. But Chrysler and GM were able to increases prices and reduce incentives.\nUAW Braces for Pushback over Proposed Dues Hike\nSelf-Driving Vehicles Face Plenty of Obstacles\nGerman Union Throws Support Behind UAW Plans for VW Plant","url":"https://www.nbcnews.com/business/autos/detroit-car-makers-report-sales-jump-may-after-winter-blues-n121121"}
