{"authors":["Associated Press"],"date_download":"2018-10-22 22:55:40","date_modify":"2018-10-22 22:55:40","date_publish":"2016-01-28 11:29:24","description":"FRANKFURT, Germany (AP) — Deutsche Bank co-CEO John Cryan says the group is making \"good progress\" on a wide-ranging restructuring but there will be no bonus...","filename":"data/vaneerConsumption/DeutscheBankscrapstopmanagementbonusesafterbigloss.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:1371e3f790aa4e5594d38269a62bd47f-2vdWmEltwXfba0ce28e6327f3231-105_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420641_Deutsche-Bank-CEO-Good-progress-despite-year-loss_1540248940.html","title":"Deutsche Bank scraps top management bonuses after big loss","title_page":"Deutsche Bank scraps top management bonuses after big loss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Deutsche Bank scraps top management bonuses after big loss\nFRANKFURT, Germany (AP) — Deutsche Bank co-CEO John Cryan says the group is making \"good progress\" on a wide-ranging restructuring but there will be no bonuses for top management after the bank lost 6.8 billion euros ($7.5 billion) last year.\nThe bank was hit by 5.2 billion euros in expenses to settle regulatory litigation, and by 5.8 billion euros in write-offs on the value of assets and businesses.\nCryan said Thursday the loss meant the board of directors had decided there would be no bonuses for top management, adding they should \"own\" the poor results.\nCo-CEOs of Deutsche Bank John Cryan, right, and Juergen Fitschen talk to each other during the annual press conference in Frankfurt, Germany, Thursday, Jan. 28, 2016. (AP Photo/Michael Probst)\nDespite strong performances by individual bank divisions such as asset management, Cryan was unable to give a firm prediction for when the bank would return to profit.\n\"We stand a good chance this year,\" he said. But any profits will be needed to rebuild the company's finances, meaning the bank would not pay a dividend for 2015 and 2016.\nHe said that if the bank sticks to its strategy, eventually it will be in \"a very good place.\"\nCryan said the bank would face further legal expenses in 2016 as it pushes to settle remaining litigation \"as soon as possible.\"\nHe described the legal difficulties, which have cost the bank 12.7 billion euros since 2012, as a \"millstone around the neck of the bank.\" He said such expenses this year were \"expected to be below 2015 levels,\" though he couldn't make an estimate.\nCryan joined the bank as co-CEO in July, replacing Anshu Jain, and will become sole CEO in May when Juergen Fitschen departs.\nHe is leading a push to simplify the bank by leaving or selling risky or less profitable lines of businesses. It plans to shed 35,000 jobs by 2020. The bank will drop in-house and contractor jobs, and eventually spin off its Postbank retail bank.\nTop technology manager Kimberly Hammonds laid out plans for drastically simplifying the bank's sprawling networks.\nCryan acknowledged that the company's share price had suffered, hurting morale. He said that too many earlier actions at the bank had been aimed at short-term results, and added \"we should not seek to manage the share price, we should seek to manage the bank.\"\n\"It doesn't happen overnight, but we will succeed,\" Cryan said.\nShares in Deutsche Bank were down 2.4 percent in morning trading on Thursday, at 16.69 euros.\nThe bank has faced legal issues over rigging of financial benchmarks, and last year paid $258 million for violating U.S. financial sanctions against Iran and other countries.\nCo-CEOs of Deutsche Bank John Cryan pauses, during the annual press conference in Frankfurt, Germany, Thursday, Jan. 28, 2016. Deutsche Bank AG (DB) on Thursday reported a fourth-quarter loss of $2.32 billion, after reporting a profit in the same period a year earlier. (AP Photo/Michael Probst)\nCo-CEOs of Deutsche Bank John Cryan, right, and Juergen Fitschen stand together prior to the annual press conference in Frankfurt, Germany, Thursday, Jan. 28, 2016. (AP Photo/Michael Probst)\nCo-CEOs of Deutsche Bank John Cryan, right, and Juergen Fitschen stand together prior to the annual press conference in Frankfurt, Germany, Thursday, Jan. 28, 2016. (AP Photo/Michael Probst)\nCo-CEO of Deutsche Bank John Cryan gestures during the annual press conference in Frankfurt, Germany, Thursday, Jan. 28, 2016. (AP Photo/Michael Probst)","url":"https://www.dailymail.co.uk/wires/ap/article-3420641/Deutsche-Bank-CEO-Good-progress-despite-year-loss.html"}
