{"authors":["Will Martin"],"date_download":"2018-10-30 22:41:18","date_modify":"2018-10-30 22:41:18","date_publish":"2018-07-30 00:00:00","description":"Eurozone financial bigwigs have consistently argued that euro clearing should take place within the euro area, and Britain has repeatedly had to defend its right to clear trades.","filename":"data/vaneerConsumption/DeutscheBankshiftsclearingvolumesfromLondontoFrankfurt.json","image_url":"https://amp.businessinsider.com/images/5b5ec38d1982d834008b4757-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deutsche-bank-shifts-clearing-london-to-frankfurt-brexit-2018-7_1540939278.html","title":"Deutsche Bank shifts clearing volumes from London to Frankfurt","title_page":"    Deutsche Bank shifts clearing volumes from London to Frankfurt - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bad news for the City of London? Russell Boyce/Reuters\nLONDON — Deutsche Bank has executed plans to shift around half of its euro clearing activities out of the UK in a move that will worry those seeking to defend the City of London's place at the heart of European finance post-Brexit.\nThe move, first reported by the Financial Times late on Sunday, will see Deutsche Bank repatriate euro clearing to the bank's Frankfurt operation, where it is headquartered. Deutsche Bank, Germany's biggest lender, is one of the top five clearers of interest rate derivatives.\nClearinghouses manage credit risk, acting as a middle-man in swaps and derivatives trades to guarantee the contract in the event that one of the parties involved in the trade goes bust. The acceptance of English law and widespread use of English language has made London a hub for clearing globally. It handles more than 70% of the daily euro clearing business, equivalent to around €930 billion (£792 billion, $995 billion) of trades per day, according to a House of Lords report.\nDeutsche Bank has shifted its euro clearing volumes from London-based LCH, which is owned by the London Stock Exchange, to Deutsche Börse subsidiary Eurex.\nDeutsche Bank confirmed the FT's report on Monday morning, with a spokesperson telling Reuters that the bank has shifted a \"large part\" of its clearing operation out of London. Deutsche Bank declined to comment when contacted by Business Insider.\nThe bank was keen to emphasise that no jobs have been moved out of the City. Stefan Hoops, the bank's global co-head of institutional and treasury coverage, told the FT: \"It's the same London-based person who clears a transaction. We're just using a different clearinghouse.\"\nEurozone financial bigwigs have consistently argued that euro clearing should take place within the euro area. Britain has had to repeatedly defend its right to clear these trades, given that the euro is not the national currency.In 2015, the UK won a landmark court battle to continue clearing in London.\nBritain's vote to leave the EU revived calls to move euro clearing out of London but until now there had been little real sign that lenders and clearing houses are moving operations away from the UK.\nDeutsche Bank's clearing move comes amid continued uncertainty over the future of the City of London post-Brexit. Earlier in July, the EU reportedly rejected the British government's latest attempts to clarify the City's future relationship with the EU, saying it threatened the bloc's \"decision-making autonomy.\"\nUnder the government's proposed new relationship Britain would sign up to a system of so-called \"equivalence.\" The government said it will seek to improve on existing requirements for equivalence of rules between the EU and outside countries.\nHubertus Väth, the managing director of Frankfurt Main Finance, a lobbying group trying to attract finance businesses to Frankfurt, said in an emailed statement: \"Numerous international investment banks have set up spreads in Frankfurt similar to those in London.\n\"With the publication of whitepaper by the British government, the process further gained momentum. It became evident: We are still far from reaching an agreement. A hard Brexit is still a possibility, and hopes of special provisions for the financial service industry have vanished. Thus, the preparations for a relocation of the clearing business have intensified.\"","url":"https://www.businessinsider.com/deutsche-bank-shifts-clearing-london-to-frankfurt-brexit-2018-7"}
