{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 23:28:42","date_modify":"2018-10-30 23:28:42","date_publish":"2016-12-07 00:00:00","description":"A Deutsche Bank rates trader was suspended after asking a trading counterparty to join a WhatsApp group, according to a source.","filename":"data/vaneerConsumption/DeutscheBanksuspendsinterestratetraderforusingWhatsApp.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deutsche-bank-suspends-rates-trader-whatsapp-2016-12_1540942122.html","title":"Deutsche Bank suspends interest-rate trader for using WhatsApp","title_page":"    Exclusive: Deutsche Bank suspends rates trader for using WhatsApp - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A WhatsApp logo seen behind a Samsung Galaxy S4 phone that is logged on to Facebook in the central Bosnian town of Zenica. Thomson Reuters A Deutsche Bank rates trader has been suspended after asking a trading counterparty to join a WhatsApp group, according to a source familiar with the matter.\nThe incident happened two weeks ago, and the bank's internal investigation is yet to close, the source told Business Insider.\nThe WhatsApp group was formed to discuss views on interest rates, the person said.\nA representative for Deutsche Bank declined to comment.\nRates traders deal in interest-rate derivatives such as swaps, futures, and options, which often derive their value from benchmarks such as the London Interbank Offered Rate, or Libor.\nThe market for interest-rate derivatives is the biggest in the world, and companies and banks use the products to manage their cashflow and hedge against future rate changes.\nBanks and brokers are keen to avoid any hint of collusion after the industry was hit with billions in fines from international regulators for attempting to manipulate interest-rate benchmarks such as Libor.\nFirms have become much more sensitive about how their traders communicate. In the Libor rate-fixing scandal, a handful of traders used Bloomberg chat rooms to discuss rates and influence rate-setters for several years leading up to 2012. Tom Hayes, a former UBS and Citigroup banker in London, was jailed for 11 years as part of the scandal.\nFirms are still being pursued by regulators. On Wednesday the European Commission fined Crédit Agricole, HSBC, and JPMorgan Chase €485 million for operating a cartel in euro interest-rate derivatives.","url":"https://www.businessinsider.com/deutsche-bank-suspends-rates-trader-whatsapp-2016-12"}
