{"authors":["Tom Sims"],"date_download":"2018-10-30 22:59:18","date_modify":"2018-10-30 22:59:18","date_publish":"2018-07-25 00:00:00","description":"Net profit in the second quarter was 401 million euros ($468.33 million), down from 466 million euros last year.","filename":"data/vaneerConsumption/DeutscheBankprofitsfall14butrevenuedeclineslows.json","image_url":"https://amp.businessinsider.com/images/55e99a739dd7cc1f008b82d5-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-deutsche-bank-second-quarter-net-profit-drops-14-percent-2018-7_1540940358.html","title":"Deutsche Bank profits fall 14%, but revenue decline slows","title_page":"    Deutsche Bank profits fall 14%, but revenue decline slows - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A man walks past Deutsche Bank offices in London December 5, 2013. REUTERS/Luke MacGregor\nFRANKFURT (Reuters) - Deutsche Bank on Wednesday posted a 14% drop in net profit in the second quarter from a year earlier, as Germany's largest bank restructures under new leadership.\nDeutsche last week already flagged that net profit would be more than double analysts' forecasts in a rare piece of good news for the bank, which is cutting costs to revive profitability.\nNet profit in the second quarter was 401 million euros ($468.33 million), down from 466 million euros last year.\nThe bank halted a steep decline in revenue, which was 6.6 billion euros. That is flat compared with the same quarter in 2017, when revenue fell 10% from a year earlier.\nThe figures are a positive sign for new Chief Executive Christian Sewing, who took over in April and has embarked on plans to cut more than 7,000 jobs in an overhaul of the bank.\n\"We're making important changes to our core businesses as promised, we're headed in the right direction on costs, and our balance sheet quality is strong.\" Sewing said on Wednesday.","url":"https://www.businessinsider.com/r-deutsche-bank-second-quarter-net-profit-drops-14-percent-2018-7"}
