{"authors":["Will Martin"],"date_download":"2018-10-31 00:16:56","date_modify":"2018-10-31 00:16:56","date_publish":"2016-12-02 00:00:00","description":"To paraphrase Mark Twain, reports of cash's death are greatly exaggerated.","filename":"data/vaneerConsumption/DeutscheBankresearchontheendofcashandacashlesssociety.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cashless-society-end-of-cash-deutsche-bank-2016-12_1540945016.html","title":"Deutsche Bank research on the end of cash and a cashless society","title_page":"    Deutsche Bank research on the end of cash and a cashless society - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Locals re-enact the 1573 medieval battle of \"Seljacka Buna\" in Donja Stubica, Croatia, February 7, 2015. Reuters/Antonio Bronic Society is far from becoming totally cashless, and suggestions that cash could be on the brink of extinction in Western society are way off the mark, according to a new report from Deutsche Bank.\nWriting in a note titled \"Cash: In the long winter of its reign\" Deutsche Bank economist Heike Mai argues that while use of cashless payments in the form of cards and apps is growing exponentially, the status of cash as king is not yet under threat.\nIn other words, to paraphrase Mark Twain, reports of cash's death are greatly exaggerated.\nMai focuses her research on Europe, and particularly the eurozone, where the European Central Bank recently decided to remove the €500 note from circulation as a way of making money laundering and organised crime more difficult. \"Cash is facing many challenges in the euro area,\" Mai writes, adding that \"this note represents about one quarter of the value of cash in circulation.\"\nObviously, removing 25% of the cash in circulation poses some threat to the usage of physical currency, but Mai argues that the reason central banks are looking to move away from notes and coins is something of a false prophecy.\nEssentially, getting rid of cash doesn't markedly decrease levels of money-related crime.\n\"There are good reasons to believe that cash won't disappear anytime soon from the euro area,\" she writes.\n\"First, it is debatable that a cashless society would mean less crime. For example, the ratio of damage caused by card fraud to the value of counterfeit notes in circulation is over 10 to 1.\"\nMai argues that if society were to take away cash, criminals could find new ways of moving money without detection. Here's the extract (emphasis ours):\n\"The available evidence suggests that restrictions on cash use will probably reduce for-profit crime but will certainly not eliminate it.Other means of storing and transferring illegally obtained assets without leaving many traces are already in use. They include the transport of other physical valuables (e.g. prepaid instruments, precious metals) as well as using false identities, criminal middlemen and shell companies to facilitate cashless transfers via regulated entities like the banking system, money transmitters or online payment service providers.\"\nEven in Sweden, Mai argues, a society where cashlessness is incredibly popular (I visited Stockholm earlier this year and can confirm that shop assistants look at you strangely if you try and pay with a note or handful of coins) the abolition of cash won't prevent crime.\nThe amount of cash in circulation as a percentage of GDP in Sweden has dropped from around 3% in 2008, to roughly 1.8% now, but that hasn't stopped financial crime.\n\"Rather surprisingly, though, the number of reported money laundering offences increased over the past years. This could signal that money laundering is not directly related to or even dependent on the usage and availability of physical currency,\" Mai writes.\nCrime plays a massive role in the argument for a cashless society. However, there is another, simpler argument why physical money isn't going to disappear any time soon. People like cash. \"Some economies like using cash, for example, Germany, Spain, Italy and Austria,\" Mai adds.","url":"https://www.businessinsider.com/cashless-society-end-of-cash-deutsche-bank-2016-12"}
