{"authors":["Matt Turner"],"date_download":"2018-10-31 00:16:06","date_modify":"2018-10-31 00:16:06","date_publish":"2016-12-02 00:00:00","description":"The German bank has decided to reduce the number of sales and trading clients it deals following a review of its client list.","filename":"data/vaneerConsumption/DeutscheBankiscuttingitsclientlist.json","image_url":"https://amp.businessinsider.com/images/581205dfb28a648f198b491d-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deutsche-bank-is-cutting-its-client-list-2016-12_1540944966.html","title":"Deutsche Bank is cutting its client list","title_page":"    Deutsche Bank is cutting its client list - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Deutsche Bank is cutting 3,400 clients off.\nThe German bank has decided to reduce the number of sales and trading clients it deals with following a review of its client list. Dixit Joshi, the head of the bank's salesforce for equities and debt, announced the move in a memo on Friday. Rob Copeland and Jenny Strasburg at The Wall Street Journal were first to report the news.\nThe bank said in October it would reduce the number of clients in global markets by up to 50% as part of an effort to reduce the complexity of the investment bank.\nOn a slide setting out these steps, Deutsche Bank said that 30% of its core clients generated 80% of its revenues, with the tail of clients, the other 70%, generating 20% of revenues.\nThis is Deutsche Bank's own version of the age-old 80/20 rule on Wall Street. In short, 80% of revenues are generated by 20% of clients. Another version of this rule holds that 80% of revenues are generated by 20% of the staff, who might well be covering these core clients.\nDeutsche Bank\nIn better times, banks are happy to maintain the tail end of clients, as the cost associated with servicing them isn't that much of a focus. In tougher periods, in contrast, banks either find cheaper ways to service them, like handing them off to more junior staff or staff based in lower-cost locations, or they cut them completely.\nDeutsche Bank isn't the first to cut its client list, and it's not alone in paying closer attention to which clients are most profitable. Still, the shift to prioritizing \"core clients\" has broad ramifications for the competition for business on Wall Street, and the kind of service the tail end of clients receives.\nGreenwich Associates, the capital markets consultancy, said in a note earlier this year that \"less sophisticated clients are being directed to e-trading solutions and junior sales traders.\"\nThat sort of treatment has long been common in equities — think Michael Lewis' \"Liar's Poker\" and \"equities in Dallas\" — but it is now permeating the bond market, too.\n\"The growth of e-trading in fixed income has expanded this form of client tiering considerably,\" Greenwich said.","url":"https://www.businessinsider.com/deutsche-bank-is-cutting-its-client-list-2016-12"}
