{"authors":["Will Martin"],"date_download":"2018-10-30 21:40:17","date_modify":"2018-10-30 21:40:17","date_publish":"2016-12-19 00:00:00","description":"On a trade-weighted basis, the pound has gained 6% since October, but any rally is about to come to an end, Deutsche Bank argues.","filename":"data/vaneerConsumption/DeutscheBankontheendofthepoundssurge.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deutsche-bank-pound-will-fall-brexit-2016-12_1540935617.html","title":"Deutsche Bank on the end of the pound's surge","title_page":"    Deutsche Bank on the end of the pound's surge - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"David Gray/Reuters LONDON — The pound has \"seen its surge\" and the only way from here is down, according to Deutsche Bank's latest research on Britain's downtrodden currency.\nWriting in a note circulated to clients on Monday, Deutsche macro strategist Oliver Harvey argues that while the pound has jumped 6% on a trade-weighed basis in recent months, following its post-Brexit crash, it will continue to appreciate in the final couple of weeks of 2016 and into 2017. In short, the only way is down for sterling.\nSeveral factors will influence sterling's renewed fall in the coming months, but as with many currencies right now, politics reigns supreme.\nIn November HSBC's currencies team argued that the traditional relationship between major currency movements and economic events has now come to an end, and in its place, big political developments like Brexit and the election of Donald Trump are now in charge.\nThis theme is set to continue, Harvey argues, noting that political disruption in Europe in the new year could derail the British government's chance of securing the best possible Brexit deal.\nHere is the key extract (emphasis ours):\n\"The market has all but priced out the risk premium introduced after Theresa May's conference speech in early October and mentions of Brexit on Bloomberg have dropped to their lowest levels since the referendum. But political risk looks set to rise into the new year. UK government rhetoric on reaching an interim deal has been more constructive but agreement needs to be soon or Brexit exposed companies will vote with their feet. Given the very messy European political calendar in H1 (including Dutch, French and likely Italian elections), we are concerned that initial negotiations could be fractious.\"\nAnother vulnerability the pound has over the course of the next year is the potential for the US dollar to appreciate further against China's renminbi, should the Chinese government continue to devalue it in order to make exports even more competitive.\nHere is Harvey again:\n\"Sterling is vulnerable to a higher USD/CNY. GBP underperforms during periods of capital outflows due to its heavy share in Chinese reserves. These have picked up to the largest levels since January and our Asia strategist forecast more weakness for the renminbi into the new year.\"\nHarvey adds that while sterling may have looked cheap recently, that is no longer the case, which could in turn stop buyers entering the market.\n\"In contrast to a month ago, sterling is no longer cheap on rate differentials. Indeed, the two year spread against the dollar points to fair value sub 1.20, while EUR/GBP seems around fair,\" he writes.\nOn Monday, sterling is slipping against the dollar, losing roughly 0.8% of its value to trade below $1.24 as of 1.00 p.m. GMT (8.00 a.m. ET).\nHere is the chart:","url":"https://www.businessinsider.com/deutsche-bank-pound-will-fall-brexit-2016-12"}
