{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:45:38","date_modify":"2018-10-30 20:45:38","date_publish":"2016-12-28 00:00:00","description":"'The policies that underpin free trade and a rules-based, open international economic order can be reversed, as history cautions.'","filename":"data/vaneerConsumption/DEUTSCHEBANKGlobalizationisundersiege.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deutsche-bank-asset-management-threat-to-globalization-populism-brexit-trump-2016-12_1540932338.html","title":"DEUTSCHE BANK: 'Globalization is under siege'","title_page":"    Deutsche Bank Asset Management on threat to globalization and populism - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A 15th century seige. Wikimedia Commons Deutsche Asset Management, the asset management arm of Deutsche Bank, believes globalization is under serious threat and the \"benefits have to be better articulated to the public.\"\nJosh Feinman, Deutsche Asset Managment's global chief economist, says in a recent note to clients that anti-globalization sentiment has \"unleashed a political backlash, an anti-establishment revolt— \"a politics of rage\" —that has contributed to the UK vote to leave the EU, the U.S. election of Donald Trump, and the rise of populist, nationalist parties throughout Europe and in parts of Asia too.\"\nHe adds that \"Opposition to globalization is not the only driver of these trends, but it has certainly played a key role.\" Feinman concludes: \"Globalization is under siege.\"\nDeutsche Bank is notoriously bearish on global trade, with the bank's chief forex strategist George Saravelos already calling \"peak\" globalization. However, while Saravelos was predicting a looming unwinding of globalization, Feinman concerns himself mainly with diagnosing the causes of this unwinding.\nFeinman believes the main driver of the current backlash against globalization is rising inequality. He points to OECD and World Bank figures that show the Gini coefficient, a standard measure of inequality, has worsened across most developed nations over the last 30 years, notably in China and the US. (The closer to 1 that the Gini index is, the more unequal income distribution.) Deutsche Asset Mangement\nFeinman admits that globalization has played a part in widening inequality in developed nations, saying: \"Within countries, inequality has rebounded sharply over the last three or four decades, especially in advanced economies, where upper-income people have reaped disproportionate gains, and metrics of inequality have in some places retraced to levels not seen since the early 20th Century.\"\nHowever, at a macro-level globalization has largely been good at reducing inequality. Feinman says: \"In general, poorer countries that have liberalized and become part of the global system have tended, at least over the past couple of decades, to grow faster than more advanced economies, though a few regions (emerging Asia and Eastern Europe) are largely responsible for this catch-up, and glaring gaps in average living standards between the emerging and the advanced worlds persist.\"\nFeinman says globalization has been an easy target for politicians on both the left and right because \"the benefits of trade, while substantial in aggregate, are often diffuse and hard to pinpoint, while those who lose out from trade, though small in number, are easy to identify, usually uncompensated, and understandably vocal.\"\nFeinman says of this backlash: \"It's starting to have an effect. Not just politically, where populist, anti-globalization sentiments have helped tip recent elections in Europe and the U.S. But economically too, where signs are building that globalization itself may be losing momentum. International trade has slowed, barely outpacing global GDP growth in recent years after running at more than twice its pace in the quarter-century or so from the mid-1980s.\" (You can read more about Deutsche Bank's peak globalization call here.)\nFeinman says that globalization has not yet gone into reverse but is in \"a slower gear.\" He adds that some of this could be down to cyclical factors such as weak investment spending and the collapse in commodity prices.\nA woman snaps a photograph of a group of demonstrators who were protesting the Trans-Pacific Partnership, at the Federal Building in San Francisco, California June 9, 2015. Reuters/Robert Galbraith But Feinman adds: \"What's most worrying is that policies have been shifting against globalization. Tariff reductions have stalled, non-tariff barriers and other trade discriminating measures have been on the rise, more countries have been limiting immigration, some (including China) have tightened capital controls, and the adoption of trade pacts has slowed, as evidenced most prominently by the failure of the Doha round of trade liberalisation and the U.S.'s recent decision not to ratify the TPP.\"\nHe says: \"So far, these are mostly risks. Cooler heads may well prevail... But the policies that underpin free trade and a rules-based, open international economic order can be reversed, as history cautions.\" He highlights the backlash against the first wave of globalization that occurred in the run-up to the first world war, with curbs on American immigration and increased tariffs in England.\nFeinman says: \"Globalization must never be taken for granted. Its benefits have to be better articulated to the public, the risks of abandoning it more clearly spelled out, and the minority who are hurt by free trade and open markets perhaps better compensated for their losses.\nHe is not the only one making this argument. Former Chancellor George Osborne said an event earlier this year: \"We shouldn't be surprised — if we're not making an effort those of us who believe in free trade — that those who argue against free trade or more protectionism are out there in that vacuum we've created.\" He called for more people to \"start fighting now\" to protect free trade.","url":"https://www.businessinsider.com/deutsche-bank-asset-management-threat-to-globalization-populism-brexit-trump-2016-12"}
