{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-23 00:37:51","date_modify":"2018-10-23 00:37:51","date_publish":"2016-01-28 14:45:30","description":"When Andy Howland, a high school wrestler with Down's Syndrome, needed a clash - star athlete Deven Schuko answered the call. The pair battled it out at his school in Massachusetts.","filename":"data/vaneerConsumption/DevenSchukosacrificeswrestlingrecordtohelpAndyHowland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAEF4000000578-0-image-a-76_1453991722228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421021_Talented-high-school-sportsman-sacrifices-perfect-wrestling-record-help-student-special-needs-centre-stage_1540255071.html","title":"Deven Schuko sacrifices wrestling record to help Andy Howland","title_page":"Deven Schuko sacrifices wrestling record to help Andy Howland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A super-talented sportsman sacrificed his perfect wrestling record to help a student with special needs take center stage.\nIt could be a scene from a sugar-sweet teen movie - but this touching moment actually happened at a school in Massachusetts.\nDeven Schuko has enjoyed an incredibly successfully high school wrestling career so far, winning over 100 matches and rising to the rank of co-captain of his school's team.\nHowever, while usually the thought of losing a match would never even cross his mind the young athlete was happy to blemish his record for a clash against fellow wrestling fan, Andy Howland.\nDeven Schuko gave up his perfect record to make the day of fellow wrestler Andy Howland, both pictured\nGrapple: Andy executes a hold on Devon as the pair battle it out on the floor of Norton High School's hall\nAndy, 21, goes to Dighton-Rehoboth High School, suffers from Down's Syndrome and challenged Deven to a match in front of their classmates.\nNorton High School student Deven told the Sun Chronicle as soon as he heard about the clash, there was only one thing he wanted to do.\nHe said: 'I asked the coach, and he said he thought that would be a great idea. We just wanted to make his day.\n'If I had to lose to someone, I'd like to lose to Andy. It was a win-win in my book.'\nFinisher: Andy wins the goodnatured encounter by pinning successful school sportsman, Deven, on the floor\nDeven said 'If I had to lose to someone, I'd like to lose to Andy. Pictured, Andy walks off after winning the match\nThe match was filmed by a parent in the crowd and the touching occasion represented a big win for Andy, who has a 27-0 record and has been wrestling for around six years","url":"https://www.dailymail.co.uk/news/article-3421021/Talented-high-school-sportsman-sacrifices-perfect-wrestling-record-help-student-special-needs-centre-stage.html"}
