{"authors":[],"date_download":"2018-10-30 14:32:04","date_modify":"2018-10-30 14:32:04","date_publish":"2016-05-25 15:01:00","description":"Real estate services outfit Transwestern has an office tower on the drawing board for a parcel at Perimeter Mall, joining a boom-let of office projects in the Atlanta area’s largest sub-market.","filename":"data/vaneerConsumption/DevelopersplanninganewofficetowerinDunwoody.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/25/Images/photos.medleyphoto.9900013.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_developers-planning-new-office-tower-dunwoody__1540909924.html","title":"Developers planning a new office tower in Dunwoody","title_page":"Developers planning a new office tower in Dunwoody","title_rss":"NULL","source_domain":"ajc.com","text":"Real estate services outfit Transwestern has an office tower on the drawing board for a parcel at Perimeter Mall, joining a boom-let of office projects in the Atlanta area’s largest sub-market.\nTranswestern officials presented a plan last week to the Dunwoody Development Authority for a 16-story tower on an out-parcel at the mall across Hammond Drive from the State Farm campus, Dunwoody’s head of economic development, Michael Starling said. The property is also adjacent to the Dunwoody MARTA station.\nMessages left for Transwestern officials was not immediately returned and a spokeswoman for the company declined to comment. A message left with an executive with Perimeter Mall owner General Growth Properties was not immediately returned.\nDunwoody Reporter, which reported the project Tuesday, has renderings and other details here.\nThe developers are seeking tax incentives as part of the project. The deal also would involve a parking deck currently leased to MARTA, Starling said.\nHe said the project will require action by the city council to allow for the building’s height.\nThe potential project comes as another major Dunwoody development was shelved. Crown Holdings on Monday withdrew its plans for four high rises a block south of Perimeter Mall.\nCrown was seeking a rezoning of part of the former Gold Kist headquarters site to allow two condo towers to be built along with two office buildings. The site already carries the office zoning.\nBut Crown Holdings decided to shelve the rezoning plan for fear that it would not pass muster with Dunwoody City Council.\nMost of the new office construction in Dunwoody — and throughout the metro area — is for specific corporate tenants, such as State Farm, Mercedes-Benz USA in Sandy Springs and NCR in Midtown.\nThe region’s speculative office projects have been kept in check, leading to a near historic squeeze in metro Atlanta for top-end office space. Vacancy was 17.2 percent in metro Atlanta in first quarter and even narrower for Class A space, according to real estate services firm JLL.\nThe Transwestern project appears to be a speculative play, meaning it’s not designed for a specific tenant. It would join a project underway by Seven Oaks Co. at Perimeter Summit in Brookhaven among the ranks of spec office projects in Central Perimeter.","url":"https://www.ajc.com/business/developers-planning-new-office-tower-dunwoody/TASSyqBKritG7m1fio6HCP/"}
