{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:32:49","date_modify":"2018-10-22 21:32:49","date_publish":"2016-01-29 07:07:39","description":"Deven Black, 62, was lying in bed in Boulevard shelter in East Harlem at 11.50pm on Wednesday when his roommate Anthony White, 21, allegedly slashed his throat and nearly severed his head.","filename":"data/vaneerConsumption/DevenBlackstabbedandalmostbeheadedinNYCbyroommateAnthonyWhite.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/07/30B02BE200000578-0-image-a-42_1454051211584.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422272_Former-teacher-62-stabbed-beheaded-21-year-old-roommate-New-York-City-homeless-shelter_1540243969.html","title":"Deven Black stabbed and 'almost beheaded' in NYC by roommate Anthony White","title_page":"Deven Black stabbed and 'almost beheaded' in NYC by roommate Anthony White | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former public school teacher has been stabbed to death in a homeless shelter in Harlem, New York, reports claim.\nDeven Black, 62, was lying in bed at 11.50pm on Wednesday when his roommate Anthony White, 21, allegedly slashed his throat and nearly severed his head, according to the New York Daily News.\nHis body was found in Boulevard, a private shelter, the next morning.\nKilled: Deven Black, 62, (left) was lying in bed at 11.50pm on Wednesday when his roommate Anthony White, 21, (right) allegedly slashed his throat and nearly severed his head\nPolice have launched a city-wide manhunt for White, the NYPD said in a press release.\nBlack, who won an Academy Of Education award for his work as a librarian in the Bronx in 2013, was made a substitute teacher in 2014.\nLast year, he was charged with theft which led to him being suspended without pay. It is not clear when he vacated his residence in Nyack, New York, and when he first took shelter in East Harlem.\nMayor Bill de Blasio branded the slashing 'deeply disturbing'.\nNYPD Chief of Detectives Robert Boyce said in a statement: 'This individual had this throat lacerated and then apparently bled out because of that. One of the security officers opened the door, saw him laying on the floor, and that's when Mr. White ran out.'\nThe slaying came after days of White threatening to harm or kill people in the shelter, the New York Times reported.","url":"https://www.dailymail.co.uk/news/article-3422272/Former-teacher-62-stabbed-beheaded-21-year-old-roommate-New-York-City-homeless-shelter.html"}
