{"authors":["Associated Press"],"date_download":"2018-10-23 01:30:15","date_modify":"2018-10-23 01:30:15","date_publish":"2016-01-29 15:29:00","description":"JOHANNESBURG (AP) — AB de Villiers will continue as test captain on a permanent basis after accepting the offer from Cricket South Africa. The national selec...","filename":"data/vaneerConsumption/DeVilliersacceptsoffertobepermanentSAfricacaptain.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422961_De-Villiers-accepts-offer-permanent-SAfrica-captain_1540258215.html","title":"De Villiers accepts offer to be permanent SAfrica captain","title_page":"De Villiers accepts offer to be permanent SAfrica captain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"De Villiers accepts offer to be permanent SAfrica captain\nJOHANNESBURG (AP) — AB de Villiers will continue as test captain on a permanent basis after accepting the offer from Cricket South Africa.\nThe national selectors recommended De Villiers to the CSA board, which announced the decisions on Friday.\nDe Villiers was the stand-in captain for the last two home tests against England, after Hashim Amla quit the job.\nHis first assignment in charge will be a home series against New Zealand in August.\n\"I thoroughly enjoyed captaining in the last two tests against England, and although I still have a lot to learn in this role, it's a new challenge that I'm excited to take on,\" De Villiers said in a statement released by CSA.\nEmboldened by the consolation 280-run win over England on Tuesday in the fourth and last test, De Villiers said \"I believe we are witnessing the emergence of another great team. We are rebuilding and have a long way to go to being a finished product as a squad.","url":"https://www.dailymail.co.uk/wires/ap/article-3422961/De-Villiers-accepts-offer-permanent-SAfrica-captain.html"}
