{"authors":["Lisa","Burnett Gavin Lesnick"],"date_download":"2018-10-30 19:09:36","date_modify":"2018-10-30 19:09:36","date_publish":"2015-07-01 00:00:00","description":"A suspicious package found near Camp Robinson on Wednesday morning had components of a bomb and will be analyzed further, authorities said.","filename":"data/vaneerConsumption/DevicefoundnearCampRobinsonhadcomponentsofbombpolicesay.json","image_url":"https://media.arkansasonline.com/img/photos/2015/07/01/20150701_115313_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_jul_01_nlr-police-investigate-suspicious-device__page=1_1540926576.html","title":"Device found near Camp Robinson had 'components' of bomb, police say","title_page":"Device found near Camp Robinson had 'components' of bomb, police say","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Police officers direct traffic away from Remount Road Wednesday while authorities investigated a suspicious package found to have the components of a bomb. - Photo by Gavin Lesnick\nA suspicious package found near Camp Robinson on Wednesday morning had components of a bomb and will be analyzed further, authorities said.\nThe device was spotted shortly after 10 a.m. just off the roadway in the 8200 block of Remount Road. That area was blocked in both directions for about two hours. The device was cleared and the road reopened about noon.\nNorth Little Rock Police Department Sgt. Brian Dedrick said investigators with the Bureau of Alcohol, Tobacco, Firearms and Explosives went to the scene and examined the package. A preliminary look revealed it had components, such as a fuse and electrical parts, that meant it could be \"some type of bomb device.\"\nThe federal investigators took custody of the package, which Dedrick said was also wrapped in tape, and will investigate it further.\nDedrick said the device was similar to one found last year in Burns Park.\nPolice are \"always on heightened alert\" around holidays, Dedrick said, adding that authorities learned of the suspicious package Wednesday when a passerby saw it and called 911.\n\"That's what we encourage people to do,\" he said.\nEARLIER\nThe North Little Rock Police Department is investigating a suspicious device that was found on Remount Road on Wednesday morning.\nNorth Little Rock Police Department spokesman Sgt. Brian Dedrick said the department received a call about 10:08 a.m. reporting a “suspicious device” at 8200 Remount Road.\n“Camp Robinson police were also called out,” he said.\nNorth Little Rock police are currently working with the Bureau of Alcohol, Tobacco, Firearms and Explosives' bomb squad to assess the device, Dedrick said.\nRemount Road is blocked off from Spriggs Road and Batesville Pike, Dedrick said.\nDetails are still developing at this time.\nSee Thursday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2015/jul/01/nlr-police-investigate-suspicious-device/?page=1"}
