{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:36:05","date_modify":"2018-10-30 18:36:05","date_publish":"2018-06-29 15:45:19","description":"U.S. Education Secretary Betsy DeVos says switching to the type of education embraced by countries such as Switzerland would “help catch us up.”","filename":"data/vaneerConsumption/DeVosWantsUStoAdoptEuropeanEducationPolicies.json","image_url":"https://media.breitbart.com/media/2018/03/Betsy-DeVos-Scolds-Alex-WongGetty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_29__1540924565.html","title":"DeVos Wants U.S. to Adopt European Education Policies","title_page":"DeVos Wants U.S. to Adopt European Education Policies","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Education Secretary Betsy DeVos says switching to the type of education and workforce development policies embraced by countries such as Switzerland, the Netherlands, and the U.K. would “help catch us up” to students in other countries.\nThe “Post-16 Skills Plan” compliments the U.K.’s established academic track toward college/university for students completing high school at 16. A T-level program prepares students for employment in a skilled trade or pursuit of higher technical/skilled education. #RethinkSchool pic.twitter.com/YZMRsJGWK1 — US Dept of Education (@usedgov) June 15, 2018\nIn an op-ed at Education Week, DeVos writes that during a recent international trip, she found these European countries have a centralized approach to education and workforce development, similar to what she hopes to achieve through a merger of the U.S. Departments of Education and Labor, as announced last week via a federal government reform plan.\nIn the Netherlands, there are a range of educational options that students can choose from, including a strong vocational education and training system which boasts a high graduation rate and good career preparation. #RethinkSchool pic.twitter.com/ZQv7tRqIjz — US Dept of Education (@usedgov) June 11, 2018\nDeVos asserts that in these countries, “freedom in education isn’t controversial – it’s common sense.”\nThe secretary is a proponent of school choice – the provision of federal funds for both public and private schools – as well as personalized and social and emotional learning (SEL), in which personality, psychological, and attitudinal data are collected on students to improve education outcomes.\nIn an effort to put students and learning at the center of the U.K. education system, schools are granted more autonomy and the community allowed more say in a personalized learning experience. #RethinkSchool pic.twitter.com/Jayed69BUo — US Dept of Education (@usedgov) June 14, 2018\nDutch education outcomes consistently rank among the best in the world. One reason why: their secondary education system is customized to support a student’s long-term goals. #RethinkSchool pic.twitter.com/g5ZjLaccOj — US Dept of Education (@usedgov) June 11, 2018\nAs children learn to understand and control their emotions, teachers can provide support by showing empathy and encouraging children to do the same. #SEL pic.twitter.com/vH3QA9T8Mg — US Dept of Education (@usedgov) June 25, 2018\nDeVos highlights some of the key features she observed on her tour:\nIn the countries I visited, education is oriented around the distinct needs of each student. In the Netherlands, freedom in education is enshrined in the constitution, which requires that the state provide equal funding for both publicly run and private schools. Two-thirds of students in the Netherlands attend schools that are privately run and taxpayer funded. … In England, greater autonomy at the school level has been encouraged with the creation of “academies,” similar to charter schools in the United States, and “free schools,” both of which are granted significantly more flexibility for educators. Under Prime Minister David Cameron, the number of academies greatly increased, and free schools were created to serve as incubators of innovation and improve student achievement. Today, more than 70 percent of secondary schools in England have adopted the academy or free school model. … Switzerland is known for its robust apprenticeship program, with more than two-thirds of high school students engaged in one of the roughly 300 government-recognized apprenticeships.\nWhat drove education reform in the U.K.? A recognition they were falling behind the rest of the world. In science, math and reading, the U.K. lags behind many international competitors, though its results still outpace the U.S. #RethinkSchool pic.twitter.com/I2OBMsLGwO — US Dept of Education (@usedgov) June 14, 2018\nThe secretary bemoans the fact that U.S. students have been falling behind on international standardized tests.\n“In science and math, students in Switzerland, the Netherlands and the United Kingdom outperformed U.S. students on the most recent Program for International Student Assessment,” she explains. “The United States ranked 23rd in reading, 25th in science, and 40th in math. If we finished 40th in the Olympics there’d be a national outcry!”\nWhile DeVos’s comments are directed principally toward those public school advocates who continually want more federal funding funneled into a public education system that appears to be failing, the conservative and constitutionalist base of the Republican Party maintains a federal role in education and workforce development not only does not exist in the Constitution, but its continued presence means greater regulation and more data collection of students in order to meet the workforce needs of big corporations.\nAdditionally, though DeVos has stated publicly that the Common Core standards are “dead,” education policy watcher Shane Vander Hart of Truth in American Education wrote earlier this year that the Every Student Succeeds Act (ESSA), “engineered by Sens. Lamar Alexander (R-TN) and Patty Murray (D-WA) – essentially cemented Common Core into every state in the country.”\n“Sure, the U.S. Department of Education is not actively pushing Common Core, they don’t need to,” he observed. “The standards and assessment consortiums don’t need to be funded anymore. The damage is done. They don’t need to publicly push it because ESSA essentially codified Common Core.”\nJane Robbins, senior fellow at American Principles Project, told Breitbart News:\nIt’s troubling that so many education policy-makers, including Secretary DeVos, are drawn to the European system of the school-to-work pipeline. Revamping our entire system to create cogs for politically connected companies isn’t the way to “catch up.” If she’s really concerned about math scores on international tests, it would be more effective to assure states they won’t be penalized for replacing the deficient Common Core math standards with good standards.\nSimilarly, during a Breitbart News interview, Eunie Smith, president of the Eagle Forum, expressed her concerns about a merger of the Departments of Education and Labor.\n“The type of education the individual receives would be influenced by crony corporations dictating to schools the skills needed for future workers,” she warned. “And the preferences of big business are already disproportionately represented in ‘the swamp.’ Officially blending the education and labor systems would raise cronyism to new levels.”\nSmith also observed the concerns about the privacy of student data. She said her own state of Alabama has a longitudinal data system that combines the data from at least ten different agencies of state government into one centralized state data base.\n“That’s a minefield for anybody who gets into that data base,” she said, adding that the economy President Donald Trump says he wants will not happen with a merger of the two departments.\n“Centralized, government-planned economies do not work, and that’s not the free market system under which America and our economy have prospered,” Smith explained. “Our president knows that. But this is contrary to that. And even though the proposed merger of the Departments of Education and Labor is going to be presented as a downsizing of the federal government, it’s not going to play out that way, and we will have a move toward government-planned economy.”","url":"https://www.breitbart.com/politics/2018/06/29/devos-wants-u-s-to-adopt-european-education-policies/"}
