{"authors":[],"date_download":"2018-10-30 19:51:05","date_modify":"2018-10-30 19:51:05","date_publish":"2018-06-29 18:59:00","description":"The grandmother of Kentea Williams, an autistic 10-year-old allegedly drowned by his adoptive dad in DeKalb County, is suing the Division of Family Children Services for not properly handling previous claims of abuse.","filename":"data/vaneerConsumption/DFCSsuedoverhomicidedrowningofautisticboy10inDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/05/16/Images/18443742_518649158525270_1008817139848577024_n.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dfcs-sued-over-h_34c69802d1ef6bd3131386f5b49fd126__icmp=np_inform_variation-test_1540929065.html","title":"DFCS sued over homicide drowning of autistic boy, 10, in DeKalb","title_page":"DFCS sued over homicide drowning of autistic boy, 10, in DeKalb","title_rss":"NULL","source_domain":"ajc.com","text":"The grandmother of Kentae Williams, an autistic 10-year-old allegedly drowned by his adoptive dad, is suing the Division of Family Children Services for not properly handling previous claims of abuse.\nSeveral DFCS workers were fired last year after Leon Williams, 44, allegedly told DeKalb County police he held the boy underwater in the tub while lecturing him for acting out at Cedar Grove Elementary. Hours before he died at their apartment outside Decatur, a neighbor said she heard Williams tell the child he would “die tonight,” police said.\nThe lawsuit, filed in DeKalb County Superior Court by Antionette Tuff, alleges there were plenty of warnings the child was being abused. For example, people said they saw the boy kept outside in the cold as punishment.\nREAD: How a DeKalb couple allegedly stole $200K through a car washing scheme\nREAD: DeKalb Bloods gang members get long sentences for executing 2 women\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nIn the days before his death, state officials investigated two complaints within two weeks for alleged mistreatment of Kentae by Williams. But two DFCS supervisors and a case worker failed to even open an investigation on one of the complaints, according to DFCS.\n“We should have escalated this case,” Virginia Pryor, deputy division director for child welfare for DFCS said last year. “We should have had a higher level of scrutiny.”\nThe suit is against Georgia Department of Human Services and the DeKalb DFCS office, which is under DHS. A spokesman for DHS didn’t immediately return a call seeking comment.\n“DFCS has a history of high employee turnover, which leads to a workforce full of young, inexperienced workers,” the suit alleges.\nTuff couldn’t immediately be reached for comment. A spokeswoman for the Antionette Tuff who was hailed as a hero for saving a DeKalb school from a gunman said it is a different Antionette Tuff filing the suit.\nThe adoptive father is set to stand trial for murder on July 9.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/dfcs-sued-over-homicide-drowning-autistic-boy-dekalb/3srKpZxQdZyIXQAIBGYu3O/?icmp=np_inform_variation-test"}
