{"authors":["Neil Munro"],"date_download":"2018-10-30 19:07:32","date_modify":"2018-10-30 19:07:32","date_publish":"2018-09-11 21:30:23","description":"Legal loopholes have ensured that only 1.4 percent of the 94,000 \"family unit\" migrants who arrived in 2017 were sent home by July 2018, according to agency data provided to Breitbart News.  | Politics","filename":"data/vaneerConsumption/DHSDataOnly14Percentof2017FamilyUnitMigrantsSentHomebyMid2018.json","image_url":"https://media.breitbart.com/media/2018/09/AP_18207772311912-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_11__1540926452.html","title":"DHS Data: Only 1.4 Percent of 2017 'Family Unit' Migrants Sent Home by Mid-2018","title_page":"DHS Data: Only 1.4 Percent of 2017 'Family Unit' Migrants Sent Home by Mid-2018 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Legal loopholes ensured that only 1.4 percent of the 94,000 “family unit” migrants who arrived during 2017 were sent home by July 2018, according to agency data provided to Breitbart News.\nThe unreleased agency data ends just before President Donald Trump’s administration rolled out a series of fixes to close the loopholes. Those fixes include increased prosecutions, asylum reforms and the replacement of the Flores settlement.\nThe fixes by Trump and Attorney General Sessions likely will ensure that most of the 2017 migrants will be ordered by judges to leave the United States during 2019. The changes will nudge up Americans’ wages before the 2020 election if the deportation orders are enforced by the U.S. Immigration and Customs Enforcement agency — despite the Democrats’ “Abolish ICE!” and sanctuary-city campaigns.\nTrump’s deputies know “this is a long game and they are in it for the long haul,” said Jessica Vaughan, policy director at the Center for Immigration Studies. “They are not in it for flash-in-the-pan measures that deal with only a small fraction of the cases.”\nRepairing the immigration system is similar to repairing a damaged house, she said. Sessions, she said, is:\ntrying to fix a house that has been fundamentally weakened by weather and abuse over the years … He is not just putting a coat of paint on it. He is strengthening the foundation … repairing holes in the drywall, fixing the broken windows, [and] the electrical system that needed to be upgraded.\nThe new data about the 2017 migrants shows that “judicial orders and catch and release loopholes … leave us with no recourse for removal [so] we are seeing a record number of family units apprehended at the Southwest border,” said an agency source. The official continued:\nIn fact, of the nearly 100,000 family units from countries such as El Salvador, Guatemala, and Honduras apprehended or encountered at the border in Fiscal 2017, only 1.4 percent of them had been removed by the third quarter of Fiscal Year 2018. Secretary Nielsen has been urging Congress to act and close these loopholes that pull family units to the United States.\nThe data shows that 94,285 “family unit” migrants were registered as they crossed the border between October 1, 2016, and September 30, 2017. The data does not say how many of the migrants were adults, youths or children. Most family units are fragments. For example, they consist of a mother with younger children. The father often travels separately, sometimes with older children.\nBut only 252 migrants of the 94,285 migrants were quickly returned to their home country, and just 1,095 were formally “removed” after legal adjudication and deported home by the end of June 2018.\nThe meant 92,938 of the 2017 family migrants — or 98.6 percent — were still in the United States as of June 30, 2018, up to 21 months after they arrived.\nMany of the migrants are tough adults or youths who brave a gauntlet of dangers to work many hours in low-wage jobs, often to send the money back to poor family members in Central America. Often, the adults bring the children knowing they can be placed in public schools in blue-collar neighborhoods. Very few of the migrant children are at American grade levels, some don’t even speak Spanish, and few attend the same private or public schools which serve the children of pro-migration lawyers or congressional legislators and staffers.\nThe DHS chart shows that 91 migrants of the 2017 migrants promised a judge they will go home voluntarily to escape U.S. penalties and that 7,080 migrants were given “removal orders” by judges before the end of June 2018.\nSeventy-five percent of the migrants who got removal orders did not show up to their court cases. Their absence means that those 5,339 migrants have to be tracked and arrested by ICE, often in Democratic-run “sanctuary cities.”\nAnother 72,023 migrants were using the court system to win residency, mostly via asylum law, by June 30. Some 59,405 had filed cases by the end of June, while 12,618 still had time to file cases.\nOf those who filed cases, only 49 had been approved to live in the United States, while 4,230 were given some form of “temporary relief,” such as a “credible fear” approval.\nMany of the 59,405 migrants who had filed cases will skip their final hearings to minimize their chance of being denied residency, getting arrested and being deported. Those migrants will either be detained by ICE or remain in the illegal workforce.\nThe DHS data also shows that 10 percent of the 2017 migrants had already disappeared by June 2018 without registering legal claims in court. Some of these 9,385 “no reported update” migrants likely joined the resident illegal-immigrant population of roughly 11 million, and the illegal-alien workforce of at least 8 million workers.\nThe minority of migrants who are kept in detention can have their legal claims resolved in roughly 38 days, according to the Department of Justice. But few migrants are kept in detention, partly because pro-migration advocates in the media, the courts, in advocacy groups and in Congress have created the various catch-and-release loopholes.\nFor example, the GOP-run Congress has not tried pressure Democrats to close up the Flores loophole. The two parties have also capped the number of detention spaces at around 40,000 beds, which is far below the administration’s 2018 request for 50,000 beds.\nThe two political parties are pushing for looser border rules. In February 2018, the Senate rejected Trump’s “Four Pillars” immigration reform. In July, GOP chairman Kevin Yoder used the 2019 appropriations budget to defund Sessions’ reforms and expand three visa-worker programs. Also, Democrats are pushing legislation that would allow all pregnant women into the United States.\nThe biggest loophole is the 2015 Flores legal decree, which says that migrants who bring children must be released 20 days after they are caught at the border. That judicial decree is advertised by smugglers in the cartels as a loophole through the border wall. For example, the New York Times reported June 22:\n“This is the reason I brought a minor with me,” said Guillermo T., 57, a construction worker who recently arrived in Arizona. Facing unemployment at home in Guatemala, he decided to head north; he had been told that bringing his 16-year-old daughter would assure passage. He asked that only his first named be used to avoid consequences with his immigration case. “She was my passport,” he said of his daughter.\nIn August, Homeland Security Secretary Kirstjen Nielsen announced an agency regulation that will end the Flores 20-days deadline:\nToday, legal loopholes significantly hinder the Department’s ability to appropriately detain and promptly remove family units that have no legal basis to remain in the country. This rule addresses one of the primary pull factors for illegal immigration and allows the federal government to enforce immigration laws as passed by Congress.\nThe vast majority of migrants who got released in 2017 will not see a judge until 2019 because so many migrants were invited by Obama to use the courtrooms that the courtroom calendars are backlogged by two years:\nThe two-year delay is boon to the migrants and also to employers because Congress requires that migrants who wait more than six months for a judge must be granted work permits. In 2017, for example, officials were required to provide work permits to 400,000 migrants waiting for court decisions. These 400,000 migrants flooded into many lower-skilled jobs in restaurants, slaughterhouses, hotels and construction sites, to pay their smuggling debts to the cartels by providing cheap services to white-collar Americans.\nHowever, the illegal workplace competition also forces down the marketplace wages earned by blue-collar Americans and legal immigrants. In that sense, white-collar progressives and cheap-labor employers are working hand-in-glove with cartel labor-brokers to snatch work and wages from blue-collar Americans and their children.\nJustice Department data also show that the courts need roughly 15 months to decide on each non-adult migrant, dubbed an “Unaccompanied Alien Child.” The backlog is caused by the crush of 80,266 pending UAC cases as of June 30, 2018. The “unaccompanied” child and youth migrants are usually accompanied to the border by coyotes who then hand over the child to federal agencies for final delivery to the child’s parents or relatives living illegally in the United States. Many of these UACs subsequently join the blue-collar workforce.\nThe department also released basic information about the status of 31,754 UACs who arrived in 2017:\nIn FY17, CBP apprehended 31,754 UACs from the Northern Triangle of Central America. Of those 31,753 illegal Central American alien minors, 98.2 percent remain in the country today (as of June 30, 2018).\nThe current backlog of immigration court cases exceeds 700,000, nearly all of which was created since 2012 by Obama’s deputies:\nHowever, the reforms established by Attorney General Jeff Sessions are reversing the Obama-era trends, and have dramatically reduced the rate at which migrants are approved to stay in the United States.\nThe approval number has plunged from almost 120,000 in 2016 towards 70,000 in 2018, according to the TRAC research center at Syracuse University.\nThe number is expected to fall further in 2019 when the 2017 migrants’ claims are heard in court under the new rules set by Sessions. For example, migrants who got into the United States in 2017 by claiming a “credible fear ” of spousal abuse will have their court cases rejected in 2019 unless higher courts or Congress step in to preserve the northward flow of cheap labor and government-aid consumers.\nSessions has also ended the policy of “administrative closure” in which judges simply filed away the migrants’ cases without reaching a judgment, and has limited judges’ authority to delay judgments while migrants try alternative legal routes.\nAlready, Justice Department data show that administrative closures are down by almost 90 percent since 2016. Also, 42 percent of asylum requests are being denied in 2018, up from just 23 percent in 2016. Asylum approvals are up modestly from 17 percent in 2016 to 22 percent in 2018.\nThat trend is expected to accelerate in 2018, partly because Sessions is also hiring more judges to process the legal claims at a faster rate.\nSessions and Nielsen are trying to fix many problems in the migration system amid the continued daily emergencies caused by the huge inflow of migrants.\nSessions ” is trying to fix it because he wants to live in it and he wants Americans to have a home that services them over the long term,” said Vaughan. “The people who lived in it before had bratty children who wrote on the wall … there were termites rotting the foundation, all the electrical system have mice, and they abused the plumbing,” she said about Obama’s policies.\nOverall, the Washington-imposed economic policy of economic growth via immigration shifts wealth from young people towards older people by flooding the market with cheap white-collar and blue-collar foreign labor.\nFour million young Americans will join the workforce this year, but the federal government will also import 1.1 million legal immigrants, and allow an army of at least 2 million visa-workers to work U.S. jobs, alongside asylum-claiming migrants and illegal aliens.\nThat flood of outside labor spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions. Immigration also pulls investment and wealth away from heartland states because investment flows towards the large immigrant populations living in the coastal states.","url":"https://www.breitbart.com/politics/2018/09/11/dhs-data-very-low-percent-2017-family-unit-migrants-sent-home-by-mid-2018/"}
