{"authors":["Neil Munro"],"date_download":"2018-10-30 19:05:33","date_modify":"2018-10-30 19:05:33","date_publish":"2018-08-22 22:03:20","description":"Secret Amnesty for 350,000 Illegals Is Being Phased Out","filename":"data/vaneerConsumption/DHSEndingGiantAdministrativeClosureAmnesty.json","image_url":"https://media.breitbart.com/media/2018/08/jeff-sessions-8-9-18-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_22__1540926333.html","title":"DHS Ending Giant 'Administrative Closure' Amnesty","title_page":"DHS Ending Giant 'Administrative Closure' Amnesty | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Attorney General Jeff Sessions is reversing the closed-door “administrative closure” amnesty for 350,000 migrants which was quietly created by officials working for former President Barack Obama.\nThe huge amnesty was carried out by Obama’s judges in the immigration courts who told roughly 350,000 migrants that their case files were being placed in storage facilities instead of being used in trials to send them home.\nBut Sessions has ordered that the files be pulled from storage and sent back into the immigration courts, alarming immigration lawyers, and progressives.\nThe Sessions reversal was shown in a chart released by the Executive Office which reveals that 1,077 cases were revived by the Department of Homeland Security in July 2018, up from roughly 755 cases per month since October 2017.\nOverall, the number of cases being set back to the courts is on track to reach almost 10,000 in 2017, up from 8,397 in Trump’s first year, and 4,847 in Obama’s final year.\n“It is significant,” said Andrew Arthur, a former immigration judge who now works with the Center for Immigration Studies. “They are recalendering cases [because] the Attorney General said they did not have the authority to close cases,” he said.\nThe calendaring has to take place in stages, likely with dangerous migrants first, he said. “Basically, what they are focusing on is criminals first, cases in which immigration [agencies] have attempted in the past to get the recalendered,” he said.\nPro-migration groups will complain and sue about Sessions’ policy, but Sessions’ authority is decisive, Arthur said.\nThe migration industry is denouncing the amnesty reversal as an intrusion on the rights and authority of immigration judges. According to Jason Boyd, a policy advocate at the American Immigration Lawyers Association. In an op-ed for TheHill.com, he wrote:\nThe Trump administration has persistently devised ways to compromise the independence of immigration judges and prevent them from reaching fair, impartial decisions. Now it has come up with 8,000 more … Among various benefits, that [administrative closure] practice enabled judges to pause certain cases — so that, for example, immigrants could pursue legal status outside of the court system — and prioritize others. Altogether, administrative closure proved a vital procedural tool for preserving due process and enhancing docket efficiency.\nAILA wants the immigration courts to be taken away from Sessions’ Department of Justice, and instead be combined with the independent courts, under the Supreme Court and its array of progressive lobbyists in the universities and the pro-migration lobby groups.\nThe huge administrative-closure amnesty is just one of several means that Obama and his deputies used to encourage cheap-labor migration into the United States.\nFor example, Obama offered a legal blind-eye and work permits to roughly 800,000 younger illegals in his 2012 DACA amnesty, plus similar support in 2014 “DAPA” amnesty for roughly 3.5 million illegal immigrants who have children in the United States. The DAPA measure was struck down by a Texas court in 2015, and the DACA measure likely will be ended in 2019.\nObama’s aides changed immigration rules to provide “catch-and-release” to hundreds of thousands of Central American migrants from 2010 onwards. For example, his deputies choose to treat 200,000 youths and children who were being imported by their parents as “Unaccompanied Alien Children” instead of illegal migrants, and they offered quick asylum to migrants who said they were being abused by husbands or criminal gangs. Those decisions added at least 300,000 asylum-seekers to the courts, plus at least 400,000 cheap-labor workers to the labor pool. The inflow of those migrants is now dropping because of immigration reforms pushed through by Sessions.\nObama bumped up refugee inflows to a target of 110,000 in 2017. The refugee inflow is dropping to roughly 21,000 in 2018, and fewer in 2019.\nObama’s deputies minimized enforcement of immigration laws against resident illegal aliens and minimized worksite enforcement of laws against jobs going to illegal immigrants. “The number of ICE deportations from the interior dropped more than 70 percent since the peak in 2009, from about 236,000 to 65,000 in 2016, and is the lowest number of deportations in 10 years,” according to the Center for Immigration Studies:\nUnder Trump, worksite-enforcement and deportations are rising, with raids in Tennesse, Nebraska, Minnesota and other sites.\nObama’s officials also allowed a massive backup in employers’ applications for green cards. The result of the backup is that roughly 300,000 college-graduate visa-workers from India, China, and the Philippines are allowed to work in white-collar jobs even though their initial work-permits have expired, and even though they are unlikely to get green cards for several years.","url":"https://www.breitbart.com/politics/2018/08/22/dhs-ending-giant-administrative-closure-amnesty/"}
