{"authors":[],"date_download":"2018-10-22 21:17:14","date_modify":"2018-10-22 21:17:14","date_publish":"2014-05-06 13:37:47","description":"DHS announced two proposed rules to make it easier for some high-skilled immigrant workers, as well as spouses, to stay and work in the U.S.","filename":"data/vaneerConsumption/DHSProposesRulestoAttractRetainHighSkilledImmigrants.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/423376/20140506-dhs-mayorkas-sl-1114_ac1125962cb8f14192cca6d53e6bdf44.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_dhs-proposes-rules-attract-retain-high-skilled-immigrants-n98096_1540243034.html","title":"DHS Proposes Rules to Attract, Retain High-Skilled Immigrants","title_page":"DHS Proposes Rules to Attract, Retain High-Skilled Immigrants","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Obama administration announced Tuesday some proposed changes to make it easier for some high-skilled immigrant workers as well as the spouses of some workers to stay and work in the U.S.\nThe first would extend employment authorization to the spouses of H-1B foreign workers who have started the process to become legal permanent residents. Usually companies in fields like science, computer and engineering petition for an H-1B visa to make one of their workers a lawful permanent resident, but it does not include their dependents.\nThe second proposed rule would update regulations making it easier for H-1B1 and E-3 professionals from Chile, Singapore and Australia to work and stay in the U.S.\nIt would also broaden and expand the evidence professors and researchers can present to make it easier for them to request employment-based first preference (EB-1) visas.\nIn announcing the rules, which will take effect in a few months after a period of public comments, DHS Deputy Secretary Alejandro Mayorkas said these kinds of action \"do not replace the need\" for comprehensive immigration reform, which can only be enacted by Congress.\nCommerce Secretary Penny Pritzker said immigrants account for 13 percent of the population but 28 percent of new businesses in the U.S. \"Passing comprehensive immigration reform is a moral obligation that makes good economic sense,\" she said.","url":"https://www.nbcnews.com/news/latino/dhs-proposes-rules-attract-retain-high-skilled-immigrants-n98096"}
