{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-23 03:10:12","date_modify":"2018-10-23 03:10:12","date_publish":"2016-01-28 18:27:31","description":"Sue York, 55, from Lincolnshire, says she would shake and vomit at the prospect of her twice-daily jabs. The grandmother said the piercing 'felt completely different'.","filename":"data/vaneerConsumption/Diabeticwomanfirstinworldtogettransplantduetoneedlephobia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACE2D800000578-0-image-a-20_1454006192473.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421452_Diabetic-woman-world-pancreas-transplant-needle-phobia-managed-belly-button-pierced_1540264212.html","title":"Diabetic woman first in world to get transplant due to needle phobia","title_page":"Diabetic woman first in world to get transplant due to needle phobia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Worldwide first for someone to undergo the procedure for needle phobia\nSaid she was terrified of the twice-daily injections and pinprick tests\nDiabetic Sue York, 55, was so scared of needles it was putting her health at risk. She became the first woman to have a pancreas transplant because of a phobia\nA British woman has become the first patient in the world to have pancreas transplant because of her needle phobia.\nSue York, who has suffered from type 1 diabetes since she was a child, claims she would shake uncontrollably and vomit at the thought her twice-daily insulin injections.\nThis is despite the fact she has had a belly-button piercing for 20 years - a procedure she claims 'felt completely different' as needles are 'far more intrusive'.\nType 1 diabetes causes a person's blood sugar, or glucose, level to become too high because the pancreas doesn't produce any insulin.\nInsulin allows glucose to enter the tissues and be used as energy so people with type 1 diabetes must inject it.\nBut Ms York says her extreme phobia of needles meant the process was always a terrifying ordeal.\nUsually, transplants are only available to patients with a physical medical condition such as kidney failure.\nAfter several consultations with a board of doctors, she was finally placed on the transplant list for a pancreas on account of her phobia.\nOn February 13 last year a suitable donor became available and she underwent a full pancreas transplant at Manchester Royal Infirmary.\nThe three-hour operation was a success and Ms York, 55, of Mablethorpe, Lincolnshire, became the first person in the world to have such a transplant because of a phobia of needles.\nYesterday she told how the operation had transformed her life.\nAnd when asked about her naval piercing, she said it felt 'completely different'.\n'I had a piercing done for my 35th birthday. It was a present from my husband,' she said.\n'For me it is totally different (than a needle phobia).The piercing felt completely different when it was put in. Needles are far more intrusive.'\nThe grandmother-of-six told the BBC's Victoria Derbyshire programme the anticipation of the injection twice a day would leave her feeling physically sick.\n'I would measure the insulin up by distancing myself from it and switching myself off but when it came to actually putting the needle into my body that was a very different issue,' she said.\n'Sometimes I would shake uncontrollably and I would have to put it down and walk away.\nThe piercing felt completely different when it was put in. Needles are far more intrusive Sue York, 55\n'Other times because I would start to feel extremely sick I would vomit.\n'It got to a point when I was beginning to seriously struggle to actually maintain doing two injections a day.\n'I did because you know your life depends on it, you have no option, you have to do it but it was becoming just horrendous.'\nSince the operation, she says she now feels 'incredible' and full of energy and doctors say her life expectancy has now doubled.\nShe has even had to get a new pair of glasses because her eyesight has improved.\nDiabetes also causes nerve damage and loss of sensation but Ms York said she had regained some feeling again since the operation.\nShe said: 'No longer am I struggling to walk up a flight of stairs, getting breathless walking into the wind. No longer is my skin yellow or grey.\n'No longer do I look constantly exhausted.\nMs York had to wait more than two years to be given the go-ahead to be placed on the transplant list. She was found a match within three weeks and underwent a successful transplant in Manchester\nMs York shows off her scar - and belly button piercing which she's had for 20 years. Today, she argued: 'The piercing felt completely different when it was put in. Needles are far more intrusive'\nShe first applied for a pancreas transplant in 2012, after the DVLA changed its rules insisting diabetic drivers checked blood glucose levels by way of a finger prick test before getting behind the wheel.\nTerrified by the prospect of more injections, she thought it was easier to give up driving.\nTHE ROLE OF THE PANCREAS IN TYPE 1 DIABETES Type 1 diabetes causes a person's blood sugar, or glucose, level to become too high because the pancreas doesn't produce any insulin. Everyone diagnosed with type 1 is treated with insulin. Insulin allows glucose to enter the tissues and be used as energy so people with type 1 diabetes must inject it. Scientists don't know why the insulin-producing cells are destroyed in people with the condition. It is thought to be caused by an abnormal, autoimmune, reaction to the cells, which could be triggered by a virus or other infection. Experts believe there is a genetic element to type 1 diabetes. It is more common in some parts of the world than others. Unlike type 2, type 1 diabetes has nothing to do with lifestyle or weight. The condition can develop at any age, but is usually diagnosed before the age of 40, most commonly in late childhood. Around 10 per cent of the 2.9 million people diagnosed with diabetes in the UK have type 1. Source: NHS Choices/Diabetes UK\nShe said: 'It was just too many needles, too many invasions into the flesh, I couldn't bear to do it so I gave up driving.\n'If I got into an accident and was unable to take a finger prick test I may have been committing a crime. I didn't want that kind of pressure.\n'I became virtually housebound because I was too weak to walk long distances. I was trapped and desperate.\n'I tried hypnotherapy to cure my phobia but it never worked.'\nShe asked her doctor for help and was referred to a diabetes expert at Manchester Royal Infirmary.\nIt took two-and-a-half years, and three transplant panel meetings, before she was finally accepted onto the transplant list.\nBut after just 21 days, the life-changing call came to say a suitable donor had been found.\n'I don't know who my donor is, but I thank them and their family from the bottom of my heart.\n'The doctors said it was an excellent donor and I was an excellent match.\n'For me, my phobia had a physical effect on me and I was just as in need of a transplant as someone with kidney problems.'\nMs York now faces blood tests every three months and undertakes a weekly finger prick test to make sure the pancreas is still working.\nSurgeon Dr Raman Dhanda, from Manchester Royal Infirmary, said guidelines were currently in place nationally and internationally to ensure those with the greatest need received transplants.","url":"https://www.dailymail.co.uk/health/article-3421452/Diabetic-woman-world-pancreas-transplant-needle-phobia-managed-belly-button-pierced.html"}
