{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-23 01:00:59","date_modify":"2018-10-23 01:00:59","date_publish":"2016-01-11 11:23:08","description":"Researchers at Curtin University in Perth, reviewed 14 studies involving more than 2.3 million people. Diabetics could cut their chances of dementia with a healthier lifestyle, it found.","filename":"data/vaneerConsumption/Diabetesraisestheriskofgettingdementiaby60.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007BF9100000578-0-image-a-6_1452511314321.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3393744_Diabetes-raises-risk-getting-dementia-60_1540256459.html","title":"Diabetes raises the risk of getting dementia by 60%","title_page":"Diabetes raises the risk of getting dementia by 60% | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Patients with type 2 diabetes are 60 per cent more likely to develop dementia, a study has claimed.\nWomen with diabetes were more likely to get vascular dementia - caused by reduced blood supply to the brain because of damage to blood vessels - than men, researchers found.\nIt occurs following a stroke or when the blood vessels supplying the brain become furred up or blocked.\nWomen who are diabetic are significantly more likely than men to develop vascular diabetes, a study found\nThe most common cause of dementia is Alzheimer's disease, which is non-vascular, the study by Curtin University in Perth, Australia.\nStudy author Rachel Huxley said diabetics can cut their chances of dementia by giving up smoking and drinking, exercising more and eating healthily.\nResearchers reviewed 14 studies involving more than 2.3 million people, including more than 100,000 dementia patients, and reported their findings in Diabetes Care.\n'In Alzheimer's disease, nerve cells throughout the brain die off, and abnormal proteins accumulate in the brain for reasons not entirely known,' said Ms Huxley.\n'Vascular dementia, in contrast, is the result of impaired blood flow to the brain, usually by a series of small, imperceptible strokes.'\nDiabetes in women seems to lead to more risk for other conditions as well.\n'These findings add to the evidence that diabetes confers a greater vascular hazard in women compared with men,' she said.\nIn Alzheimer's disease, nerve cells throughout the brain die off, and abnormal proteins accumulate in the brain (pictured). People with diabetes are 60 per cent more likely to develop dementia, the study found\n'Diabetes confers a greater risk of developing heart disease, stroke and now vascular dementia in women compared with men.'\nOverall, people with diabetes were 60 percent more likely to develop any dementia than people without diabetes.\nWomen with diabetes were more than twice as likely as those without it to develop vascular dementia, compared to a smaller increase in risk for men with diabetes.\nMore research is needed to look into how sugar in the blood interacts with the blood vessels and whether that process is different in women in men, she said.\nWomen tend to be under-treated for vascular risks relative to men, the study found.","url":"https://www.dailymail.co.uk/health/article-3393744/Diabetes-raises-risk-getting-dementia-60.html"}
