{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 22:46:45","date_modify":"2018-10-22 22:46:45","date_publish":"2016-01-11 03:45:24","description":"Diane Keaton was welcomed to the 70 club last week by longtime friends Bette Midler and Goldie Hawn.","filename":"data/vaneerConsumption/DianeKeatonreuniteswithBetteMidlerandGoldieHawnbeforeNetflixcomedy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/30021B9900000578-0-image-a-29_1452478925654.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393259_First-Wives-Club-reunion-Diane-Keaton-celebrates-70th-birthday-Bette-Midler-Goldie-Hawn-new-Netflix-comedy_1540248405.html","title":"Diane Keaton reunites with Bette Midler and Goldie Hawn before Netflix comedy","title_page":"Diane Keaton reunites with Bette Midler and Goldie Hawn before Netflix comedy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Diane Keaton was welcomed to the 70 club last week by longtime friends Bette Midler and Goldie Hawn.\nBette and Goldie met up with Diane for a lunch celebrating her birthday on Tuesday ahead of them reuniting in a new Netflix movie.\nThe three blondes certainly looked to be having fun as they all sported huge smiles while cosying up next to each other at a restaurant.\nScroll down for video\nBirthday party: Diane Keaton is shown celebrating her 70th birthday last week during lunch with Bette Midler and Goldie Hawn\nThe trio starred together in the 1996 comedy The First Wives Club and will reunite for the upcoming Netflix comedy Divanation.\nDiane was the last of the trio to turn aged 70 after Goldie hit the milestone on November 21 and Bette on December 1.\nOscar-winners Goldie and Diane and multiple Grammy winner Bette scored a huge unexpected hit with The First Wives Club that earned more than $180million worldwide on a budget of just $30million.\nSee Netflix news as Diane Keaton, Bette Midler and Goldie Hawn star in a new movie\nBusy star: The Oscar-winning actress, shown in November in Los Angeles, will reunite with Goldie and Bette in an upcoming Netflix movie\nThe film based on the best-selling 1992 novel of the same name followed three divorced school friends who reunite to exact revenge after their husbands leave them for younger women.\nThe Netflix movie Divanation will bring them back together as members of a formerly popular singing group forced to reunite after a nasty split and 30-year estrangement, according to a report by Deadline.\nThe diva trio find their reunion both tense and cathartic as they realize what made them successful.\nReady to reunite: Goldie, shown in November in New York City, and Bette, shown last month in the Big Apple, will reunite with Diane in Divanation about a former singing group reforming\nThe Divanation script was written by Lisa Addario and Joey Syracuse and will be produced by Mythology Entertainment.\nA new draft was pending and a director has yet to be chosen.\nNetflix has been moving aggressively into original feature films and previously has released the critically-acclaimed drama Beasts Of No Nation and the Adam Sandler comedy The Ridiculous Six.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393259/First-Wives-Club-reunion-Diane-Keaton-celebrates-70th-birthday-Bette-Midler-Goldie-Hawn-new-Netflix-comedy.html"}
