{"authors":["Associated Press"],"date_download":"2018-10-23 04:08:55","date_modify":"2018-10-23 04:08:55","date_publish":"2016-01-28 19:58:57","description":"VATICAN CITY (AP) — Actor Leonardo DiCaprio brushed up his Italian to greet Pope Francis at the Vatican Thursday, discussed their shared concern over the env...","filename":"data/vaneerConsumption/DiCapriogreetspopeinItaliandiscussesenvironment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:5395db4dfa594c8fb4da655550d665f3-4PuZeKVXE7cd9005b2c8760f274a-361_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421373_DiCaprio-greets-pope-Italian-discusses-environment_1540267735.html","title":"DiCaprio greets pope in Italian, discusses environment","title_page":"DiCaprio greets pope in Italian, discusses environment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DiCaprio greets pope in Italian, discusses environment\nVATICAN CITY (AP) — Actor Leonardo DiCaprio brushed up his Italian to greet Pope Francis at the Vatican Thursday, discussed their shared concern over the environment and gave the pontiff a check for his charitable works.\n\"Your Holiness, thank you for granting me this private audience with you,\" DiCaprio said in Italian as he arrived in the Apostolic Palace and kissed the pope's ring.\nLater, in English, DiCaprio offered Francis a book of works by the 15th-century Dutch painter Hieronymus Bosch, and showed him the reproduction of Bosch's \"Garden of Earthly Delights\" that had hung over his crib as a child. The triptych, which DiCaprio has referred to in the past, depicts Adam and Eve in the first panel, a teeming landscape in the center panel, and finally a vision of hell.\nPope Francis meets with actor Leonardo Di Caprio during a private audience in the pontiff's private studio, at the Vatican, Thursday, Jan. 28, 2016. (L'Osservatore Romano/Pool Photo via AP)\n\"As a child I didn't quite understand what it all meant, but through my child's eyes it represented a planet, the utopia we had been given, the overpopulation, excesses, and the third panel we see a blackened sky that represents so much to me of what's going in in the environment,\" DiCaprio told the pope.\nDiCaprio said he thought the painting also represented Francis' environmental concerns.\nFrancis' encyclical Laudato Si (Praise Be) has been embraced by environmentalists for its denunciation of the world's fossil fuel-based economy and its demand for greener energy sources.\nAn assistant then handed Francis an envelope and explained it was a check for the pope to use for charity works \"close to your heart.\"\nDi Caprio, nominated for an Oscar for his role in \"The Revenant,\" is a longtime environmental campaigner who in 1998 launched his Leonardo DiCaprio Foundation to support initiatives aimed at sustainability.\nHe recently addressed the World Economic Forum in Davos, Switzerland, announcing the foundation was donating another $15 million to environmental projects and pleading with business leaders to battle global warming.\nFrancis gave DiCaprio a leather-bound copy of Laudato Si and his earlier document, The Joy of the Gospel.\nDiCaprio was accompanied by his father, George DiCaprio, and Milutin Gatsby, global fundraising chair for the foundation.\n___\nThis story has been corrected to show that the check was from DiCaprio personally, not from his foundation.\n___\nFollow Nicole Winfield at www.twitter.com/nwinfield\nPope Francis browses through the book of paintings by Hieronymus Bosch he was presented by actor Leonardo Di Caprio, left, during a private audience in the pontiff's studio, at the Vatican, Thursday, Jan. 28, 2016. (L'Osservatore Romano/Pool Photo via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3421373/DiCaprio-greets-pope-Italian-discusses-environment.html"}
