{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 04:57:12","date_modify":"2018-10-23 04:57:12","date_publish":"2017-03-16 16:00:37","description":"Blonde bombshell Roxy Horner was looking simply sensational as she filmed a commercial for Eddy K in Milan, Italy on Thursday.","filename":"data/vaneerConsumption/DiCapriosexRoxyHornerfilmsacommercialinItaly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E553DD700000578-0-image-a-229_1489680028820.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320838_Leo-s-ex-Roxy-Horner-beautiful-bridal-couture_1540270632.html","title":"DiCaprio's ex Roxy Horner films a commercial in Italy","title_page":"DiCaprio's ex Roxy Horner films a commercial in Italy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been linked to a host of famous men in the past, and has been linked to Hollywood heavyweight Leonardo DiCaprio.\nAnd blonde bombshell Roxy Horner was looking simply sensational as she filmed a commercial for Eddy K in Milan, Italy on Thursday.\nRoxy, who is currently dating indie singer Jake Bugg, looked every inch the blushing bride in the elegant attire, turning heads as she walked down the street.\nScroll down for video\nBlonde bombshell: Roxy Horner was looking simply sensational as she filmed a commercial for Eddy K in Milan, Italy on Thursday\nBridal shoot: Roxy, who is currently dating indie singer Jake Bugg, looked every inch the blushing bride in the elegant attire, turning heads as she walked down the street\nThe striking star's couture number boasted a beautiful, layered tulle skirt an intricate lace bodice.\nThe plunging number highlighted the 25-year-old beauty's svelte figure while teasing a glimpse of her cleavage.\nBut it was her choice of footwear which really caught the eye, sporting a comfy pair of white trainers under the flowing gown.\nCentre of attention: The model caught the eye of onlookers as she posed for pictures\nStunning: The striking star's couture number boasted a beautiful, layered tulle skirt an intricate lace bodice\nSports chic: But it was her choice of footwear which really caught the eye, sporting a comfy pair of white trainers under the flowing gown\nLooking good: The plunging number highlighted the 25-year-old beauty's svelte figure while teasing a glimpse of her cleavage\nRoxy styled her blonde locks in beachy waves, and framed her face with a pair of hoop earrings.\nThe starlet - who famously dated Joey Essex - was linked to Hollywood hotshot Leonardo last year and the pair reportedly spent plenty of time together, despite the long distance.\nAccording to The Sun, the movie star, 41, regularly flew across the world to spend time with the model, who hails from Essex herself.\nHigh profile love interest: The starlet was linked to Hollywood hotshot Leonardo last year and the pair reportedly spent plenty of time together, despite the long distance\nEssex girl: The British beauty hails from Essex and famously dated TOWIE's Joey Essex\nStriking: Roxy styled her blonde locks in beachy waves, and framed her face with a pair of hoop earrings\nThey previously went dancing at Tape nightclub, before heading to trendy London haunt, the Chiltern Firehouse.\nShe has since moved on with indie singer Jake Bugg, making their first public outing as a couple during London Fashion Week Men's Collection earlier this year.\nRoxy and Jake, 22, first confirmed news of their relationship on Snapchat last December when she posted a picture of the pair on a romantic evening together.\nSmitten: She has since moved on with indie singer Jake Bugg, making their first public outing as a couple during London Fashion Week Men's Collection earlier this year\nHappy couple: Roxy and Jake, 22, first confirmed news of their relationship on Snapchat last December when she posted a picture of the pair on a romantic evening together","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320838/Leo-s-ex-Roxy-Horner-beautiful-bridal-couture.html"}
