{"authors":[],"date_download":"2018-10-30 01:13:12","date_modify":"2018-10-30 01:13:12","date_publish":"2016-09-27 00:14:45","description":null,"filename":"data/vaneerConsumption/DidBarackObamaVoteCommunistin1980.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/09/5589915429_4ab2b4008e_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861992.html","title":"Did Barack Obama Vote Communist in 1980?","title_page":"Did Barack Obama Vote Communist in 1980?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"A fascinating tidbit was reported by CNN: Barack Obama’s CIA director, John Brennan, recently reminisced about being asked a standard question for a security clearance in his early days applying to the agency: Had he ever worked with or for a group that was dedicated to overthrowing the United States of America? Of course, one group dedicated to overthrowing America had been Lenin’s group, Stalin’s group, Khrushchev’s group, Brezhnev’s group — Communist Party USA.\nYeah, but that couldn’t have any relevance here, right?\nThink again. Brennan certainly did. He thought soberly.\n“I froze,” Brennan recalled, as he shared the moment at the annual conference of the Congressional Black Caucus Foundation. “This was back in 1980, and I thought back to a previous election where I voted, and I voted for the Communist Party candidate.”\nReally? That must have raised an eyebrow even among the Congressional Black Caucus, some members of which are to the left of Gus Hall, Communist Party USA’s longtime general secretary.\nRemember ol’ Gus? Sure. He ran for president on the Communist Party ticket in the 1970s and 1980s, along with his delightful veep, angry Angela Davis — who, incidentally, is no stranger to the Congressional Black Caucus Foundation.\nSpeaking of comrade Gus, Obama’s CIA director continued in precisely that direction:\n“I froze, because I was getting so close to coming into CIA and said, ‘OK, here’s the choice, John. You can deny that, and the machine [lie detector] is probably going to go, you know, wacko, or I can acknowledge it and see what happens.” Thus, John Brennan told his questioner (and the lie-detector machine): “I said I was neither Democratic or Republican, but it was my way, as I was going to college, of signaling my unhappiness with the system, and the need for change. I said I’m not a member of the Communist Party, so the polygrapher looked at me and said, ‘OK,’ and when I was finished with the polygraph and I left and said, ‘Well, I’m screwed.’”\nApparently, Brennan passed. He soon got his acceptance notice from the CIA.\nSaid Brennan: “So if back in 1980, John Brennan was allowed to say, ‘I voted for the Communist Party with Gus Hall’ … and still got through, rest assured that your rights and your expressions and your freedom of speech as Americans is something that’s not going to be disqualifying of you as you pursue a career in government.”\nHence, there you go: John Brennan voted for Gus Hall. Our CIA director — Obama’s CIA director — voted for Gus Hall, presumably in 1976 or 1980 or both (he was first eligible to vote in ’76).\nWorse, he also seemed to say (it isn’t entirely clear) that he was actually a member of the Communist Party, which would be especially remarkable. Voting for the Communist Party was bad enough, to be a formal member would have been far worse.\nBut let’s stick to what we clearly know: Barack Obama’s CIA director clearly stated that he voted for Gus Hall for president of the United States of America. He voted for the Communist Party.\nMany of those to whom I forwarded this stunner reacted with shock, understandably, but it really shouldn’t be a surprise. Yes, of course, it’s a mindblower that we have a CIA director who was apparently once a communist or voted communist — no doubt prompting Bill Casey and Allen Dulles to flip in their graves. But then again, this is, after all, Barack Obama’s CIA director. Thus, we should hardly be amazed.\nRemember Obama’s communications director, Anita Dunn? She cited as inspirations her “two favorite political philosophers,” Mother Teresa and, naturally, Mao Tse-tung.\nNow there, in Ms. Dunn, was a revolutionary thinker. Obama sure knows how to pick ‘em.\nAnd then there are the surreal ideological ancestries of Obama’s right-hand woman, Valerie Jarrett, and the man who elected him president, David Axelrod, which I have written about at great length many times here at The American Spectator. The literal communist relations in the upbringings of Jarrett and Axelrod, and how they circled to Obama’s mentor in the 1970s, Frank Marshall Davis (Communist Party USA no. 47544), are too incredible to try to make up.\nSo, nope, it doesn’t surprise me that Obama’s CIA director would have voted for Gus Hall and the Communist Party ticket.\nBut that got me thinking. The 1980 election would have been the first for which 19-year-old Barack Obama was eligible to cast a vote. I wonder: Who did Obama vote for in 1980? I ask because the young Obama, who visited with Frank Marshall Davis for a parting goodbye just before he left Hawaii for Occidental College in 1979 (we know that because Obama wrote about it in Dreams from My Father), was beyond question at least pro-communist at that point in his ideological pilgrimage.\nThe best insight into Obama’s political thinking at that time is Dr. John Drew, who knew Obama at Occidental precisely then. Drew headed the campus Marxist organization, and Obama was introduced to him (by Drew’s girlfriend) as a fellow communist. I’ve interviewed Drew numerous times going back to 2007-8. I quote him at length in my book on Frank Marshall Davis, The Communist. Drew told me on-the-record about the moment he first met Obama, who was introduced to him as “one of us.”\n“Obama was already an ardent Marxist when I met in the fall of 1980,” said Drew. “I know it’s incendiary to say this, but Obama was basically a Marxist-Leninist.” He underscored how Obama, in Dreams from My Father, candidly recalled attending “socialist conferences” and how he “hung out” with Marxist professors, but what Obama did not explain, noted Drew, is that he “was in 100 percent, total agreement with these Marxist professors.”\nThus, when I read last week that Obama’s CIA director had voted communist back in the day, I emailed John Drew, asking if he knew whether Obama himself had voted communist in 1980.\n“I wish I knew,” Drew told me. “I hope someday you get to ask him and all this gets cleared up for future generations. For what it is worth, I voted for Carter.”\nI, too, wish I knew. But I know who does know: Barack Obama knows. I would also think that one of his biographers might know. Maybe David Remnick? David Maraniss? Who else?\nIt would be easy enough for a reporter or biographer to innocently ask, “Mr. President, for whom was your first presidential vote?”\nThat’s really a friendly enough inquiry. Standard fare. It’s a question that’s asked all the time to presidents, happily, almost playfully. Ronald Reagan told us proudly that he voted for FDR, long before he split with the party of FDR. The current Democratic Party standard-bearer, Hillary Clinton, campaigned for Barry Goldwater in 1964. She has talked openly about that many times. Her husband campaigned for John F. Kennedy.\nSo, what about Obama? Who did he vote for 1980? Could some reporter ask? Or are Obama’s media fawners and journalistic gushers afraid of the possible answer?\nDon’t hold your breath, dear comrade.","url":"https://spectator.org/did-barack-obama-vote-communist-in-1980/"}
