{"authors":["Jody Phan For Daily Mail Australia"],"date_download":"2018-10-22 22:38:56","date_modify":"2018-10-22 22:38:56","date_publish":"2017-03-10 01:09:41","description":"He's the model who previously revealed he was once overweight. And Didier Cohen proudly showed off his chiselled abs and bulging biceps as he snapped a selfie during a home workout on Friday.","filename":"data/vaneerConsumption/DidierCohentoplessonInstagramafterworkout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EF65300000578-0-image-a-66_1489107212376.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299484_Didier-Cohen-shows-rippling-muscles_1540247936.html","title":"Didier Cohen topless on Instagram after workout","title_page":"Didier Cohen topless on Instagram after workout | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the model who previously revealed he was once overweight.\nAnd Didier Cohen proudly showed off his chiselled abs and bulging biceps as he snapped a selfie during a home workout on Friday.\nThe 31-year-old's latest display of fitness is a stark contrast to a photo he previously shared from his teens.\nScroll down for video\n'Make do with what ya got': Male model and DJ Didier Cohen showed off his ripped torso during a workout in LA on Friday\n'Make do with what ya got.. LA garage workouts.... [sic]' the former Australia's Next Top Model mentor captioned the snap.\nThe US-born hunk stood sideways as he posed for the selfie, while sporting a pair of workout tights and his hair in a half-ponytail.\nShowing off his many tattoos as well as ripped torso, the male model stood inside what appears to be a storage area in his home.\nMy, how you've changed! The 31-year-old's current aesthetic is dramatically different to the one he portrayed at age 12, as shown in a throwback snap shared on Instagram last year\nThe male model's current aesthetic is dramatically different to the one he had in high school.\nFans were shocked when Didier shared a snap of himself attending his high school formal.\n'Big boy at prom with,' he captioned the photo, which featured his sweetheart at the time, a girl named Krystle.\nWhat a transformation! The US-born model previously admitted he was 'really overweight' and 'embarrassed' to take off his shirt when he was younger (pictured in 2011 on the left and in high school on right right)\nTalking about the Instagram image, which does not resemble his current self in the slightest, the now tattooed stud confessed he was embarrassed by his larger physique.\n'I was really overweight, and I was just embarrassed sometimes to take off my shirt at the beach,' he told TheFix.\nThe hunk said he was 19 when he finally decided to transform his physical shape.\n'I started running': The former Australia's Next Top Model star revealed he began exercising and eating well at age 19 in order to transform his body\n'I started running, doing a little bit of cardio, looking at what I was eating, not being super strict but just knowing what was healthier,' he told the publication.\nAnother image shared last August showed the hunk sporting a different haircut and much fuller face while posing for a school portrait.\nThe snap was later confirmed to be taken in 1997, when Didier was aged 12.\nChange of lifestyle: The star admitted he wasn't 'super strict' with his diet, but was able to find healthier options as well as involving 'cardio'\nHaving lived in Australia for many years, Didier has carved a successful modelling and music career, and was signed to Sony Music in 2015.\nLast February, the hunk announced his engagement to long-term girlfriend Jade Cara.\nHe revealed on Twitter: 'I get to spend the rest of my life with my best friend and soul mate.'\nEngaged! Didier announced his engagement to long-term girlfriend Jade Cara last year, calling her his 'best friend and soul mate'\nJade also wrote on Instagram: 'I said yes, to being your wife and your soul mate for the rest of our lives.'\n'Thank you for standing by my side in this crazy world, I love you and I can't wait to marry you.'\nDidier confirmed he gave his fiancée a three-carat diamond ring he designed with Melbourne-based jeweller Sasha Blackwood.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299484/Didier-Cohen-shows-rippling-muscles.html"}
