{"authors":["Elizabeth Jensen","Michael Oreskes","Jarl Mohn"],"date_download":"2018-10-23 05:17:46","date_modify":"2018-10-23 05:17:46","date_publish":"2016-05-27 00:00:00","description":"We found no \"pay for play\" but the disclosure process broke down.","filename":"data/vaneerConsumption/DidPloughsharesGrantSkewNPRsIranDealCoverage.json","image_url":"https://media.npr.org/assets/img/2016/05/26/potus_stills_20150806_004_wide-b115c559d194996c10f2cbcd7738810243e9d34a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ombudsman_2016_05_27_479588582_did-ploughshares-grant-skew-nprs-iran-deal-coverage_1540271866.html","title":"Did Ploughshares Grant Skew NPR's Iran Deal Coverage?","title_page":"Did Ploughshares Grant Skew NPR's Iran Deal Coverage? : NPR Ombudsman : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Did Ploughshares Grant Skew NPR's Iran Deal Coverage?\nEnlarge this image toggle caption Kainaz Amaria/NPR Kainaz Amaria/NPR\nSometimes journalists face a conflict of interest in their reporting. Other times it is the perception of a conflict, which can be just as problematic. NPR has a perceived conflict — and, because its disclosure processes broke down, in some ways a real conflict — in the case of one grant it received to fund coverage of a hot-button topic. The fiscal year 2015 grant, from the Ploughshares Fund, supported \"national security reporting that emphasizes the themes of U.S. nuclear weapons policy and budgets, Iran's nuclear program, international nuclear security topics and U.S. policy toward nuclear security.\"\nThe backstory was laid out late last week in a report from the Associated Press. As the story said: \"A group the White House recently identified as a key surrogate in selling the Iran nuclear deal gave National Public Radio $100,000 last year to help it report on the pact and related issues, according to the group's annual report.\" That group, the Ploughshares Fund, is a longtime advocacy group promoting nuclear arms control and the abolition of nuclear weapons.\nTo summarize a few key details: A controversial May 5 New York Times Magazine story profiled Ben Rhodes, President Obama's deputy national security adviser. Part of that profile centered on how Rhodes and his team sold the Iran nuclear deal to the public and included this quote from Rhodes: \"We had test drives to know who was going to be able to carry our message effectively, and how to use outside groups like Ploughshares, the Iran Project and whomever else. So we knew the tactics that worked.\"\nThe Times piece also included this passage: \"As [White House Middle East policy advisor Rob] Malley and representatives of the State Department, including Wendy Sherman and Secretary of State John Kerry, engaged in formal negotiations with the Iranians, to ratify details of a framework that had already been agreed upon, Rhodes's war room did its work on Capitol Hill and with reporters. In the spring of last year, legions of arms-control experts began popping up at think tanks and on social media, and then became key sources for hundreds of often-clueless reporters. 'We created an echo chamber,' he admitted, when I asked him to explain the onslaught of freshly minted experts cheerleading for the deal. 'They were saying things that validated what we had given them to say.'\"\nPloughshares Fund first gave NPR a grant in 1984, and then started funding it regularly in 2005, NPR spokeswoman Isabel Lara said. The Ploughshares annual reports show no grant for fiscal year 2005 and a total of $700,000 in grants from FY2006, when NPR received $50,000, to the present. There were no grants in FY2007 or FY2014, either. (Troublingly, the NPR annual reports do not disclose the 2006 grant or a 2010 grant of $150,000. All grants since 2011 have been acknowledged in the annual report.)\nNPR, as it told the AP, has a strict firewall in place between those who give it money to do its journalism work and the newsroom; i.e., no funder influences the content of NPR's reporting, it contends. The process starts with NPR, where the newsroom decides what it wants to cover and the development side of the organization seeks financial support for that, not the other way around. The vast majority of the time (if not all of it), that works just as it is supposed to. NPR gets money from, and partners with, a large number of outside foundations in support of its reporting, all without raising any red flags in my mind. Nor have I yet to see any evidence that corporate sponsors have influenced NPR's coverage, despite many listeners' concerns about that.\nBut this case is a bit different from, say, the money that NPR gets from the MacArthur Foundation in general operating support for investigative and international reporting or even the money it gets from the Gates Foundation to support the education blog and Goats and Soda global health blog. In this case, NPR's money came from one side of a very partisan debate on a specific issue to fund reporting on a specific topic. And the money was not from a sponsor who in exchange would get on-air credit; in this case the sponsor money was going directly to support the reporting.\nWhat critics are legitimately asking is whether there was a break in the firewall, since there is certainly an appearance that NPR opened itself up to be used as a propaganda organ of the administration via its reporting grant from Ploughshares. As one listener letter I received put it: \"I am very disappointed in the decision by NPR to take $100,000 from the Ploughshares Fund, in order to sculpt the news cycle surrounding the Iran deal.\"\nOur largest mission is to make sure our audience has as much information as we can possibly give them on what is an important policy and civic decision.\nTo start, I'll be very clear. That did not happen: NPR did not accept money to report favorably on the Iran deal. There was no pay for play. Furthermore, NPR assigned seasoned correspondents to cover the deal, not the \"often-clueless reporters,\" to which Rhodes referred. Were they taking orders from a funder (and would they even consider doing that)? Of course not. NPR practices strictly forbid that and I have no evidence that it happened in this case or any other case.\nTherefore, I do not believe the firewall was breached. But what about the perception that was the case? That was inevitable, partly because of some breakdowns in newsroom processes that are designed precisely to make sure NPR is transparent about potential conflicts of interest.\nAs part of our assessment of what happened, my office looked at the 254 on-air newsmagazine stories from Jan. 1, 2015, to the present that we categorized as directly related to the Iran deal. We started there because according to the annual reports of both NPR and Ploughshares, NPR did not receive a grant in 2014. (Lara said that was simply a timing issue of when the grant was awarded; but in any case, there was no 2014 grant.) NPR has also received a Ploughshares Fund grant for FY2016 that began Oct. 1, 2015, Jarl Mohn, NPR's chief executive, told me.\nOf those 254 stories, we categorized 118 as neutral; they were mostly NPR reporters talking to NPR hosts about developments in the lead-up to the deal or its implementation earlier this year. The remaining 136 stories presented a viewpoint of a source either for or against the deal. Of those voices in those stories, 160 people were quoted speaking in favor of the deal and 102 were against it.\nThere are other ways of looking at the coverage, of course. In order to post this in a timely manner, we did not count the seconds and minutes devoted to those sources; it is possible they balanced out. We did look at the attention allotted to the major players in the battle and found that the highest-profile interviews were very balanced. NPR talked twice to Obama about the deal and twice to one of its chief opponents, Israeli Prime Minister Benjamin Netanyahu.\nIn addition, we found that congressional voices opposed to the deal were more than fairly represented, and in fact, a large chunk of the voices opposed to the deal came from Congress. That is important because Republican Rep. Mike Pompeo of Kansas, a member of the House Intelligence Committee, told The Associated Press that he had tried to get NPR to interview him and was turned down, and critics of NPR have cited that as evidence that NPR was hostile to voices opposed to the deal, thanks to the Ploughshares grant.\nNPR confirms the congressman was booked for an August interview and then that interview was canceled, because there were too many other interviews scheduled. But that does not mean NPR was featuring only voices in favor of the deal. Days after the Pompeo interview was canceled, NPR interviewed Sen. Charles Schumer, a top Democrat from New York and one of the most vocal and respected Jewish members of Congress, who had just decided to oppose the deal. That was by far the more important story, since the vast majority of Democrats supported the president in voting for the deal.\nOverall, these are the congressional voices opposed to the deal who were heard on NPR air, in either sound bites or interviews:\nSen. Charles Schumer (D-N.Y.), Rep. Steve Israel (D-N.Y.), Sen. Marco Rubio (R-Fla.), Sen. Lindsey Graham (R-S.C.), Sen. Bob Corker (R-Tenn.), Sen. John McCain (R-Ariz.), Sen. Tom Cotton (R-Ark.), Sen. Ron Johnson (R-Wis.), Sen. Rand Paul (R-Ky.), Sen. Bob Menendez (D-N.J.), Sen. Kelly Ayotte (R-N.H.), Sen. Mitch McConnell (R-Ky.), Rep. John Boehner (R-Ohio), Sen. Jim Risch (R-Idaho), Ben Cardin (both when he supported the deal, and after he switched sides) (D-Md.), Sen. Ted Cruz (R-Texas), Rep. Pete Sessions (R-Texas), Rep. Peter Roskam (R-Ill.), Rep. David Brat (R-Va.), Rep. Mimi Walters (R-Calif.), and Rep. Ed Royce (R-Calif.).\nI asked Michael Oreskes, NPR's senior vice president of news and editorial director, about the numbers and the coverage. (He started the job in April 2015, so some of the coverage happened before he arrived.) \"I think it's good to do these kinds of analyses,\" he said, but added, \"There's a lot more that makes for a fair and accurate piece than just numbers.\"\nHe argued — and our analysis confirmed — that a good deal of NPR's coverage was purely explanatory. \"Our largest mission is to make sure our audience has as much information as we can possibly give them on what is an important policy and civic decision,\" he said. \"The core mission is to get across the full range of ways to think about the subject.\" He contends that listeners understood the issue better at the end of NPR's coverage than at the beginning, and I would agree. And he makes one more point with which I agree, as well: NPR's coverage was designed to \"get beyond he said/she said and figure out what's really true here,\" and an analysis of just pro and con voices will not get at that full understanding.\nStill, I was surprised as to the number of positive voices I found, but I take the newsroom's point. Where I found more cause for concern — and where both Oreskes and Mohn agree that there was a breakdown, at least in internal processes and disclosure — is in the large number of Ploughshares-funded analysts and experts who made it on the air to talk up the deal, without any acknowledgment of that by NPR.\nThe coalition that Ploughshares assembled to push the deal was astonishing, and it would likely have been almost impossible to cover the story without talking to those sources.\nPloughshares itself laid out their names in a recent post titled \"How We Won\" on its website. A video there includes a list of nearly 70 organizations under the segment \"Special Thanks To.\" Some of those names are of groups which receive grants from funded by Ploughshares; some give to Ploughshares itself. Many of them were quoted on NPR, without any acknowledgement of Ploughshares' involvement.\nTake this March 2015 story, \"Nuclear Experts Remain Optimistic About Iranian Negotiations,\" reporting on the Carnegie International Nuclear Policy Conference. The sponsor, Carnegie Corporation Endowment for International Peace, was part of the Ploughshares-led coalition and the organizations of two other people quoted in favor of the deal in the piece either received funding from Ploughshares to advocate for the deal or were working in that coalition. Joe Cirincione, the president of Ploughshares Fund, was also interviewed. NPR has already acknowledged that the piece should have included a disclosure of the funding agreement (and one has been added retroactively).\nHere's how NPR's internal processes are supposed to work: When reporters and producers book a guest, the guest should be asked to disclose whether he or she is funded in a way that might be a conflict NPR needs to know about. The senior supervisors for each reporting desk and each show are responsible for making sure that any conflicts are then properly disclosed.\nBecause that process broke down in the case of Ploughshares, Oreskes said, NPR is conducting a review of its safeguards. The newsroom is also looking into why the Cirincione interview in particular did not raise any red flags. Standards and practices editor Mark Memmott said it may have been the case that Ploughshares had been a supporter for so long that supervisors did not know, \"that institutional memory had been lost\" and needs to be refreshed.\n[Perception] is hugely important. We need to take steps to ensure that perception is protected.\nIt is important to note here that, as a general rule, reporters and their immediate supervisors usually are shielded from detailed information about funders, and that is precisely so that they do not feel any pressure to sway their reporting, Memmott said. I have uncovered no reason to believe anything different happened in this particular case. (One way of looking at it, Oreskes said, is that the firewall worked, if no one knew that Ploughshares was a funder of NPR's Iran reporting.)\nThere was a missing perspective that also concerned me. On Aug. 6, NPR reported on the millions of dollars being spent to lobby senators still on the fence, focusing on the two opposing pro-Israel lobbying groups, J Street and AIPAC. It was a strong story, but it did not go far enough. A similar story in the Times nine days later pulled back the curtain much further to note that Ploughshares, as well as J Street, was a key player in the lobbying effort for the deal (J Street got $576,500 in 2015 from Ploughshares, according to the Ploughshares annual report). It set the scene thusly: \"Meeting weekly in a conference room in the downtown Washington office of the Ploughshares Fund, a foundation devoted to eradicating nuclear weapons, the coalition strategizes and plans advertising, letters and petition drives to press its case. Ploughshares also finances many of the participants in the effort.\"\nOreskes said he \"regrets\" NPR did not do more reporting on the lobbying effort. \"I wish we'd reported that,\" he said of the scene inside the Ploughshares conference room. \"I don't know that anyone knew. I wish we'd stayed with it a little more.\"\nOne of my biggest concerns about all of this is the realization of how little I — as a proxy for the listener — know of these sorts of dedicated grant arrangements. The only way a listener can know is a) when they hear a disclosure attached to a particular story, b) when an organization such as the MacArthur Foundation issues a press release or c) by reading the annual reports of the funding organizations.\nNPR's own disclosure is minimal to the point of being unhelpful. Ploughshares, for example, is simply part of a list in the annual report titled \"2015 Supporters.\" There is no way for a listener or reader of the report to know whether those on the list made a contribution in exchange for an on-air funding credit or were, as in the case of Ploughshares, actually funding a dedicated portion of NPR's journalism.\nOne positive development to come out of this is that Mohn told me that he believes NPR should consider reverting to its earlier practice of listing grants separately from underwriters and individual donors in the annual report. I hope it will do so.\nWhere does this leave us? Mohn said he is satisfied that NPR in no way altered its reporting as a result of the funding, But, he added, \"The issues in my mind that are troubling are process questions, questions of disclosure on the air. Those are ones that I understand and agree with.\" Perception, he said, \"is hugely important. We need to take steps to ensure that perception is protected. But I don't want to gloss over what I think is the most important question. Did we do a story because we were told to do a story? The answer is absolutely not.\"\nI agree with that, but I would go a step further than shoring up disclosure. Finances are always tight at NPR and many of the foundation grants NPR receives fund areas such as award-winning investigative reporting and 17 international bureaus; that reporting would be more difficult without those funds, Mohn said. But in the case of grants such as the one from Ploughshares, which are intended to fund reporting on specific, highly controversial issues, my suggestion is that NPR consider not accepting them in the future if they contain such specific language.\nNo, the firewall was not breached in this case, but the damage that happened from perception is just too great a risk to NPR's reputation.\nDisclosure: I am paid by NPR but my office is independent of the newsroom. I report directly to Mohn.\nEditorial researcher Annie Johnson contributed to this report.","url":"https://www.npr.org/sections/ombudsman/2016/05/27/479588582/did-ploughshares-grant-skew-nprs-iran-deal-coverage"}
