{"authors":[],"date_download":"2018-10-30 01:17:21","date_modify":"2018-10-30 01:17:21","date_publish":"2018-08-16 00:05:35","description":null,"filename":"data/vaneerConsumption/DidTrumpReallySaveAmericaFromSocialism.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Barack_Obama_and_Raúl_Castro_at_the_Palace_of_the_Revolution_in_Havana_Cuba_03.21.16.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862241.html","title":"Did Trump Really Save America From Socialism?","title_page":"Did Trump Really Save America From Socialism?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"With the appearance of Death of a Nation, the must-see film by Dinesh D’Souza, a debate has begun as to the role Donald Trump plays in American history. D’Souza argues persuasively that Trump has saved America from socialism while the left and Never-Trumpers insist he has set America back. However, the events of the last few years seem strongly to support D’Souza’s view.\nAmericans need to understand that the shocking refusal by a major political party to accept the results of the last election and the onslaught of verbal, legal, and physical assaults the Democrats have engendered, are not specific to Donald Trump. In other words, it is now clear plans were made by Obama to exploit federal power during his presidency to give the Democrats control of our nation — perpetually. It really didn’t matter if Trump was the GOP nominee or not. In other words, the chaos we are witnessing today would not have been much different had, for example, Ted Cruz won the presidency.\nSure, the issues and the phony narratives would be different but the intensity of the attacks would be the same and the illegal politicizing of Federal agencies would probably still have occurred. There is little doubt the Dems would have created phony narratives customized for whoever the nominee was, similar to how they customized the Russian collusion hoax for Trump. This is what the establishment Republicans and the Never-Trumpers don’t understand. Long before Trump’s candidacy, total war was declared on the GOP when the Obama administration strategically created the conditions to make its progressive revolution a permanent one. Or so they thought.\nFirst, let’s dump the naivety. Obama has been fully in charge of both the pre- and post- election attacks on Trump. He is the leader of the resistance. The idea that his appointees at the FBI, DOJ, IRS, CIA, State Department, etc., would risk committing multiple felonies without direction from him or his henchman is simply not believable as many long-time political leaders and observers have stated.\nObama’s fingerprints can be found everywhere in the widening scandal. Text messages in September, 2016, between FBI agents/lovers Peter Strzok and Lisa Page reveal that Obama “wanted to know everything we’re doing” in the course of carrying out their make-believe investigation of Secretary of State Hillary Clinton for illegally using a private server and thus allowing “foreign actors” to access sensitive State Department info, according to two House committees and an internal FBI email.\nIndeed, under Obama, in late 2015, over 5,000 Americans had their civil rights violated by illegal FISA “702” search queries, using the NSA/FBI database by “contractors” politically connected to the Democrats. It is believed one such contractor was Fusion GPS, the Democrat firm involved with facilitating the Russian dossier containing false information about Trump. When NSA director Adm. Mike Rogers discovered this illegal activity in April, 2016, he terminated contractor access to the database.\nNot only is it highly likely the Obama White House knew that 5,000 Americans had their backgrounds searched illegally, but at this early point in the presidential campaign, it’s likely information was being sought on other GOP contenders, not just Trump.\nMore evidence of Obama’s involvement in all the corruption was the fact that he himself used a pseudonym to email Hillary on her private server. Then he later lied about it as confirmed by the IG report.\nAnother Strzok email to Page shows concern that some other staff member had stated “the White House is running this,” but Page assures him that “we got emails that say otherwise.”\nThat’s right; they were creating fake email trails to cover up Obama’s involvement. Even Obama’s Director of National Intelligence, James Clapper, admitted in a CNN interview that “It was he [Obama] who tasked us to do that intelligence community assessment in the first place,” explaining that it “set up a whole sequence of events which are still unfolding today, notably Special Counsel Mueller’s investigation.”\nMoreover, according to the DOJ Inspector General report, one of Obama’s top DOJ officials phoned FBI Deputy Director Andrew McCabe, pressuring him to drop the FBI investigation into the Clinton Foundation. There’s no way this official would do this without approval from Obama. Such revelations, are, as author Matthew Vadum puts it, “raising the specter of a sitting president becoming involved in a plot to rig the 2016 election.”\nHillary had to be exonerated in the private email scandal and an investigation of her pay-to-play foundation had to be avoided, because Obama could not afford to have her indicted in the midst of her presidential campaign. She was essential to continuing Obama’s plan to transform America and permanently keep the Republicans out of power. The Deep State is essentially the group of conspirators Obama assembled to (a) protect Hillary from being indicted, (b) smear the GOP nominee, and (c) ensure Hillary won the presidency.\nThis is why, aside from Obama, as many as 13 key Obama appointees communicated with Hillary using her private email account. And no, it was not for discussing their kid’s birthday parties. Such a complex abuse of the law requires confidential messaging hidden from the public and future investigators. It is why Hillary went to such extremes to “bleach bit” her email server and to destroy her smartphones using a hammer. Indeed, according to the FBI, she used as many as 13 electronic devices but the FBI was unable to locate most of them.\nEven the seven IRS employees involved with targeting conservative groups managed to destroy their emails by all claiming their computers had crashed. Right.\nObama’s goal was to weaponize his agencies so as to create the conditions to make it impossible for any Republican to win the presidency again. The circumstantial evidence over the last ten years strongly suggests that Obama was determined to make the 2016 election the last real free election, meaning one in which legal citizens elected the president. Based on his actions during his presidency, it is difficult to not conclude otherwise.\nIndeed, Obama even did an interview with actress Gina Rodriguez in which he made clear that illegal aliens who vote won’t be investigated by his administration because the voting records are not cross-checked against the immigration databases.\nThis is also why Obama ally and socialist billionaire George Soros funds a network of Obama-aligned groups to carry out much of the dirty work. For example, Soros funds a plethora of groups that promote open borders, attack ICE, and make it easier for illegals to avoid arrest.\nThese groups also fight all efforts to implement any kind of voter ID system that would make it difficult for illegals to vote. Indeed, the current DNC Chairman, Tom Perez, worked with “Casa De Maryland,” a Soros-funded group that successfully convinced the city of College Park to allow illegals to vote in local elections.\nBut Soros plays an even bigger role in the Obama-led resistance. The House Intelligence Committee reported that Soros and seven to ten other heavy hitters spent $50 million trying to convince people that the phony intel contained in the Dossier was authentic. Soros also funds Media Matters, a leftist group that works to convince social media companies to censor conservatives, a necessary tactic in order for Obama’s soft coup to be successful. And Google, Twitter, YouTube, Facebook appear to be dutifully following the left’s demands.\nThis is why evidence has surfaced showing that Obama’s DOJ worked with IRS officials to target Tea Party/conservative groups for the purpose of scaring them away from engaging in legal issue advocacy during the 2012 election. Indeed, the White House met 31 times during this time period with Nikole Flax, former Chief of Staff to IRS commissioner Steven Miller. Even the FBI assisted the IRS in this illegal activity, which would not have occurred without White House direction. Had this abuse not been exposed, the IRS would likely have continued its harassment all the way up until the last election. It was all about silencing the growing Tea Party moment in order to help Obama win his 2012 re-election. Basically, voter suppression.\nThis is also why the Obama White House hacked the computers of journalists to make sure they were toeing the party line. Just ask former CBS reporter Sharyl Attkisson.\nWe must also remember that Obama and his leftist allies have for years been quietly pushing for the registration of illegal aliens. Remember ACORN? That’s what they were all about, but after the headlines detailing ACORN’s shady voter registration practices died down, the Obama Administration created a federal project that did much of the same thing. Titled the White House Task Force on New Americans, it was headed by illegal alien advocate and former VP of the National Council for La Raza, Cecilia Munoz, and was created to introduce “immigrants and refugees… to both the rights and responsibilities, as well as benefits of citizenship.” And no, there’s little evidence its voter registration efforts distinguished between those here legally and those who were not.\nMunoz’s former group, the National Council of La Raza, received millions of dollars from Obama’s DOJ, money that Obama’s leftist lawyers shook down from bank settlements and used to create a shady “slush fund” which bypassed budgetary regulations and funded the open borders crowd.\nWe also now know, thanks to four different studies, that between 2.2 and 5.7 million illegal aliens have voted in the last few presidential elections.\nThe best guess is that at least three million illegal aliens voted in 2016, enough to give Hillary the popular vote but not quite enough to win some of the key rustbelt states won by Trump. This is why liberal state legislators all over the nation have pushed legislation granting illegals driver licenses. So far, 12 states have passed such laws.\nThe left knows full well that holding a driver’s license gives illegal aliens the confidence to also register to vote, not to mention many states have “motor voter” laws in which the DMV automatically registers to vote anyone granted a driver’s license. In California alone, the DMV has reported that one million “undocumented” immigrants have received driver licenses over the last three years. Unless they refused to register to vote, those non-citizens can now vote. Remember, in California, as in most states today, no one asks for proof of citizenship in order to register to vote.\nThe illegal alien vote is the Democrats secret voting bloc and it’s growing. This is why Obama’s Attorney General, Eric Holder, threw the full weight of the DOJ at every state that even thought about implementing a voter ID program of any kind.\nIt is not an accident that we are the only major country in the world that allows people to register and to vote without having to show any ID whatsoever. Clearly, the Obama administration took great pains to ensure that illegal aliens would not encounter any problems registering or voting. But we should not forget about the effort to also register felons. It is not a coincidence that during the Obama years, liberal legislators in a number of states were suddenly granting voting rights to felons.\nThen, of course, there was the effort to suppress the military vote. Hundreds of thousands of military votes were not counted in the past because the absentee voter applications arrived too late from overseas military bases. We know that in 2010, only 5% of the military vote was counted. But federal legislation was passed called the Military and Voter Empowerment Act (MOVE) that required states to engage in additional actions to make it easier for military personnel to vote, such as collecting military absentee ballots at least 45 days before an election. However, the Obama Administration failed to give the agency tasked with implementing this program adequate funding to have much impact and even granted waivers to a number of states, thus allowing them to continue what they were previously doing: throwing late military absentee voter applications in the trash.\nAs Investor’s Business Daily wrote in 2012:\nIndifference of the administration and the Defense Department will cause a record low military vote this year, particularly in swing states. Those who protect our right to vote deserve better. A new report by the Military Voter Protection Project found that absentee ballot requests by the military have dropped significantly since 2008 and are on track to make 2012 a record low for the military vote. As of Sept. 22, requests were down 46% in Florida, 70% in Virginia and 70% in Ohio…. The Pentagon is not doing its job, and the Obama administration doesn’t seem to care.… A Defense Department Inspector General report released in August found that FVAP hadn’t set up those voter assistance offices, using budget cuts as an excuse.\nThis created such an outcry that the number of waivers granted to states dramatically dropped in subsequent years.\nAre you getting the picture yet? It’s a nifty formula: Register illegals and felons to vote but suppress the votes of conservatives and those who serve our country. Add up all these actions and it’s difficult to not conclude Obama and his leftist allies in various states were engaged in a massive conspiracy to use the power of federal and state governments to influence the electoral process. And much of this occurred before Obama knew Trump would be the GOP nominee.\nBut let’s bring this conspiracy up to the present. All of this flows nicely into Obama’s plan to use his intelligence agencies as an appendage of the DNC. There is now little doubt that Obama’s appointees involved themselves in a scam to purchase phony intel and then used it as the basis for an application to the FISA court so they could spy on Trump’s campaign. This plot had little to do with Russia and everything to do with creating a damaging narrative about “treason” and “collusion” that was to be spoon fed to their media allies and used to try to remove Trump from office.\nIf Obama was really that concerned about Russian meddling with our election, he wouldn’t have ordered his cyber security team to stand down last election when they proposed ramping up efforts to counter Russian interference. And Obama would have demanded that the DNC turn over its server to the FBI to determine if it was really was hacked by the Russkies. But they didn’t, probably because they weren’t sure they could control the narrative if revelations leaked out that Russia didn’t hack the DNC computer. Instead, the DNC turned its server over to a cyber security firm called CrowdStrike that has ties to Hillary Clinton. Why would they do that?\nBut something happened on the way to socialist utopia. Trump won. That was not supposed to happen.\nTo be blunt, the plan was for Hillary to win and continue the destruction of the American system of limited government, the rule of law, and the free enterprise system. A Hillary victory would have continued Obama’s agenda of open borders, government control of many industries, a cradle to grave welfare system, and emaciated military and socialist policies that would continue economic stagnation. Future elections would appear to be legit but they wouldn’t be.\nUnder a Clinton presidency, she would continue the Obama immigration policies, thereby allowing a few million more illegals to enter the country and would also massively increase Third World refugees who vote heavily Democratic. Indeed, in 2016 she announced that as president she would increase Syrian refuges alone by 550%. Add to this the aggressive federal/state/private voter registration programs targeting these groups and the result would be a boost of Democrat vote numbers probably large enough to keep winning the White House on a perpetual basis, essentially invalidating the will of the legal majority.\nElections would just be a formality to make the masses feel like they still lived in a free country, but the only free elections would be between Democrats in their own primary. The result would be the transformation of America to a full blown socialist country within a decade. Just as Obama had promised.\nNor should there be any doubt about Obama’s socialist vision for America. This is important because his ideology explains why he is leading the resistance: socialists believe in the Marxist theory that capitalism cannot coexist with socialism, hence they are obligated to destroy the free enterprise system and all the cultural traditions that go along with it. It was not a coincidence that the attacks on traditional marriage, the undermining of religious freedom, the promotion of transgendered “rights,” and other issues challenging traditional mores came to a fore during the Obama years. Obama and the progressives seek to undermine America’s cultural traditions because they are linked to America’s Christian and capitalist heritage. Their socialist ideology explains the chaos we find everywhere we look today. Historically, socialists detest free speech, free press, freedom of religion, and other constitutional rights we all take for granted. Just walk down any big city street with a Trump hat on and you will witness the attacks for yourself. Start getting used to it.\nHowever, Americans were so propagandized by the media concerning Obama’s “mainstream Democrat” background that very few know the real truth about who he really is. But the evidence of Obama’s socialist background is overwhelming.\nResearchers have dug up quite a bit about him since he burst onto the national political scene over a decade ago. Four books in particular have ripped off the propaganda cover: Aaron Klein’s The Manchurian President: Barack Obama’s Ties to Communists, Socialists and other Anti-American Extremists; Paul Kengor’s The Communist: Frank Marshall Davis, the Untold Story of Barack Obama’s Mentor; Trevor Loudon’s Barack Obama and the Enemies Within, and lastly, Stanley Kurtz’s excellent Radical-In-Chief: Barack Obama and the Untold Story of American Socialism. These authors have exhaustedly documented Obama’s involvement with numerous groups dominated by communists and socialists.\nIndeed, Obama launched his political career at the house of former Weatherman terrorist Bill Ayers, who calls himself a “small c communist.” Obama’s mentor at Harvard was Charles Ogletree, a radical Marxist professor, former Black Panther, and leader of the nutty “reparations” movement.\nWe now know his father was a socialist economist and that his boyhood mentor was Frank Marshall Davis, a card-carrying Communist Party member who, according to his FBI file, was engaged in espionage. Davis even appears on the FBI’s Cold War era “watch list” of people to be rounded up should the Soviets launch a war against the USA.\nWe also know that Obama spoke at the funeral of leading Marxist theoretician Saul Mendelson. We know that in the 1996 he actually joined the New Party, a Marxist party in Illinois. And we know the Communist Party itself lavished praise on Obama, boasting of how they “actively supported Obama during the primary election.” Upon Obama’s 2008 victory, Sam Webb, the president of the U.S. Communist Party, announced we “now have a friend, a people’s advocate and the first African American in the White House.”\nFormer Communist activist John Drew attended Occidental with Obama and says not only that Obama was a well-known “Marxist-Leninist” on campus but that he actually said “There’s going to be a revolution” in the USA. And there has been of sorts.\nOne cannot dig into Obama’s background without stumbling into Communists and other assorted socialist revolutionaries everywhere one looks. And much of the media knew this when Obama ran for the presidency in 2008 but decided Americans didn’t need to know. But they covered every mistake and every shady relationship that Donald Trump ever had. Nor is there any evidence Obama ever modified his views. His background and his legislative legacy demonstrates contempt for America; its history, culture, constitution, and political system. All of this is consistent with Obama’s Marxist worldview that he took great pains to disguise. As Stanley Kurtz wrote, “Obama has made concerted efforts to hide his socialist convictions from the voters who put him into office.”\nIn Obama’s mind, his election was only the first step in the transformation of America. When Trump interrupted Obama’s plans by defeating Clinton, Obama was forced to dedicate himself to managing the resistance to Trump with the goal of removing or defeating Trump in order to revive his plan of moving America toward socialism. That is why Obama, his wife Michelle, and his top advisor, Valerie Jarrett moved into a home just two miles from the White House. The home, as reported by the Daily Mail, is the “nerve center of the mounting insurgency against his successor….” This is also why Obama has been busy meeting with numerous 2020 White House contenders at his office in the World Wildlife Fund building in Washington, D.C.\nObama may not prevail in his effort to oust Trump and/or defeat him in 2020, but one has to acknowledge his brilliance in organizing this very complex and far flung conspiracy. It includes elements of spying, disinformation, legislative efforts, propaganda, media relations, the use of intelligence assets, not to mention the coordination of dozens of legal assaults on numerous Trump policies with the goal of paralyzing his ability to govern. Many of Obama’s tactics such as promoting the movement to give felons voting rights, blocking states from implementing voter ID laws, and suppressing Tea Party political activity, date back to his first term. For a decade, he has worked within the system preparing for the current chaos, even though much of what the “resistance” has done is highly questionable, if not illegal. Especially the politicizing of federal agencies.\nIf the Republicans were half as energetic and organized as Obama, they would likely not be in the predicament they are in. Aside from a few standouts like Congressman Devin Nunes (R-CA), they look impotent and confused, and seem unwilling to believe that Obama has been engaged in a long-term project to transform America and disenfranchise Republicans permanently. Had roles been reversed with Hillary in the White House and Republican FBI/DOJ appointees caught using their offices to sabotage Hillary’s election, it’s likely a lot of Republicans would be wearing orange jumpsuits by now.\nAs I’ve previously written for The American Spectator, when Republicans violate the law, the Dems waste no time indicting, convicting, and sending Republicans to prison. Between Watergate and Contra-gate, Democrats charged 83 Republicans with criminal conduct and many went to prison. So far, Republicans have not held even one Democrat accountable for crimes committed that are arguably far more damaging to our democratic process than these two Republican scandals.\nInstead, incredible as it may seem, the party involved with abusing federal power to interfere with a presidential election is using the authority of the Special Council office to investigate Republicans on a phony Russian collusion case. Hard to believe.\n“Operation Hurricane,” as the FBI called its illegal anti-Trump effort, is unprecedented in scope in U.S. history, yet Nunes has received only lukewarm support from the GOP establishment. Moreover, the Senate Select Committee on Intelligence (SSCI) headed by establishment Senator Richard Burr (NC), issues reports and makes statements that consistently undermine Nunes’s work. Burr actually defended the corrupt FISA application that, we now know, was based solely on the fabricated, DNC-funded dossier. Indeed, SSCI is notorious for leaking classified info to the press.\nAside from Senator Chuck Grassley and a few other Senators, many Republican senators seem to take their lead from the Democrats rather than from the House Intelligence Committee, which has spent far more time and resources investigating Operation Hurricane than any other committee.\nNor has the White House been helpful. For months now, the FBI, DOJ, CIA, and other agencies have dragged their feet on releasing documents requested by congressional house investigators. The DOJ has yet to release the full June, 2017 FISA warrant application without redactions, a document that would likely challenge the entire Russian collusion narrative. With one phone call, the Trump White House can order these agencies to comply immediately, but Trump’s attorneys apparently are resisting this. They should re-think. It is pathetic that a private group, Judicial Watch, using the Freedom of Information Act, has been able to secure far more documents than have the Republican-controlled oversight committees. How can this be?\nIf the GOP cannot unify to pursue a scandal this deep-rooted and consequential, then they don’t deserve to win in 2020 and will not likely survive as a viable party. It’s as if the Republican establishment wants the Deep State to prevail, Trump to be removed, and America returned to the socialist path it was on under Obama. Are they really that naïve that they don’t understand that once we go down that road, it’s unlikely the damage can be undone?\nThe progressive strategy to take down America has been in place for years but the lackadaisical attitude of the Republicans could determine if Trump’s counter-attacks are for the long term or are temporary. Aside from continuing to expose Obama’s plot to sabotage Trump’s election, the GOP needs to step up its game in many areas. For example, they need to launch a nationwide effort to coordinate the passage of voter ID laws in every state possible and Trump should order the DOJ to assist with the drafting of such laws.\nThe DOJ should also open up an investigation into how state DMV’s are automatically signing up illegals to vote who possess driver licenses; they should investigate the status of our military vote and make sure our fighting men and women are not being disenfranchised, and, lastly, they should investigate the slew of Soros-funded groups suspected of registering illegal aliens. After all, our democracy is being threatened by millions of non-citizens voting thereby compromising the integrity of our democratic system. Is this not precisely the kind of national conspiracy the DOJ should be investigating?\nMoreover, AG Jeff Sessions needs to take back control of his agency. It is alarming that he appears to be not involved in any DOJ investigations concerning anything remotely related to Russia or Hillary, because he was advised to recuse himself by career DOJ attorney Scott Schools, even though the legal case for Session’s recusal was non-existent. Not surprisingly, Schools was hired by Obama official Sally Yates who was fired by Trump for refusing to support his travel ban. Sessions needs to reverse this silly recusal, hire new staff who are actually loyal to him, and get back on top of investigating the biggest political scandal in American history.\nThis is do or die time. Failure to act now by the GOP will cost the country dearly. Obama and his progressive allies have an aggressive multi-prong plan to survive congressional investigations, win back the White House in 2020, and resume their effort to take America down the socialist path. This is war, and the Democrats know it, but it’s not clear the Republican leadership understands this moment in history.\nSo, did Trump save America from socialism as D’Souza claims in Death of a Nation? I would argue that yes, he did, but if more Americans don’t realize what’s at stake here and wake up, Trump’s election will be only a temporary respite from the left’s efforts to turn America into a Third World style socialist “paradise.” For starters, every American patriot can help fight the progressives by taking a friend who is “apolitical” or “undecided” to watch Death of a Nation. This film will open their eyes.","url":"https://spectator.org/did-trump-really-save-america-from-socialism/"}
