{"authors":[],"date_download":"2018-10-22 21:00:51","date_modify":"2018-10-22 21:00:51","date_publish":"2014-05-05 09:04:49","description":"A U.N. committee will look at whether the Vatican violated the U.N. Convention Against Torture, which it ratified in 2002.","filename":"data/vaneerConsumption/DidtheVaticanViolateUNConventionAgainstTorture.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/419626/140505-vatican-0615_1013f7092dd48b8a00838258be619723.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_religion_did-vatican-violate-u-n-convention-against-torture-n96986_1540242051.html","title":"Did the Vatican Violate U.N. Convention Against Torture?","title_page":"Did the Vatican Violate U.N. Convention Against Torture?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA U.N. committee compared the Vatican's handling of the global priest sex abuse scandal with torture Monday, raising the possibility that its failure to investigate clergy and their superiors could have broader legal implications.\nBut the Vatican's top envoy in Geneva, Archbishop Silvano Tomasi, claimed that the Holy See was getting its house in order after a decade-long effort to deal with a global priest sex abuse scandal.\n\"There has been, in several documentable areas, stabilization and even a decline of cases in pedophilia,\" he told a committee of experts in charge of the U.N. Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment, which the Vatican ratified in 2002.\nAt the Holy See's first appearance before the committee, experts mainly peppered the Vatican with tough questions to be answered Tuesday. For instance, they asked why the report on its implementation of the treaty was almost a decade late, and why the Vatican believes its responsibility for protecting against torture only applies within tiny Vatican City, a nation of less than 1,000 inhabitants.\n\"I wonder if you could tell us how you insure that the criminal prohibition against torture in Vatican City covers all individuals for whom the Holy See has jurisdiction,\" asked committee member Felice Gaer.\nExperts said a finding by the committee that the systematic abuse amounted to torture could have drastic legal implications for the church as it continues to battle civil litigation around the world resulting from the decades-long scandal that saw tens of thousands of children raped and molested by priests.\nKatherine Gallagher, a human rights attorney for the New York-based nonprofit legal group, the Center for Constitutional Rights, said such a finding could open the floodgates to abuse lawsuits dating back decades because there are no statutes of limitations on torture cases. Gallagher, whose group represents Vatican sex scandal victims, said rape can legally constitute a form of torture because of the elements of intimidation, coercion, and exploitation of power.\n\"The torture committee's questions really were about sexual violence and rape, and they made it clear that these acts fall within the definition of torture and the Vatican's obligations under the torture convention,\" she said after the hearing.\n\"A recognition by the torture committee that this is one of the most significant crimes could really open up a new level of prosecutions and accountability,\" she added.","url":"https://www.nbcnews.com/news/religion/did-vatican-violate-u-n-convention-against-torture-n96986"}
