{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-23 01:54:36","date_modify":"2018-10-23 01:54:36","date_publish":"2017-04-26 12:37:27","description":"If Antonio Conte's aim was to get some sort of reaction out of Diego Costa when he decided to drop him for the FA Cup semi-final against Tottenham Hotspur, then it worked spectacularly.","filename":"data/vaneerConsumption/DiegoCostaisbackbutwillhebeatChelseanextyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FCEA200000578-0-image-a-52_1493213060205.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447210_Diego-Costa-Chelsea-year_1540259676.html","title":"Diego Costa is back - but will he be at Chelsea next year?","title_page":"Diego Costa is back - but will he be at Chelsea next year? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If Antonio Conte's aim was to get some sort of reaction out of Diego Costa when he decided to drop him for the FA Cup semi-final against Tottenham Hotspur, then it worked spectacularly.\nCosta's head appeared already in China, with his form having fallen spectacularly since that offer in January from the Far East. He had stopped scoring and was going AWOL in games.\nThen on Tuesday, just in time for the Premier League title run-in, Costa came back with a bang.\nDiego Costa celebrates after getting back to his goalscoring ways against Southampton\nAntonio Conte had previously mentioned that Costa was saving his goals for the business end\nTottenham will travel to Crystal Palace on Wednesday understandably feeling frustrated. Their players will have had the option of watching Chelsea on TV and some will have chosen to do so.\nThey will have seen Costa forget about his recent form to terrorise Southampton at Stamford Bridge, including scoring arguably his greatest goal this season.\nHis first was simple – a cross, a header, done, dusted.\nHis second was sublime – a one-two with Eden Hazard, then another with Pedro, then a fine finish.\nHe also assisted Hazard for Chelsea's opener and almost scored an overhead kick, only for Gary Cahill to take it off him. Cahill's header went in, thankfully, so he'll forgive his team-mate for that.\nCosta's brace turned what would have been a 2-2 draw into a 4-2 win – or one point into three. He has had a habit of that this season.\nCosta scored twice to ensure Chelsea won, and fans will be desperate for him to keep scoring\nSeason at a glance Live tables\nFixtures\nScores Premier League\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\nOf all the Premier League's players this season, no-one has had as big an impact as Costa in terms of turning draws into wins.\nHis goals have contributed 15 points – without that, Chelsea would be fifth in the Premier League, level with Manchester United. Of course, 11 of of those 15 came before the Chinese offer in January.\nAgainst Southampton, though, Costa showed he can still turn it on.\nIt's in the nick of time, too, with five games to go in the Premier League.\nDepending on whether Tottenham win or lose at Selhurst Park, the title could be Chelsea's by mid-May.\nThen a sixth game awaits – against Arsenal at Wembley Stadium in the FA Cup final. The double is on, and Chelsea's boss thinks he has his striker back.\nConte's decision to drop Hazard for the FA Cup semi-final was met with more surprise than Costa, because it was no secret that the striker had been struggling.\nThe striker was benched for the FA Cup semi-final, but bounced back to form on Tuesday night\nCOSTA'S STATS Appearances: 31 Goals: 19, Assists: 6 Yellow Cards: 8 Pass Success %: 74.9 Shots per game: 3.2\nChinese Super League side Tianjin Quanjian are still interested in the 28-year-old, and want to pay Costa a staggering £620,000 a week and Chelsea a substantial fee to sign him this summer.\nSo the question marks over his future are still there, though Conte hopes they are put to the back of his mind while Chelsea try to turn into champions.\nCosta's two goals on Tuesday suggest it will. It took his tally in the top flight to 19 for this season and the Spain international is now only one off his greatest total for Chelsea (20 in 2014-15).\nCosta is still being linked with a move to China this summer, and could end his Chelsea career\nCHELSEA'S FIXTURES Everton (A), league, April 30 Middlesbrough (H), league, May 8 West Brom (A), league, May 12 Watford (H), league, May 15 Sunderland (H), league, May 21 Arsenal (N), FA Cup final, May 27\n'For strikers it's very important to score because the goal is your life,' Conte said on Tuesday. 'I always said I was very pleased with his commitment and work for the team.\n'Sometimes he was lacking in different circumstances but I was always confident about him.\n'If you remember, in the Tottenham press conference I said he was saving his goals for the final part of the season. It's important for his confidence and for us.'\nConte was confident Costa was saving his strikes for the business end of the season and Chelsea's supporters are hoping the same.\nConte's main man may not stay at the Bridge, but the club will be hoping to keep hold of him\nWith games to go against Everton (a), Middlesbrough (h), West Bromwich Albion (a), Watford (h) and Sunderland (h), Costa should fancy his chances of getting above that 20-goal mark.\nCosta enjoys scoring against Everton, after all. He got two in that 6-3 win at Goodison Park in 2014, then another in 2016, and another in Chelsea's 5-0 win at Stamford Bridge this season.\nAgainst Southampton, Costa showed he can still be Conte's main man. Now, even if he is sold in the summer, the striker has to keep it up as Chelsea close in on the title.","url":"https://www.dailymail.co.uk/sport/football/article-4447210/Diego-Costa-Chelsea-year.html"}
