{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:36:24","date_modify":"2018-10-30 19:36:24","date_publish":"2015-12-16 23:57:29","description":"A Facebook group of hardcore \"Star Wars\" fans has threatened to unleash a \"spoiler jihad\" campaign against Disney by ruining the plot of the new \"Force Awakens\" film if their demands are not met.","filename":"data/vaneerConsumption/DiehardStarWarsFansThreatenSpoilerJihadIfDisneyIgnoresTheirDemands.json","image_url":"https://media.breitbart.com/media/2015/12/Star-Wars-fans-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_16__1540928184.html","title":"Diehard 'Star Wars' Fans Threaten 'Spoiler Jihad' If Disney Ignores Their Demands","title_page":"Diehard 'Star Wars' Fans Threaten 'Spoiler Jihad' If Disney Ignores Their Demands","title_rss":"NULL","source_domain":"breitbart.com","text":"One group of Star Wars fans is taking the term “diehard fan” to the next level.\nThe Alliance to Preserve the Expanded Universe, a Facebook group of hardcore Star Wars fans that want to see all of the countless novels, comics, television shows, and other non-canonical material from the space adventure saga preserved in the wake of Disney’s acquisition of the brand, has threatened to unleash a “spoiler jihad” campaign against the House of Mouse by ruining the plot of the new Force Awakens film if their demands are not met.\nThe trouble began last year, when Lucasfilm announced that only the original six Star Wars films, the animated television series Star Wars: The Clone Wars, and any new films created by the company would be considered “canon,” or part of the official Star Wars mythology.\nThat announcement angered fans of the Star Wars “Expanded Universe,” the collection of hundreds of books, comics, and other media properties that furthered the adventures of Luke Skywalker, Han Solo, and the rest of the space fantasy’s core characters as well as new characters and stories not part of the films. With their announcement last year, Lucasfilm said it would shut down the Expanded Universe and rebrand it “Star Wars Legends.”\nBut diehard fans of the property, like the aforementioned Facebook group, want Lucasfilm to continue producing Star Wars Legends content, even if it remains separate from official canon — and some of those super-fans are willing to go over to the Dark Side to prod the Disney-owned company into doing it by threatening to spoil what could be the largest movie release of all time.\n“Somebody’s got to see it in order to poke holes in the plot and otherwise have ammunition with which to destroy it,” one user wrote in the group’s Facebook page, according to screenshots posted by BleedingCool.com.\n“I wasn’t planning on spoiling it in groups,” wrote another. “I probably will spoil it on my main page or in my Walking Dead group which is full of Star Wars fans.”\nAdded another: “I will target Disney loving groups and Rebels groups!!! They deserve it!! Putting their faith on a mouse!!”\nDisney has done all it can to prevent spoilers from the highly-anticipated seventh installment in the long-running franchise from reaching the Internet. The company placed an embargo on film reviews that was lifted Wednesday, the day before the film’s release, and has separately urged entertainment websites not to spoil the film for readers.\nInterest in The Force Awakens is at absurdly high levels; according to The Hollywood Reporter, the film has already sold more than $100 million worth of pre-sale tickets ahead of its December 18 release.","url":"https://www.breitbart.com/entertainment/2015/12/16/diehard-star-wars-fans-threaten-spoiler-jihad-disney-ignores-demands/"}
