{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 03:49:41","date_modify":"2018-10-23 03:49:41","date_publish":"2017-04-26 15:30:44","description":"Foods marketed as helping you shed excess pounds may be damaging your quest to get beach body ready, a study from the University of Georgia has found.","filename":"data/vaneerConsumption/DietfoodscouldactuallybemakingyouFAT.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F9FC43800000578-0-image-a-6_1493217028276.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4447180_Diet-foods-actually-making-FAT_1540266581.html","title":"Diet foods could actually be making you FAT","title_page":"Diet foods could actually be making you FAT | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If you're eating diet products in the hope of losing weight - stop what you're doing.\nFoods marketed as helping you shed excess pounds may be damaging your quest to get beach body ready, a study has found.\nIn trials on rats - believed similar to humans, items high in sugar but low in fat - meant to imitate many popular diet foods - increased their body mass.\nSugar-laden products also induced a host of other problems, including liver damage and brain inflammation, researchers found.\nThe latter may affect someone's ability to know when they are full, causing them to eat more than they need, experts at the University of Georgia claim.\nFoods marketed as helping you shed excess pounds may be damaging your quest to get beach body ready, a study has found (stock)\nLead author Dr Krzysztof Czaja said: 'Most so-called diet products containing low or no fat have an increased amount of sugar and are camouflaged under fancy names.'\nHe added that this 'gives the impression that they are healthy, but the reality is that those foods may damage the liver and lead to obesity as well'.\nDr Cjaza said: 'What's really troubling in our findings is that the rats consuming high-sugar, low-fat diets didn't consume significantly more calories than the rats fed a balanced diet.\n'Our research shows that in rats fed a low-fat, high-sugar diet, the efficiency of generating body fat is more than twice as high.\n'In other words, rats consuming low-fat high-sugar diets need less than half the number of calories to generate the same amount of body fat.'\nOver a four-week period, researchers monitored body weight, calorie intake, body composition and fecal samples in three groups of rats.\nIn trials on rats, items high in sugar but low in fat - meant to imitate many popular diet foods - increased their body mass. Scientists believe the findings may be relevant to humans\nOne group of test subjects consumed a diet high in fat and sugar, while another was given a low-fat, high-sugar diet. A control group was also used.\nBoth diets were found to increase the rats' liver fat and caused a significant increase in body weight.\nLiver fat accumulation was significant in the high-sugar, low-fat group, according to the findings published in the journal Physiology and Behaviour.\nDr Czaja said that this is a 'very dangerous situation', because this can lead to non-alcoholic fatty liver disease.\nSerious forms of the disease can result in liver damage comparable to that caused by heavy alcohol use.\nThe unbalanced diets also induced chronic inflammation in the intestinal tract and brain, the study showed.\nFormer studies in rats conducted by the same team of researchers have shown that brain inflammation alters gut communication.\nIt does this by damaging the vagus nerve, which controls sensory signals, including the brain's ability to determine when one is full.","url":"https://www.dailymail.co.uk/health/article-4447180/Diet-foods-actually-making-FAT.html"}
