{"authors":["James Dutton For Mailonline"],"date_download":"2018-10-22 22:22:25","date_modify":"2018-10-22 22:22:25","date_publish":"2017-03-10 00:29:31","description":"Dimitri Payet has hit out at Slaven Bilic's defensive style of football as the Marseille midfielder reveals the reasons behind his acrimonious departure from West Ham in January.","filename":"data/vaneerConsumption/DimitriPayetdidnotenjoyfinalweeksatWestHam.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3DE19D1D00000578-0-image-a-25_1489105762856.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4299556_Dimitri-Payet-did-not-enjoy-final-weeks-West-Ham_1540246945.html","title":"Dimitri Payet did not enjoy final weeks at West Ham","title_page":"Dimitri Payet did not enjoy final weeks at West Ham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dimitri Payet has hit out at Slaven Bilic's defensive style of football as he reveals the reasons behind his acrimonious departure from West Ham in January.\nThe French star rejoined Marseille in a £25m deal earlier this year in a move that angered supporters after the manager revealed he did not want to play for the club again.\nAfter a lacklustre end to his Hammers career, the 29-year-old already has three goals in eight appearances for his new club.\nDimitri Payet has opened up on his acrimonious move from West Ham to Marseille\nPayet poses with his No 11 shirt after sealing a £25m return to Marseille in January\nAnd Payet has lifted the lid on his controversial exit from the London Stadium, admitting to French newspaper L'Equipe: 'Our way of approaching matches, the defensive system put in place did not please me.\n'You can say that it bothered me, yes. I got through games without any pleasure.\n'I had had contact with Marseille and most notably with Rudi Garcia, who had a philosophy that I knew well. The choice was quick. If I waited six months I would lose six months.'\nPayet reveals that he snapped after West Ham's fortuitous home win over Hull in December, secured thanks to a Mark Noble penalty.\nPayet feared he was going backwards at West Ham and could not risk waiting to leave\nPAYET'S CAREER 2004-2005: AS Excelsior 2005-2007: Nantes 2007-2011: Saint-Etienne 2011-2013: Lille 2013-2015: Marseille 2015-2017: West Ham 2017-present: Marseille\nThe result lifted Bilic's side five points above the drop zone, but Payet knew that he risked going backwards if he remained with the Premier League club.\n'With West Ham at home against Hull, we won 1-0 and they hit the post four times.In the changing room everyone was happy, but the the man of the match that day was the post.\n'I thought that I would not have room for improvement. On the contrary, I risked regressing. I need another challenge.'","url":"https://www.dailymail.co.uk/sport/football/article-4299556/Dimitri-Payet-did-not-enjoy-final-weeks-West-Ham.html"}
