{"authors":[],"date_download":"2018-10-22 21:33:49","date_modify":"2018-10-22 21:33:49","date_publish":"2017-04-26 02:01:25","description":"World number four Ding Junhui took control in the second session against Ronnie O'Sullivan to lead 10-6 in their World Championship quarter-final.The China...","filename":"data/vaneerConsumption/DingeyessemifinalafterdominatingOSullivan.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/02/wire-462589-1493168487-353_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446072_Ding-eyes-semi-final-dominating-OSullivan_1540244029.html","title":"Ding eyes semi-final after dominating O'Sullivan","title_page":"Ding eyes semi-final after dominating O'Sullivan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ding Junhui needs just three more frames of the possible nine to be played to reach his second successive World Championship semi-final in Sheffield\nWorld number four Ding Junhui took control in the second session against Ronnie O'Sullivan to lead 10-6 in their World Championship quarter-final.\nThe China number one, losing finalist at Sheffield's Crucible venue to Mark Selby last year, rattled off five frames in a row from 5-5 including a century clearance against the five-time world champion from England.\nBut O'Sullivan managed to hit back with a quick-fire century in the final frame of the evening to give himself some hope going into Wednesday's final afternoon session in the best-of-25 frame match.\nDing needs just three more frames of the possible nine to be played to reach his second successive semi-final while O'Sullivan has it all to do as he needs to win seven.\nRonnie O'Sullivan needs to win seven frames from a possible nine to advance and equal Stephen Hendry's record of 12 Crucible semi-finals\nIt was a high-quality encounter with a break of at least 50 in every frame in the morning session and that astonishing standard was repeated in the evening.\nDing, 30, has not beaten world number 12 O'Sullivan in a ranking event since 2006 but looks as if he could end the hoodoo and prevent the Englishman equalling Stephen Hendry's record of 12 Crucible semi-finals.\nDing had a 63 clearance to go 5-4 ahead which O'Sullivan matched to level.\nDing then fired in breaks of breaks of 64, 65, 120, 59 and 56 to go 10-5 up before O'Sullivan responded with a typically brisk 104.\nIn the morning session, Ding had raced into a 3-0 lead before O'Sullivan took the next three and they resumed in the evening locked at 4-4.\nDing won the opening frame courtesy of a 71 break and then followed that up with a magnificent 128 clearance.\nAnother run of 71 put him further ahead with O'Sullivan barely getting to the table.\nBut the 41-year-old hit back with a breaks of 63, 99 and 65 to level at 3-3.\nDing edged the next via a tense respotted black after the frame had finished tied, but O'Sullivan restored parity with a run of 59.\nIn the day's other quarter-finals, four-time world champion John Higgins was in complete control at 11-5 ahead of Kyren Wilson.\nHong Kong's eighth-ranked Marco Fu, another bidding to become Asia's first men's world champion, trails title-holder Selby 6-2 in their quarter-final.\nAnd Barry Hawkins leads Stephen Maguire 5-3 after their opening session.","url":"https://www.dailymail.co.uk/wires/afp/article-4446072/Ding-eyes-semi-final-dominating-OSullivan.html"}
