{"authors":["Austin Ruse"],"date_download":"2018-10-30 20:03:37","date_modify":"2018-10-30 20:03:37","date_publish":"2015-02-07 05:31:09","description":"The Episcopal Diocese of Maryland believes former Bishop Heather Cook was “inebriated” at a private dinner the day before the official rehearsal for her consecration as Bishop, according to a timeline of events leading up the fatal accident two days after Christmas. |","filename":"data/vaneerConsumption/DioceseFemaleHitandRunBishopAppearedInebriatedatDinnerPriortoHerConsecration.json","image_url":"https://media.breitbart.com/media/2014/12/bishop-heather-cook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_06__1540929817.html","title":"Diocese: Female Hit-and-Run Bishop Appeared 'Inebriated' at Dinner Prior to Her Consecration","title_page":"Diocese: Female Hit-and-Run Bishop Appeared 'Inebriated' at Dinner Prior to Her Consecration | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Episcopal Diocese of Maryland believes former Bishop Heather Cook was “inebriated” at a private dinner the day before the official rehearsal for her consecration as Bishop, according to a timeline of events leading up the fatal accident two days after Christmas.\nThe timeline shows the Episcopal search committee was informed by investigators in November 2013 that Cook had a previous DUI incident in which she was driving well over the legal limit. Police say she was found to be in possession of a bottle of whiskey, a bottle of wine, and a bag of pot. According to the police report, she had vomit down the front her shirt and was driving on the rim of one wheel, the tire having been shredded.\nThe co-chairmen of the Bishop search committee interviewed Cook about the incident and clearly let it pass since Cook was on the final slate of candidates presented for approval. At that time, Cook’s DUI was discussed again. Bishop Eugene Taylor Sutton, head of the Diocese of Maryland, talked about Cook with Bishop “Bud” Shand of the Diocese of Easton, who recommended “Cook without concerns or reservations.”\nBishop Sutton then encouraged Cook to talk about her previous DUI arrest at “Meet and Greets” in 2014; however, she only talked about “difficult times in her life” and did not address the arrest.\nCook was elected Bishop in May. Over the summer of 2014, Cook underwent a required psychiatric evaluation, the details of which have not been released.\nIt was in September that Bishop Sutton suspected that “Cook might be inebriated during a private diner held two days before the consecration, and conveys concern to Presiding Bishop before rehearsal the next morning (one day before the consecration). Presiding Bishop indicates she will discuss with Cook. Cook consecrated Bishop.”\nThree months later Cook was driving her SUV on a Saturday afternoon, allegedly well over the legal limit for intoxication. She is charged with texting while driving and then swerving into the bike lane where Thomas Palermo, father of two, was riding his bike. Cook’s car struck Palermo, throwing him against the curb. Palermo later died. Cook initially left the scene for 30 minutes before driving past the accident scene again and going home. She finally returned to the scene, at which point she was arrested.\nShe was released on $2.5 million bond, has been stripped of her Bishop’s title, is undergoing alcohol treatment, and is expected to stand trial for a raft of charges that could land her in jail for upward of 20 years.\nA Grand Jury indicted her this week.","url":"https://www.breitbart.com/politics/2015/02/06/female-hit-and-run-bishop-appeared-inebriated-at-dinner-prior-to-her-consecration/"}
