{"authors":[],"date_download":"2018-10-23 01:41:52","date_modify":"2018-10-23 01:41:52","date_publish":"2016-01-29 15:50:25","description":"Diplomats in Tanzania criticised Friday a planned election re-run on Zanzibar, urging a \"peaceful outcome\" and warning of \"intimidation and tensions\" amid an...","filename":"data/vaneerConsumption/DiplomatscondemnZanzibarvotererunurgingcalm.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i2i0-3bmscybNe842cce83474b578a237-535_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423024_Diplomats-condemn-Zanzibar-vote-run-urging-calm_1540258912.html","title":"Diplomats condemn Zanzibar vote re-run, urging calm","title_page":"Diplomats condemn Zanzibar vote re-run, urging calm | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Diplomats condemn Zanzibar vote re-run, urging calm\nDiplomats in Tanzania criticised Friday a planned election re-run on Zanzibar, urging a \"peaceful outcome\" and warning of \"intimidation and tensions\" amid an opposition boycott.\nLast year's elections in Tanzania's semi-autonomous islands were scrapped, but diplomats from 15 nations expressed concern that the election commission annulled the vote \"without having provided evidence to substantiate its claim that irregularities had taken place.\"\n\"We are deeply concerned that the unilateral declaration of a re-run may lead to an escalation of intimidation and tensions,\" said the statement signed by ambassadors in Tanzania including the European Union and the United States envoys.\nThe October 25 elections, which were held across Tanzania, were scrapped on Zanzibar after ZEC reported \"violations of electoral law\", claims dismissed by the opposition ©Tony Karumba (AFP/File)\nThe October 25 elections, which were held across Tanzania, were scrapped on Zanzibar after the islands' election commission reported \"violations of electoral law\", claims dismissed by the opposition.\nZanzibar has experienced sectarian and political tensions in recent years -- including recent grenade explosions -- with the unrest affecting the islands' key tourist industry.\nOthers who signed the statement were Belgium, Britain, Canada, Denmark, Finland, France, Germany, Ireland, Italy, the Netherlands, Norway, Spain, Sweden and Switzerland.\n\"We regret that an election re-run was announced, while a dialogue between parties was still ongoing,\" the statement read.\n\"For the benefit of all Tanzanians, we reaffirm our belief that the current political impasse in Zanzibar would be best addressed through a mutually acceptable and negotiated solution.\"\nThe annulment came after opposition Civic United Front (CUF) candidate, Seif Sharif Hamad, declared himself the winner before the results were officially announced. Zanzibar's election commission announced last week that fresh polls would be held on March 20 and the CUF have said it would boycott the vote.\nZanzibar's 500,000 registered voters also cast ballots for Tanzania's national president, and despite the cancellation of the vote on the islands, new Tanzanian President John Magufuli was sworn into office last year.\nThe diplomats called on Magufuli to \"pursue his previous calls for a negotiated solution between parties, so as to ensure a peaceful outcome.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3423024/Diplomats-condemn-Zanzibar-vote-run-urging-calm.html"}
