{"authors":[],"date_download":"2018-10-30 01:03:55","date_modify":"2018-10-30 01:03:55","date_publish":"2016-08-04 01:00:55","description":null,"filename":"data/vaneerConsumption/DirectDemocracyCaliforniasLastHope.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/1022px-Fresno_-_Prop_8_Rally.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861435.html","title":"Direct Democracy: California’s Last Hope?","title_page":"Direct Democracy: California’s Last Hope?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nOne of the most far-reaching ideas advanced by 20th century progressives was the reemergence of direct democracy. And no state has taken the idea further than California.\nIn 1911, Gov. Hiram Johnson led changes to the state Constitution to include the initiative, the referendum, and the recall. These tools, he believed, would let voters take on entrenched corporate power and break the grip of special interests in the Capitol by letting them vote directly on legislation, reject bills passed by legislators, and even recall the bums from office.\nIronically, today’s California progressives are generally hostile to the concept. Although direct democracy remains popular with the general public, the state’s Democratic leaders often look for ways to gut the system. Many writers accuse the initiative process of being a root cause of most of California’s ills.\nThere’s a clear reason for this turn of events. Today’s progressives control all the other levers of state power. They understand that direct democracy is the only remaining check on the policies they promote.\nTheir complaints grow louder whenever a general election approaches. Last month, I detailed for the Spectator the 17 propositions on this year’s California ballot — the longest list since 2000. The slate filled with complex and substantive policy measures. Critics of direct democracy claim this long list is more proof of the system’s dysfunction. They wonder how voters can possibly be expected to sort through this level of legislative detail. “Is California’s Initiative Process Out of Control?” was the central question on a KQED public-radio panel I was on this week.\nInitiatives are “majoritarian,” complained former Sacramento Bee Editorial Page Editor Peter Schrag, whereas the Legislature has a deliberative process that includes hearings, debate, and passage by two houses. In the Feb. 15, 2016, issue of American Prospect, Schrag championed California’s “progressive” politics — and criticized the best-known example of California direct democracy, 1978’s property-tax-limiting Proposition 13. Many progressives are still bitter about that tax revolt.\nConservatives know that California is a different place politically today than it was in 1978. But a few years ago, far-reaching pension-reform measures were passed overwhelmingly in some of the most Democratic cities in the state. Thus, conservatives suspect, school reform also has a fighting chance on the ballot — even if proponents ultimately are outspent by the unions. The referendum process still gives us a fighting chance, which is why Democrats keep pushing these bogus reforms.\nIn 2011, Gov. Jerry Brown signed a law that moves all statewide initiatives and referendums to the November ballot. His union backers knew conservative-minded reformers had a much tougher time passing initiatives on the general election ballot, when there’s a much larger and more liberal voting demographic. Ironically, that change is the main reason for this year’s long ballot. It forced all measures onto the general election.\nThe latest initiative reform, S.B. 1253, became law in 2014. Mainly it introduces a 30-day public-review period that gives the Legislature a chance to hold hearings. It allows initiative proponents to make changes in response to public and legislative criticism. It was an attempt to give the Legislature a means to derail measures it didn’t like, as we saw this year.\nOne of the most significant initiatives on this year’s ballot involves the 72-hour rule. Backed by moderate Republican donor Charles Munger Jr., this transparency act would require the Legislature to publish the final version of any bill on the Internet for 72 hours before legislators take a final vote. The legislature — despite the “deliberate” process that Schrag pointed to — has a nasty habit of gutting bills at the last minute and then voting on entirely new language without deliberation. It’s an effective way to sneak through contentious measures.\nOnce it became clear this measure qualified for the ballot, legislators tried to cobble together their own weaker alternative and pressure Munger to drop his measure. A few reformers have for years tried to pass a 72-hour rule. It never gained serious legislative attention until now. No wonder direct democracy remains popular with the public.\nHere’s another example of the usefulness of the initiative process: Two decades ago, California voters approved Proposition 215, which legalized the sale of “medical” marijuana. Whatever one thinks of the issue, the public took into their own hands a matter the Legislature refused to address. Since that time, however, clinics have operated in a quasi-legal gray area as they waited for state legislators to come up with a regulatory framework.\nNothing happened for two decades, but suddenly the state Legislature sprang into action last year. In the waning moments of last year’s session, the Legislature passed a package of marijuana bills. The broadest one, A.B. 266, “establishes a comprehensive licensing and regulatory framework for the cultivation, manufacture, transportation, storage, distribution and sale of medical marijuana.” The governor signed them into law.\nWhat changed? Voters have qualified for this November ballot a measure that would legalize recreational marijuana. State officials believe a regulatory framework for medical marijuana is a necessary foundation for taxing and regulating the recreational stuff. Once again, voters pushed the Legislature to act.\nSome of the criticisms are silly. In 2015, someone introduced the “Sodomite Suppression Act,” a nefarious initiative that called for the execution of gays. Anyone with $200 can submit an initiative, but it takes millions of dollars to circulate petitions and really get the matter before voters. This was not a serious measure. The fix here is easy: Raise the cost of filing an initiative to eliminate the mischief-makers.\nSome of the dire warnings have fallen by the wayside. In 2009, The Economist pointed to states such as California that “face daunting budget deficits because the recession has exposed the cumulative legacy of past voter initiatives. Voters loves schools, hospitals, prisons and trains. They also hate the taxes that pay for them.” It argued that “ballot-box budgeting” leads to “fiscal chaos.” Yet in 2012, voters (regrettably) approved Proposition 30, which raised taxes and helped eliminate the state’s budget deficit. So much for chaos. The real problem remains a state government that can’t stop spending, not direct democracy.\nWhatever bad thing you can say about voter initiatives, you can also say about legislators. Sure, special interests and big money often drive initiatives. But special interests and big money also elect legislators. Few voters read the details of the proposed initiatives, but how many legislators have read the long bills they ultimately vote on, especially those gut-and-amend atrocities?\nBecause of our legislative districts, with their lopsided voter registrations, it’s virtually impossible to throw the bums out. We live in a one-party state, so certain ideas — the ones held by conservatives and libertarians — never get a true hearing in those committee rooms. I’d never design a system this way. I understand the broader conservative case against such a system, but at least with direct democracy, reformers have some chance to get around the current logjam.","url":"https://spectator.org/direct-democracy-californias-last-hope/"}
