{"authors":["Associated Press"],"date_download":"2018-10-23 01:04:46","date_modify":"2018-10-23 01:04:46","date_publish":"2017-03-16 10:44:45","description":"BEIJING (AP) - Chinese director Jia Zhangke, known for films exploring China's wrenching social changes, will host his own festival to showcase the work of...","filename":"data/vaneerConsumption/DirectorJiaZhangketohostfilmfestivalinnorthernChina.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319654_Director-Jia-Zhangke-host-film-festival-northern-China_1540256686.html","title":"Director Jia Zhangke to host film festival in northern China","title_page":"Director Jia Zhangke to host film festival in northern China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - Chinese director Jia Zhangke, known for films exploring China's wrenching social changes, will host his own festival to showcase the work of young directors and movies from developing countries.\nJia announced Thursday that the Pingyao International Film Festival will be held Oct. 19-26 in the ancient city in the northern province of Shanxi, from where Jia hails.\nHe told The Associated Press the festival aimed to present outstanding work from around the world and help promote talented young directors.\n\"During my time at film festivals, I was able to see many very good films from different countries and different cultures, and to consider people's lives, human nature and societies from different angles,\" Jia said. \"These films are brilliant, but they badly need to be introduced to Chinese audiences.\"\nHe added: \"We mainly hope the films come from regions such as Asia, Latin America and Africa because there is less chance for them to be seen by Chinese audiences,\" as opposed to films from Europe and North America.\nSwiss-Italian producer Marco Mueller, whose works include the Oscar-winning 2001 Bosnian film \"No Man's Land,\" will be the festival's artistic director.\nJia's credits include \"A Touch of Sin,\" nominated for the Palme d'Or at the 2013 Cannes Film Festival. Many of his most acclaimed films failed to gain censors' approval to be shown in China.\nA company founded by Jia will host all film festivals in the city in conjunction with the local government.\nPingyao was once a famous center of trade and finance and boasts an architectural heritage dating back 2,700 years.","url":"https://www.dailymail.co.uk/wires/ap/article-4319654/Director-Jia-Zhangke-host-film-festival-northern-China.html"}
