{"authors":[],"date_download":"2018-10-30 14:15:38","date_modify":"2018-10-30 14:15:38","date_publish":"2016-11-16 15:01:32","description":"Coal ash. Natural gas fracking. Aged sewers. Potentially dangerous pipelines.","filename":"data/vaneerConsumption/DirtydozenlistofimperiledGeorgiawatersreleased.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/16/Images/newsEngin.16833642_coal-ash-pond.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_8781796d8187e67e7acd0a02089d5fbf__1540908938.html","title":"'Dirty dozen' list of imperiled Georgia waters released","title_page":"'Dirty dozen' list of imperiled Georgia waters released","title_rss":"NULL","source_domain":"ajc.com","text":"Coal ash. Natural gas fracking. Aged sewers. Potentially dangerous pipelines.\nThe Georgia Water Coalition released Wednesday its annual “dirty dozen” list of Georgia’s most endangered waterways while urging citizens, utilities, lawmakers and others to protect the state’s rivers, streams, lakes and drinking water.\n“This year’s ‘dirty dozen’ especially highlights the inherent risks in coal, natural gas and nuclear energy alternatives,” said Joe Cook, spokesman for the Coosa River Basin Initiative in Rome. “We need to keep moving forward to a clean energy future and leave dirty energy behind.”\nHighlights of the coalition’s “dirty dozen” imperiled waterways:\n● Groundwater near a coal ash landfill outside Jesup.\n● A polluted Coosa River from a coal-fired power plant near Rome.\n● Impact of coal ash ponds on Lake Sinclair near Milledgeville.\n● Proposed oil exploration in the Atlantic Ocean off Georgia’s coast.\n● Future dangers of a proposed gas pipeline on the Chattahoochee, Flint and Withlacoochee rivers and the Floridan aquifer in southwest Georgia.\n● Sewer overflow harm to the South River in DeKalb County.","url":"https://www.ajc.com/news/state--regional-govt--politics/conservation-groups-release-dirty-dozen-georgia-waterways/qZsYYcDlalUFVCObWl8CqN/"}
