{"authors":[],"date_download":"2018-10-22 21:03:45","date_modify":"2018-10-22 21:03:45","date_publish":"2014-05-05 20:33:55","description":"A program at the University of Delaware creates custom cars for disabled children to help them get around — and maybe walk again.","filename":"data/vaneerConsumption/DisabledChildrenGetCustomCarsWithAPurpose.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/421651/x_30_nn_kidscars_140505_b34c95c5c0c98c27266c9b39789b1931.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_disabled-children-get-custom-cars-purpose-n97566_1540242225.html","title":"Disabled Children Get Custom Cars With A Purpose","title_page":"Disabled Children Get Custom Cars With A Purpose","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe technology that’s helping 5-year-old Xander Brewer-Ley keep up with his friends got its start in a deceptively simple place: a toy store.\nFrustrated by inaccessible and expensive wheelchairs, Cole Galloway, a professor in the physical therapy department at the University of Delaware, went to a local Toys R Us looking for solutions for kids with mobility problems.\n“All kids deserve a ride on car that's set for them,” Galloway told NBC News. Galloway and his Pediatric Mobility Lab and Design Studio started the Go Baby Go program, which seeks to create modifications of toy vehicles that put young kids in motion, helping them to play with their friends and gain independence.\nThe effort began by building a small robot that children with special needs could drive, and evolved into a project to modify existing toy cars to make them suitable for an individual child. Galloway says anyone can adjust a toy within several hours, a cheaper and faster route than waiting for a wheelchair.\n“That's going to take a little bit of modification for some kids. It might take a lot of modification for other kids. But everybody can get around independently,” Galloway said.\nFor Xander, who was born with a spinal cord disorder, Galloway created a stand-up car. It’s not just play – it’s therapy that may someday help Xander walk.\nGalloway has posted how-to videos on his website so families around the world can build their own custom cars.Pediatric physical therapist Tracy Stoner says the vehicles help kids with strength and balance, the same things she would work on in a traditional treatment plan. “It's opening a new window for us, and making us think differently,” she said.","url":"https://www.nbcnews.com/nightly-news/disabled-children-get-custom-cars-purpose-n97566"}
