{"authors":["Sam Tonkin For Mailonline"],"date_download":"2018-10-23 03:53:02","date_modify":"2018-10-23 03:53:02","date_publish":"2016-01-28 19:38:51","description":"Kevin Dillon, 73, of Chingford, East London, who has suffered three strokes and uses a wheelchair when he goes outside, was shocked to see a stranger's face when he received the badge.","filename":"data/vaneerConsumption/DisabledChingfordpensionersbluebadgearriveswithsomeoneelsesfaceonit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30AD197800000578-0-image-a-63_1454009789819.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421500_Disabled-pensioner-73-t-park-outside-home-blue-badge-s-face-mistake_1540266782.html","title":"Disabled Chingford pensioner's blue badge arrives with someone else's face on it","title_page":"Disabled Chingford pensioner's blue badge arrives with someone else's face on it | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A disabled pensioner says he's been unable to park outside his own home because a council's administrative error led to his new blue badge arriving with someone else's face on it.\nKevin Dillon, 73, who has suffered three strokes and uses a wheelchair when he goes outside, received the disabled parking badge last Friday.\nBut when he looked at it he was shocked to find a stranger's face staring back at him.\nMistake: Kevin Dillon (right) says he's been unable to park outside his own home because a council's administrative error led to his new blue badge arriving with someone else's face on it (left)\nMr Dillon, of Chingford, East London, complained to Waltham Forest Council and the authority said it would investigate.\nHe said: 'I didn't even notice that it wasn't me at first. Then my wife saw it and said \"that's not you.\"\n'We have no idea who this man is, but it's rather worrying and I feel very trapped not being able to see the people I want to.'\nMr Dillon and his 72-year-old wife Carol, whom he relies on to drive, chose not to use the badge in case they were caught and issued with a fine.\nIt means they aren't using the disabled parking bay outside their home.\nMr Dillon said: 'They said that I could use the badge despite it having the wrong photo.\n'But these people who stop you and look at your pass, they will fine you if you don't have the right photo, it is illegal.\nUseless: Mr Dillon, 73, who has suffered three strokes and uses a wheelchair when he goes outside, received the badge last Friday. But when he looked at it he was shocked to find a stranger's face staring back at him\n'I can't use any disabled bays with this card - including the one outside my house.\n'I can only walk about ten yards with a stick. I've had strokes and the blue badge is so important.\n'At first they said it would take around a month to send me a new one, but then they started saying it would be a week or two.'\nHis wife added: 'At the moment he has to sit in all day and he gets such a bad temper.\n'I can't take him out until the new badge comes, I'm just not risking it.'\nAfter growing tired of hearing nothing from Waltham Forest Council, Mr Dillon chased the authority on Tuesday.\nBut he claims that a council officer he spoke to denied all knowledge of his case and insisted that his disabled badge was void and that he if he used it he would be breaking the law.\nMrs Dillon said: 'I think the council have handled this situation really quite badly.\nMr Dillon and his 72-year-old wife Carol, whom he relies on to drive, chose not to use the badge (pictured) in case they were caught and issued with a fine. Waltham Forest Council has also said using it would be illegal\nIt means they aren't using the disabled parking bay outside their home in Chingford, East London (pictured)\n'It should never have happened in the first place.\n'We are both very upset about it.'\nWaltham Forest Council have since told Mr Dillon that the situation is being handled and he will be getting a new badge shortly.\nHe said: 'The council told me that somebody had clipped on the wrong photograph, which I think is very careless.\n'It's also worrying because they haven't asked me to send the old badge back, which means that my details could then get mixed up with somebody else's.'\nDeputy leader of Waltham Forest Council, Cllr Clyde Loakes, said: 'I'd like to apologise to Mr Dillon for the fact his badge was issued with the wrong photo.","url":"https://www.dailymail.co.uk/news/article-3421500/Disabled-pensioner-73-t-park-outside-home-blue-badge-s-face-mistake.html"}
