{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 03:17:31","date_modify":"2018-10-23 03:17:31","date_publish":"2016-01-11 15:57:58","description":"A bus driver in Peru could face up to two years in prison after being caught launching a vicious attack on a disabled man in CCTV footage taken in the Lurigancho-Chosica district of Lima.","filename":"data/vaneerConsumption/DisabledmaninPeruviciouslybeatenbybusdriverinvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BCE6200000578-0-image-a-31_1452527808256.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394078_Disabled-man-Peru-viciously-beaten-bus-driver_1540264651.html","title":"Disabled man in Peru viciously beaten by bus driver in video","title_page":"Disabled man in Peru viciously beaten by bus driver in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A bus driver in Peru is facing jail after CCTV cameras captured him viciously attacking a helpless disabled man in the street.\nAccording to witnesses, the young handicapped man was waiting to get on the bus, in the Lurigancho-Chosica district of the Lima Province in Peru, but the driver hit him as he pulls up to the stop.\nInstead of stopping to help, the driver carries on driving forward to pick up other passengers further down the line, and when the disabled man protested he launched the assault.\nA bus driver could face up to two years in prison after a vicious assault on a disabled man, pictured\nThe disabled man appears to be hit by the bus in CCTV footage, and then lashes out against it with his crutch\nThe driver then stuns passengers by getting out of the vehicle and kicking and stamping on the prone man\nAfter being hit by the vehicle, the disabled man used one of his crutches to bang against the windows of the bus in frustration.\nBut in a shocking twist, the driver then stops the bus, walks over to the man and kicks him hard.\nThe disabled man was left crumpled on the ground, after which the driver started stomping on his head before other passengers and passers-by intervened.\nThe attack lasts for around half a minute as the disabled man struggles to protect himself\nEventually passengers and passers-by intervene to stop the attack continuing and the man was arrested\nThe next moments on the tape show the aggressor in a heated conversation with the bystanders while the injured man remains curled up on the floor holding his head.\nSoon policemen and paramedics arrive on the scene, to attend to the victim and arrest his attacker.\nA police spokesman said: 'It seems a clear-cut case of an unprovoked assault.'","url":"https://www.dailymail.co.uk/news/article-3394078/Disabled-man-Peru-viciously-beaten-bus-driver.html"}
