{"authors":[],"date_download":"2018-10-22 21:24:01","date_modify":"2018-10-22 21:24:01","date_publish":"2016-02-26 00:00:00","description":"They say they are leaving because of lengthy delays in being recognized as refugees, poor living conditions and humiliation at the hands of German authorities.","filename":"data/vaneerConsumption/DiscouragedByDelaysInGermanySomeMigrantsOptToReturnHome.json","image_url":"https://media.npr.org/assets/img/2016/02/26/gettyimages-512254838_wide-5b08cd871226d25bac8593cf7972166a95c1ddc4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=468216184_1540243441.html","title":"Discouraged By Delays In Germany, Some Migrants Opt To Return Home","title_page":"Discouraged By Delays In Germany, Some Migrants Opt To Return Home : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nGermany wants to send home some asylum-seekers. In that way, Germany resembles other European countries concerned about the sheer number of people coming from the Middle East and elsewhere. This week, Germany sent a charter plane filled with Afghan migrants back to Kabul. And yesterday, Germany's Parliament passed laws that make it easier to deport migrants. Many asylum-seekers say they got the message. They're not waiting to be shoved out. NPR's Soraya Sarhaddi Nelson reports from Berlin.\nSORAYA SARHADDI NELSON, BYLINE: Terminal C here at Tegel Airport is packed with people waiting to take the weekly Iraqi Airways flight to Baghdad and Erbil. Most on this recent afternoon are Iraqi asylum-seekers who've given up on trying to make it in Germany. Going home after four months is Duaa al-Buhaider and her two preschool-aged children. Her mother, Bushra al-Fahad, pats her shoulder.\nAL-BUHAIDER: (Foreign language spoken).\nNELSON: She says the reason her daughter and family are leaving are the delays in getting their case decided as well as rude treatment by the very government workers who are supposed to help. Fahad, who has been a refugee in Germany for the past six years, invited her daughter and grandkids to live in her two-room apartment so they wouldn't be stuck outdoors in a camp during the cold winter months. But her German landlord forbade it, saying he didn't want that many people in the small apartment. Frustration overwhelms the 47-year-old, and she starts to cry.\nBUSHRA AL-FAHAD: (Foreign language spoken).\nNELSON: Fahad says, \"Of course we prefer to stay in our country. We don't choose to be migrants. So why do they make it so hard?\" That's a question Bernd Mesovic of the German refugees rights group Pro Asyl has as well.\nBERND MESOVIC: (Foreign language spoken).\nNELSON: He accuses the government of using delays as a tactic to encourage more people to leave. And while asylum-seekers wait, they are denied benefits in language classes, which adds to their frustration, Mesovic says.\nMESOVIC: (Foreign language spoken).\nNELSON: Exactly how many asylum-seekers are choosing to leave Germany is hard to say. The government only keeps track of the small numbers seeking official help with their return. That amounted to 724 Iraqis last year. Nearly 10 times as many went home in December as in July. That's OK with Stephan Mayer, who is with the German ruling coalition's parliamentary group in charge of home affairs. He says parts of Iraq are safe, especially now that ISIS has withdrawn from some areas.\nSTEPHAN MAYER: It's not so difficult to live there in Kurdistan and in northern Iraq, so I don't see any problem if those from Iraq turn back to Erbil.\nNELSON: The MP denies the delays in claims processing are on purpose. But he adds that if asylum-seekers who go home dissuade others from coming, so much the better. Back at the airport, Iraqi asylum-seeker Ahmed al-Jawad says he'll be taking that message back to his friends and family in Baghdad.\nAHMED AL-JAWAD: (Foreign language spoken).\nNELSON: He says dying in Iraq is better than being humiliated here. Soraya Sarhaddi Nelson, NPR News, Berlin.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=468216184"}
