{"authors":[],"date_download":"2018-10-22 21:41:43","date_modify":"2018-10-22 21:41:43","date_publish":"2014-05-07 22:07:05","description":"Discovery is at least the 15th in the Pacific Northwest since girl walking on beach stumbled across man's foot in a size-12 Adida in 2007.","filename":"data/vaneerConsumption/DiscoveryofHumanFootonSeattleWaterfrontAddstoAppendageTally.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427766/140507-seattle-shoe-jms-1904_6b3a3537e5e1c6c71e965b83648cfe0a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_discovery-human-foot-seattle-waterfront-adds-appendage-tally-n99796_1540244503.html","title":"Discovery of Human Foot on Seattle Waterfront Adds to Appendage Tally","title_page":"Discovery of Human Foot on Seattle Waterfront Adds to Appendage Tally ","title_rss":"NULL","source_domain":"nbcnews.com","text":"That gruesome find was followed by a spate of similar discoveries, mostly in British Columbia but also in Washington, leading some to speculate that a serial dismemberer was on the loose.\nBut Barb McLintock, a spokeswoman for the British Columbia Coroners Service, said an investigation determined that all of the 11 feet found there were the results of “non-suspicious deaths” – meaning they were either attributable to accidents or suicides.\n“We found there is nothing suspicious in any of them,” she said. “It appears that the feet become disarticulated from the body naturally with time, as the bodies decompose and are eaten by sea life or other marine organisms.”\nBut why do they end up on shore?\n“The answer to that, we believe, is that the material in the running shoes or hiking boots is too tough for anything to eat through, and some of them have air in them or rubber soles that cause them to float,” McLintock said.\nThough human feet have been found on beaches in many parts of the world, McLintock said the “Salish Sea” – an unofficial name for the Strait of Juan de Fuca, the Strait of Georgia and Puget Sound off northern Washington and southern British Columbia - appears to be uniquely suited for such discoveries because of circular currents that carry debris through the intricate coastal waterways, she said.\n“All of the feet have been found within about 125 miles of one another,” she noted.\nMcClintock said that coroner’s officials there have managed to match all but two of the recovered feet to victims, providing closure to their families. In one case, she said, they were able to confirm the death of a fisherman who had vanished in 1987 – 25 years before his foot was found.\n“You don’t get to have too many happy stories if you are in the coroner’s service,” she said. “This is about as happy as it gets.”","url":"https://www.nbcnews.com/news/us-news/discovery-human-foot-seattle-waterfront-adds-appendage-tally-n99796"}
