{"authors":["Caroline May"],"date_download":"2018-10-30 19:02:22","date_modify":"2018-10-30 19:02:22","date_publish":"2016-01-21 18:48:26","description":"The Federation for American Immigration Reform has launched an ad campaign aimed at sounding the alarm about how the foreign labor has been used to displace of American workers. |","filename":"data/vaneerConsumption/DisneyWorkerReplacedByForeignLaborNowFeaturedinNewAdCampaign.json","image_url":"https://media.breitbart.com/media/2015/11/Disney-Florida.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_21__1540926142.html","title":"Disney Worker, Replaced By Foreign Labor, Now Featured in New Ad Campaign","title_page":"Disney Worker, Replaced By Foreign Labor, Now Featured in New Ad Campaign | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Federation for American Immigration Reform has launched an ad campaign aimed at sounding the alarm about how the nation’s immigration system has been used to displace of American workers.\nFAIR launched the ad this week in Florida, the state where the Walt Disney Company laid off a slew of American workers and replaced them with cheaper, foreign guest workers.\nThe ads FAIR is launching this week focus on the Walt Disney layoffs.\n“This story must be told – Americans must be warned and take action,” Dan Stein, president of FAIR, said in announcing the ad. “Walt Disney is one of many well-known examples of companies exploiting gaping holes in our nation’s immigration system to displace and undermine American workers.”\nHe added, “These practices occur routinely across the nation under a system that allows businesses to bring in foreign workers in preference to Americans and, as in the case of Disney, forcing laid-off American to train their foreign replacements.”\nFAIR says the ads will run on radio, television, and online. They feature Leo Perrero, one of the laid off Disney workers.\n“A Disney executive walks in and delivers the news that we have 90 days to train our foreign replacements. If we don’t do that we won’t get our severance pay or bonuses,” Perrero says in the ad.\n“I just felt extremely betrayed and humiliated to go through that,” he adds.\nThe ad directs that people visit the ‘FAIR Chance at Jobs’ website.\n“There is a popular perception that companies can only use foreign guest workers when qualified American workers are not available. That perception is just false,” Stein added. “Guest worker programs are riddled with loopholes written by business lobbyists that allow their clients to bring in foreign workers pretty much at will.”\nSee the 30 second ad:\nFull length ad is available here.","url":"https://www.breitbart.com/politics/2016/01/21/disney-worker-replaced-by-foreign-labor-featured-in-new-ad-campaign/"}
