{"authors":[],"date_download":"2018-10-23 02:34:31","date_modify":"2018-10-23 02:34:31","date_publish":"2017-03-16 13:13:15","description":"Disney has asked Malaysia to overturn a decision to cut a \"gay moment\" in its film \"Beauty and the Beast\", a senior official said Thursday, as the studio...","filename":"data/vaneerConsumption/DisneyappealsMalaysiacutstoBeautyandtheBeast.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228503-1489669997-229_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320192_Disney-appeals-Malaysia-cuts-Beauty-Beast_1540262071.html","title":"Disney appeals Malaysia cuts to 'Beauty and the Beast'","title_page":"Disney appeals Malaysia cuts to 'Beauty and the Beast' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emma Watson stars in Disney's \"Beauty and the Beast\"\nDisney has asked Malaysia to overturn a decision to cut a \"gay moment\" in its film \"Beauty and the Beast\", a senior official said Thursday, as the studio reportedly postponed its release to resolve the issue.\nThe film, featuring \"Harry Potter\" star Emma Watson, has raised hackles worldwide among religious groups angered by its depiction of Le Fou, the sycophantic sidekick to antagonist Gaston, as a gay man, making him Disney's first ever out LGBT character.\nAfter authorities in Muslim-majority Malaysia made cuts to a song featuring Le Fou, Disney initially said it would not show a censored version of the film, effectively shelving plans to release it in the Southeast Asian nation.\nBut on Thursday, Abdul Halim Abdul Hamid, head of Malaysia's Film Censorship Board told AFP \"an appeal was sent by Disney to the home ministry\".\nDisney has now postponed the Malaysian release of the film, originally slated to open on Thursday, until March 30 to give the authorities time to rule on the matter, The Hollywood Reporter said.\nDisney did not respond to AFP's request for comment.\nThe film's director Bill Condon has revealed that the movie contains Disney's \"first exclusively gay moment\", although some critics have said the reference is extremely mild and fleeting.\nAbdul Hamid said the cuts concerned a song featuring Le Fou.\n\"The way he dances is... gay and the dialogue and the lyrics of the song are too. In the same scene he also lifts up his shirt and shows a love bite on his tummy,\" he said.\n\"Even I wanted to bring my grandchildren to watch it. But there are rules. We don't support LGBT.\"\nHomosexuality is illegal in Malaysia, where laws criminalising sodomy can result in imprisonment, corporal punishment and fines.\nReligious groups and Islamic scholars had previously called for the film to be banned over concerns that it would promote \"negative values\" in the country.\nThe film has also come under fire from religious figures in neighbouring Singapore, while Russia slapped an adults-only rating on the movie last week following pressure by an ultra-conservative lawmaker who was pushing for a ban.\nDespite the controversy, the movie has already become the fastest-selling family film in history, outpacing previous record-holder \"Finding Dory,\" according to online ticket seller Fandango, ahead of its release this week.","url":"https://www.dailymail.co.uk/wires/afp/article-4320192/Disney-appeals-Malaysia-cuts-Beauty-Beast.html"}
