{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:35:52","date_modify":"2018-10-30 19:35:52","date_publish":"2015-02-26 14:50:28","description":"Three more cases of measles have popped up in California since Monday, according to California Department of Public Health numbers released Wednesday--an increase after a hopeful weekend of no new cases. There has been a slowdown in new cases connected to the Disneyland outbreak, while passage of a California bill seeking to reduce parents’ options to exempt their school-age children from required vaccines has become more likely. |","filename":"data/vaneerConsumption/DisneylandMeaslesOutbreakSlowsasVaccineBillGainsSteam.json","image_url":"https://media.breitbart.com/media/2015/01/measles-d1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_02_26__1540928152.html","title":"Disneyland Measles Outbreak Slows as Vaccine Bill Gains Steam","title_page":"Disneyland Measles Outbreak Slows as Vaccine Bill Gains Steam | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Three more cases of measles have popped up in California since Monday, according to California Department of Public Health numbers released Wednesday–an increase after a hopeful weekend of no new cases. There has been a slowdown in new cases connected to the Disneyland outbreak, while passage of a California bill seeking to reduce parents’ options to exempt their school-age children from required vaccines has become more likely.\nTotal cases connected to the Disneyland outbreak now amount to 154 between seven U.S. states, Canada and Mexico.\nCurrently, parents of school-age children in California may exempt their children from some or all vaccinations by signing a “personal belief” waiver. Medical reasons may also exempt California children from school vaccination requirements.\nA bill introduced in the California legislature last week, SB 277, would end “personal belief” exemptions. CBS San Francisco reports that the bill already has “26 sponsors, mostly Democrats, but 2 Republicans have also signed on.”\nCalifornia is currently only one of 19 states that allow a purely personal or religious basis for school required vaccination exemptions, according to the Santa Cruz Sentinel.\nIn numbers updated Monday for California, 123 cases stood unchanged from Friday. This was the first time an update had not shown an increase in confirmed cases since the December beginning of the Magic Kingdom outbreak. As of Wednesday, California has seen 126 cases in total.\n16 cases across six other states were reported as of February 20 in connection to the Disneyland outbreak, according to the Centers for Disease Control (CDC). Another two cases were reported as having traveled to Mexico and connected to the same outbreak.\nAnother ten cases had been confirmed in Canada’s Quebec province in connection to the outbreak, the Public Health Department (PHD) of the Agency for Health and Social Services of Lanaudière reported as of February 11.\nThe U.S. CDC reports, “The outbreak likely started from a traveler who became infected overseas with measles, then visited the amusement park while infectious. However, no source has been identified.”\nU.S. public health officials declared measles eliminated from the country in 2000.\nIn Canada the disease was declared eliminated in 1998.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/02/26/disneyland-measles-outbreak-slows-as-vaccine-bill-gains-steam/"}
