{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:34:14","date_modify":"2018-10-30 19:34:14","date_publish":"2018-08-21 23:21:19","description":"At least 22 people at a hotel in Disneyland Paris resort were accidentally poisoned on Friday due to a chemical mix-up in its swimming pool.","filename":"data/vaneerConsumption/DisneylandParisAccidentallyPoisons22GuestsStaffers.json","image_url":"https://media.breitbart.com/media/2018/08/disneyland-paris.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_21__1540928054.html","title":"Disneyland Paris Accidentally Poisons 22 Guests, Staffers","title_page":"Disneyland Paris Accidentally Poisons 22 Guests, Staffers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At least 22 guests and staffers at a hotel in Disneyland Paris resort were accidentally poisoned on Friday due to a mix-up of chemicals in its swimming pool.\nGuests and staff at the New York Hotel within the Disneyland Paris resort complex received treatment for nausea and respiratory problems on Friday when pool staff mistakenly added a mix of bleach and sulfuric acid to the pool, the Daily Mail reported.\nFirefighters and emergency services reported to the scene to care for the sick people, four of whom had to be taken to the hospital because of the severity of their symptoms. Emergency personnel also evacuated the pool area and all rooms on the first floor.\nLocal French news outlet Le Parisien reported that the incident occurred when employees incorrectly mixed bleach and sulphuric acid, causing chlorine gas to be released into the air.\nChlorine gas, when inhaled, can cause swelling in the upper respiratory area, violent coughs, nausea, lightheadedness, vomiting, burning, and chest pain.\nHotel management closed off the pool area until further notice and has moved customers staying in rooms near the pool. The pool has reportedly been drained.","url":"https://www.breitbart.com/politics/2018/08/21/disneyland-paris-poisons-guests-staffers/"}
