{"authors":[],"date_download":"2018-10-30 18:28:13","date_modify":"2018-10-30 18:28:13","date_publish":"2016-10-21 18:56:07","description":"An outside review process is being proposed for DeKalb County residents to appeal high water and sew...","filename":"data/vaneerConsumption/DisputedDeKalbwaterbillsmaygetoutsidereview.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/21/Images/newsEngin.16545840_10-21-16-boc-work-session.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_d_ad1b7c8699e49ee784bfdf47a64b2e93__1540924093.html","title":"Disputed DeKalb water bills may get outside review","title_page":"DeKalb County proposes outside review for disputed water bills","title_rss":"NULL","source_domain":"ajc.com","text":"An outside review process is being proposed for DeKalb County residents to appeal high water and sewer bills.\nAn independent hearing officer would consider cases and have the authority to decide how much people must pay, according to a draft ordinance Friday from Interim DeKalb CEO Lee May.\nHundreds of residents have been protesting water bills that have inexplicably spiked, with some charges amounting to thousands of dollars.\n“We understand that people’s level of confidence is kind of low now, so we wanted to give them a sense of confidence that the process is fair,” May said about the appeal proposal.\nThe appeal process would be available to customers who, after disputing their bills to the government, still object to the county’s assessment of how much they owe.\nDeKalb would hire third-party hearing officers to review evidence, hold hearings and then make a decision, according to the proposal. The officers’ decisions would be final unless cases are further appealed to DeKalb Superior Court.\nThe DeKalb Board of Commissioners will review the proposal in the next few weeks before deciding whether to amend and approve it.","url":"https://www.ajc.com/news/local-govt--politics/disputed-dekalb-water-bills-may-get-outside-review/j2x4Y3QM0md3kBhE0AhzFI/"}
