{"authors":[],"date_download":"2018-10-30 21:09:30","date_modify":"2018-10-30 21:09:30","date_publish":"2016-12-29 10:59:00","description":"Police need the public's help identifying a suspected gunman and his accomplice in a dea...","filename":"data/vaneerConsumption/DisputeoverhotdogbunsledtodeadlygasstationshootinginDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/29/Images/QuikTripPhoto2_770x433.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_dispute-over-hot-dog-b_5d65ebbffaa731d6416c88e53197c8ff__1540933770.html","title":"Dispute over hot dog buns led to deadly gas station shooting in DeKalb","title_page":"Dispute over hot dog buns led to deadly gas station shooting in DeKalb","title_rss":"NULL","source_domain":"ajc.com","text":"Police need the public's help identifying a suspected gunman and his accomplice in a deadly shooting early Thursday outside a DeKalb County gas station.\nThe shooting led to the death of 30-year-old Andrew Spencer, Chamblee police said.\nQuintin Heard, a friend of the victim, said the incident was \"senseless” and started with a dispute at a gas station’s hot dog stand.\nHeard and Spencer were coming from Follies strip club when they decided to stop at the QuikTrip in the 4000 block of Buford Highway in Chamblee just before 3:25 a.m.\nQuintin Heard, a friend of the victim, called the deadly shooting “senseless.” BRANDEN CAMP / SPECIAL\nA man at the hot dog stand didn’t know where the buns were. Spencer got in front of the man to assist him. Heard said he soon noticed the man waiting outside the QuikTrip.\n“We were walking out, and there he is outside the store with a jacket and a hood on and his hands in his pocket,” Heard said. “He starts talking like, ‘What’s popping?’”\nAn argument began.\nAndrew Spencer (Credit: Channel 2 Action News)\n“And the next thing I know, he just pulled a gun out, and then he just started shooting,” Heard said.\nHeard ran back to their car and later found his friend lying on his stomach. He turned him over and found he was shot in the chest, barely breathing.\n“And I held him in my arms until he took his last breath,” Heard said.\nEmergency medical technicians pronounced Spencer dead on the scene.\nHeard said Spencer was a good man.\n“He didn’t deserve it at all,” he said.\nA Chamblee police officer heard the gunshots, Capt. Ernesto Ford said.\nPolice are trying to determine what led to a deadly shooting at a gas station.\nThe shooter and the accomplice sped off in a gray or green Maserati Quattroporte, police said.\nThe officer followed a different car he thought was involved in the shooting.\nPolice are investigating a deadly shooting outside a Chamblee QuikTrip in the 4000 block of Buford Highway. BRANDEN CAMP / SPECIAL\nWhen he realized that car was not involved in the shooting, the officer returned to QuikTrip and found Spencer “with massive trauma to his upper chest,” Ford said.\nChamblee police are recovering video from the scene.\nNo arrests have been made.\nOther details were not released.","url":"https://www.ajc.com/news/dispute-over-hot-dog-buns-led-deadly-gas-station-shooting-victim-friend-says/pFeBgJH6l2C5p8nyizaUTP/"}
