{"authors":[],"date_download":"2018-10-22 21:07:14","date_modify":"2018-10-22 21:07:14","date_publish":"2014-05-06 01:24:29","description":"A civilian diver involved in searches for dozens of missing people from a South Korean ferry disaster died Tuesday","filename":"data/vaneerConsumption/DiversRecoverMoreBodiesinSouthKoreanFerry.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_south-korea-ferry-disaster_divers-recover-more-bodies-south-korean-ferry-n97786_1540242434.html","title":"Divers Recover More Bodies in South Korean Ferry","title_page":"Divers Recover More Bodies in South Korean Ferry","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA civilian diver involved in searches for dozens of missing people from a South Korean ferry disaster died Tuesday, as other divers helped by better weather and easing ocean currents were picking up efforts to retrieve bodies from the sunken ship.\nThe Sewol carried 476 people, most of them students from a single high school, when it sank off South Korea's southern coast on April 16. Only 174 survived, including 22 of the 29 crew members. The sinking left 260 people dead, with about 40 others still missing.\nOn Tuesday, one civilian diver died at a hospital after becoming unconscious, government task force spokesman Ko Myung-seok said in a statement.\nSouth Korea's Yonhap news agency later identified the victim as Undine Marine Industries employee Lee Kwang-oak, 53, and said he lost consciousness soon after entering the water at 6:05 a.m. He was later found floating about 25 meters (82 feet) deep, it said.\nThe news agency noted that the divers have been working in difficult conditions and have increasingly been suffering from exhaustion, with some of them treated for decompression sickness.\nAfter the incident, Prime Minister Chung Hong-won ordered the government rescue team to thoroughly check the health conditions of divers to safely proceed with the ongoing efforts, his office said.\nIn searching for the missing, divers have been working their way into the last three unopened rooms, next to a snack bar on the ferry's third floor, Ko told reporters.\nKo earlier said that the search team does not expect to find many bodies in those rooms as they were not assigned to the high school students who made up most of the ferry's passengers. The divers will revisit areas searched earlier, while checking other areas such as bathrooms on each floor, looking for more victims. Darkness, floating debris and the maze of corridors and cabins onboard have made the search difficult.\nInvestigators have separately made their first formal arrests of people who were not on board the Sewol when it sank. The three people arrested are suspected of negligence in their handling of cargo on the vessel.\nIn all, 19 people have been arrested in the investigation, 15 of them crew members accused of abandoning passengers. An executive with ties to Chonghaejin, the company that owns the ferry, was arrested on suspicion of malpractice related to company finances.\n- Associated Press","url":"https://www.nbcnews.com/storyline/south-korea-ferry-disaster/divers-recover-more-bodies-south-korean-ferry-n97786"}
