{"authors":[],"date_download":"2018-10-22 20:45:59","date_modify":"2018-10-22 20:45:59","date_publish":"2014-05-03 16:43:48","description":"The divers focused on six rooms previously unopened on the sunken Sewol ferry. The death toll is now up to 236, officials said.","filename":"data/vaneerConsumption/DiversSearchNewRoomsofSunkenFerryFindMoreBodies.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/418231/ferry-ejo-50314_449325f7d0793a48cc0645168b9824e6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_south-korea-ferry-disaster_divers-search-new-rooms-sunken-ferry-find-more-bodies-n96316_1540241159.html","title":"Divers Search New Rooms of Sunken Ferry, Find More Bodies","title_page":"Divers Search New Rooms of Sunken Ferry, Find More Bodies","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDivers focused on previously unopened rooms of the sunken South Korean ferry, pulling eight more bodies during a search effort Saturday hampered by strong currents.\n“It took a while to develop routes, but after the routes were developed to some degree, opening up the rooms and getting inside worked out in a short period of time,” emergency task force spokesperson Ko Myung-seok told The Associated Press.\nWith the search of six rooms on the third and fourth levels of the Sewol ferry, which capsized on April 16, the death toll in the disaster has risen to 236 victims. The number of missing passengers fell to 66.\nOfficials said they’ve finished searching 58 out of 64 passenger cabins inside the ship. Some of those rooms have been difficult to enter because they’re blocked by floating objects.\nIn the wake of the disaster, South Korean Prime Minister Chung Hong-won has resigned, and the surviving captain and 14 others have been detained on suspicion of negligence and abandoning passengers.\n— Erik Ortiz","url":"https://www.nbcnews.com/storyline/south-korea-ferry-disaster/divers-search-new-rooms-sunken-ferry-find-more-bodies-n96316"}
