{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-22 22:49:21","date_modify":"2018-10-22 22:49:21","date_publish":"2016-01-29 10:14:52","description":"Florida resident Alan Egan, originally from Greater Manchester in the UK, took the incredible pictures while he was 90ft under the surface off Tiger Beach in the Bahamas.","filename":"data/vaneerConsumption/Diversrisktheirlivesfeedingsharksbyputtingthemintrance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B1380B00000578-0-image-a-52_1454062365518.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422458_Look-eyes-Divers-risk-lives-hand-feeding-petting-potentially-deadly-tiger-sharks-putting-dream-like-trance_1540248561.html","title":"Divers risk their lives feeding sharks by putting them in 'trance'","title_page":"Divers risk their lives feeding sharks by putting them in 'trance' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"These terrifying pictures show the moment a daredevil diver holds a giant tiger shark in his hands - after placing the predator in a 'dream-like' trance.\nFlorida resident Alan Egan, originally from Greater Manchester in the UK, took the incredible pictures while he was 90ft under the surface off Tiger Beach in the Bahamas.\nDramatic images show divers stroking and soothing sharks and holding them still with their potentially deadly jaws just inches away.\nDaring: Terrifying pictures a daredevil diver holding a giant tiger shark in his hands - after placing the predator in a 'dream-like' trance\nAppetite: Florida resident Alan Egan, originally from Greater Manchester in the UK, took the incredible pictures while he was 90ft under the surface off Tiger Beach in the Bahamas\nRisky: They use a technique known as 'tonic immobility' - a procedure often used to calm sharks in order to remove hooks from their mouths or throat\nThey use a technique known as 'tonic immobility' - a procedure often used to calm sharks in order to remove hooks from their mouths or throat.\nOther pictures highlight the razor-sharp teeth inside both tiger and lemon sharks' mouths while the diver hand feeds them fish. They can also be seen playing with, petting and taking selfies with an array of different species.\nMr Egan, a 59-year-old service and warranty manager, said: 'We feed the sharks to show the public that they are not mindless killers but are gentle creatures that are misunderstood.\n'This experience was a total adrenalin rush and being this up-close always offers unique opportunities to get \"the money shot\".\nFeeding frenzy: The daring divers can also be seen playing with, petting and taking selfies with an array of different species\nDinner time: Other pictures highlight the razor-sharp teeth inside both tiger and lemon sharks' mouths while the diver hand feeds them fish\nSmile for the camera: One shark almost appears to be grinning as it approaches the camera. Mr Egan said the pictures show sharks 'are not mindless killers'\nHammer time: Another daredevil diver holds up a large fish as a hammerhead shark swoops to clutch the free dinner in its jaws\n'The shot showing the diver holding the nose of a shark was the start of a procedure called tonic immobility where the shark can be turned upside down and held on your hand. It is used for comforting them while we remove unwanted fishing hooks from the mouth and throat.'\nTiger sharks are one of nature's most effective hunters. They are known to attack humans, however they are thought to dislike the taste because they frequently swim away from the scene of an attack rather than devouring the victim.\nLemon sharks, so called because of their yellowish coloring, can grow up to ten feet in length and weigh as much as two hundred pounds.\nSoothing: Dramatic images show divers stroking sharks and holding them still with their potentially deadly jaws just inches away\nJaws: Mr Egan said the experience 'was a total adrenalin rush and being this up-close always offers unique opportunities to get \"the money shot\"'\nTiger sharks are one of nature's most effective hunters. They are known to attack humans, however they are thought to dislike the taste because they frequently swim away from the scene of an attack rather than devouring the victim\nThey are nocturnal feeders and track down their food by making use of the high concentration of electroreceptors in their heads to pick up of electrical impulses emitted by their prey.\n'The Lemons are fairly easy to work with but you have to pay attention not to move your hands too quickly as they are attracted by this, as well as contrasting colors, so dark wetsuits and black gloves are worn,' said Alan.\n'We can feed up to forty sharks at one time using discarded fish from local fishermen.'\n'When people see these shots they are instantly addicted. We work with a massive scope of divers from young divers to old ladies, who just cannot get enough of this adrenalin fix.'\nA diver watches on as a huge shark swoops past just inches away and grabs a half-eaten fish in its enormous jaws in another incredible picture\nJust when you thought it was safe: Pictures show the scale of the predators - including this tiger shark - that the divers were swimming with","url":"https://www.dailymail.co.uk/news/article-3422458/Look-eyes-Divers-risk-lives-hand-feeding-petting-potentially-deadly-tiger-sharks-putting-dream-like-trance.html"}
