{"authors":[],"date_download":"2018-10-30 14:24:14","date_modify":"2018-10-30 14:24:14","date_publish":"2015-01-20 00:00:00","description":null,"filename":"data/vaneerConsumption/DivorcingIslamfromIslamism.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_01_divorcing_islam_from_islamism_1540909454.html","title":"Divorcing Islam from Islamism","title_page":"Divorcing Islam from Islamism","title_rss":"NULL","source_domain":"americanthinker.com","text":"An op-ed by Quanta Ahmed, author of In the Land of Invisible Women: A Female Doctor's Journey in the Saudi Kingdom and 2014 Ford Foundation public voices fellow with the OpEd Project, advances the heartening thesis that Islam needs to be divorced from Islamism. It also pulls no punches in condemning the Obama administration’s unwillingness to identify Islamism as the driving force behind terrorism and empowering terrorists and terrorist organizations and regimes. She is both articulate and informed in her belief that the divorce is both necessary and doctrinally feasible. Would that it were so.\nPainful scenes have transfixed us as we watch in dismay our tongue-tied administration unable to name our nemesis. Owning the narrative is key in any ideological battle, and as President Barack Obama's administration struggles to name our enemy -- oscillating between \"radicals,\" \"extremists\" and \"terrorists\" -- Islamism in its variegated forms shows neither fear nor hesitation in declaring war.\nGoing back to her opening paragraph, it is also right on target, except, unfortunately, for the last clause.\nThe Charlie Hebdo massacre demands that we at last acknowledge that the secular pluralistic democratic world is imperiled by Islamism, the dastardly impostor of Islam.\nNote that she does not go on to present her case that Islamism is the dastardly imposter of Islam – and certainly we can all agree with the “dastardly”– but “impostor”?\nShe also nails it by pointing out that even if the Islamism disconnect of the Obama administration is meant to shield Islam, it has just the reverse effect of “sheltering it within Islam’s bosom”:\nIslamists -- whether violent as the Islamic State, al-Qaida in the Arabian Peninsula, Hamas and Hezbollah, or nonviolent as institutional Islamists -- do not represent Islam. By exposing them, Islam is shielded from blame for their heinous acts, an unwanted burden the faith has borne. (Those straitjacketed by politically correct aphorisms struggle to convince us otherwise.) In avoiding the term Islamism, we shelter it within Islam's bosom.\nThat statement should somehow be brought to the president’s attention. Another powerful point is made about the reverse effect of supporting creeping anti-blasphemy legislation to protect religious sensibilities, which “privileges Islamists – above all beliefs.” And then she notes tellingly that the elevation of Islamophobia by the current administration to the status of a cardinal sin has had the effect that “Islamism has evaded scrutiny through the powerful claims of Islamophobia – an Islamist creation to shield it from inspection.”\nThe question of whether Islam can be reformed has been and is a hotly debated issue among scholars and politicians. The problem is that if one relegates the violent supremacist passages of the Koran to being directed only to the historical situation facing the Muslims at the time, then there is very little left of atemporal significance. Some 60% of the Koran by some estimates commends violence and supremacism.\nBut certainly addressing Islamism, the ideology based, mistakenly or not, on the Koran, is a necessary first step.\nThe bottom line is that whether or not Islam can really be divorced from Islamism, it is strategically important to target Islamism as the ideological driving force and justification for violent jihadists. It is not just a drones-in-the-air and boots-on-the-ground war – it is also an ideological war.","url":"https://www.americanthinker.com/blog/2015/01/divorcing_islam_from_islamism.html"}
