{"authors":["Ann Powers"],"date_download":"2018-10-23 02:06:44","date_modify":"2018-10-23 02:06:44","date_publish":"2016-08-18 00:00:00","description":"On Wednesday night, during their first headlining tour in a decade, the Chicks showed off the many ways they've always been more than the usual Music City act.","filename":"data/vaneerConsumption/DixieChicksHostAJoyouslyDefiantGirlsNightOutInNashville.json","image_url":"https://media.npr.org/assets/img/2016/08/18/537492620_wide-d9d22ec748d28e427e024405713d59ad908318ea.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_therecord_2016_08_18_490497693_dixie-chicks-host-a-joyously-defiant-girls-night-out-in-nashville_1540260404.html","title":"Dixie Chicks Host A Joyously Defiant Girls' Night Out In Nashville","title_page":"Dixie Chicks Host A Joyously Defiant Girls' Night Out In Nashville : The Record : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Dixie Chicks Host A Joyously Defiant Girls' Night Out In Nashville\nEnlarge this image toggle caption Kevin Mazur/Getty Images for PMK Kevin Mazur/Getty Images for PMK\nNatalie Maines took one look at the wildly cheering fans in Nashville's Bridgestone Arena Wednesday night and knew just what to say. \"I like what you're wearing,\" she coyly remarked. It felt as if the singer could see every Southwestern-print skirt, pair of fringey ankle boots and vintage \"Cowboy Take Me Away\" t-shirt in the packed arena. This is what made a seemingly innocuous remark hit the mark sweetly and succinctly: Maines knows exactly who is making the first headlining Dixie Chicks tour in a decade one of the most successful live events of 2016. It's women. In Nashville, an eyeball estimate put the crowd at upwards of 80 percent female — maragarita-hoisting scrums of Vanderbilt undergrads, mothers with their tweens in tow, middle-aged women out with the running group or the book club. Some wrote \"Earl's in the Trunk\" on their back car windows (referring to \"Goodbye Earl,\" the band's comical 2000 hit about an abused woman's revenge) and drove hours to catch this show. Some said they'd never believed this chance to see their beloved Chicks would come again.\nAnd all sang along with a boisterous abandon that might have startled even Taylor Swift fans as the Dixie Chicks delivered a set designed to keep the feeling of recompense turned up high. There was no real mention of the price the band paid in 2003, after Maines' spontaneous protest against the Bush administration's impending invasion of Iraq (\"We're ashamed that the president of the United States is from Texas,\" the Lubbock-born singer told a London crowd) inspired conservative country radio stations to ban its music, earned death threats and, eventually, derailed the group. The show's only sign of partisanship, aside from some pre-show videos advocating for several progressive causes, was a now mildly notorious photograph of Donald Trump with devil horns, shown during the parade of mugshots on the video screen during \"Goodbye Earl.\" In fact, there was little banter at all; Maines did nearly all the talking, plucking lines from the past to ensure the night's heady arc continued apace. That one about how nice her fans look? A search of the archive on the Chickoholic fan site shows she's been using it for a decade.\nWho can blame Maines for sticking to script after being so roundly punished for speaking her mind? Besides, Dixie Chicks' music does the talking. This tour's set list reminds concertgoers that \"Not Ready To Make Nice,\" the unapologetic answer song the trio released after the Bush controversy (and an encore Wednesday), fits right in with a body of work that's all about staying independent and fighting inequity, albeit usually on a personal scale. From the rebel road song \"Lubbock Or Leave It\" to \"Sin Wagon,\" a giddy tale of post-breakup liberation, to \"Wide Open Spaces,\" about a daughter following in her mom's adventuring footsteps, Dixie Chicks songs dwell on the moments when the courage to go in a new direction overcomes dependence and doubt. Even the group's most beloved cover songs shore up this theme. In Nashville, the trio's pure and simple version of the Stevie Nicks-penned \"Landslide\" filled the arena like a women's national anthem. Maines dedicated it to the nine children the three Dixie Chicks have among them, reinforcing the message that women's self-determination need not contradict the family life their fans, many there with sisters or parents, so clearly value.\nNor does it have to derail a band's life, though anyone who knows this one's history recognizes that Maines's strong will might have made its long break inevitable, even without political controversies. The show balanced the musical interests she's pursued during the Chicks' hiatus with those of her bandmates, fiddler and mandolin player Martie Maguire and multi-instrumentalist Emily Strayer. Sisters Maguire and Strayer, who also lead the band Court Yard Hounds, are bluegrass-grounded virtuosos who gravitate toward the realms of country and classic rock, where crack players shine. In her own solo work, Maines has tended more toward eclectic, adult-oriented pop, covering Jeff Buckley and collaborating frequently with Ben Harper, whose jam-band anthem \"Better Way\" provided the Chicks with this show's final encore. Throughout the set Maguire and Strayer asserted themselves through effortlessly virtuosic solos and playful duels with members of their backing band. Meanwhile, Maines shone in moments showing her pop range: She memorialized Prince with a nearly Sinead O'Connor-worthy version of \"Nothing Compares 2 U\" and led the band through a version of Beyonce's \"Daddy Lessons\" that provided ample evidence that the Chicks could have inspired the Queen's foray into so-called country.\nSpeaking of country, this tour also stresses the ways the Dixie Chicks were always both more than and different from the usual Nashville act, leaving some of the band's twangier efforts on the cutting-room floor. With two additional guitarists and a keyboard player, the group nurtured melodic noise; uptempo rockers like \"Some Days You Gotta Dance\" highlighted roots in the Texas rock of Doug Sahm and Joe Ely. Not one but three covers of songs by Patty Griffin, the adventurous singer-songwriter who herself blends gospel and soul influences with folk and country, represented the trio's roots; an instrumental bluegrass song by Strayer and Maguire interpolated Beyonce's \"Single Ladies\" and the White Stripes' \"Seven Nation Army.\" And the show's end was pure Blue Man Group-style showbiz: As several of their kids took up instruments in the background, the three women banged the bejeezus out of a painted white trash can as rock 'n' roll noise hit the rafters. This happened not long after a Magic Mike XXL moment in which a male entertainer named Keith greeted Strayer, who'd just turned 44, with a giant birthday cake.\nBut that's the thing: In 2016, and in fact perhaps always, the spirit of the Magic Mike movies — of women claiming pleasure and personal power — is arguably more key to the significance of the Dixie Chicks than the spirit of Nashville tradition. Onstage Wednesday evening, the trio expanded upon the idea of the ultimate girls' night out, deepening its meanings by connecting this sense of female joy with purposefulness and social justice. Backstage, a photograph posted on Instagram shows, they hung out with other women who've also long stretched country's definitions: Shania Twain, whose massive '90s breakthroughs helped connect the genre to Top 40 pop, and Wynonna Judd, who's as much a rocker as she is a spinner of home truths. Maren Morris, whose 2016 album shows how country can seamlessly blend with the influence of R&B stars like Beyonce and Rihanna, was also reportedly at the show. This is the group's lineage. From rockabilly Rose Maddox in the 1950s to Chicks heirs Swift and Miranda Lambert today, women in one strain of country have long taken chances that reset the genre's boundaries, finding a freer sound to accommodate what they needed to say. It's a wide open space where the voices raised can hit the highest notes.","url":"https://www.npr.org/sections/therecord/2016/08/18/490497693/dixie-chicks-host-a-joyously-defiant-girls-night-out-in-nashville"}
