{"authors":["Associated Press"],"date_download":"2018-10-23 01:08:23","date_modify":"2018-10-23 01:08:23","date_publish":"2016-01-28 15:23:56","description":"MELBOURNE, Australia (AP) — Novak Djokovic called it the best he has ever played against old foe Roger Federer. Serena Williams was just being her dominant s...","filename":"data/vaneerConsumption/DjokovicWilliamswinAustralianOpensemifinals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d7445904905248b18e46c0ef9685f0e8-2vdWmEltwXfba0ce28e632a1f5de-381_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420258_Play-way-Day-11-Australian-Open_1540256903.html","title":"Djokovic, Williams win Australian Open semifinals","title_page":"Djokovic, Williams  win Australian Open semifinals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Djokovic, Williams win Australian Open semifinals\nMELBOURNE, Australia (AP) — Novak Djokovic called it the best he has ever played against old foe Roger Federer. Serena Williams was just being her dominant self.\nThe defending champions both made their way back to the Australian Open final, with Djokovic beating Federer 6-1, 6-2, 3-6, 6-3 and Williams defeating Agnieszka Radwanska 6-0, 6-4 on Thursday.\n\"I've had matches where I've played similar tennis,\" said Djokovic, the top-ranked player in the world. \"But I think against Roger, these first two sets have been probably the best two sets I've played against him overall throughout my career.\"\nNovak Djokovic of Serbia, right, and Roger Federer of Switzerland walk off the court after their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016. (AP Photo/Andrew Brownbill)\nHours earlier at Rod Laver Arena, Williams advanced to within one win of another Grand Slam milestone. If the six-time Australian Open champion wins Saturday's final against seventh-seeded Angelique Kerber, she will equal Steffi Graf's 22 major singles titles, a record in the Open era and the second-most in history behind Margaret Court's 24.\n\"I was able to do everything that I needed to do,\" Williams said of Thursday's match. \"I was really hitting just all the right shots, making little to no errors, which is kind of hard to play like that.\"\nDjokovic, a five-time champion at the Australian Open, advanced to his sixth final at Melbourne Park. He'll find out who his final opponent will be after Andy Murray takes on Milos Raonic on Friday.\nFor Federer, the signs were ominous from the beginning. Djokovic held his first service game at love and broke the 17-time Grand Slam champion in the second. After seven minutes, Federer was trailing 3-0.\nThe first set was over in 22 minutes. Most spectators — including a woman with a sign reading: \"Just Married But Willing to Exchange for Federer\" — were behind him, applauding Djokovic's service faults and giving Federer a standing ovation when he broke to go ahead 4-2 in the third set.\nThe end came quickly in the fourth. Djokovic broke Federer in the eighth game to go up 5-3 — not even a stunning down-the-line shot after he earlier chased down a lob on the same point could save the Swiss great.\nDjokovic held three match points in the next game and he clinched it when Federer netted a backhand. Djokovic, who won three Grand Slam titles last year, took a 23-22 edge in his 45 meetings with Federer.\n\"Definitely I've played unbelievable the first two sets but that's what is necessary against Roger,\" Djokovic said.\nAsked about the crowd support for Federer, Djokovic displayed Swiss-like diplomacy.\n\"When I play Roger it's something that is expected, in a way, considering his career and his greatness on and off the court,\" Djokovic said. \"He's loved. He's appreciated. He's respected around the world. For me it's normal in a way.\"\nFederer said he wasn't surprised by Djokovic's early blitz.\n\"I've seen Novak play this well before,\" he said. \"It's tough when it's from the start because obviously you got to try to stop the bleeding at some point. He can get one or two sets all of a sudden ... and it's tough to get back into it.\"\nIn the first semifinal match, Kerber ended Sydney-born British player Johanna Konta's surprising run with a 7-5, 6-2 win to reach her first Grand Slam final. Konta was the first British woman since 1983 to reach the semifinals at a major tournament.\nWilliams is the overwhelming favorite in the final, and not just based on recent form. She continued her perfect streak in seven Australian Open semifinals.\n\"I definitely block it out,\" Williams said in reply to a question about equaling Graf's mark. \"I was one off last year, too. If I don't win on Saturday, I'll still be one off.\"\nDespite all her success, it is a loss that is inspiring Williams in this tournament. She was two matches away from a calendar-year Grand Slam in 2015 when she lost to Roberta Vinci in the U.S. Open semifinals.\n\"Physically I'm feeling a lot better, mentally I needed that break after the Open,\" Williams said, but \"I didn't think I would do this well this fast.\"\n___\nAP Sports Writer John Pye contributed to this story.\nSerena Williams of the United States celebrates after winning a point against Agnieszka Radwanska of Poland during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Andrew Brownbill)\nRoger Federer of Switzerland wipes the sweat from his face during his semifinal match against Novak Djokovic of Serbia at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Andrew Brownbill)\nAgnieszka Radwanska of Poland plays a forehand return to Serena Williams of the United States during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Andrew Brownbill)\nRoger Federer of Switzerland answers questions at a press conference following his semifinal loss to to Novak Djokovic of Serbia at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)","url":"https://www.dailymail.co.uk/wires/ap/article-3420258/Play-way-Day-11-Australian-Open.html"}
