{"authors":[],"date_download":"2018-10-30 01:08:54","date_modify":"2018-10-30 01:08:54","date_publish":"2015-03-11 00:00:00","description":null,"filename":"data/vaneerConsumption/Doblacklivesreallymatter.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_do_black_lives_really_matter__comments_1540861734.html","title":"Do black lives really matter?","title_page":"Blog: Do black lives really matter?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Why hasn't Jamiel \"Jas\" Shaw II, 17, a standout Los Angeles student-athlete, gunned down for the color of his skin and the red of his Spiderman backpack, received a scintilla of the mainstream media attention paid to Trayvon Martin? Both were young black males of the same age when they were murdered. While the details of the Travyon Martin case have been highly publicized and are widely known in part due to President Obama's comment that \"if I had a son he would look like Trayvon,\" the Jamiel Shaw tragedy has been almost entirely ignored by the mainstream press. As there has been a groundswell and a grassroots campaign that \"black lives matter\" why aren't there protest marches and cries for justice for both of these virtually identical victims of homicide? Like Trayvon, Jamiel was walking home when he was shot in the stomach and head. However, the glaring difference in this situation... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/03/do_black_lives_really_matter__comments.html"}
r. Espinoza – a violent felon, had just served four months of an eight-month sentence for assault with a deadly weapon and battery of a police officer – killed Jamiel a day after Espinoza had been released from jail in May of 2008. Jamiel's hands were up, but it made no difference: Mr. Espinoza's head shot pierced the victim's hand.\nLast week, his aggrieved father, testifying in a Department of Homeland Security hearing in support of a bill, HR 1041, named in his son's honor, which would allow the FBI to track illegal alien criminal activity, said, “Do black lives really matter? Or does it matter only if you are shot by a white person or a white policeman?” In other words, shouldn't black lives always matter, and not only when it is politically expedient as a wedge issue to keep people stirred up, distracted, and divided along racial lines? My heart bleeds for the Shaw family. Why should they have to pay such a dear price for the national government's shirking its fundamental responsibility to finally, once and for all, secure the borders from the flood of aliens and stem the resulting chaos through proper enforcement of existing law? Bill sponsor Representative Walter Jones's efforts to move the bill forward have been repeatedly frustrated. This, despite Article IV, Section IV of the U.S. Constitution, which guarantees Americans protection against foreign invasion. It is ironic that the tentacles of government overreach seek to regulate and monitor almost every aspect of our lives in the name of \"security\" – in flagrant violation of state's sovereignty and personal privacy rights – but refuse to actually do the protecting.","url":"https://www.americanthinker.com/blog/2015/03/do_black_lives_really_matter_.html"}
