{"authors":["Mail Foreign Service"],"date_download":"2018-10-22 22:31:34","date_modify":"2018-10-22 22:31:34","date_publish":"2017-03-10 01:02:30","description":"In a case described as 'extraordinary' and 'unexplained' doctors in Canada have found brain activity, resembling deep sleep waves, in a patient ten minutes after they were declared clinically dead.","filename":"data/vaneerConsumption/Doctorsfindbrainactivitytenminutesafterdeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F17F100000578-0-image-a-12_1489107243990.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4299628_Doctors-brain-activity-ten-minutes-death_1540247494.html","title":"Doctors find brain activity ten minutes after 'death'","title_page":"Doctors find brain activity ten minutes after 'death' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Canadian doctors studied the heartbeat of four patients in intensive care after their life-support machines were switched off\nDoctors have found scientific evidence that people’s brains can continue to show signs of life after they have been declared clinically dead.\nA patient showed persistent brain activity for ten minutes after their heart stopped and experienced brain waves we normally get during deep sleep.\nCanadian doctors studied the brain activity and heartbeats of four patients in intensive care after their life-support machines had been switched off.\nBrain inactivity preceded the heart stopping in three out of the four cases.\nHowever, in one of the cases, single delta wave bursts persisted after the heart had stopped and the patient was clinically dead.\nWe normally get these brain waves in a deep sleep.\nDoctors in a Canadian intensive care unit described the case as extraordinary and unexplained.\nResearchers from the University of Western Ontario in Canada assessed electric impulses in the brain in relation to the beating of someone’s heart after life-sustaining therapy was removed.\nBrain inactivity preceded the heart stopping in three of the four cases.\nHowever, in one of the cases, the patient’s brain continued to work after their heart stopped.\n‘In one patient, single delta wave bursts persisted following the cessation of both the cardiac rhythm and arterial blood pressure (ABP),’ the researchers said.\nSingle delta wave bursts, often associated with deep sleep, were recorded ten minutes after a patient was declared clinically 'dead'\nThere was significant differences in electrical activity in the brain between the 30-minute period before and the 5-minute period after the heart stopped.\n‘It is difficult to posit a physiological basis for this EEG [brain] activity given that it occurs after a prolonged loss of circulation’, according to the paper which was published in the Canadian Journal for Neurological Science.\nThe experiment raises difficult questions about when someone is dead and therefore when it is medically and ethically correct to use them for organ donation.\nAs many as a fifth of people who survive cardiac arrests report having had an other-worldly experience while being ‘clinically’ dead.\nUp to a fifth of people who survive cardiac arrests report having had an other-worldly experience\nHowever, scientists say it’s far too early to be talking about what this could mean for the post-death experience - especially considering it was only seen in one patient.\nIn 2013, a similar phenomenon was found in experiments on rats whose hearts had stopped.\nThe research, which was published in the journal Proceedings of the National Academy of Sciences revealed rats had a burst of brain activity one minute after decapitation.\nThe pattern of activity was similar to that seen when the animals were fully conscious - except signals were up to eight times stronger.\nThe researchers said that the discovery that the brain is highly active in the seconds after the heart stops suggests that the phenomenon has a physical, rather than spiritual nature.","url":"https://www.dailymail.co.uk/sciencetech/article-4299628/Doctors-brain-activity-ten-minutes-death.html"}
