{"authors":["Associated Press"],"date_download":"2018-10-23 01:37:16","date_modify":"2018-10-23 01:37:16","date_publish":"2017-04-26 12:10:48","description":"DETROIT (AP) - A Detroit-area doctor and his wife accused in a female genital mutilation case are returning to court to find out if they can be released from...","filename":"data/vaneerConsumption/Doctorwifeingenitalmutilationcaseseekjailrelease.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464727-1493205055-349_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447310_Doctor-wife-genital-mutilation-case-seek-jail-release_1540258636.html","title":"Doctor, wife in genital mutilation case seek jail release","title_page":"Doctor, wife in genital mutilation case seek jail release | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DETROIT (AP) - A Detroit-area doctor and his wife accused in a female genital mutilation case are returning to court to find out if they can be released from jail.\nProsecutors are expected to ask a judge Wednesday to keep Dr. Fakhruddin Attar and his wife, Farida, locked up while their case winds through federal court.\nThey're accused of conspiring with another doctor who is charged with performing genital mutilation on 7-year-old Minnesota girls at a clinic. The Livonia clinic is owed by Dr. Attar. The government says he allowed Dr. Jumana Nagarwala to see young girls there after hours.\nFBI agents leave the office of Dr. Fakhruddin Attar at the Burhani Clinic in Livonia, Mich. Friday, April 21, 2017, after completing a search for documents. The investigation is connected to the case of Dr. Jumana Nagarwala, of Northville, charged with performing genital mutilation on two young girls from Minnesota. (Clarence Tabb Jr. /Detroit News via AP)\nGenital mutilation, also known as cutting, has been condemned by the United Nations and is outlawed in the U.S. Nagarwala and the Attars belong to a Muslim sect known as Dawoodi Bohra.","url":"https://www.dailymail.co.uk/wires/ap/article-4447310/Doctor-wife-genital-mutilation-case-seek-jail-release.html"}
