{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:49:16","date_modify":"2018-10-30 18:49:16","date_publish":"2015-07-21 12:19:49","description":"“Each dollar spent on fetal tissue transplants from aborted babies and embryonic stem cell research is a dollar not spent on expanding the success of adult stem cell therapies,\"","filename":"data/vaneerConsumption/DoctorsRefutePlannedParenthoodsDefenseItUsesAbortedFetalTissueForScientificProgress.json","image_url":"https://media.breitbart.com/media/2015/07/Nucatola-video.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_21__1540925356.html","title":"Doctors Refute Planned Parenthood’s Defense It Uses Aborted Fetal Tissue For Scientific Progress","title_page":"Doctors Refute Planned Parenthood’s Defense It Uses Aborted Fetal Tissue For Scientific Progress | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pediatric neurosurgeon and GOP presidential candidate Dr. Ben Carson says this week that Planned Parenthood’s claim that obtaining fetal tissue from abortions is important for medical and scientific research is “spurious.”\n“There’s nothing that can’t be done without fetal tissue,” Carson said on Fox News Channel’s The Kelly File. “[I]t’s been over-promised what the benefits of fetal research would be. And very much under-delivered.”\nYet, the promise of medical research was the defense given for the discussion by Planned Parenthood’s senior medical director, seen in an investigative video, describing how to abort a baby in such a way that allows its organs and body parts to be useful for sale to biomedical companies.\nEric Ferrero, the organization’s vice president of communications, asserted that Planned Parenthood donates aborted fetal tissue “to scientific research that can help lead to medical breakthroughs.”\nCarson, however, is not the only doctor who finds that “spurious.”\nDr. Michelle Cretella, president of the American College of Pediatricians (ACPEDS), actually goes one step further.\n“Let’s be clear: selling organs of aborted babies for fetal tissue research is unnecessary and prolongs human suffering,” she tells Breitbart News. “Fetal tissue research, like embryonic stem cell research, has failed to produce a single successful treatment for human disease, and both have been associated with significant side-effects including overgrowth of cells and the need for immunosuppressive chemotherapy.”\nCretella further explains:\nAdult stem cell research, in contrast, has yielded treatments for 73 different diseases including several forms of cancer, diabetes, Parkinson’s, cardiac disease, autoimmune illnesses and more. Adult stem cells do not overgrow or require immunosuppression, and most importantly, they do not require the killing of innocent human life.\n“Each dollar spent on fetal tissue transplants from aborted babies and embryonic stem cell research is a dollar not spent on expanding the success of adult stem cell therapies,” she adds.\nCretella also makes a sharp ethical distinction between fetal tissue and aborted fetal tissue.\n“While it is true that useful insights about fetal development, genetic defects and gene activation have been and can be gleaned from fetal tissue research, only research upon spontaneously miscarried infants is morally licit,” she said. “The bottom line is this: the slaughter of unborn infants in the womb described by Planned Parenthood’s Dr. Deborah Nucatola is blatantly immoral. It is a national disgrace that anyone – most especially a doctor – defends its practice.”\nAccording to a report in the New York Times, the National Institutes of Health spent $76 million in 2014 on research involving human fetal tissue, and will spend a similar amount this year. Researchers at universities associated with medical centers that perform abortions are able to obtain aborted fetal tissue easily, but private companies also broker sales by obtaining aborted baby tissue from abortion providers and selling it to researchers, as was described by Nucatola in the now-viral video.\nDr. Susan Fisher, director of the Human Embryonic Stem Cell Program at the University of California, San Francisco, told the Times, “These tissues are very valuable for studying human development and finding out what makes it tick.”\n“Can we reprogram cells in the same way to repair disease processes?” she continued. “Can we have a better understanding of the sort of haywire development that accompanies some tumors?”\nHowever, Arthur Caplan, director of medical ethics at New York University Langone Medical Center, told the Times he believes Planned Parenthood faces serious challenges in the realm of ethics regarding senior medical director Nucatola’s graphic description of the organization’s practices.\n“You cannot, must not, alter how or when you do an abortion simply to obtain tissues you want,” Caplan said. “Basically, the only concern is the health and safety of the mother.”\nAdditionally, he observed the appearance of potential conflicts of interest for the organization is considerable when it accepts fees for fetal tissue obtained from abortions performed in their facilities.\nFor further information about non-fetal and non-embryonic stem cell research visit the ACPEDS website.","url":"https://www.breitbart.com/politics/2015/07/21/doctors-refute-planned-parenthoods-defense-it-uses-aborted-fetal-tissue-for-scientific-progress/"}
