{"authors":["Caitlin Gallagher"],"date_download":"2018-10-30 23:55:00","date_modify":"2018-10-30 23:55:00","date_publish":"2014-08-12 21:33:43","description":"Earlier this month, the new Doctor Who Peter Capaldi graced the cover of Entertainment Weekly, where the magazine went in-depth with the Twelfth Doctor. The magazine asked showrunner Steven Moffat whether or not Capaldi's past appearances (not as…","filename":"data/vaneerConsumption/DoctorWhoPeterCapaldiSpoilersSayTheShowWillExplainHisPastRolesButHow.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bf3b7757-5ed2-4b9a-bb56-66e39ad9d719.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35354-doctor-who-peter-capaldi-spoilers-say-the-show-will-explain-his-past-roles-but-how_1540943700.html","title":"'Doctor Who' Peter Capaldi Spoilers Say The Show Will Explain His Past Roles, But How?","title_page":"'Doctor Who' Peter Capaldi Spoilers Say The Show Will Explain His Past Roles, But How?","title_rss":"NULL","source_domain":"bustle.com","text":"Earlier this month, the new Doctor Who Peter Capaldi graced the cover of Entertainment Weekly, where the magazine went in-depth with the Twelfth Doctor. The magazine asked showrunner Steven Moffat whether or not Capaldi's past appearances (not as the Doctor) within the world of Doctor Who would be acknowledged. Moffat's response? \"We're not going to make a big fuss about this because everyone knows he's the same actor ... but there's a neat little idea.\" A neat little idea, eh? The Doctor wouldn't ignore that detail — and neither shall I!\nThe Doctor is an alien Time Lord with the ability to regenerate, which means his body and personality change after he has suffered what would be a fatal blow to mere humans. When the reign of Matt Smith ended, the initial reactions to Capaldi as the next Doctor were mixed. Something that made the response more complicated was the fact that Capaldi has already been in the Whoniverse — twice.\nCapaldi appeared in Season 4 of Doctor Who in the episode of \"The Fires of Pompeii\" as marble merchant Lobus Caecilius and in Season 3 of Torchwood as John Frobisher. This is far from the first time that an actor in Doctor Who has doubled up (or tripled up in Capaldi's case) on roles. Martha Jones, Sixth Doctor Colin Baker, and Amy Pond (who was in the same episode as Capaldi) have all done it too.\nMoffat said that former showrunner Russell T. Davies is responsible for connecting why we've seen Capaldi in the world of Doctor Who before. I'm not going to even begin to act as if I am a fraction of clever or creative as the writers of Doctor Who, but I figured I'd give a shot to guessing what this \"neat little idea\" is.\nLet's start by looking at Capaldi in \"The Fires of Pompeii.\" Rarely does the Doctor change fixed points in time (which the destruction of Pompeii is considered one of them), but his companion at the time, doesn't-take-no-for-an-answer Donna Noble, tried to convince him to try to save Caecilius's family and the city.\nDrwhobaddalek21 on YouTube\nDonna's persistence ended up paying off. After the pair discovers the Pyroviles — an alien species with plans to destroy the planet — are in the city, the Tenth Doctor discovers he has to choose to save Pompeii or the Earth. He, of course, chooses to save the world and we find out that the Doctor actually caused the eruption of Mount Vesuvius (they don't teach you that in history class). So he didn't actually mess with a fixed point in time — his actions were the fixed point in time.\nWhovians have seen the Doctor make exceptions to his own rules time and time again, but changing a fixed point is a pretty big deal. So the real turning point came when he decided to save the family that had helped him and Donna in this adventure. Could it be that the Tenth Doctor felt a bond with Caecilius? (Just watch the intensity those homeboys share starting at 1:38).\nDrwhobaddalek21 on YouTube\nTennant's Doctor had a time when he turned himself human and couldn't remember that he was a Time Lord (Martha and a fob watch containing his true identity brought him back). Could the same type of thing have happened to Capaldi's Doctor? Caecilius did buy the TARDIS off the streets of Pompeii because he admired it and called it modern art. Perhaps only a true Doctor could love the TARDIS that much and he is subconsciously aware of his true identity.\nIt's an interesting theory, but I somehow doubt the show will repeat the same plot point. Another idea could be tied into what happens after the Doctor saves the family. It is rare for the show to follow the bit characters who were in the episode after the Doctor leaves them, but this one does. In the last scene of the episode, we actually see a fast forward to Caecilius and his family in Rome.\nDrwhobaddalek21 on YouTube\nMaybe the link will have to do with the fact that the Doctor and Donna are his family's household gods. Or maybe because they were saved, there will be some sort of paradox. Or maybe the Doctor will regenerate as someone's face he remembered (can he do that??).\nBut these theories conveniently ignore Capaldi's role in the Doctor Who spinoff Torchwood.\nBBCWorldwide on YouTube\nHis Torchwood role was much bigger than his Caecilius character, so it could complicate matters too much to try to explain it — especially since Moffat said specifically they weren't going to make a big fuss (ah, how much more British can he get?). But maybe Davies will use Captain Jack Harkness — who in the coolest turn of events was the Face of Boe — as the key to Capaldi's Doctor, and they'll ignore his appearance in the Pompeii episode entirely.\nWhatever happens, I can't wait to be proven absolutely wrong when Doctor Who returns for Season 8 of the reboot on Aug. 23 on BBC America.\nImages: Adrian Rogers/BBC America; mymindpalaceisatardis, katinkka, doctorwhogifs/Tumblr","url":"https://www.bustle.com/articles/35354-doctor-who-peter-capaldi-spoilers-say-the-show-will-explain-his-past-roles-but-how"}
