{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:49:10","date_modify":"2018-10-30 18:49:10","date_publish":"2015-11-09 18:16:57","description":"Doctors say Planned Parenthood’s claims of offering “women’s healthcare” and enabling fetal tissue research are deceptions.","filename":"data/vaneerConsumption/DoctorsPlannedParenthoodAllAboutDeceptionsonWomensHealthandFetalResearch.json","image_url":"https://media.breitbart.com/media/2015/09/texas-rally-to-defund-planned-parenthood-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540925350.html","title":"Doctors: Planned Parenthood All About Deceptions on Women’s ‘Health’ and ‘Fetal Research’","title_page":"Doctors: Planned Parenthood All About Deceptions on Women’s ‘Health’ and ‘Fetal Research’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Physicians tell Breitbart News that Planned Parenthood’s claims its primary focus is “women’s healthcare” and that it harvests fetal organs to enable medical breakthroughs are deceptions.\nMiami-based radiologist Dr. Grazie Pozo Christie says: “It takes a special kind of blindness to see Planned Parenthood Federation of America (PPFA) as a benevolent, charitable society. They are interested in their very healthy bottom line, made so by abortion, which is ultimately an act of hopelessness and abandon.”\nPozo Christie, a member of the advisory board of the Catholic Association, participated in an event recently at the Heritage Foundation in Washington, D.C. As CNSNews.com reports, panelists discussed the impact the recent videos exposing Planned Parenthood’s apparent practices of selling the harvested body parts of unborn babies should have on Congress – compelling lawmakers to redirect funds from the abortion business to federally qualified healthcare facilities that do not provide abortions.\n“Planned Parenthood Federation of America is a giant organization that operates more than 700 ‘health’ centers in the United States,” Pozo Christie tells Breitbart News. “Some of their affiliates perform second and third trimester abortions, the kind that generate fetal tissue for research – and then sell that tissue to procurers.”\nWhat helps the economy? #BIRTHCONTROL ACCESS: Women w/ access to it are 20% more likely to go to college & make more $. #GOPDebate — Planned Parenthood (@PPact) October 29, 2015\nPozo Christie adds:\nCecile Richards admitted as much when she stated that the abortion chain would stop the practice. Some of the clinics that perform these abortions do not call themselves “Planned Parenthood,” but are closely associated nonetheless, receiving referrals for advanced pregnancies from the small Planned Parenthood clinics. They offer “funding” from the National Abortion Federation just like the other clinics do, which in turn is lavishly funded by donors like Warren Buffett, who also donates heavily to PPFA. They are all in it together, for the money and for the satisfaction of promoting their damaging ideology.\nDuring the Heritage event, Pozo Christie continued, “We know that Planned Parenthood has nothing to do with health care. What Planned Parenthood does is it promotes a new definition of health care, and they’ve done this very successfully.”\nThe physician explained Planned Parenthood has restricted the definition of “women’s healthcare” to mean sexual liberation, which has been a major goal of the feminist movement.\n“They have narrowed the idea of health care to mean something very small, which is the promoting or the enabling of one kind of what they consider the ideal life, the ideal woman, which is a life of sexual liberation where there are no consequences for pregnancy,” Pozo Christie said.\nRecently, Dr. Michelle Cretella, president of the American College of Pediatricians (ACPEDS), explained to Breitbart News that Planned Parenthood’s claim its organ-harvesting practices are to enable scientific research to facilitate medical breakthroughs” is another ruse.\n“Fetal tissue research, like embryonic stem cell research, has failed to produce a single successful treatment for human disease, and both have been associated with significant side-effects including overgrowth of cells and the need for immunosuppressive chemotherapy,” she said.\n“Adult stem cell research, in contrast, has yielded treatments for 73 different diseases including several forms of cancer, diabetes, Parkinson’s, cardiac disease, autoimmune illnesses and more,” Cretella added. “Adult stem cells do not overgrow or require immunosuppression, and most importantly, they do not require the killing of innocent human life.”\n“The bottom line is this: the slaughter of unborn infants in the womb described by Planned Parenthood’s Dr. Deborah Nucatola is blatantly immoral,” Cretella continued. “It is a national disgrace that anyone – most especially a doctor – defends its practice.”","url":"https://www.breitbart.com/politics/2015/11/09/doctors-planned-parenthood-deceptions-womens-health-fetal-research/"}
