{"authors":["Kalhan Rosenblatt For Dailymail.Com"],"date_download":"2018-10-23 02:57:17","date_modify":"2018-10-23 02:57:17","date_publish":"2016-01-29 17:45:07","description":"Evan Antin might be even cuter than the animals he saves. The exotic animal doctor is a former model and personal trainer and his pictures with cats, dogs and turtles are driving the Internet wild.","filename":"data/vaneerConsumption/DoctorEvanAntinbecomesanInstagramcelebrityforhispictureswithadorableanimals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B467BB00000578-0-image-a-70_1454088260880.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423123_Doctor-Evan-Antin-Instagram-celebrity-pictures-adorable-animals_1540263437.html","title":"Doctor Evan Antin becomes an Instagram celebrity for his pictures with adorable animals","title_page":"Doctor Evan Antin becomes an Instagram celebrity for his pictures with adorable animals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The vet has been helping animals all his life and said he's enjoying his\nEvan Antin, the sexiest veterinarian on the internet, might be even cuter than the animals he saves.\nThe 31-year-old California based exotic animal veterinarian became an internet sensation after he was named Sexiest Beast Charmer alive by People magazine in its 2015 Sexiest Man Alive issue.\nSince then the former model and personal trainer has earned 90,000 followers.\nDr Evan Antin, an exotic animal veterinarian from California, might be the sexiest veterinarian on the internet\nHe's gained thousands of followers on Instagram thanks to his snaps with adorable and exotic animals\nSnuggle up: The 31 year old is a veterinarian at Conejo Valley Veterinary Hospital in California\nThe doctor's favorite animals are snakes and alligators and he owns a Savannah monitor named Matilda\nEvan wrote on Instagram that he has been humbled by the amount of support he's received on social media\nYesterday Evan wrote on Instagram to thank his thousands of followers for their support and their love of animals saying: 'WOW!!! I am SO humbled and blown away by the fact that just 2 days ago I celebrated 10k followers and today I see that over 100k people share a passion for animals with me!\n'And people from ALL OVER the world!\n'I want to thank everyone for ALL THE SUPPORT! Thanks again and more animal posts to come.'\nEvan works at Conejo Valley Veterinary Hospital in Thousand Oaks, California, where he practices exotic medicine.\nHe says there he's just Dr Antin, but to the internet he's an animal lover's dream come true.\nCharmer: Sulcatta tortoises (pictured) often hide in their shell but this one was even charmed by Evan\nEvan has traveled to six continents and documents his travels and activism on YouTube\nHe even makes lizards seem cute!: Evan says he has a particular affinity for reptiles, but loves all animals\nEvan was named Sexiest Beast Charmer alive by People magazine in its 2015 Sexiest Man Alive issue\nEvan, 31, was formerly a model and a personal trainer but none of that has stopped his passion for animals\n'(The attention is) not totally foreign to me, but obviously this week has been particularly exciting.\n'I've been working with animals for years. I've done guest appearances on television shows for handling wild animals,' Evan told ABC news.\nThousands of people have gone crazy for his Instagram posts, which show him snuggled up to cats, posing with puppies and even holding water monitors and giant tortoises.\nEven this prickly African Porcupine is enamored with Evan, who said this was one of his favorite interactions\nEvan snuggles up to his cat Willy (pictured, left) and a friendly puppy (pictured, right)\nEvan is also a world traveler. He's been to six continents to help animals and promotes animal conservation on his YouTube channel.\nHe's helped elephants, orangutans and dragons in places like Australia and Tanzania.\nOne snap shows his petting a cat in Turkey saying: 'Getting in good w the locals...In fact I must say-I've met and tried to interact w cats all over the globe and for whatever reason these little Turkish cats are so much friendlier than any other street cats anywhere!?'\nAlthough he has a cat named Willy and a dog named Henry, Evan says his favorite animals are reptiles and his prized possession is a Savannah monitor lizard named Matilda.\nUnfortunately for the rest of us, he also has a fiancée.\nHuskies, malamutes and wolves make regular appearances on Evan's Instagram\nThis picture from 2007 shows Evan in Tanzania when he was still a student at Colorado State University\nHot date: Evan said he made regular television appearances before his internet fame","url":"https://www.dailymail.co.uk/news/article-3423123/Doctor-Evan-Antin-Instagram-celebrity-pictures-adorable-animals.html"}
