{"authors":["Breitbart Tech"],"date_download":"2018-10-30 21:30:58","date_modify":"2018-10-30 21:30:58","date_publish":"2017-01-28 18:13:23","description":"A new documentary claims that pornography has got \"uglier and nastier\" since the explosion of free-to-view internet sites like Youporn and Pornhub.","filename":"data/vaneerConsumption/DocumentaryPornTubeSitesThreatenChildrenandActors.json","image_url":"https://media.breitbart.com/media/2017/01/porn-site-leak-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_01_28__1540935058.html","title":"Documentary: Porn 'Tube' Sites Threaten Children and Actors","title_page":"Documentary: Porn 'Tube' Sites Threaten Children and Actors | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Paris (AFP) – A new documentary claims that pornography has got “uglier and nastier”, with actors forced to shoot more hardcore films for less since the explosion of free-to-view internet sites like Youporn and Pornhub.\n“Pornocracy”, made by Ovidie, a former French porn star turned director, claims that far fewer films are now being made and fees have been slashed up to 10-fold.\nShe blames “tube” sites — so-called because they resemble YouTube — which have been accused of hosting thousands of videos pirated from traditional adult entertainment companies.\nCritics say children are also getting their first exposure to sex through the sites.\nAnd they worry about the effect porn culture is having on the way teenage boys treat girls.\n“Tubes” are also blamed for making porn consumption so commonplace that last week London’s transport system was forced to warn that people who watched porn on buses and trains would be reported to the police.\nChildren’s campaigner Marie Derain, an advisor to the French women and families minister, said the exploitive nature of “tube” sites was extremely worrying.\n“Their economic model goes beyond even what is at stake in terms of pornography,” she told AFP.\n– Nearly all pirated –\nGregory Dorcel, who heads Marc Dorcel, Europe’s third-biggest adult entertainment group, said 95 percent of the 100 billion porn clips watched on the web last year were pirated.\nHis company alone has made five million requests to Google for its videos to be taken down from “tubes”.\n“But 48 hours later the videos are back online,” Ovidie said.\nHer documentary claims that a little-known company called MindGeek — headquartered in “an empty office” in Luxembourg — is now porn’s most powerful player, holding a monopoly-like grip on the industry.\nBut MindGeek, which prefers to be seen as a tech company, and makes no reference to porn on its website, told AFP that it operates only four “tube” sites — Pornhub, Youporn, RedTube and Tube8.\n“Claims that we dominate the industry are nonsense,” a spokeswoman said, saying that only three of its sites ranked in the top 10 of the world’s most visited adult sites.\nPornhub alone, however, is the 11th most viewed site in the US, just behind Wikipedia, Twitter and Instagram.\nMindGeek says it is simply a platform for its “1,000 content partners that upload content and benefit from the exposure on our sites”.\n“There is lot of misinformation about how tube sites function,” the spokeswoman said.\nShe said it followed YouTube’s lead on “managing the issue of copyrights”.\n“There is no room in our model for the assumption that content is pirated,” she added.\nShe claimed instead that they had “formed positive, symbiotic relationships with most of the major players in the industry”.\nMany traditional adult film makers dispute this, also complaining that while they are subject to strict regulations on age, the “tubes” can easily be viewed by children.\n– Kids see porn by 11 –\nThe French pressure group Ennocence, which is trying to make regulation of the “tubes” an issue in the country’s coming presidential election, said children now tend to first view porn at 11.\nIts president, Gordon Choisel, said they were being bombarded with adult images through internet adverts from a very young age.\n“You think your child is watching a cartoon but then a window pops up with porn,” he said.\nChoisel said governments had to attack the sites’ advertising streams. “We have to come up with legislation that is flexible enough to adapt to changes in technology and the way videos are being watched,” he said.\nDerain, author of a 2012 report on children’s viewing habits, said porn was shaping many young people’s view of sex.\n“Sexuality in real life is not like that,” she said, but children who have grown up watching “tubes” have trouble making the distinction.\n“I have been involved in a number of very serious criminal cases where boys have systematically done to girls what they saw on porn,” she said.\n“Pornocracy” also dealt with the explosion in “cam girl” sites and what Ovidie termed the “new proletariat of sex” who work long hours on them.","url":"https://www.breitbart.com/tech/2017/01/28/documentary-porn-tube-sites-threaten-children-actors/"}
