{"authors":["Abc News","More Mark"],"date_download":"2018-10-30 00:50:49","date_modify":"2018-10-30 00:50:49","date_publish":"2018-10-28 03:46:35","description":"Dave Roberts did not seem amused by the mid-game critique.","filename":"data/vaneerConsumption/DodgersmanagerDaveRobertsrespondstocriticismfromDonaldTrumpThatsonemansopinion.json","image_url":"https://s.abcnews.com/images/Sports/dave-roberts-ap-mo-20181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_dodgers-manager-dave_91eaa5f5cef8a9b497ac3e215d3051f6_story_id=58802334_1540860649.html","title":"Dodgers manager Dave Roberts responds to criticism from Donald Trump: 'That's one man's opinion'","title_page":"Dodgers manager Dave Roberts responds to criticism from Donald Trump: 'That's one man's opinion' - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Dodgers manager Dave Roberts received word of an unexpected critic following his team's loss to the Red Sox in Game 4 of the World Series: the president of the United States.\nThe Dodgers lost the crucial game, 9-6, and fell behind 3-1 in the series. Los Angeles blew a 4-0 lead in the game -- a point not lost on the leader of the free world.\n\"It is amazing how a manager takes out a pitcher who is loose & dominating through almost 7 innings, Rich Hill of Dodgers, and brings in nervous reliever(s) who get shellacked,\" Trump tweeted to his 55.4 million followers. \"4 run lead gone. Managers do it all the time, big mistake!\"\nWatching the Dodgers/Red Sox final innings. It is amazing how a manager takes out a pitcher who is loose & dominating through almost 7 innings, Rich Hill of Dodgers, and brings in nervous reliever(s) who get shellacked. 4 run lead gone. Managers do it all the time, big mistake! — Donald J. Trump (@realDonaldTrump) October 28, 2018\nThe manager-in-chief's words of wisdom were received with skepticism from Roberts.\n\"The president said that?\" Roberts asked reporters when told of the tweet in his postgame press conference. \"I'm happy he was tuning in and watching the game. I don't know how many Dodgers games he's watched. I don't think he was privy to the conversation. That's one man's opinion.\"\nHill had thrown 91 pitches and 6 1/3 innings of shutout ball when Roberts removed him from the game. The L.A. bullpen proceeded to surrender nine runs, including one credited to Hill.\nRoberts has been manager of the Dodgers since 2016. He holds a record of 287-200 in the regular season and 23-18 in the postseason. He had taken the Dodgers to back-to-back World Series for the first time since 1977-78.\nAP\nBoston manager Alex Cora dismissed Trump's criticism as well.\n\"Dave Roberts is a good manager,\" Cora responded before leaving the podium.\nCora is a native of Caguas, Puerto Rico, and was critical of the president's response to Hurricane Maria, which devastated the island in 2017.\n\"To be tweeting about 3,000 people [dying] and being efficient, it's actually disrespectful for my country,\" Cora told Mass Live in September after Trump questioned the hurricane's death toll. \"We see it that way. I know he probably doesn't feel that way.\"\nCora was wearing a T-shirt that read \"Proud for Puerto Rico\" during the press conference on Saturday.\nChuck Burton/AP\nAs a Yankees fan, Trump was likely rooting against the Red Sox, as well. He was close friends with late Yankees owner George Steinbrenner and may also have some lingering resentment for Roberts, whose stolen base against New York in Game 4 of the 2004 American League Championship Series set up a historic Red Sox comeback and the team's first title in 86 years.\nTrump doesn't tweet about baseball much -- Saturday's tweet was sandwiched between praise for conservative commentator Dinesh D'Souza and condemnation of the shooting at a synagogue in Pittsburgh -- but of course he's made attacking the NFL a hallmark.","url":"https://abcnews.go.com/Sports/dodgers-manager-dave-roberts-responds-criticism-donald-trump/story?id=58802334"}
