{"authors":[],"date_download":"2018-10-22 21:38:55","date_modify":"2018-10-22 21:38:55","date_publish":"2014-06-04 17:48:59","description":"Bored kids complaining about how “there’s nothing to do” this summer need look no further than their neighborhood app store.","filename":"data/vaneerConsumption/DoEducationAppsKeepKidsSharporJustPluggedIn.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/487751/140604-child-tablet-1501_0f395707d105442d89185116e382a913.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_do-education-apps-keep-kids-sharp-or-just-plugged-n122581_1540244335.html","title":"Do Education Apps Keep Kids Sharp or Just Plugged In?","title_page":"Do Education Apps Keep Kids Sharp or Just Plugged In?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBored kids complaining about how “there’s nothing to do” this summer need look no further than their neighborhood app store.\nAmazon launched a new personalized summer math program through its Kindle earlier this week, joining competing tablet makers Apple and Google, in a race to own the education market and hook kids who will someday grow up and have money of their own. App developers too are taking advantage of the exploding ubiquity of mobile devices, and parental fears of “summer learning loss.” Even mobile carriers encourage parents to keep their kids mobile-engaged over vacation.\nBut experts are divided on whether more “screen time” benefits the growing minds of children more than summer downtime.\nWhen considering whether mobile apps are the best solution for keeping little Johnny and Jane intellectually engaged after the final bell, grown-ups would be wise to ask a few questions, advises Alfie Kohn, author of “The Myth of the Spoiled Child: Challenging the Conventional Wisdom About Children and Parenting,” and other books on and child development and education.\nAdults should question whether the purpose of educational apps is “really to help children become deeper thinkers and more excited learners or for purveyors of these apps to make a buck,\" Kohn told NBC News.\nAnd make a buck they do. Mobile learning games earned $1.5 billion in 2013, and will likely hit $2.3 billion by 2017, according to Ambient Insight. The market research company also reports that over 31 percent of apps found in major app stores are geared towards early learning. And parents are eating it up.\nMore than half of parents in the United States have downloaded educational apps for their children in 2013, according to a report from Common Sense Media, a not-for-profit advocacy. And 43 percent of U.S. kids often use educational apps, the survey also found. Common Sense Media, which touts “media sanity, not censorship” in the digital age, encourages the use of educational apps over the summer -- within reason.\n“Students lose up to two months of grade equivalency over the summer,” Shira Lee Katz, Senior Director of Educational Content at Common Sense Media, said, citing an article by the National Summer Learning Association.\n“At the beginning of the next school year, teachers may spend more than a month” bringing kids back up to speed, she told NBC News.\nThat may be true, Kohn told NBC News, but it's not dire as it sounds. Kids losing brain power is a hot topic this time of year, one adults are “ predisposed to embrace because we’re already nervous about time off for children,\" Kohn wrote in a 2012 article “Lowering the Temperature on Claims of \"Summer Learning Loss.”\nMostly though, kids fall behind in their ability to take standardized tests, Kohn told NBC News. But time off provides time to develop abstract thought and explore ideas learned during the school year, he said.\nWhat’s more, the American Academy of Pediatrics recommends that parents keep a tight reign on the amount kids spend in front of a screen -- not just TV, but cellphones and tablets too. Learning difficulties, along with sleeping and eating disorders, are all associated with excessive media use, according to the AAP, which suggests parents establish “screen free” zones at home.\nCommon Sense Media also encourages intellectual stimulation beyond apps. “Students do have workbooks, worksheets and textbooks they may be assigned over the summer to keep them up to speed,” Katz said. But like sunburns and hours of “Brady Bunch” reruns, mobile interaction is now an inevitable part of summer vacation for many.\nAs Common Sense Media Summer Learning Guide notes, \"Whether your kids' summer days are jam-packed with activities or left wide open for leisurely exploration -- or something in between -- chances are some of those days will involve a smartphone, tablet, or other device.\"\nWith app reviews broken down by age range and summer-specific subjects that encourage engagement with the world (and not just the mobile device), the guide focuses on kids using apps with their parents or friends, Katz said.\nSome apps help kids identify and share plants and animals they find in their neighborhood, while others enforce basic math and science concepts through games. Each is rated on a variety of areas, including privacy, content and whether kids will be tempted to bug mom and dad for “in-app” purchases to “level up.”\nKohn, however, encourages activities without digital devices. Teaching kids basic arithmetic, for example? Bake a cake with your parents and measure the ingredients, or figure out how many miles you can ride on your bike, Kohn suggested.\n\"Don’t sit there looking at a phone.”","url":"https://www.nbcnews.com/tech/gadgets/do-education-apps-keep-kids-sharp-or-just-plugged-n122581"}
