{"authors":["Megan C. Hills"],"date_download":"2018-10-31 01:41:37","date_modify":"2018-10-31 01:41:37","date_publish":"2018-08-28 09:33:53","description":"Celebrity Big Brother fans have had their eyes fixed on Chloe Ayling and Jermaine Pennant ever since that game of spin the bottle. If you didn't catch the episode or need a little refresher, allow me to fill you in: Dan Osborne dared the footballer…","filename":"data/vaneerConsumption/DoesChloeAylingHaveABoyfriendCelebrityBigBrothersJermainePennantHasAdmittedHeLikesTheModel.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/8eeae504-38c4-4663-8632-6b2b81084306-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_does-chloe-ayling-have-a-boyfriend-celebrity-big-brothers-jermaine-pennant-has-admitted-he-likes-the-model-10199349_1540950097.html","title":"Does Chloe Ayling Have A Boyfriend? 'Celebrity Big Brother's Jermaine Pennant Has Admitted He \"Likes\" The Model","title_page":"Does Chloe Ayling Have A Boyfriend? 'Celebrity Big Brother's Jermaine Pennant Has Admitted He \"Likes\" The Model","title_rss":"NULL","source_domain":"bustle.com","text":"Celebrity Big Brother fans have had their eyes fixed on Chloe Ayling and Jermaine Pennant ever since that game of spin the bottle. If you didn't catch the episode or need a little refresher, allow me to fill you in: Dan Osborne dared the footballer to lick the inside of the model’s thigh and, well, he did it. Given that Jermaine is married, it got me thinking: does Chloe Ayling have a boyfriend?\nI reached out to her agent, but haven't heard anything back just yet. So, I decided to do a little digging instead. According to my research, it looks as though Chloe is well and truly single at the moment.\nShe previously dated carpet fitter Conor Keyes, with whom she shares two-year-old son Ashton. The pair met her on holiday in Spain in 2014 and were in an on-off relationship for two years, according to the Daily Star. However, the publication reports that the pair broke up six months before Chloe gave birth to Ashton.\nShe recently opened up to her housemate Hardeep Singh Kohli about her son and troubled relationship with Conor. OK! magazine reports that she told him that \"the father hasn’t been there since birth\" and that they \"don’t speak.\"\nBig Brother UK on YouTube\nIt certainly seems like the former couple has a tricky relationship, as Conor publicly criticised Chloe last year for reportedly not contacting their child after her safe return from her six-day kidnapping ordeal. According to the BBC, kidnapper Lukasz Herba released Chloe after discovering she had a child. However, Conor told the Daily Star that she had \"not yet been in touch\" with Ashton several weeks after she returned to the UK. He told the paper: \"She can come and see [Ashton] whenever she wants to, but the thing is I am still waiting for her to do that.\"\nBustle has reached out to her rep for a comment, but they are yet to respond.\nFollowing her kidnapping ordeal, Chloe was linked to Britain's Got Talent judge David Walliams. According to the Daily Mail, the pair met up after he liked a number of her photos on Instagram. However, neither confirmed the speculation when I reached out for comment.\nStuart C. Wilson/Getty Images Entertainment/Getty Images\nAs for now though, it does look as though Chloe is single. In fact, she even hinted before entering the Celebrity Big Brother house that she's \"open\" to meeting someone on the show, but draws the line at getting intimate on-camera.\nChloe told The Sun: \"I’m open to finding romance in the house. I haven’t had a relationship since before the kidnapping ordeal, I’m looking for someone I can trust and someone with a good sense of humour. I’m up for kissing them, but that’s as far as I would go on camera. I wouldn’t have sex or do anything under the covers. I want an older man who is more mature, in his thirties, I’ve gone for that in the past.\"\nWell, at the ripe age of 35-years-old, Jermaine is certainly older in Chloe's eyes, however, I must stress again that he is married to Alice Goodwin (below), and has been since 2014. So romance rumours about he and Chloe are actually problematic AF, and can't be nice at all for his wife.\nStill, that hasn't stopped fans from speculating as to whether there’s something brewing between Chloe and Jermaine. And he hasn't exactly done much to silence those rumours either. On Sunday, the former Liverpool footballer admitted for the first time that he likes Chloe. He said: \"I'll confess that I like Chloe. She's a lovely girl, it's very bad, yeah, you shouldn't you know. But she's a nice girl, I would say, she's probably the most attractive girl in the house.\"\nBut is romance actually going to blossom between the pair? On Jermaine’s head be it, if so. As his wife apparently gave him some strong words of warning about his behaviour before he headed into the house.\nAccording to The Sun, she told him, \"You better not cheat!\" She also specifically name-dropped Stormy Daniels, who was previously set to appear on CBB before backing out at the last minute. His wife continued, \"You better behave. I don't want to be waiting for you and Stormy when you get out.\"\nGiven that Alice and Jermaine will be celebrating their fourth wedding anniversary this year, I personally think these rumours about he and Chloe need to be shut down ASAP. Jermaine, you should really lead the way with this one, hun.","url":"https://www.bustle.com/p/does-chloe-ayling-have-a-boyfriend-celebrity-big-brothers-jermaine-pennant-has-admitted-he-likes-the-model-10199349"}
