{"authors":["Samantha Martin"],"date_download":"2018-10-30 22:38:56","date_modify":"2018-10-30 22:38:56","date_publish":"2014-08-14 20:40:36","description":"When you're as hot as Taylor Blackburn, the people want, nay, need to know your marital status. The 27-year-old megahunk plays Caleb Rivers on the ABC Family hit Pretty Little Liars and its spin-off Ravenswood (which you should be watching). Caleb…","filename":"data/vaneerConsumption/DoesPLLsTylerBlackburnHaveaGirlfriendYepItsNotAshleyBenson.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/00952cae-5537-4fc1-80d0-a4ec13acb93f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35842-does-plls-tyler-blackburn-have-a-girlfriend-yep-its-not-ashley-benson_1540939136.html","title":"Does ‘PLL’s Tyler Blackburn Have a Girlfriend? Yep & It’s Not Ashley Benson","title_page":"Does ‘PLL’s Tyler Blackburn Have a Girlfriend? Yep & It’s Not Ashley Benson","title_rss":"NULL","source_domain":"bustle.com","text":"When you're as hot as Taylor Blackburn, the people want, nay, need to know your marital status. The 27-year-old megahunk plays Caleb Rivers on the ABC Family hit Pretty Little Liars and its spin-off Ravenswood (which you should be watching). Caleb may be dating Ashley Benson's character Hanna on the show, but — shield your eyes, \"Haleb\" devotees — Blackburn and Benson are not hooking up offscreen. That said, Tyler Blackburn does have a girlfriend IRL who suuuuuure looks a lot like her.\nThe couple was first spotted smooching while vacationing with Benson, her boyfriend — and, incidentally, Justin Bieber's former \"swagger coach\" — Ryan Good, and fellow PLL star Shay Mitchell in Maui. The woman attached to the actor's lips was but a mysterious blonde hottie until Blackburn revealed her identity by tagging @lolohoovs on an Instagram shot.\nThere isn't much information about Blackburn's lady friend floating around the ether, but we do know that her full name is Lauren Hoover. Based on an IMBb search, she doesn't appear to be involved in the entertainment industry. Maybe she's the sole heiress of the vacuum fortune! Or a descendent of our 31st United States president! Oh, the possibilities...\nOne thing we do know for sure is that she does indeed resemble Blackburn's onscreen girlfriend. As a refresher, here's Ashley Benson...\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\n...and here's Lauren Hoover.\nCrazy, right?! Homeboy's got a type.\nImages: Instagram (2)","url":"https://www.bustle.com/articles/35842-does-plls-tyler-blackburn-have-a-girlfriend-yep-its-not-ashley-benson"}
