{"authors":["Brandi Neal"],"date_download":"2018-10-31 01:39:59","date_modify":"2018-10-31 01:39:59","date_publish":"2018-09-01 17:50:22","description":"When someone says \"look,\" and shows you some weird thing, you may see something completely different than others viewing the same object. Case in point, people on Twitter are hashing out whether a post by @rebeccareilly__ is a picture that shows a…","filename":"data/vaneerConsumption/DoesThisPictureShowABeachOrADoorTheInternetCantDecide.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/1/1add90d2-f88b-4a4d-9a67-c4d4c1d5fda0-beach_door.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_does-this-picture-show-a-beach-a-door-the-internet-cant-decide-11478087_1540949999.html","title":"Does This Picture Show A Beach Or A Door? The Internet Can't Decide","title_page":"Does This Picture Show A Beach Or A Door? The Internet Can't Decide","title_rss":"NULL","source_domain":"bustle.com","text":"When someone says \"look,\" and shows you some weird thing, you may see something completely different than others viewing the same object. Case in point, people on Twitter are hashing out whether a post by @rebeccareilly__ is a picture that shows a beach or a door. The internet can't decide, and according to a study published in the Journal of Neuroscience, it's because of the way the human brain processes sensory information. So whether you see a beach or a door in this tweet — without knowing what it really is — is largely subjective. At first glance, the photo looks like a landscape shot of beach turned vertical.\nHowever, it could also be a super trendy door. Kind of like the kind Alice falls through in Alice in Wonderland. It could also just lead to someone's house because painting doors is not an obscure thing that only happens after consuming a bunch of edibles. @rebeccareilly__ posted a survey with her tweet, and 54 percent of respondents chose door versus beach. People feel pretty strongly about their decisions on both sides of the door-beach divide, and it's setting off the biggest online argument since that whole Yanny and Laurel debate earlier this summer.\nAccording to the study, \"top-down signals from association areas aid in context-dependent perception of visual scenes by altering the response properties of individual neurons.\" What's more, what you see depends on associations your brain makes with your previous experiences. So, if you spend a lot of time at the beach, clearly this is a photo of the beach. But, if you live in an area full of colorful doors — like Morocco — how can it be anything other than a door? Check out these tweets before you decide. You're probably going to change your mind eleventy-million times, and then you're going to need a nap.\n1 A Perfect Illusion Who knew that such a simple question could inspire such a debate? I see both a beach and a door depending on the context of the photo.\n2 I Mean, It's Clearly A Door This could legit be a door to any yoga studio in Los Angeles.\n3 Some People Want To Kill The Door Dream With so little to believe in these days, there's no harm in letting people believe this is a door. However, some people are determined to prove the door people wrong by sharing their expertise and pesky Photoshop facts. Hey, blow up the picture, lay it over a door, and it's a door. Just sayin'.\n4 It's Whatever You Want It To Be OK, if you really think about it, everything can be anything. When you were a kid you likely used household items for other things. Like, pillows and blankets aren't actually forts. But, if that's what you want them to be, they're totally forts. Confused yet?\n5 Especially If There's Alcohol Involved I think this person meant to say \"door\" instead of \"bar.\" However, if you're looking at this photo at the bar, with enough tequila it could be Lady Gaga's latest red-carpet dress.\n6 If You Weren't Confused Enough ... Beach people, this might make you change your minds. This is obviously a door. While many people are arguing that no one would have a blue and green door, Google images says otherwise. Clearly people think colorful doors are cool AF. And, Google knows everything, so the door people are the clear winners here.","url":"https://www.bustle.com/p/does-this-picture-show-a-beach-a-door-the-internet-cant-decide-11478087"}
