{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:44:20","date_modify":"2018-10-30 23:44:20","date_publish":"2014-08-13 13:42:12","description":"Real identity has been a big source of conversation in the Big Brother house this past week since Frankie revealed that he is Ariana Grande's brother and a YouTube celebrity. It is understandable why he decided to keep this part about his life…","filename":"data/vaneerConsumption/DoesAnyoneKnowBigBrotherDerrickIsaCopOneHouseguestHasSomeSuspicions.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/eb1de9b7-a57f-47a1-be94-377271b0e940.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35239-does-anyone-know-big-brother-derrick-is-a-cop-one-houseguest-has-some-suspicions_1540943060.html","title":"Does Anyone Know 'Big Brother' Derrick Is a Cop? One Houseguest Has Some Suspicions","title_page":"Does Anyone Know 'Big Brother' Derrick Is a Cop? One Houseguest Has Some Suspicions","title_rss":"NULL","source_domain":"bustle.com","text":"Real identity has been a big source of conversation in the Big Brother house this past week since Frankie revealed that he is Ariana Grande's brother and a YouTube celebrity. It is understandable why he decided to keep this part about his life quiet during the game, he didn't need a bigger target on his back than he already had just by walking into the house. Houseguests have been hiding their real identities or jobs for years. Often, they lie about their professions if they warrant a lot of education or a lot of money, just so people don't go talking about how they are smarter than they may seem, or how they don't need the money. There is another houseguest inside the Big Brother 16 house lying about his true profession, so the question is: do any of the houseguests know that Derrick is actually a police officer?\nI spoke to Week 5 evictee Amber Borzotra and when asked if she had any idea that Derrick wasn't really a parks and recreation coordinator she says, \"No, he's so good at it. I never suspected that he was hiding anything.\"\nBut do any of the other houseguests suspect anything? Frankie, who is a pro at hiding secrets in the house, actually suspected Derrick was a cop.\nObviously Christine didn't think much of it, but now that Frankie suspects Derrick, that could lead to a snowball of Derrick's true identity coming out. Funny enough, Derrick was one of the most offended people during Frankie's announcement that he had lied about his real identity. Derrick felt that if he wasn't lying about anything outside the house (which to be clear, he is), then he would expect others to do the same. Whether this was an immediate reaction to the news, in fear that he might be exposed, or he truly believes his own Big Brother identity, only time will tell.\nIf Derrick were to tell anyone in the house of his true identity, it would probably be his closest buddy and fellow Hitman, Cody. But Derrick doesn't seem like someone who believes in sharing superfluous information, so I wouldn't be surprised if the houseguests were completely in the dark about Derrick's cop identity until the game was over. If Derrick's control over the house at this point in the game is any indication of when they'll find out, they'll never know.\nImage: CBS","url":"https://www.bustle.com/articles/35239-does-anyone-know-big-brother-derrick-is-a-cop-one-houseguest-has-some-suspicions"}
