{"authors":[],"date_download":"2018-10-30 14:31:31","date_modify":"2018-10-30 14:31:31","date_publish":"2018-07-17 16:03:59","description":"The Piedmont Park Conservancy’s second Dog of the Year Contest is once again welcoming submissions. Last year, a 2-year-old Doberman named Ponce emerged victorious over more than 80 dogs.","filename":"data/vaneerConsumption/DoesyourpuphavethechopstobePiedmontParksDogoftheYear.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/WSBTV/2017/08/07/Videos/4146855.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_does-your-pup-ha_2888367795f7d63d99fae8c744d33795__1540909891.html","title":"Does your pup have the chops to be Piedmont Park’s Dog of the Year?","title_page":"Does your pup have the chops to be Piedmont Park’s Dog of the Year?","title_rss":"NULL","source_domain":"ajc.com","text":"When people see your dog, do they say “woof” — not in a playful way, but how people do when something is particularly awful or repulsive?\nNo?\nThen you might want to consider entering this contest.\nThe Piedmont Park Conservancy’s second Dog of the Year Contest is once again welcoming submissions. Last year, a 2-year-old Doberman named Ponce emerged victorious over more than 80 dogs.\nPonce was Piedmont Park's inaugural Dog of the Year.\nPhoto submissions will be accepted here until July 27, and then the public will vote with likes from Aug. 1 to Aug. 8. The six finalists will compete during an in-person contest, at 11 a.m. on Aug. 11, at the Midtown dog park.\nDuring that portion of the contest — at which owners must present proof of rabies vaccination — pets will sit for the owner, walk with them and show off for up to 30 seconds of free play.\nThe winning dog will win four prizes: the superlative title from August 11 until July 31, 2019; entry to this year’s Splish Splash Doggie Bash; entry to next spring’s Doggie Dash 5K; and a photo shoot that will supply the park’s nonprofit with promotional images.\nREAD | Soccer team helps save man after massive heart attack in Piedmont Park\nREAD | Atlanta cops looking for man seen kicking cat in Instagram video\n[Insert text here]\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/does-your-pup-have-the-chops-piedmont-park-dog-the-year/Lz0zyoaRfV1erbTmIF6KWO/"}
