{"authors":[],"date_download":"2018-10-30 18:41:21","date_modify":"2018-10-30 18:41:21","date_publish":"2017-01-18 19:25:00","description":"The Atlanta area is still sore after President-elect Donald Trump trashed Congressman John Lewis’ fifth district. Now this.","filename":"data/vaneerConsumption/DoesGeorgiasafecitieslisthaveloveforDeKalbNo.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/07/20/Images/photos.medleyphoto.10626772.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_does-georgia-saf_6f634d19a6b97f170a13017665f59608__1540924881.html","title":"Does Georgia 'safe cities' list have love for DeKalb? ... No.","title_page":"Does Georgia 'safe cities' list have love for DeKalb? ... No.","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta area is still sore after President-elect Donald Trump trashed Congressman John Lewis’ fifth district.\nNow this:\nA website called SafeWise dropped a list ranking Georgia’s 50 “safest cities,” and DeKalb County is hardly mentioned.\nOnly Brookhaven and Decatur cracked the top 50. Brookhaven was no. 29. Decatur was hanging on by the skin of its historic square and gastropubs at No. 42.\nThe site says its ranking includes only cities with 4,000-plus residents. That would include every DeKalb city but Avondale Estates, Lithonia and Pine Lake.\nThe presumptive arbiters of the website say the “backbone” of the ranking is FBI data.\nWhile DeKalb didn’t do well, other metro Atlanta counties did.\nBut here’s the good news, Dekalb:\nOne time some other website said Decatur is good for small business. Another said DeKalb had good spots to raise a family.\nOh, and the federal government said DeKalb is home to one of the best schools in America.\nDeKalb might be OK after all.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/does-georgia-safe-cities-list-have-love-for-dekalb/JBUKHo3OHR3w5RYAcgwvSP/"}
