{"authors":[],"date_download":"2018-10-30 00:59:12","date_modify":"2018-10-30 00:59:12","date_publish":"2016-06-24 00:00:00","description":null,"filename":"data/vaneerConsumption/DoesSenatorChrisMurphyRememberFastandFurious.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_06_does_senator_chris_murphy_remember_fast_and_furious_comments_1540861152.html","title":"Does Senator Chris Murphy Remember Fast and Furious?","title_page":"Articles: Does Senator Chris Murphy Remember Fast and Furious?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Democratic Sen. Chris Murphy, one of those who believe that we are just one sensible gun restriction and loophole closing away from the lion not considering the lamb dinner, thinks Orlando was the fault of those wascally Wepublicans he says want to sell guns to bad guys like the Islamic State. As the Washington Post reports: The leader of last week’s 15-hour Senate filibuster to force action on guns said Monday that Democrats need to make gun control an “integral” part of their national security policy as they try to build a political movement to rival the National Rifle Association. The message, Sen. Chris Murphy (D-Conn.) said in an interview with Washington Post reporters, should be that Republicans are partially culpable for attacks such as the Orlando nightclub shooting. “We’ve got to make this clear, constant case that Republicans have decided to sell weapons to ISIS,” Murphy said, using an alternative term for the Islamic State... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/06/does_senator_chris_murphy_remember_fast_and_furious_comments.html"}
rror gap, refusing to pass bans on assault weapons, are allowing these weapons to get in the hands of potential lone-wolf attackers. We’ve got to make this connection and make it in very stark terms.”\nWell, Sen. Murphy, the only time any U.S. officials ever tried to funnel weapons to terrorists and other bad guys was when the Democratic President Barack Hussein Obama and then-Attorney General Eric Holder conceived and ran a gunrunning operation called Fast and Furious which resulted in the deaths of U.S. Border Patrol agents Jaime Zapata and Brian Terry. Investors Business Daily editorialized on ATF Special Agent John Dodson’s attempt to spread the truth on the Obama administration’s effort to supply Mexican drug lords with semiautomatic weapons:\nATF Special Agent John Dodson is a national hero who in 2011 blew the whistle on Operation Fast and Furious, the Obama administration's gun-running operation to Mexico. Testifying before Congress, he disclosed that his supervisors had authorized the flow of semiautomatic weapons into Mexico instead of interdicting them, weapons that found their way into the hands of Mexican drug cartels with deadly results. Dodson has put his intimate Fast and Furious knowledge into a book titled \"The Unarmed Truth.\" It provides the first inside account of how the Obama administration permitted and helped sell some 2,000 guns to Mexican drug cartels, guns used in the murder of two federal agents and hundreds of Mexican citizens.. … The operation was exposed when Brian was killed in December 2010 by an illegal immigrant working for the Sinaloa Cartel near Nogales, Ariz., just 10 miles from Mexico. Two Fast and Furious weapons were found at the murder scene. Two such weapons also were used to murder Immigration and Customs Enforcement Agent Jaime Zapata in Mexico on Feb. 15, 2011, came from suspects who were under ATF watch but not arrested at the time…. \"Allowing loads of weapons that we knew to be destined for criminals, this was the plan. It was so mandated,\" Dodson, then attached to the Bureau of Alcohol, Tobacco, Firearms and Explosives' (ATF) Phoenix office, testified before Rep. Darrell Issa's House Government Reform and Oversight Committee on June 15, 2011. \"Rather than conduct enforcement actions, we took notes, we recorded observations, we tracked movements of these individuals for a short time after their purchases, but nothing more,\" Dodson testified. \"Knowing all the while, just days after these purchases, the guns that we saw these individuals buy would begin turning up at crime scenes in the United States and Mexico, we still did nothing.\"\nDemocrats like Chris Murphy did their best to hide the truth about Fast and Furious, with AG Holder arguably lying to Congress about his knowledge and involvement and repeatedly saying he “didn’t get the memo.” American citizens and Mexican nationals to this day are in jeopardy from criminals using weapons the Obama administration funneled to them. As Fox News reported about Mexican drug kigpin “El Chapo”:\nA .50-caliber rifle found at Joaquin \"El Chapo\" Guzman’s hideout in Mexico was funneled through the gun-smuggling investigation known as Fast and Furious, sources confirmed Tuesday to Fox News. A .50-caliber is a massive rifle that can stop a car or, as it was intended, take down a helicopter…\nFederal law enforcement sources told Fox News that ‘El Chapo’ would put his guardsmen on hilltops to be on guard for Mexican police helicopters that would fly through valleys conducting raids. The sole purpose of the guardsmen would be to shoot down those helicopters, sources said.\nThe Orlando shooter, Omar Mateen, as ABC’s Jake Tapper explained to Sen. Murphy, legally obtained his weapons, and not from the GOP. Tapper also got Murphy to admit is anti-gun amendments he pushed during a 15-hour filibuster, would not have prevented the Orlando shooting:\nIn a shocking development in the push for gun-control, Senator Chris Murphy, who filibustered for 15 hours regarding the issue, admitted Sunday on ABC’s This Week that his proposal would not have stopped any recent mass shooting. “Your proposal would have done nothing in the case of Orlando, it would have done nothing to stop the killing in San Bernardino,” stated ABC’s Jon Karl calling out Murphy, “And in fact, it was unrelated to the killing in Newtown.” The proposal Murphy has been pushing is one that is meant to close the mythical “gun show loophole.” “Would that have done anything to stop the massacre in Orlando,” Karl asked Murphy. The Senator tried to explain that his proposal had to work in conjunction with other proposals to be effective. Karl again called out Murphy by pointing to the fact that terrorist Omar Mateen didn’t purchase his firearms at a gun show and passed a background check anyway. “So why -- why are we focusing on things that have nothing to do with the massacres we're responding to,” Karl grilled Murphy.\nNo, Senator Murphy, the Republicans are not selling weapons to ISIS, nor did they sell anything to Omar Mateen. The Obama administration you support did sell guns to bad guys that got Americans killed and you have said nothing to condemn it. You apparently share the desire of your party leader and president to leave Americans, and your constituents, defenseless, before armed predators. We’ll listen to you and your colleagues when you submit a bill to make the White House, the Senate, and the House of Representatives gun-free zones.\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/06/does_senator_chris_murphy_remember_fast_and_furious.html"}
