{"authors":[],"date_download":"2018-10-30 01:11:40","date_modify":"2018-10-30 01:11:40","date_publish":"2018-09-08 00:31:46","description":"According to Vox (please note that I begrudgingly cite it as a reliable source), the bookies in Las Vegas have made a list of their top five bets on who just might be behind the ridiculous New York Times op-ed piece by an “anonymous senior Trump Administration official.” At the top of their list is none other than Vice President Mike Pence. Unfortunately, as absurd as this entire ordeal has been, the fact that Pence is being fingered is both unsurprising and entirely believable.","filename":"data/vaneerConsumption/DoesMikePenceHaveItOutforTrump.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Donald_Trump__Mike_Pence_29302369541.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861900.html","title":"Does Mike Pence Have It Out for Trump?","title_page":"Does Mike Pence Have It Out for Trump?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"According to Vox (please note that I begrudgingly cite it as a reliable source), the bookies in Las Vegas have made a list of their top five bets on who just might be behind the ridiculous New York Times op-ed piece by an “anonymous senior Trump Administration official.” At the top of their list is none other than Vice President Mike Pence. Unfortunately, as absurd as this entire ordeal has been, the fact that Pence is being fingered is both unsurprising and entirely believable.\nTo be fair, though, Pence categorically denied his involvement in the penning of the op-ed. Although, his denial was strange: no one was seriously thinking Pence was the culprit when he made the announcement. Yet, the vice president seemed to almost enthusiastically jump-up-and-down, screaming, “I didn’t do it!” as soon as it was published. Maybe it’s nothing, but maybe it’s something. After all, when a robbery occurs at a neighbor’s home, I don’t go running into the street reassuring the neighborhood that I didn’t do it.\nLet me also preface my remarks by stating that I have been an avowed supporter of Mike Pence. I was born in Indiana and I share Mike Pence’s Christian faith. Unlike most of the rest of the country, I supported then-Governor Pence’s anti-abortion and anti-gay marriage stances in Indiana. Like Pence, I also believe that the GOP must get more serious about fighting the Culture War than it has been. And, I have prayed with both the vice president and his wife at my church in Northern Virginia.\nSo, believe me when I say that I pray that the suspicions about the vice president being responsible for the reprehensible New York Times op-ed — written by an anonymous person — are wrong. But, the claims against Pence are worth a deeper exploration because, if true, the accusations against Pence (whether explicit or implicit) might help to explain why Trump has had such difficulty getting his more controversial policies implemented (outside of tax cuts and foreign conflicts).\nThe Failing New York Times Doesn’t Want to Fail Harder\nHowever low our opinion of the New York Times may be, in its 166-year history, the Gray Lady has only ever published an op-ed by an anonymous writer on a handful of extraordinary occasions. What’s more, it has never published something that reads like a manifesto for a pending coup d’état. The only reason the “failing” New York Times would print such garbage is not only that it consists of partisans who loathe Donald Trump, but also because the anonymous writer is someone big. There are only a few people in Washington, D.C. who would qualify as “big enough” to risk worsening the New York Times’ already-failing reputation.\nWhile Secretary of Defense James Mattis and Chief of Staff John Kelly appear to have some reservations about Trump, I find it hard to believe that such former Marines would waste their time engaging in silly innuendo in the press as the anonymous writer of the New York Times op-ed piece did. They’d likely — and we know that Kelly certainly has — voice their displeasure with the president to Trump’s face. And, whatever may be going on behind the scenes, it seems that Secretary of State Mike Pompeo has a true friendship with the president and is generally content with his boss.\nThe bookies in Vegas also suspect people, such as Education Secretary Betsy DeVos, the much-maligned (by Trump) Attorney General Jeff Sessions, and Homeland Security chief Kirstjen Nielsen (to list just a few of the 18 suspects). And, while many of the names listed would have reasons to challenge Trump in the way that the anonymous writer did, the language of the op-ed sounds like that of Mike Pence.\nNot Onboard the #MAGA-Train From the Start\nMike Pence is not a member of the Trump coalition. As a congressman representing Indiana, Pence sat on the most hawkish side of the neoconservative wing that dominates the Republican Party. In fact, he was described once as a “hawk’s hawk.” Writing in the Hill last year of what a President Pence foreign policy would look like, Hady Amr and Steve Feldstein said that it would “mean re-adopting a ‘values agenda,’ with a greater emphasis on human rights, democracy and development that would be closer in line with President George W. Bush’s policies.”\nNeed we forget that Mike Pence endorsed Ted Cruz in the Republican primary? That was a strange affair because Pence’s support for Cruz was tepid. Like many, I just assumed it was because Trump’s candidacy resonated with the base, and Pence believed that as well. Yet, on second thought, if the fears about Pence having been behind this ridiculous op-ed piece are correct, then his support for Cruz in the primary was a classic move politicians make when uncertain of what will best benefit their careers: they hedge. Pence’s endorsement was 80 percent pro-Cruz and 20 percent sympathetic to Trump (just enough support for Trump, as it would turn out, for Trump to nominate Pence as his VP).\nAlthough, his presence on the Trump presidential ticket does not necessarily mean an endorsement of Trumpism. It simply means that Pence wants to remain close to the unpredictable president. Staying in his good graces means mouthing the pieties of the #MAGA agenda, but not necessarily embracing them.\nIn fact, setting aside the gutless nature of the anonymous op-ed, the New York Times article embodies much of the ideals that the current vice president has spent his life cultivating. For instance, the op-ed goes to great lengths to point out that Trump’s “impulses are generally anti-trade and anti-democratic.” While that has been a continual complaint out of the usual left-wing whiners on television and in the press, this opinion is shared by many “traditional” figures in the “conservative” movement — of which Pence is a long-standing member.\nWhat’s more, just to prove their “conservative” bona fides, the unnamed author explains that the root of their problem with Trump — their boss — is that the president “shows little affinity for ideals long espoused by conservatives: free minds, free markets and free people.” The anonymous writer also celebrated the “bright spots” of “effective deregulation, historic tax reform, a more robust military.”\nSuch language could easily have come from erstwhile neocon Bill Kristol (or Peter Wehner or Michael Gerson, as my anonymous colleague at The American Spectator recently speculated). As a matter of fact, in January of this year, Kristol advocated for the vice president to “be prepared” for having the presidency wrested from Trump’s hands should the president’s “craziness escalate.” Further, Peter Wehner likened Pence’s actions as vice president as akin to the “butler who cleans up the spilled milk and rug stains” for President Trump rather than to an actual political partner.\nShocking words, since Pence once ran in the same circles as Kristol, Wehner, et al. It’s very possible that Vice President Pence has simply had enough of cleaning up what a “true conservative” might see as an insuperable mess in the form of Donald Trump’s presidency. Earlier in the year, a controversial article appeared in the Atlantic that profiled Pence. In the piece, several of Pence’s fraternity brothers from college were interviewed. One of them, Dan Murphy (who now teaches at Pence’s alma mater) said of Pence:\n“Somewhere in the midst of all that genuine humility and good feeling, this is a guy who’s got that ambition. Is Mike’s religiosity a way of justifying that ambition to himself?”\nThis is a theme that has played out for most of Pence’s adult life, according to the Atlantic article. In fact, Pence does appear to have some sense of destiny that I’ve only ever seen in another Republican president: George W. Bush. I hope that this sense of purpose is simply on-the-level; the sign of a good man who has been catapulted into the role of senior statesman. Then again, it might be that Pence is partaking in an effort to undo what most up here in Washington view as a vulgar presidency.\nOf Pens and Funerals Being Mightier Than Twitter\nThen, the anonymous whiner in the New York Times piece admonished that “All Americans should heed [the final words of the late Senator John McCain] and break free of the tribalism trap, with the high aim of uniting through our shared values and love of this great nation.” McCain has weighed heavily on the minds of America’s bipartisan, democratic globalist, ruling elite. His was not so much the passing of a legendary senator as it was the end of an era in which the democratic globalists reigned supreme. And, naturally, Vice President Pence was the most prominent Trump Administration figure to eulogize the late senator.\nSpeaking at the McCain funeral, Pence wistfully claimed:\nIn every generation, there are those who put country first, who prize service ahead of self, who summon idealism from a cynical age.\nNow, compare this vacuous and sentimental language to the similarly airy (and utterly useless) words anonymous espoused in the recent New York Times op-ed:\nThere is a quiet resistance within the [Trump] administration of people choosing to put country first [emphasis added]. But the real difference will be made by everyday citizens rising above politics, reaching across the aisle and resolving to shed the labels in favor of a single one: Americans.\nSome have argued that the article was ghostwritten. Most printed and spoken works of modern politicians are ghostwritten. And, even if Pence didn’t order the op-ed himself, one cannot help but wonder if it was someone speaking on his behalf. Whoever they may be, anonymous is totally channeling Mike Pence. The anonymous writer further moralizes that, “The root of the problem is the president’s amorality. Anyone who works with him knows he is not moored to any discernible first principles that guide his decision making.”\nWhile I would prefer to have a president who possesses the unshakeable faith of Job, I’m electing a politician, not a pastor, to the presidency. And, whatever positive impact the anonymous writer and their fellow “resistance” members in the “Deep State” may believe they’ve had in the Trump Administration’s successes, they’ve actually not contributed to the victories of the Trump Administration — of which, there are many.\nOn the contrary, they’re working to slow and stymie the unbelievable pace that President Trump has attempted to enact his truly conservative and patriotic policies. Just remember: it was the late Senator McCain (and his “amen!” corner in Washington, D.C.) who prevented the ultimate overturning of the disastrous Affordable Care Act.\nIs Nothing Sacred?\nThere’s another thing that worries me about this theory: some have questioned why a man of such devout faith as Pence would do something so duplicitous. Again, like Pence, I am deeply Christian and have attended the same church that the vice president occasions. I know that his is a real faith. But, as the Bible teaches, no one is perfect. Especially someone who is a politician. Remember, Pence is the man who, in 1990 ran what is still considered to be one of the “nastiest congressional races” in the Hoosier state’s political history, according to McKay Poppins of the Atlantic.\nWhat’s more, Pence might believe he’s trapped between a rock-and-a-hard-place.\nThink about it: he’s reached the pinnacle of his career, but it has (in his eyes and the eyes of so many status quo officials) been under a turbulent presidency. As anonymous wrote in the op-ed, there has been much that “free market conservatives” (such as anonymous) could be proud of during the Trump years. But, these successes have been “drowned out” by Trump’s shenanigans (in the eyes of Conservative, Inc.). Many years of careful dedication have led to Pence’s rise from radio pundit in Indiana to the second-highest-office in the land. Now, there is a chance that he could salvage the mess his boss is making of things. He could put the “steady” back in the “steady state” that anonymous spoke so fondly of.\nRemember, Kellyanne Conway is on the record as saying of Pence that his “faith allows him to subvert his ego to the greater good.” That sounds less like a ringing endorsement of Pence’s alignment with Trump on matters of substance and more like barely willing accomplice. And, what happens when the person “subverting” their ego no longer believes that supporting President Trump is for “the greater good”?\nOne can hear a degree of sanctimony in the writing of the New York Times op-ed that implies anonymous and his comrades believe they are uniquely placed to “save” our hallowed institutions. If the speculation is true about Pence, then, the op-ed sounds as though it were written by someone who has spent a career in “conservative” politics resolving to “save” the movement (and the country) from the mad grips of an “amoral” leader, such as Trump.\nIt’s Machiavellian because the entire exercise is designed to manipulate the government away from the voters so that the elite’s preferred picks rise to the top. For the record, the only reason Pence would be the elite’s favored selection for president would be that they assume that they can easily defeat Pence in 2020. This assumption might prove to be wrong, but it is something that many on the Left believe (without Trump’s name appearing before Pence’s on the ballot in 2016, his career would have ended in Indiana).\nThe Most Machiavellian Thing I’ve Ever Seen…\nThe New York Times op-ed also makes copious, favorable references to the 25th Amendment of the United States Constitution, which would allow for the president’s cabinet to remove him from office and be replaced by the vice president. So, if the rumors about Pence’s involvement with the op-ed were true, Pence (or one of his aides) was effectively arguing for himself to be made president. Now, while that may sound like the most Machiavellian thing you’ve ever heard, just remember that Mike Pence told a reporter in the days leading up to the 2016 presidential election that his vice-presidency would be modeled after the vice-presidency of his friend, Dick Cheney.\nWhatever one’s opinion about Cheney (I happen to respect but disagree with him), his was one of the most controversial (and substantive) vice-presidencies in the history of America. Cheney was more like a prime minister in the first term of the George W. Bush Administration than he was a placeholder figure, like most vice presidents have historically been. Publicly claiming that he wanted to be like Dick Cheney as vice president was quite a statement and many believed it indicated Pence’s intentions for his time in office.\nAs was speculated when Pence first became vice president, there would be an immediate push for the Pence neoconservative wing to overtake the Trump policy shop (which, at the beginning, was run almost-exclusively by the Steve Bannon-Mike Flynn nationalist wing of the Trump team). The nationalists have been steadily replaced over the last year by policy officials who more closely comport with Pence’s lifetime’s worth of globalist policies.\nPence is also the reason that retired U.S. Army General Mike Flynn was removed from his post as national security adviser. Flynn’s dismissal is believed to have been, in part, responsible for Trump’s firing of the disgraced former FBI Director, James Comey, which precipitated the launching of Robert S. Mueller, III’s special counsel investigation into any illicit ties between the Trump Campaign and Russian intelligence. In all of this, few remember that it was never proven that Flynn actually lied to Pence about anything.\nIn ridding the administration of Flynn (and other fellow travelers), the nationalist wing was weakened relative to the globalist wing. As Flynn was excised from the administration, U.S. Army General H.R. McMaster became the Trump Administration’s national security adviser. The Trump-McMaster pairing was always a point of contention, as McMaster belonged to the globalist-McCain wing of the Washington Establishment, and was visibly apprehensive about Trump’s nationalist-populism. Yet, McMaster and Pence worked far better together (and shared a common worldview) than did Pence and Flynn.\nCharting the Deep State\nFor all of the dismissals of the “Deep State,” there is ample evidence proving that such an entity does exist. While it might not be a tightly knit conspiracy against the president (and, more importantly the average Americans who voted for that president), it does exist and its members do share a common goal: remove the president who is both an offensive reminder of their inability to control events, as well as a threat to their livelihoods. The events this week reinforce this concept.\nThe truly sad thing is that the fusion of the Reagan Democrat working-class coalition with the Christian base was a winning coalition for Trump (and it was a vital group to cobble together in order to revitalize America’s ailing political culture). Removing Pence would secure Trump’s flank in the White House, although, who would replace him? Unfortunately, however, should my fears be proven correct about Pence, then Trump has to dump him going into 2020.\nPersonally, I’d nominate Senator Rand Paul (R-KY) as the next vice president. He represents a smaller share of the Republican base (the Libertarian wing), and he won’t galvanize the Christian base as strongly as someone like Pence. But the Christians will come out for Trump-Paul. Plus, Senator Paul’s support among Millennials might help to bring the youth vote out for Trump. Also, Paul has a strong record of support and a healthy working relationship with the president.","url":"https://spectator.org/does-mike-pence-have-it-out-for-trump/"}
