{"authors":["Quinn Keaney"],"date_download":"2018-10-30 23:24:21","date_modify":"2018-10-30 23:24:21","date_publish":"2014-08-13 19:27:02","description":"The Selfie Queen that is Kim Kardashian stopped by Bravo's Watch What Happens Live to have a nice little kiki with Andy Cohen on Aug. 12, and ended up providing the world with a few particularly juicy soundbites. During Cohen's entertaining \"Plead…","filename":"data/vaneerConsumption/DoesKanyeWestUnderstandKimKardashian5FictionalConversationstoDissect.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0b4e5a83-de24-4a99-baf6-5e65cbe3b94b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35635-does-kanye-west-understand-kim-kardashian-5-fictional-conversations-to-dissect_1540941861.html","title":"Does Kanye West Understand Kim Kardashian? 5 Fictional Conversations to Dissect","title_page":"Does Kanye West Understand Kim Kardashian? 5 Fictional Conversations to Dissect","title_rss":"NULL","source_domain":"bustle.com","text":"The Selfie Queen that is Kim Kardashian stopped by Bravo's Watch What Happens Live to have a nice little kiki with Andy Cohen on Aug. 12, and ended up providing the world with a few particularly juicy soundbites. During Cohen's entertaining \"Plead The Fifth\" segment of the show, where he asks celebs three tough questions and they're only allowed to pass on one, he cut right to the chase about the ongoing Twitter feud that's been developing between the Kardashian Klan and Adrienne Bailon, former Cheetah Girl actress and ex-flame of Rob Kardashian. After the reality star cleared up any ill-will she might have against Bailon (blah blah blah boring), Kim moved on to a far more interesting subject: her hubby, Kanye West.\nCohen helpfully steered their convo into a direction that would finally reveal, once and for all, if even Kim knows what the hell Kanye has been ranting about lately.\n\"Nothing that he says would embarrass me,\" Kim said. \"There [are] sometimes when he would talk about something that I might not understand the point that he's really trying to get across and I really understand it after the fact. I totally believe in him and what he's saying. It's really cool to see that he just speaks the truth. I respect his rants. I like what he says.\"\nKim, I'm sorry, but that's BS. No one understands Kanye, okay? NO ONE. I'm not even sure that Kanye understands Kanye. There are only so many times someone can be forced to listen to their husband going on and on (and on, and on, and on) about marble toilets, Karl Lagerfeld, or the fact that HE DOES NOT HAVE AN INSTAGRAM. It makes me wonder, though, if there are things Kim can't stop ranting and raving about that go right over Kanye's head. Is such a thing possible? Does an omniscient musical genius like Kanye automatically understand everything, or does something like self-tanner totally escape him? Let's explore.\nHypothetical Kim Kardashian Rant #1\nKim: \"I just don't understand how, like, everyone in the world doesn't use contouring make-up. It literally just doesn't make sense to me. How can someone go through life without having cheekbones like this, or eyeshadow applied in this shade, or...\"\nKanye:\nHypothetical Kim Kardashian Rant #2\nKim: \"Are pale people still a thing anymore? I thought that stopped in like 2007. Everyone should be tan. Evolution should have made all people come out tan by now. I mean, seriously, Kanye, can you believe that? Can we do something about that? Call Obama, babe. Please, we've got to get someone on this...\"\nKanye:\nHypothetical Kim Kardashian Rant #3\nKim: \"The public just doesn't understand what it's like having a butt like this. It's unbelievable, Kanye! Do you know how many things I've knocked over with it today? I thought North was going to have a concussion when she ran into it, I swear. It's like, just crazy! The world doesn't understand it, or the burden it really is for me...\"\nKanye:\nHypothetical Kim Kardashian Rant #4\nKim: \"Sometimes it's really hard being so inspiring to people who take selfies. I'm like, a goddess of selfies or something, and people don't give me enough credit. Like, do you know how much effort I have to put in to get the right angle? Do you know how my arm hurts from holding the camera up like that? One time my neck was sore for a week from holding a selfie pose for so long! I can't. I just can't.\"\nKanye:\nHypothetical Kim Kardashian Rant #5\nKim: \"I tweeted something today and it only got 2,386 retweets. Like, are you kidding me?! Kanye I've never felt so disrespected in my whole life. Everything I tweet should get to at least 5,000 retweets. I honestly feel like no one is respecting my genius right now. Is this what it's like for you? Is it?\"\nKanye:\nNever change, you two!\nSources: Getty Images; globalgrind.com (3); wired.com; zhiphopcleveland.com;","url":"https://www.bustle.com/articles/35635-does-kanye-west-understand-kim-kardashian-5-fictional-conversations-to-dissect"}
