{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 01:37:09","date_modify":"2018-10-23 01:37:09","date_publish":"2017-04-26 12:07:49","description":"Accounts clerk Tracy Hollinshead, 46, of Preston, Lancashire, was out walking her dog Ruby in a park when she discovered the animal had a foreign object stuck in her mouth.","filename":"data/vaneerConsumption/DogalmostchokesonaNAILhiddeninapieceofmeat.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F421200000578-0-image-a-96_1493204835033.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447170_Dog-chokes-NAIL-hidden-piece-meat_1540258629.html","title":"Dog almost chokes on a NAIL hidden in a piece of meat","title_page":"Dog almost chokes on a NAIL hidden in a piece of meat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tracy Hollinshead, 46, was out walking Ruby in a park when she discovered the animal had a foreign object stuck in her mouth\nA mother has issued a warning to dog owners after her Jack Russell almost choked on a nail hidden in a piece of meat tied to a string.\nTracy Hollinshead, 46, of Preston, Lancashire, was out walking Ruby in a park when she discovered the animal had a foreign object stuck in her mouth.\nThe accounts clerk was horrified to find that it was a piece of meat that had a three-inch nail stuck through it and a piece of string tied around it.\nShe claims it could make owners accidentally kill their dogs by pulling on the string when they see it hanging out of the mouth, dragging the nail so it cuts the pet's internal organs.\nMrs Hollinshead said: 'Ruby had been gone a while and when my husband ran up to her, she had the meat and nail in her mouth.\n'It's lucky she only has a small mouth because if it had been another dog, it might have tried to swallow it whole. The nail was about three inches long and I'm pretty sure people have done it on purpose.\n'They attach a bit of string as well because they know if owner's see it hanging out of their dog's mouth, they'll tug it and the nail will pierce their insides.\nThe mother claims the meat could make owners kill their dogs by pulling on the string when they see it hanging out of the mouth, dragging the nail so it cuts the pet's internal organs\nNarrow escape: Ruby the dog almost choked on the piece of meat that had a three-inch nail stuck through it and a piece of string tied around it\n'It could have ripped all her throat. It could have killed her. An owner would pull it and it could kill their dog. It would cause even more damage.\n'There has been quite a few similar incidents in the Preston area but it's worrying when you see it for yourself. It's awful and makes you really wary.\n'I'd just been walking the dog in the park. If a toddler had fallen on the nail, they could have really hurt themselves.\n'The nail was quite big so it could have gone through their foot or something. We have other dogs too and it makes me worried about going back to the park.\n'It's a shame for them as well. I'm quite scared by it. It's shocking. I've reported it to the police, but I don't know what they can do. It's quite a big area in Preston.\nMrs Hollinshead holds the potentially lethal device which she found while walking her dog\nOther dog owners have issued warnings on social media of similar incidents occurring since last month\n'I suppose park wardens would help but they don't work in the evenings. She could have stood in it or anything.\n'I guess I'll just be more wary about letting her off the lead. This is quite a nice area so maybe that's why the people behind this have targeted the park.\n'Ruby is constantly lively and she's inquisitive. It's horrible that this is happening. Whoever had done it needs to grow up.'\nIn the past three months, incidences of poisoned bait being used to harm or steal pets have been widely reported by owners.\nOther dog owners have issued warnings on social media of similar incidents occurring since last month.\nMrs Hollinshead said there had been 'quite a few similar incidents in the Preston area but it's worrying when you see it for yourself'\nThe owner said that 'if a toddler had fallen on the nail, they could have really hurt themselves'\nBenny McNally, also from Preston, said: 'Last week my dog almost ate a sausage with a nail in it. Luckily I acted fast and binned it. Some right sick b******s in this world.'\nRuby the dog is 'constantly lively and she's inquisitive', according to Mrs Hollinshead\nChristine Godbold, from Norfolk, complained in March that her son found cocktails sausages with nails and warned dog owners to be careful of their 'fur babies' being injured.\nJackie Nagy, from Lancashire, said: 'In Bamber Bridge [a] couple of weeks ago the Police were warning dog owners that someone was putting down poison.\n'[I] don't know if they caught anyone but it does make you think what do they get out of doing such evil cruel things disgusting evil vile scum bags.'\nIn February, dog owners took to Facebook to complain about finding nails inside raw sausages in the Oldham area of Greater Manchester.\nA Lancashire Constabulary spokesman said: 'We can confirm that we have received a report from a dog walker that they found what appears to be a pork scratching with a nail in it while in Ashton Park on Sunday, April 23.'","url":"https://www.dailymail.co.uk/news/article-4447170/Dog-chokes-NAIL-hidden-piece-meat.html"}
