{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-23 02:56:34","date_modify":"2018-10-23 02:56:34","date_publish":"2016-01-29 17:42:17","description":"The theft is one of many in the Chalford area of Gloucestershire, fuelling rumours the breed is being specifically targeted by thieves who want to profit from selling the puppies on.","filename":"data/vaneerConsumption/DognappercaughtoncamerastealingspanielpuppiesfromGloucestershirekennels.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4A89E00000578-0-image-a-2_1454090188279.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423165_Dognapper-caught-camera-brazenly-stealing-valuable-spaniel-puppies-kennels_1540263394.html","title":"Dognapper caught on camera stealing spaniel puppies from Gloucestershire kennels","title_page":"Dognapper caught on camera stealing spaniel puppies from Gloucestershire kennels  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A dognapper has been caught on camera stealing spaniel puppies worth up to £3,000 from their kennels.\nCCTV footage caught the thief, who was wearing a blue coat with a hood, walking through the gates of the kennels, in Chalford, Gloucestershire, and brazenly carrying one of the pups off.\nAfter the theft on Wednesday, owner Scott Manson, who is the official Cheltenham Racecourse farrier, said: 'I knew it was going to happen - that's why I put cameras up.\nBrazen: This is the moment a dognapper stole a spaniel puppy from its kennel in Chalford, Gloucestershire\n'I can't hide it - I'm quite well known in the sport.\n'Everyone said they were stolen to order and it looks like they were for a puppy farm.'\nThe three snatched English Springer Spaniels, named Maddie, Brandy and Harley, are trained gundogs and are used in field trials.\nThe breed can fetch quite a sum if sold and similar dogs have been known to go on the market for up to £1,000 each.\nPictures of the raid have been shared widely on social media and there has been a fierce campaign to return them.\nThe female liver and white-coloured dogs are aged seven months, six and seven years-old and are all micro-chipped.\nSpaniel puppies have been known to fetch up to £1,000 when sold. Pictured, two of the dogs that were stolen\nOther spaniels have gone missing around Chalford fuelling rumours the breed is being specifically targeted\nPolice confirmed that entry had been forced in to the property and they wanted to speak to the driver of a silver Vauxhall Signum seen in the area.\nOther dogs have gone missing in the area, fuelling suspicions that a gang are targeting the hounds.","url":"https://www.dailymail.co.uk/news/article-3423165/Dognapper-caught-camera-brazenly-stealing-valuable-spaniel-puppies-kennels.html"}
