{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 01:14:00","date_modify":"2018-10-23 01:14:00","date_publish":"2016-01-28 15:32:18","description":"Jenny Deakin,(pictured) from west London, stopped breathing and her lips turned blue when she took a bite of a Rich Tea biscuit and it got lodged in her throat.","filename":"data/vaneerConsumption/DogownersavedfromchokingtodeathonaRichTeabiscuitwhenherpet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30A9AFBA00000578-0-image-a-108_1453993839807.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421089_Dog-owner-saved-chocking-death-Rich-Tea-biscuit-pet-jumped-chest-dislodged-crumbs_1540257240.html","title":"Dog owner saved from choking to death on a Rich Tea biscuit when her pet","title_page":"Dog owner saved from choking to death on a Rich Tea biscuit when her pet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman was saved after her dog performed a 'Heimlich-like manoeuvre' and jumped on her chest to stop her choking on a biscuit.\nJenny Deakin stopped breathing and her lips turned blue when she took a bite of a Rich Tea biscuit and it got lodged in her throat.\nBut her dog Lily-Rose leapt into action and jumped up and down on the 30-year-old's chest and stomach until the deadly crumbs were dislodged.\nShe had been watching television late one night with Lily-Rose when she had her brush with death - before the dog performed a Heimlich-like maneuver.\nOwner's pride: Jenny Deakin with her beloved dog Lily-Rose - she credits the dog's arrival in her life for restoring her happiness\nHappy dog: Lily-Rose has been nominated for Cruft's Friends for Life competition and has previously been recognised as a 'wonderdog'\nShe said: 'The food got lodged in my throat - I couldn't breathe and I couldn't make myself cough again to dislodge it.\n'I was so scared and terrified that I wouldn't be able to get any help in time - and I can remember thinking that I needed to get to the phone.'\nNow Jenny, who works at a library near her home in Chiswick, west London, says she owes her life to little Lily, a Spaniel-type Papillon-cross.\nThe terrified dog lover said she can't remember standing up, but somehow ended up collapsing onto the floor where she rolled on to her back.\nShe started losing consciousness before Lily came to the rescue just in time.\nJenny said: 'I remember seeing Lily on the sofa standing looking at me.\n'The next thing I knew she jumped straight at me landing just above my stomach - luckily the force of her jump caused me to cough and the food was dislodged.'\nIn shock, Jenny went to the bathroom as she felt sick and when she saw her reflection in the mirror her lips were blue and her skin had turned a ghostly grey.\nShe said: 'As soon as I saw my reflection I knew I had come so close to being lost.'\nJenny credits Lily entirely with saving her life, and acknowledges that it is physically impossible for a dog to replicate the Heimlich maneuver exactly.\nShe said: 'I don't know whether she did it consciously or if she was just trying to get close to me.\n'Either way she did save me and I owe her so much.'\nThe doting owner has owned five-year-old Lily since she was a four-month-old puppy.\nJenny and her mum re-homed her from a previous owner that was unable to cope with a puppy.\nIt was love at first sight between the library worker and her little papillon cross - who helped her find self-confidence.\nReunited after the ordeal: Papiloon-cross Lilly-Rose and her owner Jenny Deakin at her west London home\nThe little dog has won numerous awards in the past, including being named Canine World's Wonderdog.\nNow she has been nominated for Cruft's Friends for Life competition which could see the pair attending the prestigious event if judges grant them a place in the final.\nJenny says that saving her from choking is only one of the ways the clever dog has helped her since she became her owner.\nBefore Lily came into her life she was alone and isolated - she had been bullied all through school and didn't have many friends.\nJenny found every day a struggle and said she was just going through life on autopilot.\nShe said: 'I got up, went to work, came home and took care of my mum. I found no joy in anything.\n'It tore me apart that I couldn't be the happy person that I had been throughout my childhood.'\nBut when Lily came into her life she started to find her spark again and hasn't looked back since.\nJenny said: 'It turned out she was afraid of humans, had food aggression and had to be treated for kennel cough.\n'She needed to feel loved and I needed someone to love. We were a perfect match.'\nLily forced her to go out and socialise and resulted in Jenny making lots of new friends at a puppy training class.\nNow, as well as her Crufts 'Friends for Life' nomination, the life-saving little dog has also been shortlisted for Dog Monthly's Highlife Best Friends Trophy.","url":"https://www.dailymail.co.uk/news/article-3421089/Dog-owner-saved-chocking-death-Rich-Tea-biscuit-pet-jumped-chest-dislodged-crumbs.html"}
