{"authors":["Associated Press"],"date_download":"2018-10-23 02:53:03","date_modify":"2018-10-23 02:53:03","date_publish":"2017-03-16 13:29:16","description":"Pandy the four-year-old mixed breed ran away while she was on a walk during Tuesday's winter storm. The dog ran from Soho to the Lincoln Tunnel in Manhattan. She was rescued from dog meat tr","filename":"data/vaneerConsumption/DogrescuedfromAsiasavedagaininNYCduringsnowstorm.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/21/3E58483E00000578-0-image-a-80_1489699590375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320276_Dog-rescued-Asia-saved-NYC-snowstorm_1540263183.html","title":"Dog rescued from Asia saved again in NYC during snowstorm","title_page":"Dog rescued from Asia saved again in NYC during snowstorm | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A dog that was rescued from an illegal dog meat trade has been saved for a second time after she ran away from her handler in New York City during the middle of this week's blizzard.\nTiffany Lacey, executive director of the Animal Haven in Manhattan said Pandy the female four-year-old mixed-breed was being walked Tuesday when she got spooked and bolted.\nRescue shelter volunteers gave chase but Pandy got away. The dog ran from Soho in lower Manhattan all the way to the entrance to the Lincoln Tunnel in Midtown, where she was in danger of being hit by traffic.\nReunited: Pandy was taken back to Animal Haven in Manhattan night after she had ran away to the Lincoln Tunnel during Tuesday's blizzard\nPandy was rescued for the second time after she was saved by an illegal dog meat trade in Thailand on February 19\nAbout an hour after she ran away, she was spotted by Port Authority police officers, who grabbed the leash still attached to her collar.\nThe freezing and exhausted pup was taken to ASPCA on East 92nd Street.\nAuthorities learned the dog had a microchip and were able to return Pandy to Animal Haven at 7pm. She was treated for bloodied paws.\nThe adorable dog is now back up for adoption at the Animal Haven Shelter\nLacey says Pandy was rescued on February 19th from an illegal dog meat trade in Thailand where the animals are taken from the streets and sold.\nThe shelter worked together with Soi Dog Foundation, a nonprofit organization for the welfare of dogs located in Phuket.\n'She’s doing really well. She’s tired but she’s the sweet girl she always is,' she told the New York Post.\nThe adorable pup has been put back up for adoption at the Animal Haven Shelter in Soho.","url":"https://www.dailymail.co.uk/news/article-4320276/Dog-rescued-Asia-saved-NYC-snowstorm.html"}
