{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 00:26:05","date_modify":"2018-10-23 00:26:05","date_publish":"2016-01-29 13:15:42","description":"The abused pitbull, who has since been named 'Ball', was rescued from abuse and taken to the Duemari Veterinary Clinic in Oristano on the island of Sardinia, Italy in order to recover.","filename":"data/vaneerConsumption/Dogsheadswellsupaftercollariswrappedtootightlyaroundneck.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B254DD00000578-0-image-a-44_1454071607045.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422718_The-abused-dog-head-swelled-like-balloon-Distressing-footage-shows-pitbull-s-injuries-collar-wrapped-tightly-neck_1540254365.html","title":"Dog's head swells up after collar is wrapped too tightly around neck","title_page":"Dog's head swells up after collar is wrapped too tightly around neck | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This distressing footage shows a pitbull with a hugely inflated head, caused by a collar being wrapped extremely tightly around its neck.\nThe poorly animal was rescued from abuse and taken to the Duemari Veterinary Clinic in Oristano on the island of Sardinia, Italy to recover.\nFootage released by the clinic shows the pitbull being fed by the veterinarians - presumably the first proper meal he has had in a while.\nPainful: The dog's head is clearly deformed in size and a nasty wound can be seen around his neck\nCruel: Vets say the swelling was caused by the nylon collar that had been wrapped tightly around his neck\nThe dog's head is clearly deformed in size and a nasty wound can be seen around his neck.\nAdditionally, its eyes are barely visible due to the extreme level of swelling to the head.\nVets say the swelling was caused by the nylon collar that had been wrapped tightly around his neck for a prolonged period.\nThe extra-tight collar had also cut into the animal's skin, causing a painful wound to open.\nThe veterinarians, who named the pitbull 'Ball,' removed the tight collar, allowing the dog to heal.\nOn the mend: Footage released by the clinic shows the starving pitbull being fed by the veterinarians\nAbused: The sheer size of the dog's head dwarfs its starving body as it eats food for first time in a while\nBut the footage shows that the animal still has a long way to go - the sheer size of its swollen head dwarfs its starving body.\nThe vets say that Ball is recovering however and is in much better health than when he first arrived at the clinic.\nThe video caused a stir online and a number of viewers, disgusted by the content, left comments.\nOne wrote: 'I will never comprehend the depravity of humans. How can people do this to other living creatures?\n'That poor dog makes my heart hurt. Justice will never be served in cases like this.'","url":"https://www.dailymail.co.uk/news/article-3422718/The-abused-dog-head-swelled-like-balloon-Distressing-footage-shows-pitbull-s-injuries-collar-wrapped-tightly-neck.html"}
