{"authors":["Phoebe Weston For Mailonline"],"date_download":"2018-10-23 02:13:11","date_modify":"2018-10-23 02:13:11","date_publish":"2017-03-10 11:09:29","description":"Researchers from the University of Zurich in Switzerland discovered that can be sneaky and manipulative when they want to maximise the number of tasty treats they get.","filename":"data/vaneerConsumption/Dogsusedeceptiontotrickhumanssaysnewresearch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E225B3C00000578-0-image-a-6_1489143391746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4300678_Dogs-use-deception-trick-humans-says-new-research_1540260791.html","title":"Dogs use deception to trick humans says new research","title_page":"Dogs use deception to trick humans says new research | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dogs aren't as honest and obedient as they might like to have us think.\nWe think we're in control but new research shows that dogs can be very deceptive - especially when it involves them getting an extra sausage.\nScientists found that dogs can be sneaky and manipulative in order to get what they want from humans.\nScroll down for video\nResearchers from the University of Zurich in Switzerland found that dogs can be quite calculated - especially if it means they'll get a sausage (stock image)\nDOGGIE DECEPTION Researchers paired pups with their owner and two unfamiliar humans - one who acted 'cooperatively' and gave them food and the other who was 'competitive' and kept the food for themselves. The dogs had three snacks to choose from - a juicy sausage, a dry dog biscuit or nothing at all. The dog had to lead one of these partners to one of the three potential food locations. The dog learnt to always lead the person who gave them food to the juicy sausage. They were quickly able to differentiate between who gave them food and who didn't.\nMarianne Heberlein, who studies dog cognition at the University of Zurich in Switzerland, got the idea to study doggie deception from watching her own mischievous hounds.\nShe noticed her dogs tricking each other - for example by getting up and pretending there was something interesting going on in the garden in order to nab the other one's prime sleeping spot.\nHowever, Dr Heberlein wanted to study if dogs were capable of deceiving humans too.\nThe research showed that dogs can be quite calculated if it means they'll get a sausage as a reward - and are able to recognise who is more likely to give them one.\n'They showed an impressive flexibility in behaviour,' Dr Heberlein told New Scientist.\n'They're not just sticking to a strict rule, but thinking about what different options they have.'\nResearchers paired pups with their owner (who always gave them food) and two unfamiliar humans - one who acted 'cooperatively' and gave them food and the other who was 'competitive' and kept the food for themselves.\nThe dogs had two snacks to choose from - a juicy sausage, a dry dog biscuit or nothing at all.\n'During the test, the dog had the options to lead one of these partners to one of the three potential food locations: one contained a favoured food item, the other a non-preferred food item and the third remained empty', according to the paper, which is published in the journal Animal Cognition.\nThe dog therefore had the possibility of leading its cooperative owner to one of the food locations. And that's exactly what they did.\n'A dog would have a direct benefit from misleading the competitive partner since it would then get another chance to receive the preferred food from the owner', the researchers said.\nResearchers paired pups with their owner (who always gave them food) and two unfamiliar humans - one who acted 'cooperatively' and gave them food and the other who was 'competitive' and kept the food for themselves (stock image)\nOn the first day the dogs led the cooperative partner (ie the one that did not give them the food) to the preferred food box more often than you would expect by chance.\nOn the second day, there were even smarter and led the competitive partner even less often to the favoured food box - and sent them to the empty box instead.\n'They were really quickly able to differentiate between the two partners. There was no additional learning step needed,' Dr Heberlein said.\nOther animals, such as monkeys, often need dozens of repetitions to learn similar lessons, she said.\nThe study shows that dogs are able to distinguish between competitive and cooperative partners - ie someone who will give them a sausage and someone who won't.\nThis shows dogs are capable of tactical deception and adjusting their behaviour depending on who they're dealing with.","url":"https://www.dailymail.co.uk/sciencetech/article-4300678/Dogs-use-deception-trick-humans-says-new-research.html"}
