{"authors":[],"date_download":"2018-10-22 23:11:54","date_modify":"2018-10-22 23:11:54","date_publish":"2016-11-23 00:00:00","description":"Our canine pals remember lots of facts, like where to find the food bowl. Now there's evidence they also have aspects of \"episodic memory,\" which allow them to relive experiences and events.","filename":"data/vaneerConsumption/DogsRememberMoreThanYouThinkShots.json","image_url":"https://media.npr.org/assets/img/2016/11/22/dog-memory_wide-93188ac55c3ea3f0450ffd1aad11eefb0e255f68.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=503072612_1540249914.html","title":"Dogs Remember More Than You Think : Shots","title_page":"Dogs Remember More Than You Think : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nYou may not remember what you were doing a few minutes ago, but new research says your dog probably does. NPR's Jon Hamilton reports.\nJON HAMILTON, BYLINE: A dog's brain is filled with factual memories - people, places, where to find leftover pizza. But Claudia Fugazza thought dogs might also have what are known as episodic memories - memories of experiences, like chasing a squirrel.\nCLAUDIA FUGAZZA: Most dog owners at least suspected that dogs can remember events and past experiences.\nHAMILTON: Fugazza herself owns a Czechoslovakian wolfdog named Velvet, but she's also a scientist who studies animal behavior at Eotvos Lorand University in Budapest. And she helped develop a training method that uses dogs' ability to imitate the actions of their owners. Fugazza thought this do-as-I-do training might provide a way to find out whether dogs really do remember events.\nFUGAZZA: If you ask a dog to imitate an action that was demonstrated some time ago, then it is something like asking, do you remember what your owner did?\nHAMILTON: So Fugazza and other researchers did an experiment with 17 trained dogs and their owners. First, each dog would watch their owner perform some action they'd never seen before. In one video of the study, a dog watches his owner stride to an open umbrella on the floor and give it a whack with his hand. Then the dog is led behind a partition, where he can't see the umbrella, for a minute. When the dog returns, he lies on a mat. Fugazza says this is when an unexpected command will show whether the dog remembers what his owner did.\nFUGAZZA: So we ask them to do it.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED MAN: Do it.\nHAMILTON: The dog trots over to the umbrella and taps it with his paw. Fugazza says other dogs did equally well.\nFUGAZZA: Despite showing some signs of surprise, the dogs could imitate the previously demonstrated actions.\nHAMILTON: Fugazza says this suggests the dogs were taking a mental trip back in time to retrieve a memory. Those memories faded pretty quickly. Even so, they're a lot like the episodic memories people use to chronicle their lives. Fugazza says the team isn't claiming dogs have full-fledged episodic memory.\nFUGAZZA: Episodic memory is traditionally linked to self-awareness. And so far, there is no evidence of self-aware in dogs. And I think there is no method for testing it.\nHAMILTON: For a long time, scientists thought only people had episodic memories. But Victoria Templer of Providence College says that's changing. In the past decade or so, researchers have found evidence of something like episodic memory in a range of species.\nVICTORIA TEMPLER: Magpies, black-capped chickadees, monkeys, rats.\nHAMILTON: Templer says dogs presented a special challenge.\nTEMPLER: It's difficult to test dogs, right? They're so tuned in to human cues, which can be a good thing. It can be an advantage, but it also can be a disadvantage and make it very difficult because we might be cueing dogs when we're totally unaware of it.\nHAMILTON: Templer says the team in Budapest did a good job avoiding that, and the results could help explain why episodic memory evolved in people. Templer says one possibility is that reliving the past helps us imagine the future.\nTEMPLER: So if I can imagine that I'm going to interact with some individual and that might be dangerous, I'm not going to want to interact with them.\nHAMILTON: A decision that could help a person survive to pass on their genes. The new research on dogs appears in the journal Current Biology.\nJon Hamilton, NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=503072612"}
