{"authors":["Maitri Suhas"],"date_download":"2018-10-30 23:09:56","date_modify":"2018-10-30 23:09:56","date_publish":"2014-08-13 22:40:59","description":"Television oddity Dog the Bounty Hunter weighed in on Tuesday on Twitter regarding the brutal alleged attack by MMA fighter Jon Koppenhaver, aka War Machine, on his ex-girlfriend Christy Mack. Mack, an adult film star and tattoo model, bravely…","filename":"data/vaneerConsumption/DogtheBountyHunterKeepsNecessaryEyesontheChristyMackCase.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e1753d0a-b701-4e92-b32f-31e282ea4578.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35687-dog-the-bounty-hunter-keeps-necessary-eyes-on-the-christy-mack-case_1540940996.html","title":"Dog the Bounty Hunter Keeps Necessary Eyes on the Christy Mack Case","title_page":"Dog the Bounty Hunter Keeps Necessary Eyes on the Christy Mack Case","title_rss":"NULL","source_domain":"bustle.com","text":"Television oddity Dog the Bounty Hunter weighed in on Tuesday on Twitter regarding the brutal alleged attack by MMA fighter Jon Koppenhaver, aka War Machine, on his ex-girlfriend Christy Mack. Mack, an adult film star and tattoo model, bravely exposed her injuries following the supposed attack on Sunday night, revealing gruesome damage to her face and body, and an explicit account of the assault and abuse. Duane \"Dog\" Chapman tweeted that he would come after Koppenhaver after 24 hours had expired, and on Wednesday, Chapman apparently went to Koppenhaver's home and incited him on Twitter to face him.\nIt's a strange, surreal series of events that seems made for reality television; and in fact, Chapman is still currently star of a CMT show, Dog and Beth, alongside his wife. Many of Chapman's fans are tweeting back at him, excited about the prospect of his confrontation with Koppenhaver, suggesting it would make for great TV. Though the fans tweeting at Chapman are misguided and Chapman's involvement itself seems like a touch of attention-grabbing un-reality, his publicizing of the incident is actually a good thing: It calls much needed attention to the alleged domestic abuse that Mack suffered.\nWhen she posted the photos to her personal Twitter account, Mack caught the attention of the public eye and she spoke up for victims everywhere. However, in many domestic abuse cases, the initial shock and outrage could soon fade, and the attackers could go unpunished.\nChristopher Polk/Getty Images Entertainment/Getty Images\nAs uncivilized and brutal as it may seem for a literal bounty hunter to be going after Koppenhaver, Duane \"Dog\" Chapman's involvement in the Mack-Koppenhaver incident at least keeps it at the forefront of the media, so her story won't be forgotten.\nDomestic abuse is a crime that deserves grave punishment, and hopefully Koppenhaver, if guilty, will be brought to justice. It's unclear as of yet whether that justice will come at the hands of police or Dog, but Mack deserves to know that her alleged attacker won't repeat his offense.","url":"https://www.bustle.com/articles/35687-dog-the-bounty-hunter-keeps-necessary-eyes-on-the-christy-mack-case"}
