{"authors":["Greg Bluestein"],"date_download":"2018-10-30 19:13:18","date_modify":"2018-10-30 19:13:18","date_publish":"2017-03-23 11:00:50","description":"State Sen.","filename":"data/vaneerConsumption/DogTheBountyHunterclawsintoGeorgiapolicepaydebate.json","image_url":"https://politics.myajc.com/rf/image_large/Pub/p8/Politics-MyAJC/2017/03/23/Images/WPIMAGE_cmgajcpolitics_35730.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_dog-the-bount_d4e77f988fd70d849ef64e038c3c5e57__1540926798.html","title":"Dog The Bounty Hunter claws into Georgia police pay debate","title_page":"Dog The Bounty Hunter claws into Georgia police pay debate","title_rss":"NULL","source_domain":"ajc.com","text":"State Sen. Michael Williams, R-Cummings, is trying to ratchet up the pressure on his colleagues to back his measure that would raise the salaries of deputy sheriffs and local police officers to the same level that Georgia state troopers are paid.\nThe Cumming Republican sent a robo-call blast to hundreds of thousands of Georgians featuring reality TV dude \"Dog the Bounty Hunter,\" urging a vote to help the measure to the Senate floor.\nSenate Bill 254 hasn't gotten any traction this legislative session. The calls were meant to pressure state Sen. Tyler Harper, who chairs the chamber's public safety committee, to give the measure a hearing.\nThe idea gained support last year after Gov. Nathan Deal and GOP legislative leaders engineered the 20 percent pay hike for most state law enforcement officers, but he and others say deputies should lobby their counties, not the state, for higher pay.\nThe starting pay for Georgia State Patrol officers rose to $46,422 with the pay hike, which was included in the midyear spending plan Deal signed into law. Sheriffs contend it’s hard to compete for top talent when, according to the Georgia Sheriffs’ Association, the average starting salary for a deputy doesn’t reach $30,000.\nDeal has said sheriff’s pay should be decided by county commissions, adding that shifting salary hikes to the state would also give Georgia the “control mechanism” over local deputies.\n“I don’t think that sheriffs are advocating that the state take over the control of local deputies,” he said.\nListen to the call here:\nInsider's note: A version of this post ran in the Morning Jolt.","url":"https://politics.myajc.com/blog/politics/dog-the-bounty-hunter-claws-into-georgia-police-pay-debate/epNgFmRGCAuOZvyCKmvVeN/"}
