{"authors":["Kelly Mclaughlin For Dailymail.Com"],"date_download":"2018-10-22 20:18:52","date_modify":"2018-10-22 20:18:52","date_publish":"2016-01-28 00:54:22","description":"Suffolk County SPCA Chief Roy Gross said on Wednesday that the dog was bruised, but would likely make a full recovery after the January 18 incident in Long Island, New York.","filename":"data/vaneerConsumption/DogwhowaspushedoutofanSUVisstruckbyanothervehicle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A5D1F200000578-0-image-a-36_1453942369937.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420202_Dog-pushed-SUV-struck-vehicle-chasing-owner-s-car_1540239532.html","title":"Dog who was pushed out of an SUV is struck by another vehicle","title_page":"Dog who was pushed out of an SUV is struck by another vehicle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A dog was injured in New York when it was struck by a vehicle after it was forced out of an SUV and tried to chase after the car.\nSuffolk County SPCA Chief Roy Gross said on Wednesday that the dog - a whippet mix, possibly shepherd and/or pit bull - was bruised, but would likely make a full recovery after the January 18 incident in Moriches, Long Island.\nGross said the Suffolk County SPCA is offering $2,000 reward for information leading to the arrest and conviction of the person who pushed the dog out of the car.\nA dog (pictured above) was injured in Long Island, New York, on January 18 after someone pushed it out of an SUV and it was hit by another car. It is expected to make a full recovery\nWitnesses said that the dog was let out of the passenger side of an older model green Jeep Cherokee at about 4pm.\nThe dog ran to the driver's side of the vehicle, but the driver 'pushed the dog away' off. It was then hit by another car.\n'The dog gets out,' Gross told Newsday, 'the dog goes around to the driver's side. He pushes the dog away - and the dog is running after the car. The dog then gets hit ... How do you do this to an animal?'\nThe dog, who is still recovering, now has a new home, Gross said, adding that he hopes to find the people who were in vehicle the dog was pushed out of.\n'He's going to be arrested,' Gross told Newsday. 'And, he's going to jail. This is not acceptable, what happened here.'\n'I just need one person to come forward,' he added. 'One person, who knows who this person is. That's all I need.'","url":"https://www.dailymail.co.uk/news/article-3420202/Dog-pushed-SUV-struck-vehicle-chasing-owner-s-car.html"}
