{"authors":["Press Association"],"date_download":"2018-10-22 22:25:29","date_modify":"2018-10-22 22:25:29","date_publish":"2016-01-28 10:22:37","description":"Government changes to the rules for obtaining legal aid in domestic violence cases are under challenge in the Court of Appeal. Women's rights campaigners say...","filename":"data/vaneerConsumption/Domesticabusecaselegalaidrulechangesunderappeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-1d238b33-78e8-403d-9133-6bf16bf81a5f-2vdWmEltwXfba0ce28e632727444-671_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420503_Domestic-abuse-case-legal-aid-rule-changes-appeal_1540247129.html","title":"Domestic abuse case legal aid rule changes under appeal","title_page":"Domestic abuse case legal aid rule changes under appeal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Domestic abuse case legal aid rule changes under appeal\nGovernment changes to the rules for obtaining legal aid in domestic violence cases are under challenge in the Court of Appeal.\nWomen's rights campaigners say large numbers of victims are being unfairly and unlawfully excluded from obtaining funding and want appeal judges to overturn a High Court decision a year ago not to intervene.\nLord Justice Fulford and Mrs Justice Lang, sitting in London, ruled that the court was wrongly being invited to \"enter the political arena\" and substitute its views for those of Parliament.\nThe rules set out mandatory evidence requirements for an alleged victim seeking family law legal aid\nAt the heart of the case are rules introduced by former Justice Secretary Chris Grayling as part of the Legal Aid, Sentencing and Punishment of Offenders Act 2012 (LASPO).\nThe rules set out mandatory evidence requirements for an alleged victim seeking family law legal aid.\nRights of Women (ROW), who are appealing before three judges, said new data shows that 40% of victims still do not have the required forms of evidence to access legal aid.\nThey say the most common form of evidence available, introduced n April 2014, is a referral by a health professional to a victim support organisation.\nOther forms include evidence from a medical professional or social services and evidence of a protective injunction.\nROW's director Emma Scott said: \"The Government acknowledges that domestic violence is 'often hidden away behind closed doors, with the victims suffering in silence'.\n\"More than three years on from the devastating cuts to legal aid, and despite amendments to the rules, we know that those victims behind those doors do not have the required pieces of paper to prove they have experienced domestic violence.\n\"Our research has consistently shown that nearly half of women affected by domestic violence do not have the required forms of evidence to apply for family law legal aid and that more than half of those women tell us they take no legal action as a result.\n\"This leaves them at risk of further violence, and even death.\"\nLaw Society president Jonathan Smithers has expressed concern that some forms of evidence are subject to a 24-month time limit, even though victims might be under a life-long threat.\nMr Smithers said: \"Legal aid is a lifeline for victims of abuse. This new data shows that access to safety and justice is still being denied to the very people the Government expressly sought to protect with its amendments to the regulations.\n\"The harsh tests requiring people to bring evidence to satisfy the broader statutory meaning of domestic violence are not what Parliament intended.\"\nThe appeal is being heard by Lord Justice Longmore, sitting with Lord Justice Kitchin and Lady Justice Macur.\nA Ministry of Justice spokeswoman said: \"We are determined to ensure victims of domestic violence can get legal aid whenever they need it.\n\"We have made it easier for victims of domestic violence to obtain legal aid, by ensuring a broader range of evidence qualifies. This has contributed to a 19% rise in the number of grants awarded.","url":"https://www.dailymail.co.uk/wires/pa/article-3420503/Domestic-abuse-case-legal-aid-rule-changes-appeal.html"}
