{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:36:37","date_modify":"2018-10-30 18:36:37","date_publish":"2017-01-18 20:21:59","description":"President-elect Donald Trump is already preparing for his re-election campaign in 2020 with a new campaign slogan. | Politics","filename":"data/vaneerConsumption/DonaldTrumpAlreadyHasHis2020CampaignSlogan.json","image_url":"https://media.breitbart.com/media/2017/01/Trump-in-Hat-MAGA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_18__1540924597.html","title":"Donald Trump Already Has His 2020 Campaign Slogan","title_page":"Donald Trump Already Has His 2020 Campaign Slogan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump is already preparing for his re-election campaign in 2020 with a new campaign slogan.\n“Are you ready?” Trump asked the Washington Post in an interview published Wednesday, building suspense for the unveiling of his new slogan. “‘Keep America Great,’ exclamation point.”\nTrump called his lawyer into his office during the interview to trademark the slogan more than three years before he is up for re-election, confident that America would be great by the time he uses it.\nTrump said he was inspired by his 2016 catchphrase “Make America Great Again,” which to him meant a plan from more jobs to a stronger military.\n“I felt that jobs were hurting,” Trump said. “I looked at the many types of illness our country had, and whether it’s at the border, whether it’s security, whether it’s law and order or lack of law and order. Then, of course, you get to trade, and I said to myself, ‘What would be good?’ I was sitting at my desk, where I am right now, and I said, ‘Make America Great Again.'”\nWithin a week of Mitt Romney’s loss to President Obama, Trump trademarked “Make America Great Again” for a $325 fee.\nThe slogan made its way to hats and t-shirts and became a rallying cry for supporters while his opponents slammed the catchphrase.\nTrump also has plans to keep his campaign office in Trump Tower open during his first term to work on re-election efforts, Politico reported.","url":"https://www.breitbart.com/politics/2017/01/18/donald-trump-already-2020-campaign-slogan/"}
