{"authors":["Charlie Spiering"],"date_download":"2018-10-30 20:23:49","date_modify":"2018-10-30 20:23:49","date_publish":"2015-10-13 12:06:37","description":"Trump paying attention to the debate might give it a ratings boost, as he has 4.4 million followers on Twitter.","filename":"data/vaneerConsumption/DonaldTrumpAnnouncesPlansToLiveTweetDemocraticDebate.json","image_url":"https://media.breitbart.com/media/2015/10/Trump-Rally-in-Vegas-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540931029.html","title":"Donald Trump Announces Plans To Live-Tweet Democratic Debate","title_page":"Donald Trump Announces Plans To Live-Tweet Democratic Debate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Billionaire presidential candidate Donald Trump is thrilling his fans by announcing plans to live-tweet the Democratic presidential debate.\nAt the request of many, and even though I expect it to be a very boring two hours, I will be covering the Democrat Debate live on twitter! — Donald J. Trump (@realDonaldTrump) October 13, 2015\nTrump’s personal use of social media has driven a lot of the coverage of his campaign – even sparking a story from the New York Times about his Twitter habits.\n“Mr. Trump has mastered Twitter in a way no candidate for president ever has, unleashing and redefining its power as a tool of political promotion, distraction, score-settling and attack — and turning a 140-character task that other candidates farm out to young staff members into a centerpiece of his campaign,” New York Times reporter Michael Barbaro wrote earlier this month.\nAlthough the debate will feature the first showdown between Hillary Clinton and Sen. Bernie Sanders, CNN expects lower ratings than the historic ratings from last month’s Republican debate.\nTrump’s attention to the debate might give it a ratings boost, as he has 4.4 million followers on Twitter.","url":"https://www.breitbart.com/politics/2015/10/13/donald-trump-announces-plans-live-tweet-democratic-debate/"}
