{"authors":["David Martosko","Us Political Editor For Dailymail.Com In Des Moines"],"date_download":"2018-10-22 20:23:39","date_modify":"2018-10-22 20:23:39","date_publish":"2016-01-29 01:30:15","description":"The Republican front-runner spoke to a handful of reporters aboard his airplane on the tarmac in Des Moines. He set up a public website on Thursday to raise money for veterans charities.","filename":"data/vaneerConsumption/DonaldTrumpsayshesraised6malreadyforveteransincluding1mofhisownmoney.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AE868700000578-0-image-a-39_1454038480423.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422072_Trump-says-s-raised-5-million-veterans-including-1-million-money_1540239819.html","title":"Donald Trump says he's raised $6m already for veterans including $1m of his own money","title_page":"Donald Trump says he's raised $6m already for veterans including $1m of his own money | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump told a standing-room crowd on Thursday that a collection of his wealthy friends have donated more than $6 million to his personal foundation to benefit American military veterans.\nRattling off a list of donors and dollar amounts, he wowed an audience at Drake University in Des Moines, Iowa who came to see him instead of watching a Republican presidential debate hosted by the Fox News Channel less than 2 miles away.\n'We actually raised close to 6 [million], to be honest, and I have to say, more will be coming,' he boasted. 'I think this money is going to continue to pour in.'\nBy night's end, he announced that the $6 million barrier had been broken.\nBut a Fox News spokesperson said Thursday night that The Donald, the GOP front-runner, had offered to come to the debate instead of boycotting it in exchange for a $5 million donation from the network.\n'AMAZING PEOPLE': Trump praised military veterans at an Iowa rally as he announced a $6 million haul for related charities\nFRIENDS FOR ONE NIGHT: Republican presidential rivals Mike Huckabee (left), Donald Trump (center) and Rick Santorum (right) joined on state to express their mutual love of America's fighting heroes\nOH YES HE DID: YouTube rappers 'Diamond and Silk' made a joint cameo on Thursday at Trump's veterans event\n'Trump offered to appear at the debate upon the condition that Fox News contribute $5 million to his charities,' the spokesperson said.\n'We explained that was not possible and we could not engage in a quid pro quo, nor could any money change hands for any reason.'\nCHEERING SECTION (FOR TWO): Ivanka Trump, the candidate's daughter, rooted for her dad despite being due to deliver a baby in just two weeks\nOthers, it appears, were tapped to pick up the slack.\n'Carl Icahn gave $500,000,' Trump said onstage of his longtime industrialist friend. 'One quick phone call.'\nAnd he announced his own contribution to wild applause: 'Donald Trump gave $1 million, okay?' he said.\nTrump's debate-free evening included cameos from 'Diamond and Silk,' a rapping duo of African-American women who support The Donald, and from a group of wounded warriors.\nJohn Wayne Walding, a 23-year veteran who lost his right leg during a 7-year stint in a Special Forces unit, also took his turn at the microphone.\nTrump introduced him as an 'amazing' sniper and sniper instructor who had been deployed to both Iraq and Afghanistan.\n'I feel cooler than Burt Reynolds, being introduced by Mr. Trump,' he said.\nRick Santorum and Mike Huckabee, two of Trump's GOP rivals, also showed up to show support for veterans.\n'We have an obligation to do something to make sure that our veterans have the best possible health care in the world,' Santorum said. 'Twenty-two vets a day commit suicide because of PTSD and related illnesses.'\nHuckabee said that although he and Trump are fighting tooth and nail for the Republican presidential nomination, 'tonight we are colleagues in unison standing here for the people who let us breathe every breath of free air we breathe.'\nAnd besides, he joked, 'I had nothing to do at 8 o-clock tonight.'\nALL ABOUT THE VETS: Trump greeted retired Army Sgt. 1st Class John Wayne Walding, a Special Forces amputee, on stage Thursday night\nALL DON'S FRIENDS: Trump announced several $1 million gifts to his personal foundation, including his own massive check\nTHE DEBATE THAT WASN'T: Eight Republicans traded barbs without Trump in the room after The Donald bailed over how the network has treated him\nANTI-PROTEST CROWD: Pro-Trump partisans shouted at activists who yelled 'We love veterans! Trump loves war!'\nThe two underperforming pols were part of Fox's 'undercard' debate two hours earlier, giving them ample time to make their way to Drake University for Trump's event.\nThe Donald called them 'two amazing people.'\nHe had less glowing words for Jeb Bush, another rival who was on the main debate stage while his event clipped along.\n'He's probably looking for me,' Trump jabbed. 'He's saying, \"Where's Trump? Has anybody seen Trump?\"'\nOther donors Trump bragged about include Ike Perlmutter, the longtime chairman of comic-book giant Marvel Enterprises, and his wife Laurie. They gave $1 million.\nSo did a Trump confidant who asked to remain anonymous.\nAnother $1 million contributor appeared on stage with Trump.\n'Donald and I have been friends for 18 years,' he said, recalling a pledge he had made to support Trump's presidential campaign it he ever ran for the highest office in the United States.\n'I gave him $1 million. He sent it back,' he explained. 'He said, \"I can't take your money\". I couldn't believe it!'\n'In any case, he's a great man, and I'm very happy. My wife and I will donate $1 million to your charity.'\nThe evening's festivities were interrupted twice by protesters who shouted: 'We love veterans! Trump loves war!'\nTrump has become fond of calling himself 'the most militaristic person' anyplace he speaks – usually allowing for the exceptions of veterans in the room.\nBIG MONEY: Donald Trump said aboard his private Boeing 757 that he will give $12 million of his own fortune to veterans charities, and that his overall haul is $5 million so far\nIOWA: The Donald spoke to a few reporters aboard his iconic jet\nHe previewed the fundraising bonanza aboard his private Boeing 757 jet for an intimate gathering of reporters.\n'We haven't even started, already we're up to $5 million,' he said after landing in Des Moines, Iowa.\nHe said Fox had apologized to him for what he termed a 'taunting' statement this week after he declared that he wouldn't participate in the event.\n'I got an apology. It was very nice,' he said. I appreciated it.' But Trump wouldn't say whether it was Roger Ailes, Rupert Murdoch, or someone else at News Corp who offered the mea culpa.\nA TIMELINE OF TRUMP v. FOX NEWS 6 p.m. Monday – Donald Trump's interview with Wolf Blitzer airs on CNN and he says he's not '100 percent certain' that he'll attend the debate because of Megyn Kelly 6:30 p.m. Monday – Fox News begins to push back and then says: 'Sooner or later Donald Trump, even if he's president, is going to have to learn that he doesn't get to pick journalists – we're very much surprised he's willing to show that much fear about being questioned by Megyn Kelly.' 7:03 a.m. Tuesday – Trump calls in to Good Morning America and talks to George Stephanopoulos saying he'll 'probably' do the debate, but he's still thinking about it. 1:05 p.m. Tuesday – Trump posts a poll on Twitter asking his followers to vote on the question, 'Should I do the GOP debate?' He also posts a video to Instagram asking the question. 3:16 p.m. Tuesday – Fox News sends out a tongue-in-cheek response to Trump's Twitter poll, suggesting he'd survey his Twitter followers on whether he should meet with Putin 5:45 p.m. Tuesday – Donald Trump says he was 'all set to do the debate ... but when they sent out the wise guy press releases a little while ago, done by PR person along with Roger Ailes, I said, bye, bye OK?'\nBut he was eager to talk about the money he's collecting for wounded warriors instead of tussling with Ted Cruz and his other rivals on stage.\n'I'm putting up $1 million,' he gushed. 'I know my kids are putting up some money,' he gushed.\nTrump said he has 'other friends that are putting up $200,000, $300,000. I have other friends who are putting up $1 million.'\nHe described them as 'very iconic people. Great people,' of the sort that he wants to put in charge of international trade negotiations if he becomes president.\nTrump's campaign hastily invited a handful of journalists to the airport tarmac just hours before he was to speak at his rally, which is being framed as a fundraiser for veterans organizations.\nEarlier Thursday, the Donald J. Trump Foundation launched a website devoted to collecting money from the public, all of which it said would be funneled to 'Veterans needs.'\n'This site, with small donations, already it's almost up to $400,000,' Trump said.\n'It just opened up a little while ago.'\nTrump explained his rationale for skipping the Fox News debate, the final GOP smackdown before Monday's Iowa caucuses.\nAiles, the Fox News chief, has called him 'many, many times' in the past day to negotiate his return to the debate stage, he recalled, including 'just two minutes ago.'\n'They want me there. Because they're gonna – look, they'll get much lower ratings,' he said.\n'I would have loved to have been there. The problem is once you set up this major event, how can I be there? ... It's at the same exact time.'\nAPOLOGY ACCEPTED: Trump said Fox News has offered him an olive branch over its treatment of him this week\nNOT GOING: Trump said Roger Ailes of Fox News had called him 'many, many times' to ask him to reconsider boycotting Thursday night's debate\nTrump's own event was scheduled for the same 8:00 p.m. star time as the mainstage debate, and produced its own crush of Iowans trying to get in, hours before the doors opened.\n'They've never seen lines like that,' Trump insisted. 'Far bigger than the debate.'\nHe said he was willing to reconsider his decision to bail on Fox News until his staff told him how many people had registered for tickets to his event at Drake University in Des Moines.\n'I was totally open' to participating in the debate, he said. 'But once time ran by and once thousands of people began signing up ... it's very tough to break something like that up.'\nBut ultimately 'I won't be doing it,' he declared of the Fox debate.","url":"https://www.dailymail.co.uk/news/article-3422072/Trump-says-s-raised-5-million-veterans-including-1-million-money.html"}
