{"authors":["Charlie Spiering"],"date_download":"2018-10-30 22:05:55","date_modify":"2018-10-30 22:05:55","date_publish":"2018-10-30 21:49:21","description":"President Donald Trump and First Lady Melania Trump visited the site of a horrific synagogue shooting in Pittsburg on Tuesday afternoon.","filename":"data/vaneerConsumption/DonaldandMelaniaTrumpVisitSiteofPittsburghSynagogueShooting.json","image_url":"https://media.breitbart.com/media/2018/10/Trumps-Pittsburg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30__1540937155.html","title":"Donald and Melania Trump Visit Site of Pittsburgh Synagogue Shooting","title_page":"Donald and Melania Trump Visit Site of Pittsburgh Synagogue Shooting | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump and first lady Melania Trump visited the site of a horrific synagogue shooting in Pittsburgh on Tuesday afternoon, just days after eleven people were shot and killed during a service on Saturday.\nThe president and first lady traveled to the synagogue where eleven white Stars of David were placed to honor those who were killed in the Jewish community.\nThe Trumps were joined by his son-in-law Jared Kushner and daughter Ivanka Trump and his Treasury Secretary Steven Mnuchin. Ambassador Ron Dermer of Israel also joined the group.\nThe Trumps went into the synagogue to light a candle in honor of the victims and later laid white roses and stones by each of the memorials outside the synagogue.\nDespite the president inviting top House and Senate Democrats and Republicans to pay respects to the victims, Senate Minority Leader Chuck Schumer, House Speaker Paul Ryan, and House Minority Leader Nancy Pelosi declined, each citing scheduling conflicts.\nRabbi Jeffrey Myers of the Tree of Life synagogue welcomed the Trumps to the site of the crime scene.\n“The president of the United States is always welcome,” Myers said on Monday on CNN. “I’m a citizen. He’s my president. He is certainly welcome.”\nFunerals were held for three of the victims earlier on Tuesday.\nThe group also traveled to the hospital to visit some of the wounded where they were being treated.","url":"https://www.breitbart.com/politics/2018/10/30/donald-and-melania-trump-visit-site-of-pittsburgh-synagogue-shooting/"}
