{"authors":["Lulu Chang"],"date_download":"2018-10-30 23:44:23","date_modify":"2018-10-30 23:44:23","date_publish":"2014-08-13 13:06:35","description":"The only thing more confusing than what is happening on top of Donald Trump's head is what's happening inside it. The man who spent most of 2011 and the better part of 2012 trying to convince America that Barack Obama was born in Kenya has had an…","filename":"data/vaneerConsumption/DonaldTrumpIn2014HasBeenEvenMoreFlatOutInsaneThanAnticipated.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6996734f-8584-4c4e-b4e3-f285015ffde5.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35545-donald-trump-in-2014-has-been-even-more-flat-out-insane-than-anticipated_1540943063.html","title":"Donald Trump In 2014 Has Been Even More Flat-Out Insane Than Anticipated","title_page":"Donald Trump In 2014 Has Been Even More Flat-Out Insane Than Anticipated","title_rss":"NULL","source_domain":"bustle.com","text":"The only thing more confusing than what is happening on top of Donald Trump's head is what's happening inside it. The man who spent most of 2011 and the better part of 2012 trying to convince America that Barack Obama was born in Kenya has had an even more interesting 2014 — including Trump suing Trump-titled Casinos in Atlantic City for not being quite fancy enough — and we've still got four more months of his antics to look forward to.\nIn the past four months alone, Trump has defended Donald Sterling, insisted on putting his name high over Chicago's skyline, sued to get his name taken off the Atlantic City skyline, and campaigned to keep American Ebola patients out of the United States. You'd think that with so many headlines involving his name, at least one of them would paint him in a positive light. But you'd be wrong.\nAs much as it pains me to do this, I feel that it's high time that we take a look back into the annals of Donald Trump's sordid past and poke around for some of his highlights, or lowlights, perhaps, of 2014. It's been a big year, even by the Donald's standards, and it would be a disservice not to recognize his most ludicrous moments thus far.\nAtlantic City: \"It's Not Me\"\nWilliam Thomas Cain/Getty Images News/Getty Images\nMost recently, the Donald decided that two Atlantic City casinos, Trump Plaza and Trump Taj Mahal, were just not up to the normal standards of excellence expected of the Trump name. Concerned that the failing casinos would make him look bad — just in case he's not doing a good enough job of that on his own — Trump wanted to divorce himself entirely from the properties, and asked a court to do it for him.\nHis lawsuit reads, \"The Trump name...has become synonymous with the highest levels of quality, luxury, prestige, and success,\" which are not adjectives that can be applied to the Taj Mahal or the Plaza. The casinos are run by Trump Entertainment Resorts, but Trump no longer runs Trump Entertainment Resorts as a result of his 2009 bankruptcy.\nAnd now that he's made his comeback, he wants all memories of his previous embarrassments erased. He told the Associated Press, \"I want it off both of them. I've been away from Atlantic City for many years. People think we operate [the company], and we don't. It's not us. It's not me.\"\nNo Donald, it's not you, but I can think of things much worse than those casinos that are, most definitely, very much you.\nDonald Sterling's \"Girlfriend From Hell\" Was To Blame For His Racism\nDavid McNew/Getty Images News/Getty Images\nWhile it wasn't exactly surprising that Donald Trump decided to give his unsolicited two cents about the Donald Sterling situation, it was still cringe-worthy. You see, according to Trump, Sterling's racism was far less concerning than his \"girlfriend from hell's\" attempts at baiting into saying something inflammatory. Because obviously, Sterling's girlfriend gained control of his voice box and literally made him say, \"It bothers me a lot that you want to broadcast that you're associating with black people.\"\nIn an interview with Fox and Friends, the same program that said that Obama's inauguration was \"the most depressing day of the year,\" Trump defended Sterling, saying, \"He got set up by a very, very bad girlfriend, let’s face it.\" He continued,\nShe was baiting him and she’s a terrible human being. The way she led him along, I mean — he should know if he were there, if he was with it, he would know after one or two of those questions that she was asking that there’s something going on here.\nDonald Trump, apparently, as the poster boy of being \"with it,\" would have never been tricked into making incredibly racist remarks. He ended his commentary by saying, \"I read part of the transcript and it was ridiculous. You sort of pick that up very quickly.\" Which part of it was ridiculous, Donald? The part where Sterling told his girlfriend not to bring black people to Clippers games, or the part where he said, \"You go to Israel, the blacks are just treated like dogs?\"\nObama Pretended He Was Kenyan For The Financial Aid\nBrendan Smialowski/Getty Images News/Getty Images\nAfter finally realizing that Obama is, in fact, a natural born American citizen, Donald Trump decided to try out a new theory about the president's background.\nIn May, Donald Trump told an audience at a National Press Club lunch that there was \"a very good chance [Obama] was born [in the U.S.], and said he was born in Kenya.\" Why would the president lie about his birthplace, you ask? \"Because if you were born in Kenya,\" Trump informs us, \"You got into colleges, and you got aid. Very simple.\"\nNewzvids on YouTube\nNo seriously, he said that. Out loud.\nEbola Doctors \"Must Suffer The Consequences\"\nJohn W. Adkisson/Getty Images News/Getty Images\nTaking the idea of \"no good deed goes unpunished\" to a whole new level, the Donald made some particularly incendiary remarks, even for him, via Twitter. Insisting that Dr. Kent Brantly and his coworker Nancy Writebol should not be readmitted into the country, Trump cited the \"incompetence\" of the American government for attempting to help its own citizens.\nRussell Moore, the head of the Ethics & Religious Liberty Commission, was so horrified by Trump's remarks that he nearly forgot himself — nearly, but not quite. Said Moore via Instagram, \"I have no words for this. Actually I think I do, but the Holy Spirit won’t let me say them.\" Trump, who wouldn't know a good deed if it hit him in the head, drew significant criticism for his senseless comments, but in typical Trump fashion, has yet to apologize.\nUnfortunately, the tweets have been removed from Trump's Twitter profile, but here they are, in all their glory, as reported by the Huffington Post.\nEbola patient will be brought to the U.S. in a few days – now I know for sure that our leaders are incompetent. KEEP THEM OUT OF HERE!\nStop the EBOLA patients from entering the U.S. Treat them, at the highest level, over there. THE UNITED STATES HAS ENOUGH PROBLEMS!\nThe U.S. cannot allow EBOLA infected people back. People that go to far away places to help out are great-but must suffer the consequences!\nImages: Getty Images (4)","url":"https://www.bustle.com/articles/35545-donald-trump-in-2014-has-been-even-more-flat-out-insane-than-anticipated"}
