{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:32:26","date_modify":"2018-10-30 18:32:26","date_publish":"2018-08-17 15:43:39","description":"President Donald Trump said he never respected former CIA director John Brennan, which was partially why he withdrew his security clearance.","filename":"data/vaneerConsumption/DonaldTrumpIveNeverRespectedJohnBrennan.json","image_url":"https://media.breitbart.com/media/2017/01/donald-trump-john-brennan-ap-photos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_17__1540924346.html","title":"Donald Trump: ‘I’ve Never Respected’ John Brennan","title_page":"Donald Trump: ‘I’ve Never Respected’ John Brennan","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump said Friday he never respected former CIA director John Brennan, which was partially why he withdrew his security clearance.\nThe president commented on the issue as he left the White House to travel to Bedminster, New Jersey. Brennan is now an MSNBC contributor.\nTrump said he got a “tremendous response” for his decision to end Brennan’s security clearance.\nHe denied that he was trying to silence Brennan, a frequent critic of the president.\n“There’s no silence,” Trump said. “In many cases, I’ve given him a bigger voice. Many people don’t even know who he is.”\nHe said he was fine with giving Brennan a bigger voice because he enjoyed tackling with critics.\n“I’ve never respected him,” Trump said.\nHe cited Sen. Richard Burr’s criticism of Brennan for not briefing Congress if he believed that the president was colluding with Russia.\n“It’s a disgusting thing frankly,” he said, calling the attempt from top intelligence officials to investigate his campaign a “rigged witch hunt.”\nTrump turned his ire towards former Deputy Attorney General Bruce Ohr for communicating with the phony dossier investigator Christopher Steele after he was fired from the FBI and working with Russian oligarchs.\n“Bruce Ohr is a disgrace, with his wife Nelly, doing what he did,” he said, hinting that he was ready to take away Ohr’s security clearance too.\nHe also said that Special Counsel Robert Mueller was conflicted but said he was willing to allow the investigation to continue.\n“Let him write his report,” Trump said. “We did nothing, there is no collusion, but if he was doing an honest report, he’d write it on the other side.”","url":"https://www.breitbart.com/politics/2018/08/17/donald-trump-ive-never-respected-john-brennan/"}
