{"authors":[],"date_download":"2018-10-22 22:28:53","date_modify":"2018-10-22 22:28:53","date_publish":"2014-06-10 01:52:37","description":"Embattled Clippers owner Donald Sterling says he has decided to \"fight to keep\" the team.","filename":"data/vaneerConsumption/DonaldSterlingLashesOutatNBATheClippersAreNotforSale.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_33/498291/140609-donald-sterling-jms-2157_ec6f87fdfd1e2822e4c3a048b6641da0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_nba-race-furor_donald-sterling-lashes-out-nba-clippers-are-not-sale-n126986_1540247333.html","title":"Donald Sterling Lashes Out at NBA: The Clippers Are Not for Sale","title_page":"Donald Sterling Lashes Out at NBA: The Clippers Are Not for Sale","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDonald Sterling isn’t giving up.\nThe embattled owner of the Los Angeles Clippers said Monday he intends to “fight to keep” the basketball team, despite his lawyers' announcement that he had agreed to sell the Clippers to former Microsoft CEO Steve Ballmer.\n“From the onset, I did not want to sell the Los Angeles Clippers. I have worked for 33 years to build the Team,” Sterling said in a statement released to NBC News titled “The Team is not for Sale.”\nIt was unclear how Sterling’s statement will affect the deal he and his wife, Shelly, had made to sell the team to Ballmer for $2 billion and various additional benefits.\nIn the statement Monday, Sterling lashed out at NBA commissioner Adam Silver, who banned Sterling from the league for life in response to racist comments made by Sterling during a private conversation recorded by Sterling’s companion, V. Stiviano.\n“I believe that Adam Silver acted in haste by illegally ordering the forced sale of the Clippers, banning me for life from the NBA and imposing the fine. Adam Silver’s conduct in doing so without conducting any real investigation was wrong,” Sterling said.\nHere’s the full statement Sterling released to NBC News:","url":"https://www.nbcnews.com/storyline/nba-race-furor/donald-sterling-lashes-out-nba-clippers-are-not-sale-n126986"}
