{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 01:47:51","date_modify":"2018-10-31 01:47:51","date_publish":"2018-09-11 16:19:25","description":"A week after The New York Times published an anonymous op-ed from a White House staffer working among the \"resistance\" in the administration, the president's son is striking back. Donald Trump Jr.'s take on the anonymous op-ed is that whoever wrote…","filename":"data/vaneerConsumption/DonaldTrumpJrSaidTheAnonymousOpEdChangedWhoHisDadCanTrust.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/efbc84eb-728b-4a4b-922a-7fe261bab68a-screen-shot-2018-09-11-at-60003-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_donald-trump-jr-said-the-anonymous-op-ed-changed-who-his-dad-can-trust-11871220_1540950471.html","title":"Donald Trump Jr. Said The Anonymous Op-Ed Changed Who His Dad Can Trust","title_page":"Donald Trump Jr. Said The Anonymous Op-Ed Changed Who His Dad Can Trust","title_rss":"NULL","source_domain":"bustle.com","text":"A week after The New York Times published an anonymous op-ed from a White House staffer working among the \"resistance\" in the administration, the president's son is striking back. Donald Trump Jr.'s take on the anonymous op-ed is that whoever wrote it is a \"low-level person\" who is \"subverting the will of the people.\" He also called for a Department of Justice investigation into who authored it.\nSpeaking with Tara Palmeri for ABC’s Good Morning America, Trump Jr. called the op-ed \"disgusting\" and \"sad\" and said that it has resulted in the president relying on an ever smaller circle of trusted advisers. \"I think there are people in there that he can trust, it's just — it's a much smaller group than I would like it to be,” Trump Jr. told Palmeri.\nIvanka and Jared, though, should consider themselves safe. \"I’m talking outside family. That goes without saying,\" Trump Jr. said. Who other trusted confidents might be, he's keeping to himself.\nHaving just a limited inner circle hampers the administration's agenda, Trump Jr. suggested. \"It would be easier to get things done if you’re able to fully trust everyone around you,\" Trump Jr. told Palmeri. \"I think that’s a shame.\"\nQuestioned as to what laws were broken by the op-ed's author, Trump Jr., pointed to what he sees as the issue at hand:\nListen, I think you're subverting the will of the people. I mean, to try to control the presidency while not the president. You have millions and millions of Americans who voted for this.\nThe calls for investigations have been made not just by the president's son but also the administration. Press Secretary Sarah Huckabee Sanders said at a briefing Monday that the DOJ should \"look into\" who wrote it.\nIn the interview, Trump Jr. also contemplated his fate with regards to the Mueller investigation. He implied that his role with the Russia meeting at Trump Tower would only go somewhere if prosecutors \"try to create something.\"\n\"I mean, we’ve seen that happen with everything,” he said. “I understand that they are trying to get my father, and they’ll do anything they can to get that.”\nBut personally, he's not concerned. \"I’m not, because I know what I did and I’m not worried about it,\" Trump told Palmeri.\nTrump Jr. also warned that he thought that if Democrats take control of Congress, impeachment will be on the table. And he tried to do what he's done on the campaign trail the last few months, get out the votes of his father's supporters. Typically a president can lose control of Congress two years into his term, like Obama in 2010 or Clinton in 1994.\n\"I think historically speaking, that would be what happens,” Trump Jr. told Palmeri. “You know, people get complacent. Our side is getting all the things that they're wanting to because my father's delivering on all of the promises that he made. But that's what they've said, and that's what's historical.\"\n“So our people, the MAGA people, they have to turn out. They have to get out and vote. And I think we can break history,” Trump added.\nDemocrats are also counting on voters turning out, and that anonymous op-ed could play a role.","url":"https://www.bustle.com/p/donald-trump-jr-said-the-anonymous-op-ed-changed-who-his-dad-can-trust-11871220"}
