{"authors":["Joshua Caplan"],"date_download":"2018-10-30 17:50:34","date_modify":"2018-10-30 17:50:34","date_publish":"2018-10-30 15:15:33","description":"President Trump is seeking $342,000 in lawyer fees from Stormy Daniels after a judge dismissed her defamation lawsuit against him.","filename":"data/vaneerConsumption/DonaldTrumpSeeks342000fromStormyDanielsforLawyerFees.json","image_url":"https://media.breitbart.com/media/2018/07/wi/ap/23/fbe0e5_trump-porn-star-divorce-97379-stormy-daniels-in-16-2018-file-photo-adult-e1532480839510.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30__1540921834.html","title":"Donald Trump Seeks $342,000 from Stormy Daniels for Lawyer Fees","title_page":"Donald Trump Seeks $342,000 from Stormy Daniels for Lawyer Fees","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump is seeking $342,000 in lawyer fees from pornography actress Stormy Daniels after a federal judge dismissed her defamation lawsuit against the commander-in-chief this month.\nIn a filing submitted to a Los Angeles court on Monday, President Trump wrote that Daniels, whose real name is Stephanie Clifford, “filed this action, not because it had any merit, but instead for the ulterior purposes of raising her media profile, engaging in political attacks against the president by herself and her attorney, who has appeared on more than 150 national television news interviews attacking the President and now is exploring a run for the presidency himself in 2020.”\nOn October 15, U.S. District Judge S. James Otero tossed Daniels’ lawsuit stemming from an April tweet by the president, stating a composite sketch of a man she said threatened her in 2011 to keep silent about an alleged affair with the real estate billionaire was a “con job.”\nThe president said the man was “nonexistent” and that the pornstar was playing the “fake news media for fools.” Further, President Trump retweeted a picture comparing the sketch with a photo of Daniels’ then-husband Glendon Crain. “To allow the complaint to go forward and to have one consider this to be defamatory in the context it was made would have a chilling effect,” said the judge.\n“We now know that Trump believes in legalizing marijuana,” Michael Avenatti, Daniels’ attorney and 2020 Democrat hopeful, wrote in an email to Bloomberg. “This request is nothing compared to what he will owe my client.”\nFollowing the lawsuit’s dismissal, President Trump took to Twitter to ridicule both Daniels and Avenatti.\n“Great, now I can go after Horseface and her 3rd rate lawyer in the Great State of Texas,” the president tweeted. “She will confirm the letter she signed! She knows nothing about me, a total con!”\n“Federal Judge throws out Stormy Danials lawsuit versus Trump. Trump is entitled to full legal fees.” @FoxNews Great, now I can go after Horseface and her 3rd rate lawyer in the Great State of Texas. She will confirm the letter she signed! She knows nothing about me, a total con! — Donald J. Trump (@realDonaldTrump) October 16, 2018\nDaniels filed a lawsuit against both President Trump and his longtime personal attorney, Michael Cohen, who purportedly negotiated an agreement allowing the pornstar to speak publicly about an alleged 2006 affair between her and the president.","url":"https://www.breitbart.com/politics/2018/10/30/donald-trump-seeks-342000-stormy-daniels-defamation-lawsuit-dismissed/"}
