{"authors":["Francesca Chambers","White House Correspondent","David Martosko","Us Political Editor For Dailymail.Com"],"date_download":"2018-10-23 02:48:48","date_modify":"2018-10-23 02:48:48","date_publish":"2016-01-11 15:17:10","description":"'Is he a natural-born citizen?' Trump asked a Reno, Nevada audience. The crowd answered 'No!' But The Donald said, 'I don't know...Honestly, we don't know. Who the hell knows?'","filename":"data/vaneerConsumption/DonaldTrumpaddsBruceSpringsteensBornintheUSAtoprerallyplaylist.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300194CD00000578-0-image-a-7_1452525426216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393950_Who-hell-knows-Trump-continues-passive-aggressive-birther-slam-Ted-Cruz-gets-Nevada-audience-weigh-senator-s-citizenship_1540262928.html","title":"Donald Trump adds Bruce Springsteen's 'Born in the U.S.A.' to pre-rally playlist","title_page":"Donald Trump adds Bruce Springsteen's 'Born in the U.S.A.' to pre-rally playlist | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump found a new way to troll Sen. Ted Cruz on Sunday, adding Bruce Springsteen's signature tune 'Born in the U.S.A.' to the playlist of songs his staffers blast over loudspeakers before every campaign rally.\nThe 1984 song, which has a dour outlook on the U.S. – like The Donald's oft-repeated claim that 'we don't win anymore' – is the first change to the rotation since he ended a brief run of Christmas carols two weeks ago.\nWhen Trump appeared on state in Reno, Nevada, he continued a recent drumbeat of questions about Cruz's eligibility to become president, asking his audience for their opinion on the legal matter.\n'Is he a natural-born citizen?' Trump said Sunday in Reno.\nThe crowd responded 'No!' while Trump played coy and said he wasn't sure.\n'I don't know,' he said. 'Honestly, we don't know. Who the hell knows?'\nDonald Trump continued to raise questions about Republican opponent Ted Cruz's eligibility to become president during a Nevada rally, asking his audience for their opinion on the legal matter\n'Is he a natural-born citizen?' Trump said Sunday in Reno. The crowd said 'no' while Trump said he wasn't sure. 'I don't know,' he said. 'Honestly, we don't know. Who the hell knows.'\nAs Cruz has gained ground in Iowa, Trump has unlaced his gloves and suggested his rival would spend the first two years of his presidency fighting court battles over his right to the presidency\nTrump has tried to cast a shadow over Cruz's legal standing in the days leading up to the next presidential debate.\n'Cruz is a problem,' Trump said at the Reno rally. 'And here's the problem: It's called uncertainty. It's called you just don't know.'\nThe Republican presidential candidate was born in Canada. But his mother was a U.S. citizen. Legal precedent is to consider the children of American citizens born abroad 'natural-born.'\n'The law is simple and straightforward, and it's actually come up a bunch of times in our nation's history,' Cruz said yesterday on CNN's State of the Union, pointing out that John McCain, the GOP's 2008 nominee, was born in Panama.\nBarry Goldwater, the party's 1964 nominee, was born in Arizona when it was still a territory, he noted.\n'So as a legal matter, this question is straightforward,' he said.\nNot so, says Trump. He told his audience yesterday, 'This is not a settled matter.'\n'Does anyone know more about litigation than Trump?' he said. 'Okay? I know a lot. I'm like a PhD in litigation.'\nHe said Saturday while campaigning in Iowa, 'You can't have a person running for office, even though Ted is very glib, and he goes out and says, \"Well, I'm a natural born citizen.\" '\n'The point is, you're not.'\n'BORN IN THE U.S.A. – BRUCE SPRINGSTEEN'S LYRICS The 1984 rock classic 'Born in the U.S.A.' is a downcast look at the United States – a country that matches up with Donald Trump's complaints about a nation that 'doesn't win anymore.' Trump added the tune to his pre-rally playlist at a time when he's waging a passive-aggressive battle with Ted Cruz over the Canadian-born Texas senator's eligibility to be president.\nBorn down in a dead man's town The first kick I took was when I hit the ground You end up like a dog that's been beat too much Till you spend half your life just covering up Born in the U.S.A. (REFRAIN) Got in a little hometown jam so they put a rifle in my hand Sent me off to a foreign land to go and kill the yellow man Born in the U.S.A. (REFRAIN) Come back home to the refinery Hiring man says \"son if it was up to me\" Went down to see my V.A. man He said \"son don't you understand now\" Had a brother at Khe Sahn fighting off the Viet Cong They're still there he's all gone He had a woman he loved in Saigon I got a picture of him in her arms now Down in the shadow of penitentiary Out by the gas fires of the refinery I'm ten years burning down the road Nowhere to run ain't got nowhere to go Born in the U.S.A. (REFRAIN) I'm a long gone daddy in the U.S.A. Born in the U.S.A. (REFRAIN) I'm a cool rocking daddy in the U.S.A.\nToday Rand Paul jumped on the bandwagon during a Fox News interview.\n'Cruz is a natural-born Canadian,' Paul said of his Senate colleague, according to CNN. 'He was naturally born there.'\nPaul said,'The question is, can you be natural-born Canadian and natural-born American at the same time? Maybe, but I think the courts will have to decide it, because it's never really been decided.'\nDistancing himself from the line of attack Paul said he was merely rehashing a Democratic line of attack against Cruz.\n'There is one Democratic congressman who said he will file a lawsuit over this,' he said, in reference to Alan Grayson of Florida. 'It is not me, it's whether or not Democrats pursue it, and I think they will.'\nEarlier this year Trump endorsed Cruz's argument that he meets the constitutional requirements to become president.\nAs the GOP senator has gained ground in Iowa, Trump has unlaced his gloves and suggested his rival would spend the first two years of his presidency fighting court battles over his right to the presidency.\n'I just heard this: He was a citizen of Canada for a long time,' Trump said. 'He was a citizen of the United States, I believe, and Canada simultaneously. How do you, how -- what's going on here? So, he's got to straighten these things out.'\nCruz did have dual citizenship in Canada and the U.S. having been born abroad. He preemptively renounced his Canadian citizenship in 2014.\nAs Trump hammered him on Sunday he said Cruz, a Texas senator since 2012, should have taken steps to do that years ago, before he ran for elected office.\n'Does he get a pass from that?' Trump asked. His supporters again said, 'No.'\nMcCain, Trump pointed out was born on a military base in Panama.\n'I understand that,' he said, to cheers. 'That's good: Parents are military, they're on a base. What are you going to do?'\nThe Republican presidential candidate, seen here on Friday in Iowa, was born in Canada. But his mother was a U.S. citizen. Legal precedent is to consider the children of American citizens born abroad 'natural-born'\nThe Post says Trump also went after Cruz on immigration, characterizing him as 'weak' on the issue and declaring him 'totally in favor of amnesty.' He also hit him for copying his idea to build a wall along the United States' border with Mexico.\nMarco Rubio has also drilled into Cruz on immigration.\nThe last time GOP White House candidates faced off Rubio claimed that like him, Cruz used to support legalization. He pointed to an amendment Cruz proposed during the Senate's 2013 immigration debate that would have significantly increased the number of visas available to skilled workers.\nCruz and his allies say it was a 'poison pill' meant to sink the immigration reform bill that Rubio, McCain, and a group of six other senators were trying to push through.\n'I have never supported legalization and I do not intend to support legalization,' Cruz told Rubio during the mid-December face-off in Las Vegas.\nRepublicans debate again on Thursday in Charleston, South Carolina. Trump will again be in the hot seat as the front runner in the race.\nCruz, who has risen through the ranks to second, will likely find himself fending off attacks about both issues – immigration and natural born citizenship – as the remaining contenders fight for his foothold less than weeks out from the official start of the 2016 competition.","url":"https://www.dailymail.co.uk/news/article-3393950/Who-hell-knows-Trump-continues-passive-aggressive-birther-slam-Ted-Cruz-gets-Nevada-audience-weigh-senator-s-citizenship.html"}
