{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:42:49","date_modify":"2018-10-30 19:42:49","date_publish":"2017-04-21 19:50:38","description":"President Donald Trump previewed a major announcement on tax reform next week, as he signed a series of executive orders and spoke to reporters at the Treasury Department | Politics","filename":"data/vaneerConsumption/DonaldTrumpPreviewsBigAnnouncementonTaxReformNextWeek.json","image_url":"https://media.breitbart.com/media/2017/04/Trump-Mnuchin-Evan-VucciAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_04_21__1540928569.html","title":"Donald Trump Previews ‘Big Announcement’ on Tax Reform Next Week","title_page":"Donald Trump Previews ‘Big Announcement’ on Tax Reform Next Week | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump previewed a major announcement on tax reform next week, as he signed a series of executive orders and spoke to reporters at the Treasury Department.\n“The process began long ago, but it really formally begins on Wednesday,” he said, referring to tax reform.\nThe executive orders will allow the Secretary of the Treasury, Stephen Mnuchin, to start looking for ways to simplify the tax code and change the cumbersome regulatory burden on businesses.\n“People can’t do their returns. They have no idea what they’re doing. They’re too complicated,” Trump said.\n“I look forward to taking a hard look at the regulatory burden of our tax code, which consumes billions of productive hours and compliance costs.”\nTrump said that his administration would continue to press for tax reform, promising that it would help “struggling Americans achieve their financial dreams.”\n“Together, we will restore prosperity to this nation, a nation that we so dearly love, and to bring people who call this home into a great, great way of living and a great way of life,” he said.","url":"https://www.breitbart.com/politics/2017/04/21/donald-trump-previews-big-announcement-on-tax-reform-next-week/"}
