{"authors":["Alex Swoyer"],"date_download":"2018-10-30 20:18:00","date_modify":"2018-10-30 20:18:00","date_publish":"2015-08-23 19:28:11","description":"“Donald Trump says he'll take donations to his presidential campaigns, but not from lobbyists who will expect something in return,” CNN says","filename":"data/vaneerConsumption/DonaldTrumpWillTakeCampaignDonationsbutNotfromLobbyistsorSpecialInterests.json","image_url":"https://media.breitbart.com/media/2015/08/Trump-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_23__1540930680.html","title":"Donald Trump Will Take Campaign Donations–but Not from Lobbyists or Special Interests","title_page":"Donald Trump Will Take Campaign Donations--but Not from Lobbyists or Special Interests | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP presidential candidate Donald Trump says he will accept donations for his 2016 campaign but with no strings attached.\n“Donald Trump says he’ll take donations to his presidential campaigns, but not from lobbyists who will expect something in return,” reported CNN on Sunday.\nThe real estate mogul also said hedge fund managers “get away with murder,” hinting he believes they would pay higher taxes if Trump were elected president.\nTrump’s statements were made during a Sunday interview on CBS’s Face the Nation where he said he would take donations but said his own history of donating to political campaigns leaves him apprehensive of certain contributions – mainly those from lobbyists.\n“Look, I know the people that want something. I’ve been doing this all my life. I’ve been a very big contributor to many, many people on all sides for many, many years,” Trump stated. “I don’t want lobbyists. I don’t want special interests.”\n“He said he recently took a check for $7.23 from a woman who sent “a beautiful little letter” saying it was ‘all she had,’” reported CNN.\nTrump followed that up by sharing that he rejected a lobbyist donation of $5 million because he thought that donor would want favors in return.\n“Certainly I would take contributions, I actually like the idea of investing in a campaign,” said Trump. “But it has to be no strings attached. I don’t want any strings attached.”\nTrump also said he would lower tax rates for the middle class but hike them for hedge fund managers if he were elected president.\n“You know, the hedge fund guys didn’t build this country. These are guys that shift paper around. And they get lucky,” Trump challenged. “Look, they’re energetic. They’re very smart. But a lot of them, it’s, like, they’re paper pushers. They make a fortune. They pay no tax. It’s ridiculous, OK?”\n“The hedge fund guys are getting away with murder. They’re making a tremendous amount of money — they have to pay tax,” said Trump. “I want to lower the rates for the middle class. The middle class is the one. They’re getting absolutely destroyed. This country, it won’t have a middle class very soon.”","url":"https://www.breitbart.com/politics/2015/08/23/donald-trump-will-take-campaign-donations-but-not-from-lobbyists-or-special-interests/"}
