{"authors":["Charlie Spiering"],"date_download":"2018-10-30 20:31:43","date_modify":"2018-10-30 20:31:43","date_publish":"2017-04-03 18:20:44","description":"President Donald Trump praised Egyptian president President Abdel Fattah el-Sisi, announcing support for his administration. | Politics","filename":"data/vaneerConsumption/DonaldTrumpWelcomesEgyptianPresidenttoWhiteHouseHesDoneaFantasticJob.json","image_url":"https://media.breitbart.com/media/2017/04/Trump-al-Sisi-BRENDAN-SMIALOWSKI-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_04_03__1540931503.html","title":"Donald Trump Welcomes Egyptian President to White House: ‘He's Done a Fantastic Job’","title_page":"Donald Trump Welcomes Egyptian President to White House: ‘He's Done a Fantastic Job’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump praised Egyptian president President Abdel Fattah el-Sisi, announcing support for his administration.\n“He’s done a fantastic job in a very difficult situation,” Trump said. “We are very much behind Egypt and the people of Egypt.”\nAl-Sisi was largely shunned by the Obama administration, as he led the military coup to topple President Mohamed Morsi, a leader of the Muslim Brotherhood. Trump met with al-Sisi in New York during the presidential campaign, building the relationship in September 2016.\nBoth Trump and al-Sisi are committed to fight against radical Islamic terrorism.\n“We will fight terrorism and other things and we’re going to be friends for a long, long period of time,” Trump said.\nAl-Sisi praised Trump’s leadership, especially his public statements against radical terrorists, which he described as “a satanic ideology.”\n“I’ve had a deep appreciation and admiration of your unique personality, especially as you are standing very strong in the counter-terrorism field,” he said. “To counter this evil ideology that is claiming innocent lives, that is bringing devastation to communities and nations, and that is terrorizing the innocent people.”","url":"https://www.breitbart.com/politics/2017/04/03/donald-trump-welcomes-egyptian-president-to-white-house-hes-done-a-fantastic-job/"}
