{"authors":["David Martosko","Us Political Editor For Dailymail.Com In Des Moines"],"date_download":"2018-10-23 04:09:07","date_modify":"2018-10-23 04:09:07","date_publish":"2016-01-28 20:00:30","description":"The fundraising website is run by the Donald J. Trump Foundation, which promises that '100% of your donations will go directly to Veterans needs.'","filename":"data/vaneerConsumption/DonaldTrumpsIowaveteranseventwillraisemoneyforhisownfoundation.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30A67B2100000578-0-image-a-7_1454010945409.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421621_Trump-s-Iowa-veterans-event-raise-money-foundation_1540267747.html","title":"Donald Trump's Iowa 'veterans' event will raise money for his own foundation","title_page":"Donald Trump's Iowa 'veterans' event will raise money for his own foundation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump's highly publicized veterans fundraiser on Thursday night will benefit his own charitable foundation, DailyMail.com can reveal.\nUltimately, Trump's press secretary Hope Hicks said Thursday afternoon, 'the money will go to a number of Veterans charities and organizations.'\nThe campaign has been coy about which organizations will eventually see a cash infusion.\nTrump tweeted on Thursday: 'It is my great honor to support our Veterans with you! You can join me now. Thank you! #Trump4Vets http://www.DonaldTrumpForVets.com.'\nThe link goes to a website run by the Donald J. Trump Foundation, which promises that '100% of your donations will go directly to Veterans needs.'\nHe told Fox News host Bill O'Reilly on Wednesday night that 'we're going to raise a lot of money for the veterans. A lot of money is going to be raised. A lot of people are going to be there, and I can do some good.'\nSCROLL DOWN FOR VIDEOS\nDONALD TRUMP FOR VETS: The Republican presidential front-runner is raising money through his private foundation to benefit veterans charities but his campaign wont say which ones\nDRAMA: Trump's veterans fundraiser will compete head-to-head with a Republican debate in Iowa\n'100%': Trump's foundation pledges that every penny donated through the website 'will go directly to Veterans needs'\nThe DonaldTrumpforVets.com Web domain was registered early Thursday morning, Internet records show, by Brad Parscale, the San Antonio-based website developer who handles Trump's campaign website.\nHicks did not respond to a question about whether using the foundation as a pass-through vehicle was a last-minute decision.\nBut even The Donald didn't seem to be in the loop about the website's final name, mistakenly tweeting at first that 'trumpforveterans.com' would be the repository for donations.\nTrump has made the treatment of American military veterans a centerpiece of his campaign, complaining at public rallies that the Obama administration's Department of Veterans Affairs needs a dramatic overhaul.\nHe appeared in September aboard the USS Iowa in the Los Angeles harbor, saying against a backdrop of seafaring cannons that 'we have illegal immigrants that are treated better than our veterans.'\nTrump announced this week that he would skip Thursday's Fox News Channel/Google debate, the last one of its kind before Monday's Iowa caucuses, because the network trolled him with a sarcastic statement suggesting he was afraid to face questions from moderator Megyn Kelly.\nKelly and Trump have a longstanding feud that dates back to the first Fox News debate in August, when she led off the event with a tough question about the billionaire's past barbs aimed at women he didn't like.\nInstead, he is hosting his own rally less than 2 miles away. Mike Huckabee and Rick Santorum, the winners of the last two Iowa GOP caucus contests, will join him after they participate in the 'undercard' debate reserved for low-polling Republicans.\nLAST MINUTE PLAN? The Trump veterans fundraising website was set up in the wee hours of Thursday morning, just hours before he started tweeting about it\nThe Trump foundation itself has a spotty record to date of donating to veterans charities, one that will likely see a reinvention if The Donald's supporters donate heavily this week.\nIts future donations won't be publicly known until its 2016 taxes are filed, which won't happen until at least the middle of 2017 – long after the election that will either make him President of the United States or send him back to the real estate world.\nThe foundation could alternatively choose to publish a list of donations long before then, and Trump's rivals may insist on it.\nForbes magazine reported in October that '[t]he Donald J. Trump Foundation has donated $5.5 million to 298 charities between 2009 and 2013 (the most recent year available), according to the non-profit's 990 tax forms from those years.'\n'Of that, only $57,000 has been donated to seven organizations that directly benefit military veterans or their families. ... Wounded Warriors was not among the organizations Trump's foundation gave to in that time period.'\nBut Hicks told The Weekly Standard on Wednesday that the Republican front-runner has dipped into his own pockets to support vets.\n'Mr. Trump has made significant financial and in kind contributions to many Veterans organizations, personally and not through the Donald J. Trump foundation,' she said.\nOne veterans group, Iraq and Afghanistan Veterans of America, said Tuesday that it will decline any money from Trump's Des Moines event.\nTHE RIGHT TWEET: Trump had to delete his first promotional tweet about the fundraiser after he sent out the wrong website address – getting it right the second time\n'Donald Trump is not a leader in veterans' philanthropy, unless he's donated a lot of money that nobody knows about,' the group's president Paul Rieckhoff, an Iraq War veteran, told The New York Times last year.\nRieckhoff tweeted Tuesday: 'If offered, @IAVA will decline donations from Trump's event. We need strong policies from candidates, not to be used for political stunts.'\nTrump's foundation has attracted unwelcome attention in the past after The Smoking Gun reported that the billionaire had never donated to charities engaged in relief work following the 9/11 terror attacks in 2001.\nThat report was based on an analysis of the Trump Foundation's tax returns.","url":"https://www.dailymail.co.uk/news/article-3421621/Trump-s-Iowa-veterans-event-raise-money-foundation.html"}
