{"authors":["Renae Reints"],"date_download":"2018-10-31 01:52:45","date_modify":"2018-10-31 01:52:45","date_publish":"2018-09-06 04:30:59","description":"Nike's ad celebrating the 30th anniversary of its classic motto, \"Just Do It,\" stars a familiar athlete. It's the man who started a movement: the first player to kneel during an NFL national anthem, protesting police brutality against people of…","filename":"data/vaneerConsumption/DonaldTrumpJrMocksColinKaepernicksNikeAdByReplacingTheAthletesFaceWithPOTUS.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/8ef4e04f-877e-481f-ac73-5bed026b96ac-getty-1009181184.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_donald-trump-jr-mocks-colin-kaepernicks-nike-ad-by-replacing-the-athletes-face-with-potus-11770214_1540950765.html","title":"Donald Trump Jr. Mocks Colin Kaepernick's Nike Ad By Replacing The Athlete's Face With POTUS","title_page":"Donald Trump Jr. Mocks Colin Kaepernick's Nike Ad By Replacing The Athlete's Face With POTUS","title_rss":"NULL","source_domain":"bustle.com","text":"Nike's ad celebrating the 30th anniversary of its classic motto, \"Just Do It,\" stars a familiar athlete. It's the man who started a movement: the first player to kneel during an NFL national anthem, protesting police brutality against people of color. Never a fan of this movement, President Donald Trump is not happy with Nike's decision, and his son is on his side. Donald Trump Jr. mocked Colin Kaepernick's Nike ad by posting his own alternative version of it on Instagram.\n\"There, fixed it for you. #maga,\" Trump Jr. wrote Wednesday evening on Instagram, using the Trump campaign's hashtag. In his edited photo, Kaepernick's face is replaced with Trump's under the words \"Believe in something. Even if it means sacrificing everything.\"\nEven though the ad was only revealed a few days ago, it has quickly become a political movement. Those critical of the NFL protests started a #NikeBoycott campaign, full of burning shoes and cut-up socks expressing their anger and disdain.\nPresident Trump's original response to the ad campaign was surprisingly mannered considering his long history of berating the NFL for allowing the protests (even going as far as starting a petition against ESPN for not airing the national anthem), but his fire was back in a Twitter storm Wednesday morning.\n\"Just like the NFL, whose ratings have gone WAY DOWN, Nike is getting absolutely killed with anger and boycotts,\" wrote Trump. \"I wonder if they had any idea that it would be this way? As far as the NFL is concerned, I just find it hard to watch, and always will, until they stand for the FLAG!\"\nTrump has never supported Kaepernick's protests, which began in 2016. The former 49ers quarterback claims the NFL has colluded against him since then, blocking him from playing another season, but the NFL denies this reasoning.\nAlthough Trump hasn't called Kaepernick out by name on Twitter, the president has consistently called for the NFL to force players to stand.\n\"Very important that NFL players STAND tomorrow, and always, for the playing of our National Anthem. Respect our Flag and our Country!\" Trump tweeted a year ago.\nThe NFL changed regulation earlier this year, requiring all players present on the field to stand during the anthem (unless their team is willing to pay a fine). Players are not, however, required to be on the field during the anthem. Instead of kneeling, they can remain in the locker room — an amendment Trump did not like.\nWhile there are some angry Nike fans on Trump's side (over 92,000 had liked Trump Jr.'s Instagram post by Wednesday night), many people support the sportswear company's choice. Serena Williams, who appears in the ad, tweeted on Monday that she is \"especially proud to be a part of the Nike family today.\"\nThe video, featuring Kaepernick's narration over images of diverse athletes, has already been released on social media, but it's expected to run on music, gaming, and entertainment platforms as well, CBS reports. It will officially air for the first time during the NFL season opener Thursday night.","url":"https://www.bustle.com/p/donald-trump-jr-mocks-colin-kaepernicks-nike-ad-by-replacing-the-athletes-face-with-potus-11770214"}
