{"authors":[],"date_download":"2018-10-22 21:41:31","date_modify":"2018-10-22 21:41:31","date_publish":"2016-06-04 00:00:00","description":"Multiple superPACs are vying for the Trump campaign's stamp of approval even as they woo wealthy donors.","filename":"data/vaneerConsumption/DonaldTrumpHatesSuperPACsButHeNeedsTheirMoneyAgainstHillaryClintonNPR.json","image_url":"https://media.npr.org/assets/img/2016/06/06/gettyimages-511242124_wide-f99e859238f96f47f3e957b538f530fdeadf1391.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=480731335_1540244491.html","title":"Donald Trump Hates SuperPACs, But He Needs Their Money Against Hillary Clinton : NPR","title_page":"Donald Trump Hates SuperPACs, But He Needs Their Money Against Hillary Clinton : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nThe Trump for president effort is what might politely be called frugal, but the push from here to November's expected to cost at least a billion dollars. The easiest way to raise that kind of money is one that Mr. Trump has so far scorned - super PACs. Here's NPR's Peter Overby.\nPETER OVERBY, BYLINE: Super PACs have no contribution limits, so they're perfect for million-dollar donors. The problem is Donald Trump hates them.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDONALD TRUMP: We have to do something about super PACs because super PACs now are running the country.\nOVERBY: This is Trump last January at Liberty University in Virginia.\n(SOUNDBITE OF ARCHIVED RECORDING)\nTRUMP: Got to get rid of super PACs really, really, really bad.\nOVERBY: He even had his lawyer tell pro-Trump super PACs to get lost. For his primary campaign, Trump himself paid roughly 75 percent of the tab. Now, though, super PAC-level money is needed. At Least four super PACs are competing to be the one favored by the Trump campaign. Just this week, real estate investor Tom Barrack launched Rebuilding America Now. Barrack has an edge in the battle for approval. He and Trump are longtime friends. On CNN Money last month, Barrack described Trump this way.\n(SOUNDBITE OF ARCHIVED RECORDING)\nTOM BARRACK: As big a personality as he is, his heart really sits in the shoes of the average guy.\nOVERBY: Barrack told CNN the super PAC already has pledges for $32 million. Then there's the Great America PAC. Eric Beach is one of its co-chairs.\nERIC BEACH: We know who the Trump donors/supporters are and our message is very wide. It's cast very wide.\nOVERBY: As evidence of the PAC's political talent, Beach name-checked their lead strategist, veteran Republican consultant Ed Rollins.\nBEACH: And I don't think that there is confusion in the marketplace. I think people are aware of who we are. I think we have one of the top strategists in the country in Ed Rollins. And, you know, we have a nice head start.\nOVERBY: Great America PAC launches a series of fundraising events next week. At the Committee for American Sovereignty, director Doug Watts said the donors want clarity from Trump.\nDOUG WATTS: Well, right now he hasn't indicated he likes any of them (laughter). And so, you know, that's a little bit of a handicap.\nOVERBY: Watts said his super PAC is donor-friendly.\nWATTS: They'll be able to see what the advertisements are. They'll be able to have feedback. They'll feel good about our Hispanic outreach program.\nOVERBY: And a fourth super PAC is in its early stages under the guiding hand of casino magnate Sheldon Adelson. Legally speaking, these super PACs are independent of the Trump campaign. Donors need a signal of where to send money for the greatest impact and the most influence. So Trump needs to perform a little ritual of modern politics - the blessing of the super PAC. Our guide here is lobbyist Republican adviser and former Congressman Vin Weber.\nVIN WEBER: Normally, the way it works, the candidate will go to a potential large donor and ask for the amount of money that they are legally allowed to give to the formal campaign.\nOVERBY: That's $5,400, just a setup for the real ask.\nWEBER: And please direct any additional money you want to give toward this super PAC.\nOVERBY: That's all it takes to start spreading the word so the money can flow. But having an allied super PAC might be tricky for a candidate who even writes his own tweets.\nWEBER: He is very hands-on, runs his own operation, makes his own decisions.\nOVERBY: Weber said it may be a rough transition.\nWEBER: He's going to end up seeing things done on his behalf by people that are totally out of his control.\nOVERBY: The Trump campaign didn't respond to NPR's request for comment. For now, some million-dollar donors are waiting for a sign from Trump Tower. Peter Overby, NPR News, Washington.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=480731335"}
