{"authors":["Charlie Spiering"],"date_download":"2018-10-30 17:53:50","date_modify":"2018-10-30 17:53:50","date_publish":"2018-06-27 18:36:33","description":"President Donald Trump reacted to Justice Anthony Kennedy’s decision to retire from the Supreme Court, promising conservatives that he nominate a Constitutional originalist to replace him.","filename":"data/vaneerConsumption/DonaldTrumpPromisesAnthonyKennedyReplacementfromConservativeList.json","image_url":"https://media.breitbart.com/media/2018/06/GettyImages-985322574.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_27__1540922030.html","title":"Donald Trump Promises Anthony Kennedy Replacement from Conservative List","title_page":"Donald Trump Promises Anthony Kennedy Replacement from Conservative List | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump reacted to Justice Anthony Kennedy’s decision to retire from the Supreme Court, promising conservatives that he nominate a Constitutional originalist to replace him.\nThe president said that the search for Kennedy’s replacement would begin “immediately” and would come from his list of conservative judges that he released during the campaign.\n“We have a very excellent list of great, talented, highly educated, highly intelligent, hopefully, tremendous people,” Trump said. “I think the list is very outstanding.”\nThe list of 25 potential candidates was last updated by the White House in November 2017 to include five additional names for consideration.\nThe president commented on the issue while welcoming the president of Portugal to the White House, speaking to reporters in the Oval Office. Trump thanked Kennedy for his service.\n“He’s a man that I’ve known for a long time and a man that I’ve respected for a long time,” Trump said about Kennedy. “Hopefully we’ll pick somebody that is as outstanding.”\nThe president said that he met with Kennedy at the White House earlier on Wednesday and thanked him for his service. He also said that he asked Kennedy for any suggestions for his replacement, but did not reveal any recommendations.\nHe also commented on the “vital” role of the Supreme Court and said that it was one of the most important roles of the United States.\nThe White House also released a statement in reaction to the news:","url":"https://www.breitbart.com/politics/2018/06/27/donald-trump-promises-anthony-kennedy-replacement-from-conservative-campaign-list/"}
