{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:56:57","date_modify":"2018-10-22 20:56:57","date_publish":"2016-01-29 04:53:49","description":"Beaming in a cream and gold dress, heavily-pregnant Ivanka waved to the crowds from the front row of her father's fundraiser for veterans in Des Moines on Thursday night.","filename":"data/vaneerConsumption/DonaldTrumpsfundraiserseesIvankaandMelaniaflashsmilesonthefrontrow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEE82A00000578-0-image-a-27_1454043222847.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422187_United-Ivanka-Melania-flash-dazzling-smiles-row-Donald-Trump-s-fundraiser-family-shuns-Fox-debate_1540241817.html","title":"Donald Trump's fundraiser sees Ivanka and Melania flash smiles on the front row","title_page":"Donald Trump's fundraiser sees Ivanka and Melania flash smiles on the front row | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump's rivals warned he risked everything by boycotting the Fox News debate on Thursday.\nBut judging by his family's carefree smiles, it seems they couldn't be less concerned.\nBeaming in a cream and gold dress, heavily pregnant Ivanka waved to the crowds from the front row of her father's fundraiser for veterans in Des Moines on Thursday night.\nShe was flanked by her stepmother Melania, who looked equally chic in a button-down navy coat, as well as brothers Eric and Don Jr.\nScroll down for video\nBeaming in a cream and gold dress, heavily-pregnant Ivanka waved to the crowds from the front row of her father's fundraiser for veterans in Des Moines on Thursday night\nIvanka is set to have her third child in just weeks. Ivanka (right) pictured above at last night's event with her husband, Jared Kushner (left)\nIvanka, her father's deputy at the family business, has been a stalwart of his campaign\nMelania, who looked equally chic in a button-down navy coat, stood up to give the crowds a wave\nMembers of the secret service told DailyMail.com that young Baron Trump, Donald's son with Melania, did not attend the fundraiser on Thursday\nMelania looked glamorous in a navy blue peacoat and her long brown hair perfectly coiffed\nTrump posted this picture of him with his sons Eric, (in back left corner) and Donald Jr (second right), and former Arkansas Governor Mike Huckabee (center) from the rally Thursday night\nThe family put on a united front and smiles as the packed-out stadium roared with cheers.\nThey have been stalwarts of Donald's campaign since he declared last year, attending every event and giving interviews on his behalf.\nIvanka, who is just weeks away from giving birth to her third child, has been key.\nAt the end of the event last night, Trump called out to his eldest daughter, saying: 'Ivanka, it would be so great if you had your baby in Iowa! I’d definitely win!'\nDespite the controversies surrounding the real estate mogul, he has maintained his lead in the GOP field\nThree veterans give Trump, right, a 22 Kill Honor Ring that represents twenty veterans that kill themselves daily by suicide during a rally on the Drake University campus at a special event to benefit veterans on Thursday\nA veteran chants for Trump as he waits for the Republican presidential front-runner to address veterans at Drake University on January 28\nDonald Trump Jr posted this picture on Instagram saying he was joining his father in Des Moines, Iowa\nAbove, a view of Trump's private plane on the tarmac in Iowa after he arrived Thursday night for a veterans benefit event\nEven Melania has begun discussing her husband's work as the possibility that she could be America's First Lady strengthens.\nDespite the controversies surrounding the real estate mogul, he has maintained his lead in the GOP field.\nIt is not yet clear whether his decision to boycott the debate will derail his lead come the Iowa caucus on February 1.\nEarlier on Thursday, Don Jr posted a picture on Instagram to let his followers know that he would be joining his father in Des Moines that night, and the whole family would be in town to speak to voters until the vote is over.\nMembers of the secret service told DailyMail.com, young Baron Trump, Donald's son with Melania, did not attend the fundraiser on Thursday.\nWhile Trump was holding his event for veterans, the regular GOP debate went on in Des Moines featuring (from lest to right) Senator Rand Paul, Governor Chris Christie, Dr Ben Carson, Senator Ted Cruz, Senator Marco Rubio, former Florida Governor Jeb Bush and Governor John Kasich","url":"https://www.dailymail.co.uk/news/article-3422187/United-Ivanka-Melania-flash-dazzling-smiles-row-Donald-Trump-s-fundraiser-family-shuns-Fox-debate.html"}
