{"authors":["J. Taylor Rushing","U.S. Political Reporter","For Dailymail.Com"],"date_download":"2018-10-23 00:26:12","date_modify":"2018-10-23 00:26:12","date_publish":"2016-01-29 13:19:18","description":"Billionaire boycotter Donald Trump ruled the roost on social media during Thursday night's Republican presidential debate claiming the night's top prizes despite being a no-show at the debate.","filename":"data/vaneerConsumption/DonaldTrumpclobberedtheRepublicanfieldduringGOPdebate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30AECF9C00000578-0-image-a-8_1454071903330.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422723_Trump-clobbered-Republican-field-social-media-GOP-debate-without-Google-searchers-wanted-know-Ted-Cruz-born-Canada_1540254372.html","title":"Donald Trump clobbered the Republican field during GOP debate","title_page":"Donald Trump clobbered the Republican field during GOP debate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New York real estate tycoon dominated presidential debate without even being there\nBillionaire boycotter Donald Trump ruled the roost on social media during Thursday night's Republican presidential debate claiming the night's top prizes despite being a no-show at the Des Moines debate.\nThe GOP front-runner sat out the debate just four days before the Iowa caucuses because of a long-running feud with network anchor Megyn Kelly. Instead, he held a rally nearby in the downtown state capital.\nHe was not far from viewer's finds.\nScroll down for videos\nGOP presidential front-runner Donald Trump was only a few miles away from the Republican presidential debate on Thursday night - yet he was very much inside the room\nTrump's boycott of the debate left seven GOP presidential contenders onstage\nAn hour and a half into the two-hour debate, Twitter released data showing he was the most-mentioned of the candidates onstage - 37 percent, compared to 18 percent for Texas Sen. Ted Cruz, his closest primary rival, and 12 percent for Florida Sen. Marco Rubio.\nLikewise Google Trends reported that Trump was the most popular GOP candidate on its network, in terms of what viewers were searching for online, followed by Rubio and retired neurosurgeon Ben Carson.\nOn Twitter, Trump racked up 36 percent of the night's conversation, compared to 16 percent for Cruz and 13 percent for Rubio.\nOn Facebook, Cruz could claim a limited victory - he was the evening's winner in terms of who dominated online discussions, with 41 percent of the conversation. But Trump wasn't included in that poll because of his non-participation, the company said - otherwise, Facebook officials said, he prompted more than double of the online converstations that Cruz did.\nOn Google, Trump led all candidates in terms of search volume, meaning he was the most-searched candidate throughout the debate in all 50 U.S. states.\nEven worse news for Cruz was the top-trending question on Google: 'Why was Ted Cruz born in Canada?'\nTrump sat out Thursday night's debate due to a long-running personal feud with Fox News anchor Megyn Kelly, pictured at center\nCruz was born in Canada in 1970 to an American woman, Eleanor, who was born in Wilmington, Delaware. But the senator held dual citizenship between the two countries for decades before renouncing his Canadian citizenship upon his election to the Senate in 2012.\nSuch a 'natural born' U.S. citizenship is provided for in the Constitution, but legal challenges to it are rare, especially on the presidential campaign trail.\nCruz has been sued by a Houston attorney who claims such a 'natural born citizen' Constitution requirement has never been defined or determined by the U.S. Supreme Court, or tested in a federal court.\nTrump has been mocking Cruz's claim that he has 'natural-born' U.S. citizenship and has challenged him to prove it in court - contributing to the erasing of a once-significant Cruz lead in Iowa.","url":"https://www.dailymail.co.uk/news/article-3422723/Trump-clobbered-Republican-field-social-media-GOP-debate-without-Google-searchers-wanted-know-Ted-Cruz-born-Canada.html"}
