{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:16:09","date_modify":"2018-10-30 19:16:09","date_publish":"2016-11-22 11:58:01","description":"Donald Trump held a day of meetings a Trump Tower in order to “gather ideas and speak with potential leaders being considered for positions inside the Trump-Pence Administration,” according to the Presidential Transition Team. | Politics","filename":"data/vaneerConsumption/DonaldTrumpBackinNewYorkforMorePolicyMeetingsthisWeek.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-624646258.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_22__1540926969.html","title":"Donald Trump Back in New York for More Policy Meetings this Week","title_page":"Donald Trump Back in New York for More Policy Meetings this Week | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A shortened week of meetings at Trump Tower in New York City is underway, as President-elect Donald J. Trump works on plans for his incoming administration.\nOver the weekend Trump moved meetings from Trump Tower to the Trump National Golf Club in Bedminster, New Jersey, but on Monday he was back in New York City. He held a day of meetings a Trump Tower in order to “gather ideas and speak with potential leaders being considered for positions inside the Trump-Pence Administration,” according to the Presidential Transition Team.\nIn the course of the day Trump met with Rep. Tusli Gabbard, former Sen. Scott Brown, Oklahoma Gov. Mary Fallin, 2016 presidential candidate and former Texas Gov. Rick Perry, National Border Patrol Council President Brandon Judd, National Immigration and Customs Enforcement Council President Chris Crane, former President George H.W. Bush and George W. Bush administrations’ official Elaine Chao, former Speaker of the House Newt Gingrich and Indiana State Health Commissioner Dr. Jerome Adams.\nDiscussions ranged from veterans issues, the military, Native American affairs, energy independence, homeland security, the border, illegal immigration, ISIS, terrorism, infrastructure, regulations and legislative agenda priorities to the challenges of Obamacare and health care policy ideas.\nThe Transition Team reports:\nPresident-elect Trump began his day meeting with Congresswoman Tulsi Gabbard (D-HI). The two leaders had a detailed conversation regarding the situation in the Middle East including the crisis in Syria and America’s position in the world. They also discussed approaches to fix the VA and other veterans issues. Following his meeting with Rep. Gabbard, President-elect Trump had a productive discussion with former U.S. Senator from Massachusetts Scott Brown. During the meeting, they discussed issues related to veterans, which included the significant challenges facing service members returning from active duty overseas, receiving quality and timely healthcare and mental health support, and the National Guard’s role in protecting our country. The President-elect then met with Oklahoma Governor Mary Fallin and engaged in a conversation surrounding Native American affairs. The two also touched on critical issues around increasing energy independence including alternatives for energy consumption. In his meeting with former Texas Governor Rick Perry, the President-elect had an in-depth discussion on homeland security, border control, and illegal immigration. Their conversation also included the bureaucratic challenges facing the Department of Homeland Security and Defense, ISIS, and America’s place in the world. The President-elect met with the President of the National Border Patrol Council, Brandon Judd, and President of the National Immigration and Customs Enforcement Council, Chris Crane (both organizations represent 20,000 officers). They discussed what they describe as a “crisis” on the southern border and the growing threat of terrorism and measures to keep the American public safe. Former Secretary of Labor under George W. Bush and Deputy Secretary of Transportation under President George H.W. Bush Elaine Chao and the President-elect conversed about labor and transportation issues with a particular focus on America’s long-term infrastructure needs, and reducing or eliminating burdensome regulations. The conversation with former Speaker of the U.S. House of Representatives Newt Gingrich involved long-term strategies and priorities for a productive legislative agenda, as well as innovative utilization of business in our country. President-elect Trump’s final meeting of the day was with Indiana State Health Commissioner Dr. Jerome Adams. They discussed establishing better doctor–patient relationships, the healthcare challenges Americans face each day with Obamacare, and ideas for enacting improved healthcare policies.\nVice President-elect Mike Pence is heading up the presidential Transition Team and was present during weekend meetings with Trump and potential administration officials.\nSome of the President-elect’s first leadership roles were announced last week. Sen. Jeff Sessions was named as Trump’s selection for the position of Attorney General, Lt. Gen. Michael Flynn was named for the position of Assistant to the President for National Security Affairs, and Rep. Mike Pompeo as Director of the Central Intelligence Agency.\nAlso on Monday the Transition Team released video of President-elect Trump addressing Americans with his plans for day one of his presidency through day 100. In the video Trump also discussed executive action, policy matters and the progress on the presidential transition process.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/11/22/donald-trump-back-in-new-york-for-more-policy-meetings-this-week/"}
