{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 00:02:06","date_modify":"2018-10-31 00:02:06","date_publish":"2018-10-28 19:00:03","description":"President Donald Trump attacked Tom Steyer on Sunday, tweeting that the Democratic donor \"comes off as a crazed and stumbling lunatic.\" But while the president's penchant for tweeting out personal attacks isn't exactly new, many have questioned his…","filename":"data/vaneerConsumption/DonaldTrumpSlamsTomSteyerDaysAfterTheDemocraticDonorReceivedASuspiciousPackage.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/9458baa2-2c7d-43f7-a10d-6ba37a9f72e9-getty-911913488.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_donald-trump-slams-tom-steyer-days-after-the-democratic-donor-received-a-suspicious-package-13010625_1540944126.html","title":"Donald Trump Slams Tom Steyer Days After The Democratic Donor Received A Suspicious Package","title_page":"Donald Trump Slams Tom Steyer Days After The Democratic Donor Received A Suspicious Package","title_rss":"NULL","source_domain":"bustle.com","text":"President Donald Trump attacked Tom Steyer on Sunday, tweeting that the Democratic donor \"comes off as a crazed and stumbling lunatic.\" But while the president's penchant for tweeting out personal attacks isn't exactly new, many have questioned his timing. Trump attacked Steyer days after a suspicious package was found addressed to the megadonor.\n\"Just watched Wacky Tom Steyer, who I have not seen in action before, be interviewed by @jaketapper,\" Trump wrote in a tweet. \"He comes off as a crazed & stumbling lunatic who should be running out of money pretty soon.\"\nFederal investigators reported intercepting a suspicious package addressed to Steyer late Friday, just two days before Trump lashed out at the Democratic donor on Twitter. According to the FBI, the package addressed to Steyer, a vocal Trump critic, was similar in appearance to more than a dozen addressed to Democrats and Trump critics, which were found earlier in the week to contain pipe bombs.\nIn his tweet Sunday, the president went on to dismiss the idea that Steyer, who has so far only said publicly that he hadn't ruled out a 2020 presidential bid, might become the Democratic Party's presidential nominee. \"As bad as their field is, if he is running for President, the Dems will eat him alive!\" Trump said.\nBut a number of Twitter users criticized Trump's attack on Steyer, calling it insensitive and a perfect example of how the president's rhetoric helps to fuel political violence such as the mail-bomb plot foiled earlier this week. \"Days after a fan of President Trump sends a pipe bomb to Tom Steyer, Trump steps up — not to reach out to Steyer, but to pour on more hate,\" New York Times columnist Nicholas Kristof tweeted. \"Instead of expressing shared humanity, he derides Steyer as a 'stumbling lunatic.' Mr. President, we all reap the hatred you sow.\"\n\"I wonder why a Trump fan mailed Steyer a bomb the other day,\" film director Michael Bonfiglio mused sarcastically in a retweet of Trump's tweet.\nSteyer also pushed back on Trump's remark. In a tweet posted shortly after Trump's, Steyer condemned the president for spending his time launching personal attacks in the wake of \"the horrible political violence\" seen this week. \"[Trump] just tweeted at me in his typical insulting style after watching @CNNSotu,\" Steyer said. \"It is unthinkable that in the midst of the horrible political violence our president would resort to name-calling instead of repairing the damage to the fabric of our country.\"\nFor months, Steyer has lead Need To Impeach, a campaign aimed at booting President Trump from office on the grounds he's committed at least nine impeachable offenses. On Friday, the FBI reported intercepting suspicious packages addressed to Steyer, Sen. Kamala Harris, Sen. Cory Booker, and former Director of National Intelligence James Clapper.\nEarlier in the week, packages containing mail bombs were discovered addressed to former President Barack Obama, former Vice President Joe Biden, former Secretary of State Hillary Clinton, Democratic Rep. Maxine Waters, former Attorney General Eric Holder, former CIA Director John Brennan, actor Robert DeNiro, and George Soros. The packages addressed to Clapper and Brennan were both addressed to care of CNN's New York offices.\nA suspect was taken into custody Friday, federal investigators have reported.","url":"https://www.bustle.com/p/donald-trump-slams-tom-steyer-days-after-the-democratic-donor-received-a-suspicious-package-13010625"}
