{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:09:55","date_modify":"2018-10-30 18:09:55","date_publish":"2018-08-06 16:24:35","description":"President Donald Trump signed an executive order on Monday, reimposing a series of economic sanctions on Iran.","filename":"data/vaneerConsumption/DonaldTrumpSignsExecutiveOrderRestoringSanctionsonIran.json","image_url":"https://media.breitbart.com/media/2018/08/Trump-executive-order-Iran-sanctions-8-6-18-White-House-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_06__1540922995.html","title":"Donald Trump Signs Executive Order Restoring Sanctions on Iran","title_page":"Donald Trump Signs Executive Order Restoring Sanctions on Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump signed an executive order on Monday, reimposing a series of economic sanctions on Iran.\nIn a statement sent to reporters, Trump said the Iran nuclear deal gave Iran the economic resources necessary to both continue funding terrorism around the world and searching for a path for a nuclear weapon.\n“The JCPOA, a horrible, one-sided deal, failed to achieve the fundamental objective of blocking all paths to an Iranian nuclear bomb, and it threw a lifeline of cash to a murderous dictatorship that has continued to spread bloodshed, violence, and chaos,” he wrote.\nThe reimposed sanctions will hit Iran’s gold and precious metals trade and its automotive industry. The measures will take effect on August 7, 2018. Other sanctions on the country’s oil industry are expected to resume on November 5, 2018.\nTrump said he supported a new deal with Iran that actually addressed its long-standing financial backing for terrorists as well as its missile program. He also signed support for the Iranian people.\n“The United States continues to stand with the long-suffering Iranian people, who are the rightful heirs to Iran’s rich heritage and the real victims of the regime’s policies,” he wrote. “We look forward to the day when the people of Iran, and all people across the region, can prosper together in safety and peace.”\nThe president signed his executive order at his club in Bedminster, New Jersey, an event that was closed to the press. The White House released Trump’s statement and a photo of him signing the document.","url":"https://www.breitbart.com/politics/2018/08/06/trump-signs-executive-order-restoring-sanctions-iran/"}
