{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:09:52","date_modify":"2018-10-30 18:09:52","date_publish":"2018-06-20 19:36:52","description":"President Donald Trump signed an executive order on Wednesday halting the practice of separating illegal immigrant families apprehended at the border, despite questions about its constitutionality.","filename":"data/vaneerConsumption/DonaldTrumpSignsExecutiveOrdertoStopSeparatingFamilies.json","image_url":"https://media.breitbart.com/media/2018/06/GettyImages-979571724.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_20__1540922992.html","title":"Donald Trump Signs Executive Order to Stop Separating Families","title_page":"Donald Trump Signs Executive Order to Stop Separating Families | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump signed an executive order on Wednesday to halt the practice of separating illegal immigrant families apprehended at the border, despite questions about its constitutionality.\n“We’re going to have strong, very strong borders, but we’re going to keep the families together,” Trump told reporters at the White House before signing the order. “I didn’t like the sight or the feeling of families being separated.”\nThe president said the order was important adding that he, the First Lady, and his daughter Ivanka felt strongly about the issue.\n“I think anybody with a heart would feel very strongly about it, we don’t want families separated,” Trump said, and noted that it was an issue of “compassion.”\nHe clarified that the issue of separating families was not a new one, but he would continue tackling the tough issues surrounding immigration.\n“At the same time, we are keeping a very powerful border, and it continues to be a zero tolerance, we have zero tolerance for people who enter our country illegally,” Trump said.\nVice President Mike Pence and Secretary of Homeland Security Kirstjen Nielsen joined the president in the Oval Office for the signing ceremony.\nNielsen thanked the president for his leadership on the issue and again demanded Congress to change the loopholes on immigration.\n“We ask them to do their jobs, the laws need to be changed,” she said.\nTrump said it was tough to watch the children separated from their parents and the troubling images on television.\n“You’re going to have a lot of happy people,” Trump said as he signed the executive order.\nThe order instructs his cabinet members and the Department of Homeland Security to maintain family unity by detaining illegal alien families together and provide or construct adequate facilities to do so.","url":"https://www.breitbart.com/politics/2018/06/20/donald-trump-signs-executive-order-to-stop-separating-families/"}
