{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:48:59","date_modify":"2018-10-30 19:48:59","date_publish":"2016-05-26 23:37:33","description":"“We are going to put America back to work. We are going to put people before government,\" Trump said. “I’m prepared to kick the special interests out of Washington, D.C. and to hand their seat of power over to you.” |","filename":"data/vaneerConsumption/DonaldTrumpWillDevelopanAmericaFirstEnergyPlanasHillaryClintonPutsDonorsFirst.json","image_url":"https://media.breitbart.com/media/2016/05/Trump-Flags-Thumb-Up-Evan-Vucci-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_26__1540928939.html","title":"Donald Trump 'Will Develop an America First Energy Plan,' as Hillary Clinton Puts Donors First","title_page":"Donald Trump 'Will Develop an America First Energy Plan,' as Hillary Clinton Puts Donors First | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Presumptive GOP nominee Donald Trump delivered a policy speech on energy in Bismarck, North Dakota on Thursday, but focused more on separating himself as the candidate that puts “America first” from the likely Democratic nominee Hillary Clinton, whom he suggested puts donors first.\n“Oil and natural gas production is up significantly in the last decade,” Trump began, saying this has occurred in spite of bureaucratic barriers. He added that President Obama has “made life much more difficult for North Dakota” with costly regulation, which makes it harder to turn a profit. Trump said if Hillary Clinton is in charge “things will get much worse.”\n“She’ll shut down energy production across this country,” Trump said of the Democratic frontrunner, adding that the election in November comes down to a choice between “wealth, serious wealth for people, for workers, for everybody, versus poverty…in the poverty promised by Hillary Clinton.”\nHe charged that she “enriches her friends…and makes everyone else very, very poor.”\n“She will never create real jobs and real wage growth,” he added. “She doesn’t know how to do it.” Referencing both Hillary and her husband, former President Bill Clinton, Trump added, “They don’t even want to do it.”\n“Hillary Clinton’s Venezuela style politics of poverty… that’s what it’s going to end up being,” in America, Trump warned. “That’s the direction we’re heading.”\n“Not one idea of Clinton has and actually can create a single net job or create a single new dollar to put in workers’ pockets,” Trump said. “Every idea Hillary has will make jobs disappear. She doesn’t have a clue.”\n“Hillary Clinton’s agenda is job destruction,”while Trump says his is job creation. “You don’t have to take my word for it… Hillary in her own words, she’s declared war on the American worker.”\nTrump then turned to criticizing President Obama’s energy policy.\n“President Obama has done everything he can to keep us dependent on others,” Trump began blasting the current administration.\n“He rejected the Keystone XL pipeline despite the fact that it would have created 42,000 jobs. His own State Department concluded it would be the safest pipeline ever built in the U.S.,” Trump stated, adding it had no impact on the environment. “He rejected the America-Canada pipeline. He made a deal that allows Iran to transport more oil through his pipeline than would have ever flowed through Keystone with no environmental review whatsoever.”\nTrump says if he is elected President of the United States, “We’ll accomplish a complete America energy independence,” adding, “and lots of jobs.” The crowd cheered.\n“A Trump administration will develop an America first energy plan,” Trump declared, adding, “Cheaper energy will also boost American agriculture.”\n“We never want to be there again…at the mercy of global markets,” because of draconian regulations, he added. “I’m going to ask Trans-Canada to renew its permit application for the Keystone Pipeline.”\n“We’re going to cancel the Paris Climate Agreement and stop all payments of the United States’ tax dollars to U.N. global warming programs,” he added. Political activists with agendas “will no longer write the rules, because that’s what’s happening now.”\nTrump said in terms of environmental standards he simply cares about “clean air and clean water.”\nMoving slightly away from talking about the energy and environment, Trump focused on security. “Security is not something that should only be enjoyed by the very rich and the very powerful. It has to be enjoyed by all.”\n“To those living in fear, I say help is coming,” he vowed, saying his administration will “return law and order to America.”\nTrump then touted that the National Rifle Association (NRA) endorsed him recently, jabbing, “So, Hillary get rid of the guns.”\n“What does Hillary have to offer the poor, but more of the same?” Trump questioned, turning his focus back on the probable Democratic nominee as he concluded his speech.\n“My message today is to all the people trapped in poverty and it’s these politicians, like Hillary Clinton, [who] have failed you,” he declared. “They’ve used you. They’ve stolen your votes,” and “they have given you nothing and you need something new. I’m the only one who’s going to deliver it.”\n“We are going to put America back to work. We are going to put people before government,” Trump said. “I’m prepared to kick the special interests out of Washington, D.C. and to hand their seat of power over to you.”\nPrior to his speech, Trump took questions from the media during a press conference and was asked what he thought the federal government’s role should be on energy.\n“I think the federal government should get out of the way,” he responded. “We have so much potential energy.”\n“I want to be energy independent,” he added, saying he wants “to sell our energy to other places,” and that the Keystone pipeline should be approved. “Now, I’m not saying it shouldn’t be a better deal,” he warned.\nTrump also separated himself from Clinton and Sen. Bernie Sanders (I-VT) on fracking, saying they want to ban it.","url":"https://www.breitbart.com/politics/2016/05/26/donald-trump-will-develop-an-america-first-energy-plan-as-hillary-clinton-puts-donors-first/"}
