{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:46:59","date_modify":"2018-10-30 19:46:59","date_publish":"2016-01-04 03:51:13","description":"Donald Trump Vows To 'Unsign' Obama's Executive Gun Control","filename":"data/vaneerConsumption/DonaldTrumpVowstoUnsignObamasExecutiveGunControl.json","image_url":"https://media.breitbart.com/media/2015/12/Trump-Grand-Rapids-MI-Rally-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_03__1540928819.html","title":"Donald Trump Vows to 'Unsign' Obama's Executive Gun Control","title_page":"Donald Trump Vows to 'Unsign' Obama's Executive Gun Control | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With President Obama’s executive action for gun control expected this week, Republican presidential candidate Donald Trump let it be known that he will “unsign” Obama’s executive gun control once he is sworn in as president.\nObama is expected to expand background checks to cover more private gun sales, and to put more reporting requirements on licensed gun-dealers, according to statements from White House officials. He is working out the details on his actions with Attorney General Loretta Lynch on January 4.\nAccording to CNN, Trump is vowing to undo the executive actions Obama will take this week.\nWhile speaking in Biloxi, Mississippi, on January 2, Trump said:\nThere’s an assault on the Second Amendment. You know Obama’s going to do an executive order and really knock the hell out of it. You know, the system’s supposed to be, you get the Democrats, you get the Republicans, and you make deals. He can’t do that. He can’t do that. So he’s going to sign another executive order having to do with the Second Amendment, having to do with guns. I will veto. I will unsign that so fast.\nTrump made a very similar statement during a January 3 interview on Face the Nation, when the told host John Dickerson, “The one good thing about an executive order is that the new president, when he comes in, boom, first day, first hour, first minute, you can rescind them.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/01/03/donald-trump-vows-unsign-obamas-executive-gun-control/"}
