{"authors":["David Martosko","Us Political Editor For Dailymail.Com"],"date_download":"2018-10-23 03:39:26","date_modify":"2018-10-23 03:39:26","date_publish":"2016-01-11 16:30:37","description":"Trump spoke to nearly 10,000 people last Monday in Lowell, a Massachusetts town less than 15 miles from his HQ in Littleton. Police are investigating surveillance videos from the area.","filename":"data/vaneerConsumption/DonaldTrumpsMassachusettsheadquartersspraypaintedwithPIGandNAZI.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300B56AC00000578-0-image-a-10_1452529722410.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394167_Vandals-hit-Trump-s-Massachusetts-headquarters-spray-paint-PIG-NAZI-F-windows_1540265966.html","title":"Donald Trump's Massachusetts headquarters spray painted with 'PIG' and 'NAZI'","title_page":"Donald Trump's Massachusetts headquarters spray painted with 'PIG' and 'NAZI' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vandals hit Donald Trump's Massachusetts headquarters over the weekend, spray painting epithets and a vulgar drawing on its outside windows and walls.\nPolice in the town of Littleton are investigating the incident. They found the words 'PIG' and 'NAZI,' – along with a drawing of a penis and the phrase 'F*** YOU' – tagged on the building Saturday morning.\nThe Trump campaign did not respond to a request for comment, but the incident came less than a week after the billionaire Republican front-runner spoke to nearly 10,000 people in the town of Lowell, less than 15 miles away.\nThat speech was interrupted more than a half-dozen times by protesters who shouted 'Black lives mater!' and other slogans – and a few who boomed 'Bernie Sanders!' at the top of their lungs.\nTAGGED: Vandals hit Donald Trump's Massachusetts campaign headquarters over the weekend, spray painting 'PIG' (shown), 'NAZI' and 'F*** YOU,' and a crude drawing of a penis, on the exterior windows and doors\nPROTEST CULTURE: A Trump rally on January 4 less than 15 miles away from his headquarters drew angry protesters, although police haven't said if anyone who was ejected from that event might be responsible\nREADING THE TEA LEAVES: The Donald donned reading glasses on Monday in Windham, New Hampshire as he continued his feud with the Manchester Union Leader, a newspaper that has hammered him as unserious\n'It was terrible,' 16-year old Trump volunteer Cameron Page told WBZ News Radio after he helped with the cleanup.\n'There was all kinds of disturbing things written on the windows and doors of the building.'\nPolice were quick to update the public on their search for the vandal or vandals.\n'These types of acts are surprising and certainly not representative of the kind of town that Littleton is and the kind of people who live in this community,' the town's police chief, Matthew King, said in a statement.\n'People have a right to express their views and disagreements, but the line is drawn at criminal behavior and vandalism.'\nLaw enforcement will review surveillance footage in the area, The Boston Globe reported, including some from a camera positioned at a nearby gas station.\nDean Cavaretta, Trump’s Massachusetts campaign director, told the Globe that 'we’ve had some outstanding volunteers come by and clean [the graffiti] up since.'\nHISTORIC: The 1840 building that houses Trump's Massachusetts nerve center, shown when he opened the office last year, got the spray paint treatment over the weekend\nSUPPORT: Sunday an enthusiastic crowd greeted The Donald in Reno, Nevada\nTrump's HQ isn't in a nondescript office building. It's housed in the Conant's General Store building, a historic structure, built in 1840, that has served as a post office, barber shop, department store and cobbler shop.\nPresently, Trump shares it with a furniture maker and an antique shop.\n'The Conant Building is a historic building, and it is absolutely disgraceful that anyone would vandalize it simply because of their political beliefs or their disagreement with a political figure or party,' Littleton Board of Selectmen Chairman Jim Karr said in a statement.\n'This is not what Littleton is all about. I hope that the Littleton Police Department identifies and prosecutes whomever is responsible for these acts to the fullest extent of the law.'\nTrump, the leading Republican candidate for president, has roused the ire of liberal activists by charging hard with policy statements that run counter to their sacred cows.\nHe has called for a wall to be built on America's southern border, to stop illegal immigration from Mexico.\nHe has also demanded a temporary halt to travel visas for non-citizen Muslims until the U.S. can get a handle on the flow of violent jihadis into the country from the Middle East.","url":"https://www.dailymail.co.uk/news/article-3394167/Vandals-hit-Trump-s-Massachusetts-headquarters-spray-paint-PIG-NAZI-F-windows.html"}
