{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:32","date_modify":"2018-10-30 19:52:32","date_publish":"2015-10-04 15:53:35","description":"Donald Trump responded to President Obama's calls for more gun control in the wake of the UCC school shooting.","filename":"data/vaneerConsumption/DonaldTrumpPoliticiansWhoPushGunControlDontUnderstandtheProblemsTheyWanttoFix.json","image_url":"https://media.breitbart.com/media/2015/10/AP_33779966128-e1443974005514.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_04__1540929152.html","title":"Donald Trump: Politicians Who Push Gun Control Don't Understand the Problems They Want to Fix","title_page":"Donald Trump: Politicians Who Push Gun Control Don't Understand the Problems They Want to Fix | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During an October 4 appearance on This Week With George Stephanopoulos, Donald Trump responded to President Obama’s calls for more gun control by stressing that politicians who push gun control to solve problems do not not fully understand the problems they are trying to solve.\nTrump was referencing the Umpqua Community College (UCC) shooting in specific, but he was talking about other school shootings in general, as well.\nStephanopoulos started out the segment by playing a video of Obama speaking after the UCC attack, saying, “Somehow this has become routine. The reporting is routine. My response here, at this podium, ends up being routine. The conversation and the aftermath of it, we’ve become numb to this.” Obama urged that the UCC attack be “politicized” so it could deliver the impetus for gun control that other shootings have failed to deliver.\nStephanopoulos then looked at Trump, awaiting a response, and Trump said, “Well, [Obama] is the great divider. You have a big issue between the Second Amendment folks and the non-Second Amendment folks. And he is a non-Second Amendment person.”\nTrump continued, “You know, no matter how you cut it, you have people who are mentally ill and they have problems and they’re going to slip through the cracks. No matter how you do it, no matter how you try–and if you go back 2,000 years and if you go forward two million years–you’re going to have problems.”\nStephanopoulos then interjected, granting the existence of the problems Trump mentioned but suggesting “not every country has mass shootings as frequently as we do.” Trump countered, “But what’s interesting is if you look at Chicago, it’s got the toughest gun laws in the United States, you look at other places that have gun laws that are very tough, they do, generally speaking. worse than anybody else… Go to Baltimore, go to various cities where they have very, very tough gun laws [and] they do terribly.”\nUltimately, Trump said people who say “we’re going to stop it” by passing this gun law or that that gun law fail to understand “that it doesn’t work that way.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/04/donald-trump-politicians-push-gun-control-dont-understand-problems-want-fix/"}
