{"authors":["David Martosko","Us Political Editor For Dailymail.Com"],"date_download":"2018-10-23 03:33:57","date_modify":"2018-10-23 03:33:57","date_publish":"2016-01-29 18:37:42","description":"'When you're born in Canada, you're not supposed to run for President of the United States,' Trump told a New Hampshire crowd. 'Prime minister of Canada? No problem.'","filename":"data/vaneerConsumption/DonaldTrumpsaysTedCruzisanANCHORBABYinCanada.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B453BD00000578-0-image-a-7_1454092537579.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423228_Trump-says-Ted-Cruz-ANCHOR-BABY-Canada-twists-knife-rival-senator-s-foreign-birth_1540265637.html","title":"Donald Trump says 'Ted Cruz is an ANCHOR BABY in Canada'","title_page":"Donald Trump says 'Ted Cruz is an ANCHOR BABY in Canada' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most interpretations of the 14th Amendment to the U.S. Constitution hold that Cruz's mother's citizenship makes him eligible to be president\nThe Texas senator was born in Calgary, Alberta, Canada to an American mother and a Cuban father\nCruz has lost support among Republican voters since Trump began repeating a 'birther' conspiracy about him\nDonald Trump told a New Hampshire audience that Ted Cruz is a Canadian 'anchor baby' – hinting that he has a greater claim to citizenship there\nDonald Trump returned on Friday to his primary line of attack against presidential primary rival Ted Cruz, saying in New Hampshire that the Texas senator is an 'anchor baby' in the nation of Canada where he was born.\nTrump, the GOP front-runner, has made a major issue of a Cruz 'birther' conspiracy in recent weeks, using the uncertainty surrounding Cruz's heritage as a wedge issue to raise doubts among early-state primary voters.\nIowans will cast the nation's first votes on Monday in their local precinct caucuses.\n'Ted Cruz may not be a U.S. citizen, right?' he asked supporters in Nashua, N.H.\n'But he's an anchor baby – No, Ted Cruz is an anchor baby in Canada. But Canada doesn't accept anchor babies,' he said, drawing laughs.\nSCROLL DOWN FOR VIDEO\nHE'S AN ANCHOR BABY! Donald Trump said his main rival, Ted Cruz, is a north-of-the-border 'anchor baby' with a greater claim to citizenship in Canada than in the United States\n'PUMMELED': Trump said Cruz took all the heat meant for him on Thursday night in Iowa after he boycotted a Fox News-sponsored debate\n'Anchor baby' is a derogatory term referring to children born in the U.S. whose parents are here illegally.\nUnder most interpretations of the U.S. Constitution's 14th Amendment, such babies become American citizens at birth, 'anchoring' their parents and making it practically impossible – and politically distasteful – to deport them.\nTrump said Cruz was 'pummeled' Thursday night during a GOP primary debate in Des Moines, Iowa – the first such contest to be Trump-free.\nThe Donald boycotted the event over concerns about his treatment by Fox News, the debate's main sponsor. Without him on stage, Cruz – who runs second in every national poll – took most of the heat from moderators and lower-ranking contenders.\n'You know, they didn't even mention he was born in Canada, right?' Trump jabbed.\n'When you're born in Canada, you're not supposed to run for President of the United States. Prime minister of Canada? No problem.'\n'It is a problem for him, by the way,' Trump said of Cruz's birthplace in Calgary, Alberta.\n'I think that's one of the reasons he's crashing. I think it's one of the reasons he's a nervous wreck, too. He's figured: \"What the hell happened?\"'\nHe added: 'How about this? He's a citizen of Canada. And he was a senator from Texas. And he's a citizen of Canada, joint with the U.S. How the hell does that work?'\nCruz held dual citizenship until late in 2014 when he laid the groundwork for a presidential run.\nTrump will keep up a blistering pace in the coming days, holding seven separate rallies in Iowa over a three-day period leading up to the all-important Feb. 1 caucuses.\nTHIS NEVER GETS OLD: Trump commands massive audiences wherever he goes, including New Hampshire just 11 days before the first-in-the-nation primary elections\nNew Hampshire will vote next, in the first-in-the-nation primary on Feb. 9.\nTrump urged his Nashua crowd to turn out at the polls for him, despite an Obama-fueled economic malaise.\n'I kid when I say this, but you may be feeling badly … you may have lost your job, you may be in a major state of depression.' he said.\n'It doesn’t matter. Go out and vote. I will get rid of your depression. You’ll be happy.'","url":"https://www.dailymail.co.uk/news/article-3423228/Trump-says-Ted-Cruz-ANCHOR-BABY-Canada-twists-knife-rival-senator-s-foreign-birth.html"}
