{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 23:35:02","date_modify":"2018-10-30 23:35:02","date_publish":"2016-12-06 00:00:00","description":"Donald Trump wants to cancel Boeing's new 747-8-derived Air Force One.","filename":"data/vaneerConsumption/DonaldTrumpsmisleadingtweetaboutnewAirForceOneprice.json","image_url":"https://amp.businessinsider.com/images/54c960656bb3f74239621f9a-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_donald-trump-misleading-tweet-new-air-force-one-price-2016-12_1540942502.html","title":"Donald Trump's misleading tweet about new Air Force One price","title_page":"    Donald Trump's misleading tweet about new Air Force One price - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Boeing VC-25A REUTERS/Soe Zeya Tun\nBoeing's upcoming replacement for the US Air Force's fleet of aging presidential transports may have run into an unexpected snag.\nPresident-elect Donald Trump tweeted Tuesday morning that he believes the jets based on the Boeing 747-8, which were selected last year, are too expensive and that he intends to cancel the order.\n\"Boeing is building a brand new 747 Air Force One for future presidents, but costs are out of control, more than $4 billion,\" Trump tweeted. \"Cancel order!\"\nHowever, Trump's $4 billion price tag for the Presidential Aircraft Recapitalization program — aka the next Air Force One — seems to be a bit off. More like $800 million off.\nAccording to a report by the Government Accountability Office published in March, the PAR program has an estimated total cost of $3.21 billion spread out over the next decade or so.\nThe PAR program will consist of two 747-8-derived jets set to enter service in 2024, which means that even if Boeing delivers on time, Trump will not have the opportunity to fly on the aircraft.\nBy that time, the existing aircraft — which were ordered by Ronald Reagan — will be 34 years old.\nFlying White House\n\"The PAR aircraft will be a four-engine, wide-body, commercial derivative aircraft, uniquely modified to provide the president, staff, and guests with safe and reliable air transportation with the equivalent level of security and communications capability available in the White House,\" the GAO wrote in its report.\nThis means the new Boeing jets will have to be able to operate as a fleet of flying White Houses.\nUpgrades include:\nMore powerful engines\nMidair refueling capability\nMissile defense systems\nElectronic countermeasure defense systems\nAn operating room\nThe ability survive the electromagnetic pulse emitted from a nuclear detonation\nThe communications capabilities to manage a wartime crisis from anywhere in the world","url":"https://www.businessinsider.com/donald-trump-misleading-tweet-new-air-force-one-price-2016-12"}
