{"authors":["Tony Lee"],"date_download":"2018-10-30 22:18:01","date_modify":"2018-10-30 22:18:01","date_publish":"2015-07-08 11:00:46","description":"Businessman Donald Trump has surged into second place in July's Breitbart Primary poll after making illegal immigration and border security a central part |","filename":"data/vaneerConsumption/DonaldTrumpSurginginBreitbartPrimaryAfterImmigrationControversy.json","image_url":"https://media.breitbart.com/media/2015/07/Donald-Trump-Breitbart-Primary.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_08__1540937881.html","title":"Donald Trump Surging in Breitbart Primary After Immigration Controversy","title_page":"Donald Trump Surging in Breitbart Primary After Immigration Controversy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Businessman Donald Trump has surged into second place in July’s Breitbart Primary poll after making illegal immigration and border security a central part of his presidential campaign.\nIn last month’s inaugural Breitbart Primary, 55,000 people voted, and Trump finished in sixth place with 4%. But voting for June’s Breitbart Primary started two weeks before Trump formally entered the presidential race in mid-June. Voting for the Breitbart Primary is reset each month (meaning the results from the previous month are zeroed out), and Breitbart News readers are encouraged to vote in July’s Breitbart Primary here.\nFrom July 1-6, Sen. Ted Cruz (R-TX), who finished first last month with 30% of vote, remained in first place with 6,664 first-place votes (34%). Trump has moved into second place with 4,662 first-place votes (23%), followed by Wisconsin Governor Scott Walker with 2,230 first-place votes (11%) and Sen. Rand Paul (R-KY) with 1,419 first-place votes (7%).\nTrump received considerable backlash from businesses and television networks that kowtowed to the politically correct police, the mainstream press, and members of the bipartisan permanent political establishment for pointing out during his announcement speech that some illegal immigrants are drug dealers, criminals and rapists.\n“When Mexico sends its people, they’re not sending their best. They’re not sending you. They’re not sending you. They’re sending people that have lots of problems, and they’re bringing those problems with us. They’re bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people,” Trump said. “But I speak to border guards and they tell us what we’re getting. And it only makes common sense. It only makes common sense. They’re sending us not the right people.”\nTrump also emphasized that other countries besides Mexico are sending their undesirable citizens to America.\n“It’s coming from more than Mexico,” he added. “It’s coming from all over South and Latin America, and it’s coming probably — probably — from the Middle East. But we don’t know. Because we have no protection and we have no competence, we don’t know what’s happening. And it’s got to stop and it’s got to stop fast.”\nHis message, though, resonated with Republican primary voters. After his mid-June presidential announcement, Trump surged to second in Fox News’s national poll. He also moved into second place in state polls in Iowa (Quinnipiac), New Hampshire (Suffolk, CNN/ORC), and even Michigan (Public Policy Polling).\nTrump’s message about illegal immigration may resonate even more after an illegal immigrant who had been deported five times allegedly murdered 32-year-old Kathryn Steinle last weekend in San Francisco, which is a sanctuary city. The illegal immigrant confessed to authorities that he came to San Francisco from Texas because he knew that the city was a “sanctuary city” and he would be safe from immigration authorities. Trump sent his condolences to the Steinle family and blasted politicians for not having the guts to talk about the “absolutely disgraceful” situation at America’s Southern border.\nMy heartfelt condolences to the family of Kathryn Steinle. Very, very sad! — Donald J. Trump (@realDonaldTrump) July 3, 2015\nOur Southern border is totally out of control. This is an absolutely disgraceful. situation.http://t.co/ujz3jENIYo We need border security! — Donald J. Trump (@realDonaldTrump) July 3, 2015\nOur Southern border is unsecure. I am the only one that can fix it, nobody else has the guts to even talk about it. http://t.co/ujz3jENIYo — Donald J. Trump (@realDonaldTrump) July 3, 2015\nWriting in the Wall Street Journal, which has promoted pro-amnesty legislation while attacking conservatives opposed to it, Gerald Seib conceded that “Trump’s burst is a sign that there is a populist streak at the base of the party,” which he said “is in part the natural result of the GOP’s expansion in the past three decades to include more working-class voters.”\n“Today, many of them feel economically threatened and marginalized by cultural change. Some cite a decline in moral values as the most alarming trend in the country. They aren’t the genteel patricians of Republican stereotype, but they are Republicans nonetheless,” Seib wrote. “And yes, The Donald is speaking to them.”\nPat Buchanan observed this week that Trump’s message is resonating with working-class Americans in the so-called “silent majority” who believe Trump will take action to make the country’s borders more secure instead of kicking the immigration can down the road like politicians on both sides of the aisle have been doing. Buchanan wrote that “Trump intends to exploit the illegal immigration issue, and the trade issue, where majorities of middle-class Americans oppose the elites. And he is going to ride them as far as he can in the Republican primaries.”\n“Americans are fed up with words; they want action,” Buchanan continued. “Trump is moving in the polls because, whatever else he may be, he is a man of action. ”\nUnlike his GOP rivals who jumped at the opportunity to criticize Trump, Cruz, who has been on top of the Breitbart Primary, saluted Trump for bringing attention to the country’s disastrous immigration policies.\n“I salute Donald Trump for focusing on the need to address illegal immigration,” Cruz said this weekend on Meet The Press. “The Washington cartel doesn’t want to address that. The Washington cartel doesn’t believe we need to secure the borders. The Washington cartel supports amnesty and I think amnesty’s wrong.”\nWalker, who is now behind Trump in the Breitbart Primary, has also been praised by the likes of Sen. Jeff Sessions (R-AL) for suggesting America may have to even limit its legal immigration levels if massive immigration continues to hurt more American workers.\nThere are three weeks left in July’s Breitbart Primary poll, and readers are encouraged to vote here.","url":"https://www.breitbart.com/politics/2015/07/08/donald-trump-surging-in-breitbart-primary-after-immigration-controversy/"}
