{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 03:38:31","date_modify":"2018-10-23 03:38:31","date_publish":"2017-03-10 13:20:39","description":"A Ferrari with a top speed of nearly 200mph originally owned by President Donald Trump is expected to sell for up to $350,000 at auction.","filename":"data/vaneerConsumption/DonaldTrumpsFerrariF430forsale.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E2308C500000578-0-image-a-61_1489152031368.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301200_Drive-like-President-Donald-Trump-s-Ferrari-sale_1540265911.html","title":"Donald Trump's Ferrari F430 for sale","title_page":"Donald Trump's Ferrari F430 for sale  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Ferrari with a top speed of nearly 200mph originally owned by President Donald Trump is expected to sell for up to $350,000 at auction.\nThe luxury F430 supercar was owned by the then-billionaire businessman for four years, and was registered to Trump Tower.\nHe bought it brand-new in 2007, and it has been driven just 2,400 miles since then.\nThe luxury car was owned by Trump for four years after he bought it brand-new in 2007\nIt is being sold by Auctions America with a guide price of between $250,000 and $350,000\nA statement from the auction house said: 'It's well known that President Trump appreciates the finer things in life and this Ferrari F430 is no exception'\nIt is now being sold by Auctions America with a guide price of between $250,000 and $350,000.\nA statement from the auction house said: 'It's well known that President Trump appreciates the finer things in life and this Ferrari F430 is no exception.\n'At the time of its release, it was one of the most technologically advanced performance cars on the market.\nAt the time of its release, it was one of the most technologically advanced performance cars on the market\nThe car has a 4.3-litre V8 which develops around 485bhp - giving it a 0-62mph time of 3.9 seconds and a top speed of 196mph\n'Already a low production vehicle, its provenance is significantly increased by President Trump's ownership.'\nThe car has a 4.3-litre V8 which develops around 485bhp - giving it a 0-62mph time of 3.9 seconds and a top speed of 196mph.\nAuctions America will be selling the President's former Ferrari in Fort Lauderdale, Florida, over the weekend of March 31.\nAuctions America will be selling the President's former Ferrari in Fort Lauderdale, Florida, over the weekend of March 31\nThe luxury F430 supercar was owned by the then-billionaire businessman for four years, and was registered to Trump Tower\nThey added: 'To see a former or current President's personal vehicle offered for sale is extremely rare. It's highly likely Donald Trump is the only United States President to ever own a Supercar.\n'This Ferrari F430 is very special and is sure to make an excellent addition to any collection.'\nTrump is known to be a fan of luxury cars, with Gearheads reporting that some of his previous acquisitions include a 2003 Mercedes-Benz SLR McLaren, a 2015 Mercedes-Benz S600, a 1956 Rolls-Royce Silver Cloud, a 2015 Rolls-Royce Phantom and a 2011 Chevy Camaro Indy 500 Pace Car.\nUnusually he has also owned a 1993 Cadillac Allante, the same model used as a pace car for the 76th Indy 500 race.\nDonald Trump with a 1956 Rolls-Royce Silver Cloud, one of the first cars he ever owned","url":"https://www.dailymail.co.uk/news/article-4301200/Drive-like-President-Donald-Trump-s-Ferrari-sale.html"}
