{"authors":[],"date_download":"2018-10-22 22:02:34","date_modify":"2018-10-22 22:02:34","date_publish":"2014-05-08 17:43:48","description":"Los Angeles Clippers owner Donald Sterling wants his friends to know, he's no racist — he grew up in East LA.","filename":"data/vaneerConsumption/DonaldSterlinginPurportedNewRecordingImNotaRacist.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/407416/140429-sterling-jhc-0915_cb45bb3970bb1a1c3d5a7e242526d219.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_nba-race-furor_donald-sterling-purported-new-recording-im-not-racist-n100541_1540245754.html","title":"Donald Sterling in Purported New Recording: I'm Not a Racist!","title_page":"Donald Sterling in Purported New Recording: I'm Not a Racist!","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDonald Sterling wants his friends to know, he's no racist.\nIn a newly released audio purported to be of a conversation between Sterling and someone close to him recorded last week, the ousted Los Angeles Clippers owner rails against the storm gathering around him.\n\"You think I’m a racist?\" Sterling asks the friend in the recording that was obtained and posted by RadarOnline on Thursday. \"You think I have anything in the world but love for everybody? You don’t think that! You know I’m not a racist!\"\nThe other voice responds, \"I know I, but, I but .. what about when I hear that tape though, that tape of her...\"\n\"I grew up in East LA!,\" Sterling retorts. \"East LA! You’d die to get out of there — I got out of East LA. I was the president of the high school there. I mean, and I’m a Jew! And 50 percent of the people there were black and 40 percent were Hispanic. You ever been to Boyle Heights (a working-class Mexican-American neighborhood in LA) ... So I mean, people must have a good feeling for me.\"\nThe other man then asks if Sterling had talked to Clippers forward Blake Griffin (who is of mixed race) or anybody else on the team.\n\"I didn’t talk to anybody, I'm in my house in Beverly Hills,\" Sterling says.\nHe adds, \"I mean, how could you think I’m a racist knowing me all these years? How can you be in this business and be a racist? Do you think I tell the coach to get white players? Or to get the best player he can get?”\nSterling, 80, also indicates that he's upset that Magic Johnson — who was the figure at the center of the racist comments he made to gal pal/personal assistant V. Stiviano and released by TMZ on April 25 — was so quick to publicly renounce him.\n\"You can’t force someone to sell property in America!\"\n\"It breaks my heart that Magic Johnson, my — a guy that I respect so much, wouldn’t stand up and say, ‘Well let’s get the facts. Let’s get him and talk to him.’ Nobody tried. Nobody! I’m here on Beverly Drive and Sunset across from the Beverly Hills Hotel.\"","url":"https://www.nbcnews.com/storyline/nba-race-furor/donald-sterling-purported-new-recording-im-not-racist-n100541"}
