{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:30:32","date_modify":"2018-10-30 19:30:32","date_publish":"2018-07-11 17:22:14","description":"President Donald Trump fought for American farmers at NATO against foreign trade barriers “destroying their businesses.”","filename":"data/vaneerConsumption/DonaldTrumpFightingforAmericanFarmersatNATOSummit.json","image_url":"https://media.breitbart.com/media/2018/04/wi/afp/18/2j7hin_sorghum-field-in-texas-chinese-anti-dumping-duties-hit-us-farmers-china.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_11__1540927832.html","title":"Donald Trump Fighting for American Farmers at NATO Summit","title_page":"Donald Trump Fighting for American Farmers at NATO Summit","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump had American farmers on his mind at the NATO summit on Wednesday, calling out other countries for trade barriers and tariffs “destroying their businesses.”\nTrump tweeted in defense of American farmers while attending the NATO summit in Brussels, Belgium. He pledged to open things up better than ever while warning “it can’t go too quickly.”\n“I am in Brussels, but always thinking about our farmers,” wrote Trump:\nI am in Brussels, but always thinking about our farmers. Soy beans fell 50% from 2012 to my election. Farmers have done poorly for 15 years. Other countries’ trade barriers and tariffs have been destroying their businesses. I will open… — Donald J. Trump (@realDonaldTrump) July 11, 2018\n“Soy beans fell 50% from 2012 to my election,” Trump said, highlighting the plight of farmers before he took office. “Farmers have done poorly for 15 years.”\nTrump called out the trade barriers put on the U.S. by other countries. “Other countries’ trade barriers and tariffs have been destroying their businesses.”\nHe pledged in two tweets to open “…things up, better than ever before, but it can’t go too quickly. I am fighting for a level playing field for our farmers, and will win!”:\n…things up, better than ever before, but it can’t go too quickly. I am fighting for a level playing field for our farmers, and will win! — Donald J. Trump (@realDonaldTrump) July 11, 2018\nTrump participated in a breakfast meeting with NATO Secretary General Jens Stoltenberg in the morning. In the afternoon, he held two separate pull-aside meetings with German Chancellor Angela Merkel and French President Emmanuel Macron.\nBoth Trump and Merkel sat side by side as they told reporters that they discussed trade in their meeting. “I believe that our trade will increase, and lots of other things will increase,” said Trump.\n“We’ll see what happens over the next period of a few months.” Merkel said, “Indeed, we have an opportunity to have an exchange of our economic developments on issues such as migration and also the future of our trade relations.”\nTrump also told reporters while sitting next to Macron that his discussion with Macron involved trade, NATO, “a lot of different things, and hopefully, in the end, it’ll all work out.”\nAt June’s G7 summit in Canada, President Trump proposed to fellow G7 countries that they eliminate all trade barriers. “That’s the way it should be, no tariffs, no barriers … and no subsidies,” said Trump speaking of his college education. “That’s the way you learned at the Wharton school of finance, I mean that would be the ultimate thing.” Chief economic adviser to the president, Larry Kudlow, said of Trump’s G7 comments at the time, “I, myself, was particularly gratified to hear my president talk about free trade.”\nFollow Michelle Moons on Twitter @MichelleDiana.","url":"https://www.breitbart.com/politics/2018/07/11/trump-fighting-american-farmers-nato/"}
