{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 20:55:56","date_modify":"2018-10-30 20:55:56","date_publish":"2016-12-23 00:00:00","description":"Germany's biggest lender managed to finalise the details of its settlement with the US Department of Justice – a legacy of the 2008 financial crisis.","filename":"data/vaneerConsumption/DonaldTrumpandChristmashelpDeutscheBankandCreditSuissesettlement.json","image_url":"https://amp.businessinsider.com/images/5623b2ecdd089556568b4577-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_donald-trump-and-christmas-help-deutsche-bank-and-credit-suisse-settlement-2016-12_1540932956.html","title":"Donald Trump and Christmas help Deutsche Bank and Credit Suisse settlement","title_page":"    Donald Trump and Christmas help Deutsche Bank and Credit Suisse settlement - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters Christmas started two days early at Deutsche Bank.\nGermany's biggest lender managed to finalise the details of its settlement with the US Department of Justice - a legacy of the 2008 financial crisis and one of the biggest liabilities for the bank and shareholders alike.\nEven better, it did so for half price.\nDeutsche Bank settled for $7 billion, of which $3.1 billion is payable in cash and the rest in the form of customer redress for its issuance and underwriting of residential mortgage-backed securities in the lead up to the 2008 crisis.\nThat is just half the $14 billion figure that was mooted earlier this year and led to a share-price crash amid concerns about Deutsche Bank's ability to pay its obligations and stay afloat.\nAnd the German lender is not the only one to finish up with the DoJ.\nCredit Suisse agreed to pay US authorities $2.5 billion to settle similar claims it misled investors in residential mortgage-backed securities it sold in the years before the global financial crisis. The Swiss bank will also pay $2.8 billion in consumer relief over five years from the settlement, it said in a statement.\nRegulators often clear their decks before the Christmas break but this year is particularly special for the DoJ, which is anticipating a radical change in administration from President Barack Obama to Donald Trump, who has filled his cabinet with Wall Street heavyweights and billionaires.\nDeutsche Bank is trying to restructure $300 million of Donald Trump's debt, according to Bloomberg, which would have raised concerns of a conflict of interest if any deal would have been struck under his administration.\nEither way, drawing a line under the misdeeds of the past has cheered investors.\n\"Deutsche bank shares +3.7% suggests relief at a good result and the affair being closed. Credit Suisse shares flat implies an acceptable deal,\"Mike van Dulken, an analyst at Accendo Markets, said in an emailed statement on Friday. \"However there is no panic.\"","url":"https://www.businessinsider.com/donald-trump-and-christmas-help-deutsche-bank-and-credit-suisse-settlement-2016-12"}
