{"authors":["Press Association"],"date_download":"2018-10-23 00:11:19","date_modify":"2018-10-23 00:11:19","date_publish":"2017-03-16 09:18:08","description":"The US president said he \"loved Ireland and the people of Ireland\".","filename":"data/vaneerConsumption/DonaldTrumpvowsUSIrishrelationshipwillgrowcloser.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/19/wire-230323-1489692194-876_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319378_White-House-committed-Ireland-peace-process-Mike-Pence-says_1540253479.html","title":"Donald Trump vows US-Irish relationship will grow closer","title_page":"Donald Trump vows US-Irish relationship will grow closer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Donald Trump has said the strong relationship between Ireland and the United States will grow closer than ever under his leadership.\nVowing to visit Ireland during his time in the White House, Mr Trump told Irish premier Enda Kenny that he was his “new friend” and their respective governments would forge an even tighter bond in the years ahead.\nUS President @realDonaldTrump meeting @EndaKennyTD in the Oval Office of the White House. pic.twitter.com/dvx0TU7hXU — David Young (@DavidYoungPA) March 16, 2017\nMr Kenny held a meeting with the president in the Oval Office during a packed day of St Patrick’s engagements in Washington.\nAfterwards they were hosted by Speaker Paul Ryan at his traditional St Patrick’s lunch on Capitol Hill.\nSpeaking at the annual event, Mr Trump said he “loved Ireland and the people of Ireland”.\nDonald Trump\n“The people of Ireland and the people of the United States have stuck together through good times and bad times,” he said.\n“Over many centuries we have built a bond that thrives, inspires and endures and with us it’s going to be closer than ever before.\n“So as we celebrate our shared history and our enduring friendship let us commit ourselves to working together, as we will, to build on that bond to the benefit of our citizens for many more generations to come.”\nUS President @realDonaldTrump tells media in Oval Office: \"I love Ireland\". pic.twitter.com/oH3SLgWWjT — David Young (@DavidYoungPA) March 16, 2017\nDuring the lunch, Mr Kenny made an impassioned plea to the president to help the 50,000 “undocumented” Irish who live in the United States without legal permission.\nThe Taoiseach has long campaigned for a legal pathway to be opened up to allow the undocumented to obtain legal residency without fear of deportation.\nThe issue has drawn intense focus on this year’s visit, given the president’s hard-line stance on immigration.\nEnda Kenny and Donald Trump\nAfter the White House meeting, Mr Kenny said he and the president had agreed to work constructively on the issue.\nLater, at the speaker’s lunch, the Taoiseach stressed the important role played by so many Irish people through US history.\n“This is what I said to your predecessor on a number of occasions – we would like this to be sorted,” he told the president.\nEnda Kenny\n“It would remove a burden off so many people that they can stand out in the light and say ‘now I am free to contribute to America, as I know I can’.”\nMr Kenny also hailed those who continue to work for reconciliation in Northern Ireland, name-checking lunch guests Democratic Unionist MP Ian Paisley jnr and Sinn Fein President Gerry Adams.\nGerry Adams\nTurning to the president, the Taoiseach said: “We want to protect this peace process and I know you are going to work with us in that context also.”\nThere were lighter moments during the lunch, which was held before the Taoiseach’s traditional presentation of a bowl of shamrock to the president back at the White House.\n“They say the Irish have the capacity to change everything,” joked Mr Kenny.\n“I just saw the President of the United States read from his script … entirely.”","url":"https://www.dailymail.co.uk/wires/pa/article-4319378/White-House-committed-Ireland-peace-process-Mike-Pence-says.html"}
