{"authors":["Peter Over"],"date_download":"2018-10-22 21:41:27","date_modify":"2018-10-22 21:41:27","date_publish":"2016-07-06 00:00:00","description":"It's a big improvement over his previous fundraising but still far less than his Democratic rival, Hillary Clinton.","filename":"data/vaneerConsumption/DonaldTrumpRaises51MillionInJuneButDetailsAreHazy.json","image_url":"https://media.npr.org/assets/img/2016/07/06/ap_16188033689704_wide-8447063f7bcf369a124c7763c4e62664a8080c4c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_07_06_484990858_donald-trump-raises-51-million-in-june-but-details-are-hazy_1540244487.html","title":"Donald Trump Raises $51 Million In June But Details Are Hazy","title_page":"Donald Trump Raises $51 Million In June But Details Are Hazy : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Donald Trump Raises $51 Million In June But Details Are Hazy\nEnlarge this image toggle caption Gerry Broome/AP Gerry Broome/AP\nDonald Trump's fundraising operation kicked into gear last month and raised about $51 million, the campaign says in a press release. But the release offered a less than complete picture of the financial structure meant to propel the real estate developer and reality TV star to the White House.\nThere was a glaring omission in Trump's statement: It didn't include how much cash on hand the campaign held as of June 30. On its last report to the Federal Election Commission, the Trump campaign reported holding just $1.89 million as of May 31 — versus $42.5 million reported by Hillary Clinton's campaign.\nThe disclosure reports, with complete information for June, must be released by July 20. That's the day after the Republican convention is expected to officially nominate Trump.\nThe release detailed sources of Trump's money: $25 million from wealthy donors, $22 million from small donors and online givers, and nearly $4 million from Trump himself. That brings his personal campaign spending to around $50 million.\nClinton's campaign, in a press release last week, said she raised $69 million in June and finished the month with more than $44 million on hand.\nOn both sides, much of the cash was funneled to national and state party committees.\nNew data from NBC News and the media firm SMG Delta show the impact of Clinton's financial advantage. By their analysis, the Clinton campaign and its sidekick superPAC, Priorities USA Action, have spent $45 million on TV and radio ads.\nMeanwhile, the Trump campaign has spent nothing so far on advertising for the general election. The National Rifle Association and pro-Trump superPAC Rebuilding America Now have spent a combined $2.8 million on Trump's behalf.","url":"https://www.npr.org/2016/07/06/484990858/donald-trump-raises-51-million-in-june-but-details-are-hazy"}
