{"authors":[],"date_download":"2018-10-22 22:23:30","date_modify":"2018-10-22 22:23:30","date_publish":"2014-05-09 16:52:46","description":"In seized government building in east Ukraine, pro-Russian separatists remain steadfast heading into Sunday's referendum vote.","filename":"data/vaneerConsumption/DonetskSeparatistsEmbraceReferendumDrinkFreeCoffee.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_donetsk-separatists-embrace-referendum-drink-free-coffee-n101561_1540247010.html","title":"Donetsk Separatists Embrace Referendum, Drink Free Coffee","title_page":"Donetsk Separatists Embrace Referendum, Drink Free Coffee","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDONETSK, Ukraine -- The woman scanned a list and made notes in a small notebook.Taped to a wall, the list was formatted like a spreadsheet. Aspirin, flu pills, painkillers. Medicine after medicine, listed in row after row. \"If any of these are at my home, I'll bring them,\" the woman said.\nThere were pamphlets, reminders, and calls to action. One sign read, \"We need blankets and mattresses.\" A small sticker was designed in the fashion of the World War Two-era British government poster. \"Keep calm and fight for Donetsk Republic,\" it read.\nOne month after pro-Russian separatists captured the regional administration building here and declared a breakaway \"people's republic,\" the drab government building has morphed into a foreboding and chaotic fortress.\nArmed guards wearing camouflage and black wool masks mill around the ground floor, smoking and sipping from small plastic cups. For now, their revolution is catered. A concession stand near a bale of barbed wire serves coffee free of charge. A medical stand delivers care to wounded. But no one seems to be in charge of cleaning up.\nEmpty cans and bottles line the stairwells. Cigarette butts are everywhere: scattered along the floor, or stuffed in tall cups, soaking in black water. Hallways are lined with piles of furniture dragged from offices. Many sleep in the building. Others visit often, dropping off whatever goods they can manage to bring.\nGulnara Kotova, 48, studying the list of medicines, says she is doing her patriotic duty. She was born in Russia in 1968, and moved to Ukraine 18 years ago to work at a Donetsk clothing factory. She lives in a communal apartment with other factory workers. \"We love our Russia. We respect our Russia,\" she said.\nOn Sunday, she said, she's going to vote \"yes\" in a referendum on the region's status. She wants the Donetsk region -- with its population of several million -- to be independent.\nTHE REFERENDUM\nSeparatists stormed the Donetsk government building during the first week of April, and called for a vote that would make the eastern region independent from the Kiev government. The Kiev government had only come to power in February, after popular protests removed the country's Moscow-backed president.\nThe so-called referendum vote, scheduled for Sunday, will move ahead despite a call Wednesday by Russian president Vladimir Putin to delay it.\n\"Putin is looking for a way out of the situation, and we really appreciate it,\" said separatist leader Denis Pushilin, referring to the political crisis in Ukraine. \"But we speak for the people -- we're saying what people want,\" Pushilin said. \"One hundred percent we're not moving the referendum.\"\nThe remarks came during a hastily organized press conference Thursday afternoon that appeared to reveal fissures between the separatist leadership and Moscow.\nLater Thursday, during an interview in the separatists' eleventh-floor offices, a high-ranking deputy said the leadership was unanimous in its view. \"I was the first to have a word during the discussion,\" said Andrei Purgin, a bearded, soft-spoken man in jeans and a cream-colored blazer. Purgin says he is co-head of a council running the separatist government.\n\"We all agreed,\" Purgin said. \"We voted to keep the date -- all 78 members of the people's council.\"\nAfter the meeting concluded, Purgin said, the leaders addressed the press, vowing not to change the date.\nTHE VOTERS\nIt's unclear what weight -- if any -- the referendum will carry. The Kiev government has condemned the vote and is all but certain to disregard it. Whether Putin will use the vote as a pretext for action -- as he did in annexing Crimea following referendum there in March -- is also unclear.\nBut in the square surrounding the Donetsk administrative building, where regular speeches and pro-separatist gatherings are held, a siege mentality has developed. On a recent afternoon, people ranted, sounding off about what they perceive as meddling in the conflict by the U.S. and its European allies.\n\"Those Western bastards. If I had enough power, I would turn them into powder. I would destroy America and wipe it off the map,\" said a local builder named Igor. \"You think Putin doesn't have enough power? Military planes can cross the territory of Ukraine in no time.\"\n\"I think this is a big, big, Putin plan.\"\nAnd while people said they would vote on Sunday, none said they planned to participate in national elections slated for later this month.\n\"We will have our referendum, and we will be a separate state by then,\" said Nina, a retiree.\nELSEWHERE IN DONETSK, ANXIETY\nBut only blocks from the seized building, viewpoints mellow.\nTucked behind the city's so-called Lenin Square, in an office facing a looming statue of Vladimir Lenin, are the studios of a new online TV news company. \"We want to be the network that connects people without propaganda,\" says the channel's 33 year-old general manager, Kirill Bodrov.\nFunded by a local businessman, the channel, Different TV, began regularly scheduled online programming only a week ago.\nBodrov, who is Russian-born, spoke as he scanned the web for deals on lights and cameras for his studio. The channel recently hosted separatist leaders for a Q&A in the studio.\nBodrov said he is skeptical that the separatists are really, as their leaders have insisted, operating independently of Russia.\n\"There are too many questions. What republic? Of what country, a republic? You get no answer,\" Bodrov said. \"I think this is a big, big, Putin plan.\"\nNBC News's Alexey Furman contributed reporting in Donetsk.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/donetsk-separatists-embrace-referendum-drink-free-coffee-n101561"}
