{"authors":[],"date_download":"2018-10-22 21:30:14","date_modify":"2018-10-22 21:30:14","date_publish":"2018-08-29 00:00:00","description":"McGahn served as Donald's Trump's campaign lawyer and spearheaded the president's successful push to pack the bench with conservative judges.","filename":"data/vaneerConsumption/DonMcGahnWhiteHouseCounselWhoHelpedReshapeFederalJudiciaryToStepDown.json","image_url":"https://media.npr.org/assets/img/2018/08/20/gettyimages-1020059682_wide-4808243a38b1aac283a5759792136aa0bf75acf5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=615614644_1540243814.html","title":"Don McGahn, White House Counsel Who Helped Reshape Federal Judiciary, To Step Down","title_page":"Don McGahn, White House Counsel Who Helped Reshape Federal Judiciary, To Step Down : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AILSA CHANG, HOST:\nWhite House counsel Don McGahn is leaving his post this fall. As he's done many times in the past, President Trump made this personnel announcement in a tweet today. And if McGahn's name sounds familiar, that's because his extensive cooperation in special counsel Robert Mueller's investigation recently made headlines. NPR White House correspondent Tamara Keith joins us now to talk about all this. Hey, Tam.\nTAMARA KEITH, BYLINE: Hey.\nCHANG: So do we know if the Mueller investigation played a role in McGahn's exit?\nKEITH: We don't know for certain. But McGahn's departure has actually been discussed for some time now - since well before we knew about the level of cooperation. The New York Times reported that McGahn sat for some 30 hours of interviews with investigators from Robert Mueller's team. President Trump today, at the White House, had nothing but praise for McGahn.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRESIDENT DONALD TRUMP: Don McGahn's a really good guy - been with me for a long time. Privately before this, he represented me. He's been here now - it will be almost two years - and a lot of affection for Don. And he'll be moving on - probably the private sector - maybe the private sector. And he'll do very well. But he's done an excellent job.\nUNIDENTIFIED REPORTER: Any concern over what he said to the Mueller team?\nTRUMP: No, not at all, not at all.\nKEITH: So the question there was any concern about what he said to the Mueller team. President Trump says no. He wasn't worried about it. He signed off on letting him sit for those interviews and sharing documents. But then the president also said he didn't know what McGahn had told the special counsel team. And then the president said, we do everything straight. We do everything by the book. And Don is an excellent guy.\nCHANG: Well, if Don - if McGahn's a really good guy, and Trump loves him so much, why is he leaving?\nKEITH: Well, a person close to the White House told me that President Trump couldn't stand McGahn and that he regularly and openly complained about him to White House aides. One source of this tension was likely that McGahn, as White House counsel, wasn't the president's personal lawyer. He represents the presidency.\nCHANG: Right.\nKEITH: And that put him in a position of saying no to President Trump on a number of occasions. And, you know, the president is not used to that. In the private sector, he had lawyers who said yes. And here was McGahn saying no. But even in the face of all that, he was able to secure two Supreme Court nominees and a number of other judicial picks that will be in the judiciary for a long time to come - leaving a legacy, for sure.\nCHANG: What else has McGahn been able to accomplish under this administration besides the Supreme Court pick?\nKEITH: Right, all of these judicial nominees - and one question that comes up now is who might replace him. The person that is getting the most talk is Emmet Flood. He is someone who was brought into the White House to help deal with the Russia investigation earlier this year. He has a history. He defended President Clinton during impeachment and was part of the Bush administration, making a case for executive privilege. And it isn't clear whether he will actually get the job. But there is thought that he was brought into this current role with the idea that he would ultimately replace McGahn.\nCHANG: That's NPR White House correspondent Tamara Keith. Thanks, Tam.\nKEITH: You're welcome.\n(SOUNDBITE OF CCOLO'S \"GHANAAFREEKABOOM DUB\")\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=615614644"}
