{"authors":[],"date_download":"2018-10-30 14:33:10","date_modify":"2018-10-30 14:33:10","date_publish":"2015-07-24 00:00:00","description":null,"filename":"data/vaneerConsumption/DonorsurgeGOPcandidatestoboycottdebatesifTrumpparticipates.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_donors_urge_gop_candidates_to_boycott_debates_if_trump_participates_comments_1540909990.html","title":"Donors urge GOP candidates to boycott debates if Trump participates","title_page":"Blog: Donors urge GOP candidates to boycott debates if Trump participates","title_rss":"NULL","source_domain":"americanthinker.com","text":"Allahpundit sums up the efficacy of this idea perfectly: \"So, so dumb, but that’s our donor class for you.\" The New York Times details the \"logic\" of why boycotting the debate by major candidates is a good idea: The thinking, according to a Republican involved in the conversations, was that the lesser-funded prospects who have been eclipsed by Mr. Trump would follow suit, and the TV networks airing the debates would be forced to bar Mr. Trump in order to have a full complement of candidates. Allah blows that nonsense out of the water: Bush, Walker, and Rubio can each argue, somewhat credibly, that having Trump in the race is good for them. For Jeb, he’s a big-name foil, a guy whom Bush can use to underscore his own comparative moderation and electability. There may be nothing worse to many “somewhat conservative” voters than nominating a Bush … unless the alternative is nominating Donald Trump. For Walker, what... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/07/donors_urge_gop_candidates_to_boycott_debates_if_trump_participates_comments.html"}
long as Trump doesn’t hang around the race too long, denying Walker the anti-Bush votes he needs in the early states, he’s pure upside. As for Rubio, he’s pitching himself to righties as the party’s best chance to cut into Hillary’s domination of the Latino vote. The more Trump grumbles about Mexican rapists, the more desperate some undecideds will become to heal that rift with Hispanics before the general election. Rubio, thanks to his Gang of Eight pedigree and his Cuban heritage, may be the closest thing the GOP has to a “magic bullet.” And the more damage Trumpzilla does over the next six to nine months, the more compelling that case for Rubio becomes. So why would any of these guys want to drive Trump off the stage? Especially when he’s already hinting about going third-party if he feels insulted? Actually, there’s a third reason why the boycott idea is dumb: Why would anyone assume that the also-rans in the race would follow the lead of Bush, Walker, and Rubio by boycotting? They’d love to have those guys off the stage. Instead of being relegated to the JV debate at 5 p.m. on August 6th, they’d end up as part of the main show with a gigantic audience thanks to Trump. They could stand there and say, not unpersuasively, that any man who’s afraid to debate Donald Trump has no business negotiating for the United States against Vladimir Putin.\nThere are some who believe that the GOP should feature Mr. Trump in the debates because he's liable to say something radically incendiary and disqualify himself from the race.\nDream on. Trump could advocate dropping a nuke on Iran, and a significant number of Republicans would cheer him on. He could call for executions of border scofflaws and get the same support. There will be no disqualifying Mr. Trump from the campaign. If there is, he could easily run as a third-party candidate and hand the race to the Democrats.\nWe should fully expect Mr. Trump to turn the debate into a circus, but to deny the fact that he has a significant base of support in the party is irrational. Best to let him on stage with other Republicans so, as Allah suggests, the contrasting styles can be judged by the primary voters.","url":"https://www.americanthinker.com/blog/2015/07/donors_urge_gop_candidates_to_boycott_debates_if_trump_participates.html"}
