{"authors":[],"date_download":"2018-10-30 01:13:52","date_modify":"2018-10-30 01:13:52","date_publish":"2014-09-10 00:00:00","description":null,"filename":"data/vaneerConsumption/DontgetcockyRepublicansTheelectionaintovertilitsover.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_09_dont_get_cocky_republicans_the_election_aint_over_til_its_over_1540862032.html","title":"Don't get cocky Republicans: The election ain't over 'til it's over","title_page":"Don't get cocky Republicans: The election ain't over 'til it's over","title_rss":"NULL","source_domain":"americanthinker.com","text":"President Obama is a drag on Democrats this year, any way you slice it. His disapproval rating has been hovering around 60 percent in the key Senate states, that hasn't gotten better, and 55 percent of registered voters rate his presidency as a \"failure.\" The history of an unpopular president's party in midterm election is even gloomier.\nBut tucked inside Tuesday's new Washington Post-ABC News poll is a semi-encouraging figure for Democrats: Among the clear majority of Americans who disapprove of Obama (54 percent), a little bit less than three-quarters of them say they are voting Republican in the coming election -- just 72 percent.\nI say \"just\" 72 percent, because that's in contrast to the 85 percent of Obama approvers who say they will vote for Democrats. In other words, opposing Obama is not an analogue for voting Republican in the upcoming election. And that's why Democrats still have at least a fighting chance to keep the Senate (current generic ballot: 46 percent for Democrats, 44 percent for Republicans). (bold added)\nIt's not really all that surprising. After all, Democrats in many key races are running well ahead of Obama's approval rating in their states.","url":"https://www.americanthinker.com/blog/2014/09/dont_get_cocky_republicans_the_election_aint_over_til_its_over.html"}
