{"authors":[],"date_download":"2018-10-30 01:25:28","date_modify":"2018-10-30 01:25:28","date_publish":"2016-02-08 09:00:00","description":null,"filename":"data/vaneerConsumption/DontFenceUsInWesternStatesSeekReturnofLandFromDC.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/02/Oregon_National_Historic_Trail_in_Wyoming.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862728.html","title":"Don’t Fence Us In: Western States Seek Return of Land From D.C.","title_page":"Don’t Fence Us In: Western States Seek Return of Land From D.C.The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"According to the United States Geological Survey, nearly half the land in the Western United States is owned by the federal government. This includes 84.9 percent of land in Nevada (hiding UFOs requires lots of space), 64.9 percent of Utah, 61.6 percent of Idaho, 61.2 percent of Alaska, 52.9 percent of Oregon, 48.1 percent of Wyoming, and 45.8 percent in California. Meanwhile, the federal government owns only about 5 percent of the land in states east of the Mississippi River. Altogether, Uncle Sam owns roughly 640 million acres of land.\nIn March 2012, Utah Gov. Gary Herbert (R) signed the Utah Transfer of Public Lands Act into law, which instructs the federal government to relinquish more than 20 million acres of land to the State of Utah. Although Utah has yet to bring forward a suit in an attempt to enforce the law, a move that is expected to bring strong opposition from the federal government, similar legislation is being considered in nine other Western states. These states are arguing if the federal government turns over its property in the West to the states, it will result in better environmental stewardship of the land, lower management costs, and an increase in productivity.\nEnvironmentalists, support federal government land ownership in Western states because they say these lands contain the most biologically and environmentally valuable ecosystems in the nation that need to be protected by federal officials from less environmentally concerned states. “If not for federal policies for public land management,” University of Wyoming professor Debra Donahue told the New York Times, “America would lack a world-class system of national parks, wildlife refuges and wilderness areas.” This is undeniably true; however national parks, national monuments, wildlife refuges, and federal wilderness areas (FWAs), essentially the only parts of the West tourists ever lay their eyes on, would be excluded from any future land transfers.\nMost of the land held by the U.S. Bureau of Land Management, excluding national parks, monuments, and FWAs, is the result of historical accident, not environmental concerns. During the Progressive and New Deal Eras, Congress created federal agencies to control Western lands under the belief central authorities would dispassionately apply science to determine the best use of natural resources. But as Montana State University professor of economics Holly Fretwell writes, “Science cannot determine whether hiking, biking or timber harvest is a higher-valued use. Instead, management decisions—regarding recreation use, commodity production or restoration activities—depend on budget appropriations and special interest battles.”\nFretwell says this leads to gross mismanagement of public lands, leaving Western communities at risk of wildfires, soil erosion, and other environmental problems that impose steep economic costs.\nWithout allowing market forces to have a greater say in how federal lands are used, Western states will continue to suffer economic and environmental disadvantages. A recent study from the Institute for Energy Research showed, even in a time of stagnant demand, opening up federal lands to just oil, coal, and gas production would bring many benefits to the states, including $663 billion in increased GDP and 2.7 million jobs created over the next 30 years. The report also found a $3.9 trillion increase over federal tax revenues, and a $1.9 trillion increase in state tax revenues, over the next 37 years. (In addition to coal, oil, and natural gas, federal lands are also a major source of softwood timber, hard metals, and grazing areas.)\nA study comparing state trust lands in Arizona, Idaho, Montana, and New Mexico to federal multiple-use lands from 2009–13 by the Property and Environment Research Center (PERC) found these states earned a combined $14.51 for every dollar spent managing state trust lands, while the federal government earned only 73 cents for every dollar they spent managing federal lands. On a per-acre basis, the states earned $34.60 while the feds lost $4.38.\nPERC writes, “State trust management has demonstrated its ability to resist excessive political influence, respond to market signals, and accommodate new resources over time.… Managing these lands should provide a rich source of revenues to benefit the public, but is instead coming at a high cost to taxpayers.”\nNot only would a transfer of Western federal lands to the states be better for the preservation of much of the land and the residents of the states, it would also be a better deal for taxpayers nationwide.","url":"https://spectator.org/65406_dont-fence-us-western-states-seek-return-land-dc/"}
