{"authors":[],"date_download":"2018-10-30 01:12:59","date_modify":"2018-10-30 01:12:59","date_publish":"2018-10-29 00:05:50","description":"Here we go again: “It’s all Trump’s fault.”Do you remember the Democrats and the CNN crowd rushing to blame Saudi Arabia for the 9-11 attack on the Twin Towers? Or to blame Islam? I don’t. There were 19 murderers on 9-11, and 15 of them came from Saudi Arabia. The others also were Muslims. And all we hear — from Obama and George W. Bush on down — is that Islam is a “religion of peace,” so don’t blame Islam.","filename":"data/vaneerConsumption/DontInsultMeAsaRabbibyBlamingYourPoliticalEnemiesforSomeDirtbagJewHater.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/Pittsburgh3-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861979.html","title":"Don’t Insult Me As a Rabbi by Blaming Your Political Enemies for Some Dirtbag Jew-Hater","title_page":"Don’t Insult Me As a Rabbi by Blaming Your Political Enemies for Some Dirtbag Jew-HaterThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Here we go again: “It’s all Trump’s fault.”\nDo you remember the Democrats and the CNN crowd rushing to blame Saudi Arabia for the 9-11 attack on the Twin Towers? Or to blame Islam? I don’t. There were 19 murderers on 9-11, and 15 of them came from Saudi Arabia. The others also were Muslims. And all we hear — from Obama and George W. Bush on down — is that Islam is a “religion of peace,” so don’t blame Islam. Obama tells us that ISIS “is not Islamic.” Instead, we were told after 9-11, the “Saudis are our friends.” They, their Wahhabi Islam, the hundreds of anti-Christian madrassas they have built throughout the United States, the $10 billion they have poured into Western colleges and universities, the hundreds of millions they have thrown at American universities to buy off entire Middle East Studies departments and to teach anti-Americanism, anti-Christianity, and anti-Judaism to young people on our soil. And yet we repeatedly get fed the mantra about “our friends the Saudis.”\nOur friends, that is, until they recently clipped off and butchered a Washington Post journalist. Now that they hurt someone from within the Left media, suddenly — only now — the tune changes. Suddenly, the same Saudi Prince whom the always-wrong Thomas Friedman of the New York Times ogled as a great new leader, is crowned the “Bad Guy.” And even then, Trump is to blame.\nDo you remember the Democrats and the Seedier Media blaming Castro and Communism for Lee Harvey Oswald when he murdered President John Kennedy? I don’t. I remember the flag-draped coffin, the memorial procession in Washington, Jackie draped in black, John-John saluting, the eternal flame at Arlington. But I don’t remember anyone blaming Communism for the assassination of JFK.\nDo you remember the Democrats and the Seedier Media blaming Robert (F- – – Trump) De Niro for the shooting and attempted assassination of President Ronald Reagan? I don’t. A certified mental case, John Hinckley, Jr., shot at the President because, as he explained it, he wanted to impress and protect Jodie Foster. In the movie Taxi Driver, Robert De Niro — who apparently was not called upon to do much acting in that movie, just to stay true to self — had portrayed a violent mental case, a character named Travis Bickle, who protects a 12-year-old prostitute (Foster) and ultimately tries to assassinate a United States Senator who is running for President. So Hinckley, obsessed not only with protecting and impressing Foster’s fictional character but also with wanting to be the fictional Bickle character in real life, shot at President Reagan to murder him — emulating De Niro’s character. So I ask again: Do you remember the Democrats and the Seedier Media blaming Robert (F- – – Trump) De Niro for the shooting and attempted assassination of President Ronald Reagan? Because I don’t.\nI don’t remember Democrats blaming left-wing politics for two crazy leftist women in San Francisco, each trying to assassinate President Gerald R. Ford. There was Nut Job 1, Sarah Jane Moore, a fan of the Symbionese Liberation Army, the sickos who kidnapped Patty Hearst. She had been divorced five times before entering revolutionary politics. And there was Nut Job 2, Lynette “Squeaky” Fromme, a disciple of Charles Manson. Do you remember the Left blaming their side of the political spectrum for those two mental cases? Because I don’t.\nI don’t remember Democrats blaming Bernie Sanders for the dirtbag animal — and outspoken Bernie Sanders supporter — who shot Rep. Steve Scalise and others when Republicans innocently were warming up for a baseball game. Do you? Because I don’t.\nThere actually is a demonstrable link between Robert De Niro and the shooting of Ronald Reagan. Between Castro and Cuba and Communism and the murder of President Kennedy. Between Left incitement and the attempts on President Ford’s life. Between the Saudis, their Wahhabi Islam, and the murders of 9-11. But the darlings of political correctness get lifetime passes from the despicably biased media. Can’t blame De Niro.\nAnd now, a dirtbag with a demented mind that actually led him to post on Facebook his hate of President Trump — he hates Trump because the sicko regards Trump as a “globalist” — shoots at Jews in a Pittsburgh temple, and the Left media, the Democrats, and their hand-picked anti-Trump Jewish stooges get trotted out to blame President Trump.\nSo I respond: Don’t you dare insult me as a rabbi by blaming your perceived political enemies for some dirtbag Jew-hater. This President could not be a better friend of Jewish concerns and causes. He supports Israel and moved America’s Israel embassy to Jerusalem. His daughter and son-in-law are Orthodox Jews, and he treats them lovingly and respectfully, as he does their Orthodox Jewish children, his grandchildren. He ended Obama’s vicious anti-Israel animus, and he has supported Israel strongly in the United Nations. No wonder that Jews throughout the world love him, support him. In Israel, among Israeli Jews, he is wildly popular with a 67% approval rating. They hated Obama — and for great reason. In England, the Jews have gone conservative, while the British Labour Party has chosen an outright anti-Semite, Jeremy Corbyn, as their leader. Jews from the former Soviet Union are the most conservative of people. As are Orthodox Jews in America. Jews throughout the world — except for those in America influenced by Hollywood and the Left Media — have become increasingly and intensively conservative. And we enthusiastically support President Trump. President Trump has condemned anti-Semitism as forthrightly as has any President in American history. When the people were murdered at the Pittsburgh temple, he ordered all American flags to be flown at half-staff for three days. Compare that to Obama who responded to Arab terrorists murdering Jews in a kosher-food store in France by saying blithely that they randomly had been killed at some random delicatessen.\nThus, it is despicable beyond words when Democrats, Leftists, and NeverTrumpers jump to blame President Trump for the deranged actions of a mentally sick dirtbag. And nothing is more disgusting than when carefully selected Leftist rabbis abuse their station to spew their garbage against President Trump and blame him for the actions of a maniacal moron like Robert Bowers who actually hates Trump and calls him a “globalist.” The Left media dig up these Jewish characters whose god is not the G-d of the Torah but the gods of Hollywood and the ACLU. By contrast, among the Jewish community we Orthodox Jews comprise the ones who actually live Judaism, observe Jewish traditions, who believe every word of the Torah, who eat strictly kosher, who observe the Sabbath according to its laws. Those of us who actually worship and serve the G-d of the Torah, not the gods of Hollywood and the Leftist media, are among the strongest supporters of President Trump — and we are outraged, beyond insulted, when CNN and MSNBC and other Seedier Media gang up against us and dig up JINOs — yep, Jews In Name Only — to blame our President wrongly and falsely. Jews who would not know, recognize, or grasp a passage of the Talmud if it were placed on their laps, in English translation, with an audio recording alongside.\nSo is there anyone to blame for the Pittsburgh shootings?\nWell, for starters, howzabout we blame the mental-case dirtbag who did it? Did anyone ever consider that?\nAnd we can blame the ACLU and the other social-justice warriors who changed American laws to prevent government from institutionalizing mentally ill and deranged crazies. Virtually every time we read about a shooting, whether at a church or a synagogue or a school or a movie, it invariably turns out that the shooter was a crazy mental case who should have been locked up years earlier — and whom lots of people knew needed to be locked up.\nNow for the more important part: The day that Sarah Huckabee Sanders and her family were hounded out of that Virginia restaurant was the day that the seeds were planted for a new era of violence in American politics. Sanders was physically hounded, and the restaurateur endorsed the despicable act. In subsequent weeks, Ted Cruz’s party was physically confronted at a restaurant. So were Mitch McConnell and his wife, Elaine Chao. Pam Bondi, Florida’s Attorney-General, was hounded at a movie. Republican United States Senators have been confronted physically in the halls of Congress, to the degree that they have needed armed security escorts. These despicable acts have been the fruits of Maxine Waters publicly urging her followers to harass Trump supporters at restaurants, gas stations, and other public venues. Similarly, Cory Booker has urged his backers to get into opponents’ faces. Hillary Clinton, without blinking, urged incivility until her side wins election. Eric Holder egged on his crowd to kick Trump backers.\nLet us understand what this Rhetoric of Violence from the Left does. It changes the playing field of political discourse. When someone threatens to get into your or my face, what does that do to you or me? Well, I am normal. So I bristle. Do I fantasize about kicking them reciprocally? Do I fantasize about gathering a crowd and hounding Maxine Waters out of a restaurant and a gas station? That is a private matter I will not share. My private thoughts remain private. Do I fantasize about kicking Eric Holder reciprocally, and about getting into Cory Booker’s face and being uncivil to Hillary? I will not tell. But I never would act that way. I would not even joke about it. I have internal restraints. Because I am normal.\nThe thing is, in a country of 300 million people, there are lots and lots of people who are not normal. There are truly demented people. Just walk the streets of any large city. Look at the crime statistics in Chicago, Detroit, St. Louis, Memphis, and in other cities that have enjoyed decades of uninterrupted Democrat rule. Here in Los Angeles, homeless encampments see people urinate and defecate on the sidewalk; amazingly, there have been typhus outbreaks. San Francisco is even worse. Likewise, outside this strange region, everyone who works at a place with lots of employees has met some real nuts. We all have met crazy people. And when crazy people are presented — daily — with prominently disseminated calls for kicking opponents, getting into opponents’ faces, harassing and stalking opponents at gas stations, restaurants, and movie theaters — well, a few crazies load up their guns.\nIt has been so predictable. So many of us have been warning for weeks that the Rhetoric of Violence on the Left soon is going to get someone killed. When a three-year-old baby crawls on the floor and plays “hide and seek” with his or her parents, it “hides” by putting its hands over its eyes and imagines: “I cannot see you, so you cannot see me.” And when a tyke does that, it is giggly cute. But when an adult does that, it is narcissistic and blind. When Maxine Waters tells people to harass their opponents at restaurants and gas stations, she thinks that only her Antifa Leftist friends are listening. But so are the crazies on the other side of the aisle. “What a great idea!” they think. “Let’s rock her world!” And soon some maniac from Florida, who should have been removed from the streets and been institutionalized long ago, is mailing her a bunch of pipe bombs. When Eric Holder says “Kick them,” he thinks that he has inspired only Leftists to kick conservatives. But that is how a three-year-old thinks. In reality, others are listening, too, and crazies around the country responsively think: “Yeah, that’s a great idea, pal. I am going to kick Eric Holder. Time for some ‘Fast & Furious,’ Eric.” And soon a maniac is mailing a pipe bomb to Holder, too. And so it goes. The wages of the Democrats’ Rhetoric of Violence.\nFrom the day that we elected President Trump to lead our country forward and to reverse the eight-year Obama blip and erase that blight from history, the Democrats and the Left have been in rabid “Resistance.” Never before in American history have so many celebrities spoken so blithely and publicly about blowing up the White House, kicking opponents, symbolically cutting off a President’s head, symbolically stabbing him to death, urging incivility, and in fact driving people out of restaurants and movie theaters.\nUnderstand that these words and the escalating of political language into violence has real-life physical consequences. Last week it was a nut who mailed some pipe bombs. This week it was a Jew-hater who will spend the rest of his life in prison — unless we are blessed to see him tried in a jurisdiction that offers him a well-deserved death penalty. Next time — if the Democrats and the rest of the Left do not cool their political Rhetoric of Violence — it yet may be someone closer to their world. This is the price of the Rhetoric of Violence. Antifa does not exist in a vacuum. Violence begets violence. And the Left will have only itself to blame if their delirious dreams of hurting conservatives physically play out in the opposite direction intended.\nMay the Omnipresent console the families of the eleven murdered in Pittsburgh among the mourners for Zion and Jerusalem.","url":"https://spectator.org/dont-insult-me-as-a-rabbi-by-blaming-your-political-enemies-for-some-dirtbag-jew-hater/"}
