{"authors":["Russ Koesterich","The Blackrock Blog"],"date_download":"2018-10-31 00:20:13","date_modify":"2018-10-31 00:20:13","date_publish":"2014-09-10 00:00:00","description":"The bottom line: The major trend in the global economy is one of increasing divergence, rather than slower growth.","filename":"data/vaneerConsumption/DontFreakOutAboutAGlobalSlowdown.json","image_url":"https://amp.businessinsider.com/images/5410958feab8eab0220fb488-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_dont-freak-out-about-a-global-slowdown-2014-9_1540945213.html","title":"Don't Freak Out About A Global Slowdown","title_page":"    Don't Freak Out About A Global Slowdown - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Is economic growth slowing once again? BlackRock's Russ Koesterich doesn't think so. Scott Olson/Getty Images Following five years of an uneven, disappointing and often erratic recovery, investors can be forgiven for a certain level of paranoia when it comes to economic growth.\nEach year is forecasted to be the one when the global economy finally \"breaks out\" of historically low growth levels. Instead, for much of the past five years, gross domestic product (GDP) growth figures in Europe, the United States and even emerging markets have consistently come up short.\nDespite some recent positive surprises in the United States, this trend has generally continued in 2014, leaving many investors asking the question: Is economic growth once again slowing? I believe the answer is no.\nTo be sure, global growth will be below trend once again this year and long-term growth is likely to remain lower than the post-World War II average going forward. However, I see few signs of a cyclical slowdown and related decelerating growth, outside of Europe and a few select emerging markets: Consider the following:\n1. Most global manufacturing surveys suggest global growth is stable, and even modestly accelerating.\nThe global Purchasing Managers Index (PMI) has been stable at around 52.5 for most of the year. This level is consistent with a modest expansion. Meanwhile, the services component of the global PMI actually improved recently. July's reading of 56 represents a significant jump from the first half of the year.\n2. Credit spreads remain tight.\nCredit market conditions have historically been a good sign post for the global economy. Deteriorating credit conditions, measured by widening spreads, have generally been associated with slower growth, while tight spreads tend to coincide with faster growth. Today, most measures of credit conditions are positive, with tight spreads across all of fixed income. Even high yield spreads have come in after a short scare last month.\n3. Prices of industrial metals remain steady.\nWhile gold prices have been selling off, prices of industrial metals have been more stable. This is relevant for global growth. Given industrial commodities' sensitivity to economic activity, increases in their prices tend to have a positive correlation with global growth. Using the Journal of Commerce Index of Industrial Metals as a proxy, industrial metal prices have been holding their own. The index is up around 8% from the spring lows and 7% year over year. On this metric, there is little evidence of a global slowdown.\nIn short, while there are parts of the global economy that investors should be nervous about, on a global basis the economy appears stable. What is noticeable is a growing divergence between different regions and countries.\nThe United States is accelerating, while Europe is struggling — growth there was flat in the second quarter. In emerging markets, China seems to be achieving a soft landing and Indian growth has picked up, but Brazil slipped back into recession during the first half of the year.\nThe bottom line: The major trend in the global economy is one of increasing divergence, rather than slower growth.","url":"https://www.businessinsider.com/dont-freak-out-about-a-global-slowdown-2014-9"}
