{"authors":["Colin Fernandez For Mailonline"],"date_download":"2018-10-22 20:54:16","date_modify":"2018-10-22 20:54:16","date_publish":"2017-03-16 00:00:51","description":"Most British owners – 78 per cent – say they dress up their pooch because they fear they may get wet. This fear, vets say, is misplaced as dogs dry quickly and rain is unlikely to harm them.","filename":"data/vaneerConsumption/Dontforceyourdogtodressup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/23/3E4FC57D00000578-0-image-a-32_1489622392510.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318350_Don-t-force-dog-dress-up_1540241656.html","title":"Don't force your dog to dress up","title_page":"Don't force your dog to dress up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The craze for dressing up dogs in fancy designer outfits is causing a rise in skin complaints, according to vets.\nWhile some may think they look cute wearing waistcoats, jumpers and t-shirts most dogs have no need of clothes.\nA staggering 81 per cent of pet owners have at least one outfit for their canine companion.\nThe craze for dressing up dogs in fancy designer outfits is causing a rise in skin complaints, according to vets (stock photo)\nMost owners – 78 per cent – say they dress up their pooch because they fear they may get wet. This fear, vets say, is misplaced as dogs dry quickly and rain is unlikely to harm them.\nA further 53 per cent say they want to keep their dogs warm, while one in ten say they do it because it looks nice (10 per cent).\nSeven per cent of owners admit they dress their dog up because they see the animal as a fashion accessory.\nThe majority of owners (81 per cent) have a coat for their dog, while others have reflective outfits (31 per cent) and jumpers (21 per cent).\nSome owners go one step further and dress their dog up in t-shirts (16 per cent), hats and shoes (both seven per cent) and even dresses (five per cent).\nBut vets warn that giving an additional coat to many dogs can be bad for their health.\nSeven per cent of owners admit they dress their dog up because they see the animal as a fashion accessory (stock photo)\nA survey of 23 vets asked their concerns about clothing canines by Direct Line Pet Insurance, found one in three vets (32 per cent) were concerned that dressing up pups and dogs can cause rubbing against the skin.\nA further 27 per cent said that the use of coats can cause stress, while 23 per cent were concerned clothes can cause overheating.\nThe most common doggy complaint seen by vets, according to the survey, is atopic dermatitis, a skin condition that can be triggered by allergic reactions.\nA survey of 23 vets asked their concerns about clothing canines, found one in three vets were concerned that dressing up pups and dogs can cause rubbing against the skin (stock photo)\nOtitis, an ear infection, and flea allergies were the next two most common complaints.\nThe majority (70 per cent) of vets and veterinary nurses identified the West Highland White Terrier as the breed most susceptible to skin conditions, followed by Shar Peis and Labradors (both 35 per cent) and Staffordshire Bull Terriers and Boxers (both 26 per cent).\nThe most common doggy complaint is atopic dermatitis, a skin condition that can be triggered by allergic reactions (stock photo)\nThe most common forms of treatment for skin problems in dogs are antibiotics (28 per cent), steroids / steroid creams (22 per cent) and flea prevention like spot on and collars (17 per cent).\nFor dogs susceptible to allergies, having a de-humidifier can be helpful, as can checking the dog’s diet to ensure it is eating hypoallergenic foods, the report said.\nDr Andrew Francis, Chief Operations Officer at Pawsquad, a veterinary advice service that launched the survey: ‘Owners should be mindful that sometimes putting their dogs in clothing can cause skin damage, as the added materials can irritate a dog’s skin.\n‘Skin disease is the most common reason for people seeking an online veterinary consultation and, while easily treated, can cause problems if left for a long period of time.\n‘If any owner is concerned their dog may be suffering from skin disease they should speak to a vet.’","url":"https://www.dailymail.co.uk/news/article-4318350/Don-t-force-dog-dress-up.html"}
