{"authors":[],"date_download":"2018-10-30 01:05:23","date_modify":"2018-10-30 01:05:23","date_publish":"2014-10-02 08:00:00","description":null,"filename":"data/vaneerConsumption/DontGetComplacentIftheGOPWinsinNovember.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/10/3005754636_74ae8b2b9b_z.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861523.html","title":"Don’t Get Complacent If the GOP Wins in November","title_page":"Don’t Get Complacent If the GOP Wins in NovemberThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"We’re less than five weeks out from the midterm elections, and by all appearances they will go well for the Republicans. Gains in the House and Senate are likely, with the majority in the Senate within reach. Pick-ups are likely at the state level as well—just as important, but frequently overlooked. So you can be relatively sure that on the night of November 4, there will a ton of backslapping and plenty of folks walking around with that winning glow.\nHere’s the problem: Winning will give the Republican Party a new, and false, sense of confidence, which could mask the significant deficiencies that remain in the Right’s political infrastructure. These deficiencies, if not rectified on a national scale, will make it impossible for the GOP to win the White House in 2016.\nMany factors determine a party or candidate’s ability to win the White House. Some reside in the realm that we can call luck or fate, but many others are controllable. What Republicans need to understand—yesterday—is that there are plenty of the latter, and myriad things the party can do, regardless of who the nominee will be in 2016, to make winning back the Oval Office much more likely.\nFirst, let’s ask ourselves: Where is the Right’s version of Obama for America (now Organizing for Action)? True, the GOP does have groups that are big on speeches, bus tours, and rallies. But conservatives in this center-right country still don’t have an entity highly focused on organizing the grassroots and building political infrastructure. We need an organization, driven by metrics and the concept of return on investment, training field staff and volunteers, mobilizing activists, registering new voters, leveraging the best voter and consumer data available, conducting neighborhood canvassing operations — and doing it all on an ongoing basis, long before any specific election.\nDemocrats win because they do this. Republicans play at it.\nLet’s consider a few numbers from the 2012 race, according to a memo released by Obama’s campaign:\n• 5,117: That’s how many Get-Out-The-Vote (GOTV) staging locations, in battleground states alone, the Obama campaign had in the last five days of the 2012 campaign.\n• 698,799: This is how many shifts volunteers signed up for to man phones and knock doors in the closing days of the election.\n• 1,792,261: How many newly registered voters Obama for America signed up in just these battleground states during the campaign cycle.\n• 125,646,479: This last and most impressive number corresponds to the live, personal phone calls or door knocks the campaign had completed at the start of the final GOTV weekend push.\nI would love to see the number of activist training sessions conducted by the Obama campaign, but the memo only describes it as “thousands and thousands.” No campaign just stumbles into numbers like these. They happen because of years — not just months — of groundwork.\nThey happen also because of refined and streamlined processes. That effort for Obama 2012 was led by chief technology officer Harper Reed, who was responsible for building “Narwhal,” the campaign’s integrated data platform. The Chicago Tribune reported back in the spring of 2011 that Reed would ”focus on helping field operators improve voter contact.” So with his team of engineers, he built a “coordination system/data platform for linking and sharing information on voters and volunteers.”\nLinger on this: Reed was tasked with helping field organizers to improve voter contact. Why? Yale professors Donald Gerber and Alan Green have shown that for every twelve to fourteen people that have live conversations with a campaign representative on their doorsteps, one will vote for the candidate. In-person conversations are and continue to be the gold standard of politics. It’s about people talking to people. Properly marry it with the latest technology and you are unstoppable.\nThe goal, subsequently achieved by the Obama campaign, was to achieve that on a mass level with the help of integrated database technology and the various other tools built by Reed. It’s the equivalent in politics of Henry Ford creating the assembly line and reducing the production time of his cars from twelve hours to two and a half.\nThat’s what political technology is about: scaling up the rate of high-value contacts to put victory within reach.\nBut technology can only take you so far. It’s why after the elections Reed said, “The real innovation was not the technology. The real innovation was the ground game.” And the ground game always has been and always will be by definition heavy on the human element.\nThis is another persistent problem for Republicans. Joe Rospars, Obama’s former digital strategist and founder of Blue State Digital, was quoted recently saying, “It’s very difficult to imagine them marshaling a digital program like ours because the Republican strategy does not involve people.”\nRospars is right, but it didn’t used to be that way. While the Right has never organized in the same way as the unions, or ACORN, it used to have grassroots armies and emphasize personal contact. Yet despite seeing the Obama campaign success in placing an overwhelming emphasis on field offices and field staff, the GOP acts as though 2012 never happened.\nGranted, the Republican National Committee has launched its Victory 365 program, which as of August has put roughly 300 paid staff in the field. This is a positive step. Put in perspective, however, that’s about half the number staff Obama had in 2012 in Ohio alone. It’s not an entirely fair comparison, since this year’s elections are midterms with no presidential race on the ballot. But it is telling that the GOP machine, for all its talk about changing its ways, will spend significantly more donor dollars on paid media this year than on field staff and personal contact.*\nIf the Right is serious about taking back the White House in 2016, we have to start now on the smart, focused extra-party work that must begin in the first quarter of 2015. The work should focus on ten key states. Three to four dozen organizers should be on the ground, knocking on doors, having conversations, registering voters, collecting unique data tags, building coalitions, and training thousands of activists on GOTV operations.\nThis is about being focused on the right things long enough to obtain the results one wants on the scale one needs. It’s about long-term presence in the right places, with trainings and coalition building. Then it’s about leveraging trained networks through technology to have maximum impact.\nIt’s a numbers game of metrics and goals, with every dollar invested having some measurement of success. A numbers game where it costs $20 to register a new voter and $2.01 to make a live contact. A numbers game where we know 10 to 15 percent of those training will actually do grassroots work. Do the math, conservatives. Figure out your “win number” and multiply. Understand that Democrats don’t win with television and online ads.\nBy focusing on the right ten states, and doing the right things, from technology and data and training and organizing, we can help ensure we keep America free by beginning the serious process of national, generational change. This change rarely begins at the top; the seismic shifts occur at the local level and build from the ground up.\n*The story initially said that the RNC will spend ten to twenty times more on media than on field staff, a calculation that the RNC contests, and one that did not include independent expenditures, such as ads funded by Super PACs.","url":"https://spectator.org/60545_dont-get-complacent-if-gop-wins-november/"}
