{"authors":[],"date_download":"2018-10-22 22:23:12","date_modify":"2018-10-22 22:23:12","date_publish":"2014-05-08 20:25:02","description":"The number of births to women 35 and older has soared in the U.S. to a number nine times greater than 40 years ago.","filename":"data/vaneerConsumption/DontCallMeGrandmaBirthstoOlderMomsontheRise.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_08/202851/140221-pregnant-woman-2026_ece9d12329273e2e3553d05821e7ee21.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_womens-health_dont-call-me-grandma-births-older-moms-rise-n100731_1540246992.html","title":"Don't Call Me Grandma: Births to 'Older' Moms on the Rise","title_page":"Don't Call Me Grandma: Births to 'Older' Moms on the Rise","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe only time Elisabeth O’Brien, 43, truly feels like an “older mom” is when she falls into bed at 9 p.m — if she’s lucky. Don’t feel old, Ms. O’Brien. Regardless of age, most moms of 10-month-olds are exhausted by 9 at night.\nLast year, at age 42, O’Brien became a first-time mom to a 7 pound, 13 ounce “ridiculously happy and healthy” baby boy named Samuel. And she also become part of a growing trend among women over age 35 who are having their first children, according to data released Friday by the National Center for Health Statistics, part of the Centers for Disease Control and Prevention.\n\"We are just all so thrilled,\" says O'Brien, of Los Angeles. \"I was ready to be a mom.\"\nThe average age for women giving birth for the first time has risen during the past 40 years — with a veritable baby boom among women age 35 and older. For example, the number of women ages 35 to 39 giving birth for the first time soared to 11 per 1,000 in 2012, from 2.1 women per 1,000 in 1970. For women ages 40-44, the rate grew to 2.3 per 1,000 in 2012 from 0.4 per 1,000 in 1970.\nFrom 2000 through 2012, 46 states and Washington, D.C., showed an increase in the first birth rate for women aged 35-39. For women age 40-44, rates increased in 31 states as well as Washington, D.C. Some areas including D.C., Minnesota, Nebraska and South Carolina rose 60 percent or more.\n“This (trend) has been going on for a while, and when we see statistics changing it can be a reflection of what’s going on in society,” says lead researcher T. J. Mathews, citing that in 2012, there were nine times as many first births to women ages 35 and older than there were four decades earlier.\nWomen are waiting longer to give birth due to many factors, including later marriage, educational pursuits and financial reasons, says Elizabeth Gregory, director of the Womens, Gender & Sexuality Program at the University of Houston and author of “Ready. Why Woman Are Embracing The New Later Motherhood.”\n“Many of these women took time to finish their educations and establish themselves at work,” she said. “Women figured out early on there is a financial return to delay, and they could provide for their families better.”","url":"https://www.nbcnews.com/health/womens-health/dont-call-me-grandma-births-older-moms-rise-n100731"}
