{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:28:24","date_modify":"2018-10-30 19:28:24","date_publish":"2017-03-09 20:02:12","description":"Farmers in the Central Valley know that it will take 3-4 years for water to permeate down to the underground aquifers after the drought.","filename":"data/vaneerConsumption/DontExpectCentralValleytoStopSinkingAfterDroughtYet.json","image_url":"https://media.breitbart.com/media/2016/04/Central-Valley-aqueducts-Joel-Pollak-Breitbrat-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_03_09__1540927704.html","title":"Don’t Expect Central Valley to Stop Sinking After Drought — Yet","title_page":"Don’t Expect Central Valley to Stop Sinking After Drought -- Yet","title_rss":"NULL","source_domain":"breitbart.com","text":"Farmers in the Central Valley know that it will take three to four years for water to permeate down to the underground aquifers and start raising the land again. But environmentalists warn of a crisis due to the Central Valley still sinking after this year’s heavy rains, due to the use of groundwater during the five-year drought.\nA joint release by a consortium of scientists from the, Canadian Space Agency, NASA and Caltech, titled “Progress Report: Subsidence in the Central Valley, California,” reported that subsidence due to groundwater pumping in California’s San Joaquin Valley is continuing at its fastest recorded rate of nearly 2 inches per month in some locations, despite the record heavy rains this year. According to the JPL press release:\n“Because of increased pumping, groundwater levels are reaching record lows — up to 100 feet (30 meters) lower than previous records,” said Department of Water Resources Director Mark Cowin. “As extensive groundwater pumping continues, the land is sinking more rapidly and this puts nearby infrastructure at greater risk of costly damage.”\nThe California Department of Water Resources has been contracting with NASA’s Jet Propulsion Laboratory since 2014 to track Central Valley earth subsidence with imagery from the European Space Agency’s Sentinel-1A and Canada’s Radarsat-2 satellites. The latest update warns that increased subsidence rates have the potential to damage local, state and federal infrastructure, including aqueducts, bridges, roads and flood control structures.\nLong-term subsidence was identified as creating a risk that thousands of public and private groundwater well casings in the San Joaquin Valley and could permanently reduce the underground aquifer’s water storage capacity.\nThe JPL report comes just three months after the U.S. Geological Survey (USGS), under President Obama’s Department of Interior Secretary Sally Jewell, took a last major shot at San Joaquin Valley famers on December 23, 2016 by publishing “Conjunctive Use in Response to Potential Climate Changes in the Central Valley, California.”\nBased on mid-21st Century climate change forecasts resulting in California becoming 2 to 4°C hotter and 10 to 15 percent drier, the USGS claimed that the federal government must respond to the hydrologic impacts of the Central Valley groundwater reduction that will be caused by a 40 percent loss of streamflows with “an integrated water-management approach” that prevent seawater intrusion into the Sacramento-San Joaquin Delta and preserves habitats for fish and birds by dramatically reducing agricultural water deliveries.\nCalifornia and the federal government are fully aware that it can take several years or rainwater to percolate down to fill aquifers and start pushing the earth surface back up. According to an January 17, 2017 report by the U.S. Geological Survey for the District of Columbia:\nDuring a drought, a lot of rain is needed to make up for water deficits, and to fill our reservoirs and recharge our aquifers. During hot summers, a lot of rain gets evaporated before getting the chance to replenish our water supplies. In terms of replenishing our groundwater supplies, it may take a long time for water that falls on the earth’s surface to reach and recharge the aquifers. The deeper the aquifer, the longer it takes for rainfall to get there.\nDespite the five-year California drought that started in 2011, California groundwater and earth levels rose in 2011 and 2012 due to the delayed impacts of water percolation on subsidence. Central Valley farming experts told Breitbart News that it will probably take another two years for this year’s heavy rains to start pushing the ground up again.","url":"https://www.breitbart.com/local/2017/03/09/dont-expect-central-valley-stop-sinking-drought-yet/"}
