{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:47:30","date_modify":"2018-10-30 18:47:30","date_publish":"2018-07-25 02:28:30","description":"First son Donald Trump Jr. told teens at Turning Point USA’s banquet Tuesday that his mother escaped communist Czechoslovakia “for a reason.\"","filename":"data/vaneerConsumption/DonTrumpJrTellsTeensHisMotherEscapedCommunismForaReason.json","image_url":"https://media.breitbart.com/media/2018/07/Don-Jr.-Jim-WatsonAFPGetty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_24__1540925250.html","title":"Don Trump Jr. Tells Teens His Mother Escaped Communism ‘For a Reason’","title_page":"Don Trump Jr. Tells Teens His Mother Escaped Communism ‘For a Reason’","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, DC — First son Donald Trump Jr. explained to teens at Turning Point USA’s banquet Tuesday night that his mother escaped communist Czechoslovakia “for a reason.”\nIt was near the end of a speech to the teens at the Trump Hotel in Washington, DC, that Trump told them of one of the greatest lessons he has ever learned.\nHe asked the crowd why no one under socialism has advocated for it. He spoke of his grandmother who grew up in what was communist Czechoslovakia. He said his grandfather took him there when he was young every summer for six or eight weeks and he learned what it was like, calling it one of the most important lessons he ever learned.\n“I got to see the opposite of what I saw in this country,” said Trump. “I learned not to take all of our incredible freedoms … for granted,” and that it was not an easy lesson for the son of a billionaire from New York city. He spoke of his grandmother being in distress when she sees people advocating for socialism on the news.\n“My mother escaped from it for a reason,” said Trump, adding that it didn’t offer her opportunities, but rather the exact opposite.\nTrump opened his speech by taking a poll to ask the teens if they wanted his “pre-scripted nonsense” speech, holding up a typed version, or if they wanted the handwritten bullet point speech that he held up as an alternative. The crowd clearly favored the bullet point speech with their cheers.\n“You are actually using your own mind. That does not happen often anymore these days,” Trump said of their stance for conservative values. “You are being the true trailblazers.”\n“When I’m long gone you will still be reaping the benefits” of all they are creating, said Trump, adding that they will benefit from his “father’s policies.”\nTrump told the crowd that his father, President Donald Trump, spoke with him just before the event and wanted to tell the teens, “Thank you.”\n“You are going to be the beneficiaries of this economy,” he went on, citing the availability of jobs. “The other side doesn’t even know what they’re talking about.”\nHe asked them what the Democratic platform is now. He agreed with them that it is socialism and Karl Marx, while Republicans are the party of Lincoln. Then he said it is also the party of hate and b.s., declaring, “Hate and b.s. is not a political platform.”\n“They want to roll back anything that Donald Trump has done,” he said. He cited record low unemployment rates for many demographics.\n“The derangement is real folks,” he said, adding they’ve seen what it’s done to the minds of Democrats. “Name one economic matrix, name one, where we are not better off than we were four years ago,” said Trump, concluding that they couldn’t “because it doesn’t exists and they want to change that for some reason.”\nTrump told them to look at what’s going on in North Korea. He spoke of turning on the tv and to see pundits saying that they had been working on the North Korea problem for 30 years and President Trump is doing things all wrong. President Trump did the opposite of what the longtime pundits have said to do, and that the president is getting results, Trump conveyed and described the president as the embodiment of “promises made, promises kept.”\nTrump listed Trump’s kept promises on tax reform, cutting regulations beyond goals set, the Supreme Court, and Israel. “No one had the guts to actually do it, until now,” Trump said of the president’s action to move the embassy in Israel to Jerusalem.\n“You guys are those trailblazers. You guys are those rebels,” he said, as he told them to stay active in the 2018 midterms. He said the Democrat Party has lost its way and is “no longer the party of the working class.”\nHe urged the teens to make sure that the Trump supporters know that “just because Donald Trump isn’t on the ticket in 2018, doesn’t mean that he’s not on the ticket. It doesn’t mean that all of his policies, all of the accomplishments, all of the winning, it is all on the ticket, and we’ve got to fight for it.\nTrump said the only thing president Trump has ever been wrong about is that they would get tired of winning. He asked the crowd if they were tired of it yet, and they shouted back “No.”\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook","url":"https://www.breitbart.com/politics/2018/07/24/don-trump-jr-tells-teens-his-mother-escaped-communism-for-a-reason/"}
