{"authors":["Associated","Press Reporter"],"date_download":"2018-10-22 20:15:26","date_modify":"2018-10-22 20:15:26","date_publish":"2016-01-29 00:54:03","description":"Dontrell Stephens, 22, removed his shirt in a federal courtroom to show that his wounds prove his hands were in the air when he was shot by a Florida cop in Fort Lauderdale in 2013.","filename":"data/vaneerConsumption/DontrellStephensparalyzedbydeputyremovesshirttoshowjuryhiswounds.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AECF4F00000578-0-image-a-48_1454039443712.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421819_Man-paralyzed-deputy-removes-shirt-shows-jury-wounds_1540239326.html","title":"Dontrell Stephens paralyzed by deputy removes shirt to show jury his wounds","title_page":"Dontrell Stephens paralyzed by deputy removes shirt to show jury his wounds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A paralyzed young black man winced in pain Thursday as his brother removed his suit jacket and shirt to show a federal jury bullet wound scars from being shot by a sheriff's deputy who had stopped him for riding his bicycle into traffic.\nDontrell Stephens, 22, told the six women and two men hearing his case that he had his hands over his head and was unarmed when Palm Beach County Deputy Adams Lin began shooting in September 2013. He pointed at a scar on the inside of his right elbow, the bullet still lodged on the outside of the elbow.\nHis attorney, Jack Scarola, said outside court that the wound and the bullet's position bolster Stephens' testimony that his arms were in the air and contradicts Lin's statements that Stephens had dropped his arms and was reaching into his back waistband when the officer began firing. If his arms were down, Scarola said, Stephens could not have been hit on the inside of the elbow.\nScroll down for video\nSeeking damages: Dontrell Stephens, 22, removed his shirt in a federal courtroom to show that his wounds prove his hands were in the air when he was shot by a Florida cop in Fort Lauderdale in September 2013\nDontrell Stephens arrives at the Federal courthouse in Fort Lauderdale, Florida, on Thursday for the start of his civil trial. Stephens is suing Palm Beach County deputy Adams Lin and the Palm Beach Sheriff's Office\nThe 22-year-old was 20 when he was shot by a local officer. He claims his civil rights were violated. He is seeking in excess of $5 million to cover his medical treatment and future care\nStephens is suing Lin and the Palm Beach Sheriff's Office, alleging his civil rights were violated. He is seeking in excess of $5 million to cover medical treatment and future care.\nThe case is one of several across the country that have sparked debate about the shooting of unarmed black males by law enforcement officers. Federal Magistrate Judge Barry S. Seltzer has instructed the jury that they are only to consider the specific circumstances of Stephens' shooting and no other.\nScarola said Thursday was the first time Stephens and Lin had seen each other since the shooting.\nLin, an Asian-American, has been cleared of criminal wrongdoing by sheriff's investigators and local prosecutors and has since been promoted to sergeant.\nHe has said that after reaching for his waistband, Stephens lurched forward with a dark object in his left hand that he thought was a gun.\nDashcam footage from a Florida cop car taken in September of 2013 shows Dontrell Stephens being pursued by police. He then stops, gets off his bike and puts his hands up\nStephens (center) was shot by Palm Beach County Sheriff's Office Deputy Adam Lin and is now paralyzed\nDeputy Lin fired his gun four times at Stephens even though the then-20-year-old had a cellphone, not a gun\nWith Stephens sitting in his wheelchair in the courthouse hallway before he testified, Lin looked away as he walked past. At one point, one of Stephens' relatives turned his wheelchair so he wouldn't be facing down the hallway toward where Lin was standing.\nStephens told the jury in a calm, clear voice that he rode to a convenience on Sept. 13, 2013, and noticed Lin's patrol car parked nearby as he pedaled away.\nStephens has a record for possessing cocaine\nHe said that while riding, he got a cellphone call from a friend and talked with the phone in his right hand until he heard a short siren burst behind him as he turned into a parking lot. He looked over his left shoulder as Lin turned on his blue lights, which is confirmed by video from Lin's dashboard camera.\nHe rode a few more feet, jumped off his bike and then walked between two parked cars toward where Lin had moved — out of the dash cam's range.\n'I asked the officer what I was being stopped for,' Stephens said. He said Lin did not reply but had a 9 mm handgun pointed at him. Stephens indicated that they were about 6 feet apart facing each other.\n'I felt terrified, scared for my life,' Stephens said.\n'He told me to put my hands up. As soon as I put my hands up, he started shooting,' Stephens said.\nThe video shows Stephens turning as he comes back into the dash cam's view and then falling to the ground, his cellphone still in his right hand. Lin stands over him with his gun drawn and orders Stephens to roll from his back to his stomach. Stephens testified that he couldn't move.\nStephens said his last memory of that day was being in the back of the ambulance. He awoke several days later in the hospital, staring into a bright light.\nVideo of the shooting was released as part of a lawsuit filed against the Palm Beach County Sheriff's Office\nHe said he is living with his three brothers in a small apartment. He has undergone rehabilitation but has no control of his bladder or bowels.\n'It's pretty bad to have pain at night and day. I try my best myself to handle it, but when it's real bad, I cry,' Stephens said. '...There's no other way I can handle it.'","url":"https://www.dailymail.co.uk/news/article-3421819/Man-paralyzed-deputy-removes-shirt-shows-jury-wounds.html"}
