{"authors":["Sebastian Shakespeare For The Daily Mail"],"date_download":"2018-10-22 20:31:20","date_modify":"2018-10-22 20:31:20","date_publish":"2016-01-29 02:00:31","description":"Despite her long career with the BBC, Dame Esther Rantzen has become the first veteran presenter to hit out at its controversial scheme to plug an impending £650 million funding shortfall.","filename":"data/vaneerConsumption/DontgivecashtoBBCEstherRantzentellspensionersbySEBASTIANSHAKESPEARE.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/309D73CF00000578-0-image-a-42_1454032818039.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422052_SEBASTIAN-SHAKESPEARE-Don-t-cash-BBC-Esther-tells-pensioners_1540240280.html","title":"Don't give cash to BBC, Esther Rantzen tells pensioners, by SEBASTIAN SHAKESPEARE","title_page":"Don't give cash to BBC, Esther Rantzen tells pensioners, by SEBASTIAN SHAKESPEARE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Outspoken: Dame Esther Rantzen\nDespite her long and fruitful career with the BBC, Dame Esther Rantzen has become the first veteran presenter to hit out at its controversial money-raising scheme to plug an impending £650 million funding shortfall.\nThe Corporation divided opinion earlier this week when it announced it could rely on a roster of so-called ‘silver celebrities’ — including Lord Bragg, Dame Helen Mirren and Sir Michael Parkinson — to persuade pensioners to pay their TV licence voluntarily after the Government announced it will no longer subsidise free TV licences for over-75 year olds.\nHowever, outspoken charity founder Rantzen, who is 75, argues the money would be better spent elsewhere.\n‘It’s a new concept, isn’t it? That the BBC is some sort of charity that we’re going to donate to. I love the BBC, but I’ve never thought of it in that way — as a charity,’ she tells me.\nRantzen, who presented That’s Life! from 1973 until 1994, started at the BBC in 1965 as a researcher. Twenty years later she turned her focus to charity work and created the children’s counselling service ChildLine in 1986, followed by The Silver Line — a helpline for older people — in 2013. She adds: ‘I don’t mind donating the equivalent of a TV licence fee to a good cause, such as Cancer Research, the Silver Line, or ChildLine, but is the BBC saving anyone’s life? I’m grateful to the BBC, but I just don’t think of it as a charity.’\nThe Government has met the cost of licences for over-75s since 2001, transferring the money to the BBC annually.\nBut Chancellor George Osborne announced last July that the BBC’s responsibility for the free licences will be phased in from 2018-19. In return, the Government agreed the Beeb could ask for voluntary payments from those receiving free licences.\nI'd rather die than retire, says Gambon\nCelebrated actor Sir Michael Gambon may have admitted he is having problems learning his lines — he even needed crib notes in his pockets to help him with his dialogue in the new Dad’s Army film — but he hasn’t ruled out a stage comeback. ‘I’d love to do another play like Krapp’s Last Tape,’ he says of Beckett’s classic in which he appeared most recently in 2010 in the West End.\n‘If they gave me that again, I would like that. It would be terrible to retire. I’d rather drop dead.’\nThe joy of the piece for Gambon is that the actor playing Krapp only has to listen to pre-recorded tapes of his character talking about his life.\nThe late Cecil Parkinson never escaped the disgrace of abandoning his love child. But he started out in life with more lofty ambitions. The former Tory Cabinet Minister wrote to author Dominic Shelmerdine in 1991 saying he set out ‘to play football like Tom Finney, the star player for my favourite football team Preston North End, and to go into the Church as a clergyman. I finished up playing rugby and being a politician!’\nNot to mention playing fast and loose...\nTV Kirsty in a state of Andress\nIs TV presenter Kirsty Gallacher angling for a new role as a Bond girl? Kirsty, who was the fifth celebrity to be booted off the last series of Strictly Come Dancing, certainly looked more at home on the seashore than the dance floor as she mimicked Ursula Andress in the 1962 film Dr No, posing in a white bikini and clutching a pair of conches.\nNew role? Kirsty Gallacher (right) mimicked Ursula Andress in the 1962 film Dr No (left), posing in a white bikini and clutching a pair of conches. The only thing missing from the snap was a dagger at her hip\nThe only thing missing from the sultry snap, part of an ad campaign for spa Champneys, was a dagger at her hip. Despite turning 40 last week, the buxom brunette still has a shot at bagging 007.\nItalian Monica Bellucci was 50 when she was cast as Daniel Craig’s love interest in the latest Bond outing, Spectre.\nWhile Boris Johnson MP continues to sit on the fence over whether Britain should stay in or leave Europe, his father Stanley has nailed his colours to the mast.\nNext week, the former MEP and environmental campaigner is hosting an event at the House of Lords for the launch of Environmentalists For Europe (E4E). The jolly Johnson patriach has co-founded the new group with birdwatcher Bill Oddie.","url":"https://www.dailymail.co.uk/news/article-3422052/SEBASTIAN-SHAKESPEARE-Don-t-cash-BBC-Esther-tells-pensioners.html"}
