{"authors":[],"date_download":"2018-10-22 21:50:27","date_modify":"2018-10-22 21:50:27","date_publish":"2014-05-08 14:53:26","description":"The SEC isn't exactly telling people to avoid bitcoin altogether -- but it wants you to know the cryptocurrency is a breeding ground for scams.","filename":"data/vaneerConsumption/DontBeaSuckerforBitcoinScamsSECWarns.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_10/232766/140306-bitcoin-sign-02-1125_919e545eeb75c5668fa7eb8ea957b12f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_dont-be-sucker-bitcoin-scams-sec-warns-n100371_1540245027.html","title":"Don't Be a Sucker for Bitcoin Scams, SEC Warns","title_page":"Don't Be a Sucker for Bitcoin Scams, SEC Warns","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDon't be a sucker when it comes to bitcoin.\nThat's the gist of a new warning from the Securities and Exchange Commission. The regulatory group isn't exactly telling people to avoid bitcoin altogether -- but it wants you to know the shadowy \"cryptocurrency\" is a potential breeding ground for all sorts of scams.\nThat's because bitcoin is new and different, and its recent meteoric (though volatile) rise in value can be seductive to uninformed investors, the SEC said.\nAs the SEC put it in an alert published Wednesday: \"Potential investors can be easily enticed with the promise of high returns in a new investment space and also may be less skeptical when assessing something novel, new and cutting-edge.\"\nStill, though bitcoin is a new investment opportunity, the SEC's advice for spotting scams would apply to all kinds of general fraud: avoid deals that sound too good to be true, don't give in to high sales pressure, etc.\nIf a victim does get sucked in, however, that's where bitcoin does present unique challenges. The digital-only currency is difficult to trace, it's international, it isn't regulated by any central authority and law enforcement has a tough time seizing or freezing those ill-gotten gains.\nThe SEC closed its alert with a final warning for people who choose to invest in bitcoin, even if they aren't victims of fraud. The agency reiterated that bitcoin is not ensured or regulated, it has a history of volatility and security problems, and it's simply a new type of investment.\nThe SEC's Wednesday warning is just one of several recent alerts from regulatory groups, who have started to roll out official statements as the bitcoin market develops -- and as it suffers setbacks like the February bankruptcy of the major bitcoin exchange Mt. Gox.\nOn the consumer side, the SEC itself published an advisory last summer about the use of bitcoin in known Ponzi schemes. The Internal Revenue Service determined in March that it would tax bitcoin as property, not as currency.\nFinancial groups are worried, too. The Financial Industry Regulatory Authority (FINRA) recently issued its own alert about the risks of digital currencies. The North American Securities Administrators Association (NASAA) included digital currencies on its list of the top 10 investor threats of 2013.","url":"https://www.nbcnews.com/tech/innovation/dont-be-sucker-bitcoin-scams-sec-warns-n100371"}
