{"authors":[],"date_download":"2018-10-30 01:26:06","date_modify":"2018-10-30 01:26:06","date_publish":"2014-07-10 08:00:00","description":null,"filename":"data/vaneerConsumption/DontSayGoodbyetoRedheadsYet.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/07/Bill_and_Kevan_-_not_listening-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862766.html","title":"Don’t Say Goodbye to Redheads Yet","title_page":"Don’t Say Goodbye to Redheads YetThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As everyone knows, the easiest way for a scientist to get his or her name in the paper these days is to make a prediction about global warming. Miami will be underwater, millions will die of starvation, giraffes will be roaming Nebraska — you name it, someone will print it. After all, how could President Obama be fulfilling the longtime dream of environmentalists of closing down the American economy and taking us back to a simpler time if we weren’t constantly imbued with the sense that we are living in the Last of Days and World Apocalypse is upon us?\nLast week, however, this whole circus finally jumped the shark, at least by my reckoning, with the prediction of a Scottish scientist that global warming is going to drive redheads extinct.\n“The red-headed gene is believed to be an evolutionary response that allows the body to absorb more vitamin D in gloomy weather, not unlike the conditions typically seen in Scotland,” reported The Weather Channel in one of numerous stories. “The new theory suggests that warming temperatures could put an end to that response, rendering all (natural) redheads extinct. ‘I think the reason for light skin and red hair is that we do not get enough sun and we have to get all the Vitamin D we can,’ Dr. Alastair Moffat, managing director of Scotland’sDNA, told the Daily Mail. ‘If the climate is changing and it is to become more cloudy or less cloudy then this will affect the gene.… if it was to get less cloudy and there was more sun, then yes, there would be fewer people carrying the gene.’”\nNow I happen to be a redhead (as in above photo), so I’m not completely neutral here. I can tell you without question that sunburn and overexposure to ultraviolet rays are the bane of having pale skin. Whenever I visit Florida I begin to feel sick after a few days from all the radiation I’m absorbing. I don’t think I could live down there without spending all my time indoors or drowning in sun lotion.\nBut it’s junk science that aggravates me here.\nDr. Moffatt, whoever he may be, seems to be making a fundamental confusion here between two very important scientific concepts, ultraviolet and infrared radiation, or as we might call them, “sunlight” and “heat.” If global warming meant more sunburn-causing ultraviolet radiation were reaching the earth, then redheads might be in for a hard time. But ultraviolet has nothing to do with global warming.\nThe theory of global warming instead says that increased carbon dioxide in the atmosphere will trap infrared radiation — heat — normally reflecting back into space, therefore warming the earth — the so-called “greenhouse effect.” So redheads won’t be impacted more than anyone else.\nGranted, Moffatt gets around this by arguing that cloud cover will be the controlling factor. Decreased cloud cover, he says, will let in more sunlight, which will make the low-melanin, redheaded gene superfluous. But nobody has any idea whether a hypothetical warming earth would have more or less cloud cover. In fact, Richard Lindzen, perhaps the world’s most prominent global warming skeptic, argues precisely that increased warming will create more cloud cover and that this will be enough to offset the whole earth-overheating scenario.\nActually, if you think about it long enough and want to engage in the kind of off-the-wall speculations that characterize most global warming “science,” you could argue that red hair will become more important. Red hair is a recessive gene that has emerged mostly in northern latitudes such as Denmark and Scotland where the Gulf Stream keeps the weather tolerably warm while sunlight remains relatively weak. Now if the earth’s middle latitudes start becoming intolerably hot and people start migrating toward places like Canada and Siberia, then red hair is going to become more adaptive.\nWell, this is just another far-out speculation of the kind that says we should be closing down whole sectors of the economy because of what the weather is going to be like 50 years from now. In any case, I’m not worried that my grandchildren will become evolutionarily obsolete. (Red hair seems to skip generations.) I’m much more worried that there won’t be much left of the American economy if we base our future on predictions like this one.","url":"https://spectator.org/59910_dont-say-goodbye-redheads-yet/"}
