{"authors":["Nicholas St. Fleur"],"date_download":"2018-10-22 23:09:01","date_modify":"2018-10-22 23:09:01","date_publish":"2014-07-22 00:00:00","description":"Researchers have stumbled on an ingenious idea: Use bubble wrap as a cheap test tube and petri dish. They've even run tests on blood that's sitting inside the poppable packaging. So how does it work?","filename":"data/vaneerConsumption/DontPopThatBubbleWrapScientistsTurnTrashIntoTestTubes.json","image_url":"https://media.npr.org/assets/img/2014/07/21/bubbles-edit_wide-4d7d94aca70315917eaeb53b5e429616d20e17d9.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_goatsandsoda_2014_07_22_333587799_dont-pop-that-bubble-wrap-scientists-turn-trash-into-test-tubes_1540249741.html","title":"Don't Pop That Bubble Wrap! Scientists Turn Trash Into Test Tubes","title_page":"Don't Pop That Bubble Wrap! Scientists Turn Trash Into Test Tubes : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Don't Pop That Bubble Wrap! Scientists Turn Trash Into Test Tubes\nEnlarge this image toggle caption American Chemical Society American Chemical Society\nHate to burst your bubble, glass lab gear. But plastic bubble wrap also works pretty well at running science experiments.\nScientists at Harvard University have figured out a way to use these petite pouches as an inexpensive alternate to glass test tubes and culture dishes. They even ran glucose tests on artificial urine and anemia tests on blood, all with the samples sitting inside bubble wrap.\n\"Most lab experiments require equipment, like test tubes or 96-well assay plates,\" says chemist George Whitesides, who led the study. \"But if you go out to smaller villages [in developing countries], these things are just not available.\"\nOne glass test tube can cost between $1 and $5. Bubble wrap, by contrast, is dirt cheap. One square foot of it, with about 100 to 500 bubbles depending on bubble dimensions, costs only 6 cents, Whitesides and his team reported Thursday in the journal Analytical Chemistry.\n\"You can take out a roll of bubble wrap, and you have a bunch of little test tubes,\" he says. \"This is an opportunity to potentially use material that would otherwise have been thrown away.\"\nWhitesides is a master at converting cheap, everyday materials into lab equipment. He's made a centrifuge from an egg beater and CD player. And he's designed a glucose detector from paper and tape.\nWhile visiting scientists around the world, Whitesides noticed that many labs in developing countries don't even have simple pieces of equipment, such as test tubes for running blood tests, storing urine samples or growing microbes.\nThat's when the idea popped into his head: bubble wrap. The packaging material is readily available all over the globe, and scientists often have it around the lab because other equipment is shipped in it.\nSo Whitesides and his team tried injecting blood and chemicals into the clear blisters with a needle and syringe. They then sealed the holes with nail polish.\nThe bubbles held the liquid with no problem. And since the plastic is clear, the team could use the mini-test tubes for tests that involve color changes. For instance, to test for anemia, the scientists added a chemical that changes colors when it reacts with iron in blood. They also successfully grew bacteria and worms inside the bubbles.\nBut to make a good test tube or petri dish, the bubble wrap also needed to be sterile.\nSo Whitesides' students filled the plastic bubbles with a solution of food for microorganisms and looked to see if bacteria grew inside. After four days, no microbes appeared. To their surprise, the air and plastic inside the bubbles were completely sterile.\nThat finding also surprised Michele Barry, a tropical disease doctor at Stanford University, who wasn't involved in the study.\n\"I had no idea that the bubbles themselves were sterile, which is fabulous,\" she tells Goats and Soda. \"I just assumed it would be colonized by bugs. So this is amazingly interesting.\"\nLabs in poor countries have a great need to store samples, Barry points out. The bubble wrap could also be used to test water for toxic metals, such as mercury, arsenic and lead, she says.\nBut the plastic packaging comes with many limitations. The mini-test tubes must be handled carefully or they'll pop — literally. And bubble wrap is sensitive to light. It degrades over time.\nTo use the bubble wrap, scientists need needles and syringes — which could be just as scarce as test tubes in a bare-bones lab, Barry points out.\nWhitesides says he doesn't have specific plans to roll out the bubble wrap in labs anytime soon. But he hopes that this proof-of-concept study will inspire other scientists around the world to take the idea and wrap it up.","url":"https://www.npr.org/sections/goatsandsoda/2014/07/22/333587799/dont-pop-that-bubble-wrap-scientists-turn-trash-into-test-tubes"}
