{"authors":[],"date_download":"2018-10-22 22:22:48","date_modify":"2018-10-22 22:22:48","date_publish":"2014-05-09 21:38:57","description":"The hotel boycott continues to grow following publicity about the owners connection to the new Islamic law (Sharia) penalties in Brunei.","filename":"data/vaneerConsumption/DorchesterSaysItsUnfairlySingledOutforShariaTies.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/433236/140509-hotel-bel-air-1723_78854a41abaf9bddb6899c5f3bc5cc8f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_dorchester-says-its-unfairly-singled-out-sharia-ties-n101886_1540246968.html","title":"Dorchester Says It's Unfairly Singled Out for Sharia Ties","title_page":"Dorchester Says It's Unfairly Singled Out for Sharia Ties","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAs losses from an anti-Sharia boycott mount for the Bel-Air and Beverly Hills hotels, its effect on the owner's bottom-line may not be as important as the public shaming that comes along with it, according to an official at Human Rights Watch.\n\"I don't want to put some chambermaid at the Beverly Hills Hotel out of a job so the Sultan of Brunei might lose money on a minimal investment,\" said John Sifton, the Asia Advocacy Director for Human Rights Watch. \"Naming and shaming\" is usually a better option than a boycott, he said.\nThe hotels' owners, the Brunei Investment Fund, has an estimated value of $40 billion, according to the Sovereign Wealth Fund Institute. But calculating the actual value and its full investments is nearly impossible. \"They are one of the least transparent funds on the planet,\" said Michael Maduell, president of the institute.\n\"The hotel assets are a real small part of their portfolio,\" which also include a lot of oil, real estate, stocks and exchange-traded funds, Maduell said. Brunei formerly made high-risk investments, but likely turned more conservative after a high-profile lawsuit, he said.\nAnd yet the boycott of the Dorchester Collection hotels continues to grow, following publicity about the owners connection to the new Islamic law (Sharia) penalties in Brunei, an oil-rich country in southeast Asia on the island of Borneo next to Malaysia. The Bel-Air and Beverly Hills properties are among the 10 Dorchester luxury hotels owned by the Brunei Investment Agency, a branch of the government.\nSo far the boycott has been joined by celebrities such as Ellen DeGeneres, Jay Leno, Stephen Fry and Sharon Osbourne; politicians including Los Angeles Mayor Eric Garcetti; and businesses including Virgin and the CRUISE.co.uk travel agency.\nCalifornia Lieutenant Governor Gavin Newsom added his name to the boycott list via Twitter. \"Headed to LA tomorrow. Two places I won't be visiting: the Bel Air & Beverly Hills hotels. Please join the boycott,\" he tweeted Thursday.\nGLAAD also said it is returning donations from the Beverly Hills Hotel. In a letter posted Thursday on the organization's website, Sarah Kate Ellis, GLAAD's president and CEO wrote: \"I know that you are working to rebuild your hotel's standing with the LGBT community as well as our allies, but GLAAD is not interested in being a public relations pawn.\"\nThe Los Angeles Jewish Home also canceled an event at the hotel, the Los Angeles Daily News reported Thursday.\nVirgin CEO Richard Branson elaborated Thursday on his reasons for the boycott by his companies.\n\"Richard believes the planned imposition of stoning and death sentences for adultery, sodomy and murder is regressive and a step too far. He has consistently spoken out against such extreme legal actions; in some cases trying to work with governments to moderate laws and in others calling for a boycott,\" Nick Fox, spokesman for Richard Branson, said in an email to CNBC late Thursday.\n\"The Virgin group of companies has many relationships worldwide, and we try to use our businesses as a force for good. We do our best to pick our partners appropriately, in this case we feel the changes in Brunei have gone too far,\" Fox added.\nThe Beverly Hills City Council on Tuesday called for new ownership of the hotel so it \"will not be tarnished by the Brunei government's actions,\" as Mayor Lili Bosse said.\nDorchester's CEO Christopher Cowdray said the boycott is unfair.\n\"We believe the Beverly Hills City Council resolution unfairly targets The Beverly Hills Hotel and its 650 employees, and this has resulted in a boycott. The hotel has already lost $1.5 million in cancelled events and many of our employees may lose the more than $8 million in gratuities they receive annually working at meetings and functions normally held at the hotel. The boycott will result in a reduction of the $11 million the hotel contributes in local taxes and will curtail the millions spent in purchasing goods and services from local companies. In today's global economy, more than $5 trillion of capital is managed by Sovereign Wealth Funds, the majority of which is from South East Asia and the Middle East,\" he said in a statement after the council's vote Tuesday.\n\"Many iconic American brands across a wide variety of industries — hotels, real estate, consumer products, luxury goods, technology, and others — are backed by countries governed by Sharia and not aligned with our civil liberties. Many of these companies are in our own back yard. Against this backdrop, we question why The Beverly Hills Hotel is being singled out,\" Cowdray said.\nSifton agreed that there are many regions in the world that practice some level of Sharia, but only a handful have it institutionalized in the criminal law. Brunei's recent addition of more crimes and more severe penalties for so many crimes puts it in league with Iran, Saudi Arabia, a few states in Nigeria and Aceh in Indonesia, Sifton said.\nOne of the hotel unions has been active in the campaign against the hotel. Earlier this week, Buzzfeed reported the it is actually steering the anti-Dorchester campaign. UNITE HERE Local 11 even runs a DumpBHH.org website calling for a boycott.\n\"Hotel Bel-Air closed in 2009 for a two-year renovation. It was union when it closed, and it reopened as non-union,\" Leslie Lefkowitz, a spokeswoman for the hotel told CNBC Thursday in an email.\nWhen the Hotel Bel-Air closed in 2009, the severance paid to employees was the largest any hotel has ever paid in California, and she blamed the union for creating hurdles for a supervised election by the federal government that would allow the employees to vote for or against organized labor.\nEarlier in the week, union president Tom Walsh called the Sultan of Brunei anti-worker and anti-gay. \"We want him out of Beverly Hills and out of the United States,\" Walsh said. \"These historic hotels deserve ownership that will respect human rights and the rights of their own workers.\"","url":"https://www.nbcnews.com/business/travel/dorchester-says-its-unfairly-singled-out-sharia-ties-n101886"}
