{"authors":[],"date_download":"2018-10-22 22:04:38","date_modify":"2018-10-22 22:04:38","date_publish":"2017-04-26 03:31:17","description":"Internet mogul Kim Dotcom has launched a bold, though probably doomed, bid to have FBI director James Comey grilled by New Zealand police while visiting the...","filename":"data/vaneerConsumption/DotcomurgesKiwicopstogoafterFBIchief.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/03/wire-462911-1493173879-999_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446170_Dotcom-urges-Kiwi-cops-FBI-chief_1540245878.html","title":"Dotcom urges Kiwi cops to go after FBI chief","title_page":"Dotcom urges Kiwi cops to go after FBI chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Internet mogul Kim Dotcom has launched a bold, though probably doomed, bid to have FBI director James Comey grilled by New Zealand police while visiting the South Pacific nation for a security conference\nInternet mogul Kim Dotcom has launched a bold, though probably doomed, bid to have FBI director James Comey grilled by New Zealand police while visiting the South Pacific nation for a security conference.\nComey is reportedly attending a meeting of the \"Five Eyes\" intelligence sharing network -- the United States, Britain, Canada, Australia, and New Zealand -- being held in the South Island this week.\nDotcom's interest stems from an Auckland court's ruling in 2014 that the FBI illegally copied and transferred data about his Megaupload empire from New Zealand to the United States.\nThe data was seized during a 2012 police raid in Auckland that shut down Megaupload and triggered Dotcom's ongoing legal battle to avoid extradition to the United States.\nDotcom said he had filed a formal complaint with New Zealand police about the FBI's actions, requesting they \"urgently\" interview Comey while he was in the country.\n\"The FBI broke the law. That's what NZ courts found. It's the job of NZ Police to uphold the law. And we're all equal before the law, right?\" he tweeted late Tuesday.\nHowever, authorities in New Zealand will not even confirm whether Comey is attending the conference, which is being held at a luxury resort near Queenstown.\nMedia images published Sunday showed a figure in sunglasses bearing a striking resemblance to Comey being whisked away from the tarmac at Queenstown airport in a black security vehicle.\nPrime Minister Bill English this week confirmed the Five Eyes meeting but would not reveal who was attending, saying only \"it's a pretty security conscious group of people\".\nNew Zealand Police were tight-lipped when asked about Dotcom's demand that they haul in Comey for questioning.\n\"Police have received correspondence and it is being assessed,\" a spokeswoman said.\nThe FBI alleges Megaupload netted more than US$175 million in criminal proceeds and cost copyright owners more than US$500 million by offering pirated content.\nA New Zealand court ruled in February that Dotcom and his three co-accused were eligible to be extradited to the United States on fraud charges.\nIf convicted, they could face jail terms of more than 20 years.\nDotcom, who denies any wrongdoing and is on bail in Auckland, plans to appeal the decision, meaning his epic legal fight is likely to stretch into a sixth year.","url":"https://www.dailymail.co.uk/wires/afp/article-4446170/Dotcom-urges-Kiwi-cops-FBI-chief.html"}
