{"authors":["John Hayward"],"date_download":"2018-10-30 22:19:24","date_modify":"2018-10-30 22:19:24","date_publish":"2016-10-04 16:58:16","description":"GOP strategist Doug McMarlin talked about the upcoming VP debate on Tuesday’s Breitbart News Daily with SiriusXM host Alex Marlow.","filename":"data/vaneerConsumption/DougMcMarlinWatchtheDemeanoroftheCandidatesDuringVPDebateBecauseLikelihoodofSenatorKaineGettingAgitatedIsVeryHigh.json","image_url":"https://media.breitbart.com/media/2016/10/Pence-Kaine-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2016_10_04__1540937964.html","title":"Doug McMarlin: ‘Watch the Demeanor of the Candidates’ During VP Debate Because ‘Likelihood of Senator Kaine Getting Agitated Is Very High’","title_page":"Doug McMarlin: ‘Watch the Demeanor of the Candidates’ During VP Debate Because ‘Likelihood of Senator Kaine Getting Agitated Is Very High’","title_rss":"NULL","source_domain":"breitbart.com","text":"Veteran GOP strategist Doug McMarlin talked about the upcoming vice presidential debate on Tuesday’s edition of Breitbart News Daily with SiriusXM host Alex Marlow.\nMcMarlin said:\nTraditionally, when you prepare for a VP debate, you’ll spend several weeks or so and hit on every hot button issue that’s going on in the world and domestically. In this particular instance, I’m sure that that’s happening. In fact, I’m almost certain it is. However, this particular debate’s a bit different because this race has become so contentious. I think that the candidates will spend a lot of time supporting the positions of their running mate, the primary candidate. And I’d bet you there’s going to be a lot of questions that come about some of the more salacious aspects of this race so far.\nHe observed that the best debate “zingers” tend to come in the vice presidential debates, such as “Lloyd Bentsen in 1988, when he dropped the line on Dan Quayle and said, ‘You’re no Jack Kennedy.’ That’ll be taught in school for a long time as one of those things you look at.”\nMcMarlin was confident that Pence would not allow the media moderators to dictate all the debate topics to force his campaign’s issues off the stage, as arguably occurred to his running mate Donald Trump during the first presidential debate:\nGovernor Pence is, one, a consummate politician. He’s also a former radio host, as we all know, and he has been spectacular on the trail, answering the questions that he wants to answer, and also at the same time covering what the media has asked. He comes across as kind of the balance to Mr. Trump. Mr. Trump is very direct. He will say exactly what he thinks, and I think we’ve seen that. Mr. Pence is a bit more calm and kind of even-keeled. That will probably put him in a much better position. And also, always, too, it’s a matter of who’s gonna get rattled. I’m not quite sure what Elaine [Quijano] is going to ask, but neither one of them seem to get rattled badly, but it seems that Governor Pence is much better at doing this sort of thing.\nMcMarlin agreed that more attention should be paid to Democratic vice presidential candidate Tim Kaine, who has been fairly low-key on the campaign trail so far, given the lingering questions about Hillary Clinton’s health:\nAside from the health issue aspect, we also have two of the oldest candidates that would be elected to the presidency. That’s put a lot of focus on both vice presidential candidates – but in particular on the Senator, because as you pointed out absolutely correctly, there’s already some thinking in the back of folks’ heads. And now that we’re into the homestretch here, people are going to start to make up their minds, and the great middle of the country that actually decides these elections are starting to think about these things, like, “Hmm, I’m not quite so sure.” Now, would you like to have Governor Pence in the extremely unfortunate instance of him taking office, or would you like to have Mr. Kaine? And I think the answer to that’s quite obvious. Mr. Pence is, as I said, much more even-keeled. And I think that, as I mentioned earlier, a lot of the questions tonight, instead of what’s normally been talked about in vice presidential debates, are gonna be directed at issues that have popped up with the actual nominees. So, for example, with Secretary Clinton, you’re exactly right: They’re going to talk about that. They’re going to talk about emails. They’re going to talk about, possibly, the previous history of her time as a U.S. Senator, which would not be hard to ask the other U.S. Senator. And also, specifically, Benghazi and some of the other issues that the American public is well, well aware of.\nAsked for one surprising or unexpected thing to look for in the VP debate, McMarlin replied:\nYou know what? Don’t look at the words. Watch the demeanor, and you’ll see a comfort level with one of the candidates, and I think we know who that is. And we’re going to see, I think, the likelihood of Senator Kaine getting agitated is very high, and Mr. Pence being very calm, and responding in a very good way, as he has continuously on the trail.\n“Watch the demeanor of the candidates. That’s the important thing because that’s going to be the demeanor of what they do for the rest of this campaign,” he stressed.\nHe added that it would be important to watch how the two running mates defend “whatever’s going to be tossed at them, regarding a lot of the hearsay in the news on Mr. Trump, and a lot of the facts that we have on Secretary Clinton.”\nMcMarlin concluded by referring to the 2016 contest as “the strangest race I have ever seen in 30 years of doing this.”\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/radio/2016/10/04/doug-mcmarlin-watch-demeanor-candidates-vp-debate-likelihood-kaine-getting-agitated-high/"}
