{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-22 23:39:34","date_modify":"2018-10-22 23:39:34","date_publish":"2016-01-28 12:48:37","description":"The 31-year-old was seen showing off almost every inch of her lean, willowy curves in the photo, taken as she sat on her bed in the reflection of a mirror.","filename":"data/vaneerConsumption/DoutzenKroeslooksstunningassheshowsoffhershapelyderriere.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA390100000578-0-image-a-4_1453984994149.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420861_Lingerie-clad-Doutzen-Kroes-looks-stunning-shows-shapely-derriere-lengthy-legs-seductive-bedroom-selfie_1540251574.html","title":"Doutzen Kroes looks stunning as she shows off her shapely derriere","title_page":"Doutzen Kroes looks stunning as she shows off her shapely derriere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of the world's top models and travels the globe for work.\nBut in Doutzen Kroes' latest snap, taken in her latest hotel room, it wasn't the plush surroundings that caught the eye.\nThe lingerie-clad 31-year-old was seen showing off almost every inch of her lean, willowy curves in the photo, taken as she sat on her bed in the reflection of a mirror.\nScroll down for video\n'Hotel life': Doutzen Kroes ensured nobody was looking at her plush hotel room as she posed seductively in just her underwear in her latest selfie, posted on Thursday\nAlthough slightly obscured by the wooden edges of the panelled wardrobe door, her endless legs, slim waistline and shapely, pert derriere were still clearly visible.\nThe Dutch darling wore very little for her saucy selfie, teaming a pair of hip-skimming black briefs with a tiny crop top-style bralet, cut to just below her bust.\nShe sat on the edge of the bed with her bottom jutting outwards, drawing attention to her curved back and slim pins, as she added to the snap: '#hotellife.'\nThe former Victoria's Secret stunner appeared to be taking some time out to relax while on her latest work mission, although it's not known exactly where in the world she is at present.\nPeachy! Earlier in the week, the stunning Dutch model shared a gorgeous snap of herself in just briefs and a crop top\nBirthday vibes: On Saturday, Doutzen celebrated her 31st birthday with a rocking party\nJust a few days prior, Doutzen teased her nearly 4m Instagram followers again with another gorgeous snap, posted just after her birthday.\nWearing nothing but a cropped t-shirt and tiny peach panties, she revealed her envy-inducing slim stomach and shapely rear.\nOn Saturday, mother-of-two Doutzen celebrated her 31st birthday with a big night out, along with a group of gal pals and DJ husband Sunnery Gorré\nShe flashed her abs in a lumberjack shirt tied at the mid-riff and wore her hair back in a ponytail.\nDoutzen's modelling career may have began in earnest in 2001 when she moved to New York from the small village of Eastermar, aged 18, but the 5ft 9in had always had aspirations of being famous.\nNight out: Doutzen celebrated her big day surrounded by pals and husband, DJ Sunnery James\nSpeaking to the Wall Street Journal, she said: 'I wanted to become a teacher like my mother, or a charity worker. But my mom says that when I was younger I told her, “People are going to know me,” so I guess I always had that idea.\n'We didn’t have fashion magazines around the house, so I would see someone like Jennifer Lopez’s CD covers and think, “I would love to have hair or makeup like that.” I secretly sent my pictures to a modeling agency in Amsterdam, and they sent me to New York.'\nThe former Victoria's Secret model was the second highest paid model in the world in 2014 behind Gisele Bundchen, and has a long-running relationship with L'Oreal Paris, for whom she is a brand ambassador.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420861/Lingerie-clad-Doutzen-Kroes-looks-stunning-shows-shapely-derriere-lengthy-legs-seductive-bedroom-selfie.html"}
