{"authors":["Press Association Reporter"],"date_download":"2018-10-23 04:44:35","date_modify":"2018-10-23 04:44:35","date_publish":"2017-03-16 15:57:12","description":"Douvan is set to have a scan in a bid to discover why the 2-9 favourite was well beaten in the Betway Queen Mother Champion Chase at Cheltenham on Wednesday.","filename":"data/vaneerConsumption/DouvansetforscanafterCheltenhamdisappointment.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E4DE73500000578-0-image-a-16_1489679818327.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_racing_article-4320822_Cheltenham-flop-Douvan-set-scan-search-answers_1540269875.html","title":"Douvan set for scan after Cheltenham disappointment","title_page":"Douvan set for scan after Cheltenham disappointment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Douvan is set to have a scan in a bid to discover why the 2-9 favourite was well beaten in the Betway Queen Mother Champion Chase at Cheltenham on Wednesday.\nTrainer Willie Mullins and jockey Ruby Walsh were convinced something was wrong after the seven-year-old lost his unbeaten record without ever looking like winning.\n'He was quite lame this morning when I brought him out and he's on the way to get an MRI scan,' said Mullins.\nRuby Walsh riding Douvan after finishing down the field in the Queen Mother Champion Chase\n'We think it's something up in his hind quarters. It looked like his near hind leg. We think it's above the hock.\n'He was quite sore last night, but he's comfortable.\n'I imagine that's him finished for the season and we can look forward to next season with him.'\nWalsh knew quite early on that things were not going to plan.\nHe told ITV4's The Opening Show: 'I don't know how you can put it into words - shock, maybe - but it wasn't happening from a long way out.\n'He wasn't jumping with his usual fluency. He was erratic and he even put down on me at the fence past the stands.\n'When I faced into the back straight I was struggling to keep up with Special Tiara and from the top of the hill I was hoping for a miracle and it never came off.\nIt was a big shock for trainer Willie Mullins, who is now looking to establish the cause\n'When he guessed at the first, then gave the second so much air, I knew it wasn't the normal Douvan.\n'He's stiff and sore today, but he's standing up.\n'He's OK, and lives to fight another day. He'll definitely race again.'","url":"https://www.dailymail.co.uk/sport/racing/article-4320822/Cheltenham-flop-Douvan-set-scan-search-answers.html"}
