{"authors":[],"date_download":"2018-10-22 22:43:10","date_modify":"2018-10-22 22:43:10","date_publish":"2014-06-10 13:39:33","description":"he Dow hit a new high on Tuesday although stocks edged mostly lower, halting the S&P 500's record-smashing run on a lackluster day of trading.","filename":"data/vaneerConsumption/DowEndsatRecordHighbutSP500SlipsBackFromWinningRun.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_dow-ends-record-high-s-p-500-slips-back-winning-n127251_1540248190.html","title":"Dow Ends at Record High, but S&P 500 Slips Back From Winning Run","title_page":"Dow Ends at Record High, but S&P 500 Slips Back From Winning Run","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Dow hit a new high on Tuesday although stocks edged mostly lower, halting the S&P 500's record-smashing run on a lackluster day of trading.\nThe Dow Jones Industrial Average closed unofficially 2.8 points higher at 16,945.92, eclipsing Monday's record close. But the S&P 500, which also closed at a record on Monday, fell about half a point to 1,950.79 and the Nasdaq added just 1 point.\n\"It's a catalyst-light day, but we've been up 11 out of the last 13 days,\" said Art Hogan, chief market strategist at Wunderlich Securities.\n\"New records are spectacular, but more important is what multiple are stocks trading at,\" said Hogan, who pointed out that while the Dow has closed at a record high nine times in 2014, it's up a less-dramatic 2.1 percent for the year.\nThe Chicago Board Options Exchange Volatility Index, or VIX, rose 0.4 percent to 11.19, after last week's drop of nearly 6 percent to 10.73, its lowest in more than seven years.\nTuesday data had wholesale inventories up 1.1 percent in April after a 1.1 percent gain in March. Another report had the number of job openings at 4.0 million in April, versus 4.0 million reported the prior month.\nA third release had small businesses expressing more optimism about the U.S. economy in May, with the National Federation of Independent Business reporting its Optimism Index at its highest since September 2007.\nStill, the NFIB cautioned the reading remained well below those that usually come with economic expansion.\nTyson Foods shares slid 3.8 percent after the poultry producer drew a downgrade to underperform from neutral by Credit Suisse; Apple fluctuated after Irish state broadcaster RTE reported the European Commission would launch a formal probe into the iPhone maker's tax arrangements in Ireland.\nThe 10-year Treasury yield used in figuring mortgage rates and other consumer loans rose 3 basis points to 2.636 percent.\nThe U.S. dollar gained against other currencies, and dollar-denominated commodities were mixed; crude futures for July delivery turned lower, off 6 cents to $104.35 a barrel, and gold futures for August delivery up $6.20, or 0.5 percent, at $1,260.10 an ounce.\nTreasury prices declined along with stock futures, with the 10-year Treasury yield used in figuring mortgage rates and other consumer loans rising 2 basis points to 2.629 percent.","url":"https://www.nbcnews.com/business/markets/dow-ends-record-high-s-p-500-slips-back-winning-n127251"}
