{"authors":[],"date_download":"2018-10-30 01:13:28","date_modify":"2018-10-30 01:13:28","date_publish":"2015-05-21 00:00:00","description":null,"filename":"data/vaneerConsumption/DoWhiteRiotsMatterMorethanBlackRiotsMatter.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_05_do_whiteriotsmatter_more_than_blackriotsmatter_1540862008.html","title":"Do #WhiteRiotsMatter More than #BlackRiotsMatter?","title_page":"Do #WhiteRiotsMatter More than #BlackRiotsMatter?","title_rss":"NULL","source_domain":"americanthinker.com","text":"For Chicago, the May weekend weather was lovely. After a cold winter and cool early spring, Saturday and Sunday were cloudy, windy, and quite warm. So most residents took advantage of the fine day in walking, jogging, hanging out in the park and beaches, and sitting on their front porches. But others, whose usual activities do not depend on the weather, just took advantage of the lack of snow and bitter cold to bump up their usual behavior according to this shocking (well, to me) Chicago Tribune headline .\nChicago's violent weekend began Friday afternoon when, in the span of three hours, three people were shot in Englewood, another person was wounded in East Chatham and an 81-year-old woman and a relative were hit by gunfire as they sat on a porch in Gresham, taking a break from a wake. It ended early Monday morning in the South Shore neighborhood when a man was shot and seriously wounded just yards from where one man was killed and another wounded hours earlier. The gunfire scattered two dozen people who had gathered at the murder scene as police drew their weapons and scanned a vacant lot with their flashlights.\nIn most of these crimes the perps -- as the TV shows would say -- were black; the exception was in a Hispanic neighborhood. I am quite certain that in all of these incidents the victims and the shooters were of the same racial and/or ethnic background, thus depriving such local godly civil rights leaders/shakedown artists as Rev. Jesse Jackson Senior and Rev. Michael Pfleger plus national godly civil rights leader/shakedown artist Rev. Al Sharpton an opportunity for hogging the limelight by blaming the usual suspects for oppression and hopelessness and thus hauling in more guilt/extortion cash. But Pfleger tried, accusing the parents and their children for behaving irresponsibly and demanding better behavior. Ha!\nAfter a particularly bloody weekend in Chicago, Fr. Michael Pfleger pointed to Gov. Bruce Rauner's declared budget cuts as a future obstacle in stemming the violence. \"With all these state cuts taking place in this city, all the jobs that are not going to be there, the programs are not going to be there, I think it’s frightening what’s ahead of us right now in this city,\" Pfleger, the pastor at St. Sabina Church, told NBC Chicago. (snip) \"We’ve got to fight Springfield to say you’ve got to put some of this money back,\" Pfleger said. \"We can’t abandon our youth and wonder why spikes in violence are going on. They’re connected.\" Pfleger and Jackson are encouraging Chicagoans to take a stand for themselves and their communities and contact political and community leaders to rally for a change. This message oddly mirrored Emanuel's inauguration message to the people of Chicago when he told them to do their part, too.\nMore government money -- the all-encompassing solution. Never mind that it failed.\nThe phony, guilt-ridden white occupier enablers and their black followers spouting various # signs of whose lives matter, loudly notifying the world of when there will be peace and justice while inconveniencing citizens of all racial, religious, ethnic, gender, age, class, orientation, or demographic combinations thereof were conspicuously absent.\nBut Chicago is not alone enduring this. New York, which does have a lower crime rate than Chicago, (okay, not that reassuring) suffers similarly:\nBoy, 15, beaten and robbed of cellphone, shoes and even pants on Brooklyn subway in gang-related attack caught on video (WARNING: GRAPHIC CONTENT) Brooklyn community advocate Tony Herbert said the attack occurred when two gangs clashed. \"What is happening nowadays is a group of teens will walk up to another group of teens, whether\nthey be two or more, and ask what gang they reppin, then in a flash of a second the assault begins,” Herbert said. Friday’s subway pounding wasn’t the only mayhem to happen underground this month. Cops on Saturday released images of a marauding band of knife-wielding muggers who have targeted straphangers on the J train on three occasions since early May.\nBaltimore, Detroit, Atlanta, Philadelphia, Los Angeles... similar incidents.\nBut then there was the wild -- but not an everyday occurrence -- biker gang shootout in Waco, Texas which left nine white (so they say at the moment) bikers dead. The race-conscious grievance industry sprang into action.\nWould it have been different if the Waco bikers were black? After a shoot-out between rival biker gangs in Texas, civil rights activists are accusing police of double standards by comparing pictures of the scene with those of recent unrest in Baltimore and Ferguson.\nThe single mom and thug defenders contingent had its say.\nOutrage as social media users compare Waco, Texas to Baltimore and Ferguson uprisings No emergency is as black and white as when the National Guard gets deployed. That's why many social media users complaining after nine motorcycle gang members were killed during a shootout in Texas -- but no one deployed the troops like they did in Baltimore or Ferguson, Mo. “They’ve recovered at least 100 weapons,” Deray McKesson, a high-profile activist wrote on Twitter. “The (National) Guard would be mobilized now if, black.” With photos showing detained members of the criminal motorcycle gangs plugging away at their phones as police calmly stand guard, activists are quick to point out the disparity of the situation. (snip) In the aftermath of Sunday’s killings, there’s no sign of tear gas or baton-wielding riot cops tearing through the streets, like what happened after Michael Brown and Freddie Gray were slain at the hands of police officers. “When are we going to start asking how many of the (people) in the Waco slaughter grew up in single-parent homes? Oh, that’s right,” Blow wrote.\nTwitchy captured a sample of tweets ranging the spectrum.\nCall the white bikers thugs, call them murderers, call them dangerous -- call them all of these words because that's what they all are. Other questions: Do they have regular jobs when they aren't riding? What draws them to dangerous biking gangs as opposed to a group of guys -- and they were male -- that just enjoys the breeze in their hair? Did they too grow up in fatherless homes? Well, yes, good questions that need answers.\nHowever, racial grievance industry to the contrary, the Waco police did not act delicately toward the white bikers because they were white.\nPolice, who had been out in force, acted in seconds, Swanton said. He said 18 Waco police officers and four Texas Department of Public Safety officers responded to the shooting, some of them off-duty, but most in uniform because “we wanted our presence to be known.” “They could care less we were here,” Swanton said of the bikers. “As we turned up on scene,” the bikers, who had been shooting other bikers, turned on police who returned fire.\" Swanton said he didn’t know how many officers fired or whether they wounded any of the bikers. No bystanders or officers were hurt in the violence. “We have layers of protection,” he said, including officers stationed on nearby overpasses and on rooftops so that would-be attackers cannot fire from higher ground. In a statement released on Monday, Gov. Greg Abbott condemned the gang-related violence. “Texas will not stand for the type of lawlessness we witnessed in Waco yesterday. My office, along with law enforcement agencies at the local, state and federal levels, is committed to providing any and all resources needed to support the Waco Police Department and the local community. I want to express my heartfelt gratitude to the first responders who put themselves in harm's way to protect innocent lives,” the statement said. Police have been highly critical of the restaurant and its decision to allow the bikers to gather despite intelligence reports that the motorcycle gangs, including the Bandidos and Cossacks, represented a danger. The groups were apparently meeting to discuss turf and recruiting issues, Swanton said.\nAn undercover agent who infiltrated biker gangs described how they operate.\nWith two other undercover agents, Falco infiltrated a Mongols chapter in Virginia on the East Coast.\nInside the Mongols from 2004 to 2005, he found similarities with the Vagos, “but they were much, much more violent.” “The difference between the Mongols and all other biker gangs is they brought in outside Hispanic street gang members,” he said. “They were 18, 19, 20 years old and they were willing to go to prison, they expected to. (snip) “The RICO laws [crimes under the Racketeer Influenced and Corrupt Organizations Act] have reduced the amount of violence among these gangs. “Infiltrations by the ATF has destroyed their power, but it hasn’t destroyed their numbers.” Falco said the global spread of gangs, which includes the expansion of the Australian-based outlaw club the Rebels into the US and Europe, was ongoing. Outlaw gangs looked for new opportunities in all regions, including increasing numbers in Asia, for criminal activity, principally drug trafficking. “It doesn’t matter where they are in the world, they will have to continue with the war.”\nAs with the Bandidos, Cossacks, so with the Bloods, Crips, White Aryan Brotherhood, or any other group of lawbreakers.","url":"https://www.americanthinker.com/articles/2015/05/do_whiteriotsmatter_more_than_blackriotsmatter.html"}
