{"authors":["Caroline Pate"],"date_download":"2018-10-30 22:49:15","date_modify":"2018-10-30 22:49:15","date_publish":"2014-08-14 18:52:15","description":"After a difficult Season 4, Downton Abbey is finally on its way back. And with it, as always, is some new faces. We get to see both Lady Mary and Lady Sybil's children grown up a bit, and there's a few new characters in Downton Abbey Season 5:…","filename":"data/vaneerConsumption/DowntonAbbeySeason5PicsRevealBigCluesAbouttheGranthamsPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e8006724-8e7f-4ddd-a996-f151963bc230.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35817-downton-abbey-season-5-pics-reveal-big-clues-about-the-granthams-photos_1540939755.html","title":"'Downton Abbey' Season 5 Pics Reveal Big Clues About the Granthams - PHOTOS","title_page":"'Downton Abbey' Season 5 Pics Reveal Big Clues About the Granthams — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"After a difficult Season 4, Downton Abbey is finally on its way back. And with it, as always, is some new faces. We get to see both Lady Mary and Lady Sybil's children grown up a bit, and there's a few new characters in Downton Abbey Season 5: Richard Grant (you might recognize him as Jessa's weird father figure from Girls or from the Doctor Who episode \"The Snowmen\") will play an art collector and guest of the Granthams named Simon Becker and Anna Chancellor will be guest starring as Russian refugee Lady Anstruther. As always, we Yankees have to wait a little longer — the new season isn't set to premiere in the U.S. until Jan 5.\nBut until then, we have some official photos from the show to tide us over. And while the better part of them are pretty run-of-the-mill — we get some lovely in-character shots of Daisy, Thomas Barrow, Mr. Bates and Anna, and Carson and Mrs. Hughes — we also get a few peeks at some of the newer characters. Lady Grantham poses with new houseguest Simon Becker, a nurse takes care of the toddler George, and Tom Branson watches over an older Sybil.\nBut the biggest mysteries aren't about who does show up in the pictures, but who doesn't. With all these children, where is Lady Edith's out-of-wedlock shame baby? And speaking of which, where's her lover Michael Gregson? And Lord Gillingham is happily posing with Branson, Mary and some guns, but where is his rival Charles Blake? Let's search these photos for some answers:\nBranson and Sybil\nWell, if you haven't already gathered, Sybil and George's new toddler actors mean that the show is in for a significant time jump. So how will Branson and his growing daughter fit into the Grantham household now?\nMaster George and His Nurse\nAnd of course, it should be interesting to see the newest of the master of the house growing up. Wonder what he'll think of his mother's love triangle...\nBranson, Lord Gillingham, and Lady Mary\nSpeaking of which, where's the third leg of this said love triangle? Charles Blake seemed like a shoe-in last season, but Lord Gillingham is standing awfully close to Lady Mary. Sure, she may look a little stony and wary, but she sort of always looks that way.\nLady Grantham and Simon Becker\nOkay, who is this Simon Becker guy? Lady Grantham has a pretty sly look on her face, like she is not putting up with any of this dude's bullshit. The Dowager Countess will not be having this...\nPhotos: PBS","url":"https://www.bustle.com/articles/35817-downton-abbey-season-5-pics-reveal-big-clues-about-the-granthams-photos"}
