{"authors":["Sharnaz Shahid","Baz Bamigboye For The Daily Mail"],"date_download":"2018-10-22 21:53:06","date_modify":"2018-10-22 21:53:06","date_publish":"2016-01-11 01:49:24","description":"The stars looked sensational at the 73rd Annual Golden Globe Awards, held at the Beverly Hilton Hotel in Los Angeles on Sunday.","filename":"data/vaneerConsumption/DowntonAbbeysJoanneFroggattandLilyJamesattheGoldenGlobes2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001DCF300000578-0-image-a-204_1452476836171.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393217_Downton-Abbey-star-Joanne-Froggatt-preened-perfection-plunging-strapless-gown-star-Lily-James-ethereal-white-chiffon-number-Golden-Globes_1540245186.html","title":"Downton Abbey’s Joanne Froggatt and Lily James at the Golden Globes 2016","title_page":"Downton Abbey’s Joanne Froggatt and Lily James at the Golden Globes 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She propelled to stardom after playing the endearing Lady’s maid Anna Bates in hit period drama Downton Abbey.\nAnd on Sunday evening, Joanne Froggatt looked absolutely sensational as she floated across the red carpet alongside co-star Lily James at the 73rd Annual Golden Globe Awards, held at the Beverly Hilton Hotel in Los Angeles\nThe British beauty, who is nominated for Best Performance by an Actress in a Limited Series or Motion Picture Made for Television, turned heads in a daring periwinkle blue Reem Acra dress.\nScroll down for video\nBritish sweethearts: Joanne Froggatt (left) looked sensational at theGolden Globe Awards, held at the Beverly Hilton Hotel in Los Angeles on Sunday while Downton co-star Lily James cut an ethereal figure (right)\nThe plunging strapless gown, which featured a heart-shaped bodice and a cinched waist, was teamed with a pair of striking Chopard pink diamond earrings, worth a staggering $1million.\nWith her honey coloured tresses swept into a centre parting, her pretty facial features were enhanced with subtle tones of makeup.\nThe blonde beauty, 35, has been nominated for the prestigious award for role as Anna Bates in the ITV drama - she picked up the gong last year for her work in the same role.\nSee the latest Golden Globes updates on all the winners and red carpet fashion\nWinning look: Joanne, who is nominated for Best Performance by an Actress in a Limited Series or Motion Picture Made for Television, turned heads in a daring periwinkle blue Reem Acra dress\nSpeaking exclusively to The Daily Mail ahead of the event, Joanne admitted that she had now moved to America with her husband, James Cannon, to pursue opportunities in Hollywood.\n‘We’ve taken the plunge and done it. Last Tuesday we rented out our house for six months, boarded a flight to Los Angeles and here we are,’ she said. ‘We’re actually homeless. We’re living in a hotel until we can find ourselves somewhere to rent out here. We have some feelers out and we’re assembling a list of places to view.\n‘I have no jobs lined up in Hollywood but there are so many opportunities to be had. We’re going to have a little bit of a break first and then plunge right in and see what’s out there. I won’t be here forever. My home is in England. I just want to see what happens.’\nElsewhere, Lily – who is best known for her role as Lady Rose in the beloved show – oozed heaps of elegance in her angelic white gown.\nGlitz and glamour: The plunging strapless gown, which featured a heart-shaped bodice and a clinched waist, was teamed with a pair of striking Chopard pink diamond earrings, worth a staggering $1 million\nTipped for more success? The blonde beauty, 35, has been nominated for the prestigious award for role as Anna Bates in the ITV drama - she picked up the gong last year for her work in the same role\nTipped for more success? The blonde beauty, 35, has been nominated for the prestigious award for role as Anna Bates in the ITV drama - she picked up the gong last year for her work in the same role\nA world of difference: Joanne Froggatt as Anna in Downton Abbey\nWith her golden-tinted tresses left in tousled waves, the 26-year-old looked nothing short of glamorous in her style choice.\nThe talented star appeared to be in fantastic spirits as bumped into award-winning actress Cate Blanchett on the arrivals carpet.\nMeanwhile, the awards are an accolade bestowed by 93 member of the Hollywood Foreign Press Association for film and television, both in foreign and domestic markets.\nIt has been held at the Beverly Hilton Hotel since 1961, and will be broadcast live on NBC this coming year from the same location on January 10, 2016.\nThe Golden Globes often rank as the third most watched awards show each year, just behind the Oscars and the Grammys.\nElegant as ever: Elsewhere, Lily – who is best known for her role as Lady Rose in the beloved show – oozed heaps of elegance in her angelic white gown\nStar pals: The 26-year-old star appeared to be in fantastic spirits as bumped into award-winning actress Cate Blanchett on the arrivals carpet\nAs she's better known: Downton Abbey with Lily James as Lady Rose MacClare\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393217/Downton-Abbey-star-Joanne-Froggatt-preened-perfection-plunging-strapless-gown-star-Lily-James-ethereal-white-chiffon-number-Golden-Globes.html"}
