{"authors":["Victoria Friedman"],"date_download":"2018-10-30 20:03:09","date_modify":"2018-10-30 20:03:09","date_publish":"2018-09-14 12:07:05","description":"Downing Street told Conservative Party MEPs to distance themselves from Prime Minister Viktor Orbán, leaked WhatsApp messages reveal.","filename":"data/vaneerConsumption/DowningStOrdersToriestoDistanceThemselvesfromOrban.json","image_url":"https://media.breitbart.com/media/2018/09/Orban-May.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_09_14__1540929789.html","title":"Downing St Orders Tories to Distance Themselves from Orban","title_page":"Downing St Orders Tories to Distance Themselves from Orban","title_rss":"NULL","source_domain":"breitbart.com","text":"Downing Street told European Parliament Conservative Party MEPs to distance themselves from Prime Minister Viktor Orbán after they had voted unanimously against imposing sanctions on Hungary, leaked WhatsApp messages obtained by BuzzFeed reveal.\nNumber 10 made the intervention after Tory Members of European Parliament voted against triggering Article 7, which could result in sanctions or the loss of voting rights, against Hungary on Wednesday morning.\nThe leaked messages, of which screenshots were seen and published by BuzzFeed, shows the Tories’ European Parliament Chief Whip Ashley Fox MEP telling fellow party MEPs to distance themselves from the pro-sovereignty, anti-mass migration conservative Prime Minister of Hungary by retweeting a social media post that denies the vote was “an endorsement of Viktor Orban”.\n“Downing Steet has asked Dan D to tweet that our vote on Art 7 does not imply support for Orban,” Fox messaged the group.\n“Can I ask all members to retweet DD without further comment.”\nOur vote against #Article7 on #Hungary was not an endorsement of Viktor Orban. Accusations were in areas not covered by EU law, where Hungary is sovereign. #Article7 is a legal matter, by making it political, the EP has strengthened him domestically. — Daniel Dalton (@ddalton40) September 13, 2018\nDan Dalton MEP then messaged to the group: “This is the tweet I have posted. Dan.”\nOf note, the tweet says that the EP vote has “strengthened [Orbán] domestically” — implying that increased Hungarian support for a Prime Minister that puts ‘Hungary First’ and fights off attacks from the globalist bloc is not the desired result.\nA Tory source familiar with the situation told the news website that “MEPs who might privately support Orbán have been ordered not to comment”.\nA Government source said: “This was simply a suggestion to help clarify the reason for this particular vote.”\nThis move follows the Conservative Party whipping its MEPs to oppose enacting Article 7 on Hungary ahead of the vote.\nThe notionally ‘conservative’ Tory Party, whose MEPs are members of the European Conservatives and Reformists (ECR) in the Parliament, is reportedly the only conservative group of lawmakers in Western Europe to vote against Article 7.\nHowever, Dalton said in advance of the vote that party opposition was down to efforts to stop the “politicising” of “what should be a purely legal matter”, saying it should be the responsibility of the unelected “European Commission to build a legal case against” Hungary — not the Parliament’s elected MEPs.\nPoland to Veto EU Sanctions ‘in Solidarity with Hungarian People’ https://t.co/hvNiCvzldx — Breitbart London (@BreitbartLondon) September 13, 2018\nThe vote also revealed a rift in the European People’s Party (EPP) — a centre-right group which includes Mr Orbán’s Fidesz party, Austrian Chancellor Sebastian Kurz’s Austrian People’s Party, and German Chancellor Angela Merkel’s Christian Democratic Union, amongst others — resulting in Orbán effectively being abandoned by some presumed allies, notably the Austrian Chancellor.\nKurz, who previously supported Hungary and Poland on rejecting the European Union’s forced migrant relocation scheme, turned on Orbán ahead of the vote, saying his party would support triggering Article 7, stating Monday: “There are no compromises on the rule of law. The core values need to be protected.”\nOrbán has defied the EU on mass migration and defended Hungary’s right as a sovereign nation to make internal reforms, resulting in MEPs voting 448-197 to begin sanctions procedures against the country for failing to uphold “EU values”.\nHungary’s foreign minister Péter Szijjártó denounced the vote Wednesday as the “petty revenge of pro-migration politicians”.\n@FriedmanPress Follow Victoria Friedman on Twitter at","url":"https://www.breitbart.com/europe/2018/09/14/downing-street-orders-tories-distance-themselves-conservative-hungarian-leader/"}
