{"authors":["Alanna Bennett"],"date_download":"2018-10-30 22:36:07","date_modify":"2018-10-30 22:36:07","date_publish":"2014-08-14 22:17:44","description":"One of the roughest things about putting together a period production must be the constant threat of anachronisms sneaking in. Even the best productions fall prey to it: Mad Men's had plenty of moments that could never have happened in the years the…","filename":"data/vaneerConsumption/DowntonAbbeySeason5PromotionalPhotosGotAnachronisticWithThisMajorMistakePHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/df146e27-de6e-4fe7-ba21-1d637c5aca24.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35856-downton-abbey-season-5-promotional-photos-got-anachronistic-with-this-major-mistake-photos_1540938967.html","title":"'Downton Abbey' Season 5 Promotional Photos Got Anachronistic With This Major Mistake - PHOTOS","title_page":"'Downton Abbey' Season 5 Promotional Photos Got Anachronistic With This Major Mistake — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"One of the roughest things about putting together a period production must be the constant threat of anachronisms sneaking in. Even the best productions fall prey to it: Mad Men's had plenty of moments that could never have happened in the years the show takes place in. The most recent victim, though, is Downton Abbey : They let a little piece of the modern world stick around in the back of their most recent promo shoot.\nConsidering how much press I'm seeing this blunder get already, there's a small part of my brain that's suspecting this to be a clever ploy by Downton's PR team. Viral content's a favorite PR strategy, after all, and getting this to spread like wildfire across facebook and twitter feeds could be just what the show needs to jump-start viewers who might have dropped out of the show over the seasons to remember that the Crawleys exist. Maybe it'll even get them some new viewers.\nIt could also, of course, just be a simple blunder. Regardless, water bottles — such as that over poor Lady Edith's shoulder — weren't exactly part of the mise-en-scene of life in the 1920s. Sure, the Crawleys are a high-class people; they could probably have afforded to receive their water in all sorts of high-falutin' forms. Alas, the bottled water industry didn't really start to boom until about sixty years after this. Maybe by then the world will have stopped being awful to Edith?\nYou can see even more Downton anachronisms at the official Downton PBS page. But those ones seem to be on purpose.\nImages: PBS","url":"https://www.bustle.com/articles/35856-downton-abbey-season-5-promotional-photos-got-anachronistic-with-this-major-mistake-photos"}
