{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:24:32","date_modify":"2018-10-30 22:24:32","date_publish":"2014-08-15 19:03:48","description":"If you're not aware of it yet, allow me to introduce you to the magic of Downton Abbey 's newest promotional photo. In what was either a genius move or a total airheaded mistake, a very modern plastic bottle was left on the mantle of a very old…","filename":"data/vaneerConsumption/DowntonAbbeySeason5PromotionalPhotoMistakeTurnedIntoaHilariousMemePHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9dedf37f-6f30-4530-a307-a98672e49559.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35978-downton-abbey-season-5-promotional-photo-mistake-turned-into-a-hilarious-meme-photos_1540938272.html","title":"'Downton Abbey' Season 5 Promotional Photo Mistake Turned Into a Hilarious Meme - PHOTOS","title_page":"'Downton Abbey' Season 5 Promotional Photo Mistake Turned Into a Hilarious Meme — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"If you're not aware of it yet, allow me to introduce you to the magic of Downton Abbey 's newest promotional photo. In what was either a genius move or a total airheaded mistake, a very modern plastic bottle was left on the mantle of a very old fireplace that's supposed to be set in the 1920s. Now, I will admit to not being the biggest history buff, but even I know that plastic bottles weren't around back then. It's unclear whether or not ITV put it there on purpose in hopes that the Interwebz would catch wind of it and turn it into the meme that it's become (thus gaining a ton of free advertising) or if it was really just a mistake, but, either way, it's amazing. And, of course, the Interwebz did what it does best, and made it into something even more amazing.\nApparently, if you go on Twitter right now and search \"Downton Abbey,\" you'll be inundated with images pointing out the gaffe...and some that have a little something extra added to make fun of the mistake. Personally, I think Downton Abbey should embrace the error next season and just give everyone iPhones (or cast Batman!), but that's just me. Check out the best edits below:\nImages: ITV; Twitter","url":"https://www.bustle.com/articles/35978-downton-abbey-season-5-promotional-photo-mistake-turned-into-a-hilarious-meme-photos"}
