{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 22:11:41","date_modify":"2018-10-22 22:11:41","date_publish":"2016-01-29 09:06:23","description":"Despite the gulf in social class on screen, Downton Abbey stars Laura Carmichael, 30, and Michael Fox have struck up a romance off of it.","filename":"data/vaneerConsumption/DowntonAbbeysLauraCarmichaelandMichaelFoxenjoyingblossomingromance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0D39800000578-0-image-a-9_1454058854517.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422318_There-chemistry-Downton-Abbey-s-Laura-Carmichael-Michael-Fox-enjoy-blossoming-romance_1540246301.html","title":"Downton Abbey's Laura Carmichael and Michael Fox 'enjoying blossoming romance'","title_page":"Downton Abbey's Laura Carmichael and Michael Fox 'enjoying blossoming romance' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Laura Carmichael is said to have found love with her Downton Abbey co-star Michael Fox.\nIn the ITV1 period drama, the actress, 30, portrays aristocratic Lady Edith Crawley, while the actor, 26, plays her lowly illiterate servant Andy Parker - but despite the gulf in class on screen, the couple have reportedly struck up a romance in real-life.\nA source told The Sun that Laura and Michael really hit it off during filming last year, and their relationship has now moved beyond friendship.\nScroll down for video\nLucky in love: Despite the gulf in social class on screen, Downton Abbey stars Laura Carmichael, 30, and Michael Fox, 26, have struck up a romance off of it\nThe insider said: 'They started off as mates but quickly realised there was chemistry there and decided to start dating.\n'It’s very early days still but they are really enjoying each other’s company. The best part is that since the show ended they have had a lot more time to spend with each other.'\n'Before that, most of their time together was at work.'\nBlossoming romance: The pair reportedly hit it off during filming last year with their relationship having now moved beyond friendship\nCarmichael was a stalwart of the award-winning period drama having starred as Lady Edith Crawley from the very first episode.\nMeanwhile, Michael joined the cast for the penultimate series where he played the Crawley family's servant.\nDownton came to an end after six wildly successful series in last month.\nAnd Lady Edith, after suffering more than her fair share of heartbreak throughout the duration of the show, finally found herself lucky in love.\nAll good things... Downton came to an end after six wildy successful series in December last year\nHappy ending: In the show's finale, Lady Edith tied the knot to fabulously wealthy Bertie, much to the delight of her parents\nHer chequered love life has seen her jilted at the alter by Sir Anthony Strallon, give birth out of wedlock after boyfriend Michael Gregson went missing - presumed dead - in Germany, and be ditched by fiancé, the newly minted marquess Bertie Pelham after sister Mary maliciously let slip that Marigold was Edith's illegitimate daughter at the dinning table.\nBut in the show's final episode she oozed 20s glamour as she tied the knot with the fabulously wealthy Bertie, much to the delight of her parents.\nAnd she finally came clean to her mother-in-law about her illegitimate child Marigold. Mrs Pelham (Patricia Hodge) took the news better than expected and Lady Edith was finally able to move on happily with the rest of her life.\nLate to the party: Michael joined the cast for the penultimate series where he played Lady Edith's servant\nIn a recent The Telegaraph's Stella Magazine, Laura, who attended Bristol Old Vic theatre school, revealed how the opportunity to star in Downton came about.\nShe said: 'When I left, I didn't even have an agent. There were a couple of really tough years, on several fronts, when I did tempting jobs and wondered when the phone call would come.\n'But the (Downton) casting director had seen me in a drama school production and I was asked to audition; all the girls in the waiting room were entirely unlike each other, because we were deliberately chosen on account of our \"otherness\".'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422318/There-chemistry-Downton-Abbey-s-Laura-Carmichael-Michael-Fox-enjoy-blossoming-romance.html"}
