{"authors":[],"date_download":"2018-10-30 19:08:59","date_modify":"2018-10-30 19:08:59","date_publish":"2018-09-10 18:59:00","description":"Hurricane Florence: Download these apps for finding gas, hotels, help","filename":"data/vaneerConsumption/Downloadtheseappsforfindinggashotelshelp.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/25/Videos/4446726.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_hurricane-flo_a2604ab6dbf5ca9cdccfd01f5357ea2d__1540926539.html","title":"Download these apps for finding gas, hotels, help","title_page":"Hurricane Florence: Download these apps for finding gas, hotels, help","title_rss":"NULL","source_domain":"ajc.com","text":"Hurricane Florence intensified into a Category 4 around midday on Monday and continues to strengthen on a path to the East Coast of the United States.\n>>Tracking Hurricane Florence: Live updates from the Carolinas\nOn Monday, the National Hurricane Center is warning that Florence is likely to strengthen to 150 mph just before landfall later this week.\n>>What is the Saffir-Simpson scale, how does it work; is there a Category 6?\nAuthorities are telling residents of the areas likely to be affected that they should begin making preparations for either staying or plans for leaving as Florence approaches.\nHere are some website links and apps to help with finding shelter, getting gas and keeping in touch with family and friends.\nEvacuation routes\nNorth Carolina: Here is a link to evacuation routes in North Carolina. The map shows the routes – both state and national highways – from coastal areas to Interstate 95. Interstate 95 is in the center of the state and runs north and south.\nInterstate 40 runs from the coastal area of North Carolina near Wilmington across the state where it intersects with I-95.\nVirginia: Hurricane evacuation routes are shown on page 9 of this PDF. It includes routes for those who live on the Peninsula, those who live south of I-264 and those who live on the Eastern Shore.\nIf you are looking for information needed when evacuating before a storm, here is a list of apps and websites that may help.\nGeorgia: Here is the link to maps for hurricane evacuation in Georgia.\nLinks to state and county emergency management agencies\nEmergency management agencies can provide updated information on watches and warnings along with locations of shelters and other help. Here are the links for Georgia, North Carolina, South Carolina and Virginia.\nGeorgia: Click here for the Georgia Emergency Management Department.\nNorth Carolina: Click here for the North Carolina Department of Public Safety. Click here for each North Carolina county’s emergency management agency website. Many of the county EMA sites have links to shelters.\nSouth Carolina: Click here for the South Carolina Emergency Management Department.\nVirginia: Click here for the Virginia Emergency Management Department.\nAnother way to find shelter\nAnother way to find shelters once they have opened is to text the word “SHELTER” and a zip code to 4FEMA (43362).\nFor example, for the Wilmington, N.C. area you would text to 43362: SHELTER 28401 (Wilmington’s zip code).\nHotels that accept pets\nIf you are evacuating with your pet, click here to find hotels that allow pets.\nHere are some helpful links and apps that you should download in advance of the storm.\nAirports\nTo check on the status of airports, click here.\nGas\nFor gas availability, click here at GasBuddy.\nWi-Fi\nFor a map of Xfinity Wi-Fi hotspots, which are located both indoors and outdoors in places such as shopping districts, parks and businesses, click here at Xfinity.\nTraffic\nFor traffic slowdowns or wrecks, road closures and other real-time traffic issues, go to Waze.\nHotel information\nTo find a hotel room, see expedia.com.\nMore on weather\nFor live weather coverage in the Carolinas, get the WSOC weather app.\nIf you need more information about weather, public alerts, shelters, forecasts and more, go to Google.org’s crisis maps.\nIf you need a money transfer or storm tracking apps, try the \"Stay Safe After the Hurricane” collection.\n>>How to use the internet during a storm when your internet is down\nMiscellaneous\nOther hurricane apps are available from a collection at the Google Play store.\nZello: This app became popular during Hurricane Irma last year. Zello can convert your phone into a sort of walkie-talkie or two-way radio. You must have a WiFi connection to use it. You can instantly send voice messages or photos.\nRed Cross Apps: There are several apps hosted by the Red Cross including first aid apps for humans and pets. A Red Cross app also downloads information to your phone so you can access it even when cellphone towers are down.\nFacebook Safety Check: You can mark yourself safe on this Facebook app to let family and friends know you are OK. You can also check on your family and friends.\nICE Standard: The ICE Medical App lets you put your emergency medical contact Information on a smartphone.\nNextdoor: Nextdoor connects you with people in your neighborhood.\nLife360: If you are evacuating, this app can let family and friends know where you are. Life360 will track your movements and automatically send texts to those you chose to share that information with.","url":"https://www.ajc.com/news/national/hurricane-florence-download-these-apps-for-finding-gas-hotel-rooms-help/WSzhqaqUuQa9jiNiCXUlgO/"}
