{"authors":[],"date_download":"2018-10-22 20:43:12","date_modify":"2018-10-22 20:43:12","date_publish":"2014-06-02 13:43:31","description":"Stocks closed narrowly mixed on the first trading day of June, but the Dow and S&P 500 squeezed out gains to finish at fresh highs.","filename":"data/vaneerConsumption/DowSP500CloseatNewHighs.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/481211/140602-stocks_0939_ffe41f6d97765865d279a6313cf0a609.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_dow-s-p-500-close-new-highs-n120206_1540240992.html","title":"Dow, S&P 500 Close at New Highs","title_page":"Dow, S&P 500 Close at New Highs","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nStocks closed narrowly mixed Monday on the first trading day of June, but the Dow and S&P 500 squeezed out gains to finish at fresh highs.\nIn an unusual move, the Institute for Supply Management corrected its May manufacturing data for a second time to 55.4. The index was first corrected to 56 after being initially reported as 53.2 at 10 a.m. ET. Analysts polled by Reuters expected a reading of 55.5.\nStocks came off the lows of the day after word of the initial adjustment began to circulate. The market was still higher after the second revision.\n\"Bottom line, we've seen a nice spring rebound but it still looks like we are just getting back to the pre-winter trend rather than being on the cusp of a new acceleration in growth,\" according to Peter Boockvar, chief market analyst at The Lindsey Group.\nThe Dow Jones Industrial Average closed in positive territory in volatile trading, ending unofficially at 16,743.70. The blue-chip index hit an intraday high of 16,756.64 and traded in a narrow 75-point range throughout the session. Caterpillar and United Tech led the gainers.\nThe S&P 500 finished higher, setting a fresh record at 1,924.97. Meanwhile, the Nasdaq closed in the red unofficially, at 4,237.20. The CBOE Volatility Index (VIX), widely considered the best gauge of fear in the market, rose above 11.\nAmong key S&P sectors, industrials led the gainers, while energy lagged.\nAmong other economic reports, construction spending ticked up in April to its best level in nearly five years, but still missed estimates.\nOther economic data this week include reports on factory orders and car sales, as well as the widely watched May jobs report on Friday.","url":"https://www.nbcnews.com/business/markets/dow-s-p-500-close-new-highs-n120206"}
