{"authors":["Esra Gurkan For Mailonline"],"date_download":"2018-10-22 23:48:19","date_modify":"2018-10-22 23:48:19","date_publish":"2017-03-16 07:50:10","description":"Are you wondering where the watchman is? You're not the only one. The watchman has gone wandering and appears to have left his post unguarded and people are beginning to gather.","filename":"data/vaneerConsumption/DoYOUknowwherethewatchmanis.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/15/3E5ED20E00000578-0-image-a-44_1489766335314.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4313200_Can-spot-nine-faces-painting_1540252099.html","title":"Do YOU know where the watchman is?","title_page":"Do YOU know where the watchman is? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"First it was Where's Wally? style challenges where finding a hidden panda was the aim of the game.\nNow vintage illustration puzzles are having a moment, and the latest features a watchman who appears to have left his post unguarded.\nThe clever optical illusion picture, posted by Playbuzz, challenges you to try and find out where on earth he went, but it's no easy task.\nScroll down for reveal\nLook closely at this vintage optical illusion and see whether you can spot the wandering watchman\nWhether he's strategically chosen a different spot to keep watch from a more secretive location, or he's wandered off, finding him is no easy task.\nIf you're struggling - a clue is that he hasn't actually gone very far at all.\nFor those who can't find him, the reveal is in the picture below, showing that the watchman is hiding right behind his sentry box, in front of a tree.\nThe puzzle is just the latest in a long line of optical illusion challenged to baffle the web.\nDid you manage to spot him? It turns out he's hidden between the back of his post and a nearby tree\nAt first glance, it looks like a painting of an old man in profile - but his isn't the only face in this picture.\nIn fact, there are nine different faces hidden within the illustration, and it's your job to spot them all.\nThe picture, posted by the gaming site Playbuzz, has left viewers scratching their heads, as some of the hidden characters are much harder to spot than others.\nCan you spot all of the nine faces? This tricky illustration posted online by Playbuzz is actually harder than it looks - and it's left internet users baffed\nIf you need a bit of help with finding them all, scroll down to see the reveal. But be warned: you might kick yourself for not having found them all yourself.\nOne particularly sneaky face can be found lurking towards the right of the painting, but none are on the floor near to the sleeping dog - a red herring which makes it even tougher to spot all nine.\nHow many did you see?\nThe big reveal: All nine faces have been circled and it must appear obvious now but how did you do?\nThis latest optical illusion comes after a peaceful painting of a sunny seaside scene featuring four hidden animals went viral.\nThe puzzle, also from Playbuzz, challenges you to try and find the fox, bat, antelope and flamingo concealed in the picture - and the makers say that only the overly analytical will be able to.\nPlaybuzz claims that only the 'overly analytical' can manage to find all four animals in the picture\nIf you are having trouble spotting the four animals then look closely at the rocks.\nThree of them are hidden on the right hand side, whereas the flamingo, which people thought was the trickiest to find, can be spotted in the bottom left corner.\nOther users took to Playbuzz to claim that there are in fact five animals and that there is a dog somewhere in the picture.\nHow many did you manage to find?\nDid you manage to spot the fox, bat, antelope and flamingo soaking up the sunshine at the seaside?\nCounting sheep is supposedly an ideal way to fall asleep, but this field of woolly creatures is bound to do the exact opposite.\nA new Where's Wally? style puzzle challenges you to find the one sheep in the flock that's drifted off for a snooze.\nAnd the puzzle created by Drift Sleep has an added challenge as there's a sheep dog watching over them for you to spot also.\nCan you spot the sheep that's fallen asleep? As an added challenge, there's also a dog watching over the flock waiting for you to find\nWhile graphic brainteasers have proven popular online, it seems web users can't get enough of vintage puzzles either.\nThe latest to wind-up the web is a retro advert that tasks players with spotting two babies hidden in the scene.\nIn the poster for Dr Seth Arnold's Balsam, a group of girls appear distressed as they try to find the lost infants.\nThe sleeping sheep can be found to the left of centre, while the dog is nearby poking his head out from behind a tree\nAn old fashioned puzzle doing the rounds online is asking users to spot the two missing babies in this vintage advertisement\nThe puzzle, shared by Playbuzz, proves exceptionally difficult as it is entirely black and white, making it even tougher to spot anything amiss in the scene.\nHowever, those with a keen eye should be able to spot one of the children to the dog's right and another hidden in the apron of the weeping girl.\nDid you spot them without cheating?\nThose with a keen eye should be able to spot one of the children to the dog's right and another hidden in the apron of the weeping woman\nIn another recent retro challenge shared by Playbuzz, players are tasked with seeking out a policeman in an old-fashioned advert.\nIn the illustration, three young boys can be seen trying to take a short cut through a neighbour's back garden - but little do they know there is a policeman close by, and he's watching their every move.\nAt a glance you would be forgiven for struggling to spot the officer in the drawing as his outline blends so well with the background.\nBut if you flip the image upside down his face can be spotted in reverse in the branches of the tree.\nA policeman lurks in the background of this old-fashioned advert - but can you spot him?\nIt might help for you to flip the image upside down as his face can be spotted in reverse in the branches of the tree\nAccording to Playbuzz, only true workaholics will be able to spot what's amiss on the old-fashioned desk below.\nIt might not bear much resemblance to your own desk, with its retro telephone and pen stand in place of a computer, but can you spot the one thing that's wrong with this picture?\nLook at this desk and see if you can spot what is wrong with it (apart from its old fashioned telephone)\nThe desk is filled with paperwork, books and a calendar. Take a second look at that calendar and see if you can spot something amiss.\nThe date is, in fact, wrong, as June 31 does not exist - there are only 30 days in June.\nIf you managed to spot it before the reveal then you are a true workaholic and are working way too much overtime, according to the puzzle's makers.\nDid you see it? The answer is the calendar: there is no June 31. The last day of the month is June 30\nAnother vintage puzzle to resurface this week asks the internet to seek out the missing kitten in the illustration.\nOriginally an advert for Dr. Seth Arnold's Balsam used to 'Cure Bowel Complaints' the tricky puzzle had been shared by Playbuzz leaving the web scratching its head.\nA vintage brainteaser has resurfaced this week challenging the web to spot the second cat in this advert for Dr. Seth Arnold's Balsam\nIn the drawing two women sit at a table and while one of their cats is in plane view the other appears to have disappeared.\nHowever, those with excellent vision should be able to spot the pesky pet hiding in the bonnet of the woman on the left.\nThis isn't the first retro puzzle to re-emerge with a mind-boggling brainteaser infuriating the web over the weekend.\nThose with a keen eye should be able to spot the pesky pet hiding in the bonnet of the woman on the left\nThe illustration, shared by Playbuzz, asked men and women to spot the soldier's four missing friends.\n'Can you spot where they be hidden?,' it asks. 'Solving this riddle will drive you insane! We are not kidding!'.\nThe website claims that only one per cent of the population can see the concealed soldiers, so can you see all four?\nCan you find the four hidden men in this image? Only 1 per cent of the population can locate all of the missing soldiers in a puzzle the makers say will 'drive you insane'\nThe site claims that its optical illusion will quite literally have you standing on your head to solve it - if you don't go mad trying.\nYou will need to flip your head to see all four soldiers - one of whom is on the man's sleeve, one is on a top rock, another is on the bottom rock and the final one is hiding in the tree.\nDid you see them all? Tilt your head upside down to reveal where the hidden soldiers are hiding; it's a lot harder than you think\nOne is on the man's sleeve, one is on a top rock, another is on the bottom rock and the final one is hiding in the tree\nThe latest optical illusion comes after a similar one swept the web last week. It showed five young soldiers playing hide and seek in this puzzle, but one of them was better than his friends at disappearing from view.\nIt challenged you to try and find where the fifth member of the group is lurking in the vintage illustration.\nThe website claims that 95 per cent of people can't find him - are you among the five per cent who can?\nThere are five boy soldiers in this classic illustration but one of them appears to have gone missing\nIf you can't manage to spot him then you aren't alone, but you might find flipping the image upside down makes things a little easier.\nEven then, 49 per cent said that they weren't able to find him, and had to look at the reveal for it to all become clear.\nWhen looking at the picture upside down, the boy is in fact right above the other soldiers and can be spotted nestling in between the trees.\nNow that the picture has been flipped, his hiding place has been revealed to be above them\nIt's one of a stream of similar optical illusions that have had people scratching their heads in recent weeks.\nIt might look as though there are only three boys in the photo below, but there are in fact seven - and the hidden friends are all enjoying a crafty cigarette.\nAnother hidden image puzzle, posted by Playbuzz, has managed to frustrate a lot of people.\nA poll of puzzle fans confirmed that 70 per cent of people had to give up and look at the reveal in order to find the hidden figures.\nThere are four bad boys smoking in this picture but can you spot them?\nIf you're struggling to find the extra characters in the vintage illustration, you might want to try flipping it upside down.\nThis will make the smokers more obvious and might just enable you to find them.\nBut don't be worried if you're still left battled as they are especially tricky to spot.","url":"https://www.dailymail.co.uk/femail/article-4313200/Can-spot-nine-faces-painting.html"}
