{"authors":["Amal El-Mohtar"],"date_download":"2018-10-23 01:20:03","date_modify":"2018-10-23 01:20:03","date_publish":"2014-07-29 00:00:00","description":"Graphic novelist Emily Carroll's gorgeous new collection of horror stories entwines words and pictures to deliver delicious, twisted-fairy-tale chills. Strange things come and go in these woods.","filename":"data/vaneerConsumption/DoYouDareToVentureThroughTheseTangledWoods.json","image_url":"https://media.npr.org/assets/img/2014/07/22/throughthewoods_wide-9126bc32d3a7ea2b2bc2400ef558d2663b86cc1f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_07_29_334077605_do-you-dare-to-venture-through-these-tangled-woods_1540257603.html","title":"Do You Dare To Venture Through These Tangled 'Woods'?","title_page":"Do You Dare To Venture Through These Tangled 'Woods'? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Do You Dare To Venture Through These Tangled 'Woods'?\nI am not a trained reader of horror. Usually whenever I encounter horror stories, I'm left feeling dissatisfied with the quality of my unsettlement; I think \"oh, that was gratuitous\" or \"eh, was that necessary?\" With very few exceptions, I tend not to seek out horror.\nEmily Carroll's Through the Woods is so thoroughly an exception that I have to revise my stance on the whole genre.\nIn these five graphic tales (meaning comics, not stories told in Grand Guignol fashion — although that linguistic line is definitely blurred here), Carroll's sinuous prose and emphatic art blend seamlessly into a path through the stories she tells. If there is a key to this collection, it is the phrase, \"It came from the woods. (Most strange things do),\" which recurs in \"His Face All Red,\" the story of a man who murders his brother only to see him emerge from the woods whole, happy and unscathed. These are tales of strange things that come from or go into the woods — and what they did to people, or had done to them, along the way.\nThese stories are thick with the cadence and syntax of fairy tale, where the telling's stylized repetitions are rendered as much through art as through words. I badly want to hold up three pages in \"A Lady's Hands Are Cold\" in order to discuss at obnoxious length how the twisting layout on one page draws the gaze into a song, how the song encircles a character, how the art is contrapuntal and telling three stories in harmonic dissonance to the line of the prose. It's a story in conversation with Bluebeard and Mr. Fox while aping neither; it's unsettling, and frightening, and builds expectation in familiar fairy tale lines only to — well. That would be telling.\nIt's also stunningly beautiful. The whole book is magnificently executed: the work with color, character, contrast, perspective, layout, lettering, is all dextrous and varied and absolutely masterful. It's Gorey with less humor and more eloquence, elegance and poise; in place of whimsy is a wicked sense of pace, threat and a lurking delight in causing terror. I found myself so awed by individual pages that I had to exclaim about them in great detail to hapless people around me, saying things like, \"Look, just look at how the ribbon around her throat is a threat because of this blood-striped knife,\" or \"do you see how the word 'nothing' here is part of a sentence but also an illustration of what is spoken between them!\"\nI should say that I greeted the endings of some stories with dismay. They are, after all, horror. But it was a dismay that felt earned, that seemed to say, \"What kind of story did you think this was?\" in a gentle, chiding way — while patiently eating your face.\n(Not that anyone's face gets — well. Anyway.)\nThrough the Woods is complex without being opaque; these are all still clear, deceptively simple stories that are kissing-close to beginning with \"once upon a time.\" They're stories about girls who lose a father to the winter, a mother to sickness, a friend to a ghost; they're stories told as straightforwardly as fairy tale while containing all the rich density of poetry.\nI am still not a reader of horror. But I am a reader of poetry, of folk and fairy tales, of dark fantasy and a frequent wanderer of woods — and as such, I am most certainly a reader of Carroll.\nIt's not lost on me that this book is, in so many ways, a cautionary tale against setting foot in strange forests — while being at the same a dense tangle of story-wood in and of itself. Nor, I suspect, is it lost on Carroll, who lures us in only to do terrible, wonderful things to our heads and hearts.\nAmal El-Mohtar is the author of The Honey Month and the editor of Goblin Fruit, an online poetry magazine.","url":"https://www.npr.org/2014/07/29/334077605/do-you-dare-to-venture-through-these-tangled-woods"}
