{"authors":["Jack Montgomery"],"date_download":"2018-10-30 17:50:55","date_modify":"2018-10-30 17:50:55","date_publish":"2018-10-29 09:05:37","description":"Up to 80 jihad brides and their children are reportedly heading back to Britain from Kurdish custody in the Middle East.","filename":"data/vaneerConsumption/DozensofJihadBridesReturningtoBritainImminently.json","image_url":"https://media.breitbart.com/media/2018/08/burqa.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_10_29__1540921855.html","title":"Dozens of Jihad Brides Returning to Britain 'Imminently'","title_page":"Dozens of Jihad Brides Returning to Britain 'Imminently'","title_rss":"NULL","source_domain":"breitbart.com","text":"Up to 80 jihad brides and their children are reportedly heading back to Britain from Kurdish custody in the Middle East.\nAround 150 jihad brides with British citizenship are thought to have travelled to the Middle East to join the Islamic State, mostly with male partners or to become brides to jihadists already in theatre.\nMany have now become widows in the custody of Kurdish fighters as the Islamic State’s physical caliphate — which once stretched across Syria and Iraq, with exclaves in places like Misrata, Libya — collapses in the face of sustained assaults by the Russian-backed Syrian government and Western-backed forces such as the Kurdish YPG.\nKurdish leader Abdul Karim Omar now says he wants to “hand over” the foreign extremists who once flocked to the region, according to The Times, vowing: “We will not let them stay here.”\nThe French government recently said they would accept children being repatriated, but not their adult parents — but Theresa May’s government appears to be a softer touch, with a relative of one ‘British’ bride claiming she had been issued with a new passport and travel documents for her children, and that she and around 80 women like her are likely to return imminently. More may follow.\nUK Government Plans to ‘Bribe’ Returning Islamic State Fighters with Houses and Jobs\nhttps://t.co/CXFK0sZw90 — Breitbart London (@BreitbartLondon) October 30, 2017\n“The vast majority of those returning to Britain from Syria are women and children,” one British official confirmed by way of justification — although female jihadists have been convicted for terror plots in the UK.\n“The more concerning cases — particularly the men — have not been returning. But we will speak to everyone… because they may have been involved in terrorist activity,” they added.\nThis does not appear to be quite true, however, as previous reports have indicated that a large number of Islamic State volunteers have returned to Britain, and that the authorities have not seen great success in either prosecuting or even monitoring them, due to difficulties gathering evidence of crimes in their Middle East — which is, of course, a war zone — and a lack of police and security resources to surveil them all.\nOnly one female returnee, Tareena Shakil, from Birmingham, has been successfully convicted.\nMay Govt Admits ‘Significant Portion’ of Returned Islamic State Jihadists Going Unpunished https://t.co/IKVdAunzdk — Breitbart London (@BreitbartLondon) February 5, 2018\nOpinion on whether or not jihad brides should be allowed to return is reportedly divided, with the neighbour of two sisters who travelled to the Islamic State from east London suggesting “The children should definitely be allowed to return because they are so young and they’ve done nothing wrong” — although side-steps the question of whether Britain has any real obligation to children born in the Middle East to migration-background women.\nAnother local resident was less indulgent, stating simply: “They’ve made their bed, now they should lie in it… Last year’s attacks in London and Manchester showed that we’ve got enough jihadists here already. We don’t need any more.”\nSalman Abedi, the suicide bomber who targetted an Ariana Grande concert attended mainly by children and young people, was the son of an Islamist refugee from Libya.\nBREAKING: Latest named victim of Manchester attack is 8-year-old Saffie Rose Roussos https://t.co/Xf4w03JYoK pic.twitter.com/bDwiBN6MQL — Breitbart London (@BreitbartLondon) May 23, 2017\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/10/29/dozens-jihadi-brides-returning-britain-imminently/"}
