{"authors":["Associated Press"],"date_download":"2018-10-23 05:24:50","date_modify":"2018-10-23 05:24:50","date_publish":"2017-03-16 16:19:48","description":"LIMA, Peru (AP) - Muddy water spilled onto streets and into homes on Thursday in a new round of unusually heavy rains that has killed at least a dozen people...","filename":"data/vaneerConsumption/DozendieinnewroundoffloodinginPeru.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/01/wire-231669-1489712962-556_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320930_Dozen-die-new-round-Peru-flooding_1540272290.html","title":"Dozen die in new round of flooding in Peru","title_page":"Dozen die in new round of flooding in Peru | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LIMA, Peru (AP) - Muddy water spilled onto streets and into homes on Thursday in a new round of unusually heavy rains that has killed at least a dozen people in Peru and now threatens flooding in the capital.\nThe intense rains and mudslides over the past three days have wrought havoc around the Andean nation and caught residents in Lima, a desert city of 10 million where it almost never rains, by surprise.\nIn one of the more dramatic incidents, stunned residents watched and took out cellphone cameras as a woman escaped after being swept into an avalanche of mud, wood debris and farm animals about 53 kilometers (32 miles) south of downtown Lima.\nA man plays in a flooded street using an inner tube in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)\nEvangelina Chamorro, 32, had just dropped her two daughters at school and was feeding her pigs alongside her husband when they were pulled into a landslide. Armando Rivera, Chamorro's husband, told RPP radio they climbed a tree but the trunk broke. They held on to each other's hands but Chamorro eventually lost his grip and got separated.\nShe emerged near a bridge, lifting herself from a current of wooden planks and walking toward the shore covered head to toe in mud.\n\"There's a person there!\" an onlooker cried out.\nChamorro collapsed as she reached land and was quickly carried by several men to an ambulance. She sustained only minor injuries.\nAuthorities said Thursday they expect the rains caused by El Nino, which generates a warming of surface waters in the eastern Pacific Ocean, to continue for another two weeks. Thus far, officials say a total of 62 people have died and 12,000 homes have been destroyed in storms this year.\nIn Lima, the swelling Huaycoloro river swept away two trucks and threatened to destroy a bridge. Schools nationwide have suspended classes. And seven of the nation's most dangerous criminals were temporarily transported to another facility after a river near the prison threatened to overflow.\nPresident Pedro Pablo Kuczynski said late Wednesday that authorities are prepared to provide shelter and relief to those left homeless.\nA man looks at the flow of the Huaycoloro river in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)\nSoldiers carry tools to use for helping neighbors cross a flooded street in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)\nA man wades through a flooded street in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)\nNeighbors work to salvage belongings from their flooded home in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)\nPeople watch from the top of a hill as the overflow of the Huaycoloro river floods streets in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)\nA man takes an inner tube onto a street flooded by the overflow of the Huaycoloro river in Lima, Peru, Thursday, March 16, 2017. A new round of unusually heavy rains has killed at least a dozen people in Peru and now threatens flooding in the capital. Authorities said Thursday they expect the intense rains caused by the warming of surface waters in the eastern Pacific Ocean to continue another two weeks. (AP Photo/Rodrigo Abd)","url":"https://www.dailymail.co.uk/wires/ap/article-4320930/Dozen-die-new-round-Peru-flooding.html"}
