{"authors":["Bob Price"],"date_download":"2018-10-30 20:03:27","date_modify":"2018-10-30 20:03:27","date_publish":"2016-11-24 15:02:36","description":"A Texas DPS Trooper who was nearly killed after being struck by an alleged drunk driver is going home – just in time for Thanksgiving.","filename":"data/vaneerConsumption/DPSTrooperInjuredonDutyisHomeforThanksgiving.json","image_url":"https://media.breitbart.com/media/2016/11/Trooper-Blackburn-Homecoming.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_11_24__1540929807.html","title":"DPS Trooper Injured on Duty is Home for Thanksgiving","title_page":"DPS Trooper Injured on Duty is Home for Thanksgiving","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas – A Texas Department of Public Safety (DPS) Trooper who was nearly killed after being struck by an alleged drunk driver over Labor Day weekend is going home–just in time for Thanksgiving.\nTrooper Chad Blackburn has been recovering, first in a hospital and later in an extended care facility, since being critically injured in the early morning hours of September 5. As he prepared to go home for the first time, he was greeted by a line of DPS troopers who stood and clapped as he was wheeled out of the facility with his wife and children, KHOU CBS11 reported Wednesday evening. He was escorted home by his fellow troopers.\nBlackburn was sitting in his DPS patrol vehicle alongside I-45 in southeast Houston on September 5 while conducting a Labor Day speeding and drunk driving enforcement program, KTRK reported at the time. His vehicle was struck from behind by a red Mercedes driven by Tuwanna Moore, 31. The crash was so violent, her Mercedes flipped over and landed on its roof.\n“A red Mercedes-Benz was traveling at a high rate of speed tried to attempt a lane change to the right on the outside and ran into the back of the state trooper,” DPS Sergeant Richard Standifer said at the time.\n“The preliminary tox (toxicology) screen that was taken was .29,” a court officer told KTRK. “She admitted to the filing officer she consumed tequila. She also admitted to driving.”\nThe trooper received serious injuries to his spine, lungs, and spleen. He was quickly transported to Memorial Herman Hospital in the Texas Medical Center. He spent several weeks in ICU as he struggled to survive his horrific injuries.\nMore than two months later, Blackburn is going home and will celebrate Thanksgiving with his family.\n“I can’t express enough thanks and enough gratitude for what everyone has done for us,” Sherri Blackburn, the trooper’s wife told the reporters for the CBS affiliate. “We’ve never felt alone. We felt like the community was right there with us the entire time. We serve a mighty God, and he’s been right there with us. We’re just very thankful.”\nDPS Sergeant Stephen Woodard told KHOU, “On that tragic day, we could have been planning a funeral, but today it’s a celebration. It’s Thanksgiving. We’re more thankful to not just be alive, but to be able to share this moment with our friend.”\nMrs. Blackburn told reporters his recovery is going well. “He’s ahead of schedule on his recovery. He works hard every day. He follows doctors’ orders. That’s enabled him to do some things we didn’t expect – like go home this soon.”\nTrooper Blackburn left his medical care facility once before. On October 29, the trooper was allowed to leave in order to attend a play where his daughter was performing Macbeth. He was finally able to attend the closing night’s performance.\n“My daughter Victoria has worked so hard, not only in this production but in her theatre class for several years now,” Blackburn told ABC13 at the time. “And I did not want to miss something that she’s worked so hard to accomplish.”\nSherri Blackburn said she hopes he will be able to come home again for Christmas.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2016/11/24/dps-trooper-injured-duty-home-thanksgiving/"}
