{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:46:52","date_modify":"2018-10-30 18:46:52","date_publish":"2018-08-07 14:26:41","description":"Schools are hosting drag queen stars as story readers to children and justifying the events as “social and emotional learning.”","filename":"data/vaneerConsumption/DragQueensTeachChildrenTheresNoSuchThingasBoyandGirlThings.json","image_url":"https://media.breitbart.com/media/2017/06/DRAG-QUEEN-STORY-HOUR.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_07__1540925212.html","title":"Drag Queens Teach Children ‘There’s No Such Thing as Boy and Girl Things’","title_page":"Drag Queens Teach Children ‘There’s No Such Thing as Boy and Girl Things’","title_rss":"NULL","source_domain":"breitbart.com","text":"Schools are hosting adult drag queen stars as story readers to children as young as preschool age and justifying the events as consistent with the latest progressive education panacea known as “social and emotional learning.”\n“What an amazing way to teach individuality, empathy, and acceptance!” posted Alexis Hernandez, a first-grade teacher at the Maurice Sendak Community public school in Brooklyn, New York, to the Drag Queen Story Hour’s (DQSH) website.\nHernandez continued her praise:\nDrag Queen Story Hour gave my first graders a fun and interactive platform to talk and think about social and emotional issues like acceptance, being yourself, and loving who you are. During our debrief … [students] were preaching the incredible lessons they had learned, like “it’s OK to be different,” and “there’s no such thing as ‘boy’ and ‘girl’ things.”\nThe Daily Caller observed a new video by Sean Fitzgerald, in conjunction with the David Horowitz Freedom Center and Stop K-12 Indoctrination, which alerts parents to the push to indoctrinate even very young children in gender ideology – a belief system that subjugates biological sex to whatever gender an individual claims at any given time:\nFitzgerald emphasized that if parents opt their children in to a library or bookstore reading hour led by a drag queen, it is their right to do so.\n“It doesn’t stop there,” he cautioned, however. “Drag Queen reading hours don’t only take place in private book stores and rented spaces in public libraries. Many of these events take place within our public schools.”\nThe target audience for DQSH are children between the ages of three and eight:\n“DQSH captures the imagination and play of the gender fluidity of childhood and gives kids glamorous, positive, and unabashedly queer role models,” touts the drag queens’ website. “In spaces like this, kids are able to see people who defy rigid gender restrictions and imagine a world where people can present as they wish, where dress up is real.”\nA comment posted to DQSH’s website by Judy Zuckerman, director of Youth and Family Services at the Brooklyn Public Library, demonstrated that gender ideology adopts the tenets that there are no boundaries in sexuality, that the science of biology is weighing children down, and that children should be able to focus totally on themselves.\n“Drag Queen Story Hour is a fun and important program that celebrates diversity in the way that children may dress and act,” Zuckerman said. “It encourages children to look beyond gender stereotypes and embrace unfettered exploration of self.”\n“Think about how absurd this is,” Fitzgerald says in the video, adding:\nThe taxpayer is funding adult-themed performers to come and read to our smallish children in order to indoctrinate them into a political ideology about gender while, at the same time, school districts across the country are removing any and all references to biological sex from science textbooks.\nJane Robbins, senior fellow at the American Principles Project, based in Washington, DC, wrote in a statement sent to Breitbart News that “‘social emotional learning,’ in the hands of radical ideologues, can turn into child abuse”:\n“These people apparently think children’s stability in their identities should be sacrificed to advance a political agenda,” she said and added:\nThese drag-queen exhibitions seem designed to create gender confusion – known as gender dysphoria, or “transgenderism” – in young children. “This condition in turn could lead to treatment that, in the words of the American College of Pediatricians, “virtually ensures they will ‘choose’ a lifetime of carcinogenic and otherwise toxic cross-sex hormones, and likely consider unnecessary surgical mutilation of their healthy body parts as young adults.”\nParents and teachers: Ask children about their feelings. Their ability to identify and label negative emotions will grow self-awareness. Read for this and more ways to enhance children’s social-emotional learning. #SELhttps://t.co/urdEzsoVL9 — Harvard Education (@hgse) July 31, 2018\n“Sufferers from gender dysphoria have sky-high rates of suicide,” Robbins continued. “But at least they can be used to advance a political agenda.”","url":"https://www.breitbart.com/politics/2018/08/07/drag-queens-teach-children-no-such-thing-boy-girl-things/"}
