{"authors":["Will Martin"],"date_download":"2018-10-30 23:10:49","date_modify":"2018-10-30 23:10:49","date_publish":"2016-12-08 00:00:00","description":"Financial markets have \"proved much more resilient\" than expected in the face of geopolitical risk events in 2016.","filename":"data/vaneerConsumption/DRAGHIUncertaintyprevailseverywhere.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ecb-president-mario-draghi-press-conference-for-december-2016-12_1540941049.html","title":"DRAGHI: 'Uncertainty prevails everywhere'","title_page":"    ECB President Mario Draghi press conference for December - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"European Central Bank President Draghi addresses the European Parliament in Strasbourg, 21 November 2016 Reuters/Vincent Kessler ECB President Mario Draghi says that \"uncertainty prevails everywhere\" but believes financial markets have \"proved much more resilient\" than expected in the face of geopolitical risk events in 2016.\nSpeaking after the bank announced an extended, but downsized programme of quantitative easing, Draghi told reporters in Frankfurt that the year's three big events — the Brexit vote, Trump's presidential victory, and the Italian referendum — could all possibly have \"major effects in the world,\" but what those effects will be is unknown.\nTurning particularly to the upcoming presidency of Donald Trump, Draghi said that it is \"very, very difficult to assess now what is the medium to long term consequence,\" of a Trump presidency.\nThis uncertainty was one of the key reasons the ECB decided to allow itself to be \"pragmatic and flexible\" when it comes to tweaking its quantitative easing programme.\n\"If, in the meantime, the outlook becomes less favourable or if financial conditions become inconsistent with further progress towards a sustained adjustment of the path of inflation, the Governing Council intends to increase the programme in terms of size and/or duration,\" the ECB's official statement said.\n\"This [uncertainty] is the reason for that sentence in the introductory statement,\" Draghi told reporters.\nBroadly speaking, he said, the global economy is recovering well, but he once again emphasised the need for structural reforms to economies around the world, but particularly in Europe.\n\"There are indications of a somewhat stronger global recovery. However, economic growth in the euro area is expected to be dampened by a sluggish pace of implementation of structural reforms and remaining balance sheet adjustments in a number of sectors.\"\nAsked about fears surrounding the state of Italy's banks, and stricken Monte dei Paschi in particular, Draghi replied by saying that: \"The vulnerabilities that both the banking system and Italy have been there for a long time. I'm confident the government knows what to do.\"\nDuring the conference, Draghi categorically denied that the ECB has begun the tapering — the process of gradually unwinding purchases — of its QE programme, saying: \"There is no question about tapering.\"\nTapering \"has not even been discussed. In fact, it is not even on the table,\" he added. For what the ECB is doing to be considered tapering, Draghi said, the bank would need to \"have a policy whereby purchases go to zero.\"","url":"https://www.businessinsider.com/ecb-president-mario-draghi-press-conference-for-december-2016-12"}
