{"authors":["Will Martin"],"date_download":"2018-10-30 23:15:57","date_modify":"2018-10-30 23:15:57","date_publish":"2016-12-08 00:00:00","description":"The European Central Bank's latest monetary-policy decisions were released Thursday afternoon.","filename":"data/vaneerConsumption/Draghireloadsthebazooka.json","image_url":"https://amp.businessinsider.com/images/5849840bdd08953e448b4f4a-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-central-bank-monetary-policy-december-2016-12_1540941357.html","title":"Draghi reloads the bazooka","title_page":"    European Central Bank monetary policy decisions for December 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Kai Pfaffenbach The European Central Bank has extended its quantitative-easing programme beyond its horizon of March 2017, saying Thursday that it would keep buying up eurozone corporate and government debt until at least December 2017.\nAt its latest monetary-policy meeting, the bank's governing council said that beginning in April — the month after its quantitative-easing programme was scheduled to end — it would buy up to €60 billion of assets a month, €20 billion less than its current programme.\nQE, a stimulus program of asset purchases, is colloquially known as the \"bazooka\" in the press because it is one of the most direct and heavy-duty monetary-policy weapons central banks can use. The bank has the scope to buy €80 billion of government and corporate bonds a month.\nThe bank also left all its main rates unchanged Thursday, with its key refinancing rate remaining at 0% and the key deposit rate left at -0.4%. It said it expected \"interest rates to remain at present or lower levels for an extended period of time.\"\nThe ECB said in a statement announcing its QE decision: \"From April 2017, the net asset purchases are intended to continue at a monthly pace of €60 billion until the end of December 2017, or beyond, if necessary, and in any case until the Governing Council sees a sustained adjustment in the path of inflation consistent with its inflation aim.\"\nThe ECB added that it was willing to increase the size of its buying programmes, saying: \"If, in the meantime, the outlook becomes less favourable or if financial conditions become inconsistent with further progress towards a sustained adjustment of the path of inflation, the Governing Council intends to increase the programme in terms of size and/or duration.\"\nA QE extension of some form was widely expected, though the reduced programme is something of a surprise. In October, the ECB's president, Mario Draghi, strongly hinted that the bank would make some sort of move on a QE extension. He told a press conference on October 20: \"Our decisions in December will tell you what we are going to do in the coming months. That will define the monetary-policy environment for the coming weeks and coming months.\"\nThe bank also left its key interest unchanged Thursday afternoon, when the bank announced the outcome of its December governing council meeting. It would have been an enormous shock if either of those rates changed on Thursday, with the market pricing a 98% chance that interest rates would stay put.\nInflation has picked up a little in recent months, hitting 0.6% in November but still well below the ECB's target of close to, but not above, 2%. This is the core driver of the extended programme of bond buying, known officially as the Asset Purchase Programme.\nCommenting on the ECB's decision, Claus Vistesen, the chief eurozone economist at Pantheon Macroeconomics, said in an emailed note that the ECB's tone was \"very dovish\" — here's the key extract:\n\"The ECB has extended the QE program for longer than the market, and we, expected, and has committed itself to keeping it in place should the recovery falters. This is to say, tapering is far from guaranteed or automatic. This should just about be enough to offset the \"disappointment\" of the ECB only buying €60B a month starting Q2 next year. The statement further notes that principal repayments will be reinvested alongside the net purchases. In other words, the ECB is in no hurry to shrink its balance sheet.\"\nSome, however, see the move as a compromise between the ECB's hawks (those who want to tighten monetary policy) and doves (who want the opposite). Hawks get a smaller amount of QE, but doves get extended QE. Everybody wins — or, from some perspective, nobody does.\nDuring a news conference after the decision, Draghi announced some tweaks to the way the ECB would go about buying assets in the future, saying the bank would start buying bonds with a minimum maturity of one year. The threshold was previously two years. It will also now be allowed to buy bonds yielding below the bank's deposit rate of -0.4% to the \"extent necessary.\"\nThe euro briefly spiked higher on the decision, gaining more than 1.1% on the day, before dropping almost instantly, falling into negative territory, extending its losses. Here's how it looks against the dollar as Draghi speaks:","url":"https://www.businessinsider.com/european-central-bank-monetary-policy-december-2016-12"}
