{"authors":["Karishma Sarkari For Daily Mail Australia"],"date_download":"2018-10-22 23:34:07","date_modify":"2018-10-22 23:34:07","date_publish":"2016-01-28 12:36:00","description":"The comedic duo and hosts of I'm A Celebrity...Get Me Out Of Here! Australia got along so well last season, this time around they'll be living together.","filename":"data/vaneerConsumption/DrChrisBrownwilllivewithcohostJuliaMorrisforImACelebrity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA751B00000578-0-image-a-29_1453986660521.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420780_Dr-Chris-Brown-live-host-Julia-Morris-m-Celebrity-Here_1540251247.html","title":"Dr Chris Brown will live with co-host Julia Morris for I'm A Celebrity","title_page":"Dr Chris Brown will live with co-host Julia Morris for I'm A Celebrity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dr Chris Brown and Julia Morris have returned to the South African jungle closer than ever.\nThe comedic duo and hosts of I'm A Celebrity...Get Me Out Of Here! Australia got along so well last season, this time around they'll be living together.\nSpeaking to OK! Magazine Australia in an interview published on Thursday, the 37-year-old Bondi Vet said there is nothing fake about the pair's close relationship and describes their chemistry as 'complicit harassment'.\nScroll down for video\n'Complicit harassment': Dr Chris Brown told OK! Magazine Australia that his relationship with I'm A Celebrity...Get Me Out Of Here! co-host Julia Morris is not fake, with the pair close after the last 12 months\nThe hunky vet also added with his tongue firmly-in-cheek: 'I get to deal with wild animals on four legs and on two legs. I have more success keeping one of those under control than the other'.\nMeanwhile the 47-year-old House Husbands actress revealed in the same interview that she's found it 'really hard' over the past 12 months to see her side-kick become increasingly obsessed with her.\n'Obviously, I want to reach out and touch him...emotionally,' she added.\nAsked if the brunette beauty plans to do anything differently second time around, Julia admitted: 'I might harass the doctor slightly less, but by slightly I mean I might give him half a day off.\n'The rest of the time he needs to batten down his private hatches,' she added cheekily.\n'I want to reach out and touch him': Julia joked with the publication about the chiselled Vet's obsession with her\nThe pair will share quarters across the season, with the handsome TV personality set to whip up a meal or two for his house-mate with a 'bachelor spatula'.\nMeanwhile, Julia joked that she hopes her husband and daughter spending ten days with them in Africa won't impact their flirtations.\nThe duo's on-screen banter is one filled with sexual innuendo, usually from Julia's side, making Chris appear visibly uncomfortable.\nReturning to the jungle! Returning co-hosts of the reality series will share a house this year while in the South African wilderness\nHowever, he recently played down claims his co-host's often suggestive remarks are demeaning, in light of the recent Chris Gayle sexism incident, telling news.com.au: 'This is comedy, this is performance....I'm in on the joke.'\nThe chiselled Bondi Vet, who is seen in a loin cloth in the promotional shots for the upcoming reality TV series, has even begun playing up to the comedian's comments, making them quite the dynamic double act.\nI'm A Celebrity will feature an array of stars camped out in the middle of Kruger National Park in South Africa jungle, where they will be put to the test.\nSurprised: Chris says he doesn't understand the link between Julia's joking on-screen antics and cricketer Chris Gayle's apparently 'sexist' remarks to a TV reporter recently\nOver the eight week period, they must survive a series of tasks to earn decent meals and special treats, while also surviving the public vote, to win $100,000 for their charity.\nIn recent weeks, speculation has been rife as to who will go into the jungle at the end of the month.\nDespite offering plenty of hints, no member of the line-up has been officially confirmed as yet, with the contestants to be revealed as they make their way into the jungle on Sunday night.\nDr Chris recently The Project that the reality show is going to be even bigger - and tougher - in its second season.\n'As opposed to last year, where we kind of went easy on all the celebrities in the jungle, this year, it's very real Africa.\n'This is going to be a different series, it's going to be a little bit more wild, a bit more dangerous,' the hunky presenter said.\nI'm A Celebrity...Get Me Out Of Here! Australia will launch on Sunday January 31, 7.30pm on Network Ten, while sister show I'm A Celebrity...Get Me Out Of Here! NOW will follow the main show on Channel Eleven.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420780/Dr-Chris-Brown-live-host-Julia-Morris-m-Celebrity-Here.html"}
