{"authors":[],"date_download":"2018-10-22 22:09:36","date_modify":"2018-10-22 22:09:36","date_publish":"2014-05-09 11:10:34","description":"Dr. Dre could become the world's first billionaire rapper if Apple buys Beats Electronics (and if the math adds up).","filename":"data/vaneerConsumption/DrDreWillHeBetheWorldsFirstBillionaireRapper.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/431161/140509-dre_0708_f9915c16fd9539aebe66b3a23ad9ad96.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_dr-dre-will-he-be-worlds-first-billionaire-rapper-n101151_1540246176.html","title":"Dr. Dre: Will He Be the World's First Billionaire Rapper?","title_page":"Dr. Dre: Will He Be the World's First Billionaire Rapper?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe only one who knows how much Dr. Dre is really worth today is Dr. Dre.\nAnd as he says, in his now famously deleted video, he is \"the first billionaire in hip-hop right here from the (expletive) West Coast.\"\nDr. Dre is super rich by any measure. And the co-founder of Beats, the headphones and music-streaming service, is about to get even richer if Apple buys the company, as reported, for more than $3 billion.\nBut the question of whether he's a billionaire requires a lot of guesswork. And some of the math being tossed around on the web doesn't seem to add up.\nForbes said in its May issue that Dr. Dre was worth around $550 million. Pundits are saying that all he needs is another $450 million to become a billionaire. So as long as his stake in Beats is more than 15 percent, he's a billionaire.\nBut that math is double counting. Forbes doesn't offer any details on its estimate for Dr. Dre's worth, but they do say that it's based on his stake in Beats. They estimate that stake—based on Carlyle's minority investment in the company—at close to $2 billion.\nForbes' Zack O'Malley said Dr. Dre has a 20 percent to 25 percent stake in Beats. (Other sources say it's closer to 20 percent.)\nIf that's the case, his pretax take from a $3.2 billion sale would be between $640 million and $800 million. Since he's a resident of California, which treats a capital gain as ordinary income, he would likely pay up to a third of his windfall in taxes.So that would bring his take-home from the deal to between $430 million and $670 million. That's unless he somehow shielded his stake with trusts or offshore entities, which is possible.\nBut if it's a straight sale with typical tax treatment, Dr. Dre would need additional assets of between $330 million and $570 million in order for the Apple deal to make him a billionaire.\nThat said, Dre is the greatest wealth creator in the history of hip-hop. And is there really any difference between having a net worth of $700 million or $1 billion? Either way, it's enough to buy most of what anyone could ever want.\nAnd if he says he's a billionaire, he would certainly know. But contrary to his video statement, Forbes will not be updating its billionaire list. O'Malley is saying Dr. Dre is worth closer to $800 million.\nAnd indeed, my own math suggests that Dr. Dre would need to have significant non-Beats wealth (at least $300 million) to get him to the 10-figure club.","url":"https://www.nbcnews.com/business/consumer/dr-dre-will-he-be-worlds-first-billionaire-rapper-n101151"}
