{"authors":[],"date_download":"2018-10-22 21:35:42","date_modify":"2018-10-22 21:35:42","date_publish":"2014-06-05 16:15:47","description":"Given a chance to extend their quasi-legal status by the administration, young immigrants are demanding more: protection from deportation for families.","filename":"data/vaneerConsumption/DREAMersCanRenewDeferredDeportationsButPressForMore.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/490016/20140605-dreamarmy-sl-1244_504ef08ad7c296f814a046124a8a51b2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_dreamers-can-renew-deferred-deportations-press-more-n123636_1540244142.html","title":"DREAMers Can Renew Deferred Deportations, But Press For More","title_page":"DREAMers Can Renew Deferred Deportations, But Press For More","title_rss":"NULL","source_domain":"nbcnews.com","text":"“It is not a matter of whether or not the administration delivers the relief we are demanding, it is just a matter of when. Our families can’t wait any longer, we need action now,” Cristina Jimenez, co-founder at United We Dream, said in a statement.\nTheir view has split many of their allies. Some groups and lawmakers have backed the president and his view to give Republicans until the August congressional recess to pass immigration legislation. Others have decried the many thousands of people who will be deported until then and joined the youths in calling for the president to take action now.\nThe president meanwhile has defended his caution in using his executive authority, warning that it is not a permanent solution and who it can affect is limited.\nThe first expirations of what is known as Deferred Action for Childhood Arrivals are approaching, but the administration said Thursday the young immigrants could start applying immediately to extend their temporary breaks from potential deportation.\nMore than 560,000 young immigrants had received the quasi-legal status since they first began being granted in September 2012, according to the Department of Homeland Security.\nThe administration has simplified the renewal application and made some other adjustments to the DACA program. Kamal Essaheb, an attorney at the National Immigration Law Center, said two important things for young immigrants to keep in mind is that if they have never applied for DACA, they can and those who have it should learn and stay abreast of the specific window of time they have to renew.\nEssaheb said NILC will soon have on its website a date generator so young immigrants can input their expiration date and get back a date range for when they should renew.","url":"https://www.nbcnews.com/news/latino/dreamers-can-renew-deferred-deportations-press-more-n123636"}
