{"authors":["Samantha Matthews"],"date_download":"2018-10-30 23:57:30","date_modify":"2018-10-30 23:57:30","date_publish":"2014-08-12 20:33:53","description":"Are you dying to steal Lindsay Lohan's style? If so then you are going to want to thank her little brother for his latest venture. Lindsay Lohan's younger brother, Michael Lohan Jr., is raising money for Vigme, a social shopping app that will let…","filename":"data/vaneerConsumption/DressLikeLindsayLohanWithHerBrothersNewAppVigme7OutfitsWedActuallyWantToSteal.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3d03b68c-7681-4c23-b192-d2751490d6e7.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35500-dress-like-lindsay-lohan-with-her-brothers-new-app-vigme-7-outfits-wed-actually-want_1540943850.html","title":"Dress Like Lindsay Lohan With Her Brother's New App, Vigme - 7 Outfits We'd Actually Want To Steal","title_page":"Dress Like Lindsay Lohan With Her Brother's New App, Vigme — 7 Outfits We'd Actually Want To Steal","title_rss":"NULL","source_domain":"bustle.com","text":"Are you dying to steal Lindsay Lohan's style? If so then you are going to want to thank her little brother for his latest venture. Lindsay Lohan's younger brother, Michael Lohan Jr., is raising money for Vigme, a social shopping app that will let fans find out where to purchase their favorite celebs clothes, according to Page Six. While you may not think of Lindsay Lohan as a style icon, (I know I don't), some of her outfits are actually pretty great, making it totally justifiable to want to steal her look.\nMichael described the ins and outs of the shopping app to Page Six. “If Lindsay buys something, it goes into her [virtual] closet. People see what’s in her closet. If someone else buys [the same item], it puts money into Lindsay’s pocket,” Michael told me. “It’s a way for trendsetters to monetize their influence. We game-ify it.”\nAlthough I thought that the last time I wanted to steal Lohan's fashion looks was when I watched some of her most memorable movie roles like Parent Trap, Mean Girls, and Georgia Rule, I would definitely wear some of her more recent outfit choices. So in honor of the app, here's 7 outfits I'd actually want to steal from Lohan's closet.\n1. The Nude Cocktail Dress\nMonika Fellner/Getty Images Entertainment/Getty Images\nAlthough this dress may seem simple, the overall look is certainly chic and elegant.\n2. The Casual Look\nAndrew H. Walker/Getty Images Entertainment/Getty Images\nLohan's fuzzy white sweater, dark high waisted skinny jeans, and black booties prove just how stylish a casual look can be.\n3. The All Black Ensemble\nRobin Marchant/Getty Images Entertainment/Getty Images\nI love an all black attire and Lohan does it right!\n4. The Red Carpet Look\nJason Merritt/Getty Images Entertainment/Getty Images\nLohan wows on the red carpet in a black midi length cocktail dress with gold details and caged heels.\n5. The Leather Skater Skirt\nRob Kim/Getty Images Entertainment/Getty Images\nI love a great leather skirt and this skater version looks sensational on Lohan.\n6. The Black and White Style\nRob Kim/Getty Images Entertainment/Getty Images\nThis white blazer is the perfect add on for an all black outfit.\n7. The Printed Mini Dress\nJason Kempin/Getty Images Entertainment/Getty Images\nAlthough the hemline is a tad short this printed shift dress is super cute and I can't help but love those heels!\nImages: Getty Images","url":"https://www.bustle.com/articles/35500-dress-like-lindsay-lohan-with-her-brothers-new-app-vigme-7-outfits-wed-actually-want"}
