{"authors":["Alyson Hurt","Nancy Shute"],"date_download":"2018-10-22 23:11:48","date_modify":"2018-10-22 23:11:48","date_publish":"2015-06-03 00:00:00","description":"Lots of people say they're having trouble with alcohol. Native Americans and young, college-educated white men are most apt to be at risk. And most people don't get any help cutting back.","filename":"data/vaneerConsumption/DrinkingTooMuchOneThirdOfAmericansSayYes.json","image_url":"https://media.npr.org/assets/img/2015/06/03/beer-bottles_wide-8d10394de6a1e9732724bab7eb544fc7d1caed7f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2015_06_03_411747683_drinking-too-much-one-third-of-americans-say-yes_1540249908.html","title":"Drinking Too Much? One-Third Of Americans Say Yes","title_page":"Drinking Too Much? One-Third Of Americans Say Yes : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Drinking Too Much? One-Third Of Americans Say Yes\nEnlarge this image toggle caption iStockphoto iStockphoto\n\"Alcohol use disorder\" might not be a hashtag, and there's good reason. The term was created in 2013, when the DSM-5, the bible of mental health diagnoses, ditched the two distinct disorders of alcohol abuse and alcohol dependence in favor of one term: alcohol use disorder.\nWhatever you call it, it's a big problem. Almost 30 percent of Americans say they've had enough trouble with drinking to qualify at some point in their lives, according to a study from the National Institute on Alcohol Abuse and Alcoholism, published Wednesday in JAMA Psychiatry. That's 68 million people.\nThe researchers polled 36,309 adults in 2012 and 2013 on their drinking habits and health. Almost 14 percent said they'd had two or more of the 11 symptoms of alcohol use disorder in the past, year, including:\nAlcohol is often taken in larger amounts or over a longer period than was intended.\nThere is a persistent desire or unsuccessful efforts to cut down or control alcohol use.\nRecurrent alcohol use resulting in a failure to fulfill major role obligations at work, school or home.\nCraving, or a strong desire or urge to use alcohol. (This one's new.)\nRecurrent alcohol use in situations where it is physically hazardous.\nThe big sample size makes it possible to slice the data based on race, age, income and other variables. Native Americans face the greatest risk overall, and men are still drinking more than women, with 36 percent of men reporting alcohol use disorder at some point in their lives, compared to 22.7 percent of women.\nDrinking problems were worst in the young, with 26.7 percent of young adults under 30 saying they'd had trouble in the past year, compared to 16 percent of 30- to 44-year-olds. Other studies have found that teenagers are starting to drink earlier and are drinking more heavily, which then carries over into young adults.\nJust 7.7 percent of people who had drinking problems in a year sought treatment or help, the study found. Twelve-step groups were the most likely sources, with 4.5 percent going there compared to 3.6 percent talking with health care practitioners.","url":"https://www.npr.org/sections/health-shots/2015/06/03/411747683/drinking-too-much-one-third-of-americans-say-yes"}
