{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:03:08","date_modify":"2018-10-30 20:03:08","date_publish":"2016-12-08 16:00:01","description":"While Atlanta rarely dips below 20 degrees, our damp, gray winter days lingering in the 40s gets in...","filename":"data/vaneerConsumption/Drinkhottoddiesandspikedcocoaatthese8Atlantabars.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/07/Images/WPIMAGE_cmgajcfoodandmore_12319.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_dr_bcc60f065e6b091bbac8421c0162f8b1__1540929788.html","title":"Drink hot toddies and spiked cocoa at these 8 Atlanta bars","title_page":"Drink hot toddies and spiked cocoa at these 8 Atlanta bars","title_rss":"NULL","source_domain":"ajc.com","text":"While Atlanta rarely dips below 20 degrees, our damp, gray winter days lingering in the 40s gets in the bones. Wrap your hands around a warm cocktail to keep that chill at bay. From the classic toddy to spiked cocoa to wassail, we went in search of hot booze and found these eight Atlanta bars doling out cups of good cheer this season.\nWassail\nDating back to 5th-century Saxon Britain, wassail has seen many spirited iterations from warm spiced wine and mead in England to cider, brandy and Madeira in America. But one fact remains, wassail was and always has been sipped by crowds of merrymakers. Back again this year at Victory Sandwich Bar in Decatur, the batched Wet Your\nWassail is a play on beverage director Chasity West’s grandmother’s recipe. The cider-based hot beverage is mixed with spiced rum, pineapple and orange and seasoned with warming spices like clove and nutmeg. If you’re headed to the Fox Theatre over the Winter months, we suggest stopping at Edgar’s Proof and Provision for a cup of good cheer from beverage director James Wampler. Wampler’s wassail contains cider and dark rum with lemon and a secret blend of holiday spices topped with a fragrant star anise.\nVictory Sandwich Bar, 340 Church St., Decatur. 404-377-9300, vicsandwich.com.\nEdgar’s Proof and Provision, 659 Peachtree St. NE, Atlanta. 404-897-5045, thegeorgianterrace.com/edgars-proof-and-provision.\nChá de Cana (cane tea) at El Super Pan with cachaça and Laphroaig scotch. Photo courtesy of El Super Pan\nChá de Cana (cane tea) at El Super Pan\nNothing warms our soul faster than a hot toddy on a gray day but when that toddy involves rum and the smoky goodness of Laphroaig (scotch), you can bet the smile on our face is more than booze. Beverage director Alejandra Dudley wanted a warm cocktail on the menu reflecting El Super Pan’s Latin roots , “In Mexico during the holidays, we drink Ponche de Frutas. It's usually non-alcoholic and it has guava, prunes, tejocotes (stone fruit), sugar cane, warm spices and is sweetened with piloncillo.” Dudley created a Ceylon apple tea syrup and mixes it with Cachaça (rum-like spirit made from sugar cane), Angostura Vallet, Laphroaig and hot water. The cocktail is warm, slightly smoky with a hint of sweetness. A slice of sugar cane infused with Ron del Barrilito rum serves as both garnish and palate-prepper. Dudley recommends biting down on the cane to suck a bit of rum juice out between each sip of this boozy cane tea.\nEl Super Pan, Ponce City Market, 675 Ponce De Leon Ave, NE, Atlanta. 404-600-2465, elsuperpan.com.\nBrush Sushi's potent Mexican hot chocolate with Asian influences. Photo courtesy of Brush Sushi\nHot chocolate at Brush Sushi\nYou had us at hot chocolate. Add the concentrated kick of chipotle tincture and the high-octane funk from Xi Feng Jiu Baijiu (Chinese spirit distilled from fermented sorghum at 114 proof) and we surrender. Brush beverage director Jeff Banks got the idea for his “Mexican hot chocolate with Asian influences” after dining with friends over Thanksgiving whose parents had prepared a traditional Mexican feast with lots of heat. Banks stirs together 10 ounces of hot chocolate with house-made chocolate syrup, matcha, cinnamon, salt, chipotle tincture and Xi Feng Jiu Baijiu and serves the cocoa in a cast iron tea pot to keep it toasty. An edible garnish of marshmallow and yakitori shishito pepper is added which you roast over an open fire to nibble on between sips.\nBrush Sushi, 316 Church St., Decatur. 678-949-9412, brushatl.com.\nCast Iron's Linus and Lucy hot toddy with bourbon, dry curaçao and cocoa-infused honey. Photo courtesy of Cast Iron\nLinus and Lucy at Cast Iron\nNow open in the former Last Word space, Cast Iron boasts a classically-motivated cocktail menu. Beverage director Brad Tolleson whose bar chops include Restaurant Eugene and Craft Izakaya has created an impressive list of imbibes to pair with chef Evan Cordes' dishes (try the burger.) This includes a Southern winter classic the Linus and Lucy hot toddy. Tolleson gives the traditional whiskey-based cocktail a slightly bittersweet bite from herb-forward dry curaçao, smoothing the edges out with a silky cocoa-infused honey syrup and lemon. Presented in dainty cappuccino cups with the remaining mixture kept warm in a glass pot, this toddy can serve as tea for two or sipped solo with a good book.\nCast Iro n, 701-5 Highland Ave. NE, Atlanta. 404-228-2005, castironatl.com.\nThe Mercury's hot buttered rum uses local ingredients found at the Ponce City farmers market. Photo Courtesy of The Mercury\nHot buttered rum at Ponce City Farmers Market\nSip, shop, give back. The Mercury’s hot buttered rum makes that triple threat possible on Tuesday evenings from 4 p.m. to 8 p.m. at the Ponce City farmers market . Using local ingredients like Mercier Orchard’s cider, Banner Butter and Proof pecan old fashioned syrup, this luscious hot buttered rum will help keep you warm while you shop for your weekly produce. Proceeds from this grab-and-go hot cocktail help fund the farmers market. The market has moved indoors for the Winter and is located on the second floor next door to The Mercury.\nPonce City Market, second floor next to The Mercury, 675 Ponce De Leon Ave NE, Atlanta. cfmatl.org/poncecity.\nAlpine Dreams at Yebo Ski Haus\nFrom now until March 1, Yebo Beach Haus has transformed from summer resort to ski lodge with Winter-inspired cocktails, cozy interiors and a menu full of hearty fare like brats and cheese fondue. Bring on the cocoa and leg warmers. One hot beverage caught our eye immediately with its clever use of the high-proof French liqueur green chartreuse. Alpine Dreams pairs rich and creamy hot chocolate with the black licorice sweetness of green chartreuse and is served in a glass mug rimmed with Italian meringue. Sip this boozy cocoa through a chocolate cookie straw.\nYebo Beach (Ski) Haus,111 West Paces Ferry Road NW, Atlanta. 404-869-1992, yebobeachhaus.com.\nThe hot milk punch Bad Santa at Miracle on Monroe pop-up mixes overproof rum with Batavia Arrack. Photo: Rachel Harrison\nBad Santa at Miracle on Monroe\nChristmas has taken over Tapa Tapa in the Midtown Promenade through Christmas Eve. Miracle on Monroe is one of 29 bar takeovers around the world full of the holiday spirit (on steroids) and includes themed cocktails, Christmas movies on Wednesday nights and guest bartenders every Thursday. We fancied the Bad Santa, a hot milk punch with Barbados and Trinidad overproof rums, arrack (molasses, rice-based spirit), pineapple, lemon, almond milk and coconut water. Be warned, it’s aptly named, for the booze is strong in this Santa. Open Wednesday through Friday and Sundays 6 p.m. to midnight. Saturdays 6 p.m to 1 a.m. Saint Nick’s booze lair is 21 and up.\nMiracle on Monroe (Tapa Tapa), 931 Monroe Dr. NE, Atlanta. 404-481-5226, facebook.com/BudEtheElfsBar.\nRELATED CONTENT\nRead more of our coverage of the Atlanta bar scene\nMake merry with punch at these 5 Atlanta bars\nFive hard ciders to try\nWhy aren’t you drinking aperitif cocktails?\nOrange wine? Here’s why and where to give it a try\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/drink-hot-toddies-and-spiked-cocoa-these-atlanta-bars/44BNVjRveZGh3YGX6qORsI/"}
