{"authors":[],"date_download":"2018-10-30 21:54:37","date_modify":"2018-10-30 21:54:37","date_publish":"2016-12-20 12:45:00","description":"A driver whose car was pinned underneath a special education school bus Tuesday is expected to...","filename":"data/vaneerConsumption/DriverfreedaftercrashwithCobbschoolbus.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/20/Images/IMG_2872.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_driver-rescued-from-school-bus-crash-expected__1540936477.html","title":"Driver freed after crash with Cobb school bus","title_page":"Driver freed after crash with Cobb school bus","title_rss":"NULL","source_domain":"ajc.com","text":"A driver whose car was pinned underneath a special education school bus Tuesday is expected to be OK, Channel 2 Action News reported.\nThe crash shutdown all southbound lanes and one northbound lane of Austell Road near McDuffie Road for nearly two hours in Cobb County.\nAustell Rd at McDuffie: - Good News! ALL LANES NOW OPEN — Cobb County DOT (@CobbDOT) December 20, 2016\nThe car rear-ended the bus just before 7:10 a.m., Cobb police spokesman Sgt. Dana Pierce said.\nAt the time, the bus was headed to Sanders Elementary School in Austell, Cobb schools spokeswoman Donna Lowry said.\nRELATED: 2 metro Atlanta school buses crash daily\nWhile the seven children and two adults on the bus were not injured, the driver of the car was trapped for about 50 minutes, officials said.\nA technical rescue team with crews from east and north Cobb assisted in the rescue of the trapped driver.\n“They came together and were able to lift the school bus off the car, pull the car out and then cut the person out of a car,” Cobb fire battalion chief Chris Sobieski said.\nA driver was injured in a school bus crash Tuesday on Austell Road in Cobb County. JOHN SPINK / JSPINK@AJC.COM\nThe driver, who was conscious and talking, was taken to a local hospital by ambulance, he said.\nSchool bus crash working in Austell. McDuffie Rd. blocked and southbound Austell Rd. is blocked. Please avoid this intersection. pic.twitter.com/1gFKKDwol4 — Ashley Frasca (@AshleyFrascaWSB) December 20, 2016\nThe school’s principal and assistant principal went to the scene, Lowry said. The students and the adults were wearing seat belts at the time of the crash. A replacement bus was sent to the scene to carry the students and the adults to their final destination.\nSobieski said there have been more accidents this holiday season than normal.\n“I hope people exercise a little more caution in the holiday season,” he said. “A lot of people want to get to their destinations safely.”\nThe cause of the school bus crash is still under investigation.","url":"https://www.ajc.com/news/traffic/driver-rescued-from-school-bus-crash-expected/G2WZOt5yRyMGnWtOcbe9fM/"}
