{"authors":[],"date_download":"2018-10-22 22:42:49","date_modify":"2018-10-22 22:42:49","date_publish":"2014-05-12 15:49:13","description":"Pregnant women may be at a much higher risk of car crashes than others, especially during the second trimester, a new study finds.","filename":"data/vaneerConsumption/DrivingWhilePregnantCarCrashesMoreLikelyStudyFinds.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/436301/140512-pregnant-driver-11a_6f479fe47d3c98e47ccb386f4b9c40ab.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_womens-health_driving-while-pregnant-car-crashes-more-likely-study-finds-n103176_1540248169.html","title":"Driving While Pregnant? Car Crashes More Likely, Study Finds","title_page":"Driving While Pregnant? Car Crashes More Likely, Study Finds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPregnant women may be at a much higher risk of car crashes than those without babies on board, especially during the second trimester, according to a surprising new study that urges moms-to-be to drive extra carefully.\nWomen run a 42 percent increased relative risk of being in a motor vehicle accident when they’re pregnant than when they’re not — and the risk is especially acute during the first month of the second third of pregnancy.\nThat’s according to Canadian researchers who studied records of more than 500,000 women for six years from 2006 to 2011, comparing their risk of accidents before and after pregnancy. In the three years before they were pregnant, the women were involved in 177 car crashes a month. During pregnancy, the number jumped to 252 per month — a significant increase.\nIt’s a reminder that the huge surge of hormones, documented brain changes and other effects of pregnancy may affect expectant mothers more than they realize, said Dr. Donald Redelmeier, a population epidemiologist at the University of Toronto.\n“I look after pregnant women who ask me extremely unusual questions about scuba diving or hot tubs or airline flights or roller coasters,” Redelmeier told NBC News. “And I’ve never been asked about traffic safety, despite it being a substantially larger threat to mother and child.”\nIn fact, car crashes are the leading cause of fetal death linked to trauma in mothers, Redelmeier and his colleagues noted in the latest issue of the Canadian Medical Association Journal. Every year in the U.S., there are about 15 million motor vehicle accidents that send 2.5 million people to hospitals.\nRedelmeier’s study followed women who gave birth in Ontario, Canada, and were involved in serious car accidents that resulted in emergency room visits. It found that the higher risk of car crashes during pregnancy extended to women in diverse populations, with varying lifestyles, Redelmeier said. The risk was higher in the fall and winter, when the weather is worse, and in the afternoons, the study found.\n“It’s the afternoon commute that can really ruin your day,” he said.\nThough the risk is highest in the second trimester, it resolves by the end of pregnancy. Redelmeier said he believes it might be because the physical changes become obvious by the third trimester and pregnant women are surrounded by family and friends urging them to be more cautious.\n“In that second trimester, women are feeling really good. It contributes to that false sense of security,” he said. “They’re rushing around to get things done before the baby comes.”\nThe study doesn’t mean women should stop driving during pregnancy. Even at their worst, they’re still better drivers than men of the same age, he noted.\n“On the contrary, we’re saying that individuals need to start driving more carefully,” Redelmeier said. “We shouldn’t be complacent. We all share the road.”","url":"https://www.nbcnews.com/health/womens-health/driving-while-pregnant-car-crashes-more-likely-study-finds-n103176"}
