{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 03:51:20","date_modify":"2018-10-23 03:51:20","date_publish":"2017-03-10 13:50:57","description":"A driver in China was fined after trying to pass off his Chinese made car as a Porsche. Police stopped the man on March 7 after noticing the vehicle looked a little strange.","filename":"data/vaneerConsumption/DrivertriestopassoffhisChinesecarasaPorsche.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22F80900000578-0-image-a-6_1489153252168.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301064_Driver-tries-pass-Chinese-car-Porsche_1540266680.html","title":"Driver tries to pass off his Chinese car as a Porsche","title_page":"Driver tries to pass off his Chinese car as a Porsche | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A driver in China has been fined by police for trying to pass off his car as a luxury Porsche.\nThe man spent just 200 yuan (£23) modifying his Chinese made vehicle to try and pass it off as a high-end Porsche Macan S model.\nThe driver was fined 500 yuan (£59.47) on March 7 for modifying the car so that it did not match the model registered.\nMore than it seems: Police spotted the man driving a strange looking vehicle on March 7\nCosts a bit more money: The real car is worth some 698,000 yuan (£83,000) in China\nHard work: The man even added detail to the wheels to make it look like a luxury car\nThe man was stopped by police in Liuyang, China's Hunan province on March 7.\nPolice told The Paper that when they saw the car, they got the impression that the body looked a bit strange.\nThey asked the driver surnamed Wu for his driving licence and permit but he said he was unable to provide it and claimed the vehicle was borrowed.\nPolice ran the registration number through the system and found that the number corresponds to a Chinese made model Zhongtai SR9.\nThe man spent 200 yuan (£23) on modifying his Chinese-made car to look like a Porsche\nDifferent: The man's attempts look very different to that of the real model (pictured)\nWu was the licence owner of this car. However his driving licence only allows him to drive motorcycles and not a car.\nHe later admitted that the car cost 100,000 yuan (£11.895) and he then spent 200 yuan (£23) on modifying the vehicle to make it look like the Porsche Macan S model.\nThe price of a Porsche Macan S in China is 698,000 yuan (£83,000).\nWu told police that he never suspected that the modifications were illegal.\nHe was detained by police and handed a fine of 500 yuan (£59) and was told to restore the vehicle.","url":"https://www.dailymail.co.uk/news/article-4301064/Driver-tries-pass-Chinese-car-Porsche.html"}
