{"authors":["Belinda Grant Geary For Daily Mail Australia"],"date_download":"2018-10-23 01:24:22","date_modify":"2018-10-23 01:24:22","date_publish":"2016-01-11 12:25:27","description":"Parents demand more rights for unborn children after a drunk and drug affected driver slammed into a family causing a pregnant woman to lose her child while he walked free with only a $950 fine.","filename":"data/vaneerConsumption/Driverwhowasdrinkanddrugaffectedavoidsjaildespiteunbornbabygirlbeingkilled.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A1B8600000578-0-image-a-116_1452515026489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393644_Driver-drink-drug-affected-avoids-jail-despite-unborn-baby-girl-killed-crashed-speeding-car-pregnant-mother-s-vehicle_1540257862.html","title":"Driver who was drink and drug affected avoids jail despite unborn baby girl being killed","title_page":"Driver who was drink and drug affected avoids jail despite unborn baby girl being killed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A drink and drug affected driver whose speeding car slammed into a family causing a pregnant mother to lose her unborn child has walked free with only a $950, as the outraged parents demand more rights for babies in utero.\nOnly days before Sophie Ella Milosevic was meant to be held for the first time by her parents Sarah and Peter, the couple were struck by a speeding driver in Marsden, south-east of Brisbane.\nRodney Leigh Shaw was under the influence of drugs and alcohol when he hit the couple's car at speed on August 29, 2014, as Mr Milosevic was making a right hand turn into Second Avenue.\nScroll down for video\nSarah and Peter Milosevic have petitioned the government to recognise unborn babies more than 30 weeks old as human beings after the drunk and drug affected driver who hit them was let off without jail time\n'He sent us spinning in the opposite direction to where we were,' Mrs Milosevic told A Current Affair.\n'I remember sitting in the car and going 'she is gone',' she added.\nThe distressed couple's 10-year-old son and 18-month-old daughter, who were travelling in the back of the family car, made it out of the accident with minor injuries, however Sophie was not so lucky.\nAs Mr Milosevic recovered from a broken neck and Mrs Milosevic nursed broken ribs and a brain injury, Sophie was delivered a still birth and the devastated couple handed her tiny body over to the coroner.\nRodney Leigh Shaw was convicted of speeding and driving while under the influence of alcohol at Beenleigh's Southern Districts Magistrates Court where he received a 'pathetic' $950 fine and five-month driving suspension\n'He sent us spinning in the opposite direction to where we were,' Mrs Milosevic said\nThe car was left a mangled wreck while Mrs Milosevic was taken to hospital where she delivered Sophie still born\nAfter the tragic accident, Mrs Milosevic nursed broken ribs and a brain injury in hospital\nShe was left bruised and battered after Shaw's car ploughed into the front passenger side of the car\nShaw was convicted of speeding and driving while under the influence of alcohol at Beenleigh's Southern Districts Magistrates Court where he received a 'pathetic' $950 fine and five-month driving suspension, the Courier Mail reported.\nAccording to A Current Affair, this was not Shaw's first offence. The father-of-one has reportedly been fined on 11 occasions for speeding and once before for drink driving.\nFeeling 'let down by the courts', Ms Milosevic created a petition on Change.org in a bid to give Sophie, and other unborn babies who are killed due to the direct actions of another, a 'voice' by changing legislation that dictates the rights of unborn children, which they called Sophie's Law.\n'Instead of bringing my baby girl home I had to plan her funeral. And now the man responsible gets away with it because she was stillborn and has no rights in a court of law,' she wrote.\n'I want that law changed.'\nCurrently in Queensland a person is responsible for the death of an unborn child if the baby is killed after a pregnant woman is 'unlawfully assaulted'.\nBut Mrs Milosevic said this does not cover babies who die and are still born as a result of a road accident.\nMr and Mrs Milosevic admitted that they felt 'let down by the courts' after learning of Shaw's fate\n'Instead of bringing my baby girl home I had to plan her funeral. And now the man responsible gets away with it because she was stillborn and has no rights in a court of law,' she wrote\nCurrently in Queensland a person is responsible for the death of an unborn child if the baby is killed after a pregnant woman is 'unlawfully assaulted'\nBut Mrs Milosevic said this does not cover babies who die and are still born as a result of a road accident\nThe petition, aimed at Queensland's Attorney General Yvette D'Ath, has attracted more than 50,000 signatures, with many leaving messages of support for the grieving couple, who are unable to work and now rely on Centrelink payments to support their family.\n'All babies must have the same rights inside the womb as those outside the womb. The laws need to be changed,' one woman wrote.\n'He who is responsible for the loss of some ones life should be held accountable! This poor baby girl and many other unborn babies robbed of life because of there pathetic choices. This mother and father have lost more then he will ever know and he should be the one hurting... not them!' wrote another.\nDespite a criminal conviction, Shaw has maintained that he did nothing wrong, even shifting blame to Mr Milosevic, who was driving the family car at the time of the accident.\nThis was not Shaw's first driving offence. The father-of-one has reportedly been fined on 11 occasions for speeding and once before for drink driving.\nDespite a criminal conviction, Shaw has maintained that he did nothing wrong, even shifting blame to Mr Milosevic, who was driving the family car at the time of the accident\n'They didn't apologise to me. I nearly died… Peter's actions caused the accident,' Shaw told A Current Affair.\nMr Milosevic said he will never be able to get over the loss of his baby daughter's life or the careless accident that caused it.","url":"https://www.dailymail.co.uk/news/article-3393644/Driver-drink-drug-affected-avoids-jail-despite-unborn-baby-girl-killed-crashed-speeding-car-pregnant-mother-s-vehicle.html"}
