{"authors":["Cheyenne Macdonald For Dailymail.Com"],"date_download":"2018-10-23 04:17:38","date_modify":"2018-10-23 04:17:38","date_publish":"2016-01-28 20:06:02","description":"Drones, take your mark; the Drone Racing League is putting custom quadcopters head-to-head in the first professional race series of its kind. The season kicks off at Miami Lights Sun Life Stadium.","filename":"data/vaneerConsumption/DRONEracingishereFirstprofessionalleaguelauncheswithpilotsseeinglivefeedfromtheircraftusingspecialgoggles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD255C00000578-0-image-a-23_1454011550498.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421348_DRONE-racing-professional-league-launches-pilots-seeing-live-feed-craft-using-special-goggles_1540268258.html","title":"DRONE racing is here: First professional league launches with pilots seeing live feed from their craft using special goggles","title_page":"DRONE racing is here: First professional league launches with pilots seeing live feed from their craft using special goggles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Drones, take your mark; the Drone Racing League is putting custom quadcopters head-to-head in the first professional race series of its kind.\nAnd, with live-streaming video goggles, pilots will be transported right into the cockpit for a first-person view.\nDRL’s season-opener will take place on February 22 at the NFL Miami Lights Sun Life Stadium, where the drones will compete to make it through the three-dimensional race course.\nScroll down for video\nDrones, take your mark; the Drone Racing League is putting custom quadcopters head-to-head in the first professional race series of its kind. The season kicks off at Miami Lights Sun Life Stadium.\nThe February opener will kick off the first of many events leading to the crowning of the World’s Best Drone Pilot.\nFor the 2016 races, the Drone Racing League is using the DRL Racer2, a custom drone that can travel at speeds up to 120 miles-per-hour, and has a camera mounted to the front.\nEach race is made up of three events: qualifying, semifinals, and finals.\nWithin these rounds, the pilots will have to fly their drones through multiple heats of a complex course.\nThe races take place in large venues, like a football stadium or abandoned building.\nThese courses feature narrow halls and tunnels, sharp turns, and multi-level paths, requiring the drone to go up and down stairs and pass through gates.\nIn order to successfully complete a race, the pilots must fly their drones through each gate and checkpoint.\nMissing the checkpoint or crashing will result in disqualification.\nPoints are tallied based on the checkpoints and the finish time.\nAt the end of the season, those with the most points accrued will compete in the world championship.\nFLYING THE DRONE RACING LEAGUE'S RACER2 QUADCOPTER As the League points out, getting accustomed to flying a drone with a first-person view of high speeds and aerobatic manoeuvres can be a ‘disorienting experience.’ The perspective allows pilots to feel as though they’re actually flying In order to fly, the pilot needs a drone, a controller, and a pair of FPV goggles. The drones for the 2016 season are the DRL Racer2 quadcopters, which are small and fast and are custom built for racing. According to the blog, the Racer 2 features a carbon fibre frame to protect the electronics, and has an HD camera mounted on the front. More than 100 LEDs line the drones to identify each pilot with a colour, and allow for optimal visibility. While these drones travel extremely fast, hitting speeds of up to 120 mph, they can also perform abrupt stops and sharp turns. The ‘elite pilots’ have even established their own tricks, using gravity-defying manoeuvres to flip and roll through small spaces. In order to successfully complete a race, the pilots must fly their drones through each gate and checkpoint.\nEach pilot wears a pair of goggles, which displays live video from the camera aboard the drone, and uses a controller to operate the craft. The drones are loaded with more than 100 colour-changing LEDs to differentiate between the pilots. The DRL Racer2, an upgrade from the Racer1 model used in the pre-season flights, is made of light weight carbon fibre, so it can move fast, and endure crashes\nDrones, take your mark; the Drone Racing League is putting custom quadcopters head-to-head in the first professional race series of its kind. And, with live-streaming video goggles, pilots will be transported right into cockpit for a first-person view\nFor the races, the DRL uses FPV – first person view, so the pilots can see the race track as if they were flying through it themselves.\nEach pilot wears a pair of goggles, which displays live video from the camera aboard the drone, and uses a controller to operate the craft.\nThe drones are loaded with more than 100 colour-changing LEDs to differentiate between the pilots.\nThese courses feature narrow halls and tunnels, sharp turns, and multi-level paths, requiring the drone to go up and down stairs and pass through gates. In order to successfully complete a race, the pilots must fly their drones through each gate and checkpoint. Missing the checkpoint or crashing will result in disqualification\nThe DRL Racer2, an upgrade from the Racer1 model used in the pre-season flights, is made of light weight carbon fibre, so it can move fast, and endure crashes.\nAs the League points out, getting accustomed to flying a drone with a first-person view of high speeds and aerobatic manoeuvres can be a ‘disorienting experience.’\nThe perspective allows pilots to feel as though they’re actually flying.\nPilots practice in small communities, according to a DRL blog, including at a club called ‘FPV Addiction,’ on Long Island, NY, to improve their skills and ‘become the drone.’","url":"https://www.dailymail.co.uk/sciencetech/article-3421348/DRONE-racing-professional-league-launches-pilots-seeing-live-feed-craft-using-special-goggles.html"}
