{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:15:49","date_modify":"2018-10-30 21:15:49","date_publish":"2015-06-17 01:01:44","description":"The community of Mountain House, California is set to completely run out of water in just a few days, after the state cut supplies to senior water rights holders last week amid record drought.","filename":"data/vaneerConsumption/DroughtCATownDaysAwayfromRunningOutofWaterafterStateCuts.json","image_url":"https://media.breitbart.com/media/2015/03/california-drought-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_16__1540934149.html","title":"Drought: CA Town Days Away from Running Out of Water after State Cuts","title_page":"Drought: CA Town Days Away from Running Out of Water after State Cuts | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The community of Mountain House, California is set to completely run out of water in just a few days, after the state cut supplies to senior water rights holders last week amid record drought.\nMoutain House’s only source of water, the Byron-Bethany Irrigation District, was among 114 senior rights holders issued curtailment notices last week by the State Water Resources Control Board, California’s top water regulatory body, reports CBS Sacramento affiliate CBS13.\nNow, the community’s 15,000 residents must find a new source of water, and quickly.\n“We’re out there looking for water supplies as we speak,” Mountain House general manager Ed Pattison told CBS. “We have storage tanks, but those are basically just to ensure the correct pressurization of the distribution system. No more than 2 days are in those storage tanks.”\nPattison will reportedly buy a small amount of water to ensure the community doesn’t entirely run out. But, for a long-term fix, Mountain House will have to diversify its water sources, Pattison told the outlet.\nThe cutbacks issued to California’s senior water rights holders were the first since 1977, according to the Board. Roughly 9,000 junior water rights holders had already received curtailment notices for the second consecutive year.\nMountain House is not the only California community to run dry during the state’s devastating four-year-long drought; the small, unincorporated community of Outingdale in El Dorado County has not had any water since May. Outingdale residents have relied on five to six tanker trucks per day, each holding about 6,500 gallons of water, to see it through the water shortage.","url":"https://www.breitbart.com/local/2015/06/16/drought-ca-town-days-away-from-running-out-of-water-after-state-cuts/"}
