{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 22:14:01","date_modify":"2018-10-30 22:14:01","date_publish":"2015-06-22 18:51:46","description":"This Father's Day, dads with boats at Folsom Lake received disappointing news as they were forced to pull their boats from the marina due to low water levels resulting from California's fourth year of drought. Sunday also coincided with the first day of summer. |","filename":"data/vaneerConsumption/DroughtAllBoatsOrderedoutofFolsomLake.json","image_url":"https://media.breitbart.com/media/2015/06/Folsom-Lake-drought-Justin-Sullivan-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_22__1540937641.html","title":"Drought: All Boats Ordered out of Folsom Lake","title_page":"Drought: All Boats Ordered out of Folsom Lake | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This Father’s Day, dads with boats at Folsom Lake received disappointing news as they were forced to pull their boats from the marina due to low water levels resulting from California’s fourth year of drought. Sunday also coincided with the first day of summer.\nThe Marina’s website says the lake is dropping two-thirds of a foot of water a day, which brought its elevation on Sunday to 414 feet. According to Julie Christensen, the assistant manager of the Folsom Lake Marina, that’s just two feet over the elevation where boats can no longer stay docked in the slips. “The boats are still able to launch and the lake is still open for all boating” in addition to use for other water activities such as jet skiing and parasailing, Christensen told Breitbart News.\nThe lack of snow due to the drought has been a direct cause of the low water levels.\nAlthough the lake is still usable, visitors are cautioned to be mindful of rocks due to the shallower water levels.\nThe Fourth of July is one of Folsom Lake’s busiest weekends, and officials anticipate that the water levels will remain above 400 feet. Otherwise, a mandatory five miles-per-hour speed limit will be implemented.\nAccording to Christensen, however, the bureau predicts that the water level will remain above the mandatory 400 feet.\nChristensen says she hopes the lake will remain operational until Labor Day Weekend, which has been the norm in previous years.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook","url":"https://www.breitbart.com/local/2015/06/22/drought-all-boats-ordered-out-of-folsom-lake/"}
