{"authors":["William Bigelow"],"date_download":"2018-10-30 22:13:56","date_modify":"2018-10-30 22:13:56","date_publish":"2015-07-24 16:05:31","description":"The California drought may be hitting the state hard, but wine growers in the Lodi region say this will make their 2015 wines tastier.","filename":"data/vaneerConsumption/DroughtIsGoingtoCreateAmazingWinefor2015Vintage.json","image_url":"https://media.breitbart.com/media/2015/07/vineyard-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_24__1540937636.html","title":"Drought Is Going to Create Amazing Wine for 2015 Vintage","title_page":"Drought Is Going to Create Amazing Wine for 2015 Vintage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The California drought may be hitting the state hard, but wine growers in the Lodi region say that the paucity of water will make their 2015 wines tastier.\nSunny Vasisht of the Weibel Family Vineyards Tasting Room said, “The 2015 grapes are looking good,” adding that the water shortage helps concentrate the flavorfulness of the wine. He said, “So you’re going to get a lot more flavor coming through. The yields may not be as high, but the quality is definitely going to be impacted on the better side, for the betterment of the product as well.”\nVice President of Operations for Mohr-Fry Ranches Bruce Fry told FOX40 that the grapes in his family’s vineyard seem to be ripening earlier this year. He explained that many of the region’s vineyards irrigate their vines with well water from an underground drip system.\nFry added, “We have to be careful what we’re doing, how we’re irrigating. But we’re not in as dire straights as our farmer friends to the south. … So when you taste a bottle of wine in 2015, you can kind of taste what the weather was like that year, and how the growing conditions were in the flavors. So far, the season’s going to be a good one.”\nThe vineyards prosper when rain is not consistent, but rather hits hard periodically.\nA storm bringing 2.29 inches to the Lodi region in early February may have helped the wine growers; in January, when California’s drought was discussed at the 21st annual Unified Wine and Grape Symposium, Camron King, executive director of the Lodi Winegrape Commission, said:","url":"https://www.breitbart.com/local/2015/07/24/drought-is-going-to-create-amazing-wine-for-2015-vintage/"}
