{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 22:15:55","date_modify":"2018-10-30 22:15:55","date_publish":"2016-03-27 13:44:51","description":"The Federal Bureau of Reclamation accelerated water releases from Lake Shasta earlier this month from 5,000 to 20,000 cubic feet per second despite drought.","filename":"data/vaneerConsumption/DroughtAnotherCaliforniaDamReleasesWater.json","image_url":"https://media.breitbart.com/media/2016/03/Folsom-Lake-spillway-Joel-Pollak-Breitbart-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_03_27__1540937755.html","title":"Drought: Another California Dam Releases Water","title_page":"Drought: Another California Dam Releases Water | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Federal Bureau of Reclamation accelerated water releases from Lake Shasta earlier this month from 5,000 to 20,000 cubic feet per second over concerns that the reservoir could overflow, the Los Angeles Times reports.\nEarlier in March, the federal government also accelerated releases from Folsom Lake (above) to 15,000 cubic feet per second, even though the reservoir was not yet full. Authorities were concerned that further increases in the lake’s volume would have posed a risk of flooding as the spring snow melt begins in the Sierra Nevada mountain range.\nThe California drought continues, especially in the southern part of the state, but northern regions of California have experienced a “Miracle March” of precipitation, building on rain and snowfall from earlier in the El Niño-fueled winter. Though some reservoirs remain well below average, others are experiencing above-average water volume and anticipate further inflows as the spring thaw begins in earnest.\nIn a flight over California’s water infrastructure last week, Breitbart News observed different reservoirs at different heights, and the flooding of farmlands near the Sacramento Bypass.\nThe danger is that the strong El Niño could be followed by a dry weather pattern called La Niña, plunging a state that has not yet fully recovered from a historic drought back into an emergency situation.\nDespite the new releases of water from dams in California, farmers are still not receiving their water allocations from the government, owing to competing environmental uses, such as protecting the Delta smelt, an endangered species thought to be at risk from increasingly salty water in the Sacramento-San Joaquin River Delta.\nSen. Dianne Feinstein (D-CA) recently wrote to President Barack Obama, urging him to assist farmers by pumping the water they need. One local farmer who was used in a presidential photo-op in 2014 said he had been misled by the White House, which recently published a drought policy plan that did not mention increasing water allocations.","url":"https://www.breitbart.com/local/2016/03/27/another-full-california-dam-releases-water/"}
