{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:14:38","date_modify":"2018-10-30 21:14:38","date_publish":"2015-06-26 20:59:02","description":"LOS ANGELES - Some California water districts holding senior rights to river water may defy the state's order to stop all water diversions as mass |","filename":"data/vaneerConsumption/DroughtWaterDistrictsConsiderIgnoringOrdersasMassConfusionReignsOverWaterCutbacks.json","image_url":"https://media.breitbart.com/media/2015/03/california-drought-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_26__1540934078.html","title":"Drought: Water Districts Consider Ignoring Orders as 'Mass Confusion' Reigns Over Water Cutbacks","title_page":"Drought: Water Districts Consider Ignoring Orders as 'Mass Confusion' Reigns Over Water Cutbacks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES – Some California water districts holding senior rights to river water may defy the state’s order to stop all water diversions as mass confusion reigns over the nature of curtailment notices sent out by the state’s top water regulators.\nEarlier this month, the State Water Resources Control Board (SWRCB) ordered the curtailment of all water diversions to 114 senior water rights holders in the Delta, San Joaquin and Sacramento River watersheds who have held claims to river water since 1903, and threatened fines of up to $1,000 per day for non-compliance. The move came as the state struggles to conserve water resources during a record four-year drought.\nBut several water districts, including the Patterson, Oakdale, South San Joaquin and Banta Carbona Irrigation Districts, sued the Board, claiming it did not have the legal authority to curtail senior rights holders’ water diversions.\nAt a hearing Tuesday in Stockton, state attorneys said the curtailment notices issued to 114 senior water rights holders were meant to serve as “general courtesy notices.”\n“The notice issued by the state water board is merely a general courtesy notice,” state attorneys said. “Before taking enforcement action, the state water board must conduct an initial analysis of how much water is available under this year’s drought conditions, and which water rights are legally authorized to divert under such conditions.”\n“Until this is done, the state water board cannot make reasoned decisions about which diverters to bring enforcement actions against.”\nThe curtailment notices issued to senior rights holders earlier this month were the first since 1977, according to the Board. Some 9,000 junior water rights holders had already received curtailment notices for a second consecutive year.\nThe cutback orders affected individual senior water rights holders as well as several municipal water districts and state agencies like the Department of Water Resources (DWR) and the California Department of Fish and Wildlife.\nAlso affected was the Byron-Bethany Irrigation District, the sole source of water for the central California town of Mountain House. The community’s 15,000 residents were faced with the prospect of running out of water before a deal was reached Tuesday with the South San Joaquin Irrigation District to keep water flowing.\nIn its initial order, the Board said cuts to other senior water rights holders and farmers in other watersheds “may be imminent” as the state continues to monitor the effects of the drought.\nOakdale Irrigation District general manager Steve Knell called the situation surrounding the Board’s apparent backtracking one of “mass confusion.”\n“We’re living life in a blender at this point,” Knell said in a statement. “The state water board has generated a lot of confusion by its actions. In its court papers, it’s apparent it has changed course.”\nBut David Rose, an attorney for the State Water Board, told the Associated Press that the board had not reversed course, and that senior rights holders found to be illegally diverting water could be hit with steep fines.\nJeff Shields, general manager of the South San Joaquin Irrigation District, called for the Board to unequivocally state its intentions regarding the curtailment notices.\n“The attorney general identified fatal flaws in the SWRCB’s curtailment notices,” Shields said in a statement. “As a result, the appropriate action would be for the SWRCB to rescind the curtailment order or issue a clarification explaining they are only advisory, not compulsory.”\nMeanwhile, some farmers in the water districts affected by the curtailments are considering ignoring the notices altogether in order to keep their crops alive. Attorney Steve Herum, who represents two of the affected water districts, told the AP that the confusion has reached “the point of reckoning.”\n“I think the farmers and irrigation districts are going to have to take a hard look at the totality and legal consequences of the situation,” Herum said.\nAubrey Bettencourt, executive director of the nonprofit California Water Alliance, said the confusion over the curtailment notices is the latest incident “to undermine the public’s confidence in the powerful but unelected and appointed board’s decisions.”\n“A thorough investigation, new review, corrective actions, remediation of errors and complete transparency is long overdue,” Bettencourt said.","url":"https://www.breitbart.com/local/2015/06/26/drought-water-districts-consider-ignoring-orders-as-mass-confusion-reigns-over-water-cutbacks/"}
