{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:31:53","date_modify":"2018-10-30 19:31:53","date_publish":"2016-03-08 22:02:12","description":"Operators began releasing water from Folsom Dam for the first time in four drought-stricken years after El Niño-fueled storms over the weekend.","filename":"data/vaneerConsumption/DroughtStillOnButFolsomDamOpensFloodgates.json","image_url":"https://media.breitbart.com/media/2016/03/Folsom-Dam-Vince-Flickr-CC-Cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_03_08__1540927913.html","title":"Drought Still On, But Folsom Dam Opens Floodgates","title_page":"Drought Still On, But Folsom Dam Opens Floodgates | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Operators began releasing water from Folsom Dam for the first time in four years after El Niño-fueled storms dropped billions of gallons of water into California’s largest reservoirs over the weekend.\nWith the state still suffering through record drought, operators at Folsom Dam opened three floodgates on Monday and were expected to open two more on Tuesday, to increase the rate of water release to 15,000 cubic feet per second, according to local NBC affiliate KCRA.\nThe U.S. Bureau of Reclamation announced last month that it would begin releasing water from Folsom Lake to avoid overflow, even though the lake still sits well below its full capacity of 977,000 acre-feet of water.\nStill, expected runoff from heavy winter storms brought on by the current Pacific El Niño could cause the lake to overflow well before the Sierra snowpack peaks in early April.\n“We’ve got to make sure that we have enough space in there to keep downstream safe,” Reclamation spokesman Shane Hunt told KCRA.\nLocal ABC affiliate KXTV posted a video of the open floodgates, as water poured over the face of the dam for the first time since 2012:\nSacramento police were reportedly flying helicopters over the American River on Tuesday, warning those in low-lying and flood-prone areas to move to higher ground.The releases come as powerful rainstorms soaked Northern California last weekend, adding billions of gallons of water to the state’s most critical reservoirs. According to the San Jose Mercury News, the state’s 46 largest reservoirs collectively added 391 billion gallons of water to their totals, which the paper notes is enough water to serve 6 million people for one year.\nDespite the massive deluge, California will need a lot more rain if it is to weather what has been a punishing four-year-long drought. The water content level in the Sierra Nevada snowpack measured just 83 percent of average on Tuesday; that number must reach all the way up to 150 percent of average by April 1 to make a dent in the drought, according to state water experts.\nThe state has also fallen behind in meeting Gov. Jerry Brown’s mandatory 25 percent water use reduction order. Californians cut water use by just 17.1 percent in January, the lowest rate since record-keeping began in June. A particularly dry, hot February — one of the hottest Februaries in state history — has also hurt drought relief efforts.\nStill, forecasters predict more rain for later this week. According to the Mercury News, a storm developing over the Bay Area could deliver up to two inches of rain to the region through Thursday and Friday.","url":"https://www.breitbart.com/local/2016/03/08/water-let-out-of-folsom-dam-as-storms-dump-billions-of-gallons-of-water-into-ca-reservoirs/"}
