{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 22:13:55","date_modify":"2018-10-30 22:13:55","date_publish":"2015-06-15 19:15:11","description":"Fire season has arrived early in California, and the crippling drought has helped an unlikely culprit--lawnmowers--start several blazes in Sacramento, which could have rendered one home a complete loss. |","filename":"data/vaneerConsumption/DroughtLawnmowersSparkTwoSummerFiresinCalifornia.json","image_url":"https://media.breitbart.com/media/2015/06/Lawnmower-fire-Frank-Boston-Flickr-CC-Cropped.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_15__1540937635.html","title":"Drought: Lawnmowers Spark Two Summer Fires in California","title_page":"Drought: Lawnmowers Spark Two Summer Fires in California | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Fire season has arrived early in California, and the crippling drought has helped an unlikely culprit–lawnmowers–start several blazes in Sacramento, which could have rendered one home a complete loss.\nTwo otherwise easily preventable fires were started by sparks from lawnmowers that were used during the hottest times of the day. Due to the drought, there was limited access to water in the areas, which made it more difficult to put out the flames.\nAccording to Sacramento NBC News affiliate in KCRA, the first lawn mowing-related fire took place in Rio Linda just after 2:30, and the other, in Citrus Heights, was sparked just after 1:30. A neighbor was able to use a hose on their own property to help stall the fire until firefighters arrived on scene.\nVideo from this afternoon’s grass fire on U street in Rio Linda. Cause: mowing. Approx 2ac burned, no homes dmg. pic.twitter.com/ZOgUd82E6o — MetroFire Sacramento (@metrofirepio) June 13, 2015\nFirefighters told KCRA that homeowners should mow their lawns in earlier, cooler hours of the day where heat from the sun and the lawn mower don’t spark flames. They also placed emphasis on lawn upkeep and maintenance, suggesting that another factor for these fires is weeds are being allowed to grow out of control, which makes it easier for the flames to spread at a faster rate.\nPhoto: File\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/local/2015/06/15/drought-lawnmowers-spark-two-summer-fires-in-california/"}
