{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:33:14","date_modify":"2018-10-30 19:33:14","date_publish":"2015-05-21 17:38:59","description":"Select farmers in the Sacramento and San Joaquin River Delta have offered to give up one quarter of their allotted water supply this year to help |","filename":"data/vaneerConsumption/DroughtFarmersOffer25ofWaterinExchangeforNoFutureCuts.json","image_url":"https://media.breitbart.com/media/2015/05/San-Joaquin-C09.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_21__1540927994.html","title":"Drought: Farmers Offer 25% of Water in Exchange for No Future Cuts","title_page":"Drought: Farmers Offer 25% of Water in Exchange for No Future Cuts | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Select farmers in the Sacramento and San Joaquin River Delta have offered to give up one quarter of their allotted water supply this year to help California combat its devastating four-year-long drought.\nThe farmers, who hold senior water rights to river water, want a guarantee from state water officials that the state won’t restrict the remaining 75% of the water that they are entitled to regardless of whether the drought intensifies or not, according to the Associated Press.\nThe offer comes as the state reportedly prepares to order water cutbacks from California’s most senior water rights holders, who have had access to river water for irrigating their farms for more than 100 years. The farmers hope that by offering a concession to state water officials, they can escape the stiffer restrictions that have been placed on junior water rights holders. Agricultural interests have so far been exempted from the state’s mandatory 25% statewide cutback, which applies only to California’s 400 urban water districts.\nState Water Resources Control Board director Tom Howard told the AP that the Board is seriously considering the offer, and will have a decision by Friday.\n“Should we make an offer like that early, to give people clarity and regulatory certainty, or is there not enough water to really make a difference?” Howard said. “We’re just trying to make sure if the offer makes sense.”\nCalifornia’s complex water rights system has been criticized for causing dysfunction in California’s water management. “Senior” water rights date back to the late 1800s, to the Gold Rush Era, when those who got to the river first claimed the right to use its water for irrigation. However, the system is plagued by mismanagement, with many rivers being over-allocated. Additionally, because water usage numbers rely on self-reporting, it is not clear exactly how much water senior rights holders draw from the state’s rivers.\nThe state cannot legally cut senior water rights holders’ allotments. Jonas Minton, a water policy adviser and former deputy director of the California Department of Water Resources, told the AP that the farmers’ offer is fair because a 25% cut is in line with what urban users have been ordered to cut.\n“Overall, if agriculture in California reduces its use by 25 percent, the state will weather this bad weather,” Minton told the AP. “It’s heartening to see that some agricultural water users are willing to do their share.”\nFarmers have been criticized for overdrawing water from underground water wells, leading to subsidence and sinking ground levels in California’s Central Valley.","url":"https://www.breitbart.com/local/2015/05/21/drought-farmers-offer-25-of-water-in-exchange-for-no-future-cuts/"}
