{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 01:00:08","date_modify":"2018-10-23 01:00:08","date_publish":"2017-03-10 08:31:48","description":"Katherine Salcedo, 36, from Fort Worth, Texas was so addicted to Dr Pepper people thought she was pregnant due to her 17 stone frame, but now she's been left with loose skin after shedding weight.","filename":"data/vaneerConsumption/DrPepperaddictmistakenforbeingpregnantlosesweight.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21930000000578-0-image-a-34_1489133757447.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300272_People-thought-obese-Dr-Pepper-addict-pregnant_1540256408.html","title":"Dr Pepper addict mistaken for being pregnant loses weight","title_page":"Dr Pepper addict mistaken for being pregnant loses weight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman with a secret addiction to sugary pop Dr Pepper confessed that she soared to 238 lbs (17 stone), after guzzling six cans a day – becoming so fat that people thought she was pregnant.\nKatherine Salcedo, 36, from Fort Worth, Texas loved the calorie-laden drink so much she'd keep a 330ml can by her bed and a 12 pack constantly in her fridge.\nShe's managed to slim down through dieting and weight loss surgery, and now weighs a healthy 135 lbs (nine-and-a-half stone).\nBut now she's desperate to raise $30,000 for surgery to remove loose skin on her stomach that means she still looks like she's about to give birth.\nDr Pepper addict Katherine Salcedo, 36, from Fort Worth, Texas, weighing 189lbs, in March 2015, before she went in to have her gastric sleeve operation\nKatherine, here weighing around 135lbs, in November 2016 after she lost almost half her body weight\nOn waking, before even going to the toilet or brushing her teeth, she'd neck her Dr Pepper, cherishing the sugar boost and sweet taste.\nAfter that, she'd have a further three cans throughout the day. In total she'd guzzle 14 litres of the drink each week.\n'People would say Dr Pepper was misunderstood, but in reality I was,' she said. 'I was constantly mistaken for being pregnant.'\nIt wasn't just Dr Pepper – which contains 96 calories a can and 24 grams of sugar per 330ml - which made Katherine's weight balloon.\nKatherine has been left with excess skin on her stomach after her dramatic weight loss and is fundraising for surgery to remove it\nKatherine, pictured weighing around 235lbs, dressed as a gangster for Halloween 2009\nKatherine, in April 2015, after having her gastric sleeve operation\nKatherine, weighing around 235lbs, lived on a diet of fried chicken, burgers and chips. Here she is at her son Damian's first birthday\nShe also gorged on a daily cheese burger, with large chips from McDonald's, totalling 745 calories a go.\nNo morning was complete without a visit to her local drive-thru.\nEvery day, she would also drive four miles to other fast food restaurants and splash out up to $30 (£25) a day on high-calorie food.\n'I'd scoff fried chicken,' she said, confessing that she would happily consume 4,000 calories daily.\nAfter slimming down through a healthy diet, Katherine decided to have a gastric sleeve operation to lose more weight\nOn an average day, for lunch, she'd guzzle a Subway foot-long sandwich and a large bag of crisps– always accompanied by her beloved Dr Pepper.\nWorking as a supervisor for a sleep clinic, Katherine realised her waistline was bulging, while her bank account was shrinking.\nShe has always been big, but her terrible diet saw her hit 238 lbs (17 stone) aged 27.\nJust 5ft 3ins tall, she wore size 22 (UK size 26) and had to buy her clothes from a plus size section.\nKatherine with her husband Carlos in late January 2017\nKatherine was so addicted to the fizzy drink, Dr Pepper, that her weight ballooned so much, people thought she was pregnant. Here she is pictured weighing around 235lbs\n'It was a nightmare getting anything to fit. Because my middle was so big, clothes would fit my legs and arms but would be so tight and uncomfortable around my belly.'\nHer hefty bulk also started impacting on her health.\nShe said: 'In 2007 I was diagnosed with Type 2 diabetes, because of my weight. I was constantly sweaty and jittery all the time. I felt so nauseous when my blood sugar plummeted.\n'My blood pressure was high, too. It really wasn't good.'\nKatherine with her sons (left to right) Damian and Adrian, pictured here on 4 July 2016\nKatherine, here weighing 135lbs, dressed as Alice In Wonderland for Halloween 2016\nBut her turning point came one day when she was 28, when someone asked 'when are you due?', assuming her Dr Pepper belly was a baby.\n'I was so embarrassed. I tried to brush it off, but something needed to change.'\nKatherine, who has two sons, Damian, eight, and Adrian, five, was determined to slim down – losing more than 50 lbs (four stone) in a year and learning how to cook delicious meals from scratch.\nKatherine (left) aged about 14, with her gran, Casi, and sister, Shirley\nKatherine after having her gastric sleeve operation, but feeling bloated\nBy the age of 30 - 12 months after revamping her diet and eating salads, protein shakes and fresh vegetables, and doing power-walking and work-out games at home - she weighed 182 lbs (13 stone) and was wearing size 18 clothes (UK size 22).\nStill eager to lose more weight, in April 2015 Katherine had an $9,700 (£8,000) gastric sleeve operation at Texas General Hospital.\nKatherine and her construction worker husband Carlos, 38, financed the operation, which entailed removing part of her stomach leaving a thin vertical sleeve, with a loan.\nKatherine, pictured here pregnant with her son Adrian, in 2011\nKatherine was so addicted to the fizzy drink, Dr Pepper, that her weight ballooned so much, people thought she was pregnant. Here she is pictured in her early 20s with Carlos\nKatherine, weighing around 200lbs, before she had her gastric sleeve operation\nUnder the knife for two hours, she emerged with a stomach half the size.\nUnable to eat full portions, in six months her weight plummeted from 182 lbs (13 stone) to 135 lbs (nine and a half stone) and she could wear slinky size 6 (UK size 10) clothes.\nUnfortunately, though, her rapid weight loss left her with a curtain of excess skin.\nNo amount of exercise or healthy eating can shift it, making surgery to slice it off, costing $30,000 (£25,000), the only solution – but it is money she can't afford.\nKatherine on the day of her gastric sleeve operation, 1 April 2015\nKatherine, here weighing around 189lbs, in February 2015 (left) and after her dramatic weight, in March 2016 (right)\nKatherine, here weighing 134lbs, with her husband Carlos at her niece's graduation, June 2016\n'We don't want to be in more debt, so need to find another way to get the money. 'It's feels so horrible and is so hard to wear nice clothes because of it.\n'I want to feel comfortable, but I still have all this excess skin and lots of rashes where it rubs against my clothes.'\nDesperate for help, so she can finally feel good about herself and be in better shape to look after her kids, Katherine is now appealing for people to help her pay for the surgery.\nKatherine, pictured here weighing 235lbs, at 23. People used to think the mother-of-two was constantly pregnant\nThe mother-of-two was addicted to fast food as well as Dr Pepper, and would drive four miles a day to get her favourite fried chicken\nKatherine would keep cans of Dr Pepper by her bed and drink it as soon as she woke up in the morning\nKatherine with her son Damian, then a toddler, in 2011\n'I wasn't greedy, I had a sugar addiction which took over my life.\n'I have worked so hard to lose the weight, now I feel I could go either way and become a new person with this transformation.\n'I want to be able to play sports with my children and not have anything flapping about in the wind.'","url":"https://www.dailymail.co.uk/femail/article-4300272/People-thought-obese-Dr-Pepper-addict-pregnant.html"}
