{"authors":["John Hayward"],"date_download":"2018-10-30 20:14:37","date_modify":"2018-10-30 20:14:37","date_publish":"2017-01-03 16:05:14","description":"Dr. Sebastian Gorka discussed with Breitbart News Daily on Tuesday the New Year’s Eve slaughter at the Reina nightclub in Istanbul.","filename":"data/vaneerConsumption/DrSebastianGorkaHashtagsandSocialMediaMemesShowNationalSecurityHasNotBeenTakenSeriouslyforEightYears.json","image_url":"https://media.breitbart.com/media/2015/04/michelle-obama-bring-back-our-girls-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2017_01_03__1540930477.html","title":"Dr. Sebastian Gorka: Hashtags and Social Media Memes Show ‘National Security Has Not Been Taken Seriously for Eight Years’","title_page":"Dr. Sebastian Gorka: Hashtags and Social Media Memes Show ‘National Security Has Not Been Taken Seriously for Eight Years’","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday’s Breitbart News Daily, SiriusXM host Raheem Kassam and Breitbart News National Security editor Dr. Sebastian Gorka discussed the New Year’s Eve slaughter at the Reina nightclub in Istanbul.\n“The latest is, this club – which it’s being misreported: It’s not really a ‘nightclub.’ It’s actually a restaurant. So it’s open during the day. Very popular with tourists,” Gorka observed. “Big attack – the latest developments are that there have been multiple arrests.”\n“The bad news is, despite it clearly being some kind of broader conspiracy, not some one-off individual, the individual who was the perpetrator of this mass murder has not yet been caught,” he said, adding that photographs of the individual taken during the attack are beginning to circulate.\nGorka noted that the Islamic State has claimed responsibility for the attack.\n“It’s quite often the case that it takes a long time for the jihadis, especially al-Qaeda, to accept responsibility, even in the case of 9/11,” he pointed out. “ISIS is a little bit different. So yes, we have a claim of responsibility, so it’s probably not somebody who was disaffected, uneducated, and unemployed.”\nHe added there has been no indication that the Kurdish separatists of the PKK organization, which has carried out numerous attacks in Turkey, were responsible for the Istanbul nightclub shooting.\n“ISIS wants to destroy Western civilization, but they are very clearly targeting Turkey,” Gorka said. “Ironically, the last version of the ‘Caliphate’ was the Ottoman Empire, but ISIS sees the Turks today as apostates, not good Muslims. They actually had an issue of their magazine Dabiq dedicated to, quote-unquote, ‘recapturing Constantinople.’ So for them, this is as much a target as any other Western nation, ironically.”\nKassam brought up the practice of expressing solidarity for the victims of terrorist atrocities by using their national flags in social-media profiles, noting there doesn’t appear to be many Turkish flags fluttering on Facebook and Twitter after the Istanbul massacre. Gorka denounced the entire practice as shallow sentimentalism that trivializes real security concerns.\n“I don’t care whether it’s in France or whether it’s in Istanbul, I reject this,” he said. “This is the snowflake generation response to something. I’m not interested in seeing somebody’s profile picture change. It’s like hashtag ‘Bring Our Girls Back’ from Chibok, Nigeria. That worked really well, didn’t it?”\nKassem threw out the #Kony2012 social media campaign, a wholly ineffectual and long-forgotten “viral sensation” that sought to raise awareness of African warlord Joseph Kony’s use of child soldiers, as another example.\n“Is our natural security just being meme-ified, Dr. Gorka?” Kassam asked.\n“I think this is one of the reasons Mr. Trump won in the election,” Gorka replied. “National security has not been taken seriously in at least eight years. People are concerned. Look at San Bernardino. Look at Orlando. The fact is, the border wall isn’t just about jobs and immigration; it’s about national security.”\n“I think people are fed up. They understand that education, economics – none of that is worth anything unless you’re safe first,” he said.\nDr. Sebastian Gorka is the author of the best-selling book Defeating Jihad: The Winnable War.\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/radio/2017/01/03/gorka-hashtags-social-media-memes-show-national-security-not-taken-seriously-eight-years/"}
