{"authors":["Emma Glanfield For Mailonline"],"date_download":"2018-10-23 00:43:55","date_modify":"2018-10-23 00:43:55","date_publish":"2016-01-28 14:47:56","description":"Dr Susan Lim Mey Lee, who is based in Singapore but a member of the General Medical Council in London, faces being struck off for charging the Queen of Brunei's sister £12million for treatment.","filename":"data/vaneerConsumption/DrSusanLeewhocharged12mforbreastcancertreatmenttobestruckoff.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB1A6700000578-0-image-a-35_1453993159944.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421059_Top-doctor-performed-world-s-liver-transplant-faces-struck-charging-Queen-Brunei-s-sister-12million-breast-cancer-treatment_1540255435.html","title":"Dr Susan Lee who charged £12m for breast cancer treatment to be struck off","title_page":"Dr Susan Lee who charged £12m for breast cancer treatment to be struck off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A leading surgeon who performed the world's first liver transplant faces being struck off for allegedly charging the Queen of Brunei's sister £12million for breast cancer treatment.\nDr Susan Lim Mey Lee, who is based in Singapore but a member of the General Medical Council (GMC) in London, is an expert in robotic-assisted surgery and stem cell research and performed the world's first successful liver transplant in 1990.\nHowever, despite being held in high regard, she now faces losing her ability to practise after the GMC launched an inquiry into the 'grossly excessive fees' she charged to the Brunei royal family.\nDr Susan Lim Mey Lee (right), who is based in Singapore but a member of the GMC in London, faces being struck off for charging the Queen of Brunei's sister £12m for breast cancer treatment over a six-month period. She was found guilty on misconduct in Singapore and faces a probe in Britain. Left: The Queen of Brunei\nAn investigation into Dr Lee was launched by the Singapore Medical Council (SMC) in 2012.\nShe was accused of charging £12million ($24m Singapore dollars) for coordinating the treatment of the Queen of Brunei's sister over a six-month period in 2007.\nThe SMC found her guilty of 94 counts and suspended her from practising for three years for her 'particularly serious' misconduct.\nShe was also fined £5,000 ($10,000) and ordered to promise that she would charge fair and reasonable fees in future.\nThe Singapore High Court rejected an appeal which she lodged in 2013, describing the 'opportunistic and arbitrary' fees charged as 'grossly excessive'.\nThat prompted a letter to the GMC in London from its counterpart in Singapore, alerting it to the findings against Dr Lee.\nThe GMC's fitness to practise panel is now investigating the case and has the power to strike off Dr Lee if she is found guilty.\nDr Lee faces losing her ability to practise after the GMC in London (headquarters pictured) launched an inquiry into the 'grossly excessive fees' she charged to the Brunei royal family while working in Singapore in 2007\nDr Lee fought to block the investigation at London's High Court, insisting that the alleged misconduct dated back to 2007 and that it was now too late to take action against her.\nShe said her GMC membership was 'effectively honorary' and she had not realised she was obliged to keep the body informed about the disciplinary case in Singapore.\nDismissing her challenge, however, Mr Justice Haddon-Cave said Dr Lee was duty-bound to notify the GMC in London of the SMC's findings against her.\nThe five-year time limit applied under GMC rules began when the SMC found her guilty of misconduct, he added.","url":"https://www.dailymail.co.uk/news/article-3421059/Top-doctor-performed-world-s-liver-transplant-faces-struck-charging-Queen-Brunei-s-sister-12million-breast-cancer-treatment.html"}
