{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 00:45:36","date_modify":"2018-10-23 00:45:36","date_publish":"2017-04-26 10:35:56","description":"Dean Grundell, 44, of West Yorkshire, who was previously spared jail so he could try to tackle his drug addiction on the Jeremy Kyle Show, was sentenced to 26 weeks in prison for theft.","filename":"data/vaneerConsumption/Drugaddictshoplifterjailedafterthreateningreporter.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9ED2D000000578-0-image-a-36_1493200026916.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446728_Drug-addict-shoplifter-jailed-threatening-reporter_1540255536.html","title":"Drug-addict shoplifter jailed after threatening reporter","title_page":"Drug-addict shoplifter jailed after threatening reporter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dean Grundell, left with an unidentified man, was jailed after making threats towards a female reporter during a hearing at Kirklees Magistrates' Court\nA drug-taking serial shoplifter who was spared jail to go on the Jeremy Kyle show has been locked up after making threats towards a female reporter.\nDean Grundell, 44, was held in contempt of court after taking issue with the press being present at his hearing in West Yorkshire.\nHe made 'direct threats' towards the press box immediately after being brought from the cells into a courtroom at Kirklees Magistrates' Court.\nGrundell, of Dalton, West Yorkshire, - who has 154 offences to his name - hurled personal abuse towards the female reporter and shouted: 'You little b***h, I'm coming for you - I don't care if I get 10 or 20 years.'\nMagistrates found him in contempt 'due to his aggressive behaviour towards the press' and had him removed from the courtroom for the remainder of the proceedings.\nHe was jailed for a total of 26 weeks for theft, breaching his community order and failing to attend court previously.\nIt came after Grundell was handed a suspended sentence in February after begging magistrates to give him a chance to get clean on the ITV show.\nAt the time he was in talks with producers to appear on the daytime programme and said he wanted to go to a rehabilitation facility to quit his drug addiction for good.\nDespite admitting thefts from three Huddersfield shops, magistrates granted him the chance and handed him an 18-week suspended sentence.\nScroll down for video\nGrundell was spared jail after admitting theft earlier this year after magistrates agreed to let him go on The Jeremy Kyle Show, pictured, to seek help for his drug addiction\nHe appeared alongside his mother Christine, right, and was berated by Kyle after 'smirking' at him. The producers arranged for him to enter rehab only for him to quit after one day\nThe following month he appeared in the show's segment 'I'm ashamed of my son - he's a drug taking criminal!'\nKyle criticised him for using the name of his show to get out of jail but Grundell was still offered 84 days in rehab to get clean - an opportunity he quit just 24 hours later.\nEarlier this month magistrates at the Huddersfield court issued a warrant for his arrest when he failed to attend a hearing over allegations he stole alcohol worth £200 from a Morrisons in March.\nGrundell also failed to comply with his court-ordered drug treatment requirement after missing follow up appointments when his urine tested positive for drugs.\nMike Sisson-Pell, mitigating, said that his client had appeared before the courts with 'alarming regularity' since 1998 due to his misuse of class A drugs.\nHe said: 'It's taken its toll on his body and mental health.\nHis mother, 71, told Kyle that her son was 19 and 'fell into the wrong crowd' when he began taking drugs. She added she was 'disgusted' at the way he lives\nGrundell, pictured, was jailed for 26 weeks for theft and breaching the suspended sentence he received in February\n'He's a mess, a skeleton under his clothing with a very nasty wound to his leg as a result of DVT.\n'He is not long for this world if he carries on and his plea to the court today is to send him to prison.\n'He can't hack it out here and (in prison) he's going to do what he needs to do to get himself on the right track.'\nOf his client's outburst in court, Mr Sisson-Pell added: 'I've no doubt he'll reflect on his behaviour in court and be sorry for that - it puts him in a very poor light.'\nMagistrates activated Grundell's suspended sentence order and jailed him for a total of 26 weeks.\nHe was ordered to pay £115 victim surcharge upon his release from custody.","url":"https://www.dailymail.co.uk/news/article-4446728/Drug-addict-shoplifter-jailed-threatening-reporter.html"}
