{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 02:43:44","date_modify":"2018-10-23 02:43:44","date_publish":"2016-01-29 17:24:08","description":"Merchandise featuring the infamous drugs barren has become wildly popular since his recent recapture in Mexico - everything from T-shirts to pinatas are now available to buyers","filename":"data/vaneerConsumption/DruglordsElChaposdaughtertomakemoneyfrommerchandise.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30A4090300000578-0-image-a-96_1454087475914.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423130_Now-s-El-Chapo-trademark-Mexican-drug-lord-s-daughter-sell-merchandise-father-s-brand-given-official-permission_1540262624.html","title":"Drug lord's El Chapo's daughter to make money from merchandise","title_page":"Drug lord's El Chapo's daughter to make money from merchandise | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"El Chapo Guzman's alleged daughter will now be able to sell watches, hats, jewellery and even Christmas decorations with the official El Chapo brand after she was given the trademark for the name by authorities.\nMerchandise featuring the infamous drugs barren has become wildly popular since his recent recapture - everything from T-shirts to pinatas are now available to buyers.\nBut from now on they will need to pay for the right to use the 'El Chapo' brand.\nT-shirts and merchandise featuring El Chapo's image have become wildly popular after the drugs baron's recapture earlier this month\nMore merchandise: Clothing with El Chapo branding are displayed in Mexico City; he was recaptured six months after his spectacular prison break\nAlejandrina Gisselle Guzman Salazar, 32, has successfully registered four trademarks with the Mexican Institute of Industrial Property (IMPI), which will allow the family to sell a variety of goods branded with the cartel leader's nickname.\nEl Chapo Guzman's wife and daughter filed at least 24 applications between 2011 and 2014 to use a variety of the druglord's names including El Chapito, Don Chapo, El Chapo Guzman and Joaquin Archivaldo Guzman Loera - although most of them were rejected.\nIMPI wrote back in its rejection letters that granting any requests which included the name Guzman would be against 'good practice and moral order' to Mexican society who have suffered such harm at the hands of the delinquent.\nStrangely, though, and for no apparent reason, the government have approved four trademarks for the use of plain 'El Chapo.'\nTaken away: El Chapo being taken away by Mexican police officers - he was recaptured in an early morning raid earlier this month\nFor sale: El Chapo may now be in jail but his image lives on with market traders keen to supply shoppers with products themed on the drugs baron\nOne of Alejandrina Guzman's trademarks covers leather, animal skins, whips, umbrellas, walking sticks, and saddlery. Another includes precious metals, gemstones, jewelry, and watches.\nEven more worrying are the remaining two El Chapo trademarks, which include one for toys, games, gym equipment, and festive decorations, while the last allows her to create publicity services and business management offices in his name.\nGuzman, considered by many as the most dangerous criminal leader in the world, is known for his delusions of grandeur and has become a popular character in Mexican culture, gaining celebrity status despite his violent past.\nIt comes after a silk shirt worn by El Chapo during his meeting with Hollywood actor became an unlikely fashion must-have. The clothing firm behind the shirts El Chapo donned for his audience with the American actor took advantage of their headline-making handshake to use the violent narco as a star salesman.\nLos Angeles-based Barabas published the photo of the pair meeting at the Mexican fugitive's jungle hideout on its website under the caption 'Most Wanted' offering customers the chance of a free 'El Chapo' shirt for every Like on Facebook and Instagram.\nThe picture of Penn and the drugs trafficker wasposted on the site alongside another of a male model wearing the same $128 'Fantasy' Men's button down shirt. The shirt sold out almost immediately.","url":"https://www.dailymail.co.uk/news/article-3423130/Now-s-El-Chapo-trademark-Mexican-drug-lord-s-daughter-sell-merchandise-father-s-brand-given-official-permission.html"}
