{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:10:33","date_modify":"2018-10-23 00:10:33","date_publish":"2017-03-16 09:01:06","description":"Adults who regularly used drugs snacked more often and eroded their own teeth, a team of Australian scientists found. While some narcotics caused chemical deterioration when applied to the teeth.","filename":"data/vaneerConsumption/Drugabusershavemoretoothdecaythangeneralpublic.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E43FAD200000578-0-image-a-10_1489654876483.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4312890_Drug-abusers-tooth-decay-general-public_1540253433.html","title":"Drug abusers have more tooth decay than general public","title_page":"Drug abusers have more tooth decay than general public | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Being addicted to drugs causes tooth decay, new research confirms.\nOn average, those with cocaine and cannabis habits had about 3.5 less teeth, the study found.\nAdults who regularly used the latter snacked more often and eroded their own teeth, scientists claim.\nWhile some narcotics - including cocaine - caused chemical deterioration when applied to the teeth or gums.\nOn average, those with cocaine and cannabis habits had about 3.5 less teeth, the study found\nAddicts of both would also clench and grind their teeth, another known risk factor of tooth decay.\nA team of Australian researchers combined the results of 28 previous dental studies from around the world.\nThe study included data of 4,086 patients with known substance use disorders of various drugs.\nWriting in the journal Addiction, the researchers said: 'The use of drugs is increasing by approximately 3 million new users each year.\n'While the global use of amphetamine, cocaine and ecstasy are estimated to have decreased in the past decade, the use of opiods and cannabis is continually rising.\n'These problems should receive greater attention, and there are simple steps that both dental and non-dental personnel can take to improve this population's oral health.'\nThe scientists also found that those with addictions to substances were also less likely to visit the dentist than the general population\nCOCAINE MAKES YOU IMPATIENT Cocaine has long been linked to risky behaviour. But a study last month confirmed the suspicions around the popular street drug when it comes to having sex. Users are less willing to wait for a condom before getting under the sheets with a stranger, Johns Hopkins University scientists discovered. Being 'high' off the stimulant causes people to become impatient - possibly explaining why addicts are more likely to carry an STI.\nThey found those with addiction to substances were also less likely to visit the dentist than the wider population.\nThe lifestyle of drug users often enhanced tooth decay too. This included high sugar diets, malnutrition, poor oral hygiene and lack of regular dental care.\nDentists should screen all patients for drug abuse, the scientists from Queensland, Melbourne and James Cook universities claimed.\nAny patient that has significantly more tooth decay than expected, based on their age, should be referred to doctors, they added.\nThe British Dental Association (BDA) said it wasn't surprising that drug abusers had a greater prevalence of tooth decay and gum disease than the general population.\nA BDA spokesperson said: 'Drug addiction often goes hand in hand with a chaotic lifestyle, poor nutrition and oral hygiene and generally seeing the dentist only when in pain.\n'Unfortunately their dental problems can be exacerbated by a craving for sweet foods and the reduction in saliva as a side effect of the drugs and medication.'","url":"https://www.dailymail.co.uk/health/article-4312890/Drug-abusers-tooth-decay-general-public.html"}
