{"authors":[],"date_download":"2018-10-23 05:39:03","date_modify":"2018-10-23 05:39:03","date_publish":"2017-02-20 00:00:00","description":"New guidelines encourage doctors to tell patients to try non-drug therapies for acute lower back pain first.","filename":"data/vaneerConsumption/DrugsShouldBeALastResorttoTreatAcuteLowerBackPainShots.json","image_url":"https://media.npr.org/assets/img/2017/02/18/yoga-back-pain_wide-7ebe92e21e19f8c4bec1b40f8cd99a6c40594882.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=515675259_1540273143.html","title":"Drugs Should Be A Last Resort to Treat Acute Lower Back Pain : Shots","title_page":"Drugs Should Be A Last Resort to Treat Acute Lower Back Pain : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nLower back pain - yeah, you know who you are. You're not alone, though. Most of us will suffer from lower back pain sometime in our lives. And when it happens, many of us will reach for pain medication. But new guidelines from the American College of Physicians say don't do it. You're supposed to try yoga or acupuncture. Now, before you roll your eyes, listen to Patti Neighmond's report.\nPATTI NEIGHMOND, BYLINE: Your back is killing you. You really want pain relief. But not so fast, says Dr. Nitin Damle, president of the American College of Physicians. In contrast to lots of other pain, he says, acute back pain - not the chronic kind - usually goes away.\nNITIN DAMLE: The body will adjust, and it'll heal. And the inflammation will go down pretty much on its own.\nNEIGHMOND: It may take a week or even 10 days, but there are things you can do, other than medication, to speed the process along.\nDAMLE: Superficial heat, massage, acupuncture, spinal manipulation really is adequate for treating this problem.\nNEIGHMOND: Exercise like yoga and tai chi can relax muscles, joints and tendons.\nDAMLE: So that people can, you know, be relieved of their low back pain a little bit sooner rather than later.\nNEIGHMOND: Techniques that distract people from pain, like mindfulness and purposeful relaxation, can also help. Bottom line - if not needed, why risk the side effects of medication?\nDAMLE: They can give you gastritis. They can give you stomach upset. They can raise your blood pressure.\nNEIGHMOND: Now, if non-drug treatments just aren't working and pain continues, the guidelines suggest medication to reduce inflammation and, in some cases, low-level painkillers. Primary care doctor Steven Atlas with Massachusetts General Hospital says the guidelines are a needed change.\nSTEVEN ATLAS: It's moving away from simple fixes to a more complex view that how to make the back better involves a lot of lifestyle changes that a pill isn't going to solve.\nNEIGHMOND: Regular exercise can strengthen core muscles and protect the back. And powerful painkillers, like opioids, should be considered only as a last resort.\nPatti Neighmond, NPR News.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=515675259"}
