{"authors":["Associated Press"],"date_download":"2018-10-23 03:10:51","date_modify":"2018-10-23 03:10:51","date_publish":"2016-01-28 18:32:43","description":"DENVER (AP) — Seeking a safe haven in Colorado's legal marijuana marketplace, illegal drug traffickers are growing weed among the state's sanctioned pot ware...","filename":"data/vaneerConsumption/Drugtraffickersseeksafehavenamidlegalmarijuana.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:2a72c85e23624d6dafca9ea825bec558-4PuZeKVXE7cd9005b2c87603f836-977_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420442_Drug-traffickers-seek-safe-haven-amid-legal-marijuana_1540264251.html","title":"Drug traffickers seek safe haven amid legal marijuana","title_page":"Drug traffickers seek safe haven amid legal marijuana | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Drug traffickers seek safe haven amid legal marijuana\nDENVER (AP) — Seeking a safe haven in Colorado's legal marijuana marketplace, illegal drug traffickers are growing weed among the state's sanctioned pot warehouses and farms, then covertly shipping it elsewhere and pocketing millions of dollars from the sale, according to law enforcement officials and court records consulted by The Associated Press.\nIn one case, the owner of a skydiving business crammed hundreds of pounds of Colorado pot into his planes and flew the weed to Minnesota, where associates allegedly sold it for millions of dollars in cash. In another, a Denver man was charged with sending more than 100 pot-filled FedEx packages to Buffalo, New York, where drug dealers divvied up the shipment. Twenty other drug traffickers, many from Cuba, were accused of relocating to Colorado to grow marijuana that they sent to Florida, where it can fetch more than double the price in a legal Colorado shop.\nThese cases and others confirm a longstanding fear of marijuana opponents that the state's much-watched experiment in legal pot would invite more illegal trafficking to other states where the drug is still strictly forbidden.\nFILE - In this Dec. 31, 2013 file photo, employees tends to marijuana plants at a grow house in Denver. According to law enforcement officials, Colorado¿s legal marijuana marketplace is in some cases serving as cover for a host of illegal drug traffickers who hide their product among the state¿s many legal growing operations, then covertly ship it elsewhere and pocket millions of dollars from its sale. (AP Photo/Brennan Linsley, file)\nOne source is Colorado residents or tourists who buy retail pot and take it out of state. But more concerning to authorities are larger-scale traffickers who move here specifically to grow the drug and ship to more lucrative markets.\nThe trend also bolsters the argument of neighboring Nebraska and Oklahoma, which filed a lawsuit in late 2014 seeking to declare Colorado's pot legalization unconstitutional, arguing that the move sent a tide of illicit weed across their borders. The Obama administration last month urged the Supreme Court to reject the suit, saying that the leakage was not Colorado's fault.\nNo one knows exactly how much pot leaves Colorado. When illegal shipments are seized, it's often impossible to prove where the marijuana was grown. But court documents and interviews with law enforcement officials indicate well-organized traffickers are seeking refuge in Colorado's flourishing pot industry.\n\"There's no question there's a lot more of this activity than there was two years ago,\" said Colorado's U.S. attorney, John Walsh.\nSome in the legal industry say police have exaggerated the problem and put unfair scrutiny on people who legally grow pot on behalf of patients. Lawmakers last year limited unregulated pot growers to no more than 99 plants in an effort to crack down on those selling untaxed pot.\nThe federal government allowed Colorado's experiment on the condition that state officials act to keep marijuana from migrating to places where it is still outlawed and out of the hands of criminal cartels. Federal authorities acknowledge that both things are happening but say that, because the state is trying to keep its industry tightly regulated, there's no reason to end the legal pot trade.\nThe pot industry also acknowledges the criminal activity and insists it is doing all it can to keep legally grown weed from crossing state lines. Among other safeguards, Colorado law requires growers to get a license and use a \"seed-to-sale\" tracking system that monitors marijuana plants at every stage.\nMany of the illicit growers come from elsewhere, never obtain a growing license and \"don't even attempt to adhere to the law,\" said Barbra M. Roach, special agent in charge of the Drug Enforcement Administration's Denver field division.\n\"It's like hiding in plain sight,\" she said.\nAuthorities in Washington state, which also allows recreational marijuana, have noticed more marijuana leaving the state. But more reports are coming from Colorado, which has the nation's most robust commercial market and an international reputation for producing premium, high-potency pot.\n\"It's a brand name now,\" Roach said.\nJason Warf, head of the Southern Colorado Cannabis Council, said people are \"coming from out-of-state, buying products from licensed stores and being arrested on their way home.\"\nThat \"is really hard to curb,\" he said. \"We can't essentially babysit adults and their behavior.\"\nThe Colorado Department of Revenue's marijuana-enforcement division cites shops if pot is unaccounted for but \"after it's sold, we have very little control what happens to the marijuana,\" Director Lewis Koski said.\nPolice agencies seized nearly 2 tons of Colorado weed from drivers who had intended to take it to 36 other states in 2014, the year legal pot shops opened, according to the Rocky Mountain High Intensity Drug Trafficking Area, a federally funded drug task force. By comparison, they seized less than a ton in 2009.\nU.S. postal inspectors seized about 470 pounds of Colorado pot from the mail in 2014, up from 57 pounds in 2010, according to the task force, whose findings are based on voluntary submissions from law enforcement agencies and are largely anecdotal.\nSome cases have comic overtones, like when a Wyoming patrolman discovered 7 ounces of high-grade weed in trick-or-treat bags the day after Halloween, or when police in northern Colorado seized stuffed animals full of marijuana destined for Florida.\nOther operations are more sophisticated, like the one in which authorities say 32 people used skydiving planes and posed as licensed medical marijuana caregivers and small business owners to export tens of thousands of pounds of pot grown in Denver warehouses, usually to Minnesota. The organization made more than $12 million over four years, according to a state indictment.\nWhen they busted illegal pot farms in southern Colorado in September, state and federal agents found 28 guns, more than 1,000 plants and $25,000 in cash.\nA local UPS facility intercepts about 50 pounds of pot headed out of state each week, said Todd Reeves of the Colorado Drug Investigators Association. \"We don't have the resources,\" he said, \"to be able to go after every single one of these cases.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3420442/Drug-traffickers-seek-safe-haven-amid-legal-marijuana.html"}
