{"authors":[],"date_download":"2018-10-30 14:21:28","date_modify":"2018-10-30 14:21:28","date_publish":"2014-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/Drugbustresultsininfantbeinghorriblyburnedbyflashbanggrenade.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_drug_bust_results_in_infant_being_horribly_burned_by_flashbang_grenade_comments_1540909288.html","title":"Drug bust results in infant being horribly burned by 'flash-bang' grenade","title_page":"Blog: Drug bust results in infant being horribly burned by 'flash-bang' grenade","title_rss":"NULL","source_domain":"americanthinker.com","text":"It was a case of mistaken identity. The former tenants of a house that was the target of a no-knock drug raid had moved out and the police didn't bother to check if the family living at the address were guilty of anything. As it turns out, the cops tossed a flash-bang grenade into an infant's crib, horribly burning the baby. The police are sorry, of course. Hit and Run blog: Bounkham Phonesavanh, a nineteen month old toddler, is in a medically-induced coma afterreportedly suffering severe burns when a SWAT team from the Habersham County Sheriff’s Office in Georgia threw a flash grenade into his home during a no-knock raid apparently over a drug purchase made there earlier in the week. Sheriff Joey Terrell said officers asked the informant who directed them to the house whether there were any children and were told there weren’t so there was nothing they could have done to prevent it. Via Access North Georgia: Terrell said both the district... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/05/drug_bust_results_in_infant_being_horribly_burned_by_flashbang_grenade_comments.html"}
nvestigate, there's nothing to look at. Given the information given, GBI's SWAT team would have done the exact same thing - they'd have used the exact same scenario to enter the house.\" Whether the sheriff’s office should be executing no-knock warrants on homes because they can find informants to buy drugs from there seems like something Terrell, the GBI or the DA could “look at.” Unless the social media activists launch the right hash tag to end the war on drugs, Bounkham Phonesavanh is unlikely to be its last child victim. No one thinks of the children when cops get to play commando.\nYou want to find someone to blame for this tragedy, and Mr. Terrell thinks he has found the answer:\nThe person I blame in this whole thing is the person selling the drugs. Wanis Thonetheva, that's the person I blame in all this. They are no better than a domestic terrorist, because they don't care about families—they didn't care about the family, the children living in that household—to be selling dope out of it, to be selling methamphetamine out of it. All they care about is making money. They don't care about what it does to families. It's domestic terrorism, and I think we should treat them as such. I don't know where we can go with that, but that's my feelings on it. It just makes me so angry! I get so mad that they don't care about what they do. They don't care about the families or the people they're selling to.\nReason's Jacob Sullum has a different take:\nIt makes me angry too, but in a different way. It makes me angry that Terrell thinks violence is an appropriate response to consensual transactions in which someone exchanges methamphetamine for money (provided that person is not a pharmacist and his customer is not a patient with a prescription). It makes me angry that Terrell sees nothing wrong with sending a heavily armed SWAT team into an alleged meth dealer's home in the middle of the night, which inevitably endangers not only the dealer but anyone else who happens to be there. In Terrell's mind, that is not an act of aggression. It was Wanis Thonetheva who attacked first by agreeing to sell speed to people who wanted it. Hence Thonetheva is a \"domestic terrorist,\" harming an innocent child because all he cares about is making money. Terrorists, of course, are usually motivated by politics rather than greed. And it was not Thonetheva who sent Alecia Phonesavanh's 19-month-old son, Bounkham, to the hospital with severe burns. One of Terrell's deputies did that, in service of a political ideology that says people may not alter their consciousness in ways that are not approved by the government. \"He is in a medically induced coma and he is paralyzed,\" Phonesavanh told WSB-TV, the ABC affiliate in Atlanta. \"I hope he's not going to remember this. I know his sisters, his mommy, and his daddy will never forget this. Our kids have been through enough this year. This is just more trauma that they didn't need, and I just wish there was something better I could do to make it better for him. Wrong place, wrong time.\"\nPart of Sullum's argument is interesting; doctors prescribe addictive, psychoactivef drugs every day so why should meth be illegal? You might argue that cooking up a batch of meth at home is a far cry from the controlled manufacture of drugs at a pharmaceutical company. But Sullum seems to be saying \"caveat emptor,\" bud. It may be risky but it's a personal liberty issue whether a drug consumer wants to take the chance of putting that crap in their bodies and keeling over dead.\nUltimately, the issue of government listed illegal drugs hinges on one's personal notion of liberty. Are we free to make a mess of our lives so that society must support us? Or make a mess of our families? The same can be said of alcohol addiction, or prescription drug addiction, with the caveat that these drugs are heavily regulated and, at least, the consumer knows that what they are ingesting doesn't contain rat poison or other impurities that can kill you.\nBut the militarization of our police forces is going too far. I can see using a SWAT team to go after a drug kingpin, but a penny ante dealer? There must be a better way to take down these people without a military style assault on their homes.\nThere is much debate these days on the \"cost\" of the war on drugs. Ruined lives, jail time, a police record - all of these things just for a \"consensual transaction\" as Sullum says? Or a necessary part of safeguarding children and the rest of society from the scourge of illegal street drugs?\nDrug dealers don't look at a kid's ID to see if they're of an age to make an adult choice about what to put in their bodies. For that reason alone, some drugs should be kept out of the hands of everyone lest they fall into the hands of children.","url":"https://www.americanthinker.com/blog/2014/05/drug_bust_results_in_infant_being_horribly_burned_by_flashbang_grenade.html"}
