{"authors":[],"date_download":"2018-10-30 20:43:24","date_modify":"2018-10-30 20:43:24","date_publish":"2014-05-19 23:21:48","description":"Authorities thought they had their man. Suspect Terry Springs, wanted on drug charges, was in their sights.","filename":"data/vaneerConsumption/Drugsuspectwhojumpedintoriverstillmissing.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/20/Images/photos.medleyphoto.5275295.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_drug-suspect-who-jumped-into-river-still-missing__1540932204.html","title":"Drug suspect who jumped into river still missing","title_page":"Drug suspect who jumped into river still missing","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities thought they had their man. Suspect Terry Springs, wanted on drug charges, was in their sights. But they haven’t seen him since he floated away on a log in the Etowah River.\nTwo Cherokee Multi-Agency Narcotics Squad agents tried to arrest 42-year-old Spriggs on Monday at a relative’s home in Canton, according to a news release from Canton police spokesman Pacer Cordry. He is wanted on one count of cocaine possession, two counts of methamphetamine possession and probation violation. Spriggs fled the scene on foot, crossed Marietta Highway and went into the Etowah River, Cordry said.\nCanton police officers tried to help capture Spriggs, but he grabbed onto a log, refused to swim ashore, and began floating down the river, according to Cordry.\nAuthorities followed on foot along the shoreline for about a quarter of a mile before losing sight of Spriggs.\nThe search along the river included representatives from the Georgia State Patrol, the Canton and Cherokee fire departments, and the Cherokee County Sheriff’s Office.\nNarcotics agents are continuing their investigation today. As of this afternoon, Spriggs still hadn’t been found.\nAnyone with information on Spriggs’ whereabouts should call 911.","url":"https://www.ajc.com/news/local/drug-suspect-who-jumped-into-river-still-missing/Rlj0Q0Zds9cRkPKb284sAI/"}
