{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 03:01:42","date_modify":"2018-10-23 03:01:42","date_publish":"2017-03-10 12:30:15","description":"Convicted car thief Joshua Dobby, 23, ploughed into Makayah McDermott, 10, and Rosie Cooper, 34, as they walked along Lennard Road in Penge, south-east London.","filename":"data/vaneerConsumption/Drugaddictwhokilledchildandauntwishedhehaddied.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22E9CD00000578-0-image-a-65_1489150448355.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301066_Drug-addict-killed-child-aunt-wished-died_1540263702.html","title":"Drug addict who killed child and aunt wished he had died","title_page":"Drug addict who killed child and aunt wished he had died | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In the dock: Joshua Dobby admitted manslaughter over the deaths of Makayah McDermott, 10, and his aunt Rosie Cooper - he admitted afterwards: 'It should have been me'\nA drug addict son of a pet food millionaire who ran down and killed a child actor and his aunt in a stolen car was jailed for 12 years today.\nCareer car thief Joshua Dobby, 23, was out on licence and high on cocaine, heroin and morphine when he ploughed into Makayah McDermott, 10, and Rosie Cooper, 34, as they walked along Lennard Road in Penge, south-east London.\nDobby, who admitted afterwards: 'It should have been me', was going at three times the speed limit in a 20mph zone.\nHe then jumped out the wreckage of the car and ran off as his victims died, stepping over the badly maimed body of another young child to make good his escape.\nJust five days earlier police had abandoned a pursuit of him in the same car because it was too dangerous and the Old Bailey heard an independent probe has been launched following the fatal crash on August 31 last year.\nDobby, who is the estranged son of millionaire pet food wholesaler Mark Dobby, has never held a driving licence and has 53 previous convictions dating back to when he was 13, including one for aggravated vehicle taking.\nHe was jailed for 12 years by a judge at the Old Bailey after admitting double manslaughter and injuring the girl, and was told he would serve a further three years on licence.\nDouble killing: Joshua Dobby, 23, killed talented actor and sportsman Makayah McDermott and his aunt Rozanne Cooper, 35, after losing control of the stolen Ford Focus\nRepeat offender: Just five days earlier police had abandoned a pursuit of the same car (pictured after killing two people) because it was too dangerous\nDobby smirked as he left the dock to be taken down to the cells.\nAs he was sentenced, Makayah's grieving grandfather accused Dobby of treating his family as 'worthless' and 'expendable'.\nThe Old Bailey's top judge, Nicholas Hilliard QC, told Dobby: 'The sentence I'm going to pass is not meant to equate to the precious lives that were taken that day, no sentence could ever do that.'\n'Nor can any sentence I pass put right the dreadful consequences of your actions on 31 August last year. Given what you did that is not possible.'\nHe added: 'The pain and anguish you have caused to this family has left them in turmoil and overwhelmed by grief.\n'That ten-year-old boy was so loved and full of talent and promise for the life which he never got to live.'\nShocking dash cam footage from August 31 captured six minutes of the terrifying police chase as Dobby hit speeds of 60mph in residential roads with a speed limit of 20mph.\nHe drove the wrong way down one-way streets four times at more than 50mph, raced through red traffic lights and hurtled down streets busy with children off school for the summer holidays.\nJudge Hilliard told him: 'You drove with no regard for the safety of pedestrians or other motorists and I am sure your intention was to force police to abandon the pursuit if you possibly could.'\nKeen actor and footballer Makayah, who appeared in an Asda advert, had just landed a leading role in a major new television series and dreamed of playing for Chelsea FC.\nOmar McDermott and Danielle Cooper, parents to Makayah McDermott, looks on as DC Ian Payne speaks outside The Old Bailey in London on Friday\nFriends and relatives of the victims of the Penge crash gathered outside the Old Bailey in London\nThe victims' family and friends were inside the court when Dobby was jailed for 12 years on Friday\nBut he was pronounced dead at the scene having suffered 40 separate injuries.\nHis aunt died from 54 injuries, while a keen young cheerleader needed surgery on her leg and another child miraculously escaped unscathed.\nThe judge said Dobby had caused 'pain and anguish', leaving the family in 'turmoil and overwhelming grief' at the loss of Makayah, 'so loves and so full of talent and prospects for the life he never got to live'.\nBereft family of schoolboy and his aunt face killer in court Heartbroken: Makayah's father Omar McDermott Makayah's father Omar McDermott described feeling 'bitter, vile, hollow, defeated and cold' and as if he had let his son down, even though he was not there when he was killed. He told how Makayah was a 'dapper' little boy who was brave, strong and kind. He was to be the ring bearer at his parents' upcoming wedding before he was killed. Mr McDermott said: 'My home has become a prison of memory I wish I did not have. A prison with no freedom in sight.' On Dobby, he said: 'I have no hate or love for this young person, only regret. 'I only hope this young man gets the necessary help to become a better person.' Makayah's mother Danielle Cooper said her heart was broken at losing her 'handsome little joker'. He was intelligent, skilful and a talented actor who had dreams of playing football for Chelsea, she said. 'I spend most days crying. I'm empty inside. My heart is broken.' The young girl who was maimed in the crash recalled how Dobby stepped over her injured body to get away. In a victim impact statement, the keen cheerleader said: 'An ugly man's foot stepped over me and then ran. 'I constantly cry. My legs are a constant reminder this stupid, ugly man has destroyed my life.'\nEarlier, the court was told that in a letter from jail, Dobby told his girlfriend: 'Two people have lost their lives cos of my selfish f****** actions and it all boils down to drugs.\n'It should have been me that lost my life but it wasn't. I still have a life and I'm determined to do something with it for the sake of that child.'\nHe told her he had since 'chucked it out' and was now 'clean as a whistle', the Old Bailey heard.\nAfter the tragedy, Dobby admitted he was was coming down from smoking crack cocaine and heroin and swore never to take another drug again.\nGiving evidence in front of the victims' family, Dobby said he was 'reckless and stupid'.\nHe said: 'I understand I have caused a lot of hurt and pain. I'm truly sorry for what I've done.'\nThe young man said his life had been 'out of control' at the time and he was 'sofa surfing' with friends.\nHe admitted being on his way to sell the stolen car for £300 to buy more drugs when he killed Ms Cooper and Makayah.\nOn the afternoon of August 31 last year, the victims, accompanied by other children, were on their way to get ice creams and play on the swings.\nDobby was driving a black Ford Focus at three times the speed limit down one-way roads and jumped red lights before he lost control and hit the group.\nHe leapt out of the wrecked car and fled on foot, leaving police officers to try desperately to save the victims.\nDobby's millionaire father lives in a five-bedroom detached house in a gated estate in south east London worth an estimated £2.7million. He is the director of four companies, including a large pet food business.\nMr Dobby previously refused to talk about his killer son, but said he had not seen him in 16 years.\nAsked about Dobby's court case, he said previously: 'I haven't got anything to say. I haven't seen him for 16 years so I haven't got anything to say about it'.\nAfter he was arrested, he said: 'I was driving, I admit it. I should have stopped.\n'I don't want to go back to jail, now I might have killed innocent people. I wish I just pulled over.'\nThe defendant had a cocktail of drugs in his system when he killed Makayah and Ms Cooper, including cocaine, heroin and morphine.\nPolice at the scene last August. Dobby was being pursued by police when he lost control\nFriends and family of the two victims visit the scene of the crash last summer\nDobby admitted causing death by dangerous driving and injuring Makayah's sister but only entered guilty pleas to the more serious charges of manslaughter days before his trial was due to start.\nMitigating, Tyrone Smith QC said Dobby had a 'fractured upbringing' with time in care and a 'principal family member' also an addict.\nHe asked Dobby: 'Do you think you would have committed these offences if you had not been in the grip of drug addiction?'\nThe defendant, who admitted never owning a driving licence, replied: 'No. It was down to drugs that I committed the crimes to fund my habit.'\nThe Independent Police Complaints Commission is investigating the circumstances of the crash on August 31 2016.\nDobby had previously admitted two counts of manslaughter as well as causing serious injury by dangerous driving to Makayah's sister Yahla.\nDobby also admitted one count of dangerous driving, which involved him driving a Ford Focus dangerously on the A228 in Kent on August 26 - five days before the death crash.\nTyrone Smith QC defending criticised his client's upbringing at he hands of foster parents, which saw him injecting class A drugs at an early age and was exposed to violence and abuse.\nHe said: 'Nothing can repair the damage that he has done.\n'But those who were responsible for parenting him failed in the most lamentable way to protect him from drugs, provide him with a safe environment or maximise the positive aspects of his character.'\nFlowers were left at the scene of the horrific crash in Penge, south London last August\nDobby, of no fixed address, has 53 previous convictions.\nIn June last year he was jailed for 18 weeks for receiving stolen goods, breach of a conditional discharge and failure to surrender.\nAnd in April 2010, when he was 16, he was convicted of aggravated vehicle taking, for which he received a rehab order.\nMakayah's grandfather says the lives of the ten-year-old and his aunt were treated as 'worthless' by the drug addict who raced in a stolen car to evade police\nBereft: Grandfather Martin Cooper said the 23-year-old drug addict Dobby had treated the lives of his daughter Rozanne and grandson Makayah as 'worthless' and 'expendable' as he tried to evade police\nA family has been left numb with shock after witnessing Joshua Dobby drive a stolen car into their group, killing a young mother and her 10-year-old nephew.\nGrandfather Martin Cooper said the 23-year-old drug addict had treated the lives of his daughter Rozanne and grandson Makayah as 'worthless' and 'expendable' as he tried to evade police.\nIn a statement read out at the Old Bailey, he said: 'On that day, I was there. I watched the car drive into and over all five members of my family.\n'I watched as the driver of the car made no attempt to stop or apply the brakes and no attempt to swerve.\n'In front of my eyes, my daughter Rozanne and my grandchildren all became worthless in the eyes of the man driving the car, a means to an end.\n'They all became expendable and their only value was to create a scene of death and destruction forcing the police to end their pursuit of him.\n'How long did this man evade the police? An hour, a day, a week? This man's life gravitated to the police.\n'For the sake of a day or two on the run, he sacrificed the life of my daughter and grandson, killing them and mutilating my granddaughter.'\nMr Cooper said the family were all in his care but 'all I could do was stand there' as Dobby drove over his loved ones before running away without a backward glance.\nHe said his daughter, who left a young daughter, had a space in all their lives 'which will always be empty'.\nHe described his grandson Makayah as a 'a lovable little boy with so much promise'.\nMr Cooper, who is retired, said: 'My mind never lets me rest. I relive the sight of the collision, the car being driven on top of them.\n'Worst of all, I relive having to walk away, leaving them dead on the pavement.'\nDouble tragedy: Makayah McDermott, 10, left, and Rosie Cooper, 34, right, were killed by Dobby as they walked along Lennard Road in Penge, south-east London on the way to get ice cream\nHis wife Diana Cooper, who also witnessed the horrific crash, said the family was 'still numb with shock and devastated at losing our loved ones'.\nThe deaths affected the lives of many people who 'cherished' their friendship, including the girl who lost her mother at a very young age, she said.\nMrs Cooper described her daughter Rosie as a 'caring young mother' who had a special bond with her daughter and her grandson Makayah as 'very talented' at football and taekwondo.\nMakayah's father Omar McDermott described feeling 'bitter, vile, hollow, defeated and cold' and as if he had let his son down, even though he was not there when he was killed.\nHe told how Makayah was a 'dapper' little boy who was brave, strong and kind.\nHe was to be the ring bearer at his parents' upcoming wedding before he was killed.\nMr McDermott said: 'My home has become a prison of memory I wish I did not have. A prison with no freedom in sight.'\nOn Dobby, he said: 'I have no hate or love for this young person, only regret.\n'I only hope this young man gets the necessary help to become a better person.'\nMakayah's mother Danielle Cooper said her heart was broken at losing her 'handsome little joker'.\nHe was intelligent, skilful and a talented actor who had dreams of playing football for Chelsea, she said.\n'I spend most days crying. I'm empty inside. My heart is broken.'\nThe young girl who was maimed in the crash recalled how Dobby stepped over her injured body to get away.\nIn a victim impact statement, the keen cheerleader said: 'An ugly man's foot stepped over me and then ran.\n'I constantly cry. My legs are a constant reminder this stupid, ugly man has destroyed my life.'","url":"https://www.dailymail.co.uk/news/article-4301066/Drug-addict-killed-child-aunt-wished-died.html"}
