{"authors":["Associated Press"],"date_download":"2018-10-22 20:04:43","date_modify":"2018-10-22 20:04:43","date_publish":"2016-01-28 00:10:37","description":"WASHINGTON (AP) — In a testy election year likely to see scant collaboration between Republicans and Democrats, there's a glint of hope in Congress for a bip...","filename":"data/vaneerConsumption/Drugabusebillraiseshopesforelectionyearachievement.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:0b10b84c215a49ce80fc097a0798778e-2vdWmEltwXfba0ce28e6321e73e0-842_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419811_Drug-abuse-bill-raises-hopes-election-year-achievement_1540238683.html","title":"Drug abuse bill raises hopes for election-year achievement","title_page":"Drug abuse bill raises hopes for election-year achievement | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Drug abuse bill raises hopes for election-year achievement\nWASHINGTON (AP) — In a testy election year likely to see scant collaboration between Republicans and Democrats, there's a glint of hope in Congress for a bipartisan bill aimed at fighting heroin and opioid addiction — a deadly, growing problem that afflicts states both red and blue.\nSenate and House bills establishing grants to combat abuse, improve treatment and bolster some law enforcement programs are winning support from members of both parties. President Barack Obama used this month's State of Union address to call such legislation one area where lawmakers \"might surprise the cynics\" and get something done this year.\nSenate Majority Leader Mitch McConnell, R-Ky., whose state has one of the nation's highest death rates from drug overdoses, said GOP senators discussed the issue at their closed-door lunch Wednesday and said he hoped the Senate could approve legislation by the end of this year.\nMichael Botticelli, director of the Office of National Drug Control Policy, testifies during a Senate Judiciary Committee hearing on attacking America¿s epidemic of heroin and prescription drug abuse, on Capitol Hill, Wednesday, Jan. 27, 2016 in Washington. (AP Photo/Alex Brandon)\n\"We're trying to craft something that we think makes the difference,\" McConnell told reporters.\nSenate Minority Leader Harry Reid, D-Nev., called the problem \"a scourge\" Wednesday and said the target to pass legislation shouldn't be year's end but \"as soon as possible.\"\nPotential GOP changes include provisions tightening border controls to combat heroin shipments from Mexico and cracking down on excessive prescribing of painkillers, but No. 2 Senate Republican leader John Cornyn of Texas said lawmakers are \"in the early stages of thinking about that.\"\nBoth parties' interest in the effort doesn't mean it faces smooth sailing in Congress or isn't colored by politics. Some Republicans prefer a greater emphasis on law enforcement attempts to stop heroin from entering the U.S. from Mexico, and there are concerns about the measure's cost. And on the campaign trail, some Senate Republicans seeking re-election this November are already being attacked over the issue by Democrats trying to oust them.\n\"It's an effort every single state and every senator should have a strong interest in,\" Sen. Rob Portman, R-Ohio, a leading co-sponsor of the legislation, said in an interview this week.\nThe drive comes with U.S. drug overdose deaths more than double since 2000, with a record 47,000 dying in 2014, according to the federal Centers for Disease Control and Prevention. That's more than the number of Americans who die annually in auto accidents or from gunshot wounds. Six in 10 of those deaths involved opioids, which include prescription pain relievers like hydrocodone and oxycodone, and heroin.\nOpioid abuse is \"the No. 1 drug threat facing our country,\" Louis J. Milione, a top official at the Drug Enforcement Administration, told the Senate Judiciary Committee on Wednesday at a hearing on legislation sponsored by Sen. Sheldon Whitehouse, D-R.I., Portman and — so far — 20 others.\nThe bill doesn't have an official price tag yet and leaves final decisions on how to pay for it until later.\nPortman and Sen. Kelly Ayotte, R-N.H., whose states have major drug abuse problems, each testified in support of the bill at Wednesday's Judiciary panel hearing and have made the issue a top priority.\nWith both facing competitive re-election contests this fall, the issue lets each senator attract attention to a high-profile local concern. That could help them if the GOP presidential nomination goes to billionaire celebrity Donald Trump or Sen. Ted Cruz, R-Texas, whose hard-core views on immigration and other national topics could alienate moderates in Portman's and Ayotte's closely divided states.\nDemocrats are accusing GOP Senate supporters who are seeking re-election this year of duplicity on the issue. They say that while Portman touts his support for efforts to battle opioid abuse, he has voted against legislation addressing the problem like last December's massive government-wide spending bill, which provided millions of dollars for anti-drug efforts.\nOhio Democratic Senate candidate Ted Strickland, the state's former governor, said that while Portman issued press releases lauding that spending bill's money for combatting drug abuse, the Republican ended up voting against the overall bill.\n\"It's hypocritical of him,\" Strickland said in an interview.\nPortman said he opposed the legislation because of other provisions stuffed into the 2,000-page measure, including billions of dollars in budget gimmicks.\nDemocrats are also using the issue to attack other Republicans running for re-election in states where drug addiction is a major concern. The Pennsylvania Democratic Party accused Sen. Pat Toomey, R-Pa., on Wednesday of being \"an ideological hard-liner\" who portrays himself as backing anti-drug efforts but opposing the December spending bill and a Republican-written budget that could have cut substance abuse programs.\nToomey aides said the lawmaker has backed several anti-drug measures, including one bill he wrote aimed at preventing painkillers from being diverted to people for whom they were not prescribed.\n\"It's disappointing that the Pennsylvania Democratic Party is attempting to politicize such an important public health crisis,\" said Toomey campaign spokesman Steve Kelly.\nIn one sign of partisan finger-pointing, Judiciary Committee Chairman Charles Grassley, R-Iowa, said Mexican drug cartels are expanding in the U.S. \"because the Obama administration hasn't secured the border.\" Grassley also said the administration is \"sending mixed signals to young people,\" citing the president's 2014 remark that he considers marijuana smoking \"a bad habit.\"\nSen. Kelly Ayotte, D-N.H., left, Sen. Jeanne Shaheen, D-N.H., Sen. Rob Portman, R-Ohio, listen as Gov. Peter Shumlin, D-Vt., right, testifies during a Senate Judiciary Committee hearing on attacking America¿s epidemic of heroin and prescription drug abuse, on Capitol Hill, Wednesday, Jan. 27, 2016 in Washington. (AP Photo/Alex Brandon)\nSen. Kelly Ayotte, D-N.H., left, speaks as Sen. Jeanne Shaheen, D-N.H., Sen. Rob Portman, R-Ohio, and Gov. Peter Shumlin, D-Vt., listen during a Senate Judiciary Committee hearing on attacking America¿s epidemic of heroin and prescription drug abuse, on Capitol Hill, Wednesday, Jan. 27, 2016 in Washington. (AP Photo/Alex Brandon)\nJudiciary Committee Chairman Chuck Grassley, R-Iowa, left, Sen. Patrick Leahy, D-Vt., talk with Gov. Peter Shumlin, D-Vt., before a Senate Judiciary Committee hearing on attacking America¿s epidemic of heroin and prescription drug abuse, on Capitol Hill, Wednesday, Jan. 27, 2016 in Washington. (AP Photo/Alex Brandon)\nSen. Rob Portman, R-Ohio, testifies during a Senate Judiciary Committee hearing on attacking America¿s epidemic of heroin and prescription drug abuse, on Capitol Hill, Wednesday, Jan. 27, 2016 in Washington. (AP Photo/Alex Brandon)","url":"https://www.dailymail.co.uk/wires/ap/article-3419811/Drug-abuse-bill-raises-hopes-election-year-achievement.html"}
