{"authors":[],"date_download":"2018-10-30 18:15:06","date_modify":"2018-10-30 18:15:06","date_publish":"2015-04-25 04:00:00","description":"For years, mom Jennie Saliers drove through Druid Hills to the Paideia School, sometimes traveling Ponce de Leon Avenue several times a day to the private school campus for academics, sports, music and volunteering activities.","filename":"data/vaneerConsumption/DruidHillshomewithtiestoDrivingMissDaisy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/04/25/Images/photos.medleyphoto.7153877.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_home_druid-hills_f1f1a3958baa44cc5a25bb7ee42d3633__1540923306.html","title":"Druid Hills home with ties to ‘Driving Miss Daisy’","title_page":"Druid Hills home with ties to ‘Driving Miss Daisy’","title_rss":"NULL","source_domain":"ajc.com","text":"For years, mom Jennie Saliers drove through Druid Hills to the Paideia School, sometimes traveling Ponce de Leon Avenue several times a day to the private school campus for academics, sports, music and volunteering activities. As the kids became teens, Saliers and her husband, Bill Levisay, thought it would be great to live close enough to walk to school, she said.\nWhen a fellow Paideia parent mentioned the house next door to her was for sale, Saliers was charmed by the Georgian Revival architecture, original molding and its history. Previous residents were Pulitzer Prize-winning playwright Alfred Uhry and his family, including his grandmother, Lena Fox, who inspired “Driving Miss Daisy.”\nThe home’s background is fitting for the 2015 Druid Hills Tour of Homes & Gardens (druidhillstour.org) on May 1-3. Five houses are on the 47th annual tour, titled, “History Happens Here.”\n“It’s probably the most beautiful house we’ve ever lived in,” Saliers said.\nSnapshot\nResidents: Bill Levisay and Jennie Saliers, children Bryson Levisay and Marie Levisay, and their cats, Spot and Felix. Bill Levisay owns Levisay Consulting.\nLocation: Atlanta’s Druid Hills neighborhood\nSize: 3,500 square feet, four bedrooms, three-and-a-half baths\nYear built: 1923\nYear bought: 2012\nArchitectural style: Georgian Revival\nArchitect: Ivey and Crook\nFavorite architectural element: Round window on the top front exterior, which they added to the top of the pool house to match.\nType of renovations: In 2012, the side porch was winterized. “It’s really wonderful because it’s all glass now, but there are some windows that you are able to open. It gets a ton of light. It’s a very comfortable room,” Saliers said. In 2013, they added the pool house that houses a two-car garage, Bill’s office and guest space. The previous owners worked with designer Vern Yip to renovate the master bathroom and kitchen, and added the pool.\nContractors: Bruce Meller of Home Forge Remodeling (side porch), Rick Blanchard of Watershed Development (pool house), Pengelly’s Landscape & Garden\nInterior design style: Eclectic\nFavorite interior design elements: They have paired new furniture from Trinity Mercantile & Design in Decatur with antiques. Older pieces include a side oval table on original casters and a dry sink that belonged to Saliers’ grandmother, and quilts made by family members.","url":"https://www.ajc.com/lifestyles/home/druid-hills-home-with-ties-driving-miss-daisy/GEiwcPvmVazrkTdnzKlYeN/"}
