{"authors":["James Wilkinson For Dailymail.Com"],"date_download":"2018-10-22 23:18:46","date_modify":"2018-10-22 23:18:46","date_publish":"2017-04-26 07:10:47","description":"Jason Sylvain, 41, stands accused of being a robocidal maniac after assaulting the conical droid as it patrolled a parking lot, according to cops in the Mountain View area of San Francisco.","filename":"data/vaneerConsumption/DrunkenmanattacksarmlesssecurityrobotinCalifornia.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9C6D6300000578-0-image-a-2_1493188103506.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446222_Drunken-man-attacks-armless-security-robot-California_1540250326.html","title":"Drunken man 'attacks armless security robot in California'","title_page":"Drunken man 'attacks armless security robot in California' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If the machines are truly going to take over the Earth, they have a ways to go.\nThat's what cops in the Mountain View area of Silicon Valley learned on April 19 when they arrested an apparently drunk man for kicking over a limbless security robot.\nJason Sylvain, 41, stands accused of being a robocidal maniac after assaulting the conical droid as it patrolled a parking lot, according to NBC Bay Area.\nScroll down for video\nLegless man vs armless robot: Police say Jason Sylvain, 41, is the man seen in this footage, about to drunkenly topple a K5 security droid outside the Knightscope offices in Silicon Valley\nRobo cop: The robots are five feet tall, weigh 300lbs, and can recognize known shoplifters and photograph car license plates. They can be rented out for around $7 per hour\nSylvain jumped the K5-model robot outside the offices of its manufacturers, Knightscope, near the corner of Terra Bella and Linda Vista Avenue, police said.\n'He knocked over the machine and decided to have a conversation with it,' Stacy Dean Stevens, vice president of marketing and sales at Knightscope, claimed.\nIt's not known what was said to the stricken security droid.\nThe robots, which are five feet tall and weigh 300lbs, can use their cameras to spot the faces of known shoplifters and photograph car license plates.\nBut they are clearly not much use in a fight.\nSylvain's alleged attempt to terminate the hapless machine was a very one-sided affair: All the robot could do to defend itself is spin around and whistle.\nUnfortunately for him, it was also equipped with an alarm that caused the company's human guards to come running and place Sylvain under citizen's arrest, NBC reported.\nSylvain was charged with public intoxication and prowling - and Stevens says that shows the robot was doing 'exactly what it was supposed to do.'\nAnd much like the Terminator, the K5 unit came back after its unfortunate encounter, with a few scratches to show for it.\nDroid rage: Police didn't say why Sylvain would attack the robot. It has now been restored and is back on the beat\nResidents in the area were not impressed with Sylvain's alleged droid rage.\nLocal Eamonn Callon told ABC 7 that 'it shows how spineless the drunk guys in Silicon Valley really are because they attack a victim who doesn't even have any arms.'\nThe robots aren't completely harmless, however: Last year one of the units left a one-year-old shaken after it bumped into him in a shopping mall.\nToddler Harwin Cheng was left 'crying like crazy' after being struck by the security machine on July 6 last year.\nHe was in a shopping mall in Palo Alto - the suburb next to Mountain View that is home to tech whizzes like Mark Zuckerberg - when the K5 unit plowed into him.\nHe was not seriously hurt, but suffered a bruised foot and a bump to the head.\nThe unit's sensors had apparently malfunctioned.","url":"https://www.dailymail.co.uk/news/article-4446222/Drunken-man-attacks-armless-security-robot-California.html"}
