{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-30 22:52:31","date_modify":"2018-10-30 22:52:31","date_publish":"2016-11-03 08:00:00","description":null,"filename":"data/vaneerConsumption/DuelingDems4issuesmayhingeonwhatbrandofDemocratwins.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Donkeys1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939951.html","title":"Dueling Dems: 4 issues may hinge on what brand of Democrat wins","title_page":"Dueling Dems: 4 issues may hinge on what brand of Democrat wins | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In a turbulent election year full of surprises, this much is certain: When it’s all over next week, broad swaths of California will still be represented by Democrats. The pressing question in many parts of the state: What kind of Democrat will voters send to Sacramento? Sixteen legislative races—from Northern California’s Wine Country to SoCal’s Inland Empire—feature contests between two Democrats. That’s because voters opted in 2010 to change to a “top-two” primary system that aimed to attract centrists by allowing candidates of the same party to face off in the general election.\nIn a state with a deepening blue hue, the result is some fierce Dem-on-Dem contests. On one side are progressives backed by traditional party allies such as unions, environmentalists and teachers; on the other side is a more conservative mod squad that has the support of big business, oil companies and advocates for a more aggressive shakeup of public education.\nThe victors could play an influential and possibly decisive role in how the state resolves disputes over education, the environment, transportation and housing.\n“There’s always been a bit of a split in the Democratic Party in California. It faded a little in the last decade and now it seems to be resurging,” said Eric McGhee, a Public Policy Institute of California researcher who has studied the top-two system. The business-backed wing of the party is “flexing its muscle now more than it did before.”\nAdding oomph to the races is an infusion of millions of campaign dollars from businesses and unions. Target Book estimates that interest groups trying to mold the California Legislature to their liking have spent roughly $35 million on general election advertising campaigns independent from the candidates—allowing them to evade limits that apply to candidate donations. Absent a formal process for defining which Democrats are moderates, these expenditures are a key indicator.\n“People develop a consensus in Sacramento over who is a mod and who isn’t,” said David Townsend, a Democratic consultant who runs a business-backed political action committee.\nThe divide takes different forms in different races. In some cases, education advocates are the big spenders, in others it’s oil companies pouring on the cash. But the split is evident in legislative races in Napa, San Francisco, San Jose, Concord, Palo Alto, Salinas, parts of Los Angeles and San Bernardino.\nWhy it matters:\nEducation\nCharter schools typically pit labor unions against entrepreneurs. As public schools free from many government regulations, charters attract support from business leaders who insist they can improve education by offering families more options. Charters, unlike traditional public schools, do not have to employ union teachers—creating friction that is playing out in this election.\nCharter advocates have spent more than $7.1 million on independent ad campaigns in several races, backing Democratic candidates including Anna Caballero of Salinas, Laura Friedman of Glendale, Madison Nguyen of San Jose, Scott Wiener of San Francisco, Bill Dodd of Napa, Tim Grayson of Concord and Marc Berman of Palo Alto. Teacher unions and other labor groups have put more than $3 million into independent expenditures, much of it to help rival Democrats Ash Kalra of San Jose and Mae Torlakson of Pittsburg.\nIn the next legislative session, unions may seek more accountability for charter school boards—including possibly elections—and more disclosure of how charters spend public money, said California Labor Federation lobbyist Angie Wei.\nOn the flipside, charter advocates want the Legislature to change the way charters are reviewed for renewal, and help them use available school facilities, said Richard Garcia of the California Charter Schools Association.\nEnvironment\nThis year lawmakers extended California’s ambitious goals to reduce greenhouse gas emissions and fight global warming. But they did not tackle whether to extend a cap and trade system that requires industries to reduce emissions or pay for permits to pollute. Current law authorizes cap and trade through 2020; the new Legislature may decide whether to extend it.\nAn oil industry PAC has spent $3.7 million on independent campaigns since the primary, supporting Democrats Grayson, Raul Bocanegra of Los Angeles, Steve Bradford of Gardena and Assemblywoman Cheryl Brown of San Bernardino. Conversely, environmentalists teamed up with labor unions to spend $1.4 million backing Brown’s challenger in San Bernardino, Eloise Reyes, in a race that reveals the political left working to chip away at the power business Democrats have attained in Sacramento.\nTransportation\nCalifornia roads need billions of dollars of repairs, and Gov. Jerry Brown called a legislative special session two years ago to come up with a way to pay for them—but it fell apart over whether to raise the gas tax. Current legislators could return to cast a lame-duck vote on a deal, but more likely it falls to the new Legislature, where Democrats may have a supermajority (but perhaps not the political will) to raise taxes without Republican support. They also could revisit the petroleum industry’s previous, unsuccessful, push to scrap California’s low-carbon fuel standard.\nHousing:\nWith housing prices hitting critical condition in several parts of the state, the governor floated a plan this year to build more affordable housing—by easing environmental review requirements for developers whose projects included housing for low-income residents. The proposal floundered under objections from labor unions and environmentalists.\nOdds are it will resurface. Expect unions and environmentalists to pressure progressive Dems not to relax rules aimed at protecting jobs or the environment just to accelerate construction. Also expect the real estate industry to lobby moderate Dems against any attempts to enact rent control or add fees to property transactions.\nThe California Association of Realtors has spent $1.5 million on independent expenditures in the general election, including ads to support Berman in Palo Alto and oppose Kalra in San Jose. The California Apartment Association, which represents landlords, is spending to support Berman, Brown, Bocanegra, Grayson and Dodd, and oppose Kalra and Torlakson.","url":"https://calmatters.org/articles/dueling-dems-4-issues-may-hinge-on-what-brand-of-democrat-wins/"}
