{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 02:15:05","date_modify":"2018-10-23 02:15:05","date_publish":"2016-01-28 17:02:43","description":"Duke University, North Carolina, had banned all sorority activities after the new pledge had to be rushed to hospital on Tuesday night. The student is expected to make a full recovery.","filename":"data/vaneerConsumption/DukeUniversitybanssororityactivitiesafteralcoholrelatedissueleftstudentcriticallyill.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC7BA200000578-0-image-a-24_1454000291927.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421278_Duke-University-bans-sorority-activities-alcohol-related-issue-left-student-critically-ill_1540260905.html","title":"Duke University bans sorority activities after 'alcohol-related issue' left student critically ill","title_page":"Duke University bans sorority activities after 'alcohol-related issue' left student critically ill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Within a few hours ban was lifted after sororities agreed to review culture of 'alcohol use and abuse'\nCollege held emergency meeting with chapter presidents over concerns about the incident\nA North Carolina university has cracked down on its sororities after a student was left in critical condition due to an 'alcohol-related issue.'\nDuke University banned all sorority activities after the new pledge had to be rushed to hospital on Tuesday night. The student is expected to make a full recovery.\nIn a statement, the college revealed it had 'concerns about activities … during the most recent rush and bid periods, heightened by the hospitalization of a student for an alcohol-related issue.'\nDuke University banned all sorority activities after the new pledge had to be rushed to hospital on Tuesday night\nBut within a few hours, the ban was partially lifted following an emergency meeting between administrators, ten chapter presidents and the Panhellenic executive board.\nLarry Moneta, vice president for student affairs, said everyone 'agreed that what happened last night was unacceptable and that steps must be taken to prevent any similar recurrence'.\nHe added that each chapter will be asked to review its activities to ensure they comply with the college's policies on social events, rush, and alcohol use.\n'Steps that can be taken to undermine a social culture, not unique to Duke. That is excessively focused on alcohol use and abuse,' he said in a statement.\nLarry Moneta, vice president for student affairs, has since announced they are lifting the ban in a statement\nMoneta said that after meeting with the chapter presidents, they had agreed to focus on changing the drinking culture within their own sororities.\nSorority chapters are still subject to sanctions but will now be able to host study breaks, sisterhood events, chapter meetings, and philanthropy and community-service activities.\nRestrictions on social events will most likely be lifted in the near future.\nThe girl, who has not been named, was hospitalized amid the sororities' rush events where the chapters hold events to solicit potential new members.\nShe had recently joined one of the college's ten Panhellenic sororities although it was not clear which one.\nDuke's other eight non-Panhellenic chapters, which belong to other national sororities, are not affected, USA Today reported.","url":"https://www.dailymail.co.uk/news/article-3421278/Duke-University-bans-sorority-activities-alcohol-related-issue-left-student-critically-ill.html"}
