{"authors":[],"date_download":"2018-10-30 18:04:32","date_modify":"2018-10-30 18:04:32","date_publish":"2018-07-31 20:54:00","description":"In what has become a signature event in Dunwoody, the Dunwoody Nature Center’s annual But...","filename":"data/vaneerConsumption/DunwoodyNatureCentersButterflyFestivalreturnsnextmonth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/07/Videos/4411341.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_dunwoody-nature-_98528e0e180517b0c59a806d1809a94b__1540922672.html","title":"Dunwoody Nature Center’s Butterfly Festival returns next month","title_page":"Dunwoody Nature Center’s Butterfly Festival returns next month&n","title_rss":"NULL","source_domain":"ajc.com","text":"In what has become a signature event in Dunwoody, the Dunwoody Nature Center’s annual Butterfly Festival is set to take place on Saturday, Aug. 11.\nIn this file photo, a butterfly perches on a flower during the Butterfly Festival at the Dunwoody Nature Center. (Jonathan Phillips)\nThe 25th annual Butterfly Festival takes place on the 22-acre campus of the nature center and will feature three butterfly tents that enable guests to have a longer, less crowded experience surrounded by hundreds of live butterflies. Also, guests will be entertained throughout the day with games, animal encounters, live music, scavenger hunts and “discovery stations” throughout the park. You can even get your face painted like a butterfly.\nFile photo: Hundreds of butterflies fill multiple tents during the event which also features birds of prey, children's activities and food. (Jonathan Phillips)\nThe festival is presented by Cox Enterprises, which owns The Atlanta Journal-Constitution, through the Cox Conserves environmental sustainability program.\nThe 25th annual Butterfly Festival; 10 a.m.-4 p.m. Aug. 11 (members get early admission at 9 a.m.). Tickets are $4-$8 in advance; $5-$10 on the day of the event. 5343 Roberts Drive, Dunwoody, 770-394-3322,www.dunwoodynature.org.\nMORE: Your guide to the Center for Puppetry Arts\nLooking for more? Listen to our weekly accessAtlanta podcast, which offers more ideas for things to do in and around Atlanta.","url":"https://www.ajc.com/lifestyles/dunwoody-nature-center-butterfly-festival-returns-next-month/1EGDXZ9NDPDvo0YmCXLo7N/"}
