{"authors":[],"date_download":"2018-10-30 20:33:11","date_modify":"2018-10-30 20:33:11","date_publish":"2015-08-27 16:59:35","description":"A Dunwoody man has been sentenced to one year and nine months in federal prison for impersonating an armed Drug Enforcement Administration agent after having previously been convicted of a felony.","filename":"data/vaneerConsumption/DunwoodymanwhoimpersonatedDEAagentsentencedtoprison.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/04/04/Images/photos.medleyphoto.7068394.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_dunwoody-ma_812c27ed4c9b957ec1c75ee41335e374__1540931591.html","title":"Dunwoody man who impersonated DEA agent sentenced to prison","title_page":"Dunwoody man who impersonated DEA agent sentenced to prison","title_rss":"NULL","source_domain":"ajc.com","text":"A Dunwoody man has been sentenced to one year and nine months in federal prison for impersonating an armed Drug Enforcement Administration agent after having previously been convicted of a felony.\nDaniel Harbison, 40, had been impersonating a DEA agent for several weeks when he conducted an April 3 traffic stop in Doraville using green and white flashing LED lights, U. S. Attorney John Horn said. Unknown to Harbison, the Chevrolet Suburban he stopped was being driven by an off-duty corporal with the Doraville Police Department. Harbison, who wore a T-shirt printed with the letters “DEA,” carried a .45 caliber handgun in a thigh holster, and had a DEA identification card as well as a gold and blue badge engraved with the letters “US,” Horn said.\nThe Doraville officer identified himself and asked Harbison why his LED lights were green and white, not blue and white. Harbison said it was because he was a federal agent. When the Doraville officer told him other police officers were en route, Harbison returned to his vehicle and drove away from the scene.\nPolice officers arrested Harbison at his residence and recovered the .45 caliber handgun, the DEA T-shirt, the LED lights, the DEA card and the gold and blue badge.\nBecause he had been previously convicted of at least two felonies, Harbison could not legally possess the gun. A grand jury charged Harbison with being a felon in possession of a firearm and he pleaded guilty on June 9.\nAt the end of his prison sentence, Harbison must spend three years on supervised release.","url":"https://www.ajc.com/news/crime--law/dunwoody-man-who-impersonated-dea-agent-sentenced-prison/FSlAHtDWzwVi8FyJ2eeTCL/"}
