{"authors":[],"date_download":"2018-10-30 20:09:38","date_modify":"2018-10-30 20:09:38","date_publish":"2017-04-07 18:56:00","description":"Memorial services are set for Phineas Haq, a Dunwoody High cross-country runner who died in an accident on spring break.","filename":"data/vaneerConsumption/Dunwoodyatalossforwordsafterstudentdiesonspringbreak.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/07/Images/Dunwoody%20high.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dunwoody-loss-fo_0e76c3daa26eec6560fedea796865108__1540930178.html","title":"Dunwoody ‘at a loss for words’ after student dies on spring break","title_page":"Dunwoody ‘at a loss for words’ after student dies on spring break","title_rss":"NULL","source_domain":"ajc.com","text":"Memorial services are set for Phineas Haq, a sophomore Dunwoody High cross-country runner who died in an accident on spring break.\n“We are all deeply saddened by the sudden loss of Phineas Haq,” Andrew Chappell, youth minister at Phineas’ church, Dunwoody United Methodist, said in a message to members. “He was a beloved member of this church and community, and many of us are at a loss for words.”\nDetails on the nature of the accident haven’t been released.\nIt’s been hard to process the grief, Chappell said, particularly because so many are spread out for spring break.\n“That is why I think it is important for us to be together,” he said.\nSunday evening, from 6:30 to 7 p.m. the church, located at 1548 Mount Vernon Road, is hosting a service to remember Phineas.\nA memorial service will be held at the church next Saturday, April 15, at 1 p.m. with a reception to follow.\nIn lieu of flowers, the family is asking well-wishers to make donations to the Phineas Haq Memorial Fund at Dunwoody United Methodist Church, Chappell said.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram\n--\nIn other news:","url":"https://www.ajc.com/news/local/dunwoody-loss-for-words-after-high-school-athlete-dies-fla/xvrBZ53cmiQjUABgoQEM9K/"}
