{"authors":["Press Association"],"date_download":"2018-10-23 05:00:32","date_modify":"2018-10-23 05:00:32","date_publish":"2016-01-11 18:14:24","description":"Democratic Unionist Party MP Jim Shannon is being investigated by the Independent Parliamentary Standards Authority's compliance officer over parliamentary e...","filename":"data/vaneerConsumption/Dupsjimshannonprobedoverexpensesclaim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-34194011-dcdb-4fdb-bb11-9021000bbf34-48qEJGFphM8d437f0aaf927dc986-152_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393811_DUPs-Jim-Shannon-probed-expenses-claim_1540270832.html","title":"Dup's jim shannon probed over expenses claim","title_page":"Dup's jim shannon probed over expenses claim | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DUP's Jim Shannon probed over expenses claim\nDemocratic Unionist Party MP Jim Shannon is being investigated by the Independent Parliamentary Standards Authority's compliance officer over parliamentary expenses claims.\nThe watchdog said the rare formal probe concerns a claim by the Strangford MP relating to travel and subsistence but that no further details of the alleged wrongdoing will be published until it had been concluded.\nCompliance officer Peter Davis has faced criticism for settling almost all his cases without any publicity - despite promising to disclose the outcome of all investigations.\nThe DUP's Jim Shannon after winning the Strangford seat at the count centre in Newtownards\nThe approach - recently laid bare in a response to a Freedom of Information (FOI) request - emerged after Mr Davis was criticised for failing to announce that claims by three MPs had been referred to police last year.\nThe watchdog, who operates separately from Ipsa, was previously forced to back down when he proposed carrying out investigations in secret to prevent \"reputational damage\" to MPs.\nBut new details of his casework suggests he has been avoiding disclosure by staging in-depth \"assessments\" of complaints, during which politicians can hand back money or resolve issues without facing formal \"investigations\".\nSome 40 \"assessments\" were undertaken in 2014-15, but just one - relating to Tory Bob Blackman's mileage claims - became a formal investigation and was therefore revealed publicly.\nLast year, Mr Shannon was the highest-claiming MP - paid a total of £205,798.23 in taxpayer-funded expenses, excluding travel.\nGiving his initial reaction, Mr Shannon said he thought the probe related to mileage claims made by his staff, though said he was not certain that was its focus.\n\"If that's what it's about, and I presume it probably is - the staff mileage - (then) all the facts are there, all the mileage is there, all the details are there, all the information is there - there is nothing to worry about,\" he said.\nThe DUP representative, who was first elected to Westminster in 2010, said he would provide the watchdog with all the relevant facts and figures to prove there had been no wrong-doing.","url":"https://www.dailymail.co.uk/wires/pa/article-3393811/DUPs-Jim-Shannon-probed-expenses-claim.html"}
