{"authors":["Caitlyn Callegari"],"date_download":"2018-10-30 23:09:46","date_modify":"2018-10-30 23:09:46","date_publish":"2014-08-14 01:06:14","description":"Dustin Diamond, when will you learn? You can't shake Screech! Yeah, so, he's made some questionable decisions since Saved By The Bell ended and they were, um, incredibly un-Screech like, but that doesn't mean that's who he really is. In fact, Dustin…","filename":"data/vaneerConsumption/DustinDiamondThinksHesLeftHisSavedBytheBellRoleBehindButYouCantShakeScreech.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ffed0d9e-c577-4c0f-b139-bd67498a8239.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35710-dustin-diamond-thinks-hes-left-his-saved-by-the-bell-role-behind-but-you-cant_1540940986.html","title":"Dustin Diamond Thinks He's Left His 'Saved By the Bell' Role Behind - But You Can't Shake Screech!","title_page":"Dustin Diamond Thinks He's Left His 'Saved By the Bell' Role Behind — But You Can't Shake Screech!","title_rss":"NULL","source_domain":"bustle.com","text":"Dustin Diamond, when will you learn? You can't shake Screech! Yeah, so, he's made some questionable decisions since Saved By The Bell ended and they were, um, incredibly un-Screech like, but that doesn't mean that's who he really is. In fact, Dustin Diamond was was quoted saying he did those things purposely to distance himself from the character. He revealed to The Daily Beast that's he's over his wild antics, stating, \"But I’m done with that. I think it backfired a bit. But honestly, on the flip side, I think it did break the image. People did only see me as an 11-year-old goofball from a Saturday morning campy TV show.”\nUh, right. Well I'm here to remind you that Screech is here to stay with some of his nerdiest moments.\nImages: Giphy (6)","url":"https://www.bustle.com/articles/35710-dustin-diamond-thinks-hes-left-his-saved-by-the-bell-role-behind-but-you-cant"}
