{"authors":["Associated Press"],"date_download":"2018-10-22 23:53:58","date_modify":"2018-10-22 23:53:58","date_publish":"2017-03-16 08:09:49","description":"THE HAGUE, Netherlands (AP) - Dutch political parties are preparing to start what will likely be a long process of coalition talks after Prime Minister Mark...","filename":"data/vaneerConsumption/DutchlooktolongcoalitiontalksafterRuttewinselection.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/08/wire-227341-1489652678-597_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319178_Dutch-look-long-coalition-talks-Rutte-wins-election_1540252438.html","title":"Dutch look to long coalition talks after Rutte wins election","title_page":"Dutch look to long coalition talks after Rutte wins election | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"THE HAGUE, Netherlands (AP) - Dutch political parties are preparing to start what will likely be a long process of coalition talks after Prime Minister Mark Rutte's right-wing VVD party easily won national elections, defying polls that suggested a close race with anti-Islam populist Geert Wilders.\nWith most votes counted for the 150-seat legislature early Thursday, Rutte's VVD has 33 seats, eight fewer than in 2012. The far-right populist Party for Freedom of Wilders is second with 20 seats, five more than the last time but still a stinging setback.\nThe Christian Democrats and centrist D66 parties - likely future coalition partners for Rutte - have 19 seats each.\nPrime Minister Mark Rutte of the free-market VVD party smiles after exit poll results of the parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)\nParty leaders are expected to meet early afternoon to discuss first steps in the coalition formation process.\nDutch Prime Minister Mark Rutte gives 'high five' to children after casting his vote for the Dutch general election in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)","url":"https://www.dailymail.co.uk/wires/ap/article-4319178/Dutch-look-long-coalition-talks-Rutte-wins-election.html"}
