{"authors":["Ben Kew"],"date_download":"2018-10-30 20:37:54","date_modify":"2018-10-30 20:37:54","date_publish":"2018-08-03 23:06:13","description":"Filipino President Duterte may send a frigate warship to Libya to save three Filipinos and a South Korean man kidnapped from a water plant.","filename":"data/vaneerConsumption/DuterteConsidersSendingFrigateWarshiptoRescueFilipinoCaptivesinLibya.json","image_url":"https://media.breitbart.com/media/2018/08/f-duterte-a-20180405-870x624.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_08_03__1540931874.html","title":"Duterte Considers Sending Frigate Warship to Rescue Filipino Captives in Libya","title_page":"Duterte Considers Sending Frigate Warship to Rescue Filipino Captives in Libya","title_rss":"NULL","source_domain":"breitbart.com","text":"Philippines President Rodrigo Duterte is considering sending a frigate warship to Libya to save three Filipinos and a South Korean man kidnapped from a water plant in the troubled country, a CNN report revealed Friday.\nIn a video circulated this week, the abducted Filipino workers pleaded with Duterte to fight for their release.\n“If they start hurting those three Filipinos, I will bring a frigate there, I am not kidding,” Duterte said in a speech after the men’s identities were confirmed by a spokesman for the country’s Department of Foreign Affairs.\n“The Philippine Embassy in Tripoli has confirmed that the three Filipinos shown there are the three technicians who were taken by armed men from their work site some 500 kilometers from Tripoli,” DFA spokesperson Elmer Cato said in a statement.\nPresidential Spokesperson Harry Roque also confirmed that the government was engaging in efforts to secure the men’s release, that even included flying to Libya before the trip was canceled.\n“(Labor) Secretary (Silvestre) Bello and I were supposed to fly to Libya,” Roque said at a press briefing. “But it was canceled because of security considerations. But we took steps to prepare for the trip.”\nAccording to Yonhap News Agency, South Korean officials redirected a warship from the Gulf of Aden taking part in anti-piracy operations to help with the efforts, while pledging to do their utmost to secure the man’s release.\n“His country and his president have never once forgotten him,” presidential spokesman Kim Eui-kyeom said in a statement. “On the first day he was abducted, the president ordered the government to do its utmost with all resources the country has.”\n“The government has been maintaining a close cooperation system with the government of Libya and other allies, such as the Philippines and the United States, since the day of the incident for his safety and release,” he continued. “We are even listening to the silence of the desert as long as the information is related to the armed insurgents that kidnapped (the South Korean).”\nAlthough the identity of the assailants is not known, such incidents are common in Libya in the wake of the country’s civil war, with armed groups and terrorist organizations often kidnapping foreign workers in return for a ransom as different militias and political factions continue vying for power.\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.","url":"https://www.breitbart.com/national-security/2018/08/03/duterte-considers-sending-frigate-warship-to-rescue-filipino-captives-in-libya/"}
