{"authors":["Press Association"],"date_download":"2018-10-23 01:48:31","date_modify":"2018-10-23 01:48:31","date_publish":"2017-04-26 12:29:09","description":"Shoppers urged to do research before buying Duty Free goods.","filename":"data/vaneerConsumption/DutyfreeginperfumeandTobleronearecheaperatthesupermarketsaysWhich.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464837-1493206152-674_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447384_Duty-free-gin-perfume-Toblerone-cheaper-supermarket-says-Which_1540259311.html","title":"Duty free gin, perfume and Toblerone are cheaper at the supermarket, says Which?","title_page":"Duty free gin, perfume and Toblerone are cheaper at the supermarket, says Which? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bargain airport prices for favourites such as gin and Toblerone are now likely to be cheaper at the supermarket, a consumer group has found\nA 360g bar of Toblerone cost £4 at Bristol World Duty Free but just £3 at Asda, while an £18 70cl bottle of Tanqueray gin at Heathrow Terminal 2 could be found for £15 at Morrisons, Which? Travel found.\nA Toblerone bar can be found cheaper at supermarkets than duty free stores (A World Duty Free at Heathrow Airport (Steve Parsons/PA)\nDespite a common assumption that airport shopping will cut out the VAT, shoppers could save £21 buying a 100ml bottle of Eternity for Men Eau de Toilette on Amazon for £25 rather than at Birmingham World Duty Free for £46, according to the watchdog’s study.\nToy bargain hunters can buy the Lego Star Wars Millennium Falcon for £20 less at Toys R Us online than at Gatwick South World Duty Free.\nAnd Which? said it was “stunned” to find the SanDisk Extreme Plus 64GB camera memory card selling for £73 more at Glasgow International’s Dixons Travel than at Currys online.\nWhich? investigation shows how badly you're getting ripped off at airports and how to avoid some exorbitant charges. https://t.co/XYx0QG65tc — Which? (@WhichUK) April 26, 2017\nThe organisation checked all the prices between March 10 and March 13, including the cost of delivery on online orders and rounding figures to the nearest pound.\nThe watchdog said consumers could find savings at airport shops, noting that it found the iPad mini 2 and Fitbit Flex 2 both for £10 less at Dixons Travel at Glasgow International airport than online at John Lewis.\nBut it urged shoppers to “always do your research before you head to the airport to make sure the ‘deal’ is not actually dearer than you find on the high street or online”.\nThe investigation did find shoppers could find an iPad cheaper at airports (Anthony Devlin/PA)\nDixons Travel said the pricing of its memory card was an “error which is being corrected”.\nIt said: “At Dixons Travel we have a clear pricing policy in place.\n“We follow the common practice of non-duty free airport retailers in offering one single, great value price across products, regardless of destination, underpinned by our price promise.\n“We offer online beating prices with big brand products such as tablets, laptops, cameras, mobile phones, speakers and premium headphones typically 5% to 10% cheaper than other retailers, both in-store and online.\n“If on the rare occasion one of these products is found cheaper at a competitor, we will double the difference instantly at the till.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447384/Duty-free-gin-perfume-Toblerone-cheaper-supermarket-says-Which.html"}
