{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 23:22:23","date_modify":"2018-10-22 23:22:23","date_publish":"2016-01-11 05:36:29","description":"He recently welcomed a newborn baby girl last month but Dwayne 'The Rock' Johnson brought his first born daughter as his date to the 73rd annual Golden Globe Awards on Sunday","filename":"data/vaneerConsumption/DwayneJohnsontakesdaughterSimonetotheGoldenGlobeAwards.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004CE2C00000578-0-image-a-106_1452486542649.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393335_Family-matters-Dwayne-Johnson-proud-father-takes-daughter-Simone-14-Golden-Globe-Awards_1540250543.html","title":"Dwayne Johnson takes daughter Simone to the Golden Globe Awards","title_page":"Dwayne Johnson takes daughter Simone to the Golden Globe Awards | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He welcomed baby daughter Jasmine just last month.\nBut with mother and child bonding at home, it was his oldest child who accompanied Dwayne 'The Rock' Johnson to the Golden Globe Awards in Beverly Hills on Sunday.\nThe 43-year-old looked like one proud papa as Simone Alexandra Johnson, 14, showed support by her father's side.\nScroll down for video\nFamily matters! Dwayne Johnson, 43, brought his daughter, Simone Alexandra Johnson, 14, as his date to the 73rd annual Golden Globe Awards in Beverly Hills on Sunday\nThe WWE star-turned-actor stood out from the crowd in a velvet maroon tuxedo jacket with black satin necktie.\nHe donned fitted black tuxedo trousers and wore velvet black dress shoes to coordinate with his unique choice of jacket for the event.\nDuring the evening Johnson helped present the award for Best Actress in a Limited Series or Motion Picture for TV alongside Jennifer Lopez.\nJ-Yellow! During the evening Johnson helped present the award for best actress in a limited series or motion picture for TV alongside Jennifer Lopez\nThe pop star and TV host oozed sultry sophistication in her caped Giambattista Valli‎ gown with figure-hugging ruching and thigh-high slit.\nSimone was The Rock's daughter from his first marriage to Dany Garcia, from whom he separated in 2007.\nHe has been with his girlfriend, Lauren Hashian since the separation and they have lived together for the past eight years.\nHandsome hunk! The WWE star-turned-actor looked sharp and stood out from the crowd in a velvet maroon tuxedo jacket with black satin necktie\nThe Fast and Furious actor may have a hardman exterior, but he has a soft-centre - particularly when it comes to baby Jasmine who was born earlier this month.\nHe welcomed her into the world with Hashian, and shared a cute video singing to his sleeping baby as he held her in his giant arms on Christmas Eve.\nThe Rock displayed remarkably vocal prowess, as well as joking around that his daughter had followed in his tough-guy image by replying to him that she was going to 'his kick Santa Claus' a**, daddy.'\nTiny tot: The Fast and Furious actor may have a hardman exterior, but he has a soft-centre - particularly when it comes to his baby daughter Jasmine who was born last month\n2016 GOLDEN GLOBE AWARDS WINNERS - TELEVISION Best Performance by an Actress in a Limited Series or Motion Picture Made for Television Uzo Aduba, Orange is the New Black Joanne Froggatt, Downton Abbey Regina King, American Crime Judith Light, Transparent Maura Tierney, The Affair Best Performance by an Actor in a Limited Series or Motion Picture Made for Television Idris Elba, Luther Oscar Isaac, Show Me a Hero David Oyelowo, Nightingale Mark Rylance, Wolf Hall Patrick Wilson, Fargo Best Performance by an Actress in a Television Series – Drama Caitriona Balfe, Outlander Viola Davis, How to Get Away with Murder Taraji P Henson, Empire Eva Green, Penny Dreadful Robin Wright, House of Cards Best Performance by an Actor in a Television Series – Musical or Comedy Aziz Ansari, Master of None Gael Garcia Bernal, Mozart In The Jungle Rob Lowe, The Grinder Patrick Stewart, Blunt Talk Jeffrey Tambor, Transparent Best Performance by an Actor in a Television Series – Drama Jon Hamm, Mad Men Rami Malek, Mr Robot Wagner Maura, Narcos Bob Odenkirk, Better Call Saul Liev Shreiber, Ray Donovan Best Performance by an Actress in a Television Series – Musical or Comedy Rachel Bloom, Crazy Ex-Girlfriend Jamie Lee Curtis, Scream Queens Julia Louis Dreyfus, Veep Gina Rodriguez, Jane the Virgin Lily Tomlin, Grace and Frankie\nBest Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Lady Gaga, American Horror Story Sarah Haye, Flesh and Bone Felicity Huffman, American Crimes Queen Latifah, Bessie Kirsten Dunst, Fargo Best Television Limited Series or Motion Picture Made for Television American Horror Story Fargo Flesh And Bone Stars Wolf Hall Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Alan Cumming, The Good Wife Damian Lewis, Wolfhall Ben Mendelson, Bloodline Tobias Menzies, Outlander Christian Slater, Mr Robot Best Television Series - Musical or Comedy Orange Is The New Black Silicon Valley Transparent Veep Casual Mozart In The Jungle Best Television Series - Drama Empire Game of Thrones Mr Robot Narcos Outlander","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393335/Family-matters-Dwayne-Johnson-proud-father-takes-daughter-Simone-14-Golden-Globe-Awards.html"}
