{"authors":[],"date_download":"2018-10-30 01:09:31","date_modify":"2018-10-30 01:09:31","date_publish":"2014-05-09 17:23:00","description":null,"filename":"data/vaneerConsumption/DwellingintheFireBokoHaramsWarAgainsttheWest.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/05/BokuHaram1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861771.html","title":"Dwelling in the Fire: Boko Haram’s War Against the West","title_page":"Dwelling in the Fire: Boko Haram’s War Against the WestThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"A common vial sits perched on a police laboratory shelf in the arid northern Nigerian city of Kano, its cap smeared with rubber cement and fastened with an official seal. The contents of this bottle are unmistakable, with ashen powder, charred molars, and bone residue bearing all the hallmarks of a hasty cremation. Affixed is a label: The remains of the Late Malam Muhammadu Marwa alias Allah Ta-Tsine or Maitatsine. Such is the final resting place of the notorious millenarian prophet and anti-western insurgent who in 1980 set off a wave of violence as arbitrary as the contents of a fever dream, and whose legacy still manifests itself in the form of the riotous civil paroxysms that occur with malarial regularity in Nigeria’s roiling Islamic north. Today, with unprecedented attention being focused on the Nigerian Islamist militant organization Boko Haram, owing in no small part to its recent kidnapping and detention of almost three hundred schoolgirls in the so-called “evil forest” of the Sambisa, it is more necessary than ever to grapple with Marwa’s legacy and its implications for the future of a continent.\nMarwa’s sobriquet, “Maitatsine,” provides a solid indication of his worldview, derived as it was from the Hausa verb tsini, “to damn.” In his sermons, Marwa damned most everyone, secular and religious alike, whether it was for driving cars, for smoking cigarettes, or for wearing buttons, and that was before theological considerations had even been broached. Yet Marwa and his followers — known as the ‘Yan Tatsine or the Kano-Kato— were themselves decidedly heterodox. They prayed facing north, not towards Mecca, and relied upon sympathetic magic and juju. Innovations like a proprietary “magic sand” that was said to ward off police projectiles, working in conjunction with mystical charms fashioned from hacked-up human organs, helped buttress the preternatural confidence of the ‘Yan Tatsine movement, as did a certain willful ignorance crasse et supine. “Any Muslim who reads any book beside the Koran,” Marwa declared, “is a pagan.”\nFor the learned Alhaji Abubakar Gummi, the Grand Khadi of the Northern Region at the time, Maitatsine was merely one of a “trail of one-track minded malams [religious scholars] versed only in the recitation of the Quran by heart, and not fully comprehending what it contained.” Widespread criticism along these lines did nothing, however, to prevent thousands of fanatics and lost souls from squatting in the Yan Awaki quarter of Kano, particularly after their Mahdist-millenarian prophet assured them that “all land plots in this world belong to Allah and he does not have to ask permission of anyone before building on any plot.” All that remained was to craft invincibility potions, stockpile arms, and await both the inevitable confrontation with Nigerian security forces and the marrow-burning rapture sure to follow.\nWhile Nigeria as a whole was reaping the benefits of its first petroleum boom (1974-1981), Marwa was tapping into an equally rich, and equally combustible, vein which had been deposited in epochs past. As early as 1493, the Islamic scholar Al-Maghili was breathlessly informing the ruler of the western African empire of the Songhai that God would “send to men a learned man to renew religion…he is to ordain what is right and forbid evil and by establishing justice among men and by making the oppressed triumph over the oppressor to reform the affairs of men.” The interlarding of Mahdism and something approaching Marxism evidently dates back centuries.\nBy the seventeenth century, millenarian figures were garnering massive and destabilizing followings in places like Mauretania and Senegal. The French colonial official Louis Moreau de Chambonneau somewhat cynically described one of them, Nasr al-Din, as having touched off a revolt so as “to uplift the Senegalese and help them kill or put flight to their kings, on the pretext of religion and divine revelation.” As Nasr al-Din preached that “the people were not made for the king but the king for the people,” and that the presence of jugglers and musicians in the Senegalese court was an abomination, his followers shaved their heads, rent their garments, and with crude weapons in hand set out to hasten the demise of the great kingdoms of West Africa.\nColonialism would only fan the flames of millenarianism, as ancient patterns repeated themselves, and as the history of this region continued to flow through the channels of its natural inclination. In 1941, a trader in Maitatsine’s future stomping grounds reported that “there is clear evidence indicating the imminent appearance of the Mahdi,” and that undeniable proof was to be found in the “coming of the Europeans.” Around the same time, an anonymous Nigerian poet warned against the use of hurricane lamps and the wearing of khaki and pajamas (“who wears them and prays in them, he has committed a crime”), before concluding:\nTowel and washing blue and powder\nWhoever uses them\nCertainly on the last day the fire is his dwelling.\nMuhammadu Marwa was hardly the first, then, to claim that “anyone wearing a watch, or riding a bicycle, or driving a car, or sending his child to the normal State schools was an infidel.” But on December 18, 1980, he did manage, in unprecedented fashion, to bring fire to the dwellings of those “pagans” with whom he shared the city of Kano. More than four thousand individuals perished during Marwa’s uprising, and tens of thousands lost their homes. It took the combined efforts of the Nigerian army and air force to restore order after clashes. As the rebels described it in their atavistic incantations:\nAnd the birds were sent on them which threw on them stones from fire,\nAnd were left like burnt stalks.\nThough Marwa would die of injuries sustained in the initial clashes, and though his body would be exhumed, cremated, and secreted in a Kano police station, it would take years to suppress the ‘Yan Tatsine insurgency; Marwa’s lieutenant and disciple, Musa Makaniki, would evade capture until 2004.\nIn present-day Kano, Marwa’s baleful legacy can be discerned in the bullet holes that still pockmark walls, and the persistent nightmares that still haunt some of the city’s residents. But it may also be seen in the October 2013 “immorality crackdown” launched by the Hisbah state police, who arrested scores of Nigerians for crimes like “indecent dressing in contravention of the Sharia legal code,” which could mean a footballer-inspired haircut or a pair of trousers worn too low on the waist. The Nigerian central government’s victory over the ‘Yan Tatsine did little to stop movements like the Society for the Eradication of Evil Innovation and the Establishment of the Sunna from taking root in Kano, nor did it prevent other sects like the Kalo-Kato, whose acolytes preach a “contaminated Islam” noteworthy for its abandonment of the Hadith, from erupting throughout northern Nigeria.\nIn Kano and elsewhere, along the edge of the barren, rock-strewn Sahel, the war on “pagans” and their “evil innovations” continues apace, and no sect has been more proactive in prosecuting it than Boko Haram, the most ferocious ideological heir of the apocalyptic ‘Yan Tatsine. When gun battles rage in Kano’s Hotoro Dan Marke district, when soldiers raid suicide vest factories in the outlying village of Gunduwawa, and when GRE and TOEFL examinations are cancelled throughout the nation out of concerns for student safety, one can be sure that Boko Haram is to blame. Its campaign of terror — including infamous attacks on United Nations facilities in Abuja, Christian districts in Kano and Jos, and perhaps most shockingly the September 2013 slaughter carried out at the College of Agriculture in Yobe State — have led to the declaration of a state of emergency in three northeastern states. The April 15, 2014 abduction of hundreds of schoolgirls from a northeastern Nigerian secondary school has certainly served to focus international attention on this ongoing crisis, but it is only one of a multitude outrages inflicted on the civilian population of the region in recent years, albeit one rather more suitable for our era’s predilection for “hashtag activism,” viz. “#Bringbackourgirls.”\nBy combining the anti-western principles of Marwa and likeminded figures with the tools of modern terrorism, Boko Haram has become an existential threat to the Nigerian state and a torchbearer of recrudescent millenarianism in West Africa. Its current leader, Abubakar Shekau, even maintains that “our strength and firepower has surpassed that of Nigeria. Nigeria is no longer a big deal as far as we are concerned. We can now comfortably confront the United States of America.” Never did the ‘Yan Tatsinerange so far and wide, and now the world is reluctantly obliged to take stock of yet another millenarian sect bent on the overthrow of civil society, and this time one with strong links to al-Qaeda in the Islamic Maghreb and to Somalia’s al-Shabab.\nThe organization that has set northern Nigeria ablaze is properly known as the Congregation of the People of Tradition for Proselytism and Jihad, though its moniker of Boko Haram, roughly translated from the Hausa as “western education is forbidden,” is rather more evocative. In its formative period, between 1995 and 2009, Boko Haram was led by a cleric by the name of Mohammed Yusuf, who established a religious complex in Maiduguri and proceeded to thunder against a Nigerian state he held to be based on kufr, or “unbelief.” It was not until the June of 2009 that Yusuf’s movement came into violent confrontation with state security forces, but when it did, more than a thousand people perished in Maiduguri alone. In an open letter to the “fake President of Nigeria” and the “lowly weakling,” Governor Ali Sheriff of Borno State, Yusuf warned that his movement would neither “forget nor forgive” police actions, and demanded the disarmament of security forces. “You keep talking about peace, peace and peace. Since you worship peace as your pagan god, you can worship it in that way,” he growled. In no wise could Boko Haram be said to worship the impious idol of peace, as their later victims in Abuja, Kano, Jos, Damaturu, Gadaka, and elsewhere might readily attest.\nBefore the summer was out Yusuf was dead, his body riddled with bullets, but his acolytes carried on the tradition, lashing out at commercial banks, churches, schools, newspapers bureaus, bars, and any other institution associated with colonialism, secularism, or western liberalism. Yusuf’s successor, the aforementioned Abubakar Shekau, recently summed up Boko Haram’s ideology, such as it is: “Forget about constitution and accept Shariah. We don’t have socialism, we don’t know communism, we don’t want federalism, but we are Muslims.” That formulation, however vague, is more than sufficient for the thousands of militants who have flocked to the organization’s colors, though opportunists with ulterior motives are also seen latching onto the movement. (Kashim Shettima, the governor of Borno State, has observed that “Boko Haramhas become a franchise that anyone can buy into.”) And so from all across Nigeria they come, and from throughout the Sahel, from Cameroon, Niger, and Chad, be they ensorcelled by millenarian Mahdism or merely in thrall to the will-to-power, all in the hopes of toppling a Nigerian government marked as taghut, or “ungodly.”\nBack in 1985, shortly after the Maitatsine insurgency, the scholar Paul Lubeck warned: “Should the uprooted, deprived and repressed urban masses ever unite around a charismatic leader with a coherent ideology and an organization capable of mobilizing the excluded, then the anti-institutional energy expressed by the ‘Yan Tatsine may generate a radically different outcome than self-destructive millenarian protest.” Whether Boko Haram constitutes such a movement remains to be seen. In late October of 2013, the Nigerian government of President Goodluck Jonathan presented a captured twenty-two year old Boko Haram insurgent to the media, who provided a disillusioned account of life amongst the rebels. The name of Allah, the anonymous former fighter lamented, was only invoked when “we are running out of food supply in the bush. Our leaders will assemble us and declare that we would be embarking on a mission for God and Islam…I did not see any act of religion in there. We are just killing people, stealing and suffering in the bush.” Such testimony, even when taking into account its tailoring for popular consumption, is not quite the material for the sorts of epic poems told by griot praise singers, nor the makings of an insurrection that would altogether topple a country of 160 million. Yet Boko Haram has proven more than able to throw Africa’s most populous country and largest economy into a prolonged state of emergency, posing significant challenges in a strategically vital region.\nThere are still those in Nigeria who hold out hope that Boko Haram will simply fade away over time, representing just one more in a series of endemic millenarian uprisings. At an Eid prayer ceremony on October 15, 2013, the Emir of Ilorin, Mai-Martaba Alhaji Ibrahim Sulu-Gambari, confidently predicted that the “insecurity being experienced in many parts of the nation would not spread to the state.” But at the same event, the Chief Imam of Ilorin, Alhaji Mohammed Soliu Fulani, urged his fellow Muslims to “reflect soberly, as the nation needs serious prayers to sanitize it from the incessant terrorist attacks.” In a more philosophical vein, the imam added: “the only certain phenomenon in human life is death,” so “let us take life easy and always know that death will come one day and definitely go away with our souls. The only thing that can save us from the torment of the hereafter is the fear of God.”\nFulani’s poignant, fatalistic attitude seems unlikely to persuade the more militant of the “People of Tradition” to alter tack. It was during the 1980 Kano uprising that one of Marwa’s confederates was found wearing a necklace with the following Hausa inscription: “If I were cut into pieces and I die, I will come back again. There is no worthless person like Muhammadu Allah (sc. the Prophet Muhammad)…If I die, animosity ends, madness ends, paganism and unbelieving end…since the creation of man there was no infidel like Prophet Annabi Isa (sc. Jesus).” There is little reasoning, let alone formal negotiating, with such an unreservedly heterodox, occultist, and basically suicidal mindset. Such is the dilemma that has faced Nigerian central governments past and present.\nA lasting solution has traditionally been presented in terms of the pressing need for social and economic development in the Nigerian north. As the 1981 “Report of the Tribunal of Inquiry on Kano Disturbances” found,\nbecause of the very wide gap between the rich and the poor in our society…they were more than prepared to rise against the society at the slightest opportunity. After all, they did not have much to lose…This regrettable social situation in our society ought to be remedied immediately else it will continue to provide the required recruitment potential for disenchanted men like Marwa to rebel against the society.\nThe present-day leadership in Ilorin agrees, with the emir charging the government “at all levels to further ensure provision of basic social amenities,” while the Kano-born politician and intellectual Alhaji Maitama Sule has insisted that “if there is justice, the people in power will be concerned and create jobs, look after the people. It is not force that will make the people obey.” Numerous outsiders, including former U.S. Ambassador to Nigeria John Campbell, concur. “The ideal response by the Jonathan government would be conciliatory speeches, visits to the North, and the opening up of economic opportunities for those in the northern regions,” Campbell recently suggested.\nThis sort of political horror autotoxicus is understandable, and Boko Haram may very well be a symptom of northern Nigeria’s socio-economic ills, but it is far from certain that the proposed treatment would serve as an effective antibody within Nigeria’s wracked and harrowed body politic. “The grievances Boko Haram expresses,” Alex Thurston has noted, “are more diverse, less material, and are explicitly articulated as religious politics.” From time immemorial, elements within Nigerian Islamic society have explicitly rejected the sort of commercial and economic advances represented by western-style development, and the prescriptions and proscriptions of Boko Haram transcend such worldly matters. In the words of the Hausa poet Aliyu Rabi’u,\nO Allah, we are rebellious to other systems,\nAssist us in instituting Islam.\nOur mission is to destroy belief systems,\nAnd establish Islamic laws.\nWhat does the secularist have to offer in return? A battle for hearts and minds fought on these terms is destined to last for many years to come.\nEven the rhetoric of Ja’far Mahmud Adam, the so-called “Salafi counter-radical” and relatively moderate critic of Yusuf, would provide cause for concern. Though widely praised for lambasting Boko Haram’s founder for his “pure ignorance, not based on any knowledge, and without any link to Qur’an and Hadith,” Adam’s critique was not without its own warning signs. As Adam put it in an address to Yusuf, worth quoting at length:\nYou only know your little town. What do you know about the history of various struggles for Islam? How many years did al-Banna spend in struggle? How many years did Sayyid Qutb spend in struggle? What about the national liberation struggle in Algeria where one million martyrs were lost to the French colonizers? What do you know about the history of this struggle?… In the Sudan, al-Mahdi forced the British colonizers to flee: what do you know about that struggle? What have you learned from it? Nearer to home, how many battles did Usman dan Fodio fight? Apart from Fodio’s name, what do you know about his battles? In how many battles did he participate in the fighting? After equipping yourself with knowing the details of Prophet’ Muhammad’s battles, you also need to know about the conquest of the Byzantine Empire. The conquest of Persia is the most instructive. The struggles of Ibn Taymiyya against the Tartars’ destruction of Islamic civilization in Baghdad: what do you know about that? Above all, right now, what plans do you have?\nBoko Haram’s anti-intellectual approach was, for Adam, an embarrassment. But Adam shared with Yusuf the goal of the establishment of the khilafa, the yearned-for caliphate. As Muhammad Sani Umar interpreted it, Adam was actually “warn[ing] Muslims against confrontation with Nigerian government because they could not hope to win.” At least, not yet. So increasingly deep is the divide between Nigeria’s Christian south and Islamic north that there are those extremists content to play the long game, and who are not to be put off by conciliatory talks or economic development programs.\nWhat choice does the Jonathan government have, then, but to treat the conflict with Boko Haram as an existential struggle? Beset by other militant movements, including the Oodua Peoples Congress, the Movement for the Actualization of the Sovereign State of Biafra, the Movement for the Emancipation of the Niger Delta, and others, can the government in Abuja afford to be conciliatory towards the millenarians in the north? Kyari Mohammed, a Yola-based Boko Haram specialist, has noted that the Nigerian office of the national security adviser Sambo Dasuki “is thinking of ‘soft’ options such as counter-terrorism strategies and de-radicalization” — as evidenced by recent comments Dasuki that “we believe that we can win the war against terror by mobilizing our family, cultural, religious and national values” — but that “unfortunately, the process is military-driven.” And so it is likely to remain, as long as Boko Haram is in a position to go on the offensive. Attacks throughout the first half of 2014, launched against army barracks, boarding schools, and Catholic parishes, have only heightened tensions while keeping authorities scrambling for answers.\nWhen it comes to this ongoing crisis, the advice of outside actors, like the U.S. State Department, can be bromidic to say the least: “a combination of law enforcement, political, and development efforts, as well as military engagement” is needed, we are told. Willing and committed international partners are needed for such sweeping efforts, however. In the estimation of Freedom Onuoha of the Abuja-based Africa Center for Strategic Research and Studies, “the African Union is totally out of the picture, as it lacks capacity in these areas. The U.N. has little or nothing to offer. I think countries like the U.S., Israel, and the United Kingdom, among others, will be of great assistance.” That said, foreign assistance would necessarily lead to an internationalization of the conflict, bringing in more foreign fighters drawn from al-Qaeda in the Islamic Maghreb or al-Shabab. “The attack on the U.N. House in Abuja is likely a strategic move by the sect and its international collaborators to draw foreign forces into Nigeria and possibly make the country ungovernable,” Onuoha has noted. Millenarians are, after all, attracted to an apocalyptic struggle as moths to candles.\nFor more than three decades, Nigeria has been in the grip of this nightmare, and the ordeal has only been exacerbated by the arrival of international terror networks in West Africa. And unlike the Mahdists and millenarians of the past, those who lead Boko Haram in its campaigns against Christian, secular, educational, or western interests have a strategic, as opposed to merely tactical, outlook. “We had a grand plan to Islamize Nigeria,” two captured Boko Haram coordinators, Abu Qaba and Kabiru Sokoto, admitted in March of 2012. “We felt that a lot of Muslims were not practicing the religion faithfully as they should. Part of the plan was to reduce the powers of the Sultan to traditional ruler functions, only while all religious authority would be vested with our leader based in Yobe,” the two militants put it, adding: “The plans to attack churches and schools were not a reaction to any provocation. The plans had been there. You know why the churches had to go.” Spreading as speargrass does in the Nigerian savanna, Boko Haram has flourished where others have withered, carrying its plans to fruition and thereby imperiling peace, security, and development in a country which figures to be more populous than the United States by 2050.\nAt the height of the Maitatsine uprising, residents of Kano spoke archly of the insurgents and their “human spare-parts department,” those grisly abattoirs where the bodies of prisoners of the ‘Yan Tatsine were allegedly repurposed, so to speak, through sympathetic magic. Today, it is the Nigerian body politic itself that is being rent and hacked, divided as it is between Sharia and secular regions, or between Yoruba and Igbo ethnies, or between Boko Haram and the Abuja government, while its constituent parts are likewise repurposed in the service of oligarchs, emirs, and millenarian leaders. When it concerns so vital a region, such a state of affairs becomes a matter of the gravest concern for the international community. So absolutist is Boko Haram’s message, and so perilous is its threat, that the present disturbances amount to an existential crisis in the heart of Africa, and it is with some reason that James Verini has described the organization as “a kind of national synonym for fear, a repository for Nigerians’ worst anxieties about their society and where it’s headed.” Nigeria is hardly alone in its anxiety, and in this, Boko Haram has provided something of a western education after all, posing difficult questions through a twisted kind of Socratic method. However unwelcome this all may be, lessons must be drawn and solutions developed, lest the geopolitical conflagration spread any further, and more nations find themselves dwelling in Boko Haram’s millenarian fire.","url":"https://spectator.org/59143_dwelling-fire-boko-harams-war-against-west/"}
