{"authors":["Lucy Waterlow For Mailonline"],"date_download":"2018-10-23 00:50:23","date_modify":"2018-10-23 00:50:23","date_publish":"2016-01-29 14:09:23","description":"Eamonn Holmes revealed on today's This Morning that he will undergo a double hip operation next week. The surgery will be performed by the Queen Mother's former surgeon Sarah Muirhead-Allwood.","filename":"data/vaneerConsumption/EamonnHolmesisgivenanemotionalsendofonThisMorningbeforehipop.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B26CC600000578-0-image-a-45_1454074929158.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422734_Eamonn-Holmes-given-emotional-send-tells-Morning-viewers-undergo-double-hip-op-years-pain_1540255823.html","title":"Eamonn Holmes is given an emotional send of on This Morning before hip op","title_page":"Eamonn Holmes is given an emotional send of on This Morning before hip op | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eamonn Holmes revealed on today's This Morning that he will undergo a double hip operation next week.\nThe 56-year-old Irish presenter was given an emotional send off after he told viewers he been forced to 'walk like an ape' after putting off the procedure and enduring years of pain.\nHe received many messages of support from well wishers, including former Manchester United boss Sir Alex Ferguson, after explaining he would need ten weeks off work.\nScroll down for video\nEamonn Holmes explained on today's This Morning that the time has come for him to have a double hip operation as his wife Ruth Langsford, right, admitted she was worried about it\nThe presenters explain how Eamonn will have both of his hips replaced next week. Eamonn said he needed the op as he was in pain all the time and 'walking like an ape'\nHe said today: 'It's more au revoir than goodbye for a little while as I'm going to be rebuilt… they are taking out both of my hips and giving me new ones. I've put it off for too long ...and for me, I think it'll be a new lease of life.'\n'They ache an awful lot and next week I will have an op to replace them both.'\nHis wife and co-presenter Ruth Langsford, 55, said she'd had sleeplessness nights worrying about him having the op admitting: 'I had a cry the other night because I was so worried about you.'\nShe said she felt reassured after speaking to Eamonn's surgeon Sarah Muirhead-Allwood, who joined them on today's show, along with recovery nurse Tonya Kloppers and dancer Wayne Sleep, who had his right hip replaced in 2010.\nAn X-ray of Eamonn's hips shows how his bone is rubbing on bone as his cartilage has worn away due to a genetic defect causing the degeneration\nFather-of-four Eamonn has talked about his hip problems previously to The Sun, telling them in 2012 that the cartilage in his joints was wearing thin due to a genetic defect causing the degeneration.\nHe admitted them that he was delaying the operation as he was 'too chicken' to have surgery.\nFour years on, he is now prepared to go through with it at the expert hands of Sarah, who was the Queen Mother's former surgeon.\nShe explained why Eamonn needed the procedure, which is carried out on 150 people every day in the UK, at the relatively young age of 56.\n'Realistically people who are younger can get hip disease and it can affect the quality of your life,' she explained.\nShe said there was no point in people like Eamonn spending as a decade in pain until they reached the age deemed appropriate for hip op.\nThe presenters were joined by his surgeon Sarah Muirhead-Alwood, bottom right, and recovery nurse Tonya Kloppers, bottom left, on today's show\nRuth said she felt reassured after speaking to the experts as she has been worrying about her husband's op and had even been in tears\nShe said in Eamonn's case, it was clear from his X-rays that his ball and socket hip joint was problematic with bone rubbing on bone, and this meant he couldn't extend his leg when he walked.\nEamonn confirmed this was an issue causing him to 'stoop forward when I stand and walk like an ape.'\nSarah explained what will happen when she operates on the presenter: 'We will take away the whole of the [rounded] femur head, replacing with a hip joint and remould the socket and into that we put a cup in with cement or without cement - in the modern day we do without cement - and the material inside the socket is variable, a lot of it's plastic, but in younger patients [and what Eamonn will have] you'll get a ceramic material [socket].'\nShe said Eamonn would have a double op rather than a single one as 'if we do both together the total recovery time is maybe one day more in hospital, and for people that have got to have both done, it's much preferable for patients.'\nSarah Muirhead-Alwood, who was once the Queen Mother's surgeon, explains how the life-changing procedure is carried out\nEamonn said he preferred to have both done at once in the hope he will be back on his feet sooner, as he said he has had to turn down work in recent years due to his condition.\nHe said: 'When I look at work schedules and work that I've had to turn down - documentary series outside - it's okay when you're sitting on the This Morning sofa, but when you're outside filming or whatever, I just thought I want to get off the conveyor belt for as short a space as possible and then back on, all done in one go.'\nEamonn will have to do exercises every day to ensure his mobility returns and he said he will take inspiration from his idol Alex Ferguson, who has previously had the op.\nHe was delighted when he was surprised with a video message from the 74-year-old former manager today.\nIn the video message, Sir Alex said: 'Hi Eamonn, I believe you're going in for the big op on your hips.\nThe presenter gives his surgeon a hug as he thanks her for coming on the show to discuss his treatment\nDancer Wayne Sleep revealed he had his right hip replaced in 2010 and is now fighting fit again after wearing out the cartilage in his joint throughout his career\n'Well you know I got mine done two and a half years ago, and I'm now in great condition. I did all my exercises, listened to the doctors and physios and if you do that you'll be back one hundred percent back on the couch mooching with Ruth! So good luck, talk soon.'\nEamonn replied: 'Thank you boss! And the most impressive thing about the boss is that he was once sitting behind me at Old Trafford and he came along the row and he literally - after the operation - lifted his leg up and climbed over the seat and sat down and I thought \"well, there's my inspiration\".'\nWayne, 67, admitted that he had needed the same surgery on just one hip after wearing out the cartilage in his joint throughout his career.\nHe said: 'I was landing on my right leg every time I did turns on stage so I was jamming my hips onto the bone and all my cartilage wore out.'\nLike Eamonn, he said he initially delayed surgery.\n'I left it was long as possible but it got to the point I couldn't put my shoes on. I would lie in in bed 'till a performance, take painkillers to perform and then be back to bed again,' he said.","url":"https://www.dailymail.co.uk/femail/article-3422734/Eamonn-Holmes-given-emotional-send-tells-Morning-viewers-undergo-double-hip-op-years-pain.html"}
