{"authors":[],"date_download":"2018-10-22 22:20:57","date_modify":"2018-10-22 22:20:57","date_publish":"2014-06-09 15:53:34","description":"Children who get multiple X-rays and CT scans because of heart disease don’t have much of a higher risk of cancer later in life from the radiation.","filename":"data/vaneerConsumption/EarlyXRaysBarelyRaiseCancerRiskStudyFinds.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_39/496766/140609-heart-x-ray-1208_5cc1d61b4c1f7dd220136944a9e06f57.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_kids-health_early-x-rays-barely-raise-cancer-risk-study-finds-n126311_1540246857.html","title":"Early X-Rays Barely Raise Cancer Risk, Study Finds","title_page":"Early X-Rays Barely Raise Cancer Risk, Study Finds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Hill’s team studied 337 children under the age of 6 who had surgery for heart disease at Duke between 2005 and 2010. They gauged their radiation dose to calculate and project their lifetime cancer risk.\nIt’s an issue because children are three to four times more likely to develop cancer from exposure to ionizing radiation like that given in an X-ray or computed tomography (CT) scan. “Radiation exposure in childhood is of particular concern because children have immature developing organ and tissue structures,” Hill’s team wrote in their report, published in the journal Circulation.\nThese kids got an awful lot of imaging — 13,932 X-rays, CT scans and other procedures before, during and after surgery. The X-rays didn’t deliver much radiation at all, Hill’s team found.\nThe big culprits are cardiac catheterization exams and CT scans. They can deliver up to 1,800 times more radiation than a standard X-ray. Children who got many of these complicated and time-consuming scans did get enough radiation to triple their risk of cancer, Hill found.\nOn average, children don’t have a high risk of cancer, though, so even doubling or tripling that very low risk still doesn’t make them very likely to develop cancer.\n“Even though their risk is threefold greater, it is not necessarily a high risk,” Hill said. “I think it is important for parents to understand that there is a small amount of risk.”\nDoctors can and should do their best to minimize radiation exposure, Hill said. New technology can help with this, as can techniques that make it necessary to use the shortest possible burst of radiation.","url":"https://www.nbcnews.com/health/kids-health/early-x-rays-barely-raise-cancer-risk-study-finds-n126311"}
