{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:59:24","date_modify":"2018-10-30 23:59:24","date_publish":"2018-07-14 00:00:00","description":"BI PRIME: The impressive first quarter earnings season is unlikely to be topped as companies start to announce results, according to Goldman Sachs' equity strategists. They identified a group of stocks that's outperforming this year, and advice clients to focus on it.","filename":"data/vaneerConsumption/EarningsseasonstockstofocusoninQ2accordingtoGoldman.json","image_url":"https://amp.businessinsider.com/images/5ad64719fe0c951b008b457b-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_earnings-season-stocks-to-focus-on-in-q2-goldman-2018-7_1540943964.html","title":"Earnings-season stocks to focus on in Q2, according to Goldman","title_page":"    Earnings-season stocks to focus on in Q2, according to Goldman - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A trader works on the floor of the New York Stock Exchange shortly before the end of the day's trading in New York July 31, 2013. Reuters/Lucas Jackson\nDon't expect a repeat of the impressive first-quarter earnings beats as companies report their second-quarter results, Goldman Sachs' equity strategists said.\nIn the first quarter, 55% of S&P 500 companies beat analysts' expectations for earnings per share by at least one standard deviation — the best rate since Q2 2010.\n\"A slightly weaker macroeconomic environment will result in earnings beats normalizing from elevated 1Q levels,\" David Kostin, the chief US equity strategist, said in a note on Friday.\nPepsiCo, JPMorgan, and Wells Fargo are some of the companies that will report earnings this week as the season shifts into full gear. But some companies have already reported, and forecasts for Q2 earnings growth still have not moved much. Kostin noted this because earnings estimates typically plunge into the earnings season but are revised higher as companies start to outperform.\nThis shows that analysts do not expect the conditions that led to the first-quarter outperformance to continue, Kostin said.\nThat's not a call for negative earnings growth, but for a slowdown from the hurried pace of the first quarter. According to FactSet, earnings growth for the second quarter is projected at 20%, down from 23% in the first quarter. Also, 57% of S&P 500 companies have issued negative earnings guidance for the second quarter, lower than the five-year average of 72%.\nGoldman Sachs\n\"Investors should focus on stocks with high and stable gross margins,\" Kostin said. \"The market generally rewards companies with high margins when the outlook for corporate profitability weakens.\"\nProfit margins could come under strain in the coming quarters because of rising wages, higher interest rates, and rising commodity prices, even though tax reform provided a one-time boost, he added.\nBelow is a list of Russell 1000 stocks that have had stable or expanding gross margins for one or two years. The basket has gained 5% this year, versus a 9% loss for stocks with low and variable margins.","url":"https://www.businessinsider.com/earnings-season-stocks-to-focus-on-in-q2-goldman-2018-7"}
