{"authors":[],"date_download":"2018-10-22 21:56:03","date_modify":"2018-10-22 21:56:03","date_publish":"2015-10-26 00:00:00","description":"The epicenter of the magnitude-7.5 quake was in a region straddling Pakistan and Afghanistan and was felt strongly in the Afghan capital, Kabul.","filename":"data/vaneerConsumption/EarthquakeInNorthernAfghanistanRattlesRegion.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=451945129_1540245363.html","title":"Earthquake In Northern Afghanistan Rattles Region","title_page":"Earthquake In Northern Afghanistan Rattles Region : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nA powerful earthquake has shaken a wide area of Afghanistan and Pakistan. It measured 7.5 on the Richter scale. The epicenter of this quake was in a region straddling those two countries. The quake was felt strongly in the Afghan capital, Kabul, where NPR's Philip Reeves has been reporting, and he's on the line. And, Phil, tell us what you felt there.\nPHILIP REEVES, BYLINE: Oh, it was quite strong, and it went on for a remarkably long time. I know with earthquakes you always feel they're more dramatic than they actually are, but this was a strong one. I took refuge under the door jam because I was told when living in California that that's what you're supposed to do. But most other people here came out of the buildings onto the streets and waited for it to pass. And now they're in a pretty jittery mood because people are expecting aftershocks.\nGREENE: And what do the streets look like? I mean, is there damage? Have you seen people injured?\nREEVES: No. In Kabul itself, no, but I think most of the damage is out in the countryside. The epicenter of this quake was actually, if you look at a map, in the top right-hand corner of Afghanistan where it meets China, Tajikistan and northern Pakistan. And reports have been coming in all day really of casualties from northern Pakistan, northwestern Pakistan and from northern Afghanistan - hundreds of injuries but also some deaths. The most tragic story to emerge so far is that of 12 schoolgirls who appear to have been caught up in a stampede to get out of their school in a stairway and were crushed to death and that caused also the injury of several dozen other peoples as well.\nGREENE: That is terrible, and I know, you know, information doesn't travel all that fast. I mean, I'm frightened we might see more stories just like that as the days go by.\nREEVES: Well, that is a very important point. A lot of the communication lines are down. This isn't a remote area. I mean, this is the Hindu Kush mountains, and there are villages up there. The winter's just creeping in. It's been raining, so there are concerns that more casualties may emerge in the coming hours and days. And also there's a strong risk of landslides or landslides might already have happened. So I don't think we yet know exactly how serious this is. One point of slight optimism, though, is that this quake was a lot deeper than the quake that occurred in this part of the world 10 years ago in which 75,000 people were killed, a quake no one has forgotten at all around here. And that one was much more shallow, so there is a school of thought that says that with any luck the level of casualties in this one will be lower. Let's just hope so. We don't, at this stage, really know.\nGREENE: We will hope indeed. All right, we've been speaking to NPR's Philip Reeves who is in Kabul, Afghanistan, where he rode out an earthquake that measured 7.5 on the Richter scale. And we'll be following this very closely as more reports come in about possible casualties and deaths. Phil, thank you very much.\nREEVES: You're most welcome.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=451945129"}
