{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:20:17","date_modify":"2018-10-22 21:20:17","date_publish":"2016-04-22 00:00:00","description":"Earth Day brings everything from special Google Doodles and beautiful views of our planet to the historic signing of an international climate agreement.","filename":"data/vaneerConsumption/EarthDayBringsCelebrationsSigningOfHistoricClimatePact.json","image_url":"https://media.npr.org/assets/img/2016/04/22/gettyimages-523214212_wide-066b52b8ba691fba2552ad23ab15e71f279280f6.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_04_22_475266801_earth-day-brings-celebrations-signing-of-historic-climate-pact_1540243217.html","title":"Earth Day Brings Celebrations, Signing Of Historic Climate Pact","title_page":"Earth Day Brings Celebrations, Signing Of Historic Climate Pact : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Earth Day Brings Celebrations, Signing Of Historic Climate Pact\nEnlarge this image toggle caption Spencer Platt/Getty Images Spencer Platt/Getty Images\nIt's Earth Day, bringing everything from Google Doodles to beautiful views of our planet to an emphasis on protecting the environment and the historic signing of an international climate agreement.\nAt the United Nations, high-ranking leaders from more than 170 countries are signing the sweeping climate agreement that was reached at last COP21 climate meetings. As Christopher Joyce wrote for the Two-Way yesterday, \"The two largest sources of those gases are the U.S. and China. Whether they keep their promises will in large part determine whether the Paris deal succeeds.\"\nYou can watch the proceedings at the U.N. live, via streaming video:\nYouTube\nNASA has published an ultra high-definition view of Earth, as seen from the International Space Station. It's part of the agency's plan to release \"about 200 images across nearly 100 different social media channels that capture the breadth of the agency's 24-hour-a-day work to study Earth.\"\nYouTube\nThe European Space Agency posted its own video, showing the wide range of images taken of Earth by satellites that measure everything from topography to the atmosphere's contents.\nYouTube\nGoogle unleashed several special Doodles that feature artistic impressions of five different ecological settings and animals: the tundra and a polar bear; the ocean, with a coral reef and octopus; a desert and tortoise; a forest and red fox; and grasslands with an elephant. Google says the images are served up randomly.\nEnlarge this image toggle caption Screen shot by NPR Screen shot by NPR\nSpeaking to dignitaries gathered in the U.N.'s General Assembly Hall in New York for Earth Day — or, as his organization prefers to call it, \"International Mother Earth Day,\" Secretary-General Ban Ki-moon said that taking action on our planet's climate isn't a burden, but something that offers many benefits.\n\"It can help us eradicate poverty, create green jobs, defeat hunger, prevent instability and improve the lives of girls and women,\" he said.","url":"https://www.npr.org/sections/thetwo-way/2016/04/22/475266801/earth-day-brings-celebrations-signing-of-historic-climate-pact"}
