{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-23 03:32:29","date_modify":"2018-10-23 03:32:29","date_publish":"2016-01-28 19:02:56","description":"Scientists at the University of California Los Angeles say a planet called Theia that collided with Earth (illustrated) to form the moon 'vigorously' exchanged material with our own world.","filename":"data/vaneerConsumption/EarthismadeupofTWOplanetsCollisionthatcreatedourmoon45billionyearsagosawapairofworldsshareiceandland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACACE100000578-0-image-a-6_1454004306093.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421350_Earth-TWO-planets-Collision-created-moon-4-5-billion-years-ago-saw-pair-worlds-share-ice-land_1540265549.html","title":"Earth is 'made up of TWO planets': Collision that created our moon 4.5 billion years ago saw a pair of worlds share ice and land","title_page":"Earth is 'made up of TWO planets': Collision that created our moon 4.5 billion years ago saw a pair of worlds share ice and land | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was a cataclysmic impact that formed the moon around 4.5 billion years ago.\nBut it seems life on Earth owes a great deal more than previously believed to the Mars-sized 'proto-planet' that smacked into our own less than a hundred million years after the solar system formed.\nA new study has found that some of the water we find on Earth today may have come from this ill-fated planet - known as Theia.\nThe moon is thought to have formed when a Mars-sized object smashed into the side of our planet with a glancing blow (illustrated) , throwing out debris that eventually condensed together to form the moon. A new study has shown much of the water on Earth may have come from Theia\nScientists have discovered the two bodies exchanged a great deal of debris in the collision, leading both the Earth and the moon to have almost identical levels of oxygen isotopes.\nMost theories suggest the moon formed mainly from Theia, but the new study suggests it was actually a mixture of the two planets.\nDr Edward Young, a geologist at the University of California Los Angeles, and his colleagues who conducted the research, said: 'The new measurements presented here are consistent with Earth and the Moon having near-identical Theia contents.\nDID THEIA FORM EARTH'S CORE? The collision that created the moon could also explain why our planet has a hot core. Scientists believe Earth was hit by a body that was the size of Mars - but like Mercury in its composition - early in its life. This likely would have happened about 4.5 billion years ago. The body would have been rich in sulphur but very poor in oxygen - just like Mercury. The collision would have produced radioactive uranium and thorium, generating the heat needed to drive the 'dynamo' of molten iron in Earth's core.\n'[This] suggests that the moon-forming impact thoroughly mixed and homogenised the oxygen isotopes of Theia and proto-Earth.'\nThe researchers analysed seven samples gathered during the Apollo 12, 15 and 17 lunar missions along with material from a lunar meteorite.\nThey compared the oxygen isotopes within these to those from rock samples on Earth.\nMost planets in the solar system have distinct isotope signatures due to the way they have formed.\nHowever, the Earth and Moon have similar signatures due to the way they were formed.\nIt is thought a large planetary body smashed into the proto-Earth with a glancing blow, creating huge amounts of debris that eventually condensed to form the moon.\nThe researchers, whose work is published in the journal Science, found their samples from the moon and Earth contained identical composition of an isotope of oxygen called delta-17.\nThe researchers analysed samples of moon rock brought back by astronauts in the Apollo 12, 15 and 17 lunar missions (pictured) and compared them to rocks found on Earth. They found they had identical levels of a particular oxygen isotope, suggested the two bodies formed out of the same mixture of material\nBoth bodies appear to have concentrations of around five parts per million, which suggests Theia and the early Earth must have exchanged and shared their oxygen when they collided.\nWhile other studies have suggested there are subtle differences in the isotope levels on the moon and the Earth, Dr Young and his colleagues said their approach is more precise.\nThey explained that their results suggest both the early Earth and Theia must have had 'substantial' amounts of water high in delta-17 oxygen ether trapped in minerals or as ice.\nThis suggests much of the water we see on Earth today, which is thought to have been crucial for life forming on our planet, must have come from Theia.\nThe researchers added that their results provide new evidence that the debris produced by the collision was far more vigorously mixed than had been believed in the past.\nScientists had assumed the moon formed from the remains of the planet Theia, but the new research suggests it actually formed from debris from both planets. This suggests Theia and the Earth actually mixed and exchanged material thoroughly in the collision\n'In order to create an iron-poor Moon and simultaneously reproduce the angular momentum of the Earth-Moon system, early models required a glancing blow by a Mars-sized impactor that resulted in the Moon being composed mainly of impactor material,' they said.\n'Therefore, in the general case the moon and Earth should not be identical in their oxygen isotopic compositions.\n'Nonetheless, until recently the Moon and Earth have been found to be indistinguishable in their oxygen isotope ratios.\n'Our results favour vigorous mixing during the giant impact and therefore a high-energy, high-angular-momentum impact.'","url":"https://www.dailymail.co.uk/sciencetech/article-3421350/Earth-TWO-planets-Collision-created-moon-4-5-billion-years-ago-saw-pair-worlds-share-ice-land.html"}
