{"authors":["Harvey Day For Mailonline"],"date_download":"2018-10-23 03:01:51","date_modify":"2018-10-23 03:01:51","date_publish":"2017-03-10 12:30:26","description":"The 44 year-old comedian, television presenter and musician, who plays Vincent Hubbard on EastEnders, was found guilty last month of failing to say who was driving his white BMW i8.","filename":"data/vaneerConsumption/EastEndersRichardBlackwoodoverturnsadrivingban.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22C68400000578-0-image-a-72_1489148458797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300900_EastEnders-star-Richard-Blackwood-overturns-driving-ban_1540263711.html","title":"EastEnders' Richard Blackwood overturns a driving ban","title_page":"EastEnders' Richard Blackwood overturns a driving ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Richard Blackwood appeared in court today and successfully overturned a ban after his £100,000 supercar was caught speeding\nEastEnders star Richard Blackwood appeared in court today and successfully overturned a ban after his £100,000 eco-friendly supercar was caught speeding on the M6.\nThe 44-year-old comedian, television presenter and musician, who plays Vincent Hubbard on EastEnders, was found guilty last month of failing to say who was driving his white BMW i8.\nIn February, Birmingham Magistrates Court fined him £660, with £80 costs and ordered him to pay a £66 victim surcharge.\nHe was also disqualified from driving for six months after the vehicle was caught on camera on August 7, last year.\nBlackwood appeared at Wimbledon Magistrates Court to swear on oath he was unaware of the prosecution.\nIt will now be heard again on April 4 at Birmingham Magistrates Court.\nThe supercar was nowhere to be seen today after he took a taxi away from the court.\nPreviously the actor has appeared before the courts for a series of speeding offences.\nIn 2010 he was given a yearlong driving ban, and in 2008 was banned for six months.\nThe actor, who shot to fame in the late 90s with The Richard Blackwood Show went bankrupt in 2003 having struggled to cope with his newfound fame.\nThe 44 year-old comedian, television presenter and musician, who plays Vincent Hubbard on EastEnders, was found guilty last month of failing to say who was driving his white BMW i8\nAn admitted car enthusiast, he admitted buying a £75,000 Jaguar XJR, 'just because I could'.\nHe has credited his new role as Vincent Hubard on Eastenders with turning his life around.\nBlackwood signed a statutory declaration following conviction for driving offences between September 16 2016 and October 14 2016.","url":"https://www.dailymail.co.uk/news/article-4300900/EastEnders-star-Richard-Blackwood-overturns-driving-ban.html"}
