{"authors":[],"date_download":"2018-10-30 19:00:12","date_modify":"2018-10-30 19:00:12","date_publish":"2018-10-30 18:56:57","description":"Greasy, fatty meals with few nutrients have been linked to cardiovascular disease. However, there are a few foods that may help you avoid heart attacks, according to a new report.","filename":"data/vaneerConsumption/Eatthesecommondairyproductstoavoidheartattacks.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/02/18/Videos/4326472.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_world_eat-these-these-_200a1e401cf8959cf1a2e558cfe52ef1__1540926012.html","title":"Eat these common dairy products to avoid heart attacks","title_page":"Study: Eat these common dairy products to avoid heart attacks","title_rss":"NULL","source_domain":"ajc.com","text":"Greasy, fatty meals with few nutrients have been linked to heart attacks. However, there are a few foods that may help you avoid them, according to a new report.\n» RELATED: Banana, avocados could reduce risk of heart attacks, study says\nResearchers from the University of Eastern Finland recently conducted a study, published in the British Journal of Nutrition, to determine the link between risk of cardiac arrest and fermented and non-fermented dairy products. Fermented dairy products include buttermilk, sour cream and cheese, and non-fermented dairy products include milk.\nFor their assessment, they examined about 2,000 men between 1984 and 1989, evaluating their lifestyle and nutritional habits. They then divided the subjects into four groups based on their dairy intake and followed up with them after about 20 years.\nAfter analyzing the results, they found that 472 of the males had experienced a cardiovascular disease event, such as a heart attack.\nUpon further investigation, they noticed those with the highest consumption of fermented dairy products, which contained less than 3.5 percent fat, had a 26 percent lower heart attack risk, compared to those with the lowest consumption.\n» RELATED: Got heart disease? You may have a better chance of survival if married\n“Sour milk was the most commonly used low-fat fermented dairy product. The consumption of high-fat fermented dairy products, such as cheese, was not associated with the risk of incident coronary heart disease,” the team wrote in a statement.\nFurthermore, they said very high consumption of non-fermented dairy products was associated with increased risk of heart attacks. They listed milk as the most commonly used product in this category and defined high consumption as an average daily milk intake of 0.9 liters.\n“The new study provides further evidence on the health benefits that fermented dairy products may have over non-fermented ones,” the analysts concluded.\nWhile they do not yet understand why there is a relationship between fermented dairy products and reduced heart attack risk, they hypothesize that the compounds formed during the fermentation process may be a factor.\nLearn more about their findings here.\n» RELATED: Eat this meat twice a week to avoid heart attacks and strokes, study says","url":"https://www.ajc.com/news/world/eat-these-these-common-dairy-products-avoid-heart-attacks-study-suggests/r88aFkIX4CoBb4XAfvEh3H/"}
