{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:07:44","date_modify":"2018-10-30 19:07:44","date_publish":"2015-02-03 02:40:57","description":"After West Africans suffered from nearly 22,000 infections and 9,000 casualties, physicians began testing potential Ebola vaccines.","filename":"data/vaneerConsumption/EbolaVaccineTrialsStartinLiberia.json","image_url":"https://media.breitbart.com/media/2015/01/ebola.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_02__1540926464.html","title":"Ebola Vaccine Trials Start in Liberia","title_page":"Ebola Vaccine Trials Start in Liberia","title_rss":"NULL","source_domain":"breitbart.com","text":"After West Africans suffered from nearly 22,000 infections and 9,000 casualties, physicians began large-scale human testing of two potential Ebola vaccines on Monday.\nPhysician’s Assistant B. Emmanuel Lansana was the first person to receive the vaccination and had the two shots administered at different points on his right arm, according to the Associated Press. The trials began in Liberia’s capital city, Monrovia, named after U.S. president James Monroe. Up to 600 volunteers are reportedly taking part in the first phase, and trial organizers have said eventually as many as 27,000 people could participate.\nBut there is still no licensed treatment for the fatal hemorrhagic disease. If either, or both, of the vaccines work, it is unclear how quickly they can be mass produced, the AP notes. And there is still a need to dispel suspicions and fears Africans hold — namely, that they will become infected with Ebola if they receive the vaccine, despite studies that showed promise in first-stage human tests. Twelve Liberians received vaccinations on Monday; that number said to be increasing as the trial moves along.\nAs is the case with any vaccine, each Ebola vaccine uses a different virus that carries non-infectious Ebola material into the body in order to spark an immune response, the Post notes. Despite the positive response to both test vaccines thus far, Bruce Aylward who is leading the World Health Organization’s Ebola response team told the AP that it won’t be an immediate solution.\nOne of the vaccines was developed by the National Institutes of Health and is being manufactured by GlaxoSmithKline. The other was developed by Canadian health officials and is licensed to two U.S. companies, NewLink Genetics and Merck, according to the AP.\nLast week, Aylward reportedly told the AP that a vaccine would likely come mid-year at the soonest.\n“We might be able to vaccinate some first responders but it’s a complete uncertainty. We have no idea if it will confer protection, even though the indications are good,” he said.\nOn January 10, Sierra Leone’s Pujehun was declared Ebola-free after being the first Ebola-stricken zone to be declared cleared at 42 days of zero recorded cases of the deadly virus. The town had suffered 24 deaths from a total of 31 reported cases.\nAdelle Nazarian is on Twitter: @AdelleNaz","url":"https://www.breitbart.com/national-security/2015/02/02/ebola-vaccine-trials-start-in-liberia/"}
