{"authors":["Frances Martel"],"date_download":"2018-10-30 19:02:54","date_modify":"2018-10-30 19:02:54","date_publish":"2015-03-17 03:30:39","description":"Reports surfaced this weekend that 11 US health workers in Sierra Leone are being flown home after being exposed to the deadly Ebola virus.","filename":"data/vaneerConsumption/EbolaQuarantinedSierraLeoneVPRequestsUSAsylumas11ExposedAmericansFlyHome.json","image_url":"https://media.breitbart.com/media/2015/03/CDC-Ebola-training-US-aid-workers-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_16__1540926174.html","title":"Ebola-Quarantined Sierra Leone VP Requests US Asylum as 11 Exposed Americans Fly Home","title_page":"Ebola-Quarantined Sierra Leone VP Requests US Asylum as 11 Exposed Americans Fly Home | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Reports surfaced this weekend that eleven U.S. health workers in Sierra Leone are being flown home after being exposed to the deadly Ebola virus, the largest such group repatriated. The news arrives amid a political tempest that has the Vice President of that nation demanding asylum in the United States after being expelled from office while under Ebola quarantine.\nCNN reports that an initial group of eight workers were flown home on Sunday night, while three more are expected in the United States on Monday, after an American citizen was positively diagnosed with Ebola and flown home earlier this week. All of those returning from Sierra Leone work for the Boston-based health group Partners in Health, including the one worker already confirmed to have Ebola.\nThe eleven others allegedly have yet to show signs of contamination but were confirmed to have been exposed to the virus and interacted with the worker currently fighting the disease.\nThe group will be spread across the country, with the greatest number being flown to a facility in Omaha, Nebraska.\nThe Associated Press notes that Partners in Health currently employs 2,000 people working in West Africa. Around 600 of those are Ebola survivors and many are non-U.S. citizens.\nThe news of the mass evacuation follows media reports from Sierra Leone claiming the virus’s spread has begun to worsen since an initial improvement in January. “It is now very clear to most observers that the Ebola situation in the North and West of Sierra Leone has been worsening in recent weeks. On Thursday March 12th 2015 has come news that an American citizen is now being urgently flown out of the country having caught Ebola as part of rising cases here,” reported the Awareness Times, headquartered in the capital of Freetown. The newspaper notes that several British citizens are also under Ebola warnings.\nThe most high-profile case of Ebola quarantine in the nation occurred this month, as Vice President Samuel Sam-Sumana announced that he had voluntarily quarantined himself, despite not showing symptoms, as a precautionary measure. The move has sparked a political firestorm, as the All People’s Congress, his political party, voted to expel him from the party during his absence.\nThe Awareness Times reports the APC expelled Sam-Sumana on charges of “deceit, dishonesty and promoting violence especially against top members of the APC,” charges Sam-Sumana denies. Reuters adds that the APC also charged the Vice President with “lying about his academic credentials and his Muslim faith.”\nThe Awareness Times claims that Sam-Sumana was organizing an army in eastern Sierra Leone, and that his assistants had tweeted threats that “war” was imminent in the nation.\nReuters notes that Sam-Sumana has not only denied the allegations, but requested asylum at the U.S. embassy, claiming that he fears for his safety after his ouster. It is not certain whether being expelled from the party results in his automatic expulsion from the seat of Vice President of Sierra Leone, as the nation’s constitution requires that the Vice President be a member of the political party, but the legislature must vote to expel someone from that position.","url":"https://www.breitbart.com/national-security/2015/03/16/ebola-quarantined-sierra-leone-vp-requests-us-asylum-as-11-americans-flown-home/"}
