{"authors":["Frances Martel"],"date_download":"2018-10-30 19:06:06","date_modify":"2018-10-30 19:06:06","date_publish":"2015-07-31 18:40:01","description":"Ebola: 500+ Quarantined in Once-Cured Sierra Leone Village","filename":"data/vaneerConsumption/Ebola500QuarantinedinOnceCuredSierraLeoneVillage.json","image_url":"https://media.breitbart.com/media/2015/07/Ebola-Case-in-Sierra-Leone-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_31__1540926366.html","title":"Ebola: 500+ Quarantined in Once-Cured Sierra Leone Village","title_page":"Ebola: 500+ Quarantined in Once-Cured Sierra Leone Village","title_rss":"NULL","source_domain":"breitbart.com","text":"The government of Sierra Leone has quarantined 624 people in the past week following the death by Ebola of a man in a town that had not experienced any cases of the deadly virus in months.\nWhile the outbreak continues with little natural end in sight, however, scientists have announced a breakthrough vaccine development that could eradicate Ebola for good.\nGovernment officials announced Thursday that they would quarantine the entire area of Northern Tonkolili District, where a man recently died of Ebola and was buried using traditional unsafe burial practices. The man lived in Freetown, but had returned to Tonkolili to celebrate the end of the Muslim holy month of Ramadan. The entire village, about 500 people, have been quarantined, including 30 nurses who had contact with the patient.\nIn addition to the 503 people in the village, 121 others who are believed to have come into contact with the patient outside of Tonkolili have been quarantined, according to Sierra Leone’s National Ebola Response Center. Authorities were clear to describe this case as high-risk, particularly because the man’s father works as a taxi driver, and used his car to transport his son to two different hospitals. It is not known how many people came into contact with the father or took rides in his car in between his son’s diagnosis and transport.\nDeutsche Welle notes that this is particularly unwelcome news in Sierra Leone, as the World Health Organization had recently announced that Ebola cases had dwindled to extremely promising levels. The week before the quarantines began, Sierra Leone documented only three cases; Guinea, the other country still fighting the Ebola outbreak, documented four. Now, experts warn, hundreds in Sierra Leone are at risk.\nSierra Leone’s medical workers will also be working with significantly fewer resources, as the United Nations winds down its emergency Ebola program in the nation, the United Nations Mission for Ebola Emergency Response (UNMEER). The program concluded this week, diminishing Sierra Leone’s medical manpower.\nA scientific breakthrough published this week in medical journal The Lancet brings unprecedented hope in the fight against Ebola, however. Scientists working on an Ebola vaccine since the outbreak began in March 2014 have created a vaccine that has proven “100% effective” on patients on which it has been tested in Guinea, when patients are given ten days to ingest the vaccine. Medical researchers need to conduct follow-up testing to confirm the results, but such a vaccine may eradicate this particular strain of Ebola from West Africa entirely.","url":"https://www.breitbart.com/national-security/2015/07/31/ebola-500-quarantined-in-once-cured-sierra-leone-village/"}
