{"authors":["Sarah Griffiths For Mailonline"],"date_download":"2018-10-22 23:58:01","date_modify":"2018-10-22 23:58:01","date_publish":"2016-01-29 12:36:00","description":"Experts from University of Maryland used a carbonised oak leaf pumped full of sodium (illustrated) to demonstrate it could be used as a battery’s negative terminal, or anode.","filename":"data/vaneerConsumption/Ecofriendlybatteryismadefromjustabakedoakleafandsodium.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B2563200000578-0-image-a-29_1454071822704.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422660_You-better-leaf-Eco-friendly-battery-just-baked-leaf-sodium_1540252681.html","title":"Eco-friendly 'battery' is made from just a baked oak leaf and sodium","title_page":"Eco-friendly 'battery' is made from just a baked oak leaf and sodium | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scientists used a carbonised oak leaf (shown) pumped full of sodium to demonstrate it could be used as a battery's negative terminal, or anode\nIt's well known that you can turn the humble lemon, and even a potato, into a fully-functioning batteries but researchers have gone a step further.\nExperts from University of Maryland have created a battery using just a leaf and some sodium.\nHowever, unlike the fruit and veg versions, the recipe for the leaf battery shouldn't be tried at home - because it involves baking the leaf at a staggering 1,000°C (1,832°F).\nThe leaf battery was developed by the department of materials science and engineering.\nThe researchers used a carbonised oak leaf pumped full of sodium - a soft, silver-white, highly reactive metal – to demonstrate it could be used as a battery's negative terminal, or anode.\n'Leaves are so abundant. All we had to do was pick one up off the ground here on campus,' said Hongbian Li at the university, who is also a member of the faculty at the National Centre for Nanoscience and Technology in Beijing, China.\nOther studies have shown that melon skin, banana peels and peat moss can be used in this way, but a leaf needs less preparation.\nMost rechargeable batteries currently use lithium, but the race is on to make a battery using sodium, which can hold more charge.\nUntil now, however, experts have struggled to find an anode material that's compatible with sodium.\nWhile graphene dotted with various materials can attract and retain the sodium, such anodes are time-consuming and expensive to produce.\nThe lower side of the leaf remained studded with pores for absorbing water, which the experts used to absorb the sodium electrolyte (shown in blue, left) that can carry an electric charge (graph shown right)\nMAKING THE LEAF BATTERY The team heated a leaf for one hour at 1,000°C to burn off underlying carbon. The lower side of the leaf remained studded with pores for absorbing water, which the experts used to absorb the sodium electrolyte. The top layers of carbon that made the leaf tough became sheets of 'nanostructured' carbon to absorb the sodium. Most rechargeable batteries currently use lithium, but the race is on to make a battery using sodium, which can hold more charge. Until now, however, experts have struggled to find a material that's compatible with sodium. While graphene dotted with various materials can attract and retain the sodium, such anodes are time-consuming and expensive to produce. By comparison, leaves are much cheaper.\nBy comparison, leaves are a much faster and cheaper option.\nThe team heated a leaf for one hour at 1,000°C to burn off all the underlying carbon structure.\nThe lower side of the leaf remained studded with pores for absorbing water, which the experts used to absorb the sodium electrolyte that can carry an electric charge.\nThe top layers of carbon that made the leaf tough, became sheets of 'nanostructured' carbon to absorb the sodium that carries the charge.\nFei Shen, a visiting student in the department of materials science and engineering, said: 'The natural shape of a leaf already matches a battery's needs: a low surface area, which decreases defects; a lot of small structures packed closely together,. which maximizes space and internal structures of the right size and shape to be used with sodium electrolyte.\nLiangbing Hu, an assistant professor of materials science and engineering added: 'We have tried other natural materials, such as wood fibre, to make a battery.\nThe researchers have no plans to commercialise their research immediately, meaning it could take years before leaves are used in the batteries we buy (stock image)\n'A leaf is designed by nature to store energy for later use, and using leaves in this way could make large-scale storage environmentally friendly.'\nThe next step, Professor Hu said, is 'to investigate different types of leaves to find the best thickness, structure and flexibility' for electrical energy storage.\nThe researchers have no plans to commercialise their research immediately, meaning it could take years before leaves are used in the batteries we buy.","url":"https://www.dailymail.co.uk/sciencetech/article-3422660/You-better-leaf-Eco-friendly-battery-just-baked-leaf-sodium.html"}
