{"authors":[],"date_download":"2018-10-22 22:53:29","date_modify":"2018-10-22 22:53:29","date_publish":"2014-06-11 12:43:17","description":"Treasury Secretary Jack Lew said the economy was gaining traction but that the lack of progress on wages and employment remains disappointing.","filename":"data/vaneerConsumption/EconomyGainingbutLaborDisappointingTreasurySecretarySays.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/501766/140611-140611-lew2-0922_d99f597b44424c3127a5da91e89f11e8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_economy-gaining-labor-disappointing-treasury-secretary-says-n128256_1540248809.html","title":"Economy Gaining, but Labor Disappointing, Treasury Secretary Says","title_page":"Economy Gaining, but Labor Disappointing, Treasury Secretary Says ","title_rss":"NULL","source_domain":"nbcnews.com","text":"A dismal start to 2014, with businesses hampered by a harsh winter, has given way to optimism about the course of growth for the rest of this year. Lew noted, as well, that political feuding in Washington over health care, the debt ceiling and budget issues has receded.\nThat, he said, should pave the way for a broader discussion about how to tackle structural economic issues - how to spur infrastructure investment, strengthen alternatives to four-year colleges to train workers, and tackle immigration reform as a way to reverse the decline in labor force participation.\nThe drop in participation rates has been one of the more perplexing economic issues to grow out of the recent crisis and recession. Though some of the decline is the result of the aging of the U.S. population, some of it remains unexplained.\n\"We cannot repeal the Baby Boom,\" Lew said of the large cohort of Americans who are reaching retirement age, \"but we can address the resulting decline in the labor force by addressing our outdated, economically backwards immigration system.\"\nHe said that businesses also needed to \"come off the sidelines\" and start putting the record stocks of cash held in corporate coffers to work.","url":"https://www.nbcnews.com/business/economy/economy-gaining-labor-disappointing-treasury-secretary-says-n128256"}
