{"authors":[],"date_download":"2018-10-22 21:15:02","date_modify":"2018-10-22 21:15:02","date_publish":"2014-06-04 18:50:37","description":"A relatively upbeat Federal Reserve said Wednesday that economic growth increased across the country over the past two months.","filename":"data/vaneerConsumption/EconomyImprovingAcrosstheCountryFedSays.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_economy-improving-across-country-fed-says-n122631_1540242902.html","title":"Economy Improving Across the Country, Fed Says","title_page":"Economy Improving Across the Country, Fed Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA relatively upbeat Federal Reserve said Wednesday that economic growth increased across the country over the past two months.\nThe Fed said growth was \"moderate\" to \"modest\" in all 12 Federal Reserve districts, in its “Beige Book” release, which details economic projections from the central bank's members.\nAmong its findings:\nEmployment prospects \"generally strengthened\" across the country, though some districts reported a shortage of skilled workers.\nReal estate conditions were \"mixed\" even as home prices continued to rise, while \"lack of inventory\" was cited as one reason for slow sales.\nPrice pressures were \"subdued,\" despite the latest figures from the Bureau of Labor Statistics showing broad-based price increases for food and produce, and gas prices that remain stubbornly high despite predictions they soon would decline.\nAuto sales were brisk, as confirmed by major automakers in figures released this week.\nBroadly speaking the report confirmed statements from Fed Chair Janet Yellen and other officials who have touted the pace of the post-recession economy.\n\"Consumer spending expanded across almost all Districts, to varying degrees,\" the report stated. \"Non-auto retail sales grew at a moderate pace across most of the country.\"\nIn its previous Beige Book report in mid-April, the Fed said the economy had started to rebound from weather-related declines earlier in the year.","url":"https://www.nbcnews.com/business/economy/economy-improving-across-country-fed-says-n122631"}
