{"authors":["Associated Press"],"date_download":"2018-10-22 22:52:25","date_modify":"2018-10-22 22:52:25","date_publish":"2017-03-16 05:04:16","description":"FRANKFURT, Germany (AP) - When President Donald Trump this year said the dollar might be \"too strong,\" he added a new twist to how the U.S. government talks...","filename":"data/vaneerConsumption/EconomistTrumppolicieslikelytodriveupdollar.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/05/wire-226465-1489640666-50_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318894_Economist-Trump-policies-likely-drive-dollar_1540248745.html","title":"Economist: Trump policies likely to drive up dollar","title_page":"Economist: Trump policies likely to drive up dollar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FRANKFURT, Germany (AP) - When President Donald Trump this year said the dollar might be \"too strong,\" he added a new twist to how the U.S. government talks about its currency.\nGoing back to the 1990s, U.S. officials have repeated that the U.S. believed in a \"strong dollar,\" a mantra meant to avoid roiling currency markets.\nHow to handle currencies will be a key topic of discussion at a meeting Friday and Saturday of finance chiefs from the Group of 20 key economies in Baden-Baden, Germany.\nA man looks at an electronic stock board of a securities firm in Tokyo, Wednesday, March 15, 2017. Asian stocks were mixed Wednesday as the Fed met to decide on whether to hike interest rates in view of improvements in the U.S. economy. (AP Photo/Koji Sasahara)\nPrevious gatherings have stressed the need for countries to avoid taking deliberate steps to send their currencies lower, to avoid a so-called \"currency war\" in which nations compete at weakening their exchange rates.\nThe Associated Press asked Barry Eichengreen, professor of economics at the University of California at Berkeley, about how the new U.S. administration's comments and policies could affect the dollar.\n___\nQ: What's the likely impact on the dollar of the new administration's economic policies?\nA: There's no question that everything the new administration is intent on doing will strengthen the dollar. Number one, to change the policy mix in the direction of looser fiscal policy and tighter monetary policy (higher interest rates) makes for a stronger dollar. Number two, moving to a border adjustment tax (on imports) on the corporate tax front, which is being actively considered by the administration, would make for a stronger dollar. And number three, if the Trump administration resorts to tariffs - if it otherwise restricts imports from Mexico and China and more generally - you are going to push the dollar up as well.\nSo almost everything that is being considered in terms of economic policy changes will work to strengthen the dollar in an environment where the Trump administration would prefer to see the dollar weaken in order to, quote, bring manufacturing jobs back to the United States, end quote.\n___\nQ: What impact would a stronger dollar have on the U.S. economy?\nA: You've got to look at the whole combination of policies together. Main Street will be affected by all the other things that are going on that result in the stronger dollar. So what we're likely to see is income tax cuts, corporate tax changes, trade policy changes and a stronger dollar. And if you think that the U.S. economy is at full employment and growth is at potential, those changes are likely to lead to a stronger dollar, more inflation, but no more economic growth - and if you think the trade policy changes will be a big negative, like most economists do, maybe slower (growth).\n___\nQ: What is the outlook for the dollar's role as the dominant reserve currency?\nA: People have questions and worries about the future of the dollar but there is no alternative. They have deeper questions and doubts about the euro, they have even deeper doubts and questions about the Chinese renminbi or the Japanese yen. ... The main thing that would potentially damage the dollar's role as the leading international currency would be doubts about its stability and about the willingness of the U.S. government to stand behind it.\n___\nQ: How are other countries likely to respond to this change where a U.S. president says the dollar is too strong?\nA: Number one, it's not clear whether going forward there is going to be a change in communication coming from the White house and the Treasury. I think in terms of currency policy, just like in trade policy and the other policies, economic policies, in the Trump administration there is a battle for the soul of the administration or the ear of the president between economic moderates like (Economic Adviser) Gary Cohn and (Treasury Secretary) Steve Mnuchin and people who are economic nationalists or extremists. And I think the moderates would prefer that President Trump not make provocative statements about the dollar. So we don't know for sure if there will be an enduring change in communication at this point.\n___\nQ: You're an expert on the Great Depression. In the 1930s there was a period when countries didn't cooperate, devaluing their currencies or putting tariffs on imports. Is there any relevance from that for today?\nA: Yes, there is. Non-cooperative currency policies and exchange rate policies can lead to trade protectionism as well. So if the Trump administration grows unhappy about the strength of the dollar it has, probably, limited ability to push the dollar down in the short turn. ... But it can respond by slapping new tariffs on imports as a way of trying to neutralize the impact of the strong dollar. So conflicts over exchange rates spill over to conflicts over trade. And if you think that global supply chains are important to U.S. companies, all of that is at risk if currency conflict spills over into trade conflict and all this gets out of hand.","url":"https://www.dailymail.co.uk/wires/ap/article-4318894/Economist-Trump-policies-likely-drive-dollar.html"}
