{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-22 23:17:00","date_modify":"2018-10-22 23:17:00","date_publish":"2016-01-28 12:05:41","description":"WARNING: GRAPHIC CONTENT. An Ecuadorian man, 52, fell to his death in Alicante, Spain, when he tried to get into his home by lowering himself on a rope after leaving his keys inside.","filename":"data/vaneerConsumption/EcuadoriannationalfallstodeathontheCalledelDoctorBuadesAlicante.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA53C600000578-0-image-a-31_1453984197077.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420734_Ecuadorian-national-falls-death-Calle-del-Doctor-Buades-Alicante-trying-access-flat-outside-using-rope_1540250220.html","title":"Ecuadorian national falls to death on the Calle del Doctor Buades, Alicante","title_page":"Ecuadorian national falls to death on the Calle del Doctor Buades, Alicante | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the nerve-shredding moment a man plunged to his death from the fourth floor of a building.\nThe 52-year-old Ecuadorian national, who lived in Alicante, Spain, had supposedly left his keys inside his home.\nHis plan was to access the apartment by lowering himself using a rope and entering his home via a window.\nLocked out: This is the horrifying moment a man plunged to his death from a height of the fourth floor of a building. The 52-year-old Ecuadorian national, who lived on the Calle del Doctor Buades in Alicante, had supposedly left his keys inside his home\nDesperate measures: His neighbour helped him out and the rope was tied to the roof. The footage, filmed from an opposite apartment, shows the man's agonising descent down to the top level\nHis neighbour helped him out and the pair tied ropes to the roof.\nThe footage, filmed from an opposite apartment, shows the man's agonising descent down to the top level.\nHe seems in control and he balances on the ledge of a window before moving over to the balcony.\nThe man then transfers his weight back to the rope in order to get to the lower floor.\nHowever the rope twists leaving him swinging, with his back to the wall. Somehow he loses his grip and slides down the rope.\nThe footage then captures the horrifying sight of the man losing control altogether and plunging suddenly down to the road.\nThe person filming did not show the moment of impact.\nSome online commentators have been unsympathetic, saying: 'Amazing that someone was stupid enough to do this and found someone stupid enough to help, they were a match made in heaven' and 'This is why locksmiths were invented'.\nVarious people have also remarked that the man should be awarded the Darwin Award, a tongue-in-cheek annual review of the most foolish ways people have died.\nIt supposedly rewards foolhardy people for helping evolution by selecting themselves out of the gene pool.\nLosing control: The man then transfers his weight back to the rope in order to get to the lower floor. However the rope twists leaving him swinging, his back to the wall","url":"https://www.dailymail.co.uk/news/article-3420734/Ecuadorian-national-falls-death-Calle-del-Doctor-Buades-Alicante-trying-access-flat-outside-using-rope.html"}
