{"authors":["Kelli Serio"],"date_download":"2018-10-30 20:00:35","date_modify":"2018-10-30 20:00:35","date_publish":"2015-05-15 19:50:44","description":"Pearl Jam front man Eddie Vedder will serve as David Letterman's final musical guest next week as the host's Late Show tenure comes to a close after more than 20 years on CBS. |","filename":"data/vaneerConsumption/EddieVeddertobeDavidLettermansFinalMusicalGuest.json","image_url":"https://media.breitbart.com/media/2015/05/vedder-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_05_15__1540929635.html","title":"Eddie Vedder to be David Letterman's Final Musical Guest","title_page":"Eddie Vedder to be David Letterman's Final Musical Guest | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pearl Jam front man Eddie Vedder will serve as David Letterman’s final musical guest next week as the host’s Late Show tenure comes to a close after more than 20 years on CBS.\nVedder, who has performed on the show several times over the past 20 years, will reportedly perform with the Late Show’s Paul Shaffer and the CBS Orchestra.\nThe “Even Flow” singer first visited the show in February of 1996 when he stopped by for a surprise performance of the hit single “Black.”\nLetterman eventually adopted the Pear Jam hit as part of his nightly Schtick.\nNumerous other celebrities have stopped by the Ed Sullivan Theatre to bid farewell to Letterman in the past few weeks, including President Obama.\nOther musicians, such as Dave Matthews Band and Ryan Adams, have also made Letterman appearances recently to serenade the talk show host by revisiting old performances.\nTom Hanks will make his 60th appearance on the show Monday, Bill Murray plans to stop by Tuesday night for his 44th time, and CBS promises “an hour filled with surprises” for Wednesday’s finale.\nStephen Colbert will take over for Letterman later this year, and is expected to shed his Comedy Central satirical persona.\nWatch: Eddie Vedder Sings “Black” on Letterman in 1996.","url":"https://www.breitbart.com/entertainment/2015/05/15/eddie-vedder-to-be-david-lettermans-final-musical-guest/"}
