{"authors":["Eddie Hearn For The Daily Mail"],"date_download":"2018-10-23 01:38:00","date_modify":"2018-10-23 01:38:00","date_publish":"2017-03-16 11:52:47","description":"EDDIE HEARN: Now that the dust has settled after that thrilling night at The O2, we are dealing with the aftermath with a new heavyweight superstar in Tony Bellew.","filename":"data/vaneerConsumption/EddieHearnCouldTysonFurybeTonyBellewsnextfight.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3DF7501C00000578-0-image-a-26_1489665039419.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_bradley_wiggins_article-4319854_Eddie-Hearn-Tyson-Fury-Tony-Bellew-s-fight_1540258680.html","title":"Eddie Hearn: Could Tyson Fury be Tony Bellew's next fight?","title_page":"Eddie Hearn: Could Tyson Fury be Tony Bellew's next fight? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Now that the dust has settled after that thrilling night at The O2, we are dealing with the aftermath with a new heavyweight superstar in Tony Bellew.\nThe media and commercial requests have been endless and so to have the big fight possibilities arriving at the door. The fight with David Haye was taken for two reasons – firstly, because he believed he could win and secondly because it would secure his children's future and after all, in a game so tough, that has to be a priority.\nTony is the epitome of 'the man on the street' - a man driven by desire and solely focused on his family and providing for them. He has had a tough career littered with achievement - British, Commonwealth and European titles at light heavyweight before falling short in two world title challenges. So many people wrote him off.\nTony Bellew made history by defeating David Haye at the O2 in London in March\nBellew was a massive underdog but overcame the odds to claim the win against Haye\nBellew now has the pick of his opponents and is in control of his own destiny\nThen he went to cruiserweight and won European and world titles. That was already beyond what most people thought he could do. But not him.\nNow look at Tony – he has gone to heavyweight and, let's be honest, he's absolutely cracked it. Although the pre-fight build up was distasteful at times, both men's stock rose considerably in the fight.\nBellew proved all he said he would by beating one of the world’s best heavyweights and David Haye showed tremendous heart to carry on in the fight, something the public have sometimes doubted.\nHis next opponent could well be Tyson Fury, who has had a long spell away from the sport\nSo where next? Is there a desire to try to become the heavyweight champion of the world? How about a super fight with the controversial Tyson Fury? Will Haye be back and will public demand mean that we see that one again?\nIt's a great spot for Tony to be in but first things first we await the fate of his hand injury. We hope that the fracture sustained in the second round was just a fracture, otherwise he will need surgery which will keep him out for five or six months.\nOne thing is for sure, Tony's life will never be the same again. I'm so happy for him and let me tell you he's earned absolutely everything he's got.\nBellew is a family man and whatever his next move is, it will be in the best interests of his family\nWe are almost there in announcing one of the best fights in world boxing - Kell Brook v Errol ‘The Truth’ Spence for the IBF welterweight championship of the world.\nAs I told Sportsmail this week, Sheffield Council are just rubber stamping our application for a May 27 date at Bramall Lane in Sheffield and hopefully we will be ready to announce soon.\nIt's a stunning fight between two outstanding fighters - on May 27 we will find out the real truth about the welterweight division.\nFight fans should expect a thriller when Kell Brook takes on Errol Spence on May 27\nNext week sees another stunning fight on Sky Sports in a rematch of one of the 2016 fights of the Year between Anthony Crolla and Jorge Linares in Manchester.\nLinares put together a stunning performance last September but Crolla and trainer Joe Gallagher feel they have the perfect game plan for the rematch and Anthony is absolutely flying in training.\nThis is a hard task but my gut tells me he is going to do this - I know that everyone in the packed Manchester Arena we will be behind him and willing him on to become the king of the lightweight division.\nAnthony Crolla takes on Jorge Linares in a re-match of one of the best fights of 2016\nThis Friday sees the launch of our new fight series #NXTGEN. It's a fast-paced show that will allow the young stars at Matchroom the chance to shine under the bright lights with big TV exposure.\nIt's a bit of Friday fun away from the Saturday Night Fight series and the York Hall will be absolutely packed to watch these young guns in action. Coverage starts at 7pm on Sky Sports Facebook and then live on Sky Sports 1 at 10pm. Look out for the two main fights - undefeated Londoners Craig Richards and champion Alan Higgins do battle for the Southern Area title and Watford's big hitter Reece Bellotti takes on Welshman Dai Davies for a shot at the British title.\nAll the fighters will be out to impress fight fans as they look to progress into the big time on Saturday Night Fight nights and PPV shows in some of the biggest, most prestigious venues in the world.","url":"https://www.dailymail.co.uk/sport/bradley_wiggins/article-4319854/Eddie-Hearn-Tyson-Fury-Tony-Bellew-s-fight.html"}
