{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 04:26:12","date_modify":"2018-10-23 04:26:12","date_publish":"2016-01-29 20:01:35","description":"They stole the show at the Golden Globes after announcing they were expecting their first child. But ahead of another glitzy awards bash, Hannah Bagshawe seemed to be keeping things low-key.","filename":"data/vaneerConsumption/EddieRedmaynejetstoLAwithhispregnantwifeHannahBagshawebeforeSAGawards.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E4B600000578-0-image-a-74_1454094527795.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423291_Eddie-Redmayne-s-pregnant-wife-Hannah-Bagshawe-conceals-bump-loose-fitting-jumper-SAG-awards_1540268772.html","title":"Eddie Redmayne jets to LA with his pregnant wife Hannah Bagshawe before SAG awards","title_page":"Eddie Redmayne jets to LA with his pregnant wife Hannah Bagshawe before SAG awards | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They stole the show at the Golden Globes after announcing they were expecting their first child.\nBut ahead of another glitzy awards bash, Hannah Bagshawe seemed to be keeping things low-key, concealing her growing baby bump in a baggy jumper as she made her way through Heathrow airport on Friday.\nJoined by Eddie Redmayne, the publicist, 33, was radiating with a healthy pregnancy glow as she prepared to make the 11-hour flight to Los Angeles to support her husband at Saturday's SAG awards.\nScroll down for video\nBaby on board! Hannah Bagshawe seemed to be keeping things low-key as she concealed her growing baby bump in a baggy jumper in Heathrow airport with husband Eddie Redmayne on Friday\nClad in a loose fitting black jumper and brown suede jacket, the mum-to-be cut a casual but chic figure as she made her way through the airport.\nSheathing her shapely legs in a pair of skinny jeans, the brunette beauty upped the comfort levels in a pair of cosy grey boots.\nLeaving her locks loose and tousled, she held on to a large black handbag whilst Eddie pushed all their Globe-Trotter luggage.\nMum-to-be: The publicist, 33, was radiating with a healthy pregnancy glow as she prepared to make the 11-hour flight to Los Angeles to support her husband at Saturday's SAG awards\nGentleman: Leaving her locks loose and tousled, Hannah held on to a large black handbag whilst Eddie carried all of their luggage through the airport\nMeanwhile, the 34-year-old Oscar winner seemed deep in thought as he escorted his wife through the airport.\nClad in double denim, Eddie was no doubt apprehensive to find out if his work in The Danish Girl has done enough to bag him his second Screen Actor's Guild Award.\nLast year, the star scooped Outstanding Performance by a Male Actor in a Leading Role for his work in The Theory Of Everything, and is up for the same gong this year for his role as a transgender artist in The Danish Girl.\nPreoccupied: The 34-year-old Oscar winner seemed deep in thought as he escorted his wife through the airport. Clad in double denim, Eddie was no doubt apprehensive ahead of Saturday's SAG awards\nApprehensive: The star, who took care of the Globe-Trotter cases, was no doubt be feeling the pressure as he made his way to Los Angeles after losing out to Leonardo DiCaprio at the Golden Globes earlier this month\nThe star will no doubt be feeling the pressure after losing out to Leonardo DiCaprio at the Golden Globes earlier this month.\nBut whilst he may have walked away empty-handed at the event, he was no doubt still in good spirits after announcing his wife's pregnancy.\nAsked whether they were expecting by veteran presenter Ryan Seacrest, Eddie simply said: 'That is true.'\nAll-smiles! The pair were no doubt still in good spirits after announcing their pregnancy\nDad-to-be: Eddie is expected to welcome a son or daughter in late spring\nThe couple were then presented with baby shower gifts which included onesies saying 'You Should See My Crib' and 'Milking My 15 Minutes'.\nLaughing, Eddie responded: 'I’m sweating now – she’s calm I’m not.'\nIt's believed the couple will welcome their new addition in the late spring.\nSurprise! Reporters at the SAGs will no doubt be keen to talk to the pair after their shock pregnancy announcement at the last big awards","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423291/Eddie-Redmayne-s-pregnant-wife-Hannah-Bagshawe-conceals-bump-loose-fitting-jumper-SAG-awards.html"}
