{"authors":["Lily Waddell For Mailonline"],"date_download":"2018-10-23 02:11:53","date_modify":"2018-10-23 02:11:53","date_publish":"2017-03-16 12:33:20","description":"The Theory of Everything star is now trying his hand at voicing an animated character in new children's flick Early Man brought to life by the team behind Wallace and Gromit.","filename":"data/vaneerConsumption/EddieRedmaynescheekycharmbreatheslifeintoEarlyMan.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54323500000578-0-image-a-285_1489668302250.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319234_Eddie-Redmayne-s-cheeky-charm-breathes-life-Early-Man_1540260713.html","title":"Eddie Redmayne's cheeky charm breathes life into Early Man","title_page":"Eddie Redmayne's cheeky charm breathes life into Early Man | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's played the teen heartthrob, a transgender pioneer and famous cosmologist Stephen Hawkings.\nNow Eddie Redmayne has tried his hand at voicing an animated character in new children's flick Early Man, as a new trailer showed the much-lauded star make his latest career move where he stars opposite his old school pal Tom Hiddleston.\nThe movie, created by the iconic Aardman Animations, takes viewers back to the dawn of Earth when cavemen lived among dinosaurs and woolly mammoths, with the 35-year-old Londoner depicting heroic Dug.\nEddie has taken on the leading role of brave caveman Dug who goes on an adventure to unite his tribe against an enemy, joined by his sidekick Hognob.\nThe movie, which is currently filming in Bristol and due for release next year, sees Eddie's character joined with his best friend Hognob, take on villain Lord Nooth, played by Tom Hiddleston.\nBoth Eddie and Tom attended the prestigious Harrow School, previously revealing they had starred together in a school play, yet this is their first silver screen role.\nEddie will no doubt win over audiences as Dug as he sets out to protect his tribe in the movie which is another project for the production partnership with Aardman and StudioCanal, following the success of 2015's Shaun The Sheep.\nLooking dapper! Eddie Redmayne has tried his hand at voicing an animated character in the new children's flick Early Man, as a new trailer showed the much-lauded star make his latest career move where he stars opposite his old school pal Tom Hiddleston\nFirst look: The movie, created by the iconic Aardman Animations, takes viewers back to the dawn of Earth when cavemen lived among dinosaurs and woolly mammoths, with the 35-year-old Londoner depicting heroic Dug\nDifferent look: Eddie has taken on the leading role of brave caveman Dug who goes on an adventure to unite his tribe against an enemy, joined by his sidekick Hognob\nStudioCanal is joining with the British Film Institute to finance the project for release in UK, France, Germany, Australia and New Zealand, selling worldwide.\nIn light of the movie's first glimpse, filmmaker Nick Parker revealed Eddie is perfect for the role of the hero as he is full of energy and great fun to work with.\nNick told Empire: 'Not only is Eddie a joy to work with, his versatility and boundless energy have really helped to bring my new character to life...\n'He embodies the cheeky charm, fun and plucky wit of Dug and I’m sure he’ll get along brilliantly with Dug’s sidekick Hognob.'\nLong term pals: The duo have known each other for many years\nUp there: StudioCanal is joining with the British Film Institute to finance the project for release in UK, France, Germany, Australia and New Zealand, selling worldwide\nCheeky chap! In light of the movie's first glimpse, filmmaker Nick Parker revealed Eddie is perfect for the role of the hero as he is full of energy and great fun to work with\nIn October, he also discussed Tom's involvement: 'Tom is a wonderful actor and it’s so thrilling to see him bring our comic villain to life with his amazing talent, energy and enthusiasm.'\n'It is a great privilege to work with Tom and I’m so excited to see his character Lord Nooth emerge on screen!'\nLast month, Tom revealed the truth of their first ever role together at Harrow as he said on The Graham Norton Show: 'Eddie was a great talent even then. He was a huge star. It was an all boys school and the great, now Oscar winning Eddie Redmayne was playing the female lead.\nGood stuff: In October, he also discussed Tom's involvement: 'Tom is a wonderful actor and it’s so thrilling to see him bring our comic villain to life with his amazing talent, energy and enthusiasm'\nThat was then: In October, he also discussed Tom's involvement: 'Tom is a wonderful actor and it’s so thrilling to see him bring our comic villain to life with his amazing talent, energy and enthusiasm'\n'In a Passage to India there’s an expedition to this cultural landmark called Marabar Caves by elephant. I’m delighted to reveal that I played the front right leg of the elephant that Eddie was on.’\nIn his latest movie, Eddie made a success of his leading role in Harry Potter author J.K. Rowling's Fantastic Beasts and Where to Find Them as explorer Newt Scamander.\nIt appears the star has become more involved in children's movies since he welcomed his first child Iris Mary with his wife Hannah in the summer of last year.\nEARLY MAN is released in UK cinemas on January 26th 2018","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319234/Eddie-Redmayne-s-cheeky-charm-breathes-life-Early-Man.html"}
