{"authors":["Simeon Gholam For Mailonline"],"date_download":"2018-10-22 23:40:44","date_modify":"2018-10-22 23:40:44","date_publish":"2016-01-29 12:04:14","description":"With their Six Nations opener against Scotland just over a week away, new England head coach Eddie Jones has been at Twickenham to put his side through its paces.","filename":"data/vaneerConsumption/EddieJonesandcaptainDylanHartleyleadEnglandintrainingsessionatTwickenhamastheystepuppreparationforSixNations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B2292800000578-0-image-a-49_1454070369298.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3422655_Eddie-Jones-captain-Dylan-Hartley-lead-England-training-session-Twickenham-step-preparation-Six-Nations_1540251644.html","title":"Eddie Jones and captain Dylan Hartley lead England in training session at Twickenham as they step up preparation for Six Nations","title_page":"Eddie Jones and captain Dylan Hartley lead England in training session at Twickenham as they step up preparation for Six Nations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With their Six Nations opener against Scotland just over a week away, new England head coach Eddie Jones has been at Twickenham to put his side through its paces.\nLed by recently-installed captain Dylan Hartley, England trained on Friday morning as they stepped up their preparations for the trip to Murrayfield.\nThe whole squad were in action at England's home stadium, including former captain Chris Robsaw, under the watchful eye of new boss Jones.\nNew England captain Dylan Hartley led his side out for training at Twickenham on Friday\nNew England head coach Eddie Jones speaks to his players during the session at their home stadium\nOwen Farrell (front) and his his England team-mates were put through their paces ahead of the Six Nations\nEngand will not be in action at Twickenham in the Six Nations until their third game, four weeks from now, as they travel to Italy following their game with Scotland.\nBut it was still vital preparation for Jones, as he continues to get used to his new surroundings following his appointment and ahead of his debut as head coach.\nHartley was named captain by Jones, but Wasps boss Dai Young tipped lock Joe Launchbury as a future captain for club and country, even though the 24-year-old has missed out with England opting for the Northampton hooker.\nNew England head coach Jones has backed Hartley to the hilt in challenging him to lead the Six Nations assault despite a career suspensions tally totalling 54 weeks.\nLaunchbury was among the front-runners to replace Robshaw as captain after England's World Cup failings, but Young believes he could yet benefit from more time to hone his trade while out of the spotlight.\n'We definitely see Joe as a future captain for Wasps and I'm sure that would help him in his quest to one day be England captain,' Young said.\n'I'm sure that will come to him one day, that he will lead England, but from his point of view it's not something that Joe would be worried about. I think Dylan (Hartley) being England captain now, it gives Joe a bit more breathing space to develop. But certainly from our point of view we see him as a future captain here.'\nLaunchbury, Courtney Lawes and George Kruis will battle it out for the two second-row berths against Scotland. Young believes Launchbury already boasts many of the qualities required for Test leadership - but expects England's 28-cap mainstay to continue to fine-tune that craft.\n'He's developing his leadership skills season on season really,' Young said. 'The more experience he picks up, the more confident he is in displaying his leadership qualities. And we are pushing him in that direction.'\nNew head coach Jones appeared to be in high spirits as he prepared to lead England for the first time\nThe boss speaks to his players in front of a crowd at Twickenham before their opener against Scotland\nFormer England captain Chris Robshaw (second right) was also in action on Friday morning\nEngland fly half Owen Farrell was being put through his paces as he competed for a starting spot against Scotland\nMeanwhile, Jones and and Scotland boss Vern Cotter have engaged in a round of verbal sparring in the build-up to their opener.\nBoth coaches have installed their rival's team as favourites for the Edinburgh showdown on Saturday week with Jones arguing the Scots' performance at the World Cup identifies them as the form team in Europe.\nThe 55-year-old compared England's dismal showing at the global showpiece, in which they failed to qualify for the knockout phase, to Scotland being denied a place in the semi-finals by an erroneous penalty decision.\n'Remember that photo that was sent around during the World Cup? It was of an English gentleman trying to get out of the pool and he couldn't do it,' Jones said.\n'Well Scotland made it out of the pool and nearly got to the semi-final. The difference in performance at the World Cup was enormous.\n'Both teams will have had two weeks to prepare so the advantage that Scotland has is massive, but they have to carry that pressure of favouritism which is something they probably aren't used to.'\nEngland full-back Mike Brown runs with the ball at Twickenham as he prepares for their opening match next week\nHartley stepping out onto the Twickenham pitch as England captain for the open training session\nHead coach Jones speaks to his troops including Farrell as he gears up for the huge clash with Scotland\nJones is known for his willingness to probe for opposition weaknesses through mind games and Cotter responded by expressing his surprise that the Australian has resorted to this measure.\n'I don't know how Eddie works that out. It's just a psychological lever that he's trying to use, to take the pressure off himself,' the Scotland head coach said.\n'I gather that England are still ranked ahead of us by World Rugby. I didn't think England would need that, I thought they would be comfortable with the favourites' tag.\n'As I say, those are things used generally to take you away from the game. All that peripheral stuff will be swept aside.'\nAlex Goode (left) is tackled by Jack Nowell (right) of England as Jamie George watches on in the background\nEngland scrum-half Ben Youngs (left) takes the ball out of the ruck before releasing it to a team-mate\nEngland forward James Haskell (centre) attempts to battle his way through a tackle during training\nThe training session at Twickenham was held in front of 15,000 spectators. Head coach Jones said: 'Today's open training session was a really important moment for the whole England team. Every player on the pitch today started rugby either at school or with their local club and now they are playing for their national side; I hope seeing the team train at Twickenham has offered inspiration to any young players out there.\n'A lot has been achieved in joining the senior squad with the wider game and we want to ensure that continues, while showing our appreciation for all the support as we go into the Six Nations.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3422655/Eddie-Jones-captain-Dylan-Hartley-lead-England-training-session-Twickenham-step-preparation-Six-Nations.html"}
