{"authors":["Press Association"],"date_download":"2018-10-23 00:31:21","date_modify":"2018-10-23 00:31:21","date_publish":"2016-01-28 14:35:54","description":"Eddie Jones and Vern Cotter have engaged in a round of verbal sparring in the build-up to England's RBS 6 Nations opener against Scotland at Murrayfield. Bot...","filename":"data/vaneerConsumption/Eddiejonesbeginsmindgamesaheadofenglandsclashwithscotland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-4d671bad-5a0d-4092-b51b-ede3f097b55d-2vdWmEltwXfba0ce28e63299d6ea-466_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3418907_Dylan-Hartley-no-problem-insists-England-coach-Eddie-Jones_1540254681.html","title":"Eddie jones begins mind games ahead of england's clash with scotland","title_page":"Eddie jones begins mind games ahead of england's clash with scotland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eddie Jones begins mind games ahead of England's clash with Scotland\nEddie Jones and Vern Cotter have engaged in a round of verbal sparring in the build-up to England's RBS 6 Nations opener against Scotland at Murrayfield.\nBoth coaches have installed their rival's team as favourites for the Edinburgh showdown on Saturday week with Jones arguing the Scots' performance at the World Cup identifies them as the form team in Europe.\nThe 55-year-old compared England's dismal showing at the global showpiece, in which they failed to qualify for the knockout phase, to Scotland being denied a place in the semi-finals by an erroneous penalty decision.\nEddie Jones, right, has named Dylan Hartley as captain against Scotland.\n\"Remember that photo that was sent around during the World Cup? It was of an English gentleman trying to get out of the pool and he couldn't do it,\" Jones said.\n\"Well Scotland made it out of the pool and nearly got to the semi-final. The difference in performance at the World Cup was enormous.\n\"Both teams will have had two weeks to prepare so the advantage that Scotland has is massive, but they have to carry that pressure of favouritism which is something they probably aren't used to.\"\nJones is known for his willingness to probe for opposition weaknesses through mind games and Vern Cotter responded by expressing his surprise that the Australian has resorted to this measure.\n\"I don't know how Eddie works that out. It's just a psychological lever that he's trying to use, to take the pressure off himself,\" the Scotland head coach said.\n\"I gather that England are still ranked ahead of us by World Rugby. I didn't think England would need that, I thought they would be comfortable with the favourites' tag.\n\"As I say, those are things used generally to take you away from the game. All that peripheral stuff will be swept aside.\"\nJones sees the set-piece as England's foundation, but uses the case of Stoke City to illustrate why his team will also approach the Six Nations with a level of ambition.\n\"It's all about mindset. Every time you attack there is a risk involved. If you want to play like the old Stoke City then that's the safest way to play isn't it?\" Jones said.\n\"Just stick the ball in the air, chase hard and get everyone to clap. If you're not a strong side you can guarantee a close game.\n\"There's a fascinating book on soccer - Soccernomics - it's all about the data on soccer.\n\"It shows that teams which have done really well by playing high balls are teams that minimise the amount of time the ball is in play.\n\"It makes sense - minimise the time the ball is in play and it minimises the time the other team have to score.\n\"If you are kicking the ball relentlessly down the other end then it minimises the number of opportunities the other team will have to score.\n\"Rugby is exactly the same. Every time you run with the ball or pass the ball you are taking a greater risk than if you kick the ball.\n\"So it is developing that mindset that you have the belief and confidence to run with the ball and look after the ball properly. That's what we want in our team.\n\"We don't want to be reckless. But we don't want to be like an old Stoke City either - I know they are different now.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3418907/Dylan-Hartley-no-problem-insists-England-coach-Eddie-Jones.html"}
