{"authors":["Press Association"],"date_download":"2018-10-23 03:01:35","date_modify":"2018-10-23 03:01:35","date_publish":"2017-03-10 12:23:06","description":"Defender Mings was suspended by the FA for standing on the head of Zlatan Ibrahimovic during Saturday´s 1-1 draw at Manchester United.","filename":"data/vaneerConsumption/EddieHowestandsupforbannedgentlegiantTyroneMings.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/12/wire-195879-1489148590-501_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4301114_Eddie-Howe-stands-banned-gentle-giant-Tyrone-Mings_1540263695.html","title":"Eddie Howe stands up for banned `gentle giant´ Tyrone Mings","title_page":"Eddie Howe stands up for banned `gentle giant´ Tyrone Mings | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bournemouth boss Eddie Howe feels “gentle giant” Tyrone Mings has been hard done by after being hit with a five-match ban.\nDefender Mings was suspended by the Football Association for standing on the head of Zlatan Ibrahimovic during Saturday’s 1-1 draw at Manchester United.\nIbrahimovic received a three-match ban for his subsequent elbow on Mings, but the Cherries man was given a longer suspension following an independent regulatory commission hearing.\nYou can read the full story here: https://t.co/5WZB5FcSvv — The FA (@FA) March 8, 2017\nThe FA stated the standard punishment of three matches would have been “clearly insufficient”, but Howe and Bournemouth maintain the clash was an accident.\n“We are disappointed for Tyrone, we feel it was accidental,” Howe said at his press conference ahead of Saturday’s home meeting with West Ham.\n“I don’t think he has that kind of streak in him. Although he is a beast in stature he is certainly a gentle giant on and off the pitch. It’s a real shame for him.\n“I see a defender who has made a very good tackle trying to get back to his goal as quickly as possible. His focus is on the ball, not on what lies beneath him.\nEddie Howe\n“You can make any interpretation you want, you can see what you want to see, but I think people who understand the game to a really high level – especially being a defender myself – will know that your only priority is to defend your goal.”\nBournemouth cannot appeal against the suspension so Howe will now be without Mings until the trip to Tottenham on April 15.\n“We’ve looked at several options, but at the end of it we have to take the decision and move on,” he added.\nMeanwhile, Mings has reiterated that he did not intentionally tread on the United striker and revealed his disappointment and hurt at the decision.","url":"https://www.dailymail.co.uk/wires/pa/article-4301114/Eddie-Howe-stands-banned-gentle-giant-Tyrone-Mings.html"}
