{"authors":["Press Association"],"date_download":"2018-10-23 01:23:14","date_modify":"2018-10-23 01:23:14","date_publish":"2016-01-11 12:11:20","description":"Eddie Jones has insisted anyone overlooked for England's RBS 6 Nations squad \"hasn't done well enough\". England's new head coach will name his first Elite Pl...","filename":"data/vaneerConsumption/Eddiejonesplayerswhomissoutonenglandselectionhaventdonewellenough.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-8c08fd65-093d-414b-8852-e4e7a518ec7c-56CX32zFKLb7123928b84ce64616-433_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3392863_Eddie-Jones-Players-miss-England-selection-havent-enough_1540257794.html","title":"Eddie jones: players who miss out on england selection haven't done well enough","title_page":"Eddie jones: players who miss out on england selection haven't done well enough | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eddie Jones: Players who miss out on England selection haven't done well enough\nEddie Jones has insisted anyone overlooked for England's RBS 6 Nations squad \"hasn't done well enough\".\nEngland's new head coach will name his first Elite Player Squad (EPS) on Wednesday, and has vowed to \"increase the tempo\" and not rely on suffocating opponents.\nJones confirmed his coaching staff recruitment is complete for the Six Nations, declaring \"ultimately we want to be the most dominant team in the world\".\nEddie Jones, pictured, has vowed to increase England's attacking tempo\n\"It puts no pressure on me: the pressure's on the player,\" Jones told RFU.com of scrutiny over his selection choices.\n\"The player that hasn't been selected hasn't done well enough, it's as simple as that. So all the pressure is on the player.\n\"I accept that there will be criticism of the squad and I accept that people will think other players should be in.\n\"Everyone's entitled to their opinion, but at the end of the day the players select themselves.\n\"And the players select themselves because they express themselves in a way that I can see them being a profitable part of a winning England team.\n\"You have to be able to increase the tempo of the game.\n\"The old days where you could just strangulate teams, yes you can do that every now and then in Test matches but you've got to be able to increase the tempo of the game at various times.\n\"And you see everything that's being done in the game at the moment, and the latest example is the maul, and everything that's being done to speed the game up, the game's not going to regress, it's going to go forward.\n\"Ultimately we want to be the most dominant team in the world, but to start with we've got to beat Scotland. That's the most important thing.\"\nJones confirmed he will handle England's attacking game during the Six Nations rather than draft in a backs specialist, having opted not to pursue Northampton's Alex King.\n\"We're all done and dusted mate,\" said Jones of his back-room recruitment.\n\"We've got Steve Borthwick looking after set-piece with Ian Peel assisting, Gussy (Paul Gustard) looking after defence and I'm going to handle the attack so we don't need anything else at this stage.\n\"We've got to get the basis of the game right, nothing goes away from the meat and potatoes of the game.\n\"You've got to be able to win your set-piece ball well, you've got to be able to defend well.\n\"Then the plus bit for England is being able to attack well, and that's the area that takes time, because it is more complicated, it is more complex.","url":"https://www.dailymail.co.uk/wires/pa/article-3392863/Eddie-Jones-Players-miss-England-selection-havent-enough.html"}
