{"authors":[],"date_download":"2018-10-21 02:47:44","date_modify":"2018-10-21 02:47:44","date_publish":"2018-07-26 13:28:00","description":"Ramirez will be joining the newsroom’s core social team and will be chiefly responsible for growing the audience and engagement for Opinions content across social platforms.","filename":"data/vaneerConsumption/EdgarRamirezjoinsThePostasasocialmediaproducerforOpinions.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_07_26__1540090064.html","title":"Edgar Ramirez joins The Post as a social media producer for Opinions","title_page":"Edgar Ramirez joins The Post as a social media producer for Opinions - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Director of Audience Ryan Kellett, Deputy Audience Editor Mark Smith and Opinions Operations Editor Becca Clemons:\nWe are thrilled to announce that Edgar Ramirez is joining The Post as a social media producer for Opinions. Edgar has spent the last seven years at the Pittsburgh Post-Gazette, where he has worked as a copy editor, page designer and most recently in a variety of digital and social roles.\nEdgar will be joining the newsroom’s core social team and will be chiefly responsible for growing the audience and engagement for Opinions content across social platforms. In this role, he’ll take the lead on Post Opinions’ Facebook and Twitter accounts. Edgar will also work closely with Opinions on its growing number of digital franchises, including social video series and its global offerings. He will also advise Opinions writers on best practices and opportunities to grow their audiences.\nIn Pittsburgh, Edgar led the Post-Gazette’s social media accounts for the last two-plus years. In that time, he helped launch and produce Facebook Live programs and implement their strategies on Snapchat and Instagram stories. He also oversaw the newsroom’s transition to a new content management system.\nEdgar is a graduate of Penn State University with a degree in journalism and Latino studies.\nEdgar swears his move to D.C. didn’t have anything to do with the lack of a Stanley Cup this year in Pittsburgh.\nHis first day is Monday. You can find him on Twitter at @ERam631. Please join us in welcoming him to The Post.","url":"https://www.washingtonpost.com/pr/wp/2018/07/26/edgar-ramirez-joins-the-post/"}
