{"authors":[],"date_download":"2018-10-30 17:58:23","date_modify":"2018-10-30 17:58:23","date_publish":"2018-08-23 15:55:26","description":"After spending nearly 20 years in Connecticut, Edible Arrangements announced that it is relocating its headquarters to Sandy Springs.","filename":"data/vaneerConsumption/EdibleArrangementsmovingmainHQfromConnecticuttoSandySprings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/03/05/Images/newsEngin.21415795_ediblearrangements2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_edible-arrangeme_c5fe5f9206bdd83e38a2fd7a6f718ed0__1540922303.html","title":"Edible Arrangements moving main HQ from Connecticut to Sandy Springs","title_page":"Edible Arrangements moving main HQ from Connecticut to Sandy Springs","title_rss":"NULL","source_domain":"ajc.com","text":"The leader in the making of fruit bouquets is moving its main headquarters to metro Atlanta.\nEdible Arrangements announced earlier this week that it would be moving its headquarters from Wallingford, Connecticut to Sandy Springs.\nThe company told the AJC in March about plans to open a “second headquarters” in Sandy Springs that would create 50 jobs in the near-term, and eventually 200 overall. About 20 employees already work at the Edible Arrangements offices in Sandy Springs, which is based in the Lakeside Commons buildings off Hammond Drive.\nIn its Tuesday press release, the company says it plans to keep just 20 of 130 workers in Wallingford. It hopes to complete the relocation process by the end of this year.\nBut layoffs are possible as part of the move and the company will issue a Worker Adjustment and Retraining Notification. A spokesperson for Edible Arrangements told the Associated Press that a “small percentage” of the Wallingford workers will relocate to Sandy Springs and others will be “offered assistance.”\nWATCH | Milton’s Carl Lawson sacks a Dallas Cowboys quarterback\nREAD | Former SNL star Rob Schneider to perform in Sandy Springs\nREAD | Three Atlanta breweries named among ‘the hottest’ in America\n“We are excited to make Atlanta the brand's home base as we build a best-in-class ‘Support Center’ for our franchise owners,” Edible Arrangements CEO Mike Rotondo said in a statement. “Edible's Wallingford office is an important part of the brand's history and heritage, and we will always have a presence in the community. At the same time, the global marketplace is changing at a rapid pace and Atlanta is an attractive location to base much of the team needed to support the company's next phase of growth.”\nRotondo used to be the CEO of Atlanta-based Tropical Smoothie Café. He was also previously a regional director of franchise management for Arby’s.\nEdible Arrangements has had its headquarters in Wallingford for nearly 20 years, according to the Harford Courant.\nThe company, which makes fruit and other food baskets looks like flowers, was founded in 1999 in East Haven, Connecticut. Its first franchise location opened in 2001 in Waltham, Massachusetts. It now has more than 1,200 franchises nationwide.\nLike North Fulton County News Now on Facebook | Follow on Twitter\n﻿MORE...","url":"https://www.ajc.com/news/local/edible-arrangements-moving-main-from-connecticut-sandy-springs/rtg0RV6D31i41zPAJw3xFI/"}
