{"authors":["Press Association"],"date_download":"2018-10-23 02:13:56","date_modify":"2018-10-23 02:13:56","date_publish":"2016-01-11 13:57:21","description":"The wife of ex-Labour leader Ed Miliband is among 107 senior lawyers to be appointed a QC. Environmental barrister Justine Thornton said she was \"absolutely ...","filename":"data/vaneerConsumption/Edmilibandswifejustinethorntondelightedtojoinranksofqcs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-d34d92e7-f619-4e49-ab72-8ceac7530b56-48qEJGFphM8d437f0aaf925a9a43-446_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393951_Ed-Milibands-wife-Justine-Thornton-delighted-join-ranks-QCs_1540260836.html","title":"Ed miliband's wife justine thornton 'delighted' to join ranks of qcs","title_page":"Ed miliband's wife justine thornton 'delighted' to join ranks of qcs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ed Miliband's wife Justine Thornton 'delighted' to join ranks of QCs\nThe wife of ex-Labour leader Ed Miliband is among 107 senior lawyers to be appointed a QC.\nEnvironmental barrister Justine Thornton said she was \"absolutely delighted\" to join the ranks of Queen's Counsel.\nCandidates for the status - known as \"taking silk\" because of the right it confers to wear special robes in court - are considered each year from across the legal profession by an independent panel \"for excellence in advocacy in the higher courts\".\nJustine Thornton said she was \"absolutely delighted\" to join the ranks of Queen's Counsel\nLegal journalist and commentator Joshua Rozenberg was among eight individuals made honorary QCs by the Queen on the recommendation of Lord Chancellor and Justice Secretary Michael Gove.\nChild adoption and abduction specialist Anne-Marie Hutchinson and Clive Walker, an expert on terrorism law who has helped shape UK policy, were also among recipients of the title, which is awarded for contributions to the law outside court practice.\nMore than half of women who applied were granted QC status - compared with 43% for male colleagues - but were still outnumbered by 25 to 82, official statistics released by the Ministry of Justice showed.\nMen were more slightly likely to be interviewed - by 72% to 70%.\nFewer than a third (29%) of the 32 known applications from ethnic minority lawyers were successful - with only 56% being invited to interview.","url":"https://www.dailymail.co.uk/wires/pa/article-3393951/Ed-Milibands-wife-Justine-Thornton-delighted-join-ranks-QCs.html"}
