{"authors":["Julia Pritchard","Ciara Farmer For Mailonline"],"date_download":"2018-10-23 01:23:18","date_modify":"2018-10-23 01:23:18","date_publish":"2017-03-10 09:30:56","description":"The singer, 26, kept things casually cool in a pale blue jumper and cap as he arrived at The Rum Kitchen in Notting Hill to celebrate his recent chart success.","filename":"data/vaneerConsumption/EdSheerancelebrateschartsuccesswithcasualdinner.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21DF8600000578-0-image-a-66_1489137917203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300524_Ed-Sheeran-celebrates-chart-success-casual-dinner_1540257798.html","title":"Ed Sheeran celebrates chart success with casual dinner","title_page":"Ed Sheeran celebrates chart success with casual dinner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His latest album has been his most successful to date - amassing a whopping 56 million streams on its first day of release alone.\nSo it is no wonder Ed Sheeran was in the mood to celebrate on Thursday night, as he headed out for dinner and drinks with his management team in London.\nThe singer, 26, kept things casually cool in a pale blue jumper as he arrived at The Rum Kitchen in Notting Hill to celebrate his recent chart success - flashing the cameras with a cheery thumbs up as he made his way inside.\nScroll down for video\nChart-topper: Ed Sheeran was in the mood to celebrate his recent album success on Thursday, as he headed out for dinner and drinks with his management team in London\nThe Shape of You singer kept things low-key for the outing in a cosy blue jumper, layered atop a burgundy T-shirt.\nKnown for his rocker style, he paired the knit with simple black skinny jeans and a pair of black and grey trainers for a sporty edge.\nMaintinaing the athletic vibe throughout, Ed then accessorised with an oversized black cap and his trademark geek-chic glasses.\nFeeling good: The singer looked in good spirits as he threw a thumbs up at the cameras, in light of his successful album release\nCasual: The Shape of You singer kept things low-key for the outing in a cosy blue jumper, layered atop a burgundy T-shirt\nHeading to the Caribbean restaurant, where he is known to enjoy the jerk chicken and the Dark and Stormy cocktails, the singer looked in good spirits as he threw a thumbs up at the cameras, in light of his successful album release.\nEd unveiled his third record, Divide, on Friday, and it soared to the number one spot on the UK Album Chart in just three days.\nIt is no wonder the album was a hit however, after his singles Shape of You and Castle on The Hill stole the first and second chart spots in January - marking the first time in history an artist has taken the top UK chart positions with new songs.\nAccessories are key: Maintinaing the athletic vibe throughout, Ed then accessorised with an oversized black cap and his trademark geek-chic glasses\nSmashed it: Ed released his third record, Divide, on Friday, and it soared to the number one spot on the UK Album Chart in just three days\nGo me: Ed had been seen looking equally as chirpy in New York earlier this week, when he arrived at the airport to head home to the UK and celebrate his new release\nHowever, Ed's celebratory mood may have been somewhat tainted by recent claims that he fabricated the famous story about Princess Beatrice slicing his face with a sword.\nFellow singer James Blunt spoke to Shortlist magazine about the story, which stunned the nation in November, as he claimed he colluded with Ed to fabricate the tale after the latter innocently cut himself in a drunken stupor.\nStories suggested that Ed was hospitalised when Beatrice sliced his face with a sword when attempting to 'knight' James as a prank at a party - yet James insists it was a figment of their imaginations.\nLies! Ed's celebratory mood may have been tainted by recent accusations from James Blunt that he fabricated the famous story about Princess Beatrice slicing his face with a sword\nIn November, reports surfaced stating that Ed was rushed to hospital after Princess Beatrice sliced his face and caused a cut to his right cheek when the princess, 28, swung the blade without noticing he was standing behind her.\nGuests at the bash at the Royal Lodge in Windsor, Berkshire - Prince Andrew's home - were stunned when Beatrice accidentally struck Sheeran with the sword, The Sun on Sunday reported.\nDuring the do, the Beautiful singer reportedly quipped that he wanted to be knighted and she decided to pick up the blade, yet she was unaware that Ed - who was at the function with his girlfriend Cherry Seaborn - was standing directly behind her.\nHe was then taken to Epsom Hospital in Surrey to receive treatment for the injury just underneath his right eye before returning to the party.\nNot true: The 43-year-old You're Beautiful hitmaker spoke to Shortlist magazine about the story, which stunned the nation in November, as he claimed he colluded with Ed to fabricate the tale after the latter innocently cut himself in a drunken stupor\nReally? During the do, James reportedly quipped that he wanted to be knighted and she decided to pick up the blade, yet she was unaware that Ed - who was at the function with his girlfriend Cherry Seaborn - was standing directly behind her\nA source revealed: 'As the night wore on they started talking about honours and apparently James Blunt joked that he would love a knighthood.'\nJames claims Ed's ruse was a bid to trick fans so he could sell record - claims which may seem laughable this week after Ed broke records with his new album ÷ after selling 232,000 physical and digital copies in its first day of release.\nAs the story continues to stun fans, James is readily prepared to burst bubbles as he said in the newly-released interview: 'Ed was drunk, messing around, and he cut himself. We made a fancy story up; people fell for it. It was very embarrassing.\n'All of (the story was invented). Apart from the actual scar. It’s bizarre that people fell for it. I blame Ed.\n'He must be desperate – he’s trying to sell records. He cut himself and I just patched him up. It’s made him look prettier.'\nHis latest discussion was not the first time he has touched on the tale, as he revealed on The Graham Norton Show: 'If he (Ed Sheeran) said his face got cut while she was ‘knighting’ me then dashed to A&E before returning to the party, then he is a liar.\n'For a start, she is a princess and would be rehearsed and practiced in these matters, and given the NHS waiting lists it would have been impossible to get to hospital and back so quickly.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300524/Ed-Sheeran-celebrates-chart-success-casual-dinner.html"}
