{"authors":["Andrew Flanagan"],"date_download":"2018-10-22 20:11:20","date_modify":"2018-10-22 20:11:20","date_publish":"2018-06-28 00:00:00","description":"Sheeran is being sued over supposed similarities between his song \"Thinking Out Loud\" and the indelible Marvin Gaye hit \"Let's Get It On.\"","filename":"data/vaneerConsumption/EdSheeranSuedFor100MillionOverSupposedSongSimilarity.json","image_url":"https://media.npr.org/assets/img/2018/06/28/gettyimages-923654546_wide-eacd1a147228e7f2df7c0c9b0a4461b90e37bcbb.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_06_28_624405244_ed-sheeran-sued-for-100-million-over-supposed-song-similarity_1540239080.html","title":"Ed Sheeran Sued For $100 Million Over Supposed Song Similarity","title_page":"Ed Sheeran Sued For $100 Million Over Supposed Song Similarity : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ed Sheeran Sued For $100 Million Over Supposed Song Similarity\nEnlarge this image toggle caption John MacDougall/AFP/Getty Images John MacDougall/AFP/Getty Images\nEd Sheeran's syrupy, Grammy-winning single \"Thinking Out Loud\" is now at the center of two lawsuits.\nThe ginger troubadour was first sued over the hit song last year by the heirs of Edward Townsend, Jr., a co-writer of Marvin Gaye's \"Let's Get It On,\" which they claim \"Thinking Out Loud\" cribs from enough to warrant a lawsuit.\nThe new suit, filed today in federal court in New York by a company called Structured Asset Sales (SAS), follows a failed attempt by SAS to join the Townsend lawsuit (what's called \"intervening\"). That request to intervene in that case was turned down on June 11, 2018.\nAnd so, 17 days after that rejection, there is a new lawsuit filed by SAS itself against Sheeran, Amy Wadge (his co-writer on the song), his label Atlantic Records, Atlantic Records' parent company Warner Music Group (WMG), his publisher Sony/ATV and WMG distributor Asylum Records.\nSAS purchased its share of Townsend's song catalog from his son Clef Michael Townsend, who inherited an unknown portion of the catalog after his father's death in 2003. SAS now seeks $100 million in damages for the portion of \"Let's Get it On\" it owns, which would be whatever portion of the song's royalties Clef Townsend inherited from the slice of the song contractually given to his father.\nAtlantic Records and an attorney for Sheeran declined to comment on the case.\nEnlarge this image toggle caption John Minihan/Getty Images John Minihan/Getty Images\nThe new suit includes detailed explanations of music theory in order to explain the songs' supposed similarities — \"In Gaye's song, this chord progression within the backing pattern occurs in the key of E flat, and in Sheeran's song the progression occurs in D major ... listeners will hear the two progressions as functionally equivalent ... Many listeners will not recognize that Frank Sinatra sang 'My Way' in D major, while Elvis Presley sang that song in C major; it is clearly the same song despite the difference in key.\"\nIt's not the first suit filed against a modern hit accused of copying a song by Gaye: Robin Thicke and Pharrell's song \"Blurred Lines\" was the subject of another lawsuit, over its supposed similarity to Gaye's 1977 hit \"Got to Give It Up.\" Thicke and Pharrell lost that case (and $5.3 million through its judgement) in a ruling that many considered controversial — the pair's appeal, which was largely denied, drew support from over 200 musicians.\nSAS is owned by David Pullman, who is no stranger to the music business. Pullman is the creator of the well-known-to-some \"Bowie Bonds,\" a financial invention (which Pullman says he trademarked) that turned the royalties from 287 of his songs into 10-year bonds, which were sold for a total of $55 million. The plan almost tanked, due to timing — shortly after Bowie made off with his haul, the music industry descended into the Wild West of the digital era, meaning the 10-year vesting period of the bonds saw the royalties they contained drop precipitously, to possibly their lowest point ever. The bonds did, however, mature and were cashed in by their owners. The idea has since snowballed significantly, with whole companies now founded on the invention.","url":"https://www.npr.org/2018/06/28/624405244/ed-sheeran-sued-for-100-million-over-supposed-song-similarity"}
