{"authors":[],"date_download":"2018-10-30 00:55:35","date_modify":"2018-10-30 00:55:35","date_publish":"2017-03-17 00:04:06","description":null,"filename":"data/vaneerConsumption/EducationSavingsAccountsTheGreatPeacemaker.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/03/7223675784_10f421ea4c_k-e1489705800337.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860935.html","title":"Education Savings Accounts: The Great Peacemaker?","title_page":"Education Savings Accounts: The Great Peacemaker?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Several states — including Arizona, Georgia, Iowa, New Hampshire, Ohio, Oklahoma, Texas, and Virginia — are in the process of introducing or expanding education savings account (ESA) legislation. Even though ESAs have been proven to help the disadvantaged groups the left are always claiming to represent, liberals remain determined to undermine these school choice programs at every turn and keep the divisive debates surrounding education going strong.\nESAs provide parents with access to a portion or all the money allocated for their child’s public education for use on a range of educational alternatives, such as private school tuition, homeschooling textbooks, learning therapies, and tutoring. ESAs level the education playing field by freeing children trapped in a failing, one-size-fits-all system that dictates where students must attend school based on ZIP code, giving every student, regardless of race or income, access to the same, flexible educational opportunities.\nESAs are in demand. Parents and their children want the same choice in education they enjoy when they turn on the TV or go to a grocery store, shopping mall, or to buy a car. But the education establishment, whose best interest is in growing government, continues to ignore the overwhelming evidence in favor of ESAs, insisting instead on maintaining a worn-out system that produces more discord than it does educated graduates.\nSo much energy is put into arguing about various aspects of education—from what to teach (Common Core) to what time school should start and end to what types of bathrooms students should be able to use. True education choice would make all these issues irrelevant, saving parents, researchers, politicians, and educators time, money, and resources. It would also provide significant relief by ending the undue stress and anguish imposed on parents and kids.\nThe left isn’t noble enough to say, “While we, ourselves, love public education, we accept some people want something different,” and let it go. The left doesn’t want peace and harmony or for people to pursue happiness in their own way. They want power and for everyone to pursue the agenda that makes them happy in the way the left dictates — and they don’t mind fighting for it.\nLook at Texas, for instance. A 2013 EdChoice survey found Texas voters overwhelmingly support ESAs (in addition to other school choice programs). Other research shows ESAs would improve Texas’ public schools and boost graduation rates for all. But despite its proven benefits and Texans’ desire for school choice, members of the education establishment are determined not to give up an inch of the education territory they’ve controlled for years.\nTexas state Rep. Dan Huberty (R-Humble), who serves as chairman of the House Public Education Committee, said Texas’ ESA bill is “dead” to him as an issue. “Your responsibility as chairman,” Huberty said, “is to protect your membership.”\nHuberty didn’t say it’s his job is to “do what’s best for families” or to “honor the wishes of the constituents who elected us.” Huberty revealed, in a moment of rare honesty, what the true mindset of the public-education elite is: protect our interests first, foremost, and forever.\nThough it’s tough to be a Texas parent with school-age children right now (contrary to Huberty’s claim that Texas has school choice, the Lone Star State has zero school choice programs beyond charter and magnet schools), there is hope elsewhere. Oklahoma’s ESA bill recently passed its first committee, as did Arizona’s. In Nevada, legislators are looking for ways to fund the nation’s first universal ESA program, ruled constitutional in 2016.\nESA bills are gaining momentum in so many states for a reason: Once enough voters get wind of the wonderful things happening in cities and states offering ESAs—things like increased school competition, innovation, education customization, family satisfaction, and decreased squabbling over every inane detail of the education system—they want ESAs as well. Eventually, legislators like Huberty simply won’t be able to afford to say no to school choice.\nIt’s also encouraging the federal government appears to recognize the dire straits our current education system is in. President Donald Trump, in his recent address to Congress, declared education “the civil rights issue of our time,” saying families, especially minority ones, “should be free to choose the public, private, charter, magnet, religious, or home school that is right for them.”\nThe more the federal government recognizes the value of education choice and the sooner it frees the states to enact programs of choice, the sooner our education system can improve and the sooner the incessant bickering incited by the left when it attempts to tell everyone else how to live will finally come to an end.","url":"https://spectator.org/education-savings-accounts-the-great-peacemaker/"}
