{"authors":["Alexandra Bruschi"],"date_download":"2018-10-30 23:36:07","date_modify":"2018-10-30 23:36:07","date_publish":"2014-08-13 16:00:40","description":"If you pass a newsstand in the next few weeks, you might be surprised to see Edward Snowden's pensive face gazing back at you. WIRED has chosen Edward Snowden for its September 2014 cover story in a decision sure to prove controversial — especially…","filename":"data/vaneerConsumption/EdwardSnowdenIsSeptembersWIREDCoverStarAmericanFlagInHand.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8ccf02fe-ab6e-4853-ac9b-d8a9763c36bc.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35587-edward-snowden-is-septembers-wired-cover-star-american-flag-in-hand_1540942567.html","title":"Edward Snowden Is September's 'WIRED' Cover Star, American Flag In Hand","title_page":"Edward Snowden Is September's 'WIRED' Cover Star, American Flag In Hand","title_rss":"NULL","source_domain":"bustle.com","text":"If you pass a newsstand in the next few weeks, you might be surprised to see Edward Snowden's pensive face gazing back at you. WIRED has chosen Edward Snowden for its September 2014 cover story in a decision sure to prove controversial — especially since Snowden is pictured cradling an American flag.\nThe latest in the Snowden saga came on August 7, when Snowden received a three-year extension of his asylum from the Russian government. Though Snowden \"asked Russian authorities last month to allow him to stay,\" the former National Security Agency contractor told WIRED's James Bamford that \"he still holds out hope that he will someday be allowed to return to the U.S.,\" according to Bamford.\nIn case you haven’t had the chance to read Bamford's lengthy WIRED interview, here are some highlights…\nBold Claims\nIn the article, Bamford describes Snowden as “the most wanted man in the world, for disclosing information about National Security Agency's surveillance practices back in 2013, causing the \"biggest intelligence leak in the NSA's history.\"\nProvocative Photography\nWIRED chose world-renowned photographer Platon to lead the photo shoot. Even if you're not familiar with Platon, you might recognize his photo of Vladmir Putin for TIME's 2007 cover.\nBesides the controversial cover image, the feature also includes various other provocative photos, such as Snowden with former NSA and CIA director —and Snowden’s former boss —Michael Hayden, and Snowden sporting a T-shirt with the word Security emblazoned across its back.\nIn his own account of the interview on Wired.com, WIRED editor-in-chief Scott Dadich also describes the delicate moments that led to capturing the cover photo:\nWe returned to the prop table, and Snowden picked up the flag. Platon asked him what he'd do with it in a picture. Snowden held the flag in his hands and delicately unfolded it. You could see the gears turning as he weighed his year in exile against the love of country that motivated him in the first place. He said he was nervous that posing with the flag might anger people but that it meant a lot to him. He said that he loved his country. He cradled the flag and held it close to his heart. Nobody said a word, and the hairs on the back of my neck stood up. We all sat there for a long moment, studying him. Then Platon yelled, “Don't move!” He clicked off frame after frame, making tiny adjustments to both the lighting and Snowden's posture, sometimes asking for him to look into the lens, sometimes just above it. We had our cover.\nHere's a fun fact for you: The flag that Snowden posed with for the cover is the same flag that Platon used to cover Pamela Anderson in the iconic 1988 George magazine cover.\nSnowden’s Self-Defense\nIn the interview, Snowden defends himself, saying that he never intended to act as a spy for a foreign government but only meant to be a “whistleblower.\"\nIn audio tapes released by WIRED, Snowden calls technology \"the greatest equalizer in human history,” and therefore said that he leaked the documents to open up lines of communication within the U.S. and “give you back a choice about the country you want to live in.”\nIn his own defense, Snowden claims that he didn’t make it too hard for the U.S. government to figure out what he had done. From Bamford's article:\nHe says that he actually intended the government to have a good idea about what exactly he stole. Before he made off with the documents, he tried to leave a trail of digital bread crumbs so investigators could determine which documents he copied and took and which he just “touched.”\nSnowden also calls B.S. on some of the allegations against him, saying that the U.S. government exaggerated in claiming that he had lifted 1.7 million documents.\nEven More Leaks\nSnowden hasn’t stopped leaking information, either — he tells WIRED about a new, top-secret NSA program called “Monstermind” which, when complete, will \"automate the process of hunting for the beginnings of a foreign cyberattack.\" The program, discussed for the first time to Bamford in this WIRED interview, is a step up from similar software program that have existed for decades, and could cause problems, according to Snowden.\nThese attacks can be spoofed. You could have someone sitting in China, for example, making it appear that one of these attacks is originating in Russia. And then we end up shooting back at a Russian hospital. What happens next?”\nSobering Goodbyes\nWhen Platon says he hopes to see Snowden back home in the U.S., Snowden replies, “You probably won’t.”\nSome Twitter users are displeased, or at least shocked by WIRED’s latest cover decision:\nImages: WIRED/Platon; Twitter/dangainor, Twitter/MikkoTakkunen, Twitter/Atchka, Twitter/AndrewKatz, Twitter/OliverWillis","url":"https://www.bustle.com/articles/35587-edward-snowden-is-septembers-wired-cover-star-american-flag-in-hand"}
