{"authors":[],"date_download":"2018-10-22 21:27:15","date_modify":"2018-10-22 21:27:15","date_publish":"2014-06-05 14:03:54","description":"\"We assume that it will be extended,\" Wolfgang Kaleck, Snowden's lawyer in Germany, was quoted as saying by Germany's Inforadio.","filename":"data/vaneerConsumption/EdwardSnowdensLawyerExpectsRussiatoExtendAsylumReport.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/477911/140530-snowden-8_33dff86eb115092b932f979d887f3aa3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_nsa-snooping_edward-snowdens-lawyer-expects-russia-extend-asylum-report-n123426_1540243635.html","title":"Edward Snowden's Lawyer Expects Russia to Extend Asylum: Report","title_page":"Edward Snowden's Lawyer Expects Russia to Extend Asylum: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBERLIN - A lawyer for former U.S. intelligence contractor Edward Snowden told German radio on Thursday that he expected his client's asylum in Russia to be extended beyond July.\n\"We assume that it will be extended,\" Wolfgang Kaleck, Snowden's lawyer in Germany, was quoted as saying by Germany's Inforadio.\nHe added that there was, however, no guarantee this would happen.\nRussia granted Snowden a year's asylum in August 2013 despite the United States wanting Moscow to send him home to face criminal charges, including espionage, for disclosing in June secret U.S internet and telephone surveillance programs.\nLast month Snowden said he was not under the control of Russia's government and had given Moscow no intelligence documents after nearly a year of asylum there.\nKaleck also called on the German parliamentary committee that wants to question Snowden as part of its inquiry into the mass surveillance of German citizens which he exposed, to request a hearing in Germany.\nA hearing in Moscow would not be practicable, Inforadio reported Kaleck as saying.\nRevelations about the U.S. National Security Agency's (NSA) spying activities have put strains on relations between Berlin and Washington.\nGermany's top public prosecutor said on Wednesday he was launching an investigation into the bugging of Chancellor Angela Merkel's mobile phone by U.S. intelligence in the light of revelations by Snowden.\n- Reuters","url":"https://www.nbcnews.com/storyline/nsa-snooping/edward-snowdens-lawyer-expects-russia-extend-asylum-report-n123426"}
