{"authors":[],"date_download":"2018-10-22 21:04:17","date_modify":"2018-10-22 21:04:17","date_publish":"2014-06-04 01:21:42","description":"The new head of the National Security Agency says he believes Edward Snowden \"clearly believes in what he's doing.\"","filename":"data/vaneerConsumption/EdwardSnowdenProbablyNotaRussianSpyNewNSAChiefSays.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/469831/140527-edward-snowden-jms-1846_0132a4f7fa4501ad6594d60c47264127.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_nsa-snooping_edward-snowden-probably-not-russian-spy-new-nsa-chief-says-n121926_1540242257.html","title":"Edward Snowden 'Probably' Not a Russian Spy, New NSA Chief Says","title_page":"Edward Snowden 'Probably' Not a Russian Spy, New NSA Chief Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe new head of the National Security Agency said Tuesday he doesn't believe former NSA contractor Edward Snowden is or was a Russian spy.\nAdm. Michael Rogers, who became head of the U.S.'s spy infrastructure in April, said at a cybersecurity event organized by Bloomberg Government that while he believed it was \"wrong\" and \"illegal\" for Snowden to have leaked thousands of classified documents, he appeared to be doing what he sincerely thought was right.\nAsked whether he thought Snowden was or is working for the FSB, the Russian security service, Rogers said: \"Could he have? Possibly. Do I believe that that's the case? Probably not.\"\nAsked about Snowden's exclusive interview with NBC News' Brian Williams last month, Rogers said he wanted to be \"very balanced.\"\n\"I thought he was an intelligent individual [and] articulate. He seemed fairly arrogant to me,\" Rogers said. \"He clearly believes in what he's doing.\"\nRogers' view is different from that of his predecessor, Gen. Keith Alexander, who was also asked about the NBC News interview Tuesday on Bloomberg News.\nSpeaking about Snowden's claim that he was \"trained as a spy in sort of the traditional sense of the word,\" Alexander said he wished Snowden had told him that when Snowden went to work for the NSA.\n\"What I do not know is who he was a spy for,\" Alexander said.\nAlexander said it was a red flag that Russian authorities granted Snowden temporary renewable asylum after he arrived last June at the Moscow airport without a Russian visa.\n\"I don't think he got out of the airport without some sort of agreement,\" Alexander said.\nReferring to the FSB, he said: \"I think it was all planned. They're really good at that.\"\nIn the NBC News interview, Snowden denied that he is working for Russia.\nBut Alexander's assessment is shared by Rep. Mike Rogers, R-Michigan, chairman of the Intelligence Committee, who also accused Snowden of working with Russian intelligence in January in a joint interview on NBC's \"Meet the Press\" with Senate Intelligence Committee Chairwoman Dianne Feinstein, D-California.\n\"There's a reason he ended up in the hands, the loving arms, of an FSB agent in Moscow,\" Mike Rogers said then. \"I don't think that's a coincidence.\"\nRogers reiterated the charge in another interview on \"Meet the Press\" in March.\nFeinstein didn't go as far as Rogers did in the January interview as to directly accuse Snowden of working for the Russians, but she said, \"He may well have.\"","url":"https://www.nbcnews.com/storyline/nsa-snooping/edward-snowden-probably-not-russian-spy-new-nsa-chief-says-n121926"}
