{"authors":["Alex Michael For Daily Mail Australia"],"date_download":"2018-10-23 02:13:23","date_modify":"2018-10-23 02:13:23","date_publish":"2017-03-10 11:12:40","description":"Sunrise presenter Edwina Bartholomew finally dished the details on her now infamous 'snub' incident with Mel Gibson on the AACTA red carpet last year","filename":"data/vaneerConsumption/EdwinaBartholomewsreallyawkwardMelGibsoninterview.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21E24700000578-0-image-a-9_1489139968090.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300292_Edwina-Bartholomew-s-really-awkward-Mel-Gibson-interview_1540260803.html","title":"Edwina Bartholomew's 'really awkward' Mel Gibson interview","title_page":"Edwina Bartholomew's 'really awkward' Mel Gibson interview | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She found herself thrust into the limelight after a routine interview with controversial director Mel Gibson turned into headline news.\nNow, Edwina Bartholomew, 33, has finally opened up on her now infamous red carpet encounter with the Hacksaw Ridge mastermind.\nSpeaking to the I Don't Know How She Does It podcast, the Sunrise presenter described the exchange as 'really awkward,' but firmly denied the 61-year-old 'snubbed' her.\nFinally! Sunrise presenter Edwina Bartholomew finally dished the details on her now infamous 'snub' incident with Mel Gibson on the AACTA red carpet last year\nThe incident took place at the AACTA Awards last year, at which the presenter revealed she was so focused on getting the Hollywood icon to speak to her, that she forgot the crucial first step.\n'We were doing a Facebook live... and it was a mess and I just rolled in to talk to Mel Gibson but didn’t really get a chance to introduce myself,' she explained to the podcast.\n'And I said 'How are you' and he said 'No, who are you' and it was just very awkward'.\nThe personality then outlined her experiences after the seemingly harmless misunderstanding turned into headline news.\nWhoops! So nervous was the 33-year-old to introduce herself to Mel, 61, she forgot to tell the Hacksaw Ridge director who she was\nNo, WHO: 'And I said 'How are you' and he said 'No, who are you' and it was just very awkward,' she recounted on a podcast interview\nEdwina recounted an exchange with her mother that tipped the usually 'thick-skinned' reporter over the edge.\n'Mum was like 'Why wouldn’t you introduce yourself politely?' she remembered.\nThe seemingly atypical motherly question then sparked a chain reaction of tears, with the presenter seemingly unaware how much the media attention had been getting to her.\nOver the edge! After the tiny blunder turned into massive headline news, the beauty realised it was a prying question on her manners from her mum that sent her over the edge\nImpressive! Following the event, reporters and fans labeled her quick recovery as impressive, especially given a publication's description of the grey-bearded Australian's 'commanding presence' on the night\nThe mother and daughter pair quickly made up, and as for Mel? Edwina was adamant there was never any animosity to begin with, despite media quickly describing the director's reaction as a 'snub'.\n'[The media attention] was just way taken out of proportion and really awkward. He was actually quite delightful,' the blonde beauty stated.\nA snap over on her Instagram from the December ceremony captured the composed interviewer's rather professional analysis of the occurrence.\n'I'm going to work on my manners and introduction,' she mentioned alongside an image of the interview.\nNo 'snub': The reporter put claims that the controversial director snubbed her to bed, saying: '[The media attention] was just way taken out of proportion... He was actually quite delightful'\nGoing strong: Since aking to Instagram after the event to admit she had to work on her 'manners' Edwina has nailed interviews with the likes of Ed Sheeran\nMost improved award: The talent even jetted off to the Oscars recently, enjoying a blunder-free night\nFollowing the event, reporters and fans labeled her quick recovery as impressive, especially givien Mama Mia's description of the grey-bearded Australian's 'commanding presence' on the night.\nThese days, Edwina's manners and introductions appear to be just fine, with the beauty recently nailing a free-flowing chat with Ed Sheeran, before jetting off for a blunder-free Oscar awards assignment.\nThe personality doesn't appear to have any conversational difficulties with her boyfriend Neil Varcoe either, the host regularly sharing smitten snaps with her beau.\nNo problems! The personality doesn't appear to have any conversational difficulties with her boyfriend Neil Varcoe either, the host regularly sharing smitten snaps with her beau","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300292/Edwina-Bartholomew-s-really-awkward-Mel-Gibson-interview.html"}
