{"authors":["Ivan Speck For Mailonline"],"date_download":"2018-10-22 21:52:37","date_modify":"2018-10-22 21:52:37","date_publish":"2017-03-10 00:01:53","description":"Having begun his professional career at Swindon, the Plymouth-born defender has played for Reading and now Cardiff, as well as loan spells at Southend and Huddersfield","filename":"data/vaneerConsumption/EFLQACardiffcaptainSeanMorrison.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1ED22400000578-0-image-a-68_1489103957699.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4299490_EFL-Q-Cardiff-captain-Sean-Morrison_1540245157.html","title":"EFL Q&A: Cardiff captain Sean Morrison","title_page":"EFL Q&A: Cardiff captain Sean Morrison | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Central defender and club captain Sean Morrison has played a key role in Cardiff City’s recent resurgence in the Sky Bet Championship.\nThis week, the 26-year-old becomes the latest player to take part in our latest Sky Bet EFL Q&A.\nHaving begun his professional career at Swindon, the Plymouth-born defender has played for Reading and now Cardiff, but it was his loan spells at Southend and Huddersfield that provided two of his most vivid memories of his career to date.\nHe also recalls being inspired by Sol Campbell and struggling to contain Robin van Persie.\nWere you always a central defender?\nAlways in my professional career, yes. But all the way up from the age of six or seven, I played centre midfield until 16 when I went to Plymouth Schoolboys. I started playing centre half then and never went back into central midfield, thank God. I don’t think I’ve got the legs to do that.\nIt was a decision between Stuart Gibson, the Under-18s manager and my Under-16s coach, Chris Souness. They saw something in me that was more suited to centre half and obviously they were right in their decision. I think they always had a plan for me when I went to Plymouth to push me back to centre half. I loved it. To get a new challenge by playing a different position was nice and I was pretty good at it from the get-go. It didn’t take me too long to adapt and I’ve never looked back.\nBest moment on a football pitch?\nIt’s got to be the League One Play-Off Final for Huddersfield (against Sheffield United in May 2012, Huddersfield won 8-7 on penalties after a 0-0 draw) – just because of the circumstances. It was a very hot day and not the greatest of games. We missed our first three penalties. When you do that, you think it’s game over, but they missed two out of their first three as well. It went all the way through to the goalkeepers, 22 players took penalties and their keeper missed the last one. It was a mad, mad day but it was definitely up there, an incredible feeling when they missed theirs.\nI’ll never forget the penalties because I was on loan from Reading at the time. We had our first seven penalty takers, whose names were down and everyone knew who was taking the first seven. I didn’t think the question would even be asked if I wanted to take one because it would have been far too far down the line.\nAfter our seventh penalty taker went up, there were me, Jack Hunt and Calum Woods left (of the outfield players). We looked at each other and I said: ‘Look, I’m not taking one, I’ll be last pick.’ Because I was on loan and Reading had just been promoted to the Premier League, I didn’t want to be the guy to miss the penalty to not put Huddersfield up and then go back to my parent club who had just been promoted. I would have hated myself.\nCallum scored. Me and Jack are very good friends. I just laughed at him and said: ‘No, you’re going up, not me.’ Then he scored and I’m thinking: ‘Oh my God, I’m going to have to take one here.’\nMorrison, pictured during the League One play-off final victory over Sheffield United in 2012\nWe trained at Brentford’s training ground the week leading up to the game. The likes of Jordan Rhodes and Lee Novak, the boys who would be taking the penalties, took a few. The rest of us messed around a bit and I took maybe one or two penalties maximum, not thinking that I would actually have to take one.\nTrying to explain it to people is a strange thing. I remember their player scoring and I just started walking up. It was surreal. I knew where I was going to put the ball. You block out the crowd even though there were 70,000 or 80,000 people there. You’re in your own world. Luckily it went in, then our keeper, Alex Smithies, scored and they missed their final one.\nWe fancied Alex to score, but our striker Alan Lee then said that their keeper was going to miss and you could feel the energy change as he ran up to take it. It was strange, we just knew he was going to miss. Even though I had cramp everywhere, it was probably the fastest I had run all day down to Alex to celebrate.\nIs there one regret you need to put right?\nThe year after being at Huddersfield I went back to Reading. We spent a year in the Premier League without doing ourselves justice. I played a bit part, a small handful of games, but when you make it to the Premier League, you want to stay up. I think we had more to give and we were relegated with four or five games to go.\nI’d love the opportunity to play in the Premier League again and be a team that can stay up and compete. You see the standard of the Championship now, lots of teams with good backing from chairmen behind the clubs, so once teams get promoted now, if they have the right manager and make the right signings I think it’s there for them to give it a right good go and not be expected to come straight back down. The teams who have gone up in the last few years have made a real fight of it.\nHardest opponent?\nRobin van Persie, when he was at Man United and I was at Reading. I played against him the year he was on fire and he was different class. He would drift in and out the game but when he was in it you couldn’t get near him.\nFor someone you wouldn’t class as a big striker, even his hold-up play and technique in doing it was second to none. He was absolutely brilliant and it was a real experience. I played against him a couple of times that season. It was incredible to play against someone of that class.\nLeast favourite away ground?\nI always remember Stockport County. I played there when I was at Swindon a couple of years in a row and each time it was literally the worst pitch I’ve ever played on as a professional. We had quite a nice pitch at Swindon and then to go up to Stockport and play on theirs was tough.\nI’ve spoken with Anthony Pilkington who plays with me at Cardiff now. He was at Stockport around that time and I reckon their pitch was 5% grass and 95% sand. I hated it. I had just started coming through. I was only 17 and I remember going up there thinking: ‘This can’t be what it’s like to be a professional footballer.’ It was a tough place to go as well because they didn’t have a bad team.\nMorrison says Sol Campbell is one of his all-time sporting heroes\nFunniest thing you have seen in a dressing room?\nI’ve played with some mad people.\nWhen I was in the youth team at Swindon we had quite a tight-knit group but two of the lads, Jake Hyde and Callum Wilmoth, had disagreements now and again. One time they were coming out of the shower and Callum nicked Jake’s towel. Jake tried to grab it back and as they were pulling each other round by their towels stark naked, they were slipping around on each other’s backs. They were trying to argue but slipping over with soap and shower gel going everywhere.\nAnd there’s one more. Kevin Amankwaah, who I was with at Swindon, and Hal Robson- Kanu, who was on loan from Reading at the time, were two pretty big guys.\nThey were trying to see who was the Alpha male, pushing each other with their shoulders and it was getting a little bit serious. Then out of nowhere Hal flipped Kevin over his shoulder and through a table. Kev thought he was the big strongman in the team and some young 19-year-old came in and boshed him on to the floor through a table. The whole changing room erupted. It was like we had won the World Cup.\nImagine 20 full-grown men going mad because some young lad had just thrown the big dog on the floor. Kev took it really well to be fair. He was a good guy, one of the more experienced lads and he thought it was hilarious.\nWhat’s your guilty food pleasure?\nSweets in general, Pic ‘n’ Mix, something like that. I’m not really a big chocolate fan but I’m a sucker for sweets.\nI’m quite good, but if I do indulge and want to have a little treat, then I might go to the cinema and stack up on a kilo of Pic ‘n’ Mix. Honestly, it’s my Kryptonite.\nI can imagine it would be worse if I had kids. The cupboards would be full of it and I’d be in there myself, pretending I’m buying it for the kids.\nMorrison, pictured in action during Cardiff's clash with Blackburn on Tuesday evening\nBoyhood sporting hero?\nThere were two. I absolutely loved Sol Campbell when I was growing up. Him and Alan Shearer. My dad’s from Newcastle so Alan Shearer was God in our household. I loved him from a very young age. He was one of my favourite players, still is to this day.\nBut once I got a little bit older and understood football a bit more, Sol Campbell was the person I enjoyed watching the most and someone I aspired to be like.\nWhen I was making that transition from centre midfield to centre half, he was someone I watched, one of the best in the Premier League in my opinion. He never looked like he was struggling, he was in control of every situation. He was quick, he was strong, he was good on the ball, just a very dominant defender and a joy to watch.\nIf you had the power, what one thing would you change about the game?\nI’d say the introduction of a third referee in certain situations. For the sake of somebody upstairs looking at a 10-second clip of something that’s just happened, it could change the outcome of a lot of games, good or bad. It could stop people getting sent off or highlight situations that a referee might have missed or might have seen differently to what actually happened.\nIt would make their job a lot easier because as much stick as referees get – and I’m the first person to give referees stick on the pitch, I’m a nightmare with referees and linesmen when decisions don’t go our way – they have got a difficult job.\nI just think giving them a little bit more help where they need it could improve the game. I don’t think it would slow it down too much. In general it would just make things a lot easier for them and clear up a lot of decisions for us.\nWhen a decision doesn’t go my way, it doesn’t rile me personally to the point where it makes my performance drop, but I have seen it in teammates over the years and people that I’ve played against. Sometimes players hit the point of no return and they end up getting themselves sent off because of a decision that was wrong.\nIf it was introduced, it wouldn’t only give referees, linesmen and fourth officials an easier time, players would also be in a position where you can’t really hide if you’ve done something wrong. You’re going to get seen for it and if you haven’t, you’re also not going to get punished for something you haven’t done.\nMost embarrassing moment in football?\nI know exactly what it is. Easiest question ever. I went on loan to Southend when I was 18. It happened really quickly. Danny Wilson, the Swindon manager, wanted me to go and get a few games on a month’s loan for a couple of months. Southend were in League One as well so it was a good opportunity. I got a call on the Thursday night to say: ‘Southend have got Yeovil away on Saturday, so they will pick you up at the Swindon services on the M4 on Friday.’\nI got on the bus having not met any of these people before, including the manager. I just sat down. I was only 18 and absolutely bricking myself. The boys were lovely, I went to the hotel, did my initiation song that night, played against Yeovil on the Saturday and got sent off after 31 minutes (Southend lost 1-0 in November 2009). I had to sit in the changing room, wait for the boys to come back in and then they dropped me off at the M4 Swindon services on the way home.\nIt was one of the worst 24, 36 hours of my life. I was so embarrassed. I remember ringing my mum in the changing room. I literally rang her as soon as I got sent off saying: ‘What have I done? I’ve just been sent off for Southend on my debut and I haven’t even known these guys for 24 hours?’\nLuckily it was only a one-game ban and I managed to stay there for a couple of months, play a few games and redeem myself, but at the time it was horrible.\nMorrison flies in to tackle Conor Washington of Queens Park Rangers during their clash\nIt wasn’t even a bad tackle. It was classed as me being the last man, but I still think it was a dodgy decision. The referee told me at the time it was a yellow card and then after he got surrounded by the Yeovil players, he decided to give me a red card. It happened and it helped in a way because my time at Southend after that was really good. I guess every cloud has a silver lining and all that.\nThe Southend boys didn’t know what to say to me because they didn’t know what kind of personality or character I was. I remember saying sorry on the bus but they kind of understood as well because it wasn’t a dangerous tackle, the lad ran across me and I accidentally caught his leg as he ran across me. A few of the boys heard the referee say it was a yellow card so they had a bit of sympathy for me, but it still didn’t help the embarrassment.\nWhich player in history would you like to play alongside?\nCan I choose two? Obviously Sol Campbell because he was someone I looked up to a lot and also Tony Adams, who I had seen briefly as a kid but I’ve seen enough of him now on programmes.\nYou see how many people speak so highly of him, not only as a captain. You’d learn a lot from him, so as a fellow centre-half, he would have been able to teach me a lot. You see the team that he played in at Arsenal and he captained England and Arsenal from such a young age.\nHe was obviously a fantastic leader and someone you’d be able to learn so much from not only on the pitch but also in the dressing room before games and after games the way that he carried himself.\nNow it’s even easier to track your bets with the UK's top rated iOS sports betting app. Instantly access your bets, match stats and cash out all in one place with My Bets from Sky Bet, so you can make the right calls on the big games. That’s betting, better.","url":"https://www.dailymail.co.uk/sport/football/article-4299490/EFL-Q-Cardiff-captain-Sean-Morrison.html"}
