{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 03:46:51","date_modify":"2018-10-23 03:46:51","date_publish":"2016-01-28 19:28:51","description":"Shan Harries, 47, headmistress of Eglwyswrw County Primary School in Eglwyswrw, Pembrokeshire, was found to have changed year six pupils' test results.","filename":"data/vaneerConsumption/Eglwyswrwheadmistressbannedfromclassroomforalteringpupilstestscores.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACE4F900000578-0-image-a-11_1454008024044.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421554_Headmistress-banned-classroom-altering-pupils-test-scores_1540266411.html","title":"Eglwyswrw headmistress banned from classroom for altering pupils' test scores","title_page":"Eglwyswrw headmistress banned from classroom for altering pupils' test scores | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shan Harries, 47, Eglwyswrw County Primary School in Eglwyswrw, Pembrokeshire, was found to have changed year six pupils' test results\nA headteacher has been banned from the classroom for two years after it emerged she was fiddling test scores for her year six pupils in a bid to hit government targets.\nShan Harries, 47, headmistress of Eglwyswrw County Primary School in Eglwyswrw, Pembrokeshire, was found to have changed year six pupils' test results.\nA hearing was told she felt 'under pressure' to hit the new targets so she began raising pupils grades despite their being 'no evidence' they had reached that level.\nAn Education Workforce Council has now banned Harries from the profession for two years after ruling she acted unprofessionally.\nChairman Richard Parry-Jones said: 'This case involved deliberate dishonest conduct which is fundamentally so serious to undermine the confidence and trust of pupils, parents and colleagues.\n'Shan Harries' acts were deliberate and very serious in terms of their impact on learners and on the confidence of the public in the teaching profession.'\nThe headteacher was in charge when Estyn - the Welsh equivalent of Ofsted - visited Eglwyswrw County Primary School in December 2013.\nPresenting officer Cadi Dewi said: 'Reports were published in February 2014 which were good overall but a number of recommendations were made.\n'It was recommended that the school improve Welsh results in key stage two in terms of writing.'\nAn EWC hearing was told that the school set up a task force to discuss the targets.\nDeputy headteacher Tim Davies said: 'The issue of the Estyn report came up very often. Mrs Harries made reference to it saying it wasn't looking good as Estyn were returning.\n'She said we had to raise the standards of writing in the school. All pupils in year six had to reach level four.\n'I remember saying that there was going to be some children who would struggle to achieve this given the cohort of children we had.'\nMr Davies, who was in charge of year six, told the hearing one autistic child had 'a very challenging time' after being set the target.\nHe said: 'Whatever lessons were taught and whatever resources were used to reach the level it was not going to happen.\nThe headteacher was in charge when Estyn - the Welsh equivalent of Ofsted - visited Eglwyswrw County Primary School in December 2013\n'I had a conversation with Mrs Harries about the level and it did get a bit heated because I was trying to persuade her to change it.\n'She had increased the levels because there were concerns of inspectors at Estyn.'\nA Pembrokeshire County Council investigation found that 11 Welsh writing test scores had been changed and Mrs Davies was suspended from her role at the school in June 2014.\nIn a statement read out to the hearing Mrs Davies said she was 'full of remorse' for her actions.\nShe said: 'I dedicated my entire life to my work as teacher and head teacher at Eglwyswrw County Primary School, and I am fully aware of the full extent of my actions.\n'I relive it every day and night and I am full of remorse at what has happened.\n'I had to deal with all the rumours and gossip that naturally occurs when a head teacher leaves a school suddenly in a close knit community.'","url":"https://www.dailymail.co.uk/news/article-3421554/Headmistress-banned-classroom-altering-pupils-test-scores.html"}
