{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:09:42","date_modify":"2018-10-30 21:09:42","date_publish":"2016-05-08 16:30:21","description":"Egyptian-German scholar Hamed Abdel-Samad claimed that the Prophet Muhammad's view of Jews as \"subhuman\" animals.","filename":"data/vaneerConsumption/EgyptianGermanScholarMuhammadViewedJewsAsAnimals.json","image_url":"https://media.breitbart.com/media/2016/03/peace-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_08__1540933782.html","title":"Egyptian-German Scholar -Muhammad Viewed Jews As Animals","title_page":"WATCH: Egyptian-German Scholar -Muhammad Viewed Jews As Animals","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Egyptian-German scholar Hamed Abdel-Samad claimed that the prophet Muhammad’s view of Jews as “subhuman” and the subsequent treatment of Jews after his death was akin to that of the Nazis, adding that such hatred is ongoing and has “prevented us from dealing with our problems in a serious way.”\nIn the lecture, translated by MEMRI and entitled “Islamic Fascism and the Jews,” Abdel-Samad called on the Muslim and Arab world to stop “poisoning one generation after another with this hatred.”\nHe began by meditating on the Muslim obsession with Jews.\nToday, we will talk about Islamic fascism and the Jews. We have had a fixation about the Jews since the inception of Islam, and this fixation refuses to come to an end. The Jews have always been small in number, but they cause us some mental reaction and we cannot get them out of our mind. When I was studying in Cairo, two of the most popular books that I used to see in libraries and on the streets were Hitler’s Mein Kampf, which was banned in Germany because of its racism, and The Protocols of the Elders of Zion, which is a forgery. Without even checking, we accept it as a historical fact. This was one of the first books to be translated into Arabic in modern times. It is shameful that before translating Kant, Spinoza, Descartes, Rousseau, John Locke, or David Hume, the masters of the Enlightenment, we translated the forged Protocols of the Elders of Zion in order to use it to fuel our hatred towards the Jews. Do you know when the Protocols was translated into Arabic? In 1929 – before the State of Israel was established and before anyone was even thinking about it.\nView the entire clip here.\nAbdel-Samad then took the Koran to task for commanding Muslims to scourge Jews and Christians.\nImagine what would happen if the Jews, the Christians, the Buddhists, or the Baha’is had a verse cursing the Muslims. We would go to the UN and ask for this verse to be erased from their books, right? But for us it is very normal to curse others, because ours is the last religion and our Lord pampers us a little. But, of course, ours is a religion of tolerance, and Islam accepts all the religions, right? This is hypocrisy.\nAbdel-Samad went on to say that fascism, Nazism, and Islam all share the view that Jews are like animals. While Hitler called the Jews “vermin,” Muhammad referred to them as “apes and pigs.”\nSpurning the notion that any hostility towards Jews is the result of the Israeli-Arab conflict, Abdel-Samad wrote:\nThe Prophet Muhammad vowed that Judgment Day would not come unless the Muslims fight the Jews. Imagine that Israel came to you today and said: “Man, take Jerusalem. Take Haifa and Tel Aviv as well.” Would that be the end of our enmity with them? In that case, we would miss out on Judgment Day. Our Lord linked Judgment Day with our conflict with the Jews. The story is not about land, occupation, and rights. The source of the crisis is that we do not view these people as humans.\nAbdel-Samad reassured his audience that the Mossad is not paying him to make these claims. He said he is attempting to stop the cycle in which Muslims always blame the Jews for the world’s ills.","url":"https://www.breitbart.com/middle-east/2016/05/08/watch-egyptian-german-scholar-prophet-muhammad-like-nazis-viewed-jews-animals-jew-hatred-preventing-us-dealing-real-problems/"}
