{"authors":[],"date_download":"2018-10-22 21:49:21","date_modify":"2018-10-22 21:49:21","date_publish":"2016-07-14 00:00:00","description":"The economy is not growing fast enough to keep up. A mother of nine children talks about her failed efforts to control her family's growth or provide for her kids.","filename":"data/vaneerConsumption/EgyptsPopulationSurgesPast90MillionStrainingResourcesOfAPoorNation.json","image_url":"https://media.npr.org/assets/img/2016/07/14/egypt-s-population-july-14-2016_wide-42a8eea27cf79d2adbda8070ddde9c0266437af7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=485853031_1540244961.html","title":"Egypt's Population Surges Past 90 Million, Straining Resources Of A Poor Nation","title_page":"Egypt's Population Surges Past 90 Million, Straining Resources Of A Poor Nation : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nIn the first six months of this year, Egypt's population is estimated to have gone up by another million people. It is already the most populous nation in the Middle East. And experts warn of a dangerous mix of poverty and overpopulation. NPR's Leila Fadel looks at the numbers and one family's story.\nLEILA FADEL, BYLINE: In eastern Cairo, an electronic billboard hangs on the side of a towering government building. It's the home of Egypt's statistical agency that counts the population. In an alarming red, the billboard ticks off the estimated number of people here. On this recent day, it says there are 91,034,024 Egyptians. One of those people is Mudriyah Osman.\nHer family is an illustration of the causes and hardships of unchecked population growth. She can't read or write. She lives below the poverty line like more than 26 percent of the country. And she and her husband can't support the nine children they have. When I visit the tiny apartment she's renting with six of her kids and her sick husband, her youngest son is crying while his sister changes his diaper.\nThe apartment is infested with flies. They all gather in the one room they have on two dirty blankets.\nMUDRIYAH OSMAN: (Foreign language spoken).\nFADEL: She says they live off charity. And the landlady is constantly after her for rent.\nOSMAN: (Through interpreter) When I had the older children, my husband was working as a driver and we had a nice life.\nFADEL: She's from rural Egypt where large families are encouraged as blessings and assets. But Osman only wanted three or four children, she says. The rest were conceived by accident. She was on birth control, and it didn't work. In this one-room flat, it's hard to see how her children's lives will be any better than her own. None of them are in school.\nAnd just like their parents, they can't read or write. Experts say it takes government intervention to break this cycle. In Egypt, the number of children being born was dropping until about a decade ago. In 2008, each woman had an average of three children. And in 2014, that average jumped to 3.5, according to the government's demographic and health survey.\nIn all, the population has risen by some 20 million in the decade ending last year, says Hassan Zaky, a demographer who consults with the National Population Council.\nHASSAN ZAKY: This increase is the size of Hungary and Czech Republic together. The current size of Egypt is the combined population of Morocco, Saudi Arabia and Yemen.\nFADEL: He says there's a direct link between the fact that just under a quarter of Egypt is illiterate - rates are even higher among women - and a lack of active family planning. Meanwhile, Egypt's economy is not growing fast enough.\nZAKY: Any increase in economic growth is swallowed by the fast increase in population size, so people do not feel any improvement.\nFADEL: To try to make ends meet, poor families send their kids to work instead of school. It's a recipe for unrest - more mouths to feed, more services needed, more people angry that life isn't getting any better. The government, which critics say isn't doing enough, has a new population strategy run by deputy health minister of population Dr. Maissa Shawky.\nMAISSA SHAWKY: We are making it clear that when you have one or two children that are healthy, educated, able to stand up high for themselves in the future and they have good family and strong families in the future, you're going to be proud of this.\nFADEL: Instead of more children you can't support and who will probably have many children of their own. Now, Shawky says, the government is increasing access to the means of family planning, including things like injectable birth control. She's coordinating the work of family planning organizations and is massively increasing public education campaigns and family counseling.\nBy 2030, she says, she wants the rate to show Egyptian women having an average of at least one less child than they have now.\nYou think it's possible?\nSHAWKY: I think it would be very possible when people feel the pleasure of having one or two children.\nFADEL: She's optimistic, saying there are signs that the birthrate is already dropping. Leila Fadel, NPR News, Cairo.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=485853031"}
