{"authors":[],"date_download":"2018-10-30 21:06:20","date_modify":"2018-10-30 21:06:20","date_publish":"2016-07-17 07:09:20","description":"Egypt on Saturday blocked a United Nations Security Council resolution backed by the United States condemning the attempted coup in Turkey.","filename":"data/vaneerConsumption/EgyptBlocksUNTextBackingTurkishGovernmentDiplomats.json","image_url":"https://media.breitbart.com/media/2016/07/Turkey.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_17__1540933580.html","title":"Egypt Blocks UN Text Backing Turkish Government: Diplomats","title_page":"Egypt Blocks UN Text Backing Turkish Government: Diplomats","title_rss":"NULL","source_domain":"breitbart.com","text":"United Nations (United States) (AFP) – Egypt on Saturday blocked a United Nations Security Council resolution backed by the United States condemning the attempted coup in Turkey, diplomats said, though Cairo denied the move.\nThe United States, following consultations with officials from key NATO ally Turkey, had proposed a draft statement calling on “all parties in Turkey to respect the democratically elected government of Turkey.”\nBut Egypt, currently a non-permanent member of the Security Council, objected, according diplomats. An Egyptian diplomatic source, however, denied that Cairo had blocked the resolution.\n“This is a process that requires consensus,” he said, adding that Egypt agreed to the “overall objective of the statement” that condemned the violence and called for restraint.\n“We proposed to call on all parties to respect the democratic and constitutional principles and rule of law,” he said, rather than the initial wording calling for respect for the “democratically elected government.”\nEgypt’s relations with the government of President Recep Tayyip Erdogan have been particularly tense.\nErdogan supports the Muslim Brotherhood of former Egyptian president Mohamed Morsi, who was deposed by the Egyptian army in 2013.\nThe Turkish leader has denounced that move as a “coup d’etat,” drawing the wrath of the Egyptian general behind the ouster, Abdel Fattah al-Sisi, who is now president.\nDuring the UN debate, Egypt argued that it was “not for the Security Council to decide whether the government is democratically elected,” and it demanded that the relevant language be deleted, a diplomat said, speaking on condition of anonymity.\nDespite US insistence, Egypt would not budge.\nTurkey and several Security Council members including the United States worried the statement would have been too weak without wording explicitly supporting the Turkish government.\n“So there won’t be any statement,” the diplomat said.\nSuch Security Council resolutions require unanimous approval from the 15-member group.\nThe brief draft statement had “condemned the violence and unrest in Turkey and stressed the urgent need for an end to the current crisis and return to the rule of law.”\nIt called on all parties to “show restraint and avoid any violence or bloodshed.”","url":"https://www.breitbart.com/middle-east/2016/07/17/egypt-blocks-un-text-backing-turkish-government-diplomats/"}
