{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:25:34","date_modify":"2018-10-30 20:25:34","date_publish":"2015-01-13 13:41:27","description":"A self-proclaimed atheist student in Egypt has been sentenced to serving three years in prison after a court found him guilty of insulting Islam, in addition to receiving testimony from his own father against him charging that he \"was embracing extremist ideas against Islam.\" |","filename":"data/vaneerConsumption/EgyptianStudentGets3YearsinJailforDeclaringHesanAtheistonFacebook.json","image_url":"https://media.breitbart.com/media/2014/12/Facebook-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_13__1540931134.html","title":"Egyptian Student Gets 3 Years in Jail for Declaring He's an Atheist on Facebook","title_page":"Egyptian Student Gets 3 Years in Jail for Declaring He's an Atheist on Facebook | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A self-proclaimed atheist student in Egypt has been sentenced to serving three years in prison after a court found him guilty of insulting Islam, in addition to receiving testimony from his own father against him charging that he “was embracing extremist ideas against Islam.”\nKarim al-Banna, 21, saw the beginning of his troubles after his name appeared in a local daily newspaper on a list of atheists after writing a Facebook post declaring he was an atheist, which led to him being harassed by locals, according to the AFP. After attempting to file a complaint with a local police department, he was accused of insulting Islam by authorities and arrested. Egypt’s constitution outlaws insults against Islam, Christianity, and Judaism — the three recognized monotheist religions in that country.\nAuthorities in Egypt have reportedly stepped up measures to counter atheism, the AFP notes, including organising workshops to counter atheism.\n“If he pays a bail of 1,000 Egyptian pounds ($ 140 or 117 euros), the sentence can be suspended until a verdict is issued by an appeals court,” said al-Banna’s lawyer Abdel Nabi. An appeal for his case will be heard on March 9.\nSeveral other jail sentences have occurred as a result of people speaking out against Islam, Sharia, and religion in general. They include blogger Alber Saber, 27, who was sentenced to three years in jail on charges of blasphemy in December of 2012, and a Coptic Christian who was sentenced to six years in jail in June of 2014 for insulting Islam.\nEgyptian President Abdel Fattah al-Sisi recently called for a “religious revolution” and reformation within Islam; a call for modernization and assimilation into the modern day and times, while calling out fundamentalists who still follow in suit with Islamic law (Sharia) and traditions that were chiseled in stone centuries ago.\nFollow Adelle Nazarian on Twitter: @AdelleNaz.","url":"https://www.breitbart.com/national-security/2015/01/13/egyptian-student-gets-3-years-in-jail-for-declaring-hes-an-atheist-on-facebook/"}
