{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 22:06:43","date_modify":"2018-10-30 22:06:43","date_publish":"2016-08-17 23:42:00","description":"Egypt's Attorney-General has ordered an inquiry into two prominent politicians suspected of spying for Hezbollah.","filename":"data/vaneerConsumption/EgyptInquiryIntoPoliticiansSuspectedOfSpyingForHezbollah.json","image_url":"https://media.breitbart.com/media/2015/03/Hezbollah-marching-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_17__1540937203.html","title":"Egypt Inquiry Into Politicians Suspected Of Spying For Hezbollah","title_page":"Egypt Inquiry Into Politicians Suspected Of Spying For Hezbollah","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Egypt’s Attorney-General has ordered an inquiry into two prominent politicians suspected of spying for Hezbollah.\nFormer presidential candidates Abdul Meneem Abnu Elfutuh, chairman of the Islamist Strong Egypt party, and Hamdin Sabahi, a frontbencher for the veteran WAFD party, have been accused of collaborating with the Iran-backed militia and its patrons, Iran’s Revolutionary Guards.\nThe two, who ran in the 2011 elections that followed Hosni Mubarak’s ouster, recently attended a “pro-resistance” conference organized by Hezbollah in Beirut. Following that, a police complaint was filed against them for allegedly colluding with Hezbollah and Iran to undermine Egypt’s national interests.\nMeanwhile, on Tuesday, the Israeli Shin Bet Security Service reportedly uncovered a Hezbollah terrorist cell in Qalqilya, in the northern West Bank.\nShin Bet said that several groups of Palestinians have recently been detained as suspects in plotting attacks at the instructions of Hezbollah.\nA group from Qalqilyah was instructed to perpetrate an attack against soldiers, according to the Israeli security service. The Shin Bet identified the head of the ring as Mustafa Hindi, 18, from Qalqilyah, and says he was recruited via his Facebook profile.\nHindi was allegedly in touch with his Hezbollah operator, dubbed “Bilal,” on Facebook and later via an email account that he opened on Hezbollah’s instructions.\nAccording to the Shin Bet, Hindi was instructed to recruit a group of activists to carry out attacks against Israeli targets, including shooting at an IDF patrol in the Qalqilyah area.\nHindi is said to have recruited a number of Palestinians from his hometown, and began to collect information about army patrols in the area and train activists in shooting and the use of improvised explosives.\nMembers of that group were arrested at the start of June before carrying out any of the attacks they planned. Indictments against them have been submitted to military tribunals.\nBreitbart Jerusalem also recently reported that Hezbollah has stepped up its mediation efforts between Iran and Hamas after their falling out over the Syrian civil war. Hamas supported the opposition, was expelled from Syria, and refused to adhere to Iran’s line.\nHamas’ deputy political leader Moussa Abu Marzouk met with Iranian delegates in an attempt to patch things up. Despite several bones of contention still remaining, Iran resumed its annual $200 million support for the organization’s military wing that, in turn, pressured the political leadership to fully normalize ties with its patron.\nLast June, Breitbart Jerusalem quoted a Palestinian security source as saying that Hezbollah and Hamas have stepped up recruitment efforts in the West Bank with a view to carrying out attacks against Israel and the Palestinian Authority.","url":"https://www.breitbart.com/middle-east/2016/08/17/egypt-launches-inquiry-two-prominent-politicians-suspected-spying-hezbollah/"}
