{"authors":["John Hayward"],"date_download":"2018-10-30 22:06:25","date_modify":"2018-10-30 22:06:25","date_publish":"2017-03-14 03:32:19","description":"On Monday, a Cairo prosecutor ordered the release of former President Hosni Mubarak, who has been imprisoned since he was deposed in 2011.","filename":"data/vaneerConsumption/EgyptianProsecutorOrdersFormerPresidentHosniMubarakReleased.json","image_url":"https://media.breitbart.com/media/2017/03/former-egypt-president-Hosni-Mubarak-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_03_13__1540937185.html","title":"Egyptian Prosecutor Orders Former President Hosni Mubarak Released","title_page":"Egyptian Prosecutor Orders Former President Hosni Mubarak Released","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday, a Cairo prosecutor ordered the release of former President Hosni Mubarak, imprisoned following his deposition in 2011. His lawyer said he expected Mubarak to depart Maadi Military Hospital later this week.\n“As far as I am concerned he was in prison until today, and now he is free,” Cairo prosecutor Ibrahim Saleh told the New York Times.\nAFP notes that even if released from confinement, Mubarak will still be banned from leaving Egypt, due to a corruption investigation still in progress.\nReuters explains that Mubarak, 88, was put on trial for both corruption during his 30-year reign and for ordering the death of 239 protesters during the “Arab Spring” uprising in 2011. Prosecutors cleared him of the murder charges two weeks ago, nullifying a life sentence handed down in 2012. The court subtracted time served on the murder charges from his sentence for misusing government funds, leading to order for his release.\nMubarak is said to have suffered a heart attack after he was questioned over corruption allegations in 2011 and occasionally displayed signs of ill health for a decade before his fall from power, including overseas travel for intestinal and gall bladder surgery in 2010. He also reportedly suffered a stroke while in prison, and then injured himself by slipping and falling in the prison hospital.\nMubarak’s critics have complained his incarceration was more like a luxurious retirement funded by Egyptian taxpayers, including constant visits from family and delivery of takeout restaurant food. They argue he has technically been free since May 2015, which marked the end of his prison sentence for corruption and has willingly participated in a theatrical “incarceration” to distract public attention from how lenient the current Egyptian government has been toward Mubarak-era lawbreakers.\nThe New York Times writes that the prosecutor’s decision to formally end Mubarak’s incarceration is “undoubtedly awkward for Egypt’s current leader, President Abdel Fattah el-Sisi, who sometimes praises the revolution.”\nSisi came to power by deposing the Muslim Brotherhood’s president, Mohamed Morsi. “Since then, Egypt’s courts have jailed tens of thousands of Brotherhood members, opposition activists, lawyers, journalists and other critics of Mr. Sisi. The political prisoners include many of the same people who helped topple Mr. Mubarak in 2011 – a paradox that will not be lost on many Egyptians should Mr. Mubarak be released in the coming days,” the Times predicts.\nEven as Hosni Mubarak kinda-sorta languished in nominal incarceration, his son Gamal has been doing just fine. The Sydney Morning Herald describes him as a “flamboyant figure” given to snapping selfies with onlookers.\n#ياخبر|جمال #مبارك يحضر فرح كريم حسين أدمن \"أسف يا ريس\" ويشهد على عقد القران،والإعلامية رولا خرسا تنشر صوره معه pic.twitter.com/fRzU2Sip5X — Ya5abar | ياخبر (@Ya5abar) March 9, 2017\nHaving avoided jail for eight-figure embezzlement charges, Gamal and his brother Alaa may be on the political comeback trail. The Sydney Morning Herald relays rumors that one of them will challenge Sisi in the 2018 presidential election, even though it’s technically illegal for anyone in the Mubarak family to hold any elected office for another six years.\nTheir father’s acquittal of murder charges is described as a key factor in lifting the shadow of public revulsion and stoking “nostalgia for the Mubarak clan,” which the astonished Herald also calls “political amnesia.” Presumably, the formal end of Hosni Mubarak’s detention would further assist the ambitions of his sons, and Egypt might just get the Mubarak dynasty it demonstrated against with such enthusiasm in 2011.","url":"https://www.breitbart.com/national-security/2017/03/13/egyptian-prosecutor-orders-former-president-hosni-mubarak-released/"}
