{"authors":["Associated Press"],"date_download":"2018-10-23 02:41:31","date_modify":"2018-10-23 02:41:31","date_publish":"2017-03-10 11:59:24","description":"CAIRO (AP) - Archaeologists in Egypt discovered a massive statue in a Cairo slum that may be of Ramses II, one of the country's most famous and longest...","filename":"data/vaneerConsumption/EgyptarchaeologistsdiscovermassivestatueinCairoslum.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/17/wire-197125-1489165754-374_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300994_Archeologists-Egypt-discover-massive-statue-Cairo-slum_1540262491.html","title":"Egypt archaeologists discover massive statue in Cairo slum","title_page":"Egypt archaeologists discover massive statue in Cairo slum | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CAIRO (AP) - Archaeologists in Egypt discovered a massive statue in a Cairo slum that may be of Ramses II, one of the country's most famous and longest ruling ancient pharaohs.\nThe colossus, a large portion of whose head was pulled from mud and groundwater by a bulldozer and seen by The Associated Press on Friday, is around eight meters (26 feet) high and was discovered by a German-Egyptian archaeological team.\n\"We used the bulldozer to lift it out. We took some precautions, although somewhat primitive, but the part that we retrieved was not harmed,\" said Khaled Mohamed Abuelela, manager of antiquities at Ain Shams University.\nA boy rides his his bicycle past a recently discovered statue in a Cairo slum that may be of pharaoh Ramses II, in Cairo, Egypt, Friday, March 10, 2017. Archeologists in Egypt have discovered a massive statue that may be of pharaoh Ramses II, one of the country's most famous ancient rulers. The colossus, whose head was pulled from mud and groundwater by a bulldozer on Thursday, is around eight meters (yards) tall and was discovered by a German-Egyptian team. (AP Photo/Amr Nabil)\nEgyptologist Khaled Nabil Osman said the statue was an \"impressive find\" and the area in the working class neighborhood of Matariya in eastern Cairo is likely full of other buried antiquities.\n\"It was the main cultural place of ancient Egypt, even the bible mentions it,\" he said. \"The sad news is that the whole area needs to be cleaned up, the sewers and market should be moved.\"\nRamses II, who took the throne in his early 20s as the third pharaoh of the 19th Dynasty, ruled Egypt more than 3,000 years ago. He is credited with expanding ancient Egypt's reach as far as modern Syria to the east and modern Sudan to the south. The expansion earned him the title \"Ramses the Great.\"\nRamses II ruled Egypt for 60 years - one of the longest stretches in ancient Egypt - and besides his military exploits is known for being a great builder whose image can be seen at a string of sites across the country. Massive statues of the warrior-king can be viewed in Luxor, and his most famous monument is in Abu Simbel, near Sudan.\nOsman said the massive portion of the head removed from the ground near a street market was made in the style that Ramses was depicted, and was likely him. The site contained parts of both that statue and another.\nFamed archaeologist Zahi Hawass, Egypt's former antiquities minister, said the area where the head was found is a very important archaeological site containing the remains of temples to Akhenaten and Thutmose III - kings who ruled during the 18th Dynasty - as well as Ramses II.\nHe said excavating the area is difficult because there are houses and buildings atop the site and the ground below is filled with rainwater. He said the excavated head had been broken in earlier times.\n\"There is difficulty in the transfer of the relics from the bottom of groundwater to the highest ground,\" he said in a statement Friday.\nEgypt is packed with ancient treasures, many of which still remain buried.\nIn November last year, Egyptian archeologists discovered a village and cemetery used by officials tasked with building royal tombs. The findings at the site some 250 miles (390 kilometers) south of Cairo included 15 large tombs dating back to the Early Dynastic Period, more than 4,500 years ago.\nNew discoveries in Egyptology resonate outside of Egypt, such as the contested theory that King Tutankhamun's tomb contains additional antechambers.\nPeople gather near water which covered the site of a recently discovered statue in a Cairo slum that may be of pharaoh Ramses II, in Cairo, Egypt, Friday, March 10, 2017. Archeologists in Egypt have discovered a massive statue that may be of pharaoh Ramses II, one of the country's most famous ancient rulers. The colossus, whose head was pulled from mud and groundwater by a bulldozer on Thursday, is around eight meters (yards) tall and was discovered by a German-Egyptian team. (AP Photo/Amr Nabil)","url":"https://www.dailymail.co.uk/wires/ap/article-4300994/Archeologists-Egypt-discover-massive-statue-Cairo-slum.html"}
