{"authors":["Camila Domonoske"],"date_download":"2018-10-22 21:49:58","date_modify":"2018-10-22 21:49:58","date_publish":"2016-06-16 00:00:00","description":"The recorder was damaged, but the memory chip has been found, Egypt's Civil Aviation Authority says. A ship has also taken photographs of \"several main locations\" of the plane's wreckage.","filename":"data/vaneerConsumption/EgyptAirCockpitVoiceRecorderHasBeenRecoveredEgyptianOfficialsSay.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_06_16_482294332_egyptair-cockpit-voice-recorder-has-been-recovered-egyptian-officials-say_1540244998.html","title":"EgyptAir Cockpit Voice Recorder Has Been Recovered, Egyptian Officials Say","title_page":"EgyptAir Cockpit Voice Recorder Has Been Recovered, Egyptian Officials Say : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"EgyptAir Cockpit Voice Recorder Has Been Recovered, Egyptian Officials Say\nA ship in the Mediterranean has recovered the cockpit voice recorder from EgyptAir Flight 804 and taken images of \"several main locations\" of the plane's wreckage, Egypt's Civil Aviation Authority says.\nThe recorder was damaged, the agency said Wednesday, but the search team was able to recover the device's memory unit.\nThe recorder and the images were obtained by the ship John Lethbridge, the Civil Aviation Authority says.\nThe Associated Press reports that the vessel is operated by the U.S. company Deep Ocean Search and arrived at the search area on Sunday. The ship is equipped with underwater detection equipment, such as sonar, that can explore up to 6,000 feet below the sea's surface.\nFlight 804 crashed into the Mediterranean Sea nearly a month ago, killing all 66 people aboard.\nWhat caused the Airbus A320 to crash is still unknown. Investigators are hoping the voice recorder will shed light on what, exactly, happened. The plane's flight-data recorder has not yet been found.\nSome small pieces of debris from the plane had previously been discovered by search crews, but the search continued for the bulk of the wreckage.\nThe Egyptian Civil Aviation Authority says search teams are now working on mapping the main wreckage locations and discussing how to \"best handle the wreckage.\"","url":"https://www.npr.org/sections/thetwo-way/2016/06/16/482294332/egyptair-cockpit-voice-recorder-has-been-recovered-egyptian-officials-say"}
