{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 21:49:19","date_modify":"2018-10-22 21:49:19","date_publish":"2016-07-13 00:00:00","description":"\"All I wanted to know was whether my son was dead or alive,\" the father of one victim told Amnesty International. Enforced disappearance has become increasingly common in the last year in Egypt.","filename":"data/vaneerConsumption/EgyptianAuthoritiesDisappear34PeopleDailyAmnestyInternationalSays.json","image_url":"https://media.npr.org/assets/img/2016/07/13/ap_733306950096_wide-a59753081f5cd273b9b05fc947aeea5946dba81a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_07_13_485893396_egyptian-authorities-disappear-3-4-people-daily-amnesty-international-says_1540244959.html","title":"Egyptian Authorities Disappear 3-4 People Daily, Amnesty International Says","title_page":"Egyptian Authorities Disappear 3-4 People Daily, Amnesty International Says : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Egyptian Authorities Disappear 3-4 People Daily, Amnesty International Says\nEnlarge this image toggle caption Amr Nabil/AP Amr Nabil/AP\nAmid a sweeping crackdown on dissent in Egypt, security forces have forcibly disappeared hundreds of people since the beginning of 2015, according to a new report from Amnesty International.\nIt's an \"unprecedented spike,\" the group says, with an average of three or four people disappeared every day.\n\"Enforced disappearance has become a key instrument of state policy in Egypt,\" Philip Luther, director of the Middle East and North Africa Programme at Amnesty International, says in a statement. \"Anyone who dares to speak out is at risk, with counter-terrorism being used as an excuse to abduct, interrogate and torture people who challenge the authorities.\"\nThe rights group conducted about 70 interviews with former detainees, their friends, relatives, and lawyers. It looks at 17 specific cases, including children who were disappeared.\nAmnesty argues these disappearances follow a pattern. Most of the victims are supporters of ousted Islamist President Mohammed Morsi, though other government opponents have also been targeted. Typically, agents of the National Security Agency descend on the target's home at night, brandishing automatic weapons. \"In no case did the NSA officials produce judicial arrest or search warrants, nor did they tell detainees' families why they were taking their relatives or where to,\" the report reads.\nThen, in the cases documented by Amnesty, the detainees were held \"incommunicado, most of the time kept handcuffed and blindfolded.\" The report goes into graphic detail because in many cases, the victims were tortured:\n\"Methods of torture reported by victims and witnesses include electric shocks to the body and sensitive areas, such as the genitals, lips and ears; prolonged suspension by the limbs while handcuffed and naked; and sexual abuse, including rape; beatings and threats. Some detainees said they were subjected to the 'grill' – rotation on a bar that was inserted between their tied arms and legs and balanced between two chairs.\"\nAmnesty adds that \"prosecutors continue to rely heavily on 'confessions' that security officials obtain from detainees during their enforced disappearance, even when detainees retract them and allege they were coerced through torture.\"\nDuring the period of enforced disappearance, the detainees would typically be held at NSA offices where the judiciary has no access, according to the report. In many of the cases documented, the Egyptian government would repeatedly deny the individual is in custody.\nThese 17 cases documented by Amnesty lasted from four days to seven months, and \"ended in most cases when the detainee was taken before a prosecutor for questioning.\"\nNPR's Leila Fadel described two of the most horrific cases from the Amnesty report on All Things Considered:\n\"In one case, a young man, Mazen Mohamed Abdallah – just a teenager, 14 years old – was taken by security forces, disappeared, and repeatedly raped with a wooden stick to extract a confession, according to Amnesty International. Another case, also a 14-year-old, who disappeared for 34 days and was beaten. Given electric shocks all over his body, including his genitalia. And then when he was finally put in front of a prosecutor, he tried to retract that confession and was threatened with more electric shocks if he tried to retract the confession.\"\nAs Leila points out, there have been regular disappearances like this in Egypt for more than a year now – and they appear designed to scare government opponents. \"The motive, according to Amnesty International, human rights defenders, activists, they all say it's to silence dissent and to scare people into being silent,\" she says.\nThe Egyptian government has refused to comment directly on the report. It \"basically dismissed it out of hand,\" which is its standard response to this kind of criticism, Leila reports. In a post on Facebook, the Ministry of Foreign Affairs spokesman says Amnesty is \"not impartial and motivated by political stances.\" He accuses the group of relying only on sources that are \"hostile to the Egyptian state.\"\nAmnesty calls on international actors to put pressure on Egypt to stop the violations – specifically, the U.S. and the EU, as Leila reports. \"The United States gave $1.3 billion in military aid this year, and Amnesty is saying don't give that blindly and unconditionally,\" Leila says. \"What Amnesty is saying is that the U.S. and the European Union and other countries should not turn a blind eye to these types of acts that are increasing under this government.\"","url":"https://www.npr.org/sections/thetwo-way/2016/07/13/485893396/egyptian-authorities-disappear-3-4-people-daily-amnesty-international-says"}
