{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:06:54","date_modify":"2018-10-30 22:06:54","date_publish":"2016-04-16 15:26:10","description":"Contents: Egypt-Saudi deal for Red Sea bridge triggers massive protests in Cairo; Migrant traffic from Libya to Italy surges; Czech Republic debates adopting the short name 'Czechia' | National Security","filename":"data/vaneerConsumption/EgyptSaudiDealforRedSeaBridgeTriggersProtestsinCairo.json","image_url":"https://media.breitbart.com/media/2016/04/wi/ap_ap-photo-809-e1460820362932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_16__1540937214.html","title":"Egypt-Saudi Deal for Red Sea Bridge Triggers Protests in Cairo","title_page":"Egypt-Saudi Deal for Red Sea Bridge Triggers Protests in Cairo","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nEgypt-Saudi deal for Red Sea bridge triggers massive protests in Cairo\nMigrant traffic from Libya to Italy surges\nCzech Republic debates adopting the short name ‘Czechia’\nEgypt-Saudi deal for Red Sea bridge triggers massive protests in Cairo\nEgyptian protesters hold a sign that says ‘Awad sold his land’, an old proverb expressing the shame of giving up two islands to Saudi Arabia (VOA)\nThousands of Egyptians demonstrated in central Cairo on Friday against president Abdel al-Fattah al-Sisi in the biggest anti-government protests since al-Sisi’s coup that ousted the Muslim Brotherhood government of Mohamed Morsi.\nThe trigger for the riots was the joint plan by Egypt and Saudi Arabia to build a bridge across the Red Sea, but the riots were not triggered by the bridge plan itself, but by other terms of the same deal that we described in “10-Apr-16 World View — Egypt, Saudi Arabia to build a huge bridge where Moses parted the Red Sea”\nThe part of the deal that’s triggering the demonstrations was that a long-standing dispute over two islands in the Strait of Tiran, the Sanafir and Tiran islands, was resolved by Egypt giving up sovereignty and turning the islands over the Saudi Arabia.\nAt the same time, Saudi Arabia agreed to invest $22 billion in development projects in Egypt to help its ailing economy, though Saudi Arabia is not offering “free money” this time because Saudi Arabia’s economy is also ailing because of collapsing oil prices.\nProtesters on Friday chanted, “Awad sold his land!”, an allusion to the villagers’ taunts in a popular 1960s radio play of a man who sold his plot of farmland — an act that in the past was equated with dishonor in rural Egypt.\nEgypt’s best known political satirist, self-exiled Bassem Youssef, mimicked the shouts of Egyptian street hawkers selling souvenirs to foreign tourists by tweeting, “Here, here, Pasha, one island for a billion, a pyramid for two and I will throw two statues on top,”\nHowever, the chants by the protesters went beyond the island issue to calling for the downfall of the government. Egyptians had hoped that al-Sisi’s presidency would bring an economic upturn, but the economy has continued to worsen. The protests were not as big as the 2011 protests that brought down Mubarak, but they are similar, and new protests are planned for April 25. The crowds dispersed later in the day, although Egyptian security forces detained about 50 protesters. Al-Ahram (Cairo) and AP and AFP\nMigrant traffic from Libya to Italy surges\nOnly a few hundred migrants entered Europe via Greece this week, but almost 6,000 migrants and refugees have sailed from Libya towards Italy in the past three days in what appears the start of a wave of at least 100,000 and “possibly many, many more” this year, the International Organization for Migration said on Friday.\nThe Italian Coast Guard has become extremely efficient at saving migrants from drowning, and some people are complaining that it’s become so efficient that many more migrants are encouraged to make the trip, thus making Europe’s migrant crisis even worse. Reuters\nCzech Republic debates adopting the short name ‘Czechia’\nAfter years of debate, leaders of the Czech Republic are supporting “Czechia” as the shortened name for the country. According to President Milos Zeman in 2013, “I use the term Czechia because it’s shorter and not so cold like the term Czech Republic.”\nOther politicians object to the name for several reasons, including the fact that the new name will be confused with the name “Chechnya,” one of Russia’s provinces in the Northern Caucasus.\nIn fact, even without the new name, that is exactly what did happen in 2013 after the Boston Marathon bombing. The two Boston Marathon bombers had origins in Chechnya, but many bloggers got confused, as I reported in “21-Apr-13 World View — American bloggers confuse ‘Chechnya’ with ‘Czech Republic'”.\nIn order to allay the confusion at the time, Czech Ambassador Petr Gandalovic posted the following message on the web site for the Czech embassy in Washington:\nAs many I was deeply shocked by the tragedy that occurred in Boston earlier this month. It was a stark reminder of the fact that any of us could be a victim of senseless violence anywhere at any moment. As more information on the origin of the alleged perpetrators is coming to light, I am concerned to note in the social media a most unfortunate misunderstanding in this respect. The Czech Republic and Chechnya are two very different entities – the Czech Republic is a Central European country; Chechnya is a part of the Russian Federation. As the President of the Czech Republic Milos Zeman noted in his message to President Obama, the Czech Republic is an active and reliable partner of the United States in the fight against terrorism. We are determined to stand side by side with our allies in this respect, there is no doubt about that.\nNow, with regard to adopting the short name Czechia, one opposition MP said: “It is certainly not a good idea. I think that we are known as the Czech Republic, though for some further away its still rather often Czechoslovakia in spite of the fact we are now the Czech Republic.” Radio Prague and Washington Post\nKEYS: Generational Dynamics, Saudi Arabia, Egypt, Abdel al-Fattah al-Sisi, Bassem Youssef, Red Sea, Strait of Tiran, Gulf of Aqaba, Mohammed Morsi, Muslim Brotherhood, Hosni Mubarak, Libya, Italy, Greece, Czech Republic, Czechia, Chechnya, Boston Marathon, Petr Gandalovic, Milos Zeman\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/04/16/16-apr-16-world-view-egypt-saudi-deal-red-sea-bridge-triggers-massive-protests-cairo/"}
