{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-22 23:34:53","date_modify":"2018-10-22 23:34:53","date_publish":"2016-01-29 11:36:17","description":"So far Egypt has publicly said it has found no evidence the MetroJet flight, which crashed in the Sinai Peninsula after takeoff from Sharm el-Sheikh airport, was brought down by terrorism.","filename":"data/vaneerConsumption/EgyptAirmechanicwhosecousinisanISISfighterarrestedoverRussianplanecrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/2DFC191300000578-0-image-a-40_1454078385808.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422519_EgyptAir-mechanic-suspected-Russian-plane-crash-sources_1540251293.html","title":"Egypt Air mechanic whose cousin is an ISIS fighter arrested over Russian plane crash","title_page":"Egypt Air mechanic whose cousin is an ISIS fighter arrested over Russian plane crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two airport policemen and a baggage handler are suspected of helping him put the bomb on board\nSources said Egypt Air mechanic has since been detained over the crash\nAn Egypt Air mechanic whose cousin is an ISIS fighter is among four people arrested on suspicion of planting a bomb on board the Russian passenger jet that crashed in Sinai.\nSo far Egypt has publicly said it has found no evidence the MetroJet flight, which crashed in the Sinai Peninsula after takeoff from Sharm el-Sheikh airport, was brought down by terrorism.\nA senior security official at the airline denied that any of its employees had been arrested over the crash or were under suspicion over the crash, which killed all 224 people on board. An Interior Ministry official also said there had been no arrests.\nScroll down for video\nAn Egypt Air mechanic whose cousin is an ISIS fighter is among four people arrested on suspicion of planting a bomb on board the Russian passenger jet that crashed in Sinai\nBut the sources, who declined to be identified because of the sensitivity of the ongoing investigation, said the mechanic had been detained, along with two airport policemen and a baggage handler suspected of helping him put the bomb on board.\n'After learning that one of its members had a relative that worked at the airport, Islamic State delivered a bomb in a handbag to that person,' said one of the sources, adding the suspect's cousin joined ISIS in Syria 18 months ago.\n'He was told to not ask any questions and get the bomb on the plane.'\nAnother source said of the other suspects: 'Two policemen are suspected of playing a role by turning a blind eye to the operation at a security checkpoint. But there is a possibility that they were just not doing their jobs properly.'\nNone of the four have been prosecuted so far, the sources told Reuters.\nThe crash has called into question Egypt's drive to eradicate Islamist militancy and hurt its tourism industry, a cornerstone of the economy.\nSo far Egypt has publicly said it has found no evidence the MetroJet flight, which crashed in the Sinai Peninsula after takeoff from Sharm el-Sheikh airport, was brought down by terrorism\nISIS's Egypt affiliate is waging an insurgency in parts of the Sinai, although mostly far from the tourist resorts along its Red Sea coast.\nRussia and Western countries have long said that they believe the flight was brought down by a bomb smuggled on board.\nEgypt however has so far publicly said it has not found any evidence of foul play.\nAny formal charges or official Egyptian confirmation that a bomb brought down the Airbus A321 could potentially expose Egypt to compensation payments to the families of the victims.\nThe EgyptAir senior security official said state security police had investigated all workers at Sharm el-Sheikh airport without finding any evidence implicating any of them.\nThe crash has called into question Egypt's drive to eradicate Islamist militancy and hurt its tourism industry, a cornerstone of the economy\nThe official said state security traced the family connections of all the employees and they were cleared.\n'Any employee who shows sympathy to militants is prevented from going to work in any airport,' he told Reuters.\nAn Interior Ministry source also said no one had been arrested in connection with the crash.","url":"https://www.dailymail.co.uk/news/article-3422519/EgyptAir-mechanic-suspected-Russian-plane-crash-sources.html"}
