{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 21:48:46","date_modify":"2018-10-22 21:48:46","date_publish":"2016-11-03 00:00:00","description":"The country's central bank decided to lift controls and let the pound float freely. The move is designed to take aim at the black market and is likely to cause prices to jump.","filename":"data/vaneerConsumption/EgyptFloatsItsCurrencyPavingWayForAnInternationalBailout.json","image_url":"https://media.npr.org/assets/img/2016/11/03/ap_16308280224673_wide-654cce82c0f35a5f366bacc0d025811375e6477c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_11_03_500533505_egypt-floats-its-currency-paving-way-for-an-international-bailout_1540244926.html","title":"Egypt Floats Its Currency, Paving Way For An International Bailout","title_page":"Egypt Floats Its Currency, Paving Way For An International Bailout : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Egypt Floats Its Currency, Paving Way For An International Bailout\nEnlarge this image toggle caption Amr Nabil/AP Amr Nabil/AP\nThe value of Egypt's beleaguered currency fell by almost 50 percent against the dollar Thursday. That's after the country's central bank decided to lift controls and let the pound freely float.\nThe move in the region's most populous country was designed to take aim at the black market and is likely to cause prices to jump.\nEconomists have long argued that the value of the Egyptian pound is artificially high, propped up by the country's dwindling foreign reserves. That's been the case since the 2011 uprising that ousted longtime dictator Hosni Mubarak. The years of political unrest that followed have pummeled the country's economy and caused tourism, a major source of hard currency, to dry up.\nNow, as NPR's Jane Arraf tells our Newscast unit, \"the move paves the way for an international bailout.\"\nIt was one of the conditions the International Monetary Fund recently put forward for a $12 billion bailout, Jane says. Here's more on the context:\n\"The Egyptian pound has recently hit record lows on the black market — less than half the rate set by the central bank. \"That meant that for months almost no one wanted to trade Egyptian pounds for dollars at the much higher official rate. And Egypt needs dollars to import food and other commodities. The lack of hard currency has led to shortages of sugar and made all imported goods more expensive.\"\nBut the central bank's dramatic decision to allow the pound to float freely surprised some observers. \"Analysts had expected the central bank would move to a managed float of the currency, or would announce a sharp devaluation to prop up the beleaguered pound,\" The Wall Street Journal reports.\n\"This is a very positive, courageous step on many levels, firstly, the extent of the move, and secondly the fact that it is effective immediately,\" Mohamed Abu Basha, economist at the investment bank EFG-Hermes, tells the Journal. \"We are looking at what is very likely the end of the [foreign-exchange] crisis.\"\nBusiness mogul Naguib Sawiris, one of the country's richest people, called it an \"excellent step\" that is \"overdue.\"\nAt the same time, the decision is likely to cause price inflation on items such as food and pharmaceuticals. President Abdel-Fattah el-Sissi told Egyptians last week that \"the military would distribute a one-off package of basic food items such as sugar and rice at half price among poor Egyptians,\" The Associated Press reports.\nIn analysis published before Thursday's announcement, the Tahrir Institute for Middle East Policy said the move also could encourage \"remittances to be transferred again through the banking system.\" By some recent estimates, 90 percent of that money flows through the black market, according to the institute. \"Redirecting remittances back to Egypt's banks would significantly contribute to plugging the hole in Egypt's hard currency shortage.\"\nThe institute adds that \"undeniably, Egypt is entering into an acutely painful period, but it is possible that these difficult measures will move the country to a more sound fiscal position and help it escape the spiraling economic crisis that has plagued the country for the past few years.\"\nEgypt's benchmark stock index surged after the news, Bloomberg reports, closing at its highest point in 17 months.","url":"https://www.npr.org/sections/thetwo-way/2016/11/03/500533505/egypt-floats-its-currency-paving-way-for-an-international-bailout"}
