{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:30:05","date_modify":"2018-10-30 19:30:05","date_publish":"2016-05-12 00:00:00","description":"Brett Eibner was called up by the Kansas City Royals on Thursday.","filename":"data/vaneerConsumption/EibnercalledupbyRoyals.json","image_url":"https://media.arkansasonline.com/img/photos/2016/05/12/rockiesroyalsspring_jone_703375_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_may_26__1540927805.html","title":"Eibner called up by Royals","title_page":"Eibner called up by Royals","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Kansas City Royals' Brett Eibner races the throw as he advances to third on a ground-out by Orlando Calixte during the seventh inning of a spring training baseball game against the Colorado Rockies on Tuesday, March 8, 2016, in Surprise, Ariz. (AP Photo/Charlie Riedel)\nBrett Eibner was called up by the Kansas City Royals on Thursday.\nThe former Arkansas star had been playing for Triple-A Omaha, but was promoted when Kansas City third baseman Mike Moustakas was placed on the 15-day disabled list with a torn ACL.\nMore from WholeHogSports 6 pros who signed, but never played for Hogs\nHe could become the second former Arkansas player to make his debut in a span of 10 days, as Matt Reynolds played his first game for the New York Mets on May 17.\nIn 41 games at Omaha, Eibner was hitting .309 with 10 home runs and 28 RBIs. He also had 36 runs scored and 27 walks. His 10 home runs rank fifth in the Pacific Coast League.\nEarlier this season, he made headlines for hitting three home runs in one game.\nOf Arkansas' first five players drafted in 2010, four have now made an MLB roster. Only one who hasn't is first-rounder Zack Cox. — Matt Jones (@MattJonesADG) May 27, 2016\nEibner was held out of the Storm Chasers' lineup Wednesday, but went 2 for 3 with a double and an RBI in Tuesday's game.\nHe will wear jersey No. 12 for the Royals, whose game Thursday was rained out.\nEibner is the eighth former Arkansas player to make an MLB roster this season. In addition to Reynolds, others include pitchers Dallas Keuchel (Astros), Drew Smyly (Rays) and Mike Bolsinger (Dodgers), and position players Logan Forsythe (Rays), Craig Gentry (Angels) and James McCann (Tigers).","url":"https://www.arkansasonline.com/news/2016/may/26/eibner-called-royals/"}
