{"authors":[],"date_download":"2018-10-30 00:59:18","date_modify":"2018-10-30 00:59:18","date_publish":"2018-08-17 00:05:27","description":null,"filename":"data/vaneerConsumption/ElbaIdrisElba.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Actor_Idris_Elba_at_the_Defeating_Ebola_in_Sierrra_Leone_conference_15418119105.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861158.html","title":"Elba, Idris Elba","title_page":"Elba, Idris ElbaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It’s time to have an urbane James Bond who loves his clandestine work — once again.\nThe Bond brand suffered under Daniel Craig, who has made no secret of his desire to abandon that role. Reflecting the primacy of global grunge and glorification of the ordinary, Craig came across as a surly, hired hand who might rather be bench pressing several times his weight in the gym. Grimacing in his tight dark suits, his face smeared with grime, he looked as thuggish as the villains he was supposed to destroy.\nHappily, there are a number of candidates to replace Craig, and the leader at this writing seems to be the distinguished British actor, Idris Elba. Much coverage thus far is about race, as Elba is of West African antecedents. Elba is a highly versatile actor. Popular sources such as IMDb have ranked him among the “100 Most Beautiful People on the Planet!” Similarly, in 2017, GQ ranked him among the 50 best-dressed men. Elba was made an OBE in 2016.\nElba is superbly qualified to be Bond, and the racial focus misses the point: viewed strategically, what should be the criteria for the next generation of Bond, James Bond?\nFirst, the candidate should portray a sense of mission — and that mission is to save Western civilization from existential threats. While some chaps might waggishly say “save it from itself,” the other way to look at it is to recognize the existence of a trapezoid of malevolence that includes Russia, Iran, North Korea, and China. In addition, the landscape teems with non-state actors seeking to do harm, bristling with modern battlefield weapons and digital intrusions. There are now so many threats, seen and unseen, that the next Bond will have to perform multitasking, indeed a form covert triage.\nSecond, he will need to embody the cult of the English gentleman. Rolled umbrellas and trilbies should be seen. He should be a habitué of Savile Row and Jermyn Street, with a slight hint of foppery. He should know his horseflesh, along with Georgian and Regency mahogany and silver. His manners should be impeccable when he wants them to be, bringing to mind the axiom of Oscar Wilde: “A true gentleman is one who is never unintentionally rude.”\nThird, he should be an epicure. He will drink the right wines, and not seek to “pair them,” as is often done by gushy sommeliers in California. He will order Périgord foie gras, or the Hudson Valley equivalent if pursuing villains in the United States — accompanied by Château d’Yquem from the Sauternes, served at 14 degrees Celsius. The next Bond should know the fine cuisines of the world, but also appreciate a souvlaki with a good pilsner.\nFourth, he will need to be highly proficient with a variety of handheld weapons. The Walther PPK chambered in 7.65 millimeter has no place in today’s theaters of conflict, where some of the bad guys wear body armor and major stopping power is required. Although the PPK was a step up from Bond’s Beretta 418 chambered in .25 ACP, it is fundamentally now a collector’s item.\nThe earlier Bonds — Sean Connery, Roger Moore, Timothy Dalton, and Pierce Brosnan — were of these traditions. They were at home in Venice, Bratislava, Azerbaijan, and on the French Riviera — and in the 6th century cistern of the Byzantine emperor, Justinian I, in Istanbul.\nAs with any search process, no candidate can immediately meet all of the rigorous criteria set forth in a job description. However, the bookies have Idris Elba on the inside track, and there is always on the job training, even for someone characterized as “one of the coolest men on the planet.”\nA debonair Elba showing grace under pressure in the face of imminent danger can restore the Bond franchise to its original glories. Stay tuned.\nFrank Schell is a business strategy consultant and former senior vice president of the First National Bank of Chicago. He is a Lecturer at the Harris School of Public Policy, University of Chicago and a contributor of opinion pieces to various journals.","url":"https://spectator.org/elba-idris-elba/"}
