{"authors":["Mia De Graaf For Dailymail.Com"],"date_download":"2018-10-22 20:13:17","date_modify":"2018-10-22 20:13:17","date_publish":"2016-01-28 00:34:26","description":"The recaptured drugs lord appears stoic as police officers walked him through his undignified return to jail. Mexican president Enrique Pena Nieto is trying to fast-track Guzman's extradition.","filename":"data/vaneerConsumption/ElChapoisforcedtogivefingerprintsandposeformugshot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A947CF00000578-0-image-a-5_1453976460653.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420143_The-moment-undignified-El-Chapo-forced-fingerprints-pose-mug-shot-told-faces-imminent-extradition_1540239197.html","title":"El Chapo is forced to give fingerprints and pose for mug shot","title_page":"El Chapo is forced to give fingerprints and pose for mug shot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment Joaquin El Chapo Guzman was forced to dutifully give his fingerprints and pose for mugshots as he was told he faces extradition.\nThe recaptured drugs lord appears stoic as police officers walked him through the police station, filming his undignified return to jail.\nThe video's release comes days after Mexican president Enrique Pena Nieto announced he is trying to fast-track Guzman's extradition to the United States.\nFor now, the Sinaloa cartel leader, 61, is back in El Altiplano, a maximum-security jail outside Mexico City.\nSCROLL DOWN FOR VIDEO\nJoaquin 'El Chapo' Guzman, pictured being booked into Altiplano jail on January 8 after being recaptured\nThe undignified drugs lord gave fingerprints, a blood sample, and posed for a mug shot for the officers\nHe appeared stoic throughout the process, which was filmed and released online on Wednesday\nThe new footage was released on Wednesday as part of a 19-minute video from Mexican officials to show 'the investigation and detective work' that went into recapturing Guzman.\nThe first 14 minutes describes his escape, but features nothing new. The final five minutes focuses on his detention.\nA voiceover regales how El Chapo broke free from El Altiplano through a tunnel underground.\nThe investigation, it says, was two-pronged. One half focused on the 'corruption and collusion inside the prison and police force with criminals'.\nThe other was an intelligence effort to locate El Chapo.\nThe video shows El Chapo being told he faces imminent extradition to the United States\nThe clip was part of a 19-minute video from Mexican authorities describing the official account of his escape\nIt does not mention his meeting with Kate del Castillo and Sean Penn, despite some officials' claims that this meeting exposed him.\nIn fact, the video, which was posted on the Mexican officials' Facebook page, omits any detailed description of how authorities honed in on El Chapo's hide-out.\nThe only new detail in the official video comes in the final moments when they show El Chapo getting his fingerprints, mug shot, and blood tests taken to confirm his identity.","url":"https://www.dailymail.co.uk/news/article-3420143/The-moment-undignified-El-Chapo-forced-fingerprints-pose-mug-shot-told-faces-imminent-extradition.html"}
