{"authors":[],"date_download":"2018-10-30 19:43:03","date_modify":"2018-10-30 19:43:03","date_publish":"2018-10-30 19:21:10","description":"Natasha Crittenden Wilson didn’t expect to document an inspiring moment between strangers...","filename":"data/vaneerConsumption/Elderlymanholdsastrangersbabysoshecandopaperwork.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/19/Videos/4486796.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_elderly-man-h_d55ec892850c49da1cd930165d34ca26__1540928583.html","title":"Elderly man holds a stranger’s baby so she can do paperwork","title_page":"Elderly man holds a stranger’s baby so she can do paperwork","title_rss":"NULL","source_domain":"ajc.com","text":"Natasha Crittenden Wilson didn’t expect to document an inspiring moment between strangers in the waiting room of her doctor’s office last week, but life has a funny way about it.\nWilson was waiting for her appointment in Sheffield, Alabama, when a woman walked in with a sleeping baby in her arms. When the receptionist handed the woman paperwork to fill out, Wilson recognized the woman's conundrum. How was she supposed to juggle her sleeping baby and the clipboard of paperwork?\n» Toddler best friends dress up as Chip and Joanna Gaines in the most adorable Halloween costume\n(Facebook/Natasha Crittenden Wilson)\n\"She goes to sit down, and you could just hear her thinking, 'Now how am I going to do this?''' Wilson recalled to “Inside Edition.” Before she knew it, an elderly man from across the room was calling out to her. \"Could I hold that baby for you?\" he asked. The mother smiled and replied \"Yes, that would be amazing!”\n“This man went over there and rocked and loved on that baby like he was his!!” Wilson recalled on Facebook alongside a now-viral photo of the sweet interaction. “My heart Melted!!!”\nIn just a few days, Wilson’s photo has been viewed more than 1 million times and received more than 61,000 comments. Many said they were moved to see a white man care for a black baby like it was his own.\n\"It's all very surreal,\" Wilson told “Inside Edition.” It's very heartwarming to know that people all over the world want the same thing.\"\nWilson added that she has since been in contact with the gentleman. \"That's just who I am. I've never thought about race or color,” she said he told her over the phone. “All the children I know call me Papa Joe.\" His wife chimed in in the background: \"We call him the 'Child Magnet.'''","url":"https://www.ajc.com/news/national/elderly-man-holds-stranger-baby-she-can-paperwork/1jNYGVV0PwwXFkNvidbDPN/"}
