{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 01:36:00","date_modify":"2018-10-23 01:36:00","date_publish":"2016-01-29 15:37:24","description":"Lisa Rutter won a photo competition after capturing the heartwarming moment her 15-year-old black Labrador Jessie, who had a number of ailments, took one last run along Redcar beach in North Yorkshire.","filename":"data/vaneerConsumption/ElderlyLabradortookonefinalrunalongthebeachbeforebeingputdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B30CD500000578-0-image-a-137_1454079714014.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422920_Tear-jerking-moment-elderly-labrador-took-one-final-run-beach-just-weeks-down_1540258560.html","title":"Elderly Labrador took one final run along the beach before being put down","title_page":"Elderly Labrador took one final run along the beach before being put down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A poignant picture of an elderly dog running and smiling on her final trip to the beach has gone viral after capturing the hearts of Britain's animal lovers.\nJessie the Black Labrador was deaf, going blind, suffered from arthritis and needed to be lifted from a van for her last visit to the seaside.\nBut despite her age and ailments the 15-and-a-half year-old pet had the energy for one final run - providing there would be food at the end of it.\nThis poignant picture of Jessie the Black Labrador's last visit to the seaside at Redcar beach, North Yorkshire, has gone viral after capturing the hearts of dog lovers up and down the country\nOwner Lisa Rutter knew the dog she got as an eight-week old puppy was nearing the end of her life and wanted to treat her to one final run out on the sand.\nAnd as Jessie ran towards her on Redcar beach, North Yorkshire, Lisa captured the tear-jerking moment on her phone.\nLisa, 40, said: 'Although she couldn't hear me shouting she knew I had treats and just by me putting my hand in my pocket it created this great pic of her at her happiest.\n'Running is something I hadn't seen in a long time from her.\n'It was a lovely moment, I took out my phone and snapped the picture before giving her a well-deserved treat.'\nJessie the Black Labrador was deaf, going blind, suffered from arthritis and needed to be lifted from a van for her visit to the seaside. Despite her age and ailments, the 15-and-a-half year-old had the energy for one final run\nLisa said Jessie was 'always special to me' but to have people around the world saying how beautiful she is was 'overwhelming'\nShe added: 'Jessie was tired after the run. We sat on the beach for a while and I chatted with her and shed a tear.\n'I thanked her for being my number one girl and my best friend she gave me a big sloppy kiss.\n'I gave her lots more treats and cuddles. Maybe I knew she didn't have long left, I don't know, I just knew I wanted to spend some quality time with her.'\nThe photograph was taken in August and the following month Jessie went off her food.\nLisa took her to the vet where she made the heartbreaking decision to put her to sleep.\n'Proud to have her as a pet': Jessie the Labrador, Lisa Rutter's loyal companion, remained full of life until her final days\nShe said: 'Jessie looked up at me and at that point I knew it was time. She was ready. There had been no suffering and I was so glad of that.\n'They say you know when they are ready and I did. She had a great life.\n'I cried a lot but also I knew she was at peace. Everything was so peaceful it was like she had fallen to sleep.\n'Jessie lived for food. She had the longest tongue and gave the best kisses, she moulted terribly and constantly, she snored very, very loudly, she had very smelly paws, she snatched treats and she loved water but hated the bath.\n'We miss her everyday.'\nIt's a dog's life: Jessie lived for food, 'had the longest tongue', snored loudly, snatched treats, had smelly paws and hated bath time - but her owner Lisa wouldn't have changed her for the world\nIn November Lisa and her civil partner Jen, who she met while walking Jessie, took her ashes to be scattered in the Lake District.\nLast month they came across a Best Old Dog Photo Competition being hosted by Off the Leash, a dog cartoon website run by artist Rupert Fawcett.\nShe entered the photograph of Jessie's final run on the beach and earlier this week Rupert announced it had won the competition after picking up more than 9,500 likes.\nThe dog that even played Cupid: Lisa (left) on holiday with her civil partner Jen, who she met while walking Jessie\nLisa, who runs her own dog care and walking business in Redcar, said: 'We cried when she was getting all of the likes. It was just amazing.\n'She was always special to me but for all those people around the world to be saying how beautiful she is was overwhelming.\n'It made me so proud to have had her as my pet.'\nJessie won Best Old Dog Photo Competition hosted by Off the Leash, a dog cartoon website\nChilling out: Jessie the Black Labrador (right) with Lisa Rutter's other dogs Sooty and Sweep","url":"https://www.dailymail.co.uk/news/article-3422920/Tear-jerking-moment-elderly-labrador-took-one-final-run-beach-just-weeks-down.html"}
