{"authors":[],"date_download":"2018-10-30 14:07:18","date_modify":"2018-10-30 14:07:18","date_publish":"2018-10-30 00:05:36","description":"Back in the ’90s, Michael Moore made a movie accusing GM of killing the electric car. He was wrong. The real killer wasn’t GM","filename":"data/vaneerConsumption/ElectricCarsTheRealKillers.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/Michael_Moore_2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908438.html","title":"Electric Cars: The Real Killers","title_page":"Electric Cars: The Real KillersThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Back in the ’90s, Michael Moore made a movie accusing GM of killing the electric car. He was wrong. The real killer wasn’t GM.\nIt was a tag team of the market — and the government. One of those killers was innocent.\nThe other is still at large.\nThe market killed off the GM EV1 — the electric car that was the subject of the movie — because it was still allowed to work back then. It was a mercy killing.\nJustifiable homicide.\nThere weren’t any “zero emissions” mandates or carbon credits back in the mid-’90s and while CAFE — the government’s fuel economy edicts — did exist, back then it was only 27-something miles-per-gallon and so it wasn’t yet necessary to build EVs as compliance cars, just to even out the MPG math (as it is now; this is one of the non-market mechanisms being used to nudge EVs onto the market).\nSo the EV1 had to stand on its own two bowed and rickety legs — and of course, couldn’t. As today, it was much too expensive ($35,000 in mid-1990s dollars) to make any kind of economic sense and didn’t go very far and took forever to recharge before you could go not-far again.\nWhich didn’t make sense generally.\nGM tried give-away leases but that was just the problem. The only way to get people into an EV1 was to basically give it to them. GM may be evil but it can’t stay in business that way. So it gave up, recalled the EV1s in circulation, and crushed most of them. That’s what car companies often do with inventory that would otherwise collect dust and possibly create liability concerns for them.\nThey kept a couple for the museum.\nHardly a conspiracy. Just a market failure.\nBut there is a villain in this story — and his name is Uncle. He committed two heinous crimes, for which he deserves to be frog-marched to the dock, tried, convicted and (cue Judge Alvin Valkenheiser from Nothing But Trouble) sent for a ride on Mr. Bone Stripper.\nThe first of his offenses is the murder — really more of a pre-emptive abortion — of the affordable and functionally serviceable electric car.\nThe second is his assault upon the free market, which resulted in the illegitimate birth of high-performance electric luxury sport-cars that happen to be electric but which are utterly dependent for their existence on mandates and subsidies — and which most people still can’t afford without assuming heavy debt.\nThese EVs are only an “alternative” to internal combustion for the very affluent — and the very indebted. For the average person hoping to reduce his cost to drive, they make as much sense as running marathons in OJ’s Bruno Maglis.\nAs regards the indictments:\nIf one were going to design an electric car with the object being to make it as efficient as possible, a design criteria would be to make it as light as possible. A really light EV chassis — around 1,200 pounds or so — would not require a 400 pound battery pack and you could use a much smaller and less energy-thirsty electric motor to propel it.\nAn EV based on these principles would be able to travel a reasonable distance without using much power. It might not be fancy — or fast — but it would be efficient. Wasn’t that the point?\nSuch EVs exist — and they are affordable — but Uncle has forbidden their use on public roads, which has made them useless except as buggies in retirement communities and golf carts on the green and such.\nThey are not “safe,” you see.\nWell, not actually. They just haven’t — and can’t — pass Uncle’s crash-test rigmarole.\nBecause they are light.\nThat doesn’t make them unsafe, however. It just means they’re… light. So are motorcycles and for that matter, most aircraft.\nWhich is why they are efficient.\nIt’s true you are more vulnerable if you wreck. The same could be said of an old VW Beetle or any other small, light — and efficient/affordable car such as you used to be able to buy but can’t anymore.\nThe effect of these “safety” regs has been to make all cars — not just EVs — much heavier and by dint of that, less efficient. But it really hits EVs hard because of the Extrapolation Effect. A heavy EV needs a bigger (and so, heavier) battery pack and that makes it progressively less efficient — and more expensive.\nThis is why the mutated EVs for “sale” today emphasize everything except efficiency. Teslas notoriously tout how quick they are — and how luxurious and “tech.” All of which is great, provided the object of the exercise isn’t efficiency.\nIt is hard to decide which is the greater crime:\nUncle’s regulatory stymying of the development of efficient, sensible electric cars — or his market manipulations, which have created artificial incentives for the development of electric cars that make no sense at all.","url":"https://spectator.org/electric-cars-the-real-killers/"}
