{"authors":["Harry Pettit For Mailonline"],"date_download":"2018-10-23 01:27:42","date_modify":"2018-10-23 01:27:42","date_publish":"2017-03-16 11:25:33","description":"The finding from scientists at the University of Kansas could help researchers develop new materials that will one day be used to craft super efficient electronics and solar panels.","filename":"data/vaneerConsumption/Electronsusequantumleapstojumpbetweenatomiclayers.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E531F7300000578-0-image-a-8_1489660650317.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4319498_Electrons-use-quantum-leaps-jump-atomic-layers_1540258062.html","title":"Electrons use quantum leaps to jump between atomic layers","title_page":"Electrons use quantum leaps to jump between atomic layers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scientists have discovered a bizarre form of quantum movement in the electrons that orbit atoms.\nElectrons swirl around atoms in layers, and new research shows that electrons can teleport from one layer to another using quantum motion.\nElectrons were caught disappearing from the top layer of an atom and reappearing on the bottom layer a fraction of a second later, without any evidence of existing in between.\nThe find could help researchers to develop hyper-efficient solar panels and batteries.\nScroll down for video\nIllustration of laser beam triggering quantum movement of electrons between top and bottom layers, bypassing the middle layer. The new tri-layer material created by the team could lead to the next-generation of electronics and solar panels\nWHAT IS QUANTUM MECHANICS? Quantum mechanics refers to the branch of physics that deals with the tiny, 'subatomic' particles - including electrons. When looked at through the lense of classical mechanics, these particles do not move in a predictable way like a car or meteor. In classical mechanics, objects exist in a specific place at a specific time. But in quantum mechanics, particles can exist in a haze of probability - there is a chance they will be at point A and a different chance it will be at point B etc. Particles can therefore 'exist' in two places at the same, making them very difficult to study.\nThis is because the strange phenomenon could be used to create new 'van der Waals materials', which combine state-of-the-art nanomaterials to create useful new properties.\nThese properties would use mysterious quantum forces to craft innovative new materials with super properties.\nCommon sense might dictate that for an object to move from one point to another, it must go through all the points on the path.\n'In basketball, when someone dunks the ball from above to below the rim, the ball must be in the hoop at some point in time,' said Dr Hui Zhao, associate professor of physics & astronomy at the University of Kansas.\nBut electrons in the quantum world don't follow such common-sense rules.\n'Electrons can show up on the first floor, then the third floor, without ever having been on the second floor,' Dr Zhao said.\nThe Kansas team observed the 'counter-intuitive' motion of electrons during their experiments for the first time.\n'In a sample made of three atomic layers, electrons in the top layer move to the bottom layer, without ever being spotted in the middle layer,' said the KU researcher.\nBecause this sort of 'quantum' transport is very efficient, Dr Zhao said it can play a key role in a new type of man-made material called 'van der Waals materials'.\nThese materials could be used in super efficient solar cells and electronics.\nBall-and-stick model of superconductor magnesium diboride. Electrons (green) exist across several layers around the boron and magnesium atoms (pink). The new research shows that these electrons can jump from the top to bottom layer without passing through the middle\nThe KU research team fabricated the sample by using the 'Scotch tape' method.\nThis method uses single-molecule layers lifted from a crystal with tape that are then studied under a microscope.\nThe sample contained layers of three semiconductor materials known as MoS2, WS2 and MoSe2.\nEach layer was thinner than one nanometer - about half the diameter of a DNA helix.\nAll three of the different semiconductor layers respond to different colours of light.\nBased on that, the researchers used a laser pulse to free up some of the electrons in the top MoSe2 layer so they could move easily.\n'The colour of the laser pulse was chosen so that only electrons in the top layer can be liberated,' Dr Zhao said.\n'We then used another laser pulse with the 'right' colour for the bottom MoS2 layer to detect the appearance of these electrons in that layer.'\nThe team found electrons move from the top to the bottom layer in about one picosecond - a million, million times faster than a second.\nThe finding could help researchers to develop new single-atom layer super materials, such as graphene. These materials could be used to create super efficient electronics and solar panels in future. (Pictured: graphic illustration of one layer of graphene)\nGRAPHENE APPLICATIONS - Researchers can use the Kansas team's quantum transport research to help them develop new single-atom layer super materials. - Graphene in one example of these materials used in material research today. - In May 2016 a Chinese company created bendable smart phones made from graphene that could be worn like a futuristic bracelet. - Graphene is also being used to fight superbugs: In March this year it was found that the wonder material could be used to fight infections if coated on surgeons' tools because of its germ-killing properties. - Ribbons of the high tech material could even be strapped to plane wings to keep them free of ice in flight: In January 2016 scientists from Rice University proved that the material has electrothermal properties.\n'If electrons were things that followed \"common sense,\" like so-called classical particles, they'd be in the middle layer at some point during this one picosecond,' Dr Zhao said.\nBut the researchers monitored the middle layer and found no electrons.\nDr Zhao claims that their observations of 'quantum transport' of electrons between atomic layers is encouraging news for researchers developing new materials.\n'The Stone Age, Bronze Age and Iron Age - materials have been the defining element of human history,' he said.\n'The modern information-technology age is largely based on silicon, which is a result of many decades of material research focussed on finding new materials and developing better techniques to make them with high quality and low cost.'\nDr Zhao said tiny, two-dimensional materials, formed by just a single layer of atoms or molecules, are the future of technology.\n'The most well-known example is graphene, a single layer of carbon atoms,' he said.\n'So far, about 100 types of two-dimensional materials have been discovered, such as the three used in this study.\n'Because these atomic layers can be stacked, they open up an entirely new route to make new functional materials.'\nThe researcher said his team's work focussed on a key requirement for the use of these materials in electronic and optical applications: Electrons must be able to move between these atomic layers efficiently.\n'This study showed electrons can transfer between these layers in a quantum fashion, just like in other conductors and semiconductors,' he said.","url":"https://www.dailymail.co.uk/sciencetech/article-4319498/Electrons-use-quantum-leaps-jump-atomic-layers.html"}
