{"authors":["Associated Press"],"date_download":"2018-10-22 22:54:17","date_modify":"2018-10-22 22:54:17","date_publish":"2016-01-28 11:19:57","description":"STOCKHOLM (AP) — Swedish home appliance maker Electrolux says it fell to a 393 million kronor ($46.1 million) loss in the fourth quarter from a 970 million k...","filename":"data/vaneerConsumption/ElectroluxreportsQ4lossafterfailedbidforGE.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420670_Electrolux-reports-Q4-loss-failed-bid-GE_1540248857.html","title":"Electrolux reports Q4 loss after failed bid for GE","title_page":"Electrolux reports Q4 loss after failed bid for GE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Electrolux reports Q4 loss after failed bid for GE\nSTOCKHOLM (AP) — Swedish home appliance maker Electrolux says it fell to a 393 million kronor ($46.1 million) loss in the fourth quarter from a 970 million kronor profit a year earlier after it failed in its bid for General Electric Co.'s appliance business.\nThe world's second-largest appliance maker after U.S rival Whirlpool, Electrolux said sales rose only 1 percent to 31.8 billion kronor ($3.7 billion).\nEarlier this month, CEO Keith McLaughlin said he would retire Feb. 1, and would be replaced by Jonas Samuelson, current head of an Electrolux division for Europe, Middle East and Africa area.\nElectrolux said Thursday Dan Arler had been tapped to become head of its European appliances unit, while Alan Shaw was named new head of Electrolux's North American unit.\n\"It is now time for me to pass the baton,\" McLaughlin said as he presented his last earning report at the head of the Stockholm-based group, whose brands also include AEG, Zanussi and Frigidaire. He said he would return to his family in the U.S.\nIn December, GE pulled out of a deal to sell its appliance business to the Swedish company for $3.3 billion after U.S. antitrust regulators had opposed it. China's Haier Group bought GE's appliance business for $5.4 billion to expand its U.S. and global presence. The acquisition came as Haier tries to transform itself into a premium brand.","url":"https://www.dailymail.co.uk/wires/ap/article-3420670/Electrolux-reports-Q4-loss-failed-bid-GE.html"}
