{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 01:51:00","date_modify":"2018-10-23 01:51:00","date_publish":"2017-03-10 10:21:59","description":"Villagers said the elephant had left the Walayar Forest in desperate search for water, taking out anything in its path as it bulldozed into a nearby house in Kerala, India.","filename":"data/vaneerConsumption/Elephantchargesatmotorcyclistandsmashesintoahouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E2218D100000578-0-image-a-19_1489140217490.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300588_Elephant-charges-motorcyclist-smashes-house_1540259460.html","title":"Elephant charges at motorcyclist and smashes into a house","title_page":"Elephant charges at motorcyclist and smashes into a house  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the heart-stopping moment a rampaging elephant charged at a motorcyclist before smashing into a nearby house.\nFootage showed the enraged mammal wreaking a path of destruction in Kanjicude village in Kerala, India, after wandering in from the wild.\nVillagers said the elephant had left the Walayar Forest in desperate search for water, taking out anything in its path.\nThis is the heart-stopping moment a rampaging elephant charged at a motorcyclist before smashing into a nearby house in Kerala, India\nThe thirsty elephant charged at anyone in sight before bulldozing the wall of a house.\nFrightened locals can be heard in the video saying: 'How did it come here?\n'Don't make any noise, let it go. Keep quiet! Keep quiet!'\nThe video, which was shot from the home of a local resident, shows the battered motorcyclist escaping the elephant on foot deserting his bike.\nFootage showed the enraged mammal wreaking a path of destruction in Kanjicude village in Kerala, India, after wandering in from the wild\nVillagers said the elephant had left the Walayar Forest in desperate search for water, taking out anything in its path\nResidents were warned of the elephants' imminent arrival and were advised to remain indoors.\nDamage was done to the street but there were fortunately no casualties of the raging Ellie.\nIt comes as the latest studies reveal that more than 30,000 elephants are slaughtered each year for their ivory.\nThe staggering rate has reduced the elephant population from ten million at the start of the 20th century to just over 400,000 today.\nPoaching is now at such an unprecedented level that elephants are being killed at a rate of one every 15 minutes.","url":"https://www.dailymail.co.uk/news/article-4300588/Elephant-charges-motorcyclist-smashes-house.html"}
