{"authors":["Npr Staff"],"date_download":"2018-10-23 00:15:33","date_modify":"2018-10-23 00:15:33","date_publish":"2015-07-25 00:00:00","description":"It's been 50 years since Bob Dylan strolled on stage at the Newport Folk Festival, plugged in an electric guitar, and infuriated his flock. Historian Elijah Wald says there's much more to the story.","filename":"data/vaneerConsumption/ElijahWaldAuthorOfDylanGoesElectricNPR.json","image_url":"https://media.npr.org/assets/img/2015/07/21/26_dge_wide-0de020d2a762b70974171405e89afc977be9522a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_07_25_424977355_50-years-ago-bob-dylan-electrified-a-decade-with-one-concert_1540253733.html","title":"Elijah Wald, Author Of 'Dylan Goes Electric!' : NPR","title_page":"Interview: Elijah Wald, Author Of 'Dylan Goes Electric!' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"50 Years Ago, Bob Dylan Electrified A Decade With One Concert\nDylan Goes Electric! Newport, Seeger, Dylan, and the Night That Split the Sixties by Elijah Wald Hardcover, 354 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\nIn the early 1960s, burgeoning folk music scenes were burbling up all over the country, and the Newport Folk Festival was their confluence.\nBy the middle of the decade, the reigning king was a young Bob Dylan, the man who gave them the now-standards \"Blowin' in the Wind\" and \"The Times They Are a-Changin'.\" But on this day 50 years ago, Bob Dylan did the unthinkable, the unforgiveable: He plugged in an electric guitar, and he rocked hard.\nThe crowd was stunned. The folk faithful were betrayed by the man they considered the rightful heir to Woody Guthrie's throne. That's the mythology, anyway — but without question, it proved to be a major turning point in music history.\nMusic historian Elijah Wald has written a new book about that performance called Dylan Goes Electric!: Newport, Seeger, Dylan, and the Night that Split the Sixties. Speaking with NPR's Arun Rath, Wald says that if the audience had known just a little more about their hero's listening habits as a kid in Minnesota, his transformation at Newport '65 might not have come as such a shock. Hear the radio version at the audio link, and read more of their conversation below.\nArun Rath: Let's talk about the young Bob Dylan, or rather the young Robert Zimmerman. What kind of music was he consuming before he turned to folk?\nElijah Wald: He was an R&B fan. People often talk about him as a rock 'n' roll fan, but he was much more R&B. It's interesting: He was actually listening to a record program, his favorite program, that was beamed out of Shreveport, La., and that was specializing in things like B.B. King, Jimmy Reed, Bo Diddley, Chuck Berry. He was the kind of kid who went, \"Oh yeah, Elvis Presley, he's just imitating Clyde McPhatter.\" There's actually a take of him saying that back when he was in high school. Little Richard, incidentally, was his hero. He pounded piano and shouted like Little Richard and did the falsetto whoops and all of that.\nThat's one of the fascinating things in this book. I just thought the Bob Dylan thing had all kind of started with Woody Guthrie.\nWoody was a huge figure in his world, but it wasn't so much about Woody's songs. He liked Woody's songs, but it was [more about] Woody's book, Bound for Glory, and that whole idea of just the free spirit, rambling guitar player. It was the romantic attachment of that whole idea of getting out and singing the real people's music among the real people.\nYou write about Bob Dylan when he arrived in New York, and the scene in Greenwich Village. It's almost like he's trying on different personas — like you never know which Bob Dylan might show up.\nWell, people who knew Bob Dylan back in Hibbing, Minn. say he was already trying on personas. But, you know, that's not very unusual.\nHe was young!\nYeah, exactly. A guitar player and singer, 18, 19, 20 years old. It's very typical that you'll pick up a record and sound just like that record for two weeks, and then you'll pick up another record and sound like that for a while.\nHe was coming into Greenwich Village at a moment that was very exciting. There was music all over the place; there were all these people to learn from. Everybody who knew him then, you keep hearing: \"He was like a sponge.\" \"He was like a chameleon.\" He was changing incredibly quickly.\nThe folk scene that you write about from back then is a lot more diverse than I realized. There are even factions, in a way.\nThere always was friction in the folk scene between the people who really believed that this music should be done authentically, should be done right, and people who just thought, \"You know, this is fun music, let's do it however we want. Let's do it in ways that are fun.\" There were a lot of people on the purist side who thought the pop-folkies were taking great music and turning it into tripe. And there were plenty of people on the other side who thought the purists were being, you know, a bunch of silly prigs.\nThere's a point you return to in this book a number of times: that as far as Dylan's motivation, it wasn't like he wanted to lead the folk revolution. He didn't want to lead a movement.\nHe wasn't a movement kind of guy. I'm not going to say that he wanted to be a pop star, but he was not a joiner. He was not good with organizations. That's I think one of the things that was going on later in 1965: There was this feeling that it was all about, \"We're going to make a movement that's going to change the world.\" And he was all for changing the world, but he wasn't much for movements.\nEven so, he was still kind of a folk hero, and he was a smash at the Newport Folk Festival in his debut in 1962. Everything seemed to go great in 1963 as well. So what was behind the decision to front an electric band in 1965?\nI mean, what happened at Newport was much more complicated than just Bob Dylan plugging in an electric guitar. I sometimes make the analogy to, if you've seen Marlon Brando in The Wild One, where the motorcycle gang rides into the small town — the problem isn't that the people in the town hate motorcycles. The motorcycles are just part of what worries them about these guys who, essentially, they find threatening. The same was true for Dylan's electric guitar at Newport. There were other people playing electric guitars at Newport. But Dylan, as you say, had been seen as a hero and more than that. He was the man who had written one of the anthems of the freedom movement, and one of the people who was holding it all together to create this new world, this new youth movement that would change the world.The fact is, Dylan was not comfortable in that role, and by 1965, that role was feeling constricting and frightening to him, the fact that people were looking to him for answers.\nWhen he got on stage at Newport with that band, I think the way that story is often told is that there were all these traditionalist folkies, and they hated rock 'n' roll, and here he was playing rock 'n' roll and the stupid folkies were lost in the past. I'm not saying that's completely wrong, but there's the other side of it. It was a very tricky time: That was the weekend that Lyndon Johnson fully committed the United States to victory in Vietnam. The civil rights movement was falling apart. SNCC [The Student Non-Violent Coordinating Committee] — which was the group that had brought all the kids down for Freedom Summer the previous year — now was throwing all the white members out, and the new chant was \"black power.\" That communal feeling of the first half of the '60s was getting harder and harder to feel like it was all going to work and the world was going to be a better place. Dylan was someone a lot of people were looking to to hold that together — and instead, he comes out there with an electric band and doesn't say a word to them. Dylan was always somebody who had been very cheerful, friendly, chatting with the audience — doesn't say a word. And is playing the loudest music they've ever heard and screaming, \"How does it feel to be on your own?\" A lot of people were upset by that, and you can sort of see why.\nDid Dylan go into this planning to bring in the electric band and cause a splash? When did that decision actually take place?\nNo — one of the things about this story is that it was completely unplanned. Dylan had come to Newport like he always did, with an acoustic guitar, planning to sing his songs and go home. But, as it turned out, the Butterfield Blues Band was there, and Al Cooper was there, and Al Cooper and Mike Bloomfield — who had just joined the Butterfield band — were the main players on \"Like a Rolling Stone.\" He pulled it together at the last moment. They did one rehearsal the night before. It was a complete surprise. Dylan thought of it maybe 24 hours before everyone else heard it, but it was a surprise for him, too.\nYouTube\nYou say that the scene was not like the near-riot some people some people describe it as. How intense was the reaction? How much booing was there? How upset were people?\nThe reaction was very intense. How much booing there was is hard to say, because the fact is, they turned the microphones on stage way down because the band was so loud, so suddenly you can't hear the crowd during the electric set very much. But you can hear some people yelling, and you can hear what they're yelling. There are people yelling, \"Bring back Cousin Emmy,\" who was the hillbilly singer who had sung just before him, and \"I don't like your band,\" and \"Throw away that electric guitar,\" and \"Bring back Pete Seeger,\" and \"We want the old Dylan.\" You can also hear people yelling \"Beatles! Play the Beatles!\", and \"Cancel the rest of the show! Stay all night!\" It's a very mixed reaction.\nThere were people who loved it; this is another thing that people leave out of the story. There were probably thousands of people who were there just to see Dylan. They didn't care about the Newport Folk Festival. They loved his electric record. \"Like a Rolling Stone\" was just starting to climb the charts. He was a pop star. He hung out with the Beatles and The Rolling Stones. There were all these people who had come to Newport just to see Dylan, and they weren't always being very polite, so there was this feeling that the Folk Festival was turning into something else — maybe a pop festival, or maybe just a place where people went to get famous, rather than a place where they went to share music. In order to fight against that, the Newport Festival, carefully, was not giving anyone star treatment, so everyone who played that night was just supposed to play 12 minutes. They put Dylan on partway through the first half, and he sang three songs, and he left. That's when the place went completely nuts.\nBeyond the moment itself, that night took on cultural baggage pretty much right away, being taken as a defining moment for something; you could argue about what it was. But, now we actually have a nice tidy 50 years of distance from this, maybe some real perspective. So what did that moment mean for music, or for American culture?\nYou know, I called this book The Night That Split the Sixties. It's very easy to forget that all the things that we normally think of when we say the word \"sixties\" happened after 1965 — the Vietnam War, the hippies, the drugs. The Beatles hadn't even yet done Rubber Soul; they were still a fun pop group. All of that stuff, that's really the break that happens right at this. And I'm not saying at all that it happened because Dylan went electric, but it's a real good marker for the divide between what had been the first half of the '60s and what was coming.","url":"https://www.npr.org/2015/07/25/424977355/50-years-ago-bob-dylan-electrified-a-decade-with-one-concert"}
