{"authors":[],"date_download":"2018-10-22 20:01:55","date_modify":"2018-10-22 20:01:55","date_publish":"2016-01-28 00:00:26","description":"New York Giants quarterback Eli Manning says he does not know if older brother Peyton plans to retire after the Super Bowl, but Eli hopes Peyton \"can go out ...","filename":"data/vaneerConsumption/EliManningwantsPeytonSuperBowlwinsohecangooutontop.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g4wb-4vVdYopwYQ7f641721b07a6936e2-146_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420108_Eli-Manning-wants-Peyton-Super-Bowl-win-top_1540238515.html","title":"Eli Manning wants Peyton Super Bowl win so he can 'go out on top'","title_page":"Eli Manning wants Peyton Super Bowl win so he can 'go out on top' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eli Manning wants Peyton Super Bowl win so he can 'go out on top'\nNew York Giants quarterback Eli Manning says he does not know if older brother Peyton plans to retire after the Super Bowl, but Eli hopes Peyton \"can go out on top.\"\nThe elder Manning will become the oldest starting quarterback in Super Bowl history at age 39 when he guides the Denver Broncos against the Carolina Panthers in the NFL's championship spectacle on February 7 at San Francisco.\nAnd Eli Manning, who has won two Super Bowl titles to one for Peyton, is among those who gets the feeling that Super Bowl 50 might be the moment when his five-time NFL Most Valuable Player sibling hangs up his helmet for good.\nQuarterback Peyton Manning of the Denver Broncos and brother quarterback Eli Manning #10 of the New York Giants shake hands after a game on September 15, 2013 in East Rutherford, New Jersey ©Ron Antonelli (Getty/AFP/File)\n\"He has not said anything to me about it,\" Eli Manning said Wednesday. \"But I think I kind of may think like everybody else, where you see this as possibly being the last game. I don't know if he knows himself or if he's thought about it. But when you get to Year 19 and you deal with some injuries and things going on ... it would be a good way to go out.\n\"I don't know if it is, but because of that possibility, I hope he can win this game. And if he decides to hang it up, he can go out on top.\"\nManning was caught telling New England Patriots coach Bill Belichick this could be his \"last rodeo\" after Denver's 20-18 victory over the Patriots in the American Football Conference final.\nEli Manning led the Giants to Super Bowl wins in 2008 and 2012, both times over New England, while Peyton guided his former club, the Indianapolis Colts, to a 2007 triumph over Chicago. Peyton was on the losing end to New Orleans in 2010 with the Colts and routed by Seattle with Denver two years ago.\n\"There's no bragging rights,\" Eli said of the Manning family rivalry. \"We both know that it's a team effort and about everything going the right way. One player can't control the outcome of a whole season or a certain game because of other circumstances. So I've never mentioned that, or we've never compared who has more rings. Never been a discussion or come up in any way.\"\nPeyton Manning missed six regular-season games this season due to injuries, returning to the lineup to direct a season-ending victory over San Diego that gave Denver a home-field playoff edge.\nPeyton agreed to a $4 million pay cut last March but earned back half that amount for reaching the Super Bowl. He gets $2 million more back with a victory over the Panthers, boosting his salary for the campaign to $19 million.\nEli Manning said his brother's legacy doesn't depend upon a victory, although Peyton would join Jim Kelly, John Elway and Fran Tarkenton as the only quarterbacks to lose three Super Bowls if Carolina beats Denver next week.\n\"Peyton and his impact on the game of football will not be determined and based off this one game,\" Eli Manning said. \"He has kind of, in a lot of ways, changed the game with the no-huddle offense they had in Indianapolis for so long.","url":"https://www.dailymail.co.uk/wires/afp/article-3420108/Eli-Manning-wants-Peyton-Super-Bowl-win-top.html"}
