{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-22 23:19:10","date_modify":"2018-10-22 23:19:10","date_publish":"2017-04-26 07:15:30","description":"She stars as Offred in highly-anticipated TV series, The Handmaid's Tale - and Elisabeth Moss looked incredible when she attended the LA premiere on Tuesday.","filename":"data/vaneerConsumption/ElisabethMossandAlexisBledelatHandmaidsTale.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F1ECF00000578-0-image-a-32_1493203624378.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446238_Elisabeth-Moss-Alexis-Bledel-Handmaid-s-Tale_1540250350.html","title":"Elisabeth Moss and Alexis Bledel at Handmaid's Tale","title_page":"Elisabeth Moss and Alexis Bledel at Handmaid's Tale | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She stars as Offred in highly-anticipated TV series, The Handmaid's Tale - and Elisabeth Moss looked incredible when she attended the LA premiere on Tuesday.\nThe 34-year-old wore a plunging dress which was emblazoned with swallows as she walked the red carpet in Los Angeles, along with her co-star Alexis Bledel.\nShe teamed the number with a pair of strappy heels and wore her hair in a retro style that her Mad Men character Peggy would be proud of.\nScroll down for video\nWonder women: Elisabeth Moss (left) stunned in a plunging swallow-themed dress as she joined Alexis Bledel (right) at the LA premiere of The Handmaid's Tale on Tuesday night\nHer signature red lip looked stunning and added a pop of colour to her pretty ensemble.\nIn the TV series, Elisabeth's character Offred, who sleeps with The Commander, played by Joseph Fiennes, while his wife is present.\nShe is forced to do so in hopes bear them a child during the harrowing storyline.\nLooking good: Her signature red lip looked stunning and added a pop of colour to her pretty ensemble\nHarsh: Elisabeth's character Offred, who sleeps with The Commander, played by Joseph Fiennes, while his wife is present. She is forced to do so in hopes bear them a child\nAlexis meanwhile, stars as Ofglen, a neighboring fellow handmaid to Offred, the protagonist of the story.\nThe 35-year-old looked far from her character as she was nothing short of glamorous at the Hulu show's Hollywood premiere.\nThe Gilmore Girls star was styled in a sparkly, '90s-inspired halter dress, which was a severe contrast to her character's period clothing.\nSpring style! In contrast with her frock's dark color, Alexis accessorized with bright spring shades, choosing a soft yellow for her strappy Schutz heels and a pale blue for her clutch\nHer role: Alexis is seen in character as Ofglen on her Hulu TV show\nIn contrast with her frock's dark color, Alexis accessorized with bright spring shades, choosing a soft yellow for her strappy Schutz heels and a pale blue for her clutch.\nThe mom-of-one wore her chestnut brown locks loose and down.\nFor make-up, the blue-eyed beauty played up her pretty peepers with liner. Her lips, in contrast, were toned down with a neutral shade.\nThe woman behind the fiction: While at the premiere, the actress greeted the story's author Margaret Atwood, 77\nThe Handmaid's Tale is based on a book by Canadian author Margaret Atwood, 77.\nThe fiction piece tells of a society that is overtaken by a totalitarian cult.\nThe women who are assigned as handmaids are there simply to reproduce.\n'I think it's a timely project, no matter who you are. I think everyone's going to be able to take something away from it that is really resonate and probably a bit emotional,' she told E! News.\n'And when it comes to being a young mother and dealing with subject matter like a dystopian future, well, 'It brings everything into focus, right?\n'It's a time in your life when you only want to leave home to work if you absolutely love the project and feel it's important.'\nStatement shirt: Martha Plimpton wore a grey T-shirt with Feminist in gold lettering along with a white jacket and white trousers to the premiere","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446238/Elisabeth-Moss-Alexis-Bledel-Handmaid-s-Tale.html"}
