{"authors":[],"date_download":"2018-10-30 14:33:08","date_modify":"2018-10-30 14:33:08","date_publish":"2015-05-28 00:00:00","description":null,"filename":"data/vaneerConsumption/ElizabethWarrenunhappythegovernmentdoesntborrowandspendmoney.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_elizabeth_warren_unhappy_the_government_doesnt_borrow_and_spend_money_comments_1540909988.html","title":"Elizabeth Warren unhappy the government doesn't borrow and spend money","title_page":"Blog: Elizabeth Warren unhappy the government doesn't borrow and spend money","title_rss":"NULL","source_domain":"americanthinker.com","text":"In an incredible exchange with a liberal drone in Silicon Valley, Elizabeth Warren made it appear that she was unaware that the federal government borrows and spends money: A conference attendee asked Sen. Warren, a Massachusetts Democrat, a fairly straightforward question: Why isn't the government, with interest rates so low and the country so obviously in need of infrastructure and other investments, doing the common-sense thing, which would be to borrow money at those low rates and invest? \"We are not doing it because the people in Washington – too many of the people in Washington – do not represent the folks who elected them. They represent the rich and the powerful, who don't want their taxes raised,\" Warren said. As of this writing, our federal debt was over 18 trillion dollars, and our unfunded obligations are probably in the neighborhood of 200 trillion dollars. We borrow hundreds of billions of dollars because of... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/elizabeth_warren_unhappy_the_government_doesnt_borrow_and_spend_money_comments.html"}
package (which, of course, spent nearly nothing on infrastructure).\nI never took Senator Warren's class on bankruptcy law when she taught at Harvard Law School (bankruptcy law didn't sound very fun), but I appreciate the irony of someone teaching such a course who has no understanding of what causes bankruptcy in the first place. (I did see her – and Obama – around campus from time to time. She always had an owlish expression on her face, as if she had been sucking on lemon candies.)\nI don't honestly believe that Senator Warren is unaware that the government is borrowing money to finance spending. But I do honestly believe that she considers the massive deficit spending we are now engaged in as insignificant. Obama has massively increased spending and massively increased deficits; on economics alone, he's a far-left radical. But Warren makes Obama look like a moderate. She's an extremist, even compared to other extremists.\nShe's got her Marxist jargon down right, though. The problem isn't government, but the \"rich\" who don't want their taxes raised. The people who earn money are the evil ones, and the virtuous ones are those who take it away.\nYou know, I looked up her bio on Wikipedia. Her entire life has been cushy teaching jobs and government positions. She's never really worked in the private sector, and she has no comprehensions of the risks and difficulties of starting a business. But the level of her extremism, even by the newly raised bar created by Obama's irresponsibility, is still quite striking. As Mark Levin says, \"the left never has enough; the left is never done.\"\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/05/elizabeth_warren_unhappy_the_government_doesnt_borrow_and_spend_money.html"}
