{"authors":["Caroline May"],"date_download":"2018-10-30 21:18:15","date_modify":"2018-10-30 21:18:15","date_publish":"2016-02-02 18:32:59","description":"Sen. Elizabeth Warren (D-MA) is continuing to keep her powder dry this Democratic primary but signaled an endorsement could be on the way. |","filename":"data/vaneerConsumption/ElizabethWarrenCoyonPossiblePostIowaEndorsementWellSee.json","image_url":"https://media.breitbart.com/media/2015/12/o-ELIZABETH-WARREN-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_02__1540934295.html","title":"Elizabeth Warren Coy on Possible Post-Iowa Endorsement, ‘We’ll See’","title_page":"Elizabeth Warren Coy on Possible Post-Iowa Endorsement, ‘We’ll See’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Elizabeth Warren (D-MA) is continuing to keep her powder dry this Democratic primary but signaled an endorsement could be on the way.\nThe junior Massachusetts senator declined to tell reporters Monday night before the Iowa caucuses who she will support or when she will announce that endorsement this cycle, according to MassLive.\n“No endorsements now,” she said, according to the outlet, following an open house in Springfield, MA.\nWarren added “we’ll see” when asked about a possible post-Iowa endorsement.\nThe only female Democratic senator who has not endorsed Hillary Clinton this election cycle expressed confidence in the Democratic field but would still not tip her cards about possible endorsements.\n“I think that what the Democrats are doing is terrific. We’re out talking about the issues,” Warren said, according to MassLive. “I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”\nThe critic of big business and Wall Street has declined to throw her support to any presidential candidate for months. When pressed by reporters about Clinton’s Wall Street connections, Warren offered a more broad-reaching answer — saying she’s worried about everybody’s Wall Street ties.\n“This is a rigged game and it’s rigged because Wall Street makes sure that in every decision that gets made they’re there,” she said according to MassLive. “They make sure they’ve got their lobbyists and their lawyers so that everything tilts just a little bit more their direction. This is what I’m fighting everyday in the United States Senate.”\nWhile Clinton has received dozens of Senate endorsements, Sanders has yet to receive one.\nClinton eked out a win in Iowa Monday night, Bernie Sanders came in a razor-close second, and Martin O’Malley suspended his presidential campaign.","url":"https://www.breitbart.com/politics/2016/02/02/elizabeth-warren-coy-on-possible-post-iowa-endorsement-well-see/"}
