{"authors":["Dan Riehl"],"date_download":"2018-10-30 19:44:08","date_modify":"2018-10-30 19:44:08","date_publish":"2015-01-13 01:37:40","description":"Sen. Elizabeth Warren is strongly opposed to Lazard investment banker Antonio Weiss getting a senior spot with the US Treasury Department.","filename":"data/vaneerConsumption/ElizabethWarrenBestsObamaonTreasuryDepartmentNominee.json","image_url":"https://media.breitbart.com/media/2014/12/elizabeth-warren-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_12__1540928648.html","title":"Elizabeth Warren Bests Obama on Treasury Department Nominee","title_page":"Elizabeth Warren Bests Obama on Treasury Department Nominee | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Elizabeth Warren (D-MA) is strongly opposed to Lazard investment banker Antonio Weiss getting a senior spot with the US Treasury Department. To avoid a bruising confirmation that may have bolstered Warren’s profile at the expense of the Obama White House, Weiss has asked that his name be withdrawn and is settling for a less lofty spot.\nNow, “Weiss will be circumventing Senate confirmation and accepting a different job with lesser authority at the Treasury, as a counselor to Treasury Secretary Jack Lew.” This is despite the fact that many Democrats feel Weiss is well-suited for the more senior position.\nA number of former Treasury officials thought Warren was way out of line, and that Weiss’ experience was perfect for the position he was being nominated for.\nFor its part, the White House was reportedly standing by Weiss. That’s reflected in this statement from last month: “This is somebody who has very good knowledge of the way that the financial markets work, and that is critically important.” However, with Warren on the warpath against Weiss, evidently that wasn’t enough.\nOn Monday, the WH released the following statement.","url":"https://www.breitbart.com/politics/2015/01/12/elizabeth-warren-bests-obama-on-treasury-department-nominee/"}
