{"authors":["Sean Moran"],"date_download":"2018-10-30 20:43:28","date_modify":"2018-10-30 20:43:28","date_publish":"2018-10-30 18:26:13","description":"Jon Tester broke ranks with fellow Senate Democrats and said that Sen. Elizabeth Warren’s (D-MA) DNA results do not “pass the test.”","filename":"data/vaneerConsumption/ElizabethWarrensDNAResultsDoNotPasstheTest.json","image_url":"https://media.breitbart.com/media/2018/10/elizabeth-warren-4.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30__1540932208.html","title":"Elizabeth Warren’s DNA Results Do Not ‘Pass the Test’","title_page":"Dem Jon Tester: Elizabeth Warren’s DNA Results Do Not ‘Pass the Test’","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Jon Tester (D-MT) broke ranks with fellow Senate Democrats on Tuesday and said that Sen. Elizabeth Warren’s (D-MA) DNA results do not “pass the test.”\nThe Montana Democrat chided the Massachusetts Democrats, suggesting that Warren’s DNA test does not make her a Native American.\n“I don’t think that would pass the test, no,” Tester said. The Montana senator also noted that the fight between President Donald Trump and Warren ignores the more significant issues facing Native Americans.\n“I don’t think that’s where we need to go,” Tester, a member of the Senate Indian Affairs Committee, said. “That’s a fight between her and Trump and she can continue to have that fight. The real issue here are the challenges in Indian country, especially the tribes that don’t have gaming.”\n“The real issue that revolves around Native American people is poverty, and unless you’re a gaming tribe, it’s a problem, and we’ve got to figure our solutions to get it fixed,” the Democrat added.\nNative Americans make up roughly 8.6 percent of Montana’s total population; Tester said that the Indian population could decide whether he or Republican challenger Matt Rosendale wins November’s Montana Senate race.\n“Bottom line, Indian Country is going to decide who wins the election,” Tester said.\nOn Monday, Crow Tribal chairman A.J. Not Afraid endorsed Matt Rosendale for U.S. Senate.\n“In order for the longevity of the tribe, to surpass my life existence, we need to do something about it now – fits the direction of Rosendale and President Trump,” Not Afraid said in a statement on Monday. “Fits the agenda of the Crow Tribe, both domestically and internationally. … That agenda fits the Crow today, to side with the Administration and Matt Rosendale.”\nI’m humbled to have the support of the Crow Tribe! Thank you for this invitation to speak and visit with all of you today! #mtsen #mtpol pic.twitter.com/JpYnyO4mdT — Matt Rosendale (@MattForMontana) October 30, 2018\nRosendale said in a statement on Monday:\nI will be a true friend, listen, and always be there for the Crow people. Montana’s tribes are a critical part of the state and I pledge to work together to help build a better future with more jobs, economic opportunities, and better health care for the Tribal nations, and I will be there to hold the federal government accountable when they’re not doing their job and delivering on their promises.\nAnother Senate Democrat, Sen. Claire McCaskill (D-MO), condemned Warren and Sen. Bernie Sanders (I-VT), claiming that she is “not one of those crazy Democrats.”\nTester has tried to reassure his base amidst polls that show a tightening gap between him and Rosendale. A Gravis Marketing poll released on Tuesday found that Tester’s lead in the Montana Senate race has slipped to a statistical tie.\nLast week, Tester also tried to appeal to his Montana values during the Senate race, touting his love of hunting, despite not having a Montana hunting license in six years—the last time he ran for office.\n“It’s pretty disingenuous to see Jon Tester talk about the importance of hunting when he’s rarely had a hunting license,” Rosendale said in September. “It’s not surprising though, Jon Tester has changed. He left behind his Montana values a long time ago.”","url":"https://www.breitbart.com/politics/2018/10/30/democrat-jon-tester-elizabeth-warrens-dna-results-do-not-pass-test/"}
