{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 01:52:24","date_modify":"2018-10-23 01:52:24","date_publish":"2016-01-28 16:19:29","description":"The 17-year-old was spotted stepping outside of the nail salon in Los Angeles on Wednesday.","filename":"data/vaneerConsumption/ElleFanninghidesherfacewithhelpofagreencapassheexitsnailsaloninLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB17E500000578-0-image-a-18_1453992935252.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421146_Going-undercover-Elle-Fanning-hides-face-help-pulled-green-cap-exits-nail-salon-LA_1540259544.html","title":"Elle Fanning hides her face with help of a green cap as she exits nail salon in LA","title_page":"Elle Fanning hides her face with help of a green cap as she exits nail salon in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Elle Fanning seemed to be going undercover on Wednesday.\nThe Maleficent star was spotted with her green cap pulled down low over her face as she exited a nail salon in Los Angeles.\nThe 17-year-old actress was on a break from shooting the Ben Affleck film Live By Night.\nPutting her best foot forward! Elle Fanning stepped out of a pedicure appointment in Los Angeles in a pair of disposable flip flops and toe separators\nElle teamed her summery pink top with a pair of slouchy Capris jeans\nThe fresh face actress wore her bright blonde hair down in its natural waves.\nElle looked thoroughly relaxed as she stepped out following her pampering session, her trusty high-tech phone in hand.\nThough she appeared solo, the actress was spotted chatting with someone, growing animated as she pointed towards the distance.\nKeeping it casual: The 17-year-old made do with a pink and white top with Capri jeans\nTop it off: The actress polished off the look with a playful hat that was worn over her bright blonde hair\nElle has been carving out a name for herself in the movie industry with leading roles in previous films that include Maleficent and Young Ones.\nWith a thriving career in the film industry, the teen recently discussed how she has had to put college plans on pause.\n'I thought more, and I'm like, Eh. I don’t think it’s for me.' she told Teen Vogue in 2015. 'That sounds weird because I feel like every- body goes to college. Maybe I'll just wait. I'm already doing what I want to do, so why can’t I just...?'\nHard at work: The We Bought A Zoo starlet has just finished shooting the film How to Talk to Girls at Parties, which is slated for release this year\nThe younger sister of Dakota Fanning is busy as usual, having finished shooting the film How to Talk to Girls at Parties, which is slated for release this year.\nElle stars as Zan, an alien touring the galaxy who breaks away from her group to pursue true love with Enn, played by Alex Sharp.\nThe award-winning actress has also been shooting on the Hollywood set of Live By Night, a 1920s period film.\nLive By Night is scheduled for release in 2017.\nKeeping busy! The award-winning actress has also been shooting on the Hollywood set of Live By Night, a 1920s period film","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421146/Going-undercover-Elle-Fanning-hides-face-help-pulled-green-cap-exits-nail-salon-LA.html"}
