{"authors":["Emily Mae Czachor"],"date_download":"2018-10-31 00:01:56","date_modify":"2018-10-31 00:01:56","date_publish":"2018-10-28 20:18:49","description":"A lot has changed since Ellen Pompeo and Chris Ivery said \"I do\" before a Manhattan City Hall officiator way back in 2007. (Very Meredith Grey of them, no?) But Ellen Pompeo's latest comments on her husband — which she shared with audience members…","filename":"data/vaneerConsumption/EllenPompeosCommentsOnHerHusbandShowJustHowStrongTheirMarriageIs.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/0033ce90-2b22-47a4-9361-0d3564a570e8-getty-1052785988.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ellen-pompeos-comments-on-her-husband-show-just-how-strong-their-marriage-is-13010835_1540944116.html","title":"Ellen Pompeo's Comments On Her Husband Show Just How Strong Their Marriage Is","title_page":"Ellen Pompeo's Comments On Her Husband Show Just How Strong Their Marriage Is","title_rss":"NULL","source_domain":"bustle.com","text":"A lot has changed since Ellen Pompeo and Chris Ivery said \"I do\" before a Manhattan City Hall officiator way back in 2007. (Very Meredith Grey of them, no?) But Ellen Pompeo's latest comments on her husband — which she shared with audience members at Marie Claire's Power Trip conference over the weekend, according to People — prove Ivery isn't threatened by his wife's professional successes, enormous as they've become.\n\"My husband is not at all intimidated by my drive, or my bossiness,\" Pompeo said during the event, which focused on women's empowerment and encouraged attendees to share their own experiences. Of course, just because Ivery isn't intimidated by his partner's passion — and determination to see that passion through — doesn't mean the guy deserves an award or anything. After all, the fact that Pompeo is driven and \"bossy\" (which, honestly, probably just means she's got a penchant for leadership at work and at home) really shouldn't be cause for intimidation, when you think about it.\nUnfortunately, there are lots of successful women out there who know full-well that just because it shouldn't be, definitely doesn't mean that it isn't. So, even if Pompeo might not be experiencing the consequences of a \"fragile male ego\" (to borrow the actor's turn of phrase, per People's new report) in her marriage, it still feels incredibly important that she's talking about it. Especially given the fact that, when it comes to navigating big-time success, Pompeo is literally a professional.\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nSpeaking to the Power Trip event's audience, Pompeo reaffirmed what most of us pop culture devotees probably knew already:\n\"I never thought I'd be at the height of my career at 48 years old. I'm at the top of my game, with no end in sight.\"\nAgain, pretty much anyone who's been following Pompeo's name in the news this past year has known that to be true for quite some time. Back in January, the longtime Grey's Anatomy lead finally scored the major salary boost she'd been vying for since Derek was still alive, according to The Hollywood Reporter. \"For me, Patrick [Dempsey] leaving the show was a defining moment, deal-wise,\" Pompeo told the magazine, adding that,\n\"They could always use him as leverage against me — 'We don't need you; we have Patrick' — which they did for years.\"\nPatrick Dempsey left Grey's for good in 2015, which means Pompeo's salary negotiations had probably been in the works for something like three years before she eventually saw her rightful payoff. That said, in 2018, she definitely did. Per her January conversation with THR, it was revealed that Pompeo will earn roughly $20 million annually for her role on Grey's moving forward, making her the highest-paid female actor on any TV drama.\nIn light of all that, Pompeo told the Power Trip conference audience that \"it's really important for men to be on board\" with her success, according to People's report. Luckily, if her comments about Ivery are any indication, it does sound like her husband, at least, is very much on board with Pompeo's powerhouse career trajectory. Which, from the looks of it, seems to have no limit. Here's to hoping other men with similarly strong, empowered wives take notice of Ivery and Pompeo's ostensibly healthy relationship dynamics — and take note accordingly.","url":"https://www.bustle.com/p/ellen-pompeos-comments-on-her-husband-show-just-how-strong-their-marriage-is-13010835"}
