{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-22 21:03:58","date_modify":"2018-10-22 21:03:58","date_publish":"2016-01-11 00:03:22","description":"They reportedly ended their two-year romance in December - but Ellie Goulding and Dougie Poynter appear to be back on track.","filename":"data/vaneerConsumption/EllieGouldingandDougiePoynterlookliketheyarebackontogether.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/21/3000A17E00000578-0-image-a-97_1452462211593.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3392968_Ellie-Goulding-Dougie-Poynter-look-like-together_1540242238.html","title":"Ellie Goulding and Dougie Poynter look like they are back on together","title_page":"Ellie Goulding and Dougie Poynter look like they are back on together | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They reportedly ended their two-year romance in December - but Ellie Goulding and Dougie Poynter appear to be back on track.\nThe two musicians, both aged 28, were pictured picking up a late night spot of shopping from their local Waitrose on Thursday.\nWhile they could just be friends, Dougie appeared keen to keep a low profile for the outing, wrapping his camouflage coat around his face as he made his way out into the street.\nScroll down for video\nSweet: They reportedly ended their two-year romance in December - but Ellie Goulding and Dougie Poynter appear to be back on track and were pictured doing some late night shopping together on Thursday\nGrubs up! The two musicians, both aged 28, were pictured picking up some food from their local Waitrose supermarket\nPop star Ellie was easy to spot with her blonde hair and stunning features as she walked slightly behind her McBusted boy wearing a cream sheepskin coat.\nShe teamed her look with a pair of super skinny black jeans and ankle boots, while Dougie took control of carrying all the shopping bags.\nThe outing comes as Ellie shared a gushing picture of the handsome boyband member walking the catwalk at the Joshua Kane show for the London Mens Collections.\nHide and seek: While they could just be friends, Dougie appeared keen to keep a low profile for the outing, wrapping his camouflage coat around his face as he made his way out into the street\nShe's so cool: Pop star Ellie was easy to spot with her blonde hair and stunning features as she walked slightly behind her McBusted boy wearing a cream sheepskin coat\nWhat a gent: She teamed her look with a pair of super skinny black jeans and ankle boots, while Dougie took control of carrying all the shopping bags\nFriendship first: While they've kept quiet on the subject of whether or not there has been trouble in paradise, it's clear to say the pair have remained close\nShe captioned the image with the words: 'Congratulations on your first walk @idougahole this is incredible. @joshuakanebespoke #nextbigthing.'\nWhile they've kept quiet on the subject of whether or not there has been trouble in paradise, it's clear to say the pair have remained close.\nOn Ellie's birthday last week, Dougie shared a lovely black and white picture of Ellie rocking out on stage.\nShe's got the look: Ellie looked naturally pretty as she stepped out into the street wearing a low-key ensemble\nNatural beauty: Her blonde locks fell in a casual tousled style past her shoulders as she followed behind Dougie\nI'll go first: The pair maintained a little distance from one another as they made their way down the street\nGood match: But they soon walked closer together as they headed out into the night\nBless him: Dougie was more than happy to carry all the shopping on behalf of the pair\nHe wrote: 'Happy birthday to this very special/rad lady @elliegoulding.'\nMailOnline has contacted a spokesperson for both Ellie and Dougie for further information.\nMeanwhile, Dougie has been a regular attendee at the men's clothing shows this weekend. On Sunday, he attended the Chester Barrie AW16 presentation at the Waldorf Hilton\nSuper cool: Meanwhile, Dougie has been a regular attendee at the men's clothing shows this weekend. On Sunday, he attended the Chester Barrie AW16 presentation at the Waldorf Hilton","url":"https://www.dailymail.co.uk/tvshowbiz/article-3392968/Ellie-Goulding-Dougie-Poynter-look-like-together.html"}
