{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 00:21:58","date_modify":"2018-10-23 00:21:58","date_publish":"2017-03-16 09:28:48","description":"Ellis Briar Athersych (pictured), 26, from Brigg in North Lincolnshire, attacked the woman after she shouted 'why don't you go home and look after your kids'.","filename":"data/vaneerConsumption/EllisBriarAthersychbitoffawomansearinrow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E5272DF00000578-0-image-a-38_1489656502298.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319402_Possessed-mother-26-bit-woman-s-ear-row_1540254118.html","title":"Ellis Briar Athersych bit off a woman's ear in row","title_page":"Ellis Briar Athersych bit off a woman's ear in row | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ellis Briar Athersych (pictured), 26, from Brigg in North Lincolnshire, attacked the woman after she shouted 'why don't you go home and look after your kids'\nA woman's ear was savagely bitten off by a 'possessed' mother-of-one on a night out.\nEllis Briar Athersych, 26, from Brigg in North Lincolnshire, attacked the woman after she shouted 'why don't you go home and look after your kids'.\nThe pair grappled with each before being separated. But when the other woman walked away, Athersych launched herself at her and bit into her ear.\nThe victim, who remains anonymous, has undergone two operations but a surgeon said there would always be a part of the ear missing.\nJailing Athersych for six-and-a-half-years for the attack, Recorder Eric Elliott, QC, told her: 'You seem to have gone berserk generally at anybody in the vicinity.\n'It is very sad when separating a mother from her daughter - but this is the only course.'\nProsecutor Jeremy Evans said the attacks occurred when the victim was outside a social club with a group of people on October 9\nMr Evans told the court: 'She heard a female shout out something to the effect of 'why don't you go home and look after your kids'.'\nThe victim took offence to the remark and there was a confrontation where the two women grappled with each other.\nA friend of the victim then managed to drag the defendant away before being assaulted and a man then tried to intervene and was also assaulted by Athersych.\nThe victim was walking away when she felt the defendant 'take her ear in her mouth'.\nMr Evans said: 'She moved forward to try to shake her off and felt tremendous pain as she bit her right ear.'\nAthersych 'lost control' and was described by witnesses as being 'possessed'.\nThe victim, who remains anonymous, has undergone two operations but a surgeon said there would always be a part of the ear missing\nMr Evans said the victim was 'nervous and paranoid' about leaving her house following the attack and had taped up her letterbox because of 'repercussions'.\nDavid Godfrey, mitigating, said Athersych accepted 'limited memory of the evening' and said she had a history of turning to alcohol when she could not cope with things.\nHe added: 'The victim is a victim but did engage in initial confrontation'.\nAthersych pleaded guilty to assault occasioning grievous bodily harm and two further assaults.\nThe court was told Athersych had 14 previous convictions 'of significance', including battery, ABH and assaulting a constable.\nSpeaking after sentencing, prosecutor Mr Evans said: 'If you use your mouth as a weapon to cause serious injury you will receive a serious custodial sentence.'","url":"https://www.dailymail.co.uk/news/article-4319402/Possessed-mother-26-bit-woman-s-ear-row.html"}
