{"authors":[],"date_download":"2018-10-31 00:07:56","date_modify":"2018-10-31 00:07:56","date_publish":"2017-01-26 00:00:00","description":"The mayor of El Monte, a cash-strapped San Gabriel Valley city with many retired employees drawing two pensions, says there’s “no rational justification” for the double pensions.","filename":"data/vaneerConsumption/ElMontesmayorwantstoendbonuspensionscostingmillionsbuthishandsaretied.json","image_url":"https://www.trbimg.com/img-5889403b/turbine/la-ahagman-1485389941-snap-photo/600","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944476.html","title":"El Monte's mayor wants to end bonus pensions costing millions but his hands are tied","title_page":"El Monte’s mayor wants to end bonus pensions costing millions but his hands are tied - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"The mayor of El Monte, a cash-strapped San Gabriel Valley city with many retired employees drawing two pensions, says there’s “no rational justification” for the extraordinary, taxpayer-funded generosity.\nBut at the same time, Mayor Andre Quintero says there’s nothing city officials can do about the situation in the near term. The benefit is written into the city’s collective bargaining agreements, so it could be eliminated only through negotiations with unions.\nADVERTISEMENT\nAnother obstacle: California courts have long held that public employees are guaranteed the retirement benefits in place on the day they were hired.\nEl Monte’s predicament reflects the deep difficulty of reining in public pension costs. The city’s retirement burden is among the heaviest of any municipality in California, a recent Times investigation found.\nRetirement expenses totaled $16.5 million last year — equal to 28% of the city’s general fund. Among California’s 10 largest cities, only San Jose paid as much toward retirement benefits relative to its general fund.\nContributing to El Monte’s burden is the unusual double pension system, which covers more than 200 active and retired civilian employees.\nThe “supplemental” pensions, approved by City Council members in 2000, are paid on top of the pensions civilian retirees collect through the California Public Employees’ Retirement System.\nCalPERS pensions provide up to 60% of employees’ final salaries. With their supplemental pensions, eligible El Monte retirees collect as much as 90% of final salary. The idea was to put retirement pay for non-uniformed employees — clerks, managers and maintenance workers — nearly on par with that of police officers.\nAfter the 2008 financial crisis, El Monte eliminated supplemental pensions for new employees, but the move did not affect retirees or active employees already covered by the plan.\n“We cannot condone or justify these benefits,” Mayor Andre Quintero said at a City Council meeting Jan.10, the first since The Times published an article about the bonus pensions. “The plain and simple truth is that the city was taken advantage of by those who were entrusted to protect our tax dollars.”\nThe supplemental plan was championed in 2000 by then-City Manager Harold O. Johanson and other top administrators, who stood to benefit. The City Council approved it unanimously and without public discussion, meeting minutes show.\nJohanson retired about three years later, at 58. Today, he is the top beneficiary of the program, collecting a combined pension of more than $250,000 per year, state and city records show. Thanks to annual cost of living adjustments, his total pension is substantially higher than what he earned while working.\nJohanson is one of at least eight El Monte retirees with combined pensions of $200,000 a year or more.\n“ The plain and simple truth is that the city was taken advantage of by those who were entrusted to protect our tax dollars. ” — Mayor Andre Quintero Share this quote\nThe bonus pensions cost El Monte $2.4 million last year. Quintero said that money “would go a long way toward restoring our badly deteriorated streets or funding after-school programs.”\nHalf of El Monte’s 116,000 residents were born outside the United States, and one-fourth live below the poverty line.\nLike many would-be pension reformers, Quintero, a Democrat who was elected mayor in 2009, is learning how difficult it is to cut retirement benefits.\nLanguage defining the supplemental pensions — and obliging the city to continue funding them for those eligible — is in the city’s contracts with employee unions.\nADVERTISEMENT\nThe agreement with the largest of those unions expired in 2010, and the city has signed periodic extensions ever since. The next extension is set to be voted on by the mayor and council next month.\nIn an interview last week, Quintero vowed to vote “no” unless the supplemental pension provision was stripped out.\nBut after consulting with city staff, Quintero changed his mind because, he said, city officials had already agreed to financial terms of the contract. The upcoming vote is supposed to address lesser details, Quintero said, and attempting to eliminate the supplemental pensions could open the city to a claim that it negotiated in bad faith.\n“We have to find the way to extricate ourselves from this situation with the least harm,” Quintero said.\nRepresentatives of the union, Service Employees International Union Local 721, did not respond to requests for comment.\nThe city is due to start negotiating a new contract with the union later this year. That will be a better time to draw the line, Quintero said. Whether other members of the five-person council will vote with him remains an open question, Quintero acknowledged.\nEven if they do, the union could sue and the case would hinge on the court’s interpretation of the “California rule,” a body of legal decisions holding that public employees are entitled to the pension benefits in place on the day they were hired.\nThe question would be whether the rule applies to the unusual supplemental pensions. Of more than 3,000 cities, counties and special districts in California, only 52 offer a similar benefit, a Times review of public records found.\nA case before the California Supreme Court could also affect the outcome. In August, a Northern California appeals court ruled unanimously that Marin County could subtract some forms of extra pay from the final salary used to calculate pensions, thereby reducing monthly retirement payments. The three-judge panel said that state law requires a government agency to offer a “reasonable” pension.\n“If thousands of people working in similar positions around the state are only getting the CalPERS pensions, I think the El Monte unions would have a hard time showing that’s unreasonable,” said Dan Pellissier, a former aide to Republican legislators who is now president of California Pension Reform, a group seeking to curb retirement benefits.\nFormer El Monte Mayor Rachel Montes, who signed the resolution authorizing the supplemental pensions in 2000, has not responded to repeated requests for comment.\nThen-councilman Anthony Fellow, a communications professor at Cal State Fullerton, initially did not respond to requests for comment. In a recent email, Fellow wrote that the bonus pensions seemed reasonable “based on the city’s economic conditions and financial stability at the time.” He said the added pensions served “our efforts to attract city administrators to run one of the largest cities in the San Gabriel Valley.”\nArt Barrios, another former councilman, also did not respond to requests for comment for The Times’ earlier story on the extra pensions. Encountered recently at City Hall, Barrios said the benefit seemed “reasonable at the time.” He declined to elaborate.\nCalifornia's Pension Crisis Sign up for our Essential Politics newsletter to receive more stories like this Privacy policy","url":"http://www.latimes.com/projects/la-me-el-monte-mayor/"}
