{"authors":["Chriss W. Street"],"date_download":"2018-10-30 20:40:43","date_modify":"2018-10-30 20:40:43","date_publish":"2015-12-28 14:08:55","description":"The El Niño killing machine slaughtered 41 people this week in a build-up to more death, destruction and misery over the next 90 days.","filename":"data/vaneerConsumption/ElNioKillingMachineJustWarmingUp.json","image_url":"https://media.breitbart.com/media/2015/12/ap_ap-photo1310-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_28__1540932043.html","title":"El Niño Killing Machine Just Warming Up","title_page":"El Niño Killing Machine Just Warming Up | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The El Niño killing machine that slaughtered 41 across the South in violent storms this week is just warming up for a crescendo of death, destruction, and misery that is expected to arrive over the next three months.\nBreitbart News reported on October 11 that the NOAA Climate Prediction Center stated the planet is already experiencing the most extreme El Niño conditions ever recorded, with sections of the equatorial central and eastern Pacific Ocean sea surface up a stunning 10.8 degrees Fahrenheit, versus the record eight degrees in 1997-98.\nEl Niño’s year-long warming trend along the eastern half of the equatorial Pacific has reversed the “Westerlies” trade winds that blow from South America to Polynesia, turn up toward Japan, and then curl along Alaska and the West Coast.\nAs a result, America’s weather pattern has flipped, with New Yorkers on Christmas Day wearing shorts and heading to the beach in 72-degree weather; while Los Angeles surfers were headed out to the mall in 59-degree weather to buy sweaters.\nWABC-TV in New York broadcast the evening news in front of its headquarters near Times Square. One passer-by summed up Christmas 2015 in The City, “Oh, this is awesome. Being able to see 70-degree weather in New York City on Christmas Eve, is something really cool to experience.”\nEric Fisher, chief meteorologist for CBS Station WBZ in Boston reported, “You look into the Northwest where the rain and snow has been nonstop. You look into the Northeast, Mid-Atlantic, upper Midwest–winter completely on pause, and temperatures that are so far above average they’ll be smashing records before we’re done.”\nDown South, 70-80-degree weather was causing electric storms, pouring rain and tornadoes. The combination killed 30 people last week and caused the raging Pea River in Elba, Alabama to rise by 25 feet before cresting at 45.5 feet on late Saturday afternoon. The flood waters eclipsed the record 1929 flood, according to local officials.\nAs the 80-degree heat-front moved west, it whipped-up tornadoes in the Dallas/Fort Worth area. The twisters left 10-mile-wide swaths of devastation and left at least 11 people dead either directly from the storm or in related traffic accidents.\nTemperatures on the Westside of the Rocky Mountain are averaging 17 degrees colder than temperatures on the Eastside, breaking many 100 year records.\nAccording to Nate Mantua, a climatologist with the National Oceanic and Atmospheric Administration in Santa Cruz, California, told CBS that every four to seven years “there’s a massive shift in rainfall patterns in the tropics. So wet places end up being really dry, and normally dry places end up getting lots of rainfall.”\nMantua worries that the equatorial temperature anomaly promises one of the strongest El Niños is about to hit California with the worst rainfall and flooding since 1950.\nEl Niño careened into the Sierra Nevada Mountains this month, with the Mammoth Mountain region snowfall jumping by 70 percent and adding 6.4 billion gallons of water to Lake Tahoe. The Nation Weather Service predicts that another large storm system will hit Northern California mountains this week with another 4 feet of snow.\nBut the worst weather is about to arrive over the next three months. The El Niño from December 26 through January 3, 1997, dumped over 20 inches of snow and rain in some California locations. Hundreds of thousands of people were forced to evacuate, and the state suffered about $1.8 billion in damage.\nThe next winter brought another strong El Niño that included four weeks in February 1998 of nearly continuous storm flooding, mudslides, and agriculture disruptions.\nCalifornia’s average rainfall that month totaled 21.74 inches, breaking the all-time-record of 17.33 inches, which had stood since 1867. A record 35 counties were declared federal disaster area, as California suffered 17 storm-deaths and $550 million in damages.\nDespite the state’s history of severe flooding, the Commerce Department’s www.floodsmart.gov website reveals that about half to two-thirds of Californians living in the high-risk floodplains have not purchased federal flood insurance this year.\nThe federal flood insurance program is available to California owners and renters of residential and commercial properties. It remains a tremendous bargain at about $700 per year, given that the average claim is about $40,000.","url":"https://www.breitbart.com/local/2015/12/28/el-nino-killing-machine-just-warming/"}
