{"authors":["Robert Kraychik"],"date_download":"2018-10-30 18:18:50","date_modify":"2018-10-30 18:18:50","date_publish":"2018-09-07 18:20:19","description":"Tesla founder and CEO Elon Musk praised Chinese politicians as more scientifically apt than their American counterparts. He offered his comments during a Thursday appearance on the Joe Rogan Experience podcast.","filename":"data/vaneerConsumption/ElonMuskPraisesReallySmartChinesePoliticiansTheyreGoodatScience.json","image_url":"https://media.breitbart.com/media/2018/07/elon-musk-tesla-china-xi-jinping.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_09_07__1540923530.html","title":"Elon Musk Praises 'Really Smart' Chinese Politicians; 'They're Good at Science'","title_page":"Elon Musk Praises 'Really Smart' Chinese Politicians; 'They're Good at Science'","title_rss":"NULL","source_domain":"breitbart.com","text":"Tesla founder and CEO Elon Musk praised Chinese politicians as more scientifically apt than their American counterparts. He offered his comments during a Thursday appearance on the Joe Rogan Experience podcast.\nMusk also said “average citizens” of America need not worry about potential Chinese state surveillance of their behavior through mobile phones manufactured in partnership with the Chinese government, such as those from Huawei electronics.\nTranscript below.\nROGAN: What do you see in terms of — when you think about the future of your companies — bottlenecks; things that are holding back innovation; regulatory commissions and people that don’t understand the technology that are influencing policy? What could potentially be holding you guys back, right now? Is there anything that you would change?\nMUSK: That’s a good question. I wish politicians were better at science. That would help a lot.\nROGAN: That’s a problem. There’s no incentive for them to be good at science.\nMUSK: There isn’t. Actually, they’re pretty good at science in China. The mayor of Beijing, I believe, has an environmental engineering and the deputy mayor has a physics degree. I met them. The mayor of Shanghai is really smart.\nROGAN: What do you think of this government policy of stopping use of Huawei phones and there’s something about the worry about spying. From what I understand, from real tech people, they think it’s horseshit. Like phones, like the government saying, “Don’t buy Huawei phones.” Are you up on that, at all?\nMUSK: I guess if you have like top-secret stuff, then you want to be pretty careful about what hardware you use, but most people do not have top secret stuff, and nobody really cares what porn you watch. Nobody actually cares.\nROGAN: And if they do, that’s kinda on them.\nMUSK: National spy agencies do not give a rat’s ass what porn you watch. They do not care. What secrets does a national spy agency have to learn from the average citizens? Nothing.\n…\nROGAN: The worry is that these are somehow controlled by the Chinese government. The communist Chinese government is going to distribute these phones, and I don’t know if the worry is economic influence, that they’ll have too much power. I don’t know what it is. Are you paying attention to any of this?\nMUSK: Not really. I don’t think we should worry too much about Huawei phones. Maybe your national security agencies shouldn’t have Huawei phones. I think that’s a question mark. But I think for the average citizen, it doesn’t matter. Pretty sure the Chinese government does not care about the goings on of the average American citizen.","url":"https://www.breitbart.com/tech/2018/09/07/elon-musk-praises-really-smart-chinese-politicians/"}
