{"authors":["Josh Hanrahan For Daily Mail Australia"],"date_download":"2018-10-23 00:00:14","date_modify":"2018-10-23 00:00:14","date_publish":"2017-03-10 05:27:38","description":"She's the glamorous wife of Hollywood superstar Chris Hemsworth.","filename":"data/vaneerConsumption/ElsaPatakylooksradiantinafloralgowninByronBay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FFC1D00000578-0-image-a-38_1489121836633.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299990_Elsa-Pataky-looks-radiant-floral-gown-Byron-Bay_1540252814.html","title":"Elsa Pataky looks radiant in a floral gown in Byron Bay","title_page":"Elsa Pataky looks radiant in a floral gown in Byron Bay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the glamorous wife of Hollywood superstar Chris Hemsworth.\nAnd Elsa Pataky, 40, showed off the boho chic style she's become renowned for in Byron Bay on Saturday.\nImmersing herself in the relaxed local lifestyle, Elsa went barefoot as she and Chris doted over their twin boys while out for lunch.\nFamily day out: Spanish actress Elsa Pataky opted for boho chic in Byron Bay on Saturday\nWith their two-year-old twin boys Tristan and Sasha in tow, the couple enjoyed a family meal at The Farm restaurant.\nFlaunting her slim figure, Elsa opted for a colourful floral gown with a low neckline.\nTying her hair in a chic updo, she showed off a number of necklaces which dangled elegantly around her neck.\nDoting parents: Elsa went barefoot as she and husband Chris Hemsworth (R) doted over their twin boys, Tristan and Sasha\nShe accessorised further with a number of colourful bangles and bracelets on both wrists.\nAdding to the Byron Bay charm of the ensemble, Elsa opted to go barefoot for the occasion.\nWhile she and Chris spent much of their day doting over their boys, Elsa also enjoyed a discussion with a female friend.\nAt one stage, the parents were pictured sitting down with their boys in the shade and Elsa appeared to take a stick off her son.\nHey mum! The couple enjoyed a family lunch at The Farm restaurant\nStyle: Elsa opted for a colourful floral gown with a plunging neckline and several accessories\nGood spirits: While she and Chris spent much of their day doting over their boys, Elsa also enjoyed a discussion with a female friend\nBeachside vibes: Her barefoot boho style has become a regular feature since she and her family relocated to coastal New South Wales\nHer barefoot boho style has become a regular feature since she and her family relocated to coastal New South Wales.\nThey previously lived in Los Angeles, but Chris spoke often of his desire to move back to Australia.\nElsa and Chris married in late-2010 and share a daughter, India Rose, four, as well as their twin boys.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299990/Elsa-Pataky-looks-radiant-floral-gown-Byron-Bay.html"}
