{"authors":[],"date_download":"2018-10-22 22:20:52","date_modify":"2018-10-22 22:20:52","date_publish":"2014-06-09 18:36:30","description":"Troy James Knapp, known by many as the \"Mountain Man,\" was sentenced to 10 years and six months in prison.","filename":"data/vaneerConsumption/ElusiveMountainManGets10YearsinPrison.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/497246/140609-mountain-man-utah-1430_527189550054070118bedef84197e47c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_elusive-mountain-man-gets-10-years-prison-n126526_1540246852.html","title":"Elusive 'Mountain Man' Gets 10 Years in Prison","title_page":"Elusive 'Mountain Man' Gets 10 Years in Prison","title_rss":"NULL","source_domain":"nbcnews.com","text":"Knapp, 46, will next go before a state judge Monday where he's scheduled to take plea deals from seven Utah counties where he is charged with burglary-related crimes. Details of the plea deals are not being disclosed, but he's charged with more than 40 burglary-related crimes dating back to 2009.\nU.S. Assistant Attorney Matthew Bell said Knapp has been cooperating with authorities since agreeing to the plea deal this spring, helping them find 16 weapons he had stored away in four locations in four different counties. That included 13 handguns, two rifles and 1 one shotgun, Bell said.\nAuthorities say Knapp began a string of cabin burglaries across southern and central Utah in 2007.\nKnapp is set to take individual plea deals for each county, but prosecutors in the seven counties have been working together to make sure everybody is on board with the package of deals, said Sanpete County Attorney Brody Keisel.\nHe's charged in Beaver, Emery, Garfield, Iron, Kane, Sanpete and Sevier counties.\nIf the deals go through as expected, it will signal the end of what could be the final chapter in the mysterious story of an unknown California fugitive who became a sensation in Utah as he raided cabins, stealing guns, whiskey and supplies.\nSince his arrest, prosecutors have been eager to tamp down the notion that Knapp was some sort of folk hero by insisting Knapp is nothing more than a criminal living off others for years.\n- Associated Press","url":"https://www.nbcnews.com/news/us-news/elusive-mountain-man-gets-10-years-prison-n126526"}
