{"authors":["Simone Amelia For Daily Mail Australia"],"date_download":"2018-10-22 23:54:57","date_modify":"2018-10-22 23:54:57","date_publish":"2017-03-10 04:51:13","description":"She first started modelling at the tender age of 10 and Aussie model Elyse Knowles stepped out on Wednesday to celebrate International Women's Day at a discussion forum held in Melbourne.","filename":"data/vaneerConsumption/ElyseKnowlescelebratesInternationalWomensDay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F394900000578-0-image-a-9_1489112092947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299568_Elyse-Knowles-celebrates-International-Women-s-Day_1540252497.html","title":"Elyse Knowles celebrates International Women's Day","title_page":"Elyse Knowles celebrates International Women's Day | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She first started modelling at the tender age of 10.\nAnd Elyse Knowles has become one of Australia's most in-demand faces, chosen as an ambassador for high-profile brands including Rolex and Billabong.\nThe 24-year-old stepped out on Wednesday to celebrate International Women's Day at a discussion forum held in Melbourne.\nScroll down for video\nGirl power: Elyse Knowles stepped out on Wednesday to celebrate International Women's Day at a discussion forum held in Melbourne\nThe blonde beauty stunned in an ensemble that featured a strapless top with elongated bottom, its mustard tone complimenting her golden skin.\nShe paired it with loose pants and high wedge sandals, choosing to carry a black clutch.\nThe successful model wore her hair to one side in gorgeous natural waves and highlighted her tan with warm make-up that included a light peach lip.\nPopular: The 24-year-old has become one of Australia's most in-demand faces, chosen as an ambassador for high-profile brands including Rolex and Billabong\nThe face of last year's Caulfield Cup Carnival took to her Instagram to post an image of herself from the day, starting the caption with an emphatic: 'WE ARE WORTH IT!'\nShe continued, 'International Women's day, a time to congratulate how far we have come as a society, but a time to realise how far we have to go.'\n'I think your passion for International Women's Day is very sexy,' gushed one fan in the snap's comments section.\nSun-kissed: The blonde beauty stunned in an ensemble that featured an off-shoulder top with elongated bottom, its mustard tone complimenting her golden skin\n'Look amazing girl!' wrote fellow model and Formula One Rolex Australia Grand Prix Ambassador, Brooke Hogan.\nElyse recently revealed she works on her body 'every day'.\n'I am constantly working out, watching what I eat and drink, and making sure my brain is healthy too,' she told Husskie magazine.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299568/Elyse-Knowles-celebrates-International-Women-s-Day.html"}
