{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 20:02:34","date_modify":"2018-10-30 20:02:34","date_publish":"2016-08-23 00:03:20","description":"The State Dept. attempted to explain away the relationship between Sec. of State Hillary R. Clinton and the Clinton Foundation.","filename":"data/vaneerConsumption/EmailsNotEvidenceofClintonFoundationPaytoPlay.json","image_url":"https://media.breitbart.com/media/2016/08/Clinton-Sec-of-State-Clinton-Global.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_22__1540929754.html","title":"Emails Not Evidence of Clinton Foundation Pay-to-Play","title_page":"State Dept: Emails Not Evidence of Clinton Foundation Pay-to-Play","title_rss":"NULL","source_domain":"breitbart.com","text":"The spokesman for the State Department had a difficult time during Monday’s hostile and at times uncomfortably awkward briefing with reporters as he attempted to explain away the relationship between the State Department under Democratic nominee for president Hillary R. Clinton and the Clinton Foundation.\nAt times, Mark C. Toner, the department’s deputy spokesman, looked at his shoes or had his eyes closed as he took deep breaths between answers to reporters asking about revelations from 725 pages of emails released by Judicial Watch. The FBI turned over to the State Department 14,900 emails to and from Clinton that were discovered by the FBI during its investigation into the former secretary of state’s private email scheme.\nInside the 725 pages are rare looks into how Clinton insiders operate, as this batch was tied to a specific Freedom of Information Act request by the Washington-based watchdog for all emails of official State Department business received or sent by Clinton confidante Huma Abedin from Jan. 1, 2009 through Feb. 1, 2013, using a “non-state”.gov email address.\nOne exchange was between Abedin and Doug Band. Band is a long-time confidante of President William J. Clinton, who followed the president to the foundation.\nBand told Abedin Crown Prince Salman of Bahrain needed to meet with Secretary Clinton, but when the prince went through official channels he got no appointment.\nIt should be noted that the prince committed $32 million to Crown Prince’s International Scholarship Program for the Clinton Global Initiative and the Kingdom of Bahrain donated between $50,000 to $100,000 to the foundation as did Bahrain Petroleum.\nSome email messages between Abedin and Band include:\nJune 23, 2009 email Band to Abedin: “Cp of Bahrain in tomorrow to Friday. Asking to see her. Good friend of ours.” June 23, 2009 email Band to Abedin: “Cp of Bahrain in tomorrow to Friday. Asking to see her. Good friend of ours.” June 23, 2009 email Abedin to Band: “He asked to see hrc thurs and fri thru normal channels. I asked and she said she doesn’t want to commit to anything for thurs or fri until she knows how she will feel. Also she says that she may want to go to ny and doesn’t want to be committed to stuff in ny…” June 25, 2009 email Abedin to Band: “Offering Bahrain cp 10 tomorrow for meeting woith [sic] hrc. If u see him, let him know. We have reached out thru official channels.”\nOther requests included helping a group of English footballers with criminal records through the visa process and a pitch to help Bono broadcast a concert from the International Space Station.\nToner was asked directly by the State Department if these email conversations with Band advocating for Clinton Foundation donors and Abedin looking for ways to make things happen constituted a pay-for-play gambit between the State Department and the Clinton Foundation.\nToner said the State Department had reviewed all of the emails released to Judicial Watch for wrongdoing and they found none.\n“There was no impropriety,” he said. “This was simply evidence of the way the process works, in that a secretary of state has aides getting emails or contacts by a broad range of individuals and organizations.”\nToner said,” These were important people with information to convey to the secretary of state. There is nothing that we have seen to indicate an untoward relationship.”\nJudicial Watch President Tom Fitton had a different view when he said Monday: “These new emails confirm that Hillary Clinton abused her office by selling favors to Clinton Foundation donors.”\nFitton said he did not want the State Department in charge of the investigation into Clinton and her team.\n“There needs to be a serious, independent investigation to determine whether Clinton and others broke the law,” he said.\nThis is the tenth set of records produced for Judicial Watch by the State Department from the non-state.gov email accounts of Huma Abedin. The documents were produced under a court order in a May 5, 2015, Freedom of Information lawsuit against the State Department (Judicial Watch, Inc. v. U.S. Department of State (No. 1:15-cv-00684)) requiring the agency to produce.\nReporters also asked about 180 pages worth of call logs from the desk of Cheryl Mills, which shows that the lawyer, who was then serving as Secretary of State Clinton’s chief of staff, was constantly trading calls with Laura Graham, the president of the Clinton Foundation.\nToner said although he had no knowledge about the phone conversations, he would speculate that the heavy phone traffic was related to Mills leading the effort to relieve the suffering of the Haitian people after that country’s 2011 earthquake.\nIn one message Graham made a reference to Mills about “our boss.”\nToner told one reporter that in fact it was not possible for Graham and Mills to have the same boss at the same time.\nWho is the person Graham called “our boss?” a reporter asked.\n“I can’t speculate as to who they were referring to.”\nOf course not.","url":"https://www.breitbart.com/politics/2016/08/22/state-spox-grilled-upon/"}
