{"authors":["Penny Starr"],"date_download":"2018-10-30 18:09:18","date_modify":"2018-10-30 18:09:18","date_publish":"2018-08-11 14:42:31","description":"Criticism of Chicago Mayor Rahm Emanuel concerning the violence that has gripped the city is growing, including from black leaders.","filename":"data/vaneerConsumption/EmanuelHasNeglectedandOppressedUs.json","image_url":"https://media.breitbart.com/media/2018/05/AP_18045826190925.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_11__1540922958.html","title":"Emanuel Has ‘Neglected’ and 'Oppressed Us’","title_page":"Chicago Pastor on City's Violence: Emanuel Has ‘Neglected’ and 'Oppressed Us’","title_rss":"NULL","source_domain":"breitbart.com","text":"Criticism surrounding Chicago Mayor Rahm Emanuel’s role in the violence that has gripped the city that just last weekend saw 72 people shot–12 fatally–includes a black pastor who said Emanuel is responsible because he has “neglected” and “oppressed” people who live in crime-ridden neighborhoods.\nRev. Ira Acree, pastor of the Greater St. John Bible Church on Chicago’s West Side, was interviewed on National Public Radio’s (NPR) Morning Edition on Thursday. Host Rachel Martin played a clip of Emanuel at a press conference saying there are too many guns on the street and a lack of values.\n“I am taken aback by the arrogance of this mayor,” Acree said. “In the midst of a crazy, horrifying week of violence, he blames the victim.”\n“He’s talking about values,” Acree said. “He needs to consider the fact when he closed 50 schools in black and brown neighborhoods, that was a statement of his values.”\n“When he closed mental health institutes, that was a statement of his values,” Acree said. “When he sits on a half a billion dollars of HUD money, and we have homeless people in Chicago, that’s a statement of his values.”\n“He needs to take ownership and begin to stop his neglect of an entire side of town,” Acree said.\nMartin tried to defend Emanuel, who was also treated kindly by the left wing, taxpayer-funded NPR when he was former President Barack Obama’s chief of staff.\n“Well, as you know, he would paint it differently,” Martin said, adding:\nHe would say that this is a priority for him, and what he is suggesting is that he needs help from people like you, from people who live in these neighborhoods, to call out the crimes, not just call when the crime happens and report the crime but to report the criminal, the perpetrator, if they know who it is.\n“Is that a problem?” Martin asked.\nAcree answered that Chicago is a “tale of two cities.”\n“Just this same weekend, one Chicago’s enjoying outdoor meals and watching shows and attending Lollapalooza while another one is being shot down, filling up trauma centers and preparing funeral arrangements,” Acree said. “Of course we have these conditions that he has helped expand the disparity on.”\nMartin again came to Emanuel’s defense, stating the violence pre-dates the mayor’s tenure.\n“It does,” Acree said. “But while the violence has gone down all across the country in the last couple of years, unfortunately, it has not been duplicated here in Chicago at the same percentage – still has not.”\nAcree finally confronted Martin and had his say about Emanuel.\n“I cannot take him serious because for 7 1/2 years he has neglected us,” Acree said. “He has oppressed us. He has disinvested in us.”\n“So what guidance do you give your parishioners? I mean, when people come to you and are clearly suffering an emotional toll because of all this violence who have – which has taken so many loved ones from people, do you just say…”\n“We walk by faith. We walk by faith. You know, we trust in God,” Acree said. He continued:\nAnd we also know what the Scripture says – without a vision, people perish. And even though this mayor does not have a vision that has inclusivity for us, we must have a vision for ourselves. We must pull ourselves up from our own bootstraps and keep persevering forward.\nMartin then asked if, beyond faith, Acree had any practical advice for his parishioners.\n“Yeah, we can vote out these politicians that don’t have any interest for us, who just want our support on Election Day and then support other communities afterwards,” Acree said.\nPresident Donald Trump also criticized Emanuel on Thursday while at a meeting in New Jersey about prison reform.\n“I guess you have to take it from the leadership,” Trump said. “It’s called bad leadership.”\nAt a press conference and on Twitter, Emanuel said everyone in Chicago has a responsibility to end the violence in the city.\n“Today we have a heavy heart, and our souls are burdened,” Emanuel said. “We are a better city than what we saw this weekend. We as a city, in every corner of Chicago, have a responsibility”:\nToday we have a heavy heart and our souls are burdened. We are a better city than what we saw this weekend. We as a city, in every corner of Chicago, have a responsibility. You can help. If you have info, submit a tip anonymously here or text to 274637: https://t.co/lBrWxplM1g pic.twitter.com/f81BUmW7Nk — Mayor Rahm Emanuel (@ChicagosMayor) August 6, 2018\nFollow Penny Starr on Twitter.","url":"https://www.breitbart.com/politics/2018/08/11/chicago-pastor-emanuels-role-citys-violence-neglected-oppressed/"}
