{"authors":["Associated Press"],"date_download":"2018-10-23 04:05:22","date_modify":"2018-10-23 04:05:22","date_publish":"2017-04-26 15:45:51","description":"CONCORD, N.H. (AP) - A Republican state lawmaker accused of creating a misogynistic online forum is resisting calls for his resignation and says he will...","filename":"data/vaneerConsumption/EmbattledlawmakerIwillstandstrongformensrights.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448136_Embattled-lawmaker-I-stand-strong-mens-rights_1540267522.html","title":"Embattled lawmaker: I will 'stand strong for men's rights'","title_page":"Embattled lawmaker: I will 'stand strong for men's rights' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CONCORD, N.H. (AP) - A Republican state lawmaker accused of creating a misogynistic online forum is resisting calls for his resignation and says he will \"stand strong for men's rights.\"\nThe Daily Beast reported Tuesday that Rep. Robert Fisher founded The Red Pill, which calls itself a \"discussion of sexual strategy in a culture increasingly lacking a positive identity for men.\" The Daily Beast traced a variety of online usernames back to Fisher. It quotes comments many of those usernames made, on The Red Pill and other sites, that degrade women's intelligence and appear to normalize rape.\nFisher denied his role in the forum to The Daily Beast, but he didn't repeat that denial in a statement to New Hampshire reporters. He said the rape comment in particular, made on a different forum in 2008, was taken out of context. In a thread discussing \"absolute truth,\" Fisher wrote, \"Rape isn't an absolute bad, because the rapist I think probably likes it a lot. I think he'd say it's quite good, really.\"\n\"I'm disappointed that this sort of attack has replaced real news, but it strengthens my position and resolve that fighting for equal rights is more important today than ever,\" Fisher said in a statement released Tuesday night. \"Here's my message to the public: I am not disappearing. I will continue to stand strong for men's rights and the rights of all.\"\nFisher, in his statement, goes on to say that he faced \"false rape accusations\" in his early 20s that brought him to \"a very low place.\" The Daily Beast reported Fisher no longer runs the forum.\nRepublican House Speaker Shawn Jasper said he was \"sickened\" by the story and urged Fisher's constituents not to re-elect him in 2018. House Minority Leader Steve Shurtleff and a number of other Democrats called for Fisher's resignation.\n\"I am shocked and disturbed by the report linking Representative Robert Fisher to deeply offensive statements and the creation of a misogynistic online forum,\" Shurtleff said.\nFisher, 31, is a two-term representative from Laconia who does not serve on any policy committees, at his own request, according to the legislature's website. Fisher lists himself as a \"computer technician\" and owns a computer repair business.\nHe has missed about 50 percent of all votes this legislative session, according to state records. He is a co-sponsor of 14 pieces of legislation, including bills to expand the use of medical marijuana, to ban the practice of gay conversion therapy on minors and to reduce business taxes.\n__\nThis story has been corrected to show The Daily Beast article was published Tuesday, not Monday.","url":"https://www.dailymail.co.uk/wires/ap/article-4448136/Embattled-lawmaker-I-stand-strong-mens-rights.html"}
