{"authors":["John Hayward"],"date_download":"2018-10-30 20:43:40","date_modify":"2018-10-30 20:43:40","date_publish":"2015-03-01 15:23:20","description":"The New York Times has a depressing article headlined \"Mutual Suspicion Mars Tech Trade With China,\" whose title buries the lede. The story is more about tech companies suspicious of both China and the Obama Administration. There is a serious information-technology trade war underway, and China is eating Team Obama's lunch, in part due to continuing fallout from Edward Snowden's revelations of Obama's digital surveillance state. |","filename":"data/vaneerConsumption/EmboldenedBySnowdenRevelationsChinaPlaysHardballWithUSTechCompanies.json","image_url":"https://media.breitbart.com/media/2015/02/Xi-Jinping-speech-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_01__1540932220.html","title":"Emboldened By Snowden Revelations, China Plays Hardball With U.S. Tech Companies","title_page":"Emboldened By Snowden Revelations, China Plays Hardball With U.S. Tech Companies | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The New York Times has a depressing article headlined “Mutual Suspicion Mars Tech Trade With China,” whose title buries the lede. The story is more about tech companies suspicious of both China and the Obama Administration. There is a serious information-technology trade war underway, and China is eating Team Obama’s lunch, in part due to continuing fallout from Edward Snowden’s revelations of Obama’s digital surveillance state.\nThe Chinese communists are leaning hard on U.S. tech companies to “submit to invasive audits and create back doors into hardware and software,” as the NYT puts it, beginning with computers used by the Chinese banking industry but soon to expand into other information-technology realms under the rubric of Chinese national security and counter-terrorism. When the U.S. objects, China thunders about the Snowden revelations and NSA surveillance, a trump card they probably will not get tired of playing any time soon.\nTech companies bristling against these demands turned to Washington for help with some reluctance, because they are “leery of the Obama Administration’s using their technology for espionage.” Even though many suspect China’s claims of wanting computer surveillance tech for counter-terrorism purposes is just a fig leaf for protectionist measures to hobble foreign companies against Chinese competitors, Beijing’s charges of hypocrisy have gone a long way towards slanting the political field in their favor.\nThere also seems to be a general sense of helplessness about dealing with China’s strongarm tactics, which are said to have gotten more aggressive under the current president, Xi Jinping. Because the Chinese government maintains such tight control over their economy, they can make “take it or leave it” demands of American firms looking for access to the enormous Chinese market – which is “expected to account for half of all information technology spending globally in 2015.” Submitting to the government’s demands gets foreign companies favorable treatment for a while, until Chinese companies copying their hardware and software with suspicious accuracy are ready to muscle them out of the market. Beijing also seems fond of soaking captive American corporations for huge fines after dubious investigations; CEOs pay up because retaining access to the Chinese market for a few more years is worth the price.\nThus far, the U.S. government’s response has mostly taken the form of demands that don’t seem to go anywhere, along with a general suggestion from former ambassador Jon Huntsman to “tie the technology trade issues to broader trade talks between the countries.” Given how important this issue seems to be in Beijing, and how nervous U.S. negotiators with be about sparking a serious general trade war, it remains to be seen just how much leverage will be available to make China back down on its demands for digital surveillance technology.","url":"https://www.breitbart.com/national-security/2015/03/01/emboldened-by-snowden-revelations-china-plays-hardball-with-u-s-tech-companies/"}
