{"authors":["Associated Press"],"date_download":"2018-10-23 01:00:30","date_modify":"2018-10-23 01:00:30","date_publish":"2016-01-11 11:20:49","description":"KATHMANDU, Nepal (AP) — Emergency relief supplies have been sent to mountain villages in Nepal hit by a weekend snowstorm and located near the epicenter of a...","filename":"data/vaneerConsumption/EmergencysuppliessenttoNepalvillageshitbysnowstorm.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393678_Emergency-supplies-sent-Nepal-villages-hit-snowstorm_1540256430.html","title":"Emergency supplies sent to Nepal villages hit by snowstorm","title_page":"Emergency supplies sent to Nepal villages hit by snowstorm | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emergency supplies sent to Nepal villages hit by snowstorm\nKATHMANDU, Nepal (AP) — Emergency relief supplies have been sent to mountain villages in Nepal hit by a weekend snowstorm and located near the epicenter of a massive April 2015 earthquake, officials said Monday.\nWarm clothes, blankets, tents, food and money were sent to the villages by land and helicopter, and most of the villages have been reached, said Government Administrator Udav Prasad Timilsina.\nHe said most of the families in the villages had received the emergency aid. There were no reports of any deaths or serious injuries from the weekend storm.\nThe affected villages are in Gorkha district, about 160 kilometers (100 miles) northwest of the capital, Kathmandu.\nMost of the houses in the area were damaged in the April 25 earthquake, and thousands of people have been living in tents.\nThe quake killed nearly 9,000 people and damaged around 1 million houses.\nNepal will formally begin earthquake reconstruction work this weekend. The National Reconstruction Authority is going to send hundreds of engineers to villages to take detailed surveys of the damage. The agency will also train construction workers and collect money from donors.\nForeign donors have pledged $4.1 billion for earthquake reconstruction, but only a small amount of that money has reached Nepal because it took months to set up the new agency to deal with the task.","url":"https://www.dailymail.co.uk/wires/ap/article-3393678/Emergency-supplies-sent-Nepal-villages-hit-snowstorm.html"}
