{"authors":["John Hayward"],"date_download":"2018-10-30 22:17:38","date_modify":"2018-10-30 22:17:38","date_publish":"2016-09-22 22:57:29","description":"The latest poll from Emerson College shows Hillary Clinton leading Donald Trump by only six points in Illinois, where Barack Obama won by over 16 points | Politics","filename":"data/vaneerConsumption/EmersonCollegePollClinton45Trump39inIllinois.json","image_url":"https://media.breitbart.com/media/2016/09/HRC-and-DJT-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_22__1540937858.html","title":"Emerson College Poll: Clinton 45%, Trump 39% in Illinois","title_page":"Emerson College Poll: Clinton 45%, Trump 39% in Illinois | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The latest poll from Emerson College shows Hillary Clinton leading Donald Trump by only six points in Illinois, where Barack Obama won by over 16 points against Mitt Romney in 2012.\nEmerson has the race at Clinton 45%, Trump 39% in a four-way race. Libertarian Gary Johnson received 6% support in Illinois, while the Green Party’s Jill Stein pulled 3%. Seven percent of respondents said they were undecided.\nEmerson’s most recent national poll showed Trump just slightly ahead of Clinton, 43% to 41%, well inside the poll’s 3.4% margin of error. This was also a four-way survey, in which Johnson drew 9% and Stein had 2% support.\nThe Illinois poll discovered an interesting situation in which Trump held a strong 49% to 27% lead with independent voters, but Clinton was 11 points ahead with voters who supported John Kasich in the Republican primary.\nAs for Bernie Sanders supporters, whom Trump has made an effort to attract, 53% of them favored Clinton, while Trump and Gary Johnson were tied with 15% apiece, and Stein was close behind them with 12%.\nEmerson also found a virtual dead heat in the Illinois Senate, with Democrat Tammy Duckworth just two points ahead of incumbent Republican Mark Kirk, 41% to 39%. Kirk has previously been seen as one of the most vulnerable incumbent Republican candidates.","url":"https://www.breitbart.com/politics/2016/09/22/emerson-college-poll-clinton-45-trump-39-illinois/"}
