{"authors":["Rachael Levy"],"date_download":"2018-10-30 23:39:12","date_modify":"2018-10-30 23:39:12","date_publish":"2016-12-06 00:00:00","description":"Emerging Sovereign Group is shutting down its Sovereign Master fund, a $300 million macro strategy.","filename":"data/vaneerConsumption/EmergingSovereignGroupMasterFundmacrohedgefundshutsdown.json","image_url":"https://amp.businessinsider.com/images/58471a9be02ba71e008b7c03-1536-768.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_emerging-sovereign-group-master-fund-macro-hedge-fund-shuts-down-2016-12_1540942752.html","title":"Emerging Sovereign Group Master Fund macro hedge fund shuts down","title_page":"    Emerging Sovereign Group Master Fund macro hedge fund shuts down - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Tobias Helbig/Getty Images Emerging Sovereign Group is shutting one of its hedge funds after redemptions from investors, according to people familiar with the matter.\nThe Emerging Sovereign Master Fund, a macro strategy, manages about $330 million — a figure that includes borrowings - according to hedge-fund database AltX. It's one of six funds listed by the New York firm in a filing. These include emerging markets equities and macroeconomic hedge funds.\nEmerging Sovereign Group managed about $3.5 billion as of mid-year, roughly a 26% drop in assets from a year prior, according to the Hedge Fund Intelligence Billion Dollar Club ranking. A representative for the firm declined to comment.\nThe group was founded in 2002 by Kevin Kenny, Jason Kirschner, Mete Tuncel with seed money from investing legend Julian Robertson of Tiger Management. Carlyle Group took a stake in 2011, but recently sold it back to the founders as it steps away form hedge funds.\nThe Master Fund's closure is one of several recent shutterings.\nOrlando Muyshondt's firm, Tyrian Investments, also backed by Robertson, is shutting due to redemptions. Perry Capital announced earlier this year it would shutter, as did Wingspan Investment Management, an $800 million hedge fund firm, Bloomberg reported.\nInvestors have pulled about $77 billion from the $3 trillion hedge fund industry this year through October, according to data provider eVestment.","url":"https://www.businessinsider.com/emerging-sovereign-group-master-fund-macro-hedge-fund-shuts-down-2016-12"}
