{"authors":["Press Association"],"date_download":"2018-10-22 21:31:27","date_modify":"2018-10-22 21:31:27","date_publish":"2016-01-29 06:48:47","description":"Patients admitted in an emergency to hospital at weekends are older and more disabled than those admitted during the week, new research suggests. The study c...","filename":"data/vaneerConsumption/Emergencyweekendpatientsolderandmoredisabledthanthoseadmittedinweek.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-c2a4094d-fd0c-490b-b7cd-0bac66c67866-3bmscybNe842cce83474b518cda2-13_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421952_Emergency-weekend-patients-older-disabled-admitted-week_1540243887.html","title":"Emergency weekend patients 'older and more disabled than those admitted in week'","title_page":"Emergency weekend patients 'older and more disabled than those admitted in week' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emergency weekend patients 'older and more disabled than those admitted in week'\nPatients admitted in an emergency to hospital at weekends are older and more disabled than those admitted during the week, new research suggests.\nThe study could add to the row between health workers and the Government over the use of data suggesting people are more likely to die at the weekend in NHS hospitals.\nPrevious studies have found that patients admitted at weekends are older and more sick, although some have shown that death rates are still higher at weekends despite this.\nThe research on emergency admissions was led by Dr Paul Hamilton from the Royal Victoria Hospital.\nThe new study, of a major hospital in Belfast and published in Emergency Medicine Journal, examined data for 536 patients.\nResearchers looked at factors affecting emergency admission between 5pm on a Friday and 9am on a Monday.\nThey found that patients admitted at the weekend as medical emergencies were significantly older than those admitted at other times of the week.\nThey were typically aged 68 compared with 65 during the week.\nThey also ranked higher on scores of disability and were more \" functionally dependent\" than those admitted during a weekday .\nThe research was led by Dr Paul Hamilton from the Royal Victoria Hospital in Belfast.\nThe team said: \" These findings illustrate major differences in the age and functional dependence of patients admitted to hospital at weekends.\n\"This may fully or partially explain the increased mortality that has been publicised.\"\nThe experts also questioned whether increasing the numbers of staff at the weekend would make any difference to the survival of patients.\nIn November, a study published in the British Medical Journal (BMJ), found that babies born in NHS hospitals at weekends are more likely to be stillborn or die in the first week of life than those delivered Monday to Friday.\nA different study in the BMJ in September showed that around 11,000 more people die every year within 30 days of admission to hospital on Friday, Saturday, Sunday or Monday compared with other days of the week.\nResearchers behind that study said a lack of consultant cover and \"reduced\" services could be contributing to higher death rates.\nBut they argued it would be \"rash and misleading\" to conclude that an exact number of deaths could have been avoided.","url":"https://www.dailymail.co.uk/wires/pa/article-3421952/Emergency-weekend-patients-older-disabled-admitted-week.html"}
