{"authors":[],"date_download":"2018-10-21 02:47:07","date_modify":"2018-10-21 02:47:07","date_publish":"2018-08-15 20:37:30","description":"Giambalvo joins Post Sports as its new Maryland football and men’s basketball beat writer.","filename":"data/vaneerConsumption/EmilyGiambalvojoinsSports.json","image_url":"https://www.washingtonpost.com/resizer/Ra4ByBKpz34zVuHXbFEl1TJdXII=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3V4XIQR7GYYU7GRNLGIQ4EXRYM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_15__1540090027.html","title":"Emily Giambalvo joins Sports","title_page":"Emily Giambalvo joins Sports - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Sports Editor Matt Vita:\nI’m thrilled to announce that after a very successful internship this summer, Emily Giambalvo will be staying with us to become our new Maryland football and men’s basketball beat writer.\nEmily has impressed us from the beginning of her internship with her maturity, work ethic and reporting instincts. When Steve Goff was in Moscow for the World Cup, Emily became our lead soccer writer and excelled in her coverage of Wayne Rooney’s arrival in Washington, his first game with D.C. United and the opening of the team’s new stadium, Audi Field. She’s pitched in on coverage of the Nationals, Redskins, Ravens and Citi Open. She wrote a detailed and revelatory piece on how a coordinated social media and marketing campaign organized by the Seattle Mariners secured a spot on the American League All-Star team for shortstop Jean Segura.\nEmily, a native of South Carolina, is a May graduate of the honors program at the University of Georgia, where she majored in Management Information Systems and minored in Anthropology. She was part of the Grady Sports Media Certificate Program and spent a summer abroad studying in Moscow and St. Petersburg. She describes her Russian language skills as basic, but her time in Russia further piqued her interest in Russian culture and history.\nPlease join me in welcoming Emily to the newsroom fulltime.","url":"https://www.washingtonpost.com/pr/wp/2018/08/15/emily-giambalvo-joins-sports/"}
