{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:55:45","date_modify":"2018-10-22 20:55:45","date_publish":"2016-01-28 05:05:52","description":"The 24-year-old showcased her incredible figure in skinny jeans and thigh high boots as she ran errands about town in West Hollywood.","filename":"data/vaneerConsumption/EmilyRatajkowskidonsskinnyjeansandthighhighbootsinWestHollywood.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A5F61B00000578-0-image-a-24_1453944597383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420261_Emily-Ratajkowski-showcases-fabulous-figure-skinny-jeans-thigh-high-boots_1540241745.html","title":"Emily Ratajkowski dons skinny jeans and thigh-high boots in West Hollywood","title_page":"Emily Ratajkowski dons skinny jeans and thigh-high boots in West Hollywood | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a pro at stealing attention even from some of the world's biggest pop stars.\nAnd Emily Ratajkowski, who rocketed to fame as a dancer in Robin Thicke's Blurred Lines video, kept up with appearances on Wednesday in West Hollywood.\nThe 24-year-old showcased her incredible figure in skinny jeans and thigh high boots as she ran errands about town.\nScroll down for video\nStrutting her stuff! Emily Ratajkowski, 24, displayed her slim pins in skinny jeans and thigh-high boots while out and about in West Hollywood on Wednesday\nThe Gone Girl star teamed the look with a low-cut black satin blouse which hinted at some of her ample cleavage.\nShe added her ensemble with a choker necklace that tied with a ribbon in the back and fell down past her posterior.\nThe brunette swept her silky locks back into a low, chic bun which allowed her flawless features to take centre stage.\nSultry in satin: The Gone Girl star teamed her look with a low-cut black blouse which hinted at some of her ample cleavage\nRatajkowski - who shot to fame after stripping off for Robin Thicke's raunchy Blurred Lines video - accessorized her wardrobe with a Gucci handbag and dark shades.\nOn Monday she gave her nearly 5 million Instagram followers an eyeful as she shared a sultry bikini-clad snap of her pert posterior.\nAnd while her social media accounts flaunt her flawless physique, the star has spoken of how her looks can be a hindrance when it comes to casting.\nDetails: Ratajkowski - who shot to fame after stripping off for Robin Thicke's raunchy Blurred Lines video - accessorized her wardrobe with a Gucci handbag and dark shades\nTroubles: While her social media accounts flaunt her flawless physique, the star has spoken of how her looks can be a hindrance when it comes to casting\nEmily recently told GQ magazine: 'When people google my name they see this bikini-sex-symbol kind of thing and they're scared to cast me as anything but that.'\n'So I'm taking a long and, I hope, high road of basically waiting for the parts that I'm most excited about, which can be really annoying.'\nBut despite her burgeoning acting career, she is still in demand as a model, having recently stripped off for the Love magazine advent calendar.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420261/Emily-Ratajkowski-showcases-fabulous-figure-skinny-jeans-thigh-high-boots.html"}
