{"authors":[],"date_download":"2018-10-22 22:49:49","date_modify":"2018-10-22 22:49:49","date_publish":"2014-06-10 22:58:56","description":"Teammates and other fellow students were grief-stricken to learn that Emilio Hoffman, a 14-year-old soccer player, was killed in the school shooting.","filename":"data/vaneerConsumption/EmilioHoffman14IdentifiedasVictimofOregonSchoolShooting.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/501181/140611-oregon-shooting-memorial-3a_972cd9e3a163ba7bb1b482d1c72b059f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_emilio-hoffman-14-identified-victim-oregon-school-shooting-n127861_1540248589.html","title":"Emilio Hoffman, 14, Identified as Victim of Oregon School Shooting","title_page":"Emilio Hoffman, 14, Identified as Victim of Oregon School Shooting","title_rss":"NULL","source_domain":"nbcnews.com","text":"Sign up for breaking news alerts from NBC News\nPolice said they were investigating whether the gunman, who was also found dead in a separate restroom, killed himself or died in a confrontation with officers.\n\"This is a tragedy that affects our whole community,\" Troutdale Police Chief Scott Anderson said late afternoon.\n\"This is just a tragic event. It feels so personal,\" said Linda Florence, superintendent of the Reynolds School District.\n\"I know we will get through this,\" Florence said. \"We have a very safe school district. We will become even safer.\"\nDozens of students and members of the community attended a vigil at a local Baptist church on Tuesday night. Gov. John Kitzhaber also attended the vigil.\nEmilio was a popular member of the school's junior varsity soccer team, and teammates and other fellow students were grief-stricken by the news of his death.\nThe Reynolds High student association also tweeted its condolences.\nThe incident also raised concern that it would give outsiders a mistaken perception of the school.\n— M. Alex Johnson","url":"https://www.nbcnews.com/news/us-news/emilio-hoffman-14-identified-victim-oregon-school-shooting-n127861"}
