{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:44:42","date_modify":"2018-10-22 22:44:42","date_publish":"2017-03-16 04:26:03","description":"Not only that but Krasinski will direct his actress wife in the paranormal thriller A Quiet Place that he's also rewriting from an original script.","filename":"data/vaneerConsumption/EmilyBluntandJohnKrasinskitostarinAQuietPlace.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E50D21600000578-0-image-a-82_1489637934908.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318830_Emily-Blunt-John-Krasinski-set-star-together_1540248282.html","title":"Emily Blunt and John Krasinski to star in A Quiet Place","title_page":"Emily Blunt and John Krasinski to star in A Quiet Place | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emily Blunt and Jophn Krasinski are going where most Hollywood couples fear to tread.\nThey plan to star together on the big screen for the first time, Variety reported Wednesday.\nNot only that but Krasinski will direct his actress wife in the paranormal thriller A Quiet Place that he's also rewriting from an original script.\nBold move: Hollywood couple John Krasinski and Emily Blunt, pictured in January, are set to star on screen together for the first time in the paranormal thriller A Quiet Place\nIt marks the third time the former star of The Office will helm a feature project; he directed The critically-acclaimed The Hollars last year and Brief Interviews With Hideous Men in 2009.\nThe original script for the thriller that's set on a farm where a family is being terrorized by evil was purchased by Paramount prior to Krasinski expressing interest, Variety stated.\nIt's now been greenlit with Michael Bay's Platinum Dunes company producing the film which is slated to start production in the fall.\nHelming gig: Krasinski, 37, will also direct the film from an original screenplay he is reworking. He previously directed himself and Anna Kendrick in The Hollars, pictured, released last year\nIn demand: Blunt, 34, who starred last year in The Girl On The Train and The Huntsman: Winter's War, is currently filming the Mary Poppins sequel for Disney\nKrasinski, 37, stars for Platinum Dunes and Paramount in their upcoming Amazon original series Jack Ryan and he starred in 13 Hours directed by Michael Bay and released last year.\nBlunt, meanwhile, remains a much in demand actress in Hollywood, starring in 2016 in the high profile films The Girl On The Train and The Huntsman: Winter's War.\nThe actress, 34, is currently filming Mary Poppins Returns for Disney.\nSources claim to Variety that Krasinski and Blunt, who married in 2010 and have two young daughters, mostly prefer to keep their individual careers separate from their personal relationship.\nBut both loved the script for A Quiet Place so much, they decided to go ahead and make it together.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318830/Emily-Blunt-John-Krasinski-set-star-together.html"}
