{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:22:55","date_modify":"2018-10-22 22:22:55","date_publish":"2017-03-10 00:34:03","description":"The 25-year-old model and actress stripped off to a skimpy triangle bikini as she soaked up the sunshine after strutting her stuff at Paris Fashion Week","filename":"data/vaneerConsumption/EmilyRatajkowskisunbathesinskimpywhitebikini.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/07/3E209D5E00000578-0-image-a-75_1489130654176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299430_Emily-Ratajkowski-skimpy-white-triangle-bikini-sunbathes_1540246975.html","title":"Emily Ratajkowski sunbathes in skimpy white bikini","title_page":"Emily Ratajkowski sunbathes in skimpy white bikini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has been busy strutting her stuff at Paris Fashion Week.\nSo Emily Ratajkowski took a little time out on Thursday - as she hit the beach.\nThe 25-year-old model and actress stripped off to a skimpy triangle bikini as she soaked up the sunshine.\nScroll down for video\nCurves ahead: Emily Ratajkowski donned the skimpiest of bikinis on Thursday as she hung out at the beach in Malibu\nWinter sun: The 25-year-old model and actress stripped off to a teeny triangle bikini\nSexy senorita! The brunette beauty sipped on a Corona beer in the sun\nCompleting her beach babe look was a gold pendant necklace and wide brim straw fedora.\nThe beauty was joined by boyfriend Jeff Magid and the couple sipped on Corona beer as they sat chatting by the water's edge.\nEmily and musician Jeff were first linked in December 2014 and have been going strong ever since.\nTaking it easy: The star is fresh off Paris Fashion Week so no doubt happy to enjoy some downtime\nTaking shade: The leggy lady accessorized her look with a straw fedora\nThe star showed off her famous curves as she grabbed a towel\nTwo's company: Emily was joined by her boyfriend Jeff Magid for some chill time\nLongtime loves: The couple have been dating since 2014\nDuring the outing Emily shared her day in paradise with Instagram and Snapchat followers.\nShe nearly spilled out of her halter-neck waffle-fabric white top.\nThe pretty Californian native was careful not to risk the aging damage of UV rays, as she shaded her face with a wide-brimmed hat.\nJeff kept it casual in a grey t-shirt and blue shorts\nChatting it up: The Blurred Lines video beauty nattered away to her beau\nI'm listening: Jeff, who is a musician, made himself comfortable by resting on his arm\nHer flawless features appeared to be make-up free, as she showcased her pout and impressive bone-structure.\nThe star was in France on Monday, but it would not yet be bikini weather in Europe, so it appears she's returned to her native West Coast to recover.\nEmily has been busy as an ever-present on the front row during the prestigious fashion week, showcasing a number of different styles.\nThe sand gets everywhere! Emily dusted off her derriere\nCovering up: Emily wriggled into some checked pants a she got ready to head home\nTres chic! Emily looked stylish as she arrived at the beach in her two-piece outfit and sunglasses by RAEN\nOoh la la! The star wouldn't have looked out of place on the runways of Paris Fashion Week\nHot stuff! Emily shared multiple snaps and videos of her outing on social media\nPrior to fashion week, Emily had been in the headlines after her iCloud was allegedly hacked and private pictures leaked.\nShe also hit out at photographer Jonathan Leder last December for releasing Polaroid images from a racy photoshoot without her consent.\nThe snapper recently discussed his experience with Emily in a Q&A with Highsnobiety.\nLife's a beach! The 25-year-old model and actress stripped off to a skimpy triangle bikini as she soaked up the sunshine\nLooking good: The model looked delighted to be back in the sunshine\nFull moon tonight? She put on a cheeky display in her revealing two-piece as she checked out the view\nCareful! She nearly spilled out of her halter-neck waffle-fabric white top\nHe said: 'I would say that within 30 minutes of taking the first Polaroids, she was naked. I had worked with over 500 models by that point in my career, and I can tell you that Emily Ratajkowski was one of the most comfortable models I had ever worked with in terms of her body.\n'She was neither shy nor self-conscious in any way. To say she enjoyed being naked is an understatement.\n'I don’t know if it empowered her, or she enjoyed the attention, but I can say, out of the 100 or so Polaroids we shot those two nights, only in a handful does she have clothes on.'\nSensible: The pretty Californian native was careful not to risk the aging damage of UV rays, as she shaded her face with a wide-brimmed hat\nPretty: Her flawless features appeared to be make-up free, as she showcased her pout and impressive bone-structure","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299430/Emily-Ratajkowski-skimpy-white-triangle-bikini-sunbathes.html"}
