{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 01:51:28","date_modify":"2018-10-23 01:51:28","date_publish":"2016-01-11 13:09:30","description":"Emilia Clarke, 29, swapped the the gothic dress she wore at the Golden Globes for a light semi-sheer floral number at HBO's official afterparty inside the Beverly Hilton Hotel on Sunday night.","filename":"data/vaneerConsumption/EmiliaClarkewearsasheerfloraldressforHBOsGoldenGlobesafterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A187F00000578-0-image-a-15_1452514885233.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393801_Emilia-Clarke-swaps-sweeping-black-gothic-dress-sheer-floral-number-attends-HBO-s-Golden-Globes-afterparty_1540259488.html","title":"Emilia Clarke wears a sheer floral dress for HBO's Golden Globes afterparty","title_page":"Emilia Clarke wears a sheer floral dress for HBO's Golden Globes afterparty | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She stunned at the Golden Globes in a gothic sheer lace black gown.\nBut Emilia Clarke, 29, swapped the dark dress and its lengthy train for a light semi-sheer floral number at HBO's official afterparty inside the Beverly Hilton Hotel on Sunday night.\nThe Game of Thrones star looked radiant in the figure-hugging Dolce&Gabbana frock, which had embroidered poppies and daisies decorating its sides.\nScroll down for video\nTransformation: Emilia Clarke, 29, swapped the the gothic dress she wore at the Golden Globes for a light semi-sheer floral number at HBO's official afterparty inside the Beverly Hilton Hotel on Sunday night\nShe matched the colour of the poppies with a slick of bold red lipstick, contrasting with her unblemished pale skin.\nHer blue eyes were enhanced by smokey eye-shadow and a plentiful application of mascara. The star's brunette tresses with caramel tinting were tied back.\nStanding with her hand on her hip, her small tattoo of a wasp on her left pinky finger caught the eye, as did her glistening silver bracelet.\nSee full Golden Globes coverage including highlights, results and fashion\nWoman in black: Emilia stunned at the Golden Globes in a gothic sheer lace black gown with a flowing train\nFlower power: The Game of Thrones star looked radiant in the figure-hugging Dolce&Gabbana frock, which had embroidered poppies and daisies decorating its sides\nThe diminutive actress, who measures 5ft 2ins, was given a boost by a pair of bronze Jimmy Choo stilettos.\nDespite Game of Thrones losing out to Mr Robot in the Best Series, Drama category, Emilia didn't appear too disappointed as she flashed a huge smile.\nOn Saturday, she showcased her impressively-toned abs in a flirty leather pencil skirt at the Four Seasons in Beverly Hills.\nStylist Kate Young dressed the 29-year-old actress in a long-sleeved black crop-top, matching stilettos, and gold clutch for the BAFTA tea party.\nGorgeous: Her blue eyes were enhanced by smokey eye-shadow and a plentiful application of mascara. The star's brunette tresses with caramel tinting were tied back\nColour co-ordinated: She matched the colour of the poppies with a slick of bold red lipstick, contrasting with her unblemished pale skin\nThe Terminator Genisys star will reprise her role as Daenerys Targaryen in the sixth season of Game of Thrones, which premieres April 24 on HBO.\n'There’s so much in store for her. It’s really exciting,' Clarke told the Los Angeles Times in July.\n'It’s just go, go, go, go. Shocking moment to shocking moment. Epic moment to epic moment. It’s mental; it’s epic. And definitely Dany’s a part of it.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393801/Emilia-Clarke-swaps-sweeping-black-gothic-dress-sheer-floral-number-attends-HBO-s-Golden-Globes-afterparty.html"}
