{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-23 03:44:36","date_modify":"2018-10-23 03:44:36","date_publish":"2017-03-10 13:30:26","description":"Dubai-based Emirates has revealed a multi-million-dollar makeover on the first and business class bar area of its A380 planes. The saloon-style upgrade was inspired by 'private yacht cabins'.","filename":"data/vaneerConsumption/Emiratesunveilsprivateyachtstyleonboardlounge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E229AC200000578-0-image-a-38_1489146443117.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4300572_Emirates-unveils-private-yacht-style-board-lounge_1540266276.html","title":"Emirates unveils 'private yacht style' on-board lounge","title_page":"Emirates unveils 'private yacht style' on-board lounge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emirates has unveiled a multi-million-dollar interior makeover for its Airbus aircraft, enhancing the on-board lounge to emulate 'private yacht cabins'.\nUp to 18 fliers will be able to dine and unwind in the exclusive saloon-style area without disturbing other passengers as it will be set behind noise-cancelling curtains.\nThe onboard lounge upgrade will be rolled out across the company's A380 jetliners on the upper deck of the aircraft, for first and business class passengers.\nCustomers in the lounge can enjoy gourmet canapés, handpicked wines from around the world and limited edition fine spirits, as well as signature cocktails prepared by the bartender\nThe saloon-style upgrade will be rolled out across the company's A380 jets on the upper deck of the aircraft, for first and business class passengers\nThe re-design will see the decade-old semi-circular benches replaced by two tables for four either side of the horseshoe counter with views out of the plane's windows.\nOne table will feature double berths facing each other and the other will have an L-shaped seating arrangement around a smaller cocktail table.\nEach seat will be equipped with seatbelts enabling guests to remain in the bar even during turbulence.\nTo further create the authentic bar ambience there will be there will be standing room for 18 passengers.\nBut if things get too rowdy, fliers back in their first and business class cabins seats need not worry - a sound-proof curtain will be installed to block out any unwanted noise.\nIt will see the decade-old semicircular benches replaced by two tables for four either side of the horseshoe counter with views out of the aircraft's windows\nFurther highlights include new window blinds with integrated LED mood lighting and sub woofers for surround sound.\nThe lounge also features a 55-inch LCD screen so customers can view the latest flight information, or enjoy live TV broadcasts of news or sports updates.\nA champagne colour-scheme and ambient lighting will also be used to give an airier look and feel, Dubai-based Emirates revealed.\nEmirates has 'taken inspiration from private yacht cabins' in revamping its lounges, President Tim Clark explained in a statement, adding that the design will make the areas 'more intimate and conducive for passengers to socialise.'\nOne table will feature double berths facing each other and the other will have an L-shaped seating arrangement around a smaller cocktail table. Each seat will be equipped with seatbelts enabling guests to remain in the bar even during turbulence\nEmirates current bar, above, which has semi-circular benches - was featured in a 2015 TV ad featuring Jennifer Aniston\nCustomers in the lounge can enjoy gourmet canapés, handpicked wines from around the world and limited edition fine spirits, as well as signature cocktails prepared by the bartender.\nA mock-up of the refurbishment was revealed at the ITB Berlin travel fair on Wednesday.\nThe first new saloon-style upgrade will be installed in a new A380 at Airbus Group SE's interiors factory in Hamburg before it enters service in July. Six more will be similarly kitted out by the end of the year.\nIn total around 50 planes will eventually feature the new bar area, although Emirates does not intend to retrofit the 90 aircraft already delivered,Bloomberg reported.","url":"https://www.dailymail.co.uk/travel/travel_news/article-4300572/Emirates-unveils-private-yacht-style-board-lounge.html"}
