{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 00:02:25","date_modify":"2018-10-23 00:02:25","date_publish":"2016-01-29 12:37:04","description":"The daily flight between Auckland and Dubai will eclipse the current record holder, Qantas, by 20 minutes, but it will soon be topped by another Emirates flight and two Qatar Airways routes.","filename":"data/vaneerConsumption/Emiratesoffersworldslongestflightwith17hour15minutetripfromAucklandtoDubai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1E1FE00000578-0-image-a-18_1454067731818.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3422618_Emirates-offers-world-s-longest-flight-17-hour-15-minute-trip-Auckland-Dubai_1540252945.html","title":"Emirates offers world's longest flight with 17 hour, 15 minute trip from Auckland to Dubai","title_page":"Emirates offers world's longest flight with 17 hour, 15 minute trip from Auckland to Dubai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The race to offer the world’s longest non-stop flight is heating up, with Emirates announcing it will claim the title with journeys between the United Arab Emirates and New Zealand.\nUsing Boeing 777-200LR aircraft, the daily flights between Dubai and Auckland are scheduled to begin on March 1.\nThe service from Auckland to Dubai has an estimated flight time of 17 hours and 15 minutes (approximately 8,800 miles), which will eclipse the current record holder by 20 minutes. However, that flight’s reign will be brief.\nEmirates said it will use Boeing 777-200LR aircraft, which can carry 266 passengers, on the route\nThe ultra-long-haul, wide body jets seat as many as 10 passengers in each row in economy class\nTHE LONGEST FLIGHTS IN THE WORLD Sydney-Dallas, Qantas – 8,578 miles, 16 hours and 55 minutes Jeddah-Los Angeles, Saudia – 8,332 miles, 16 hours and 40 minutes Johannesburg-Atlanta, Delta Air Lines – 8,439 miles, 16 hours and 40 minutes Dubai-Los Angeles, Emirates – 8,339 miles, 16 hours and 35 minutes Abu Dhabi-Los Angeles, Etihad Airways – 8,390 miles, 16 hours and 30 minutes Doha-Los Angeles, Qatar Airways – 8,306 miles, 16 hours and 25 minutes Dallas-Hong Kong, American Airlines – 8,123 miles, 16 hours and 20 minutes Dubai-Houston, Emirates – 8,168 miles, 16 hours and 20 minutes Abu Dhabi-Dallas, Etihad Airways – 8,054 miles, 16 hours and 20 minutes Doha-Houston, Qatar Airways – 8,047 miles, 16 hours and 20 minutes\nAt the end of March, state-owned Emirates is planning to introduce a 17 hour and 35 minute flight from Dubai to Panama City.\nBut it looks like that journey will eventually be topped by rival Gulf carrier Qatar Airways.\nEarlier this week, Qatar Airways’ CEO revealed that the state-owned airline is adding two ultra-long-haul routes – Doha to Auckland and Doha to Santiago, Chile.\nThey will become the longest and second-longest routes with flight times of about 18 hours.\nUntil these flights get off the ground, the record will still be held by Qantas, which offers a 16 hour and 55 minute journey from Dallas to Sydney.\nWith its new route to Auckland, Emirates is hoping to lure European travellers, who would fly from destinations such as London or Paris and catch a connecting flight in Dubai.\nPassengers who travel from Auckland to Dubai will have to cope with a flight time of 17 hours and 15 minutes\nEmirates said its new route will cut journey times between Europe and New Zealand by almost three hours each way\nWhile the Auckland-Dubai flight will claim a record, Emirates said the leg from Dubai to Auckland will clock in at just under 16 hours.\nThe carrier said its new route will cut journey times between Europe and New Zealand by almost three hours each way.\nEmirates' Boeing 777-200LR planes can carry 266 passengers in three classes – eight in first class, 42 in business and 216 in economy.\nEmirates' Boeing 777-200LR aircraft have 42 lie-flat seats for passengers in business class (pictured)\nSheikh Ahmed bin Saeed Al Maktoum, chairman and chief executive of Emirates Airline and Group, said in a statement: ‘Having just one stop on the long haul to New Zealand will make the journey quicker and more comfortable.\n‘This will be a boon to many business people, tourists, expatriate New Zealanders and other travellers in Europe, parts of Africa and the Middle East.’\nHe said a non-stop service between Dubai and Auckland has been in the airline’s sights for some time.\nMeanwhile, United Airlines announced this week that it will begin daily non-stop flights between San Francisco and Singapore on June 1.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3422618/Emirates-offers-world-s-longest-flight-17-hour-15-minute-trip-Auckland-Dubai.html"}
