{"authors":["Christine Distasio"],"date_download":"2018-10-30 23:47:30","date_modify":"2018-10-30 23:47:30","date_publish":"2014-08-13 04:02:18","description":"It was only a matter of time before this Pretty Little Liars 'ship sank. On Tuesday night's new episode of PLL , \"A Dark Ali,\" Emison finally ended. And while this was a moment most PLL fans have been waiting for since Emily chose Ali over the rest…","filename":"data/vaneerConsumption/EmisonIsOverOnPrettyLittleLiarsBecauseAlisonIsTheWorst.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e8a5b700-2988-43e6-8a1c-0ecc87eb0bac.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35548-emison-is-over-on-pretty-little-liars-because-alison-is-the-worst_1540943250.html","title":"Emison Is Over On 'Pretty Little Liars' Because Alison Is The Worst","title_page":"Emison Is Over On 'Pretty Little Liars' Because Alison Is The Worst","title_rss":"NULL","source_domain":"bustle.com","text":"It was only a matter of time before this Pretty Little Liars 'ship sank. On Tuesday night's new episode of PLL , \"A Dark Ali,\" Emison finally ended. And while this was a moment most PLL fans have been waiting for since Emily chose Ali over the rest of her friends, I'm glad to see that her badass, no-nonsense attitude from last Tuesday's episode has carried on. On \"March of Crimes,\" Emily gave Sydney a piece of her mind for being a liar and on \"A Dark Ali,\" Emily finally dissolved Emison after Ali pulled her shadiest move yet.\nJust when we all thought that Ali could at least keep a manipulative hold on Emily until the show's summer finale, she ruined it all. Tuesday night's episode was all about the guy the Rosewood police arrested — he finally got a name, Cyrus Petrillo, and left Alison with a huge choice: her friends or her game with \"A.\" Do I even need to tell you that she chose wrong? Because she did, she really did.\nAlison was convinced that if identified Cyrus and turned the heat up on him and the investigation, he'd fold and lead her straight to \"A.\" Meanwhile, her friends — including the ever-loyal Emily — were trying to get her to tell the truth about everything so \"A\" wouldn't get any additional ammo against them. They'd all beat \"A\" to the punch and, even if that meant not finding out who's under the black hoodie for a little while longer.\nUnsurprisingly, after manipulating Emily with tales of getting mugged at knife-point by Cyrus in an abandoned basement and asking her not to tell any of the other girls, Ali went rogue. Detective Tanner took her and Mr. DiLaurentis to said abandoned basement and Ali spilled the beans about knowing Cyrus and continued to spin her web of lies to the police. And Emily is so over that shit, especially since she trusted Ali and they had an agreement that the terrible fivesome would stick together through all of this \"A\" drama until the end. \"All for one and one for all\" is apparently the liars' new motto.\nSo, when she found out that Ali identified Cyrus and that he was officially being incarcerated by the Rosewood police, Emily confronted Alison. She threw at her all at once all of the shit she, Hanna, Aria, and Spencer went through over the past four seasons because of Ali and how they went through it together. But since Ali had forsaken all of that by, again, choosing herself, her secrets, and her lies over her friends, they were done. And just like that, Emison is officially dunzo and Emily Fields is Rosewood's new resident badass.\nNow that Alison's lost her biggest supporter and the possibility of Emison, she's really got nothing left in Rosewood. And no one is sorry about it.\nImage: ABC Family","url":"https://www.bustle.com/articles/35548-emison-is-over-on-pretty-little-liars-because-alison-is-the-worst"}
