{"authors":["Kaitlin Reilly"],"date_download":"2018-10-30 23:57:33","date_modify":"2018-10-30 23:57:33","date_publish":"2014-08-12 20:30:05","description":"Did you freak out when you saw that the official hashtag for the Pretty Little Liars summer finale was #FatalFinale? I did. Pretty Little Liars Season 5 has put us through the ringer this summer with huge reveals (Shana shot Ezra!) and insane twists…","filename":"data/vaneerConsumption/EmisonCouldBeOverIfAliFakesHerOwnDeathInThePrettyLittleLiarsFatalFinale.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3523ad94-a218-4ba1-bdc0-4ec478115776.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34967-emison-could-be-over-if-ali-fakes-her-own-death-in-the-pretty-little-liars-fatalfinale_1540943853.html","title":"Emison Could Be Over If Ali Fakes Her Own Death In The 'Pretty Little Liars' #FatalFinale","title_page":"Emison Could Be Over If Ali Fakes Her Own Death In The 'Pretty Little Liars' #FatalFinale","title_rss":"NULL","source_domain":"bustle.com","text":"Did you freak out when you saw that the official hashtag for the Pretty Little Liars summer finale was #FatalFinale? I did. Pretty Little Liars Season 5 has put us through the ringer this summer with huge reveals (Shana shot Ezra!) and insane twists (the person in Ali's grave was a Radley patient!) but the promise of a character meeting their death in the summer finale is even more intense than I expected. The promos for the PLL finale hinted that we may see \"one less liar\" by the end of the summer season. If ABC Family is talking about an official \"Liar,\" that leaves us with one of five options: Spencer, Hanna, Aria, Emily, and, of course, Ali . Ali may have just returned from the dead (figuratively speaking) but of all the liars who could meet a dark fate, it seems that Ali is the most obvious choice. Then again, I'm not so sure that this \"fatal finale\" means what it appears to. Ali may, in fact, be the liar that the promo is referring to, but I'm not so sure that she'll die for real. I'm certain Ali would more likely fake her own death in the finale.\nThat'd be messed up on so many levels, but the person that it would mess up the most is Ali's dear friend (and maybe more) Emily. Out of all the liars, Emily took Ali's \"death\" two years ago the hardest — Emily was secretly in love with Ali, and really wanted to believe that Ali could have felt the same way. When Ali returned to Rosewood, it appeared that she did have real feelings for Emily. Ali admitted that Emily's feelings weren't totally one-sided, and the two even ended up making out at their sleepover. Emily has always been Ali's favorite, but their friendship definitely crossed over into romantic territory in the summer season. Unfortunately for Emison fans, their relationship won't make it to the Christmas episode if Ali does what I suspect she might do.\nA is after Ali, and since there's no way that A is going to stop his or her ruthless game anytime soon, Ali may need to come up with a more permanent solution so that she is no longer a target. A knew that Ali had survived being buried alive in her own backyard and stalked her while she was away. It seems that the only thing that will stop A is if Ali is dead for good and can no longer engage in this twisted game of cat and mouse. Ali's clever enough to realize that A won't follow around if everyone thinks she's dead — and A believes it, too.\nUnfortunately, that would mean the end of Ali's encounters with the liars — I'm not sure that Ali would let the girls in on her plan for faking her own death. If she does, I doubt that Ali would give the girls the option to talk to her after her own \"death\" — it would be risky for both them and for her, especially if A is still after the other girls. If that happens, then Emison is definitely dead in the water.\nIf Ali does let the girls in on her plan to fake her own death, it could still destroy Emison forever. Emily was so mad at Hanna when she learned that Hanna had helped Ali hatch a plan to leave Rosewood — what would Emily do if Ali decided to leave forever without warning? At the end of the day, Ali always looks out for number one, and even if she does have feelings for Emily, they'll never be as important as creating a safety net to protect her from A. Like it or not, Ali's too selfish for a real relationship and will save her own skin before anyone else's — even Emily's.\nSorry Emison fans, but it looks like this ship will definitely sink.\nImages: ABC Family; Rebloggy (3)","url":"https://www.bustle.com/articles/34967-emison-could-be-over-if-ali-fakes-her-own-death-in-the-pretty-little-liars-fatalfinale"}
