{"authors":["Baz Bamigboye For The Daily Mail"],"date_download":"2018-10-22 22:06:13","date_modify":"2018-10-22 22:06:13","date_publish":"2017-03-10 00:16:48","description":"Emma Watson told Baz Bamigboye that she wanted to make sure that Belle - a French village girl who reads and writes - was imbued with a sense of 'adventure, wanderlust and heroism'.","filename":"data/vaneerConsumption/EmmaWatsonsaysDisneysBelleisarealrolemodel.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F551300000578-0-image-a-60_1489111431101.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299542_Belle-s-real-role-model-says-Emma-Watson_1540245973.html","title":"Emma Watson says Disney's Belle is a real role model","title_page":"Emma Watson says Disney's Belle is a real role model | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emma Watson said the young woman she plays in the sumptuous new Beauty And The Beast film may be a feminist, but she's not a man hater just because she doesn't want to get married.\nWatson said that she wanted to make sure that Belle ('one of my absolutely favourite Disney characters') — a French village girl who reads, writes, rides and even invents a washing-machine — was imbued with a sense of 'adventure, wanderlust and heroism'.\n'She's book smart, emotional, sweet and romantic. It's not like she's cut off from that part of herself because she has a brain. I think Belle's one of those characters who really turns the feminist, man-hating thing on its head,' Emma declared.\n'It's not that she doesn't want to get married because she hates men. She doesn't want to get married because she wants to explore the world; and she wants to go on adventures; and wants her independence.\nEmma Watson told Baz Bamigboy that she wanted to make sure that Belle - a French village girl who reads, writes, rides and even invents a washing-machine - was imbued with a sense of 'adventure and heroism'\n'So she wants to be with someone who will enable and empower her, as opposed to diminish her. She wants it on her own terms.'\nReading the script, Emma was keen to ensure it was 'true to the spirit' of Belle. 'I was a real watchdog for that,' she explained when we met at Shepperton film studios.\nSo, early on, she made a deal with Bill Condon, the Academy Award-winning director of Beauty And The Beast. She agreed to record songs from the film soundtrack, so he could check out her singing — if he promised to get her a new draft of the script.\n'I had three hours in a recording studio,' she recalled. 'It was really raw, but Bill was pleased. And Disney was pleased.' Even so, making the audition tape was a nerve-racking experience.\n'I hadn't sung since I was about 12. This was something I'd always wanted to do, but I thought: 'Is my voice still there? I just hadn't used it, but it was a very pleasant surprise to find it was still there. I just kind of had to unearth it!'\nShe found, too, that she loved the singing lessons; and has continued them because, 'I've found it actually really helps my acting, and my speaking voice. It's great for my breathing. It's a discipline that I really, really like.'\nActually, the film, which opens in cinemas worldwide next Friday, embodies exactly the kind of equality values that Emma's HeForShe UN Women campaign espouses.\nBut the picture isn't a lecture. Far from it. It's lush, lavish fun. Like the 1991 animated film, Belle isn't the one who needs rescuing. She does the rescuing.\nThe live action picture is stuffed with A-list talent — on both sides of the camera. The cast includes Dan Stevens, who is very good as the Beast; Luke Evans, who absolutely nails the redneck stupidity of Gaston; and Emma Thompson as Mrs Potts the teapot.\nThe two Emmas also worked together on some of the Harry Potter films, and Watson told me Thompson 'has been such a mentor for me'.\nWatson told Baz Bamigboy that Beauty and The Beast's Bell is 'one of my absolutely favourite Disney characters'\nThe diverse cast (that word, 'diverse', is a Disney mantra) also features Josh Gad, Kevin Kline, Audra McDonald, Gugu Mbatha-Raw, Ian McKellen, Ewan McGregor, Haydn Gwynne, Clive Rowe and Alexis Loizon — who provides some love interest for one of the key supporting stars.\nWatson, pictured on Sunday, said she wanted the film to show the 'true to the spirit' of Belle\nBetween the cast and crew — including costume designer Jacqueline Durran, composer Alan Menken, lyricist Tim Rice, production designer Sarah Greenwood, make-up and hair designer Jenny Shircore and choreographer Anthony Van Laast — there are at least a dozen Oscar winners; as well as multiple recipients of Oliver, Tony, Bafta and Grammy awards.\nCondon, who also made Dreamgirls, told me it's the best crew he's ever worked with, 'bar none'.\nBefore dismantling Greenwood's exquisitely decorated ballroom set (a real work of art), Tendo Nagenda — Disney's executive vice-president of production — asked the cast and crew to stop for a moment, 'take a look and soak it all in'; he wanted people to appreciate 'the hundreds who created the sets'.\nAs I left a screening of the film, the man from the New Yorker paused as he put on his coat and scarf and marvelled that the millions that must have been spent on Beauty And The Beast were all evident, up on the big screen: an opulent new take on a tale as old as time.\nIt's the most heartwarming musical on Broadway — and it could become one of the biggest, and unlikeliest, hits of the year.\nCome From Away is the story of the planes diverted from the U.S. to Gander in Newfoundland, Canada, on 9/11.\nHusband-and-wife composers and lyricists Irene Sankoff and David Hein wrote the show, which opens officially on Sunday at the Gerald Schoenfeld Theatre, after visiting Gander in 2011 for the tenth anniversary commemoration of the day the 'plane people' arrived.\nNearly 7,000 passengers, pilots and flight crew descended on the remote Newfoundland town on September 11, 2001, after American air space was closed to all flights.\n'People changed their lives out there,' Hein told me. 'Some had fallen in love, and the experience affected them profoundly.'\nCome From Away is the story of the planes diverted from the U.S. to Gander in Newfoundland, Canada, on 9/11\nThe couple flew to Gander using money from a Canadian government grant. Hein noted that they were able to expand their funding, because the locals wouldn't let them stay in hotels. Instead, they invited them into their houses.\nThat kind of welcoming hospitality is what those travellers who had 'come from away' found in Gander, too: the 10,000-strong population opened their homes, civic halls, gyms and hostels to the stranded travellers.\nSankoff and Hein interviewed as many of those involved as they could; and spent years honing and refining their piece to absolute perfection.\nI confess that I was, initially, hesitant about seeing Come From Away. But, strictly speaking, it's not a 9/11 musical at all. Or a Canadian one.\nA cast of 12 sing and dance and recount tales from scores of folks: locals and plane people.\nIt's going to give the masterpiece Dear Evan Hansen a run for its money at the Tony Awards in June, that's for sure.\nI sat next to Cameron Mackintosh, per chance, and we — and everybody else — were on our feet, roaring our approval at the end. Many in the crowd were weeping.\nThis really should come from away to London — I'm thinking somewhere like the Young Vic.\nCraig Revel Horwood, who will direct Warner Brown's musical Son Of A Preacher Man: a show set in and around a Soho coffee shop, looking at the lives of three strangers.\nLouise Redknapp is being considered for a lead role in Warner Brown's musical Son Of A Preacher Man\nProducer John Sachs said the show will use a lot of songs associated with Dusty Springfield, including the title track, which was featured on the classic 1968 Dusty In Memphis album, though it's not about her at all.\nThe show will embark on an autumn tour starting at the Churchill Theatre in Bromley from September 4.\nLouise Redknapp, who reached the final of the last series of Strictly Come Dancing (on which Revel Horwood was a judge) is being considered for one of the lead roles.\nHer spokesperson would not confirm, but did say Redknapp was keen to do something in musical theratre.\nProducer Sachs said that having worked with her for 15 weeks on Strictly, Revel Horwood 'knows her strengths'.\nHe explained that in the show, three people are drawn to a particular building in Denmark Street, Soho; seeking the man who can heal them.\nImelda Staunton, Conleth Hill, Imogen Poots and Luke Treadaway, who capture the viciousness of Who’s Afraid Of Virginia Woolf?, Edward Albee’s scathing attack on American hypocrisy and society.\nThe play emerged during the hellish horrors of Vietnam; and this razor-sharp production, directed by James Macdonald, could be seen as a cultural assault and commentary on Donald Trump’s morally bankrupt White House.\nIt’s at the Harold Pinter Theatre for a limited season.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299542/Belle-s-real-role-model-says-Emma-Watson.html"}
