{"authors":["Rosie Narasaki"],"date_download":"2018-10-30 23:24:26","date_modify":"2018-10-30 23:24:26","date_publish":"2014-08-13 19:00:02","description":"Hold the phone — did you know that Emma Stone is reportedly in talks to take on the lead role in the Broadway revival of Cabaret?\nYup, according to the New York Times, Stone may be taking over for Michelle Williams when she leaves the show on…","filename":"data/vaneerConsumption/EmmaStoneMightStarInCabaretHer8MostSallyBowlesiestOutfitsThatProveShesPerfectForTheRole.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c027beb8-3345-49b4-b358-5b9ff1c2bcc1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35620-emma-stone-might-star-in-cabaret-her-8-most-sally-bowles-iest-outfits-that-prove-shes_1540941866.html","title":"Emma Stone Might Star In 'Cabaret' - Her 8 Most Sally Bowles-iest Outfits That Prove She's Perfect For The Role","title_page":"Emma Stone Might Star In 'Cabaret' — Her 8 Most Sally Bowles-iest Outfits That Prove She's Perfect For The Role","title_rss":"NULL","source_domain":"bustle.com","text":"Hold the phone — did you know that Emma Stone is reportedly in talks to take on the lead role in the Broadway revival of Cabaret?\nYup, according to the New York Times, Stone may be taking over for Michelle Williams when she leaves the show on November 9th. Apparently, Williams was actually Stone's replacement, after she was forced to drop out of the project, no doubt due to her crazy-busy film career.\nShe may not seem like the right girl for the role, but she did show us she had quite the pipes during her musical number in Easy A — yes, that was actually her singing, and we also have the added bonus of the fact that she already knows her way around a strip-tease and a feather boa. Plus, when she threw down the gauntlet in a wildly competitive (not to mention off-the-charts viral) lip synch battle with Jimmy Fallon, we all saw the fiery, impassioned heights she is capable of reaching — perfect for the oft-belted \"Mein Herr\" and \"Maybe This Time,\" no?\nAnd while she tends to cultivate something of a good-girl image (you'll often catch her in Peter Pan collars and florals), some of her wardrobe choices of yore have leaned decidedly Cabaret-ish. So, with that in mind, let's take a look at some of her most Sally Bowles-worthy duds!\n8. In Pucci\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nWell, we know she can rock some bodycon black leather... and that takes some serious chutzpah.\n7. On the Cover of W Magazine\nW Magazine\nMore leather — and it doesn't get much more \"Mein Herr\" than black lingerie.\n6. In Gucci\nPascal Le Segretain/Getty Images Entertainment/Getty Images\nScreen siren with a side of bombshell. Yes.\n5. On the Cover of Vogue\nVogue\nGorgeously delicate lingerie and the best eyeliner ever? Sally would definitely approve.\n4. In The House Bunny\nIt's like she already joined the Kit Kat Klub!\n3. In Easy A, Part I\nScreen Gems/IMDb\nI don't know about you, but when I think of Emma Stone x Sally Bowles, this is the first outfit that pops to mind.\n2. In Elie Saab\nBen Pruchnie/Getty Images Entertainment/Getty Images\nOkay, tell me this Elie Saab jumpsuit isn't basically Liza Minnelli's entire red carpet career compressed into a single outfit.\n1. In Easy A, Part II\nBecause, come on: Sally Bowles is all about red feather boas and matching corset bustiers!\nImages: Getty Images (4), W Magazine, Vogue, IMDb, Giphy (2)","url":"https://www.bustle.com/articles/35620-emma-stone-might-star-in-cabaret-her-8-most-sally-bowles-iest-outfits-that-prove-shes"}
