{"authors":["Will Martin"],"date_download":"2018-10-30 22:00:52","date_modify":"2018-10-30 22:00:52","date_publish":"2016-12-16 00:00:00","description":"It is bonus season in the City of London, and finance workers are finding out how big their pay boosts are this Christmas.","filename":"data/vaneerConsumption/Emolumentbankersbonusesandsatisfactionrankings.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bonuses-bankers-are-unhappy-with-their-bonuses-2016-12_1540936852.html","title":"Emolument bankers bonuses and satisfaction rankings","title_page":"    Emolument bankers bonuses and satisfaction rankings - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Lucas Jackson It is bonus season in the City of London, and finance workers are finding out how much their salaries will be topped up this Christmas.\nAs ever, City folk earned sums of money that most people could only ever dream of in 2016. The trade-off, of course, is long hours, serious pressure and high stress.\nSalary-benchmarking site Emolument released its latest survey of finance workers' bonuses on Friday, which showed bankers working in mergers and acquisitions got bigger bonuses than their peers in 2016.\nThe survey also revealed the attitudes of City workers to their bonus packages, and it is fair to say that most are not particularly happy with how much they have been given this year.\nEmolument's research showed that bankers working in origination and syndication — those responsible for bringing as much business as possible to their banks, and for creating syndicated loans — are the least happy with their bonuses in 2016. When asked if they were happy, just 17% said that their bonus was up to scratch. They picked up an average of £45,000 this year.\nMid-level traders earned an average bonus of £65,000 this year, but were one of the most unhappy groups in finance. \"Traders, despite having the second highest bonuses in these rankings, are among the least happy of banking professionals (only 23% of them were happy with their 2016 bonus),\" Emolument says.\nHere is the chart showing how satisfied London's financial workers are with their bonuses in 2016:","url":"https://www.businessinsider.com/bonuses-bankers-are-unhappy-with-their-bonuses-2016-12"}
