{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:54:41","date_modify":"2018-10-30 21:54:41","date_publish":"2016-12-16 00:00:00","description":"While that's more than colleagues elsewhere in investment banking, it's still 20% less than last year.","filename":"data/vaneerConsumption/Emolumentsurveyonbankerbonuses.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_emolument-survey-on-banker-bonuses-2016-12_1540936481.html","title":"Emolument survey on banker bonuses","title_page":"    Emolument survey on banker bonuses - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"RM Sotheby's Bankers working in mergers and acquisitions got bigger bonuses than their peers in 2016, according to a survey by salary-benchmarking site Emolument.com.\nMid-level M&A bankers earned a median bonus of £80,000 ($99,516) in 2016, according to the survey.\nWhile that is more than what colleagues make elsewhere in investment banking, it is still 20% less than last year.\nM&A has been exceptionally busy in 2016, with record deal volumes split between a handful of large investment banks and advisory boutiques.\nOctober was a bumper month, with shareholder approval for the £79 billion tie-up between brewery giants SABMiller and Anheuser-Busch InBev as well as the merger between asset managers Janus Capital and London-based Henderson Group.\nAlice Leguay, co-founder and COO at Emolument said: \"Over the last couple of years we have seen a huge polarisation in bonuses especially in mergers and acquisition. This applies to specific banks: those who have access to the high flow of deals and fees, versus the non-performing banks in M&A.\"\nTrading bonuses were stable at £65,000 while bonuses for bankers in origination, which involves bringing corporate debt and equity to the market, crumbled 30%.\nHere is the chart:","url":"https://www.businessinsider.com/emolument-survey-on-banker-bonuses-2016-12"}
