{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:19:13","date_modify":"2018-10-30 18:19:13","date_publish":"2016-03-24 14:39:16","description":"Protests erupted at Emory University on March 21st in response to Donald Trump endorsements written in sidewalk chalk around campus.","filename":"data/vaneerConsumption/EmoryUniversityStudentsScaredInPainoverTrump2016WrittenonSidewalk.json","image_url":"https://media.breitbart.com/media/2016/03/wi/afp_c4808ec43faba77eea2d029a30a31c8be04c9f82-2-e1458830329831.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_03_24__1540923553.html","title":"Emory University Students Scared, 'In Pain' over 'Trump 2016' Written on Sidewalk","title_page":"Emory University Students Scared, 'In Pain' over 'Trump 2016' Written on Sidewalk | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Protests erupted at Emory University on March 21st in response to Donald Trump endorsements written in sidewalk chalk around campus.\nThe protesters, who carried signs with the slogans, “Stop Trump” and “Stop Hate,” eventually moved their protest inside an administrative building. University President James W. Wagner ushered some of the protesters into a nearby board room where he allowed them to address their concerns.\nThey protesters demanded that the university disavow Donald Trump and his student supporters on campus, citing that his beliefs are not in line with the school’s standards for diversity and inclusion. One student asked if Emory would send out a university-wide e-mail to “decry the support for this fascist, racist candidate.” Wagner quickly denied this request.\n“I’m supposed to feel comfortable and safe [here],” one student said. “But this man is being supported by students on our campus and our administration shows that they, by their silence, support it as well … I don’t deserve to feel afraid at my school,” she added.\nIn response to to their concerns, Wagner and the administration announced their decision to use university security cameras to identify those who were responsible for the Trump chalkings. Although there was no indication that the chalkings contained racist content, the university prohibits chalk writing that hasn’t been approved by the campus reservation service.\n“How can you not [disavow Trump] when Trump’s platform and his values undermine Emory’s values that I believe are diversity and inclusivity when they are obviously not [something that Trump supports],” one student said tearfully. “Banning Muslims? How is that something Emory supports?” asked another.\nMy alma mater in the news- Emory kids protest when someone writes TRUMP with sidewalk chalk https://t.co/zwTRwq76px pic.twitter.com/MjeDOZLpu1 — Kmarko (@Kmarkobarstool) March 22, 2016\nAlthough there was no suggestion that the chalk-writing itself contained offensive language, the protesters have maintained that the incident is causing student suffering. Sophomore Jonathan Pereza, who led the protests against the chalk-writing, cried out in the quad: “You are not listening! Come speak to us, we are in pain!”\nTom Ciccotta writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta.","url":"https://www.breitbart.com/tech/2016/03/24/emory-students-scared-in-pain-over-trump-2016-written-on-sidewalk/"}
