{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:22:05","date_modify":"2018-10-30 18:22:05","date_publish":"2016-09-19 13:31:27","description":"\"Social justice warriors\" (SJWs) have a new coping tool, thanks to Project Veritas filmmaker James O'Keefe: the emotional first aid kit.","filename":"data/vaneerConsumption/EmotionalFirstAidKitsforSocialJusticeWarriors.json","image_url":"https://media.breitbart.com/media/2016/09/Emotional-First-Aid-Project-Veritas-Screen-shot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_19__1540923725.html","title":"'Emotional First Aid Kits' for Social Justice Warriors","title_page":"New: 'Emotional First Aid Kits' for Social Justice Warriors","title_rss":"NULL","source_domain":"breitbart.com","text":"“Social justice warriors” (SJWs) — those perennially prone to offense by the slightest hint of political incorrectness or simple diversity of opinion — have a new coping tool, thanks to Project Veritas filmmaker James O’Keefe: the emotional first aid kit.\nO’Keefe introduced the new “must-have” campus accessory at the University of Houston, ahead of a sold-out appearance on Monday evening by Breitbart News tech editor Milo Yiannopoulous, who is already “triggering” the politically intolerant.\nThe emotional first aid kits are designed to address the trauma of any “microaggressions” a student or professor might encounter if they cannot reach a “safe space” in time, and include a “genderless” baby blanket, earplugs, and Hershey’s Kisses (though the Project Veritas team ran into a serious snag when the chosen candies came prepared in American flag wrappers).\nO’Keefe and his team, representing the “99.99 percent,” pitched the emotional first aid kits to an academic adviser in the University of Houston’s philosophy department, who thought it was such a good idea that she offered to help assemble them.\nThe University of Houston event will be the second on Yiannopoulos’s “Dangerous Faggot” tour, complete with outrageously gas-guzzling tour bus and entourage. The event is scheduled from 7:00 to 9:00 p.m. Central Time at the Student Center Theater, 4455 University Drive, in Houston and is free.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2016/09/19/social-justice-warriors-james-okeefe-milo-introduces-emotional-first-aid-kits/"}
