{"authors":["Associated Press"],"date_download":"2018-10-22 23:23:31","date_modify":"2018-10-22 23:23:31","date_publish":"2016-01-29 11:04:51","description":"CAVINTI, Philippines (AP) — With a mournful bow, Emperor Akihito paid his respects in a war memorial in the Philippines Friday to the largest number of Japan...","filename":"data/vaneerConsumption/EmperorAkihitohonorsJapanesewardeadinPhilippines.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:a6bee62be9f44a729384e3631da1eeb8-4PuZeKVXE7cd9005b2c876903049-631_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422243_Emperor-Akihito-honors-Japanese-war-dead-Philippines_1540250611.html","title":"Emperor Akihito honors Japanese war dead in Philippines","title_page":"Emperor Akihito honors Japanese war dead in Philippines | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emperor Akihito honors Japanese war dead in Philippines\nCAVINTI, Philippines (AP) — With a mournful bow, Emperor Akihito paid his respects in a war memorial in the Philippines Friday to the largest number of Japanese invasion troops who died outside their homeland in World War II.\nClad in black and accompanied by Empress Michiko, he and Michiko each laid a bouquet of white chrysanthemums, Japan's imperial symbol, and silently prayed near a marble cenotaph in the Japanese memorial garden along Lake Caliraya in Laguna province southeast of the Philippine capital. Some of the 170 relatives of Japanese soldiers wept quietly.\nAkihito did not speak at the ceremony, but in his only public remarks related to Japan's wartime aggression, he said at a banquet hosted by President Benigno Aquino III on Wednesday that Japan should never forget the massive loss of lives in the war more than 70 years ago.\nVisiting Japan's Emperor Akihito and Empress Michiko bow their heads to pay respects to the Japanese Imperial Forces who died during WWII at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nAkihito has repeatedly expressed regret for the damage caused by the war, but has never offered a straightforward apology. The furthest he has gone is to express \"deep\" remorse in an address last year marking the 70th anniversary of the end of the fighting.\n\"I just feel very, very proud of the fact that I was able to present my father and his existence and what he did for his country to the emperor,\" said Joyce Tsunoda, holding a picture of a Japanese soldier who died in the Philippines. \"I think it was something that I never dreamed that I will be able to do.\"\nTsunoda was among the relatives who talked with Akihito and Michiko at the memorial.\nOn Wednesday, Akihito and his wife led a wreath-laying ceremony at Manila's Heroes Cemetery, where more than 44,000 Filipino soldiers from World War II are buried. More than 1 million Filipinos, most of them civilians, and about half a million Japanese soldiers died in the war. The remains of many of the soldiers have not been found, according to Akihito's press secretary, Hatsuhisa Takashima.\nAkihito's visit to the Philippines this week is the latest in a series of foreign trips that are seen as an attempt to show his commitment to peace and remorse for World War II, when Japanese forces invaded Asian nations in a brutal conflict Japan fought in the name of his father, Hirohito.\nWhile the Japanese monarch has been jeered in some of his previous foreign visits, Akihito was welcomed with full state honors in the Philippines, which now depends on Japan as a leading trading partner, provider of development aid and a major ally. The visit comes as the Philippines and Japan both confront an assertive China in contested territories in the East and South China Sea.\n\"Their imperial majesties are exemplars of humility, congeniality and heartwarming empathy,\" presidential spokesman Herminio Coloma Jr. said.\nFor some Filipinos, however, old wounds have not healed.\nIsabelita Vinuya, an 84-year-old grandmother who was among dozens of women and girls raped by Japanese troops in Pampanga province, north of Manila, picketed the Japanese Embassy along with seven other elderly victims to demand justice.\n\"We want to tell the emperor that our case is not being heard by the Japanese government,\" she said. \"We want him to hear us, so that they will admit to the atrocities they did to us, and take responsibility for it.\"\nSome historians say that as many as 200,000 Asian women, mostly Korean but also Chinese and others, were forced into Japan's military brothels during the war.\n___\nAssociated Press writers Jim Gomez and Teresa Cerojano in Manila, Philippines, contributed to this report.\nVisiting Japan's Emperor Akihito and Empress Michiko lay flowers to pay respects to the Japanese Imperial Forces who died during WWII at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nVisiting Japan's Emperor Akihito and Empress Michiko lay flowers to pay respects to the Japanese Imperial Forces who died during WWII at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nVisiting Japan's Emperor Akihito and Empress Michiko, center, walk to offer flowers and prayers to the Japanese Imperial Forces who died during WWII at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nVisiting Japan's Emperor Akihito and Empress Michiko, center, bow their heads to pay respects to the Japanese Imperial Forces who died during WWII at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nRelatives of Japanese Imperial Forces who died in the Philippines during WWII offer prayers at the Japanese Memorial Garden, a Japanese war memorial, after visiting Japan's Emperor Akihito and Empress Michiko paid homage in ceremony at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. (AP Photo/Bullit Marquez)\nRelatives of Japanese Imperial Forces who died in the Philippines during WWII prepare to offer flowers at the Japanese Memorial Garden, a Japanese war memorial, after visiting Japan's Emperor Akihito and Empress Michiko paid homage in ceremony at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. (AP Photo/Bullit Marquez)\nRelatives of Japanese Imperial Forces who died in the Philippines during WWII offer white carnation flowers at the Japanese Memorial Garden, a Japanese war memorial, after visiting Japan's Emperor Akihito and Empress Michiko paid homage in ceremony at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. (AP Photo/Bullit Marquez)\nVisiting Japan's Empress Michiko, center left, holds photos of Japanese Imperial Forces who died in the Philippines during WWII which were shown to her after she and Emperor Akihito offered flowers and prayers at the Japanese Memorial Garden, a Japanese war memorial, in Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nA relative of Japanese Imperial Forces who died during WWII in the Philippines shows photos of the Japanese soldier as she talks to Empress Michiko, second left, shortly after the Japanese royal couple offered flowers and prayers at the Japanese Memorial Garden, a Japanese war memorial, in Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nVisiting Japan's Emperor Akihito and Empress Michiko bow their heads shortly after paying respects to the Japanese Imperial Forces who died during WWII in the Philippines at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nA relative of Japanese Imperial Forces who died during WWII in the Philippines wipes her tears as she talks to visiting Japan's Emperor Akihito, right, and Empress Michiko shortly after laying flowers at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)\nA relative of Japanese Imperial Forces who died during WWII in the Philippines wipes her tears as visiting Japan's Emperor Akihito, third left, talks to other relatives shortly after laying flowers with Empress Michiko at the Japanese Memorial Garden, a Japanese war memorial, at Cavinti township, Laguna province southeast of Manila, Philippines Friday, Jan. 29, 2016. The tribute was the highlight of the 82-year-old Akihito's visit to the Philippines.(AP Photo/Bullit Marquez)","url":"https://www.dailymail.co.uk/wires/ap/article-3422243/Emperor-Akihito-honors-Japanese-war-dead-Philippines.html"}
