{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:15:07","date_modify":"2018-10-30 21:15:07","date_publish":"2015-06-01 16:59:09","description":"At the Produced By conference in Los Angeles on Sunday, Empire creator Lee Daniels revealed that he has received death threats over a gay storyline on his |","filename":"data/vaneerConsumption/EmpiresLeeDanielsonDeathThreatsWeWillContinuetoDoOurThingUntilHomophobiaisDone.json","image_url":"https://media.breitbart.com/media/2015/05/lee-daniels-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_01__1540934107.html","title":"Empire's Lee Daniels on Death Threats: 'We Will Continue to Do Our Thing Until Homophobia is Done'","title_page":"Empire's Lee Daniels on Death Threats: 'We Will Continue to Do Our Thing Until Homophobia is Done' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At the Produced By conference in Los Angeles on Sunday, Empire creator Lee Daniels revealed that he has received death threats over a gay storyline on his hit Fox television show.\nDaniels and Jussie Smollett, who plays Jamal, the gay middle child struggling for acceptance from his hip-hop mogul father Lucious Lyon on Empire, said they have both received death threats over the storyline, according to the Wrap.\n“Homophobia is real. It exists… Jussie and I both get death threats,” Daniels said during the panel discussion. “But we will continue to do our thing until homophobia is done.”\nDaniels also said a specific scene proved controversial to viewers.\n“I have to relate to these people honestly. That trash can scene? It happened,” the show’s creator said, referring to a scene in the first season in which Lucious Lyon (Terrence Howard) throws his son Jamal into a trash can for wearing women’s clothing.\nBoth Daniels and Smollett are gay.\nThe Empire Produced By panel also included writer and executive producer Danny Strong, and producers Brian Grazer, Ilene Chaiken, and Francie Calfo. The creative team spoke about the production process and how the record-breaking show has managed to defy expectations.\n“Danny (Strong) just gave me the headline of, ‘King Lear in the world of hip-hop,'” Grazer said, according to Variety. “And I knew very little about King Lear, but I did know all about hip-hop.”\nDaniels said that when he first began work on Empire, many people thought he was crazy for switching from directing critically-acclaimed movies like The Butler and Precious to helming a television project.\n“Everybody was shocked. All my director friends said I’d never be able to last a month and I didn’t think I would, either,” Daniels said.\nThe second season of Empire begins Sept. 23 on Fox.","url":"https://www.breitbart.com/entertainment/2015/06/01/empires-lee-daniels-on-death-threats-we-will-continue-to-do-our-thing-until-homophobia-is-done/"}
