{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:15:05","date_modify":"2018-10-30 21:15:05","date_publish":"2015-05-11 19:28:07","description":"Empire showrunner Lee Daniels sounded off on the lack of diversity in television dramas during a roundtable discussion with some of today's most successful TV writers. |","filename":"data/vaneerConsumption/EmpireShowrunnerLeeDanielsIHateWhitePeopleWritingforBlackPeople.json","image_url":"https://media.breitbart.com/media/2015/05/lee-daniels-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_05_11__1540934105.html","title":"'Empire' Showrunner Lee Daniels: 'I Hate White People Writing for Black People'","title_page":"'Empire' Showrunner Lee Daniels: 'I Hate White People Writing for Black People' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Empire showrunner Lee Daniels sounded off on the lack of diversity in television dramas during a roundtable discussion with some of today’s most successful TV writers.\nIn a wide-ranging conversation with TV creatives Damon Lindelof (Lost, The Leftovers), Beau Willimon (House of Cards), Alex Gansa (Homeland), Michelle King (The Good Wife), and Sarah Treem (The Affair), Daniels said he enjoys “going in and watching a room full of black people talking for me and writing words for black people.”\n“I hate white people writing for black people; it’s so offensive,” Daniels told the other writers, according to the Hollywood Reporter. “So we go out and look specifically for African-American voices. Yes, it’s all about reverse racism!”\nDaniels’ Empire is undoubtedly the biggest show on television today. In its first season, the show became the only primetime series in at least 23 years to increase its viewership every week. It is also the vanguard program in a new collection of more diverse television shows, including ABC’s Black-ish, Fresh Off the Boat, and Shonda Rhimes’ How To Get Away With Murder.\n“What upsets me is that there are many blacks who don’t like how I’m representing African-Americans right now,” Daniels said of the pressure to live up to viewer expectations. “And I’m like, ‘Well, this is the world that I know. This is as honest as I can be.'”\nWhen asked if they felt pressure to include more diverse talent in the writer’s rooms, some of the showrunners demurred.\n“I think you want your writers room to somehow reflect your show so that the conversations that are happening in the writers room can translate more easily to the screen,” Treem replied. “When we put the room of The Affair together, we specifically looked for half men, half women, and that’s important to our story.”\nDaniels asked each of the showrunners whether they had African-American writers in their writers rooms. Treem and Gansa answered that they did not, while King said there had been two on the most recent season of CBS’ The Good Wife.\nBut Beau Willimon called the question “weird,” and said there are “many different ways to talk about or measure diversity” in television shows.\n“How many women do you have?” Willimon asked Daniels. “How many Asian-Americans do you have? Just, it’s a weird question. But we have zero African-Americans in our writers room of six.”\nWillimon continued:\nA lot of times the story is about picking and choosing a sliver of the world that you might tell a story about, and that might just be about Jewish people during the Holocaust, where you’re not going to see any African-Americans. Or, if you’re in a concentration camp that’s just men, you’re not going to see any women. I think that our responsibility is to tell the truth, and if you’re telling the truth about your given sliver, however narrow or wide it is, then you’re contributing to the overall diversity of our collective story.\nKing explained that The Good Wife had two African-American female writers on its most recent season, and that one of them had remarked that she had “never been in a room where there’s another African-American woman.”\n“We weren’t hiring for ‘diversity,’ we were hiring the best writer at any given moment. But it was a telling remark,” King said.\n“It’s repulsive is what it is,” replied Daniels. “It’s inexcusable.”\nRead more of the Hollywood Reporter‘s roundtable discussion here.","url":"https://www.breitbart.com/entertainment/2015/05/11/empire-showrunner-lee-daniels-i-hate-white-people-writing-for-black-people/"}
