{"authors":["Associated Press"],"date_download":"2018-10-22 21:57:47","date_modify":"2018-10-22 21:57:47","date_publish":"2017-03-16 02:04:15","description":"NEW YORK (AP) - While TV star Jussie Smollett was in the recording studio working on his own music apart from \"Empire,\" set for release later this year, he...","filename":"data/vaneerConsumption/EmpiresJussieSmollettgetspoliticalinnewvideo.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/06/wire-226901-1489646989-155_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318666_Empires-Jussie-Smollett-gets-political-new-video_1540245467.html","title":"'Empire's' Jussie Smollett gets political in new video","title_page":"'Empire's' Jussie Smollett gets political in new video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - While TV star Jussie Smollett was in the recording studio working on his own music apart from \"Empire,\" set for release later this year, he couldn't help but write a song about what's going in the world, from injustice to President Donald Trump.\nThat's when he penned \"F.U.W,\" short for \"(expletive) up world,\" around President's Day and immediately directed a music video to bring his words to life. The clip will debut late Wednesday on his YouTube page.\nThe black-and-white video features men and woman of various ethnicities and highlights injustices, from human and LGBT rights to religious and racial prejudices. A woman wears a hijab in one scene, a boy wears a hoodie in another and four women put their fists up as they stand in front of the words, \"My body, my rights.\"\nFILE - In this May 20, 2016 file photo, Jussie Smollett attends the \"Empire\" FYC Event in Los Angeles. On Wednesday, March 15, 2017, Smollett debuted a music video for \"F.U.W.\", a song about injustice which he wrote and performs, on his YouTube page. (Photo by Richard Shotwell/Invision/AP, File)\n\"This song is for the oppressed. That's why I feel like people will connect with it because it is very broad, because oppression is so broad,\" he said in an interview Tuesday with The Associated Press.\nIn another scene, a man in a wheelchair runs over a Donald Trump mask.\n\"That mask is a representation of this false idea of patriotism. And that mask is a representation of this idea of white male privilege,\" 34-year-old Smollett said. \"It's so much bigger than him. It's what he represents, and it's because of that representation, that's why he's the president of the United States currently.\"\n\"It's our opportunity to take those masks off and shatter them, so that's what I did,\" he added.\nTrump's apparent mocking of a disabled reporter was widely criticized last year. Some of Smollett's \"F.U.W.\" lyrics focus on Trump and his administration: \"Why are we back in the past?/It's the same script different cast/All of these alternative facts/Catch me outside how about that?/Why is it so hard to keep hope?/Who got that popular vote?/Was the whole thing just a joke?/Was the whole thing just one big joke?\"\nOn Wednesday, Trump fired back at rapper Snoop Dogg days after the release of a music video in which he points a toy gun at a clown dressed like Trump and pulls the trigger.\nTrump tweeted: \"Can you imagine what the outcry would be if @SnoopDogg, failing career and all, had aimed and fired the gun at President Obama? Jail time!\"\nThe White House did not immediate return a request seeking comment about Smollett's video, which also features a black man standing in front of a noose, images of barbed wire and two water fountains with \"white\" and \"colored\" signs above them.\n\"We had written so many other great songs for my album, but this just felt like 'I can't wait for the album, I can't wait for a single,'\" said Smollett, who plans to release an official single this summer. \"You couldn't follow, you know, normal rules or normal protocol with this, you just had to get it out and luckily Columbia (Records) stood behind me.\"\nDuring the presidential campaign, Smollett and other \"Empire\" cast members appeared in an ad endorsing Democratic nominee Hillary Clinton.\nSmollett, who was one of the kid stars of \"The Mighty Ducks\" film, is set to appear in Ridley Scott's science fiction film \"Alien: Covenant\" this year. He said it was \"freeing\" to release a song apart from his \"Empire\" persona, and he challenged himself by directing the video.\n\"Because the song means so much to me and the message means so much to me, and what we're going through right now means so much to me, I wanted to do it justice. And I knew what was in my mind would do it justice,\" he said.\n_______\nOnline:\nhttps://www.youtube.com/user/jussiesmollett","url":"https://www.dailymail.co.uk/wires/ap/article-4318666/Empires-Jussie-Smollett-gets-political-new-video.html"}
