{"authors":[],"date_download":"2018-10-30 18:32:28","date_modify":"2018-10-30 18:32:28","date_publish":"2017-01-19 18:02:00","description":"A pharmacy technician who worked at a mid-Georgia Kroger is suing the company for illegal race-based discrimination and retaliation.","filename":"data/vaneerConsumption/EmployeesuesKrogeroverallegeduseofNworddiscrimination.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Rare_Life/2017/01/03/Images/photos.medleyphoto.12728299.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_employee-sues-kr_369c436d5f264517d5384c9cc5deb807__1540924348.html","title":"Employee sues Kroger over alleged use of N-word, discrimination","title_page":"Employee sues Kroger over alleged use of N-word, discrimination","title_rss":"NULL","source_domain":"ajc.com","text":"A pharmacy technician who worked at a middle Georgia Kroger is suing the company for race-based discrimination and retaliation.\nShontraye Hurt, the “only African American in her department working as a pharmacy technician,” was “forced to listen to racial slurs, excluded from full participation in the workplace and treated with disrespect and intimidation,” according to the lawsuit.\nThe filing lists numerous occasions that claim Hurt was subjected to a racially hostile work environment.\nIn November 2015, she allegedly heard the pharmacist of the Milledgeville store use the N-word in conversation at work.\nThe lawsuit says she made an oral complaint to the pharmacy manager, but despite being told the issue would be resolved after she attended a meeting with the pharmacist and others, no action was evidently taken.\nOther allegations can be read in the full suit below.\nMonths later, Hurt reportedly heard the N-word at work again—this time directed at her.\nThe suit says a customer called Hurt the N-word over the phone, and an employee who was present reported it to the pharmacist.\n“(The employee) reported this matter to (the pharmacist), who spoke with the customer on the phone but did not disclose to (Hurt) what was said to the customer,” the lawsuit says. “After this complaint of race discrimination, the customer continued to use the Kroger Pharmacy, but avoided (Hurt).”\nA week later, Hurt was called into an office by a Kroger representative to discuss the incident. According to the lawsuit:\n“During the meeting, (he) explained to (Hurt) why White people feel the way they do about Black people. (He) mentioned the only Black person he knew was his maid. (He) also told (Hurt) that he previously managed a restaurant call(ed) Cowboy Bills, and he had to kick out an interracial couple because the White customers were upset. (He) told (Hurt) he did not think (the pharmacist) was a racist. To (Hurt’s) knowledge no action was taken by Kroger as a result of (her) complaint.”\nA Kroger spokesman said the company cannot comment on details related to the case because the matter is pending litigation. Kroger’s registered agent, CSC of Cobb County, is located in Marietta.\nWeeks later, Hurt allegedly overheard the pharmacist joking with co-workers about being called to the “principal’s office” regarding her complaint of his use of the N-word.\nHe stopped answering her work-related questions, the suit said, and he and co-workers stopped working with her to complete tasks.\nThe pharmacist also allegedly said his wife, a school teacher, had “to discipline unruly African American students” and that “certain people need to discipline their kids,” comments which the lawsuit said made Hurt very uncomfortable.\nHurt noticed the pharmacist making African American customers wait for extended periods of time to get prescriptions filled, but he “did not subject non-African-American customers to long waits,” the lawsuit says.\nIn March 2016, Hurt expressed her complaints to human resources.\nIn an email described in the lawsuit, she detailed how she was once denied information on how to apply for a promotion, but a Caucasian employee was subsequently given that information — and the job. She wrote about how her complaints had gone unheeded.\nThe pharmacist was transferred to a different store about a month later, according to the lawsuit.\nThe lawsuit says Hurt has suffered lost wages and benefits, diminished employment opportunities and emotional distress including outrage, shock and humiliation.\nShe seeks lost wages and damages.\nHurt’s attorney, J. Stephen Mixon, said he cannot talk about the case because it's in litigation. His office would not speak to whether any action has been taken on the suit since it was filed Dec. 19.\nIn a racial discrimination lawsuit settled in 2008, The Kroger Co. “agreed to make certain programmatic changes in its employment policies” and pay $16 million in cash to all eligible black employees, according to Law360, a legal news and analysis website, and other media outlets.","url":"https://www.ajc.com/news/local/employee-sues-kroger-over-pharmacist-alleged-use-word-discrimination/FEANeLI4mCFKJrSVgRzQXL/"}
