{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 22:22:05","date_modify":"2018-10-22 22:22:05","date_publish":"2017-03-16 03:14:18","description":"Em Rusciano has made an emotional plea to her husband Scott Barrow during her Thursday morning breakfast show, begging him to help with the chores at home.","filename":"data/vaneerConsumption/EmRuscianohasaspatwithherhusbandliveonair.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E5068C100000578-0-image-a-37_1489631778596.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318596_Em-Rusciano-spat-husband-live-air_1540246925.html","title":"Em Rusciano has a spat with her husband live on air","title_page":"Em Rusciano has a spat with her husband live on air | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Em Rusciano has made an emotional plea to her husband Scott Barrow during her Thursday morning breakfast show, begging him to help with the chores at home.\nThe 38-year-old revealed that she does '90 percent' of the housework despite rising at 4am for her breakfast radio slot.\n'Babe, I'm tired man,' she said, addressing hubby Scott, who was listening in. 'I'm working hard. We get to do lots of fun stuff because I'm doing this radio job.\nHelp! Em Rusciano has made an emotional plea to her husband Scott Barrow during her Thursday morning breakfast show, begging him to help with the chores at home\n'And I need you to cook the dinner more. I'm so tired,' she added, her voice breaking despite her otherwise lighthearted discussion on the issue.\nEm earlier admitted that speaking about the issue live on air was a 'passive aggressive go at my husband' but felt she was at the end of her rope.\n'Because I start earlier, and because I do everything else, he should cook the dinner,' she told her co-host Harley Breen.\nEm explained that her husband works from 7am to 5pm while she is home at midday and he therefore feels she has more time to cook for their family.\nWorking hard: Em, pictured with her two daughters Marchella and Odette and husband Scott, said on air, 'Babe, I'm tired man. I'm working hard. We get to do lots of fun stuff because I'm doing this radio job'\n'We are at a point where he goes 'What's for dinner?' And I go, ''Whats for dinner?' (in response)' she said.\nThe former Australian Idol star said that by calling out her husband live on air, she was taking a stand for all Aussie women.\nEm said, 'In many Australian households, the jobs aren't equally divided. Women tend to do 90 percent, and run the house, and work.'\nFamily ties: Em earlier admitted that speaking about the issue live on air was a 'passive aggressive go at my husband' but felt she was at the end of her rope (pictured with their youngest daughter Odette)\nStrike! She added that a 'strike' from housework may shake Scott up, saying, 'I need to make a stand with my husband. I feel like perhaps I need to go on strike'\nShe added that a 'strike' from housework may shake Scott up, saying, 'I need to make a stand with my husband. I feel like perhaps I need to go on strike'.\nThe mother of two wasn't kidding about her workload, as in addition to rising at 4am for her radio show, Em is also a touring performer and author.\nShe published her memoir Try Hard: Tales from the Life of a Needy Overachiever in October 2016.\nMaking her point: The former Australian Idol star said that by calling out her husband on air, she was taking a stand for all Aussie women\nThe Try Hard tour followed, with dates around NSW, Melbourne, Brisbane, Tasmania and Adelaide between December and February.\nThe lively variety show involved the performer singing, dancing, doing comedy routines and following it all with a Q+A.\nAt one point, working both her radio gig and touring, in addition to raising a family, got too much, and Em tried to quit her radio show.\n'Last week, I quit my job twice. This one,' she said on her show last month.\nBrood: She and Scott have two daughters, Marchella, 14, and Odette, 9, and Em fell unexpectedly pregnant with her first daughter when she was 21\nEm explained, 'I was so upset. I was working both ends of the day. I was doing stand-up comedy, I was doing radio.'\nLuckily the Hit Network’s Head of Content, Gemma Fordham, talked her out of it.\nNot only is she a busy career woman, Em is both raising a family and working on her marriage.\nShe and Scott have two daughters, Marchella, 14, and Odette, 9, and Em fell unexpectedly pregnant with her first daughter when she was 21.\nStrong: 'I want my daughters to dream big and have adventures in life and it's really important for them to have some role modelling on that front,' Em said on her radio show\n'I want my daughters to dream big and have adventures in life and it's really important for them to have some role modelling on that front,' Em said on her radio show earlier this month.\nIn an open letter to her daughters published on Mamamia in January, Em wrote, 'You are the most impressive thing I've ever done, my greatest achievement, the loves of my life (besides your father, of course).'\nEm and her husband have been together for 18 years, and put their marriage back together last year after a six-month separation.\nShow girl: Em took her Try Hard tour around NSW, Melbourne, Brisbane, Tasmania and Adelaide between December and February\nLast year, the singer wrote in a column for news.com.au: 'We didn't separate for any specific reason, there were many factors.\n'And to be honest we probably didn't fix our relationship properly after the first time we separated (which was three years ago).'\nShe added, 'Slowly we came back together. We went away and worked on ourselves and started to relate to each other in a new way.'\nExhausted: At one point, working both her radio gig and touring, in addition to raising a family, got too much, and Em tried to quit her radio show\nThe couple live in Melbourne with their children, from where Em controversially broadcasts her Sydney based breakfast show.\nThe Em Rusciano Radio Show with Harley Breen replaced Rove McManus and Sam Frost who were removed from the breakfast slot after lacklustre ratings.\nOn air: The Em Rusciano Radio Show with Harley Breen replaced Rove McManus and Sam Frost who were removed from the breakfast slot after lacklustre ratings","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318596/Em-Rusciano-spat-husband-live-air.html"}
