{"authors":["Press Association"],"date_download":"2018-10-23 02:38:12","date_modify":"2018-10-23 02:38:12","date_publish":"2016-01-29 17:13:50","description":"The death of Gordon Goody, one of the last surviving members of the Great Train Robbery gang, marks \"the end of an era\", the son of one of his fellow robbers...","filename":"data/vaneerConsumption/endofaneraasgreattrainrobbergordongoodydiesinspainaged86.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-23279c37-1919-43ce-9b84-8ca24a677039-3bmscybNe842cce83474b5812efe-407_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422853_Great-Train-Robber-Gordon-Goody-dies-Spain-aged-86_1540262292.html","title":"'end of an era' as great train robber gordon goody dies in spain aged 86","title_page":"'end of an era' as great train robber gordon goody dies in spain aged 86 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'End of an era' as Great Train Robber Gordon Goody dies in Spain aged 86\nThe death of Gordon Goody, one of the last surviving members of the Great Train Robbery gang, marks \"the end of an era\", the son of one of his fellow robbers said.\nGoody, 86, died surrounded by friends on Friday morning in Mojacar, a town in the south of Spain where he ran a bar, the local town hall said.\nGoody, a hairdresser before the 1963 robbery, was jailed for 30 years for his role in the 1963 heist, one of the most famous in British criminal history which was dubbed the \"crime of the century\".\nGordon Goody, pictured during the Great Train Robbery trial in 1964\nMichael Biggs, son of Ronnie Biggs, one of the most famous of the 15-strong gang, spoke of his sadness at hearing of Goody's death.\nHe told the Press Association: \"I knew that he was ill, but I didn't know how ill he was, I've been away from the country for a few months.\n\"It is always sad to know someone's passed away and my thoughts are with his family at the moment, and I wish his family all the best.\n\"It's the end of an era. Now it's all down to the history books.\"\nAsked what his father would say at the news of his fellow gang-member's death, he said: \"He would say, 'We can finally all get together for a drink'.\"\nOn August 8 1963, a gang masterminded by Bruce Reynolds stopped the Glasgow-Euston overnight mail train as it passed through the Buckinghamshire countryside close to Cheddington.\nThe train was driven a mile and a half to Bridego Bridge, where the gang unloaded £2,631,684 in used notes - worth around £46 million today.\nBut they were later captured and 12 were jailed for a total of more than 300 years.\nMore than one broke out of prison, including Biggs, who spent over 30 years on the run before he finally returned to Britain in 2001 to face arrest.\nReynolds returned in 1968, five years after the crime, and was captured in Torquay and jailed for 25 years.\nGoody was sentenced to 30 years but released in 1975, setting up his Spanish bar four years later.\nThe Mojacar town hall statement said Goody died at 6am, and paid a glowing tribute to him, according to The Local, an English-language news website in Spain.\nA spokesman said: \" All who knew him were struck by his friendliness, his love for his friends and family and the many pets he rescued from the street.\n\"He was a complete gentleman, far removed from the image that those who didn't know him might have had from those difficult years that marked a large part of his life.","url":"https://www.dailymail.co.uk/wires/pa/article-3422853/Great-Train-Robber-Gordon-Goody-dies-Spain-aged-86.html"}
