{"authors":[],"date_download":"2018-10-30 00:54:21","date_modify":"2018-10-30 00:54:21","date_publish":"2014-05-19 08:00:00","description":null,"filename":"data/vaneerConsumption/EndoftheEuropeanDream.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/05/sipaphotosfour11026620copy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860861.html","title":"End of the European Dream?","title_page":"End of the European Dream?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Who says there’s anything wrong with the European Union? I mean, apart from the fact that it’s founded on little more than political hot air, that it’s profoundly undemocratic, that it struts and frets on the world stage, but, insecure about its own identity, is unable to muster either the will or the means to play a significant role in international affairs. That its only raison d’être is the obsessive, mischievous geographical and regulatory expansion that keeps unaccountable Eurocrats in Brussels at their tax-free jobs. That its botched attempt at creating greater unity with its own currency, the misbegotten euro, is instead stifling needed growth and causing deep divisions among its twenty-eight member states.\nToday, more and more Europeans are beginning to find a lot wrong with the EU. Many are wondering openly whether it is only a necessary nuisance or an actual handicap as Europe struggles to recover from the six-year-old economic crisis. After all, they were never asked whether they wanted this artificial postwar creation. The brainchild of a French cognac salesman named Jean Monnet, it was contrived by technocrats eager to try their hand at creating the biggest multinational bureaucracy—carrying out the most massive redistribution of wealth—since the United Nations. The peasants were never told where they were being led.\nContrary to the organic, bottom-up growth of an authentic nation, it was all done top-down, a technique the Brussels-based Eurocracy delicately terms the “democratic deficit.” As one early president of the European Commission, the EU executive branch, put it in an unwonted moment of candor, “We don’t know where we’re going, but we’re on our way.” In fact, the sham EU “presidency” is itself an excellent example of the Potemkin village that is the organization today: He is appointed without benefit of popular election, exercises no real executive powers, and commands no armed forces. Similarly, the EU claim that it has guaranteed peace in Europe is demonstrably fraudulent, conveniently overlooking that Europe has been sheltered for decades beneath the American nuclear umbrella and a U.S.-led NATO.\nFor that matter, “Europe”—the quotation marks distinguish the EU from the real Europe of sovereign nations—openly plagiarizes America’s national symbols. Its propagandists fondly refer to its “founding fathers,” they tout the goal of “ever closer union,” and its official flag features stars on a blue background. One high-flown declaration solemnly begins, “We the citizens of the European Union…” which echoes a certain American document.\nEuropeans were told by their political leaders that the EU would be worth surrendering their national sovereignty, including control over their historic borders. What they got was dislocation of their social order due to uncontrolled immigration and a huge increase of violent organized crime now able to circulate freely throughout the continent. They also got a scam-ridden technocracy answerable to no one—some years ago the corruption at EU headquarters in Brussels was so rife that the entire European Commission had to resign. The vast system of subsidies to virtually every interest group with a lobby lends itself to endemic abuse. Free trade among member states often came to mean crooked businesses collecting value-added tax on imported goods and then neglecting to pay it to governments, costing them billions a year in revenue. The EU’s own auditors have on occasion refused to sign off on its accounts. In their annual reports they cite rip-offs like phantom cattle declared to obtain grants, non-existent subsidized olive groves, and $10 billion worth of fake hospitals.\nOn the rare occasions when Europeans have been asked their opinion of the EU, they gave a thumbs down. Thus when the EU’s new constitution—a prime example of Eurospeak with two preambles, four main parts, twenty chapters, nineteen titles, fifteen sections, seventeen sub-sections, thirty-six annexed protocols, and a two-part finale—was put to referendums in France and the Netherlands, voters resoundingly rejected it. And if they hadn’t, the Danes and Brits were poised to give it the coup de grâce. Today it’s a safe bet that a majority of EU citizens agree with that fine fleur of American diplomacy, Victoria Nuland, when she memorably said off-record, “You know, f–k the EU.”\nThe British have been saying the equivalent of that at least since the days of Margaret Thatcher, and see no reason to change their minds. Today polls show that 48 percent would vote to leave the EU in a referendum—Prime Minister David Cameron has promised one in 2017 if he is still in office—39 percent would vote to stay in, and 13 percent are still pondering the matter. Despite the tussle with Moscow over Ukraine, another survey reveals that Britons have a better opinion of Vladimir Putin’s Russia than they do of the EU. Britain’s Euroskepticism is sometimes explained away as the result of its citizens’ insularity. But it’s the same story on the continent: During the last six years, the percentage of Europeans overall who say they have confidence in the EU has dropped from 57 percent to 33 percent.\nDuring his visit to Europe in March, President Obama spent much time listening to EU members, especially France, Germany, and Britain, explain why their vested interest in trade with Russia and their dependence on its natural gas meant they could implement only token sanctions against Putin for his annexation of Crimea and threats against Ukraine. It was also an exercise in handholding as he tried to convince them that Europe still figures large in U.S. policy despite his announced pivot toward Asia. He must have felt right at home with EU officials, a group as clueless about foreign policy as he is.\nIt was their clumsy attempt at eastward expansion, with the ill-considered offer of association to Ukrainian President Victor Yanukovych, that sparked the current crisis over Crimea. Their proposal, including closer political and economic ties, which they formally signed with his successor, Arseniy Yatsenyuk, on March 21, could only intensify Putin’s encirclement paranoia following the admission of Poland and the Baltic states to the EU and NATO. Despite his aggressive reaction to that deal—for which Ukraine paid with the loss of Crimea—the sorcerer’s apprentices in Brussels are staggering on with their Eastern Partnership program. Next hazardous step: formalizing association agreements with Russian neighbors Georgia and Moldova by next August, seemingly daring Putin to react again. He has already cut off Russian imports of Moldovan wine as a prelude to further unpleasantries.\n“The EU definitely miscalculated about Russia’s reaction,” Linus Linkevicius, the Lithuanian foreign minister, told the New York Times. “We are doing a lot of things too little and too late.” Swedish Foreign Minister Carl Bildt agrees. He points out that the EU diplomats got two crucial things wrong: They did not take seriously Moscow’s intention to protect Russians living outside the country, and they dismissed its threat of retaliation if Kiev signed the association pact. With loose cannons like this making European policy, the U.S. doesn’t need enemies.\nNothing daunted, the amateurish EU diplomatic corps, under its “foreign minister,” the pallid British leftist politician Catherine Ashton, dearly loves trying to extend its influence throughout the world. The goal seems to be turning the EU into a meddling mini-UN. How this creates “an ever closer union” among European nations remains unclear, but the EU wants to be seen as a big player on the world scene. The effort includes things like negotiating closer trade ties with the African Union, while sending individual African countries tens of millions of dollars for social programs. It gets its foot in the door of Middle Eastern affairs with trifling gestures like an official visit to the Pakistan Cricket Board as congratulations for its promotion of cricket. Nor is the Western Hemisphere beyond the reach of the EU’s fledgling global ambitions. It is offering eighteen Latin American countries a total of $3.4 billion in development aid over the next seven years. On America’s doorstep in the Caribbean it is doing a deal with Cuba to promote political and economic cooperation. And in the U.S. itself, the EU is trying to dictate to Wisconsin cheesemakers how to label their products: It forbids using names like Parmesan, Gorgonzola, or Brie, because those can come only from Europe.\nWhile busy with their grand schemes—today Europe, tomorrow the world—EU oligarchs have been overlooking the growing discontent at home. European opinion leaders have begun openly criticizing them for arrogantly imposing policies, including harsh austerity measures on countries like Greece and Spain, without democratic consultation. In Germany, one of the EU’s staunchest supporters, the poet and essayist Hans Magnus Enzensberger, who knew Nazi dictatorship under the Third Reich, warns that the high-handed way the unelected, autocratic European Commission imposes its policies constitutes “a denial of democracy.” His compatriot Jürgen Habermas, a prominent sociologist of the Frankfurt School, cautions that the EU is becoming “an organ of post-democratic domination.”\nBut today’s most vehement criticism is directed at the euro. The pro-EU establishment preaches the dogma that a shared currency is the magic key to European growth and stability. The euro’s critics\naccuse it instead of crippling Europe with its unworkable, one-size-fits-all monetary policies. Many conservative economists in the U.S., including Milton Friedman, have always said that the attempt to create monetary union for purely political purposes, without a foundation of joint fiscal and tax rules, was nonsense. Now they are being joined in Europe by the likes of François Heisbourg, who declares simply, “That thing just doesn’t work.”\nOne of Europe’s most influential think-tank gurus, Heisbourg is chairman of the International Institute for Strategic Studies in London and of the Geneva Centre for Security Policy, as well as special counselor to France’s Fondation pour la Recherche Stratégique. A longtime supporter of European unity and the EU itself, he observes that over the last quarter-century the EU has produced neither political union nor a true European citizenry, and certainly not a viable single currency. In his powerful recent book, a scathing critique of the EU entitled La Fin du Rêve Européen (“The End of the European Dream”), he notes that except for Japan, the EU has had the weakest economic growth in the industrialized world. “The world is advancing, but not Europe…such performance can only lead Europeans to conclude that the EU is not the solution but part of the problem.”\nHe insists that only radical change can get Europe back on the rails. That means getting rid of the euro and returning to the franc, D-mark, lira, and other national currencies that existed before the premature rush to a single European currency. To those who say that’s impossible, meaning the entire EU establishment, he points to Brazil’s replacement of the cruzeiro by the real in 1994 without damaging the economy. In other words, the euro must be sacrificed to save what’s left of the project of a unified Europe. The alternative is to watch the European dream become “an interminable nightmare.”\nMany ordinary Europeans, disappointed and disgusted by the European oligarchy, are likely to agree. That’s why the elections to the European Parliament on May 25 are forecast to produce a tsunami of votes for the National Front and other far-right and populist parties whose stated goal is reining in the EU and making it more responsive to Europeans’ real concerns. Either that, they threaten, or outright withdrawal of their member states from it.","url":"https://spectator.org/58757_end-european-dream/"}
