{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-22 21:16:32","date_modify":"2018-10-22 21:16:32","date_publish":"2016-01-28 07:12:17","description":"In what is the latest move by a Big Six supplier to reduce tariffs, the company said the reduction will take effect on March 29 and will save household gas customers on average £32 a year.","filename":"data/vaneerConsumption/EnergygiantSSEwillcutgaspricesby53inMarchintimeforSpring.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A766C000000578-0-image-a-64_1453965528630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420458_Energy-giant-SSE-cut-gas-prices-5-3-March-just-time-spring_1540242992.html","title":"Energy giant SSE will cut gas prices by 5.3% in March in time for Spring","title_page":"Energy giant SSE will cut gas prices by 5.3% in March in time for Spring | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Energy giant SSE announced today that it will cut gas prices by 5.3 per cent in two months’ time.\nIn what is the latest move by a Big Six supplier to reduce tariffs, the company said the reduction will take effect on March 29 and will save household gas customers on average £32 a year.\nIt comes just a week after rival E.ON announced it was lowering gas prices by 5.1 per cent from February 1. SSE said the reduction will come three months before its current price freeze ends.\nEnergy giant: SSE announced this morning that it will cut gas prices by 5.3 per cent from March 29\nRetail managing director Will Morris said: ‘When we announced our price freeze, we promised that we would not increase prices but would cut them if we could – and that’s exactly what we’ve done.\n‘This is our third successive reduction in household gas prices and shows our commitment to getting prices as low as we can and to fight for customers in a fiercely competitive market.’\nThe cut was praised by Secretary of State for Energy and Climate Change Amber Rudd as a ‘step in the right direction’.\nBut Martin Lewis, founder of Money Saving Expert and www.cheapenergyclub.co.uk, branded the reduction as ‘trivial’.\nHe said: ‘Again it's just a trivial 5 per cent on gas only, not electricity, nothing close to the drop in wholesale prices. Energy firms must be whooping for joy that they can get away with such small cuts.’\nSSE's price cut will not take effect until after Easter, but SSE said it comes three months before its current price freeze comes to an end.\nRetail boss: Will Morris said it was SSE's 'third successive reduction in household gas prices and shows our commitment to getting prices as low as we can and to fight for customers in a fiercely competitive market'\nThe group pledged to keep energy prices on hold in March 2014 until the end of June 2016. Miss Rudd called for other UK providers to drop their prices.\nPraised: Secretary of State for Energy and Climate Change Amber Rudd said the cut was a 'step in the right direction'\nShe said: ‘I'm absolutely clear that the market must provide a fair deal for consumers and that's why I've been pressing energy companies to put their customers first and pass on savings to them.\n‘SSE has taken a step in the right direction and I urge other suppliers to follow suit.’\nSSE insisted wholesale energy prices make up an ‘ever smaller proportion’ of customer bills, with many other cost pressures affecting tariffs and limiting the ability to pass on cuts.\nThe group revealed it lost customers since last March, with electricity and gas accounts reducing by 30,000 to 8.28million.\nIt said customers also used less electricity, down 3 per cent, while gas usage remained flat.\nAlistair Phillips-Davies, chief executive of SSE, said market conditions were ‘challenging’, with the group hit by one of the warmest winters on record and the impact of Storm Frank on its networks in the north of Scotland last month, which saw winds of 90mph and significant flooding.\nThe group said it restored power to 93 per cent of affected customers within 12 hours.\nMr Phillips-Davies added: ‘I am pleased that we have been able to announce a reduction in retail gas prices - our third consecutive reduction in household energy prices - and to achieve a significant reduction in the number and duration of power cuts experienced by our network customers.’\nAlso today, This is Money revealed energy bills are set to go up by an average of £206 this weekend for households on one of the 26 fixed energy tariffs that expire at the end of the week.\nCo-operative Energy, Extra Energy, First Utility, M&S Energy, Npower, Sainsbury's Energy and Scottish Power all have fixed tariffs that will come to an end on Sunday.\nAside from SSE and E.ON, the remainder of the Big Six have been facing mounting criticism for failing to pass on the falling price of wholesale energy prices to customers.\nThird successive reduction Will Morris, SSE retail managing director\nWholesale gas and electricity costs fell 23 per cent in 2015 to a five-year low, according to energy pricing experts ICIS.\nMr Morris added: 'Wholesale energy prices account for an ever-smaller proportion of the bill and there are different cost issues affecting electricity and gas.","url":"https://www.dailymail.co.uk/news/article-3420458/Energy-giant-SSE-cut-gas-prices-5-3-March-just-time-spring.html"}
