{"authors":["Press Association"],"date_download":"2018-10-23 03:50:41","date_modify":"2018-10-23 03:50:41","date_publish":"2017-03-10 13:38:06","description":"\"An artificial origin is worth contemplating and checking,\" researchers said.","filename":"data/vaneerConsumption/Energyflashesindistantgalaxiescouldbealienspacecraft.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196223-1489153090-567_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4301308_Energy-flashes-distant-galaxies-alien-spacecraft_1540266641.html","title":"Energy flashes in distant galaxies `could be alien spacecraft´","title_page":"Energy flashes in distant galaxies `could be alien spacecraft´ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mysterious flashes of energy detected in distant galaxies may be evidence of super-advanced aliens powering interstellar spacecraft, theorists claim.\nFast Radio Bursts (FRBs) are intense radio pulses that last no more than a millisecond. Since their discovery in 2007, fewer than two dozen have been detected by the world’s largest radio telescopes – and their origin remains unknown.\nAstronomers know almost nothing about them other than that they appear to occur in very remote galaxies billions of light years away.\na light-sail powered by a radio beam (red) generated on the surface of a planet\nNow a team of US scientists from Harvard University has put forward the serious suggestion that FRBs could be evidence of aliens at work.\nNew research suggests mysterious phenomena could be evidence of advanced alien technology. Release: https://t.co/hxAgUIpEvA pic.twitter.com/7uy5DXA4mE — SmithsonianObs (SAO) (@saoastro) March 9, 2017\nThe bursts may be leaked energy from unimaginably powerful transmitters capable of sending giant light sail ships on voyages between stars, said the researchers writing in the journal Astrophysical Journal Letters.\nProfessor Avi Loeb, from the Harvard-Smithsonian Centre for Astrophysics, said: “Fast radio bursts are exceedingly bright given their short duration and origin at great distances, and we haven’t identified a possible natural source with any confidence. An artificial origin is worth contemplating and checking.”\nIn a new study, Prof Loeb and Harvard colleague Dr Manasvi Lingham looked at the feasibility of building a radio transmitter powerful enough to be detectable across such immense distances.\nThey concluded that a solar-powered system would generate the required amount of energy if it used an area twice the size of Earth to capture the sun’s rays.\nWater-cooling on a colossal scale would be needed to prevent the underlying structure melting. But the question remains, why go to the trouble of constructing such an instrument in the first place? The most likely explanation is to drive interstellar light sails, the scientists argue.\nA light sail uses the tiny amount of pressure exerted by light to produce a small but continuous acceleration that over time allows a space craft to attain great speeds.\nThe energy levels responsible for FRBs would be enough to push a payload weighing a million tons – about 20 times the mass of the largest cruise ships on Earth.\n“That’s big enough to carry living passengers across interstellar or even intergalactic distances,” said Prof Lingam.","url":"https://www.dailymail.co.uk/wires/pa/article-4301308/Energy-flashes-distant-galaxies-alien-spacecraft.html"}
