{"authors":["Pa Reporter"],"date_download":"2018-10-22 20:33:52","date_modify":"2018-10-22 20:33:52","date_publish":"2016-01-29 02:17:59","description":"England's Charley Hull and Scotland's Catriona Matthew were among a group of seven players tied for the lead after the opening round of the Pure Silk Bahamas LPGA Classic.","filename":"data/vaneerConsumption/EnglandsCharleyHulloneofsevenplayerstiedfortheleadafterroundoneofthePureSilkBahamasLPGAClassic.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30ADD1AC00000578-0-image-a-99_1454033518492.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-3422120_England-s-Charley-Hull-one-seven-players-tied-lead-round-one-Pure-Silk-Bahamas-LPGA-Classic_1540240432.html","title":"England's Charley Hull one of seven players tied for the lead after round one of the Pure Silk Bahamas LPGA Classic","title_page":"England's Charley Hull one of seven players tied for the lead after round one of the Pure Silk Bahamas LPGA Classic | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"England's Charley Hull and Scotland's Catriona Matthew were among a group of seven players tied for the lead after the opening round of the Pure Silk Bahamas LPGA Classic.\nBoth fired five under par rounds of 68 to sit on top of the leaderboard along with Americans Paula Creamer, Alison Lee and Ashley Ramsey and Japanese pair Mika Miyazato and Haru Nomura.\nCreamer had an eagle, five birdies and two bogeys in her round.\nEngland's Charley Hull is one of seven tied for the lead after round one of the Pure Silk Bahamas LPGA Classic\nPaula Creamer, of the United States, is also tied for the lead in the Bahamas alongside 19-year-old Hull\nBoth fired five under par rounds of 68 to sit on top of the leaderboard following the opening round\nHull shot a blemish-free round which included five birdies and Matthew had an eagle and four birdies, dropping just one shot during her round.\nEngland's Holly Clyburn finished with an even round of 73 after a double bogey six on the 16th hole was added to dropped shots on the second, ninth and 12th.","url":"https://www.dailymail.co.uk/sport/golf/article-3422120/England-s-Charley-Hull-one-seven-players-tied-lead-round-one-Pure-Silk-Bahamas-LPGA-Classic.html"}
