{"authors":["Paul Newman For Mailonline"],"date_download":"2018-10-23 02:31:05","date_modify":"2018-10-23 02:31:05","date_publish":"2016-01-11 14:48:41","description":"PAUL NEWMAN IN JOHANNESBURG: The sight of Trevor Bayliss putting England through rigorous catching practice was an indication of the size of the prize within their grasp this week.","filename":"data/vaneerConsumption/EnglandputthroughtheirpacesinthefieldaheadofthirdTestascoachTrevorBaylisseyesupseriesvictoryinSouthAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B1B9A00000578-0-image-a-84_1452523246370.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3393996_England-paces-field-ahead-Test-coach-Trevor-Bayliss-eyes-series-victory-South-Africa_1540261865.html","title":"England put through their paces in the field ahead of third Test as coach Trevor Bayliss eyes up series victory in South Africa","title_page":"England put through their paces in the field ahead of third Test as coach Trevor Bayliss eyes up series victory in South Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The sight of an animated Trevor Bayliss putting England through rigorous catching practice on their return to work at the Wanderers on Monday was an indication of the size of the prize within their grasp this week.\nThe England coach, usually such a laid-back and understated figure on the training field, does not want the opportunity of a series win against the best team in the world on their own patch to slip through his fingers now.\nCertainly the chance to go 2-0 with two to play at Cape Town was wasted by an England side who saw 10 chances go begging during their 211 overs in the field and a repeat in Thursday’s third Test here will not be tolerated by Bayliss.\nJonny Bairstow practices his wicket-keeping skills at England's training session in Johannesburg\nEngland coach Trevor Bayliss and captain Alastair Cook returned to work as they eye a third Test victory\nSo chance after chance was offered in the thin air of the Highveld at this imposing ground on Monday and the vast majority of them were taken, including an absolute screamer of a one-handed catch in the deep by Chris Jordan.\nSadly Jordan will not be in the team on Thursday for a Test where England can seal a notable triumph with one match to play but at least he can resume the 12th man duties that were beyond him at Newlands because of the virus that has claimed Nick Compton as its latest victim.\nNot that England have suddenly become a bad catching side overnight and it was left to Jonny Bairstow to defend the record of a team whose lapses came as a shock to Bayliss, a coach who puts great store by quality fielding.\nThe Wanderers in Johannesburg will be the venue for the third Test beginning on Thursday\nEngland returned to work on Monday with a rigorous training session as they look for a 2-0 lead in the series\nStuart Broad, Joe Root, Cook and coach Bayliss on the pitch at the Wanderers during England's training\n‘Fielding has been a priority ever since Trev took over to be honest,’ said Bairstow, who came of age as a Test batsman in Cape Town and is striving here to do the same as a keeper. ‘I think you saw the amount of catches we took in the summer – some of those in the Ashes were ridiculous – so last week was just a bit of a blip as far as we’re concerned. At no point were we taking it lightly.’\nThe tone of a team’s fielding, of course, can be set by the keeper and Bairstow, who made a maiden Test century at Newlands but dropped Temba Bavuma on the way to his own, accepted the view of Bayliss that his glovework remains ‘a work in progress.’\n‘I was satisfied with the bulk of my keeping in Cape Town and I’m pleased with the way it’s going,’ said Bairstow. ‘I don’t think you can ever say you’ve nailed it but I’ve only kept in four or five Tests and it’s still a massive learning curve. I’m still bedding into Test cricket as a wicketkeeper.’\nHe will now get an extended chance to bed in further with England encouraging Jos Buttler, for now, to concentrate on limited-overs cricket and take a full part in the Indian Premier League this Spring.\nRoot attempts to take a diving catch during England's training session in Johannesburg on Monday\nEngland bowlers James Anderson (right) and Steven Finn (centre) are put through their paces\nBayliss and Cook have a discussion during England's session in the nets on Monday at the Wanderers\nBairstow has looked more comfortable with the tempo of batting at No 7 even though he is a good enough batsman to bat in the top five and now wants to emulate Matt Prior in becoming a genuine all-rounder.\n‘I like to think so,’ said Bairstow when asked if he now considered himself a genuine batsman-keeper. ‘I’ve invested a lot of time and energy and a lot of pain in my keeping as well as my batting. I don’t see any reason why I can’t have a long career keeping wicket for England but also contributing with my batting.’","url":"https://www.dailymail.co.uk/sport/cricket/article-3393996/England-paces-field-ahead-Test-coach-Trevor-Bayliss-eyes-series-victory-South-Africa.html"}
