{"authors":["Paul Newman For Mailonline"],"date_download":"2018-10-23 03:50:39","date_modify":"2018-10-23 03:50:39","date_publish":"2017-03-16 14:56:56","description":"Strauss has brought back a rivalry which dates back to 1836 as part of his crusade to make white-ball cricket as important as the Test game ahead of the Champions Trophy.","filename":"data/vaneerConsumption/EnglandWorldCuprecordcouldbehelpedbyNorthvSouth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E4A651700000578-0-image-a-100_1489675653156.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4320604_England-World-Cup-record-helped-North-v-South_1540266639.html","title":"England World Cup record could be helped by North v South","title_page":"England World Cup record could be helped by North v South | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andrew Strauss believes the revival of cricket’s North v South rivalry will boost England’s attempt to end their ‘awful’ World Cup record.\nEngland’s team director has brought back a rivalry which dates back to 1836 as part of his crusade to make white-ball cricket here as important as the Test game ahead of this year’s Champions Trophy and the 2019 world tournament.\nTo that end, Strauss sees the three-match series, which begins in Dubai on Friday, as a key part of England’s strategy to see them finally triumph in a 50-over format where they have traditionally floundered in global events.\nJames Vince (L) and Keaton Jennings (R) will captain the North and South teams in Dubai\nEngland director Andrew Strauss believes the rivalry could turn England's World Cup fortunes\n‘Being blunt, our record at world cups is awful,’ said Strauss of an event England have never won. ‘So it’s safe to assume that if we do the same things we’ve done ahead of previous tournaments we should expect similar results.\n‘The north-south series is an example of our determination to leave no stone unturned over the next three years in our preparation for the 2019 competition and to change the perception of 50-over cricket domestically.’\nEight of the selected players earned their places through their performances in last season’s Royal London Cup in an attempt to unearth a previously overlooked 50-over talent pool from domestic cricket\nBut there are plenty of players from in and around the current England one-day side included in teams coached by England assistants Paul Farbrace and Ottis Gibson and captained by Keaton Jennings and James Vince.\nEngland coach Trevor Bayliss will be an interested observer and will have a particular eye on Durham’s Mark Wood, a key bowler when fit, as he continues his comeback from another ankle operation.\nEngland paceman Mark Wood will be turning out for the North in the first match on Friday","url":"https://www.dailymail.co.uk/sport/cricket/article-4320604/England-World-Cup-record-helped-North-v-South.html"}
