{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-23 02:08:13","date_modify":"2018-10-23 02:08:13","date_publish":"2016-01-11 13:45:43","description":"The app (pictured), built by researchers from the University of Cambridge, attempts to guess a user's regional accent based on their pronunciation of 26 words and colloquialisms.","filename":"data/vaneerConsumption/EnglishDialectsappguesseswhereYOURaccentisfrom.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AABC000000578-0-image-a-63_1452520881246.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393935_Can-app-guess-accent-English-Dialects-tool-predicts-hometown-based-pronounce-26-different-words_1540260493.html","title":"English Dialects app guesses where YOUR accent is from","title_page":"English Dialects app guesses where YOUR accent is from | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The English Dialects app (pictured) claims to be able to guess your hometown by asking you a series of multiple-choice questions\nDo you say splinter or spool, or pronounce the word 'three' with a 'f' rather than a 'th'?\nThe answers to these questions could reveal more about you than you think.\nAn app claims to be able to use your answers to such questions to guess your hometown through a series of multiple-choice questions.\nCalled English Dialects, the app generates a heat map based on your answers and guesses where your accent is from.\nThe free app, available for iOS and Android, was built by researchers from the University of Cambridge.\nIt attempts to guess a user's regional accent based on their pronunciation of 26 words and colloquialisms.\nUsers can either select which word they use to describe an item, or they can listen to how different words are pronounced and select the most appropriate.\nFor example, one question asks what word the person uses to describe a small piece of wood that becomes lodged in a finger.\nAnother question features audio clips of a man saying the word 'bacon' in various different ways, and asks the user to select the clip that sounds most like their own pronunciation of the same word.\nIt also asks the endlessly contentious English question of whether 'scone' rhymes with 'gone' or 'cone'.\nAt the end of the quiz, the app generates a heat map and tries to guess where the user's accent is from using three possible locations.\nUsers can rate how accurately the app determined where they are from and give feedback to improve the its accuracy.\nThe app also allows users to view which areas of the country use the different variations of each word or colloquialism at the end of the quiz.\nAnd they can additionally listen to both historic and contemporary pronunciations, taking what the researchers call 'an auditory journey through England.'\nThe old recordings are now held by the British Library and were made available for use in the app.\nThe app tries to predict a user's regional accent based on their pronunciation of 26 words and colloquialisms. Users can either select which word they use to describe an item (example pictured left), or they can listen to how different words are pronounced and select the most appropriate (pictured right)\nUsing the answers, the app generates a heat map and tries to guess where the user's accent is from using three possible locations (pictured right). The questions are based on the Survey of English Dialects that took place between 60 and 70 years ago\n'We want to document how English dialects have changed, spread or levelled out,' said Dr Leemann, a researcher at Cambridge's Department of Theoretical and Applied Linguistics.\n'The first large-scale documentation of English dialects dates back 60 to 70 years, when researchers were sent out into the field - sometimes literally - to record the public.\nHOW TO USE ENGLISH DIALECTS The free app, available for iOS and Android, was built by researchers from the University of Cambridge. It attempts to guess a user's regional accent based on their pronunciation of 26 words and colloquialisms. Users can either select which word they use to describe an item, or they can listen to how different words are pronounced and select the most appropriate. For example, one question asks what word the person uses to describe a small piece of wood that becomes lodged in a finger. Another question features audio clips of a man saying the word 'bacon' in various different ways, and asks the user to select the clip that sounds most like their own pronunciation of the word. The app then generates a heat map and tries to guess where the user's accent is from using three possible locations. They can rate how accurately the app determined where they are from and give feedback to improve the app's accuracy. The app also allows users to view which areas of the country use the different variations of each word or colloquialism at the end of the quiz.\n'It was called the \"Survey of English Dialects\". In 313 localities across England, they documented accents and dialects over a decade, mainly of farm labourers.'\nThe English language app follows the team's apps for German-speaking Europeans, which accumulated more than one million hits in four days, and more than 80,000 downloads of the app by German speakers in Switzerland.\nThe researchers used this historical material for the dialect guessing app, which allows them to track how dialects have evolved into the 21st century.\n'Much of our understanding of the regional distribution of different accent and dialect features is still based on the wonderful but now outdated Survey of English Dialects – we haven't had a truly country-wide survey since,' said Professor David Britain, a dialectologist and member of the app team based at the University of Bern in Switzerland.\n'We hope the app will harness people's fascination with dialect to enable us to paint a more up-to-date picture of how dialect features are spread across the country.'\nHowever, while the Swiss version of the app proved to be highly accurate, Dr Leemann and his colleagues have sounded a more cautious note on the accuracy of the English dialect app.\n'English accents and dialects are likely to have changed over the past decades,' explained Dr Leemann.\n'This may be due to geographical and social mobility, the spread of the mass media and other factors.\n'If the app guesses where you are from correctly, then the accent or dialect of your region has not changed much in the last century.","url":"https://www.dailymail.co.uk/sciencetech/article-3393935/Can-app-guess-accent-English-Dialects-tool-predicts-hometown-based-pronounce-26-different-words.html"}
