{"authors":["Tom Farmery For Mailonline"],"date_download":"2018-10-23 01:45:27","date_modify":"2018-10-23 01:45:27","date_publish":"2016-01-11 12:56:28","description":"Sampson guided England to third place - the nation's highest ever finish - at the World Cup in Canada last summer after narrowly missing out on a place in the final.","filename":"data/vaneerConsumption/EnglandwomensheadcoachMarkSampsonagreesnewdealtokeephiminchargeuntil2019WorldCupinFrance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/0D53E15400000514-0-image-a-10_1452516968057.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-3393870_England-women-s-head-coach-Mark-Sampson-agrees-new-deal-charge-2019-World-Cup-France_1540259127.html","title":"England women's head coach Mark Sampson agrees new deal to keep him in charge until 2019 World Cup in France","title_page":"England women's head coach Mark Sampson agrees new deal to keep him in charge until 2019 World Cup in France | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mark Sampson, the head coach of the England women's football team, has agreed a new two-year deal with the FA which will keep him in charge beyond the 2019 World Cup.\nSampson guided England to third place - the nation's highest ever finish - at the World Cup in Canada last summer after narrowly missing out on a place in the final.\nHe said: 'I am delighted to have agreed to continue working with the Lionesses through to the 2019 FIFA Women's World Cup [in France].\nMark Sampson has been rewarded for guiding England's women to their highest place in a World Cup last year\n'It is an honour and a privilege to manage such a fantastic group of people who represent their country with incredible pride and passion.'\nSampson was full of emotion after the 2-1 defeat by Japan in the semi-final at the Commonwealth Stadium in Edmonton.\nNo one can forget Laura Bassett's painful 92nd minute own goal that gifted Japan their ticket to the final.\nBut Sampson understands that England can come back stronger.\nHis team also look certain to feature in next summer's European Championship in Holland after winning all of their qualifying games so far.\nSampson offers support for Laura Bassett after her own goal gifted Japan their ticket to the World Cup final\nSampson, who is shortlisted for FIFA Women's World Coach of the Year at Monday's Ballon d'Or awards in Zurich, said: 'We have all worked very hard over the last two years to improve both individually and collectively and our World Cup bronze medal highlights the progress this team has made.\n'It was crucial post the World Cup that we worked hard to continue to grow the game and I am pleased, with the steps we have taken, we are ready to do just that.'\nThe FA's technical director Dan Ashworth said: 'We're committed to the growth and development of the women's game and our focus is on creating winning England teams.","url":"https://www.dailymail.co.uk/sport/article-3393870/England-women-s-head-coach-Mark-Sampson-agrees-new-deal-charge-2019-World-Cup-France.html"}
