{"authors":["Press Association"],"date_download":"2018-10-23 05:12:20","date_modify":"2018-10-23 05:12:20","date_publish":"2016-01-11 18:21:12","description":"Warrington have appointed England international Chris Hill as their captain for 2016. The former Leigh prop has made 132 appearances since making his Super League debut in 2012,","filename":"data/vaneerConsumption/EnglandinternationalChrisHillappointedWarringtoncaptainfor2016campaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300CE5ED00000578-0-image-a-12_1452535514571.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyleague_article-3394295_England-international-Chris-Hill-appointed-Warrington-captain-2016-campaign_1540271540.html","title":"England international Chris Hill appointed Warrington captain for 2016 campaign","title_page":"England international Chris Hill appointed Warrington captain for 2016 campaign  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The former Leigh prop will succeed last year's skipper Joel Monaghan\nWarrington have appointed England international Chris Hill as their captain for 2016.\nThe former Leigh prop, who has made 132 appearances since making his Super League debut in 2012, steps up from the role of Wolves vice-captain to succeed last year's skipper Joel Monaghan, who has moved to Castleford.\nWarrington head of coaching and rugby Tony Smith said: 'Chris has been a leader at the club for a number of seasons.\nWarrington have appointed England international Chris Hill as their captain for the 2016 Super League season\n'We see on a week-to-week basis his leadership qualities out on the pitch. However, his attitude towards training and how he conducts himself off the pitch is also first class.\n'Although Chris will be named as captain, we have a number of other players who provide fantastic leadership and will support Chris in his role.'\nHill said: 'I feel immensely proud to be appointed as the captain of this great club. There have been a number of great leaders and captains who have gone before me so to be added to this list is quite humbling.'","url":"https://www.dailymail.co.uk/sport/rugbyleague/article-3394295/England-international-Chris-Hill-appointed-Warrington-captain-2016-campaign.html"}
