{"authors":["Sam Peters For Mailonline"],"date_download":"2018-10-23 00:34:09","date_modify":"2018-10-23 00:34:09","date_publish":"2017-03-16 10:00:23","description":"Billy Vunipola and Anthony Watson return to England's starting line-up as Eddie Jones names his strongest side of the tournament for Saturday's potentially historic Six Nations clash with Ireland.","filename":"data/vaneerConsumption/EnglandrugbyteamforSixNations2017tievsIreland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E43F9FD00000578-0-image-a-8_1489658226960.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4319428_England-rugby-team-Six-Nations-2017-tie-vs-Ireland_1540254849.html","title":"England rugby team for Six Nations 2017 tie vs Ireland","title_page":"England rugby team for Six Nations 2017 tie vs Ireland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Billy Vunipola and Anthony Watson return to England's starting line-up as Eddie Jones names his strongest side of the tournament for Saturday's potentially historic Six Nations clash with Ireland.\nJones' unbeaten team needs just one more victory to become only the sixth team in history to secure a back-to-back Grand Slams and notch up a world record 19th successive Test win in the process.\nThe England coach is able to name an almost fully fit squad with Vunipola's return to the starting line-up at No 8 in place of Nathan Hughes a massive psychological boost as they look to make history on St Patrick's Day weekend in Dublin.\nBilly Vunipola was expected to miss the entire Six Nations after undergoing knee surgery\nAnthony Watson replaces the unfortunate Jack Nowell on England's right wing this weekend\nVunipola, considered by many to be the world's best No 8, underwent knee surgery last November and had been expected to miss the entire Six Nations but returned a fortnight ago for his club Saracens and was drafted onto England's bench against Scotland last weekend.\nAn impressive contribution off the bench in the second half was enough to convince Jones the 24-year-old powerhouse is fit enough to start against Ireland and his return to the starting line-up is one of two changes to the team that ran in seven tries against Scotland at Twickenham.\nWatson replaces the unfortunate Jack Nowell on England's right wing after also making his return from injury off the bench against Scotland.\nThe Bath flyer has suffered an injury-ravaged season, breaking his jaw in training last October before suffering a hamstring strain training in Portugal in January.\nElliot Daly appears to have shaken off the 'possible concussion' he suffered against Scotland\nLike Vunipola, he has only had one start for his club since returning from injury, but Jones considers him ready to make his first England start since last summer's historic tour of Australia. Nowell has to settle for a place on the replacement's bench.\nENGLAND'S SIX NATIONS RESULTS Feb 4 - England 19-16 France Feb 11 - Wales 16-21 England Feb 26 - England 36-15 Italy March 11 - England 61-21 Scotland\nElliot Daly appears to have shaken off the effects of the 'possible concussion' he suffered in the opening minutes against Scotland and is named on the left wing while Northampton flanker Tom Wood will win his 50th cap off the bench as Jones challenges his men to reach for greatness.\n'We've had a really good week's preparation,' said England head coach Jones.\n'The intensity of training has been good. It's going to be quite an occasion in Dublin so we understand we have to be prepared emotionally, physically and mentally.\n'The mood in camp has been positive. We're very excited ahead of what is a huge opportunity for the players. You sense the intensity has stepped up; it has in training, definitely.\nEngland head coach Eddie Jones says his squad have had a 'really good week of preparation'\n'The message to the players has been quite simple, we're playing Ireland on Saturday and that is the only thing that counts. We are focusing on preparing well, the only thing we can control is our preparation.\n'Ireland not having anything to play for means they have the courage to fail which frees them up mentally, we are a little bit vulnerable because we have already been crowned the RBS 6 Nations champions and we had a big win against Scotland, so for us it's getting the right mind-set for the game.\n'I congratulate Tom Wood on his personal milestone. He is a committed team man, who has fought his way back into this set-up and has been a great contributor to the team on and off the field. He works very hard and it's a great reward for him.'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4319428/England-rugby-team-Six-Nations-2017-tie-vs-Ireland.html"}
