{"authors":["Matt Maltfor Mailonline"],"date_download":"2018-10-23 02:07:55","date_modify":"2018-10-23 02:07:55","date_publish":"2017-03-10 11:05:11","description":"Owen Farrell is a doubt for England's crunch Six Nations showdown with Scotland on Saturday after he was unable to take part in the eve-of-match captain's run.","filename":"data/vaneerConsumption/EnglandrugbynewsOwenFarrelldoubtfulforScotlandtie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E2248AB00000578-0-image-a-21_1489143166982.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4300808_England-rugby-news-Owen-Farrell-doubtful-Scotland-tie_1540260475.html","title":"England rugby news: Owen Farrell doubtful for Scotland tie","title_page":"England rugby news: Owen Farrell doubtful for Scotland tie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Owen Farrell is a doubt for England's crunch Six Nations showdown with Scotland on Saturday after he was unable to take part in the eve-of-match captain's run.\nFarrell received treatment from the Red Rose medical team and was withdrawn from the squad's final session of the week on Thursday morning.\nThe 25-year-old was at Twickenham on Friday as part of the squad preparing for Saturday's Calcutta Cup clash but he didn't participate in any training drills.\nOwen Farrell was forced to miss the captain's run on Friday after picking up a leg injury\nThe 25-year-old watched on as his England team-mates prepare for crunch Scotland clash\nFarrell does keepy-ups with the ball during the captain's run which he was forced to miss\nFarrell appears in high spirits despite the possibility of missing Saturday's Six Nations match\nFarrell didn't take part in the training drils\nFarrell, George Ford and Mike Brown were given kicking guidance by Jonny Wilkinson, but Farrell was just rehearsing his technique and not actually kicking.\nEngland will give him until as late as possible on Saturday to recover - and there are no additions in place as cover.\n'Owen didn't train today and we're monitoring his leg injury. It's a leg injury,' defence coach Paul Gustard said.\n'We have until tomorrow before kick-off to make a decision, which means he has at least another 24 hours of recovery ahead of him. We'll make a call as and when we know more.\n'We're not bringing anyone in. We're obviously very happy with Ben (Te'o) in the squad. We have Jonny May with us at the moment as 24th man, so we have some flexibility as cover.\n'We're really confident (if Owen misses out). We're very happy with the squad that we've got and the 24 that we chose for this game. Whatever combination we end up with at 10, 12, 13, we're happy.'\nFarrell's absence will come as a major concern to Eddie Jones, who selected his star man at inside centre for the Six Nations contest.\nThe Saracens star appears to have been unable to overcome an injury to his left leg, which forced him to leave the training pitch in Surrey on Thursday.\nDespite wearing training gear, Farrell was forced to look on as Jonny Wilkinson catches the ball\nFarrell throws the ball to Wilkinson, who famously won the 2003 World Cup with England\nFarrell, George Ford and Mike Brown (left) were given kicking guidance by Wilkinson\nIt remains unclear the extent of the injury but it will be a huge blow to Jones should Farrell not recover in time for Saturday's Calcutta Cup clash.\nJones admitted on Thursday that Farrell 'could be a doubt' for the clash after he failed to finish that day's training session.\n'Owen could be a doubt. He's got a bad leg, so he couldn't finish training. He'll be all right,' Jones said.\n'I think he ran into my dog. My dog was running around and he ran into it.'\nThe Saracens star holds a kicking tee during the captain's run, which he didn't take part in\nThe England centre puts his hands on his hips as he looks to overcome his leg injury\nFarrell looks on while Jack Nowell, who will start on Saturday, was able to take part in session\nWhen it was pointed out to Jones that he had given conflicting answers over Farrell's fitness, Jones replied: 'Yeah, but I think he'll be all right, is that OK?'\nGreater clarity over Farrell's injury was provided by his centre partner Jonathan Joseph, who has been recalled in place of Ben Te'o.\n'I didn't see what happened but he'll be completely fine. He'll be out there on Saturday,' Joseph said.\nJones, who was in high spirits during the captain's run, announced his squad on Thursday morning for the Twickenham clash, with Farrell named at inside centre.\nRed Rose captain Dylan Hartley and head coach Eddie Jones during session at Twickenham\nRose greets World Cup-winner Wilkinson, who was helping out with training drills on Friday\nEngland have kept Billy Vunipola on the bench for their Calcutta Cup clash with Scotland\nThe England coach resisted the temptation to throw Billy Vunipola straight back into his starting line-up for the clash against Scotland with the Saracens No 8 named on England's bench.\nVunipola had been widely expected to start in place of Nathan Hughes at Twickenham after making a faster than expected recovery from knee surgery last November but was, on Thursday morning, named on the replacements bench alongside fit-again Bath flyer Anthony Watson.\nJones has made three changes to his starting line-up with winger Jack Nowell replacing Jonny May, Jonathan Joseph named at outside centre in place of Ben Te'o and Ben Youngs wearing the No 9 shirt in place of Danny Care.\nJones has made three changes to his starting line-up with winger Nowell replacing Jonny May\nJones, the England head coach, joins in on training as he looks to battle for the ball with May\nVunipola and James Haskell share a laugh ahead of the Six Nations showdown on Saturday\nJones appears in high spirits despite the prospect of facing Scotland without star man Farrell","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4300808/England-rugby-news-Owen-Farrell-doubtful-Scotland-tie.html"}
