{"authors":["Press Association"],"date_download":"2018-10-23 05:11:23","date_modify":"2018-10-23 05:11:23","date_publish":"2017-03-16 16:13:09","description":"Five players have been given unlikely call-ups to Gareth Southgate´s 26-man group.","filename":"data/vaneerConsumption/EnglandsquadThesurpriseselections.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/16/wire-229385-1489680791-944_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320910_England-squad--The-surprise-selections_1540271483.html","title":"England squad - The surprise selections","title_page":"England squad - The surprise selections | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"England manager Gareth Southgate has sprung some surprise selections in his squad to face Germany and Lithuania next week.\nHere, we take a look at five unlikely inclusions in Southgate’s 26-man group.\nJermain Defoe\n(Peter Byrne/PA)\nDefoe last played for England in 2013 and, aged 34, he is comfortably the oldest member of this squad. The striker has been in excellent form, however, for a struggling Sunderland side, hitting 14 goals in 27 league appearances. Other than Harry Kane, Defoe is the highest scoring Englishman in the Premier League.\nJake Livermore\n🗣 \"It's a great reward for him – he's battled back from some personal difficulties. I'm sure he'll be delighted.\" https://t.co/3dAeKRw1eF — England (@England) March 16, 2017\nLivermore made his only international appearance five years ago against Italy when a 22-year-old midfielder at Tottenham. His progress since then has not been as dramatic as some might have hoped and, after joining Hull permanently in 2014, he moved to West Brom in January. Livermore has registered one goal and one assist in the league this season.\nLuke Shaw\nShaw is yet to complete 90 minutes in the league this year, his only start coming earlier this month against Bournemouth when he had to come off after 70 minutes. The left-back has struggled for fitness and form this season under Jose Mourinho, who questioned the 21-year-old’s commitment in November when he withdrew late from a matchday squad.\nJames Ward-Prowse\nWard-Prowse has long been considered one of this country’s brightest young talents, with few able to match his excellent touch and delivery. He has cemented his place in Claude Puel’s Southampton starting line-up in recent weeks but doubts remain about the 22-year-old effectiveness, given he has scored only twice in the league this season.\nNathan Redmond\nRedmond was one of Southgate’s most trusted performers for the Under-21s and is a flag-bearer for the system, having come through the England youth teams. The winger is still waiting for his first senior cap, however, with concerns surrounding his consistency at the highest level. Redmond scored twice against Watford last weekend but those were his first league goals since October.","url":"https://www.dailymail.co.uk/wires/pa/article-4320910/England-squad--The-surprise-selections.html"}
