{"authors":["Lawrence Booth For Mailonline"],"date_download":"2018-10-23 05:52:48","date_modify":"2018-10-23 05:52:48","date_publish":"2017-03-10 15:26:06","description":"Alex Hales and Joe Root's centuries helped England complete a historic 3-0 one-day international whitewash of West Indies. Here, Sportsmail rates the England players during the ODI series.","filename":"data/vaneerConsumption/EnglandplayerratingsRootledseriesclinchingchase.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E1D493900000578-0-image-a-29_1489159328075.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4301624_England-player-ratings-Root-led-series-clinching-chase_1540273968.html","title":"England player ratings: Root led series-clinching chase","title_page":"England player ratings: Root led series-clinching chase | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alex Hales and Joe Root's centuries helped England complete a historic 3-0 one-day international whitewash with a 186-run trouncing of West Indies at the Kensington Oval.\nHales' comeback hundred, after breaking his hand in India, and Root's first in this format for more than a year underpinned England's 328 all out with a second-wicket stand of 192.\nHere, Sportsmail's Lawrence Booth rates the players for their performances during the ODI series.\nAlex Hales celebrates after hitting a century upon his return to the ODI side from injury\nHales scored 110 from 107 deliveries, hitting five sixes and nine fours in the process\nENGLAND STARTING XI FOR THE CHAMPIONS TROPHY 1 Jason Roy 2 Alex Hales 3 Joe Root 4 Eoin Morgan (capt) 5 Ben Stokes 6 Jos Buttler (wkt) 7 Moeen Ali 8 Chris Woakes 9 David Willey 10 Liam Plunkett 11 Adil Rashid\n9 Joe Root – Anchored England's series-clinching chase in Antigua with 91 not out, then made a long-overdue century in Barbados. Almost never fails.\n9 Chris Woakes – Keeps growing in stature. Got England out of jail with the bat in the second match, and took seven cheap wickets.\n8 Alex Hales – Made the most of his only chance after recovering from a hand injury, hitting a stirring hundred in Barbados. England's top-order banker.\n8 Eoin Morgan – Set the tone for the series with a clever century in Antigua on a stodgy surface. His decision to opt out of Bangladesh is very much behind him.\n8 Liam Plunkett – Ten wickets at an average of 9.90 made a great case for Champions Trophy inclusion. And he went for only four an over.\nJoe Root punches the air after reaching his ninth ODI hundred on Thursday\n7 Ben Stokes – Helped set up the first win with the bat, and got his long overdue revenge on Carlos Brathwaite in Barbados.\n6 Sam Billings – Another walk-on part meant he was neither here nor there: a decent half-century followed by a first-ball duck. Still a reserve batsman.\n6 Steven Finn – Grew in confidence as the series progressed. An inexperienced West Indies top order were uncomfortable against his pace and bounce.\n6 Adil Rashid – The most expensive of England's regular bowlers (5.22 an over), he was never at his best.\nEngland's Test captain kisses the Three Lions on his helmet after reaching three figures\n6 Jason Roy – His 48-ball 52 kick-started the chase in the second game, but needs to convert one of his many fifties.\n5 Moeen Ali – Quiet with both bat and ball. Remains crucial to the balance of the side, but England could do with more from his batting.\n3 Jos Buttler – Just 21 runs in three innings means he hasn't passed 31 in ODIs in seven innings. But his keeping was solid and England have no intention of replacing him with Jonny Bairstow.","url":"https://www.dailymail.co.uk/sport/cricket/article-4301624/England-player-ratings-Root-led-series-clinching-chase.html"}
