{"authors":["Press Association"],"date_download":"2018-10-23 01:31:37","date_modify":"2018-10-23 01:31:37","date_publish":"2017-04-26 12:04:09","description":"Sir Geoff Hurst and Gordon Banks have come together to urge people to Unite Against Dementia.","filename":"data/vaneerConsumption/Englands1966heroestakeondementiainthenameoftheirafflictedteammates.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464693-1493204653-529_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447280_England-s-1966-heroes-dementia-afflicted-teammates_1540258297.html","title":"England´s 1966 heroes take on dementia in the name of their afflicted teammates","title_page":"England´s 1966 heroes take on dementia in the name of their afflicted teammates | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two of England’s World Cup winning squad have spoken of their sadness at the effect dementia has had on three of their former team mates, as they joined a bid to raise funds for research into the disease.\nSir Geoff Hurst and Gordon Banks recalled the “wonderful” memories they share with their fellow 1966 footballing victors, as they took part in an awareness campaign.\nWorld Cup legends Sir Geoff Hurst & Gordon Banks OBE have come back together to urge people to #UniteAgainstDementia https://t.co/YtXbaqILmh pic.twitter.com/BzR0341dWn — Alzheimer's Society (@alzheimerssoc) April 26, 2017\nThe pair appear in a new television advertisement where they reminisce about the historic day when England lifted the world’s greatest footballing trophy.\nBut the sporting stars, who are part of the United Against Dementia campaign launched by the Alzheimer´s Society, described a stark contrast today for their teammates Martin Peters, Nobby Styles and Ray Wilson who now live with the condition.\nBanks, now 79 and himself battling cancer, told the Press Association: “We had such wonderful moments with these lads that have got dementia.\n'It’s devastating to see Britain’s heroes – our World Cup colleagues – living with Alzheimer’s.' https://t.co/Rt8haUeR8X pic.twitter.com/1uYtaTDRA8 — Alzheimer's Society (@alzheimerssoc) April 26, 2017\n“All the times we had jokes with them and a laugh and a drink, and just wonderful, wonderful memories.\n“And to think of them now, like they are now, they can’t even remember us and it’s just so sad now, it really is.”\nSir Geoff has enjoyed an annual golfing trip with Peters and their wives since the 1980s, but last year he said it was “difficult” to see how his long-time friend’s health had gone downhill.\nI don't often get star-struck but wow... World Cup winning legends Gordon Banks OBE & Sir Geoff Hurst. @GMB pic.twitter.com/fGPVfsw3ok — Piers Morgan (@piersmorgan) April 26, 2017\nSir Geoff, 75, said: “By that stage of course he had been deteriorating so it was quite difficult to see one of your teammates, close up.”\nSeeing the impact on someone he had known since his teenage years motivated him to take part in the campaign, he added.\nHe said: “It’s such an important charitable cause and the key thing for me is to make people aware, to get people to unite, to unite against dementia.”\nSir Geoff Hurst\nBanks, who lost his brother David to Alzheimer’s in 2012, said he was hurt when his sibling died “because I couldn´t do anything about it”.\nThe former England goalkeeper and Stoke City player said he continues to receive treatment for cancer.\nHe said: “I have a scan every few months and that hopefully is getting smaller.”\nGordon Banks\nIt is thought one person is diagnosed with dementia every three minutes and there is currently no cure for the disease.\nSir Geoff, who guaranteed his place in football history by scoring the decisive goals in England’s 4-2 final win over West Germany, said it is a particularly tragic illness.\nHe said: “I think it’s a huge difference between a physical illness as Banksy is describing and with dementia.\nSir Geoff, right, and Banks, second left, with fellow World Cup winners George Cohen, left, and Martin Peters\n“You know with a physical illness you’ve got a chance of recovering and Banksy is improving as he’s said.\n“But with dementia you know that it’s only going to go one way.\n“It’s not going to get any better, it’s only going to deteriorate.”\nThe pair, speaking in London, laughed and joked with each other as Sir Geoff admitted: “You never lose that dressing room banter.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447280/England-s-1966-heroes-dementia-afflicted-teammates.html"}
