{"authors":["Hardik Vyas"],"date_download":"2018-10-23 00:58:37","date_modify":"2018-10-23 00:58:37","date_publish":"2017-03-16 10:36:40","description":"Valencia, who joined Everton on a season-long loan from West Ham, has struggled for game time since making the switch, but is hoping he gets more minutes over the last 10 games of the season.","filename":"data/vaneerConsumption/EnnerValenciawantsEuropeanfootballforEverton.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E548D8C00000578-0-image-a-85_1489673547629.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319600_Enner-Valencia-wants-European-football-Everton_1540256317.html","title":"Enner Valencia wants European football for Everton","title_page":"Enner Valencia wants European football for Everton | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Enner Valencia is focused on using what is left of the season to secure European qualification at Everton and inists he would love to stay on at the club when his loan deal ends.\nValencia, who joined Everton on a season-long loan from West Ham, has struggled for playing time since making the switch, but is hoping he gets more minutes over the last 10 games of the season.\n'There are 10 games in which I could play. And those 10 games are vital because what we have to do is seal qualification for one of the European competitions,' Valencia, who has made three league starts, told the club website.\nEnner Valencia is determined to get Everton into the position to qualify for European football\nThe Blues striker has scored twice in 23 games since moving to Goodison Park last summer\n'I'm all about being positive and the best possible way of looking at things. I'm really keen to play.'\nThe Blues have an option to make Valencia's move permanent and the Ecuador international is open to staying at the club.\n'It's all about focusing on the present rather than the future,' Valencia added. 'But I can say from my point of view that I would love to stay.'\nSeventh-placed Everton host lowly Hull in the league on Saturday, before visiting Merseyside rivals Liverpool on April 1.\nThe forward said he would 'love' to make his stay at Goodison Park permanent","url":"https://www.dailymail.co.uk/sport/football/article-4319600/Enner-Valencia-wants-European-football-Everton.html"}
