{"authors":["Dave Burke","Peter Allen In Paris For Mailonline","Rachael Burford For Mailonline"],"date_download":"2018-10-23 01:27:27","date_modify":"2018-10-23 01:27:27","date_publish":"2017-03-16 11:29:33","description":"A Greek anarchist group called the Conspiracy of Fire Nuclei is 'likely behind' a letter bomb that injured a secretary at the International Monetary Fund (IMF) offices in Paris, Greek police said.","filename":"data/vaneerConsumption/EnvelopebombexplodesatParisIMFoffice.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54032C00000578-0-image-a-24_1489666626913.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319772_Envelope-bomb-explodes-Paris-IMF-office_1540258047.html","title":"Envelope ‘bomb’ explodes at Paris IMF office","title_page":"Envelope ‘bomb’ explodes at Paris IMF office | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Greek anarchist group is 'likely behind' a letter bomb that injured a secretary at the International Monetary Fund (IMF) offices in Paris, a Greek police source said.\nFrench investigators told their Greek counterparts that the package was sent from Athens by a group called the Conspiracy of Fire Nuclei, the source added.\nThe far-left Greek group had earlier claimed responsibility for an explosive device, also sent from Greece, that was intercepted on Wednesday at the offices of German Finance Minister Wolfgang Schaeuble.\nScroll down for video\nPolice outside the International Monetary Fund (IMF) building in Paris this morning, where an envelope bomb exploded in a staff member's face\nThe envelope bomb exploded in the face of a worker at the International Monetary Fund's Paris office this morning.\nA female IMF secretary suffered head and hand injuries in the blast, and damage to her eardrum.\nIMF chief Christine Lagarde has branded the attack a 'cowardly act of violence'.\nIMF chief Christine Lagarde has branded the attack a 'cowardly act of violence'\nParis police chief Michel Cadot revealed that IMF staff have received a number of threatening calls in recent days.\nFrance is currently in a state of emergency after a string of deadly Islamic extremist attacks over the past two years.\nThe explosive device 'exploded in the face of a member of the IMF's clerical staff', said a police source.\nHe said the employee suffered head and hand injuries and was receiving medical treatment.\nFrench President Francois Hollande said authorities would do all they could to find those responsible for the attack.\nThe IMF office is situated close to the Arc de Triomphe in the heart of the French capital\nA French Army soldier talks to a woman as soldiers arrive at the scene near the Paris offices of the International Monetary Fund (IMF)\nA primitive device constructed around a firecracker, which had been sent in the post, is believed to have caused the explosion\nThe explosive device 'exploded in the face of a member of the IMF's clerical staff', said a police source\nA primitive device constructed around a firecracker, which had been sent in the post, is believed to have caused the explosion.\nAround 20 people were evacuated from the highly secure building as a 'matter of routine' but hundreds of others in other offices remained, said the source.\nPolice were searching the area where the device went off, and also the offices of the World Bank, which are in the same building as the IMF.\nFrench police officers take position after letter bomb exploded at the French office of the International Monetary Fund\nPolice are investigating the explosion at the IMF building, which injured a female member of clerical staff\nIn a statement, Lagarde said: 'I have been informed about the explosion in the IMF's Paris office, which caused injuries to one of our staff.\n'I have been in touch with the office, and my compassion goes to the colleagues there.\n'I condemn this cowardly act of violence and reaffirm the IMF's resolve to continue our work in line with our mandate.\n'We are working closely with the French authorities to investigate this incident and ensure the safety of our staff.'\nA cordon was set up outside the IMF office after the homemade bomb, which was sent in the post\nPolice were searching the area where the device went off, and also the offices of the World Bank, which are in the same building as the IMF\nMichel Cadot, the head of Paris police, said 'three people were present' when the explosion happened 'just before midday'.\nHe said the device 'was not a bomb', but a 'big firecracker' that had been turned into a homemade booby trap.\nMr Cadot said staff at the IMF in Paris had received 'menacing phone calls' over the past few days, but these were nothing out of the ordinary.\nStaff at the IMF in Paris had received 'menacing phone calls' over the past few days, but these were nothing out of the ordinary\nFrench President Francois Hollande said authorities would do all they could to find those responsible for the attack\nAs more police and fire crews arrived, a wider evacuation was ordered, as some 150 members of staff began to leave the building, which is close to the Arc de Triomphe.\nThe parcel containing the device was addressed to the Chief of the European Bureau of the IMF, but was opened by a secretarial assistant, said Mr Cadot.\nHe said that the assistant was 'being treated for injuries to the face and hand' but they were not life threatening.\nIt comes after Greek radicals this week claimed responsibility for a parcel bomb that was sent to Germany's finance minister, Wolfgang Schaeuble.\nThe explosion happened inside the IMF building in Paris, police have confirmed\nFrench Police officers secure the scene near the Paris offices of the International Monetary Fund (IMF)\nFrench Police officers arrive at the scene following the explosion at the IMF office in Paris this morning\nThe padded envelope had Italian postage stamps, but police were able to diffuse the device.\nThe Conspiracy of Fire Cell group said in a statement: 'We still have the rage. We sent the package to Germany's finance minister as part of the second act of the Nemesis Plan. Nothing is over, everything continues.'\nNine suspected members of the armed anarchist group are currently on trial at a court set up inside Korydallos prison, for their alleged role in bombings and other attacks.\nThe group has claimed responsibility for a spate of parcel bombings last November that targeted embassies and even reached the office of German Chancellor Angela Merkel.\nPolice in Berlin said yesterday: 'The first investigation results show that the package contained a so-called explosives mixture, which is frequently used to produce pyrotechnics.\n'It was designed to cause considerable injuries when the package was opened.'","url":"https://www.dailymail.co.uk/news/article-4319772/Envelope-bomb-explodes-Paris-IMF-office.html"}
