{"authors":["Emily Walkenhorst"],"date_download":"2018-10-30 14:18:32","date_modify":"2018-10-30 14:18:32","date_publish":"2018-10-28 02:48:00","description":"Panel OKs effort to set rule on wells","filename":"data/vaneerConsumption/Environmentnotebook.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_28__1540909112.html","title":"Environment notebook","title_page":"Environment notebook","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Panel OKs effort to set rule on wells\nThe Arkansas Pollution Control and Ecology Commission has approved starting a rule-making process to transfer a permitting program for oil and gas disposal wells from one state agency to another.\nThe rule would move the approximately 500 no-discharge permits from the Arkansas Department of Environmental Quality's purview to that of the Oil and Gas Commission, which already has the same permitting program.\nOne person expressed concern about the permitting program during the commission's meeting Friday.\nEllen Carpenter described a U.S. Environmental Protection Agency inspection of an oil-storage tank in Union County that was found to be overfull and leaking and that had dead birds in it, among other things. She said Department of Environmental Quality data showed it hadn't been inspected since 2009.\nCommissioner Lawrence Bengal, who is also director of the Oil and Gas Commission, assured Carpenter that his agency would inspect the sites more frequently than what she described.\nBengal recused himself from the voice vote, which had no opposition.\nContractor to begin work on river bridge\nA federal contractor on Monday will begin construction to stabilize the Ponca bridge over the Buffalo National River.\nThe Eastern Federal Highways Program awarded a contract to Kovilic Construction Co. of Franklin Park, Ill., to work on stabilizing the bridge, resurfacing it and patching up weak spots, according to a news release from the National Park Service.\nThe estimated cost of the work is $350,000, said Lauren Ray, a park ranger and interpreter at the Buffalo National River. The work should last about 40 days, during which periodic closures of the bridge may occur, according to the news release.\nThe bridge is one of the last Works Progress Administration-era spans in Arkansas, the news release said. It was built by the administration in 1943. After the federal government proposed closing the bridge in 2006, the public called for its preservation.\nThe bridge has worn down with use, which once included frequent motor vehicle traffic, Ray said. Now it's mostly used by pedestrians.\nState Desk on 10/28/2018","url":"https://www.arkansasonline.com/news/2018/oct/28/conservation-plan-adds-2-watersheds-epa-1/"}
