{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 03:52:20","date_modify":"2018-10-23 03:52:20","date_publish":"2016-01-11 16:54:20","description":"Sir Philip was at his Barbados holiday home when England's northern cities were deluged on Boxing Day and admitted last week he could have returned days earlier.","filename":"data/vaneerConsumption/EnvironmentAgencybossSirPhilipDilleyQUITSaftercriticsblasthim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/2FD8852800000578-0-image-a-23_1452531205441.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394247_Environment-Agency-boss-QUITS-admitting-t-Britain-time-critics-blast-staying-Barbados-Christmas-flooding-crisis_1540266740.html","title":"Environment Agency boss Sir Philip Dilley QUITS after critics blast him","title_page":"Environment Agency boss Sir Philip Dilley QUITS after critics blast him | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Embattled Environment Agency boss Sir Philip Dilley has quit following weeks of criticism over his response to the Christmas flooding crisis.\nSir Philip was at his Barbados holiday home when England's northern cities were deluged on Boxing Day and admitted last week he could have returned days earlier.\nHe today handed his resignation to Environment Secretary Liz Truss admitting he was not able to available at short notice throughout the year.\nSpeaking to MPs last week, a tanned Sir Philip said he regretted not returning to Britain earlier during the flooding crisis\nSir Philip said he was 'well qualified' for the role but added media attention was diverting attention from the 'real issue' of helping people flooded out of their homes.\nHe said the expectations of the role had 'expanded' since he took on the £100,000 a year post.\nDeputy chairman Emma Howard Boyd will take over while a replacement is found, Ms Truss said.\nSir Philip returned to Britain on December 30. Speaking to MPs last week, he said: 'In hindsight it would have been better if I had come back as early as I could, which would have been one or two days earlier. But I don't feel guilty of leaving it many weeks.'\nMPs began calling for Sir Philip's resignation over the weekend after it emerged his wife was from Jamaica. Sir Philip had said he was in Barbados because that was where his family was from.\nSeveral Environment Agency statements, which Sir Philip confirmed to MPs he would have approved, made the same reference.\nSir Philip today insisted he had not made any 'untrue or misleading statements' but added: 'Apart from approving the statement about my location over Christmas that in hindsight could have been clearer.'\nConservative Nigel Evans said he should quit, telling the BBC: 'Quite frankly, an amazing number of people gave up their Christmases ... and the guy in charge of the Environment Agency, overseeing how effective they are in dealing with these floods, thinks he can do it from Barbados.\n'Well, I think he should spend more time in Barbados.'\nSir Philip Dilley eventually returned to Britain on December 30 before a trip to see the flooding devastation in York\nLabour MP John Mann told The Telegraph: 'He should resign immediately. He's clearly misled people and as ever, the cover-up is much greater than the crime.'\nLiberal Democrat leader Tim Farron said: 'Many staff gave up their Christmas Eve, Christmas Day and New Year's Eve. Their boss should have joined them. It seemed to many that this organisation was bereft of its formal leadership when it was most needed.\n'The public deserved better.'\nIn his resignation statement, Sir Philip said: 'I have today told the Secretary of State of my decision to step down as Chairman of the Environment Agency, and she has accepted my resignation.\n'I am well qualified to carry out this role, and had much to contribute. I fully support the Secretary of State's reform agenda to deliver efficiency as well as a better, more joined-up service to our stakeholders and the public, and so I am disappointed that I will not now see through delivery of these reforms.\n'My reason for resigning is that the expectations of the role have expanded to require the Chairman to be available at short notice throughout the year, irrespective of routine arrangements for deputy and executive cover. In my view this is inappropriate in a part-time non-executive position, and this is something I am unable to deliver.\n'Furthermore the media scrutiny focused on me is diverting attention from the real issue of helping those whose homes and businesses have flooded, as well as the important matter of delivering a long-term flood defence strategy. This same media attention has also affected and intruded on my immediate family, which I find unacceptable.\n'I want to be clear that I have not made any untrue or misleading statements, apart from approving the statement about my location over Christmas that in hindsight could have been clearer.\n'The Environment Agency is an extremely competent and well-run organisation, and the many employees I have met are passionate about what they do because they really care for the environment and the communities we work to enhance and protect.\nSir Philip was criticised for staying in Barbados at holiday home, pictured, while England's northern cities were underwater\n'I retain the full support of the board, which I know has a strong breadth of knowledge and experience, and with Sir James Bevan as the newly appointed Chief Executive the future of the Environment Agency is in strong hands.'\nMs Truss said: 'Today I have accepted Sir Philip Dilley's resignation and I would like to thank him for his work as Chairman of the Environment Agency.\n'He has ably led the Environment Agency through some challenging times and leaves it a much better organisation, as shown in its excellent response to the recent flooding which saw staff working around the clock to protect and help thousands of people across the country.\n'It is important that the Environment Agency continues to have a strong leadership team and its Chief Executive Sir James Bevan will continue his excellent work heading up the operational and day-to-day running of the organisation.\nSir Philip Dilley (right), who earns £100,000 a year for a three-day week, visited Todmorden, Hebden Bridge and Mytholmroyd in West Yorkshire after returning from the Caribbean\nYork was among the cities hardest hit by flooding over Christmas as Britain suffered the heaviest December rain on record\n'The current Deputy Chairman, Emma Howard Boyd, has agreed to become Acting Chairman with immediate effect and will lead the board in holding the agency to account.'\n'We will begin the task of recruiting a permanent replacement in due course.'\nAt the hearing with MPs last week, Sir Philip attempted to explain he had two homes and did not 'feel away' when he was in Barbados.\nHe told the committee: ‘I also should explain that I do have two homes, my wife is from the Caribbean, we have a home there and I spend time there particularly over Christmas.\n‘When I’m there I don’t feel I’m away, I feel like I’m at home … I work there, I keep in very regular contact with all the people that matter. I know that none of my actions or inactions detracted from the performance of the agency.’\nSir Philip denied that staff had advised him not to go away over the Christmas period and took responsibility for the statement put out by the Environment Agency that said he was at home, when he was in Barbados.\n'I saw it, I approved it, it's my problem,' he told MPs, adding that he had a family home in the Caribbean, and worked from there.\nHis absence had not detracted from the Environment Agency's performance, he said, but admitted the communications effort could have been better.\nAnd he said he told the MPs he would learn lessons from the events.","url":"https://www.dailymail.co.uk/news/article-3394247/Environment-Agency-boss-QUITS-admitting-t-Britain-time-critics-blast-staying-Barbados-Christmas-flooding-crisis.html"}
