{"authors":["Associated Press"],"date_download":"2018-10-22 22:41:07","date_modify":"2018-10-22 22:41:07","date_publish":"2016-01-28 10:56:14","description":"ISLAMABAD (AP) — Pakistan's Foreign Ministry announced Thursday that representatives from Afghanistan, Pakistan, China and the United States will meet in the...","filename":"data/vaneerConsumption/Envoysfrom4countriestodiscussAfghanpeacetalksFeb6.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420640_Envoys-4-countries-discuss-Afghan-peace-talks-Feb-6_1540248067.html","title":"Envoys from 4 countries to discuss Afghan peace talks Feb. 6","title_page":"Envoys from 4 countries to discuss Afghan peace talks Feb. 6 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Envoys from 4 countries to discuss Afghan peace talks Feb. 6\nISLAMABAD (AP) — Pakistan's Foreign Ministry announced Thursday that representatives from Afghanistan, Pakistan, China and the United States will meet in the Pakistani capital Islamabad next month to discuss how to resume the stalled peace process between Kabul and the Taliban.\nThe ministry spokesman, Qazi Khalilullah, said the Feb. 6 meeting would continue the ongoing efforts to lay out a roadmap to peace for the war-shattered Afghan nation. It will be third such meeting in recent weeks.\nOfficials have said that Taliban representatives will be invited when the four countries reach some understanding on the overall roadmap.\nKhalilullah said Pakistani Prime Minister Nawaz Sharif will soon travel to Qatar as part of that effort, but did not elaborate on that visit.\nThe announcement came days after the Afghan Taliban said its \"political office\" in Qatar was the only entity authorized to carry out negotiations on its behalf. The peace talks have been on the hold since July 2015, when the Afghan government revealed that Taliban leader Mullah Mohammad Omar had been dead for years.","url":"https://www.dailymail.co.uk/wires/ap/article-3420640/Envoys-4-countries-discuss-Afghan-peace-talks-Feb-6.html"}
