{"authors":["Kelly Schremph"],"date_download":"2018-10-30 22:36:06","date_modify":"2018-10-30 22:36:06","date_publish":"2014-08-14 22:35:03","description":"There’s no telling what kind of romantic whirlwind Julie Plec has in store for her dedicated Vampire Diaries fans next season. Some are hoping for a Klaroline reunion during the TVD / Originals crossover we’ve been promised. Meanwhile, others are…","filename":"data/vaneerConsumption/EnzoDatingCarolineThisRandomTVDRomanceMayActuallyHappeninSeason6.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/99402096-6cd6-4072-ac91-ecdb14e840eb.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35723-enzo-dating-caroline-this-random-tvd-romance-may-actually-happen-in-season-6_1540938966.html","title":"Enzo Dating Caroline? This Random ‘TVD’ Romance May Actually Happen in Season 6","title_page":"Enzo Dating Caroline? This Random ‘TVD’ Romance May Actually Happen in Season 6","title_rss":"NULL","source_domain":"bustle.com","text":"There’s no telling what kind of romantic whirlwind Julie Plec has in store for her dedicated Vampire Diaries fans next season. Some are hoping for a Klaroline reunion during the TVD / Originals crossover we’ve been promised. Meanwhile, others are rooting for a full-blown Steroline romance, which was strongly hinted at in TVD ’s Season 5 finale. Either way, things are looking pretty good for Ms. Caroline Forbes next season. However, there's still another option to consider… what if neither of these two vampire hunks end up getting the girl (or at least not right away)? What happens if another guy comes into the picture, and instead of hooking up with either Klaus or Stefan, Caroline starts dating Enzo?\nThat's right — we may have a new 'shipping duo on our hands. Think about it. When has Plec ever made a relationship simple on this show? There are always barriers to overcome or some sort of obstacle to fight through — even another person to get out of the way for a new romance to bloom. So what makes you think this situation will be any different? For a series that has always prided itself in producing exciting plot twists no one could see coming, it would be completely out of character to allow Team Klaroline or Team Steroline to succeed without any complications arising first. That’s where Enzo comes in.\nLike it or not, he’d be the perfect obstacle to get in the way of these two very popular ‘shipping pairs. No one can deny that there was a definite spark between these two last season (though that could just be because it’s impossible for Candice Accola to not have great chemistry with anyone). So things could definitely start to heat up in the Enzoline (or do we like Carolenzo better?) department by the time Season 6 rolls around. Just hear me out…\nHe’s Definitely Her Type\nHe’s handsome… he’s charming… he has a hint of danger about him. Oh, and let’s not forget about that accent of his. How we can expect Ms. Forbes not to be drawn in by all of that? Plus, we know Caroline well enough by now to recognize that her outer hostility and sarcasm toward a hot villain is simply a defense mechanism to hide her attraction to them.\nMichael Malarkey Is Here To Stay\nNow that the actor’s been promoted to a series regular, it’s about high time his character got a little love story of his own (because, let’s face it, that whole Maggie thing didn’t really count). If you’re a permanent fixture on this show then you’re bound to start hooking up with someone, right? It's gotta be mandatory in the TVD handbook or something. Elena’s too devastated over Damon’s departure to the Other Side; Bonnie’s too busy, ya know, being dead (for now); so that leaves Caroline as the ideal candidate. Some people just have the best luck.\nThey’ll Definitely Share Scenes Together\nAccola recently shared a TVD Season 6 set photo of Caroline and Enzo on her Who Say account, and the two of them appear to be sharing a meal together at a diner somewhere. Could this be a date? Another road trip? Is this an indicator that Damon’s death actually drives Steroline further apart? It’s hard to say, but the point is these two are going to be sharing some definite screen time together… which could lead to bonding… which could lead to… ya know, other things. All I’m saying is that Klaus and Stefan better up their game, because from the looks of things, Enzo is not messing around… or backing down. And I'm not entirely sure I want him to.\nImages: Bob Mahoney/The CW; pl.wikia.com; mkserialblog/Wordpress; skyrock.com; tuenticrepusculoforo.forosactivos.net","url":"https://www.bustle.com/articles/35723-enzo-dating-caroline-this-random-tvd-romance-may-actually-happen-in-season-6"}
