{"authors":["Matthew Debord"],"date_download":"2018-10-30 23:03:39","date_modify":"2018-10-30 23:03:39","date_publish":"2016-12-08 00:00:00","description":"At issue is the type of cars that the automakers want to sell — or more accurately, don't want to sell.","filename":"data/vaneerConsumption/EPAcarmakersbreakonhigherCAFEstandards.json","image_url":"https://amp.businessinsider.com/images/584882ecba6eb6771b8b7dd2-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_epa-carmakers-break-on-higher-cafe-standards-2016-12_1540940619.html","title":"EPA carmakers break on higher CAFE standards","title_page":"    EPA carmakers break on higher CAFE standards - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Sales aren't what they used to be. Matthew DeBord/Business Insider Donald Trump has reportedly nominated Scott Pruitt, the Attorney General of Oklahoma, to be the new head of the Environmental Protection Agency.\nThe choice won't please environmentalists; Pruitt has \"made no secret of his disdain for the EPA,\" according to NPR.\nThe EPA is responsible for enforcing an increase in Corporate Average Fuel Economy (CAFE) standards, something that automakers have been protesting, even though they've been doing a fairly good job of hitting their marks.\nAt issue is the type of cars that the automakers want to sell — or more accurately, don't want to sell: small, high-MPG vehicles and electric cars that help them to comply with the regulations but that consumers don't want to buy.\nAnd that aren't very profitable. Big SUVs and pickup trucks, on the other hand, are profitable.\nThe automakers want to build and sell the vehicles that people want to buy. This doesn't mean that they don't want to improve fuel-economy. The opposite, actually: they want SUVs and pickups to get better MPGs because that's a selling point.\nIf you can deliver what might have been considered gas-guzzling power ten years ago with more fuel-sipping tech, then you're going to go for it and customers aren't going to argue.\nThe EPA has now moved to solidify the standards before the new administration comes to Washington.\n\"Automakers have a wide range of technology pathways available to meet the [new] standards,\" the EPA said in a statement Wednesday (via Forbes).\nPickups sales are booming. Ford\n\"[The new] standards are achievable with very low penetration of strong hybrids, electric vehicles and plug-in hybrid electric vehicles,\" the statement continued.\nUnfortunately, hybrid sales have been tanking in the face of the SUV and pickup boom. Electric cars, Tesla's notwithstanding, make up only about 1% of the global market and, as Ford CEO Mark Fields recently pointed out, in the auto industry they have gone from making up 2.3% of available models to 2.8% — in a decade.\nThere's sensible industrial and environmental policy — and there are regulations that compel companies to manufacture stuff for which there is no demand. The automakers aren't out to destroy the planet, but they have good cause to ask the EPA to push back CAFE increases, at least until the current market dynamics change, or gas prices go back up.","url":"https://www.businessinsider.com/epa-carmakers-break-on-higher-cafe-standards-2016-12"}
