{"authors":["Joe Wertz"],"date_download":"2018-10-23 05:31:26","date_modify":"2018-10-23 05:31:26","date_publish":"2017-01-18 00:00:00","description":"Oklahoma Attorney General Scott Pruitt has sparked controversy for his denial of climate science and his ties to fossil-fuel interests. Here's what to expect in Wednesday's confirmation hearing.","filename":"data/vaneerConsumption/EPACriticToGetSharpQuestionsOnIndustryTiesAsHeViesToRunAgency.json","image_url":"https://media.npr.org/assets/img/2017/01/17/ap_17006585829085_wide-4083e437c1480d23c53596b079212e4ecc1aedc4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_18_510355798_epa-critic-to-get-sharp-questions-on-industry-ties-as-he-vies-to-run-agency_1540272686.html","title":"EPA Critic To Get Sharp Questions On Industry Ties As He Vies To Run Agency","title_page":"Scott Pruitt's EPA Administrator Confirmation Hearing Begins Wednesday : NPR","title_rss":"NULL","source_domain":"npr.org","text":"EPA Critic To Get Sharp Questions On Industry Ties As He Vies To Run Agency\nEnlarge this image toggle caption Zach Gibson/AP Zach Gibson/AP\nA live stream of this confirmation hearing is available via C-SPAN.\nOklahoma Attorney General Scott Pruitt has been among the most controversial picks for Donald Trump's Cabinet. In part, that's because the Environmental Protection Agency nominee has said things like this:\nAround the Nation Trump's Pick To Lead The EPA Has A History Of Battling The EPA Trump's Pick To Lead The EPA Has A History Of Battling The EPA Listen · 3:25 3:25\n\"Scientists continue to disagree about the degree and extent of global warming and its connection to the actions of mankind. That debate should be encouraged — in classrooms, public forums, and the halls of Congress.\"\nAs Oklahoma's lead attorney, Pruitt has also been a leader in going after the environmental agency, joining other Republican attorneys general in lawsuits to try to stop, among other things, ozone and methane emissions regulations and Obama's signature climate plan.\nPruitt has also been public in his defense of coal, oil and natural gas — all industries the EPA oversees. In a 2013 interview he said, \"I think the attitude with the EPA and certain environmental groups is that fossil fuels are bad — period. And they're doing everything they can to use the rule-making process to attack.\"\nFor all this, he may face stiff opposition in Wednesday's confirmation hearing.\n\"This is not somebody who should be leading the Environmental Protection Agency,\" says Michael Brune, executive director of the Sierra Club. \"Pruitt has basically made his career working to tear down, or at least challenge, environmental and public health safeguards. So why does he want to lead EPA?\"\nBrune hopes the Senate Environment and Public Works Committee asks tough questions about that Wednesday — and about the hundreds of thousands of dollars in campaign contributions that Pruitt has received from the fossil fuel industry.\nPruitt, who declined requests for an interview, has been less active than his predecessor in the Oklahoma attorney general's office in pursuing environmental cases. Court records and data collected by the Environmental Working Group also suggest Pruitt stalled a state lawsuit regarding water pollution from chicken manure after receiving contributions linked to the poultry industry.\nKay Mills of Missouri worries that big corporations will have Pruitt's ear on policy. She and other members of the Moms Clean Air Force traveled to Washington, D.C., to pressure their senators to reject Pruitt's nomination.\n\"I'm really concerned about Scott Pruitt's rejection of science,\" Mills says. \"In particular, his rejection of the science around mercury pollution. As a pregnant mother ... I've been thinking a lot about mercury and how that impacts my unborn baby.\"\nPruitt's industry ties are seen as a good thing by many of his supporters, and he is likely to get a positive reception from Republican senators from fossil-fuel-producing states. Groups representing drillers and miners say their economic concerns were largely ignored over the past eight years.\n\"We can achieve the goals of environmental improvement without sacrificing our economic development, energy security, jobs,\" Marty Durbin of the American Petroleum Institute told reporters in endorsing Pruitt.\nPruitt also has been enthusiastically endorsed by nearly two dozen conservative advocacy groups who feel the EPA under President Obama has overreached. In a joint statement, groups including the American Energy Alliance and Americans for Tax Reform call Pruitt a \"stalwart defender against federal intrusion into state and individual rights.\"","url":"https://www.npr.org/2017/01/18/510355798/epa-critic-to-get-sharp-questions-on-industry-ties-as-he-vies-to-run-agency"}
