{"authors":["Julie Cart","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 22:38:15","date_modify":"2018-10-30 22:38:15","date_publish":"2017-03-10 17:01:00","description":"The anticipation continues to build as California officials spent another week waiting for the expected rollbacks of vehicle emissions and fuel efficiency standards to come from the Trump Administration—moves that could have serious repercussions for California’s greenhouse gas reduction goals.","filename":"data/vaneerConsumption/EPApoisedtorollbackfuelefficiencystandardsunderminingCaliforniasclimategoals.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540939095.html","title":"EPA poised to roll back fuel efficiency standards, undermining California's climate goals","title_page":"EPA poised to roll back fuel efficiency standards, undermining California's climate goals | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"EPA poised to roll back fuel efficiency standards, undermining California’s climate goals\nThe anticipation continues to build as California officials spent another week waiting for the expected rollbacks of vehicle emissions and fuel efficiency standards to come from the Trump Administration—moves that could have serious repercussions for California’s greenhouse gas reduction goals.\nAt issue are the 2022-2025 vehicle miles-per-gallon requirements set last summer by the outgoing Obama Administration. The rules raise the fleet average fuel efficiency to more than 50 miles per gallon by 2025, up from 27.5 mpg in 2010.\nIn a separate action, Scott Pruitt, the head of the Environmental Protection Agency, is widely expected to loosen the emission rules for cars, which have for a number of years been identical to California’s stringent standards. That has been assumed to occur at any time, but Mary Nichols, head of the California Air Resources Board, told a Sacramento audience this week that although she’s hearing the same rumors, she has no particular insight into what the federal agency might do. “They aren’t asking me.” she said.\nSo expected was the move that a state senator introduced a resolution opposing “any efforts by the current administration and Congress of the United States to deny, rollback, or otherwise undermine the waiver authority.”\nBut, by the end of the week, the shoe had failed to drop.\nThe EPA itself has been strangely quiet, although Pruitt on Thursday week confounded scientists around the world when he said he does not believe carbon dioxide is a primary contributor to climate change. “I think that measuring with precision human activity on the climate is something very challenging to do and there’s tremendous disagreement about the degree of impact, so no, I would not agree that it’s a primary contributor to the global warming that we see,” he told CNBC’s “Squawk Box. “But we don’t know that yet. … We need to continue the debate and continue the review and the analysis.”\nIn fact, there is little debate about carbon dioxide’s role in climate change, as the EPA’s as-yet unpurged website concludes, “Carbon dioxide is the primary greenhouse gas that is contributing to recent climate change.”\nEPA Chief Scott Pruitt: Carbon Dioxide Not Primary Contributor To Global Warming | Squawk Box | CNBC Environmental Protection Agency Administrator Scott Pruitt said Thursday he does not believe carbon dioxide is a primary contributor to global warming. ” Subscribe to CNBC: http://cnb.cx/SubscribeCNBC About CNBC: From ‘Wall Street’ to ‘Main Street’ to award winning original documentaries and Reality TV series, CNBC has you covered.\nA group of Democratic senators earlier in the week urged the EPA not to change the emissions rules, saying in a letter, “These automobile emissions standards are economically feasible and technologically achievable for the auto industry.”\nCar manufacturers disagree, and have lobbied the Trump Administration to revisit the standards and build in more flexibility.\n“America should be putting cars that burn too much gasoline in the rear-view mirror,” said Anna Aurilio, Legislative Director for Environment America.“Unfortunately, EPA’s potential action may be a green light to keep making cars that dirty our air, endanger our health and threaten out children’s future.”\nThe complicated, litigated process of the interwoven regulations was consolidated under the Obama Administration. Both the EPA and California’s air board set their own greenhouse gas standards, while the U.S Department of Transportation sets the fuel efficiency rules, known as CAFE standards. Taken together, fuel economy and emissions are set out in what’s known as the National Program, which covers vehicle emissions and fuel economy from 2017-2025.\nWhat might be afoot, according to Simon Mui, an analyst with the National Resources Defense Council, is both agencies working in concert to weaken both fuel efficiency and emissions rules at the same time “At that point,” he said, “the California standards would be the one shining star holding things up.”\nThat’s because the state has the right under the Clean Air Act to set its own emissions standards for new cars if it deems the federal guidelines insufficiently strict. (The law also allows other states to adopt California’s rules, which more than a dozen have done.) To do so, California’s air board must request a waiver from the EPA, which it has done for more than 50 years.\nSuch waivers have been the bedrock on which much of California’s climate change goals stand and are critical for the state to achieve its greenhouse gas reduction goals. The state’s emissions from passenger cars and light trucks have been reduced by more than 30 percent since 2009, when California expanded its use of the air quality waiver.\nBut after Pruitt refused to endorse California’s special waiver privilege, the state has girded itself for this sort of battle with federal officials, having hired former U.S. Attorney General Eric Holder to represent it.\nDave Clegern, a spokesman for the state air board, noted that the state has received more than 100 waiver in the last 50 years, adding, “California’s unique ability to set and enforce its own standards on mobile sources is critical for California to protect public health, and has benefitted the nation.”","url":"https://calmatters.org/articles/trump_california/epa-poised-roll-back-fuel-efficiency-standards-undermining-californias-climate-goals/"}
