{"authors":[],"date_download":"2018-10-30 01:24:51","date_modify":"2018-10-30 01:24:51","date_publish":"2018-09-13 00:05:50","description":"President Donald Trump committed to fundamentally transforming the U.S. Environmental Protection Agency (EPA) from an agency producing politicized science to one instilling sound scientific standards for research. By doing so, Americans should expect improved environmental and health outcomes.","filename":"data/vaneerConsumption/EPAsNonPoliticizedScienceBenefitsAmericans.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Environmental_Protection_Agency_building_15011151177.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862691.html","title":"EPA’s Non-Politicized Science Benefits Americans","title_page":"EPA’s Non-Politicized Science Benefits AmericansThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"President Donald Trump committed to fundamentally transforming the U.S. Environmental Protection Agency (EPA) from an agency producing politicized science to one instilling sound scientific standards for research. By doing so, Americans should expect improved environmental and health outcomes.\nCurrently, regulatory costs top $1.9 trillion annually, which amounts to $14,842 per U.S. household. That’s nearly $15,000 less for Americans to pay for health insurance, medical bills, education expenses, groceries, gasoline, or entertainment. Because the economic and social implications of regulations are profound, the science they are built upon must be impeccable.\nOver the last few decades — under Republican and Democratic administrations — EPA formed a cozy relationship with radical environmental activists and liberal academic researchers. With the support of environmental lobbyists who despise capitalism (expressed by consumers’ free choices in the marketplace) EPA bureaucrats, in pursuit of more power and expanded budgets for the agency, funded researchers who, because they were largely dependent on government grants for the majority of their funding, were only too happy to produce results claiming industry was destroying the earth.\nOf course, the only way to prevent environmental collapse was more government control of the economy. However, these reports were produced despite the fact poverty and hunger have steadily declined and people are living longer and more productive lives than ever before.\nAs Jay Lehr, a colleague and science director at the Heartland Institute told me once, “For decades, EPA has been a wholly owned subsidiary of the environmental left. Together, radical environmentalists and EPA bureaucrats, including the members of all their advisory panels, have used their considerable power to thwart American business at every turn.”\nUnder Trump, EPA changed how it pursues science to pay greater fealty to the scientific method and remove temptations for scientific self-aggrandizement and corruption.\nNot surprisingly, researchers, environmentalists, and bureaucrats, seeing their power curtailed and their gravy train ending, are crying foul saying the Trump administration is undermining science. However, in reality this is simply not true.\nEPA’s scientific advisory panels are tasked with ensuring the research the agency uses to develop and justify regulations is rigorous, has integrity, and is based on the best available science.\nTo better ensure this, EPA ceased automatically renewing the terms of board members on various panels. EPA is now filling its scientific panels and boards on a competitive basis as each board member’s term expires.\nThis should improve the science EPA uses to inform its decisions, by expanding diversity — diversity of interests, diversity of scientific disciplines, and diversity of backgrounds — thus bringing in a wider array of viewpoints to EPA decision-making.\nIn addition, to reduce opportunities for corruption, EPA ceased allowing members of its federal advisory committees to apply for EPA research grants and instituted policies to ensure advisory panel members and grant recipients have no other conflicts of interest. It was always a foolish practice to allow those recommending, often determining, who gets EPA grants to also be in the running for those grants. However, this was business as usual at EPA, where grant makers awarded themselves, research teams they were members of, or their friends billions of taxpayer dollars over the years.\nIn April, then EPA Administrator Scott Pruitt declared “The era of secret science at EPA is coming to an end.” Pruitt proposed requiring the data underlying scientific studies used by EPA to craft regulations be available for public inspection, criticism, and independent verification.\nFor years, EPA bureaucrats have used the results of studies by researchers who would not disclose the data underlying their results to be examined and retested for confirmation or falsification. Fortunately, EPA is finally ending this unjustifiable practice.\nMany scientists have objected to EPA’s new secret science policy because they claim the studies EPA uses have undergone “peer review.” However, the peer review process is often nothing more than other researchers, often hand-picked by the scientists whose research is being reviewed, sitting around in their ivory towers reading the reports and saying, “this looks okay or reasonable to me.”\nUnless the reviewers are able examine the underlying data and assumptions, and attempt to replicate the results, peer review is unable to ensure the validity of studies used to underpin regulations. Absent transparency and replicability, peer review is hollow.\nAnother long overdue EPA regulatory reform was the decision to end exclusive use of the “Linearity No Threshold” (LNT) model when assessing the dangers of radiation, carcinogens, and other toxic substances in the environment. Going forward, EPA will incorporate uncertainty into its risk assessments using a variety of other, more realistic models.\nThe LNT model assumes there is no safe dose of ionizing radiation or exposure to various other chemicals or toxins. Relying on flawed studies from the effect of ionizing radiation on fruit flies from the 1950s, EPA and other regulatory agencies have used LNT as a basis for regulation of environmental clean-ups, setting safety standards for nuclear plants, and limiting low dose radiation treatments for medical patients, a policy that has cost lives and billions of taxpayer dollars.\nAlthough science has progressed phenomenally since the 1950s, with copious amounts of research showing the LNT model is seriously flawed, EPA and other agencies never questioned the LNT standard. That is, until now.\nIn fact, adverse effects from low dose exposures to radiation and most other chemicals and potential toxins are often non-existent. Indeed, substances that may be harmful in large quantities can be beneficial in small amounts, a process known as hormesis.\nIn the commonly paraphrased words of Swiss physician and astronomer Paracelsus, “the dose makes the poison.” Vitamins, which are valuable in small quantities, and even water, which is literally necessary for life, can become deadly if too much of either is taken over a short period of time. Or consider sun exposure. While exposure to too much sunlight can contribute to skin cancer, sunlight is required to catalyze the final synthesis of Vitamin D, which strengthens the bones, helping prevent osteoporosis and rickets. There is also ample evidence sunlight can help fight depression and several skin and inflammatory ailments.\nReplacing reliance on the untenable LNT model with other models of exposure and response will result in better safety and health protocols, potentially saving billions of dollars and thousands of lives each year.\nIn service of the American people and the pursuit of continued American greatness, science practices at EPA are improving under President Trump. One can only hope equivalent changes are adopted at other executive agencies so the regulations they produce are grounded in the best available science, free of political corruption and bureaucratic incentives for agency mission creep and growth.\nSterling Burnett, Ph.D. (hburnett@heartland.org) is a senior fellow on energy and the environment at The Heartland Institute, a nonpartisan, nonprofit research center headquartered in Arlington Heights, Illinois.","url":"https://spectator.org/epas-non-politicized-science-benefits-americans/"}
