{"authors":[],"date_download":"2018-10-22 20:37:36","date_modify":"2018-10-22 20:37:36","date_publish":"2014-06-02 15:02:02","description":"McCarthy says climate change 'supercharges risks' to health and economy.","filename":"data/vaneerConsumption/EPAToutsAmbitiousButAlsoAchievableCarbonRule.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482261/140602-carbon-pollution-jsw-245p_35c017f546701bf613676b49023564a7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_white-house_epa-touts-ambitious-also-achievable-carbon-rule-n120266_1540240656.html","title":"EPA Touts 'Ambitious, But Also Achievable' Carbon Rule","title_page":"EPA Touts 'Ambitious, But Also Achievable' Carbon Rule","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn a move already meeting stiff resistance from powerful energy industry groups, the Obama administration formally announced a proposal Monday that would slash carbon emissions at existing power plants by 30 percent by 2030, compared with 2005 levels.\n“Today, climate change — fueled by carbon pollution — supercharges risks not just to our health, but to our communities, our economy, and our way of life,\" Environmental Protection Agency administrator Gina McCarthy said in a speech unveiling the rule.\nUnder the proposal, states will have several options at their disposal to meet the new standard, including renewable energy investments and shifts to natural gas.\n\"This plan is all about flexibility, McCarthy said. \"That’s what makes it ambitious, but also achievable.\"\nJoining a conference call with the American Lung Association to discuss the rule, President Barack Obama called it \"a sensible, state-based plan.\"\n\"This is something that is important for all of us, as parents, as grandparents, as citizens, as folks who care about the health of our families and also want to make sure that future generations are able to enjoy this beautiful blue ball in the middle of space that we're a part of,\" he said.\nThe rule is being celebrated by environmental advocates, who call the move a positive step towards slowing climate change and improving air quality, while opponents deride the plan as a sure bet for job losses – particularly in the coal industry. Republicans quickly branded the proposal a \"national energy tax.\"\nSenate Minority Leader Mitch McConnell of Kentucky called the plan \"a dagger in the heart of the American middle class.\"\n\"By imposing these draconian new rules on the nation's coal industry, President Obama and every other liberal lawmaker in Washington who quietly supports them is also picking regional favorites, helping their political supporters in states like California and New York while inflicting acute pain on states like Kentucky,\" he said.\nMcConnell's Democratic opponent, Alison Lundergan Grimes, also slammed the measure, calling it \"more proof that Washington isn't working for Kentucky.\"\n\"Coal keeps the lights on in the Commonwealth, providing a way for thousands of Kentuckians to put food on their tables,\" she said. \"When I'm in the U.S. Senate, I will fiercely oppose the President's attack on Kentucky's coal industry because protecting our jobs will be my number one priority.\"\nThe U.S. Chamber of Commerce calculated that the change could cost an average of $50 billion each year until 2030.\nMcCarthy flatly refuted those suggestions on Monday, saying critics of the climate push are advertising \"manufactured facts and scare tactics.\"\nPower plants account for about one-third of all greenhouse gas emissions from the United States. The EPA says its proposal is worth nearly $100 billion in “climate and health benefits” and will shrink electricity bills by about eight percent.","url":"https://www.nbcnews.com/politics/white-house/epa-touts-ambitious-also-achievable-carbon-rule-n120266"}
