{"authors":[],"date_download":"2018-10-22 20:31:54","date_modify":"2018-10-22 20:31:54","date_publish":"2014-06-02 00:45:06","description":"The Obama administration on Monday will roll out a plan to cut earth-warming pollution from power plants by 30 percent by 2030.","filename":"data/vaneerConsumption/EPAtoProposeMajorCutsinCarbonEmissions.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/480591/140601-powerplant-jms-2106_d1d02e1995cf570379965eb64cc19021.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_epa-propose-major-cuts-carbon-emissions-n119946_1540240314.html","title":"EPA to Propose Major Cuts in Carbon Emissions","title_page":"EPA to Propose Major Cuts in Carbon Emissions","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Obama administration will announce tomorrow a sweeping plan to cut carbon emissions.\nThe Environmental Protection Agency will unveil its proposal that existing U.S. power plants will have to cut their carbon emissions by 30 percent from 2005 levels by 2030.\nThe announcement will work through Section 111(d) of the Clean Air Act, which requires states to adopt performance standards for existing sources of pollution. The EPA sets the benchmarks that states must meet and can improve upon.\nIn a statement, Michael Steel, spokesman for House Speaker John Boehner, called the plan a \"scheme\" that will \"raise costs and destroy American jobs.\"\n\"This goes in exactly the wrong direction,\" Steel said.\nDespite concluding in 2009 that greenhouse gases endanger human health and welfare, a finding that triggered their regulation under the 1970 Clean Air Act, it has taken years for the Obama administration to take on the nation's fleet of power plants. In December 2010, the Obama administration announced a \"modest pace\" for setting greenhouse gas standards for power plants, setting a May 2012 deadline.\nEPA data shows that the nation's power plants have reduced carbon dioxide emissions by nearly 13 percent since 2005, or about halfway to the goal the administration will set Monday. The agency is aiming to have about 25 percent cut by 2020.\nObama has already tackled the emissions from the nation's cars and trucks, announcing rules to reduce carbon dioxide emissions by doubling fuel economy. That standard will reduce carbon dioxide by more than 2 billion tons over the life of vehicles made in model years 2012-25. The power plant proposal will prevent about 430 million tons of carbon dioxide from reaching the atmosphere, based on the 30 percent figure and what power plants have already reduced since 2005.\nThe EPA has not confirmed the details of the proposal Sunday.\n— Reporting by Kelly O'Donnell, Kristin Welker, Anne Thompson, Frank Thorp and the Associated Press","url":"https://www.nbcnews.com/politics/politics-news/epa-propose-major-cuts-carbon-emissions-n119946"}
