{"authors":["John Hayward"],"date_download":"2018-10-30 20:11:48","date_modify":"2018-10-30 20:11:48","date_publish":"2016-07-19 02:28:01","description":"The coup against President Recep Tayyip Erdogan seems to have been put down over the weekend, but tensions are still running high in Turkey.","filename":"data/vaneerConsumption/ErdoganPurgesMilitaryPoliceCivilService.json","image_url":"https://media.breitbart.com/media/2016/07/erdogan-after-turkey-military-coup-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_18__1540930308.html","title":"Erdogan Purges Military, Police, Civil Service","title_page":"Turkey's Failed Coup: Erdogan Purges Military, Police, Civil Service","title_rss":"NULL","source_domain":"breitbart.com","text":"The coup against President Recep Tayyip Erdogan seems to have been put down over the weekend, but tensions are still running high in Turkey, with F-16 fighter jets still patrolling the skies over Istanbul and Ankara on Monday morning for “control of the airspace and security.”\nThere is good reason for the government to worry about controlling airspace, as Sky News obtained footage on Monday of a helicopter strafing the headquarters of the National Intelligence Agency during the hottest hours of the military coup on Friday evening.\nIn one of the stranger tales to emerge from the coup, rebel-piloted F-16s had Erdogan’s aircraft locked with their radars but refrained from shooting him down. “Why they didn’t fire is a mystery,” a former military officer told Reuters.\nAccording to Sky News sources, Erdogan has “given his country’s air force orders to shoot down any military helicopters taking off from Istanbul.”\n“The purge of state structures and presence of F-16 jets suggests authorities fear the threat against Mr Erodgan is not over, even amid a crackdown that has seen more than 7,500 people arrested,” Sky News added. Photographs have surfaced of dozens of captured rebel soldiers lying naked and handcuffed on the floor of a gymnasium.\nIn addition to the arrests, purges of the police, military, and civil service have resulted in the sacking of some 9,000 police officers and 3,000 judges. Erdogan is talking about reviving the death penalty to deal with them.\n“Why should I keep them and feed them in prisons, for years to come?’ – that’s what the people say,” Erdogan grumbled, as reported by the BBC. “They want a swift end to it, because people lost relatives, lost neighbours, lost children… they’re suffering so the people are very sensitive and we have to act very sensibly and sensitively.”\nU.S. and European Union officials have “expressed alarm” about Erdogan’s response to the coup. As the UK Daily Mail put it, quoting EU foreign policy chief Federica Mogherini: “This is no excuse to take the country away from fundamental rights and the rule of law, and we will be extremely vigilant on that.”\nAfter a meeting on Monday morning, EU foreign ministers informed Turkey that its hopes of joining the European Union would be dashed, if coup suspects are executed.\nThe death toll from the coup reportedly includes 24 coup plotters and 208 government loyalists, which Prime Minster Binali Yildarim referred to as “martyrs.”\nA key figure in the post-coup fallout is General Akin Ozturk of the Turkish air force, who was charged with treason along with 26 other officers on Monday. Turkish media reported that Ozturk confessed to masterminding the operation, but the BBC reports him telling prosecutors on Monday, “I am not the person who planned or led the coup.”\nOzturk, in turn, blamed U.S.-based imam and longtime Erdogan adversary Fethullah Gulen for inciting the coup. Gulen has responded by denying involvement and suggesting Erdogan himself staged the coup to justify a purge. The Daily Mail cites U.S. Secretary of State John Kerry saying the United States would be willing to extradite Gulen but only if Turkey can provide “legitimate evidence that withstands scrutiny.”\nAlso suspicious was EU enlargement commissioner Johannes Hahn, who drew the ire of Turkish Foreign Minister Mevlut Cavusoglu by claiming that the government drew up arrest lists before the coup was attempted. The BBC quotes Cavusoglu calling these allegations “unacceptable.”","url":"https://www.breitbart.com/national-security/2016/07/18/turkey-still-tense-coup-attempt/"}
