{"authors":["John Hayward"],"date_download":"2018-10-30 20:11:25","date_modify":"2018-10-30 20:11:25","date_publish":"2016-12-22 03:37:29","description":"Turkish President Recep Tayyip Erdogan declared on Wednesday that Mevlut Mert Altintas was almost certainly a follower of Fethullah Gulen.","filename":"data/vaneerConsumption/ErdoganNoReasontoHideRussianAmbassadorsKillerWasaGulenist.json","image_url":"https://media.breitbart.com/media/2016/11/wi/afp/03/3ar6qmq-e1478670520434.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_21__1540930285.html","title":"Erdogan: 'No Reason to Hide' Russian Ambassador's Killer Was a Gulenist","title_page":"Erdogan: 'No Reason to Hide' Russian Ambassador's Killer Was a Gulenist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Turkish President Recep Tayyip Erdogan declared on Wednesday that Mevlut Mert Altintas, the 22-year-old police officer turned jihadi who murdered Russian ambassador Andrey Karlov before a crowd of reporters on Monday, was almost certainly a follower of exiled cleric Fethullah Gulen.\n“There is no reason to hide that he’s a member of the FETO network. All his connections, from where he was educated to his links, point to FETO,” Erdogan told Turkish media, as quoted by The New York Times.\nFETO is the Turkish government’s name for the Gulenists, an acronym that translates to “Fethullah Terrorist Organization.”\nGulen is a Muslim cleric who currently lives in Pennsylvania, having departed Turkey in some haste after feuding with his old friend Erdogan in 1999. The Turkish government has named Gulen the mastermind behind the aborted coup attempt in July, conducted a massive purge of suspected Gulenists from every quarter of government and demanded his extradition. The U.S. government is still considering the request, prompting occasional outbursts of anger from Ankara about the delay.\nGulen issued a statement on Monday denouncing the murder of Karlov:\nI am shocked and deeply saddened to learn of the tragic assassination of Russia’s Ambassador to Turkey, Andrey Karlov, who was speaking at an art gallery in Ankara. I condemn in the strongest terms this heinous act of terror. No terrorist act can be justified, regardless of its perpetrators and their stated purposes. It is the expectation of the Turkish people and the world that the government investigate the circumstances of this incident, identify those who aided the perpetrator and take the necessary precautions so that such an attack cannot be staged in the future. I send my deepest condolences to Ambassador Karlov’s family and to the Russian people for this tragic loss. I ask God the Most Compassionate to dry the roots of terrorism and lead the world to days of peace and tranquility. Turkish and international experts repeatedly have pointed out the deterioration of security and counter-terrorism efforts due to the Turkish government’s assigning hundreds of counter-terrorism police officers to unrelated posts, as well as the firing and imprisoning many others since 2014. This despicable act of shooting an ambassador, who represents an entire nation, only exacerbates the Syrian conflict that has already taken too many lives and driven too many from their homelands, like adding fuel to a fire. I urge the Turkish and Russian governments, as well as the rest of the international community, to continue to work toward a peaceful resolution to the ongoing conflict in Syria. Our work to make the world a more peaceful place must continue unabated.\nTurkish Foreign Minister Mevlut Cavusoglu told U.S. Secretary of State John Kerry that “both Turkey and Russia know the Gulenist terror cult was behind Russian envoy Andrey Karlov’s assassination” on Tuesday.\nHowever, Kremlin spokesman Dmitry Peskov did not leap to support Erdogan and Cavusoglu’s claims: “In this case it is hardly worth hurrying to any conclusions until the investigation determines – as our president said – who was behind the murder of our ambassador.”\nDeutsche Welle quotes Peksov adding that Karlov’s murder was “a blow to Turkey’s prestige.” The Russians have sent a team of investigators to work with Turkish authorities on the assassination probe.\nThe same article notes the hair-raising detail that Altintas worked on security details for President Erdogan at least eight times. He was on sick leave the day of the coup attempt in July.","url":"https://www.breitbart.com/national-security/2016/12/21/erdogan-russian-ambassadors-killer-gulenist/"}
