{"authors":["Dave Burke For Mailonline","Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 02:01:24","date_modify":"2018-10-23 02:01:24","date_publish":"2017-03-10 10:41:24","description":"Eric, 33, revealed he misses his sister Ivanka back in New York when he posted the photo to Twitter on Thursday. The next day, Ivanka, 35, shared a snapshot of her son.","filename":"data/vaneerConsumption/EricTrumpposeswithsisterIvankaattheWhiteHouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/17/3E24412600000578-0-image-a-64_1489167149582.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300780_Eric-Trump-poses-sister-Ivanka-White-House_1540260084.html","title":"Eric Trump poses with sister Ivanka at the White House","title_page":"Eric Trump poses with sister Ivanka at the White House | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eric Trump misses having his older sister Ivanka in New York with him, but the mother-of-three appears to be having a great time with her kids in Washington, D.C.\nPresident Donald Trump's 33-year-old son took to Twitter on Thursday to post an image of himself posed with 35-year-old Ivanka at the White House on International Women's Day, revealing that he misses her in the wake of her recent move.\n'Great seeing @IvankaTrump and the kids today! Miss her back in New York!' the executive vice president of the Trump Organization captioned the snapshot.\nScroll down for video\nSibling love: Eric Trump took to Twitter on Thursday to share a picture of himself posed alongside his sister Ivanka at the White House the day before, stating that he misses her\nThrowback: On Friday, Ivanka posted a recent photo of her three-year-old son Joseph at his 'favorite' exhibit at the National Museum of American History\nWhile Eric looks patriotic in a navy suit and red tie, Ivanka is the picture of elegance in a purple dress featuring a large bow on her hip.\nThe next day, Ivanka took to Instagram to share a photo of her three-year-old son Joseph at the National Museum of American History.\n'Joseph's favorite exhibit at @amhistorymuseum was Ralph Baer's workshop, inventor of the first video game! #STEM #Smithsonian #latergram,' she captioned the photo, which sees her eldest son posing in front of the display case.\nIvanka and her husband Jared Kushner are also proud parents to a five-year-old daughter, Arabella, and an 11-month-old son, Theodore.\nLadies who lunch: Eric and Ivanka posed for the photo together on International Women's Day, and on Wednesday, she celebrated at a luncheon\nFirst Lady: The ladies luncheon was hosted by Ivanka's stepmother Melania, who wore a chic Ralph Lauren dress to the event\nAfter her father's inauguration in January, Ivanka and Jared, a senior adviser to President Trump, moved from Manhattan to Washington, D.C. where they are living in the neighborhood of Kalorama.\nAlthough Ivanka has no official role in the administration, she has been present when her father met foreign leaders including Japanese Prime Minister Shinzo Abe and Canadian Prime Minister Justin Trudeau.\nIvanka stepped down from her position as executive vice president of the Trump Organization ahead of the move, and she a part of her father's close inner circle.\nWhen their father became president, Eric and his 39-year-old older brother Donald Trump Jr. were jointly put in charge of the company, but it is clear he is missing his sister while she is away.\nRight at home: Ivanka was all smiles at the luncheon, which was hosted in the State Dining Room\nPower couple: Earlier in the day, Ivanka and her husband Jared Kushner were pictured leaving their Washington, D.C. home. The couple moved out of their Manhattan apartment in January\nProud parents: In addition to Joseph, Ivanka and Jared also have a five-year-old daughter, Arabella, and an 11-month-old son, Theodore\nPresent: Although Ivanka has no official role in the administration, she has been present when her father met foreign leaders, including Canadian Prime Minister Justin Trudeau\nThe photo of Ivanka and Eric was taken on International Women's Day, presumably around the time their stepmother, First Lady Melania Trump, hosted a ladies luncheon in the State Dining Room.\nIvanka attended the event, and she also visited the United Nations Headquarters and filmed a video with the women who work there.\n'I am so inspired by these amazing young women on International Women's Day,' she wrote. 'They are the future!\n'Thank you to the UN Foundation and Girl Up for a great day of learning and activities focused on STEM. #WomensDay #IWD2017 #GirlUp #WomenInSTEM.'\nEarlier in the day, Ivanka was pictured stepping out of her $5.5million home with Jared, who brought her coffee after an early morning workout.","url":"https://www.dailymail.co.uk/news/article-4300780/Eric-Trump-poses-sister-Ivanka-White-House.html"}
