{"authors":[],"date_download":"2018-10-22 22:53:21","date_modify":"2018-10-22 22:53:21","date_publish":"2014-06-11 01:22:41","description":"The Tea Party has proven it still packs a political punch in 2014, thanks to the debate over immigration reform.","filename":"data/vaneerConsumption/EricCantoraCasualtyofImmigrationReform.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/501176/140611-eric-cantor-concession-250a_4185a9a76d9ac48c5b521320843ecd5d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_eric-cantor-casualty-immigration-reform-n128006_1540248801.html","title":"Eric Cantor a Casualty of Immigration Reform","title_page":"Eric Cantor a Casualty of Immigration Reform","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Tea Party has proven it still packs a political punch in 2014, thanks to the debate over immigration reform.\nIn the most stunning upset so far of this midterm season, the second-highest ranking Republican in the House of Representatives lost his party’s primary on Tuesday. Eric Cantor, the man seen as next-in-line to become House Speaker, was handily defeated by college professor Dave Brat.\nSign up for breaking news alerts from NBC News\nIt's extraordinary for a congressional leader to lose his or her primary race and, in this case, one of the big reasons for the upset was the highly charged issue of immigration.\nCantor had previously supported a \"Dream Act\"-like proposal to provide a path to citizenship for children who were brought to the United States illegally. \"One of the great founding principles of our country was that children would not be punished for the mistakes of their parents,\" Cantor said in a speech a year ago. \"It is time to provide an opportunity for legal residence and citizenship for those who were brought to this country as children and who know no other home.\"\nIn his long-shot campaign, Brat attacked Cantor on that stance. \"Eric Cantor is saying we should bring more folks into the country, increase the labor supply - and by doing so, lower wage rates for the working person,\" Brat charged.\nTo protect his right flank on immigration, Cantor sent out mailers saying he led the fight against President Obama's “amnesty” -- that is, comprehensive immigration reform that had passed the Senate a year ago.\nBut as Tuesday's Virginia primary proved, that ultimately wasn't enough.\nBefore tonight's Tea Party victory, establishment Republicans had cruised to victory in many contests. In North Carolina, the Chamber of Commerce-backed Thom Tillis won the state's Senate GOP primary. In Idaho, an establishment incumbent congressman defended his seat. And in Kentucky, Senate Minority Leader Mitch McConnell easily defeated his Tea Party challenger.\nBut in Mississippi last week, Sen. Thad Cochran, R-Miss., was forced into a June 24 runoff. And now the No.2-ranking House Republican goes down to defeat.","url":"https://www.nbcnews.com/politics/first-read/eric-cantor-casualty-immigration-reform-n128006"}
