{"authors":["Chelsea White For Dailymail.Com"],"date_download":"2018-10-23 03:21:16","date_modify":"2018-10-23 03:21:16","date_publish":"2017-04-26 14:46:44","description":"Late Tuesday, faced off against her online critics without a stitch of clothing on. The star managed to avoid the social media censors as she added some stars to cover her private parts.","filename":"data/vaneerConsumption/ErikaJaynenakedforInstagramsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA016B800000578-0-image-a-5_1493215734747.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447866_Erika-Jayne-bares-naked-Instagram-snap_1540264876.html","title":"Erika Jayne naked for Instagram snap","title_page":"Erika Jayne naked for Instagram snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Negative Nellies take note, this Real Housewives star knows what you think about her and she does not care.\nErika Jayne - aka Erika Girardi - faced off against her online critics without a stitch of clothing on.\nLate Tuesday night, the 45-year-old posted a naked snap of herself on Instagram.\nBares all: Erika Jayne - aka Ekria Girardi - faced off against her online critics without a stitch of clothing on on Tuesday night\nThe Beverly Hills Housewives star only managed to avoid the social media censors as she added some stars in post-production to keep some of her most private bits still private.\nIn the picture, which was taken a little while ago in Miami, Erika stands in the door of a hotel room's bedroom wearing just a pair of chain detailed heels.\nWith a giant blonde wig on, the reality star stares down the camera lens completely comfortable in her own skin.\nErika captioned the photo: 'Mikey made me do it ... Miami nights.'\nHaters come at me: The star then added some numbered extra thoughts knowing she would be targeted by online trolls\nNot bothered: The star then posted a GIF of her rolling her eyes on Real Housewives Of Beverly Hills to really make sure the haters knew she does not care\nMikey is Mikey Minden her choreographer and best friend.\nThe star then added some numbered extra thoughts knowing she would be targeted by online trolls.\n'1. This is my pre DWTS body. 2. I am not currently in Miami but am in NYC.\nTeam trouble: Erika captioned the photo: 'Mikey made me do it ... Miami nights.' Mikey is Mikey Minden her choreographer and best friend\n'3. I posted this knowing most of you would be judgmental and couldn't resist a chance to tear me down and I was right. 4. Go be offended at your own life. 5. I'm living my life to the fullest.'\nThe star then posted a GIF of her rolling her eyes on Real Housewives Of Beverly Hills to really make sure the haters knew she does not care.\nErika already looks amazing in this snap, so one can only imagine what her next round of naked photos will be like after her grueling training for Dancing With The Stars.\nThe star was recently eliminated from the dancing competition.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447866/Erika-Jayne-bares-naked-Instagram-snap.html"}
