{"authors":["Allum Bokhari"],"date_download":"2018-10-30 21:13:57","date_modify":"2018-10-30 21:13:57","date_publish":"2016-02-16 13:25:33","description":"The ESA gave a glowing tribute to the late Justice Antonin Scalia for his pioneering efforts to extend First Amendment protections to video games.","filename":"data/vaneerConsumption/ESAPraisesAntoninScaliaforDefenseofVideoGamesasLeftWingGamesJournalistsTrashHim.json","image_url":"https://media.breitbart.com/media/2016/02/ap_antonin-scalia_ap-photo-4-e1455561701259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_16__1540934037.html","title":"ESA Praises Antonin Scalia for Defense of Video Games as Left Wing Games Journalists Trash Him","title_page":"ESA Praises Antonin Scalia for Defense of Video Games as Left Wing Games Journalists Trash Him | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Entertainment Software Association (ESA), the leading voice of the U.S. video games industry, gave a glowing tribute to the late Justice Antonin Scalia for his pioneering efforts to extend First Amendment protections to video games.\nIn their statement, the ESA said:\nThe Entertainment Software Association joins those who salute the service and mourn the loss of Justice Scalia. In 2011, when our industry defended the rights of creators and consumers of video games before the U.S. Supreme Court, it was Justice Scalia who authored the historic majority opinion. He declared, with no ambiguity, that video games, like books, movies and other forms of expression, are deserving of First Amendment protections. It was a momentous day for our industry and those who love the entertainment we create and we are indebted to Justice Scalia for so eloquently defending the rights of creators and consumer everywhere.\nThe historic case referenced by the ESA was Brown Vs. Entertainment Merchants’ Association, which challenged a California law that criminalized those who sold violent video games to minors. (The California politician who authored the law, former Democrat State Senator Leland Yee, currently faces up to 20 years in jail for arms trafficking, among other charges.)\nCrucially, the ruling in Brown Vs Entertainment Merchants’ Association established the principle that video games were an expressive art form, and thus entitled to First Amendment protections. Writing the opinion for the majority in the 7 -2 Supreme Court decision, Scalia emphasised this point:\nLike protected books, plays, and movies, they communicate ideas through familiar literary devices and features distinctive to the medium. And “the basic principles of freedom of speech… do not vary” with a new and different communication medium.\nDespite his efforts to protect video games from censorship, progressive games journalists couldn’t resist straying outside their wheelhouse to launch attacks on Scalia for his rulings on cases that had nothing to do with video games.\n“ESA Mourns Bigoted Supreme Court Justice Who Defended Video games One Time,” is the extraordinary headline at GamesPlanet, a site that has so far evaded a reputation for rabid progressive bias. That reputation may change today.\nUproxx, a site that does have a reputation for left-wing bias, went so far as to question Scalia’s motives in defending video games. “Considering Scalia’s comparisons of homosexuality to bestiality and abortion laws to slavery, one wonders how things might have unfolded if another state had tried to ban games for featuring gay characters or sexual situations,” writes the author. “This ruling does nothing to negate Scalia’s difficult broader legacy as a jurist.”\nGizmodo, the flagship technology blog of the Gawker empire, acknowledged Scalia’s forward-thinking rulings on tech issues, but not before they attacked his opinions of being “backwards” and “running counter to progress” in “almost every” non-tech arena.\nLeftist games journalists and commentators were even more salty on Twitter. Sacked Escapist contributor Bob Chipman said positive coverage of Scalia’s ruling would cause gamers to see “a man who was a almost purely destructive force as heroic.” He went on to compare Scalia to Kim Jong Il and Hitler.\nLaura Hudson, senior editor at Offworld, also expressed dismay at video games sites that stuck to the topic:\nAre we being serious here, video game websites Like actually serious pic.twitter.com/5ty4OUqncb — Laura Hudson (@laura_hudson) February 14, 2016\nHowever, progressive stalwarts Kotaku, Polygon, and Motherboard were surprisingly even-handed in their coverage of Scalia’s passing. Motherboard acknowledged that the games industry had “lost a friend,” while Polygon conceded that Scalia’s “rigid” conservative principles led to a ruling that was “an important defence of free expression.” One commenter on Kotaku expressed dismay that the site’s editor-in-chief, Stephen Totilo, was being nice to a conservative.\nIt should be noted that Scalia was not, in fact, as inflexible as he is often portrayed. Nor are these criticisms fair. Textualism is the judicial philosophy that words matter—that a law means whatever its words day. Specifically, Justice Scalia was an originalist, meaning that he believes every legal text—including the text of the Constitution—are to be given the meaning that those words had to the people who adopted them at the time.\nScalia regularly said that being a good judge meant that sometimes a judge needed to reach a conclusion he did not like, because such rulings are confirmation that the judge was following the law as it was written, instead of inserting his personal preferences. He once made it clear that he personally opposed flag-burning, but had to strike down a law forbidding burning the flag because he thought that activity was protected by the First Amendment.\nYou can follow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/02/16/esa-praises-antonin-scalia-for-defense-of-video-games-as-left-wing-games-journalists-trash-him/"}
