{"authors":[],"date_download":"2018-10-30 18:19:09","date_modify":"2018-10-30 18:19:09","date_publish":"2014-05-14 04:00:00","description":"The Highlands-Cashiers Chamber Music Festival, two hours away and just over the Georgia line in western North Carolina, will have new temptations this year for Atlantans seeking a summer mountain getaway.","filename":"data/vaneerConsumption/EscapefromthecityforHighlandsCashiersChamberMusic.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/05/14/Images/photos.medleyphoto.5240404.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_escape-from-t_908fc91d1984a417ac23c47b8cb2adc2__1540923549.html","title":"Escape from the city for Highlands-Cashiers Chamber Music...","title_page":"Escape from the city for Highlands-Cashiers Chamber Music...","title_rss":"NULL","source_domain":"ajc.com","text":"The Highlands-Cashiers Chamber Music Festival, two hours away and just over the Georgia line in western North Carolina, will have new temptations this year for Atlantans seeking a summer mountain getaway. Organized by William Ransom of the Emory Chamber Music Society of Atlanta, the 33rd edition will run from June 27 through Aug. 3.\nHighlights of the 24-concert series include:\nThe festival’s first July 4th weekend concerts, titled “Musical Fireworks” on July 5-6, will feature Atlanta Symphony Orchestra concertmaster David Coucheron and his pianist sister, Julie.\n“Jazz Meets Classics: Sax in the Mountains” features saxophonists Will Scruggs and Leo Saguiguit with pianists Gary Motley and Elena Cholakova, July 18-19.\nThe Grammy Award-winning Parker String Quartet performs in concert July 20-21, then gives an an afternoon children’s concert and an informal evening performance at Buck’s Coffee Cafe (both free) on July 22.\n“CelloMania,” a concert featuring six cellists led by Sara Sant’Ambrogio of the Eroica Trio, will be held July 27-28.\nViolinist Tim Fain, musical star of the Academy Award-winning film “12 Years a Slave,” will share an “American Idols” program (in this case, meaning composers including Philip Glass and Aaron Copland) with pianist Ransom on Aug. 1-2. Fain also will play during the Final Gala Concert on Aug. 3, featuring the Festival Chamber Orchestra giving the fest’s first-ever performance of Mendelssohn’s Double Concerto for Violin and Piano. A dinner follows the concert.\nA Country Meets Classics” program will be inaugurated after the festival proper, on Aug. 10, a benefit concert featuring Nashville’s Blended 328 sharing a bill with the Vega String Quartet. One ticket option includes barbecue and beer.\nInformation: 828-526-9060, www.h-cmusic festival.org.\nTHEATER\n7 Stages to offer varied ‘Encounters’ in 2014-15\n7 Stages has announced its 2014-15 season schedule. The Little Five Points troupe’s 36th season will include:\nSept. 4-6: “Curious Encounters Festival of Interactive Performance,” featuring performances by seven artists including the Object Group, Association Internationale du Film d’Animation-Atlanta, PushPush Theater, Shana Robbins and more.\nOct. 2-26: “The Doctor, The Devil, and My Dad,” a world premiere from Atlanta playwright-actress Suehyla El-Attar about a young woman confronting the death of her father. The play explores the wonders of the universe, Islamic teachings of death and mysteries of the grave.\nDec. 18-20: “Krampus Xmas,” holiday hijinks with Santa’s perverse sidekick, in collaboration with the L5P Rock Star Orchestra, Syrens of the South and the Baphomettes.\nFeb. 12-March 1, 2015: “FML: How Carson McCullers Saved My Life,” Sarah Gubbins’ story about a high school girl embracing her queer identity, inspired by Carson McCullers’ “The Heart Is a Lonely Hunter.”\nMarch 9-15, 2015: “Mein Kampf,” George Tabori’s absurdist comedy about aspiring artist Adolf Hitler before his rise to power.\nApril 16-May 10, 2015: “The Breakers,” an interactive production created by associate artistic director Michael Haverty, to be staged at Goat Farm Arts Center, where the audience will spy on a young couple haunted by addictions and desire.\nMay 18- 24, 2015: “7 Trumpets,” described as “a vibrant outdoor celebration of music, dance and the unseen forces that move us.”\nInformation: 404-523-7647, www.7stages.org.\nNew troupe plates up murder, mystery\nIt’s hard to tell the actors from fellow audience members at “The Dinner Detective Murder Mystery Dinner Show,” the city’s latest dinner theater entry.\nBeing performed at the Marriott Suites Midtown at 6:30 p.m. Saturday nights through August, the show was launched in Los Angeles in 2004.\nTickets, including four-course meal, $59.95. 35 14th St. N.E., Atlanta. 1-888-959-6590, www.thedinnerdetective.com.\nATTRACTION\nFolk Pottery Museum add blacksmith feature\nThe Folk Pottery Museum of Northeast Georgia and adjoining and Sautee Nacoochee Center, near Helen, will open a new heritage attraction, a working forge and blacksmith shop, on May 24. The debut is in conjunction with the Sautee Nacoochee Volunteer Fire Department’s annual Pig Out barbecue there.\nThere will be smithing demonstrations and an auction of blacksmith-made items to help raise funds to supply the coal and steel to operate the forge and shop. The addition is adjacent to a restored slave cabin, both parts of a Heritage Site Project that interprets stories and practices of Sautee and Nacoochee valleys settlers.\nThe center’s two art galleries and local history museum as well as the Folk Pottery Museum will be open for free, 10 a.m.-5 p.m. 283 Ga. 255 in Sautee Nacoochee, a quarter-mile north of the Ga. 17 junction. 706-878-3300, www.folkpotterymuseum.com, www.snca.org.\nCLASSICAL MUSIC\nCapitol City founding director honored\nCapitol City Opera Company’s founding director Donna Angel was chosen the 2014 recipient of the Partners in Excellence Lifetime Achievement Award from Opera Volunteers International (OVI). To be presented at the joint OVI/Opera America conference in San Francisco on June 20-23, the award honors individuals who have given extraordinary volunteer service to opera in their communities.\nAngel founded Capitol City Opera Company in 1983 to focus on developing local talent, provide opera performances accessible to all and educate about vocal expression. She created education and outreach programs that have reached 20,000 Georgia students a year for more than two decades.\nInformation: www.ccityopera.org.","url":"https://www.ajc.com/entertainment/escape-from-the-city-for-highlands-cashiers-chamber-music-festival/2K0foBJFwPBrCp5FkFMJEM/"}
