{"authors":["Associated Press","Dailymail.Com Reporter"],"date_download":"2018-10-23 02:34:16","date_modify":"2018-10-23 02:34:16","date_publish":"2017-03-16 13:09:16","description":"Wesley Massey, 34, was being transported from Ohio to Pennsylvania on Wednesday night when he fled and stole a car from a rental facility, leading police on a high-speed chase.","filename":"data/vaneerConsumption/Escapedprisonercaughtinstolencarafter2statechase.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/17/3E55399800000578-0-image-a-19_1489684061993.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320208_Escaped-prisoner-caught-stolen-car-2-state-chase_1540262056.html","title":"Escaped prisoner caught in stolen car after 2-state chase","title_page":"Escaped prisoner caught in stolen car after 2-state chase | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A handcuffed prisoner who escaped from a transport vehicle in Ohio led police on a high-speed chase in a stolen car before he was finally captured in Pennsylvania.\nWesley Massey, 34, was being transported to Pennsylvania by a private company on Wednesday night when he fled and stole a car from a rental facility.\nPolice spotted the vehicle on Interstate 90, and chased after Massey, who was driving at speeds exceeding 100mph until he was finally stopped with the help of spike strips.\nWesley Massey, 34, who was jailed last year for charging $42,000 to his company credit card, was being transported from Ohio to Pennsylvania when he escaped and fled\nMassey, of Meadville, Pennsylvania, faces eight additional charges including fleeing the police and receiving stolen property, the Erie Times News reported.\nThe 34-year-old was jailed in February 2016 after he allegedly spent about $42,000 on a company credit card to pay for a Corvette along with jewelry, massages, and a Carnival Cruise for two.\nHe was also charged with weapons and forgery in an unrelated case.\nOn Wednesday night, Massey was being transported from Ohio to Pennsylvania when the Cleveland Police Department issued an alert that he had escaped around 11pm.\nMassey was driving a Volkswagen Passat stolen from a rental facility near Cleveland Hopkins International Airport and was spotted on Interstate 90 at 1.50am just two miles away from crossing the Ohio state border.\nPolice managed to stop Massey before he sped off at speeds greater than 100mph.\nThe chase finally ended after police in Albion, Pennsylvania, managed to stop the 34-year-old with the help of spike strips.\nMassey led police on a high speed chase until he was stopped with spike strips. He is now being held in Erie County Prison, where he faces eight additional charges\nMassey, along with his wife Courtney N. Massey, were jailed on felony charges after the chief financial officer of Power Drives Inc. alerted police that he had failed to show up to work.\nMassey was accused of charging the company credit card more than $42,000 in unauthorized purchases.\nHe later wrote a forged check for $10,890 to the Crawford County Clerk of Courts, which led to an investigation that found Massey was carrying an unlicensed handgun in his car, which had a license plate from another vehicle, police said.\nMassey was then charged with additional weapons and forgery felonies.\nHe is now in custody at Erie County Prison, with bond set at $200,000.","url":"https://www.dailymail.co.uk/news/article-4320208/Escaped-prisoner-caught-stolen-car-2-state-chase.html"}
