{"authors":[],"date_download":"2018-10-30 18:32:47","date_modify":"2018-10-30 18:32:47","date_publish":"2016-10-11 17:24:00","description":"Taiquan Mitchell was in court to learn how long he's going away to prison and tried to explain to the judge why he'd run away last week.","filename":"data/vaneerConsumption/EscapedDeKalbmurdererIwasgoingtoseegrandma.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/11/Images/Taiquan%20Mitchell%20in%20court_edit.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_escaped-dekalb-murderer-was-going-see-grandma__1540924367.html","title":"Escaped DeKalb murderer: I was going to see grandma","title_page":"Escaped DeKalb murderer says he was going to see grandma","title_rss":"NULL","source_domain":"ajc.com","text":"With chains clanking on his ankles and cuffs tight on his wrists, Taiquan Mitchell approached the courtroom podium to beg apologies for what he’d done, for the killing and how he managed to make everything even worse.\nThe 24-year-old Atlanta man fled trial last week in DeKalb County Superior Court and spent several days on the run after being convicted of murder.\n“My grandma’s been in the nursing home,” he explained to Judge Asha Jackson, the same judge who granted him $125,000 bond in 2014, which left him able to ditch his ankle monitor and run away. “I was headed to North Carolina to see her. That was my whole intention.”\nUnswayed by his excuses, Jackson sentenced him to life plus 40 years in prison, the same sentence given to co-defendant Deon Dorsey, who had been in more trouble with the law before the murder.\nAs Jackson read the penalty, Mitchell, who was caught last Wednesday in South Carolina, worked his bound hands to his face, holding a wadded tissue, and wiped tears.\nJackson, who typically makes no statement in sentencing hearings, made clear she was upset Mitchell ran. But she focused on the senselessness of the murder.\nShe said Marcus Waters, 29, died in a tragic case revolving around drugs and the poor choices of the defendants. The man was found dead, naked with his door kicked in on Carteret Place near I-285 in January 2014. The defendants were looking for marijuana, according to authorities.\nJackson called the case “ridiculous.”\nShe also took issue with Mitchell’s suggestion that she didn’t understand his “feelings.”\nHe seemed to be saying his hard life – his mother died when he was 14 and he bounced from house to house, he said – played a part in how he turned out.\nJackson said she went to an inner city high school and faced her own challenges.\n“In this life, you have to make choices,\" she said.\nThe victim’s family spoke of the cost of choices.\n“You guys have taken a part of my heart that can never, ever be replaced,” mother Gwendolyn Dennard told Mitchell and Dorsey.\nThe man was sentenced to life plus 40 years.\nShe used to look forward to seeing her son walk in the house and say: “Momma, whatchu cookin’?”\nNow she goes to see his grave every week, sometimes twice a week.\nMitchell, who is leaving four children and a job he held as a cook while out on bond, told Waters’ family he was sorry.\nThe murder “wasn’t intended,” he said.\nThe state didn’t buy his sorrow for the victim.\nWhen Mitchell ran, it showed he never intended to take responsibility, prosecutor Noah Schechtman said.\nMitchell's intentions no longer matter.\nWhen he rose to leave the courtroom, he was surrounded by deputies this time. Head hung low, Mitchell walked with them to a holding room.\nThe door closed behind him.\n>>RELATED: Detective says DeKalb online-dating murder has ‘definite’ gang ties\n>>RELATED: Obama shortens sentences for DeKalb, north Georgia drug offenders\n>>RELATED: DeKalb dad catches 50-year-old man molesting son, cops say","url":"https://www.ajc.com/news/local/escaped-dekalb-murderer-was-going-see-grandma/PYf4607R6ck0XAlTVEB01H/"}
