{"authors":["Trent Baker"],"date_download":"2018-10-30 21:36:53","date_modify":"2018-10-30 21:36:53","date_publish":"2016-08-02 16:24:04","description":"Tuesday on ESPN2's \"First Take,\" co-host Max Kellerman reacted to Seattle Seahawks star quarterback Russell Wilson's comments that \"of course\" black lives | Video","filename":"data/vaneerConsumption/ESPNsKellermanItHasntAlwaysBeenSoObviousThatBlackLivesMatter.json","image_url":"https://media.breitbart.com/media/2016/08/kellerman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_08_02__1540935413.html","title":"ESPN's Kellerman: 'It Hasn't Always Been So Obvious' That Black Lives Matter","title_page":"ESPN's Kellerman: 'It Hasn't Always Been So Obvious' That Black Lives Matter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on ESPN2’s “First Take,” co-host Max Kellerman reacted to Seattle Seahawks star quarterback Russell Wilson’s comments that “of course” black lives matter, but so do police lives and all other lives.\nKellerman, who called Wilson’s Black Lives Matter stance “milquetoast,” said the point of the Black Lives Matter movement is that it has not always been obvious to everyone that black lives matter.\n“The point of the Black Lives Matter movement– parenthetically it’s ‘too.’ Black Lives Matter, too. In other words, it hasn’t always been so obvious to everyone that black lives do matter. Black life has been cheap throughout most of the history of this country, and continues to do so in many places. That’s the idea of bringing attention through Black Lives Matter. But you can understand why reasonable people don’t get that at first. They say, ‘Wait, all lives matter, of course.’ When he says obviously black lives matter, that kind of speaks to the heart of the idea. No, it’s not always so obvious,” Kellerman stated.\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2016/08/02/espns-kellerman-it-hasnt-always-been-so-obvious-that-black-lives-matter/"}
