{"authors":["Trent Baker"],"date_download":"2018-10-30 21:37:08","date_modify":"2018-10-30 21:37:08","date_publish":"2015-04-21 20:51:26","description":"ESPN Host Attacks 'Racist' Redskins for Reaction to Eagles' Tebow Signing","filename":"data/vaneerConsumption/ESPNHostAttacksRacistRedskinsforReactiontoEaglesTebowSigning.json","image_url":"https://media.breitbart.com/media/2015/04/Kellerman421.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_04_21__1540935428.html","title":"ESPN Host Attacks 'Racist' Redskins for Reaction to Eagles' Tebow Signing","title_page":"ESPN Host Attacks 'Racist' Redskins for Reaction to Eagles' Tebow Signing | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During Tuesday’s airing of “SportsNation” on ESPN2, host Max Kellerman gave his opinion on the Washington Redskins Twitter account posting the Kermit the Frog sipping Lipton Iced Tea meme shortly after the Philadelphia Eagles Twitter account announced the signing of quarterback Tim Tebow.\nThe meme is titled “But That’s None Of My Business,” as if the Redskins are saying that their quarterbacks may be bad, but the Eagles are proud to be signing a player that has been out of the league since 2012 but it is not none of their business.\nKellerman was not a fan of this tweet by Washington, and is not a fan of their nickname or owner.\n“This is a terrible look for Washington, which has a racist name. It’s not a nickname, it’s the name of the team, an officious owner, and by the way, are consistently the worst team in the NFC East. Have not been nearly as good as the Eagles have been over the last, what, two decades? And the Eagles make a move that’s got nothing to do with you, and you tweet that out?”\nThe Redskins are not the only ones attacked by Kellerman, however, as he was suspended by ESPN in 2014 after talking on-air about hitting his then girlfriend.\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2015/04/21/espn-host-attacks-racist-redskins-for-reaction-to-eagles-tebow-signing/"}
