{"authors":["Trent Baker"],"date_download":"2018-10-30 21:36:41","date_modify":"2018-10-30 21:36:41","date_publish":"2017-04-20 16:38:13","description":"Thursday, ESPN \"First Take\" co-host Max Kellerman weighed in on the New England Patriots' visit to the White House in celebration of their Super Bowl | Video","filename":"data/vaneerConsumption/ESPNsKellermanGronkowskiPoppingIntoWHPressBriefingNormalizesSeanSpicerPatriotsShouldveBoycottedTrip.json","image_url":"https://media.breitbart.com/media/2017/04/kellerman-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_04_20__1540935401.html","title":"ESPN’s Kellerman: Gronkowski Popping Into WH Press Briefing Normalizes Sean Spicer — Patriots Should’ve Boycotted Trip","title_page":"ESPN's Kellerman: Gronkowski Popping Into WH Press Briefing Normalizes Sean Spicer --- Patriots Should've Boycotted Trip | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Thursday, ESPN “First Take” co-host Max Kellerman weighed in on the New England Patriots’ visit to the White House in celebration of their Super Bowl victory over the Atlanta Falcons.\nIn a long-winded rant, Kellerman said Patriots tight end Rob Gronkowski walking into press secretary Sean Spicer’s press briefing Wednesday normalizes Spicer’s behavior, adding that this proves that the Patriots should have completely boycotted visiting the White House.\nRemarks as follows:\nWhen the press corps is cracking up at a press secretary because of an athlete’s presence there, so he’s lending something to the proceedings, the athlete is, and the press corps is, you know, they’re having a rollicking good time, they’re really laughing at a press secretary who in his first press conference, demonstrably lied, shot credibility, I mean your job is to establish credibility with the national media, and completely shot it since his first press conference and it’s gone downhill since there, by the way. In a scary way, incidentally, especially when there’s a lot of uncertainty about a very unusual administration, how much authoritarian impulse is there — well, when the press secretary comes out and says what you know as a fact is not a fact because now we’re giving you alternative facts, eventually was the phrase, that’s a scary thing. Like wait, what’s going on here? They think that they can just say anything and we’re supposed to take it as true. When that guy is normalized and the press is yukking it up, that’s a very bad thing. That’s an unhealthy thing to have happened.\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2017/04/20/espns-kellerman-gronkowski-popping-into-wh-press-briefing-normalizes-sean-spicer-patriots-shouldve-boycotted-trip/"}
