{"authors":["Trent Baker"],"date_download":"2018-10-30 18:19:35","date_modify":"2018-10-30 18:19:35","date_publish":"2015-11-10 18:45:57","description":"ESPN's Stephen A. Smith Urges Caution --- Twitter Explodes","filename":"data/vaneerConsumption/ESPNsStephenASmithUrgesCautiononMizzouRaceCardTwitterExplodes.json","image_url":"https://media.breitbart.com/media/2015/11/sas1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_11_10__1540923575.html","title":"ESPN’s Stephen A. Smith Urges Caution on Mizzou, Race Card — Twitter Explodes","title_page":"ESPN's Stephen A. Smith Urges Caution on Mizzou, Race Card --- Twitter Explodes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday, ESPN’s Stephen A. Smith warned “black America” to not jump so quickly to thinking someone with different views or skin pigmentation are racist. Taking into account he could be called an “Uncle Tom” or “sellout,” Smith continued the University of Missouri discussion on Tuesday’s “First Take.”\nSmith first applauded Missouri student Jonathan Butler, who went on a hunger strike, for his “courage” and the football team for enlightening the alleged racial injustices on campus. He also agreed that former school president Tim Wolfe had to step down due to his “criminal negligence.”\nThe ESPN talking head cautioned the black community against playing the race card yet again.\n“I admire Jonathan Butler. It’s not about him. He’s unbelievable, and so are those football players,” Smith explained. “My problem is I don’t want other folks looking at that situation from our community and think ‘OK, we get to cry about racism with everything.’ No, you do not. In some cases it’s valid. And in some instances, it’s not. You have to go about the business of pounding the pavement.”\n“Jonathan Butler had a very viable argument, and he exercised it exceptionally well. Some of us, a few of us, don’t have that argument but will try to use it as an excuse every way, to blame somebody else for keeping them down as opposed to pounding the pavement, putting on your bootstraps, putting in the hard work and doing what you have to do and not looking at yourself as the victim because we have a future generation to think about,” he added.\nSome people of Smith’s “community” took to Twitter to applaud him for his stance:\nThank you @stephenasmith for being honest and real about the degrading things in the black community. — Él Capitán (@Committed23) November 10, 2015\n@stephenasmith Thank you for speaking on Univ of Missouri situation and elaborating on the black community as a whole. I agree 100% — Jamrock (@Jamrock_nyc) November 10, 2015","url":"https://www.breitbart.com/video/2015/11/10/espns-stephen-a-smith-urges-caution-on-mizzou-race-card-twitter-explodes/"}
