{"authors":["Lucy Waterlow For Mailonline"],"date_download":"2018-10-23 01:18:50","date_modify":"2018-10-23 01:18:50","date_publish":"2016-01-11 12:10:57","description":"Mick Coburn, 52, and his wife Karen, 46, left the UK behind last summer so they could start a new life in the sun with her three daughters from a previous relationship, Abby, Hayley and Danielle.","filename":"data/vaneerConsumption/EssexcoupleselltheirhomeandrisklifesavingstorunBenidormbar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/30097A0700000578-0-image-a-4_1452514251938.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3390343_Couple-sold-home-uprooted-children-buy-bar-Benidorm-whim-admit-ve-gambled-life-savings-despite-never-pulling-pints-before_1540257530.html","title":"Essex couple sell their home and risk life savings to run Benidorm bar","title_page":"Essex couple sell their home and risk life savings to run Benidorm bar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple from Essex who have no previous experience in the hospitality industry have revealed why they chose to sell their home and risk their savings to run a bar in Benidorm.\nMick Coburn, 52, and his wife Karen, 46, left the UK behind last summer so they could start a new life in the sun with her three daughters from a previous relationship, Abby, Hayley and Danielle.\nThe family are now running a bar in the resort popular with British ex pats after deciding 'on a whim' to buy the business.\nMick and Karen Coburn reveal on Tuesday evening's Bargain Loving Brits In The Sun on Channel 5 how they have risked their savings to buy a bar in Benidorm\nThe couple have bought Levi's Showboat, a bar already well-established in Benidorm, so they are under pressure to continue its success\nNeither of them have run a bar before as Mick used to work as a transport manager while Karen ran a fish spa company.\nAfter selling their home and 'gambling' their savings on the venture, Karen admitted they were under pressure to make the business a success.\n'We are nervous, we are taking on a lot we know that. You do have to make changes and stay on the ball. Bars open and then they close because people put no effort in,' she revealed as they share their story on Channel 5 documentary Bargain Loving Brits In The Sun.\nThey had moved to Spain as Karen was meant to be taking it easy after having surgery for a chronic back problem. But they decided to buy a bar popular in Benidorm 'on a whim' after hearing it was up for sale.\nKaren's daughters Abby, Danielle and Hayley have moved to Spain with their mother and step father to help them run the bar\nKaren said: 'I got talking to Mick (the previous owner) and it came up that he was selling so I said \"yes we will buy it\" and here we are.\n'I am meant to take it a lot easier after the surgery I have had but unless I cannot move I will keep going.'\nCompetition for custom in the area is tough as there are hundreds bars which attract tourists and ex pats with happy hour deals on drinks and entertainment while they dine.\nLuckily for the Coburns, they do not have to start their business from scratch as they have taken over the reins at a bar established by Wayne Wright from Manchester.\nHe set up Levi's Showboat Cabaret bar 20 years ago in what was a derelict disco and has been attracting punters with this meal deals and cabaret show - which includes his own drag act.\nKaren is meant to be taking it easy following back surgery but running the busy bar means she has to muck in serving tables\nMick, pictured pulling a pint, admitted taking over the business was more hectic than they expected\nKaren, pictured clearing glasses, said they had taken a big gamble buying the bar as they have no previous experience running such a business\nBut after years of working 16 hour days, he decided it was time to sell the business, saying: 'I feel if I carry on working 24/7 I will burn out and crash, it is time to take it easy.'\nUnder Wayne's ownership, the bar turned over £250,000 every year and the Coburns feel under pressure to continue his success and keep his loyal customers returning.\nThey have enlisted the help of Karen's daughters Abby and Hayley, who are in their twenties, to work as barmaids while 18-year-old Danielle works front of house to attract in custom from the street.\nDanielle said she has no regrets about leaving the UK.\nThe couple bought the bar from Wayne Wright, second from right with his partner, who said he will 'burn out and crash' he is keeps running it as he has been working 16 hour days for years\n'I am so excited, never in million years thought we would be doing this,' she said.\nHowever, on opening night, Wayne, who agreed to help the Coburns find their feet, said he was worried they have bitten off more than they can chew.\nHe said: 'It is very disorganised noone seems to know what they are doing. They are not ready, if I wasn't here tonight it would a disaster.\n'I asked Karen to clear a table and I don't think she was happy but you have to muck in.'\nThe mother admitted they have had to work hard to show the locals that the bar they know and love won't be having any drastic changes under their management.\nWayne has established Levi's Showboat as a successful bar in competitive Benidorm and said the Coburns will need to be organised to maintain its reputation and popularity\nShe said: 'It has been hectic and hair pulling at times and a learning curve. It is a big business we have taken on in Benidorm.'\nMick agreed taking over the bar has been 'more hectic than we realised'.\n'We are slowly finding our feet and our way around,' he said.\nSince they took over the bar last June, the couple say they are currently coping well.\n'I think the gamble has paid off but it is still early days,' Karen admitted. 'Come back and ask us when we have been here a year.'","url":"https://www.dailymail.co.uk/femail/article-3390343/Couple-sold-home-uprooted-children-buy-bar-Benidorm-whim-admit-ve-gambled-life-savings-despite-never-pulling-pints-before.html"}
