{"authors":["Press Association Reporter"],"date_download":"2018-10-23 03:23:17","date_modify":"2018-10-23 03:23:17","date_publish":"2016-01-11 15:59:26","description":"The 36-year-old Essex all-rounder is to take up the role of director of the Graham Napier Cricket Academy at the Royal Hospital School in Suffolk, which is set to launch in September.","filename":"data/vaneerConsumption/EssexallrounderGrahamNapiertoretireattheendof2016season.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/1A218B8C000005DC-0-image-a-83_1452527908978.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3394148_Essex-rounder-Graham-Napier-retire-end-2016-season_1540264997.html","title":"Essex all-rounder Graham Napier to retire at the end of 2016 season","title_page":"Essex all-rounder Graham Napier to retire at the end of 2016 season | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Essex all-rounder Graham Napier has announced he will retire from professional cricket at the end of the 2016 county season.\nThe 36-year-old is to take up the role of director of the Graham Napier Cricket Academy at the Royal Hospital School in Suffolk, which is set to launch in September.\nNapier said on www.essexcricket.org.uk: 'The opportunity at RHS is one that I could not turn down. I feel the time is right to move on, and give back to the game that has given me so much.\nGraham Napier has announced he will retire from professional cricket at the end of 2016 county season\nEssex all-rounder to become director of Graham Napier Cricket Academy at Royal Hospital School in Suffolk\n'I have loved every second of playing for Essex, and will be doing my best to make sure I retire with a bang at the end of the season.'\nNapier, who was part of England's squad for the 2009 ICC World Twenty20 but did not play, has scored almost 5,500 runs at an average of 29.86 in first-class cricket and taken 421 wickets at an average 31.40 since his debut in 1997.\nA big-hitting all-rounder, Napier has twice struck 16 sixes in an innings for Essex - first in a Twenty20 match when making an unbeaten 152 off 58 deliveries against Sussex in 2008 and then again in the LV= County Championship clash against Surrey in 2011, when he made 196 off 130 balls.\nThat saw him equal the world record for sixes in a first-class innings, a mark broken by New Zealand's Colin Munro last year.","url":"https://www.dailymail.co.uk/sport/cricket/article-3394148/Essex-rounder-Graham-Napier-retire-end-2016-season.html"}
