{"authors":[],"date_download":"2018-10-22 20:37:08","date_modify":"2018-10-22 20:37:08","date_publish":"2014-05-02 18:43:25","description":"One establishment Republican predicts the Tea Party is poised for a defeat in the upcoming intra-party battles.","filename":"data/vaneerConsumption/EstablishmentGOPCallshisShotTeaPartyisGoingtoLoseinUpcomingPrimaries.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/416876/140502-teaparty-110308-teaparty-1140a-1438_3290c01cc1ecf1e690ef2f12f520b4be.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_establishment-gop-calls-his-shot-tea-party-going-lose-upcoming-n95891_1540240628.html","title":"Establishment GOP Calls his Shot: Tea Party is Going to Lose in Upcoming Primaries","title_page":"Establishment GOP Calls his Shot: Tea Party is Going to Lose in Upcoming Primaries","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAs the 2014 congressional primary season heats up, the Republican establishment is once again facing off against the Tea Party, and one establishment Republican predicts the Tea Party is poised for a defeat in the upcoming intra-party battles.\n“I think at the end of the day they’re going to lose big time,” said former Rep. Steve LaTourette, R-Ohio, who now heads the Main Street Partnership, an advocacy group that aims to elect moderate Republicans to congressional seats.\nThe month of May features several establishment-vs.-Tea Party primaries, including key Senate contests in North Carolina (May 6), Georgia (May 20) and Kentucky (also May 20). And right now, it appears the GOP establishment holds the early advantage in these contests.\nBut LaTourette has focused on one race in particular -- the May 20 Idaho primary between eight-term incumbent Mike Simpson, R-Idaho, and challenger Bryan Smith. Establishment types like the U.S. Chamber of Commerce, the Super PAC for LaTourette’s organization and even 2012 GOP presidential nominee Mitt Romney are backing Simpson, while conservative groups like the Club for Growth and Senate Conservatives Fund are supporting Smith.\n“You can take it from me -- the conservative choice for congress is Mike Simpson,” Romney says in a TV ad sponsored by the U.S. Chamber of Commerce. (In 2012, Romney easily won this congressional district, which has a substantial Mormon population.)\nDefending Main Street, the super PAC arm of LaTourette’s organization, launched an ad in April attacking Smith and Club for Growth President Chris Chocola. The ad ties in comments made by Chocola at a March debate with LaTourette where the Tea Party backer conveyed his respect for Rep. Nancy Pelosi.\n“While personal injury attorney Bryan Smith and his financial backers help Pelosi, Mike Simpson has been Nancy Pelosi’s worst nightmare,” claims the Defending Main Street ad out against Smith.\nMeanwhile, the Club for Growth has been airing a TV ad hitting Simpson for backing the 2008 Wall Street bailout. “My name is Mike Simpson; I voted for the $700 billion bailout,” the ad shows Simpson saying.\nWhat irks LaTourette is when these conservative groups spend millions of dollars trying to defeat incumbent Republicans rather than Democrats. “They’ll go in and claim that the incumbent Republican who served, in some instances for a long time, is a RINO [Republican-In-Name-Only], a liberal, not a true Republican,” says LaTourette. “These outside groups funded by a few very rich people … tilt the playing field by dumping sometimes millions of dollars into a race that, before then, would only be a couple hundred thousand.”\nHe also questions the tactics these conservative groups have employed – like the ones that led to last year’s brief shutdown of the federal government over President Obama’s health-care law. “I don’t have a problem with very conservative people in our caucus,” LaTourette said. “I don’t have any problem with the Tea Party. What I have a problem with is when they then, in order to raise money in many instances, say, ‘We’re going to have this fight, we’re going to take this hill’ when there’s no chance of taking this hill.”\nAsked for a comment to respond to this criticism, Club for Growth spokesman Barney Keller told NBC News that Club for Growth “doesn’t care what some corporate lobbyist says about us,” referring to LaTourette, who is a registered lobbyist after serving in Congress.\nThese outside groups funded by a few very rich people … tilt the playing field by dumping sometimes millions of dollars into a race that, before then, would only be a couple hundred thousand\nThe Club for Growth does not consider itself a Tea Party group, Chocola has said, but it does align with the Tea Party on economic issues. In his debate with LaTourette in March, Chocola argued that Tea Party Republicans are just doing what they promised when they ran for office and sticking to Republican ideals.\n“Every single Republican, since at least 2000, that is serving in the Congress, ran on the message that government’s too big, debts too big, we have to make sure we reform entitlements, and we have to make sure we get back to the principles of the Republican Party,” he said. “So when has that actually happened?”\nLaTourette believes the Republican Party must also become more inclusive and stop playing exclusively to the GOP base. The Republican Party, he adds, continuously attacks unions and has a “we don’t want you” attitude to their party membership.\n“We need to stop giving women advice on what they should do after they’ve been impregnated, after they’ve been raped, that’s probably a subject we should leave alone”, says LaTourette. “And we have to be inclusive, you know, we can’t continue to say that we don’t want people to be in the party with the growth of the Hispanic population, with women being 52, 53 percent of the electorate.”\n“Taking control of the Senate and actually electing a Republican will be a distant memory if we don’t perk up here,” he said.","url":"https://www.nbcnews.com/politics/first-read/establishment-gop-calls-his-shot-tea-party-going-lose-upcoming-n95891"}
