{"authors":["Brad Schrade"],"date_download":"2018-10-30 21:01:54","date_modify":"2018-10-30 21:01:54","date_publish":"2016-12-13 14:40:44","description":"The estate sale of Diane McIver drew thousands of people to the Buckhead showroom where people bough...","filename":"data/vaneerConsumption/Estatesaleofexecutivekilledbyhusbanddrawsthousandsaddsfinal.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/13/Images/WPIMAGE_cmgajcinvestigations_11472.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_investigations_estate-_79d85d19c7535ff739e9b5d3580cb452__1540933314.html","title":"Estate sale of executive killed by husband draws thousands, adds final...","title_page":"Estate sale of executive killed by husband draws thousands, adds final...","title_rss":"NULL","source_domain":"ajc.com","text":"The estate sale of Diane McIver drew thousands of people to the Buckhead showroom where people bought fur coats, designer jewelry and items from her large hat collection.\nNow, the popularity has led the company handling the deceased Atlanta executive's estate to add an additional day on Wednesday.\n\"Our sales are always popular, but this was off the charts,\" said Robert Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, which managed the sale.\nMcIver was shot in the back and killed Sept. 25 by her husband, Tex McIver, as the couple road in their SUV. He has said it was an accident, but the estate sale is going on as the criminal investigation by Atlanta police is ongoing. The peculiar nature of the shooting and the couple's prominence in business and political circles in Atlanta has fueled public interest in the case.\nTex McIver enlisted the estate sale company to help liquidate the more than 2,000 clothes and high-end fashion items of his deceased wife. His attorney, Stephen Maples, said the proceeds aren't going to his client, but will be used to cover some $350,000 in bequests that Diane McIver left in her will to friends and employees.\nAhlers said the estate sale that ran over the course of five days last week, culminating Sunday, was one of the company's most attended events in its history. He estimated between 2,000 and 3,000 people came to their showroom in Buckhead and that the sale \"exceeded expectations.\" He wouldn't disclose how much money the sale generated.\nThe reason for adding the extra day is because \"It feels like there's still interest there,\" he said. About 250 items are still left to sell.\nThe sale which will run Wednesday, however, will not be the final step in McIver's liquidation of his wife's estate. Ahlers said some higher end items that weren't part of the estate sale will be auctioned in January.","url":"https://www.myajc.com/blog/investigations/estate-sale-executive-killed-husband-draws-thousands-adds-final-day/GTCuVk1VnHZ5S27HUDBwBL/"}
