{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 04:55:52","date_modify":"2018-10-23 04:55:52","date_publish":"2017-04-26 16:24:11","description":"Ayodele Oladuti, 29, of South Croydon, South London, would use the photos of bank cards to commit identity theft and set up bank accounts and a phone contract in their names.","filename":"data/vaneerConsumption/Estateagentwhophotographedclientbankcardsisjailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3F9FD1E600000578-0-image-a-244_1493220137052.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448254_Estate-agent-photographed-client-bank-cards-jailed_1540270552.html","title":"Estate agent who photographed client bank cards is jailed","title_page":"Estate agent who photographed client bank cards is jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jailed: Ayodele Oladuti, 29, photographed his clients' bank cards while showing prospective buyers around their homes\nAn estate agent who photographed his clients' bank cards while showing prospective buyers around their homes was jailed for two years today.\nAyodele Oladuti, 29, of South Croydon, South London, would use the photos of cards and other documents to commit identity theft and set up bank accounts and a phone contract in their names.\nHe then returned to their homes to collect the fraudulently obtained cards and mobile phone, and used the photographed cards to buy clothing and electrical goods online and in stores.\nIn total he attempted to defraud 20 victims of just over £25,000 and was successful in obtaining just over £6,000.\nHis scheme came to light when one of the sellers became suspicious during a viewing as Oladuti did not leave the flat when the prospective buyers did.\nThe owner checked CCTV and saw him opening doors and cupboards. He took the footage to The Personal Agent's manager who immediately contacted Surrey Police.\nOladuti was jailed for two years at Guildford Crown Court (pictured). He attempted to defraud 20 victims of just over £25,000 and was successful in obtaining just over £6,000\nOladuti admitted seven counts of fraud and was jailed for two years at Guildford Crown Court.\nDetective Constable Simon Evans, who investigated the case, said: 'Mr Oladuti cynically manipulated his way into employment as an estate agent by faking his CV and setting up a fake email account to provide himself with a reference to an employment agency, who then recommended him to this local business.\n'He then systematically defrauded the people whose homes he was showing to prospective buyers. In at least one case he returned to defraud the victim a second time, once the victim had closed all their compromised accounts.\nHe caused untold stress and worry to his victims Detective Constable Simon Evans\n'Oladuti breached the trust placed in him by innocent victims who looked to him to help them sell their properties.\n'He caused untold stress and worry to his victims, who were forced to rearrange their financial affairs at the same time as they were trying to move house.\n'I am particularly grateful to The Personal Agent for their quick thinking and continued help in catching and prosecuting Mr Oladuti.\n'I hope that this sentence gives some comfort to the victims, including the estate agency, who have had to unpick the chaos that this man's identity fraud has caused.'","url":"https://www.dailymail.co.uk/news/article-4448254/Estate-agent-photographed-client-bank-cards-jailed.html"}
