{"authors":["Kirspencer For Daily Mail Australia"],"date_download":"2018-10-22 22:44:15","date_modify":"2018-10-22 22:44:15","date_publish":"2017-03-16 04:25:05","description":"The 37-year-old shared the photo of her and father Jack, documenting a special moment together before he walked her down the aisle to become Mrs Moggs.","filename":"data/vaneerConsumption/EstherAndersonsharesweddingphotowithfatherJack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E507D1100000578-0-image-a-68_1489634906015.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318598_Esther-Anderson-shareswedding-photo-father-Jack_1540248255.html","title":"Esther Anderson shares wedding photo with father Jack","title_page":"Esther Anderson shares wedding photo with father Jack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She tied the knot with partner Howard Moggs in a stunning beach ceremony earlier this year.\nAnd now Esther Anderson has posted a heartwarming photo of the man who gave her away.\nThe 37-year-old shared the photo of her and father Jack, documenting a special moment together before he walked her down the aisle.\nDaddy's girl: Esther shared a photo of her and dad Jack to Instagram Thursday, documenting a moment they shared on the way to her wedding\nEsther looked radiant in her elegant ivory gown, which featured intricate silver beading and layers of tulle.\nThe brunette beauty wore her hair loose around her face, with her high veil spread out along the seat behind the pair.\nGrinning at the camera, the former Home and Away star let her natural beauty shine through, with simple smokey eye make-up and a dusty pink lipstick.\nHe put a ring on it: Howard and Esther enjoyed a stunning beach ceremony earlier this year\nHer 91-year-old father looked dapper as he donned a crisp white shirt with a blue check tie.\nHe beamed proudly as he leaned in for the photo, as Esther held her pastel orange and pink flowered bouquet.\nThe romantic ceremony took place last month in Esther's hometown of Geelong, just outside of Melbourne.\nLoved-up: The 37-year-old was proposed to on Valentines Day in 2015, with her wedding taking place almost a year later\nIt came after Howard got down on bended knee with a romantic sunset proposal on Valentine's Day 2015, at the couple's LA home.\nThe stunning bride rocked up to the ceremony in a white Jaguar, alongside her father Jack and her sister Lara Eldrige, who served as maid of honour.\nAmong the guests at the couple's special day were the actress's former cast mates, Tessa James, and Bernard Curry and Kimberly Cooper, who performed at her reception.\nFamily affair: Esther was given away by her dad, with sister Lara serving as her maid of honour on the big day\n'It was magic, just ridiculously beautiful and romantic,' the brunette beauty told New Idea in an exclusive interview in February.\n'I have never been so happy in my whole life.'\nThe Summer Bay star had previously marched with him at ANZAC Day parade's, with Jack serving his country as part of the RAAF in New Guinea during World War II.\nShe enjoyed a honeymoon with her new husband before the two returned to LA, where she preparing for a new role.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318598/Esther-Anderson-shareswedding-photo-father-Jack.html"}
