{"authors":["Esther Rantzen For Daily Mail"],"date_download":"2018-10-22 22:31:23","date_modify":"2018-10-22 22:31:23","date_publish":"2017-03-10 00:55:06","description":"As a career woman and British TV star Esther Rantzen enjoyed late-motherhood. But it never occurred to her that meant she would be condemned to later grandmotherhood, too.","filename":"data/vaneerConsumption/EstherRantzenrealisesthepriceofhavingchildrenlate.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1E5B7C00000578-0-image-a-62_1489106009476.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299564_Like-career-women-Esther-Rantzen-children-late_1540247483.html","title":"Esther Rantzen realises the price of having children late","title_page":"Esther Rantzen realises the price of having children late | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Esther Rantzen's four-year-old grandson, Benjamin (pictured together) has forced her to rethink her whole life\nMy beloved four-year-old grandson, Benjamin, has forced me to rethink my whole life.\nWith one simple question he brought me face to face with the truth I have been avoiding, making me sharply aware of my own mortality, and how little time I have left.\nIt happened when I was in his home on one of my daily visits, playing forts with him, piling cushions on top of each other and making a terrible mess of my daughter's tidy sitting room.\nOn my way to find another cushion I met Benji in the hallway. He looked at me with round, dark eyes. 'Are you leaving, Etta?' he asked, worried. 'No,' I said, 'I'm staying.' 'For ever?' he asked.\nI've had some tough questions in my time, but this one went straight to my heart. I didn't answer him then, and I still can't, because the truth is too painful. I am 76 years old. So I can't stay with him for ever. I wish I could.\nI'll stay as long as I can. Long enough to see his tenth birthday, I hope and pray, although I'll be 82, and many of my friends and family have gone by that age.\nIn a panic I've looked up the average life expectancy of women in the UK, and it's only just over 80. So will I be spared long enough to see him at his 18th birthday? Or his wedding? Is it too much to ask?\nIt probably is. Although I've never admitted my age to Benji, the truth I have to face is that when he's 18, I'll be 90. The bleak fact is if I manage still to be here to throw confetti at his wedding, the chances are I'll be over 100 years old.\nEsther (pictured with her daughter and grandchildren) worries that by starting a family so late she is no a much older grandmother\nWhat I am facing, along with many women who have made the same life choice, is the consequence of being an older mother.\nBy starting my family so late I am very much an older grandmother. I never wanted a long life. I always thought I would take what fate hands out to me. But now I value every second I'm given, and long for more. And for the first time I wish I'd planned my life differently.\nMillions of women made the same decision, it's an integral part of the Sixties revolution which opened up a new world of opportunity to young women. So my generation made different choices from our own parents.\nEven though our mothers were in their 20s when we were born, and our grandmothers in their 40s, that wasn't the way we wanted our own lives to go.\nMany of us had mothers like mine who stayed at home, and I knew my mum had talents she'd never been able to explore.\nBut we Sixties women were being offered real careers for the first time.\nSuddenly the workplace became such an exciting place for us that it didn't seem relevant when medical experts told us women are at their most fertile between the ages of 20 and 24.\nWe didn't take it seriously when they said that we begin to lose our fertility at 27. I had my first baby at 37, and I am not alone.\nEsther had her first baby at 37. She is pictured with daughter Emily in 1979\nLast year, according to the Office for National Statistics, the number of women who had babies when they were over 40 overtook mothers under 20 for the first time in 70 years.\nThe fertility rate among older women has more than trebled since the early Eighties.\nI would say that is a direct result of the new opportunities open to women — the chance to take on demanding jobs, get the promotion we long for, and we no longer have the time or the inclination to start a family when our jobs are so challenging and time-consuming.\nAs part of the Sixties revolution, I've always considered myself incredibly lucky. I had a career I loved as a TV presenter and producer, and the work absorbed me. TV takes up every second of your time, every scrap of energy, and you give every waking hour to your work because it's enormous fun and dangerously challenging.\nIf your programme fails, the humiliation is public and intense. But if you get a programme right and reach a huge audience, it's like being at the centre of an explosive firework display.\nSince I was one of the few women given the opportunity to present programmes in those distant misogynist times, the Sixties and Seventies, I had to make sure I didn't fail. I had to prove women had something special to offer.\nSo I made programmes about subjects men hadn't considered important enough — like childbirth, mental health and child abuse.\nI found myself creating a consumer programme, That's Life! The years went by and my 20s turned into my 30s almost without me noticing. I was brought up with a shock when a reporter from the Jewish Chronicle asked: 'Why is it you never married?'\nAfter a successful career in TV, Esther had children and married later in life. When her first baby was born she was offended to be told by her obstetrician that I was officially 'a geriatric mother'\nFor the first time I thought: 'Is it too late, now?' Had I been so absorbed in my career that I had lost the chance of marrying and having a family of my own?\nThen, when I was in my 30s, I was lucky again. I married my beloved husband, documentary-maker Desmond Wilcox. After we had been together for ten years, our first baby was born, and I was offended to be told by my obstetrician that I was officially 'a geriatric mother'.\nTwo years later, when I was 39, my second daughter came along. Eighteen months after that, by which time I was 41, my son was born. And although I was much older than many of the other mothers at school, I didn't mind.\nAfter all, there are advantages in late-motherhood. I never minded staying at home with my toddlers rather than travelling the world; I'd done my travelling. I never missed the parties I turned down; they were far more boring than reading bed-time stories.\nI was senior enough in the BBC for colleagues to tolerate the time I took off to see a school play or sports day.\nWhile she was enjoying late-motherhood, it never occurred to Esther that meant she would be condemned to later grandmotherhood, too. Esther is pictured with husband Desmond Wilcox with their children Emily, then two, and Rebecca, then seven months\nAnd although I declined the opportunity to take part in the mums' race, knowing I would run out of breath halfway through, and although my husband was sometimes confused with a grandfather at school, those were pinpricks to our pride that we soon forgot.\nThen Desmond died aged only 69, and our children lost him far, far too early. It was a terrible price to pay for having older parents. They were still in their teens, and the pain is still raw for them.\nWe all feel we were robbed. As we comforted each other, I was under instructions from the children to be more careful. They didn't want to lose another parent, and I promised I would stay around for a reasonable time. After all, my own parents had survived into their 90s. Surely, I thought, that would be long enough?\nNot any more. The idea of never seeing Benji grow up breaks my heart. I have two more toddler grandsons who give me such joy that I count each precious moment I spend with them. So many things that give us the most pleasure are fleeting.\nEsther has written a letter to her grandchildren for them to read after her death\nSince Benji's question, I am constantly aware of the poignant, agonising truth, that our time together is limited.\nI have resolved to write a letter to my grandchildren for them to read after my death, to make sure they know how precious they are to me, and to remind them of the fun we had together. To tell them what I hope their lives will bring. To apologise to them that I will have to leave them far too soon.\nI can't remake my life. It would be wrong to dismiss the work I did with such passion. But if only I had known my grandchildren would fill my heart with such joy, perhaps I would have decided to start my family ten years earlier, whatever that did to my career.\nI hope today's mothers recognise the truth.\nWhile I was enjoying late-motherhood, it never occurred to me that meant I would be condemned to later grandmotherhood, too.\nNo Benji, I won't be able to stay with you for ever, but thank you for asking me the question that has made me value every moment we have left.","url":"https://www.dailymail.co.uk/femail/article-4299564/Like-career-women-Esther-Rantzen-children-late.html"}
