{"authors":["Jessica Taylor"],"date_download":"2018-10-23 00:47:19","date_modify":"2018-10-23 00:47:19","date_publish":"2017-01-07 00:00:00","description":"The head of the Office of Government Ethics writes that several nominees have not completed the required ethics review process or submitted financial disclosures. Hearings begin next week.","filename":"data/vaneerConsumption/EthicsOfficeWarnsConfirmationsForTrumpNomineesAreMovingTooFast.json","image_url":"https://media.npr.org/assets/img/2017/01/07/gettyimages-630618528_wide-0f93d5172be6e588ffccd7e5fad32952c16a6627.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_07_508699137_ethics-office-warns-confirmations-for-trump-nominees-are-moving-too-fast_1540255639.html","title":"Ethics Office Warns Confirmations For Trump Nominees Are Moving Too Fast","title_page":"Ethics Office Warns Confirmations For Donald Trump's Nominees Are Moving Too Fast : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ethics Office Warns Confirmations For Trump Nominees Are Moving Too Fast\nEnlarge this image toggle caption Don Emmert /AFP/Getty Images Don Emmert /AFP/Getty Images\nUpdated at 5:30 p.m.\nThe Office of Government Ethics is raising alarm over the pace of confirmation hearings for President-elect Donald Trump's nominees, saying Saturday that they have yet to receive required financial disclosures for some picks set to come before Congress next week.\nIn a letter to Senate Minority Leader Chuck Schumer, D-N.Y., and Sen. Elizabeth Warren, D-Mass., released Saturday, OGE Director Walter Shaub wrote that \"the announced hearing schedule for several nominees who have not completed the ethics review process is of great concern to me\" and that the current schedule \"has created undue pressure on OGE's staff and agency ethics officials to rush through these important reviews.\n\"More significantly, it has left some of the nominees with potentially unknown or unresolved ethics issues shortly before their scheduled hearings,\" Shaub continued. \"I am not aware of any occasion in the four decades since OGE was established when the Senate held a confirmation hearing before the nominee had completed the ethics review process.\"\nShaub explains in the letter that the Ethics in Government Act requires that presidential appointments confirmed by the Senate obtain OGE certification of their financial disclosures prior to any congressional hearings. Such a process is \"complex\" and \"labor-intensive,\" he notes, and takes \"weeks, not days\" to ensure that the Senate has a clear picture of any possible conflicts of interest.\nA Senate GOP source, however, noted that in the past the OGE paperwork hasn't always preceded hearings. For example, in 2001, Rod Paige, George W. Bush's nominee for Secretary of Education, had his hearing over a week before the committee received the OGE paperwork.\nSenate committees are set to begin confirmation for several Trump nominees for Cabinet positions and other posts next week so that they can be voted on and sworn in as soon as possible after Trump takes office on January 20.\nAttorney General nominee Jeff Sessions and Homeland Security nominee, retired Gen. John Kelly, are set for hearings on Tuesday.\nOn Wednesday, hearings are set for Secretary of State nominee Rex Tillerson, whose close ties to Russia as Exxon Mobil CEO have come under scrutiny, along with Education Secretary nominee Betsy DeVos and Transportation Secretary nominee Elaine Chao.\nOn Thursday, hearings are set for Housing and Urban Development Secretary nominee Ben Carson and Commerce Secretary nominee Wilbur Ross. A hearing on retired Marine Corps Gen. James Mattis, Defense Secretary nominee, is also scheduled.\nDemocrats have already charged that Senate Republicans are trying to hurry through hearings for the president-elect's Cabinet, and the warning letter from the federal ethics watchdog gives that argument more weight.\nSchumer said in a statement that the OGE letter \"makes crystal clear that the transition team's collusion with Senate Republicans to jam through these Cabinet nominees before they've been thoroughly vetted is unprecedented.\"\n\"The Senate and the American people deserve to know that these Cabinet nominees have a plan to avoid any conflicts of interest, that they're working on behalf of the American people and not their own bottom line, and that they plan to fully comply with the law,\" Schumer continued. \"Senate Republicans should heed the advice of this independent office and stop trying to jam through unvetted nominees.\"\nIn a statement, the Trump transition team dismissed the OGE letter as overtly political and argued that \"the transition process is currently running smoothly.\"\n\"In the midst of a historic election where Americans voted to drain the swamp, it is disappointing some have chosen to politicize the process in order to distract from important issues facing our country,\" the Trump statement read. \"This is a disservice to the country and is exactly why voters chose Donald J. Trump as their next president.\"\nShaub said that his office would \"continue expediting our ethics reviews of the President-elect's nominees to meet reasonable timeframes without sacrificing quality.\"\n\"It would, however, be cause for alarm if the Senate were to go forward with hearings on nominees whose reports OGE has not certified,\" he continued. \"For as long as I remain Director, OGE's staff and agency ethics officials will not succumb to pressure to cut corners and ignore conflicts of interest.\"\nIn November, Shaub raised eyebrows when the OGE Twitter account posted odd tweets urging Trump to fully divest from his business interests. NPR later reported that it was Shaub himself who had personally directed the tweets.\nTamara Keith contributed.","url":"https://www.npr.org/2017/01/07/508699137/ethics-office-warns-confirmations-for-trump-nominees-are-moving-too-fast"}
