{"authors":["Norm Eisen","Ethics Expert"],"date_download":"2018-10-22 21:30:55","date_modify":"2018-10-22 21:30:55","date_publish":"2017-01-19 00:00:00","description":"Norm Eisen and Richard Painter discuss Trump's business conflicts. The new president will be \"violating the constitutional conflicts clause ... as soon as he takes the oath of office,\" Eisen says.","filename":"data/vaneerConsumption/EthicsLawyersCallTrumpsBusinessConflictsNakedlyUnconstitutional.json","image_url":"https://media.npr.org/assets/img/2017/01/19/gettyimages-628021400_wide-823d5091a646ff7b475a802ef588aa3901a8b86f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_19_510574687_ethics-lawyers-call-trumps-business-conflicts-nakedly-unconstitutional_1540243855.html","title":"Ethics Lawyers Call Trump's Business Conflicts 'Nakedly Unconstitutional'","title_page":"Ethics Lawyers Call Trump's Business Conflicts 'Nakedly Unconstitutional' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ethics Lawyers Call Trump's Business Conflicts 'Nakedly Unconstitutional'\nEnlarge this image toggle caption Eduardo Munoz Alvarez/AFP/Getty Images Eduardo Munoz Alvarez/AFP/Getty Images\nWill Donald Trump's new job as president create ethical conflicts with his long-running role as a business owner?\nTrump sees no problem. \"I have a no-conflict situation, because I'm president,\" Trump said at a recent press conference. He was correctly referring to the federal conflicts-of-interest law that covers Cabinet secretaries, but not presidents.\nStill, ethics experts say other restrictions do apply to presidents, setting up serious ethical problems for the new administration.\n\"A president is not permitted to receive cash and other benefits from foreign governments,\" Norm Eisen tells Fresh Air's Terry Gross. \"And yet, Donald Trump is getting a steady flow of them around the world and right here in the United States.\"\nEisen, who served as President Obama's special counsel on ethics and government reform, has joined forces with Richard Painter, the former chief ethics lawyer for President George W. Bush, to speak out publicly about Trump's potential conflicts of interest.\nEisen describes Trump's business entanglements as \"frankly and nakedly unconstitutional. ... It is extraordinary that we'll have a president who is violating the constitutional conflicts clause, the so-called Emoluments Clause, as soon as he takes the oath of office,\" he says.\nPainter concurs with Eisen's assessment. \"The president needs to focus on protecting the United States and American interests in a very dangerous world,\" Painter says. \"I really hope that President Trump takes the steps he needs to, to be free of conflict of interest in that endeavor.\"\nInterview Highlights\nWhen [Trump] makes his decisions to use America's military force, or threaten it abroad, how will we know that he is not putting ordinary Americans' lives at risk in order to protect his properties, and his pocket and his wallet?\nOn questions that arise because Trump hasn't released his tax returns and detailed financial reports\nNorm Eisen: So many people in the heartland of the country rightly are angry that their lives have been devastated by economic and trade developments of recent years, and also, many of them have [gone] themselves or sent their kids abroad to fight America's wars.\nWith Donald Trump receiving these enormous sums from foreign governments, and having strong property interests and relationships in many foreign governments, when he makes his decisions on domestic and economic policy, how will we know that he is not using the White House to do deals for himself at the expense of the people who voted for him? When he makes his decisions to use America's military force, or threaten it abroad, how will we know that he is not putting ordinary Americans' lives at risk in order to protect his properties, and his pocket, and his wallet, rather than in the best interest of our country?\nOn how Trump's business loans could interfere with his ability to regulate banks\nRichard Painter: Consider, for the example, the debt from Deutsche Bank. Now, Deutsche Bank is a private bank, but we already know about very large loans from Deutsche Bank, and so that's a dependency relationship, and yet the president is supposed to be regulating or supervising the people who regulate the financial services sector.\nThey're talking about repealing Dodd-Frank ... and scaling back on bank regulations, making it easier for banks to loan money against collateral, which is almost always real estate, and that's what they're talking about doing in this administration, and here's the president of the United States, dependent upon banks — some government-owned, some private banks, all over the world — and there's a serious conflict of interest there.\nOn the chairman of the House Committee on Oversight calling the director of the Office of Government Ethics, Walter Shaub Jr., to come before his committee after Shaub criticized Trump's plan to address business conflicts\nPainter: That congressional committee of so-called oversight in government reform has been a politicized body engaged in politicized investigations for a long time. ... And now what we have is the chairman of the committee, instead of focusing on the serious problems with respect to the president-elect's conflicts of interest and the potential constitutional violation that we will have on Friday [Inauguration Day] because of the foreign government payments, that committee doesn't want to focus on that, all they want to do is start to harass the Office of Government Ethics and try to investigate the Office of Government Ethics simply because [Director] Walter Shaub had the courage to speak out and say exactly what I've been saying ... that the president's divestiture plan is inadequate. ...\nThis is just pure partisan politics coming out of the House Oversight Committee, and I'm embarrassed, as I say, having been a Republican for many years, to see them bringing partisan politics into their work and now harass the Office of Government Ethics for doing its job.\nOn the security risks posed by having the Trump name on buildings around the world\nPainter: Do you want to put the name of the president of the United States on a building in a country with a high risk of terrorist attacks? ... I think that's asking for trouble. ... It certainly doesn't help to have a president who makes insulting comments about other people's religion — that certainly gets the extremists energized.\nI think there's a serious global security concern with having the president's name up on these buildings, and we could get sucked into something overseas because something happens to one of those buildings and the people in it.\nOn the chances that Congress will use its authority to force Trump to end the conflicts of interest he will face as president\nEisen: You might say, Terry, \"Wait a minute, Congress is in the hands of the same party as the White House. Are they really going to pivot against Donald Trump?\" But let's remember that the Senate hangs by just a few votes, and there are some very independent-minded Republicans in the Senate, and I think when we get to our first scandal — and scandal will be inevitable with this arrangement that Mr. Trump is maintaining where he's hanging on to his ownership interests ... I think you'll see in the Senate that some of those Republicans join with the Democrats to ask for documents, ask for witnesses, to call for hearings. So I think you'll see some legislative oversight.","url":"https://www.npr.org/2017/01/19/510574687/ethics-lawyers-call-trumps-business-conflicts-nakedly-unconstitutional"}
