{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 22:06:28","date_modify":"2018-10-30 22:06:28","date_publish":"2015-04-20 14:30:21","description":"Nearly one in four Britons will be non-white by 2051, thanks to the high birth rates amongst ethnic minorities, new research has revealed. The majority of |","filename":"data/vaneerConsumption/EthnicMinoritiesSettoMakeUpQuarterofBritishPopulationby2051.json","image_url":"https://media.breitbart.com/media/2015/03/Crowded-Britain-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_20__1540937188.html","title":"Ethnic Minorities Set to Make Up Quarter of British Population by 2051","title_page":"Ethnic Minorities Set to Make Up Quarter of British Population by 2051 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Nearly one in four Britons will be non-white by 2051, thanks to the high birth rates amongst ethnic minorities, new research has revealed. The majority of the increase will take place within the Indian and Pakistani communities.\nStudies have previously suggested that ethnic minorities will rise to account for between 20 and 30 per cent of the population by 2050. The new comprehensive study by researchers in the Geography Department at the University of Leeds falls squarely within that range, predicting that ethnic minorities will comprise 24.3 per cent of the British population by 2051, up from 12.8 at the 2011 census.\nPhilip Rees, emeritus professor of population geography at Leeds University told the Times: “Even if you shut the borders — which is impossible under international law — the minority ethnic groups, with the possible exception of the Chinese, would continue to grow because of their age structures . . . [which] are concentrated in the reproductive years.”\nBritain’s ethnic minority populations tend to be younger than the British average: the median age for white Britons is 38; for those of Bangladeshi origin it is 22, for those of Pakistani origin it is 24; for Black Africans it is 25, and for Indians, 30. Only Black Caribbeans approach the white British median, with an average age of 37.\nThe baby boom amongst ethnic minorities is expected to cause a significant increase in the overall population, as numbers rise from the official estimate of 63.4 million in 2011 to 77.4 million over the next three and a half decades. While the white population is expected to increase marginally by 3.3 million to reach 58.6 million, the ethnic minority population is predicted to more than double to 18.7 million in total.\nImmigration regularly ranks at or near the top of voters concerns, yet the Westminster parties have avoided the topic during this election period for fear of losing ground to UKIP. Labour has refused to set an immigration target figure, instead promising to “ensure Britain continues its proud history of providing refuge for those fleeing persecution” and limit the time asylum seekers spend in detention, whilst the Conservatives have downgraded their 100,000 target to merely an “ambition”.\nDavid Coleman, professor of demography at the University of Oxford, said: “Many of the consequences of large-scale migration are damaging. We do not need up to 13 million more people by the mid century. Almost all that increase will be immigrants and their children. It will not make the UK a happier or richer place.\n“Crowding and congestion will have entirely negative effects, increasing pressure on schools, hospitals and particularly housing.”\nAnd Alp Mehmet, vice-chairman of Migration Watch UK, which campaigns for lower immigration, said: “All such projections are uncertain but they do underline the huge impact of mass immigration on our society.”\nThere has also been some dispute over official population estimates in recent years. In 2008, Member of Parliament Greg Hands noted in a blog: “Many observers think the UK’s population is much bigger. A leading figure at Tesco recently told one of my parliamentary colleagues that they estimate the population of the UK to be closer to 80 million, based on the volume of certain staples they sell. Tesco are probably a world leader in understanding their consumer market, so it would be foolish to disregard their opinion.”\nThe estimate prompted Hands to ask: “just who are these extra 20 million people?”\nCommenting on the recent research, Simon Ross, director of Population Concern, said the consequences of migration on quality of life must be addressed, saying: “There a lot of people with vested interests in immigration, the universities and employers for instance . . . People talk about the taxes that migrants pay but that is a short-term view. Migrants have children and get old and we need to take account of the services they will eventually use.\n“We should not reduce migration simply to a taxation issue. We should talk about its effect on British society including the need for more housing which affects the green belt and transport infrastructure. These are quality of life issues.”","url":"https://www.breitbart.com/national-security/2015/04/20/ethnic-minorities-set-to-make-up-quarter-of-british-population-by-2051/"}
