{"authors":["Associated Press"],"date_download":"2018-10-23 04:26:50","date_modify":"2018-10-23 04:26:50","date_publish":"2016-01-29 20:09:36","description":"LONDON (AP) — The European Union and the United States are hurtling toward a deadline on reaching a new agreement over data sharing that would extinguish the...","filename":"data/vaneerConsumption/EUandUSdaysawayfromdeadlinetorenewdatasharingpact.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423117_EU-US-days-away-deadline-renew-data-sharing-pact_1540268810.html","title":"EU and US days away from deadline to renew data-sharing pact","title_page":"EU and US days away from deadline to renew data-sharing pact | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"EU and US days away from deadline to renew data-sharing pact\nLONDON (AP) — The European Union and the United States are hurtling toward a deadline on reaching a new agreement over data sharing that would extinguish the risk of costly litigation by consumers worried about their privacy.\nThe two sides have been trying to forge an agreement by Jan. 31 after Europe's top court struck down the previous pact in October due to concerns over the rights of Europeans' data stored by companies in the U.S. and their potential exposure to surveillance from U.S. intelligence agencies.\nOn Friday, Christian Wigand, a spokesman at the European Commission, said \"intense\" negotiations were ongoing but warned there wouldn't be an agreement at \"any price.\"\n\"We need an arrangement that lives up to the benchmarks that have been set by the European Court of Justice,\" he said.\nIn its October decision, the Court declared the so-called \"Safe Harbor\" pact was invalid because it did not adequately protect European consumers where their data was stored in the U.S., in light of the spying revelations made by Edward Snowden, a former contractor at the U.S.'s National Security Agency. Snowden's revelations had prompted the complaint to the Court from an Austrian law student, Max Schrems.\nThe pact, which had been used by 4,500 companies, had effectively allowed the easy transfer of data from the EU to the U.S. by having U.S. companies promise to provide privacy protections equivalent to those in the EU. The decision opened up the possibility that data privacy officers across the 28-country EU might be inundated by complaints by consumers, making it hugely difficult — and potentially expensive — for the likes of Apple, Facebook and Google to do business.\nLast week, U.S. Secretary of Commerce Penny Pritzker said both sides had been working on new arrangements for two years before the European court's ruling. She said a \"comprehensive offer\" is on the table and that an \"annual review\" will help adapt to changes in the field.\nAndrus Ansip, the European commissioner responsible for the digital single market, also said a key requirement was that Europeans \"will be treated on equal terms\" with Americans.","url":"https://www.dailymail.co.uk/wires/ap/article-3423117/EU-US-days-away-deadline-renew-data-sharing-pact.html"}
