{"authors":["Victoria Friedman"],"date_download":"2018-10-30 20:44:04","date_modify":"2018-10-30 20:44:04","date_publish":"2018-08-10 18:27:40","description":"The ECB has become concerned about the knock-on effects the fall of the Turkish lira will have on some of Turkey's biggest European lenders.","filename":"data/vaneerConsumption/EUBankConcernsGrowoverLiraAfterTrumpDoublesTurkeyTariffs.json","image_url":"https://media.breitbart.com/media/2018/08/Trump-Erdogan.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_10__1540932244.html","title":"EU Bank Concerns Grow over Lira After Trump Doubles Turkey Tariffs","title_page":"EU Bank Concerns Grow over Lira After Trump Doubles Turkey Tariffs","title_rss":"NULL","source_domain":"breitbart.com","text":"The Single Supervisory Mechanism, the European Central Bank’s financial watchdog, has become concerned about the knock-on effects the fall of the Turkish lira will have on some of Turkey’s European lenders after it experienced one of the biggest one-day falls of any free-floating currency in 20 years.\nThe panic has prompted investors to dump eurozone bank shares, with BBVA, UniCredit, and BNP, which have significant operations in Turkey, the worst effected.\nShares in Spain’s BBVA were down 5.7 percent late on Friday, Italy’s UniCredit off 6.4 percent, and France’s BNP Paribas dropping 4.4 percent, all exceeding a 4.3 percent drop in the euro zone bank index, according to Reuters.\nThe ECB is concerned that the contagion will result in Turkish borrowers defaulting on foreign currency loans, which make up about 40 percent of the Turkish banking sector’s assets, according to the Financial Times.\nThe currency has already fallen 36 percent in 2018 and has slid against the dollar on Friday.\nAlso on Friday, relations between the United States and Turkey have worsened over the fundamentalist Muslim-majority country’s detention of American pastor Andrew Brunson, who was arrested by authorities during a post-military coup attempt in 2016.\nTurkish lira having one of the biggest one-day falls of any free-floating currency in over 20 years. Now down 14%, but was off as much as 20% earlier today. For comparison:\nIndonesian rupiah -15% on 6 May, 1998\nS African rand -15% on 15 Oct, 2008\nUK pound -8% on 24 June, 2016 — Jamie McGeever (@ReutersJamie) August 10, 2018\nPresident Donald J Trump tweeted on Friday that “Our relations with Turkey are not good at this time!” adding that he had “just authorized a doubling of Tariffs on Steel and Aluminum with respect to Turkey as their currency, the Turkish Lira, slides rapidly downward against our very strong Dollar!”\n“Aluminum will now be 20% and Steel 50%,” President Trump wrote.\nThe President had tweeted at Turkey’s Islamist President Recep Tayyip Erdoğan last month to free Pastor Brunson, writing: “He has been held hostage far too long. @RT_Erdogan should do something to free this wonderful Christian husband & father. He has done nothing wrong, and his family needs him!”\nErdoğan attempted to downplay economic concerns by telling Turks “not to worry”, telling supporters they were in an “economic war” and to convert their dollars and “gold under the pillow” into lira.\nI have just authorized a doubling of Tariffs on Steel and Aluminum with respect to Turkey as their currency, the Turkish Lira, slides rapidly downward against our very strong Dollar! Aluminum will now be 20% and Steel 50%. Our relations with Turkey are not good at this time! — Donald J. Trump (@realDonaldTrump) August 10, 2018\nHis tone echoed that of a speech given on Thursday when he told supporters that “if they have dollars, we have our people, our righteousness, and our God”.\nThe contagion of instability from Turkey into Europe may extend beyond the financial, should the country decide to or find itself no longer able to keep up with its end of the EU-Turkey agreement to stop the flow of Middle Eastern migrants across the Mediterranean into Greece, resulting in a second migrant crisis.\nGerald Tatzgern, of Austria’s Federal Criminal Police Office (BKA), suggested last month that the deal could only be maintained depending on the stability of Turkey — which could be unravelled if the economy crashes.\nTwitter Follow @friedmanpress Follow Victoria Friedman on","url":"https://www.breitbart.com/europe/2018/08/10/eu-bank-concerns-turkish-lira-president-trump/"}
