{"authors":["Associated Press"],"date_download":"2018-10-23 02:02:49","date_modify":"2018-10-23 02:02:49","date_publish":"2016-01-11 13:44:03","description":"BRUSSELS (AP) — The European Union has ordered Belgium to recover some $760 million in illegal tax breaks from 35 multinationals, its latest ruling against t...","filename":"data/vaneerConsumption/EUBelgiumgaveillegaltaxbreakstotaling760million.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:b44183a176e543e8bf4741805d7b4229-56CX32zFKLb7123928b84cf57af6-166_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393722_EU-Belgium-gave-illegal-tax-breaks-totaling-760-million_1540260169.html","title":"EU: Belgium gave illegal tax breaks totaling $760 million","title_page":"EU: Belgium gave illegal tax breaks totaling $760 million | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"EU: Belgium gave illegal tax breaks totaling $760 million\nBRUSSELS (AP) — The European Union has ordered Belgium to recover some $760 million in illegal tax breaks from 35 multinationals, its latest ruling against the sweet deals many member states offered to some of the world's biggest companies.\nEU Competition Commissioner Margrethe Vestager said Monday the tax advantage given to a select group of mainly European companies \"distorts competition\" by putting smaller competitors \"on an unequal footing.\"\n\"National tax authorities cannot give any company, however large, however powerful an unfair competitive advantage compared to others,\" Vestager said. \"This scheme puts smaller competitors at an unfair disadvantage.\"\nEuropean Union Commissioner for Competition Margrethe Vestager speaks during a media conference on a state aid ruling at EU headquarters in Brussels on Monday, Jan. 11, 2016. The European Union has ordered Belgium to recover some 760 million US dollars in illegal tax breaks from 35 multinationals in the latest move to fight sweet deals many member states have offered to some of the world's biggest companies. (AP Photo/Virginia Mayo)\nBelgian Finance Minister Johan Van Overtveldt said he could still appeal the decision before the EU's high court depending on negotiations on how to claw back the taxes. \"The consequences for the companies involved could be major, and the recovery extremely complex,\" he said.\nSince the EU ruled on a government taxation system instead of deals with specific companies, it did not name any multinational involved beyond noting that they were mainly European.\nUnder the system, Vestager said multinationals did not have to pay taxes on more than 50 percent of their actual profits. Sometimes it went as high as 90 percent.\n\"We know of no other scheme similar to this, probably that was one reason it was named 'only in Belgium',\" Vestager said.\nThe disclosure that multinationals have benefited from huge tax breaks across Europe has become a big political issue at a time when many governments have been raising taxes on their citizens in an attempt to balance the books.\nOver the past months, Vestager's office has gone after several member states, including the Netherlands and Luxembourg and targeted companies like Fiat and Starbucks. It has three more tax probes ongoing, centering on U.S. companies like Apple, Amazon and McDonald's.\nVesteger has faced criticism that she has unduly focused on U.S. companies. On Monday, she denied that the latest ruling was part of a balancing act.\n\"I, of course, hear the criticism that this is about US companies, which it is obviously not,\" Vestager said.\n______\nFollow Raf Casert on Twitter at http://www.twitter.com/rcasert\nEuropean Union Commissioner for Competition Margrethe Vestager speaks during a media conference on a state aid ruling at EU headquarters in Brussels on Monday, Jan. 11, 2016. The European Union has ordered Belgium to recover some 760 million US dollars in illegal tax breaks from 35 multinationals in the latest move to fight sweet deals many member states have offered to some of the world's biggest companies. (AP Photo/Virginia Mayo)","url":"https://www.dailymail.co.uk/wires/ap/article-3393722/EU-Belgium-gave-illegal-tax-breaks-totaling-760-million.html"}
