{"authors":["Jack Montgomery"],"date_download":"2018-10-30 20:02:58","date_modify":"2018-10-30 20:02:58","date_publish":"2018-09-13 13:13:34","description":"UKIP's David Coburn branded the EU's new copyright proposals an \"enormous strike against free speech on the Internet\" in the EU Parliament.","filename":"data/vaneerConsumption/EUCopyrightProposalsaStrikeAgainstFreeSpeechontheInternet.json","image_url":"https://media.breitbart.com/media/2018/09/Voss.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_09_13__1540929778.html","title":"EU Copyright Proposals a 'Strike Against Free Speech on the Internet'","title_page":"UKIP: EU Copyright Proposals a 'Strike Against Free Speech on the Internet'","title_rss":"NULL","source_domain":"breitbart.com","text":"UKIP Scotland MEP David Coburn branded the EU’s new copyright proposals an “enormous strike against free speech on the Internet” in the European Parliament, before being howled down by establishment politicians and cut off by the parliament’s president.\nMr Coburn attempted to speak out against the EU Commission’s proposal on a new Directive regulating Copyright in the Digital Single Market, moved by rapporteur Axel Voss — a German MEP representing Angela Merkel’s Christian Democratic Union (CDU).\n“This is an enormous strike against freedom of speech on the Internet,” he told the chamber — before being drowned out by a chorus of boos.\nPresident of the EU Parliament Antonio Tajani — formerly a member of the European Commission himself — promptly took the side of the hecklers.\n“OK, the speaker is interrupted. Let’s move on to the vote, let’s move on to the vote. We don’t need to open a debate,” he said.\nCoburn had a chance to expand his thoughts on the legislation in an interview with YouTube polemicist and recent UKIP recruit Carl Benjamin — better known as Sargon of Akkad — in the parliament building, telling him the legislation was about blocking off avenues for independent dissidents to reach large audiences, not protecting creators.\n“It’s not to protect copyright, I can tell you that,” he laughed.\n“It’s nothing to do with protecting copyright. The one thing that’s upset this place is the rise of populist parties, like UKIP — the word populist is a dirty word.\n“They are scared witless, and UKIP could never have existed, have risen, without the Internet, without the freedom of the Internet. It was the one thing that gave us the ability to transcend the media, the control of press barons, the BBC — the Brussels Broadcasting Corporation or the Bolshevik Broadcasting Corporation, depending on your point of view — ITV, or whatever.\n“That’s all controlled, [but the Internet] was a way of getting the [populist] message out there, and they are horrified by this, and it’s taken them years to figure out ways of trying to cripple it,” he said.\n“If they don’t do something about it, it’s basically exposing the fact that the emperor has no clothes, and they can’t have this, they’ve got to do something about this.\n“So this is their way of attacking your ability, all you Internauts out there, it’s their way of getting at you and taking away your freedom,” he insisted, appealing directly to the camera.\n‘Internet Disaster’: EU Parliament Approves ‘Upload Filter’ Criticised as Meme Ban https://t.co/hn7cy90hVL — Breitbart London (@BreitbartLondon) September 12, 2018\nCoburn and Benjamin believe that the EU’s proposals will end the creative transformation of film clips, news material, and so on by turning them into memes or offering commentary on them, despite fair use protections, because Internet Service Providers will have to use upload filters to automatically block anything that looks like it had once belonged to a corporation, or else risk being “bankrupted”.\n“These corporations have more money than God,” explained Coburn.\n“So they’ll come and they’ll get you — the only people that will be able to continue, will be people with money, so it’s basically keeping the little guys out,” he added.\nUpload filters and copyright rules which already exist on social media platforms are incredibly blunt instruments and frequently abused.\nFor example, musician James Rhodes recently had a piece by long-dead composer Johann Sebastian Bach which he played pulled down from Facebook after Sony claimed ownership, and Felix ‘PewDiePie’ Kjellberg — YouTube’s biggest star — claimed he received a copyright strike on his channel for playing a cover of Luis Fonsi’s ‘Despacito’ on his own guitar.\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/09/13/ukip-eus-copyright-proposals-enormous-strike-against-free-speech-internet/"}
