{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:50:00","date_modify":"2018-10-30 21:50:00","date_publish":"2016-12-16 00:00:00","description":"The EU is considering a change that would let the ECB force euro clearing activities to occur in a country that uses the euro, ruling out Britain.","filename":"data/vaneerConsumption/EUconsidersrulechangetoforceeuroclearingawayfromLondonpreBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_eu-considers-rule-change-force-euro-clearing-away-from-london-pre-brexit-2016-12_1540936200.html","title":"EU considers rule change to force euro clearing away from London pre-Brexit","title_page":"    EU considers rule change to force euro clearing away from London pre-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A hangman's noose outside The Prospect of Whitby pub with Canary Wharf in the background. AP Photo/John D McHugh LONDON — The European Union could once again try and strip the City of London of its euro clearing business, according to a Financial Times report.\nThe FT reports that European Commission is considering a change that would allow the European Central Bank control over where euro-based clearing occurs, allowing it to force the activities to occur in a country that uses the euro. The change, not yet fully decided on, would likely happen next Spring.\nClearing houses in London manage credit risk, acting as a middle-man in swaps and derivatives trades to guarantee the contract in the event that one of the parties involved in the trade goes bust.\nThe acceptance of English law and widespread use of English language has made London a hub for clearing globally. The charts below, from the House of Lords select committee report on Brexit's effect on financial services published this week, shows just how dominant Britain is in the market: House of Lords London is the world's biggest euro clearing hub and controls 70% of clearing involving euro-based deals, according to Sky News.\nBritain repeatedly had to defend its right to clear trades, given that it does not have the euro. The UK last year won a court battle to continue clearing in London.\nHowever, France has repeatedly signalled that it wants to steal the business from London. President Francois Hollande said Britain could not retain its key clearing role shortly after the June 23 referendum. France's finance minister Michel Sapin also told Sky News earlier this year: \"One thing is sure, no one in the Eurozone will accept that the main clearing place will be outside the European Union.\"\nParis, London's nearest rival for clearing, handles 11% of all euro trades and France is understood to be a key driving force behind the push to changed the clearing rules.\nThe House of Lords Brexit select committee report on financial services published this week noted that Britain may be unable to mount another legal challenge to any rule change if it has already begun the process of leaving the EU.\nThe report says: \"It thus appears that the legislative changes necessary to bring about repatriation of euro clearing could take place without recourse to treaty change. The UK, as a non-EU Member State post-Brexit, would not be able to challenge its lawfulness before the General Court.\"\nSir Charles Bean, chief economist at the Bank of England from 2000 to 2008, told the select committee: \"I will not say that it is likely that we will lose it: I will say that it is certain that we will lose it.\"","url":"https://www.businessinsider.com/eu-considers-rule-change-force-euro-clearing-away-from-london-pre-brexit-2016-12"}
