{"authors":[],"date_download":"2018-10-30 21:10:14","date_modify":"2018-10-30 21:10:14","date_publish":"2016-02-07 09:59:32","description":"The European Union (EU) on Saturday called on Israel to halt the demolition of Palestinian housing, some of which was EU-funded, and reiterated its |","filename":"data/vaneerConsumption/EUDemandsIsraelHaltDemolitionofPalestinianHousing.json","image_url":"https://media.breitbart.com/media/2015/11/ap_ap-photo815-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_02_07__1540933814.html","title":"EU Demands Israel Halt Demolition of Palestinian Housing","title_page":"EU Demands Israel Halt Demolition of Palestinian Housing | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The European Union (EU) on Saturday called on Israel to halt the demolition of Palestinian housing, some of which was EU-funded, and reiterated its opposition to expanding Israeli settlements in the West Bank.\n“In the past weeks there have been a number of developments in Area C of the West Bank, which risk undermining the viability of a future Palestinian state and driving the parties yet further apart,” the EU diplomatic service said in a statement.\nIt referred to Israel’s decision on January 25 to declare 154 hectares (380 acres) of land near Jericho in the West Bank as state land, with reported plans to build around 150 new residences for settlers.\nThis was followed by the demolition of several Palestinian residences in the south Hebron hills on Wednesday.\n“This is particularly concerning both because of the extent of the demolitions and also the number of vulnerable individuals affected, including children who need support,” the EU said, adding that “demolitions included EU-funded structures.”\n“We call on the Israeli authorities to reverse the decisions taken and to halt further demolitions,” it said.\nForeign ministers from the 28 EU nations had confirmed “the EU’s firm opposition to Israel’s settlement policy” and criticised the actions including demolitions, confiscation and forced transfers.\nUN Secretary-General Ban Ki-moon said Friday he was “ashamed” at a lack of progress in the Israeli-Palestinian peace process, which has been deadlocked since a US peace mission collapsed in April 2014.","url":"https://www.breitbart.com/middle-east/2016/02/07/eu-demands-israel-halt-demolition-of-palestinian-housing/"}
