{"authors":[],"date_download":"2018-10-22 21:07:47","date_modify":"2018-10-22 21:07:47","date_publish":"2014-06-04 11:35:48","description":"\"We remain equally concerned that the DPRK (Democratic People's Republic of Korea) is increasing its ability to miniaturize nuclear warheads for their missiles,\" the European Union added.","filename":"data/vaneerConsumption/EUDeeplyConcernedOverNorthKoreaNuclearTestReports.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_15/314411/140410-kim-nk-615a_2903347e59d1caf7f6c54920c9994fcd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_e-u-deeply-concerned-over-north-korea-nuclear-test-reports-n122121_1540242467.html","title":"E.U. 'Deeply Concerned' Over North Korea Nuclear Test Reports","title_page":"E.U. 'Deeply Concerned' Over North Korea Nuclear Test Reports","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nVIENNA - The European Union said on Wednesday it was concerned that North Korea - which has threatened to carry out a new nuclear test - was enhancing its ability to miniaturize nuclear warheads for the country's missiles.\nIn a statement at a meeting of the 35-nation governing board of the U.N. International Atomic Energy Agency (IAEA), the 28-nation EU said it was \"deeply concerned\" about reports that North Korea may be preparing a fourth nuclear test since 2006.\n\"We remain equally concerned that the DPRK (Democratic People's Republic of Korea) is increasing its ability to miniaturize nuclear warheads for their missiles,\" the statement read. It did not give details.\nNorth Korea has long boasted of making strides in acquiring a \"nuclear deterrent\", but there had been general scepticism that it could master the step of miniaturizing a nuclear warhead to mount on a ballistic missile.\nBut there has been a shift in thinking since North Korea conducted a nuclear test in February last year and amid on-off indications it is preparing another, and some experts now say it may be closer than previously thought to putting a nuclear warhead on a missile.\nThe isolated and poverty-stricken state, which regularly threatens to destroy the United States and South Korea, defends its nuclear program as a \"treasured sword\" to counter what it sees as U.S.-led hostility.\nNo one outside the inner circle of North Korea's nuclear program fully knows what advances the country has made.\n- Reuters","url":"https://www.nbcnews.com/news/world/e-u-deeply-concerned-over-north-korea-nuclear-test-reports-n122121"}
