{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 20:57:20","date_modify":"2018-10-30 20:57:20","date_publish":"2017-01-24 14:29:09","description":"EU foreign policy czar Federica Mogherini said EU countries will keep embassies in Tel Aviv if US Pres. Donald Trump moves the US Embassy to Jerusalem.","filename":"data/vaneerConsumption/EUForeignPolicyChiefEuropeanEmbassiesWillStayInTelAviv.json","image_url":"https://media.breitbart.com/media/2017/01/Federica-Mogherini.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_24__1540933040.html","title":"EU Foreign Policy Chief: European Embassies Will Stay In Tel Aviv","title_page":"EU Foreign Policy Chief: European Embassies Will Stay In Tel Aviv","title_rss":"NULL","source_domain":"breitbart.com","text":"European Union foreign policy czar Federica Mogherini (pictured) said on Monday that European and European Union embassies will remain in Tel Aviv even if US President Donald Trump goes ahead with his plan to move the US embassy to Jerusalem.\nMogherini made the comments in a meeting with Israel’s Minister for Regional Cooperation Tzachi Hanegbi during a meeting of Mediterranean countries held in Barcelona.\nThe meeting was attended by foreign ministers and representatives from many European nations as well as countries along the eastern and southern shores of the Mediterranean Sea, including Israel, Jordan, Egypt, Tunisia, Algeria and Morocco.\nAccording to Israeli news website Ynet, Mogherini expressed concern to Hanegbi over the possible ramifications of moving the US embassy.\nShe said that even if the move goes ahead, European countries will keep their embassies in Tel Aviv until the Israelis and Palestinians sign a final accord.\nTrump made a campaign promise to move the embassy and Congress already voted to do so in the 1995 Jerusalem Embassy Act, but implementation has been postponed at six-month intervals at the request of every US president since then.\nThe Israeli government’s hopes that the move may finally take place under Trump’s leadership were bolstered when the president appointed David Friedman as ambassador to Israel, a lawyer who is seen as having political views in line with the current Israeli leadership.\nIn the statement announcing his appointment Friedman was quoted as saying he was looking forward to serving as the American ambassador to Israel “from its eternal capital Jerusalem,” but the White House on Sunday said that it is only in the beginning stages of discussing the possibility of moving the embassy.\nHangebi on Monday told Mogherini the issue of the US embassy moving to the capital city of a friendly country was an internal US affair that the US Congress already dealt with in legislation dating many years back, according to Ynet.\nHe added that Israel took care not to interfere with the decision and that it would be appropriate for Europe to avoid trying to influence decisions on the matter despite pressure from the Palestinian Authority.\nHanegbi also thanked Mogherini for her efforts to prevent decisions hostile to Israel.\nThe Palestinian Authority initially treated Trump’s declarations dismissively, but as it became clear that the plan might materialize, they began a war of words against the move, with some officials hinting that if the embassy were relocated there would be a violent uprising.\nOn Sunday, PA President Mahmoud Abbas met with Jordanian king Abdullah and the two agreed on a series of steps if the embassy is moved. Abbas expressed hope during the meeting that the US would abandon the plan.","url":"https://www.breitbart.com/middle-east/2017/01/24/eu-foreign-policy-chief-embassies-will-stay-tel-aviv-even-us-moves-embassy-jerusalem/"}
