{"authors":["Associated Press"],"date_download":"2018-10-23 01:24:32","date_modify":"2018-10-23 01:24:32","date_publish":"2016-01-11 12:29:23","description":"PRAGUE (AP) — The European Union foreign policy chief says she expects the economic sanctions against Iran to be lifted soon. Iran and world powers led by th...","filename":"data/vaneerConsumption/EUforeignpolicychiefsaysIransanctionstoendsoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:3de2191466ad43f8aed27534c46c83f3-56CX32zFKLb7123928b84ce9b8dc-900_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393764_EU-foreign-policy-chief-says-Iran-sanctions-end-soon_1540257872.html","title":"EU foreign policy chief says Iran sanctions to end soon","title_page":"EU foreign policy chief says Iran sanctions to end soon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"EU foreign policy chief says Iran sanctions to end soon\nPRAGUE (AP) — The European Union foreign policy chief says she expects the economic sanctions against Iran to be lifted soon.\nIran and world powers led by the U.S. agreed to a landmark nuclear deal to limit Tehran's enrichment of uranium in exchange for lifting economic sanctions. Iran has always denied seeking nuclear arms.\nSpeaking to reporters in Prague Monday, Federica Mogherini says there was no date set yet but that \"the implementation of the agreement is proceeding well.\"\nCzech Foreign Minister Lubomir Zaoralek, left, welcomes European Union foreign policy chief Federica Mogherini, right, ahead of her visit to Prague, Czech Republic, Monday, Jan. 11, 2016. (Michal Dolezal/CTK via AP)\nMogherini says it is necessary that all steps agreed have to be \"properly done,\" including the work of the International Atomic Energy Agency. But after consulting recently the foreign ministers of Iran and the United States she believes \"things are going well\" and the sanctions might be lifted \"rather soon.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393764/EU-foreign-policy-chief-says-Iran-sanctions-end-soon.html"}
