{"authors":["Associated Press"],"date_download":"2018-10-23 01:21:00","date_modify":"2018-10-23 01:21:00","date_publish":"2017-04-26 11:45:33","description":"BRUSSELS (AP) - The European Union is launching talks with unions and employers to ensure that people's work and living conditions are protected as they turn...","filename":"data/vaneerConsumption/EUlaunchestalkstodefendworklivingconditions.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464641-1493203834-569_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447222_EU-launches-talks-defend-work-living-conditions_1540257660.html","title":"EU launches talks to defend work, living conditions","title_page":"EU launches talks to defend work, living conditions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BRUSSELS (AP) - The European Union is launching talks with unions and employers to ensure that people's work and living conditions are protected as they turn to alternative jobs like self-driving taxis or fast food deliveries.\nThe EU Commission said Wednesday that debate is needed across the 28 nations as job market changes increase the risk that people might be deprived of unemployment benefits or health insurance.\nIt would also take account of the many families with two working parents or home help needs as well as minimum standards for maternity and paternity leave.\nEuropean Commission Vice-President Frans Timmermans, center, arrives for a meeting of the college of commissioners at EU headquarters in Brussels on Wednesday, April 26, 2017. Among the speaking points on the agenda were relations with Hungary. (AP Photo/Virginia Mayo)\nCommission Vice-President Frans Timmermans said: \"Living in the 21st Century means we need a 21st Century attitude toward life and work.\"\nThe Commission aims to establish common principles and rights on equal opportunities, job access and fair working conditions.","url":"https://www.dailymail.co.uk/wires/ap/article-4447222/EU-launches-talks-defend-work-living-conditions.html"}
