{"authors":["Associated Press"],"date_download":"2018-10-23 02:09:06","date_modify":"2018-10-23 02:09:06","date_publish":"2016-01-28 16:54:21","description":"LONDON (AP) — Google is gearing up for a new round in its European tax fight after the EU said it could investigate its 130 million-pound ($186 million) deal...","filename":"data/vaneerConsumption/EUmullsprobeofUKGoogletaxdealasItalyinvestigates.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:dc8180e00c8d423fa635664b688b5974-2vdWmEltwXfba0ce28e632acd35a-490_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420838_EU-considering-probe-Google-tax-deal-UK_1540260546.html","title":"EU mulls probe of UK Google tax deal as Italy investigates","title_page":"EU mulls probe of UK Google tax deal as Italy investigates | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"EU mulls probe of UK Google tax deal as Italy investigates\nLONDON (AP) — Google is gearing up for a new round in its European tax fight after the EU said it could investigate its 130 million-pound ($186 million) deal for back taxes in Britain and Italy alleged Google owed it some 300 million euros.\nBritain's Scottish National Party had asked Wednesday for an investigation of the tax deal the U.K. government struck with Google, with deputy party leader Stewart Hosie arguing there was a lack of transparency.\n\"It is my view that an independent verification of this settlement would establish confidence that the settlement is within the boundaries of state aid regulations and is a fair deal for the taxpayers of the United Kingdom,\" he wrote.\nA man enters an office building with small Google UK Limited sign in London, Thursday, Jan. 28, 2016. The European Union¿s competition commissioner says she would consider investigating the 130 million pound ($186 million) deal for back taxes struck between Britain and Google amid fury among opposition lawmakers who suggest the Internet giant should have paid more.(AP Photo/Frank Augstein)\nRicardo Cardoso, spokesman for EU competition commissioner Margrethe Vestager, said that \"we will look into it and then decide where to move from there.\"\nWriting in the Financial Times, Google's vice president of communications, Peter Barron, insisted the company paid tax at the standard corporate rate of 20 percent.\n\"Governments make tax law, the tax authorities independently enforce the law, and Google complies with the law,\" he wrote.\nThe anger of lawmakers has been stoked by reports that France and Italy were in talks to squeeze more out of the company.\nIn Italy, the financial police confirmed reports Thursday that Google was under investigation for allegedly avoiding up to around 300 million euros ($326 million) in taxes. Italian daily La Repubblica reported that the investigation stems from Google activities in Italy from 2008-2013, when Google allegedly declared its fiscal headquarters in Ireland.\nGoogle repeated Barron's line and said it is working with the relevant authorities.\nItaly has brought several cases against global technology companies that have headquarters in low-tax nations like Ireland to avoid paying higher taxes in other countries, like Italy. In December, Apple agreed to pay Italy 318 million euros in back taxes covering the same time period now contested against Google.\nAt the time of Apple's settlement, Google said it was working with Italian tax authorities.\nGoogle Inc. is based in Mountain View, California.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420838/EU-considering-probe-Google-tax-deal-UK.html"}
