{"authors":["Lianna Brinded"],"date_download":"2018-10-30 22:10:58","date_modify":"2018-10-30 22:10:58","date_publish":"2016-12-15 00:00:00","description":"Guy Verhofstadt says that the UK has to avoid 'an eternal, a definitive, agreement.'","filename":"data/vaneerConsumption/EUparliamentschiefBrexitnegotiatorGuyVerhofstadtontransitionaldealtalks.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_eu-parliaments-chief-brexit-negotiator-guy-verhofstadt-on-transitional-deal-talks-2016-12_1540937458.html","title":"EU parliament's chief Brexit negotiator Guy Verhofstadt on transitional deal talks","title_page":"    EU parliament's chief Brexit negotiator Guy Verhofstadt on transitional deal talks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Guy Verhofstadt. Reuters Guy Verhofstadt, the man appointed by the European Parliament to negotiate Brexit talks, warned Britain against taking advantage of a potential deal that would help the country transition out of the European Union.\nVerhofstadt told presenters on BBC Radio 4's \"The World at One\" programme that while a transitional deal was \"certainly possible,\" the UK has to avoid using it as a tool to stay within the Single Market, even if the overall Brexit deal means that Britain will have to leave it.\n\"I have seen many times in politics that a so-called transitional agreement becomes an eternal, a definitive, agreement - that has to be avoided,\" he said.\nThe Bank of England governor Mark Carney floated the idea for a transitional period to phase in any Brexit deal agreed. This is because a transitional deal could maintain the UK's single market status until at least 2021, if Article 50 is triggered next year as planned.\nA transition deal is important to the City because it would help financial services firms continue to do business in light of a lack of a trade deal and the loss of passporting rights— all of which are entirely plausible risks in the event of a \"hard Brexit.\"\nThe loss of passporting rights following Brexit is one of the biggest fear's in the City of London. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues. Around 5,500 firms registered in the UK rely on the EU's passporting rights for the financial services sector, and they turn over about £9 billion in revenue.\nAt the moment, Prime Minister Theresa May has to trigger Article 50 in order to official start Brexit negotiations.\nMay said she will not give a \"running commentary\" on how negotiations are going, but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.\nSo a transitional deal will at least take some of the sting out of a \"hard Brexit\" if it was to happen.","url":"https://www.businessinsider.com/eu-parliaments-chief-brexit-negotiator-guy-verhofstadt-on-transitional-deal-talks-2016-12"}
