{"authors":[],"date_download":"2018-10-30 01:07:47","date_modify":"2018-10-30 01:07:47","date_publish":"2018-09-12 20:35:58","description":null,"filename":"data/vaneerConsumption/EUParliamentVotestoCensureOrbansHungary.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/EU-Flag.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861667.html","title":"EU Parliament Votes to Censure Orban's Hungary","title_page":"EU Parliament Votes to Censure Orban's HungaryThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Earlier today, members of the European Parliament voted to censure the government of Hungary under EU Rule Article Seven. This is the first time the European Parliament has triggered Article Seven, though the European Commission did it to Poland in late 2017. Over two-thirds of the members of the European Parliament voted for this measure, which accuses Hungary of going against Europe’s “common values.” The motion accuses Hungary of attacking minorities, media, and the rule of law. The motion, if approved by national leaders would start punishing Hungary for their alleged wrongdoings. The worst possible outcome for Hungary would be the complete revocation of voting rights in the European Union, though Poland would likely veto that motion.\nVictor Orban, Prime Minister of Hungary, has often been the victim of attacks from the left and center due to his hardline stance on immigration. During the migrant crisis in Europe, Hungary felt threatened by the massive number of immigrants coming through its land to reach other parts of Europe, so it began initiating strong measures to keep migrants out of Hungary, including border security and internal crackdowns. By defying demands from Germany and other European nations to take in massive numbers of migrants, Hungary was somehow going against European values. The idea that Hungary is some sort of racist state has also been refuted heavily in a piece for The American Spectator by Lee Cohen, found here.\nOrban has also been critical of the “fake news” media that paints his government in an extremely critical light, and state-run media outlets in Hungary largely align with his worldview, though no one complains when the BBC runs extremely liberal content or when Sweden pushed to ban factual media it found offensive. For some reason, Hungary’s relatively mild (by European standards) media control was far too much for the EU.\nOrban also has stated that he wants to turn Hungary into a Christian Democracy, rather than a liberal one. These crimes were far too much for the hand-wringers in Brussels, who see his government as a threat to the current liberal hegemony within the European Union structure.\nThe idea that Orban is somehow an authoritarian and going against “European Values” because of his differing views is dubious at best. According to a poll from February, Orban’s Fidesz party was at a seven-year high in popularity, at 46%, while support for socialist parties fell. This was confirmed in the April election where Orban’s party, along with its Christian Democrat coalition allies, swept to victory, gaining over two-thirds of the seats in Parliament. This wasn’t a result of Russian hackers, fake news, or authoritarianism. It was democracy in action, as Hungarians currently feel they are best represented by the ideals that Orban champions.\nThere are elements within Hungary, including the Soros-funded Central European University, that are opposed to the direction the country is taking and are actively working to undermine the Orban’s mandate. In response, Orban has worked to limit the influence of these organizations by imposing a 25% tax on pro-immigration NGO’s. He has also cut government funding for Gender Studies programs, citing that it is not a subject that brings any value to society.\nAll of these actions have led the European Union establishment to take steps against the supposedly Anti-European Hungarians. But the winds are changing, and it is possible that the Hungarian model will represent Europe’s future.\nAs seen in recent elections of conservative and populist governments in Italy and Austria, and the growing support for nationalist parties in Sweden and Germany, large segments of the European populace are rejecting mass immigration, liberalism, and the European Union as it now exists. While the censure of Hungary by the European Parliament is a major move, it’s also a sign of how out of touch the European establishment is with the emergence of new set of European “common values”","url":"https://spectator.org/eu-parliament-votes-to-censure-orbans-hungary/"}
