{"authors":["Emily Davies","City Reporter For The Daily Mail"],"date_download":"2018-10-22 20:53:42","date_modify":"2018-10-22 20:53:42","date_publish":"2016-01-29 04:48:17","description":"The new probes announced in Brussels by Economic Affairs Commissioner Pierre Moscovici come on top of existing EU investigations into the tax deals of international giants.","filename":"data/vaneerConsumption/EUpledgestostampouttaxdealsdaysafterGooglesdealcausedoutrage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEE82E00000578-0-image-a-57_1454042571676.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422183_EU-pledges-stamp-sweetheart-tax-deals-Economic-commissioner-says-days-numbered-announces-series-measures-combat-tax-avoidance_1540241622.html","title":"EU pledges to stamp out tax deals days after Google's deal caused outrage","title_page":"EU pledges to stamp out tax deals days after Google's deal caused outrage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Declaration: Economic Affairs Commissioner Pierre Moscovici yesterday announced a series of measures in Brussels to combat tax avoidance\nThe European Union has declared it will stamp out so-called ‘sweetheart’ tax deals just days after Google’s deal with HM Revenue and Customs caused public outrage.\nEconomic Affairs Commissioner Pierre Moscovici yesterday announced a series of measures in Brussels to combat tax avoidance.\nThe new probes come on top of existing EU investigations into the tax deals of international giants such as Apple, Starbucks and McDonald’s.\nMr Moscovici said: ‘The days are numbered for companies that aggressively reduce their tax bills. We are today bringing a clear and concrete response to tax evasion.’\nLast week Google announced it had agreed to pay Britain £130million in back taxes to cover a 10-year period, despite making taking revenues of £4.6billion in the UK for 2014 alone.\nChancellor George Osborne announced the deal as a ‘victory’ but the Government later was forced to backpedal after it emerged other countries were taking a much tougher stance.\nItaly is demanding Google pay up £152million in back taxes, while France is believed to be chasing £381million.\nThe measures from the European Commission call for big companies to be obliged to report profit country by country - a break with the current practice, whereby multinationals shift revenue across borders to lower their tax bill.\nGoogle deal: Chancellor George Osborne (pictured yesterday in Bristol) announced a ‘victory’ for the UK but the Government later had to backpedal after it emerged other countries were taking a much tougher stance\nGoogle, like most multinationals, does not reveal revenues for individual countries.\nAnother requirement will compel nations to agree on minimum standards for drawing up tax rules so that multinationals stop the practice of shopping around for loopholes to avoid paying tax altogether.\nThe measures did not go as far as to require tax authorities to disclose the tax affairs of big corporations.\nIt appeared yesterday that Google could face its own tax probe after European Competition Commissioner Margrethe Vestager said the EU had the internet giant in its sights.\nTaxman: The European Union has declared it will stamp out so-called ‘sweetheart’ tax deals just days after Google’s deal with HM Revenue and Customs caused public outrage (file picture)\nMrs Vestager told BBC Radio 4’s Today programme: ‘If we find there is something to be concerned about, if someone writes to us and says this is maybe not as it should be, then we will take a look.’\nThe days are numbered for companies that aggressively reduce their tax bills Pierre Moscovici, European Commissioner for Economic Affairs\nWithin hours, Scottish National Party MP Stewart Hosie said the party had sent a letter to Brussels calling for a probe.\nThe two EU proposals are part of a 15-point package agreed by world leaders at a G20 summit in Antalya, Turkey, in November.","url":"https://www.dailymail.co.uk/news/article-3422183/EU-pledges-stamp-sweetheart-tax-deals-Economic-commissioner-says-days-numbered-announces-series-measures-combat-tax-avoidance.html"}
