{"authors":["Will Martin"],"date_download":"2018-10-30 22:59:26","date_modify":"2018-10-30 22:59:26","date_publish":"2018-07-25 00:00:00","description":"\"We hope that it doesn't come to that and that we can find a solution,\" the European Union's trade commissioner, Cecilia Malmstrom, told a Swedish newspaper. \"If not, the EU Commission is preparing a rather long list of many of American goods. It would be around $20 billion.\"","filename":"data/vaneerConsumption/EUpreparesmajortariffretaliationagainstDonaldTrumpUSgoods.json","image_url":"https://amp.businessinsider.com/images/5b58724f66cb042e008b4772-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trade-war-eu-prepares-major-tariff-retaliation-against-trump-2018-7_1540940366.html","title":"EU prepares major tariff retaliation against Donald Trump, US goods","title_page":"    EU prepares major tariff retaliation against Donald Trump, US goods - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Isaac Brekken/Getty Images; Samantha Lee/Business Insider\nThe European Union is readying retaliatory tariffs on about $20 billion worth of US goods should talks between the two parties this week fail.\nSpeaking with the Swedish newspaper Dagens Nyheter, the EU's trade commissioner, Cecilia Malmstrom, said the EU wanted to reach a settlement with the US but warned it would not shy away from hitting back at the punitive tariffs placed on certain exports by the Trump administration.\nThe retaliation would affect about $20 billion worth of goods, Malmstrom said, adding that the tariffs would not be levied against consumer goods.\n\"We hope that it doesn't come to that and that we can find a solution,\" she told Dagens Nyheter. \"If not, the EU Commission is preparing a rather long list of many of American goods. It would be around $20 billion.\"\nAsked whether the EU would target specific US states, she said, \"No, now it's more general goods such as agricultural products, machinery, high-tech products and other things.\"\nJenny Cheng/Business Insider\nThe European Commission's president, Jean-Claude Juncker, is traveling to Washington, DC, for talks with the Trump administration this week aimed at diffusing the tensions between the two parties over President Donald Trump's trade war.\nAhead of the meetings, Trump tweeted to say negotiations were \"going really well\" and people needed to \"be cool.\"\n\"When you have people snipping at your heels during a negotiation, it will only take longer to make a deal, and the deal will never be as good as it could have been with unity,\" he tweeted Wednesday morning. \"Negotiations are going really well, be cool. The end result will be worth it!\" It was unclear whether he was referring specifically to the negotiations with the EU or more generally about the US's multifront trade conflict, which also involves China and other countries.\nJuncker's main aim, it is believed, is to persuade Trump not to levy punitive tariffs on European automobiles. The US Commerce Department is investigating auto imports, and Trump has previously threatened large tariffs on imported cars. Last week, for instance, Trump said he was ready to impose a \"tremendous retribution\" against the EU.\nTrump has been pushing his trade agenda more aggressively than ever before. After threatening last Friday to place tariffs on all $505 billion worth of goods imported by the US from China, he tweeted on Tuesday in praise of tariffs.\n\"Tariffs are the greatest!\" he said. \"Either a country which has treated the United States unfairly on Trade negotiates a fair deal, or it gets hit with Tariffs. It's as simple as that — and everybody's talking! Remember, we are the 'piggy bank' that's being robbed. All will be Great!\"\nSeveral hours later, however, he appeared to strike a slightly more conciliatory tone when tweeting about Juncker's coming visit.\n\"The European Union is coming to Washington tomorrow to negotiate a deal on Trade,\" he said. \"I have an idea for them. Both the U.S. and the E.U. drop all Tariffs, Barriers and Subsidies! That would finally be called Free Market and Fair Trade! Hope they do it, we are ready - but they won't!\"\nMalmstrom, however, said she did not believe Trump and Treasury Secretary Steven Mnuchin's offer to completely remove trade barriers were serious, according to Reuters. Such an offer, she said, would be hindered by some US laws protecting American industries.\nShe then pointed to what happened during negotiations of the Transatlantic Trade and Investment Partnership in recent years.\n\"We tried earlier in TTIP negotiations to make the United States loosen those laws,\" she said. \"It was completely impossible. They did not move a millimeter.\"\n\"Basically, I'm an optimistic person, but heading into this I'm moderately optimistic,\" Malmstrom, who is a member of the EU delegation heading to Washington, concluded. \"But one must always try.\"\nSee also:","url":"https://www.businessinsider.com/trade-war-eu-prepares-major-tariff-retaliation-against-trump-2018-7"}
