{"authors":[],"date_download":"2018-10-30 22:01:56","date_modify":"2018-10-30 22:01:56","date_publish":"2015-12-08 10:13:18","description":"Donald Tusk has warned David Cameron that a central demand to curb immigration may be asking too much.","filename":"data/vaneerConsumption/EUPresidentTuskCallsCameronsBluffMigrationReformUnlikely.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-08-at-10.11.38.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_08__1540936916.html","title":"EU President Tusk Calls Cameron's Bluff, Migration Reform Unlikely","title_page":"EU President Tusk Calls Cameron's Bluff, Migration Reform Unlikely ","title_rss":"NULL","source_domain":"breitbart.com","text":"BRUSSELS (Reuters) – The man running negotiations with Britain to keep it in the European Union said leaders could seal a deal in February but warned David Cameron that a central demand to curb immigration may be asking too much.\nDonald Tusk, who next week chairs the first detailed talks on the issue between the British prime minister and all his 27 peers, sent EU leaders a progress report a month after Cameron laid out four sets of reforms he wants if he is to campaign for continued EU membership in a referendum due within two years.\n“We have made good progress,” the European Council president said in a letter that contained few surprises. ” We … have to overcome the substantial political differences that we still have on the issue of social benefits and free movement.”\nAfter next week’s summit, he added: “We should be able to prepare a concrete proposal to be finally adopted in February.”\nMany governments are willing to make changes to keep Britain in the Union. Tusk said the main stumbling block was Cameron’s pledge to cut immigration to Britain by denying benefits to workers from other EU states for four years after they arrive.\nAnti-EU campaigners said Tusk’s letter showed Cameron would secure little of consequence from Brussels. But the prime minister’s office said he would stick with a proposal that many leaders, especially in the EU’s poorer east, say would mean illegal discrimination and denying a fundamental freedom to EU citizens.\n“There is a strong will on the part of all sides to find solutions,” wrote Tusk, while describing as “difficult” the demands Cameron set out in a letter on Nov. 10.\nIn particular, Tusk said changes to social benefit rules are “the most delicate” of Cameron’s four reform “baskets”. The former Polish premier noted support for fighting welfare abuses and a possibility of reducing what Britain pays in child benefit to workers whose children live in poorer countries.\nBut one welfare request was very tricky: “There is presently no consensus on the request that people coming to Britain from the EU must live there and contribute for four years before they qualify for in-work benefits or social housing,” Tusk said.\nCameron’s spokeswoman said the demand would stay on the table for the Brussels summit on Dec. 17-18. “This issue that we are trying to address here is how better to control migration from within the EU,” she said. “We will continue to have discussions and explore the options.”\nJust how flexible Cameron may be is unclear. Tusk suggested some welfare reforms were possible. Cameron’s spokeswoman said: “We need reform in all four areas that we have outlined.”\nBritish finance minister George Osborne, speaking in New York late on Monday, said further negotiations would be “complex and robust”, but that the most recent developments showed more progress than many people had expected.\nSCEPTICS\nThe UK Independence Party, which says Britain will be better off outside a bloc struggling with mass immigration and economic blight, said: “President Tusk has called Cameron’s bluff.”\nDeputy leader Paul Nuttall, arguing the letter showed there would be no big move on benefits for EU migrants, said: “Cameron must now follow through on his threat to campaign to leave.”\nThe prime minister has said he would rather stay in the EU but rules nothing out — a line repeated by his office after a weekend newspaper report that he might campaign to quit if his demands were “completely ignored” by EU leaders.\nThe Vote Leave campaign renewed accusations that Cameron has staged the renegotiation in bad faith, going through the motions to outflank UKIP and the Eurosceptic wing of his own party while avoiding a rift that pro-EU campaigners say could hurt British access to markets and weaken its voice in Europe and the world.\n“In an effort to secure a deal at any cost, David Cameron is only asking for trivial things,” Vote Leave chief executive Matthew Elliott said. “That’s why he is now having a manufactured row with the EU to try and make his renegotiation sound more significant than it really is.”\nAn EU deal in February could allow a referendum in early summer, just over a year after Cameron won a new five-year term. He has insisted he will not rush into a deal but some business leaders have called for a swift vote to end the uncertainty.\nTusk in his letter to EU leaders urged them to seek a quick solution, warning that uncertainty over whether Britain would end its 42-year membership was “destabilising” the bloc.\nLosing the EU’s second biggest economy and one of its two main military powers would diminish the EU when it faces threats from Russia and Islamist militants and problems with mass immigration and a struggling economy.\n“We need to be united and strong,” Tusk wrote. “The UK has played a constructive and important role in the development of the European Union and I am sure that it will continue to do so.”\nHe outlined compromises on three other areas of British concern. A “set of principles” to avoid discrimination against countries not using the EU’s euro currency might be found and possibly a “mechanism” to support those principles without giving non-euro states “a veto right” over euro matters.\nHe said there was a very strong determination in the EU to promote the competitiveness, light regulation of business and free trade agreements that Cameron has called for.\nAnd on British concerns about national sovereignty, Tusk said there was a “largely shared view” on ensuring national parliaments had an important role in the EU. There was also “wide agreement”, he said, that the concept of “ever closer union among the people”, enshrined in treaty and unpopular in Britain, still allowed states to integrate on “various paths”.","url":"https://www.breitbart.com/europe/2015/12/08/eu-president-tusk-calls-camerons-bluff-migration-reform-unlikely/"}
