{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 22:02:05","date_modify":"2018-10-30 22:02:05","date_publish":"2015-03-16 19:24:47","description":"“When I hear that we have to believe in the good will of President Putin,” said Donald Tusk in a recent interview, “I know that I am dealing with someone who is either naïve or hypocritical.” |","filename":"data/vaneerConsumption/EUPresidentDonaldTuskUrgesEuropeansNottoTrustPutin.json","image_url":"https://media.breitbart.com/media/2015/03/donald-tusk-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_16__1540936925.html","title":"EU President Donald Tusk Urges Europeans Not to Trust Putin","title_page":"EU President Donald Tusk Urges Europeans Not to Trust Putin | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“When I hear that we have to believe in the good will of President Putin,” said Donald Tusk in a recent interview, “I know that I am dealing with someone who is either naïve or hypocritical.”\nEuropean Council President Donald Tusk spoke in an interview with the Polish newspaper Gazeta Wyborcza, touching on a number of issues but especially the conflict in Ukraine. In remarkably blunt language, Tusk described Putin as a political thug who only respects a position of strength.\n“Putin’s politics is much simpler than our sophisticated debate,” said Tusk. “He’s a good student of [German political philosopher] Carl Schmitt and follows his logic: first, make enemies, second, be stronger than them, third, enter into a state of conflict with them and destroy them.”\nTusk said that he was “skeptical” of Russian good will, and “convinced that the only thing necessary is to keep up the pressure, without discussing the nitty gritty.”\nTusk, who is Poland’s former Prime Minister, also confirmed that he will not be attending Victory Day ceremonies in Moscow on May 9. “I got the invitation, but I would not go to Moscow on May 9 to celebrate the anniversary of the end of World War II,” he said.\n“My presence at a military parade alongside the current aggressors and the man who uses weapons against civilians in eastern Ukraine, would be, to put it mildly, too ambiguous.”\nThis year marks the 70th anniversary of the allied victory over Nazi Germany in the Second World War. Tusk is not along in turning down the invitation. He joins a growing list of world leaders who have decided not to attend the celebrations, including German Chancellor Angela Merkel, British Prime Minister David Cameron, and US President Barack Obama.\nIn fact, the only European Union head of state confirming his presence at the festivities is Czech President Milos Zeman, who has been accused as having “gone rogue” and of undermining the country’s foreign policy regarding the conflict in Ukraine.\nTusk recommends that Europe hold to its broad economic sanctions against Russia until Ukraine recovers control of its border with Russia. He rejected suggestions from several countries to ease penalties against the Kremlin, saying that there could be no watering down of sanctions on Russia when EU leaders meet in Brussels later this week.\nIn meetings in Washington with President Obama on March 9, Tusk said that Russia is trying to divide EU member countries, and also divide the EU from the USA.\n“Our enemies who use propaganda against us, commit acts of violence and violate the sovereignty of our neighbors,” Tusk said. “And this is why, I think, united we stand, divided we fall. I’m convinced it’s true.”\nIn a statement released prior to his meeting with Obama, Tusk said that Russia is “determined to weaken the foundations of the political community of the Western world.”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/national-security/2015/03/16/eu-president-donald-tusk-urges-europeans-not-to-trust-putin/"}
