{"authors":["A.B. Sanderson"],"date_download":"2018-10-30 20:51:06","date_modify":"2018-10-30 20:51:06","date_publish":"2014-11-21 13:30:02","description":"Greedy Euro MPs are demanding billions in cash from national governments in budget talks. The eight per cent increase wanted by parliamentarians is to |","filename":"data/vaneerConsumption/EuroMPsDemandEvenMoreCashfromBritainSayRefusaltoPayShowsExtremism.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/06/17/euro-web.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_11_21__1540932666.html","title":"Euro MPs Demand Even More Cash from Britain, Say Refusal to Pay Shows 'Extremism'","title_page":"Euro MPs Demand Even More Cash from Britain, Say Refusal to Pay Shows 'Extremism' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Greedy Euro MPs are demanding billions in cash from national governments in budget talks. The eight per cent increase wanted by parliamentarians is to settle unpaid bills and works out at £5.4bn. £680million of this would come from British tax payers.\nThe demands have led to a collapse in discussions between Treasury ministers, the European Commission and the European Parliament.\nIn October MEPs reversed all the cuts made by national governments in the European Council, and they have said that refusing to hand over the cash to Brussels is pandering to “extremism”, referring to the tide of euroscepticism which has swept Europe and the UK in particular.\nA Portuguese MEP from the federalist European People’s Party, where the British Conservatives used to sit, described the refusal to pay more money to Brussels as “utterly unacceptable and incomprehensible”.\nJose Manuel Fernandes told The Telegraph: “The council [of national government ministers] has once again stimulated extremists, populists and Eurosceptics across Europe.”\nJean Arthuis, a French MEP and lead negotiator for the parliament, said the extra cash for this year was needed for unpaid bills run by EU projects.\n“We must have a concrete response to the unbearable problem of unpaid invoices accumulating on the desks of the commission,” he said.\n“This puts into danger the credibility of the EU authority and feeds the arguments of europhobes.”\nBut for others, the audacity of the demand for billions more, only weeks after the row over the surcharge Britain was burdened with after its economy performed better than expected, is what they find unacceptable.\nUkip MEP Jonathan Arnott, the party’s spokesman on the EU budget, said: “It is clear that the EU is beyond reform.\n“The only way for Britain to avoid being at the sharp end of more EU bills is to withdraw altogether.”\nJonathan Isaby of the Tax-Payers’ Alliance, told the Express: “The European Union has gone over-budget, and now wants British taxpayers to help pay the bills. It’s totally unacceptable and the Prime Minister must stand up to these demands. We must get a better deal from Brussels.”\nWith relentless demands from the EU for extra cash it is no surprise that UKIP is doing so well, securing another victory in yesterday’s Rochester and Strood by election.\nThe figure was released by the Treasury in response to a Parliamentary question tabled by Independent Labour peer Lord Stoddart. He said: “As ever with EU costs, the figures are colossal,” he said as fresh figures show that Britain will have paid more than £50bn into Brussels coffers by the end of this Parliamentary term.\nThe government will have its head in its hands at this latest news which makes its case for renegotiation even harder.\nDespite strong words and even legal action over the law capping the amount bankers can receive in bonuses, the Chancellor has backed down and given up his fight.","url":"https://www.breitbart.com/europe/2014/11/21/brussels-demands-more-cash-from-brits/"}
