{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:04:47","date_modify":"2018-10-30 21:04:47","date_publish":"2016-12-22 00:00:00","description":"Trade deals must be approved by all 38 national and regional parliaments, around 5 regional and linguistic Belgian parliaments, and at least 5 upper chambers.","filename":"data/vaneerConsumption/EuropeanCourtofJusticecourtcaseimpactonUKdoingpostBrexittradedeals.json","image_url":"https://amp.businessinsider.com/images/585ba70cdd0895387f8b4873-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-court-of-justice-impact-post-brexit-article-50-trade-deal-2016-12_1540933487.html","title":"European Court of Justice court case impact on UK doing post-Brexit trade deals","title_page":"    European Court of Justice court case impact on UK doing post-Brexit trade deals - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain has many, many hurdles to get over before it can reach a trade deal with the EU after Brexit. REUTERS/Lucy Nicholson A new European Court of Justice ruling has made it more difficult for Britain to seal a major trade deal with the European Union post-Brexit.\nThe European Court of Justice's Advocate General Eleanor Sharpston published a legal opinion saying that all 38 national and regional parliaments, around five regional and linguistic parliaments in Belgium, and at least five upper chambers in Europe have to approve an EU trade deal with Singapore that is currently in the works.\nThe same will have to be done for any post-Brexit EU trade deal Britain tries to strike.\nIt \"will make the process hugely longer, because they will have to keep an eye not only on what the EU wants but also what all the national capitals and even the regional parliaments want,\" Catherine Barnard, a professor of European Union law at the University of Cambridge, told The Telegraph.\nEarlier this year, the EU-Canada free trade deal (CETA) nearly collapsed after seven years of talks. It was vetoed by the Belgian region of Wallonia, which eventually agreed to support the deal but only after all other parties agreed to a series of significant revisions.\nEarlier this month, the British ambassador to the EU warned May's government that it could take over a decade to finalise a post-Brexit trade deal with the EU. He also warned the government that a proposed UK-EU trade deal could be rejected by the national parliaments of the other 27 states at the eleventh hour, as all EU members must approve a trade deal before it is finally signed off by Brussels.\nThe new opinion issued from the ECJ authority highlights just how wide a range of EU authorities will be able to veto any post-Brexit trade deal. It could delay plans for a long time.\n\"It's grossly inconvenient for the UK, which is faced with exactly the same as what happened with the Canadian agreement and the Walloons,\" Barnard told the Telegraph.\n\"The Walloons were eventually leant on to change their minds, but that may not be so easy with the UK deal as it will be more contentious because it is likely to be more far-reaching, covering issues like financial services.\"\nThe ECJ makes sure that EU law is applied in the same way to all EU countries and is there to settle legal disputes between EU institutions and national governments.","url":"https://www.businessinsider.com/european-court-of-justice-impact-post-brexit-article-50-trade-deal-2016-12"}
