{"authors":["Associated Press"],"date_download":"2018-10-23 00:53:29","date_modify":"2018-10-23 00:53:29","date_publish":"2017-03-10 08:04:12","description":"THE HAGUE, Netherlands (AP) - That Duindorp has few immigrants is part of its charm for Willem van Vliet, whose \"Willem and Toet\" fish bar serves crispy...","filename":"data/vaneerConsumption/EuropeonEdgeImmigrationfearsboostDutchfarright.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196109-1489151358-787_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300328_Fears-immigration-drive-Dutch-populist-vote_1540256009.html","title":"Europe on Edge: Immigration fears boost Dutch far right","title_page":"Europe on Edge: Immigration fears boost Dutch far right | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"THE HAGUE, Netherlands (AP) - That Duindorp has few immigrants is part of its charm for Willem van Vliet, whose \"Willem and Toet\" fish bar serves crispy shrimp croquettes and other Dutch snacks.\nWhen the cook leaves the tidy, quiet neighborhood next to The Hague's port and travels the few miles (kilometers) to more culturally diverse areas of the city, he sees a Netherlands not enriched by immigration, but ravaged by it.\n\"Too many people have come to Holland with no education, no work experience, and they are coming here only for money from the government,\" he said. \"Enough is enough.\"\nIn this Saturday, March 4, 2017 photo, people walk past socks and stockings that are displayed for sale at a market stall in The Hague, The Netherlands. (AP Photo/Emilio Morenatti)\nSuch views make Duindorp one of the epicenters of the populist wave sweeping Europe, gate-crashing its politics and clouding its future. Dutch elections on Wednesday, followed by polls later this year in France and Germany, will be a barometer of whether the storm is gaining strength.\nThe specter of uncontrolled floods of migrants from countries that don't share Europe's Christian heritage is a principal selling point of the far-right firebrand politics of the Netherlands' Geert Wilders and Marine Le Pen in France. By harping on anti-Islam, anti-immigrant themes, they are accused of making xenophobic views mainstream again.\nFor their supporters, they simply tell it like it is.\nOf the Netherlands' 17 million people, just over one in five now have a foreign background and about 850,000 are Muslim. Paradoxically, hostility against migrants is sometimes sharpest in places that have not absorbed large numbers of them.\nDuindorp has no mosques and few Muslims. Its several thousand people are overwhelmingly white, most born locally.\nYet Duindorp is Wilders territory. When his Party for Freedom got hammered in the last parliamentary election in 2012, Duindorp bucked the trend. At Duindorp's community center that serves as a polling station, where retirees come for billiards and company, 352 people voted for Wilders, more than for the two largest parties combined.\nLeo Pronk, a Duindorp community leader, said Wilders hooks voters who \"don't know any better\" with his program to \"de-Islamize the Netherlands,\" ban the Quran and immigration from Muslim countries and shut the country's estimated 475 mosques.\n\"Wilders is saying what the low-educated people want to hear ... 'Immigrants are taking our jobs, they are raping our women,'\" said Pronk, who doesn't vote for him.\nIslam, relatively new in the Netherlands, has spread as increasing numbers of native Dutch are abandoning religion. The Netherlands' oldest mosque, in The Hague, was built in 1955.\nIts imam, Naeem Ahmad, dismisses Wilders' program as \"not possible.\"\nHe says the Muslim community is thriving. The Mobarak Mosque gets New Year greeting cards from its Dutch neighbors. Before the ubiquity of GPS, people would lead worshippers who had trouble finding the building right to the door, he said.\n\"In what other country would that happen?\" he asked. \"The majority of the people in the Netherlands are still very liberal, very welcoming.\"\nThose receptive to Wilders' arguments also include wealthier people, among them the crew of the Maarten-Jacob. The trawler-men make as much as 8,000 euros ($8,450) each per month catching fish from the North Sea. Of the six aboard, five plan to vote Wilders, even though his desire to pull the Netherlands out of the European Union could hurt its fishing industry, likely limiting access to European waters.\n\"Islam is very dangerous,\" the captain, Jan de Boer, said. \"I'm very scared and I mean it, honestly.\"\nFear cuts both ways.\nImmigrants and their Dutch-born children are questioning their place in the country once famed for its tolerance.\n\"The Netherlands that I grew up in are not the Netherlands I live in today,\" said 46-year-old Sylvana Simons, of Surinamese descent.\n\"We've told ourselves and we desperately wanted to believe - and believed - that we were the most tolerant country in the world,\" the former TV presenter said. \"It has proven not to be enough.\"\nBorn in The Hague, with Moroccan parents, 36-year-old market-stall holder Latif Boujada said he no longer feels at home in either country. He sells let's-learn-Arabic books, recordings from the Quran and other Muslim apparel.\nBoujada's father came in the 1970s for work in the textile industry.\n\"The Dutch didn't want to do the dirty jobs. We helped make the country rich. Now they want us to go back,\" Boujada said.\nBut he added defiantly: \"We're not going anywhere. We are staying.\"\n___\nMike Corder in The Hague contributed.\nIn this Friday, March 3, 2017 photo, people walk by a billboard showing the candidates for the Parliamentary elections scheduled for March 15 at The Hague, The Netherlands. Ahead of a Dutch vote that will indicate whether populism in Europe is gathering strength or blowing over, divisive questions about immigration and Islam are testing the Netherlands' famed capacity for tolerance and inclusiveness. (AP Photo/Emilio Morenatti)\nIn this Saturday, March 4, 2017 photo, rosary beads are displayed for selling next to a mannequin wearing a headscarf in a market stall at The Hague, The Netherlands. In The Hague's most culturally diverse neighbourhoods, many women wear Muslim headscarves. (AP Photo/Emilio Morenatti)\nIn this Saturday, March 4, 2017 photo, members and supporters of the extreme right wing Nederlandse Volks-Unie (Netherlands People's Union) demonstrate in The Hague ahead of Parliamentary elections scheduled for March 15. The NVU is not fielding any candidates in the election but said it was using Saturday's demonstration to give its supporters voting advice. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, people are seen reflected in a restaurant window in The Hague, the Netherlands. Of The Netherlands' 17 million people, just over one in five now have a migrant background _ rising to roughly half-and-half in The Netherlands' four largest melting-pot cities: Amsterdam, Rotterdam, Utrecht and The Hague. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, the flag of The Netherlands flies near the beach in The Hague, The Netherlands. Ahead of a Dutch vote that will indicate whether populism in Europe is gathering strength or blowing over, divisive questions about immigration and Islam are testing the Netherlands' famed capacity for tolerance and inclusiveness. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, Agne, 12, plays his trumpet as he practices in the centre of The Hague, The Netherlands. Of the Netherlands' 17 million people, just over one in five now have a migrant background _ rising to roughly half-and-half in the Netherlands' four largest melting-pot cities: Amsterdam, Rotterdam, Utrecht and The Hague. (AP Photo/Emilio Morenatti)\nIn this Monday, March 6, 2017 photo, pedestrians walk along a platform at the central station in The Hague, The Netherlands. Of The Netherlands' 17 million people, just over one in five now have a migrant background _ rising to roughly half-and-half in the Netherlands' four largest melting-pot cities: Amsterdam, Rotterdam, Utrecht and The Hague. (AP Photo/Emilio Morenatti)\nIn this Saturday, March 4, 2017 photo, people have dinner at a restaurant at The Hague, The Netherlands. The Netherlands is densely populated, with some of its land reclaimed from the sea. Geert Wilders supporters cite lack of space as another reason for the Netherlands to close its doors. The country is full, they argue. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, Denice Spans, 30, center, walks next to her father Fred, 62, right, and their friend Rogier, left, as they go for a swim in the sea of The Hague, The Netherlands. \"I think 80 percent of people who vote Wilders are afraid of change,\" says Denice Spans, a 30-year-old educator who works with asylum seekers. Those voters include her father, Fred, a hairdresser. The two of them swim together in the North Sea in the mornings but don't see eye-to-eye politically. (AP Photo/Emilio Morenatti)\nIn this Monday, March 6, 2017 photo, a cyclist looks for a slot to park her bicycle at the bike free parking in The Hague, The Netherlands. The Netherlands is densely populated, with some of its land reclaimed from the sea. Geert Wilders supporters cite lack of space as another reason for the Netherlands to close its doors. The country is full, they argue. (AP Photo/Emilio Morenatti)\nIn this Sunday, March 5, 2017 photo, people walk along the beach in The Hague, The Netherlands. Of The Netherlands' 17 million people, just over one in five now have a migrant background _ rising to roughly half-and-half in The Netherlands' four largest melting-pot cities: Amsterdam, Rotterdam, Utrecht and The Hague. (AP Photo/Emilio Morenatti)\nIn this Thursday, March 2, 2017 photo, a woman reads the bible at the central station in The Hague, Netherlands. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, fishermen of the Maarten-Jacob ship work fixing their fishing net at the port in The Hague, The Netherlands. The crew of the Maarten-Jacob makes a handsome living, as much as 8,000 euros ($8,450) each per month, trawling fish from the murk of the North Sea. Five of the six men who work the vessel said they'd be voting for Geert Wilders, even though his desire to pull The Netherlands out of the European Union could be disastrous for the country's fishing industry, likely limiting access to European fishing grounds. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, a fisherman works on his ship fixing a fishing net at the port in The Hague, The Netherlands. The crew of the Maarten-Jacob ship makes a handsome living, as much as 8,000 euros ($8,450) each per month, trawling fish from the murk of the North Sea. Five of the six men who work the vessel said they'd be voting for Geert Wilders, even though his desire to pull the Netherlands out of the European Union could be disastrous for the country's fishing industry, likely limiting access to European fishing grounds. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, a poster with a portrait of Michel Rog, candidate for the CDA (Christian democratic party), is displayed in a window in the centre of The Hague, The Netherlands. Ahead of a Dutch vote that will indicate whether populism in Europe is gathering strength or blowing over, divisive questions about immigration and Islam are testing the Netherlands' famed capacity for tolerance. (AP Photo/Emilio Morenatti)\nIn this Saturday, March 4, 2017 photo, people walk along street stalls at a fruit market in The Hague, The Netherlands. In The Hague's most culturally diverse neighbourhoods, many women wear Muslim headscarves. In the market, young Muslim women eating battered fried fish, a Dutch favourite, took dainty, careful bites to avoid splashing grease on their hijabs. (AP Photo/Emilio Morenatti)\nIn this Thursday, March 2, 2017 photo, a mosque is seen on the outskirts of The Hague, The Netherlands. Of The Netherlands' 17 million people, just over one in five now have a foreign background. That number rises to roughly half-and-half in the four largest melting-pot cities: Amsterdam, Rotterdam, Utrecht and The Hague. About 5 percent of the population, at least 850,000 people, is Muslim. (AP Photo/Emilio Morenatti)\nIn this Friday, March 3, 2017 photo, a banner by Stichting Vluchteling (Refugee Foundation of Netherlands), that reads in Dutch \"Choose a Party\" hangs on a lamppost in The Hague, The Netherlands. Ahead of a Dutch vote that will indicate whether populism in Europe is gathering strength or blowing over, divisive questions about immigration and Islam are testing the Netherlands' famed capacity for tolerance and inclusiveness. (AP Photo/Emilio Morenatti)","url":"https://www.dailymail.co.uk/wires/ap/article-4300328/Fears-immigration-drive-Dutch-populist-vote.html"}
