{"authors":["Lianna Brinded"],"date_download":"2018-10-30 23:24:32","date_modify":"2018-10-30 23:24:32","date_publish":"2016-12-07 00:00:00","description":"Jacob Wallenberg's family foundation holds large stakes in AstraZeneca, Nasdaq, Electrolux and Saab.","filename":"data/vaneerConsumption/EuropeanindustrialistJacobWallenbergBrexitimpactonFDIinvestmentpassportingarticle50.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-industrialist-jacob-wallenberg-brexit-impact-on-fdi-investment-passporting-article-50-2016-12_1540941872.html","title":"European industrialist Jacob Wallenberg: Brexit impact on FDI, investment, passporting, article 50","title_page":"    European industrialist Jacob Wallenberg: Brexit impact on FDI, investment, passporting, article 50 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters LONDON — One of Europe's most influential industrialists questioned London's future as a financial centre in the wake of Brexit and said the UK is no longer \"first on the list\" for new investments here.\nSwedish investor Jacob Wallenberg has a family foundation that holds massive stakes in companies such as pharmaceutical giant AstraZeneca and reformed automaker and now defence group Saab. The stakes generate around $130 billion (£102.9 billion) in revenue.\nIn an interview with the Financial Times, Wallenberg said that when Brits voted for a Brexit on June 23, it was \"one of the worst days of my professional life.\"\nHere are some highlights from the FT interview:\nOn investing in expansion — \"For those of us who have the liberty to wait a while, we will wait a while. For the time being there are so many outstanding questions that the UK is not the first country on the list for investments and this will remain for some time.\"\nWhere London ranks on his investment list — \"Am I, at this point in time, going to put new capacity in Britain? No.\"\nThe future of London's role in the financial markets — \"For all of Europe, the axis London-Berlin-Paris is over. London has always been standing up for a libertarian view but is no longer at the table. It will be replaced by the axis Paris-Berlin, which has a very different view of economics. London is the centre of global financial markets, and that is being put into question. This is not in the interest of either the UK or Europe.\"\nThe loss of passporting rights following Brexit is one of the biggest fear's in the City of London. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues.\nAround 5,500 firms registered in the UK rely on the European Union's passporting rights for the financial services sector, and they turn over about £9 billion in revenue.\nClick here for the full FT interview.","url":"https://www.businessinsider.com/european-industrialist-jacob-wallenberg-brexit-impact-on-fdi-investment-passporting-article-50-2016-12"}
