{"authors":["Press Association"],"date_download":"2018-10-23 00:19:56","date_modify":"2018-10-23 00:19:56","date_publish":"2016-01-29 13:04:06","description":"Andy Murray and Novak Djokovic could join forces and play on the same team after the launch of a new Ryder Cup-style tournament was announced. The Laver Cup,...","filename":"data/vaneerConsumption/Europetotakeonrestoftheworldinlavercup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-48d1422f-7024-4f07-beae-7056a66da976-4PuZeKVXE7cd9005b2c876a2ad32-155_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422378_Europe-Rest-World-Laver-Cup_1540253996.html","title":"Europe to take on rest of the world in laver cup","title_page":"Europe to take on rest of the world in laver cup | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Europe to take on Rest of the World in Laver Cup\nAndy Murray and Novak Djokovic could join forces and play on the same team after the launch of a new Ryder Cup-style tournament was announced.\nThe Laver Cup, named after Australia's 11-time major champion Rod Laver, will be a three-day event pitting a European team against the rest of the world.\nThe competition will be held annually, except for Summer Olympic years, and the first edition is set for September 2017.\nRod Laver has given his name to a new Ryder Cup-style event\nLaver said: \"I can see this becoming a very important part of the experience of being a top global player, with the world's best longing to earn the right to participate and thriving in this style of competition.\n\"It's so good to see the sport of tennis finally develop a proper counterpart event to the Ryder Cup.\"\nTeams will be made up of six players, with four qualifying through results and the other two selected by their team captains. Matches will feature both singles and doubles ties.","url":"https://www.dailymail.co.uk/wires/pa/article-3422378/Europe-Rest-World-Laver-Cup.html"}
