{"authors":["Will Martin"],"date_download":"2018-10-30 21:49:43","date_modify":"2018-10-30 21:49:43","date_publish":"2016-12-16 00:00:00","description":"The latest inflation data out of the eurozone was released on Friday.","filename":"data/vaneerConsumption/EurozoneinflationdataforNovember.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_eurozone-inflation-data-for-november-2016-12_1540936183.html","title":"Eurozone inflation data for November","title_page":"    Eurozone inflation data for November - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Dominic Lipinski PA Wire/PA Images Inflation in the eurozone creeped up again in November, according to the latest inflation figures released by Eurostat on Friday morning.\nConsumer price inflation, the key measure of price growth, came in at 0.6% year-on-year in November, matching the earlier flash estimate provided at the end of November.\nThat represents a 0.1 percentage point increase from October, when inflation read 0.5%.\nInflation in the eurozone now sits at a level not seen for more than two years.\nOn a year-to-year basis core consumer prices grew by 0.8%, against a forecast of 0.8%, and a previous reading of the same number.\nCore prices are an important measure because they strip out the most volatile items — things like fuel and food prices, which are subject to massive variations.\n\"The largest upward impacts to euro area annual inflation came from restaurants & cafés (+0.07 percentage points), rents and tobacco (both +0.04 pp), while gas (-0.11 pp), heating oil (-0.05 pp) and package holidays (-0.04 pp) had the biggest downward impacts,\" a statement from Eurostat said.\nHere is the chart showing the longer term trend:\nEurostat\nOn a nation-by-nation basis, Belgium saw the biggest price growth in the month. \"In November 2016, negative annual rates were observed in six Member States. The lowest annual rates were registered in Bulgaria and Cyprus (both -0.8%). The highest annual rates were recorded in Belgium (1.7%), the Czech Republic (1.6%) and Austria (1.5%),\" Eurostat said.\nHere is the chart:","url":"https://www.businessinsider.com/eurozone-inflation-data-for-november-2016-12"}
