{"authors":["Myra Butterworth For Mailonline"],"date_download":"2018-10-23 00:19:50","date_modify":"2018-10-23 00:19:50","date_publish":"2016-01-29 13:03:17","description":"The Polish tower block is still being built, meaning buyers won't be able to move in until the end of the year, but it has already won awards for its design.","filename":"data/vaneerConsumption/Europesbestdevelopmentisunveiledasa52storeytowerblockinWarsaw.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30AAD8D500000578-0-image-a-20_1454071994316.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-3422352_Europe-s-best-development-unveiled-52-storey-tower-block-Warsaw_1540253990.html","title":"Europe's 'best development' is unveiled as a 52-storey tower block in Warsaw","title_page":"Europe's 'best development' is unveiled as a 52-storey tower block in Warsaw | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A new apartment block in Poland has been named Europe's best development, even though it will not be completely built for several months.\nResidents will be able to move into one of the 287 apartments in the 52-storey tower block in Warsaw before the end of this year.\nPrices range from £242,000 to £1.9m depending on whether they opt for a one, two or three bedroom flat, while the luxury penthouses are expected to sell for £7m.\nThe award-winning development is a 52-storey tower block in Poland's Warsaw.\nPrices range from £242,000 for a one bedroom flat to £7m for a luxury penthouse.\nThere is a choice of interior design schemes available, depending on the size of apartment.\nThe tower includes a large temperature controlled wine storage on the ground floor for wine connoisseurs.\nThere are spectacular views across Poland's Warsaw where the tower is located.\nResidents will have access to a 25 metre swimming pool, a Jacuzzi and a gym, along with a private cinema equipped with a golf simulator, children's playroom and business conference rooms.\nThere's an additional bonus for wine connoisseurs as there is a large temperature controlled wine storage on the ground floor.\nAll of the apartments have floor-to-ceiling glazing in the living areas and the latest technology that'ss compatible with tablets and smartphones. There is also parking facilities and a concierge on site.\nArchitect Daniel Libeskind said: 'The concept and design first came to mind as I was reflecting on the city, which has been resurrected after ages of destruction and oppression.'\nThe flats range in size from 660 sq ft up to 10,000 sq ft for a penthouse.\nMichal Skotnicki, of polish developer BBI Development, said: 'Warsaw offers spectacular value compared to similar top luxury residences in other markets such as London, Paris or Berlin that now command an excessive price premium.'\nSimon Conn, an overseas property and finance expert, told MailOnline: 'Poland is not a holiday market, it is a business market or for expats who want to buy a retirement home in the area.'\n'It is also difficult to get a mortgage unless you're buying with a Polish partner,' he added.\nThe development is called Zlotta 44 and was named Europe's 'Best Residential Development' at the International Property Awards, held in London in December.\nWhile not seen as a traditional holiday destination, Warsaw - which is Poland's capital - was ranked the most liveable city in the world by the Economic Intelligent Unit in 2012. Local industry includes manufacturing, metal processing, steel and electronic manufacturing and food processing.\nOne, two and three bedroom apartments are available depending on a buyer's budget.\nThe distinctive development has 52 floors and towers over the city of Warsaw.","url":"https://www.dailymail.co.uk/property/article-3422352/Europe-s-best-development-unveiled-52-storey-tower-block-Warsaw.html"}
