{"authors":["Breitbart London"],"date_download":"2018-10-30 21:56:12","date_modify":"2018-10-30 21:56:12","date_publish":"2016-08-25 08:24:02","description":"An EU scheme to relocate refugees from Greece and Italy must be bigger and move faster, the U.N. refugee chief said Wednesday.","filename":"data/vaneerConsumption/EuropesForcedMigrantRelocationSchemeMustBeBiggerQuicker.json","image_url":"https://media.breitbart.com/media/2016/04/Screen-Shot-2016-04-29-at-17.53.50.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_08_25__1540936572.html","title":"Europe's Forced Migrant Relocation Scheme Must Be Bigger, Quicker","title_page":"U.N. Migrant Chief: Europe's Forced Migrant Relocation Scheme Must Be Bigger, Quicker","title_rss":"NULL","source_domain":"breitbart.com","text":"(REUTERS) – A European Union scheme to relocate refugees from frontline countries Greece and Italy to other member states must be bigger and move faster, the U.N. refugee chief said in Athens on Wednesday.\nThe programme, devised last year, was intended to relocate 160,000 from Greece and Italy to other European countries over two years but fewer than 4,000 people have moved so far.\nSome central European member had fought the scheme, with Hungary and Slovakia challenging the decision in EU courts.\n“I will certainly continue to advocate on behalf of the refugees, on behalf of the states hosting them – Italy and Greece principally – for this programme to be bigger and to be accelerated,” U.N. High Commissioner for Refugees Filippo Grandi told reporters.\n“It is one example of European solidarity and cooperation that can and must work so we need to put all our energy in trying to make it work.”\nOnly refugees – specifically those from Syria, Iraq and Eritrea – are considered for the programme. Migrants and failed asylum seekers are not relocated but repatriated to their countries of origin.\nItaly’s interior minister said on Tuesday that Germany had agreed to take in hundreds of people who are blocked in Italy.\nAsked if the programme could still work, Grandi said: “I hope that it will. Because in fact it must work.”\nGrandi was speaking after a visit to a Syrian family from Aleppo, living in an Athens apartment under a scheme launched by the UNHCR and EU Commission.\nThe family of seven – a mother, two grandparents and four children – were displaced for years inside Syria before fleeing to Europe this summer. They are all relocation candidates.\n“They left behind a good life to come here and to escape from the war,” said Sofia, whose family owns the apartment and who lives with her own family in the flat above, urging other Greeks to open their homes to refugees and migrants.\n“We could have be in their shoes,” she said. She declined to give her family name.\nThe family are among more than 58,000 refugees and migrants, mostly from Syria, Iraq and Afghanistan, who have arrived in Greece since March hoping to move further north through Europe but who ended up stranded by border closures in the Balkans.\nMost live in difficult, unsanitary camps across the country. Greece is also seeking new facilities to alleviate overcrowding at centres on five islands.\nDuring his three-day visit to Athens, the second this year, Grandi said the UNHCR would keep pushing the EU for more support.\nBut he also underlined that efforts to end the conflict in Syria and other war-torn countries should be stepped up.\n“Refugees are mostly the result of unresolved conflict and until and unless we solve those conflicts the risk of new influxes and new emergencies cannot be excluded,” he said.\n(Additional reporting by Gina Kalovyrna; Editing by Alison Williams)","url":"https://www.breitbart.com/europe/2016/08/25/u-n-refugee-chief-europes-forced-migrant-relocation-scheme-must-bigger-quicker/"}
