{"authors":[],"date_download":"2018-10-30 00:56:35","date_modify":"2018-10-30 00:56:35","date_publish":"2018-06-30 13:22:24","description":null,"filename":"data/vaneerConsumption/EuropeanUnionReachesMigrationDeal.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/EU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860995.html","title":"European Union Reaches Migration Deal","title_page":"European Union Reaches Migration DealThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On June 28 and 29, European leaders met in Brussels to discuss, among other things, the migrant crisis from Africa and the Middle East and those that have landed on Europe’s shores in recent years in search of refuge. This came at a particularly tense time, as Europeans at every level are divided on the issue.\nOne faction represents the more recent European order; it celebrates regional unity, multiculturalism, and neoliberalism. Chancellor Angela Merkel and President Emmanuel Macron have taken charge on these issues across the European Union. On the other side are the more populist, and in some cases, more nationalistic bodies who reject multiculturalism, support traditional European values, and national identity. Its leaders include Italy’s Deputy Prime Minister Matteo Salvini and Hungary’s Prime Minister Viktor Orbán.\nWhile migration across the Mediterranean has been commonplace for thousands of years, the influx over the past three years has been unprecedented and Europe has struggled to handle all the new arrivals. In Italy alone, an estimated 600,000 people have arrived since 2014. In Germany, over a million Syrians and others arrived in 2015 and 2016, after first arriving in on the southern coasts of Europe by boat, and then traveling up through the Balkans on to Central Europe. While steady immigration does come with notable and positive effects, inflows this high are not sustainable and have led to numerous issues, both economic and cultural. Social services are strained as Europe’s welfare states have a hard time catering to millions of new users.\nSome of Europe’s nations have decided that they have had enough, and no longer wish to accept ships and other craft that are arriving from the North African coast. Earlier this week, Malta denied access to a Dutch-flagged German NGO ship, Lifeline, carrying over 200 migrants. Italy and others criticized this move. Ironically, Italy was also criticized for denying port access to the exact same ship a few days prior. Eventually, a deal was made in which the ship would dock in Malta and the migrants would either remain in Malta or be sent to Italy. Earlier this month, both Malta and Italy denied access to another ship, Aquarius, which eventually was allowed to make port in Spain where they would be processed.\nLast weekend, ahead of the full 28 member summit, 16 heads of state met in Brussels for informal talks. While nothing concrete was established, all leaders agreed that Europe’s borders needed to be better protected and that source countries need to have a greater responsibility.\nShortly before the summit, Germany’s Angela Merkel took a harder stance than she has in the past, and urged the German parliament to support a tough but humane approach to migration, and claimed the crisis was a “make or break” moment for Germany and Europe. This comes at a particularly important time for Merkel, as her support has decreased drastically while her own Minster of the Interior was willing to act unilaterally to deal with the crisis. Merkel faces an ultimatum from members of her own party to get a Europe-wide solution to the crisis.\nTaking an even harder stance than Merkel, Orbán stated that “Finally, we will do what the people really request, and I think the people request two things. The first is no more migrants in, so stop them. The second is: those who are in, we should bring back.”\nMerkel’s solution of a “tough but humane” approach was welcomed by other key countries at the summit including Greece, France, and Spain. On Thursday, Italy was concerned that this solution was not adequate, and threatened to stall the summit if no concrete provisions were made — any solution would have to be backed up with action, not just words.\nNegotiations continued late into the night, but a deal was finally reached in the early hours of Friday morning. The deal made provisions regarding processing centers for migrants on EU soil as well as made efforts to protect Europe’s external and internal borders. Italy ended in a better place than it started, as asylum seekers landing in the country would now be regarded as seeking asylum in “Europe” rather than just Italy, dealing a blow to the Dublin Regulation that put increased burdens on the individual countries where asylum seekers arrive. Merkel also is in a better place than she started, as she has an agreement to bring to her divided party and parliament.\nNow that the summit is over, European governments must work together to implement the policies that will keep their continent secure. While there was some agreement, and things are moving towards a semblance of unity, this deal is by no means the end of this crisis, and further debate and head-butting between the European states is certain to continue.","url":"https://spectator.org/european-union-reaches-migration-deal/"}
