{"authors":["Glen Williams For Mailonline"],"date_download":"2018-10-22 22:14:56","date_modify":"2018-10-22 22:14:56","date_publish":"2017-03-10 00:24:59","description":"Karim Ansarifard's ball was met by Cambiasso to put his side in front. But Aboubakar rescued a valuable point, and arguably more crucial away goal, when he rifled home just after the break.","filename":"data/vaneerConsumption/EuropaLeagueroundupCambiassostrikecancelledout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1E5D0400000578-0-image-a-24_1489105385407.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4299474_Europa-League-round-Cambiasso-strike-cancelled-out_1540246496.html","title":"Europa League round-up: Cambiasso strike cancelled out","title_page":"Europa League round-up: Cambiasso strike cancelled out | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Leicester midfielder Esteban Cambiasso gave Olympiacos a first-half lead over Besiktas but Vincent Aboubakar replied to earn the Turkish side a 1-1 draw in Athens.\nKarim Ansarifard's inswinging ball was met by Cambiasso, who did well to finish and put his side in front.\nBut Aboubakar rescued a valuable point, and arguably more crucial away goal, when he rifled into the bottom corner just after the break.\nEsteban Cambiasso opened the scoring for Olympiacos against Besiktas in the first half\nBut Vincent Aboubakar cancelled the Argentinian's goal out as the game finished 1-1\nClaudio Beauvue's 90th minute goal gave Celta Vigo a 2-1 win at home against Russian outfit Krasnodar.\nThe game got off to a slow start but both sides hit their straps in the second half. Daniel Wass's free kick bamboozled Stanislav Kritsyuk in the Krasnador goal to open the scoring.\nBut Viktor Claesson hit back quickly for the visitors, poking home between Sergio Alvarez's legs just six minutes later to gain parity.\nBut Beauveus' last-gasp strike was enough to down the visitors when he glanced home a pin-point Hugo Mallo cross to put the ball beyond Kritsyuk.\nCelta Vigo's Claudio Beauvue struck in the 90th minute to down Krasnador in the 2-1 win\nEUROPA LEAGUE LAST-16 RESULTS Apoel Nicosia 0-1 Anderlecht Copenhagen 2-1 Ajax Rostov 1-1 Manchester United Celta Vigo 2-1 Krasnodar Schalke 1-1 Borussia Monchengladbach Gent 2-5 Genk Lyon 4-2 Roma Olympiakos 1-1 Besiktas\nCopenhagen's Andreas Cornelius headed in on the hour to secure a 2-1 home victory against former European champions Ajax.\nThe Danish side shot out of the blocks to take the lead in the first minute. Soren Kvist dinked a ball through to Rasmus Falk, who lashed home with just 28 seconds on the clock.\nThe Dutch giants hit back strongly, however. Teenage starlet Kasper Dolberg levelled proceedings just after the half-hour mark with a pivoting volley.\nBut former Cardiff striker Cornelius planted an emphatic header home from near the penalty spot to seal the win at the Parken Stadium.\nAnderlecht won 1-0 at APOEL Nicosia with a first-half goal from Nicolae Stanciu.\nAlexandru Chipciu showed composure in the box to pull the ball back to Stanciu, who slotted into the corner for the game's only goal.\nAndreas Cornelius headed home for Copenhagen to give his side the 2-1 win over Ajax","url":"https://www.dailymail.co.uk/sport/football/article-4299474/Europa-League-round-Cambiasso-strike-cancelled-out.html"}
