{"authors":["Will Martin"],"date_download":"2018-10-30 23:29:11","date_modify":"2018-10-30 23:29:11","date_publish":"2016-12-07 00:00:00","description":"Optimism over the future has returned to the continent's financial sector ahead of a crucial European Central Bank meeting on Thursday.","filename":"data/vaneerConsumption/EuropeanstockmarketsonWednesdayDecember7.json","image_url":"https://amp.businessinsider.com/images/58483cb1dd089531448b4e34-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-stock-markets-on-wednesday-december-7-2016-12_1540942151.html","title":"European stock markets on Wednesday December 7","title_page":"    European stock markets on Wednesday December 7 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Laszlo Balogh Stocks across Europe charged on Wednesday as optimism over the future returned to the continent's financial sector ahead of a crucial European Central Bank meeting on Thursday.\nThe European Central Bank's governing council will hold its December meeting in Frankfurt, where it is widely expected to announce that it will extend its quantitative easing programme beyond the current endpoint in March 2017.\nThe prospect of that extra stimulus, as well as the hope that a solution to the crisis at Italian lender Monte dei Paschi is close, has boosted stocks.\nGovernment officials reportedly told executives at Monte dei Paschi to prepare for a possible €5 billion (£4.2 billion, $5.3 billion) state bailout as soon as this weekend, according to the Financial Times, while the bank's CEO Marco Morelli and Chief Financial Officer Francesco Mele were said to be in Frankfurt on Tuesday to hold talks with the officials at the eurozone's Single Supervisory Mechanism.\nThe Wall Street Journal reports that Morelli and Mele are there to discuss the implementation of the bank's €5 billion capital increase.\nAs a result, Europe's major share indexes — particularly Italy's FTSE MIB — followed on from where they left off yesterday evening on Wednesday, climbing strongly.\nAt the European close, the MIB was higher by more than 2%, having spent all day well in the green. Its gains were led by Monte dei Paschi, which closed the day more than 10% higher. Unicredit, the country's biggest lender and only globally systemically important bank, was 9% higher, having gained 12% on Tuesday.\nHere is the broad MIB chart:\nInvesting.com\nElsewhere in Europe gains are in a similar ballpark, with shares in Germany's DAX and Britain's FTSE 100 both close to 2% higher, and most other bourses more than 1% up. Here is the Europe-wide scoreboard:\nInvesting.com\nCommenting on Wednesday's market moves, Mike van Dulken of Accendo Markets writes in an emailed statement:\n\"Calls for further Equity gains in Europe come courtesy of another record Wall St close helped by a bank-led rally and even stronger advances in Asia overnight. This is in spite of lower oil prices and disappointing Aussie GDP, with metals prices back pointing north in spite of a stronger US dollar, something which should help the FTSE via a weaker GBP and DAX via weaker EUR.\n\"Optimism remains rife within financials that the ECB is set to extend its bond-buying QE programme tomorrow and that a recapitalisation solution for troubled Italian bank Monte dei Paschi di Siena (MPS) is in the pipeline. However, this could be via Italy applying for a €15bn loan from Europe's ESM to help recapitalise several troubled banks and not just MPS which would avoid the issue of illegal state aid/bailout.\"","url":"https://www.businessinsider.com/european-stock-markets-on-wednesday-december-7-2016-12"}
