{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-22 23:36:05","date_modify":"2018-10-22 23:36:05","date_publish":"2017-04-26 08:08:15","description":"Police have opened an investigation after the 21-year-old received the vile abuse on social media and she has fled her home in Scotland.","filename":"data/vaneerConsumption/EuroMillionswinnerJaneParkhirestwobodyguards.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F869C0B00000578-0-image-a-4_1493190361916.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446566_EuroMillions-winner-Jane-Park-21-hires-two-bodyguards_1540251365.html","title":"EuroMillions winner Jane Park hires two bodyguards","title_page":"EuroMillions winner Jane Park hires two bodyguards | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britain's youngest EuroMillions Jane Park has brought in bodyguards after an online troll threatened her with a brutal acid attack to make her face look like a 'melted welly'.\nPolice have opened an investigation after the 21-year-old received the vile abuse on social media and she has fled her home in Scotland.\nThe millionaire, from Edinburgh, has now enlisted two bodyguards to protect her as she went shopping yesterday.\nThe burly security guards flanked her while she was running errands, including to the bank.\nEuromillions winner Jane Park (pictured) has hired bodyuards and fled her home in Scotland after an online troll threatened her with a brutal acid attack\nTV personality Katie Piper (pictured in 2009) was left disfigured and still needing reconstructive surgery nearly a decade after the attack\nThe men, from high-end firm Spears Worldwide Security, then walked her into a blacked-out people carrier.\nThe Euromillions winner, who is Britain's youngest, was told on Snapchat she would end up with a face like a 'melted welly' and the abuser referenced acid-attack victim Katie Piper.\nThe troll said: 'You don't want to end up with a face like a half-melted welly boot do you?' according to the Mirror.\nThey added: 'Katie Piper eat your heart out.'\nA source close to Miss Park told the Mirror: 'Jane has had a really traumatic time and is fearful what will happen next. It clearly scared her.'\nTV personality Katie Piper's ex-boyfriend Daniel Lynch hired Stefan Sylvestre to throw acid on her face in an attack in 2008, after which both men were given life sentences.\nShe was left disfigured and still needing reconstructive surgery nearly a decade after the attack.\nThis latest development comes just weeks after hackers accessed Miss Park's personal photos and offered to sell them to the press for £1,000.\nThe Euromillions winner was told on Snapchat she would end up with a face like a 'melted welly' and the abuser referenced acid-attack victim Katie Piper\nThe anonymous seller claimed to have got the four pictures from her private Snapchat account, openly admitting to having hacked into it.\nThey requested £1,000 - to be paid through Paypal, an online payments company - for the images of Miss Park, who won £1million on the Euromillions when she was 17.\nMiss Park was so young when she won in 2013 that they had to put Irn Bru in her champagne flute for the press photo shoot after the win, and enjoyed celebrity because of it.\nAt the time, she vowed to spend it on a customised white Range Rover with pink trim, a season ticket for her beloved Hibernian football team and a holiday in Ibiza with her friends.\nMiss Park also spent nearly £4,000 on plastic surgery to increase her bra size to a 36FF.\nShe bought herself a house in Prestonpans, Scotland, for £169,995 but recently sold it at a £20,000 profit after four years because she wanted to move back in with her mother after feeling lonely living alone.\nMiss Park has previously bought a VW Beetle, a BMW, a purple Range Rover and is now shopping for a Mercedes. A friend said she would consider the £30,000-£50,000 a chauffeur would cost 'money well spent'.\nThe lottery winner has hit the headlines numerous times over the years, flashing her 34FF breasts on a Halloween night out in November last year.\nBut in February, she claimed she was considering legal action against Camelot, claiming her life would have been '10 times better' had she not won the money at such a young age.\nPolice have opened an inquiry after the 21-year-old received the vile abuse on social media\nHowever, she has since revealed that she will not sue Camelot and is now rumoured to be appearing on the next series of Love Island.\nThe young winner, who does not work and has enjoyed a series of luxury cars since the win, hit the headlines again in March when she was banned from driving for 18 months.\nLast week Miss Park hit the headlines when she posted an intimate Snapchat photo next to Scottish reality star Brian Matthews.\nMiss Park, who used to date X Factor star Sam Callaghan, posted a bedroom picture of her with Matthews, who starred in Scottish reality show Glow. She captioned the photo, saying: 'Sorry Sam Callahan'.","url":"https://www.dailymail.co.uk/news/article-4446566/EuroMillions-winner-Jane-Park-21-hires-two-bodyguards.html"}
