{"authors":["Will Martin"],"date_download":"2018-10-30 22:53:28","date_modify":"2018-10-30 22:53:28","date_publish":"2018-07-26 00:00:00","description":"\"As long as the trade tensions do not escalate into an outright trade war, we see no reason for the ECB to change its June guidance,\" Berenberg economist Florian Hense said.","filename":"data/vaneerConsumption/EuropeanCentralBankdecisionforJuly2018.json","image_url":"https://amp.businessinsider.com/images/547afb46eab8eab95a0a0dcf-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-central-bank-decision-for-july-2018-7_1540940008.html","title":"European Central Bank decision for July 2018","title_page":"    European Central Bank decision for July 2018 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Mario Draghi, President of the European Central Bank (ECB) waits for the start of the European Banking Congress in the Old Opera house in Frankfurt, November 21, 2014. REUTERS/Kai Pfaffenbach\nLONDON — The European Central Bank left its monetary policy entirely unchanged at the July meeting of its governing council on Thursday, as had been expected.\nThat means a base deposit rate of -0.4%, and a quantitative easing program of €30 billion per month — a figure that will be reduced to 15 billion euros per month from September as the bank winds down its bond buying. The ECB will cease purchasing bonds from the end of 2018.\nThe bank continued, however, to hint that an interest-rate hike could be on the way in the next year or so.\n\"The Governing Council expects the key ECB interest rates to remain at their present levels at least through the summer of 2019,\" it said in a statement, adding \"in any case for as long as necessary to ensure the continued sustained convergence of inflation to levels that are below, but close to, 2% over the medium term.\"\nThis assessment was corroborated by President Mario Draghi during a press conference after the decision, in which he had a positive view of the eurozone economy.\n\"While uncertainties, notably related to the global trade environment, remain prominent, the information available since our last monetary policy meeting indicates that the euro area economy is proceeding along a solid and broad-based growth path,\" he told reporters at the ECB's Frankfurt headquarters\nThe meeting was always expected to be uneventful, with economists unanimous in their beliefs that policy would be unchanged. July's meeting is the last before the central bank's extended summer break, and is traditionally lacking in any significant action.\n\"As expected, today's meeting yielded little new information with regards to the policy outlook following last month's forward guidance update,\" Andrew Wilson, CEO of Goldman Sachs Asset Management Europe, said in an email.\nThe euro was little moved on the decision, reflecting the fact that it was in line with market expectations.","url":"https://www.businessinsider.com/european-central-bank-decision-for-july-2018-7"}
