{"authors":["Associated Press"],"date_download":"2018-10-23 00:08:38","date_modify":"2018-10-23 00:08:38","date_publish":"2016-01-29 12:48:20","description":"LONDON (AP) — Inflation across the 19-country eurozone doubled in January, but few economists think it represents a meaningful pick-up in the economy given s...","filename":"data/vaneerConsumption/Eurozoneinflationat15monthhighbutoutlookstillweak.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:e3379530f66b4bc09eb84cf7bbe26107-3bmscybNe842cce83474b55927ba-227_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422469_Eurozone-inflation-rises-15-month-high-January_1540253318.html","title":"Eurozone inflation at 15-month high, but outlook still weak","title_page":"Eurozone inflation at 15-month high, but outlook still weak | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eurozone inflation at 15-month high, but outlook still weak\nLONDON (AP) — Inflation across the 19-country eurozone doubled in January, but few economists think it represents a meaningful pick-up in the economy given subdued growth across much of the region, a renewed drop in oil prices and mounting uncertainties around the world.\nConsumer prices were 0.4 percent higher in January than the year before, against December's 0.2 percent rate, according to figures released Friday by Eurostat. January's rate was the highest since October 2014, when it was also 0.4 percent, a development that may provide comfort to at least some policymakers at the European Central Bank.\nThe ECB is in the midst of a massive stimulus program that is designed to get inflation back toward its target of just below 2 percent. By keeping interest rates low and pumping money into the economy via a bond-buying program worth over a trillion euros, the ECB is hoping to generate enough economic activity to get prices rising. Last week, ECB President Mario Draghi hinted that an expansion of the stimulus could be announced in March.\nFILE - In this Thursday, Jan. 21, 2016 file photo, the President of the European Central Bank Mario Draghi waits for the beginning of a news conference in Frankfurt, Germany, following a meeting of the ECB governing council. The chief monetary authority for the 19-country eurozone helped stem a global stock market slide last week by indicating the ECB could provide more stimulus at the next meeting in March. (AP Photo/Michael Probst, File)\nInflation has been below target since February 2013 for a variety of reasons, not least the fall in oil prices. Few economists think inflation is heading toward target any time soon.\n\"Rather than representing the start of a convincing upward trend, we view today's outturn as a transitory hiccup in an otherwise lifeless path for inflation,\" said Timo del Carpio, European economist at RBC Capital Markets.\nOnce again, energy prices weighed the most on inflation in January, but the impact was smaller than it has been in previous months as prior-year declines start falling out of the annual comparison. In the year to January, energy prices were 5.3 percent lower. The last time the impact was smaller was in June 2015.\nOther components of inflation saw price increases, such as processed food, alcohol & tobacco.\nPerhaps more encouraging for ECB rate-setters was the news that the core rate, which strips out volatile items like energy and food, rose to 1 percent from 0.9 percent. The increase in the core rate suggests underlying price pressures are building as unemployment drops in many parts of the eurozone and amid signs of a pick-up in wage increases.\nThe outlook for inflation is likely to hinge heavily on oil prices. A big drop in January — which saw the benchmark New York rate fall to a near 13-year low around $27 a barrel — amid worries over the scale of the Chinese economic slowdown stoked renewed worries that the eurozone, and other economies such as Japan, could suffer a debilitating bout of deflation, or falling prices.\nThe idea of falling prices sounds good but in reality can be a big problem. Consumers could decide to postpone spending if they think prices are likely to continue falling, while businesses fail to generate the profit margins they need to invest and innovate. In combination, they can cause an economy to stagnate, as happened in Japan over the past two decades.\nA rebound in oil prices this week following speculation that the OPEC oil cartel and other suppliers such as Russia are mulling production cuts has helped push the price of oil back above $30 a barrel — on Friday, it was up a further 19 cents at $33.41 a barrel. If that trend continues, the deflation fears may recede and ease the pressure on the ECB to do more.\nFollowing Draghi's comments last week, markets have been primed for a further stimulus and the reaction to Friday's figures suggests that hasn't changed much, with the euro fairly flat around $1.09. The improvement in inflation contrasted with downbeat data showing lending by commercial banks to businesses increased only 0.3 percent in December, after rising 0.7 percent in November. The ECB has cited improving bank lending statistics as proof its stimulus is working.\n\"We still expect the ECB to revise its (core inflation) forecasts sharply downwards in March, which will clear the way for further expansionary measures,\" said Christoph Weil, an economist at Commerzbank.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422469/Eurozone-inflation-rises-15-month-high-January.html"}
