{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:45:55","date_modify":"2018-10-30 20:45:55","date_publish":"2015-06-28 22:10:55","description":"The Greek prime minister’s surprise call for a July 5 referendum for voters to decide whether or not to accept the terms of a bailout deal offered by international creditors prompted the Eurozone to reject Greece’s pleas to extend the expiring bailout, various news outlets report.","filename":"data/vaneerConsumption/EurozoneExpectingGreekDefaultAfterBailoutExtensionRejected.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo1155-1024x682.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_28__1540932355.html","title":"Eurozone Expecting Greek Default After Bailout Extension Rejected","title_page":"Eurozone Expecting Greek Default After Bailout Extension Rejected","title_rss":"NULL","source_domain":"breitbart.com","text":"The Greek prime minister’s surprise call for a July 5 referendum for voters to decide whether or not to accept the terms of a bailout deal offered by international creditors prompted the Eurozone to reject Greece’s pleas to extend the expiring bailout, various news outlets report.\nThat means the bailout will expire on Tuesday, setting the stage for financially troubled Greece to default on a critical $1.73 billion payment to the International Monetary Fund (IMF) due on the aforementioned expiration date.\nGreece wanted the bailout to be extended until after the referendum on July 5, reports Reuters, adding that the finance ministers of the 18 other nations that share the euro with Greece are now preparing for a Greek default.\n“Addressing the nation at 1 a.m. in Athens, [Greek Prime Minister Alexis Tsipras] told a television audience that Greek voters should have their say on the economic retrenchment that other eurozone countries and the International Monetary Fund [IMF] are demanding of Greece,” reports The Wall Street Journal (WSJ). “He said he couldn’t accept the list of policies that creditors presented in Brussels this week, which include some drastic tax hikes and sharp cuts to government spending, including on pensions.”\n“Most European policy makers were taken by surprise by the Greek premier’s announcement, though Mr. Tsipras said he had informed German Chancellor Angela Merkel and French President François Hollande about his decision.”\nOn Saturday, Greece’s Interior Minister Nikos Voutsis reportedly said that the Greek government “is not neutral” and will urge voters to reject the creditors deal in the referendum.\nThe Guardian reports, “Euro finance ministers have refused to extend Greece’s bailout following [Mr. Tsipras’] shock decision to hold a referendum, meaning [the bailout] expires on 3o June.”\nIreland’s Finance Minister Michael Noonan told reporters that Greece’s call for a referendum scuttled chances of an agreement between eurozone nations on how to ensure financial stability in both Greece and the eurozone after the bailout expires.\nWithout Greece, the other 18 countries “pledged to do whatever it takes to stabilize the common currency area and said they were in much better shape to do so than at the height of the eurozone crisis a few years ago. In a formal statement, they also implicitly urged Greece to impose capital controls to stabilize its banking system,” notes Reuters.\nGreece still remains a member of the European Union, according to The Guardian.\nGreece’s Finance Minister Yanis Varoufakis was reportedly now allowed to attend Saturday’s meeting of European finance ministers in Brussels. In a statement issued by the ministers who attended the gathering, Greek was accused of unilaterally breaking off the negotiations.\n“The current financial assistance arrangement with Greece will expire on June 30, 2015, as well as all agreements related to the current Greek program,” it said, stressing its decision to reject a grace period to hold the vote, Reuters reports.\n“Underlining the mutual incomprehension that has marked months of often angry exchanges between the Syriza government [in Greece] and its European partners, Finance Minister Yanis Varoufakis was still holding out hopes of a deal,” adds the article.\nIf the lenders agree to improve the terms, Varoufakis said the Greek government would recommend that voters support the deal.\nDespite the backlash against Greece’s prime minister’s call for a referendum, “the Greek parliament met to approve the referendum, with pro-European opposition parties uniting in condemning the decision and fuelling speculation that Tsipras’ left wing government may have to resign if voters back the bailout in the July 5 referendum,” reports Reuters.","url":"https://www.breitbart.com/national-security/2015/06/28/eurozone-expecting-greek-default-after-bailout-extension-rejected/"}
