{"authors":[],"date_download":"2018-10-22 22:58:47","date_modify":"2018-10-22 22:58:47","date_publish":"2014-06-11 15:44:17","description":"Taxi drivers sowed traffic chaos in Europe's top cities on Wednesday by mounting one of the biggest ever protests against Uber.","filename":"data/vaneerConsumption/EuropeanTaxiDriversSnarlTrafficWithRalliesOverUbersCarService.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/502276/140611-uber-protest-1122_97c4d2269718d1e8ba2ff69f21170672.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_european-taxi-drivers-snarl-traffic-rallies-over-ubers-car-service-n128476_1540249127.html","title":"European Taxi Drivers Snarl Traffic With Rallies Over Uber's Car Service","title_page":"European Taxi Drivers Snarl Traffic With Rallies Over Uber's Car Service","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTaxi drivers sowed traffic chaos in Europe's top cities on Wednesday by mounting one of the biggest ever protests against Uber, a U.S. car service which allows people to summon rides at the touch of a button.\nDrivers of hundreds of London's black taxis snarled traffic in the streets around Trafalgar Square, hooting their horns as they passed Downing Street, the home of Prime Minister David Cameron, and the Houses of Parliament.\nSign up for top Business news delivered direct to your inbox.\nIn Paris, taxi drivers slowed traffic on major arteries into the city centre during the morning commute. In Berlin hundreds choked the main road to the city's historic centre while commuters juggled buses and trains, or simply walked, to get to work in Madrid and Barcelona.\nSan Francisco-based Uber Technologies Inc., valued last week at $18.2 billion just four years since its 2010 launch, has touched a raw nerve by bringing home the threat of technological advances to one of the world's most visible trades.\n\"This about an all out assault on our profession, our livelihoods,\" said Max Small, a driver of one of London's black taxis for 34 years. \"These big companies are coming in, not playing by the rules.\"\nTaxi drivers across Europe level a variety of charges against Uber: that its applications break local taxi rules; that its drivers fail to comply with local insurance rules; and that it is therefore in breach of licensing and safety regulations.\nUber, backed by investors such as Goldman Sachs and Google, refute all those allegations, a spokeswoman said. Uber said it, its applications and its drivers comply with local regulations.\n\"What you are seeing today is an industry that has not faced competition for decades. Now finally we are seeing competition from companies such as Uber which is bringing choice to customers,\" said Pierre-Dimitri Gore-Coty, Uber Regional General Manager for Europe.\n--- Reuters","url":"https://www.nbcnews.com/business/consumer/european-taxi-drivers-snarl-traffic-rallies-over-ubers-car-service-n128476"}
