{"authors":["Will Martin"],"date_download":"2018-10-30 23:53:35","date_modify":"2018-10-30 23:53:35","date_publish":"2016-12-05 00:00:00","description":"Italy emphatically rejected Prime Minister Matteo Renzi's programme of reforms, and Renzi resigned. Here's how markets have reacted on Monday.","filename":"data/vaneerConsumption/EuropeanmarketsafterItalianreferendumresultDecember5.json","image_url":"https://amp.businessinsider.com/images/58459be3dd089539448b4a31-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-markets-after-italian-referendum-result-december-5-2016-12_1540943615.html","title":"European markets after Italian referendum result, December 5","title_page":"    European markets after Italian referendum result, December 5 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Financial markets in Italy were unsure what to make of the country's emphatic rejection of Matteo Renzi's constitutional reforms in Sunday's referendum, or Renzi's subsequent resignation.\nEquities in the country briefly crashed on Monday morning, before fighting back strongly almost immediately after the start of trade, and then dropping again as the day progressed, before climbing back to the close.\nAt the open, Italy's benchmark stock index, the FTSE MIB fell off a cliff, starting the day's trading lower by around 2.4% as investors react to the political instability caused by Renzi calling time on his premiership.\nAfter the open, shares bounced back sharply, trading 1.4% higher on the day just after 9.00 a.m. GMT. However, the index then dropped by more than 1% once more, before climbing back near to its opening price at the close:\nInvesting.com\nLosses on the day were understandably led by Italy's financial sector, where numerous banks — particularly the world's oldest, Monte dei Paschi di Siena — are under severe pressure thanks to an enormous surfeit of bad loans, and a desperate need to recapitalise.\nMonte dei Paschi, along with Popolare di Vicenza, Veneto Banca, Carige, Banca Etruria, CariChieti, Banca delle Marche, and CariFerrara are all at risk of collapse in the aftermath of the referendum, it was warned last week.\nMonte dei Paschi dropped more than 10% at the open, but pulled back strongly mid-morning, before sliding again, much like the broader FTSE MIB:\nInvesting.com\nAnd here is how Italy's largest lender, and the country's only globally systemically important bank, Unicredit, performed. As the chart show, Unicredit shares fluctuated wildly on the day:\nInvesting.com\n\"The Italian referendum is the major story that will dominate market moves throughout Monday's trading session after Prime Minister Matteo Renzi left his position after a bruising defeat, with 60% of people voting to reject the constitutional changes. The initial market reaction was to the downside, but Renzi's decision to leave so quickly after the result meant that added clarity drove the Euro and European equity markets to the upside,\" James Hughes, the chief market analyst at forex firm GKFX said in an email earlier.\nElsewhere in Europe, equities responded to the referendum result and Renzi's resignation fairly calmly, with Europe's key indexes trading strongly in positive territory. Germany's DAX and France's CAC, as well as the Euro Stoxx 50 broad index gained more than 1%. Here's the scoreboard:\nInvesting.com\nThe relative calm of the markets on Monday reflects the fact that investors had broadly priced in a \"no\" vote and Renzi's subsequent resignation, as polls had largely pointed in that direction in the run-up. Last week, most polls put it about 6 percentage points ahead of the \"yes\" camp.\nElsewhere in Italy's financial markets, Italian bond yields had climbed significantly on the day, with the 10-year yield up around 14 basis points, or 7.5% in mid-afternoon, before tumbling into the close. Yields ended lower by 1 basis point.","url":"https://www.businessinsider.com/european-markets-after-italian-referendum-result-december-5-2016-12"}
