{"authors":["Russ Swan For Mailonline"],"date_download":"2018-10-22 20:01:45","date_modify":"2018-10-22 20:01:45","date_publish":"2016-01-29 00:04:46","description":"An international team of scientists, including those at the University of Giessen, Germany, said their findings reinforce claims global warming is man-made and not part of the normal climatic cycle.","filename":"data/vaneerConsumption/EuropeisthewarmestitsbeensinceRomantimes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACCAA400000578-0-image-a-38_1454005224305.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421362_Europe-warmest-s-Roman-times-Tree-rings-temperatures-highest-2-000-years_1540238505.html","title":"Europe is the warmest it's been since Roman times","title_page":"Europe is the warmest it's been since Roman times | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Study warns we may have underestimated the full extent of extreme events\nThey said findings reinforce claims that global warming is man-made\nEurope is warmer now than it has been at any time over the past 2,000 years, according to new research.\nScientists claim their findings reinforce claims global warming is man-made and not part of the normal climatic cycle.\nAnd they warn we may have underestimated the full extent of possible extreme events in the future, such as heatwaves.\nEurope is warmer now than it has been at any time over the past 2,000 years, according to new research. Most of the continent has experienced strong summer warming over the course of the past several decades, accompanied by severe heatwaves in 2003, 2010 and 2015. London in the summer of 2015 is pictured\nMost of Europe has experienced strong summer warming over the course of the past several decades, accompanied by severe heatwaves in 2003, 2010 and 2015.\nThe new research puts the current warmth in a 2100-year historical context using tree-ring information - a key indicator of past climate.\nThe findings were then combined with historical documents to derive a new European summer temperature reconstruction.\nThe study, published in journal of Environmental Research Letters, shows that over the past 30 years temperatures have risen by more than would have been expected from natural events such as volcanic eruptions and solar activity.\nScientists said their findings reinforce claims global warming is man-made and not part of the normal climatic cycle. A power plant belching out smoke is shown above\nProfessor Jurg Luterbacher, of the University of Giessen, said: 'We now have a detailed picture of how summer temperatures have changed over Europe for more than 2,000 years and we can use that to test the climate models that are used to predict the impacts of future global warming.'\nThe research, by a group of 45 scientists from 13 countries, found warm summers were experienced up to the 3rd century, allowing Romans to grow grapes and make wine in northern Britain.\nThe research found warm summers were experienced up to the 3rd Century, allowing Romans to grow grapes and make wine (stock image)\nThis was followed by generally cooler conditions from the 4th to the 7th centuries.\nA generally warm medieval period was followed by a mostly cold spell from the 14th to the 19th Centuries, known as the Little Ice Age.\nThe pronounced warming early in the 20th century and in recent decades is well captured by the tree-ring data and historical evidence, on which the new reconstruction is based.\nThe evidence suggests that past natural changes in summer temperature are greater than previously thought, indicating that climate models may underestimate the full range of future extreme events, including heatwaves.\nThis past variability has been associated with large volcanic eruptions and changes in the amount of energy received from the sun.\nThe new finding, that temperatures over the past 30 years lie outside the range of these natural variations, supports the conclusions reached by the International Panel on Climate Change (IPCC) that recent warming is mainly caused by the burning of fossil fuels - in other words anthropogenic, or man-made, activity.\nCo-author Danny McCarroll, of the University of Swansea, said: 'We expected temperatures now to be similar to those in Medieval and Roman times, but it is actually warmer. That came as a big surprise.\n'There is nothing else to explain this anomaly than greenhouse gases, in my opinion.\n'Most of the 20th century was similar to warmer periods in the past, because it took time for man's effect on the planet to kick in.\nThe new research puts the current warmth in a 2100-year historical context using tree-ring information - a key indicator of past climate (stock image), The findings were then combined with historical documents to derive a new European summer temperature reconstruction\n'What is means is climate models used by the Met Office underestimate the future extreme heatwaves we may be facing.\n'We have just heard 2015 was the warmest year in Europe on record. Britain was lucky, it largely escaped but other places were unusually hot with many lives being lost.\n'Heatwaves in Britain may become the norm, almost par for the course.'\nProfessor McCarroll said the team mainly analysed the growth of tree rings in the Alps and Scandinavian areas because this is where climate has most effect on them.\nThese were combined with historical records documenting what, on the face of it, would have been mundane data such as tax returns and grain harvests.\nHe added: 'They are the sort of things that would have been retained by bureaucrats, boring information which has come in very handy.'","url":"https://www.dailymail.co.uk/sciencetech/article-3421362/Europe-warmest-s-Roman-times-Tree-rings-temperatures-highest-2-000-years.html"}
