{"authors":["Will Martin"],"date_download":"2018-10-30 23:10:44","date_modify":"2018-10-30 23:10:44","date_publish":"2016-12-08 00:00:00","description":"The ECB will now extend QE until at least December 2017.","filename":"data/vaneerConsumption/EuropricemovementsonDecember8.json","image_url":"https://amp.businessinsider.com/images/5849913bdd089519558b4598-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_euro-price-movements-on-december-8-2016-12_1540941044.html","title":"Euro price movements on December 8","title_page":"    Euro price movements on December 8 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Attac anti-globalisation activists demonstrate in front the euro sculpture in front of the European Central Bank (ECB) headquarters in Frankfurt, September 24, 2009. REUTERS/Johannes Eisele The euro dived and stocks surged on Thursday, after the European Central Bank announced a six-month extension to its quantitative easing programme.\nThe bank said that it will keep buying up eurozone corporate and government debt until at least December 2017.\nAt its latest monetary policy meeting, the bank's governing council said that from April 2017 — the month after its quantitative easing programme was scheduled to end — it will buy up to €60 billion of assets per month, €20 billion less than its current programme.\nHere's how that impacted the markets.\nThe euro\nAs a result of the move, the euro slipped more than 1.3%, having very briefly spiked higher as the decisions were announced at 12.45 p.m. GMT (7.45 a.m. ET). The currency dropped significantly as ECB President Mario Draghi started his post-announcement press conference, and remained substantially lower throughout the afternoon, as Draghi made it very clear that the ECB plans to keep QE going for the foreseeable future.\nHere's how it looks around 4.40 p.m. GMT (11.40 a.m. ET):\nMarkets Insider\nThe euro's movements in recent weeks have been unpredictable. The single currency slumped more than 1% after former Italian Prime Minister Matteo Renzi announced his resignation following his crushing defeat in the country's constitutional reform referendum.\nThat was expected, but the rapid recovery of the currency, which actually closed higher the day after the vote, was not.\nSociete Generale said in November that it expects the euro to hit parity against the dollar for the first time in almost 15 years at the start of 2017 as political uncertainty in the single currency area begins to crystallise.\nParity between the euro and the dollar will be driven by two big catalysts: European politics, and a strengthening dollar following the expected rate hike by the US Federal Reserve in December.\nStock markets\nEuropean stock markets took great comfort from the decision, charging during afternoon trade on the prospect of a reduction in the scope of QE. Major indexes in the eurozone were largely up 1% or higher, with Germany's DAX up 1.8%, Spain's IBEX 2.11% higher, and Italy's FTSE MIB 1.55% in the green.\nHere's the scoreboard at the close:\nInvesting.com\nBonds\nThe asset class that will be most directly affected by the extension and shrinking of QE, bonds have seen yields rise on the ECB's decision. Yields took off soon after the announcement, with the Italian 10-year yield running up by as much as 15 basis points to 2.03%. It is has since calmed down and is pretty much flat on the day.\nThe story is broadly similar across the board. Yields jumped after the announcement, but then fell a little. Here's how Europe's benchmark government debt vessel, the German 10-year, looks:","url":"https://www.businessinsider.com/euro-price-movements-on-december-8-2016-12"}
