{"authors":["Associated Press"],"date_download":"2018-10-23 04:34:56","date_modify":"2018-10-23 04:34:56","date_publish":"2016-01-11 17:40:48","description":"BRUSSELS (AP) — As the EU struggles to manage its biggest refugee emergency since World War II, national governments have pledged to ensure that people who a...","filename":"data/vaneerConsumption/Europesmigrantsafterharrowingjourneysthelongwait.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394201_Europes-migrants-harrowing-journeys-long-wait_1540269296.html","title":"Europe's migrants; after harrowing journeys, the long wait","title_page":"Europe's migrants; after harrowing journeys, the long wait | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Europe's migrants; after harrowing journeys, the long wait\nBRUSSELS (AP) — As the EU struggles to manage its biggest refugee emergency since World War II, national governments have pledged to ensure that people who are not fleeing conflict and not entitled to stay will be rapidly sent home.\nBut it's not happening, and it's not a new problem. Less than 40 percent of people ordered deported in 2014 have been sent home.\nBeyond that, the European Union's refugee-sharing initiative is barely working, meaning that people face a long wait in uncomfortable circumstances to know their fate.\n___\nWHY?\nMost people arrive in Greece or Italy. Eleven teams of experts sent to register, fingerprint and interview people to decide whether they qualify to remain in Europe were meant to be up and running in the two countries months ago. Only three are operational.\nSince September and up to Jan. 7, a total of 836 people were returned from 14 European countries. Some 272 people were deemed to need protection and were taken from Greece and Italy to new residences elsewhere in Europe, according to EU figures.\nIn the past, deportations were poorly organized and rights groups protested, notably over deportations to Afghanistan. The EU's border agency Frontex was recently given a brief to coordinate the returns.\n___\nWHERE ARE THESE PEOPLE BEING SENT?\nItaly has organized flights taking would-be migrants back to Egypt and Tunisia, a total of 153 people from September to Jan. 7, as well as separate flights with other nations returning people to Nigeria. Greece has deported dozens to Pakistan. Almost half the people sent home from the combined EU went to Albania and Kosovo. Armenia and Georgia are the other destinations.\n___\nWHAT HAPPENS TO ALL THE OTHERS WAITING?\nIndividual nations are responsible for lodging the migrants. Processing times vary. In recent years, the average time across the EU for deciding whether someone is eligible for asylum has been about six to eight months. In Italy, some people have reported waiting two years.\nReception facilities in Italy and Greece are overwhelmed. People judged to be staying in Europe illegally and due to be sent home are supposed to be held in separate facilities. Children traveling without adults must also be lodged in special premises, but often this doesn't happen.\n___\nWHO'S ALLOWED TO STAY?\nPeople whose lives and safety are at risk in their home countries or face persecution can qualify for asylum or some other form of international protection. Those who come for purely economic reasons are not allowed to stay. The EU's refugee-sharing initiative, known as emergency relocation, often applies mainly to Syrians, Eritreans, Iraqis or Afghans.","url":"https://www.dailymail.co.uk/wires/ap/article-3394201/Europes-migrants-harrowing-journeys-long-wait.html"}
