{"authors":["Will Martin"],"date_download":"2018-10-30 23:24:55","date_modify":"2018-10-30 23:24:55","date_publish":"2018-07-19 00:00:00","description":"\"If the US would impose these car tariffs, that would be very unfortunate, but we are preparing together with our member states a list of rebalancing measures as well,\" the European Union's trade chief, Cecilia Malmstrom, said on Thursday.","filename":"data/vaneerConsumption/EUthreatensimmediateretaliationagainstanyTrumpautotariffs.json","image_url":"https://amp.businessinsider.com/images/5b50764c776f7f1b008b477c-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trade-war-europe-trump-eu-retaliation-auto-tariffs-2018-7_1540941895.html","title":"EU threatens immediate retaliation against any Trump auto tariffs","title_page":"    EU threatens immediate retaliation against any Trump auto tariffs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump and the European Commission’s president, Jean-Claude Juncker. Reuters; Reuters\nEuropean Union officials are preparing for the worst ahead of talks with the US about the future of trade.\nPresident Donald Trump and his administration are considering tariffs of as much as 20% on US automobile imports from Europe. EU officials are readying a list of retaliatory tariffs to be applied should the two sides fail to reach an agreement.\nSenior EU officials, including the European Commission's president, Jean-Claude Juncker, are set to fly to Washington, DC, next week with the aim of persuading Trump not to levy punitive tariffs on European automobiles. The EU is preparing to hit back, however, if he cannot be persuaded.\n\"The aim of President Juncker's visit is to try to establish a good relation, try to see how we can de-escalate the situation and avoid it from going further and see if there is a forum where we can discuss these issues,\" Cecilia Malmstrom, the EU's trade chief, said at a press conference on Thursday.\n\"If the US would impose these car tariffs, that would be very unfortunate, but we are preparing together with our member states a list of rebalancing measures as well,\" she added.\nAccording to an EU source cited by Bloomberg, any retaliatory tariffs would be ready immediately.\nBloomberg also reported that Juncker would put two separate plans on the negotiating table that would be intended to stop any further escalation in the trade conflict.\nThe first plan is a so-called plurilateral deal, whereby tariffs on autos and auto parts would be reduced by all major auto-exporting countries. Second, according to Bloomberg, Juncker will propose a \"limited\" free-trade agreement between the EU and the US.\nTrump mulls auto tariffs\nThe US Commerce Department is investigating auto imports, and Trump has previously threatened large tariffs on imported cars. Earlier this week, Trump said he was ready to impose a \"tremendous retribution\" against the EU.\n\"We said if we don't negotiate something fair, then we have tremendous retribution, which we don't want to use, but we have tremendous powers,\" Trump said in a Cabinet meeting.\n\"Including cars — cars is the big one,\" he added. \"And you know what we're talking about with respect to cars and tariffs on cars.\"\nMany European automakers, including BMW and Mercedes, already have production plants in the US. Mercedes employs 4,000 people at its production plant in Alabama, while BMW's plant in Spartanburg, South Carolina, makes close to 2,000 cars a day.\nTrump, however, wants more production in the US, saying in a June tweet that companies should \"build them here!\"\nAlmost every major auto manufacturer, from foreign companies like Hyundai to American brands like GM and Ford, has submitted comments to the Commerce Department warning about the possible effect of tariffs on US auto workers and consumers.","url":"https://www.businessinsider.com/trade-war-europe-trump-eu-retaliation-auto-tariffs-2018-7"}
