{"authors":[],"date_download":"2018-10-22 20:57:51","date_modify":"2018-10-22 20:57:51","date_publish":"2014-05-05 13:45:48","description":"Actress and political activist Eva Longoria announced an ambitious national effort to significantly boost the number of Latinos in political office.","filename":"data/vaneerConsumption/EvaLongoriaLaunchesLatinoVictoryProjectLatinoPAC.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/421111/140505-eva-longoria-victory-02_c1b69abf56f6c17b82b16242b212f736.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_eva-longoria-launches-latino-victory-project-latino-pac-n97181_1540241871.html","title":"Eva Longoria Launches Latino Victory Project, Latino PAC","title_page":"Eva Longoria Launches Latino Victory Project, Latino PAC  ","title_rss":"NULL","source_domain":"nbcnews.com","text":"The announcement was made with a backdrop of banners printed with faces of Latinos, as well as statistics of Hispanics and politics. There are only 28 members of the House of Representatives who are Latino (of those only 9 are Latinas) and there are only three Cuban-American senators.\nIn the 2012 elections, 11 million Hispanics voted, but at the same time, over 12 million eligible Latinos did not vote. In 2014, the worry is that Latino political participation will be even lower than it usually is in the midterms.\nThe group announced the formation of the Latino Victory PAC (political action committee), aimed at raising money and resources for Latino candidates. At the event the group announced its endorsement of seven federal and state level Hispanic candidates.\nOne of them was Lucy Flores, a Democratic candidate for lieutenant governor in Nevada. Flores told NBC this high-profile support will make a difference. \"In the past resources have not been there,\" said Flores. She said the PAC would give candidates like her visibility in the 2014 race.\nLeticia Van de Putte is a candidate for lieutenant governor on the ballot with Democratic gubernatorial candidate Wendy Davis in the high-stakes, high-profile Texas governor's race. Van de Putte told NBC that while there might be unresolved national issues when it comes to immigration, her hope was that voters would see the importance of voting in state and local elections where much of the state's laws and policies are determined.\nOther candidates which were singled out for support included Rhode Island Democratic gubernatorial candidate Angel Taveras, who is currently mayor of Providence and Amanda Renteria, a Democrat running for Congress in California's Central Valley.\nLongoria and Muñoz, along with Puerto Rican attorney Andrés López, were the trio behind the largest Latino fundraising group for the 2012 elections, The Futuro Fund, which bundled millions of dollars in Latino contributions for President Obama's re-election. Longoria was also one of the co-chairs of Obama's re-election campaign and Muñoz was named national finance chair for the Democratic National Committee.\nLending visibility, financial resources and support to Latino political candidates is just one of the group's initiatives. Another one is building Latino empowerment through educational and professional attainment.\nCristóbal Alex, the Latino Victory Project's president, said one of the group's goals was to reach 100,000 \"firsts\" - the first Latinos in their families to reach educational and professional milestones.\nAs Eva Longoria said, the aim is to build \"Latino currency.\"","url":"https://www.nbcnews.com/news/latino/eva-longoria-launches-latino-victory-project-latino-pac-n97181"}
