{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 23:00:21","date_modify":"2018-10-22 23:00:21","date_publish":"2017-03-16 05:16:20","description":"The Desperate Housewives star took to Snapchat and shared several photos and videos of her special day which began with a family trip to Disneyland in Anaheim, California.","filename":"data/vaneerConsumption/EvaLongoriasurprisedwithmariachibandforherbirthday.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51D88400000578-0-image-a-38_1489640274036.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318806_Eva-Longoria-surprised-mariachi-band-birthday_1540249221.html","title":"Eva Longoria surprised with mariachi band for her birthday","title_page":"Eva Longoria surprised with mariachi band for her birthday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She celebrated her first birthday as the wife of Televisa president, José Antonio Bastón on Wednesday.\nSo Eva Longoria was treated to a special surprise from her husband of nearly 10 months with a mariachi band as she turned 42.\nThe Desperate Housewives star took to Snapchat and shared several photos and videos of her special day which began with a family trip to Disneyland in Anaheim, California.\nScroll down for video\n'I'm crying!': Eva Longoria was treated to a special surprise from her husband, José Antonio Bastón, with a mariachi band as she turned 42\n'It's my birthday today so I'm taking the family to Disney and the madness has already started. Jesus Christ, getting people in the car...,' she began.\nEva spoke directly into the camera and joked to followers before the amusement park outing had even begun, saying, 'We've got two car loads of Disney fun.'\nWhile strolling through the Happiest Place On Earth, the brunette beauty played with several of the popular social media mobile app filters.\n'My husband just surprised me!': She was overcome with emotion at her gift from the Televisa president\nPlaytime: The Desperate Housewives star took to Snapchat and shared several photos and videos of her special day which began with a family trip to Disneyland in Anaheim, California\nThe former Telenovela actress even got her very own personalized Snapchat filter in honor of her special day.\nHer animated figure was dressed in a skintight red mini dress with matching stilettos.\n'Going on It's A Small World, now the song's going to be in my head the whole day,' she humorously griped in a high-pitched voice changing filter.\nRocking birthday bash: Eva seemed to be having a ball at Disneyland posing for fun pictures\nSocial media savvy: While strolling through the Happiest Place On Earth, the brunette beauty played with several of the popular social media mobile app filters\nRed hot! The former Telenovela actress even got her very own personalized Snapchat filter in honor of her special day\nAfter meeting Mickey Mouse, the Texas-born stunner was content with returning home where she was greeted with countless bouquets of stunning flowers.\nEva lined them up and boasted to fans who sent each, 'These are from Mario [Lopez] and Courtney, these are from my writers, these are from Victoria [Beckham].'\n'Of course my husband sent the biggest ones,' she gushed.\n'My husband sent the biggest ones': The Golden Globe nominee then returned home where she was greeted with countless bouquets of stunning flowers\nShe's loved! The Texas-born beauty lined up the bountiful bouquets and read aloud who sent each including Victoria Beckham, Mario Lopez and his wife Courtney Mazza, and George Lopez\nTasty treat: Eva was treated to homemade birthday cakes as she blew out the candles with the help of kids in her family\nAfter blowing out the candles on her cake, Eva was brought to tears as the mariachi band played in her backyard.\nThe Golden Globe nominee and Bastón got engaged in December 2015 while on holiday in Dubai.\nThey had been dating since 2013 and tied the knot in front of their closest family and friends in Valle De Bravo, Mexico on May 21, 2016.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318806/Eva-Longoria-surprised-mariachi-band-birthday.html"}
