{"authors":["Naomi Ackerman For Mailonline","Sarah Jones For Dailymail.Com"],"date_download":"2018-10-23 01:32:15","date_modify":"2018-10-23 01:32:15","date_publish":"2017-03-16 11:34:02","description":"Eva Longoria, 42, chose to celebrate her birthday like thousands of others by heading to Disneyland in Anaheim, California, with her family on Wednesday.","filename":"data/vaneerConsumption/EvaLongoriadressesdownforherDisneylandbirthdaytrip.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5350D300000578-0-image-a-17_1489659730936.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319486_Eva-Longoria-dresses-Disneyland-birthday-trip_1540258335.html","title":"Eva Longoria dresses down for her Disneyland birthday trip","title_page":"Eva Longoria dresses down for her Disneyland birthday trip | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is a Golden Globe-nominated actress who jet sets around the world.\nBut Eva Longoria, 42, chose to celebrate her birthday like thousands of others by heading to Disneyland in Anaheim, California, with her family on Wednesday.\nAfter embracing her inner child by meeting with Mickey Mouse, The Desperate Housewives star's husband José Antonio Bastón laid on a mariachi band to surprise her.\nScroll down for video\nBirthday girl! Eva Longoria, 42, chose to celebrate her birthday like thousands of others by heading to Disneyland in Anaheim, California, with her family on Wednesday\nEva looked stunning in a simple shorts and T-shirt combo for her special day, flaunting her tanned arms and legs.\nThe star opted for a white theme for the day and also sported a fedora and accessorised with a gold-chained clutch.\nIn her usual age-defying fashion, Eva looked youthful and excited as she enjoyed rides at the theme park with her young companions.\nThe group enjoyed the 'It's a Small World' water rafting ride, though did not seem completely absorbed as she pulled out her phone to take a call mid-ride.\nAmazing day: After having fun with Mickey Mouse, The Desperate Housewives star was treated to a special surprise from her husband of nearly ten months with a mariachi band\nRelaxed: Eva and her family enjoyed the 'It's a Small World' water rafting ride, though did not seem completely absorbed as she pulled out her phone to take a call mid-ride\nIt is the first birthday the prolific actress has celebrated with her Televisa president husband, José since they've been married.\nAnd the star took to Snapchat to live share her special day with millions of fans.\n'It's my birthday today so I'm taking the family to Disney and the madness has already started. Jesus Christ, getting people in the car...,' she began.\nEva spoke directly into the camera before the amusement park outing had even begun, saying, 'We've got two car loads of Disney fun.'\nWhile strolling through the Happiest Place On Earth, the brunette beauty played with several of the popular social media mobile app filters.\n'I'm crying!': Eva Longoria was treated to a special surprise from her husband, José Antonio Bastón, with a mariachi band as she turned 42\n'My husband just surprised me!': She was overcome with emotion at her gift from the Televisa president\nPlaytime: The Desperate Housewives star took to Snapchat and shared several photos and videos of her special day which began with a family trip to Disneyland in Anaheim, California\nThe former Telenovela actress even got her very own personalized Snapchat filter in honour of her special day.\nHer animated figure was dressed in a skintight red mini dress with matching stilettos.\n'Going on It's A Small World, now the song's going to be in my head the whole day,' she humorously quipped in a high-pitched voice changing filter.\nSocial media savvy: While strolling through the Happiest Place On Earth, the brunette beauty played with several of the popular social media mobile app filters\nRed hot! The former Telenovela actress even got her very own personalized Snapchat filter in honor of her special day\nAfter meeting Mickey Mouse, the Texas-born stunner was content with returning home where she was greeted with countless bouquets of stunning flowers.\nEva lined them up and explained to fans who sent each, 'These are from Mario [Lopez] and Courtney, these are from my writers, these are from Victoria [Beckham].'\n'Of course my husband sent the biggest ones,' she gushed.\n'My husband sent the biggest ones': The Golden Globe nominee then returned home where she was greeted with countless bouquets of stunning flowers\nShe's loved! The Texas-born beauty lined up the bountiful bouquets and read aloud who sent each including Victoria Beckham, Mario Lopez and his wife Courtney Mazza, and George Lopez\nAfter blowing out the candles on her cake, Eva was brought to tears as the mariachi band played in her backyard.\nThe Golden Globe nominee and Bastón got engaged in December 2015 while on holiday in Dubai.\nThey had been dating since 2013 and tied the knot in front of their closest family and friends in Valle De Bravo, Mexico on May 21, 2016.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319486/Eva-Longoria-dresses-Disneyland-birthday-trip.html"}
