{"authors":["Emily Mae Czachor"],"date_download":"2018-10-31 01:38:41","date_modify":"2018-10-31 01:38:41","date_publish":"2018-08-28 23:16:18","description":"Remember when Tate Langdon put on a head-to-toe latex body suit and proceeded to wreak havoc on the likes of the unsuspecting Harmon family, via a truly nightmarish set of means? Well, Evan Peters is reprising his Murder House character on American…","filename":"data/vaneerConsumption/EvanPetersReturnsAsTateLangdonInASpookyNewAmericanHorrorStoryApocalypsePhoto.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/d391653a-58ab-4c32-af54-9d849a4eeb8a-getty-959679678.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_evan-peters-returns-as-tate-langdon-in-a-spooky-new-american-horror-story-apocalypse-photo-10921320_1540949921.html","title":"Evan Peters Returns As Tate Langdon In A Spooky New 'American Horror Story: Apocalypse' Photo","title_page":"Evan Peters Returns As Tate Langdon In A Spooky New  'American Horror Story: Apocalypse' Photo","title_rss":"NULL","source_domain":"bustle.com","text":"Remember when Tate Langdon put on a head-to-toe latex body suit and proceeded to wreak havoc on the likes of the unsuspecting Harmon family, via a truly nightmarish set of means? Well, Evan Peters is reprising his Murder House character on American Horror Story: Apocalypse, according to Entertainment Weekly. So perhaps fans can expect some closure (or maybe just a lot more havoc) on the whole Tate debacle when AHS returns for Season 8. At least, it sure looks that way.\nOn August 28, AHS creator Ryan Murphy posted two back-to-back photo teasers on Instagram ahead of Apocalypse's upcoming debut. (That's Wednesday, Sept. 12, for those who've yet to clear their schedules.) The first picture features a truly searing shot of Emma Roberts' Coven character in all her witchy-chic glory, standing \"amongst the backyard bones\" of Season 1's Murder House set.\nIt was pretty exciting to catch a glimpse of Roberts' revamped Madison Montgomery character on social media, especially after all these years. But it was Murphy's follow-up post several hours later that's sparked some serious hubbub among AHS fans on the internet. Captioning what looks like a candid snapshot of Peters posing gleefully on the Murder House set, Murphy didn't beat around the bush.\n\"Tate. Happy to be home,\" he wrote, ushering in a fierce wave of celebration from fans who've been waiting on the return of Peters' infamous Murder House character ever since he fathered the \"Anti-Christ\" — in perhaps the most horrendous way possible — and set in motion the eventual fall of all mankind way back in Season 1. Still, the sweet-talking ghost teenager (whose corporeal life ended with a high school shooting) somehow managed to win over the hearts of some AHS fans. So it makes sense, especially given the parameters of the show's upcoming season, that Peters' Tate is finally slated to make his creepy AHS comeback.\nThose who've been following the recent rollout of Apocalypse-related tidbits in the news might know already that the upcoming season will rely on some old haunts, reimagined in a new-ish setting. Bottom line? Apocalypse is basically the Murder House-Coven crossover of most every AHS fan's wildest nightmares. The new season will see the return of several familiar faces from the show's Murder House days, including Jessica Lange's Constance Langdon, as well as the Harmon trio (played by Connie Britton, Dylan McDermott, and Taissa Farmiga) who are, unsurprisingly, still kicking from beyond the grave.\nAccording to The Hollywood Reporter, Farmiga is actually set to reprise both her Murder House and Coven roles when the series returns for an eighth season. Sarah Paulson will juggle both her Murder House and Coven roles in Apocalypse, too, as well as a new character named \"Venable\" that fans haven't met before.\nAt this point, it's still a little unclear whether Peters will appear in multiple roles when AHS returns for Apocalypse later this month. Those who watched Coven will probably have a tough time forgetting Peters as Kyle Spencer, the frat-star-turned-zombie who won over the affections of both Roberts' and Farmiga's respective characters during their stay at Miss Robichaux's witch academy. Does that mean fans can expect to see Kyle again come Season 8? Nothing's been confirmed, but the possibility doesn't seem totally off the table.\nThat being said, it sounds like Peters might actually be taking on an entirely new character, in addition to reprising the role of Tate. During an AHS pre-Emmy voting event back in April, Murphy told Deadline that Peters would play a \"comedic hairstylist\" in Apocalypse. \"The funny thing is, we shot Cult and it was very taxing on Evan,\" Murphy told the outlet, adding that Peters expressed this to him pretty directly last November, right around the time Cult finished up its on-air run.\n\"Around Thanksgiving, I was talking to Evan and he said, 'You know this show is so hard. It's so difficult to do,'\" Murphy told Deadline. So, in a presumable effort to ease up on the actor, Murphy told him, \"Your part this year is a comedic part. You are comedic and you play a hairstylist.\"\nIt doesn't take a ghost-whisperer to know that Tate might be the furthest thing from a \"comedic part\" as an actor can get. That said, if Murphy's latest post really was confirmation that Tate will have a place in the AHS: Apocalypse lineup, then let's hope Peters' \"comedic hairstylist\" character makes a few cameos in the new season, too. You know, to balance out all the ghostly doom.","url":"https://www.bustle.com/p/evan-peters-returns-as-tate-langdon-in-a-spooky-new-american-horror-story-apocalypse-photo-10921320"}
