{"authors":["Liam Blackburn","Press Association"],"date_download":"2018-10-23 04:45:41","date_modify":"2018-10-23 04:45:41","date_publish":"2017-03-10 14:53:34","description":"Corry Evans has been included in a Northern Ireland squad that has also been boosted by Craig Cathcart's return for the home World Cup qualifier with Norway later this month.","filename":"data/vaneerConsumption/EvansandCathcartnamedinNorthernIrelandsquad.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3595B46700000578-0-image-a-42_1489157477283.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301496_Evans-Cathcart-named-Northern-Ireland-squad_1540269941.html","title":"Evans and Cathcart named in Northern Ireland squad","title_page":"Evans and Cathcart named in Northern Ireland squad | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Corry Evans has been included in a Northern Ireland squad that has also been boosted by Craig Cathcart's return for the home World Cup qualifier with Norway later this month.\nMidfielder Evans has not played in over two months with his ongoing groin issue but his club Blackburn are fine with his selection.\nWatford defender Cathcart is available for the first time since the summer's European Championships having battled his own injury problems.\nCraig Cathcart (centre) has returned from injury to be picked in Northern Ireland's squad\nCorry Evans (right) is also back, despite having not played for two months with a groin issue\nShane Ferguson's suspension has opened the door for Oldham's Ryan McLaughlin to earn a recall but there is no place for Wigan striker Will Grigg, who has a knee problem.\nMichael O'Neill's men will look to strengthen their hold on second place in Group C when the Norwegians visit Windsor Park on March 26.\nNorthern Ireland have not played a game since November 15, when they were beaten 3-0 by Croatia in a friendly.\nPrior to that, 4-0 victories over Azerbaijan and San Marino sandwiched a slender defeat by world champions Germany in qualification Group C.\nCathcart celebrates after scoring for Northern Ireland in a friendly against Wales last year","url":"https://www.dailymail.co.uk/sport/football/article-4301496/Evans-Cathcart-named-Northern-Ireland-squad.html"}
