{"authors":["Greg Ferenstein"],"date_download":"2018-10-30 21:11:20","date_modify":"2018-10-30 21:11:20","date_publish":"2015-12-03 12:30:22","description":"Even Paul Krugman dedicated an entire column to highlighting the role of housing restrictions and inequality.","filename":"data/vaneerConsumption/EvenPaulKrugmanSaysInequalityRelatedtoHousingRegulation.json","image_url":"https://media.breitbart.com/media/2015/08/Paul-Krugman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_12_03__1540933880.html","title":"Even Paul Krugman Says Inequality Related to Housing Regulation","title_page":"Even Paul Krugman Says Inequality Related to Housing Regulation","title_rss":"NULL","source_domain":"breitbart.com","text":"(Ferenstein Wire) Silicon Valley and countless cities around the country are facing a housing crisis. A recent analysis from an MIT researcher suggests that soaring cost of rent is the primary cause of growing income inequality over the last half-century.\nTo fix the problem, there is a growing bipartisan movement against the principal culprit of the rising rents: government regulations that restrict construction.\nIndeed, even New York Times economic columnist Paul Krugman–an unabashed supporter of government intervention into the market–dedicated an entire column to highlighting the role of housing restrictions and inequality.\n“In this age of gentrification, housing policy has become much more important than most people realize,” he wrote.\n“National housing prices have risen much faster than construction costs since the 1990s, and land-use restrictions are the most likely culprit. Yes, this is an issue on which you don’t have to be a conservative to believe that we have too much regulation,” Krugman argued, noting a recent economic report from the White House arguing essentially the same point.\nIn both San Francisco Bay Area and New York, anti-construction hawks have placed severe restrictions on construction. Google’s attempts to build more housing for its growing workforce have been routinely rejected by local governments over the years.\nTo be sure, not every city has experienced the same housing crisis. Berkeley Economist Enrico Moretti credits Seattle’s relatively shallow rent increase to the city’s construction boom.\nAs housing reaches a crisis point, it appears folks from all political sides will be taking aim at regulation hawks.\n*For more stories like this, subscribe to the Ferenstein Wire newsletter here.","url":"https://www.breitbart.com/the-media/2015/12/03/even-paul-krugman-says-inequality-related-housing-regulation/"}
