{"authors":[],"date_download":"2018-10-30 19:34:22","date_modify":"2018-10-30 19:34:22","date_publish":"2018-08-21 17:15:00","description":"2018 AJC Decatur Book Festival: Events for kids and teens Aug. 31-Sept. 2, 2018. Locations include Children’s Stage at the Decatur Recreation Center, Young Adult Stage at the Decatur Recreation Center Studio, Sycamore Family Stage","filename":"data/vaneerConsumption/Eventsforchildrenandyoungadults.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/03/07/Videos/4341734.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_books--litera_988c95e7bfffc93de29f9ef5f71d1552__1540928062.html","title":"Events for children and young adults","title_page":"2018 AJC Decatur Book Festival: Events for  children and young adults","title_rss":"NULL","source_domain":"ajc.com","text":"Held every Labor Day weekend, the AJC Decatur Book Festival celebrates the written word with three days of readings, panels, parades, music — and much, much more. This year, several events will celebrate the 20th anniversary of the U.S. publication of “Harry Potter and the Sorcerer’s Stone.”\nAmong the activities each year at the AJC Decatur Book Festival is the parade, which has featured children’s author and Grand Marshal Carmen Agra Deedy, left. BRANDEN CAMP/SPECIAL\nBut this family-friendly festival, filled with back-to-back events, activities and live performances for kids of all ages, will explore a wide range of themes — everything from magic and slam poetry to immigration, Peter Pan and modern-day mythological heroes. All events are free.\nHere’s a sampling of reading-inspired events centered on or near the square in downtown Decatur Aug. 31-Sept. 2. These stages are all only a few minutes’ walk, at most, from one another. Locations include the Children’s Stage, the Young Adult Stage and the Sycamore Family Stage -- all on Sycamore Street.\nFor a full lineup, go to the festival’s website at decaturbookfestival.com.\nKidnote Address: A Celebration of ‘Harry Potter and the Sorcerer’s Stone’\nTo celebrate the 20th anniversary of the the publication of “Harry Potter and the Sorcerer’s Stone,” this year’s Kidnote event will feature a group of popular middle-grade and YA authors, including Becky Albertalli, Tony DiTerlizzi, Adam Gidwitz, Laurel Snyder and Nic Stone. They will talk about how the “Sorcerer’s Stone” changed the literary landscape for readers — and writers. To add to the magic, there will be Harry Potter trivia, a costume contest and other mischief. 5-7 p.m. Friday, Aug. 31, Agnes Scott College’s Presser Hall, 141 E College Ave., Decatur. (Please note, this event is free but a ticket is required. For tickets, go to decaturbookfestival.com.)\nActivities such as the AJC Decatur Book Festival help make the neighborhood attractive to new homeowners. (Jonathan Phillips/Special/For the AJC)\nThe following events are on Saturday, Sept. 1:\n‘Let It Shine’ parade\nThis year’s parade theme is “Let It Shine!” Children’s book author Angela DiTerlizzi will lead the parade to the Children’s Stage at the Decatur Recreation Center to celebrate her newest book, “Just Add Glitter!” Line up beginning at 9:30 a.m. at the Community Bandstand on the Decatur Square. Parade begins at 9:45 a.m.\nMusical selections from the Alliance Theatre’s Theatre for the Very Young production of ‘Beautiful Blackbird’\nInspired by the award-winning Ashley Bryan picture book, this rhythmic play explores the universal idea that true beauty is found within. Adapted from a Zambian folk tale, this story traces Blackbird’s courageous journey to share his truth that “color on the outside is not what’s on the inside.” Featuring an original jazzy score and inventive creative movement, “Beautiful Blackbird” brings Bryan’s inspired artwork to life. 11:30 a.m., Sycamore Family Stage.\nRELATED: Read about the High Museum’s 2017 Ashley Bryan exhibit\nA woman reads a book at the 12th Annual AJC Decatur Book Festival last year. CONTRIBUTED BY BRANDEN CAMP\n‘Dreamers’\nCelebrated illustrator Yuyi Morales, who was born in Yelapa, Mexico, and currently resides there, shares her own immigration story in her beautiful picture book, “Dreamers.” 1 p.m., Children’s Stage at the Decatur Recreation Center.\nTeens Talk Activism\nJoin Core Dance founder and Artistic Director Sue Schroeder and members of Writeous Poets, from Little Rock, Ark., as they discuss spoken word poetry and dance as a form of activism. This session will include short performances by the poets. 4:15 p.m., Young Adult Stage at the Decatur Recreation Center Studio.\n‘Magic or Not?’\nNational Book Award winner Jeanne Birdsall (the Penderwick series) and Newbery Honor Winner Adam Gidwitz (“The Unicorn Rescue Society” series) will discuss, and maybe even argue about, whether you need magic to make books magical. They’ll also share jokes and perhaps even tell a story or two. 4:45 p.m., Children’s Stage at the Decatur Recreation Center.\n‘Green Card Youth Voices’\nGreen Card Voices aspires to build a bridge between immigrants, non-immigrants, and advocates from across the country by sharing the firsthand immigration stories of foreign-born Americans, by helping us see the “wave of immigrants” as individuals, with stories of family, hard work and cultural diversity. Students from Burma, Nepal and Mexico will share their personal stories about immigrating to the United States. It’s tied to a new book, “Green Card Youth Voices: Immigration Stories From Atlanta High School.” 1:45 p.m., Young Adult Stage at the Decatur Recreation Center Studio.\nChildren color at the 12th Annual AJC Decatur Book Festival last year. CONTRIBUTED BY BRANDEN CAMP\nThe following events are on Sunday, Sept. 2\n‘Calling All Jedis!’ parade\nCalling all Jedis! The Force is with you on Sunday as you march to the Children’s Stage led by Adam Rex, creator of the new picture book “Are You Scared, Darth Vader?” Line up beginning at 11:30 a.m. at the community bandstand on the Decatur Square. The parade begins at 11:45 a.m. and heads to the Children’s Stage at the Decatur Recreation Center.\nHighlights from ‘Peter Pan’ with Serenbe Playhouse\nEnjoy some highlights of this soaring and fun show, which runs through Aug. 26 at Serenbe Playhouse. In nine seasons, Serenbe Playhouse has achieved a stellar track record as a producer of work for children and families. This delightful musical comedy is no exception. 1 p.m., Sycamore Family Stage.\n‘Mythbusters!’\nWriters Jennifer Cervantes and Roshani Chokshi show that Percy Jackson isn’t the only modern-day mythological hero. Just ask their characters — Aru Shah and Zane, kids straight out of Hindu and Mayan legend. 2:15 p.m., Children’s Stage at Decatur Recreation Center.\n‘The Power of Poetry’\nPoets Elizabeth Acevedo and Eve Ewing discuss the art and science of slam poetry and how it can turn into amazing fiction. 2:30 p.m., Young Adult Stage at the Decatur Recreation Center Studio.\n‘Illegal: Exploring the Plight of Undocumented Immigrants in Graphic Lit’\nBest-selling author Eoin Colfer, and co-author Andrew Donkin, present their timely graphic novel that delves beneath the headlines to tell the story of what it means to flee your home. 4:30 p.m., Children’s Stage at Decatur Recreation Center.\nYoung Adult Truth or Dare\nWhat will it be? Truth? Or Dare? Favorite YA authors Becky Albertalli, David Arnold, Nic Stone, Angie Thomas and Julian Winters are this year’s contestants. Or victims? 5 p.m., Young Adult Stage at the Decatur Recreation Center Studio.\n“Harry Potter and the Sorcerer’s Stone” is the first book in the Harry Potter series by J.K. Rowling. It was published 20 years ago, on June 26, 1997, in the U.K. (as “Harry Potter and the Philosopher’s Stone”) and the following year in the United States. (American-Statesman Staff)\nHarry and the Potters\nAs a bookend to the weekend’s celebration of the “Sorcerer’s Stone,” the popular Wizard Rock group, “Harry and the Potters,” will close out the festival Sunday with a performance on the Children’s Stage. In 2002, brothers Paul and Joe DeGeorge formed Harry and the Potters, a Wizard Rock band. Since then, they have performed all over the world, and were featured in the 2008 documentary “We Are Wizards.” 6:30-8 p.m., Children’s Stage at Decatur Recreation Center.\nEVENT PREVIEW\nAJC Decatur Book Festival. Aug. 31-Sept. 2. Free. Various venues. decaturbookfestival.com.\nKeynote: Kenny Leon. 8 p.m. Aug. 31. Sold out. Schwartz Center at Emory University, 1700 N. Decatur Road, Atlanta.\nKidnote: Harry Potter celebration. 5 p.m. Aug. 31. Free but ticket required. Presser Hall at Agnes Scott College, 141 E. College Ave., Decatur.\nStreet Festival: 10 a.m.-6 p.m. Sept. 1, noon-6 p.m. Sept. 2, downtown Decatur.","url":"https://www.ajc.com/entertainment/books--literature/ajc-decatur-book-festival-fabulous-events-for-kids-and-teens/b5GDfJ7xVqoZ8IxS8vs0vO/"}
