{"authors":[],"date_download":"2018-10-30 21:00:55","date_modify":"2018-10-30 21:00:55","date_publish":"2015-10-04 13:46:28","description":"Pope Francis had some mojo going. Adoring crowds thronged the streets during his recent visit. It was in the wake of that communal enthusiasm that the pontiff forwarded a plea to the Georgia Board of Pardons and Paroles: don’t give Kelly Gissendaner the needle.","filename":"data/vaneerConsumption/EvenwiththepopeinhercornerGissendanerhadnohope.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/10/04/Images/photos.medleyphoto.8231756.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_even-with-the-po_72adcf3706dca2203608ae6d8b1fa15e__1540933255.html","title":"Even with the pope in her corner, Gissendaner had no hope","title_page":"Kelly Gissendaner execution is Georgia's latest worldwide saga","title_rss":"NULL","source_domain":"ajc.com","text":"Pope Francis had some mojo going. Adoring crowds thronged the streets during his recent visit. It was in the wake of that communal enthusiasm that the pontiff forwarded a plea to the Georgia Board of Pardons and Paroles: don’t give Kelly Gissendaner the needle.\nThe board, which operates in a cloud of secrecy, was unmoved. Soon, she was dead. Lobbying efforts from candle-holding crowds, Gissendaner’s kids (who were also the victim’s) and even God’s wingman himself didn’t nudge the board to sympathy. Nor did the countless legal appeals.\nGissendaner made news in February for ordering two cheese Whoppers for her last meal (this time it was fajitas). She was convicted in 1998 of masterminding her husband’s vicious stabbing murder. Her boyfriend/henchman confessed, helping strap Gissendaner on the gurney while he someday will be paroled.\nThat’s not fair, her supporters contended, arguing there’s something wrong when the guy who battered and stabbed a man to death may one day be freed while she ends up with poison in her veins. She was the first woman executed in the state since 1945.\nThe recent execution — again — brought to the forefront the ongoing argument about government’s most ominous and grave duty: killing its citizens. Georgia in recent years, and historically, has been at the forefront of that debate. In fact, it was Peach State cases before the U.S. Supreme Court that unplugged electric chairs across the U.S. (Furman v Georgia, 1972) and then fired them back up (Gregg v Georgia, 1976.)\nHaving a pope weigh in on a Georgia execution is not new. In 2011 Pope Benedict XVI appealed to save the life of Troy Davis, a convicted cop-killer whose life became a worldwide cause célèbre. Benedict, too, was unsuccessful.\nWilliam Neal Moore, a Rome, Ga., preacher, chuckled at the fact that the pope’s word was not sinking in. “Georgia is not a Catholic state,” he said.\nInstead, he sees a certain steadfastness in the state not changing course.\n“The state of Georgia isn’t going to let anyone bully them,” he said. “The pope isn’t going to tell us what to do. It becomes political. If we stop for this person then we’ll have to stop for that person. They’re saying, ‘We kill white people. We kill black people. We even kill women. We kill everybody to show we are fair.’ “\nMoore was a soldier who killed an elderly man in a shootout while Moore was burglarizing his home in 1974. But while he’s cynical about Georgia’s killing apparatus, he himself received mercy. In 1990 the parole board commuted his sentence while prison crews were readying the electric chair. The victim’s family lobbied for his release, as did a little lady from Calcutta — Mother Teresa.\nI guess a future saint has more cred than the pope when it comes to winning over the board. In 1991, Moore, clearly a changed man, was released from prison.\nWayne Garner, a man with a varied career — undertaker, legislator, hard-nosed prisons chief, parole board chairman and small-town mayor — disagrees with Moore on the parole board’s intention.\nHe believes the current parole board members are thoughtful people who are not interested in sending a message or thumbing their noses to the pontiff. Garner said they simply believed they were doing their duty in carrying out the sentence a Gwinnett County jury meted out 17 years ago.\nThe board “has a ton more information about the case than the public,” he said. From what he knows, however, Garner says he would have commuted Gissendaner’s sentence.\nGarner is well-versed in the execution process. He oversaw three electrocutions as the corrections chief in the late 1990s and, as he remembers, four clemency hearings before that. None was granted.\nAs Parole Board Chairman, Garner met with condemned killer Nicholas Lee Ingram for 20 minutes in April 1995. “How can I make a decision to execute a man without at least looking him in the eye?” he said at the time.\nThe British-born Ingram’s execution was front-page fodder for the Brit tabloids. A corrections spokeswoman said of the foreign press, “I get the impression that they think we’re a bunch of barbarians who just want to nuke everybody.”\nPutnam County Sheriff Howard Sills last year witnessed the lethal injection of Robert Wayne Holsey, who murdered a deputy named Will Robinson. “It’s like watching someone go to sleep,” he said of the event.\nSills’ county is in one of the toughest judicial circuits (Ocmulgee) and he is resolute in his support for the ultimate punishment. “I know how hard it is to get the death penalty and anyone who gets the death penalty serves the death penalty. It’s a necessary part of the system. It’s necessary consequence.”\nAmericans still favor the death penalty. But support has dropped as sentences of life without parole give juries an alternative from meting out an execution. A 2013 Gallup Poll found 60 percent of Americans in favor, down from 80 percent in 1994, when crime was rampant. A Pew Research Center Poll from the same year said 55 percent of Americans were in support, down from 78 percent in 1996.\n“It’s still over 50 percent because our generation hasn’t died out yet,” said former DeKalb County DA J. Tom Morgan, who is now a law professor and thinks the death penalty should be abolished. He sought the death penalty several times but all cases ended up with life without parole sentences, either through plea deals or his urging.\nWithin a decade or so, Morgan, Garner and Sills predict, executions will be a thing of the past.\nMoore, the former inmate turned preacher, disagrees. There’s too much emotion tied to it, especially in Georgia.\n“I think we’ll see more,” Moore said, especially in the next few years.\nAnd, so, the argument will continue.","url":"https://www.ajc.com/news/local/even-with-the-pope-her-corner-gissendaner-had-hope/Ipbn06qUe5PhUrfjPTkJEI/"}
