{"authors":[],"date_download":"2018-10-30 19:42:33","date_modify":"2018-10-30 19:42:33","date_publish":"2018-08-03 15:05:00","description":"Dragon Con 2018: Event debuts Diversity fan track with array of panel discussions, workshops and special events","filename":"data/vaneerConsumption/EventtodebutDiversityfantrack.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/newsEngin.22588670_2012-08-31-dragoncon-048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_for-first-time-drago_becaa3e8620fb5609484798d620504f5__1540928553.html","title":"Event to debut Diversity fan track","title_page":"Dragon Con 2018: Event to debut Diversity fan track","title_rss":"NULL","source_domain":"ajc.com","text":"Jarvis Sheffield vividly remembers his first Dragon Con, the ultra-successful pop culture convention that overtakes downtown Atlanta each Labor Day weekend. With the power of a Superman punch, Dragon Con’s welcoming spirit and diversity made an impact. He saw a melting pot of fans, many in costume, celebrating together, letting their geek flags fly.\n“When you come into that environment, you’re much more accepted in terms of your interests,” said Sheffield, founder of the Black Science Fiction Society. “You don’t even look at race. You’re just another nerd, and nerd (culture) is a bridge.”\nThis year, Sheffield hopes to strengthen that bridge. For its 32nd installment, Dragon Con debuts an array of panel discussions, workshops and special events all tied to the subject of diversity. As director of the convention’s Diversity in Speculative Fiction & Literature Fandom fan track, Sheffield will pilot that figurative starship.\n>> RELATED: Dragon Con promises a ‘Stranger’ Labor Day weekend\nDiversity in cosplay, the hobby of costuming as pop culture characters, will be discussed in panels as part of Dragon Con’s Diversity track. CONTRIBUTED BY DRAGON CON\nFan tracks serve as Dragon Con’s lifeblood. Each of the more than 35 tracks covers subjects from movies, comics and gaming to science, animation and costuming. Within each track, you’ll find many events taking place throughout the convention. Want to learn how to break into the comic book biz, listen to behind-the-scenes stories from the star of your favorite blockbuster flick or get costuming tips from the pros? That’s just a smidgen of what you’ll find.\nIn the past, some of the convention’s tracks would cover diversity issues, but 2018 marks the first time they land under one category.\nThe Black Geeks of Dragon Con photo shoot, a gathering of African-American costumers, will take place at the annual pop culture convention in downtown Atlanta. CONTRIBUTED BY DRAGON CON\n“It’s a bold move for Dragon Con, and I applaud them for doing it,” said Channing Sherman, a regular attendee and organizer of the Black Geeks of Dragon Con photo shoot, a gathering of costumed African-American fans, who pose for pictures on the steps of the Hilton hotel. “I think often when people hear the word diversity, they immediately think black and white. But you’ve got the LGBTQ community, the disabled and gender diversity. So I hope they really try to encompass all aspects of it.”\nThe new Dragon Con Diversity track, a series of panel discussions and events taking place at the pop culture event, celebrates ethnicity in fiction and fandom. CONTRIBUTED BY DRAGON CON\nAccording to Sheffield, the Diversity track will cover those topics and more with 22 panels and workshops. Other types of diversity, including nationality, religion, age and body type, share the spotlight. Sessions cover everything from female video game creators to the significance of gender and sexuality in fiction.\nTopics that include gender in science fiction and fantasy will be discussed in panels as part of Dragon Con’s Diversity in Speculative Fiction & Literature Fandom fan track. CONTRIBUTED BY DRAGON CON (For the AJC)\nAcclaimed author and screenwriter Steven Barnes, known for penning TV episodes of “The Outer Limits,” “Stargate SG-1,” “Baywatch” and more, serves as the literary guest of honor. Other guest panelists include film composer Stephen Letnes. Letnes, who’s legally blind, will chat about challenges involving creatives with disabilities.\nLetnes said when it comes to the diversity dialogue, those with disabilities don’t always have a seat at the table. “It’s hard to get a shoulder into the conversation,” said Letnes, an advocate for the disabled in Hollywood and founder of the Able Artist Foundation. “It’s tough for people with disabilities to get ahead. We’re always running to stand still, because there’s more for people with disabilities to think about and manage so we can compete with others (in our professions) who do not have those challenges.”\nTanya Woods, a costume creator and cosplayer seen here as Marvel's Misty Knight, will appear on several panels as part of Dragon Con's Diversity track. CONTRIBUTED BY KHARI SAMPSON\nTanya Woods, a technical writer by day and a costumer by night who will sit on several panels, echoes the importance of Dragon Con’s Diversity track, yet hopes for diversity within the diversity.\n“I think sometimes when people see a diversity track, they think it’s just for those people who fall underneath that umbrella,” said Woods, whose “Black Panther” Dora Milaje costumes she created with collaborator Walter Dean can be seen in the Marvel Web series “Marvel Becoming.” “Those tracks are for everyone, because everyone should be part of the conversation about how we should all be able to work together, play together and be one community.”\n>> RELATED: Comic book artist’s work takes her from superheroes to civil rights\nFor Sheffield, the challenge of wrangling the Diversity programming and his team of volunteers looms large. In addition to the panels, it also includes a quartet of parties, two showcases and participating in the Dragon Con parade. The latter, which will be held Sept. 1, features a massive float dedicated to the 2018 hit superhero film “Black Panther” and cosplayers representing different types of diversity. Since the announcement of the Diversity track in early spring, Sheffield said it’s been akin to a part-time job.\n“But it’s a labor of love,” he explained. “To have an opportunity to incorporate a different, diverse group of people so they get to partake in the Dragon Con experience is an awesome feeling, so I’m more than happy to play my part.”\nEVENT PREVIEW\nDragon Con\nAug. 30-Sept. 3. Five-day membership: $160 online until Aug. 28; then available for $140 beginning Aug. 30 at the Sheraton Atlanta Hotel. Three-day, two-day and single-day memberships $10-$120 depending on number of days and which days. Tickets available on a day-of basis at the Sheraton. Free ages 6 and younger. Sheraton Atlanta Hotel, 165 Courtland St. NE, Atlanta. dragoncon.org.\nIN OTHER NEWS:","url":"https://www.ajc.com/events/for-first-time-dragon-con-offers-fan-track-focusing-diversity/69qds1hO5R62uJkB5zDUxK/"}
