{"authors":["Press Association"],"date_download":"2018-10-23 01:58:29","date_modify":"2018-10-23 01:58:29","date_publish":"2016-01-28 16:38:19","description":"Everton fumed as Manchester City controversially overturned a first-leg deficit to claim a place in the Capital One Cup final. City recovered from being two ...","filename":"data/vaneerConsumption/Evertonupsetovercontroversialgoalinsemifinaldefeat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-ee4b2c17-b4c7-4b64-a137-b1b0f4ef89c3-4vVdYopwYQ7f641721b07af46f96-194_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420435_Everton-upset-controversial-goal-semi-final-defeat_1540259909.html","title":"Everton upset over controversial goal in semi-final defeat","title_page":"Everton upset over controversial goal in semi-final defeat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Everton upset over controversial goal in semi-final defeat\nEverton fumed as Manchester City controversially overturned a first-leg deficit to claim a place in the Capital One Cup final.\nCity recovered from being two goals behind on aggregate to win their semi-final 4-3 overall with a 3-1 success at the Etihad Stadium, but their comeback hinged on a contentious goal.\nWith the score 1-1 on the night, City hit a second to level the tie through Kevin De Bruyne despite Raheem Sterling clearly running the ball out of play in the build-up.\nManchester City came from behind to beat Everton in their Capital One Cup semi-final\nThe Toffees never recovered from that 70th-minute blow and substitute De Bruyne then set up Sergio Aguero for a decisive third City goal six minutes later.\nThe result put quadruple-chasing City through to next month's final against Liverpool but there was concern over De Bruyne's fitness after the Belgian was carried off late on with suspected medial ligament damage.\nDe Bruyne's goal was the main talking point of an enthralling the game with Everton boss Roberto Martinez questioning how the officials could have missed the ball crossing the byline.\nMartinez said: \"It was a clear decision, the ball is out of play. That second goal affected the outcome too much.\n\"You have to respect the referees, they have the toughest job in football, but certain decisions are clear-cut. When the ball is out of play in the modern game, you don't expect that to be missed.\n\"When it ends up with the second goal, you can imagine the major blow it has in our feelings, our performance and our chances to get through.\"\nEverton led 2-1 from the first leg and increased their advantage as Ross Barkley finished off a swift counter-attack with an excellent finish in the 18th minute.\nCity rallied and pulled one back with a deflected Fernandinho strike and hit the woodwork twice through Aguero and David Silva before De Bruyne's disupted effort.\nThe momentum was all with the hosts after that and they secured victory with a fine glancing header from Aguero.\nCity boss Manuel Pellegrini felt justice was served after his side were, amongst other controversial decisions, denied a penalty in the first leg and because they were superior overall.\nPellegrini said: \"Maybe it was a mistake of the referee but I think Everton cannot complain about the referee. We lost at Goodison with a clear offside for the first goal and a clear penalty for Jesus Navas.\n\"I'm very happy because I think we deserve to be in the final. It was a game of 180 minutes and I think we played this semi-final in an intelligent way.\"\nThe only downside was the injury to De Bruyne, who appeared to get his studs caught in the turf and fall awkwardly. He looked in agony before being taken off on a stretcher.\nPellegrini said: \"The doctor thinks he has a problem in his medial ligament. It is very difficult to know in this moment but I am optimistic he will not be out for the rest of the season.\"\nAfter the game, Everton goalkeeper Joel Robles apologised to De Bruyne for attempting to pick him up after he went down injured.\nRobles tweeted: \"I would like to apologise to Kevin De Bruyne for my reaction to his injury. In the heat of the moment I didn't realise he was badly hurt.","url":"https://www.dailymail.co.uk/wires/pa/article-3420435/Everton-upset-controversial-goal-semi-final-defeat.html"}
