{"authors":["Dominic King For Mailonline"],"date_download":"2018-10-22 23:04:58","date_modify":"2018-10-22 23:04:58","date_publish":"2016-01-28 11:44:39","description":"Phil Jagielka has branded Martin Atkinson 'arrogant' as Everton's fury towards the referee mounted following the controversial exit from the Capital One Cup after their defeat by Manchester City.","filename":"data/vaneerConsumption/EvertonsPhilJagielkaclaimsMartinAtkinsonjokedabouthisdefendinginManCitygame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30AA0C8C00000578-0-image-a-27_1453981498486.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420777_Your-defending-brilliant-Arrogant-referee-Martin-Atkinson-joked-performance-says-Phil-Jagielka_1540249498.html","title":"Everton's Phil Jagielka claims Martin Atkinson joked about his defending in Man City game","title_page":"Everton's Phil Jagielka claims Martin Atkinson joked about his defending in Man City game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ball had clearly gone out of play before Raheem Sterling crossed for goal\nPhil Jagielka has branded Martin Atkinson 'arrogant' as Everton's fury towards the referee mounted following their controversial exit from the Capital One Cup.\nEverton's captain – like his manager Roberto Martinez – was furious that Kevin De Bruyne's goal, which gave Manchester City a 2-1 lead and levelled the semi-final on aggregate, was allowed to stand after Raheem Sterling ran the ball out of play before crossing.\nJagielka tried to speak with Atkinson – who has history with Everton – immediately but the England international claims the match official gave him a sarcastic reply and said he 'just told me that our defending was brilliant'.\nReferee Martin Atkinson has been labelled as 'arrogant' after Manchester City's 3-1 victory over Everton\nEverton captain Phil Jagielka (left) says Atkinson joked about the quality of his side's defending at the Etihad\nEverton were left fuming when Kevin De Bruyne scored City's second after the ball had gone out of play\nEverton's players show their dejection shortly after Atkinson blew the full-time whistle at the Etihad\nATKINSON'S PAST CONTROVERSIES April 2010 - Manchester City questioned the appointment of Atkinson for one of their games after frustrations over his performance in a previous Manchester derby. October 2011 - Sent off Everton midfielder Jack Rodwell in the Merseyside derby against Liverpool. The red card was later rescinded. April 2012 - Gave a goal for Chelsea's Juan Mata in their 5-1 FA Cup semi-final win over Tottenham despite it not crossing the line. February 2015 - Jose Mourinho picked out four apparent mistakes by Atkinson in a draw between Chelsea and Burnley. The referee was overlooked for the next round of fixtures. P.S. Steven Gerrard said of Atkinson in his autobiography: 'I can't stand him.'\nThe official has been at the centre of a row with Everton before, after he sent Jack Rodwell off in a Merseyside derby in October 2011. That red card that was later rescinded.\nAfter Wednesday's game, Martinez was outraged by Atkinson's decision and insisted the complexion of the tie changed dramatically from that moment and, as he reflected on the defeat, Jagielka said he was 'speechless' that such a high-profile mistake had been made.\n'The replays show it is not just an inch or so out,' he said. 'You expect the officials that are supposed to be of a high standard to spot that but it obviously wasn't one of those nights. I tried to (speak to Atkinson). He just ​told me that ​our ​defending was brilliant.\n'So it is difficult when things start going the wrong way and they become a little bit arrogant – but unfortunately that is the way it goes.\n'If he made a decision wrong or he didn't see it that is what happens. Sometimes when you go and speak to people and, in such big games, get the answers you get, it is that little bit more frustrating.'\nHe added: 'It is really hard. You know your luck is obviously not in when the deflection goes in for the first goal and then as the game is heating up and they are piling on the pressure, some decisions that still bemuse me now – throw-ins given for I don't know what.\nRaheem Sterling offered up the cutback for the goal but ball appeared to have crossed the white line already\nTelevision replays showed that Sterling had run the ball out of play but De Bruyne's goal\nJagielka was furious with the decision but says Atkinson was dismissive of his complaints over the goal\n'Unfortunately the ball was out of play, I'm pretty speechless. I am not saying it is the best we have played but we certainly didn't get anything out for what we put in there.\n'We've not stopped. You keep going, it was still a great cutback (from Sterling) and a great finish (from De Bruyne).'\nThere was another incident that left Jagielka bewildered. In the build up to the attack from which City scored the second goal, Atkinson awarded a foul throw to City when Everton defender John Stones had not even thrown the ball in by the halfway line.\nSterling got past John Stones but despite failing to keep the ball in play he managed to set up the goal\nEverton were infuriated with the referee's performance and aggrieved after missing out on a place in the final\nManager Roberto Martinez was also frustrated with how decisions were not given in his side's favour\n'Obviously he saw what he saw – or he didn't see what he didn't see – but the one that baffles me is the throw-in that gets given the other way,' said Jagielka.\n'He told me that was a foul throw. I don't understand how it can be a foul throw if you've not actually thrown the ball.\n'It is likely taking a corner out of quadrant and not kicking it, and it being a foul corner. It has been a frustrating. This has contributed to us losing the game but it is not the be-all and end-all. But as far as luck goes, we are massively frustrated.'","url":"https://www.dailymail.co.uk/sport/football/article-3420777/Your-defending-brilliant-Arrogant-referee-Martin-Atkinson-joked-performance-says-Phil-Jagielka.html"}
