{"authors":[],"date_download":"2018-10-30 19:47:02","date_modify":"2018-10-30 19:47:02","date_publish":"2018-10-30 00:00:00","description":"Blair wants more diversity on the board and more attention to the voices of South Gwinnett residents.","filename":"data/vaneerConsumption/EvertonBlairDistrict4.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23310949_101818-gwx-boe-candidate-forum_AP4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-school-_7339375a57d9b701af7cc27f295f6911__1540928822.html","title":"Everton Blair, District 4","title_page":"Gwinnett school board race: Everton Blair, District 4","title_rss":"NULL","source_domain":"ajc.com","text":"At 26 years old, Everton Blair will perhaps be the youngest school board member Gwinnett County has ever had, if he wins the District 4 seat. He would also be the first black person on the board.\nHe said he sees more diversity on the school board as a long-overdue necessity.\n“I think that there is an opportunity to increase the number of perspectives that we have represented on our board. … As a former student in Gwinnett County Public Schools and a former teacher, I can bring a perspective of a learner and an educator from not that long ago,” he said. “And as a resident of South Gwinnett, I bring a voice that isn’t always consistent in meetings that take place in the north part of the county. It’s not easy for folks who live south of Highway 78 to always make those meetings. I think that’s invaluable when you’re talking about setting policies and procedures.”\nA 2009 graduate of Shiloh High School, he edged past opponent Mark Williams with 53.47 percent of the votes in the Democratic primary.\n“I was educated in the growing diversity of the Gwinnett County that we see today. It is that diversity that makes us stronger and I’m excited to represent many new aspects of our county’s diversity, particularly my age,” he said. “It’s important to exercise leadership that brings youth to the discussion … My youth is coupled with much more experience than many other people who have run for this position.”\nAt the nonprofit Broad Foundation, which gives grants to improve public schools, advance scientific and medical research and make the arts accessible to the public, he was a director for a program to develop leadership for superintendents. The founder of that organization, Eli Broad, donated heavily to Blair’s campaign. Gwinnett County schools is a two-time recipient of the million-dollar Broad Prize, for gains in in student achievement while narrowing achievement gaps among low-income students and students of color.\nBlair acknowledges he doesn’t know everything.\n“I think it’s a good position to be in that there will be three of the five board members who have been there for quite some time to help orient the newcomers to the processes of Gwinnett County Schools,” he said. “The superintendent has been in the office my entire school career — since I was in kindergarten. I have a positive relationship with him. We know each other very well.”\nBlair interned at Gwinnett County Schools’ support center in 2010 after his freshman year in college. He said he had a lot of interaction with district leaders and area superintendents and plans to build upon that solid foundation.\nHe also plans to improve communication with constituents. Board members are are accountable when “we can see and engage on their thoughts on an issue before they vote on an issue,” he said. “There is room for that thought and that position to be articulated with the public. Your board members are the community’s conduit to holding the schools accountable.”\nHe’d like to use social media and other technology to meet people where they are.\n“Most people should know their school board member, especially since they have such a direct impact on their family and their students. In many cases we might hear more or feel more intimately connected to our governor or our president than we do to our own school board member,” he said. “Everyone is active and present in their own space, but you’ve got to be as universally present as possible, which leads me to think about how we can use virtual space to increase engagement. It’s just one additional avenue, I’m not going to be tweeting all the time, but I do have a very active Facebook where I’ve got over a thousand followers and I intend to be continually communicative with the residents, students and parents in my district.”","url":"https://www.ajc.com/news/local/gwinnett-school-board-race-blair-wants-more-diversity/2t0tWNR2LjaIyTzShWkQXK/"}
