{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:19:15","date_modify":"2018-10-30 20:19:15","date_publish":"2015-03-21 01:31:16","description":"Everytown for Gun Safety tweeted proponents of campus carry, asking if giving guns to their \"drunk, college-age daughters\" is a great idea.","filename":"data/vaneerConsumption/EverytownDoYouReallyWanttoGiveGunstoYourDrunkDaughters.json","image_url":"https://media.breitbart.com/media/2015/03/campus-carry-OK-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_20__1540930755.html","title":"Everytown: Do You Really Want to Give Guns to Your 'Drunk' Daughters?","title_page":"Everytown: Do You Really Want to Give Guns to Your 'Drunk' Daughters? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On March 19, Everytown for Gun Safety tweeted to proponents of campus carry, asking if giving guns to their “drunk, college-age daughters” is really a great idea.\nThis question follows campus carry bills making it out of committee in Florida and Nevada, and it also follows Texas Governor Greg Abbott’s reaffirmation that he will sign campus carry legislation once it reaches his desk.\nEverytown’s exact tweet: “You think your drunk, college-age daughters are bad with their phones? Imagine them with guns.”\nIronically, in late February, Everytown criticized Nevada GOP Leader Michele Fiore (R-Las Vegas) for describing college-age females as “young, hot little girls on campus.” Fiore said men bent on sexual assault would think twice if “young, hot little girls on campus have a firearm.”\nBut now, with Everytown’s drunk daughters tweet, we finally understand—it’s okay to paint with a broad brush and describe college females as irresponsible humans, but it’s not okay to mention how unarmed, attractive women are targeted for sexual assault and worse.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/03/20/everytown-do-you-really-want-to-give-guns-to-your-drunk-daughters/"}
