{"authors":["Ben Nagle For Mailonline"],"date_download":"2018-10-23 01:33:28","date_modify":"2018-10-23 01:33:28","date_publish":"2017-03-10 09:55:40","description":"Love was in the air for Everton's Morgan Schneiderlin and his fiancee Camille Sold this week, as they shopped for wedding rings in Manchester city centre.","filename":"data/vaneerConsumption/EvertonstarMorganSchneiderlinspottedinManchester.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E222B3200000578-0-image-a-2_1489141304068.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300542_Schneiderlin-Manchester-partner-Camille-Sold_1540258408.html","title":"Everton star Morgan Schneiderlin spotted in Manchester","title_page":"Everton star Morgan Schneiderlin spotted in Manchester | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Love was in the air for Everton's Morgan Schneiderlin and his fiancee Camille Sold this week, as they shopped for wedding rings in Manchester city centre.\nThe pair got engaged in March last year, and headed out to Deansgate on Thursday afternoon to visit various jewellers.\nSchneiderlin had earlier trained at Finch Farm with his Toffees team-mates, before meeting his partner for some retail therapy.\nMorgan Schneiderlin holds hands with his fiancee Camille Sold as the pair go shopping\nSchneiderlin and Sold looked in good spirits as they wandered around Manchester this week\nThey seemed in high spirits as they eyed up expensive wedding rings in the window of a jewellers, peering through the glass.\nEverton face West Brom this weekend, and Schneiderlin is expected to start after reigniting his career at Goodison Park.\nThe Manchester United flop was used to a place on the sidelines at Old Trafford, but is back in the starting XI at Everton and firing on all cylinders.\nThe pair eyed up various rings and other pieces of jewellery in a shop window on Deansgate\nSold posted a picture of herself to Instagram from the pair's outing on Thursday afternoon\nSchneiderlin and Sold have been together for a number of years, with the latter staying with him as he moved from Southampton to United to Everton.\nAs the pair found their feet in Manchester, Sold opted to keep herself busy by working as a shop assistant at adidas in the city centre.\nOn £10-an-hour while her boyfriend picked up an annual salary of £5million, Sold was pictured wearing a United shirt while at work back in 2015.\nEarlier in the day, Schneiderlin had trained alongside his Everton team-mates at Finch Farm","url":"https://www.dailymail.co.uk/sport/football/article-4300542/Schneiderlin-Manchester-partner-Camille-Sold.html"}
