{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:49:44","date_modify":"2018-10-30 21:49:44","date_publish":"2016-02-04 16:36:42","description":"Despite past support, Everytown for Gun Safety has now turned the table on Governor Terry McAufiffe (D) because of his decision to reverse a majority gun control win in Virginia. |","filename":"data/vaneerConsumption/EverytownTurnsOnGovMcAuliffeOverGunControlReversal.json","image_url":"https://media.breitbart.com/media/2016/02/Terry-mcauliffe-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_04__1540936184.html","title":"Everytown Turns On Gov. McAuliffe Over Gun Control Reversal","title_page":"Everytown Turns On Gov. McAuliffe Over Gun Control Reversal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Despite past support, Everytown for Gun Safety has now turned the table on Governor Terry McAufiffe (D) because of his decision to reverse a majority gun control win in Virginia.\nOn January 29 Breitbart News reported that Everytown came unglued over McAuliffe’s announcement that he would reverse Attorney General Mark Herring’s (D) unilateral attempts to ever reciprocal concealed carry ties with 25 states.\nNow The Washington Post reports that the gun control group is a bit more than simply unglued–they are actually on the offensive. They have launched a social media campaign which shows “side-by-side photos of McAuliffe and the National Rifle Association’s Wayne LaPierre.” The photos are captioned: “What do VA Gov. Terry McAuliffe and NRA head Wayne LaPierre have in common? Both Gov McAuliffe and NRA Head Wayne LaPierre support allowing dangerous people to carry hidden loaded weapons in Virginia.”\nTo be fair, McAuliffe’s decision is not about allowing dangerous people to carry guns in Virginia. Rather, it is about maintaining state relations with a number of states that refuse to recognize Virginia concealed carry permits unless Virginia recognizes theirs in return. Everytown and Attorney General Herring (D) were hoping to use the denial of reciprocity as leverage to force other states to pass more gun control, but the public outcry against the end of reciprocity was too great and McAuliffe was burning too much political capital by standing idly by.\nMcAuliffe’s reversal of Herring’s actions now waits for the approval of the GOP-controlled General Assembly.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/02/04/everytown-turns-on-gov-mcauliffe-over-gun-control-reversal/"}
