{"authors":["Carl Markham","Press Association Sport"],"date_download":"2018-10-23 01:56:35","date_modify":"2018-10-23 01:56:35","date_publish":"2017-03-10 10:30:07","description":"Ronald Koeman has challenged his players to win their next two games to maintain the pressure on teams in the top six, with fifth-placed Arsenal only six points away and seemingly in crisis.","filename":"data/vaneerConsumption/EvertonmanagerRonaldKoemantargetscatchingArsenal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E1D23FD00000578-0-image-a-18_1489145133543.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300716_Everton-manager-Ronald-Koeman-targets-catching-Arsenal_1540259795.html","title":"Everton manager Ronald Koeman targets catching Arsenal","title_page":"Everton manager Ronald Koeman targets catching Arsenal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Everton manager Ronald Koeman is targeting six points from their next two matches to retain some purpose in their season.\nWest Brom and Hull are the visitors to Goodison Park before the Toffees head to near-neighbours Liverpool for the Merseyside derby.\nKoeman has challenged his players to win both games at home in order to maintain the pressure on teams in the top six, with fifth-placed Arsenal only six points away, albeit with a match in hand, but seemingly in crisis.\nEverton manager Ronald Koeman has called on his team to beat West Brom and Hull City\nKoeman's players are boosted by their manager's belief that they can break into the top six\nSeason at a glance Live tables\nFixtures\nScores Premier League\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\n'I still believe in when we win the next two games at home that still something is possible above us in the table,' said Koeman.\n'But that starts with six points and starts this Saturday.\n'Arsenal are normally strong and have good players, so it will be really tough to catch them. But maybe after six points then we come closer and then maybe something is possible.\n'It starts always by yourself, don't look too much to other teams. If you win we come closer and that is the most important.'\nA victory over the Baggies, one place below in eighth, would open up a significant gap and virtually assure the Toffees of seventh place.\nKoeman thinks that would represent a degree of success this season after back-to-back 11th-placed finishes under predecessor Roberto Martinez.\n'The first objective is for Saturday, to win the game and make the distance to seven points. I think that is really a big gap,' the Dutchman added.\n'That (seventh) is the first step we needed to make for this season.\n'I don't like to speak a lot about the end of the season but if we finished in seventh I think we can be happy.\n'The next step needs to be for next season.'\nEverton's nine-match unbeaten Premier League run, stretching back to mid-December and garnering 21 points, was ended by a disappointing performance at Tottenham last weekend.\nArsenal have struggled of late and look to be in trouble after their Champions League exit\nHowever, Koeman does not believe that will affect his players and instead said he thought it provided a timely reminder of where Everton currently are.\n'We know Tottenham are a really strong team. They were the better team that day and it is good to see sometimes that still we need to improve,' he said.\n'I don't think it will affect the team a lot. It shows that still there is a lot of work to do.'","url":"https://www.dailymail.co.uk/sport/football/article-4300716/Everton-manager-Ronald-Koeman-targets-catching-Arsenal.html"}
