{"authors":["Pa Reporter"],"date_download":"2018-10-23 03:23:03","date_modify":"2018-10-23 03:23:03","date_publish":"2017-03-10 12:52:36","description":"Ahead of the weekend's Premier League action, Sportsmail will be providing you with all you need to know. Here is all the information you need for Everton's home game with West Brom.","filename":"data/vaneerConsumption/EvertonvsWestBromTeamnewskickofflineups.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3DEBB8B700000578-0-image-a-6_1489140946620.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300702_Everton-vs-West-Brom-Team-news-kick-line-ups_1540264983.html","title":"Everton vs West Brom: Team news, kick-off, line-ups","title_page":"Everton vs West Brom: Team news, kick-off, line-ups | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of the weekend's Premier League action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Everton's home game with West Brom.\nEverton vs West Brom (Saturday - Goodison Park)\nTeam news\nEverton\nForward Dominic Calvert-Lewin is in contention for a place in Everton's squad to face West Brom after recovering from an ankle injury which has sidelined him since January 2.\nMidfielder Muhamed Besic has returned to training after recovering from a knee ligament operation but there are doubts over whether he will feature at all this season.\nMuhamed Besic has returned to training after recovering from a knee ligament operation\nManager Ronald Koeman is likely to make changes from the side which lost at Tottenham with veteran midfielder Gareth Barry likely to make way for the more attacking Ademola Lookman.\nProvisional squad: Robles, Coleman, Williams, Funes Mori, Baines, Gueye, Schneiderlin, Barkley, Davies, Lookman, Lukaku, Stekelenburg, Jagielka, Holgate, McCarthy, Barry, Mirallas, Lennon, Valencia, Calvert-Lewin.\nWest Brom\nWest Brom will once again be without winger Matt Phillips when they face Everton on Saturday.\nPhillips sits out the Premier League contest at Goodison Park due to the hamstring problem that has kept him sidelined for the last two games.\nBaggies boss Tony Pulis says he has 'one or two knocks' in his squad beyond that but does not expect anyone else to be unavailable.\nProvisional squad: Foster, Myhill, Nyom, Dawson, Evans, McAuley, M Wilson, Olsson, Brunt, Galloway, Fletcher, Yacob, Livermore, Field, Chadli, Morrison, McClean, Rondon, Leko, Robson-Kanu.\nWest Brom boss Tony Pulis has 'one or two knocks' going into the Goodison Park clash\nKey match stats (supplied by Opta)\nEverton are winless in their last three home league games against the Baggies (D2 L1), failing to score in each match.\nTony Pulis’ side won this exact fixture 1-0 last season thanks to Salomon Rondon’s goal – it’s the only goal in the last three Premier League games between the sides at Goodison Park.\nThe last team Everton failed to score against in four successive top flight home matches was Manchester United (between 1990 and 1993).\nMeanwhile, West Brom haven’t kept a clean sheet in four consecutive away top flight games against an opponent since March 1925 (a run of five against Birmingham).\nRomelu Lukaku has scored three goals in six Premier League games against his old club, but all of these have come at the Hawthorns.\nLukaku now has 78 Premier League goals. Only three players in the history of the competition have scored more before their 24th birthday than the Belgian: Michael Owen (110), Robbie Fowler (106) and Wayne Rooney (86), while Lukaku now has one more than Cristiano Ronaldo (77).\nWest Brom haven’t kept a clean sheet in four consecutive away games since March 1925\nThis will be Tony Pulis’ 300th Premier League game in charge (currently P299 W95 D87 L117).\nWest Bromwich Albion (40 points) need just three more points this season to equal their points tally from the whole of 2015-16 (43).\nEverton (44 points) can also equal their entire points tally from last season and also the season before (47) if they win this match.\nWest Bromwich Albion have won 39 points from 20 games against sides outside the top six this season (W11 D6 L3) – more than any other club in games between teams currently in positions 7-20.\nThe Baggies have named an unchanged starting XI on 10 occasions this season in the Premier League; more often than any other side.","url":"https://www.dailymail.co.uk/sport/football/article-4300702/Everton-vs-West-Brom-Team-news-kick-line-ups.html"}
