{"authors":["Matt Turner"],"date_download":"2018-10-30 23:39:19","date_modify":"2018-10-30 23:39:19","date_publish":"2016-12-06 00:00:00","description":"Evercore, the boutique bank, is one to watch on Wall Street.","filename":"data/vaneerConsumption/EvercorepresentationatGoldmanSachs.json","image_url":"https://amp.businessinsider.com/images/58472c5fba6eb69a018b7c64-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_evercore-presentation-at-goldman-sachs-2016-12_1540942759.html","title":"Evercore presentation at Goldman Sachs","title_page":"    Evercore presentation at Goldman Sachs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Ralph Schlosstein, president of Evercore Partners Bloomberg Evercore, the boutique bank, is one to watch on Wall Street.\nThe firm has hired John Weinberg, part of a Goldman Sachs dynasty, to be executive chairman. It has added a head of activist defence, made hires in Europe, and the share price is up almost 30% in the last 12 months.\nAnd in a presentation on Tuesday at the Goldman Sachs financial services conference, Evercore CEO Ralph Schlosstein claimed bragging rights in the most Wall Street way possible:\nOur top staff make more money than yours.\nIn a presentation setting out the firm's goal to become \"the most elite independent investment banking advisory firm globally,\" Schlosstein said that productivity per advisory senior managing director is now ahead of the average productivity of all of its public independent peers.\nThe firm has 81 advisory senior managing directors, and they generated $13.3 million per person on average for the last twelve months ending the third quarter 2016. For comparison, the full-year high is $14.8 million, which the firm achieved in 2007.\nThe set of public independent peers that Evercore is comparing itself to doesn't include Centerview, which may well give it a run for its money. Still, it's quite a statistic.","url":"https://www.businessinsider.com/evercore-presentation-at-goldman-sachs-2016-12"}
