{"authors":["Jack Gaughan For Mailonline"],"date_download":"2018-10-23 03:21:27","date_modify":"2018-10-23 03:21:27","date_publish":"2017-03-16 14:09:08","description":"Ronald Koeman is furious at Romelu Lukaku's public declaration that he wants to leave Everton and warned that the top scorer must respect his contract.","filename":"data/vaneerConsumption/EvertonbossRonaldKoemanblastsRomeluLukaku.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54F0AA00000578-0-image-a-7_1489675894297.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320444_Everton-boss-Ronald-Koeman-blasts-Romelu-Lukaku_1540264887.html","title":"Everton boss Ronald Koeman blasts Romelu Lukaku","title_page":"Everton boss Ronald Koeman blasts Romelu Lukaku | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ronald Koeman is furious at Romelu Lukaku's public declaration that he wants to leave Everton and warned that the top scorer must respect his contract.\nLukaku made plain his desire to play in the Champions League and claimed that Everton do not match his ambitions in a startling interview this week.\nAnd that has left Koeman, who spoke to the player at Finch Farm on Thursday morning, angry.\nEverton manager Ronald Koeman is furious with striker Romelu Lukaku, who went public with his demands to leave the club this week\nKoeman told top scorer Lukaku that he will respect his contract at Goodison Park\nLukaku seemed cheerful despite his wish to leave Everton as he trained on Thursday\nLukaku, though, will play against Hull in the Premier League this weekend. Everton will discuss suitable punishment after comments this week.\n'Of course I'm not happy about that interview because first, if Everton is not a club with a lot of ambition I wouldn't be the manager,' Koeman said.\n'The second - and I spoke with Rom this morning - is I know it's difficult, if you're a player, prepare yourself to play good and score goals. He is one of the best.\n'The rest needs to be done by the manager and board.\n'First you speak with the player, then the board and we'll see what happens. We have time to decide what we need to do.\nKoeman said he has spoken with Lukaku at the club's training ground on Thursday morning\nIn-form Belgian striker Lukaku has scored 20 goals in 29 matches for the Toffees this season\nBelguim striker Lukaku has made plain his desire to play in the Champions League\nEverton fixtures All Premier League Saturday Hull City (H) April 1 Liverpool (A) April 4 Manchester United (A) April 9 Leicester City (H) April 15 Burnley (H) April 22 West Ham United (A)\n'If a player loses his interest in Everton he will not play. His behaviour - except some quotes - is good and he will play. The team needs Rom.'\nThe Toffees had put together a huge financial package to the striker but Lukaku is not driven by money.\nIt had been suggested that the deal was '99.9 per cent done' but the Belgian now sees his future away from Goodison Park.\nInstead, the 23-year-old wants to challenge for silverware and raised questions about the club's transfer policy, even after they spent in January.\nManchester United - who had earmarked Harry Kane as Zlatan Ibrahimovic's successor - are likely to have followed the latest developments with interest.\nEverton slapped a £65million price tag on Lukaku last summer and will ask for similar when suitors swoop in the coming months.\nLukaku, seen scoring against West Brom last weekend, will undoubtedly attract interest\n'The deal wasn't agreed, 99 per cent is not 100. They are still trying to get the contract over the line, that's what I know.\n'Every player has ambitions, likes to play for titles and the Champions League. That's a normal ambition. What we'd like to do is that Everton - if there's one club to make the next step - then it's Everton.\n'Everybody has seen the difference between this season and last, it's impossible to do it in one window, one season. It takes times.\n'If you can show good players who will make the team stronger that there is ambition, that the club is progressing, talk about a new stadium - that is enough stuff to see Everton are in a good direction.\nLukaku is set to be part of the Everton team that plays Hull City this weekend\n'I spoke with Rom about the project in the summer. I'm not afraid of his situation because the player has two years left on his contract.\n'What you don't like is the media talking about his contract every day. It's up to our board to have the deal done.\n'Everybody knows what can happen in football and you have to respect your contract.'","url":"https://www.dailymail.co.uk/sport/football/article-4320444/Everton-boss-Ronald-Koeman-blasts-Romelu-Lukaku.html"}
