{"authors":["Aditi Prakash"],"date_download":"2018-10-23 00:21:50","date_modify":"2018-10-23 00:21:50","date_publish":"2017-04-26 09:59:50","description":"Everton's impressive home form can help them defeat leaders Chelsea on Sunday, insists midfielder Morgan Schneiderlin. Everton have lost just one of their 17 league games at Goodison this season","filename":"data/vaneerConsumption/EvertonmanSchneiderlininsiststheywillbeatChelsea.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D913100000578-0-image-a-6_1493196553666.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4446882_Everton-man-Schneiderlin-insists-Toffees-beat-Chelsea_1540254110.html","title":"Everton man Schneiderlin insists they will beat Chelsea","title_page":"Everton man Schneiderlin insists they will beat Chelsea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Everton's impressive home form in the Premier League can help them defeat leaders Chelsea on Sunday, midfielder Morgan Schneiderlin insists.\nEverton have lost just one of their 17 league games at Goodison Park this season and are in sixth spot, six points behind Manchester City in fourth but after having played two games more.\n'Chelsea are a difficult team to beat but we are a match to anyone at home,' Schneiderlin told Sky Sports.\nMorgan Schneiderlin believes Everton's home form will see them defeat leaders Chelsea\n'When we play at our top at Goodison, no one can beat us. It will be hard for them on Sunday and we won't let them breathe, or have any space on the pitch.'\nChelsea's lead could be cut to four points if second-placed Tottenham Hostpur beat Crystal Palace on Wednesday and Schneiderlin said Spurs would be ready to pounce if the leaders slipped up.\n'Tottenham ... are a very strong team and, if Chelsea slip, they will be there,' he added.\n'Chelsea can't afford to lose and let points slip because there's a lion chasing them.'\nThe Blues are flying high and closing in on the Premier League title this season\nSchneiderlin also believes Tottenham will be ready to pounce should Chelsea slip at Goodison\nThe 27-year-old France international also believes Everton's results in their four remaining games can help them build momentum for next season.\n'We have to play for something; for the fans, for the badge and to have good momentum next season. They are behind us.'\nEverton were thrashed 5-0 at Stamford Bridge earlier in the campaign but beat the London side at Goodison Park last season.","url":"https://www.dailymail.co.uk/sport/football/article-4446882/Everton-man-Schneiderlin-insists-Toffees-beat-Chelsea.html"}
