{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:52:34","date_modify":"2018-10-30 18:52:34","date_publish":"2016-08-29 21:50:54","description":"TEL AVIV – The Qesem Cave, discovered by accident during road works outside Tel Aviv 16 years ago, is arguably the world’s foremost prehistoric site in the world, shedding light on how early humans lived and ate.","filename":"data/vaneerConsumption/EvidenceOfTheWorldsOldestBarbecueDiscoveredIn400000YearOldCaveOutsideTelAviv.json","image_url":"https://media.breitbart.com/media/2016/08/Qesem-Cave-excavation-site.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_29__1540925554.html","title":"Evidence Of The ‘World’s Oldest Barbecue’ Discovered In 400,000-Year-Old Cave Outside Tel Aviv","title_page":"Evidence Of The ‘World’s Oldest Barbecue’ Discovered In 400,000-Year-Old Cave Outside Tel Aviv | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The Qesem Cave, discovered by accident during road works outside Tel Aviv 16 years ago, is arguably the world’s foremost prehistoric site in the world, shedding light on how early humans lived and ate.\nA boulder that had been blocking the entrance to a giant limestone cave was blown up in a controlled explosion, exposing treasures that hadn’t seen the light of day in over 200,000 years.\nIn an article published on Sunday, Ynet news cited archaeology professor at Tel Aviv University, Ron Barkai, who is leading the dig at the cave.\nCalling it “a very special cave,” Barkai explained that its contents reflect a hitherto “unknown stage in the history of humanity. We don’t know which type of human lived here. We know that they acted differently than everyone else who lived in this area before them.”\n“They seem like a different type of human. They didn’t just behave differently, but they also looked differently. If we aren’t mistaken, they were more similar to us (humans today), and not their forefathers the Homo erectus,” he said.\nAvi Gofer, a fellow archeologist at the university who is also involved in the discovery, discusses the revolutionary nature of the Qesem finds.\n“What these people did here is completely different from what other humans were doing; in terms of chiseling technology, behavior, hunting techniques, organization, use of fire, and much more. In other words, there was an explosion of change (at Qesem Cave) and a lot of innovations,” he said.\nProfessor Torsten Otmeier of the University of Erlangen-Nuremberg, Germany, agrees with Gofer’s assertion.\n“This site is approximately 400,000 years old. If you look at what [early humans] did here, from their hunting strategies, the way they made their tools, and how they prepared their food, it points to one of the most important changes in the history of mankind. Before this era, early humans acted in a completely different manner. This site represents one of the most important turning points in the evolution of mankind,” he said.\nFor example, one of the larger discoveries that resulted from Qesem Cave was that cavemen apparently cooked meat and, in particular, had a taste for tortoise.\nBarkai said that one of the differences between Homo erectus and the type of humans found in the cave was in the tools and cutlery used.\n“They made flint knives alongside other large artifacts such as hand axes which enabled these early peoples to hold on to the tool with one hand and cut. These are the oldest examples of knives in the history of humanity,” he said.\n“By comparison,” he continued, “Europe only started seeing humans using knives 30,000 years ago. These knives were created 400,000 years ago. What happened here in Israel 400,000 years ago predates the rest of the world by hundreds of thousands of years. In the millions of years prior, there is no evidence of burnt bones (which suggest cooking). It seems these people ate cooked meat, meaning that Qesem Cave has evidence of the oldest barbecue ever held.”","url":"https://www.breitbart.com/middle-east/2016/08/29/evidence-of-the-worlds-oldest-barbecue-discovered-in-400000-year-old-cave-outside-tel-aviv/"}
