{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:53:33","date_modify":"2018-10-30 17:53:33","date_publish":"2016-09-07 00:48:13","description":"The U.S.-led air campaign’s focus on the Islamic State in the Middle East has helped a former al-Qaeda affiliate in Syria gain strength.","filename":"data/vaneerConsumption/ExAlQaedaAffiliateMaySoonEstablishIslamicState.json","image_url":"https://media.breitbart.com/media/2016/09/Fateh-al-Sham-front-former-al-nusra-al-qaeda-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_06__1540922013.html","title":"Ex Al Qaeda Affiliate May Soon Establish Islamic State","title_page":"Report: Ex Al Qaeda Affiliate May Soon Establish Islamic State","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S.-led air campaign’s primary focus on the Islamic State (ISIS/ISIL) in the Middle East has helped a former al-Qaeda affiliate in Syria gain strength, U.S. military officials and other analysts have acknowledged.\nJabhat al-Nusra, which declared in July that it was no longer affiliated with al-Qaeda after rebranding itself as Jabhat Fateh al-Sham, or JFS, (Front for the Conquest of the Levant), has benefited from its rival ISIS’s recent loss of territory to the U.S.-led coalition, reports Voice of America (VOA).\nThe declaration came soon after Brett McGurk, President Barack Obama’s special envoy for the U.S.-led alliance against ISIS, told lawmakers at the end of June that the group was flourishing and had become the “largest” al-Qaeda affiliate “in history.”\n“Most Western analysts dismiss JFS’s break with al-Qaida as a feint, seeing it as a long game the jihadist group has been playing for some time across the Middle East and Africa,” notes VOA.\nAs an independent group now, JFS is reportedly looking to establish its own so-called caliphate in the territory it controls in Syria.\nVOA notes:\nThere has long been a debate in the ranks of Jabhat al-Nusra about whether it should announce officially an emirate in territory it controls in northern Syria, mainly in the province of Idlib to the west of the besieged city of Aleppo. The group’s leader, Mohammad al-Julani, suggested in a posted audio recording in July 2014 that it was about to do so.\nThe former al-Qaeda affiliate, now known as JFS, continues to fight the Islamic State, also known as IS, for territory and influence.\nVOA explains:\nFor tactical reasons, apparently mainly focused on avoiding disrupting relations and cooperation with other rebel militias in Syria, the group — made up mainly of Syrian jihadists — has held off. But emirate-building aspirations appear once again to dominate much of its recent propaganda and, as IS is pushed back more and more, Jabhat Fateh al-Sham has been boosting its criticism of rival jihadists while also engaging more directly with Western media. The propaganda operations are being overseen by an Australian jihadist preacher, the self-styled Sheik Mostafa Mahamed, who last month appeared on British television to show videos of formally fractured rebel groups fighting together under the banner of the JFS.\nDespite breaking formal ties to al-Qaeda, some analysts argue that the formation of a JFS Islamic state in Syria would be a “major win” for al-Qaeda, points out Foreign Policy (FP).\nJFS featured al-Qaeda-linked Sheikh Abdallah Muhammad al Muhaysini, a Saudi cleric and a highly influential jihadist ideologue in Syria, in one of its recent propaganda videos accusing ISIS of having Muslim blood on its hands and being heretical, notes VOA.\nThe FP article — authored by Jennifer Cafarella and Genevieve Casagrande of the Washington-based Institute of the Study of War, a think tank, and Nicholas Heras of the Center for a New American Security — argues that al-Qaeda is gaining strength in Syria.\nThey expressed concern that inaction from the United States in defense of the eastern half of Aleppo province “may inadvertently be paving the way for Syria’s next Islamic State.”\nEchoing the VOA report, written testimony submitted to U.S. lawmakers on June 28 by Obama’s McGurk said:\nIn Syria, as ISIL is losing territory in the east, its terrorist rival – Jabhat al-Nusra – is gaining ground in the west, putting down roots in Idlib province along the Turkish border. Nusra is establishing schools and training camps, recruiting from abroad, launching major military operations, and enjoying a sophisticated online presence, all the while providing safe haven for some of al Qaida’s most experienced terrorists. With direct ties to Ayman al Zawahiri, Osama Bin Laden’s successor, Nusra is now al Qaida largest formal affiliate in history.\nAccording to the U.S. State Department, the strength of the affiliate is unknown. U.S. military officials have acknowledged that the former al-Qaeda affiliate has advanced and become more potent, capitalizing on the chaos in war-ravaged Syria and the American-led coalition’s focus on ISIS.\n“Now, al-Nusra Front and [ISIS] don’t get along… I guess you could say to the extent that we’re weakening [ISIS], maybe it benefits al-Nusra Front,” Lt. Gen. Sean MacFarland, the top U.S. commander in Iraq, conceded during a press conference in February.\nBesides fighting ISIS, JFS has also taken on the Russian and Iranian-backed regime of Syrian dictator Bashar al-Assad.\nVOA notes that the group played a “key role in defending eastern Aleppo from a massive Russian and Iranian-backed Assad regime offensive.”","url":"https://www.breitbart.com/national-security/2016/09/06/former-al-qaeda-affiliate-may-soon-establish-islamic-state-syria/"}
