{"authors":["Brandon Riddle"],"date_download":"2018-10-30 21:35:30","date_modify":"2018-10-30 21:35:30","date_publish":"2017-04-20 00:00:00","description":"A lawsuit filed by a former high school football player in Arkansas who claims his civil rights were violated has moved to federal court.","filename":"data/vaneerConsumption/ExArkansashighschoolfootballplayerssuitclaimingcivilrightsviolationsmovestofederalcourt.json","image_url":"https://media.arkansasonline.com/img/photos/2017/04/20/136604987_AN-FBH-HERT-FAY_004_ORIG_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_jun_28_ex-arkansa_19c5be55a3f8373360409dc4853ab217__page=1_1540935330.html","title":"Ex-Arkansas high school football player's suit claiming civil-rights violations moves to federal court","title_page":"Ex-Arkansas high school football player's suit claiming civil-rights violations moves to federal court","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Fayetteville High School tailback Terrance Rock (9) makes a play during a football game in October. Rock sued Centerton and a number of police officers in Washington County Circuit Court alleging wrongful arrest, malicious prosecution and other state and federal civil rights claims.\nA lawsuit filed by a former high school football player in Arkansas who claims his civil rights were violated has moved to federal court.\nTerrance Rock is suing the city of Centerton and a number of police officers, accusing officials of a wrongful arrest, malicious prosecution, violation of due process and vision of privacy, the Northwest Arkansas Democrat-Gazette reported.\nRock, then a senior at Fayetteville High School, was arrested in November in connection with the September robbery of a Centerton resident, who reported speakers, a cellphone charger and two watches stolen.\nRecords show he was released on $10,000 bail one day after his arrest.\nCharges against Rock were later dismissed after the Center Police Department acknowledged wrongfully arresting the student-athlete.\nOfficials in the Northwest Arkansas town of around 11,000 residents have denied the accusations and have asked for a dismissal of the suit.\nThe suit seeks $750,000 in damages on the due process claim and an unspecified amount of compensation on other claims, the newspaper reported.","url":"https://www.arkansasonline.com/news/2017/jun/28/ex-arkansas-high-school-football-players-suit-clai/?page=1"}
