{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:28:08","date_modify":"2018-10-30 22:28:08","date_publish":"2016-12-13 00:00:00","description":"Jenkins started his own fintech venture, 10x Future Technologies, in October.","filename":"data/vaneerConsumption/ExBarclaysCEOAntonyJenkinsisjoiningtheboardofBlockchain.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_former-barclays-ceo-antony-jenkins-blockchain-board-fintech-2016-12_1540938488.html","title":"Ex-Barclays CEO Antony Jenkins is joining the board of Blockchain","title_page":"    Former Barclays CEO Antony Jenkins joining the board of Blockchain - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Former Barclays CEO Antony Jenkins. AP Photo/Alastair Grant, File LONDON — Former Barclays CEO Antony Jenkins is joining the board of fast-growing startup Blockchain, his second foray into fintech in recent months.\nJenkins says in a press release announcing the appointment on Tuesday: \"Blockchain technology has the potential to reinvent the way we use money and contribute to a finance system that's high quality, low cost, secure, fair and transparent. I am proud to join a company playing a pivotal role in ushering in a new era.\"\nJenkins' decision to join the board comes two months after he unveiled a fintech startup of his own, 10x Future Technologies. The startup is working on a cloud-based core banking system — the technology that allows banks to hold deposits and accounts — and has already signed a deal with Virgin Money.\nJenkins was CEO of Barclays for three years until he was ousted in 2015. Since leaving the bank he has been vocal about the potential of the nascent fintech industry, predicting an \"Uber-moment\" for banking. He met Blockchain CEO Peter Smith at a dinner around 8 months ago, according to Smith.\nLondon-based Blockchain provides software for people to construct their own bitcoin wallets on their computers and recently opened its 10 millionth wallet.\nBlockchain CEO and cofounder Peter Smith told Business Insider over the phone on Tuesday morning: \"For me, it's the opportunity to learn how to run a really complex business from someone who's done it before. Our business every year gets much more complicated and much more global. I've never really run that kind of thing.\"\nBlockchain employs around 25 people in London but also has offices in Luxembourg and New York. The company is the world's biggest provider of digital wallets for bitcoin, with over 50% market share, and processes over 150,000 transactions a day on average. It has raised over $30 million (£23.9 million) to date.\nSmith adds: \"Then on his side, I think it's about learning about the technology and learning what it looks like to be the director of a technology company rather than a bank.\n\"I think Antony looked at a lot of opportunities since the end of Barclays. He had a lot of things he could go do but I think he was excited about this because of his super technology focus.\"\nBlockchain's product is based around blockchain (small b) technology, also known as distributed ledger technology (DLT). DLT was first developed to underpin the digital currency bitcoin and uses complex cryptography to allow strangers to safely and securely transact with each other, cutting out the need for trusted intermediaries such as banks.\nBanks themselves are excited by the technologies potential in traditional finance, cutting costs by allowing banks to do things like settlement and clearing between each other rather than working through clearing banks and other intermediaries.\nJenkins says in a LinkedIn blog post on Tuesday: \"The ramifications of Blockchain's technology are potentially enormous. Traditional banks' record-keeping function would no longer need to exist, because this could be transferred to a digital system.\"","url":"https://www.businessinsider.com/former-barclays-ceo-antony-jenkins-blockchain-board-fintech-2016-12"}
