{"authors":["Press Association"],"date_download":"2018-10-23 02:08:45","date_modify":"2018-10-23 02:08:45","date_publish":"2016-01-11 13:54:18","description":"A former senior trader at Deutsche Bank has been ordered to pay a £1 million bail security after being accused of involvement in rate rigging. Christian Bitt...","filename":"data/vaneerConsumption/Exbanktraderaccusedoverrateriggingtoldtopay1mbailsecurity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-eee5ac8c-cddd-493d-a4cd-55b85c95599c-48qEJGFphM8d437f0aaf9259cfae-369_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393891_Ex-bank-trader-accused-rate-rigging-told-pay-1m-bail-security_1540260525.html","title":"Ex-bank trader accused over rate rigging told to pay £1m bail security","title_page":"Ex-bank trader accused over rate rigging told to pay £1m bail security | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ex-bank trader accused over rate rigging told to pay £1m bail security\nA former senior trader at Deutsche Bank has been ordered to pay a £1 million bail security after being accused of involvement in rate rigging.\nChristian Bittar, 44, appeared at Westminster Magistrates' Court on the day before his birthday, represented by David Cameron's brother, Alex Cameron QC.\nHe is accused, along with 10 other people, of conspiracy to defraud between 2005 and 2009.\nChristian Bittar appeared at Westminster Magistrates' Court accused of conspiracy to defraud between 2005 and 2009\nThe accused - six from Deutsche Bank, four from Barclays, and one from Societe Generale - are the first to face criminal proceedings as a result of an investigation by the Serious Fraud Office (SFO) into the alleged manipulation of the Euro Interbank Offered Rate (Euribor).\nFour of them appeared in court, and spoke only to confirm their identities.\nAchim Kraemer, 51, from Germany, was ordered to pay a security of £100,000. The court heard he still works for Deutsche Bank.\nOther Deutsche Bank employees who were due to face charges did not attend the hearing.\nThey are: Ardalan Gharagozlou, Andreas Hauschild, Joerg Vogt, and Kai-Uwe Kappauf.\nSociete Generale banker Stephane Esper, from Germany, was also not present to face charges.\nColin Bermingham, 59, from Aldeburgh, Suffolk; Carlo Palombo, 37, from California, US; Philippe Moryoussef, 47, of Singapore, and Sisse Bohart, 38, who gave an address in Denmark, all from Barclays, also appeared in court.\nDeputy chief magistrate Emma Arbuthnot ordered the two men who live overseas to pay a bail security of £150,000 each, while Bohart was ordered to pay £50,000.\nBermingham was granted bail on the conditions that he surrenders his travel documents, reports weekly at a police station. A condition of residence at his home address was also imposed.\nIt is alleged that there was collusion to manipulate the rates between separate banks, as well as a collusion between people at the same bank.\nBittar, Bermingham, Polombo, Moryoussef, Kraemer and Bohart are due to next appear at Southwark Crown Court on January 13.\nLast November the SFO said criminal proceedings would be \"issued against other individuals in due course\".\nEuribor is the rate at which eurozone banks borrow funds from one another.\nA number of bankers have already been charged with manipulating the Libor rate.\nLibor, the London Interbank Offered Rate, is the rate that leading banks in London borrow funds from each other.","url":"https://www.dailymail.co.uk/wires/pa/article-3393891/Ex-bank-trader-accused-rate-rigging-told-pay-1m-bail-security.html"}
