{"authors":[],"date_download":"2018-10-22 20:58:46","date_modify":"2018-10-22 20:58:46","date_publish":"2014-06-03 20:00:56","description":"Capt. Gregory McWherter was found guilty of violating two articles under the military's code of justice during nonjudicial proceedings.","filename":"data/vaneerConsumption/ExBlueAngelsCommanderReprimandedforWorkplaceBehavior.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485271/140603-blue-angels-gregory-mcwherter-1607_052caaf44f4d5db67a54e172185c381b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_ex-blue-angels-commander-reprimanded-workplace-behavior-n121621_1540241926.html","title":"Ex-Blue Angels Commander Reprimanded for Workplace Behavior","title_page":"Ex-Blue Angels Commander Reprimanded for Workplace Behavior","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA former Blue Angels commander tolerated inappropriate sexual comments and pornographic images in the workplace during his time as leader of the famed precision flying team and will be given a letter of reprimand, the Navy said Tuesday.\nCapt. Gregory McWherter was found guilty of violating two articles under the military's code of justice during nonjudicial proceedings convened Monday in Pearl Harbor, Hawaii. The articles were failure to obey an order or regulation and conduct unbecoming of an officer by fostering a hostile command climate and failing to stop \"obvious and repeated instances of sexual harassment, condoning widespread lewd practices within the squadron and engaging in inappropriate and unprofessional discussions with his junior officers,\" the Navy said in a statement.\nThe punitive letter will go in McWheter's permanent file and is widely seen as a career-ender in the service. McWherter told Navy officials he did not wish to speak to the media, said Cmdr. Kevin Stephens, a spokesman at Naval Air Forces.\nMcWheter was relieved in April from his duty as executive officer of Naval Base Coronado in California amid the allegations during his second stint as the Blue Angels' leader from May 2011 to November 2012. The Navy said it did not find problems during his first stint as the flying team's commanding officer from 2008 to 2010.\n\"The investigation concluded that McWherter witnessed, condoned, and encouraged behavior that, while juvenile and sophomoric in the beginning, ultimately and in the aggregate, became destructive, toxic, and hostile,\" the Navy said in a statement.\nThe Navy said investigators found no evidence the behavior lead to sexual assault.\nThe complaint filed with the Navy's inspector general against McWherter alleged \"lewd speech, inappropriate comments, and sexually explicit humor were allowed in the workplace\" and in some cases \"encouraged\" by the commanding officer, and \"pornographic images were displayed in the workplace and shared in electronic communications.\"\n--The Associated Press","url":"https://www.nbcnews.com/news/us-news/ex-blue-angels-commander-reprimanded-workplace-behavior-n121621"}
