{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:22:24","date_modify":"2018-10-30 21:22:24","date_publish":"2016-12-21 00:00:00","description":"Mark Lyttleton personally managed assets worth about £4.5 billion ($5.6 billion) at his peak.","filename":"data/vaneerConsumption/ExBlackRockfundmanagerMarkLyttletonsentencedto12monthsinjailforinsiderdealing.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ex-blackrock-fund-manager-mark-lyttleton-sentenced-to-12-months-in-jail-for-insider-dealing-2016-12_1540934544.html","title":"Ex-BlackRock fund manager Mark Lyttleton sentenced to 12 months in jail for insider dealing","title_page":"    Ex-BlackRock fund manager Mark Lyttleton sentenced to 12 months in jail for insider dealing - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Lyttleton managed a £4.5 billion fund at BlackRock. REUTERS/Toru Hanai LONDON — A former fund manager at the London division of the asset manager BlackRock on Wednesday was sentenced to 12 months in jail after pleading guilty to two counts of insider dealing.\nMark Lyttleton admitted buying shares shortly before the public announcements about EnCore Oil and Cairn Energy after hearing privileged information from colleagues.\nLyttleton, who was arrested in 2013, dealt through an overseas asset manager trading on behalf of a Panamanian-registered company. As well as using an overseas shell company, registered in his wife's maiden name, Lyttleton also tried to cover his track by using an unregistered mobile.\nLyttleton is one of the highest profile figures in Britain to be sentenced for insider trading. His funds were popular with investors during the financial crisis as he posted positive returns and at the peak he personally managed assets worth about £4.5 billion ($5.6 billion). The fund manager gained the insider information during the course of his work at BlackRock.\nMark Steward, executive director of enforcement and market oversight at the Financial Conduct Authority, said in an emailed statement: \"Lyttleton's insider dealing involved a gross abuse of the trust placed in him as a senior fund manager.\n\"He tried to hide his misconduct through the use of unregistered mobile phones and setting up a company in his wife's maiden name in an overseas jurisdiction. None of this meant he could avoid detection.\n\"Those who are tempted to insider deal, especially financial industry professionals, must know now they are more likely to be caught than ever before and, when caught, they will likely face a custodial sentence.\"","url":"https://www.businessinsider.com/ex-blackrock-fund-manager-mark-lyttleton-sentenced-to-12-months-in-jail-for-insider-dealing-2016-12"}
