{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:00:23","date_modify":"2018-10-30 20:00:23","date_publish":"2015-07-29 02:19:49","description":"The Montana and Wyoming Rockies were hit with what forecasters have called an \"exceptional\" and rare July cold front and heavy snowfall.","filename":"data/vaneerConsumption/ExceptionalColdFrontSlamsMontanaWyomingMountainsWithRareJulySnowPack.json","image_url":"https://media.breitbart.com/media/2015/07/Jackson-Hole-Mountain-Resort-Wyoming-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_28__1540929623.html","title":"'Exceptional' Cold Front Slams Montana, Wyoming Mountains With Rare July Snow Pack","title_page":"'Exceptional' Cold Front Slams Montana, Wyoming Mountains With Rare July Snow Pack","title_rss":"NULL","source_domain":"breitbart.com","text":"The Montana and Wyoming Rockies have been hit with what forecasters have called an “exceptional” and rare July cold front that has blanketed the region in a heavy snowfall.\nThe cold front deposited up to eight inches in some parts of the northern Rockies above the 8,000 feet elevations in Montana, Wyoming, and Idaho.\nThe weather system is so unusual that the National Weather Service (NWS) forecast office in Billings said, “This pattern should not happen in July.”\nGet this: July 27, 3pm in Missoula, 47 degrees! Normally warmest week of the year #ironic #brrr Not to worry, 90s by end of the week. #MTwx — NWS Missoula (@NWSMissoula) July 27, 2015\nOthers agreed. “In my 27 years as the chief meteorologist for KXLF/KBZK, I have only reported a few times that snow is falling in SW Montana in July,” said Montana TV meteorologist Mike Heard. “Today [Monday] is one of those days.” The same weather system brought heavy storms and tornado conditions in other areas of the western plains.\nHow unusual is this cold front? The forecast winds 2000 feet above the surface haven’t been seen in quite awhile! pic.twitter.com/nVxcXrKR53 — NWS Billings (@NWSBillings) July 27, 2015\nFollow Warner Todd Huston on Twitter @warnerthuston, or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2015/07/28/exceptional-cold-front-slams-montana-wyoming-mountains-with-rare-july-snow-pack/"}
