{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:08:16","date_modify":"2018-10-30 21:08:16","date_publish":"2015-11-17 10:52:48","description":"To fight an aggressive Islamic State, the U.S. and European countries should seriously consider adapting the Israeli Mossad model.","filename":"data/vaneerConsumption/EXCLUSIVEUSWarnedByExMossadChiefTimeForArmedGuardsAtCafesMallsandClubs.json","image_url":"https://media.breitbart.com/media/2015/01/c730c49962ccd7036b0f6a7067004531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_17__1540933696.html","title":"EXCLUSIVE - U.S. Warned By Ex-Mossad Chief: Time For Armed Guards At Cafes, Malls and Clubs","title_page":"EXCLUSIVE - U.S. Warned By Ex-Mossad Chief: Time For Armed Guards At Cafes, Malls and Clubsx-Mossad Chief Warns U.S. - Time For Armed Guards At Cafes, Malls and Clubs","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV, Israel – The U.S. and European countries should seriously consider adapting the Israeli model of combatting terrorism in order to fight an increasingly aggressive Islamic State, former Mossad chief Shabtai Shavit told Breitbart Jerusalem.\nThese measures include deploying armed guards to protect soft targets like restaurants, shopping centers, and movie theaters.\n“You have to strike the right balance between defense and offense,” posited Shavit, who led Israel’s Mossad intelligence agency from 1989 to 1996. “If you adopt only the defensive strategy, pretty soon you realize that your investments achieve a prohibitive level.”\nShavit argued that the coordinated terrorist attacks in Paris last Friday need to be analyzed in the wider context of other purported ISIS assaults over the past week. These include the group’s claim that it downed a Russian airliner over Egypt, as well as a double suicide attack in Beirut on Thursday.\nThese three events, said Shavit, indicate a change in ISIS strategy. “Until recently, ISIS was involved in killing other Arabs and Muslims, but now they have made a strategic change in their strategy. They have decided to go after what they call the infidels, and kill not only Arabs and Muslims but also Europeans and others.”\n“Being able to perpetrate all of these terrorist attacks within one week in territories very far from each other indicates a high level of capability and preparedness,” he said.\nShavit stated that the U.S. and Europe should utilize the Israeli model of fighting terrorism, which consists of three main elements:\nIntelligence. “The more intelligence you have, the smaller the threat you will have to face,” said Shavit. “And because of that, any investment in improving intelligence is worthwhile and proves itself every time.”\nDefense: “The Israeli strategy consists of guards at each and every mall, train station, and so on and so forth,” he said.\nOffense: Take the war directly to ISIS strongholds, perhaps by aiding Kurdish and moderate Sunni Arab ground forces with airstrikes.“My advice, if asked, is to develop a comprehensive strategy consisting first and foremost of good intelligence and then the right balance between offensive and defensive measures,” said Shavit. He also criticized the Western powers for failing to adequately arm the Kurds.\n“I want to point to the Kurds, whom I know in person,” he said. “They are the most courageous warriors in that part of the world and had the West, namely the U.S. and European countries, given them enough armored vehicles and tanks, the Kurds could have been the arm that fights ISIS directly on the ground with the cooperation of Western air forces. Together, they can do the work and achieve the aim I described to you.”","url":"https://www.breitbart.com/national-security/2015/11/17/u-s-warned-by-ex-mossad-chief-time-for-armed-guards-at-cafes-malls-and-clubs/"}
