{"authors":["Rep. Jeff Duncan"],"date_download":"2018-10-30 19:13:42","date_modify":"2018-10-30 19:13:42","date_publish":"2015-05-12 17:22:03","description":"What has President Obama done to earn my trust and the trust of the American people over the past six years? The answer: nothing. |","filename":"data/vaneerConsumption/ExclusiveJeffDuncanVoteNoonTPA.json","image_url":"https://media.breitbart.com/media/2015/04/Obama-I-do-what-I-want-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_12__1540926822.html","title":"Exclusive - Jeff Duncan: Vote 'No' on TPA","title_page":"Exclusive - Jeff Duncan: Vote 'No' on TPA | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama is requesting Trade Promotion Authority (TPA), also known as “Fast Track Authority” to assist him with negotiating the Trans-Pacific Partnership (TPP) and other trade deals. The Administration is asking Congress for this extraordinary power, abdicating some of the traditional Congressional involvement, so that this huge trade deal might be consummated.\nFor the record, I am generally a free-trade supporter as long as we’ve negotiated a fair deal. Helping U.S. businesses gain broader access to foreign markets, while also ensuring that Americans have access to affordable foreign-made consumer goods just makes sense when compared with higher tariffs and American businesses being shut out of certain markets for their products.\nWhat is in this agreement known as TPP? I, as a United States Congressman, can read the negotiations. However, in order to read them, I must be in a classified reading room in the Capitol, sign a non-disclosure agreement which assures that I will not discuss the contents of what I have read, and I am allowed to take notes, but I have to leave them in the room.\nI represent over 700,000 U.S. citizens in the Third District of South Carolina. As a federal representative, the votes I cast truly affect all Americans. My constituents expect that I make informed decisions. They also expect me to communicate with them about issues which affect them, their families, and their livelihoods.\nI ask this of the supposedly “most transparent Administration in history:”\nWhat has President Obama done to earn my trust and the trust of the American people over the past six years?\nThe answer: nothing.\nThe Administration misled the American people in September 2012 about the attacks in Benghazi which led to the deaths of four brave Americans in an attempt to further the narrative that terrorism was on the run in order to win an election a few short weeks later.\nThe Administration used the IRS to target political enemies.\nThe Justice Department was used to intimidate conservative leaning journalists.\nObamaCare was crafted in back rooms with a lot of rulemaking authority given to unelected bureaucrats at HHS.\nPresident Obama released five Taliban terrorist leaders in exchange for a deserter.\nThe Administration is negotiating with Iran (without preconditions?) resulting in a bad deal for freedom and ensuring that Iran will have a nuclear weapon at some point in the future.\nThe Administration has turned its back on Israel, recently snubbing Prime Minister Benjamin Netanyahu and possibly sending campaign support to work against him in the recent Israeli elections.\nThey have usurped the U.S. Congress by signing an Executive Memo granting amnesty to illegal immigrants while also failing to secure our nation’s southern border.\nAnd the list goes on.\nSo the question remains: what has this Administration done to earn our trust with so much authority? Again, nothing.\nSupporters of giving Fast Track Authority to the President will argue that the legislation contains safeguards to ensure that the President honors his commitments to Congress. However, in the past when this President has broken his word and overstepped his authority, when has Congress ever stepped up to stop him?\nThese are my concerns and this is why I cannot support giving Fast Track Authority to this President under these conditions.\nRepublican Jeff Duncan represents South Carolina’s third congressional district.","url":"https://www.breitbart.com/politics/2015/05/12/exclusive-jeff-duncan-vote-no-on-tpa/"}
