{"authors":["Dustin Stockton"],"date_download":"2018-10-30 21:43:45","date_modify":"2018-10-30 21:43:45","date_publish":"2016-04-26 12:00:24","description":"Rep. Ron DeSantis (R-FL), a conservative running for the GOP nomination to replace Marco Rubio in the U.S. Senate in November, called out his own party’s leadership for its failure to hold the IRS accountable, years after the agency refused to comply with congressional investigations into its targeting of conservative groups. | Politics","filename":"data/vaneerConsumption/ExclusiveRepRonDeSantisPaulRyansGOPLeadershipTeamFearsBeltwayMediaIsntHoldingIRSAccountable.json","image_url":"https://media.breitbart.com/media/2016/04/Desantiis2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_26__1540935825.html","title":"Exclusive - Rep. Ron DeSantis: Paul Ryan’s GOP Leadership Team Fears Beltway Media, Isn't Holding IRS Accountable","title_page":"Exclusive — Rep. Ron DeSantis: Paul Ryan’s GOP Leadership Team Fears Beltway Media, Isn't Holding IRS Accountable | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TAMPA, Florida — Rep. Ron DeSantis (R-FL), a conservative running for the GOP nomination to replace Marco Rubio in the U.S. Senate in November, called out his own party’s leadership for its failure to hold the IRS accountable, years after the agency refused to comply with congressional investigations into its targeting of conservative groups.\nDeSantis is part of a small group of conservatives in the House pushing to impeach IRS commissioner John Koskinen. He tells Breitbart News that House Speaker Paul Ryan’s leadership team has backed down from holding Koskinen accountable.\n“I think what’s holding it back, I think the leadership is worried about being criticized by inside the Beltway media and stuff,” Desantis told Breitbart News at a gun show here. “We are going to try to force the issue potentially in a way that at least people have to go on the record, look I think if Republicans have to go on the record on it, it will sail through because no one wants to be defending a recalcitrant IRS commissioner.”\nDeSantis and some other conservative members in the House Freedom Caucus, which is chaired by the Rep. Jim Jordan (R-OH), are planning to lead an effort this week to force the issue. In mid-April, a band of Freedom Caucus members took to the House floor to lead a special order to call attention to the fact that leadership has thus far ignored the matter.\nRyan’s leadership team, in many ways, has frustrated conservatives nationwide because of his unwillingness to pick a fight with President Barack Obama on issues ranging from government overregulation to agency power abuse and transparency to Muslim refugee resettlement to immigration to trade to budget matters. Despite grassroots conservatives’ dissatisfaction with Ryan in his early days as Speaker, however, most conservatives inside Congress have thus far been unwilling to challenge him. But that’s starting to change—and much faster than it did for now former Speaker John Boehner, who Ryan replaced.\nThe Puerto Rico bailout issue led to Rep. John Fleming (R-LA) speaking out against leadership. Ryan’s team’s aggressive lobbying of members on the bailout, including an outrageous request that they look the other way and say nothing as Ryan’s allies forced the bailout through the Natural Resources Committee on a voice vote, has sparked tensions.\nNow, Ryan’s unwillingness to impeach Koskinen is becoming an issue within the conference. DeSantis is planning to find a way to move forward with his and his conservative colleagues’ efforts to press for accountability inside the IRS.\n“We just had tax filing season and you can ask any tax payer that if the IRS audited them and they subpoenaed documents and you destroyed the documents they wanted, if you lied to the IRS or you refused to comply with the audit in any other way, you’d never be able to get away with that,” DeSantis told Breitbart News.\nAnd yet, that’s how the IRS has behaved with Congress when we’re trying to get the truth about the targeting investigation.They destroyed 24,000 emails that were under two congressional subpoenas, the commissioner has come to Congress and made multiple false statements. They didn’t even do basic due diligence to even try to find anything. They didn’t even look at Lerner’s Blackberry. So what we’ve been doing, me and probably about thirty to forty of my colleagues, is you cannot have a situation where the head of this powerful agency operates under a lower standard of conduct than that which is expected of tax payers he is empowered to audit. I think he has breached the public trust and I think we need to use the power of impeachment of civil officers to impeach the IRS commissioner and remove him from office. So we have filed those articles and we are pushing to get those heard as soon as possible, we haven’t had luck yet with the leadership but we’re not quitting we’re going to continue to push the issue. I think the American people are so sick of you know government imposes all these rules on them and if they run afoul to it there are consequences, yet, the people in positions of power, they are never held accountable and that just cannot last.\nThis is hardly the first time since President Obama has been in office that there’s been a showdown between not just the administration and congressional Republicans over a lingering scandal, but also between congressional conservatives and their leadership. Back when Boehner resisted holding then Attorney General Eric Holder accountable for the Operation Fast and Furious scandal, it was a band of unlikely rebels who began calling for Holder’s resignation that eventually forced Boehner—months later—to allow a vote to hold Holder in both criminal and civil contempt of Congress for covering up the documents under subpoena. After years of legal battles thanks to the civil contempt resolution, Congress has finally started breaking through Holder’s obstruction—and President Obama’s wrongful use of executive privilege to hide the documents.\nThen, after the Benghazi scandal, Boehner held out as long as he could before eventually allowing for the creation of the Benghazi Select Committee—chaired by Rep. Trey Gowdy (R-SC)—under enormous pressure and a discharge petition just a few signatures away from being able to force the creation of the committee without Boehner’s approval anyway.\nThose battles laid the groundwork for Boehner’s eventual ouster, as it was during that timeframe that coalitions formed among various unlikely allies throughout the GOP conference in which they tried two times unsuccessfully to remove him as Speaker. On the third go-around, though, conservatives had amassed enough votes to force Boehner to resign before a special resolution from Rep. Mark Meadows (R-NC) that would have removed him whether he wanted to leave or not was brought to the floor. Boehner literally resigned moments after he found out that conservatives had enough votes to pull him out of office thanks to Meadows’ vacate the chair resolution.\nNow, DeSantis is moving forward with this plan to hold Koskinen accountable. H says he isn’t looking for a fight with Ryan. But if Ryan stands in his way, this could be deja vu all over again in the House at it could set up the beginnings of yet another one of those epic showdowns between Republicans and Obama—and between conservatives and leadership.\n“Normally thirty years ago if someone got a subpoena they would produce the documents but now the bureaucracy has figured out, we don’t gotta do anything for congress we can just do what we want, why would we comply?” DeSantis told Breitbart News. “That’s the attitude they have and their getting away with it. So what we’re trying to do is say that that attitude is unacceptable and we need to hold someone accountable. The thing is it would be good for the IRS to do that but it’d also sends a signal to everyone else in the bureaucracy that if you guys get over your skies, Congress is going to use the authority that it has.”\nDeSantis implored grassroots conservatives across the country to join his cause—and he gave them explicit instructions on how to do so.\n“You need to contact your member of congress and you need to tell them to cosponsor the articles of impeachment that have been filed against the IRS commissioner,” DeSantis said.","url":"https://www.breitbart.com/politics/2016/04/26/exclusive-rep-ron-desantis-paul-ryans-gop-leadership-team-fears-beltway-media-isnt-holding-irs-accountable/"}
