{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:59:44","date_modify":"2018-10-30 19:59:44","date_publish":"2016-10-11 02:41:43","description":"The Republican congressman from Montana told Breitbart News Monday that he is very disturbed by the lewd tape of Donald J. Trump, but still supports his party's nominee for president. | Politics","filename":"data/vaneerConsumption/ExclusiveNavySEALRepZinkeTrumpShouldBeAshamedofLewdTalkbutisPreferabletoHillaryClinton.json","image_url":"https://media.breitbart.com/media/2016/10/GettyImages-577295674.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_10__1540929584.html","title":"Exclusive–Navy SEAL Rep. Zinke: Trump ‘Should Be Ashamed’ of Lewd Talk, but is Preferable to Hillary Clinton","title_page":"Exclusive--Navy SEAL Rep. Zinke: Trump 'Should Be Ashamed' of Lewd Talk, but is Preferable to Hillary Clinton | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Republican congressman from Montana told Breitbart News Monday that he is very disturbed by the lewd tape of Donald J. Trump, but still supports his party’s nominee for president.\n“What Mr. Trump said was wrong,” said Rep. Ryan Zinke (R.-Mont.). “There is no other way to say it. He should be ashamed. But, that doesn’t make Hillary any better a candidate.”\n“What we face everyday is a bureaucracy that’s grown out of control, a government that have become separated and is no longer held accountable to the people,” he said. “This is a unique election in the history of our country.”\n“As much as anything else, this is a people’s election–that’s really the essence of the Trump candidacy,” he said.\n“It’s the rise of Americans, who are angry at signs that they see the greatness of America fading and they not longer have trust for the government,” he said.\nClinton represents the political elite that is telling Americans that their concerns are trivial, said the retired Navy SEAL officer. “She’s the one who said it is OK to have a public position and say something else in private–that is exactly what is wrong with our government,” Zinke said.\nThe congressman said he was not on the conference call with Speaker Paul D. Ryan (R.-Wis.), when Ryan said he would not defend or campaign with Trump.\nOn the call, Ryan told the congressmen to look out for themselves and not to feel loyalty to Trump.\nThe combat veteran of the war in Iraq, who was the acting commander of more than 3,000 special operations personnel at Combined Joint Special Operations Task Force–Arabian Peninsula, said he knew nothing whatsoever about plans rumored to have been originated with the speaker replace Trump from the top of the ticket with Indiana Gov. Michael Pence, who is Trump’s vice-presidential running mate.\nAlthough, Zinke said he still supports Trump, he understands members of Congress, who feel they have to represent their own districts.\n“Sometimes representing your district is more important that representing your party,” he said. “In Montana, Trump won soundly, but so did Bernie Sanders,” he said. The Treasure State primary was held June 7 with Trump taking 74 percent of the vote. On the Democratic side the Vermont senator beat Clinton with 51 percent of the vote to her 47 percent.\nZinke said one of the things that frustrate Americans is the lack of accountability with public officials.\nBut, during Sunday’s debate, Trump owned up to what he said on that tape, he said. “I felt he felt accountable,” he said.\nThe Montana congressman said Trump’s contrition was in contrast to Clinton’s refusal apologize or provide answer for why she told an audience that it was acceptable to hold a public position and a private position other than it was what President Abraham Lincoln did to pass the 13th Amendment ending slavery. Zinke said the comparison between “Honest Abe” and Clinton was ridiculous.","url":"https://www.breitbart.com/politics/2016/10/10/zinke-backs-trump-over-clinton/"}
