{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:04:04","date_modify":"2018-10-30 21:04:04","date_publish":"2017-03-06 15:48:39","description":"Speaking from Jerusalem in a Breitbart Jerusalem exclusive interview, Congressman Ron DeSantis (R-FL) strongly rejected Palestinian threats regarding...","filename":"data/vaneerConsumption/EXCLUSIVERepRonDeSantisTrumpShouldIgnorePalestinianThreatsOverMovingEmbassytoJerusalem.json","image_url":"https://media.breitbart.com/media/2017/03/Ron-DeSantis-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_06__1540933444.html","title":"EXCLUSIVE - Rep. Ron DeSantis: Trump Should Ignore Palestinian Threats Over Moving Embassy to Jerusalem","title_page":"EXCLUSIVE – Rep. Ron DeSantis: Trump Should Ignore Palestinian Threats Over Moving Embassy to Jerusalem","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Speaking from Jerusalem in a Breitbart Jerusalem exclusive interview, Congressman Ron DeSantis (R-FL) strongly rejected Palestinian threats regarding the possibility of the U.S. moving its embassy from Tel Aviv to Jerusalem.\nDeSantis, chairman of the subcommittee for National Security for the House Oversight Committee, was in Israel on Saturday and Sunday with a small delegation as part of a fact-finding tour to study the possibility of relocating the U.S. Embassy to Jerusalem.\nIn response to his visit, Ziad Khalil Abu Zayyad, a spokesman for Palestinian Authority President Mahmoud Abbas’s Fatah Party warned, the “US Congress should understand that moving the US embassy to Jerusalem will explode the situation in the Mena region (Middle East and North Africa.”\n“This same team should consult with its military and political consultants in the (U.S.) State Department that stated several times in the past that (such) actions put American interests and presence in the region in danger,” Zayyad said.\nNumerous PA officials in recent weeks made similar statements about the possibility of violence in response to any embassy relocation to Jerusalem.\nResponding to those threats, DeSantis told this reporter:\nThey say that about if we were to do anything. There is always going to be a pretext for them to use to go on their cycle of violence. As you’ve mentioned, they rejected peace time and time again. So, I think for us to do policy based on what a Palestinian Arab is saying they are going to do in response given their history is unacceptable.\nThe second thing is, I think it would actually be very good for Donald Trump to follow through with his promise. Because I think it will show that this is a guy who means business. That he is exercising leadership. That he is not afraid to take bold action even in the face of these threats.\nAnd ultimately in the Arab world they have a different psychology than in the Western World. They respect strength. And they respect a strong horse. So, if you cower in the face of these threats to me you will end up losing respect not only from Palestinian Arabs, but also from some of the Arab states in the Gulf.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2017/03/06/exclusive-rep-ron-desantis-trump-ignore-palestinian-threats-moving-embassy-jerusalem/"}
