{"authors":["Aaron Klein"],"date_download":"2018-10-30 19:25:19","date_modify":"2018-10-30 19:25:19","date_publish":"2016-08-08 12:20:06","description":"Bill Clinton rape accuser Juanita Broaddrick charged that there is a media “double standard” when it comes to a lack of reporting on the sexual assault and rape charges against the former president.","filename":"data/vaneerConsumption/EXCLUSIVEJuanitaBroaddrickNBCsAndreaMitchellOwesMeAPublicApology.json","image_url":"https://media.breitbart.com/media/2016/08/juanita.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_08_08__1540927519.html","title":"EXCLUSIVE- Juanita Broaddrick: NBC’s Andrea Mitchell Owes Me A Public Apology","title_page":"EXCLUSIVE- Juanita Broaddrick: NBC’s Andrea Mitchell Owes Me A Public Apology","title_rss":"NULL","source_domain":"breitbart.com","text":"Bill Clinton rape accuser Juanita Broaddrick charged that there is a media “double standard” when it comes to a lack of reporting on the sexual assault and rape charges against the former president.\nShe further demanded that NBC News Anchor Andrea Mitchell issue a public apology for calling Broaddrick “discredited” during a segment that aired May 19 on the highly-rated “Today Show.” In response to a retraction letter from Broaddrick’s attorney, who is also her son, the network quietly scrubbed the word “discredited” from the online version of Mitchell’s report, Breitbart News first reported last week.\nBroaddrick was speaking on Sunday on this reporter’s talk radio program, “Aaron Klein Investigative Radio,” broadcast on New York’s AM 970 The Answer and Philadelphia’s NewsTalk 990 AM.\nAsked about the significant media silence regarding her story and those of other Clinton sex accusers, Broaddrick stated:\n“I just think it’s a double standard. I don’t think that they want to bring out these bad things that Bill Clinton has done. And they are letting the victims of his crimes suffer because they don’t want to go up against him and his machine.”\nDuring the interview, Broaddrick took particular issue with NBC.\nOn Tuesday, Breitbart News reported that without any public acknowledgement and following the retraction letter on behalf of Broaddrick, NBC edited the Internet edition of Mitchell’s segment in which the anchor claimed Broaddrick’s rape accusation had been “discredited.”\nFollowing publicity of its edit, NBC News posted on the webpage that hosts the video the following qualifier:\nEditor’s Note: In the original version of this report, we referred to Ms. Broaddrick’s allegations as “discredited.” While questions have been raised about her account, upon review, on May 19, we removed that word.\nRegarding the NBC action, Broaddrick told me, “NBC has always protected him. And Hillary.”\nShe continued: “And I don’t think it is ever going to change. I don’t understand it. I think it’s wrong. But there’s really nothing at this point that I could do about it. I’m just glad, Aaron, that they did at least take out discredited from their report and made the caption that they had taken it out. Of course, your article is what force that.”\nNBC, however, has not fulfilled Broaddrick’s request, which she says was communicated in the letter, for an apology from Mitchell on the “Today Show” as well as an acknowledgement on the show and on NBC’s website that there is no information that Broaddrick’s story has been discredited.\nInstead, a staffer from NBC informed Broaddrick’s attorney and son, Kevin L. Hickey, that the “discredited” statement had been removed, Broaddrick and Hickey said.\n“It is incredibly disappointing that NBC and Andrea Mitchell will not publicly apologize for this egregious error, especially considering that NBC has retroactively edited the online version of the story and taken out the word ‘discredited,’” Hickey told Breitbart News on Tuesday.\n“Why not now go the extra step, the morally right step, and publicly acknowledge the mistake and publicly apologize?” he said.\n“My mom’s credibility was just fine for Lisa Myers and NBC when the story was initially aired. Nothing has changed. Yet NBC apparently thinks it is okay to disparage a victim like this and then do nothing to rectify the situation.”\nA spokesperson for NBC News did not return a Breitbart News request for comment.\nDuring the “Today Show” segment in question, which aired live on May 19, Mitchell was reporting on an interview with Fox News host Sean Hannity in which Donald Trump utilized the word “rape” while discussing accusations against Bill Clinton regarding women.\nIn the initial segment, which can be seen below, Mitchell stated: “Donald Trump using that word unprompted, during an interview last night with Fox News’ Sean Hannity. Bringing up a discredited and long-denied accusation against former president Bill Clinton, dating back to 1978 when he was Arkansas Attorney General.”\nThe scrubbed segment on NBC’s website, seen below, has Mitchell omitting the word “discredited” She now says: “Donald Trump using that word unprompted, during an interview last night with Fox News’ Sean Hannity. Bringing up (sic) long-denied accusation against former president Bill Clinton, dating back to 1978 when he was Arkansas Attorney General.”\nNeither Mitchell nor the network provided any documentation or evidence to back up the “discredited” claim. As critics pointed out in response to Mitchell’s claim, Broaddrick’s accusation has not been discredited.\nNBC itself vetted Broaddrick’s story when she originally broke her silence by speaking to the network’s show Dateline in 1999.\nThe network also caught up with Norma Rodgers, Broaddrick’s friend and employee, who confirmed Broaddrick’s story of how Norma found Broaddrick in her hotel room in the immediate aftermath of the incident with a badly swollen lip and mouth and that Broaddrick’s pantyhose had been ripped off. Broaddrick had stated that Clinton bit her on the lip during the alleged rape, which she said transpired in 1978 at her room in a Little Rock hotel.\nNBC’s Lisa Myers, who conducted the 1999 interview with Broaddrick for the network, stated in a 2014 interview that “[N]othing has come up since that story was reported that in any way undercuts what Juanita Broaddrick said.” Myers has since retired from the network.\nNBC’s Shoddy History with Broaddrick\nNBC has a history of minimizing Broaddrick’s rape story.\nIn January, Broaddrick said that NBC’s Mitchell told her by phone that the network would not conduct a new interview with Broaddrick “because you have nothing new to add” since Broaddrick first went public in an NBC interview in 1999.\nAn NBC News spokesperson confirmed to BuzzFeed in January that the network pursued an interview with the rape accuser but decided against running a story after purportedly establishing that there was nothing new.\n“When Juanita Broaddrick went public last week, NBC News sent an associate producer to Arkansas to see if there was anything new in her story. We established there was not, and decided not to pursue it any further,” the spokesperson said at the time.\nNBC seems to be overlooking a series of new revelations from Broaddrick, including:\nBroaddrick says Bill Clinton repeatedly called her after the alleged rape.\nBroaddrick says that Hillary Clinton tried to silence her.\nLast month, Broaddrick told me that Clinton raped her not once but twice during the same infamous encounter in 1978.\nBroaddrick says NBC removed the bombshell charge that Hillary tried to silence her.\nThis last point underscores NBC’s questionable history with Broaddrick.\nWhen Broaddrick originally broke her silence by speaking to NBC’s Dateline in 1999, Clinton’s rape accuser says she told the network’s reporter, Lisa Myers, on camera that she believed Hillary tried to silence her.\nIn January, Broaddrick recalled to me that during the pre-taped interview, she began to tell Myers about the personal meeting with Hillary described above in which, Broaddrick believes, the future First Lady strongly implied the alleged rape victim had to stay silent about her traumatic experience.\nBroaddrick says that an NBC staffer present for the 1999 filming rushed in front of the camera, interrupted the prerecorded session, and declared that the allegations against Hillary could not be included in the interview.\nShe charges that NBC went so far as to re-film that portion of the interview, with Myers asking the same question anew and Broaddrick sidestepping the Hillary meeting in the new response.\n“We were sitting on my couch,” Broaddrick recalled of the interview. “All the cameras were behind me. She asked some question about whether I was intimidated or threatened by anyone, and I started right in with the meeting with Hillary while we were filming the interview.\n“And almost as soon as I started to explain, one of the staffers, I believe he was a producer, came rushing in and said, ‘No, no. We can’t go there.’”\nBroaddrick said Myers re-asked the question for the camera and the following exchange, which made the final cut, took place:\nLisa Myers: Did Bill Clinton or anyone near him ever threaten you, try to intimidate you, do anything to keep you silent? Juanita Broaddrick: No. Myers: This has been strictly your choice. Broaddrick: Yes.\nBroaddrick, inexperienced in media relations, explained to Breitbart News why she gave an altered answer the second time around.\n“I didn’t do interviews before and I’m not a lawyer. I thought from the sound of what the NBC staffer was saying that there was some legal reason why we couldn’t talk about Hillary and that we just couldn’t go there for legal reasons.”\nWhen the story broke in January, NBC News did not provide Breitbart News with a statement about Broaddrick’s accusations despite being given five business days to do so. It has yet to reply to that request for comment.\nNBC Held Interview Until After Clinton Impeachment Vote\nAfter filming the 1999 interview, NBC waited 35 days until finally airing the exclusive. The timeline is critical. The Senate voted to acquit Clinton in the impeachment case on Feb. 12. NBC’s interview, conducted January 20, 1999, did not run until Feb. 24, and the network placed it opposite the highly-rated Grammy Awards.\nSome have questioned NBC’s motivation in waiting to air Broaddrick’s charge of rape. “The 35-day interval between tape and air is now one of the legends of the impeachment process. Why didn’t the American public get to hear Mrs. Broaddrick before the Senate voted to acquit Mr. Clinton on Feb. 12?” wrote Philip Weiss in the Observer in 1999.\nSpeaking in 1999, NBC News vice president Bill Wheatley vehemently denied the network deliberately held the interview until after the Senate vote. He said NBC took the normal period of time for properly vetting stories. “There was no pressure from the White House, period. Nor as some were claiming was there any pressure from NBC or G.E. corporate higher-ups to kill the story,” said Wheatley.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/the-media/2016/08/08/exclusive-juanita-broaddrick-nbcs-andrea-mitchell-owes-public-apology/"}
