{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 20:27:44","date_modify":"2018-10-30 20:27:44","date_publish":"2017-03-19 13:37:49","description":"Hamas security forces have uncovered a rocket workshop run by a pro-Islamic State organization in Gaza, according to a jihadist source.","filename":"data/vaneerConsumption/EXCLUSIVEJihadistHamasUncoveredIslamicStateRocketWorkshopinGaza.json","image_url":"https://media.breitbart.com/media/2016/05/terror-rocket.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_19__1540931264.html","title":"EXCLUSIVE - Jihadist: Hamas Uncovered Islamic State Rocket Workshop in Gaza","title_page":"EXCLUSIVE – Jihadist: Hamas Uncovered Islamic State Rocket Workshop in Gaza","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Hamas security forces have uncovered a rocket workshop run by a pro-Islamic State organization in Gaza, according to a jihadist in the coastal enclave.\nAbu Baker Almaqdesi, a top Palestinian jihadi who previously fought for IS in Syria and Iraq and returned to his native Gaza following an injury, said that hundreds of rockets and explosive belts have been seized by Hamas in a recent raid.\nLast month, Hamas unveiled a jihadi arsenal containing some 250 rockets and hundreds of AK-47 rifles.\n“The range of some of these rockets is 140 kilometers,” Almaqdesi claimed without providing any evidence. He further stated that similar rockets have already been shipped to Waliyat Sinai, IS’s Egyptian affiliate.\nA Hamas Interior Ministry official declined to confirm or deny the report about the rocket workshop, but confirmed that electronic devices allegedly utilized to connect between Sinai-based jihadists and their Gaza counterparts have been seized.\nOn Saturday, two rockets were fired from Gaza into southern Israel, prompting the Israel Defense Forces to retaliate against Hamas positions.\nMeanwhile, the pro-IS Aamaq news agency reported that Israeli drones raided the organization’s strongholds in Sinai.\n“Several people, including two children, were killed and (others) injured on Thursday in Israeli raids on outposts in Rafah and Sheikh Zwaid in the north of Sinai,” the report said.","url":"https://www.breitbart.com/middle-east/2017/03/19/exclusive-jihadist-hamas-uncovered-islamic-state-rocket-workshop-gaza/"}
