{"authors":["Charlie Spiering"],"date_download":"2018-10-30 22:00:21","date_modify":"2018-10-30 22:00:21","date_publish":"2015-11-16 19:16:11","description":"“I’m not going to meet with people who say they want to kill police officers,” Chris Christie says about Black Lives Matter.","filename":"data/vaneerConsumption/ExclusiveChrisChristieCriticizesObamaForFuelingFergusonEffectAndBlackLivesMatter.json","image_url":"https://media.breitbart.com/media/2015/11/Christie-Iowa-Getty1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_16__1540936821.html","title":"Exclusive: Chris Christie Criticizes Obama For Fueling ’Ferguson Effect’ And Black Lives Matter","title_page":"Exclusive: Chris Christie Criticizes Obama For Fueling ’Ferguson Effect’ And Black Lives Matter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New Jersey Governor Chris Christie has no intention of engaging with Black Lives Matter protestors, even if a group of tried to crash his events with their protests.\nIn an exclusive interview with Breitbart News, he described the protest movement as “a disgrace.”\n“I’m not going to meet with people who say they want to kill police officers,” he said. When asked if he would challenge their protests on camera, he indicated that he would ignore them.\n“I think, for me, until they decide that they want to really discuss these things in a way that are non-violent, I have no interest in engaging,” he said.\nChristie argued that the movement was one more result of the “Ferguson effect,” pointing out that the unrest in Ferguson was a consequence of President Obama refusing to stand with police officers.\nHe recalled Obama’s first comments on the situation in Boston after a black professor was arrested for breaking into his own home in 2009.\n“The president immediately took the side against the police,” Christie recalled. “Before he had any knowledge of the facts, before he knew anything he was out in the briefing room taking the side of the police officers.”\nThe incident sparked the famous “beer summit” Obama held at the White House to calm the situation and begin a conversation about law enforcement and race relations.\nChristie said that Obama’s “lawlessness” on issues such as immigration and recreational marijuana empowered activists to believe that they no longer had to obey the laws.\n“For people who are dissatisfied by what’s going on in the country, they believe that they can take matters in their own hands too and don’t have to work through justice system and the governmental system,” he said. That kind of action divided the country, Christie explained, particularly from citizens who worked hard and obeyed the law.\nIf police officers brake the law, Christie explained, they should face the justice system and be punished according to the law.\nBut the president, he suggested, had more of a responsibility to support law enforcement.\n“I just think we should stand behind the people who are trying to keep law and order in our society, especially if you are the leader of the government,” Christie said, agreeing that Obama couldn’t play the role of a professor in the campus protests.","url":"https://www.breitbart.com/politics/2015/11/16/exclusive-chris-christie-criticizes-obama-fueling-ferguson-effect-black-lives-matter/"}
