{"authors":["Katie Mchugh"],"date_download":"2018-10-30 18:11:57","date_modify":"2018-10-30 18:11:57","date_publish":"2017-02-14 04:35:08","description":"A former Trump campaign chairman is rallying public support in Virginia's governor's race by highlighting the cost and damage caused by Democrats' support for sanctuary cities and illegal immigration throughout the state. | Politics","filename":"data/vaneerConsumption/ExclusiveVirginiaGubernatorialCandidateCoreyStewartSlamsRichmondsSanctuaryCityPlan.json","image_url":"https://media.breitbart.com/media/2017/02/AP_17044485759637.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_13__1540923117.html","title":"Exclusive-Virginia Gubernatorial Candidate Corey Stewart Slams Richmond's Sanctuary City Plan","title_page":"Exclusive—Virginia Gubernatorial Candidate Corey Stewart Slams Richmond's Sanctuary City Plan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A former Trump campaign chairman is rallying public support in Virginia’s race for governor by highlighting the damage caused by Democrats’ support for sanctuary cities and illegal immigration throughout the state.\nCorey Stewart was Donald Trump’s campaign chairman in the state, and he’s now rallying Trump supporters to help end the sanctuary city policies in the state capital of Richmond.\n“In stark contrast with the lawlessness of the Obama years, which the pro-amnesty Gang of Eight Senators and Republicans like Ed Gillespie approve of, the election of Donald Trump is ushering in a new American era of law and order,” Stewart told Breitbart News, adding:\nNo more will Americans have to worry about whether their executive branch will enforce the law. No longer will families in sanctuary cities have to live in fear of criminal illegal aliens roaming their streets looking for their next victims.\nRichmond’s Democratic mayor recently declared Americans have no right to expect elected officials to enforce immigration laws against criminal aliens residing in their own city. Americans’ ancestors are “from somewhere else” and thus have no legitimate claim to authority in their hometown communities and their native country against migrants from other places, the mayor claims.\n“America is a nation of immigrants,” said Mayor Levar Stoney in a Feb. 6 directive ordering local police not to cooperate with federal immigration enforcement officers.\n“Unless you are Native American, all of us are from somewhere else. This is not—as some have suggested—a weakness. Rather, it is our strength. It is what makes us great. It is why so many from so many parts of the world want to make this country their home.”\nOne estimate pegs the number of illegal aliens in Virginia at roughly 247,000—meaning the state ranks in the top 10 of states with the largest numbers of illegal aliens.\nOver 40,000 illegals are Mexicans, with illegal aliens from El Salvador, Guatemala, and Hondorous following close behind. Mass Third World immigration is transforming Virginia into another Democratic stronghold like California, as Breitbart News has extensively documented.\nGang violence is another Third-World import affecting Virginia as the Mara Salvatrucha, or MS-13, members hack and stab their way into newspaper headlines. “El Salvador is the top country of birth for immigrants to Virginia,” the Associated Press reported in 2014, and one-fifth of the total population of El Salvador lives in the U.S. Without immigration from El Salvador, there would be no MS-13 in America at all. Many MS-13 gang members are illegal aliens—and thus shielded from deportation under Richmond’s sanctuary city directive.\nStewart said he is the only candidate in the Virginia governor’s race concerned about enforcing immigration law.\n“When I am governor, there will be absolutely no question as to where the Governor stands,” he said. “I will stand with the law. I will stand for the safety and security of legal residents of Virginia, and against the lawless left which seeks to undermine our civil society.”\nVirginia’s gubernatorial election takes place on November 2017.","url":"https://www.breitbart.com/politics/2017/02/13/exclusive-virginia-gubernatorial-candidate-corey-stewart-slams-richmonds-sanctuary-city-directive/"}
