{"authors":["Raheem Kassam"],"date_download":"2018-10-30 18:29:29","date_modify":"2018-10-30 18:29:29","date_publish":"2016-01-16 17:11:17","description":"LONDON, United Kingdom – Open borders activists gathered at London's St. Pancras train station today to protest against immigration controls, urging |","filename":"data/vaneerConsumption/EXCLUSIVEVIDEOOpenBordersCampaignersStageDieInInLondonClaimCologneRapesNOTCommittedByMuslimMigrants.json","image_url":"https://media.breitbart.com/media/2016/01/DSCF3378.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_16__1540924169.html","title":"EXCLUSIVE VIDEO: Open Borders Campaigners Stage 'Die In' In London, Claim Cologne Rapes NOT Committed By Muslim Migrants","title_page":"EXCLUSIVE VIDEO: Open Borders Campaigners Stage 'Die In' In London, Claim Cologne Rapes NOT Committed By Muslim Migrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LONDON, United Kingdom – Open borders activists gathered at London’s St. Pancras train station today to protest against immigration controls, urging European governments to accept more migrants despite the recent controversies occurring across the continent.\nIn spite of the mass migrant rape scandal gripping the continent, activists from the ‘London2Calais’ and ‘Youth’ groups gathered at the transport hub also being inundated by Alan Rickman fans due to its relevance in the Harry Potter series to demand that Britain and her European partners abolish border controls.\nChanting, “No borders, no nations, stop deportations”, the protesters held up passengers and caused closures of parts of the station which connects London with Brussels and Paris via the Eurostar rail network.\nPolice blocked the entrance to St. Pancras, wary of a repeat of October’s protest where activists got the better of law enforcement, causing mayhem across the train station.\nOne protester named Mona, from the London2Calais initiative, told Breitbart London (video above) that she did not believe the mass sexual assault and rapes in Cologne on New Year’s Eve were perpetrated by migrants, despite police admission of the fact.\nInstead, she claimed that the issue was being hyped up by the politicians and media, despite an establishment-imposed media black out on the issue for several days before Breitbart London finally reported the issue in the English language.\nShe said: “I don’t think that its that clear that [the sexual assaults were] actually made by refugees, that refugees are responsible for it. I think it’s actually used a way to scapegoat refugees which is very very dangerous.\n“And it’s being used by politicians who are trying to heat up things and trying to affect German public opinion… I’m from Germany myself, a majority [of Germans] have consistently been pro-refugee… and its politicians and people from the top that actually tried to trigger that hatred towards refugees.”\nA recent German opinion poll showed that for the first time, Germans believe the migration situation has become out of control. According to Deutsche Welle, 70 per cent of Germans now expect crime to rise due to the large number of migrants, and 56 per cent of those polled say Mrs. Merkel is not doing a good job handling the crisis, up from 49 percent in December.\nMona continued: “It’s really deadly, especially in a country with a history of Germany, where there’s still militant fascist movements that go round killing people.”\nShe did not cite any evidence for this claim, but added: “These acts [the sexual violence] should be seen as committed by individual people and… whether they’re refugees or not, should be held accountable.\n“The way its been framed in the media, thats the problem because they’re drawing a direct correlation between refugees and assault which is just not true and that’s racist”.\nIn fact, the correlation between an increase in crime and migration is long-established, and German authorities stated so even before Cologne.\nIn December 2015, the Federal German State of Saxony reported an increase in migrant crime of 47 per cent on the year, with people now admitting that they are rendered powerless by pro-migrant political agendas. They are, one claimed, no longer able to forcible detain migrants, even those reported to have committed crimes.\nThis two-tier criminal justice system has fuelled resentment against migrants, and migrants themselves have brazenly exclaimed that they should be treated differently because German Chancellor Angela Merkel “invited them”.\n“That correlation, there is no evidence for it,” claimed Mona, adding, “I’ve been harassed in Germany a lot of times and it was always by white people, I don’t have the experience of being harassed by refugees”.\nShe added, “What we’re seeing now with Charlie Hebdo suggesting that Aylan Kurdi, a 3-year-old boy who died, would somehow be responsible for these assaults, this is the kind of racism [attributing rapes to migrants] leads to”.\nCharlie Hebdo is a satirical magazine.\nFollow Raheem Kassam on Twitter for more European migrant crisis coverage, or you can follow on Facebook","url":"https://www.breitbart.com/europe/2016/01/16/pictures-hard-left-pro-open-borders-brigade-host-die-in-at-londons-st-pancras-station/"}
