{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:40:12","date_modify":"2018-10-30 21:40:12","date_publish":"2015-09-03 17:02:11","description":"Hillary Clinton's home email server crashed in 2012 after the Benghazi attacks.","filename":"data/vaneerConsumption/EXCLUSIVEHillarysEmailServerCrashedWeeksAfterBenghazi.json","image_url":"https://media.breitbart.com/media/2015/08/Huma-Abedin-with-Hillary-Robyn-BeckAFPGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_03__1540935612.html","title":"EXCLUSIVE: Hillary's Email Server Crashed Weeks After Benghazi","title_page":"EXCLUSIVE: Hillary's Email Server Crashed Weeks After Benghazi | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton’s private email server crashed in the immediate weeks following the Benghazi terrorist attack, according to emails sent by Clinton’s top State Department aide Huma Abedin.\nAbedin emailed Clinton Foundation executive director Stephanie Streett on the morning of October 10, 2012 to inquire about flooring options for a building she was designing. Abedin was using her State Department government email account to communicate with Streett because her clintonemail.com address, hosted on Hillary’s private server, had crashed.\n“Is your email working?” Abedin asked Streett on the morning of October 10, 2012. “Mine has been down last night. Did you get my email about flooring?”\nStreett replied with an answer about a temporary floor covering that could go over “the permanent natural bamboo.”\n“My bigger problem right now is I can’t even get into my clinton email and I wanted to print all the latest documents to go through line by line with Oscar,” Abedin responded. “May need them re-sent to this email but will let you know if I can’t figure it out here first.”\n“I meant that my email was completely down so I can [sic] even access the last bio script,” Abedin clarified. “Would just need it sent to this email. But hopefully its up and running soon.”\nThis Clinton email crash, coming just weeks after the September 11, 2012 terrorist attack in Benghazi, was one of at least three instances in which clintonemail.com went down during Clinton’s tenure at the State Department.\nWhen Clinton’s private email server went down in February 2010, the State Department’s IT Help Desk couldn’t even help her, because they didn’t know that Clinton was using private email.\n“Ur email must be back up!!,” Abedin wrote to Clinton during the confusion. “What happened is judith sent you an email. It bounced back. She called the email help desk at state (I guess assuming u had state email) and told them that. They had no idea it was YOU, just some random address so they emailed. Sorry about that. But regardless, means ur email must be back! R u getting other messages?”\nClinton’s private server also crashed during Superstorm Sandy in late October 2012.","url":"https://www.breitbart.com/politics/2015/09/03/exclusive-hillarys-email-server-crashed-weeks-after-benghazi/"}
