{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:50:06","date_modify":"2018-10-30 20:50:06","date_publish":"2014-07-15 02:01:45","description":"This weekend, over 2,000 pro-Israel demonstrators gathered in San Francisco on Saturday and Los Angeles on Sunday. There were peaceful protests against |","filename":"data/vaneerConsumption/EXCLUSIVESelfDescribedUSCProfessorHamasAreFreedomFightersNotTerrorists.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-California/2014/07/14/IsraelRally-6535.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_07_14__1540932606.html","title":"EXCLUSIVE: Self-Described USC Professor: Hamas Are 'Freedom Fighters,' Not Terrorists","title_page":"EXCLUSIVE: Self-Described USC Professor: Hamas Are 'Freedom Fighters,' Not Terrorists | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This weekend, over 2,000 pro-Israel demonstrators gathered in San Francisco on Saturday and Los Angeles on Sunday. There were peaceful protests against the Hamas-led rocket fire that has gripped Israel over the past week and ignited reactionary defensive fire from Israel.\nBreitbart News was able to get behind the scenes of both the pro-Israel and pro-Palestinian sides of Sunday’s rally. The event ended with the arrests of four pro-Palestinian protesters.\nAt Saturday’s protest, a line of police encircled the nearly 200 pro-Israel protesters who congregated in San Francisco in reaction to an earlier protest on Tuesday of last week, in which a group of pro-Israel demonstrators were threatened by anti-Israel protesters.\nA video of Saturday’s event, which was filmed by the Zionist Organization of America’s West Coast executive director Sam Levine and given to Breitbart News, appears below:\nSunday’s event began peacefully but did not end that way. A police officer had to fire a gunshot to break up a fight. Four men were arrested on suspicion of assault with deadly weapons, reports NBC of Southern California.\nRoz Rothstein, co-founder and CEO of Stand With Us, which co-hosted Sunday’s Los Angeles rally along with the Israel American Council (IAC), addressed the thousands congregated over a loudspeaker: “There seems to be some confusion in the media… that Hamas and Israel are equal. Hamas is a terrorist organization. Israel is not,” she noted. Rothstein told Breitbart News, “Hamas wants war. Israel wants peace. And sometimes Israel has to demonstrate strength to arrive at peace.”\nThe events of the past weeks in Israel were sparked by the murders of three Israeli teenagers (one of which held dual U.S.-Israel citizenship) who were kidnapped and murdered by Hamas terrorists, followed by the killing of a Palestinian teen a few days after the discovery of the boys’ bodies.\nIsrael’s Consul General to the southwest, David Siegel, told Breitbart News that Israel’s goal throughout Operation Protective Edge is “to achieve a sustainable security for Israel.” He went on to give some perspective as to what it looks like when the only established democracy in the Middle East, Israel, comes under attack by terrorist forces:\nWhen 80% of Israel is under fire for six days in a row, that is like 80% of the United States — from Los Angeles to Philadelphia, every city — being bombarded at the same time. America wouldn’t tolerate [this], Israel won’t tolerate [this], and we’re [Israel] going to put an end to this. We’re going to do it militarily or diplomatically, by whatever means it takes to achieve that sustainable security that we’re looking for. And this is going to be a long haul.\nOn the pro-Palestinian side, there were approximately 50 protesters present. Breitbart News was able to speak with a few of the individuals congregated, although none of those interviewed were willing to provide their full names.\nOne man, who gave only his first name, “Rich,” and who said he was a University of Southern California professor, held up a sign with an image of Mother Theresa which compared Israel to South Africa during the era of apartheid. In April of this year, Secretary of State John Kerry apologized for erroneously likening Israel to an apartheid state.\nRich told Breitbart News that Hamas “are freedom fighters, not terrorists.” Hamas has been designated a terrorist organization by the United States, which has a policy that bars contact with Hamas leaders. “Israel needs to be called Palestine again,” he said, in a frustrated tone. “The land was theirs first,” he lamented.\nBreitbart News then asked him if the same line of thought should be applied to America and whether it should be renamed “Native America,” to which he replied, “No. It’s a different time now. That happened over 200 years ago.”\nNearby, a female student who said she was Palestinian also spoke to Breitbart News, but declined to provide her name. “Hitler killed six million Jews for a reason,” she said. Rich then jumped in and said, “That’s going too far. You are out of line.”\nOn the pro-Israel side, a small business owner, Guy Moshe, said, “I feel bad for the Palestinians… for the women and children and all the good Palestinians who are under Hamas control.” He added, “Hamas is murdering them if they’re not going to go by what they say. They [Hamas] believe in killing the Jews. We are not going to allow our children to be in danger… we’re going to fight them,” Moshe said.\nCouncilman Paul Koretz, who said he was present on behalf of the City of Los Angeles, Mayor Eric Garcetti, and L.A. City Attorney Mike Feuer told the audience that “the City of Los Angeles stands 100%, irrevocably with the State of Israel… Israel wants peace and we all know it. Israel has been forced into military action.”\nHe went on to note that “Hamas is sacrificing it’s own Palestinian people as well by putting rocket launchers right in residential areas where they know they’re going to be killed, just to make that a PR victory. It’s absolutely reprehensible. The City of Los Angeles will not stand for it,” Koretz said.\nPhoto courtesy of Michael Guttman","url":"https://www.breitbart.com/local/2014/07/14/exclusive-breitbart-news-goes-inside-pro-israel-pro-palestinian-protests/"}
