{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:25:15","date_modify":"2018-10-30 19:25:15","date_publish":"2015-09-22 18:35:52","description":"Alex Datig says Hillary Clinton’s message that she stands with sexual assault victims is “offensive.” Datig says “charity begins at home.”","filename":"data/vaneerConsumption/EXCLUSIVESexualAssaultSurvivorCallsHillaryClintonaHypocrite.json","image_url":"https://media.breitbart.com/media/2015/09/GettyImages-453979631.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_22__1540927515.html","title":"EXCLUSIVE: Sexual Assault Survivor Calls Hillary Clinton a 'Hypocrite'","title_page":"EXCLUSIVE: Sexual Assault Survivor Calls Hillary Clinton a 'Hypocrite' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A woman who says that she was sexually molested as a child and later raped is launching an attack video against Hillary Clinton, saying Clinton doesn’t stand up for sexual assault victims, and pointing to the number of accusations of sexual assault by women against Bill Clinton.\nAlex Datig says Hillary Clinton’s message that she stands with sexual assault victims is “offensive.” Datig says “charity begins at home.”\nDatig’s video titled, “Hillary’s Re-Traumatization Of Rape Campaign Is An Assault On Survivors,” highlights stories from Kathleen Willey, Juanita Broaddrick, Paula Jones and Monica Lewinsky – all of whom alleged Bill Clinton sexually assaulted them.\nThe video then cuts to Hillary Clinton saying, “Don’t let anyone silence your voice.”\nDatig is using her personal story to counter Clinton’s campaign message. She tells Breitbart News, “I think she’s a hypocrite.”\nDatig is a businesswoman living in Los Angeles, California and a political consultant, where she has worked in politics for 15 years, but has endured a difficult past.\nShe told Breitbart News she was molested as a child and also drugged and raped as a teenager, later finding herself under the control of a pimp. After going through 16 years of recovery, she has decided to speak out against human and sex trafficking, giving victims of sexual assault a voice.\nDatig considers herself a Republican, but told Breitbart News, “This is a bipartisan issue and [Hillary Clinton’s] politicizing this issue. I think it’s disgusting.”\n“I am probably a textbook case for what Hillary Clinton is talking about when she says rape survivors – sexual assault survivors – have a right to be heard,” Datig explained. “My troubles in my teen years kept attracting predators into my life.”\nDatig told Breitbart News she has been through the recovery process from her traumatic past for roughly 16 years.\nDatig said during her time entering recovery and getting treatment, “There was a Monica Lewinsky sandal a few years later and Paul Jones and all these things – and Hillary Clinton could have done so much for rape survivors back then … where she could have drawn the line where she could have said, ‘I don’t tolerate this type of behavior and no woman should.’”\nBreitbart News asked Datig what she would like to see from presidential candidates on the issue of sexual assault and victims of human sex trafficking.\n“I think that all of the candidates have to be educated on what a survivor is of sexual assault and what we are…we are repressed and oppressed by society, thanks to people like Hillary Clinton because people don’t believe us,” Datig charged.\n“You’re denying somebody’s right to exist,” she added, referencing how people ignore victims of sexual assault and deny something happened.","url":"https://www.breitbart.com/politics/2015/09/22/exclusive-sexual-assault-survivor-calls-hillary-clinton-hypocrite/"}
