{"authors":["Matthew Boyle"],"date_download":"2018-10-30 19:59:50","date_modify":"2018-10-30 19:59:50","date_publish":"2015-05-21 00:03:08","description":"Sen. Steve Daines (R-MT), who joined Sen. Rand Paul (R-KY) in his filibuster on the U.S. Senate floor on Wednesday, told Breitbart News in an exclusive interview when he came off the Senate floor that he stands with Rand because Montanans want him to.","filename":"data/vaneerConsumption/ExclusiveSenSteveDainesIStandwithRandAgainstNSABulkCollectionofAmericansRecords.json","image_url":"https://media.breitbart.com/media/2015/05/Steve-Daines-AP-PhotosMichael-Albans.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_20__1540929590.html","title":"Exclusive - Sen. Steve Daines: I Stand with Rand Against NSA Bulk Collection of Americans’ Records","title_page":"Exclusive — Sen. Steve Daines: I Stand with Rand Against NSA Bulk Collection of Americans’ Records | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Steve Daines (R-MT), who joined Sen. Rand Paul (R-KY) in his filibuster on the U.S. Senate floor on Wednesday, told Breitbart News in an exclusive interview when he came off the Senate floor that he stands with Rand because Montanans want him to.\nDaines said in a brief phone interview moments after leaving Paul’s side on the floor:\nI think first and foremost it was important that the voice of the people of Montana was heard on the floor of the United States Senate tonight. I stand with the people of Montana who believe that we must protect the Constitution. The bulk data collection program is an overreach of the federal government and I thought it was very important to stand with Sen. Paul tonight—and there were five members from the House in the back of the Senate chamber tonight, and I served with four out of those five when I was in the House. It was great to see that as well.\nDaines said filibusters like Paul’s here against section 215 of the PATRIOT Act—which enables the NSA’s controversial bulk collection of Americans’ data—expose bad problems in the U.S. government. Daines said:\nI think this is going to helpful to providing more light on this issue of this NSA metadata collection program. The House had a very strong vote in support of the USA Freedom Act 338-88. I think many of us in the Senate are concerned that the Senate is not looking at what the House did, how strong a vote that was and I believe that one of the things to do is to take the USA Freedom Act—which I’m a cosponsor of, the Mike Lee bill—and put it on the Senate floor and allow this deliberative body called the U.S. Senate to debate it, engage in thoughtful deliberation and let the American people here have their voices heard on the floor of the U.S. Senate. I think that’s the logical next step and I’m glad to see Sen. Paul step in and support that.\nDaines called for Senate Majority Leader Mitch McConnell to allow an open and honest debate—with lots of amendments—to the USA Freedom Act, which would end the government’s collection of such data via the NSA and move that data collection over to the private phone companies. Paul doesn’t think that the USA Freedom Act as currently written is acceptable, since it would keep data collection alive, and it’s unclear if he’d support the USA Freedom Act if it were amended to the point where it could fully end data collection. Daines wants an open and honest debate—something McConnell is currently opposed to having. Daines went on to say:\nLet’s put the bill on the floor and let’s have an open and very spirited debate as we debate the overreach of our federal government—it’s a violation of our Constitution, it’s a violation of the law according to a court in New York. Let’s have that debate though in front of the American people—and let the voice of the people be heard on the floor of the U.S. Senate like it was heard on the floor of the U.S. House. For those who have concerns with the USA Freedom Act—of which many do—let’s have an open amendment process and have that debate on the floor of the U.S. Senate.\nSen. Mike Lee (R-UT), when he joined Paul on the Senate floor to back Paul’s filibuster, called for McConnell to have an open and honest debate process as well.\n“I agree with the junior senator from Kentucky that the American people deserve better than they are getting,” Lee said. “And quite frankly it is time that they expect more from the United States Senate. This is not time for more cliffs, for more secrecy, and more 11th hour backroom deals. It’s time for the kind of bipartisan bicameral consensus that I believe is embodied in the USA Freedom Act.”\nLee’s office, in a press release after his appearance, explained how McConnell is blocking open debate on this matter. In the release, Lee’s office noted that Paul is going to speak on the floor all the way until Thursday morning.\n“Majority Leader Mitch McConnell (R-KY) has said he will give the USA Freedom Act a vote, but he has not promised a fair debate on the bill that includes an open amendment process,” Lee’s office said. “Senator Paul will be speaking on the floor through Thursday morning calling on Senate leadership to allow votes on his amendments with Sen. Ron Wyden (D-OR) to the USA Freedom Act. Senator Lee fully supports these amendments getting votes.”\nDaines added in his interview with Breitbart News that he believes the American people are moving more and more decisively against the NSA’s data collection program.\n“I think so, and I think we’re already starting to see that happen,” Daines said. “I think what Sen. Paul is doing is another step in that process by moving the Senate to at least consider the USA Freedom Act. All we’re asking for is let’s have a fight on the floor. I think that’s a good thing. And I speak for the people of Montana—we’re hearing a lot of comments, input, phone calls, emails, letters about this overreach of the federal government. It’s my job to bring that voice of the people of Montana to the United States Senate and that’s what I did tonight in standing with Rand Paul.”","url":"https://www.breitbart.com/politics/2015/05/20/exclusive-sen-steve-daines-i-stand-with-rand-against-nsa-bulk-collection-of-americans-records/"}
