{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:46:22","date_modify":"2018-10-30 21:46:22","date_publish":"2015-09-23 20:09:17","description":"Hillary Clinton's right-hand aide Huma Abedin did private business for a Clinton-linked company on her State Department email account.","filename":"data/vaneerConsumption/EXCLUSIVETopHillaryClintonAdviserDidPrivateClintonBusinessOnStateDepartmentEmail.json","image_url":"https://media.breitbart.com/media/2015/03/Huma-Abedin-Hillary-Clinton-AFP1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_23__1540935982.html","title":"EXCLUSIVE: Top Hillary Clinton Adviser Did Private Clinton Business On State Department Email","title_page":"EXCLUSIVE: Top Hillary Clinton Adviser Did Private Clinton Business On State Department Email | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton’s right-hand aide Huma Abedin did private business for a Clinton-linked company on her State Department email account, Breitbart News has learned.\nAbedin was helping to recruit executives for the private corporate advisory firm Teneo Holdings, founded by former Bill Clinton right-hand man Doug Band, while she was on an official State Department trip with Hillary Clinton by her side.\nKen Miller, former vice chairman of Merrill Lynch and Viacom board member, is now a senior advisor at Teneo Holdings. When Miller was considering taking the Teneo job, he reached out to Huma Abedin. Why would Abedin, a staffer for Hillary Clinton at the State Department, need to be consulted on new Teneo hires?\nThe conflict of interest, according to emails obtained by Breitbart News, is staggering.\nMiller’s executive assistant Shannon Nacey emailed Huma Abedin directly on July 2, 2012 with the subject line “Ken Miller call re: Teneo.”\nNacey told Abedin that Miller had just met with Doug Band about the Teneo gig, and wanted Abedin’s advice.\n“Ken has been in talks with Teneo, and has met with several people there, most recently Doug Band. He would appreciate your input on a decision he’s considering. Can we schedule a quick call for today or tomorrow?” Nacey asked Abedin.\n“Hi shannon – I’m so sorry I missed this. I’m in asia. Does he still want to talk? I emailed him as well,” Abedin replied on her official State Department email.\nWhat was Abedin doing in Asia?\n“I’ve landed in cambodia. We are 11 hours ahead. Its almost 4am so I’m going to bed for a couple hours. Call me tomorrow,” Abedin told Nacey in a subsequent email on July 11.\nHillary Clinton gave a speech on July 11, 2012 in Phnom Penh, Cambodia. Thus, Clinton was with Abedin in Asia when she was dealing with Ken Miller’s Teneo concerns.\nNacey arranged for Miller to call Abedin. Abedin gave Nacey her cell phone number. Ken Miller also emailed Abedin directly at one point during this exchange, on July 10, 2012.\nReached for comment, Nacey, now an executive assistant to Miller at Teneo Holdings, did not provide comment.\n“I can tell you that he’s not interested in speaking with you,” Nacey told Breitbart News, noting that Miller was also in meetings.","url":"https://www.breitbart.com/politics/2015/09/23/exclusive-top-hillary-clinton-adviser-private-clinton-business-state-department-email/"}
