{"authors":["Penny Starr"],"date_download":"2018-10-30 20:12:15","date_modify":"2018-10-30 20:12:15","date_publish":"2017-04-11 01:14:02","description":"It has been six months since Andrew Brunson reported to a local police station, hoping he would finally be granted permanent residency in Turkey.","filename":"data/vaneerConsumption/EXCLUSIVESisterofChristianPastorJailedinTurkeyWeLoveHimandWantHimBack.json","image_url":"https://media.breitbart.com/media/2017/02/american-christian-pastor-Andrew-Brunson-turkey-prison-aclj.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_10__1540930335.html","title":"EXCLUSIVE: Sister of Christian Pastor Jailed in Turkey: ‘We Love Him and Want Him Back'","title_page":"EXCLUSIVE: Sister of Christian Pastor Jailed in Turkey: ‘We Love Him and Want Him Back' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"It has been six months since Andrew Brunson reported to a local police station, hoping he would finally be granted permanent residency in Turkey, a country where he has been a pastor for 23 years.\nInstead, he was detained for what authorities falsely claimed was his “membership in an armed terrorist organization.” Despite pleas from his family and the efforts of the Washington D.C.-based Center for Law and Justice, Brunson was transferred to a prison where he is still being held.\n“It’s been very hard on us as his family,” Beth Herman, Brunson’s sister, told Breitbart News. “We love him and we want him to be back with his family.”\nBrunson’s family has also made direct appeals to the Trump administration. Last month, Brunson sent a statement to President Donald Trump through the United States Embassy in Turkey. And just days ago, his wife Norine met briefly with Secretary of State Rex Tillerson during his diplomatic visit to Turkey.\n“The 20-minute meeting took place in Ankara, Turkey as the Secretary of State held a series of meetings with senior Turkish officials,” the ACLJ reported. “This meeting occurred just a few days after Pastor Andrew made a direct personal appeal to the Trump Administration to secure his freedom.”\nACLJ posted a statement from Norine Brunson following the meeting:\nOn Monday, Andrew told me he felt the Lord had said I would meet with Secretary of State Tillerson. On Tuesday, I was told by the embassy and another Senator that the meeting would NOT happen. I decided to come to Ankara anyway and arrived last night. I met with another significant person in the State Department early afternoon, then late afternoon was told the Secretary would meet with me. I just had a 20 min meeting with Sec. of State Tillerson. I do not know what will come of it, considering the sensitive period Turkey is in, but was grateful for the opportunity.\nBrunson’s statement asked President Trump to intervene on his behalf.\nWill the Turkish government face no consequence for stubbornly continuing to hold an American citizen as a political prisoner? Even though I have a long public track record as a church pastor, they falsely accuse me of being a member of an Islamist terrorist group. I have been imprisoned since October 7, 2016. During this time the Turkish government has produced no proof and has rebuffed numerous attempts by the American government to secure my return to the United States. In fact they are treating the US government with contempt and paying no price for it. I plead with my government – with the Trump Administration – to fight for me. I ask the State Department to impose sanctions. I appeal to President Trump: please help me. Let the Turkish government know that you will not cooperate with them in any way until they release me. Please do not leave me here in prison.\nBrunson, an American citizen from North Carolina, has been the pastor of a church in Turkey for more than two decades, and he and his wife raised their children there.\n“He loves the Turkish people and he’s tried to do only good to them,” Herman said, adding that her brother would “do nothing that would hurt anybody.”\nACLJ also launched a petition drive, with more than 254,000 people signing on to show support for Brunson and to ask for his release and return to the United States.\n“Turkey – our NATO ally – has begun increased crackdowns on Christians,” the petition said. “If convicted, Pastor Andrew could face years in prison based on extremely serious – and false – charges. At the ACLJ, we’re representing the family, mobilizing our international resources – including our offices in the region – demanding Pastor Andrew’s freedom. Take action with us before it’s too late.”\n“Pastor Andrew’s plight has caught the attention of hundreds of thousands of people and has been raised directly by the U.S. Secretary of State, and yet he continues to remain unjustly imprisoned and facing trial,” a post said on the ACLJ website.\n“We cannot let up our efforts,” the post said. “We need to let Pastor Andrew know, now more than ever, that he has not been forgotten and that our efforts will continue until he is released back to the United States and reunited with his family, who have been unjustly denied their husband and father for far too long.”\nACLJ said that Brunson is being kept in a cell meant to house eight men where more than 20 men are incarcerated.\nTo date, no official charges have been filed against Brunson, which makes taking legal action difficult, according to ACLJ.\nAysun Akşehirlioğlu, Brunson’s Turkish attorney, said once an indictment is made the case against the pastor would be unsealed and a court date could be set, although nothing is certain, according to the attorney.\nBrunson’s sister said that her brother is being persecuted for the faith that is sustaining him.\n“We have a strong faith in God,” Herman said. “We believe God is with him and he’ll make it through this.”","url":"https://www.breitbart.com/national-security/2017/04/10/exclusive-sister-of-christian-pastor-jailed-in-turkey-we-love-him-and-want-him-back-with-his-family/"}
