{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:26:38","date_modify":"2018-10-30 18:26:38","date_publish":"2018-07-01 11:00:54","description":"Samantha Markle, the half-sister of the Duchess of Sussex Meghan Markle, called for a British constitution and described the imprisonment of citizen journalist Tommy Robinson as \"extreme,\" during an exclusive interview with Breitbart News.","filename":"data/vaneerConsumption/EXCLUSIVESamanthaMarkleCallsforBritishConstitutionTreatmentofTommyRobinsonIsExtreme.json","image_url":"https://media.breitbart.com/media/2018/06/Samantha-Markle.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_07_01__1540923998.html","title":"EXCLUSIVE — Samantha Markle Calls for British Constitution, Treatment of Tommy Robinson Is ‘Extreme’","title_page":"EXCLUSIVE -- Samantha Markle Calls for British Constitution, Treatment of Tommy Robinson Is 'Extreme' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Samantha Markle, the half-sister of the Duchess of Sussex Meghan Markle, called for a British constitution and described the imprisonment of journalist and activist Tommy Robinson as “extreme,” during an exclusive interview with Breitbart News.\nAfter being asked about Robinson’s 13-month prison sentence for reporting on child grooming gangs outside of a court, Markle called the sentence “extreme,” and defended his right to free speech despite her disagreements with his political views.\n“I don’t agree with his issues, but I still believe in defending freedom of speech even when it’s morally repugnant, up until the point where there is actual injury or imminent danger,” Markle declared. “I feel it’s wrong for governments to say outside of a courthouse you can’t say such and such because it might bias the jury. The jurors have an obligation to maintain an issue of neutrality until they’ve been presented with the evidence and facts of the case, so what they might hear outside of a courthouse shouldn’t be restricted on the grounds that they might change their decision.”\n“Inside the court, the government has a right to say you are not allowed to say such and such, but in the public domain, I don’t think the government should be allowed to restrict this, even outside of a courthouse,” she continued. “So for the judge to say to Tommy Robinson, ‘If you do this again I’m going to arrest you,’ I personally feel it’s wrong.”\n“I feel for Tommy Robinson to be charged with, for over a year, contempt of court for exercising his freedom of speech, with information that was already salient in the media by the way — he was not sharing information that only attorneys and clients were privileged to — he was sharing information that was public knowledge already,” Markle expressed. “That it might bias a jury, I feel is no legal grounds to arrest him and deprive him of his life, liberty, and happiness for a year.”\nMarkle continued to describe the sentence “extreme,” adding, “There is not a clear constitution within the UK and that is causing some stress for the people and problems for the government. Perhaps there needs to be a written constitution… that is amendable… but there still needs to be clear boundaries and fair boundaries.”\n“I know so many lovely Muslim people, I detest hate speech against any people,” she concluded. “But being loud and being boisterous about what he hates, should we jail someone like that? No.”\nRead Samantha Markle’s thoughts on the media and her relationship with her half-sister in the other parts of this interview.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington, or like his page at Facebook.","url":"https://www.breitbart.com/tech/2018/07/01/exclusive-samantha-markle-calls-for-british-constitution-treatment-of-tommy-robinson-is-extreme/"}
