{"authors":["Abc News","Kaitlyn Folmer","Alex Hosenball","More Mark","More Kaitlyn","More Alex"],"date_download":"2018-10-30 00:52:37","date_modify":"2018-10-30 00:52:37","date_publish":"2018-10-28 02:36:56","description":"Sayoc has been charged with sending suspected explosive devices to politicians.","filename":"data/vaneerConsumption/EXCLUSIVESurveillancevideoshowsallegedmailbomberreadingnewspapersatstripclubnightbeforearrest.json","image_url":"https://s.abcnews.com/images/US/bomber-1-ht-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_exclusive-surveillance-v_3a2e85a17adbd0492aaabf70e2e99415_story_id=58802069_1540860757.html","title":"EXCLUSIVE: Surveillance video shows alleged mail bomber reading newspapers at strip club night before arrest","title_page":"EXCLUSIVE: Surveillance video shows alleged mail bomber reading newspapers at strip club night before arrest - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Mail bombing suspect Cesar Sayoc spent the early morning hours of the day he was arrested shuffling through press clippings at the Ultra Gentlemen's Club in West Palm Beach, according to exclusive surveillance video obtained by ABC News and sources at the club.\nInterested in Mail Bomb Investigation? Add Mail Bomb Investigation as an interest to stay up to date on the latest Mail Bomb Investigation news, video, and analysis from ABC News. Add Interest\nSayoc was arrested on Friday for allegedly sending at least 14 suspected explosive devices to a number of prominent Democrats and critics of President Donald Trump, including former President Barack Obama, former Vice President Joe Biden, California Rep. Maxine Waters, New Jersey Sen. Cory Booker and CNN's offices in New York.\nHe was charged Friday afternoon with five federal crimes: interstate transportation of an explosive, illegal mailing of explosives, threats against former presidents and certain other persons, threatening interstate communications and assaulting current and former federal officers. He could face as much as 48 years in prison.\nBroward County Sheriffs Office via AP\nSayoc filled in as a DJ at the club as recently as Thursday from noon to 9 p.m. The surveillance footage shows him bringing bags into the club Thursday at 11:35 a.m. for his set, and then exiting the club later that night.\nUltra Gentlemens Club\nScott Meigs, who says he has known Sayoc for 20 years, described him as \"a very nice guy.\"\n\"I would never think that he would do anything like this,\" Meigs, who is also a DJ, told ABC News. \"He was very polite, very outgoing. Very good with the customers, very good with the entertainers. Never a problem.\"\nMeigs added that it wasn't until three weeks ago that Sayoc started talking about politics.\n\"I just thought it was passion, that he was passionate about politics,\" he added. \"But he did talk a lot about it, trying to tell everybody to vote Republican in the upcoming elections.\"\nWhen Sayoc left the club and went to the gym after his shift Thursday, according to witnesses, he returned Friday at 2:16 a.m. -- just hours before he was arrested -- to collect his tips from earlier and hang out.\nUltra Gentlemens Club\nThe 56-year-old can be seen on footage from inside the club spreading newspapers across the empty banquet table in front of the stage. Sources at the club told ABC News that they saw Sayoc going through press clippings while seated in the lounge during these hours.\nWPLG-TV via AP\nSources at Ultra Gentlemen's Club told ABC News that employees and patrons there saw Sayoc burning items in a small fire outside his van, parked in the club parking lot, between midnight and 2 a.m. Friday morning. ABC News reviewed the surveillance video from the parking lot and is unable to see a visible fire, but is able to see patrons approaching the van.\nUltra Gentlemens Club\nPhotos from club sources of the remnants of the small fire lit by Sayoc outside his van that night showed a charred paperclip among the alleged remnants of a fire visible in the photos.\nSayoc had only worked at the club for about two months. Surveillance footage from mid-October at the club, acquired by ABC News, showed Sayoc greeting guests at the front door and chatting with other employees at the front desk.\nUltra Gentlemens Club\nHe was arrested just before noon in the parking lot of an AutoZone car parts store in Plantation, Florida, about 40 minutes south of the West Palm Beach club where he worked.\nUltra Gentlemens Club\nHe was apparently living out of his van, which was plastered with stickers denouncing prominent Democrats and touting the president.\nUltra Gentlemens Club\nThat van contained a printer, stamps, paper, an unidentified powder and soldering equipment, pointing at least preliminarily to the vehicle being a possible location for the assembly of the alleged improvised explosive devices (IEDs), according to two officials briefed on the probe.\nABC News' Josh Margolin, Jack Date, Aaron Katersky and Mike Levine contributed to this report.","url":"https://abcnews.go.com/US/exclusive-surveillance-video-shows-alleged-mail-bomber-reading/story?id=58802069"}
