{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:56:19","date_modify":"2018-10-30 19:56:19","date_publish":"2016-08-09 22:10:15","description":"\"The number one issue we have in my district is what's going on with our polluted water here,\" said Brian Mast.","filename":"data/vaneerConsumption/ExclusiveBrianMastSaysinDCHellFightVAHacks.json","image_url":"https://media.breitbart.com/media/2016/06/Brian-Mast-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_09__1540929379.html","title":"Exclusive–Brian Mast Says in DC He’ll Fight VA Hacks","title_page":"Exclusive--Brian Mast Says in DC He'll Fight VA Hacks","title_rss":"NULL","source_domain":"breitbart.com","text":"The former Army staff sergeant running for Congress after giving both his legs serving with Special Operations Command in Afghanistan described the top issue in his race for the Republican nomination for Congress from Florida’s 18th Congressional District.\n“The number one issue we have in my district is what’s going on with our polluted water here,” said Brian Mast, who after his medical retirement from the Army earned a bachelor’s degree from Harvard College.\nMast told Breitbart, when he first went out campaigning a little more than one year ago, the top issue was Common Core and matters related to education. Now, there are concerns about immigration, crime, and terrorism, but what has been done to the local ecology is presently front and center.\nThe U.S. Army Corps of Engineers years ago, at the behest of developers, straightened out the Kissimmee River, which feeds into Lake Okeechobee. The lake fills up faster than nature intended and the corps then bleeds off nitrate rich fresh water into salt water estuaries and other bodies of water, said the former explosive ordnance specialist, who deployed overseas multiple times before his accident Sept. 10, 2010, when he was attempting to disarm a bomb.\nThe result is a blobbing overgrowth of vegetation, at times 5-inches thick, that is destroying shoreline, wildlife, as well as commerce in boating, fishing, and tourism, he said. “I am not exaggerating one bit–it is like some guacamole-like substance on top of the water.” Lake Okeechobee is a 730-square mile lake, second only to Lake Michigan in size inside the 49 contiguous states.\nAfter the 2005 Hurricane Katrina, the corps examined all dikes and levees for soundness and they determined that the levees at Lake Okeechobee were not up-to-standard, so they began a program of deliberate releases of lake water into salt water environments–over and above the natural flow–every time the lake’s water level reached a certain high point, he said.\n“They are dumping toxic water into our normally beautiful and pristine waters on the coast, literally destroying them,” he said.\nFor political and institutional reasons, the Army Corps of Engineers operates with autonomy and without sanction, he said. “They have no concern for anyone else.”\nBecause he has seen how the corps operates and the damage they do to the environment, the economy ,and the everyday lives of people in his district, Mast said he will seek a seat on the House Committee of Transportation and Infrastructure. The committee overseas the Army Corps of Engineers, as well as oversight of the Environmental Protection Agency and the Federal Emergency Management Agency–two agencies that should be protecting his district from the corps.\nBecause the actual polluter is the federal government, the federal government does nothing, he said.\nBut, if the polluter was an oil company or some other business-villain, the feds would not hesitate to get involved, he said.\n“If this were, you know, oil sitting on top of my water, we’d have a dozen federal agencies right now expending every resource they had, all-day long, to clean up every single drop of it,” he said.\nThe poor treatment of veterans by President Barack Obama’s Department of Veterans Affairs is an issue that Mast said he has experienced first-hand and comes up as a concern whenever he meets with voters.\n“Our West Palm Beach VA hospital is a very good hospital, all-in-all, they do a pretty good job,” he said.\nBut, even at the West Palm Beach facility, there are problems related to the people who work there, he said. “When you have somebody there who is rude or inattentive or does not do there job well? You don’t ever see that person leave. They still continue to exist there.”\nThere is one two-week incident Mast said he experienced that illustrates how keeping the wrong people employed at the VA is the problem.\n“Last time I needed a new cane from the VA, I went to them–we’re talking about a cheap $20 or $30 cane–I went to the VA and they said: ‘OK, Brian, first you need to go to your primary physician to get a script,” he said.\nThe combat veteran waited a week for an appointment with his “prime” and that doctor told him, “No, I can’t write you a script. You have to go see physical therapy and physical therapy will write you a script for a cane.”\nMast said he waited another week and went to his appointment with the physical therapist. “Then, they tell me: ‘We can write you a script for a cane, but before we do that, we need you to to talk a one-hour class on how to use a cane.'”\nAt that point, the Republican candidate for Congress with two prosthetic legs attached at the knees told himself he would just buy himself a cane.\n“I was pretty upset about it,” he said. “I spent a-year-and-a-half learning how to walk and use a cane and everything else–if anyone does not need a class on how to use a cane, it’s me.”\nThe real lesson is that people working for the VA were looking to pump up there own productivity reports through hassles they put veterans through, he said.\n“That system of federal bureaucracy, where they are simply trying to justify their own existence by making up things for other people to do,” he said. “I didn’t need a class on using a cane, but at the end of the fiscal year, they could go up and say: ‘Look, we gave this many classes on this, and this and this.”\nThis culture of federal bureaucrats taking care of themselves is consistent in every VA hospital from top to bottom, he said.\nThe Republican Primary for Florida-18 is held Aug. 30 and there are four other candidates for the open House seat:Rebecca Negron, Carl Domino, Rick Kozell, Noelle Nikpour and Mark Freeman.\nThe incumbent Democrat Rep. Patrick Murphy is running for Senate.","url":"https://www.breitbart.com/politics/2016/08/09/exclusive-brian-mast-says-in-dc-hell-fight-va-hacks/"}
