{"authors":["Lee Stranahan"],"date_download":"2018-10-30 21:23:16","date_modify":"2018-10-30 21:23:16","date_publish":"2015-10-13 12:43:41","description":"In an exclusive interview with Breitbart News, Oregon pastor Randy Scroggins described how the media used a quote from him in the wake of the Umpqua Community College Shooting to attack GOP Presidential candidate Ben Carson.","filename":"data/vaneerConsumption/EXCLUSIVEMediaSmearsBenCarsonbyTrickingRoseburgPastor.json","image_url":"https://media.breitbart.com/media/2015/10/12043037_536365619863242_6063617442337627035_n.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_10_13__1540934596.html","title":"EXCLUSIVE: Media Smears Ben Carson by Tricking Roseburg Pastor","title_page":"EXCLUSIVE: Media Smears Ben Carson by Tricking Roseburg Pastor | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In an exclusive interview with Breitbart News, Oregon pastor Randy Scroggins described how the media used a quote from him in the wake of the Umpqua Community College Shooting to attack GOP Presidential candidate Ben Carson.\nPastor Scroggins—whose daughter survived the UCC shooting—first revealed in this past Sunday’s sermon at Roseburg’s New Beginnings Church of God that a media outlet had asked Scroggins for a quote.\n“Somebody had come to me and asked me, ‘What do you think about Christians holding up signs that say ‘I am a Christian?’ and my comment was very simple—if you want to hold up a sign, I have no problem. In fact, if you want to put a little fish on your bumper, I have no problem. The only thing I ask is this… before you hold up a sign or put a fish on your bumper, why don’t you study the life of Jesus?”\nScroggins’ comment was a general one with a message familiar to all Christians: walk the talk. “If you can live like Him” Scroggins says,“then hold up a sign.”\nHowever, Scroggins’s comments came right in the middle of a media pile-on of Dr. Ben Carson, who has risen to become a top contender for the GOP nomination in recent polls. Carson has come under intense media fire in recent weeks in what Breitbart News writer Jerome Hudson called “a liberal media lynching.”\nThat’s when the media played its trick and used the general quote applicable to every Christian to smear Carson.\n“They put my quote under Ben Carson holding a sign,” said Scroggins. “I wasn’t talking about Ben Carson at all.”\nThe implication was clear: that Scroggins, who was in the news for his daughter’s role in the UCC tragedy, was implying Carson is a phony Christian.\nScroggins is adamant no such implication was ever intended.\n“I’m not even sure I knew at the time that Ben Carson had held up a sign,” the pastor told Breitbart News. “I believe with all my heart that Ben Carson is a Christian. I believe that. I thought it was a little humorous they took my quote and put it under him, as if I was talking about him. I was not.”\nScroggins’s take is as good natured as one would expect from a man of God, but given that Ben Carson has been assailed by articles with titles like “F*ck Ben Carson,” the media bamboozle that Scroggins experienced might seem less than humorous to those that care about journalism.","url":"https://www.breitbart.com/the-media/2015/10/13/exclusive-media-smears-ben-carson-tricking-roseburg-pastor/"}
