{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:00:05","date_modify":"2018-10-30 19:00:05","date_publish":"2017-04-21 15:28:34","description":"\"John Finney, an American from Paintsville, Kentucky, told Breitbart News exclusively about the moment a terrorist attack began in Paris..","filename":"data/vaneerConsumption/EXCLUSIVEAmericanEyewitnessAccountofParisTerroristAttack.json","image_url":"https://media.breitbart.com/media/2017/04/family.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_04_21__1540926005.html","title":"EXCLUSIVE: American Eyewitness Account of Paris Terrorist Attack","title_page":"EXCLUSIVE: American Eyewitness Account of Paris Terrorist Attack","title_rss":"NULL","source_domain":"breitbart.com","text":"“I was walking down the Champs-Élysées around 9 pm with my wife and three sons, and I stopped to buy a rose for my wife. We were 10 feet away from a person dressed in black garb when all of a sudden I heard a sudden burst of shots. It sounded like about eight bullets,” John Finney, an American from Paintsville, Kentucky, told Breitbart News in an exclusive phone interview.\n“There were police in the street when the person started shooting,” Finney, 51, whom friends call “Jack” added, recalling the moments he and his family (pictured) witnessed a terrorist rampage on the streets of Paris.\n“The shooter was very thin. He looked to be of Muslim or Islamic descent. His skin tone was darker, but it wasn’t black. He had facial hair, but it was light, it wasn’t a full beard,” Finney continued. “We saw one shooter, but we heard later there may have been two to four.”\n“I looked him in the eye. My wife looked him in the eye. It was all very quick,” Finney said.\n“He was spraying bullets, kind of in a half moon shape. My wife yells ‘run,’ and my boys start running, and I’m following them. I hear another burst of shots–about ten, and then another ten shots,” Finney says of the attack.\nFinney added, “we did not see the hit, but we saw one of the policemen fall to the ground” when asked if he saw anyone hit by the bullets.\n“It was all really quick. It was one of those things in slow motion. When it happens to you, it’s so quick, you just react,” Finney emphasized.\n“I was very proud of how how my wife and three boys reacted. They were urgent, but not panicked. There are people panicking everywhere. One lady with a baby fell down, and my son helped her up. Then another lady fell down and hit her head, and I helped her up,” he notes.\nFinney said the attack happened at 9:02 pm local time.\n“My wife sent a text just as it happened. It was 9:02 pm local time. Right now it’s 12:43 am local time,” he said.\n“We ran into the Swatch Watch shop, which was about 35 feet away from the shooter. The management there was fantastic. They pulled down the metal door,” he added.\n“We were locked down there for about two hours. They had French Special Forces out in the street. There were all kinds of helicopters around. Then after about two hours, they evacuated us out of the Swatch Watch shop, and got us back to our hotel, where we are now,” Finney said.\n“From what I saw, this was a pretty big event. At the time, we felt they were still searching for other terrorists. I can’t say enough great things about the French police. I can’t say enough great things about the French people.\n“I was told there was an actual warning given to the military that an event like this might happen. I wish they had made us aware of that. There were thousands of people on the street at the time.”\nFinney praised what he said was “the heroic behavior of the French Police.”\nFinney and his wife, Dr. Angela Maggard, were in Paris with their three sons, one 16 and twins aged 14, to celebrate the couple’s 30th wedding anniversary.\nEarlier in the day, Finney, his wife, and their three boys had visited the Phoenix Hotel then gone out to a restaurant for dinner.\n“We wanted to show our boys where we stayed thirty years ago,” Finney said.\nFinney wanted Breitbart News to know two key points about the attack.\n“One, it was a terrorist attack,” he said.\n“Two, it was placed around the election.”\nEarly Friday morning, The Standard reported Finney’s account of the terrorist attack he and his family witnessed:\nA terrified family caught up in the attack have revealed today how they looked the gunman “in the eyes” before running for their lives as he opened fire on police. John Finney, 51, shielded his wife and children as they fled the attacker. The Finney family, tourists visiting Paris en route to London from their home in Kentucky. were walking down the famous boulevard when a series of blasts rang out. Mr Finney told the Standard: “My wife and I looked him in the eye. It was like slow-motion. We are blessed to be alive.” His 16-year-old son Jack said: “There was a single gunman in black clothes on the sidewalk in between a hotel and a police van. Three rounds of machine gun fire were shot off. “He was about 20ft from us on the crowded street. It was a Kalashnikov, all black. It was very terrifying. “Everyone started running including me. We saw a few people fall. My dad held his arms out and covered as much of us as he could as we ran away, not sure if we were going to be shot at. “I knew more and more attacks have been happening here but I really didn’t expect one to happen as I walked down such a famous street.” The family sought refuge in a nearby branch of Swatch along with other shocked witnesses before being given the all-clear by police more than two hours later. Mr Finney said that French special forces and bomb squads were “sweeping every inch of the area involved” following the attack. He said his family, who are scheduled to travel on to London on Sunday, would not be scared into returning home early. He said: “We will not live in fear and we will not bow to the terrorists.”\n“John Finney, an American tourist from Kentucky visiting Paris with his family told NBC News that he had been 10 feet away when the shooter opened fire,” NBC News reported:","url":"https://www.breitbart.com/politics/2017/04/21/exclusive-american-eyewitness-account-of-paris-terrorist-attack/"}
