{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:16:21","date_modify":"2018-10-30 19:16:21","date_publish":"2016-10-19 21:06:49","description":"A lawyer-contestant from the second season of The Apprentice who has had extensive and regular contact with other contestants told Breitbart News he rejects as false any media report that Donald J. Trump sexually harassed women competing on the show. | Politics","filename":"data/vaneerConsumption/ExclusiveApprenticeContestantDismissesClaimsTrumpSexuallyHarassedContestants.json","image_url":"https://media.breitbart.com/media/2016/10/gettyimages-461643890-Trump-Apprentice-Contestants.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_19__1540926981.html","title":"Exclusive–‘Apprentice’ Contestant Dismisses Claims Trump Sexually Harassed Contestants","title_page":"Exclusive--'Apprentice' Contestant Dismisses Claims Trump Sexually Harassed Contestants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A lawyer-contestant from the second season of The Apprentice who has had extensive and regular contact with other contestants tells Breitbart News he rejects as false any media report that Donald Trump sexually harassed women competing on the show.\nAny suggestion that the Republican nominee behaved in a sexually improper manner with female contestants on the program strikes him as false and virtually impossible, said Bradford Cohen, a Fort Lauderdale, Florida, Miami-based attorney, who is part of the informal networks of contestants from The Apprentice, who gossip with each other about the show and its personalities.\n“Honestly, it takes me by surprise in terms of the individuals that are coming forward–now–and making these allegations,” he said.\n“As an attorney, I always look at timing,” he said. “I don’t really believe in coincidence.”\nCohen said the rapid flurry of accusations leveled at Trump, all at the same time, makes him very suspicious.\nFormer Apprentice contestant from the show’s fifth season Summer Zervos came forward last week as a client of Hillary Clinton supporter Gloria Allred and claimed that Trump has forced himself upon her in a sexual manner.\n“All of a sudden these four or five people come forward with things that all happened at different periods of time–that they said happened—happened years and years ago? It is just very unusual to me,” he said.\n“While we were on the show, we had contact with Mr. Trump, but there was always people around,” he said.\n“We were shooting almost every day,” he said. “While you are on the show you have very limited contact with Mr. Trump, not with other people. No one is ever alone with Mr. Trump, while the shooting is occurring, in terms of contestants.”\n“In my season, I was the leader on the first task and the reward was having dinner with Mr. Trump at his apartment in Trump Tower–I was actually on the women’s team on my season, I was the only man on the women’s team–we all went up for dinner with Mr. Trump, he was a gentleman, everything that took place was on the up-and-up, and he talked about his wife consistently and she actually had dinner with us–we had a nice conversation.”\nAfter shooting, Mr. Trump left the set, Cohen said. “Sometimes, Mr. Trump, well not really Mr. Trump, but somebody from the production staff would send a message to you, like: ‘Hey, Mr. Trump thought you did great. Or: He’s sorry he fired you. Or, just something nice from Mr. Trump. Never anything negative.”\n“I’ve been in contact with Mr. Trump, since the show ended, and also in contact with at least one person from every season of the regular Apprentice,” he said. “There allegations were never raised–we’ve never even heard rumors of these allegations.” Trump’s program had non-famous professionals competing in the first six seasons and the 10th; in other seasons, the contestants were celebrities.\nCohen said that very atmosphere of the show’s community meant that there were no secrets. He went on to say:\nI am a criminal defense attorney. I’ve represented victims of sexual abuse and defendants who were accused of some sort of sexual impropriety. I can tell you that in this instance, because, we’ve all had the same experience on the show–we share a lot of instances of what happened on the show, or after the show, there’s stories that fly around–everyone talks to each other–there’s emails back-and-forth and texts–and there was never a word or even a hit of impropriety that anyone ever stated and yes, someone on one of the seasons,would have said something to someone.\nAnother fact to consider was that given the way people left the show, many of them would have been in an emotional state that opened them up to lashing out at Trump and not wanting to keep his secrets, if there were any, he said.\n“Getting fired on a national stage is never a happy moment,” he said.\n“It was not a happy moment for me,” Cohen said. Cohen was fired in the second week of the show’s second season.\nThe lawyer said given the animosity and bitterness surrounding some of the show’s exits, he is certain accusations of sexual misconduct would have come out sooner. “You know? Three weeks before a national election? As I said, there weren’t even rumors, so it seems strange that this would be brought up now.”\nThe Ponderosa was another opportunity for stories to surface, he said.\nWhen contestants were fired from the show, they moved to the group apartment at Trump Tower to private apartments at another Trump property in New York City, called The Ponderosa, where they were sequestered until the shooting of the season was completed, he said.\n“Until the show ends, we’re all sequestered,” he said.\n“People get fired and they would back to the Ponderosa and tell stories about how they got fired,” Cohen said.\nWith no contact with the outside world, the fired contestants talked about nothing else except the show, sharing stories and rumors, he said. “It was all we had.”\nAfter he left the show and completed his publicity appearances for the program, Cohen said he would still have contact with the New York City developer, including a time when Trump still owned the Miss Universe beauty pageant and Cohen was at the pageant’s home in Las Vegas.\n“I saw him interact there with individuals there–always a gentleman,” he said. “I am friends with women who competed in Miss Universe and they have nothing but great things to say about Mr. Trump.”","url":"https://www.breitbart.com/politics/2016/10/19/exclusive-apprentice-contestant-dismisses-claims-trump-sexually-harassed-contestants/"}
