{"authors":["Matthew Boyle"],"date_download":"2018-10-30 20:21:44","date_modify":"2018-10-30 20:21:44","date_publish":"2015-12-14 03:51:32","description":"Exclusive — ‘Egg On Their Face’: Team Rand Mocks Mainstream Media For False Predictions He Would Not Make Debate Stage","filename":"data/vaneerConsumption/ExclusiveEggOnTheirFaceTeamRandMocksMainstreamMediaForFalsePredictionsHeWouldNotMakeDebateStage.json","image_url":"https://media.breitbart.com/media/2015/12/GettyImages-496567868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_13__1540930904.html","title":"Exclusive - ‘Egg On Their Face’: Team Rand Mocks Mainstream Media For False Predictions He Would Not Make Debate Stage","title_page":"Exclusive — ‘Egg On Their Face’: Team Rand Mocks Mainstream Media For False Predictions He Would Not Make Debate Stage","title_rss":"NULL","source_domain":"breitbart.com","text":"LAS VEGAS, Nevada — The presidential campaign of Sen. Rand Paul (R-KY) is mocking the mainstream media after several inside-the-beltway reporters falsely predicted that Paul wouldn’t make the debate stage here on Tuesday evening.\nPaul, CNN announced on Sunday morning, will be right there on the main stage—not relegated to the undercard debate like New Jersey Gov. Chris Christie was at the last debate.\n“Some in the media have no integrity, instead of waiting until polling is actually announced they try to predetermine outcomes, only to once again find egg on their face,” Sergio Gor, Paul’s communications director, told Breitbart News exclusively.\nPretty much everyone from major media outlets, with the exception of Breitbart News Network, falsely reported ahead of CNN announcing the debate lineups that Paul wouldn’t be on the main stage.\n“Kentucky Senator Rand Paul will almost certainly fail to qualify for the primetime stage at next Tuesday’s fifth Republican primary debate, according to an analysis of poll data conducted by Bloomberg,” Bloomberg Politics wrote. “Paul has been included in all four of the main presidential debates to this point in the campaign.”\n“Sen. Rand Paul, after a disappointing Iowa poll all but assuring that he will be relegated to the undercard stage at next Tuesday’s Republican debate, is arguing that he deserves to be at the big kids’ table — and hinting that he might have more to say about the matter next week,” Politico’s Daniel Strauss wrote.\n“Sen. Rand Paul (R-Ky.) is in serious danger of missing out on next week’s GOP debate main stage as his polling continues to sputter nationally and in early states,” The Hill’s Ben Kamisar wrote. “While CNN has given candidates three avenues to qualify for the main stage — meeting either a 3.5 percent average national threshold or a 4 percent average threshold in Iowa or New Hampshire — Paul has failed to muster enough support as of Friday morning, according to The Hill’s analysis of qualifying polls.”\nSeveral other major mainstream outlets jumped the gun by also falsely predicting before CNN—the network moderating Tuesday’s debate here at the Venetian Resort and Casino, which is owned by GOP mega-donor Sheldon Adelson—released its criteria that Paul wouldn’t make it.\nPaul consistently and repeatedly throughout this whole process maintained that he expected to make the main debate stage, and that if he didn’t he would continue forward with his campaign. But that didn’t stop some in the media from falsely suggesting he is considering dropping out—most notably the Boston Globe and The Hill, which parroted the Globe’s incorrect narrative after the Boston newspaper wrote its piece on the matter.\nPaul, of course, is the big winner here since the entire mainstream media inaccurately predicted negative things about him—much the same way the media has inaccurately gone after other conservatives this cycle like Donald Trump, Sen. Ted Cruz (R-TX) and more.\nLast debate, in Milwaukee, Paul had one of the best performances he’s had yet on the debate stage this cycle. Paul was the first rival of the establishment, donor-class-backed Sen. Marco Rubio (R-FL) to really knock Rubio off his game in an exchange about defense spending levels.\nSince then, Rubio has found himself unable to gain momentum—and has essentially been stuck in the same polling position since mid-October in large part thanks to Paul kicking off the effective blows against him. Other candidates like Cruz and Trump have landed some hard hits on Rubio—and New Jersey Gov. Chris Christie has in at least one poll surged past Rubio in New Hampshire after earning the endorsement of the New Hampshire Union Leader, an endorsement that Rubio was previously expected to receive.","url":"https://www.breitbart.com/politics/2015/12/13/exclusive-egg-face-team-rand-mocks-mainstream-media-false-predictions-not-make-debate-stage/"}
