{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:56:34","date_modify":"2018-10-30 19:56:34","date_publish":"2016-08-03 19:30:19","description":"\"It shouldn’t take the threat of a subpoena just to get a government agency to detail how it is spending taxpayers’ money,\" said Rep. Jeff Miller (R.-Fla.), the chairman of the House Committee of Veterans Affairs. \"Unfortunately the department has driven us to that point. Nevertheless, our investigation into this matter will continue until all the facts are at hand.” | Politics","filename":"data/vaneerConsumption/ExclusiveHouseChairmanSaysHeWillIssueSubpoenasOverVAWasteCorruption.json","image_url":"https://media.breitbart.com/media/2016/03/department-of-veterans-affairs-logo-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_03__1540929394.html","title":"Exclusive: House Chairman Says He Will Issue Subpoenas Over VA Waste, Corruption","title_page":"Exclusive: House Chairman Says He Will Issue Subpoenas Over VA Waste, Corruption | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The chairman of the House Committee on Veterans Affairs tells Breitbart News he is frustrated with the resistance and delaying tactics he encounters from the Department of Veterans Affairs as he works to improve how the VA serves veterans and investigate waste.\n“It shouldn’t take the threat of a subpoena just to get a government agency to detail how it is spending taxpayers’ money,” said Rep. Jeff Miller (R.-Fla.), the chairman of the House Committee of Veterans Affairs. “Unfortunately the department has driven us to that point. Nevertheless, our investigation into this matter will continue until all the facts are at hand.”\nVeterans are paying the price as President Barack Obama‘s VA blows taxpayer money on artwork or other boondoggles, he said.\n“Whether it’s the still-unfinished hospital that’s more than $1 billion over budget, near-$300,000 relocation packages for senior executives, or millions in failed green-energy projects, the Department of Veterans Affairs has proven itself essentially incapable of fiscal responsibility,” he said.\n“The Department of Veterans Affairs lavish spending on extravagant works of art is more proof of this sad fact, which is precisely why VA is refusing to provide the figures our committee has requested,” Miller said.\nAlthough the news of the $20 million–and maybe more–spent on artwork has been in news lately, the chairman spoke Sept. 30 about the spending spree on the House floor.\nMiller said on the House floor he was stunned to learn the VA purchased an art installation on the side of a parking garage that displays quotes by Abraham Lincoln and Eleanor Roosevelt in Morse code that cost $285,000. There was also a large rock sculpture and courtyard in the middle of the mental health center that costs $1.3 million, a stainless steel and aluminum sculpture in the aquatic center entrance that cost $365,000.\n“Another sculpture that I am at a loss to describe in an exterior lobby that cost $305,000 and a sculpture in the shape of a half arc that is located inside the mental health center that cost $330,800,” he said.\nMiller also spoke out that day about the VA’s long-delayed and way-over-budget hospital project in Denver.\n“While I am supportive of the provisions of this bill up to this point, I vehemently disagree with the department’s proposal to cover the increased costs of the Denver project,” he said. “This bill would allow VA to proceed with the department’s proposed plan to use$200 million in offsets from the medical services account and through delayed activations for other construction project.”\nThe chairman said then on the House floor that the idea of a new veterans hospital in Denver started 16 years ago.\n“The project was first envisioned as a shared facility on the former Fitzsimmons army base in Aurora, Colorado,” he said. “The initial estimate for a shared facility was $328 million.\nAfter several years, the price tag for the project grew to $800 million, he said. The VA has completely mismanaged the construction site, so that the new price tag is $1.675 billion.\n“The VA senior executives in charge of the Denver disaster collected massive bonuses as project costs skyrocketed and delays stretched on for years,” he said.\n“They have since retired with full benefits,” he said.\n“This is inexcusable,” he said. “To allow rewards, bonuses and full retirement benefits to be retained, even when the facts indicate that an employee has not performed to the level expected, is not only wrong, it is also a blatant and woeful misuse of taxpayer dollars.”","url":"https://www.breitbart.com/politics/2016/08/03/house-chairman-will-issue-subpoenas-va-waste-curruption/"}
