{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 18:11:27","date_modify":"2018-10-30 18:11:27","date_publish":"2016-11-16 13:08:40","description":"Rep. Steve Stivers says one to the most important things he's learned is that it is all about winning. \"You've got to win races and he did a great job at it.\" | Politics","filename":"data/vaneerConsumption/ExclusiveNewNRCCChairmanRepSteveStiversSharesPlantoWinAgainin20182020.json","image_url":"https://media.breitbart.com/media/2016/11/AP_269042272019.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_16__1540923087.html","title":"Exclusive–New NRCC Chairman Rep. Steve Stivers Shares Plan to Win Again in 2018, 2020","title_page":"Exclusive--New NRCC Chairman Rep. Steve Stivers Shares Plan to Win Again in 2018, 2020 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The new chairman of the National Republican Congressional Committee sat down with Breitbart News for an exclusive interview about the lessons learned that will inform his two-year term running the political wing of the House Republicans.\n“You’ve got to be ready for battle,” said Ohio’s Rep. Steve Stivers, who served as the deputy chairman of the NRCC. He defeated Texas’ Rep.Roger Williams, when the House Republican Conference met Tuesday to elect its leadership for the next session of Congress.\n“Roger’s a good man,” the new chairman said of his challenger.\n“We had a two-minute conversation, shook each other’s hand–Roger’s a good man. He is a friend of mine. Roger has ideas and energy and I want to bring that to bear at NRCC and I want to figure out if there is a place, where we can put him that he feels comfortable with and that works,” he said.\n“I am committed to bringing Roger into the organization as an active member,” Stivers said. “He’s always exceeded his dues. He’s always been a great member of NRCC and our conference.”\nWilliams told Breitbart News he wants to work with the new chairman to grow and improve the NRCC.\n“Congratulations to Chairman Stivers,” Williams said.\nWe ran an exciting campaign that earned a great amount of support and I am thankful to all my colleagues who worked hard to spread our message. I look forward to working with Chairman Stivers and Speaker Ryan on the important job of protecting and expanding our republican majority to continue to move our country in the direction of lower taxes, less government and a strong national defense.\nStivers made a point of telling Breitbart News of the lessons he learned from outgoing chairman Rep. Greg Walden of Oregon. “You’ve got to make the candidates ready. You’ve got to make sure you have the money and you’ve got to have the organization to win races.”\nStivers said one to the most important things he learned from Walden is that it is all about winning. “You’ve got to win races and he did a great job at it.”\nWalden took the House Republicans to their biggest majority in modern history in 2015 with 247 seats, he said.\n“Then, he essentially maintained it with this new class–we don’t know if Sheriff Jones is a win or lose and we’re not sure-for-sure whether Darrell Issa will win, but Darrell’s slightly ahead and Sheriff Jones is slightly behind, but they are still counting ballots,” he said. Sacramento County Sheriff Scott Jones challenged Rep. Ami Bera (D.-Calif.) and Rep. Darrell Issa, who represents suburban San Diego, was challenged by Democrat Doug Applegate, a retired Marine colonel.\nStivers said he credits Walden with largely protecting the largest Republican majority since 1929, with only six losses, as of deadline.\nThe Ohio congressman said his own rocky road to Congress is going to inform his chairmanship as he looks to grow his majority and protect his incumbents.\n“I was a candidate in 2008 in one of the most hotly contested races in country, where I lost by 2,133 votes,” he said.\n“Then, I ran in 2010, in again one of the most hotly contested races in the country, and I won that race fairly comfortably, in fact we were so far ahead that the DCCC pulled out by October,” he said. The Democratic Congressional Campaign Committee is the political wing for House Democrats. ”\n“I have seen what the NRCC does well, seen what they need to improve on and in consultation–talking to more than 200 of our members of our conference–have come up with a plan,” Stivers said.\nThe Stivers plan includes a special Patriot program for supporting incumbents in primaries, creating a national finance committee to lift the burden of fund raising off the members, recruiting a network of volunteers to staff campaigns and looking forward to the redistricting in the states to make sure Republicans are not manipulated into majority Democratic districts, he said.\n“We have the 2018 and 2020 cycles to win state legislatures and hold some state legislatures to make sure the map that is drawn in 2021 is as good as it can be for us,” the congressman said. “Frankly, that important shaping of the battlefield has to start now.”","url":"https://www.breitbart.com/politics/2016/11/16/rep-steve-stivers-shares-plan-to-keep-gop-control-of-house-in-2018-2020/"}
