{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:46:03","date_modify":"2018-10-30 21:46:03","date_publish":"2015-07-29 20:11:04","description":"Boehner has reportedly been warned not to bring the measure forward Wednesday because he “might be embarrassed.”","filename":"data/vaneerConsumption/EXCLUSIVEBoehnerDiscouragedFromBringingMeadowsResolutionUpMightbeEmbarrassed.json","image_url":"https://media.breitbart.com/media/2015/06/Boehner-Dark-Drew-Angerer-Getty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_29__1540935963.html","title":"EXCLUSIVE: Boehner Discouraged From Bringing Meadows’ Resolution Up, 'Might be Embarrassed'","title_page":"EXCLUSIVE: Boehner Discouraged From Bringing Meadows’ Resolution Up, 'Might be Embarrassed' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Members on the floor of the United States House of Representatives are discussing the future of Speaker John Boehner, and the talks must be troubling to House Leadership.\nBreitbart News has learned that House Speaker John Boehner has “been discouraged” from holding an immediate vote on Rep. Mark Meadows’ (R-NC) resolution to remove Boehner as Speaker of the House.\nAs explained to Breitbart News, House Leadership was considering “tabling” Meadow’s resolution Wednesday afternoon prior to Congress leaving for August recess, but has “been discouraged” from doing so.\nIf Meadows’ resolution were brought to the floor, House Members that want to remove Boehner could vote “yes” to do so. Those that want to keep Boehner as Speaker would vote “no.”\nBoehner has reportedly been warned not to bring the measure forward Wednesday because he “might be embarrassed.”\nIn an exclusive interview with Breitbart News, Rep. Walter Jones (R-NC) said he is standing with Meadows on this measure against Boehner’s leadership.\nJones voted twice to remove Boehner as House Speaker, four years ago and most recently earlier this year.\n“I have nothing personally against Mr. Boehner. I think he’s a good man. I don’t think he’s a good leader,” Jones exclusively told Breitbart News.\n“We are elected by the people of our district – across this country – and people elect us expect us to represent their interest and to vote our conscience,” Jones said.\nThey don’t send us to Washington to be a puppet of any leadership, and when a leader starts coercing and threatening members that don’t vote with them on certain rules or certain legislation – and if they don’t vote with them they get penalized or punished, that’s not the way I think the government should work. We should represent the interest of our people.\nJones told Breitbart News he goes back to his district almost every weekend and his constituents support his previous move to oppose Boehner as Speaker. “The majority of the people in my district do not think that Mr. Boehner is a good leader – they just don’t,” Jones explained.\nHe said it isn’t in the interest of the conservatives who elected the Republican representatives to “have a Speaker of the House who, in my opinion, is more interested about special interest and raising money than the policy of the people.”\n“That’s one reason many of us feel very frustrated,” he added.\n“This is not a conservative leader. A conservative leader would not keep raising the debt ceiling,” Jones said, adding that it’s against Republican principles to grow the government and increase spending – “That’s not this leadership.”\n“Many times he’ll pass legislation by going and working with the Democrats instead of working with Republicans,” Jones added.\nIf Meadows’ measure to remove Boehner isn’t tabled Wednesday, it would hold over until after the August recess.","url":"https://www.breitbart.com/politics/2015/07/29/exclusive-boehner-discouraged-from-bringing-meadows-resolution-up-might-be-embarrassed/"}
