{"authors":[],"date_download":"2018-10-30 20:04:57","date_modify":"2018-10-30 20:04:57","date_publish":"2017-04-11 19:36:00","description":"In 2015, then-DeKalb County policeman Vanito Gumbs purportedly claimed he moonlighted as a “hitman” for the notorious Gangster Disciples street gang.","filename":"data/vaneerConsumption/ExDeKalbcopsaidhewasaganghitmantoimpressagirl.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/11/Images/gumbs,%20vancito_1109x694.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_attorney-dekalb-_8560733dd983660c9080b2567f1d6dc7__1540929897.html","title":"Ex-DeKalb cop said he was a gang 'hitman' to impress a girl","title_page":"Attorney: Ex-DeKalb cop said he was a gang 'hitman' to impress a girl","title_rss":"NULL","source_domain":"ajc.com","text":"In 2015, then-DeKalb County policeman Vanito Gumbs purportedly claimed he moonlighted as a “hitman” for the notorious Gangster Disciples street gang.\nHis attorney now says this wasn’t an admission of one of the most egregious examples of police corruption in Atlanta history — it was a 20-something guy who lived with his mom making up stories for his girlfriend.\n“The (accusations) are based on foolish, youthful text-message statements made by Mr. Gumbs to a woman..,” attorney Roger Wilson wrote in a court filing last week.\nWilson claims the U.S. Attorney’s Office, which charged Gumbs in a massive racketeering case involving the gang, has no evidence he was involved in any murder.\nWilson is asking the court to let Gumbs out of federal custody in Lovejoy. He’s been held there since last May.\n“He has now been incarcerated without trial and fully proclaiming his innocence for almost a year,” Wilson wrote in the motion, to which the government hasn’t yet responded.\nWilson claims many of the allegations come from Gumbs’ now-ex girlfriend and that the feds don’t have other evidence to back them up.\nGumbs, however, doesn’t deny having a relationship with Kevin Clayton, the alleged “chief enforcer” for the Disciples’ Georgia chapter.\n“Mr. Gumbs was a DeKalb County police officer whose beat included the South DeKalb neighborhoods where Mr. Clayton apparently was very active, very visibly, in a variety of public activities, including youth sports and organizing,” the defense attorney wrote.\nProsecutors allege Gumbs gave Clayton information about police activity to keep Clayton safe from arrest.\nGumbs was hired at the police department in November 2013.\nThe subsequent allegations against him have been among the most startling as DeKalb deals with a dangerous gang problem.\nGangs have destroyed and ended many lives in the county. A leader even allegedly ordered the murder of a baby boy who then died in his mother’s arms.\nThe 2016 indictment that charged Gumbs and scores of other alleged gang members was lauded by the feds as a huge blow to the Gangster Disciples.\nBut police records suggest the gang is still in DeKalb.\nThis week, a purported member was arrested on charges of molesting a child while initiating the boy into the gang.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/attorney-dekalb-cop-said-was-gang-hitman-impress-girl/EvYJXt2sM6rekoVmucUziM/"}
