{"authors":[],"date_download":"2018-10-30 20:07:01","date_modify":"2018-10-30 20:07:01","date_publish":"2015-11-05 17:49:25","description":"The now-former DeKalb County middle school teacher and coach arrested in May for allegedly allowing students to have sex in a classroom closet has been charged with felony child molestation for allegedly texting pornographic images of himself and others to a student.","filename":"data/vaneerConsumption/ExDeKalbteacherfacesporntextingcharge.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/05/Images/photos.medleyphoto.8355529.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_dekalb-teacher-faces-porn-texting-charge__1540930021.html","title":"Ex-DeKalb teacher faces porn-texting charge","title_page":"Ex-DeKalb teacher faces porn-texting charge","title_rss":"NULL","source_domain":"ajc.com","text":"The now-former DeKalb County middle school teacher and coach arrested in May for allegedly allowing students to have sex in a classroom closet has been charged with felony child molestation for allegedly texting pornographic images of himself and others to a student.\nQuentin Wright sent the images via the Kik chat app to a child under age 16 in April, said Terrie Clark, spokeswoman for DeKalb County Solicitor-General Sherry Boston, who led the investigation.\nWright was in DeKalb County Jail on Thursday with bond set at $5,000 bond.\nWright, 25, resigned his post as a basketball coach and math and science teacher at Stone Mountain’s Champion Theme Middle School after his May 19 arrest on four counts of contributing to the delinquency of a minor. Four students allegedly were involved in the classroom closet incidents, which occurred on different occasions, Clark said.\nThose charges were misdemeanors, and Wright’s arraignment them was put off while investigators examined the phones of Wright and students at the school. During their investigation, they said, pornographic images were found.\nThe texted porn allegedly was sent to one student who was not among the four students involved in the classroom closet incidents, the authorities said.\nThe case now will go to the DeKalb County district attorney.\nBoston said her office pursued the case beyond the initial allegations because “it did not feel right to any of us. (The allowance of sex in the classroom) is very unusual behavior. We were not content … with closing the case. It was just a feeling.”\nShe said investigators logged more than 80 hours conducting interviews and searching through the phone content that led to the more serious felony charge of child molestation.\nThe misdemeanor charges could have resulted in no jail time.\n“This is the type of charge that, if true, warrants prison time,” Boston said, adding that it is important to make sure there are no more victims.","url":"https://www.ajc.com/news/crime--law/dekalb-teacher-faces-porn-texting-charge/BPSEioNFSDrqAnLkKVFktN/"}
