{"authors":["David Gorn","Julie Cart","Felicia Mello"],"date_download":"2018-10-30 23:28:06","date_modify":"2018-10-30 23:28:06","date_publish":"2018-06-26 18:55:00","description":"Why sue now? The order did not require that roughly 2,300 children be returned to their parents or directly state that family separations will end.","filename":"data/vaneerConsumption/ExecutiveorderornotCaliforniasues.json","image_url":"https://calmatters.org/wp-content/uploads/AdelantoDetention.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540942086.html","title":"Executive order or not, California sues","title_page":"Family separations at the border: Executive order or not, California sues","title_rss":"NULL","source_domain":"calmatters.org","text":"Yes, California is suing the Trump administration again—co-leading a coalition of 17 state attorneys general who are contesting the “zero-tolerance” practice of separating young children from their undocumented parents at the border.\nBut wasn’t it just one week ago that Trump signed an executive order to reverse that practice? Why sue now?\nAmong the reasons: The executive order did not require that roughly 2,300 children be returned to their parents, and it did not directly state the practice will end.\n“President Trump’s Executive Order says nothing about reuniting families, has no impact on the thousands of families who have already been traumatized, and is so vague and equivocal that it is unclear when or if any changes will actually be made,” said the joint statement released today by California Attorney General Xavier Becerra and leaders from the other states and the District of Columbia.\nAnd in a separate case, a federal judge in San Diego later in the day issued a preliminary junction ordering the Trump administration to reunite any of the affected families within at least 30 days. In that case, brought by the American Civil Liberties Union, the judge rebuked the administration’s policy. He noted that “the facts set forth before the court portray reactive governance — responses to address a chaotic circumstance of the government’s own making. They belie measured and ordered governance, which is central to the concept of due process enshrined in our Constitution.”\nNiels Frenzen, a USC professor specializing in immigration law, said the main issue with the executive order the president signed June 10 is that it’s not a definitive order.\n“It doesn’t actually prohibit separation,” Frenzen said. “It has a number of exceptions, so you could still have families separated. And of course, the children who have already been separated from their parents, that’s a big problem.”\nFederal officials have promised that any parents who agree to be deported will get their children back.\nThe U.S. Justice Department argued in court that its reunification procedures should be given time to work, and that they were necessary to enforce immigration law and protect children from endangerment by smugglers or by parents risking their safety by bringing them into the country illegally. The U.S. Department of Homeland Security said it had a process “to ensure that family members know the location of their children and have regular communication after separation to ensure that those adults who are subject to removal are reunited with their children for the purposes of removal.”\nBut Alex Azar, head of the federal Health and Human Services agency in charge of the children, said parents who insisted on filing a claim for asylum would remain in detention—and since there’s a 20-day limit for children’s detention, they couldn’t stay with their parents.\nThat didn’t sit well with California Democratic Sen. Dianne Feinstein: “The administration is holding children hostage to push parents to drop their asylum claims,” she said in a tweet.\nThere’s not much California can directly do about it, Frenzen said, outside of pursuing legal action.\nOne California law passed last year requires state inspections of all non-citizen detention centers—but that law could not include federal facilities. Likely as a result, federal officials chose to detain undocumented immigrants in California in the medium-security federal penitentiary in Victorville to detain immigrants in California, Frenzen said. That law also restricts expansion of city and county detention centers, but has no jurisdiction over private, for-profit facilities, so he doesn’t expect federal officials to reach the limits of detention capacity in the long term.\nFrenzen said it’s against international law to deter asylum seekers, and it’s also a violation of U.S. immigration law, “because people do have a right to present themselves and seek asylum at a border crossing.”\nMembers of the Trump administration have defended their approach. The president himself said today that he has inherited the worst immigration system in the world. And as critics have ratcheted up their condemnation, his attorney general, Jeff Sessions, fired back.\nAddressing the conservative Criminal Justice Legal Foundation today in downtown Los Angeles, Sessions had plenty to say about the protesters gathered outside the hotel, and about California lawmakers.\n“The rhetoric we hear from the other side on this issue—as on so many others—has become radicalized,” he said. “We hear views on television today that are on the lunatic fringe, frankly.”\nCalifornia’s Democratic Assembly Speaker Anthony Rendon tweeted that he wouldn’t keep donations from a company that runs for-profit detention centers in California: “Upon learning the role that Core Civic is playing in the detention of children separated from their parents by ICE, I directed my campaign to donate any donations I received from Core Civic to the Anti-Recidivism Coalition.”\nRecipients of the company’s donation include the Democratic Party, candidate for governor Gavin Newsom and many other politicians.\nLearn about all of California lawsuits against the Trump administration with our tracking tool.","url":"https://calmatters.org/articles/trump_california/executive-order-or-not-california-sues-over-family-separations/"}
