{"authors":["Ali Waked"],"date_download":"2018-10-30 19:38:34","date_modify":"2018-10-30 19:38:34","date_publish":"2016-11-16 12:10:23","description":"Iran has demanded that Hamas execute the killers of a high-profile Shi'ite activist who was killed in Gaza last week.","filename":"data/vaneerConsumption/ExecuteKillersofShiiteActivist.json","image_url":"https://media.breitbart.com/media/2016/01/saudi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_11_16__1540928314.html","title":"Execute Killers of Shi'ite Activist","title_page":"Iran to Hamas: Execute Killers of Shi'ite Activist","title_rss":"NULL","source_domain":"breitbart.com","text":"JAFFA, Israel – Iran has demanded that Hamas execute the killers of a high-profile Shi’ite activist who was killed in Gaza last week, according to a Palestinian security official.\nMithqal Alsalmi, 36, recently converted to Shi’a and was a vocal advocate of the faith and Iranian ideology in the predominantly Sunni Gaza Strip.\nHe received many threats and was repeatedly arrested by Hamas forces until his assassination last week by unknown gunmen, who are still at large.\nAlslami’s killing was condemned across the Shi’ite world, where Hamas was accused of stoking an anti-Shi’ite atmosphere and restricting the freedom of worship.\nSpeaking to Breitbart Jerusalem, a Palestinian security official said that there is information Alsalmi’s killers were members of Izz ad-Din al Qassam Brigades, Hamas’ military wing, who reside in the Shati refugee camp, near former Prime Minister Ismail Haniyeh’s house.\nHe further said that the man who pulled the trigger fled to Sinai immediately after the assassination, and two accomplices, also affiliated with Hamas, were arrested.\nDespite their membership of Hamas, he said, all three have openly adhered to an extremist Salafi ideology and are Islamic State sympathizers, and have attended the “reeducation” courses that Hamas set up to tame IS’ appeal among its activists.\n“Apparently it didn’t work, and they remained loyal to IS’ ideology,” the source said.\nIran’s Ahl Albayt Institution, the Islamic Republic’s main Shi’ite outreach body, demanded that Hamas catch Alsalmi’s killers and execute them. According to the source, a formal request was handed to Hamas by Khaled Qadoumi, the institution’s representative in the Gaza Strip.\n“The motive was sectarian, and as such the killers should be brought to justice and executed,” the institution said, claiming that future attempts on Shi’ites’ lives are looming.","url":"https://www.breitbart.com/middle-east/2016/11/16/iran-hamas-execute-killers-shiite-activist/"}
