{"authors":["Associated Press"],"date_download":"2018-10-23 03:18:50","date_modify":"2018-10-23 03:18:50","date_publish":"2016-01-28 18:44:40","description":"BEACON, N.Y. (AP) — The executive director of New York's Hudson River environmental conservation group founded by the late folk singer Pete Seeger has resign...","filename":"data/vaneerConsumption/ExecutivedirectorofSeegersenvironmentalgroupresigns.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:a79f075f551b4172a1bb948cf1214d5a-2vdWmEltwXfba0ce28e632bb450d-271_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421426_Executive-director-Seegers-environmental-group-resigns_1540264730.html","title":"Executive director of Seeger's environmental group resigns","title_page":"Executive director of Seeger's environmental group resigns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Executive director of Seeger's environmental group resigns\nBEACON, N.Y. (AP) — The executive director of New York's Hudson River environmental conservation group founded by the late folk singer Pete Seeger has resigned.\nThe Hudson River Sloop Clearwater says Peter Gross announced his resignation Wednesday, a week after he said the Beacon-based nonprofit organization was cancelling its annual music festival this year because of financial difficulties.\nGross, executive director since May 2014, said he was resigning over \"significant differences\" on how best to handle the group's finances and other issues.\nFILE - In this May 3, 2009 file photo, Pete Seeger performs at the benefit concert at Madison Square Garden in New York. The concert is a benefit for Hudson River Sloop Clearwater, a sloop created by Seeger to preserve and protect the Hudson River. The Hudson River Sloop Clearwater says executive director Peter Gross announced his resignation Wednesday, Jan. 27, 2016, a week after he said the Beacon-based nonprofit organization was canceling its annual music festival because of financial difficulties. (AP Photo/Evan Agostini, File)\nGross announced last week that the two-day concert held in June at a riverside park was being called off because the organization couldn't risk losing money on the event when it's focusing its finances on renovating the Clearwater.","url":"https://www.dailymail.co.uk/wires/ap/article-3421426/Executive-director-Seegers-environmental-group-resigns.html"}
