{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-23 00:03:27","date_modify":"2018-10-23 00:03:27","date_publish":"2017-04-26 09:07:17","description":"Cassie and Ryan Thistleton, both 34, have slammed the controversial dating show, saying they were told it would be an documentary and it only worsened their relationship.","filename":"data/vaneerConsumption/ExesCassieandRyanThistletonSLAMSevenYearSwitch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9D01B800000578-0-image-a-103_1493189645452.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446438_Exes-Cassie-Ryan-Thistleton-SLAM-Seven-Year-Switch_1540253007.html","title":"Exes Cassie and Ryan Thistleton SLAM Seven Year Switch","title_page":"Exes Cassie and Ryan Thistleton SLAM Seven Year Switch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They split in February after trying to resurrect their relationship on Seven Year Switch last year.\nAnd Cassie and Ryan Thistleton, both 34, have slammed the controversial dating show, saying they were told it would be an observational documentary and it only worsened their relationship.\nThe former couple's revelations come after Michelle Guest blasted the series last week, telling Mamamia she had no idea they would be partner swapping.\n'It was a feeling of complete violation': Ex-couple Cassie and Ryan Thistleton SLAM Seven Year Switch for fracturing their relationship further\nCassie and Ryan appeared on Seven Year Switch to try and revitalise their relationship, which had been damaged due to the traumatic loss of their unborn child at 37 weeks in 2013.\nDespite trying to make things work after their time apart on Seven Year Switch, the pair announced they had separated in February.\nThey remain on friendly terms and both care for their three daughters.\n'From the moment we saw the first commercial our hearts sunk!' Ryan said the two had been 'told very different things to the other couples'\nLast week, Cassie wrote on Instagram that she had 'mixed feelings' about the second season of Seven Year Switch.\nRyan chimed in too, saying the two had been 'told very different things to the other couples'.\n'I quote - \"it will be an observatory documentary, u guys have a very different & compelling story that will touch Australia's heart. It will be presented in an organic & genuine view'' (sic),' he wrote.\n'We only first saw the final production when the rest of the country did & from the moment we saw the first commercial our hearts sunk!\nTrusted others: Ryan explained that the couple struggled to reconnect after the loss of their unborn son four years ago, and had 'desperately thrown our hope into the hands of others'\n'It was a feeling of complete violation.'\nRyan explained that the couple struggled to reconnect after the loss of their unborn son four years ago, and had 'desperately thrown our hope into the hands of others' hoping to save their marriage.\n'It only created further strain on our already fragile relationship,' Ryan wrote.\n'It only created further strain on our already fragile relationship': Despite trying to make things work after their time apart on Seven Year Switch, the pair announced they had separated in February\nWhat will Kaitlyn think? It's unknown how participants in this year's Seven Year Switch feel about the show\nCassie agreed with Ryan's comment, writing underneath: 'So true.'\nLast week, Michelle told Mamamia that she and partner Jason had not known they would be separated during filming or partner swapping.\nShe also said they were 'assured many times that it was not going to be a reality television show and 'only found out what it was called the same time as everyone else did, when the first ad went to air'.\nDaily Mail Australia has contacted Channel Seven for comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446438/Exes-Cassie-Ryan-Thistleton-SLAM-Seven-Year-Switch.html"}
