{"authors":["Press Association"],"date_download":"2018-10-23 00:10:43","date_modify":"2018-10-23 00:10:43","date_publish":"2017-03-16 09:08:09","description":"White has signed a two-year deal with the Aviva Premiership club.","filename":"data/vaneerConsumption/ExeterswoopforAustraliascrumhalfNicWhite.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227471-1489655292-125_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319370_Exeter-swoop-Australia-scrum-half-Nic-White_1540253443.html","title":"Exeter swoop for Australia scrum-half Nic White","title_page":"Exeter swoop for Australia scrum-half Nic White | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Exeter have announced the signing of Australia international scrum-half Nic White.\nAnd Jersey back-row forward James Freeman will also be heading to Sandy Park next season after joining White in agreeing a two-year deal.\nWhite, who has won 22 caps for the Wallabies, will move to the Aviva Premiership outfit from French Top 14 club Montpellier.\nNic White is joining Exeter from Montpellier\nChiefs head coach Rob Baxter said: “I just think when a player of Nic’s quality becomes available – and he shows an interest in coming to the club – you have to act quickly.\n“If you look at how he has played, not just at Super Rugby and international level, but also more recently over in France with Montpellier, to me he is exactly the kind of signing you want to bring to the club.\n“I have no doubt he will add great competition to the scrum-halves we have already at the club, but he will also be great for the young players to learn from as well.\n“He will add a real sense of direction and game understanding to us, which I know is going to be important moving forward.”\nAnd reflecting on signing Freeman, Baxter added: “A bit like Nic, James ticks a lot of boxes for us.\n“We keep a very close eye on the Championship. I have watched a lot of James’ games in detail, and again even before we met him, we saw that he had a lot of the qualities and the potential we think to do well in the Premiership.”","url":"https://www.dailymail.co.uk/wires/pa/article-4319370/Exeter-swoop-Australia-scrum-half-Nic-White.html"}
