{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:53:32","date_modify":"2018-10-30 17:53:32","date_publish":"2016-09-30 14:01:02","description":"A former Guantánamo prisoner has reportedly been sentenced to 11 1/2 years for leading a recruiting cell for al-Qaeda.","filename":"data/vaneerConsumption/ExGitmoAlumSentencedto115YearsforRecruitingforAlQaeda.json","image_url":"https://media.breitbart.com/media/2016/06/GITMO-Detainees-Brennan-Linsley-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_30__1540922012.html","title":"Ex-Gitmo Alum Sentenced to 11.5 Years for Recruiting for Al-Qaeda","title_page":"Ex-Gitmo Alum Sentenced to 11.5 Years for Recruiting for Al-Qaeda","title_rss":"NULL","source_domain":"breitbart.com","text":"A former Guantánamo prisoner released in 2006 after he was extradited to Spain has reportedly been sentenced to 11 1/2 years in prison by Spanish court for leading a recruiting cell for al-Qaeda out of the European country’s capital.\nIn 2005, Lahcen Ikassrien, a 48-year-old Moroccan, was extradited to Spain from the U.S. military prison in Guantánamo Bay, Cuba, where he was taken after being arrested in Afghanistan four years earlier for fighting for al-Qaeda ally the Taliban.\nIn Spain, he claimed he was tortured at the Guantánamo facility, also known as Gitmo, and was released in 2006 after a court determined there was not enough evidence to affiliate him with al-Qaeda.\nAccording to the most recent U.S. government statistics, nearly 30 percent of Gitmo prisoners who have been liberated are either confirmed or suspected of having returned to terrorist activities.\nThis week, Ikassrien was found guilty of leading a cell out of Spain’s capital Madrid that provided recruits to Syria for the terrorist groups Islamic State (ISIS/ISIL) and Jabhat al-Nusra when both were operating under the al-Qaeda umbrella.\n“The court also sentenced eight members of the cell — six Moroccans, an Argentinian and a Bulgarian — to eight years in jail for membership of a terrorist organization,” reports Agence France-Presse (AFP).\n“The accused had full knowledge that the jihadist groups Jabhat al-Nusra and the Islamic State of Iraq and the Levant were jihadist structures under the umbrella of Al-Qaeda,” the court reportedly said in its ruling.\nIt added that the cell “recruited, radicalized, indoctrinated and then sent jihadist volunteers” to Syria for the two groups between 2011 and June 2014 when police disbanded it.\nWhile the Islamic State broke off from al-Qaeda in February 2014, al Nusra recently claimed to have cut ties with the group and changed its name to Jabhat Fateh al-Sham (JFS). Some analysts have dismissed JFS’ break with al-Qaeda as a feint.\nAFP reports:\nMore than 100 people from Spain are suspected of having joined jihadist fighters in Iraq and Syria, according to the interior ministry, and authorities fear they may return to launch attacks. In a major crackdown on militants, Spanish police have arrested scores of suspected recruiters in recent years.\nGitmo is currently holding 61 prisoners, including so called “forever prisoners,” which the Miami Herald explains refers to “an indefinite detainee considered too dangerous to release but never charged with a crime.”\nIn August, U.S. President Barack Obama authorized the largest transfer of prisoners of his presidency: 15 Guantánamo detainees were liberated, including two “forever prisoners.”\nA bipartisan group of lawmakers have prevented Obama from shutting down Gitmo.\nPart of the President’s plan to shut down the facility would require bringing detainees onto U.S. soil, a move that is prohibited by bipartisan legislation signed into law by Obama himself.","url":"https://www.breitbart.com/national-security/2016/09/30/spain-former-gitmo-detainee-sentenced-11-5-years-al-qaeda-recruitment/"}
