{"authors":[],"date_download":"2018-10-22 20:54:58","date_modify":"2018-10-22 20:54:58","date_publish":"2014-06-03 16:09:23","description":"Five Taliban militants freed in exchange for captive U.S. soldier Bowe Bergdahl will not be kept in jail in Qatar, a source said.","filename":"data/vaneerConsumption/ExGitmoMilitantsAreFreeToMoveAroundQatarSource.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/484596/140603-taliban-militants-bergdahl-01_649154de0e1c5895147fb7b561769a0d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_ex-gitmo-militants-are-free-move-around-qatar-source-n121356_1540241698.html","title":"Ex-Gitmo Militants Are Free To Move Around Qatar: Source","title_page":"Ex-Gitmo Militants Are Free To Move Around Qatar: Source","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFive Taliban militants freed in exchange for U.S. captive soldier Bowe Bergdahl will not be locked up while in Qatar, a diplomatic source in the Persian Gulf region said Tuesday.\nThe Afghan detainees, who were released from the Guantanamo Bay prison in Cuba on Saturday, will be watched very closely during their one-year travel ban — but their movements within the Arab emirate are not restricted, the source said.\nThe comments came hours after President Barack Obama defended the swap, citing a “sacred” obligation not to leave American soldiers behind even as the nation's top military officer said the circumstances around Bergdahl's capture would be scrutinized.\nObama, speaking to reporters in Poland on Tuesday, expressed confidence that the United States could still go after the militants if they pose a future threat to national security.\n\"We will be keeping eyes on them,” the president said. “Is there the possibility of some of them trying to return to activities that are detrimental to us? Absolutely,\" he said.\n\"We have confidence that we will be in a position to go after them if in fact they are engaging in activities that threaten our defenses.\"\nThe five men would be banned from playing any political role in the Taliban or speaking to media, the gulf diplomatic source said.\nHowever, the former detainees are being housed in a private compound similar to typical facilities for expatriate workers.\n\"There was never any discussion to move them from one jail to another jail,” the source told NBC News. “It is not where they go in [the capital] Doha that matters, it's what they do.”\nAsked about reports the detainees will have freedom of movement in Qatar, Pentagon Press Secretary Rear Admiral John Kirby said that, \"Secretary Hagel determined that this transfer was in the national interest. He is comfortable with the security assurances we received from the Qatari government.\"\nWhat happens after their one-year travel ban expires was not immediately clear.\nThe five, who had been held at Guantanamo Bay since 2002, arrived in Qatar on Sunday where U.S. security personnel handed them over to Qatari authorities in the Al Udeid area west of Doha, site of a U.S. military base.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/ex-gitmo-militants-are-free-move-around-qatar-source-n121356"}
