{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:00:40","date_modify":"2018-10-30 18:00:40","date_publish":"2018-07-15 03:31:06","description":"Former Republican Congressman Joe Walsh said he too was duped into a prank interview for Sacha Baron Cohen's new show Who is America?","filename":"data/vaneerConsumption/ExGOPRepJoeWalshRevealsHeWasDupedbySachaBaronCohen.json","image_url":"https://media.breitbart.com/media/2018/07/Who-is-America-showtime.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_14__1540922440.html","title":"Ex-GOP Rep. Joe Walsh Reveals He Was Duped by Sacha Baron Cohen","title_page":"Ex-GOP Rep. Joe Walsh Reveals He Was Duped by Sacha Baron Cohen | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A partial transcript follows:\nSMERCONISH: So, Congressman, what was the set up in your case?\nWALSH: Hey Michael, good to be with you and look, let me say at the outset I think Sacha Baron Cohen is a funny guy. I thought Borat was hilarious. Look, in my case, in a lot of the cases, he’s a funny guy because he gets people to say stupid things. He gets people to say stupid things because he lies to them. In my case he flew me out to Washington, D.C., they knew I was a big supporter of Israel, and they presented me with this award as one of Israel’s greatest friends. Found out later the whole thing was a ruse and it was a ruse probably just to get me to say some stupid things.\nSMERCONISH: So, they give you the award and then what? There was some aspect of this where it dealt with Israel using kids to protect itself against terror?\nWALSH: Yeah Michael, it was just crazy. Look, they flew me out to D.C., they put me up in a hotel, they put me in a limo. They sent me off to this studio in Virginia, again, all under the lie that I was getting an award from [an] Israel T.V. station because I’m a great supporter of Israel. After they conducted an interview, they had me read off of a teleprompter talking about some of the innovative products that Israel’s invented. Then they had me read about this four-year-old child in Israel, who when a terrorist entered his classroom, somehow he grabbed the terrorist’s gun and held the terrorist at bay. That was I guess an example of how Israel trains and arms preschool kids and how to use firearms and boy, shouldn’t we do that in America. So, I’m reading this Michael, off a teleprompter and I’m thinking to myself, “Well this is kind of crazy, but it is Israel and Israel’s strong on defense.” We found out the whole thing was made up. There is no T.V. station, there was no award, and it’s pretty clear that Sacha Baron Cohen wanted me to say something pretty crazy about guns like “in America, we ought to arm preschool kids.”\nSMERCONISH: Did an alarm go off in your head, Congressman?\nWALSH: Yeah, it did. But again Michael, it was too late because I was in the middle of this fifteen-minute thing talking about all the great things Israel does. So, the alarm went off, but the alarm really went off about three o’clock that next morning when I said, “Oh my God, I’ve been duped.” Then we hired an attorney, we looked into it and we found pretty quickly that it was this new special on Showtime that he was producing, Sacha was producing, and we found out as you said Michael, I was alone. Dick Cheney, Sarah Palin, a bunch of us were duped.","url":"https://www.breitbart.com/politics/2018/07/14/ex-gop-rep-joe-walsh-reveals-he-was-duped-by-sacha-baron-cohen/"}
