{"authors":["Press Association"],"date_download":"2018-10-22 23:51:35","date_modify":"2018-10-22 23:51:35","date_publish":"2016-01-28 13:13:57","description":"Former senior managers at HBOS in the run-up to its collapse could be banned from working in the City after regulators announced they would launch long-await...","filename":"data/vaneerConsumption/Exhbosbossesfacecitybansaswatchdogslaunchbankfailureprobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-efe56529-fbc4-4787-a1ca-af8904d2a1c1-4vVdYopwYQ7f641721b07ad98b6e-191_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420715_Ex-HBOS-bosses-face-City-bans-watchdogs-launch-bank-failure-probes_1540252295.html","title":"Ex-hbos bosses face city bans as watchdogs launch bank failure probes","title_page":"Ex-hbos bosses face city bans as watchdogs launch bank failure probes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ex-HBOS bosses face City bans as watchdogs launch bank failure probes\nFormer senior managers at HBOS in the run-up to its collapse could be banned from working in the City after regulators announced they would launch long-awaited investigations.\nThe Financial Conduct Authority (FCA) and the Prudential Regulation Authority (PRA) said they would start probes into \"certain\" bosses at the failed bank.\nIt comes after a damning report last November by Andrew Green QC, which blasted former regulators for their failure to investigate a raft of executives and called for further probes into up to 10 senior managers, including ex-chief executives Andy Hornby and James Crosby, as well as past chairman Lord Stevenson.\nFormer bosses of HBOS are to be probed by the Financial Conduct Authority and the Prudential Regulation Authority\nThe FCA and PRA said their investigations would \"determine whether or not any prohibition proceedings should be commenced\" against the former bosses.\nThey could face being struck off from working in the financial services industry, while the Insolvency Service also has the power to ban them from being directors of any company.\nThe FCA and PRA also said they would \"review materials with a view to making further decisions regarding other former HBOS senior managers\".\nThe watchdogs did not name the ex-managers who will be investigated.\nBut Mr Hornby, Mr Crosby and Lord Stevenson were named in Mr Green's scathing report at the end of last year, as well as a raft of other executives he said the former regulator, the Financial Services Authority (FSA), should have investigated.\nThese included Mike Ellis, former finance director, Colin Matthew, ex-head of the international division, and Lindsay Mackay, former boss of the treasury division.\nAlongside the Green report, the FCA and PRA last November published their much-delayed review of the HBOS saga, which put the blame firmly on the bank's executives, saying they were ''ultimately responsible'' for the demise of HBOS.\nThe bank had to be rescued by Lloyds and bailed out with £20.5 billion of taxpayer cash in 2008.\nSo far, formal action has only been taken against one former HBOS executive - Peter Cummings, who ran the commercial arm at HBOS.\nHe was fined £ 500,000 and banned for life from working in the City.\nMr Green said in his report that the FSA's failure not to investigate senior management more broadly was ''not reasonable''.\nRegulators are now left powerless to levy fines against any managers deemed responsible due to the length of time that has passed.\nBut the potential for bans could have implications for many of the ex- managers.\nIn particular, Mr Ellis is currently chairman of Skipton Building Society, while Mr Mackay is a director of Alpha Bank.\nMr Hornby is chief operating officer of Gala Coral - which is being taken over b y rival Ladbrokes to create a £.3 billion gambling giant.\nLord Stevenson has a number of positions, including at book group Waterstones Holdings where he is a non-executive director, while Mr Crosby is largely retired.","url":"https://www.dailymail.co.uk/wires/pa/article-3420715/Ex-HBOS-bosses-face-City-bans-watchdogs-launch-bank-failure-probes.html"}
