{"authors":[],"date_download":"2018-10-22 21:24:41","date_modify":"2018-10-22 21:24:41","date_publish":"2016-01-29 06:35:26","description":"Nine months after Burundi slid into a violent political crisis that has killed more than 400 people, Mike Nahimana's dream of opening a bar in Bujumbura is a...","filename":"data/vaneerConsumption/ExiledBurundianrefugeesseenoendtotheirplight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6ri-4PuZeKVXE7cd9005b2c8765c9271-537_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422262_Exiled-Burundian-refugees-no-end-plight_1540243481.html","title":"Exiled Burundian refugees see no end to their plight","title_page":"Exiled Burundian refugees see no end to their plight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Exiled Burundian refugees see no end to their plight\nNine months after Burundi slid into a violent political crisis that has killed more than 400 people, Mike Nahimana's dream of opening a bar in Bujumbura is a distant memory.\nNow a refugee in Kigali, the capital of neighbouring Rwanda, the dreadlocked 29-year old is building a new life in exile. He has no plans of going home anytime soon.\n\"At first I thought it was not going to last a week, I was optimistic,\" Nahimana said of the street protests, failed coup, nightly murders and nascent rebellion in his home country.\nBurundian refugees wait for handouts in Gashora, Rwanda ©Stephanie Aglietti (AFP)\nBut the crisis has dragged on and deepened since April 2015 when President Pierre Nkurunziza triggered unrest by controversially running for a third term.\nThe crisis shows no sign of abating.\nAfrican leaders meet on Saturday at their annual summit in Ethiopia, where they are expected to vote on sending 5,000 peacekeepers to Burundi, a plan the government has rejected.\nA two-thirds majority vote at the African Union will be required to deploy the force, the African Prevention and Protection Mission in Burundi, MAPROBU, although it remains unclear which nations would be willing to contribute troops to a mission Burundi has branded an \"invasion force\".\nNahimana is among 75,000 Burundians living as refugees in Rwanda, but he is one of the lucky ones, rich enough to live outside the refugee camp and to have relocated his \"destroyed dream\" to Kigali where he has taken over management of a bar and restaurant.\nNahimana had made the most of a decade of peace in Burundi after the end of civil war in 2006.\n\"In Bujumbura, I had projects like buying land and building a house,\" he said.\nBut in April everything changed. \"It kept getting worse to the point where I just couldn't earn any money,\" he said. \"Everything that has been built for 10 years collapsed overnight.\"\nIn Kigali, where Nahimana has made a fresh start, he acknowledges his good fortune but says it has not been easy.\n\"I was lucky to find this place but it was really hard. Everything is different, you have to start from the bottom and work your way up again. It's a new life, a new city,\" he said.\n- Peace losing ground -\nThere are few like Nahimana, however. On a hill just outside the city centre Florent, 29, shares a small two-room house with three other Burundian refugees. Their furniture consists of two mattresses, a stool and a stove.\nFlorent, a computer scientist and opposition party member, joined the street protests against Nkurunziza's rule but fled when things got too violent. He does not want to share his full name out of fear.\nNow, Florent said, his life is just about survival. \"We have been living on our savings, but we are left with virtually nothing,\" he said.\nHe fears being forced into one of the squalid refugee camps where most of his compatriots languish and worries for his country's future as political rhetoric becomes increasingly ethnic in nature.\nSitting on the terrace of a cafe, Eli, a 43-year old Burundian entrepreneur who does not want be identified out of concern for his family still across the border, laments his changed circumstances.\n\"We lived a quiet life in Bujumbura, I was not into politics\" until the security crackdown against protestors began, he said.\nTogether with a group of friends, Eli held neighbourhood fundraisers to provide food to the protestors, until he learned that he was wanted by Burundian intelligence services.\nHe fled in early May and now lives in Kigali, supported by Burundian friends who are long-term residents of Rwanda.\nWith a fresh spike in violence in Bujumbura at the start of the year and a string of talks between the government and its opponents ending in failure, Eli's optimism has waned.\n\"Before, we planned to be away for two or three months but now it looks like being more than a year at least,\" he said.\nThe prolonged crisis stirs pessimism in some, but may yet have more dangerous consequences. \"The peaceful option is losing ground,\" Eli warned, adding that young refugees are increasingly tempted to join the armed rebellion back home.\nAround 75,000 Burundians living as refugees in neighbouring Rwanda ©Stephanie Aglietti (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3422262/Exiled-Burundian-refugees-no-end-plight.html"}
