{"authors":[],"date_download":"2018-10-30 00:53:12","date_modify":"2018-10-30 00:53:12","date_publish":"2017-04-18 00:04:14","description":null,"filename":"data/vaneerConsumption/ExistentialismsDeadlyBurdenonFreedom.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/Sartrebeauvoir.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860792.html","title":"Existentialism’s Deadly Burden on Freedom","title_page":"Existentialism’s Deadly Burden on FreedomThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The brilliant scholar Lawrence Mead in several articles and an unpublished book makes the case that freedom imposes a burden that is not well understood by those who migrate to the United States where freedom is a requisite of civic participation. This, of course, isn’t a novel observation, but as I see it the burden of freedom should be seen in the context of 20th century existentialism.\nFor the existentialist thinking begins with the human subject. The term explicitly adopted by Jean-Paul Sartre suggests that only a person can fully understand the categories of science or even morality. All of the themes popularly associated with existentialism — dread, boredom, alienation, freedom, commitment — are in search of a new categorical framework, a flight from the “iron cage” of reason.\nIt is as if each individual arrives at a metaphorical blinking light and decides for himself the meaning of red and green. Suppositions of the past do not count; only the individual confronting the moment creates meaning.\nAgainst this backdrop, freedom has additional challenges. So often the self-indulgent Westerner argues you should be all that you want to be; and the normative barriers emerging from the past should not dictate your present reality. In effect, the modern person is beyond history, a person apart from conventional constraints.\nIs it any wonder that the mediating structures that offer cohesion in a democratic republic are in disarray? Existentialists of the contemporary variety maintain that marriage, to cite one example, is not a union between a man and a woman, but rather whatever you want it to be. The institutional framework is malleable.\nSimilarly, scholars who traditionally transmitted the best that is known from one generation to the next haven’t any curriculum guidelines. The purpose of education is intentionally vague, allowing so-called educators to fill the void.\nChurches that once guided moral behavior have resorted to a relativistic stance in which one man’s morality is another man’s turpitude. The meaning for congregants is that “I am my own moral agent.” The dos and don’ts of common understanding are no longer common.\nSurely freedom is a burden, but it becomes even more burdensome when the guidelines emerging from common sense are cast away like unwelcome weeds. Individuals are, as Aristotle noted, rational beings. But rational action cannot possibly apply to every aspect of life. It is occasionally helpful to say to a youngster, “No, because it is wrong.”\nRecapturing the essence of a stable society may be dependent on recognizing how far we have departed from normative behavior and on how much we can recapture from the past.\nNoel Coward once said that if “we should have to trust to the inspiration of the moment, it would be a moment completely devoid of inspiration.” Alas, existentialism places an impossible burden on the individual, one that goes beyond the normal responsibility of freedom. In combination, freedom unrestrained and existentialism create an unpleasant brew that often leads to discord and alienation. Ultimately it is the manners and spirit of a people recited from memory that preserve vitality in a republic. Teaching the virtue of memory should be the American pedagogical goal — a far better choice than asking each individual to re-create his own society.","url":"https://spectator.org/existentialism-the-burden-of-freedom-and-mediating-structures/"}
