{"authors":["Simon Kent"],"date_download":"2018-10-30 18:32:43","date_modify":"2018-10-30 18:32:43","date_publish":"2017-04-05 09:01:08","description":"Ken Livingstone has been suspended by Labour after it found he had brought the party into disrepute over comments about anti-Semitism.","filename":"data/vaneerConsumption/ExLondonMayorKenLivingstoneSuspendedinAntiSemitismRow.json","image_url":"https://media.breitbart.com/media/2017/04/ken-livingstone.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_05__1540924363.html","title":"Ex-London Mayor Ken Livingstone Suspended in Anti-Semitism Row","title_page":"Ex-London Mayor Ken Livingstone Suspended in Anti-Semitism Row","title_rss":"NULL","source_domain":"breitbart.com","text":"Former London mayor Ken Livingstone has been suspended by the Labour Party for one year after a disciplinary hearing found he had brought the party into disrepute over past comments about anti-Semitism, Hitler, and Zionism.\nMr. Livingstone has been a Labour member for almost 50 years. He was censured late on Tuesday by the party for suggesting that Hitler at one point supported Zionism, and for defending the Labour MP Naz Shah over an anti-Semitic Facebook post for which she later apologised.\nThe suspension will expire in April 2018, taking into account the time he has already served on the sidelines. Mr Livingstone will remain a full member of the party during his suspension and can attend local constituency meetings.\nThe party declined to make any further comment although Jewish party members have been unsparing in their criticism.\nMr. Livingstone has repeatedly defended his version of events that brought an initial 12-month suspension, saying there had been “real collaboration” between Nazis and Zionists before World War II.\nSpeaking after the closed-door hearing, Mr. Livingstone said he was not planning on running for office so the suspension “doesn’t make a great deal of change”, and said the hearing had been “like sitting through a court in North Korea”.\nA statement released by his office said he would be launching a campaign to overturn the suspension, adding that the hearing “was not in accord with natural justice” because it was held in private.\nLabour deputy leader Tom Watson was less than impressed.\nStatement on Livingstone disciplinary. pic.twitter.com/HPnHrpdITP — Tom Watson (@tom_watson) April 5, 2017\nSpeaking on BBC Newsnight, Mr. Livingstone refused to show any remorse: “If anyone is upset by what I said of course I apologise” but added he would not apologise for something he did not say.\nThe president of the Board of Deputies of British Jews, Jonathan Arkush, lamented the decision and said that relations between the Labour Party and the Jewish community “have reached a new all-time low.”\n“After 12 months of indecision, despite finding him guilty of all three charges, the Labour Party has decided to suspend him from holding office for just one year despite his shameless, disgraceful and tendentious attempts to link Zionism to Nazism.”\nLord Levy, the party’s chief fundraiser under Tony Blair, is threatening to leave the party over the matter.\nSpeaking on BBC Radio 4’s Today programme, he said: “Do I stay in the party? It is something that I’m going to reflect on very seriously. I am very upset with the party’s attitude. I do not believe there has been a zero-tolerance policy towards anti-Semitism.”\nBritain’s chief rabbi accused Labour of failing the Jewish community by not expelling Mr. Livingstone. “This was a chance for the Labour Party to show that it would not tolerate willfull and unapologetic baiting of the Jewish community by shamefully using the Holocaust as a tool with which to inflict the maximum amount of offence,” said Ephraim Mirvis.\n“Worryingly, the party has yet again failed to show that it is sufficiently serious about tackling the scourge of anti-Semitism.\n“The Labour party has failed the Jewish community, it has failed its members and it has failed all those who believe in zero tolerance of anti-Semitism.”","url":"https://www.breitbart.com/middle-east/2017/04/05/ex-london-mayor-ken-livingstone-suspended-anti-semitism-row-labour-party-faces-mutiny/"}
