{"authors":["Press Association"],"date_download":"2018-10-23 04:55:41","date_modify":"2018-10-23 04:55:41","date_publish":"2017-04-26 16:24:09","description":"Tim Farron denounced the former MP as \"unfit to represent the party\".","filename":"data/vaneerConsumption/ExMPDavidWardsackedasLibDemcandidateafterantiSemitismclaim.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466129-1493220252-546_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448274_Ex-MP-David-Ward-sacked-Lib-Dem-candidate-anti-Semitism-claim_1540270541.html","title":"Ex-MP David Ward sacked as Lib Dem candidate after `anti-Semitism´ claim","title_page":"Ex-MP David Ward sacked as Lib Dem candidate after `anti-Semitism´ claim | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liberal Democrat leader Tim Farron has sacked a General Election candidate facing allegations of anti-Semitism.\nMr Farron denounced former MP David Ward as “unfit to represent the party” and reversed a decision to let him stand for the party on June 8 in his old constituency of Bradford East.\nThe decision came hours after Prime Minister Theresa May unleashed a broadside at the Liberal Democrats in the House of Commons for putting forward a candidate “with questionable views on anti-Semitism”.\nI believe in a politics that is open, tolerant and united. David Ward is unfit to represent the party and I have sacked him. — Tim Farron (@timfarron) April 26, 2017\nIn a statement issued by the Liberal Democrats, Mr Farron said: “I believe in a politics that is open, tolerant and united. David Ward is unfit to represent the party and I have sacked him.”\nMr Ward told the Press Association: “I’m stunned and somewhat ashamed of my own party.” He could not say whether he would fight his removal.\nMr Ward sparked accusations of anti-Semitism in 2013 with a blog comparing the treatment of Palestinians by “Jews” to the Holocaust.\nHe was suspended by the Lib Dems later that year for questioning the continued existence of the “apartheid” state of Israel and was also forced to apologise in 2014 after suggesting he might be ready to fire rockets from Gaza into Israel.\nMr Ward, left with then-Liberal Democrat leader Nick Clegg in 2010 ( Chris Radburn/PA)\nHe was put forward as Lib Dem candidate to fight Bradford East in 2015 but lost the seat, which he had held since 2010.\nMr Farron later told a Commons inquiry that he regarded some of Mr Ward’s comments as anti-Semitic, but said it was appropriate for him to return to active involvement with the Liberal Democrats after “serving his time” on suspension.\nAt the final session of Prime Minister’s Questions before the June 8 election, Mrs May blasted the decision to allow him to stand for the party again: “People will be, I think, rightly disappointed to see the Liberal Democrats re-adopt a candidate with a questionable record on anti-Semitism.”\n“It is important that all parties maintain the strongest possible censure on all forms of intolerance and send that message to our communities.”\nHer comments came in response to a question from former minister and ex-Bradford councillor Sir Eric Pickles, who said party leaders must do more than “pay lip service” to tackling anti-Semitism.\nMr Farron failed to address the issue when asking Mrs May a question moments later, confining himself to saying that the Conservative Party “has never been nastier” and Britain needs a “decent new opposition”.\nMrs May replied: “He talks about a decent opposition. I find it difficult to hear those words coming from his mouth when we have just heard that his party has selected a candidate with questionable views on anti-Semitism.”","url":"https://www.dailymail.co.uk/wires/pa/article-4448274/Ex-MP-David-Ward-sacked-Lib-Dem-candidate-anti-Semitism-claim.html"}
