{"authors":["Associated Press"],"date_download":"2018-10-23 01:19:33","date_modify":"2018-10-23 01:19:33","date_publish":"2016-01-28 15:37:48","description":"CHICAGO (AP) — Former Northern Illinois University running back Akeem Daniels is suing two daily fantasy sports sites in Chicago federal court alleging they ...","filename":"data/vaneerConsumption/ExNIUrunningbacksuesFanDuelDraftKingsforusingname.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:ea7efbe9a8b4449282d3e7dc218e567e-2vdWmEltwXfba0ce28e632a36191-303_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420917_Ex-NIU-running-sues-FanDuel-DraftKings-using-name_1540257573.html","title":"Ex-NIU running back sues FanDuel, DraftKings for using name","title_page":"Ex-NIU running back sues FanDuel, DraftKings for using name | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ex-NIU running back sues FanDuel, DraftKings for using name\nCHICAGO (AP) — Former Northern Illinois University running back Akeem Daniels is suing two daily fantasy sports sites in Chicago federal court alleging they used his name to generate millions of dollars in revenue.\nDaniels filed the lawsuit Wednesday against Boston-based DraftKings and New York-based FanDuel, The (DeKalb) Daily Chronicle reported (http://bit.ly/1ZVf2Dq ). He is seeking class-action status to represent all college players and $5 million in damages, saying the sites' use of student athletes can lead to point-shaving and fixing.\nFanDuel said Thursday that it had no comment on the lawsuit. DraftKings didn't immediately respond to an email seeking comment sent early Thursday.\nFILE - In this Nov. 23, 2012, file photo, Northern Illinois' Akeem Daniels (3) breaks a tackle during an NCAA college football game against Eastern Michigan in Ypsilanti, Mich. The former NIU running back filed a lawsuit in Chicago, Wednesday, Jan. 27, 2016, suing two daily fantasy sports sites, Boston-based DraftKings and New York-based FanDuel, alleging they used his name to generate millions of dollars in revenue. (AP Photo/Carlos Osorio, File)\nThe lawsuit mentions 15 other NIU players who appeared in games on the two sites. Daniels argues that the sites used his names and the names of thousands of other student players to earn money.\nThe lawsuit says FanDuel and DraftKings put Daniels and others \"in an unwanted state of fear and concern of the risk of being contacted by speculators who have a financial interest\" in their performances. It said the sites have \"immeasurably altered the college football and basketball environment.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3420917/Ex-NIU-running-sues-FanDuel-DraftKings-using-name.html"}
