{"authors":["Ciara Farmer","Rebecca Davison For Mailonline"],"date_download":"2018-10-22 20:33:42","date_modify":"2018-10-22 20:33:42","date_publish":"2016-01-29 02:16:54","description":"The Ex On The Beach star looked super sexy in a bustier-style top, while the Love Island winner went equally raunchy in a flesh-flashing mesh number","filename":"data/vaneerConsumption/ExOnTheBeachsJessImpiazziandLoveIslandsJessHayesputonbustydisplays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE6B3B00000578-0-image-a-19_1454032711889.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422097_Ex-Beach-s-Jess-Impiazzi-Love-Island-winner-Jess-Hayes-extremely-busty-displays-sexy-black-ensembles-bar-birthday-bash_1540240422.html","title":"Ex On The Beach's Jess Impiazzi and Love Island's Jess Hayes put on busty displays","title_page":"Ex On The Beach's Jess Impiazzi and Love Island's Jess Hayes put on busty displays | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was a meeting of reality minds at the second anniversary of Kelly Brook's bar.\nSo Jess Impiazzi and her pal Jess Hayes were battling to ensure all eyes were on them as they attended the birthday party of Steam And Rye bar on Thursday night.\nThe Ex On The Beach star looked super sexy in a bustier-style top, while the Love Island winner went equally raunchy in a flesh-flashing mesh number.\nScroll down for video\nBusty ladies: Jess Impiazzi and her pal Jess Hayes were battling to ensure all eyes were on them as they attended the birthday party of Steam And Rye bar on Thursday night\nJess Impiazzi, who found fame starring in the second season of the MTV dating show, showed off her incredibly trim figure in the saucy ensemble.\nHer skin-tight top clung to her taut abs before boosting her extremely ample assets to perfection - permitting a generous glimpse at her cleavage.\nParing down the look, the stunning reality starlet, who counts Simon Webb and Rogan O'Connor as exes, added thoroughly ripped jeans to the ensemble while boosting her height with pointed heels.\nShe pulled her hair into an elaborate Nineties style look with a half-high ponytail pulling the curled tresses off her face while the rest tumbled over her shoulders.\nStunner: Jess Impiazzi, who found fame starring in the second season of the MTV dating show, showed off her incredibly trim figure in the saucy ensemble\nJess Hayes, the winner of last year's revival of Love Island, wore a risque leotard with a mesh insert at the front, which exhibited the fact that she opted to forego a bra for the evening.\nTo enhance the sexy nature of the look, she tucked the leotard into a sexy leather pencil skirt which matched her leather clutch bag - emblazoned with white writing reading 'Yeah'.\nHer trademark bright red locks were worn in lustrous bouncy curls, while she coordinated her vampish lipstick to her crimson locks.\nBraless: Jess Hayes, the winner of last year's revival of Love Island, wore a risque leotard with a mesh insert at the front, which exhibited the fact that she opted to forego a bra for the evening\nModel good looks: Another Ex On The Beach star attended the event, as Anita Kaushik, who formerly dated Geordie Shore star Gaz Beadle, turned out in a highly-sophisticated white, two-piece\nCo-stars: Jess and Anita starred together in Ex On The Beach together\nAnother Ex On The Beach star attended the event, as Anita Kaushik, who formerly dated Geordie Shore star Gaz Beadle, turned out in a highly-sophisticated white, two-piece.\nKelly Brook who co-owns the London venue, looked incredible in a black semi-sheer lace dress which had a skater skirt style.\nShe teamed the number with a pair of black tights and wore a pair of high heeled court shoes, in order to give herself some extra inches in the height department.\nLet the good times roll: Kelly Brook looked like she was ready to seriously let her hair down when she arrived at the second birthday party of Steam And Rye bar on Thursday night\nLetting her hair down: The 36-year-old, who co-owns the London venue, looked incredible in a black semi-sheer lace dress which had a skater skirt style at the circus-themed bash\nWith her brunette locks worn in curls which cascaded down past her shoulders, the stunner, who is dating her kick-boxing instructor, Jeremy Parisi, wore blinging diamond earrings.\nEnjoying the circus themed bash, Kelly posed with a man dressed as a ringleader as she had fun on the night.\nThree days before, Kelly marked the exact birth date of the bar when she tweeted: 'Happy 2nd Birthday @steamandrye.'\nBusty: Jess put on an extremely display in her bustier which she tucked into ripped jeans\nShe also wrote on Instagram: '2 years ago we had a Dream this week we celebrate that Dream becoming a Reality @steamandrye Happy 2nd Birthday Steam and Rye #OffTheRails.'\nActing as the perfect promo for the venue, she also posted a picture of one amazing cocktail she was enjoying on the night.\nServed in a camera lens, she captioned the black and white image with the words: 'Love this!!! #Nofilter Cocktail served in the Lens Cap With a Polaroid Taken at Your Table :))).'\nNew look: Little Mix star Jade Thirlwall showed off her edgy streaked hair (right) as she posed with a pal","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422097/Ex-Beach-s-Jess-Impiazzi-Love-Island-winner-Jess-Hayes-extremely-busty-displays-sexy-black-ensembles-bar-birthday-bash.html"}
