{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:23:35","date_modify":"2018-10-30 23:23:35","date_publish":"2016-12-07 00:00:00","description":null,"filename":"data/vaneerConsumption/ExpandedgiftcardandloyaltyfeaturescouldboostApplePay.json","image_url":"https://amp.businessinsider.com/images/584826a8e02ba734008b7dd3-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_expanded-gift-card-and-loyalty-features-could-boost-apple-pay-2016-12_1540941815.html","title":"Expanded gift card and loyalty features could boost Apple Pay","title_page":"    Expanded gift card and loyalty features could boost Apple Pay - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nApple Pay users will be able to add gift cards and a wider selection of loyalty programs following a partnership between the tech giant and Blackhawk Network, a gift and prepaid card firm.\nThe partnership will allow customers to \"store, manage, and make payments\" with gift and loyalty cards from Blackhawk partners, which include Amazon, Target, Best Buy, and Home Depot.\nPartnering with Blackhawk will improve upon a feature that's already one of Apple Pay's most popular. As it currently stands, Apple Pay's loyalty support is limited. But just a few months after Apple Pay added loyalty in that limited capacity, proprietary store and loyalty cards made up 25% of the cards loaded into the wallet, according to data from First Annapolis.\nFor context, that's nearly as much as the share held by debit cards, which are the most popular payment method among US adults. Blackhawk's vast partnership network could further extend that percentage and in turn help Apple capitalize on pent-up demand for store and loyalty offerings in-wallet.\nAnd that could lift Apple Pay in two key areas.\nIt could increase adoption of the wallet overall. Apple Pay adoption has stagnated just below a quarter of eligible users, which means the wallet needs to look for new ways to draw in users. Loyalty could be one such solution. Nearly a quarter of adults with mobile phones want to organize, track, and store loyalty and rewards points on their phones. And 53% of nonusers would start using mobile payments if they were offered these types of opportunities, which could drive new customers to the wallet.\nAnd among existing users, it could help increase engagement. Adding a vast loyalty network to Apple Pay could give users incentives to pay with the wallet in more locations, because they want to capture the benefits that loyalty cards can provide. More frequent spending could help drive up habit formation, which could increase payment volume and drive up usage across the board.","url":"https://www.businessinsider.com/expanded-gift-card-and-loyalty-features-could-boost-apple-pay-2016-12"}
