{"authors":[],"date_download":"2018-10-30 21:53:29","date_modify":"2018-10-30 21:53:29","date_publish":"2018-08-24 19:00:00","description":"As transit initiatives gain momentum in other metro Atlanta counties, many Cobb officials appear to be taking a wait-and-see approach.","filename":"data/vaneerConsumption/ExpandingtransitinCobbfacesuphillstrugglewithoutchampion.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/24/Images/newsEngin.22828425_051818-cows-5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_e_7f7da058aee02e0c5f5c341248e06104__1540936409.html","title":"Expanding transit in Cobb faces uphill struggle without champion","title_page":"Expanding transit in Cobb faces uphill struggle without champion","title_rss":"NULL","source_domain":"ajc.com","text":"As transit initiatives gain momentum in other metro Atlanta counties, many Cobb officials appear to be taking a wait-and-see approach.\nCounty Commission Chairman Mike Boyce said his board doesn’t want to be saddled with sole responsibility for facilitating a public discussion on whether more transit options are needed in the county— or take the blame for any proposed transit tax.\nBoyce pointed to the tremendous effort he put into passing a property tax hike this summer.\n“Let’s be very blunt here: I don’t see any way of addressing transit issues, or very few ways, without some kind of a sales tax,” Boyce said. “I was leading this charge for the millage and the budget, but I don’t know who is leading the charge for transit because — I just want to be very clear here — they are not going to throw this on the backs of the board.”\nThe regional transit bill signed by Governor Nathan Deal earlier this year allows 13 metro Atlanta counties to impose sales taxes of up to 1 percent for mass transit. It also creates a regional board to oversee transit funding and construction. The board, charged with coordinating transit projects across the region, would have the final say over the project lists that counties submit to voters.\nThat same legislation authorizes a special transit district in Cobb County, giving commissioners the option of limiting the referendum to areas where demand for transit is high. That would mean other parts of Cobb would not see transit expansion, but the entire county would be liable for cost overruns in the district.\nBoyce said he won’t put a referendum on expanding transit on the ballot unless there’s strong public support for it. The Cobb legislative delegation is deeply divided over transit. And local mayors are afraid the approval of any kind of tax for transit would mean the loss of existing SPLOST funds on which they have come to rely. That revenue stream must be renewed by 2020, meaning Cobb voters could be asked to support two sales taxes within a short period.\n“Could you take a risk that both of them fail? Yes,” said Marietta Mayor Steve Tumlin. “If these got pitted together, the voters I’m most familiar with would rather have a SPLOST.”\nIn the meantime, Cobb’s role in the new regional transit authority, known as The ATL, began to take shape this week.\nPowder Springs Mayor Al Thurman was chosen by his fellow mayors to cast a vote on their behalf to determine who from District 4, which spans part of Cobb and Paulding counties, will sit on the regional board. The board could have the power to influence mobility throughout the region for decades to come.\nThurman said he hopes to put forward his own candidacy.\n“I just want to be able to make sure our voice is heard,” Thurman said.\nSimilar meetings — to elect delegates to vote on the regional board’s membership — are taking place across the metro area. Delegates are expected to vote on The ATL’s board membership by early November.\nAround the same time, Cobb commissioners will receive the results of a transit survey. Later, local and state transportation department staff will create a transit development plan, including a list of proposed projects and their associated timetables and budgets.\nState representatives who spoke with The Atlanta Journal-Constitution said they are waiting to see what proposals staff come up with. But already they appear to be divided into transit supporters and skeptics.\n“I’ve been banging the transit drum for quite a while,” said State Rep. Teri Anulewicz, who said she saw the urgency of the issue when she served on Smyrna City Council.\nState Rep. Ed Setzler, who represents the more rural northwest Cobb, said he thinks the county already has a “pretty good system” for handling traffic and transportation. He also said the county wouldn’t have to implement a sales tax in order to be part of regional planning.\n“There is zero duty to pay into The ATL to be on the board,” Setzler said. “A radical departure from what we have today is going to be, by definition, ideologically driven.”\nState Senator Lindsey Tippins said any discussion of a transit sales tax, and who would make its case to the public, is premature. First, he said, residents should see a list of specific projects with timelines and budgets.\n“Voter confidence is huge,” he said.","url":"https://www.ajc.com/news/local-govt--politics/expanding-transit-cobb-faces-uphill-struggle-without-champion/A3r9pChhKhgVRsmxn3GxFP/"}
