{"authors":["Associated Press"],"date_download":"2018-10-23 05:09:59","date_modify":"2018-10-23 05:09:59","date_publish":"2017-04-26 16:40:51","description":"Lisa Connor felt her disabled daughter should have been making more progress in school, yet annual meetings with the district to set services and goals...","filename":"data/vaneerConsumption/ExpensivegruelingfightsinstoreforUSspecialeducation.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448364_Expensive-grueling-fights-store-US-special-education_1540271399.html","title":"Expensive, grueling fights in store for US special education","title_page":"Expensive, grueling fights in store for US special education | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lisa Connor felt her disabled daughter should have been making more progress in school, yet annual meetings with the district to set services and goals sometimes felt like a tug of war.\nA stroke had left Polina with a limp and vision problems, but there was always debate about keeping physical therapy, Connor said. Battles erupted over whether she should stay in public school or would do better in a private placement.\n\"You know your own kid,\" Connor said, explaining why she hired lawyers to push for the out-of-district services she thought were best for her now 15-year-old daughter.\nThousands of parents each year clash with their children's school districts over the level of special education services. The proceedings can be emotionally grueling and expensive, diverting education dollars away from classrooms, and in the wake of a U.S. Supreme Court ruling seen as empowering parents, some are expecting only more challenges as cash-strapped schools are called upon to meet higher standards.\nAs much as districts might like to be more generous, a shortfall in federal reimbursement leaves many struggling to afford services they are required by law to provide under the Individuals with Disabilities Education Act. The U.S. government has never met its target of covering 40 percent of the excess cost of educating the nearly 6.5 million students with disabilities. In 2014, federal funding covered about 16 percent.\n\"It's an unbelievable journey. You're worn out, you really are,\" said Connor, whose daughter's complex mix of disabilities, including epilepsy and an autism spectrum diagnosis, led to the placements she sought outside the Boston Public School district when she was 9, and a residential placement two years later. \"It's a lot of stress. It's a lot of money.\"\nBoston public school officials say the district uses data and assessments to arrive at recommendations, and has adopted layers of options meant to head off litigation and keep parents and schools talking through any differences.\nAcross the country, there were 18,011 due process complaints filed in the 2013-14 school year, along with 9,688 requests for mediation and an additional 4,997 written complaints, according to the latest data from the U.S. Department of Education. Most address the level of services offered and the child's placement in the district or elsewhere.\nMost of the parent-district disputes are resolved through meetings or mediation, but the most stubborn cases progress to court-like due process hearings - expensive, adversarial proceedings that advocates and administrators dread alike. Hearings can cost both sides tens of thousands of dollars in legal fees.\nA survey by the American Association of School Administrators found that many districts report acquiescing to parents' requests they find unreasonable just to avoid diverting those sums from services to legal fees, the group said in a report last year.\nJackie Pioli settled her dispute with the Stamford, Connecticut, district just before a due process hearing she said would have cost the family as much as $75,000 in legal fees, on top of the $25,000 already spent for a parent advocate's representation along the way.\nIf she had that much money, Pioli said, she would have paid the $45,000 tuition herself for the private school she wanted for her son, whose attention and anxiety problems had him in frequent trouble in public school.\n\"My son was spending almost three hours a day in time-out. ... His first-grade year was a disaster,\" Pioli said. She believes things could have improved with a reading specialist and behavioral coach, but those requests were turned down.\n\"There was nothing easy about the process at all,\" said Pioli, whose son, now 10, received a temporary out-of-district placement.\nServices like aides, physical and speech therapy and academic support roughly double the cost of educating disabled children with Individualized Education Programs, or IEPs.\n\"Cost should never be a factor in terms of what services are provided on an IEP,\" said Nancy Reder, deputy executive director of the National Association of State Directors of Special Education. But with states and local school districts picking up most of the expense, she said, it's difficult to ignore.\nPhilip Moses, director of the federally funded Center for Appropriate Dispute Resolution in Special Education, said the best solution is for states to have a variety of ways to resolve differences beyond the mediation and due process options in IDEA. Thirty-six states now offer neutral facilitators to smooth conflicts during the IEP process, up from eight states in 2004, Moses said. Other programs provide for parent advocates and case managers.\n\"The best systems provide a range of options ... that keep families and school folks working well together,\" Moses said, \"and keep money for services, and not into litigation.\"\nIDEA guarantees students with disabilities a \"free appropriate public education\" in the least restrictive environment, but exactly what that means has been open to interpretation.\nThat question was at the heart of the Supreme Court ruling in March. In the case of Endrew F., the Colorado parents sought reimbursement for private school tuition of about $70,000 after becoming dissatisfied with their son's progress in public school.\nIn the unanimous decision, Chief Justice John Roberts said it is not enough for school districts to provide only the minimum. Goals, he said, should be \"appropriately ambitious\" in light of the child's circumstances.\nWhile the justices stopped short of setting a specific standard, such as achieving at the same level as grade-level peers, many expect more parents to challenge their school districts as they weigh their own child's program against the justices' ruling.\n\"It gives parents a real feeling of empowerment,\" said Amanda Morin, a parent advocate.","url":"https://www.dailymail.co.uk/wires/ap/article-4448364/Expensive-grueling-fights-store-US-special-education.html"}
