{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-22 23:53:38","date_modify":"2018-10-22 23:53:38","date_publish":"2017-04-26 08:50:18","description":"As a nation, Australians are more stressed than ever. Here, health coach, Jayta Szpitalak explains how you can beat anxiety naturally, including how much sleep you need, what to eat and exercise.","filename":"data/vaneerConsumption/Expertrevealshertoptipstobeatanxietynaturally.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9BE7F400000578-0-image-a-115_1493186139422.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446440_Expert-reveals-tips-beat-anxiety-naturally_1540252418.html","title":"Expert reveals her top tips to beat anxiety naturally","title_page":"Expert reveals her top tips to beat anxiety naturally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Between eleven hour working days, increasing responsibilities at home and the pressure to 'keep up' on social media, it's hardly a surprise that in any given year, two million Australians are affected by anxiety.\nBut did you know that there are ways to manage your stress levels naturally?\nFrom how much sleep you need each night to how much exercise you should do and what you can eat to feel better, FEMAIL spoke to the Australian health coach and founder of Fermentanicals, Jayta Szpitalak, to find out how to beat anxiety naturally.\nAustralian health coach and founder of Fermentanicals, Jayta Szpitalak (pictured), revealed how you can beat anxiety naturally - from what you eat to how much sleep and exercise\nEach given year, some two million Australians are affected by anxiety - but you can manage it yourself at home (pictured: Jayta Szpitalak)\nHOW TO BEAT ANXIETY * Eat a diet which is rich in folate - think spinach, leafy green vegetables, asparagus and animal liver. * Also try to eat foods with fatty acids including oily fish, chia seeds and flax. * Turmeric also helps hugely with fighting cortisol levels. * Aim to sleep for between seven and nine hours a night; reduce stimulants before and sip herbal tea to create a routine. * Try to work out three times a week to curb stress levels. Five minutes works, but 20 minutes is the optimum amount if you can find time.\nAccording to Ms Szpitalak, the anxiety-busting diet is rich in folate - think spinach, green leafy vegetables, asparagus and animal liver.\n'Vitamin B deficiency is linked to higher levels of anxiety and depression,' Ms Szpitalak told Daily Mail Australia.\n'You should also try to eat foods with Omega 3 fatty acids to reduce inflammation and decrease anxiety symptoms: fatty fish such as salmon, chia seeds and flax seeds work well here.'\nMs Szpitalak advocates fighting the stress hormone, cortisol, with turmeric, ginger, beetroots and blueberries:\n'Turmeric has been shown to work better than pharmaceutical medicine in aiding the recovery of depression and anxiety,' she said.\n'Turmeric has been shown to work better than pharmaceutical medicine in aiding the recovery of depression and anxiety,' Ms Szpitalak explained\nThe expert is also a fan of flax and chia seeds (pictured), which contain Omega 3 fatty acids which help to reduce inflammation and decrease anxiety symptoms\nNext, the expert (pictured) explained that it's vital to get enough sleep - between seven and nine hours - every single night\nNext, the expert explained that it's vital to get enough sleep - between seven and nine hours - every single night.\nFor those used to burning the midnight oil, this might sound like a lot, but Ms Szpitalak said there are natural ways you can help yourself to drift off:\n'Reduce stimulants or caffeine in your diet, especially after 2pm, try and make a routine and minimise technology - especially 30 minutes before bed.'\nMs Szpitalak also recommends avoiding light if you wake up, sipping on herbal teas before you go to sleep and keeping the bed 'only for sleep and sex as this will help you to associate it with a calming space'.\nLastly, she said you can even try 'journaling' before bed to help to calm your nerves.\nShe said you can do this by creating a bedtime routine and drinking herbal tea before bed (stock image) - you can also try journaling\n'Reduce stimulants or caffeine in your diet, especially after 2pm and minimise technology - especially 30 minutes before bed,' Ms Szpitalak (pictured) said\nWhen it comes to exercise, Ms Szpitalak said you should aim for three workouts each week - or just five minutes of exercise a day (stock image)\nWhen it comes to exercise, countless studies have shown that regular workouts help to decrease overall levels of tension as well as stabilising your mood:\n'Consistency is key here, as the more regularly you work out, the more the benefits,' Ms Szpitalak said.\nAim for three workouts each week, and try to make them all the same length.\n'The amount of exercise you need to combat anxiety is not much - just five minutes a day shows a marked improvement,' Ms Szpitalak said.\n'But for a palpable difference, 20 minutes a day as little as three times a week will help.'\nFor more information about Jayta Szpitalak or Fermentanicals, click here.","url":"https://www.dailymail.co.uk/femail/article-4446440/Expert-reveals-tips-beat-anxiety-naturally.html"}
