{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:58:23","date_modify":"2018-10-30 21:58:23","date_publish":"2015-03-23 00:00:38","description":"LOS ANGELES, California -- With anti-Israel sentiment spreading on college campuses around the world, especially through the \"boycott, divestment, sanctions\" (BDS) movement, experts gathered in Los Angeles on Sunday to suggest ways to push back during Stand With Us's first anti-BDS conference. |","filename":"data/vaneerConsumption/ExpertsWrestlewithAntiIsraelMovementonCampus.json","image_url":"https://media.breitbart.com/media/2015/02/pro-palestine-rally-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_22__1540936703.html","title":"Experts Wrestle with Anti-Israel Movement on Campus","title_page":"Experts Wrestle with Anti-Israel Movement on Campus | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES, California — With anti-Israel sentiment spreading on college campuses around the world, especially through the “boycott, divestment, sanctions” (BDS) movement, experts gathered in Los Angeles on Sunday to suggest ways to push back during Stand With Us’s first anti-BDS conference.\n“A lie used in an attack will almost always beat a truth used in a defense and that’s a huge problem,” said Noah Pollak, who serves as the executive director of the Emergency Committee for Israel (ECI).\nPollak, who spoke on a panel at the conference, emphasized the importance of approaching BDS from a political angle. “As you all know, in a political battle the accusations win, generally speaking.”\nPollak explained the disparate mentalities between those who are for and against Israel. On the pro-Israel side, “playing offense doesn’t come naturally. For their [anti-Israel] side, it does.” He noted that the extremist elements at play among activists in the anti-Israel movement was such that “they’ll risk getting arrested…they’ll do anything. Our people [Jews, and those who are pro-Israel] don’t behave like that. That’s just not our culture. And it’s good that that’s not our culture.”\nOn group, Students for Justice in Palestine (SJP), was identified the main force behind the growing anti-Israel sentiment and BDS movement on college campuses. And California among the prime targets for SJP, according to experts at the conference.\n“They’re trying to pin Israel into a colonialist and imperialist state, and that flies with those on the left,” said Rabbi Aaron Lerner, who is a Hillel rabbi at UCLA.\nHe said the seeds of early anti-Israel actions that BDS groups were planting in the 2000s are starring to bear fruit on campuses.”They’re not after the votes on campus. They’re after the hearts and minds of youth who are in their formative year of developing opinions” and who will be the future voters, Lerner said.\nThe United States might be with Israel right now, he said, but in 10-15 years down the line, when these students are out of college and voting more aggressively, the hatred for Israel they experienced on campus is “going to affect the way they vote.”\nThe anti-Israel movement on campus targets liberals and socialists to join their cause, said Max Samarov, who graduated from UC Santa Barbara in 2011. “They want to get people to see Israel though dehumanizing labels… and they want to position themselves as the representatives of human rights on campus,” while making Jews and pro-Israel supporters out as evil and oppressive.\nAmong BDS’s goals “is to damage Israel politically and financially,” Samarov added, and called for Israel supporters to become more active in student government.\nThe Stand With Us conference is taking place at the same time the purportedly “pro-Israel” lobby group J Street is holding their annual conference, which has been replete with criticism of Israel’s government and newly-reelected Prime Minister Benjamin Netanyahu.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/local/2015/03/22/experts-wrestle-with-anti-israel-movements-on-campus/"}
