{"authors":["Eric Eggers"],"date_download":"2018-10-30 18:11:41","date_modify":"2018-10-30 18:11:41","date_publish":"2018-08-16 13:36:40","description":"Voter fraud remains a serious problem in Ohio where more than 5,800 votes were cast in 2016 by Ohio voters whose age in the database is listed as older than 116 years old.","filename":"data/vaneerConsumption/ExpertNewDataSuggestsOhioVoterRollsWorseThanFeared.json","image_url":"https://media.breitbart.com/media/2018/05/wi/ap/21/78daa7_primary-rdp-00727-in-may-21-2018-photo-roll-stickers-awaiting-distribution.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_16__1540923101.html","title":"Expert: New Data Suggests Ohio Voter Rolls Worse Than Feared","title_page":"Expert: New Data Suggests Ohio Voter Rolls Worse Than Feared","title_rss":"NULL","source_domain":"breitbart.com","text":"There has been quite a bit of reporting on the fact that 170 registered voters in Ohio’s 12th Congressional District are listed in Ohio’s voter database as having have birthdates that would make them over 116 years old.\nIt is important to note that neither Ohio Secretary of State Jon Husted, nor any media outlet, have challenged the existence of the obviously flawed records. Rather, they have offered an explanation for their existence, citing a change in the law in 1974.\nBut the fact remains that voters with incorrect birthdates have remained on Ohio’s rolls for nearly half a century. And not just in one district: Statewide, more than 5,800 votes were cast in 2016 by Ohio voters whose age in the database is listed as older than 116 years old.\nThe Ohio voter registration information, which was obtained through the Ohio Secretary of State’s website, also shows what appear to be errors in the listed addresses of Ohio voters.\nA cursory analysis of the data revealed registered voters who cast ballots in 2016 list addresses that clearly fail to meet the definition of a “residence.”\nOhio voters have cast ballots with registrations that list addresses as a UPS office, an antique shop, an industrial warehouse and a carpet and flooring store. There are also active voters whose listed address matches that of a Dublin veterinary office, and the Dublin Police Department.\nThese addresses are in conflict with Ohio law which defines for voting purposes a residence as “(1) the location that you consider to be a permanent, not a temporary, residence and (2) the place where your habitation is fixed and where, whenever you are absent, you intend to return.’\nThe law does allow that “If you do not have a fixed place of habitation, but you are a consistent or regular inhabitant of a shelter or other location where you intend to return, you may use that location as your residence for the purposes of registering to vote.”\nBut none of the listed locations meet that threshold.\nThese issues are part of a larger story about Ohio’s efforts to improve security and accuracy of their elections in recent years. Secretary of State Michael Husted himself touts the over 680,000 dead voters his office has removed from voter rolls since 2011.\nThat voter registration rolls are flawed is hardly a secret: Data from both the Pew Center and President Obama’s own commission on election administration reveals that anywhere from 16 to 24 million voter registrations in this country are deeply flawed or completely inaccurate.\nInaccurate registrations are opportunities for criminal behavior for any bad actor who wants to discount the weight of an honest vote. Secretary Husted knows this, which is why his office has led nationally in the fight for secure and accurate elections. Sadly for his office, and the rest of the country, much more work remains to be done.","url":"https://www.breitbart.com/politics/2018/08/16/expert-new-data-suggests-ohio-voter-rolls-worse-than-feared/"}
