{"authors":["Julie Cart","Byrhonda Lyons","Ben Christopher"],"date_download":"2018-10-30 22:50:25","date_modify":"2018-10-30 22:50:25","date_publish":"2018-09-13 04:43:44","description":"California has been a leader in developing climate policy, yes, but there have been missteps, and there’s more work to do.","filename":"data/vaneerConsumption/ExpertsCaliforniasaclimatepolicyleaderbutwithmissteps.json","image_url":"https://calmatters.org/wp-content/uploads/Panel-Photo-4-e1536819486217.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939825.html","title":"Experts: California's a climate policy leader, but with missteps","title_page":"Experts: California's a climate policy leader, but with missteps | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Pose this question to any number of experts: Should California be a role model for responding to climate change? Expect any number of differing responses.\nIndeed, the answer proved complicated and nuanced for a trio of environmental experts representing industry, advocacy and the Legislature, who assembled for a CALmatters panel today at the Global Climate Action Summit in San Francisco. It boiled down to this: California has been a leader in developing climate policy, yes, but there have been missteps, and there’s more work to do.\nFran Pavley, the former Democratic legislator who wrote California’s seminal climate law, said the state’s policies are influential, not least because the technology that has grown up around them is on the leading edge, too.\n“The technologies made in California have made a difference around the world, are probably just as important as some of the policies,” she said.\nShe once sat next to a Chinese engineer at an air pollution conference, and he told her he and his colleagues paid close attention to actions taken by California’s Air Resources Board. “He said, ‘We wouldn’t have catalytic converters in our cars today of it wasn’t for California,’ ” Pavley recounted.\nThe CALmatters panel, before a full house at the Public Policy Institute of California, came on the opening day of the global summit, co-hosted by Gov. Jerry Brown.\nThe policies Pavley and others put into place—and which are celebrated this week—have come at a furious rate for California businesses, who’ve been told to find a way reduce greenhouse gas emissions.\nIs California a role model? “Yes and no,” said Michael Shaw, vice president at the California Manufacturers and Technology Association.\n“Some things are not working as well as they could because we don’t make changes to the old programs or get rid of the old programs,” he said. “It’s difficult when California continues to push forward when the rest of the country and, for the most part, some of the world is not following suit. That puts industry at a little bit of risk.”\nTo V. John White, a longtime advocate for clean energy, California is not so much a model as a laboratory.\n“The beginning of our leadership on these issues goes way back,” said White, executive director of the Center for Energy Efficiency and Renewable Technologies. “The leadership comes from our air pollution experience. We have been trying things. We are innovating. But we have to keep going.”\nPavley echoed that.\n“These impacts of climate change, I didn’t think I’d see in my lifetime,” she said. “We need to double down on what we are doing on reducing greenhouse-gas emissions. It’s not a theoretical discussion any more. We have to be smart, but there needs to be a sense of urgency. It’s a collective responsibility.”\nCheck out all of CALmatters’ key climate policy coverage here.","url":"https://calmatters.org/articles/california-leads-on-climate-with-missteps/"}
