{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-22 23:18:54","date_modify":"2018-10-22 23:18:54","date_publish":"2017-04-26 07:15:46","description":"Ursula Cervellone, 34, founded her own eyebrow studio in Sydney after she lost much of her eyebrows from an auto-immune disease. She discusses her top brow tips - and common mistakes.","filename":"data/vaneerConsumption/Expertrevealstheeyebrowmistakesweremaking.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C962600000578-0-image-a-81_1493184263095.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446302_Expert-reveals-eyebrow-mistakes-making_1540250334.html","title":"Expert reveals the eyebrow mistakes we're making","title_page":"Expert reveals the eyebrow mistakes we're making | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For Ursula Cervellone, eyebrows have a very personal meaning.\nWhen the 34-year-old lost much of her brow hair after developing an auto-immune disease while pregnant, she decided to launch her own eyebrow business and take her arches into her own hands.\nMs Cervellone is now the founder and CEO behind Sydney's Feather Brow Couture, a boutique eyebrow studio which specialises in a more 'personal' approach to women's eyebrows.\nHere, Ms Cervellone speaks to FEMAIL about her life and the common brow mistakes she has seen people making over the eight years she has been involved in the industry.\nThe cardinal sin? Trying to go against what your natural shape, colour and size dictates.\nUrsula Cervellone, 34 (pictured), lost much of her eyebrows while she was pregnant and developed an auto-immune disease; this prompted her to found her own brow studio\nMs Cervellone revealed her top tips to make your brows better than ever (pictured: Rosie Huntington-Whiteley and Jessica Alba) - she also outlined the mistakes many of us are making\nThe cardinal sin? Trying to go against what your natural shape, colour and size dictates (pictured: one of Ursula Cervellone's clients)\nAccording to Ms Cervellone, Feather Brow Couture came about because she refused to let anyone else near her eyebrows:\n'I lost half my eyebrows through Alopecia when I developed an auto-immune disease while I was pregnant and it affected my self-confidence hugely,' the expert told Daily Mail Australia.\nI'm not going to let anyone else touch my eyebrows anymore; I'm going to do it myself\n'And then, when I paid a lot - twice - for someone to sort them out, they ended up looking worse than before.'\nMs Cervellone said she thought to herself: 'I'm not going to let anyone else touch my eyebrows anymore; I'm going to do it myself.'\nAnd so, she came up with the idea for Feather Brow Couture - which aims to focus on the specific woman's brow needs and desires, rather than what the specialist thinks they will like.\n'My idea of natural isn't necessarily your idea of natural,' she explained.\nMs Cervellone's top tip is to remember that as you age, your eyebrows will dip slightly as the soft tissue around the brow dips - you will then need to make your arches slightly higher (stock image)\n'I will feather a 22-year-old's brows extremely differently to how I approach a 55-year-old,' she explained (pictured: Ursula Cervellone in her clinic)\nMs Cervellone also said that women need to stop plucking hairs from above their eyebrows as these are vital for shaping your eyebrows (pictured: a client)\nShe also said that while dark, bold eyebrows look good when you have a bold, dramatic look, on a day-to-day basis, dark brows make your eyes look smaller and natural is better (pictured: Emma Watson and Cara Delevingne)\nMs Cervellone outlined that when it comes to our arches, all too often women fall into regular traps.\nTOP EYEBROW TIPS * Stop overplucking - especially from the top of your brow; these hairs need to be used for shaping. * Don't go against what your natural brow suggests - if you have a round face, Angelina Jolie's brows will never look the same on you. * Think about age rather than face shape and gradually make your arch and tail higher as the decades pass. This will stop you from looking too old, sad or tired. * Get educated about brows and bring in photos of what you'd like them to look like. * Don't do bold brows unless you have a full face of makeup. Day to day, something more subtle works better. Plus, blocky brows make your eyes look smaller. * Think about changing up the shape of your eyebrows every two to three years as you get older. Increase the tail and arch a little higher. * For this very reason, don't go permanent with any tattooing, feathering or colouring - semi permanent is your friend. * Never make your brows bigger than what they already are. It looks unnatural. * When pencilling in your eyebrows, make the colour lighter closer to the nose and then start to darken it as you move from the centre of the brow out to the tail.\n'One of the main things that you need to remember is that as you age, your brow shape changes hugely. You need to adopt your eyebrow technique to reflect that.\n'I will feather a 22-year-old's brows extremely differently to how I approach a 55-year-old's. As you age, your eyebrows - especially the tail - will drop lower and lower into your face as the soft tissue around the brow decreases and the brow starts to lower. This can make you look more tired, old and a bit sad.\n'It's worth remembering as you go into your thirties and beyond that you need to increase the tail and the arch a little higher every time you do your eyebrows.'\nThe expert qualified this by saying that you should never go against what nature dictates:\n'If your face shape is nothing like Angelina Jolie's, Angelina Jolie eyebrows will never look good on you,' she said.\nMs Cervellone also said that women need to stop plucking hairs from above their eyebrows:\n'These are vital for shaping and so if you're plucking them, stop,' she said.\n'As well as this, when it comes to pencilling in your eyebrows, don't go too bold. Instagram eyebrows have become very famous, and they can look good on Instagram and beauty bloggers.\n'But dark, bold brows only look good when you have dramatic makeup and need the brows to balance the makeup out.\n'On a day-to-day basis, natural brows look much better. Plus, over-the-top block eyebrows actually make your eyes look smaller.'\nWith regards to tips, Ms Cervellone said it all starts with the shape - your eyebrow should start at the bridge of your nose and end at the end of your eye (stock image)\n'If you need to fill in your brows a bit with a pencil, keep that front area near the nose a light colour and get darker as you get towards the tail end,' she said (pictured: a client)\nMs Cervellone is also a fan of angled brushes for getting that feathered look, but said that everything you do with your arches should be gradual (pictured: Ms Cervellone's studio)\nWith regards to tips for what women can do at home to make their brows look tip top, Ms Cervellone said it all starts with the shape:\n'We all have one eyebrow that's higher than the other, and the trick is to balance them out.\n'Start by shaping them so that your eyebrow starts at the bridge of your nose and ends at the end of your eye. The arch should start two thirds from the tail end and the start of your brow should incline slightly rather than be a straight line.\n'If you need to fill in your brows a bit with a pencil - particularly at the beginning or the end where you might have overplucked - keep that front area near the nose a light colour and get darker as you get towards the tail end.\n'You can even take a different pencil midway through the brow; just try not to be too blocky with the colour at the beginning. It looks unnatural.'\nMs Cervellone is also a fan of angled brushes for getting that feathered look, but said that everything you do with your arches should be gradual:\n'Avoid going bigger than what you have - it won't look good in years to come. Also, always go semi permanent with colour, tattooing or feathering rather than permanent - as you'll need to adapt your brow shape once every two to three years.\n'When you walk into a room, you want it to be you walking in first, not your eyebrows,' she concluded.\nUrsula Cervellone is an eyebrow specialist and cosmetic tattoo artist with over eight years of experience in the cosmetic industry. To visit her website, click here.","url":"https://www.dailymail.co.uk/femail/article-4446302/Expert-reveals-eyebrow-mistakes-making.html"}
