{"authors":[],"date_download":"2018-10-22 21:13:52","date_modify":"2018-10-22 21:13:52","date_publish":"2014-05-06 15:38:36","description":"The Latino electorate continues to grow but the share of voting Latinos compared to those who could vote continues to underperform.","filename":"data/vaneerConsumption/ExpectAboutaThirdOfVotingEligibleLatinosInMiderms.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_44/423706/20140506-voters-naleo-midterms-sl-1204_fe84fe7dc0ebfc3bec6c7ee8d6604f09.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_expect-about-third-voting-eligible-latinos-miderms-n98236_1540242832.html","title":"Expect About a Third Of Voting-Eligible Latinos In Miderms","title_page":"Expect About a Third Of Voting-Eligible Latinos In Miderms","title_rss":"NULL","source_domain":"nbcnews.com","text":"A national group of Latino public officeholders is projecting that 7.83 million Hispanics will vote in this year’s November elections, about a third of those eligible.\nThe National Association of Latino Elected and Appointed Officials, NALEO, announced its biennial Latino vote projection Tuesday at the National Press Club.\nThe group expects about 25.5 million Latinos will be eligible _ meaning they are adults and citizens _ to vote this November. That would mean just about a third of the eligible Latino voters would actually vote this November.\nNALEO coupled the projection with a call for Congress to pass legislation to restore voting rights protections gutted by the Supreme Court when it struck down Section 5 of the Voting Rights Act.\n“This coming election we know that Latinos will continue to have an impact on elections and we want to make sure that every single one of them is able to have a full voice in our elections,” said Arturo Vargas, NALEO’s executive director.\nThe projected 2014 midterm turnout would make up about 8 percent of the total turnout of all racial and ethnic groups, based on NALEO's estimates.\nThat projection compares to a 2010 actual turnout of 6.65 million Latino voters, also 8 percent of all votes, comparable to the 2006 share, despite an expanding Latino electorate, according to Pew Hispanic Center. NALEO had projected a turnout of 6.5 million Latino votes that year.\nThe NALEO projection follows the launch Monday of the Latino Victory Project and a separate political action committee by actress and political activist Eva Longoria and Democratic political fundraiser Henry Muñoz III to help Latinos win elections and boost Hispanic political participation. NALEO assists Latinos already in office and also promotes political engagement and citizenship among Latinos","url":"https://www.nbcnews.com/news/latino/expect-about-third-voting-eligible-latinos-miderms-n98236"}
