{"authors":["Tim Olds And Nathan Daniell For The Conversation"],"date_download":"2018-10-23 05:27:30","date_modify":"2018-10-23 05:27:30","date_publish":"2016-01-28 21:27:28","description":"Scientists from University of South Australia explain that Body Mass Index has come under fire for its calculation shortcomings - and that people should instead focus on body shape or surface shape.","filename":"data/vaneerConsumption/ExpertsslamuseofBMIandrevealhowyoucanworkoutifyouretoofatorthin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD242C00000578-0-image-a-26_1454016430629.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421663_How-perfect-weight-Experts-slam-use-BMI-reveal-work-fat-thin_1540272450.html","title":"Experts slam use of BMI and reveal how you can work out if you’re too fat or thin","title_page":"Experts slam use of BMI and reveal how you can work out if you’re too fat or thin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Public health authorities are forever telling us how much we should weigh, but one essential element is missing: Shape.\nLet’s start with a little quiz.\nBelow is a series of 3D laser scans of bodies, each seen from the front and the side.\nA 3D laser scanner is a miracle machine that creates a digital statue of your body painlessly and in a matter of seconds.\nYour task is to rank the bodies in order of fatness.\nNow there are lots of ways to measure fatness — we’ll come back to that — but for this quiz I want you to rank them according to body mass index (BMI), the most commonly used method of quantifying fatness.\nBody Mass Index is calculated by dividing weight in kilograms by the square of height in metres. But, scientists say this calculation method doesn't take body shape into account\nYou will recall that you calculate your BMI by dividing your weight in kilograms by the square of your height in metres.\nFor adults, a BMI under 18.5 is considered dangerously thin, 18.5-25 is the healthy weight range, 25-30 is overweight, and 30 or over is obese.\nOK, have you ranked them?\nTo get the answer, you will have to read all the interesting stuff between here and the end of the article.\nI’ve written before about the shortcomings of BMI.\nWhat it all boils down to is this: BMI doesn’t take body shape into account.\nIf we went at this logically, we’d observe that the volume of a box increases with the cube of the length of the side.\nSo if humans were geometrically similar regardless of their size, we should have an index that divides weight by the cube of height.\nThere is in fact such an index – it is called the Rohrer Index or the Ponderal Index, and was proposed in 1921 by the eponymous Dr Rohrer.\nA BODY SHAPE INDEX (ABSI) ABSI measures body shape through waist circumference, adjusted for height and weight. Scientists developed this measurement after finding that it was difficult to determine waist circumference through Body Mass Index measurements. The scientists, from City College of New York, looked at a sample of 14,105 adults and found that higher death rates were found for both high and low values of BMI and waist circumference. However, body shape - as measured through ABSI - can more accurately demonstrate risk factors for premature death. Source: PLOS One\nBut humans are not geometrically similar.\nAs people get taller, their legs, and particularly their upper legs, get proportionally longer.\nTall people look a little more like wolfhounds, shorter people like staffies.\nIf someone 190cm tall had the same relative leg length as someone 150cm tall, they would shrink to 185cm.\nSo the volume (and hence the mass) of tall people is somewhat less than you would expect based on their height, and taller people are at a BMI disadvantage.\nTake gym junkie Jenny.\nShe’s 170cm tall, weighs 70kg and is ultra-lean with only 10% body fat. We can calculate that her body volume is 65 litres.\nNow compare her to her sedentary sister Suzie, also 170 cm and 70kg, but 40% body fat.\nThey’ve got the same BMI (24.2), but Suzie has a body volume of 69 litres, because fat is less dense than muscle and takes up more space.\nThose extra four litres have to go somewhere, and Suzie’s got a pretty good idea of just where they have gone.\nIn the same way, the shape of people has changed over time.\nPeople today are fatter at the same BMI than people in those slimmer, bygone days — more Suzie, less Jenny.\nThe scientists instead recommend using A Body Shape Index or Surface-Based Body Shape Index, which they say are better indicators of mortality\nThose who study the human body and its movements, anthropometrists, seem to enjoy creating indices of ideal weight.\nMy favourite is Broca’s Index, named after the French anatomist Paul Broca.\nI like its simplicity: your ideal weight is your height in centimetres minus 100.\nFor me that makes exactly 80kg, which is also exactly my weight. I rest my case.\nI like this more than the stripped-down versions of my ideal weight prescribed by other various body weight scales such as Hamwi (77.9kg), Creff (77.5kg), Devine (75.5kg), Monnerot-Dumaine (74kg), Robinson (73kg), Lorentz (72.5kg), Miller (72kg) or – and this is really getting absurd — the lower limit of my healthy BMI range (60kg).\nResearchers are hard at work developing new shape-based indicators.\nThese typically use combinations of height, weight and waist circumference of often mind-boggling complexity.\nSURFACE-BASED BODY SHAPE INDEX (SBBSI) SBBSI ccounts for body surface area, vertical trunk circumference (which is the measurement from the shoulder to the groin and back), height and waist circumference. Scientists from West Virginia University analyzed data from more than 11,808 subjects. From the analysis, the scientists determined that there should be a new body shape index constructed from anthropometric determinants of body shape and body size. Source: PLOS One\nThe A Body Shape Index proved to predict risk of death quite well, but just never caught on. It needed waist circumference, which is not easy to measure.\nThere are at least six different waist measurement sites, and it requires a bit of expertise to get it right.\nMy hopes are similarly low for the recently launched Surface-Based Body Shape Index, even if it does outperform BMI as a predictor of all-cause mortality.\nThe Surface-Based Body Shape Index also requires a complex measurement that involves running a tape from the groin over the shoulder to the bum crack, which I can see leading to some resistance in the average GP’s surgery.\nSo the bottom line, so to speak, is this: yes, shape-based indices would be better than BMI, but they are hard to measure, they mean nothing to the general public, and there are only limited data for comparison.\nIn the meantime, hard-done-by Jennys and disadvantaged wolfhounds will just have to put up with it.\nSo, how do the bodies compare?\nWell, all of these people have BMIs of exactly 25.\nThe first person is 1.68m tall and weighs 70.6kg.","url":"https://www.dailymail.co.uk/health/article-3421663/How-perfect-weight-Experts-slam-use-BMI-reveal-work-fat-thin.html"}
