{"authors":["Associated Press"],"date_download":"2018-10-23 00:32:18","date_modify":"2018-10-23 00:32:18","date_publish":"2016-01-29 13:38:26","description":"BERLIN (AP) — Germany's justice minister pledged Friday to take steps to crack down on anti-foreigner crime after an unidentified assailant threw a hand gren...","filename":"data/vaneerConsumption/ExplosivedevicethrownatGermanasylumhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:1642a5db70004546b00319ef212ab59d-4PuZeKVXE7cd9005b2c876a8c95b-452_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422321_Explosive-device-thrown-German-asylum-home_1540254738.html","title":"Explosive device thrown at German asylum home","title_page":"Explosive device thrown at German asylum home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Explosive device thrown at German asylum home\nBERLIN (AP) — Germany's justice minister pledged Friday to take steps to crack down on anti-foreigner crime after an unidentified assailant threw a hand grenade at an asylum-seeker's home in the country's southwest.\nRegional police spokesman Thomas Kalmbach said \"it was just luck\" the device did not explode and nobody was harmed in the early morning attack against the home for asylum-seekers in the town of Villingen-Schwenningen.\nGermany took in nearly 1.1 million asylum-seekers last year and there have been multiple attacks on such residences, although most of them have been arson attacks against unoccupied buildings.\nFirefighters prepare hoses outside an asylum seekers' shelter in Villingen-Schwenningen, southern Germany, Friday, Jan. 29, 2016, after someone threw an explosive device over the fence. Police said \"it was just luck\" the device did not explode and nobody was harmed. (Marc Eich/dpa via AP)\nJustice Minister Heiko Maass said the grenade attack represented a new level of \"hate and violence\" and that he was summoning his state counterparts to better coordinate local and federal measures to prevent and prosecute anti-immigrant hate crimes.\n\"Grenades are already flying toward refugee homes; we can't wait until there is someone dead,\" he said. \"We need to do everything we can to ensure xenophobic crimes are more rapidly solved and punished more severely.\"\nPolice formed a special task force to look for the person or people behind throwing the grenade toward the home at 1:15 a.m., Kalmbach said.\nPolice said the grenade still contained its explosives but it was not clear whether it still had a detonator. Forensics experts are investigating.\nSecurity personnel spotted the grenade and kept residents away while police responded.\nA bomb squad destroyed the device in a controlled explosion on the scene at about 5 a.m. after evacuating the 20 residents from the home.","url":"https://www.dailymail.co.uk/wires/ap/article-3422321/Explosive-device-thrown-German-asylum-home.html"}
