{"authors":[],"date_download":"2018-10-22 20:36:51","date_modify":"2018-10-22 20:36:51","date_publish":"2014-05-02 17:49:09","description":"In California it’s all hands on deck as crews enter what could be a historic fight this summer on the frontlines.","filename":"data/vaneerConsumption/ExplosiveFireConditionsPlagueWesternUS.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/412546/140501-cucamonga-fire-540a_a924c2b0c950878707e8d22ab69e7ae3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_california-drought_explosive-fire-conditions-plague-western-us-n92621_1540240611.html","title":"Explosive Fire Conditions Plague Western US","title_page":"Explosive Fire Conditions Plague Western US","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSoaring temperatures, low humidity and Santa Ana winds created the perfect conditions for fire this week in Southern California, where firefighters are facing what could be the most dangerous fire season yet.\n\"In 2014, we've had over a thousand fires here in California,\" said Forester Glenn Barley of Cal Fire. \"In a normal year we would have a little over 400 fires.\"\nThroughout the West, bigger and more expensive fires have become the norm. Now that the wildfire season is underway, states will spend billions to contain the flames.\nIt's estimated more than half a million homes in Colorado alone are nestled in the dangerous \"Wildfire Red Zone.\"\nRay and Cindy Miller, who moved to Black Forest, Colo., more than three decades ago, lost their home in the blaze that destroyed nearly 500 homes last June. But they had planted roots in the community – and even got married on their property. They knew they had to come back and rebuild.\n“In our lifetime, we'll never see it the way it was, so that’s kind of a sobering thought,” Ray Miller said during a recent interview with NBC News. “But we traded some trees for a tremendous view and you move on.”\nHear more from the Millers below, and watch “Nightly News with Brian Williams” Friday for the latest on the wildfires threatening the West.","url":"https://www.nbcnews.com/storyline/california-drought/explosive-fire-conditions-plague-western-us-n92621"}
