{"authors":["Chris Nichols","Capital Public Radio","Dan Morain","Laurel Rosenhall"],"date_download":"2018-10-30 22:38:01","date_modify":"2018-10-30 22:38:01","date_publish":"2018-06-21 20:24:46","description":"As California rents have increased, so have calls to strengthen rent control laws across the state. Voters this fall will have the chance to weigh in on a potential first step.","filename":"data/vaneerConsumption/Exploringthepromiseandunintendedconsequencesofrentcontrol.json","image_url":"https://calmatters.org/wp-content/uploads/RENT6-e1529611366706.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939081.html","title":"Exploring the promise - and unintended consequences - of rent control","title_page":"Exploring the promise — and unintended consequences — of rent control | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Toy cars are scattered across the floor in Marie Camacho’s small one-bedroom apartment in Sacramento. Photos of her 4-year-old boy, Julian, line the walls. The 32-year-old single mom juggles two part-time jobs, but she can’t stand to be away from her son.\n“He likes being around his mom,” said Camacho. “And I’m the only one. … I’m mom and dad. So, it makes it even worse.”\nCamacho’s California dream — of raising Julian in a safe, affordable home with family, school and her church nearby — is getting tougher. Her rent is going up — way up — from about $600 a month to more than $1,000 a month. She can’t afford that jump. And her landlord is not giving her the chance. Instead, she received a 60-day eviction notice, filling her with fear about the future.\nExploding rents like Camacho’s affect millions in California, where renters make up nearly half of all households. They make it tougher to sock away money to someday realize the dream of homeownership. And they displace those without the income to keep up.\nAs rents have increased, so have calls to strengthen rent control laws across the state. Voters this fall will have the chance to weigh in on a potential first step.\nA rent control measure backed by tenant advocates qualified last week for the statewide November ballot. If approved, it would repeal the state’s Costa-Hawkins Rental Housing Act, which blocks rent controls on units built after 1995. The law also stops cities from placing rent caps on condominiums and single family homes.\nRepealing the law would allow cities to craft their own, potentially stronger rent control rules.\nUnintended consequences\nBut while expanding rent control might be good for people like Camacho, it’s not necessarily good for the majority of renters.\nOr for future renters.\nThat’s the argument made by landlords and most economists. They argue that rent control creates the perverse, unintended consequence of making rental housing scarcer and increasing rents for all but a select few.\n“It is a boon to the people that get it,” said Christopher Palmer, a finance professor at the Massachusetts Institute of Technology, who has studied rent control. “That comes at the cost of landlords and potentially at the cost of other tenants in the city that are paying higher rents or that are having scarcer housing. Or even future tenants that are going to get into a unit someday at some very high rent.”\nThat’s exactly what happened in San Francisco, according to an October 2017 study by economists at the Stanford Graduate School of Business. The report found landlords in that city converted rent-controlled apartments to condominiums and even knocked down and rebuilt entire buildings to escape restrictions after San Francisco expanded its rent control in 1994.\nThe actions taken in San Francisco are “particularly worrisome from an affordability point of view,” said Rebecca Diamond, one of the study’s authors. “Because not only does this decrease the supply of rentals as a whole in the city, which we find it does; but it replaces it with high-end condos and high-end new construction, which really caters to high-income households’ tastes and likely fueled gentrification in this city.”\nAccording to Diamond’s research, tenants with a rent-controlled apartment saved anywhere from about $2,300 to $6,600 every year.\nLoading…\nThat savings can make a huge difference in a state where rent has climbed steadily as a share of income. From 1960 to 2013, the percentage of family income needed for rent in California nearly doubled from about 20 percent to 37 percent, according to the Legislative Analyst’s Office. The cost was even higher for young renters, age 18 to 30, who paid 44 percent of their income.\nStill, the savings experienced by some also comes at a cost. In San Francisco, the city lost 5 percent of its rental housing after rent control expanded. Overall rents ticked up 5 percent, according to the Stanford study.\n“Rent control is government regulation,” said Jim Lofgren, a senior vice president with the California Apartment Association, which represents thousands of apartment owners statewide and is a leading opponent of the November ballot measure. “It interferes with the market, and it results in shortages of housing.”\n‘A political choice’\nDean Preston is executive director of Tenants Together, a statewide advocacy organization, which supports the ballot measure.\nHe believes the Stanford study is wrong to place the blame on rent control, particularly when city leaders could have outlawed condo conversions.\n“That’s a political choice, not an intellectual or academic one,” said Preston. “And that’s one of the biggest flaws of that study.”\nOther experts have a more nuanced view.\nMiriam Zuk, a housing researcher at UC Berkeley, said moderate forms of rent control — such as the existing law in California, which does not apply to new apartments — do not slow down new construction, contrary to claims by some landlords and developers.\nLooking at overall housing production from 2007 to 2013, Zuk wrote in a blog that the six cities with rent controls in the San Francisco Bay Area actually produced more housing units per capita than cities in the region without rent control.\nIn an interview, Zuk said those findings are not the result of a rigorous study and did not control for other factors that influence housing production.\nMore comprehensive studies, however, found no evidence that moderate forms of rent control slow new construction, she said.\nCarol Galante, a UC Berkeley professor of affordable housing, said it’s difficult to assess whether rent control slows growth because there aren’t many cities where the policy applies to new housing.\n“But if that were to change,” Galante added, “and rent control were to apply to new construction, I certainly could see that without any limitations, that would cause a serious concern for investors and developers. Investors can invest anywhere. It’s a global pool of money. And so they’re not going to invest in places where they don’t feel they can get an adequate return on their investment.”\n‘What am I going to do?’\nBack in Sacramento, Marie Camacho received an extension this spring to stay at her apartment with her son until she addresses several medical ailments. After that period, she’ll receive another 60-day notice asking her to leave, fueling more uncertainty, she said.\n“It’s always in the back of my mind: What am I going to do?” Marie added. “I don’t want to be homeless.”\nShe doesn’t think she can afford another apartment, and instead plans to search for a room to rent in a house.\nIn the meantime, Marie said she’s participated in protests at the state Capitol calling for more renter protections. She hopes her city passes rent control in time to help her family.\n“Right now,” she said, “if you’re poor, you’re stuck in a horrible situation.”\nChris Nichols is the PolitiFact California reporter for Capital Public Radio in Sacramento. The California Dream series is a statewide media collaboration of CALmatters, KPBS, KPCC, KQED and Capital Public Radio with support from the Corporation for Public Broadcasting and the James Irvine Foundation. Join the conversation on our CA Dream Facebook group.","url":"https://calmatters.org/articles/exploring-the-promise-and-unintended-consequences-of-rent-control/"}
