{"authors":[],"date_download":"2018-10-22 21:51:12","date_modify":"2018-10-22 21:51:12","date_publish":"2014-06-06 19:47:34","description":"A massive formation on the sun made of super-hot magnetic plasma erupted this week in an explosive solar storm captured on video by NASA spacecraft.","filename":"data/vaneerConsumption/ExplosionFromtheSunCouldDealUsaGlancingBlow.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/493206/140606-solar_9d829f73e5fc4bb72089b3a956b55b72.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_explosion-sun-could-deal-us-glancing-blow-n124806_1540245072.html","title":"Explosion From the Sun Could Deal Us a 'Glancing Blow'","title_page":"Explosion From the Sun Could Deal Us a 'Glancing Blow'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA massive formation on the sun made of super-hot magnetic plasma erupted this week in an explosive solar storm captured on video by NASA spacecraft.\nThe huge plasma tendril, known as a solar filament, erupted on Wednesday, blowing part of itself out into space in what astronomers call a coronal mass ejection, or CME. NASA's powerful Solar Dynamics Observatory recorded video of the solar filament eruption while the Solar and Heliospheric Observatory tracked the subsequent CME.\nAstronomer Tony Phillips of SpaceWeather.com, a website that tracks solar flare events, wrote in a post Thursday that amateur and professional astronomers had watched the filament for more than a week to see how it would meet its end. [Photos: Biggest Solar Flares of 2014]\n\"Astronomers had been bracing for the possibility that the filament would collapse, causing a Hyder flare when it landed on the solar surface,\" he wrote. \"Instead, it erupted and hurled part of itself into space.\"\nPhillips said the solar eruption was not aimed directly at Earth, but could deal a \"glancing blow\" to the planet's magnetic field on Saturday, possibly amplifying auroral displays.\nThe most powerful solar eruptions can pose a danger to astronauts and spacecraft in space, and can interrupt satellite navigation and communications systems. They can also interfere with ground-based power grids. Last year, the sun passed the peak period in its current activity cycle.\n— Tariq Malik, Space.com\nThis is a condensed version of a report from Space.com. Read the full report. Email Tariq Malik at tmalik@space.com or follow him on Twitter and Google+. Follow Space.com on Twitter, Facebook and Google+..","url":"https://www.nbcnews.com/science/space/explosion-sun-could-deal-us-glancing-blow-n124806"}
