{"authors":[],"date_download":"2018-10-30 14:34:53","date_modify":"2018-10-30 14:34:53","date_publish":"2018-07-09 20:15:00","description":"Art review: A kinder, gentler time recalled in Winnie-the-Pooh exhibit at High Museum through Sept. 2","filename":"data/vaneerConsumption/ExploringaClassicatHighMuseum.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/04/Videos/4408825.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_f5308da89be132a3f8a8379feb4a6b48__1540910093.html","title":"Exploring a Classic' at High Museum","title_page":"Art review: 'Winnie-the-Pooh: Exploring a Classic' at High Museum","title_rss":"NULL","source_domain":"ajc.com","text":"Much has been made recently of a yearning for childhood virtues of kindness and goodness as exemplified by the astounding success of the documentary “Won’t You Be My Neighbor?” Centered on the gentle guidance and calm nurturing of children’s television show host Fred Rogers, the film recalls a time when grown-ups acted like grown-ups and children could expect to grow up in a world of fair play and decent behavior.\nThe exhibition “Winnie-the-Pooh: Exploring a Classic” at the High Museum feels very much a part of this particular cultural moment. The show provides a reassuring retreat to childhood and its helpmate adults — writer A.A. Milne and illustrator E.H. Shepard — who saw nothing so important to do in their lives as delight children with their charming, timeless stories centered on a pudgy, slightly bumbling bear, Winnie-the-Pooh, and his friends, Eeyore, Tigger, Piglet, Rabbit, Kanga, Roo (and later additions Owl and Rabbit, the latter inspired by a specimen at the Natural History Museum), who offer a comforting and happy rendition of childhood cooperation and companionship.\n>> RELATED: Original Winnie-the-Pooh map breaks auction record\nA line block print, hand-colored by “Winnie-the-Pooh” illustrator E.H. Shepard, is part of the “Winnie-the-Pooh: Exploring a Classic” exhibit at the High Museum of Art. CONTRIBUTED BY EGMONT UK LTD., REPRODUCED WITH PERMISSION FROM THE SHEPARD TRUST\n“Winnie-the-Pooh” is an exhibition organized by London’s Victoria and Albert Museum (the world’s largest repository of Shepard’s drawings) and very much arranged for a child’s point of view. It’s full of inquisitive wall texts asking them to contemplate issues raised in the books, and ornamented with snippets from the storybooks on vinyl mobiles that drift overhead. Black-and-white sculptural trees in the center of the gallery offer a place for children to sit for a rest, a photo or a moment of contemplation and bring the stories into a child’s three-dimensional realm.\n>> RELATED: Why you need to buy tickets early if you want to go to upcoming “Infinity Mirrors” show at High\nMilne and Shepard took their own children and their playthings as their muses, the better to enter into the enchanted alternate reality of childhood or somehow alchemize a child’s imagination with the touchstones of their world. Stuffed Steiff (manufacturers of the first teddy bears in the world, we learn) and other teddy bears like the ones the real-life Christopher Robin Milne and Shepard’s son owned are on display, along with photos of Christopher with his parents and his cherished bear. A tiny black-and-white image shows Winnie-the-Pooh’s namesake: a docile black bear cub named Winnie that Christopher often visited at the London Zoo.\n“A.A. Milne, Christopher Robin Milne and Pooh Bear,” a 1926 photo by Howard Coster. CONTRIBUTED BY NATIONAL PORTRAIT GALLERY, LONDON\nThere are photographs and sketches of the real Ashdown Forest that inspired Hundred Acre Wood, which — attuned to verisimilitude — Milne wanted Shepard to visit in order to render an accurate and reality-based vision of Pooh’s habitat. Shepard’s early sketches of the forest are lush and ornate with art nouveau flourishes, dreamy evocations of place far different from the more matter-of-fact illustrations in the books themselves.\nAn entire gallery is devoted to the ancillary marketing of Pooh and friends, a walk-of-commerce filled with board games and paper dolls, clothing and stuffed animals, even sake cups encircled with storybook illustrations. The Walt Disney Co. beginning in 1961 turned the British storybook into its own extremely profitable brand with theatrical and TV films and merchandise galore.\nSome of the High Museum’s exhibit looks at marketing, such as Winnie-the-Pooh sake cups made by Hasami for the Walt Disney Co., circa 2014. CONTRIBUTED BY VICTORIA AND ALBERT MUSEUM, LONDON\nSome of the most fascinating of this ephemera are the various international versions of Winnie-the-Pooh, like the Russian version, Vinni-Pukh. A cartoon shows the squat, dark, koala-like Russian Pooh in his usual perpetual pursuit of honey, though the Soviet bear was also inspired by local culture and folk tales.\n“Pooh and Piglet Go Hunting,” one of the many pen and ink sketches by E.H. Shepard featured in “Winnie-the-Pooh: Exploring a Classic” at the High Museum of Art. CONTRIBUTED BY THE COLLECTION OF CLIVE AND ALISON BEECHAM, COPYRIGHT THE SHEPARD TRUST\nBut the majority of the show is devoted to Shepard‘s 1926 and beyond simple pencil sketches on paper that demonstrated his characteristic “economy of line” and offered the nascent storybook characters in the throes of creation. We see familiar stories, like Pooh and Piglet’s search for the Woozle, played out in these delicate drawings, and the exceedingly gentle, whimsical British cadence of Milne, which render a reality calibrated to a child’s view of things, when stinging bees and rainstorms are the biggest cataclysms and evils imaginable, and like Pooh, they can bumble through the world without much more to fear than an overstuffed tummy or the occasional Heffalump.\nART REVIEW\n“Winnie-the-Pooh: Exploring a Classic”\nThrough Sept. 2. 10 a.m.-5 p.m. Tuesdays-Thursdays and Saturdays; 10 a.m.-9 p.m. Fridays; noon-5 p.m. Sundays. $14.50, ages 6 and older; free for children 5 and younger and members. High Museum of Art, 1280 Peachtree St. NE, Atlanta. 404-733-4444, high.org.\nBottom line: A charming family-oriented exhibition that explores the enduring appeal — and marketing bonanza — of A.A. Milne’s Winnie-the-Pooh.","url":"https://www.ajc.com/entertainment/arts--theater/art-review-kinder-gentler-time-recalled-winnie-the-pooh-exhibit/t90m70rfEZPVbdpZSXovsL/"}
