{"authors":["Gianluca Mezzofiore For Mailonline"],"date_download":"2018-10-22 23:29:06","date_modify":"2018-10-22 23:29:06","date_publish":"2016-01-29 11:19:17","description":"Igor Atamanenko says he found evidence that Stalin set up secret department to analyse Mao and other leaders' faeces. Special toilets were built to collect and analyse Mao's poo to build psychological portrait.","filename":"data/vaneerConsumption/ExSovietagentrevealsStalinmadespiesanalyseleadersEXCREMENT.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/01F9F41C000004B0-0-image-a-22_1454066354371.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422563_Enema-state-Ex-Soviet-agent-reveals-Stalin-spies-analyse-leaders-EXCREMENT-clues-personality-tricked-Chairman-Mao-using-box-toilet_1540250946.html","title":"Ex-Soviet agent reveals Stalin made spies analyse leaders' EXCREMENT","title_page":"Ex-Soviet agent reveals Stalin made spies analyse leaders' EXCREMENT | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was as secret as the NSA surveillance program, though definitely smellier.\nAn ex-Soviet agent says he has found evidence that Joseph Stalin snooped on Mao Zedong when he visited Russia in the winter of 1949 by analysing his excrement.\nIgor Atamanenko told a Russian newspaper that in the 1940s Stalin's secret police set up a top secret laboratory to study people's faeces.\nAn ex-Soviet agent says he has found evidence that Joseph Stalin (left) snooped on Mao Zedong (right) when he visited Russia in the winter of 1949 by analysing his excrement\nDuring Mao's 10-day visit, special toilets were set up for the Chinese leader's waste products to be collected and studied. Instead of being connected to sewers, those lavatories led to special boxes where Mao's stolls were whisked off for analysis.\n'In those days the Soviets didn't have the kind of listening devices which secret services do today,' he told the paper, according to the BBC.\n'That's why our specialists came up with the most extravagant ways of extracting information about a person.'\nStalin's henchman Lavrenti Beria who was put in charge of the smelly laboratory\nDuring Mao's 10-day visit, special toilets were set up for the Chinese leader's waste products to be collected and studied\nWhich leads to the question: what kind of exclusive information were the Soviet spies hoping to extract from Mao and other foreign leaders' poo?\n'For example, if they detected high levels of amino acid Tryptophan,' Atamanenko explained, 'they concluded that person was calm and approachable.\n'But a lack of potassium in poo was seen as a sign of a nervous disposition and someone with insomnia.'","url":"https://www.dailymail.co.uk/news/article-3422563/Enema-state-Ex-Soviet-agent-reveals-Stalin-spies-analyse-leaders-EXCREMENT-clues-personality-tricked-Chairman-Mao-using-box-toilet.html"}
