{"authors":["Associated Press"],"date_download":"2018-10-23 01:36:58","date_modify":"2018-10-23 01:36:58","date_publish":"2017-04-26 12:05:49","description":"MASON, Mich. (AP) - Former Michigan State defensive end Auston Robertson is jailed on a $250,000 bond after being returned to Michigan from Indiana to face a...","filename":"data/vaneerConsumption/ExSpartanfootballplayerreturnedtoMichiganinsexcase.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464709-1493204752-578_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447326_Ex-Spartan-football-player-returned-Michigan-sex-case_1540258618.html","title":"Ex-Spartan football player returned to Michigan in sex case","title_page":"Ex-Spartan football player returned to Michigan in sex case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MASON, Mich. (AP) - Former Michigan State defensive end Auston Robertson is jailed on a $250,000 bond after being returned to Michigan from Indiana to face a third-degree criminal sexual conduct charge.\nThe 19-year-old Robertson was arraigned in 55th District Court in Mason on Tuesday via videoconference from the Ingham County Jail. He is scheduled to return to court next month.\nRobertson's attorney David Rosenberg says \"a strong defense\" is planned.\nMichigan State defensive end Auston Robertson stands on the field during the Spring Game at Spartan Stadium, Saturday, April 1, 2017 in East Lansing, Mich. The former defensive end has been jailed in Indiana on a third-degree criminal sexual conduct charge filed in Michigan. (Kirthmon F. Dozier/Detroit Free Press via AP)\nA police task force arrested Robertson on Saturday at a relative's home in Fort Wayne, Indiana. Robertson comes from Fort Wayne.\nRobertson is accused of forcing a woman to have sex with him at her Meridian Township apartment on April 8. Shortly after prosecutors announced the charge on Friday, Michigan State said Robertson had been dismissed from the football team.","url":"https://www.dailymail.co.uk/wires/ap/article-4447326/Ex-Spartan-football-player-returned-Michigan-sex-case.html"}
