{"authors":["Chloe-Lee Longhetti","Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-23 00:36:34","date_modify":"2018-10-23 00:36:34","date_publish":"2016-01-11 10:12:21","description":"She's a red carpet regular as host of Extra.","filename":"data/vaneerConsumption/ExtrasReneBarghdonschandelierearringsatGoldenGlobes2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3006207F00000578-0-image-a-21_1452502333949.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393513_Ren-e-Bargh-flaunts-trim-pins-thigh-high-split-strapless-white-gown-Golden-Globes-stuns-chandelier-earrings_1540254994.html","title":"Extra's Renée Bargh dons chandelier earrings at Golden Globes 2016","title_page":"Extra's Renée Bargh dons chandelier earrings at Golden Globes 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a red carpet regular as host of Extra.\nAnd even though she may interview A-list celebrities regularly, Australian star Renée Bargh certainly gives them a run for their money with her fashion.\nThe 29-year-old turned heads as she appeared at the 2016 Golden Globe Awards in Los Angeles on Sunday, flaunting her toned legs in a white Rachel Gilbert gown.\nScroll down for video\nA vision in white! Australian presenter Renée Bargh turned heads as she appeared at the 2016 Golden Globe Awards in Los Angeles on Sunday, in a white Rachel Gilbert gown\nThe strapless frock featured an over-sized bow over the bust and a daring thigh-high split.\nThe blonde completed her look with nude pointed heels, a white manicure, a soft golden tan, and accessorised with Neil Lane gold chandelier earrings.\nKeeping her make-up simple, the Queensland native wore a dusting of bronze eye shadow and a slick of nude lipstick.\nHer hair was parted in the middle and straightened and brushed behind her ears and shoulders.\nSee full coverage on the Golden Globes winners and red carpet fashion\nStatement piece: The blonde accessorised with over-sized Neil Lane gold chandelier earrings. She kept her make-up simple and used neutral tones for eye shadow and lipstick\nFlawless: The strapless frock featured an over-sized bow and a thigh-high split\nRenée shared various shots of herself to Instagram from the big day - one of the biggest on the Hollywood calendar - including a shot standing on the red carpet.\nShe captioned it stating it 'takes a village' to get ready for the glamorous event.\nThe beauty also shared a black and white shot of herself sitting in a hair and make-up chair before hand, wearing a singlet, jeans, runners and a fur coat.\nShe also shared a snap of herself standing with TV personality and actress Rocsi Diaz, holding a bottle of Moet and saying they were 'covering' the after parties together.\nDays prior to the event, she posed for a happy snap in front of the Beverly Hilton where the red carpet was being laid out.\nDocumenting the experience: Renée shared various shots of herself to Instagram from the big day including a shot standing on the red carpet\nPreparations: The beauty also shared a black and white shot of herself sitting in a hair and make-up chair before hand, wearing a singlet, jeans, runners and a fur coat\n'T [time] minus 2 days!' Renee posed outside the Beverly Hilton where the awards are held\nRenee was rugged up from the cold in a large camel coat with a navy and white polka-dot blouse underneath and thigh-high black suede boots.\nIn the caption she wrote: 'Preparations are under way! T [time] minus 2 days.'\nEarlier this week, she attended the People's Choice Awards in LA, and stunned once again in a teal lace dress with a navy crop top and skirt underneath.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393513/Ren-e-Bargh-flaunts-trim-pins-thigh-high-split-strapless-white-gown-Golden-Globes-stuns-chandelier-earrings.html"}
