{"authors":[],"date_download":"2018-10-30 20:23:23","date_modify":"2018-10-30 20:23:23","date_publish":"2015-11-23 16:53:52","description":"An extradition hearing will be held Tuesday for the man and woman suspected of running over and killing a Newton County woman last week during a violent purse-snatching in the parking lot of a Covington Wal-Mart.","filename":"data/vaneerConsumption/ExtraditionhearingTuesdayforsuspectsinCovingtonWalMart.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/23/Images/photos.medleyphoto.8422369.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_extradition_47c821db8da9336a2a4dc11bf347aaeb__1540931003.html","title":"Extradition hearing Tuesday for suspects in Covington Wal-Mart...","title_page":"Extradition hearing Tuesday for suspects in Covington Wal-Mart...","title_rss":"NULL","source_domain":"ajc.com","text":"An extradition hearing will be held Tuesday for the man and woman suspected of running over and killing a Newton County woman last week during a violent purse-snatching in the parking lot of a Covington Wal-Mart.\nBrandon Shawn Smith, 27, and Stephanie Marie Rodriguez, 37, were arrested Saturday in Manchester, Tenn., still driving the car they were allegedly in last Monday night when Covington police say they ran over and killed 65-year-old Marsha Johnson moments after she resisted an attempt to snatch her purse.\nA credit card belonging to Johnson was found days later at a Chattanooga, Tenn., chicken processing plant, and a Manchester resident tipped off police after seeing news reports about the suspects, who were then arrested without incident during a Saturday afternoon traffic stop.\nThe Honda Accord that Smith and Rodriguez were traveling in when they were arrested was taken to the GBI Crime Lab Sunday night, Covington police Capt. Ken Malcom said. It had been stolen from Virginia. Police said they have tied Smith and Rodriguez to “at least 10” purse snatchings and robberies across the Southeast, crimes dating back several weeks.\nTheir extradition hearing will be held in Coffee County, Tenn., Malcom told The Atlanta Journal-Constitution.","url":"https://www.ajc.com/news/crime--law/extradition-hearing-tuesday-for-suspects-covington-wal-mart-death/WGXSPWP2THI8cr301a2kbN/"}
