{"authors":["The Associated Press"],"date_download":"2018-10-30 18:17:38","date_modify":"2018-10-30 18:17:38","date_publish":"2018-08-14 00:00:00","description":"ALEXANDRIA, Va. — Paul Manafort's defense rested its case Tuesday without calling any witnesses in the former Trump campaign chairman's tax evasion and bank fraud trial. Manafort himself chose not to testify.","filename":"data/vaneerConsumption/ExTrumpcampaignchairmanchoosesnottotestifyasdefenserestsitscase.json","image_url":"https://media.arkansasonline.com/img/photos/2018/08/14/188466725_188465634-e117b1056ae8465f90ec9fa46ee91ca9_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_14_defense-fr_f6593cd31accfa702196d49bd1bde2f5__page=1_1540923458.html","title":"Ex-Trump campaign chairman chooses not to testify as defense rests its case","title_page":"Ex-Trump campaign chairman chooses not to testify as defense rests its case","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Members of the defense team for Paul Manafort, including Kevin Downing, left, Richard Westling, and Thomas Zehnle, walk to federal court as the trial of the former Trump campaign chairman continues, in Alexandria, Va., Monday, Aug. 13, 2018. The prosecution is expected to rest its case in the fraud trial. (AP Photo/Jacquelyn Martin)\nALEXANDRIA, Va. — Paul Manafort's defense rested its case Tuesday without calling any witnesses in the former Trump campaign chairman's tax evasion and bank fraud trial. Manafort himself chose not to testify.\nThe decision not to call witnesses clears the way for the jury to hear closing arguments in the first trial to emerge from special counsel Robert Mueller's investigation. Those arguments are scheduled for Wednesday morning.\nManafort is accused of hiding millions of dollars in income he received advising Ukrainian politicians. The defense has tried to blame Manafort's financial mistakes on his former deputy, Rick Gates. Defense attorneys have called Gates a liar, philanderer and embezzler as they've sought to undermine his testimony.\nManafort's decision not to testify and not to call witnesses was announced by his attorney, Kevin Downing, before the jury Tuesday afternoon. Asked by U.S. District Judge T.S. Ellis III whether he wished to testify in his defense, Manafort responded: \"No, sir.\"\nThe announcement came after a more than two-hour hearing that was private. The judge has not given any explanation for the sealed proceeding, only noting that a transcript of it would become public after Manafort's case concludes.\nAfter announcing that they were resting their case, Downing told reporters outside the courthouse that they did so because they believe \"the government has not met its burden of proof.\"\nAlso Tuesday, Ellis rejected a defense motion that the case should be dismissed on those same grounds. Manafort's lawyers asked the judge to toss out all the charges, but they focused in particular on four bank-fraud charges.\nThe government says Manafort hid at least $16 million in income from the IRS between 2010 and 2014 by disguising the money he earned advising politicians in Ukraine as loans and hiding it in foreign banks. Then, after his money in Ukraine dried up, they allege he defrauded banks by lying about his income on loan applications and concealing other financial information, such as mortgages.\nManafort's lawyers argued there is no way that one of the banks, Federal Savings Bank, could have been defrauded because its chairman, Stephen Calk, knew full well that Manafort's finances were in disarray but approved the loan to Manafort anyway. Witnesses testified that Calk pushed the loans through because he wanted a post in the Trump administration.\nEllis, in making his ruling, said the defense made a \"significant\" argument, but he ultimately ruled the question \"is an issue for the jury.\"\nProsecutors rested their case Monday, closing two weeks of a testimony in which they introduced a trove of documentary evidence as they sought to prove Manafort's guilt on 18 separate criminal counts. The prosecution depicted Manafort as using the millions of dollars hidden in offshore accounts to fund a luxurious lifestyle.\nThe case against Manafort does not relate to any allegations of Russian election interference or possible coordination with the Trump campaign, the main thrust of Mueller's investigation.\nStill, the proceedings have drawn President Donald Trump's attention — and prompted tweets — as the president has worked to undermine the standing of the Mueller investigation in the public square.\nTrump has distanced himself from Manafort, who led the campaign from May to August 2016 with Gates at his side. Gates struck a plea deal with prosecutors and has provided much of the drama of the trial so far.\nGates testified that he helped Manafort commit crimes in an effort to lower his tax bill and fund his lavish lifestyle. During testimony, Gates was also forced to admit embezzling hundreds of thousands of dollars from Manafort and conducting an extramarital affair.\nAfter jurors were excused Tuesday, lawyers for both sides conferred with the judge in open court on the language Ellis will use to instruct the jurors in their deliberations.\nThe only dispute was about what jurors should be told about how to interpret questions and comments interjected by the judge during the course of the trial.\nProsecutors, who have been frustrated by Ellis' tendency to interrupt and chide prosecutors in front of the jury, sought stronger language to make clear that jurors do not need to adopt any opinions expressed by the judge.\nAt one point in the discussion, Ellis asked prosecutors whether they thought he had ever interjected his own opinions. Prosecutor Greg Andres, who has had the strongest confrontations with Ellis, said \"yes.\"\nEllis eventually came up with compromise language that was agreeable to both sides.\nRead Wednesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2018/aug/14/defense-fraud-trial-ex-trump-campaign-chairman-res/?page=1"}
