{"authors":[],"date_download":"2018-10-30 20:37:05","date_modify":"2018-10-30 20:37:05","date_publish":"2015-10-21 20:36:45","description":"A former University of Georgia student has pleaded guilty to charges brought against him after an argument between two UGA fraternities in February led to gunshots being fired.","filename":"data/vaneerConsumption/ExUGAstudentgetsfineprobationinfrathousegunincident.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_uga-student_ab0c76b387dd2090dd1cb2d9b7327950__1540931825.html","title":"Ex-UGA student gets fine, probation in frat house gun incident","title_page":"Ex-UGA student gets fine, probation in frat house gun incident","title_rss":"NULL","source_domain":"ajc.com","text":"A former University of Georgia student has pleaded guilty to charges brought against him after an argument between two UGA fraternities in February led to gunshots being fired.\nGregory John O’Brien, 21, of Fayetteville, pleaded guilty on Oct. 14 to reckless conduct and possession of a weapon on school grounds, the Athens Banner-Herald reported.\nO’Brien was fined $1,000 and was placed on three years probation. The Banner-Herald said he must also take a gun safety class.\nO’Brien initially was charged with aggravated assault for allegedly pointing a gun at members of Pi Kappa Alpha. The case never went before a grand jury.\nAccording to police reports, in the early morning of Feb. 15, following an argument between members of the Tau Kappa Epsilon and Pi Kappa Alpha fraternities, gunshots were fired from the second floor of the Tau Kappa Epsilon house.\nA group of Pi Kappa Alpha members were standing between their house and Tau Kappa Epsilon’s house when O’Brien allegedly pointed what appeared to be semiautomatic handgun toward members of Pi Kappa Alpha, the Banner-Herald reported. He allegedly fired a single shot in the air, then pointed the weapon back at the Pi Kappa Alpha members, police said.\nA .45-caliber handgun was recovered when police searched the Tau Kappa Epsilon fraternity house.\nO’Brien never completed the spring semester, which ended in May, the Banner-Herald reported, citing UGA spokesman Bob Taylor.","url":"https://www.ajc.com/news/crime--law/uga-student-gets-fine-probation-frat-house-gun-incident/UWpfXQz0xSWwHE0lnFUNnL/"}
