{"authors":[],"date_download":"2018-10-22 22:35:40","date_modify":"2018-10-22 22:35:40","date_publish":"2014-06-10 16:58:40","description":"Researchers have grown part of an eye in a lab dish, using a type of stem cell made from a piece of skin.","filename":"data/vaneerConsumption/EyeinaDishResearchersMakeRetinaFromStemCells.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/499686/140610-human-eye-1233_eae47db8f2896fdc0cc21e1650389db5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_eye-dish-researchers-make-retina-stem-cells-n127471_1540247740.html","title":"Eye in a Dish: Researchers Make Retina From Stem Cells","title_page":"Eye in a Dish: Researchers Make Retina From Stem Cells","title_rss":"NULL","source_domain":"nbcnews.com","text":"Researchers have grown part of an eye in a lab dish, using a type of stem cell made from a piece of skin.\nThey said the little retina started growing and developing on its own — an important step towards creating custom-tailored organs in the lab.\n“We have basically created a miniature human retina in a dish that not only has the architectural organization of the retina but also has the ability to sense light,\" said M. Valeria Canto-Soler, an assistant professor of ophthalmology at the Johns Hopkins University School of Medicine.\nThe team used cells called induced pluripotent stem cells, or iPS cells, which are immature stem cells whose powers resemble those of embryonic stem cells — they can morph into any cell type in the body.\nThey’re made by tricking an ordinary cell, like a skin cell, into reverting back into embryonic mode. Then the researchers activate genes to get the cell to redirect itself into forming the desired cells — in this case cells of the retina.\nTo the surprise of the researchers, the cells started developing as if they were in a growing human embryo.\n\"We knew that a 3-D cellular structure was necessary if we wanted to reproduce functional characteristics of the retina, but when we began this work, we didn't think stem cells would be able to build up a retina almost on their own. In our system, somehow the cells knew what to do,” Canto-Soler said in a statement.\nThe experiment “may ultimately lead to technologies that restore vision in people with retinal diseases,” she added.\nTests showed the cells responded to light, the team reported in the journal Nature Communications. \"Is our lab retina capable of producing a visual signal that the brain can interpret into an image? Probably not, but this is a good start,\" Canto-Soler said.\nOther teams have used iPS cells to make a piece of human liver and are using them to study a range of human diseases.","url":"https://www.nbcnews.com/health/health-news/eye-dish-researchers-make-retina-stem-cells-n127471"}
