{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-22 23:34:21","date_modify":"2018-10-22 23:34:21","date_publish":"2016-01-28 12:37:03","description":"The Eye-Pod is a timber structure that is 18 feet in diameter and features a large lens in the ceiling that points to the night skies.","filename":"data/vaneerConsumption/EyepodecopodwillhelpyoufindyourinnerHobbit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9FB3400000578-0-image-a-52_1453981966468.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3420737_So-precious-inner-hobbit-stay-tiny-90-night-spherical-eco-pod-stargazing-dome-porthole-windows_1540251261.html","title":"Eye-pod eco pod will help you find your inner Hobbit","title_page":"Eye-pod eco pod will help you find your inner Hobbit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Star-crossed lovers can enjoy a romantic weekend away in this unique spherical 'hobbit house' with an intimate view of the heavens.\nThe Eye-Pod is a timber structure that is 18 feet in diameter and features a large lens in the ceiling that points to the night skies.\nAnd despite its rustic charm couples wont have to do without mod-cons in the port-hole-clad nine-foot-tall building as it features a TV, DVD player, small fridge, and complimentary Wi-Fi.\nThe dome is estimated to have cost the owners £18,000 to make over the space of 12 weeks\nThe Eye-Pod is a timber structure that is 18 feet in diameter and features a large lens in the ceiling\nIt is this unique shape and the lens which gave Miles and Anna James, the owners of The Willows Abersoch campsite it is located at, the name for their creation.\nThe exact materials of the Eye-Pod are top secret, with Miles estimating the dome cost him and his wife £18,000 to design and make over the space of 12 weeks.\nThis is not their first venture into glamping as the site is also home to fully kitted-out 16x8ft tubes, which they have dubbed 'hobbits'.\nMiles, a former lawyer and civil engineer, said: 'We have the only Eye-Pod in the world and it is going to stay that way for a while.\n'Couples have enjoyed it because of the whole experience of sleeping in a sphere and they can see the stars.'\nThe nine-foot tall pod has mod-cons including a TV, DVD player, small fridge and complimentary Wi-Fi\nThe unique shape of the pod prompted Miles and Anna James to call their creation the 'Eye-Pod'\nHe added: 'Everyone who has visited has absolutely loved it and they all want to know if they can have one, people have even come over from America and Australia.\n'It's perfect for a romantic weekend, we have had engagements, proposals and anniversaries. Only one man has proposed, apparently she said yes.\n'Apart from guests we have had a lot of interest from carpenters and boat builders wanted to make them for us, but we won't tell them how its done.\n'The point is we have the only one in the world, it's unique and it's going to stay that way for a while.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3420737/So-precious-inner-hobbit-stay-tiny-90-night-spherical-eco-pod-stargazing-dome-porthole-windows.html"}
