{"authors":[],"date_download":"2018-10-22 20:52:01","date_modify":"2018-10-22 20:52:01","date_publish":"2014-05-02 18:29:07","description":"Thanks to thousands of video gamers, researchers have traced how cells in our retina track objects that move across our field of vision.","filename":"data/vaneerConsumption/EyeWireVideoGamersHelpUntangletheRetinasSpaceTimeSecrets.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/417161/140502-coslog-ganglion_f68123edbd3bfae054c47e3b3918cf6b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_eyewire-video-gamers-help-untangle-retinas-space-time-secrets-n95861_1540241521.html","title":"EyeWire Video Gamers Help Untangle the Retina's Space-Time Secrets","title_page":"EyeWire Video Gamers Help Untangle the Retina's Space-Time Secrets","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nResearchers have traced how cells in our retina track objects that move across our field of vision, thanks in part to thousands of video gamers.\nThe findings, published online Sunday by the journal Nature, validate a concept that explains how some nerve cells are stimulated only by motion in a specific direction and not in other directions. They also validate the use of video games, crowdsourcing and the other tools of citizen science for making rigorous scientific discoveries.\n\"You no longer have to have a Ph.D. in neuroscience,\" said Amy Robinson, creative director for the EyeWire neuro-gaming venture, which contributed to the study. \"You could be a high-school student, or a sculptor, a dental assistant or retiree. All you have to have is now is an Internet connection and an interest in gaming.\"\nMore than 120,000 EyeWire gamers (\"EyeWirers\") from more than 100 countries have signed up to play online video games in which they trace 3-D representations of neural wiring. They rack up points by tracing the circuitry quickly and accurately. It's not always easy: Expert users, known collectively as the Grim Reaper, occasionally have to go into the game to correct the neural maps.\nThe project to trace retinal neurons known as starburst amacrine cells was particularly challenging. \"We weren't sure it would work, because starburst cells are extremely tricky to map,\" Robinson told NBC News.\nEyeWire's team of experts set up a special \"Starburst Challenge\" that identified the most adept gamers for the job. More than 2,000 of them contributed to the mapping project and are listed as co-authors of the Nature paper.","url":"https://www.nbcnews.com/science/science-news/eyewire-video-gamers-help-untangle-retinas-space-time-secrets-n95861"}
