{"authors":["Alan Baldwin"],"date_download":"2018-10-23 00:10:09","date_modify":"2018-10-23 00:10:09","date_publish":"2017-04-26 09:22:29","description":"The FIA announced the development following a meeting of the sport's core Strategy Group in Paris on Tuesday ahead of this weekend's Russian Grand Prix.","filename":"data/vaneerConsumption/F1toditchhaloprotectiondeviceinfavourofscreen.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F63DA1600000578-0-image-a-14_1493194921243.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_formulaone_article-4446770_F1-ditch-halo-protection-device-favour-screen_1540253409.html","title":"F1 to ditch 'halo' protection device in favour of screen","title_page":"F1 to ditch 'halo' protection device in favour of screen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Formula One is set to abandon plans for a 'halo' head protection system in favour of a transparent screen that could be introduced for 2018.\nThe governing International Automobile Federation (FIA) announced the development following a meeting of the sport's core Strategy Group in Paris on Tuesday ahead of this weekend's Russian Grand Prix.\n'A number of more integrated solutions for additional frontal protection have been studied, and the decision has been taken to give priority to the transparent shield family of systems,' it said in a statement.\nFormula One could see the introduction of protective screens for drivers from next season\n'The FIA aims to carry out track tests of this system during this season in preparation for implementation in 2018.'\nThe 'halo' cockpit protection device, which is fixed at three points including a central pillar in front of the driver that supports a protective loop above his head, was extensively tested last season with a mixed response.\nThe FIA said in January the net safety benefit had been established but a decision needed to be made about the aesthetics and whether such a system was right for Formula One.\nCockpit protection has become a priority since the deaths of drivers in other series after being hit by wheels and flying debris.\nThe shield, a see-through screen in front of the driver that does not cover the cockpit, was tested in practice for this year's Chinese Grand Prix.\nDecisions made at the Strategy Group have to be approved by the FIA's World Motor Sport Council, which is usually a formality.\nCockpit protection is high on the agenda as fears increase about drivers being hit by debris\nTuesday's meeting also agreed changes to the 2018 regulations that will lead to the disappearance of the current 'T-wing' and 'Shark Fina' aerodynamic devices that have also been criticised on aesthetics grounds.\nMeasures will also be taken to ensure that oil will not be used as fuel.\nThe Strategy Group, which is currently limited to top teams, will also be opened to non-members.\nThe governing body said this would demonstrate 'the effective commitment of both the FIA and the Commercial Rights Holder to improve transparency in the sport.'","url":"https://www.dailymail.co.uk/sport/formulaone/article-4446770/F1-ditch-halo-protection-device-favour-screen.html"}
