{"authors":[],"date_download":"2018-10-22 22:32:00","date_modify":"2018-10-22 22:32:00","date_publish":"2014-06-10 14:25:44","description":"The Puma AE was originally designed for U.S. soldiers. Now it will fly over Alaskan oil fields for BP.","filename":"data/vaneerConsumption/FAAApprovesCommercialDronetoSurveyAlaskanOilFields.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/499181/pumaae_78ae8fa9782e1fb92f4c6074bf504b50.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_faa-approves-commercial-drone-survey-alaskan-oil-fields-n127281_1540247520.html","title":"FAA Approves Commercial Drone to Survey Alaskan Oil Fields","title_page":"FAA Approves Commercial Drone to Survey Alaskan Oil Fields","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFor the first time, a commercial drone will fly over American soil with the approval of the FAA. The drone’s mission? To do aerial surveys of oil fields in Alaska for BP.\nThis is no octocopter, the tiny drones that have become popular with American hobbyists over recent years. Instead, AeroVironment’s Puma AE has a 9-foot wingspan and can fly on its own for three and a half hours before coming back down.\nAeroVironment makes several drones for the U.S. Military. The Puma was originally designed as a drone that could be thrown into the air by soldiers to give them a better view of what was around them.\nNow, it will help BP “target maintenance activities on specific roads and infrastructure” in Alaska. Previously, the FAA had only given drones permission to fly over water.\nDespite how quickly drone technology is advancing — and the growing popularity of drones with everyone from filmmakers to farmers — the FAA is still playing catch-up. Drones do fly over American soil all of the time, just without any kind of official license from the FAA. Congress has mandated that the agency come up with regulations by September 2015 to avoid confusion and accidents with airplanes.\n\"These surveys on Alaska's North Slope are another important step toward broader commercial use of unmanned aircraft,\" U.S. Transportation Secretary Anthony Foxx said in a statement.\nNot everybody agrees. Brendan Schulman, an attorney who specializes in commercial drone law, told NBC News via email that this is \"not really an example of the kind of commercial use of small drones that most people have in mind.\"\nInstead of actually creating certification requirements that private drone operators and makers could use, he said, the FAA was simply giving the OK to a drone that had already been approved by the Department of Defense for military use, which is \"not an option for people hoping to use the newer drones being designed by high-tech start-ups that are not involved in military applications.\"","url":"https://www.nbcnews.com/tech/tech-news/faa-approves-commercial-drone-survey-alaskan-oil-fields-n127281"}
