{"authors":[],"date_download":"2018-10-22 21:06:56","date_modify":"2018-10-22 21:06:56","date_publish":"2014-05-05 23:47:44","description":"Federal authorities have confirmed an exclusive NBC News report that a U-2 caused a computer glitch that delayed or cancelled hundreds of flights.","filename":"data/vaneerConsumption/FAAConfirmsSpyPlaneScrambledAirTrafficControlinCalifornia.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_faa-confirms-spy-plane-scrambled-air-traffic-control-california-n97751_1540242416.html","title":"FAA Confirms Spy Plane Scrambled Air Traffic Control in California","title_page":"FAA Confirms Spy Plane Scrambled Air Traffic Control in California","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Federal Aviation Administration has confirmed an exclusive NBC News report that a Cold War-era spy plane scrambled the computer systems of a major air traffic control system in Southern California, resulting in region-wide air travel delays affecting hundreds of flights and thousands of passengers.\nIn a statement, the FAA acknowledged that its air traffic system, which processes flight plan information, “experienced problems while processing a flight plan filed for a U-2 aircraft that operates at very high altitudes under visual flight rules.”\nThe U-2 spy plane, the same type of aircraft that flew high-altitude spy missions over Russia 50 years ago, passed through the airspace monitored by the L.A. Air Route Traffic Control Center in Palmdale, Calif., around 2 p.m. on Wednesday. The L.A. Center handles landings and departures at the region’s major airports, including Los Angeles International (LAX), San Diego and Las Vegas.\nThe computers at the L.A. Center are programmed to keep commercial airliners and other aircraft from colliding with each other. According to sources, the U-2 was flying at 60,000 feet, but the computers were attempting to keep it from colliding with planes that were actually miles beneath it.\nThough the exact technical causes are not known, the spy plane’s altitude and route apparently overloaded a computer system called ERAM, which generates display data for air-traffic controllers. Back-up computer systems also failed.\n“The computer system interpreted the flight as a more typical low altitude operation, and began processing it for a route below 10,000 feet,” said the FAA in its statement.\n“The extensive number of routings that would have been required to de-conflict the aircraft with lower-altitude flights,\" said the FAA, \"used a large amount of available memory and interrupted the computer’s other flight-processing functions.”\nThe FAA had to stop accepting flights into airspace managed by the L.A. Center, issuing a nationwide ground stop that lasted for about an hour.\nAt LAX, one of the nation’s busiest airports, there were 27 cancellations of arriving flights, as well as 212 delays and 27 diversions to other airports. Twenty-three departing flights were cancelled, while 216 were delayed. There were also delays at the airports in Burbank, Long Beach, Ontario and Orange County and at other airports across the Southwestern U.S.\nThe agency said that the issues were resolved within an hour and that the system was immediately adjusted and now requires “specific altitude information for each flight plan,” In addition the agency said it has enabled facilities that use the computer system to significantly increase the amount of flight-processing memory available.\n“The FAA is confident these steps will prevent a reoccurrence of this specific problem and other potential similar issues going forward,” the FAA statement said.\nDeveloped more than a half-century ago, the U-2 was once a workhorse of U.S. airborne surveillance. The plane’s “operational ceiling” is 70,000 feet. In 1960, Francis Gary Powers was flying a U-2 for the CIA over the Soviet Union when he was shot down. He was held captive by the Russians for two years before being exchanged for a KGB colonel in U.S. custody. A second U.S. U-2 was shot down over Cuba in 1962, killing the pilot.","url":"https://www.nbcnews.com/news/investigations/faa-confirms-spy-plane-scrambled-air-traffic-control-california-n97751"}
