{"authors":[],"date_download":"2018-10-30 14:38:08","date_modify":"2018-10-30 14:38:08","date_publish":"2018-08-02 15:49:00","description":"The article detailed how millions in airport revenue went to lawyers helping city respond to subpoenas in a federal corruption investigation","filename":"data/vaneerConsumption/FAAprobespossiblemisuseofAtlantaairportfundscitesAJCarticle.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/28/Videos/4426896.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_f_d0a55c21f27635fb3a5ee63fa5f1ae20__1540910288.html","title":"FAA probes possible misuse of Atlanta airport funds, cites AJC article","title_page":"FAA probes possible misuse of Atlanta airport funds, cites AJC article","title_rss":"NULL","source_domain":"ajc.com","text":"The Federal Aviation Administration has opened an investigation into the possible unlawful use of revenue at Hartsfield Jackson International Airport based on an article published in The Atlanta Journal Constitution.\nThe news story, which was published on AJC.com in late June, details how the city paid three law firms more than $7 million to respond to federal subpoenas from a grand jury investigating corruption at Atlanta City Hall.\nRELATED CONTENT: AIRPORT AND CITY HALL\nSome of that money came from airport funds and the article quoted experts who raised questions about whether it was spent lawfully. Airport funds must only be spent on capital and operations expenses at the airport, according to FAA regulations.\n“While we recognize that legal expenditures are permissible under certain circumstances, this article raises questions that the Federal Aviation Administration’s (FAA) Office of Airport Compliance and Management Analysis (ACO) must address,” wrote Kevin C. Willis, the director of the compliance office, in a letter dated July 26.\nThe letter, obtained by the AJC on Thursday, is addressed to Balram Bheodari, Hartsfield-Jackson’s interim general manager.\nORIGINAL DOCUMENT: SEE THE LETTER\nRELATED CONTENT: SUBPOENAS","url":"https://www.ajc.com/news/local-govt--politics/faa-probes-possible-misuse-airport-funds-agency-cites-ajc-story/yJf5M1FIhEAH4sDSFRwAhP/"}
