{"authors":[],"date_download":"2018-10-30 19:49:00","date_modify":"2018-10-30 19:49:00","date_publish":"2018-08-01 15:06:00","description":"The merry prankster's running the satirical “City of Atlanta” Facebook page are planning an implosion event for Stone Mountain. “Join us as we implode America's largest Confederate monument!” the page said, creating an event page that quickly became popular over Tuesday night.","filename":"data/vaneerConsumption/FacebookgroupjokesStoneMountainsConfederatemonumentwillimplo.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/07/04/Images/newsEngin.22457897_Governor_Candidate_Confeder.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_facebook-group-j_c543f974a0623566c927ebd0035b158e__icmp=np_inform_variation-control_1540928940.html","title":"Facebook group jokes Stone Mountain’s Confederate monument will ‘implo","title_page":"Facebook group jokes Stone Mountain’s Confederate monument will ‘implo","title_rss":"NULL","source_domain":"ajc.com","text":"The merry pranksters running the satirical “City of Atlanta” Facebook page are planning an implosion event for Stone Mountain.\n“Join us as we implode America's largest Confederate monument!” the page said, creating an event page that quickly became popular Tuesday night. “Say goodbye to a symbol of white supremacy and celebrate with us as we watch Stone Mountain crumble to the ground.”\nThe whole thing is fake, obviously, considering that the City of Atlanta page is fake and whoever runs it has no authority to blow up anything. Stone Mountain isn’t even in the city of Atlanta and it’s owned by the state. If you go to the park on Sunday between noon and 12:05 p.m., you won’t witness the massive stone explode.\nREAD: Was it fear — or recklessness — that took down Jason Spencer?\nREAD: How long will DeKalb dad get for drowning autistic son, 10?\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nBut the suggestion stirred some discord on Facebook as people who weren’t familiar with the fake Atlanta page tried to figure out if the event was real. Others just didn’t like the joke.\n“I have reported this event to Facebook as terrorism,” one man wrote. “You can’t say you are going to blow up something at a public park on a day which some people are planning to attend.”\nBy accident, City of Atlanta made two event pages.\nAs of noon Wednesday, nearly 2,000 people were “interested” in attending.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/facebook-group-jokes-stone-mountain-confederate-monument-will-implode/37Le8Gox5B4gWKfqdh1KIP/?icmp=np_inform_variation-control"}
