{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:53:31","date_modify":"2018-10-30 22:53:31","date_publish":"2018-07-26 00:00:00","description":"Facebook's stock tanked after a disappointing second-quarter earnings report. The resulting loss in market value was the biggest single-day drop in US stock market history.","filename":"data/vaneerConsumption/FacebookseesbiggestsingledaymarketcapwipeoutinUShistory.json","image_url":"https://amp.businessinsider.com/images/5b5a28118905f228008b46ef-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_facebook-stock-price-earnings-report-market-value-on-pace-for-record-drop-2018-7_1540940011.html","title":"Facebook sees biggest single-day market cap wipeout in US history","title_page":"    Facebook sees biggest single-day market cap wipeout in US history - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"MarketWatch\nFacebook just made the wrong type of history.\nThe Mark Zuckerberg-led social-media titan saw shares drop 19% on Thursday following a disastrous second-quarter earnings report. The damage was swift and unforgiving in after-market trading on Wednesday as Facebook plummeted as much as 24% within an hour. The selling then spilled over into regular trading.\nInvestors took issue with sales and subscriber numbers that fell short of expectations. But perhaps most damaging of all, the company warned of a growth slowdown. Facebook's loss was the biggest single-day drop since it started trading publicly in May 2012.\nBut that still undersells the magnitude of Facebook's earnings disaster. On a market-capitalization basis, the company saw $120 billion erased, the biggest in US stock-market history.\nAnd as you can see in the chart, it's not particularly close.\nBusiness Insider/Joe Ciolli/Andy Kiersz, data from Bloomberg\nIt must be noted, however, that for a loss of this magnitude to be possible in the first place, a company must be gigantic. Facebook achieved its $630 billion valuation (now $510 billion) through an eye-popping 472% run-up in its stock price since going public. That it's seeing such a big chunk erased shows just how fickle investors can be about companies that already possess such stretched valuations.\nSpeaking of market-leading tech stocks, Facebook's mega-cap counterparts Apple,Amazon,Netflix, and Alphabet all lost more than 1.5% at their overnight lows, and the Nasdaq 100 index dropped 1.4% in regular trading hours.\nWhile analysts were stunned by Facebook's growth guidance and subsequent stock plunge, Business Insider's Jim Edwards pointed out that Zuckerberg warned three months ago that bad news was coming, and no one listened.\nSee also:","url":"https://www.businessinsider.com/facebook-stock-price-earnings-report-market-value-on-pace-for-record-drop-2018-7"}
