{"authors":[],"date_download":"2018-10-22 20:35:05","date_modify":"2018-10-22 20:35:05","date_publish":"2014-06-02 13:58:48","description":"A patent application reveals how the world's largest social network might open the doors for kids younger than 13.","filename":"data/vaneerConsumption/FacebookPatentRevealsPossiblePlansForKids.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/481756/140602-kids-facebook-jsw-1223p_d786037442c295602c1c6adabedce73a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_social-media_facebook-patent-reveals-possible-plans-kids-n120221_1540240505.html","title":"Facebook Patent Reveals Possible Plans For Kids","title_page":"Facebook Patent Reveals Possible Plans For Kids","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt's no secret Facebook wants kids younger than 13 -- its minimum age requirement -- to join without lying about their age. A patent application made public last week reveals how the world's largest social network might make that happen.\nCurrently, the Children's Online Privacy Protection Act (COPPA) makes it hard for Facebook, and other websites that collect information, to allow users younger than 13 to join. Under the law, websites which cater to kids 12 and younger are restricted in the personal information they can collect, and must obtain \"verifiable parental consent\" for underage users. So in the past, most social networks avoided dealing with kids altogether.\nOf course, multiple studies found that millions of kids under 13 join anyway, often with the OK from their parents. Facebook's newly public patent -- filed in November 2012 -- describes a method of getting the official Facebook permission slip via verification through Mom or Dad's own Facebook account. According to the patent, Facebook would use the information provided on the parent's account to confirm the relationship with the child. Further, the parent would be able to access the child's account and privacy settings.\nFacebook would not confirm to NBC News whether the company planned to follow through with this patent, or pursue other means of expanding its terms of service to allow younger kids access to the site. As early as May 2011 however, Facebook CEO Mark Zuckerberg expressed his desire for younger users. Speaking at NewSchools Summit -- a gathering of entrepreneurs interested in transforming public education -- Zuckerberg said that going after the Children's Online Privacy Protection Act \"will be a fight we take on at some point.\"\nCOPPA -- enacted in 1998, long before Facebook or even MySpace existed -- is criticized by businesses and child advocates alike. It limits the collection and retention of personal information on websites geared towards kids ages 13 and younger. But age restrictions remain easy to circumvent, and the law does not prevent children from being advertised to or accessing pornography.","url":"https://www.nbcnews.com/tech/social-media/facebook-patent-reveals-possible-plans-kids-n120221"}
