{"authors":["Associated Press"],"date_download":"2018-10-22 21:09:32","date_modify":"2018-10-22 21:09:32","date_publish":"2016-01-28 06:58:43","description":"SAN FRANCISCO (AP) — It won't be long before Facebook's 1.6 billion users have more ways to quickly express their feelings on the world's largest social netw...","filename":"data/vaneerConsumption/Facebooktoexpandbeyonditslikebuttonprettysoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:1397f9c844ad48e99daf2b075616e93b-2vdWmEltwXfba0ce28e6325396a1-251_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420154_Facebook-expand-like-button-pretty-soon_1540242572.html","title":"Facebook to expand beyond its 'like' button 'pretty soon'","title_page":"Facebook to expand beyond its 'like' button 'pretty soon' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Facebook to expand beyond its 'like' button 'pretty soon'\nSAN FRANCISCO (AP) — It won't be long before Facebook's 1.6 billion users have more ways to quickly express their feelings on the world's largest social network.\nAfter four months of testing outside the U.S., Facebook CEO Mark Zuckerberg says that \"pretty soon\" six new emotions will be added to the social network throughout the world.\nZuckerberg didn't give a more concrete timetable while discussing the new feature with analysts in a conference call Wednesday following Facebook's latest quarterly earnings report.\nFILE - In this Dec. 13, 2011 file photo, a sign with Facebook's \"Like\" logo is posted at Facebook headquarters near the office for the company's User Operations Safety Team in Menlo Park, Calif. After four months of testing outside the U.S., Facebook CEO Mark Zuckerberg said on Wednesday, Jan. 27, 2016, that \"pretty soon\" multiple new emotions will be added to the social network throughout the world. (AP Photo/Paul Sakuma, File)\nThe additional options will expand Facebook beyond the renowned thumbs-up symbol that people click on to show they like a comment, photo or video posted on the social network.\nThe new reactions will include symbols for \"angry,\" ''sad,\" ''wow,\" ''haha,\" ''yay\" and \"love.\"\n\"We want people to be able to share all of the things that are meaningful to them, not just the things that are happy and that people are going to like when they see it,\" Zuckerberg said Wednesday.\nFacebook is hoping the additional choices will encourage people to share their thoughts more frequently and hang out on the social network for even longer periods than they already do.\nFacebook has been testing the different reactions in Chile, the Philippines, Portugal, Ireland, Spain, Japan and Colombia.\nZuckerberg said Facebook's engineers still need to make a few more \"tweaks\" before the new options are offered in other parts of the world.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420154/Facebook-expand-like-button-pretty-soon.html"}
