{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 00:39:53","date_modify":"2018-10-23 00:39:53","date_publish":"2017-04-26 10:34:21","description":"Raising his heavily tattooed forearms, the man can be seen placing a large metal bowl over the enormous arachnid as he attempts to bring it down.","filename":"data/vaneerConsumption/FacebookviralvideoofmantryingtocatchHUGEspider.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DAE3F00000578-0-image-a-7_1493197460099.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446668_Facebook-viral-spider-ceiling-meets-man-bowl_1540255193.html","title":"Facebook viral video of man trying to catch HUGE spider","title_page":"Facebook viral video of man trying to catch HUGE spider | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Faced with a massive spider on your bathroom ceiling, would you have an eight-legged freakout, or try to gently remove it?\nCaught on camera, this man chose the latter, with the aid of a large metal bowl... and terrifying consequences.\nRaising his heavily tattooed forearms, he can be seen placing the bowl over the enormous arachnid, which stays surprisingly still.\nAs the unidentified man brings the bowl down, he is shocked to find it empty. How can this be?\nThis is the moment a man was confronted with a huge spider on his bathroom ceiling\nHe attempted to remove the fearsome beast with the aid of a large metal bowl... yet when he brought it down, the receptacle was empty!\nHis confusion then turns to panic - as he turns his head slightly to reveal the huge spider on the side of his face.\nBut look again: the spider doesn't move, at all; the arachno-catcher's panic doesn't look very convincing; and then there's a blink-and-you'll-miss-it apparent 'jump cut' edit as he turns his head.\nRegardless of whether it's a prank or not, the video has gone viral on Facebook, garnering more than 69million views to date on the All Animals channel.\nConfused, the spider-catcher looks around trying to find it - whereupon there's a hint of a 'jump cut' video edit, which suggests not all is as it seems...\nIt's not behind you - it's ON you! The surprisingly non-moving spider magically appears on the man's face\nOne convinced commenter on the social media site wrote: 'I wouldn't wish this predicament upon my worst enemy'.\nAnother more sceptical viewer said: 'The way he captured it didn't look authentic.'\nSo there you have it: our spider-man is either fearless - or just a prankster with access to good video-editing technology.","url":"https://www.dailymail.co.uk/news/article-4446668/Facebook-viral-spider-ceiling-meets-man-bowl.html"}
