{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 05:13:46","date_modify":"2018-10-23 05:13:46","date_publish":"2016-01-28 21:09:41","description":"The Facebook CEO's wealth soared to $47.9billion this week after the social media website's stock climbed 12 per cent following a strong quarterly earnings report.","filename":"data/vaneerConsumption/FacebooksMarkZuckerbergbecomesworldssixthrichestperson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30A5FC0C00000578-0-image-a-10_1454014704521.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421630_Mark-Zuckerberg-world-s-sixth-richest-person-paternity-leave-Facebook-smashes-investor-s-expectations-jump-52-cent-quarterly-revenue_1540271626.html","title":"Facebook 's Mark Zuckerberg becomes world's sixth richest person","title_page":"Facebook 's Mark Zuckerberg becomes world's sixth richest person | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Zuckerberg has pledged to give away 99 per cent of his wealth over his lifetime to charities\nThe 31-year-old's wealth has soared while he has been on paternity leave since his daughter Max was born in November\nMark Zuckerberg has become the world's richest person and fourth wealthiest in the Unites States - while he was on two-month paternity leave.\nThe Facebook CEO's wealth soared to $47.9 billion this week after the social media website's stock climbed 12 per cent following a strong quarterly earnings report, according to Forbes.\nThe 31-year-old Harvard graduate is now the youngest person on the world's top ten richest list where he sits above Google founder Larry Page, the Koch brothers and most recently, Oracle's Larry Ellison.\nScroll down for video\nFacebook founder Mark Zuckerberg has become the sixth richest person in the world - while on paternity leave\nZuckerberg only entered the top ten list at the end of last year when he was catapulted from 14th in 2014 into seventh on the strength of his impressive fortune. He is also now ranked as the fourth richest in the Unites States.\nMicrosoft Chairman Bill Gates is still the richest person in the world. His fortune currently stands at $76.2 billion.\nBehind Gates is Zara founder Amancio Ortega who has a real time net worth of around $68.4 billion.\nLast year, Zuckerberg and his wife, Priscilla Chan, announced a $120 million donation to improve education in the San Francisco Bay area, particularly for low-income students. It came five years after donating $100 million to remake education in Newark.\nThe Facebook founder has been on paternity leave since the birth of his daughter, Maxima, with wife Priscilla Chan, in November when his net worth was estimated at $47.1 billion.\nHe only returned to work last Monday.\nFORBES WORLD'S TOP TEN RICH LIST (IN REAL TIME) Billionaire Net Worth (billions) Company/ source Country 1. Bill Gates $76.2 Microsoft United States 2. Amancio Ortega $68.4 Zara Spain 3. Warren Buffett $59.8 Berkshire Hathaway United States 4. Jeff Bezos $55.2 Amazon.com United States 5. Carlos Slim Helu $49.5 Telecoms Mexico 6. Mark Zuckerberg $47.9 Facebook United States 7. Larry Ellison $44.1 Oracle United States 8. Charles Koch $39.7 Diversified United States 9. David Koch $39.7 Diversified United States 10. Larry Page $37.5 Google United States\nMax - short for Maxima - weighed seven pounds, eight ounces, when she was born and is now the heir to the Silicon Valley tycoon's $46billion fortune.\nThe couple revealed that they plan on donating 99 percent of their wealth to worthy causes.\nThe internet entrepreneur first appeared on Forbes' 400 richest people in America in September 2009 with a net worth of $2 billion - two years before Facebook’s IPO in May 2012.\nSince the initial public offering, Zuckerberg's wealth has increased exponentially as Facebook continues to smash investor's expectations.\nThe world's biggest online social network bucked the trend of underwhelming tech results from Apple Inc and eBay Inc, in the face of economic turmoil in China and a strong U.S. dollar depressing the value of overseas sales.\nIt saw a 52 per cent jump in quarterly revenue as it sold more ads targeted at a fast-growing number of mobile users, sending its shares sharply higher after hours.\nThe strong growth puts the firm it in a position to challenge Google as the Internet's most powerful company.\nIn total, Mark Zuckerberg's company posted revenue of 17.9 billion US dollars (£12.5bn) in revenue for the year, up from 12.4 billion US dollars (£8.7bn) in 2014, an increase of 44%. The number of monthly active users - a key measuring stick - was also up, 14% on 2014 to 1.59 billion users.\nJust over one billion of those use Facebook every day, and 934 million of those access the site on a mobile device, a crucial market as smartphones and tablets begin to dominate time spent online.\nZuckerberg, who took two months maternity leave off after his daughter Max was born in November to wife Priscilla Chan, is also ranked as fourth richest in the United States\nZuckerberg, who returned from paternity leave on Monday, only entered the top ten list at the end of last year when he was catapulted from 14th in 2014 into seventh on the strength of his impressive fortune\nThe results marked the first time that Facebook's quarterly revenue has surpassed $5 billion.\nThe performance surpassed analyst estimates.\n'It's phenomenal at these (currency headwind) levels that they're accelerating to that level of growth,' said Rob Sanderson, an analyst at MKM Partners.\nFACEBOOK IN FIGURES 1.59 billion monthly active users as of December 31 1.44 billion used the service on mobile devices Facebook now sees 100 million hours of daily video watch time. There are 1 billion monthly users now users on Groups. 80 million people use Facebook's stripped down app Facebook Lite for the developing world's slow connections. 500 million users are on Events.\n'I don't think there's going to be too many people crying for them to start monetizing other properties anytime soon because the core business is so strong.'\nFacebook shares rose more than 12 percent in after-hours trading to $106.51.\nTotal revenue rose to $5.84 billion from $3.85 billion a year earlier, with ad revenue increasing 56.8 percent to $5.64 billion in the holiday shopping period, when spending on advertising typically spikes.\nExcluding some items, the company earned 79 cents per share.\nAnalysts on average had expected earnings of 68 cents per share and revenue of $5.37 billion, according to Thomson Reuters I/B/E/S.\nApart from focusing on mobile, Facebook has been ramping up spending on what it calls 'big bets,' including virtual reality, artificial intelligence and drones to connect the remotest parts of the world to the Internet.\nZuckerberg, who returned from two months of paternity leave on Monday, has said virtual reality represents the next major computing platform.\nIn January, Facebook began taking orders for a consumer version of the Oculus Rift, a head-mounted virtual reality unit.\nThe company has also begun monetizing some of its other units, such as photo-sharing app Instagram, which surpassed 400 million users last year and began selling ads in September.\nFacebook is growing rapidly as it enters adolescence, putting it in a position to challenge Google as the Internet's most powerful company. The results marked the first time that Facebook's quarterly revenue has surpassed $5 billion.\nFacebook shares have increased dramatically over the last year with a particular rise in the last quarter\nThe social media company's stocks have been rising since Facebook’s IPO back in May 2012\nFacebook said mobile ads accounted for 80 percent of total ad revenue in the quarter, compared with about 78 percent in the third quarter and 69 percent a year earlier.\n'It's much stronger ad growth than we were expecting,' said Ken Sena, an analyst at Evercore ISI.\n'It signifies the importance of what they're providing to advertisers,' he said. 'They're making big investments and evidenced by their quarterly performance it seems to be working.'\nThe company, which has the world's most popular smartphone app, has also been benefiting from a surge in video views that has attracted advertising dollars.\nFacebook said it had 1.59 billion monthly active users as of December 31, up 14 percent from the end of 2014. Of those, 1.44 billion used the service on mobile devices, an increase of 21 percent.\nAnalysts had expected the company to report 1.58 billion monthly active users, with 1.43 billion accessing the service through smartphones and tablets, according to market research firm FactSet StreetAccount.\nThe company, which has the world's most popular smartphone app, has also been benefiting from a surge in video views that has attracted advertising dollars.\nFacebook said it had 1.59 billion monthly active users as of December 31, up 14 percent from the end of 2014.\nOf those, 1.44 billion used the service on mobile devices, an increase of 21 percent.\nAnalysts had expected the company to report 1.58 billion monthly active users, with 1.43 billion accessing the service through smartphones and tablets, according to market research firm FactSet StreetAccount.\nDaily users of Facebook all over the world have steadily been increasing since the final quarter of 2013\nNet income attributable to common shareholders rose to $1.56 billion, or 54 cents per share, in the three months ended December 31 from $696 million, or 25 cents per share in the same period of 2014.\nExcluding items, the company earned 79 cents per share.\nAnalysts on average had expected earnings of 68 cents per share and revenue of $5.37 billion, according to Thomson Reuters.\nApart from focusing on mobile, Facebook has been ramping up spending on several 'big bets,' including virtual reality, artificial intelligence and drones to connect the remotest parts of the world to the Internet.\nThe company has also begun monetizing some of its other units, such as photo-sharing app Instagram, which surpassed 400 million users last year and began selling ads in September.\nIn January, Facebook also began taking orders for a consumer version of the Oculus Rift, a head-mounted virtual reality unit.\nChairman and Chief Executive Mark Zuckerberg, who returned from two months of paternity leave on Monday, has said virtual reality represents the next major computing platform.","url":"https://www.dailymail.co.uk/news/article-3421630/Mark-Zuckerberg-world-s-sixth-richest-person-paternity-leave-Facebook-smashes-investor-s-expectations-jump-52-cent-quarterly-revenue.html"}
