{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:53:25","date_modify":"2018-10-30 22:53:25","date_publish":"2018-07-27 00:00:00","description":"BI PRIME: As traders comb through the wreckage of Facebook's disastrous second-quarter earnings report, Goldman Sachs finds that one group of investors actually got a big boost from the company's market struggles.","filename":"data/vaneerConsumption/Facebooksstockmeltdowncrushedhedgefundshelpedcompetingclass.json","image_url":"https://amp.businessinsider.com/images/5af0bb7019ee8635008b49c2-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_facebook-stock-price-meltdown-helped-one-surprising-group-of-investors-trade-recommendation-2018-7_1540940005.html","title":"Facebook's stock meltdown crushed hedge funds, helped competing class","title_page":"    Facebook's stock meltdown crushed hedge funds, helped competing class - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images / Spencer Platt\nUpon first glance, it would seem difficult to find any silver lining in Facebook's earnings-driven stock-market disaster on Thursday, which saw shares tumble 19%.\nFor one, the $120 billion in market value erased from the company was by far the biggest drop in US stock market history. There's also the widespread damage that's rippled through hedge funds, for which Facebook was the most popular stock prior to the market bloodbath, according to Goldman Sachs data.\nBut for mutual-fund managers — a much-maligned group largely populated by traditional stock pickers— the damage has been far more limited. In a shocking bit of prescience, their portfolios were actually underweight Facebook ahead of second-quarter earnings.\nAs the chart below from Goldman shows, the average large-cap mutual fund was 20 basis points underweight Facebook, relative to benchmarks. And it didn't happen overnight. The exposure has actually been trimmed gradually over time since reaching a multi-year high in mid-2015.\nGoldman Sachs\nThis is not to say that mutual-fund managers came out entirely unscathed. Any exposure to Facebook, however underweight relative to benchmarks, likely stung. But at the same time, they were able to make up valuable ground versus competitors.\nPrior to Facebook's selloff, a Wells Fargo index measuring the performance of the 100 largest hedge fund positions was up 12% for the year. By comparison, a Barclays index of mutual fund performance had returned -1.7% over the same period.\nSuch a victory was also needed when you consider mutual funds have been squeezed on both sides by low-cost alternatives like exchange-traded funds and less liquid, high-cost investment options.\nWhile Goldman has maintained its buy rating on Facebook specifically, other firms are starting to second-guess the broader market's heavy reliance on mega-cap tech.\nMichael Hartnett, Bank of America Merrill Lynch's chief investment strategist, goes as far as to recommend investors outright bet against the so-called FANG group, which consists of Facebook, Amazon, Netflix, and Google/Alphabet.\nMore specifically, Hartnett says traders should consider going long an emerging-markets group known as BRIC (Brazil, Russia, India, and China) in the third quarter, while also shorting FANG. The objective of such a strategy would be to play a reversal in both groups from how they traded in the first half of 2018.\nAnd wouldn't you know it, mutual funds are ahead of the game once again. Goldman finds that large-cap mutual funds are already underweight FANG, and have been since the third quarter of 2016.\nWhile only time will tell whether they'll be right again, those money managers have to be feeling good about their chances after their relative success with Facebook this week.","url":"https://www.businessinsider.com/facebook-stock-price-meltdown-helped-one-surprising-group-of-investors-trade-recommendation-2018-7"}
