{"authors":["Sandra Howard For The Daily Mail"],"date_download":"2018-10-22 21:13:35","date_modify":"2018-10-22 21:13:35","date_publish":"2017-03-16 00:49:33","description":"Sandra Howard is very careful about who she trusts when it comes to the internet. But, as she discovered this week, stealing her identity proved worryingly easy for hackers.","filename":"data/vaneerConsumption/Facebookfraudstersstolemyidentitytoconmyfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FEADE00000578-0-image-a-9_1489625027811.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4317658_Facebook-fraudsters-stole-identity-family_1540242815.html","title":"Facebook fraudsters stole my identity to con my family","title_page":"Facebook fraudsters stole my identity to con my family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Like most of us, I am always extremely careful about who I trust when it comes to the faceless and voiceless world of the internet.\nEmails from seemingly desperate friends, claiming to be stranded abroad and in need of a cash transfer to get home, are banished to the cyber-dustbin. The vernacular used in those begging missives never holds up to much scrutiny, making it obvious someone’s account has been hacked.\nThe same goes for messages claiming to be from my bank or credit card company, urging me to hand over personal details due to an alleged security breach — ruses I’m sure few of us would be naive enough to fall for.\nSandra Howard (pictured) discovered that stealing her identity was worryingly easy for hackers who claimed to be her online without making any prior contact\nAnd yet, as I discovered this week —and not for the first time — stealing my identity has proved worryingly easy for hackers, who claimed to be me online without making any prior contact.\nI only discovered this fact when, a few days ago, a bona fide independent filmmaker got in touch. He had been contacted by an American company which claimed to be successful at promoting films. It had a professional looking website and seemed credible.\nIt was only when this chap looked at photographs of the company’s ‘team’ on its homepage that he realised something was amiss: he recognised my face smiling back from the page, only under the false name of Madison Wilson.\nI’ve been well known for many things over the years: as a model, a novelist, and, of course, the wife of Michael Howard, the former Conservative Party leader. However, I don’t lead a secret life as a New York-based movie promoter — and nor would I ever want anyone to think that I do, as glamorous as it might sound.\nIt would seem that my two ‘colleagues’ at World Film Presentation — the name of the so-called company I’m alleged to work at — have been similarly faked. It is being looked into, but it would appear it’s a scam — and all with my face seeming to front it up.\nWho knows what nefarious purposes they wanted my image for, but my guess is they used it to add a veneer of gloss to their dodgy business, to fool targets (I am sure they would have asked for an up-front fee from the filmmaker). Isn’t that dreadful?\nYet this isn’t the worst experience I’ve had when it comes to identity theft. A few months ago, a computer scientist who received a friend request on Facebook from someone appearing to be me got in touch.\nThis account was in my name, with my face in the profile picture. It even had a photograph of me with my husband, Michael. Both photographs had been downloaded from the internet.\nSandra only found out when a filmaker got in touch saying he had been scammed by a company using her identity under a false name\nIt was all a sham. I was horrified to think that someone had managed to ape me so easily. But I presumed that such a glaringly obvious attempt at identity fraud could soon be remedied.\nI’m not tech-savvy, so my son and his wife set about helping me get this account shut down. They rummaged around Facebook’s small print and found an email address to contact, which I did.\nUnfortunately this resulted in Facebook shutting down both the bogus account and my genuine one. It led to weeks of hassle, as I was obliged to go to various lengths to prove I was the real Sandra Howard. My husband had to take a photograph of me holding up my passport.\nIt wasn’t just an annoyance, and inconvenient not to have access to my Facebook account. I also felt horribly violated by a total stranger who had purported to be me, for reasons unknown.\nMost troubling was the fact that I may never have known any of this had it not been for the kindness of the man I’d seemingly approached, who found a way to warn me of his suspicions. I now wonder how many other sites there may be — what other ways I am being set up online.\nWhen I looked at this bogus account, it seemed so credible. I could easily imagine friends being taken in by it.\n‘Mostly, these fake accounts are just mischief-making,’ says private investigator Tony Smith, of Insight Investigations.\n‘But sometimes they can be used to create fake dating profiles. At their most sinister, they can be used to get access to your friends — you would be more likely to fall for a desperate Facebook message asking for emergency funds than one via email.’\nYou may well be reading all this thinking this kind of thing is only going to happen to someone like me, who is often photographed and has a fairly public profile.\nBut actually, we are all at risk. After mentioning my troubles, a couple of friends revealed they too have been subjected to the same shenanigans on Facebook.\nIn both cases, the scammer created a duplicate account from their profile and cover pictures, before adding various people from their publicly accessible friends list, presumably to ask them for money at a later date. They had to go through the same rigmarole I did to sort it out.\nAs a result of the scam, Facebook shut down both the bogus account and her own\nThe daughter of another friend, a professional in her early 20s, had her profile picture used to set up a fake account on the dating app Tinder. The poor girl is engaged — imagine how uncomfortable she felt knowing a stranger used her image to attract men.\nTinder profiles are tied to a Facebook account, so her issue originated with the same kind of hack as mine. Had I not managed to get my imposter shut down quickly, I could have ended up in the same sorry situation.\nFrighteningly, my own experiences cover just a couple of examples of how identities can be stolen. Financial fraud as a result of identity theft is a growing issue.\nAccording to Cifas, the fraud prevention service, there were more than 148,000 victims in 2015, compared with 94,500 in 2014. The cost is estimated at almost £5.4 billion annually.\nMost fraudsters assume a person’s identity after accessing their name, date of birth, address and bank details on social media. Some hack companies that hold your information without properly protecting their data.\nThey then use these details to buy things online, obtain credit cards, loans or benefits, take out mobile phone contracts, access confidential details or steal data.\nThe victims often only realise when they get a bill for something they didn’t buy, or discover a problem with their credit rating.\nThe only way to prevent your image being used in this way is to never have it appear on the internet in the first place. You’d have to have no cyber footprint at all — no social media accounts, no pictures attached to any business, club, sports team or school.\nSo what’s the answer? Keeping personal details private largely requires being careful about what you reveal on social media.\nBut according to Tony Smith, scams like the two I was subjected to are unstoppable. ‘The only way to prevent your image being used in this way is to never have it appear on the internet in the first place,’ he explains.\n‘You’d have to have no cyber footprint at all — no social media accounts, no pictures attached to any business, club, sports team or school.\nYou would have to avoid your name and photograph ever appearing online.’\nIn this day and age that’s almost impossible. For most of us, the genie is already out of the bottle. All we can do is urge sites like Facebook to make the process of getting fake accounts shut down as easy as possible. And be less than trusting when those who claim to be friends approach you online — they may be fraudsters.\nTony’s advice to everyone — famous or not — is to Google yourself regularly. Type in your name, email address and numbers and see what comes up.\nI also suggest routinely uploading your profile pictures to Google’s image search facility. Like me, you may find you are leading a secret life in a glamorous city that you knew nothing about.","url":"https://www.dailymail.co.uk/femail/article-4317658/Facebook-fraudsters-stole-identity-family.html"}
