{"authors":["Press Association"],"date_download":"2018-10-23 03:39:54","date_modify":"2018-10-23 03:39:54","date_publish":"2016-01-28 19:17:22","description":"Facebook is to expand its Like feature with five new emoji options called Reactions. The social network's founder and chief executive Mark Zuckerberg said du...","filename":"data/vaneerConsumption/Facebooktoexpandlikefeaturewithfivereactionsemojis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-c3d1f53d-e1c9-4cb5-81a4-979851b8d7e4-2vdWmEltwXfba0ce28e632bfc1b6-138_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421499_Facebook-expand-Like-feature-five-Reactions-emojis_1540265994.html","title":"Facebook to expand like feature with five reactions emojis","title_page":"Facebook to expand like feature with five reactions emojis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Facebook to expand Like feature with five Reactions emojis\nFacebook is to expand its Like feature with five new emoji options called Reactions.\nThe social network's founder and chief executive Mark Zuckerberg said during a conference call after the release of Facebook's latest earnings report that the new buttons would be pushed out to the site's 1.5 billion users \"pretty soon\".\nCurrently the buttons, which are \"love\", \"haha\", \"wow\", \"sad\" and \"angry\" are being tested in several countries, Mr Zuckerberg said. Each one has a corresponding emoji-style face and will appear underneath posts made to the social network, which users can then click.\nThe Like button that appears beneath each post on the site is one of its most prominent features\nDuring testing there was also a button called \"yay\" which featured a smiling face with rosy cheeks, however Facebook said this was no't fully understood by users and as a result has been removed.\nThe Like button that appears beneath each post on the site is one of its most prominent features, with a \"dislike\" button having been one of the most requested additions users would like to see on Facebook for many years, as users looked to quickly and more widely express their emotions.\nHowever, Mr Zuckerberg said that introducing a range of options rather than just an opposite to the Like button added \"a little bit of complexity\" to a user's reaction.\n\"When you only have a Like button, if you share a sad piece of content or something that makes you angry, people may not have the tool to react to it.\"\nAnalysts too believe that the introduction of a wider range of interactions will be a success for the site. Mark Middlemas, director of communications at online advertising firm RadiumOne said the move \"makes complete sense\".\n\"Emojis are the world's fastest-growing digital language, brands including McDonald's, Ikea and Domino's are increasingly using them, particularly to target millennials. In the cluttered digital age, and as we become more lazy, they're a perfect vehicle to share an opinion in one character so users will like them.","url":"https://www.dailymail.co.uk/wires/pa/article-3421499/Facebook-expand-Like-feature-five-Reactions-emojis.html"}
