{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:44:38","date_modify":"2018-10-30 18:44:38","date_publish":"2017-02-28 09:06:39","description":"Facebook has shut down the page of Palestinian president Mahmud Abbas's party Fatah, the movement said on Monday.","filename":"data/vaneerConsumption/FacebookShutsDownPageforPAPresidentAbbassFatahParty.json","image_url":"https://media.breitbart.com/media/2017/02/him.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_28__1540925078.html","title":"Facebook Shuts Down Page for PA President Abbas’s Fatah Party","title_page":"Facebook Shuts Down Page for PA President Abbas’s Fatah Party","title_rss":"NULL","source_domain":"breitbart.com","text":"(AFP) – Facebook has shut down the page of Palestinian president Mahmud Abbas’s party Fatah, apparently over a picture of late leader Yasser Arafat with a weapon, the movement said on Monday.\n“We received a message that our page violated Facebook’s regulations,” Munir al-Jaghub, a media officer with Fatah and one of the page’s administrators, told AFP.\nThe accounts of the 12 administrators of the page, which according to Jaghub had 70,000 followers, were also suspended for 30 days.\nA photo of Arafat holding a rifle that belonged to an Israeli soldier abducted in the 1980s by Palestinians in Beirut that had featured on the page was attached to the message from Facebook.\nStanding next to Arafat is Mahmud al-Alul, recently elected Fatah deputy chairman.\nIsrael regularly accuses Palestinians, including the Fatah-led Palestinian leadership, of inciting violence on social networks.\nIsraeli ministers have met with Facebook officials to stop what it calls online incitement, and have advanced a bill that would allow a court to order companies such as Facebook to remove material considered “incitement”.\nPro-Palestinian activists accuse the internet giant of censorship and bias. In September, Facebook apologised after temporarily disabling accounts linked to two Palestinian news sites critical of Israel.","url":"https://www.breitbart.com/middle-east/2017/02/28/facebook-shuts-page-pa-president-abbass-fatah-party/"}
