{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-22 22:25:20","date_modify":"2018-10-22 22:25:20","date_publish":"2016-01-28 10:23:22","description":"After four months of testing in Spain and Ireland, Facebook boss Mark Zuckerberg said the six new emotions (pictured) will be added to the social network throughout the world 'pretty soon'.","filename":"data/vaneerConsumption/FacebookReactionsusedtoexpresshappinessangerandsurprisecomingsoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A9540D00000578-0-image-a-18_1453976548021.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420664_Get-ready-Facebook-Reactions-Buttons-used-express-happiness-anger-surprise-rolling-pretty-soon_1540247120.html","title":"Facebook Reactions used to express happiness, anger and surprise coming soon","title_page":"Facebook Reactions used to express happiness, anger and surprise coming soon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It won't be long before Facebook's 1.6 billion users have more ways to quickly express their feelings on the world's largest social network.\nAfter four months of testing, Facebook boss Mark Zuckerberg said the six new emotions will be added to the social network throughout the world 'pretty soon'.\nHowever, Zuckerberg didn't give a more concrete timetable while discussing the new feature with analysts in a conference call Wednesday.\nScroll down for video\nAfter four months of testing, Facebook said the six new emotions will be added to the social network throughout the world 'pretty soon'. There will be six new emotions in addition to 'Like'. These include 'Love', 'Haha', 'Yay', 'Wow', 'Sad' and 'Angry' (pictured from left to right)\nThe icons were originally unveiled in October. In addition to the standard Like button, users in select regions were given six new 'Reactions' to test.\nThere are seven reactions in total, officially referred to as 'Like', 'Love', 'Haha', 'Yay', 'Wow', 'Sad' and 'Angry', and the list appears when a person holds down the Like button on a mobile, or hovers their mouse over it on the desktop version of the site.\n'The Like button has been a part of Facebook for a long time,' said Mark Zuckerberg in a post at the time.\n'Billions of Likes are made every day, and Liking things is a simple way to express yourself. Not every moment is a good moment, and sometimes you just want a way to express empathy.\nReactions (Love left and Sad right) appear when a person holds down the Like button on a mobile, or hovers their mouse over it on the desktop version of the site. Facebook didn't give a more concrete timetable while discussing the new feature with analysts in a conference call Wednesday\nFacebook has ruled out a dislike button (like the one pictured) because of fears it would cause negativity on the social network\n'These are important moments where you need the power to share more than ever, and a Like might not be the best way to express yourself.'\nThe feature was initially trialled by Facebook users in Ireland and Spain.\nThe dislike button has been one of the site's most requested features in recent years but founder Mark Zuckerberg previously ruled it out because he was concerned it would cause negativity.\nIn particular, he was hesitant because he feared Facebook would become similar to Reddit, where users can upvote and downvote posts.\nDuring a Q&A session at the social network's headquarters in September, however, the 31-year-old admitted he had changed his mind.\nRather than introducing a way to either like or dislike a post, he said he wanted a feature that made it easier for people to express empathy.\nIn the meantime, people can send a dislike sticker in Facebook Messenger posts.\nIt is available as part of the Likes sticker package, which also includes a heart, a peace sign, a protest fist, a hand holding a bunch of flowers and a glass of champagne, among others.\nIn the meantime, people can send a dislike sticker in Facebook Messenger posts. It is available as part of the Likes sticker package (pictured), which also includes a heart, a peace sign, a protest fist, a hand holding a bunch of flowers and a glass of champagne, among others\nAccording to recent research, the most annoying Facebook posts that would warrant the use of a dislike button are those that brag about dieting and exercising.\nThis was followed by people who share every meal, and cryptic statuses designed to seek attention by being deliberately vague.\nFacebook scams have previously exploited user's demand for a dislike button to install malware and infect accounts.\nIn particular, the Enable Dislike Button scam claims to offer the opposite to a like button and began appearing on many Facebook users' walls back in 2011.","url":"https://www.dailymail.co.uk/sciencetech/article-3420664/Get-ready-Facebook-Reactions-Buttons-used-express-happiness-anger-surprise-rolling-pretty-soon.html"}
