{"authors":[],"date_download":"2018-10-22 21:26:55","date_modify":"2018-10-22 21:26:55","date_publish":"2014-06-05 13:01:40","description":"A young Muslim in India was fatally beaten by suspects linked to Hindu fundamentalists amid tensions sparked by a Facebook post, local media reported.","filename":"data/vaneerConsumption/FacebookPostBlamedforFatalBeatingofYoungIndian.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/489356/140605-india-protests-prune-945_f2c218d2cfeeb902fb1a69a37f787095.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_facebook-post-blamed-fatal-beating-young-indian-n123371_1540243615.html","title":"Facebook Post Blamed for Fatal Beating of Young Indian","title_page":"Facebook Post Blamed for Fatal Beating of Young Indian","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA young Muslim IT manager in India was fatally beaten by suspects linked to Hindu fundamentalism amid sectarian tensions sparked by a Facebook post, police told local media.\nMohsin Sadiq Shaikh, a 24-year-old from the Solapur district of the city of Pune, was attacked with sticks and stones on his way home from prayers on Monday night by men who had been publicly protesting the circulation of offensive images desecrating two historic Hindu figures.\n\"A gang of youths blocked his way near the lane just behind his house and started hitting him with sticks,” the victim’s cousin told The Times of India, adding that the attackers also bludgeoned Shaikh with stones before fleeing. “He was lying covered in blood for about 15 minutes. His brother rushed there and took him to a nearby hospital where he died during treatment.”\nSeven men, aged between 19 and 24, were arrested, police told the newspaper. A further six were later detained, the Indian Express reported.\nThe victim’s friend alleged that the victim was targeted because he was wearing a skull cap and had a beard.\n“I ran from the spot and called his brother Mobin for help. However, by the time Mobin came, Mohsin was badly beaten up and the assailants were about to leave,” the friend told The Indian Express.\nThe attack came amid anger over a Facebook post that lampooned two Hindu folk heroes: Bal Thakeray, a right-wing politician who wanted Indian Muslims to convert back to Hinduism, and Shivaji, an 17th century Hindu king hailed as a hero of the Hindu right for his campaigns against the Muslim Moghul Empire.\nPolice took steps to block the post, preventing its circulation, according to local media, but that did little to dampen public protests including one that led to a local bakery being set on fire, the Hindustan Times reported.\nPolice told The Times of India that all of the first seven suspects arrested were associated with Hindu Rashtra Sena, a fundamentalist Hindu outfit led by Dhananjay Desai.\nHowever Desai, who was separately arrested for distributing inflammatory pamphlets earlier this year, told the Indian Express that his organization was not involved in the killing.\n“We understand that circulating derogatory pictures is a cyber crime but the problem cannot be solved by killing innocent persons,” he told the newspaper. “We did condemn the uploading of derogatory pictures, but we did not plan attacks on innocent persons.”\nAlastair Jamieson and Wajahat S. Khan","url":"https://www.nbcnews.com/news/world/facebook-post-blamed-fatal-beating-young-indian-n123371"}
