{"authors":["Pa Reporter"],"date_download":"2018-10-23 01:57:49","date_modify":"2018-10-23 01:57:49","date_publish":"2016-01-28 16:26:35","description":"Greg Dyke had initially said he would stand for a further year in office but opposition to proposed reforms from some FA councillors and a minority of board members has changed his mind.","filename":"data/vaneerConsumption/FAchairmanGregDykewillleavehispostinthesummerafterdecidingnottoseekreelectionforanotherterm.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC4FD200000578-0-image-a-19_1453998537600.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-3421267_FA-chairman-Greg-Dyke-leave-post-summer-deciding-not-seek-election-term_1540259869.html","title":"FA chairman Greg Dyke will leave his post in the summer after deciding not to seek re-election for another term","title_page":"FA chairman Greg Dyke will leave his post in the summer after deciding not to seek re-election for another term | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Greg Dyke has announced he will not seek re-election for another term as Football Association chairman.\nDyke had initially said he would stand for a further year in office but opposition to proposed reforms from some FA councillors and a minority of board members has made him change his mind.\nThe 68-year-old said 'a more of a conciliatory figure than me' would be needed to pick up the pieces after the fight to get the reforms through the FA Council. He will now leave the governing body in the summer.\nFA chairman Greg Dyke has confirmed he will not seek re-election for another term as FA chairman\nDyke said he would stand for a further year in office but he has changed his mind and will leave this summer\nEarlier this month Sportsmail revealed that former FA chief executive Ian Watmore is keen on replacing Dyke as chairman.\nWatmore, who is known to want to lead English football, would be a contender for the post. Like Dyke, he is a wealthy businessman who wouldn't be doing the job for the money.\nDyke read a prepared statement to the FA board on Thursday saying: 'During January, however, as work on options for governance reform crystallised, it became clear to all of us that there wouldn't be a unanimous position on governance reform in the board.\n'What now appears to be the case is that there is a majority position on the board for much needed significant reform. I fully support this but I recognise it is going to be a fight to get through the FA Council.\n'I had already decided that if no reform was possible I was going to leave anyway this summer, a position I had shared with a number of colleagues.\n'What I now see is that even if we get the reform through (which will be a difficult and divisive process although essential), I am probably not the best person to pick up the pieces following the inevitable discord.'\nFormer FA chief executive Ian Watmore is keen on replacing Dyke as chairman when he leaves this summer\nDyke made a throat-cutting gesture after England were drawn with Italy and Uruguay at the 2014 World Cup\nDyke, a former BBC director-general, has been FA chairman since July 2013 during which time he became an outspoken critic of FIFA under Sepp Blatter. He has also pursued policies aiming at modernising the FA and increasing the number of English players in the Premier League.\nHe also made headlines by making a throat-cutting gesture when England were drawn in the same World Cup group as Italy and Uruguay - the gesture proved to be accurate - and saying 'we should shoot ourselves' if England do not qualify from their group at Euro 2016.\nHe also set England a target of winning the World Cup by 2022.\nDyke added in his statement: 'However, whichever way the vote goes on reform, I think the FA will need more of a conciliatory figure than me to build on what has been achieved.\nDyke, pictured on the Wembley pitch in 2014, became frustrated by opposition to proposed FA reforms\nDyke announced plans to celebrate the 50th anniversary of England's 1966 World Cup win earlier this month\n'So having said all that you've probably guessed what I intend to say. I have changed my mind about standing for a final year in the summer but I will devote my time in the coming months to press for acceptance of the board's much-needed, long overdue reform programme.'\nDyke said he would leave the FA in a 'dramatically better financial position' than when he arrived, and that important changes had already been made.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-3421267/FA-chairman-Greg-Dyke-leave-post-summer-deciding-not-seek-election-term.html"}
