{"authors":[],"date_download":"2018-10-23 05:17:06","date_modify":"2018-10-23 05:17:06","date_publish":"2015-12-01 00:00:00","description":"As international leaders convene in Paris to talk about solutions for climate change, one tribe on the Washington coast reluctantly plans its retreat from the encroaching Pacific Ocean.","filename":"data/vaneerConsumption/FacingRisingWatersANativeTribeTakesItsPleaToParisClimateTalks.json","image_url":"https://media.npr.org/assets/img/2015/11/12/seawall_wide-d09dc3ded1b365f8bd605f67cca6044fdb8255a5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=455745765_1540271826.html","title":"Facing Rising Waters, A Native Tribe Takes Its Plea To Paris Climate Talks","title_page":"Facing Rising Waters, A Native Tribe Takes Its Plea To Paris Climate Talks : NPR","title_rss":"NULL","source_domain":"npr.org","text":"LINDA WERTHEIMER, HOST:\nNo matter how climate talks turn out in Paris, the world faces the prospect of climate refugees. Some island nations are already looking to move their people to higher ground. They're even buying land elsewhere. A native tribe in the United States faces a similar choice as sea levels rise. Ashley Ahearn from member station KUOW reports from Washington state's Olympic Peninsula.\nASHLEY AHEARN, BYLINE: Fawn Sharp, the president of the Quinault Indian tribe, still remembers the night last year when the sea spilled into her coastal village.\nFAWN SHARP: I received a phone call from a tribal elder who lives not far from here, right next to the ocean, and the ocean breached into his backyard and took out his smokehouse.\nAHEARN: The Army Corps repaired the 2,000-foot seawall that protects this community, but it wasn't the first time the ocean broke through. And Sharp says it won't be the last.\nSHARP: It will happen. It's not a question of if but when. So we have undertaken a comprehensive effort to relocate our entire village, our courthouse, our law enforcement facilities\nAHEARN: The school, hundreds of homes. The relocation plan will cost $60 million - money the tribe doesn't have. They're asking the U.S. government for help and approaching foundations. About a thousand tribal members live in this small community where the Quinault River flows into the Pacific. Half of them make their living fishing, a livelihood that's under threat. With this year's mild winter and drought, the river was warmer and shallower than ever before recorded. Shane Underwood takes me through the Quinault seafood plant. He's the manager here. We walk past large bins of Chinook and Coho salmon, caught right here on the Quinault River.\nSHANE UNDERWOOD: Everybody's processing salmon and getting ready for market, so...\nAHEARN: How have the fish looked this year? Has it been a good year?\nS. UNDERWOOD: No, it hasn't been a great year at all due to all the low water conditions we experienced over the summer. I've never seen it as low as it's been.\nAHEARN: Underwood said tribal fishermen were bringing in half as much salmon as they'd normally be catching this time of year. So the tribe closed down fishing altogether to give the remaining fish a break. To make matters worse, the glacier that fed the Quinault River and kept it cool melted away five years ago. Stretches of the river got so dry this summer that when one tribal member was walking through a particularly low patch, he stubbed his toe on what turned out to be a baby mastodon jaw. It had probably been submerged since the last Ice Age. Shane Underwood takes me out onto the pier behind the fish plant. He points across the river to where tribal members in small aluminum skiff's pull their nets out of the water.\nS. UNDERWOOD: That fishing ground right over there, that ground belongs to my dad. My brother fishes that ground, and he has a family of 10 people in his household that has to support. And his sole source of income is fishing.\nAHEARN: Shane's 23-year-old son David comes out to join us. He's wearing a Notorious B.I.G. T-shirt and a baseball cap. He's been fishing since he was 7, and he's worried.\nDAVID UNDERWOOD: Climate change could just take all our salmon away.\nAHEARN: I asked David about the plans to relocate his tribe because of sea level rise. He said it's hard to explain to non-native people what it's like to live in the same place for thousands of years.\nD. UNDERWOOD: Just wouldn't be the same to live anywhere else. We'd pretty much be lost, you know? I mean, I don't ever want to have to leave this place, but if the ocean keeps rising, we're going to have to. So I hope and pray that something's done about climate change. I really do.\nAHEARN: David Underwood's best hope is Paris, where international leaders gather this month. Fawn Sharp, the president of the Quinault, will be attending those climate talks. She says it's hard to stay optimistic when year after year leaders have failed to reach a global accord. But she's going to Paris with an open mind.\nSHARP: You come together to contend with the seemingly impossible, but you're part of the solution, and it's that collective will to make a difference to solve this crisis - that's the only way it's going to happen.\nAHEARN: Sharp says she'll be pushing developed nations to help not just her people but other indigenous peoples around the world who are on the frontlines of climate change. For NPR News, I'm Ashley Ahearn on the Quinault Indian reservation in Washington. [POST-BROADCAST CORRECTION: In the audio of this story, as in a previous Web version, we say that Quinault Tribal Council President Fawn Sharp will be attending the climate talks in Paris. It turns out that Sharp decided not to attend and that representatives from two other tribes in Washington state are going instead.]\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=455745765"}
