{"authors":[],"date_download":"2018-10-30 17:55:59","date_modify":"2018-10-30 17:55:59","date_publish":"2015-08-22 04:00:00","description":"Donald Trump, a pro-life attack on Planned Parenthood and Atlanta Mayor Kasim Reed. They all took a ride last week on the AJC Truth-O-Meter, courtesy of those fact-checking scribes at PolitiFact and PolitiFact Georgia.","filename":"data/vaneerConsumption/FactcheckerslookatTrumpAtlantasMayorReedprolifegroup.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/12/Images/photos.medleyphoto.7902112.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_5aa33e73203d9855320acce9bf402817__1540922159.html","title":"Fact-checkers look at Trump, Atlanta’s Mayor Reed, pro-life group","title_page":"Fact-checkers look at Trump, Atlanta’s Mayor Reed, pro-life group","title_rss":"NULL","source_domain":"ajc.com","text":"Donald Trump, a pro-life attack on Planned Parenthood and Atlanta Mayor Kasim Reed.\nThey all took a ride last week on the AJC Truth-O-Meter, courtesy of those fact-checking scribes at PolitiFact and PolitiFact Georgia.\nFull versions can be found at www.politifact.com/georgia/.\nAbbreviated versions of our fact checks are below.\nAtlanta Mayor Kasim Reed in a speech to the Commerce Club on Tuesday, August 11, 2015:\n“Peachtree and Pine is one of the leading sites for tuberculosis in the nation.”\nAtlanta Mayor Kasim Reed has made no secret of wanting to close the homeless shelter at Peachtree and Pine streets, and he is now citing health concerns as a reason it should be shuttered.\nReed says he’ll push for the city to acquire the property through eminent domain and turn it into a police precinct and fire station.\n“Peachtree and Pine is one of the leading sites for tuberculosis in the nation,” he said recently at a Commerce Club speech.\nThirty cases of a medicine-resistant strain of TB in eight states have been traced back to the shelter at Peachtree and Pine. The shelter also had a large share of the cases in a recent TB outbreak in Fulton County and four TB deaths, according to state data.\nCDC officials clearly believe it’s a concern, but a leading tuberculosis expert says, there’s a dearth of comparative data.\nWe rated Reed’s statement Mostly True.\n“Zero Planned Parenthood facilities are licensed to do mammograms. Planned Parenthood, women don’t need you!”\nThe Alliance Defending Freedom, Tweet posted Aug. 3, 2015\nThe secret videos showing discussions of fetal tissue sales have reignited the abortion debate nationally and in Georgia.\nIn an effort to debunk defenders that Planned Parenthood provides essential women’s health services in addition to abortions, a pro-life group claimed that none of the organization’s clinics is licensed to provide mammograms.\n“Zero Planned Parenthood facilities are licensed to do mammograms,” the Aug. 3 Tweet from the Alliance Defending Freedom read. “Planned Parenthood, women don’t need you!”\nFederal data and Planned Parenthood’s own documents back up the claim.\nHowever, the statement ignores that Planned Parenthood physicians perform the clinical exams that lead to referrals for a mammogram or other specialized breast care.\nThat physical exam is a necessary step in the process of getting the screening and has been since 1970, although ADF has a valid point that other physicians could provide that piece of the process.\nThat means the claim is partially accurate but misleading without additional details.\nWe rated the claim Half True.\nDonald Trump on Sunday, August 16th, 2015 in an interview on “Meet the Press”:\nSays “if the (Iran nuclear) deal gets rejected, they still get” $150 billion.\nExperts told us that even if Congress rejected the nuclear deal, other countries could stop enforcing their own sanctions anyway. As a result, Iran would be able to access at least some of its assets that have been frozen under international sanctions.\nHowever, experts said it’s highly unlikely that this would amount to $150 billion, the maximum estimate of how much Iran could benefit by the lifting of all international sanctions without regard to Iran’s outstanding financial obligations.\nWithout United States participation, the best estimate we could find was $40 billion.\nTrump’s claim is partially accurate but cherry-picks the high end of estimates for the unfrozen assets.\nWe rated Trump’s claim Half True.","url":"https://www.ajc.com/news/state--regional-govt--politics/fact-checkers-look-trump-atlanta-mayor-reed-pro-life-group/x2ta9wDhm1z0aoLOUlcFrL/"}
