{"authors":[],"date_download":"2018-10-30 17:56:34","date_modify":"2018-10-30 17:56:34","date_publish":"2015-08-08 04:00:00","description":"Donald Trump took the spotlight last week in the first prime-time TV debate of the 2016 presidential race.","filename":"data/vaneerConsumption/Factcheckersponderthepresidentbackyardchickensandgay.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_aabcf3ff84f855e9f03ed3a268bf0f55__1540922194.html","title":"Fact-checkers ponder the president, backyard chickens and gay...","title_page":"Fact-checkers ponder the president, backyard chickens and gay...","title_rss":"NULL","source_domain":"ajc.com","text":"Donald Trump took the spotlight last week in the first prime-time TV debate of the 2016 presidential race.\nTrump’s criticism of U.S. Sen. John McCain’s war record has turned the treatment of veterans into a major point of political discussion. President Barack Obama entered the fray, with a statement that his administration has cut homelessness among veterans by one third, a remark that had prompted us to fire up the Truth-O-Meter.\nWe looked at a claim by U.S. Sen. Ted Cruz, R-Texas, that states not directly involved in the gay marriage lawsuits that reached the Supreme Court “are not bound” by the court’s ruling. We also were asked to check out a warning from the Centers for Disease Control about kissing and cuddling backyard chickens.\nComing tomorrow, we look at GOP candidate and New Jersey Gov. Chris Christie.\nFull versions can be found at www.politifact.com/georgia/.\nBarack Obama on Tuesday, July 21st, 2015 in an online interview with “The Daily Show”\nSince 2009, “we’ve cut homelessness (among veterans) by a third.”\nEver since Republican presidential candidate Donald Trump criticized the war record of Vietnam veteran Sen. John McCain on July 20, the treatment of veterans has been a major point of political discussion.\nPresident Barack Obama got into the fray in his July 21 interview with Jon Stewart on the Comedy Central program “The Daily Show” during an exclusively online portion of the interview.\nStewart questioned Obama on the state of veteran health care.\n“Let’s take something like homelessness among veterans. So we’ve cut that by a third, ” Obama said.\nAccording to the most recent, best available data, the president is right. During his tenure, homelessness among veterans has decreased 32.57 percent. That number, however, is based on estimates that have an element of uncertainty.\nFunding to end homelessness among veterans has received bipartisan support in Congress.\nStill, Obama’s point is largely accurate. We rated his statement Mostly True.\nCenters for Disease Control on Thursday, July 16th, 2015 in radio interview\nCaution: Kissing and cuddling chickens can be hazardous to your health.\nRaising backyard chickens has been satisfying some foodies’ affection for the uber-local egg and lower-fat meat in urban areas, including metro Atlanta, for about a decade.\nNow the Centers for Disease Control and Prevention is warning of a downside to the popular trend: salmonella outbreaks traced to some backyard owners kissing and cuddling their flocks.\nThe CDC findings drew some media attention last month, and a PolitiFact reader who heard the health alert on NPR’s “Morning Edition” on July 16 asked us to dig deeper.\nThe CDC issued the recent warning against kissing or snuggling backyard chickens after four recent salmonella outbreaks that, as of July 29, had infected 218 people in 41 states. Five of them were in Georgia.\nInterviews have been conducted with 140 of the people who became ill, and 117, or 84 percent, reported contact with live poultry in the week before their illness began, according to the CDC website.\nThe CDC also has evidence from outbreaks between 2008 to 2014. In that period, they found that, of the people who became infected with salmonella due to baby poultry exposure, 49 percent, or 196 out of 400 people, reported snuggling and holding baby birds. Another 13 percent, or about 53, reported kissing baby birds.\nThat’s cause to sound the alarm.\nWe rated the CDC warning True.\nTed Cruz on Sunday, June 28th, 2015 in an interview with NPR News\nSays states not directly involved in the gay marriage lawsuits that reached the Supreme Court “are not bound” by the court’s ruling.\nThe U.S. Supreme Court holds ultimate sway on the laws of the land, yes?\nHold on, Ted Cruz said in an interview about the court’s 5-4 decision holding that state bans on gay marriage violate federal principles of equal protection and fair treatment under the law.\nAfter the June 26, 2015, ruling, which addressed challenges to state laws in Ohio, Tennessee, Michigan and Kentucky, Cruz said that if a party isn’t directly involved in a dispute before the Supreme Court, it’s not required to comply with the ruling.\n“Those who are not parties to the suit are not bound by it, ” Cruz said.\nA reader asked us to check Cruz’s claim.\nHe has a thread of a point in that only four states were directly involved in the case. But that’s an incomplete answer to the question of whether states could ignore the court’s ruling. Other courts would be bound by the Supreme Court’s precedent, making the ruling applicable throughout the nation. That’s a fact that Cruz alluded to only after being pressed by the interviewer for clarification of his earlier misleading statement.\nWe rated the claim by Cruz Mostly False.\nGeorgia Department of Economic Development in a July 9th, 2015 press release.\nFilm and television productions generated a $6 billion economic impact for Georgia’s economy in the most recent fiscal year.\nSuperheroes and zombies apparently bring serious coin into the Peach State.\nThe “Ant-Man” movie, and “The Walking Dead” TV series were among 248 productions shot in Georgia in the fiscal year that ended June 30, according to the state Department of Economic Development.\nThe direct spending in Georgia was $1.7 billion, but the headline had an even more eye-popping number. The productions “generated an economic impact of more than $6 billion,” the department said.\nPolitiFact Georgia couldn’t resist looking further.\nWe found out that the state came up with the $6 billion figure by multiplying each direct dollar by 3.57 to come up with the overall economic impact. We were told that’s the formula for calculating economic impact that the state’s used for at least 30 years.\nBruce Seaman, an economist at the Andrew Young School of Public Policy at Georgia State University, said the state’s multiplier is way too high. A more realistic 1.83 multiplier impact of $3.1 billion, which is lower, but certainly significant.\nWe rated the state’s claim Half True.","url":"https://www.ajc.com/news/state--regional-govt--politics/fact-checkers-ponder-the-president-backyard-chickens-and-gay-marriage/thEjlwMjOjzVmppNR8iYzO/"}
