{"authors":["Associated Press"],"date_download":"2018-10-23 02:18:29","date_modify":"2018-10-23 02:18:29","date_publish":"2017-03-16 12:49:31","description":"LONDON (AP) - In the thriller \"Kompromat,\" a political earthquake is shaking Britain and the European Union, a populist tide is sweeping the West and a...","filename":"data/vaneerConsumption/FacttofictionBorisJohnsonsfatherpensBrexitthriller.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/12/wire-228397-1489668576-414_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320032_Fact-fiction-Boris-Johnsons-father-pens-Brexit-thriller_1540261109.html","title":"Fact to fiction: Boris Johnson's father pens Brexit thriller","title_page":"Fact to fiction: Boris Johnson's father pens Brexit thriller | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - In the thriller \"Kompromat,\" a political earthquake is shaking Britain and the European Union, a populist tide is sweeping the West and a resurgent Russia is pulling invisible strings around the world.\nBritish author Stanley Johnson found gallons of real-life fuel for his forthcoming novel, billed as a \"Brexit thriller.\" As a former senior EU official and father of Brexit-backing British Foreign Secretary Boris Johnson, he's exceptionally well placed to turn political fact into fiction.\nThe book's publisher says it \"explores the skullduggery that might just have gone on behind the scenes\" of Britain's EU membership referendum, held against a backdrop of geopolitical cyber-meddling, online propaganda and disorienting \"fake news.\" Its title is a Russian word for compromising material that can be used as leverage against a public figure.\nStanley Johnson poses for a portrait as he talks to the Associated Press at the London Book Fair, about his forthcoming thriller based around a fictitious Brexit scenario, in London, Thursday, March 16, 2017. In the political thriller \"Kompromat,\" a political earthquake is shaking Britain and the European Union, a populist tide is sweeping the West and a resurgent Russia is pulling invisible strings. British author Stanley Johnson found gallons of real-life fuel for his forthcoming Brexit thriller. As a former senior EU official, and father of Brexit-backing British Foreign Secretary Boris Johnson, he's exceptionally well placed to turn political fact into fiction. (AP Photo/Alastair Grant)\nJohnson's cast of characters includes a populist U.S. presidential candidate, a right-wing blogger-turned-political adviser, a female British prime minister, a Russian president and assorted world leaders, spies and political manipulators.\nAny resemblance to real people is, if not coincidental, at least plausibly deniable.\n\"My key characters are what you might call composite characters,\" Johnson said during an interview at this week's London Book Fair.\nThe nearest thing to a good guy is a British politician who's \"a useful idiot. He's a good guy without realizing it, and he's basically being manipulated by the bad guys anyway.\"\n\"There is no autobiographical element, I can reassure you,\" stressed the 76-year-old environmentalist, adventurer, ex-member of the European Parliament and - he has claimed - a one-time trainee spy.\nAnd no characters are based on members of his high-profile family - although Johnson doesn't necessarily expect people to believe that.\n\"People will see what they want to see in books,\" he said.\nJohnson is the author of several previous thrillers that mirrored or predicted true-life events. \"Panther Jones for President,\" published in the 1960s, foresaw a black president in the White House. \"The Warning\" was about global warming. \"The Commissioner\" - which was turned into a 1998 film starring John Hurt - unleashed turmoil inside the EU.\n\"Kompromat,\" which is being published in Britain on Sept. 28 by Oneworld, joins a growing crop pf Brexit-themed fiction, including Ali Smith's recently published \"Autumn,\" Amanda Craig's forthcoming urban-rural novel \"The Lie of the Land\" and Mark Billingham's detective thriller \"Love Like Blood,\" out later this year.\nJohnson's book drew lively interest at London's literary trade fair. The author brandished the business card of a senior Russian diplomat who had just asked if he could have a copy.\nAlthough Moscow machinations loom large, Johnson stresses that his novel is not anti-Russian. He says he has some Russian heritage mixed in with his British, German and Turkish ancestry.\n\"I have an instinctive sympathy with this great nation,\" he said. \"So the last thing I want to do is to demonize it in any way.\"\nHe says he admires Russian authorities for a \"degree of sheer cunning and inventiveness that some of us on this side of the political divide might do well to emulate.\"\nJohnson is patriarch of one of Britain's best-known clans. Youngest son Jo is a science minister in Britain's Conservative government. Daughter Rachel is a well-known journalist. And his larger-than-life son Boris, a former mayor of London, now Britain's top diplomat, is recognized around the world.\nBoris Johnson has inherited his father's loquacious ebullience - both tend to wrap up answers with a cheerful \"Hey, ho\" - but not his affection for the EU. Boris was a leader of the victorious \"leave\" side in last year's EU referendum. Stanley firmly wanted Britain to stay in the 28-nation bloc.\nHe says this is \"a very, very worrying moment\" for Britain, but admires his son's positivity about the country's prospects outside the EU. Looking on the bright side appears to be a family trait.\n\"I am struck very happily by Boris's note of optimism on this whole business,\" Johnson said. \"He's the great uplifting spirit in this fanfare. And so I'm happy to know that everything is going to turn out alright.\"\nDo things turn out alright in the book? Johnson says his thrillers \"almost all end with somebody saying: 'Mr. President, the blob is getting bigger.'\"\n\"That blob could be an incoming missile, it could be a virus which is growing and growing, it could be a nuclear deposit in the Earth. In this case, the blob may just be the spreading of the internet,\" he explained.\n\"I usually leave it to the reader to work out whether the blob does in fact do its dirty work - or do people, in the nick of time, intervene?\"\n___\nFollow Jill Lawless on Twitter at http://Twitter.com/JillLawless\nStanley Johnson poses for a portrait as he talks to the Associated Press at the London Book Fair, about his forthcoming thriller based around a fictitious Brexit scenario, in London, Thursday, March 16, 2017. In the political thriller \"Kompromat,\" a political earthquake is shaking Britain and the European Union, a populist tide is sweeping the West and a resurgent Russia is pulling invisible strings. British author Stanley Johnson found gallons of real-life fuel for his forthcoming Brexit thriller. As a former senior EU official, and father of Brexit-backing British Foreign Secretary Boris Johnson, he's exceptionally well placed to turn political fact into fiction. (AP Photo/Alastair Grant)\nStanley Johnson poses for a portrait as he talks to the Associated Press at the London Book Fair, about his forthcoming thriller based around a fictitious Brexit scenario, in London, Thursday, March 16, 2017. In the political thriller \"Kompromat,\" a political earthquake is shaking Britain and the European Union, a populist tide is sweeping the West and a resurgent Russia is pulling invisible strings. British author Stanley Johnson found gallons of real-life fuel for his forthcoming Brexit thriller. As a former senior EU official, and father of Brexit-backing British Foreign Secretary Boris Johnson, he's exceptionally well placed to turn political fact into fiction. (AP Photo/Alastair Grant)","url":"https://www.dailymail.co.uk/wires/ap/article-4320032/Fact-fiction-Boris-Johnsons-father-pens-Brexit-thriller.html"}
