{"authors":["Brian Lee For Mailonline"],"date_download":"2018-10-22 22:57:05","date_modify":"2018-10-22 22:57:05","date_publish":"2016-01-29 10:24:27","description":"Man United are the first team through to the fifth round of the FA Cup after Daley Blind and Juan Mata came to the rescue at Derby. Find out who we reckon will join them... and make some money","filename":"data/vaneerConsumption/FACupbettingguidewiththebestoddsonTottenhamLiverpoolagainstWestHamandtherestofthetoptipsforthefourthround.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/309BA95100000578-0-image-a-4_1454077994440.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420569_Derby-County-vs-Manchester-United-FA-Cup-betting-guide-plus-best-odds-Tottenham-Liverpool-against-West-Ham-rest-tips_1540249025.html","title":"FA Cup betting guide with the best odds on Tottenham, Liverpool against West Ham and the rest of the top tips for the fourth round","title_page":"FA Cup betting guide with the best odds on Tottenham, Liverpool against West Ham and the rest of the top tips for the fourth round | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United are the first team through to the fifth round of the FA Cup after Daley Blind and Juan Mata came to the rescue at Derby.\nWayne Rooney was fortunate he wasn't done for offside before curling home a superb opener but everyone who backed him at 9/2 for the first goal will be glad the flag stayed down.\nGeorge Thorne levelled the England captain's strike as Derby threatened to make a game of it but class shone through as the United players, who were a best-priced even money to win, eased the pressure on manager Louis van Gaal in front of the BBC cameras.\nJuan Mata (centre) put the lid on Manchester United's FA Cup fourth-round win at Derby County\nThe victory eases the pressure on United boss Louis van Gaal\nBEST BETS OF THE WEEKEND Homes: Arsenal, West Brom, Wigan, Leyton Orient, Wimbledon 12/1 Paddy Power Aways: Tottenham, Man City, Hull, Birmingham 11/1 Sky Bet Draws: Huddersfield vs Cardiff, Swindon vs Barnsley, Kilmarnock vs Hamilton around 40/1 Both teams to score: Liverpool vs West Ham, Portsmouth vs Bournemouth, Bolton vs Leeds, Swindon vs Barnsley, Rangers vs Falkirk 18/1 Bet Victor\nBT Sport take over the telly duties on Saturday and Tottenham's trip to Colchester kicks things off at lunchtime.\nColchester slipped to the foot of League One without kicking a ball when midweek results went against them and the only games they've won since late October were FA Cup ties - against Wealdstone, Altrincham and Charlton.\nThe big hitters will steam in to the 2/5 for an away victory but Paddy Power's 11/4 for Spurs to win giving away two goals on the handicap is the one for us.\nLiverpool against West Ham in the teatime kick-off is an interesting one and not just because of Jurgen Klopp.\nSpurs were back home after a training break in Barcelona as they prepared for League One Colchester\nFA CUP ODDS (best available) 5/1 Man City, 11/2 Arsenal, Chelsea, 8 Man United, 12 Liverpool, 14 Spurs, Everton 25 Crystal Palace, 33 West Ham, 40 Stoke, Watford Click HERE for the full list\nThe Liverpool boss lost his specs against Norwich and his rag against Stoke and it could be another eventful 90 minutes for him when the Hammers arrive on Merseyside.\nKlopp's side leaked four goals to Norwich, yes Norwich, in an epic win last weekend and their defence was far from impressive as they sneaked through to the League Cup final after a penalty shootout against the Potters.\nKlopp likes his music but he wasn't about to burst into Queen's Bohemian Rhapsody when shouting 'Mama' during the semi. Mamadou Sakho was getting a blast from his manager and Alberto Moreno was also on the receiving end as Klopp got a bit crazy on the touchline.\nHe won't have solved the problems in a few days so it's hard to see West Ham not scoring. They're 31/10 with Bwin, Liverpool are 21/20 with Bet Victor and Coral, while several firms have Slaven Bilic's side, who have won 3-0 and 2-0 against Saturday's opponents already this season, at 7/4 to win, draw no bet.\nLiverpool players were celebrating in midweek as they reached the final of the Capital One Cup\nJurgen Klopp wasn't always all smiles on Tuesday night though as his defence gave him some hairy moments\nAston Villa against Manchester City and Crystal Palace at home to Stoke are the other all-Premier League ties and Manuel Pellegrini's men, already heading to Wembley after seeing off Everton in the Capital One Cup on Wednesday night, should stay on track for four trophies this season. They're 200/1 with Sky Bet to win the Champions League, Premier League, FA Cup and League Cup, 7/1 for the two domestic cups and 16s for three pots, falling short in the European Cup. The Premier League and League Cup double is 9/4.\nElsewhere, for all the FA Cup romantics, Burnley (8/1) at Arsenal and Colchester (9/1) at home to Spurs are the biggest prices in round four - but the City Ground looks a better bet for an upset as Nottingham Forest (2/1) host Watford.\nPortsmouth look set to be roared on by their biggest home crowd since they played Southampton in 2011 and you can get 21/10 at Bet Victor they beat Bournemouth while the Cherries are 7/5.\nBuying money, if you can afford it\nSportsmail's Martin Samuel pointed out this week that in the years England has been sending four representatives to the Champions League, since the end of the 2001-02 campaign, no team in the top four with 15 games to go has suffered the 10-point swing it would take for Leicester to be caught by Manchester United in fifth. The bubble is showing no sign of bursting and talk of a collapse is not even a whisper now. Another one for the big hitters - the Foxes are 4/9 to qualify for Europe's top table... Sky Bet, according to our pals at oddschecker.com, were offering 1000/1 on the opening day of the campaign.\nPardew takes a punt\nCrystal Palace manager Alan Pardew has gambled on Emmanuel Adebayor. The former Arsenal, Real Madrid and Manchester City striker has been a free agent for five months since leaving Spurs but it's time to get off Instagram and back on the pitch. His selfies show he's kept in shape but can he remember where the net is? It's 9/4 with Paddy Power he scores a debut goal against Stoke.\nEmmanuel Adebayor has signed for Crystal palace - he's 9/4 for a goal on his debut against Stoke","url":"https://www.dailymail.co.uk/sport/football/article-3420569/Derby-County-vs-Manchester-United-FA-Cup-betting-guide-plus-best-odds-Tottenham-Liverpool-against-West-Ham-rest-tips.html"}
