{"authors":["Associated Press"],"date_download":"2018-10-23 00:06:37","date_modify":"2018-10-23 00:06:37","date_publish":"2016-01-11 08:29:42","description":"President Barack Obama has generally had trouble getting Congress to act on his State of the Union proposals over the years. Some notable examples: 2010: Oba...","filename":"data/vaneerConsumption/FailedStateoftheUnionproposalsthroughtheyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:cb5981b9914840339d7211dac0edc932-48qEJGFphM8d437f0aaf92259613-823_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393536_Failed-State-Union-proposals-years_1540253197.html","title":"Failed State of the Union proposals through the years","title_page":"Failed State of the Union proposals through the years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Failed State of the Union proposals through the years\nPresident Barack Obama has generally had trouble getting Congress to act on his State of the Union proposals over the years. Some notable examples:\n2010: Obama called on Congress to pass an energy bill in which the government would cap how much carbon dioxide companies could emit. The effort died in the Senate after Republicans successfully cast the proposal as a \"cap-and-tax\" that would cost jobs.\n2011: Obama called on Congress to get rid of tax loopholes benefiting individual companies and industries so that the additional revenue generated could be used to offset a lower corporate tax rate without adding to the deficit. But one company's loophole is another's necessity. The result so far is no reduction in the corporate tax rate.\nFILE - In this Jan. 20, 2015, file photo, President Barack Obama gives his State of the Union address before a joint session of Congress on Capitol Hill in Washington as Vice Presient Joe Biden and House Speaker John Boehner listen. (AP Photo/J. Scott Applewhite, File)\n2012: The president called for giving millions of homeowners the opportunity to refinance their mortgages at historically low rates. The program's cost would be covered by a fee on large financial institutions. The bills never made it out of congressional committees.\n2013: Saying that business, labor and law enforcement wanted it, Obama said \"now is the time\" for comprehensive immigration reform. He made the same call the year before. It hasn't happened.\n2014: \"Say yes. Give America a raise,\" Obama said in calling for a minimum wage of $10.10 an hour. And with the war in Afghanistan ending, he called for Congress to lift restrictions on transferring prisoners from Guantanamo Bay in Cuba. Neither initiative was approved.","url":"https://www.dailymail.co.uk/wires/ap/article-3393536/Failed-State-Union-proposals-years.html"}
