{"authors":[],"date_download":"2018-10-22 22:10:29","date_modify":"2018-10-22 22:10:29","date_publish":"2014-06-09 01:58:59","description":"Unfavorable winds have forced NASA to call off the launch of its saucer-shaped Low-Density Supersonic Decelerator for the fourth time in a week.","filename":"data/vaneerConsumption/FailuretoLaunchNASAsFlyingSaucerStaysGrounded.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2015_23/482786/140602-coslog-saucer_96690b0d68009d9fd40e21d08c4f0c97.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_failure-launch-nasas-flying-saucer-stays-grounded-n125911_1540246229.html","title":"Failure to Launch: NASA's Flying Saucer Stays Grounded","title_page":"Failure to Launch: NASA's Flying Saucer Stays Grounded","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Wind conditions have been the prevailing factor in the launch delays,\" NASA spokeswoman Shannon Ridinger said in an email on Sunday.\nThe 15-foot-wide LDSD is supposed to be launched by a helium balloon to a height of 120,000 feet, and then blasted up to 180,000 feet by a solid-fueled rocket engine. As it descends at supersonic speeds, it would inflate an \"inner tube\" device to increase its diameter to 20 feet. The resulting atmospheric drag should slow the descent enough for the deployment of a super-strong parachute.\nA more advanced version of the device could be used to help land multi-ton payloads on Mars. But for this test, NASA wants the LDSD prototype to fall into the Pacific Ocean — and that means upper-level winds have to blowing out to sea rather than inland. So far, the winds have been blowing in the wrong direction.\nNASA spokesman David Steitz told NBC News that the current wind pattern appears to be anomalous.\n\"The LDSD team examined the weather records of PMRF [the Pacific Missile Range Facility] during the past two years, day-by-day, to pick the optimal time of year for cooperative atmosphere and winds,\" he wrote in an email. \"This year, however, Mother Nature appears to have new plans for the winds over Hawaii.\"\nAfter Wednesday, the team has one more opportunity on the schedule, on June 14. For additional background on NASA's flying saucer, take a look at last week's preview. And to find out which way the winds are blowing, check out the LDSD project's website or follow @NASA_Technology on Twitter.","url":"https://www.nbcnews.com/science/space/failure-launch-nasas-flying-saucer-stays-grounded-n125911"}
