{"authors":[],"date_download":"2018-10-30 19:45:22","date_modify":"2018-10-30 19:45:22","date_publish":"2018-08-13 18:18:00","description":"“City of AtIanta lives forever.”So read the first post by the new satirical Facebook page for the city of Atlanta, which replaced the last page after it was taken down following a prank about the “implosion” of the Confederate carving on Stone Mountain.","filename":"data/vaneerConsumption/FakeCityofAtlantaFacebookpagebackafterStoneMountainprank.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/07/04/Images/newsEngin.22457897_Governor_Candidate_Confeder.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_fake-city-atlant_0359e58362982fc9b252ff2c729363cf__1540928722.html","title":"Fake ‘City of Atlanta’ Facebook page back after Stone Mountain prank","title_page":"Fake ‘City of Atlanta’ Facebook page back after Stone Mountain prank","title_rss":"NULL","source_domain":"ajc.com","text":"“City of AtIanta lives forever.”\nSo read the first post by the new satirical Facebook page for the city of Atlanta, which replaced the last page after it was taken down following a prank about the “implosion” of the Confederate carving on Stone Mountain.\nThe page, which has poked fun at the city for nearly two years, was down only a few days after creating an event page for the implosion. Ben Palmer, a comedian who runs the page, posted that the monument, which he called a “symbol of white supremacy,” was set to blow last Sunday.\nIt was obviously a joke. The monument isn’t even in the city of Atlanta.\nTo come back, the page had to make a slight shift in name: From “City of Atlanta” to “City of AtIanta, GA.”\nREAD: Was it fear — or recklessness — that took down Jason Spencer?\nREAD: How long will DeKalb dad get for drowning autistic son, 10?\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nPalmer went quickly back to work last week.\nHe announced that the city would fly flags at half-staff in honor of the original page. Then he announced the latest plan for Stone Mountain, this time as a “reconstruction” rather than an implosion.\n“Join us as we redesign America's largest Confederate monument!” the event page said. “Celebrate with us as we deconstruct a symbol of white supremacy and replace it with a large peach.”\nThe event was scheduled for this past Sunday. It didn’t happen.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/fake-city-atlanta-facebook-page-back-after-stone-mountain-prank/diaWZG8X8PqLMP6vJw4aLJ/"}
