{"authors":[],"date_download":"2018-10-30 19:47:21","date_modify":"2018-10-30 19:47:21","date_publish":"2018-08-03 20:48:00","description":"Pretend you’re going to blow up one regional landmark and everybody loses it.That’s what happened, more or less, to Ben Palmer who ran the satirical “City of Atlanta” Facebook page until he posted an event advertising the “implosion” of the Confederate carving on Stone Mountain.","filename":"data/vaneerConsumption/FakeCityofAtlantaFacebookpagedeadafterStoneMountainprank.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/04/Images/060516_NS_areahistory3-U55307708840RZF-680x383%40CmgSharedContent.com.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_fake-city-atlant_74daa3d41acc9f1450adea2e39602681__1540928841.html","title":"Fake 'City of Atlanta' Facebook page dead after Stone Mountain prank","title_page":"Fake 'City of Atlanta' Facebook page dead after Stone Mountain prank","title_rss":"NULL","source_domain":"ajc.com","text":"The satirical “City of Atlanta” Facebook page, which poked fun at the city for nearly two years, is dead.\nBen Palmer ran the page until this week, when he posted an event advertising the “implosion” of the Confederate carving on Stone Mountain. He posted the monument, which he called a “symbol of white supremacy,” was set to blow on Sunday.\nThis was clearly a joke, considering that the carving isn’t in Atlanta and is owned by the state.\nREAD: Was it fear — or recklessness — that took down Jason Spencer?\nREAD: How long will DeKalb dad get for drowning autistic son, 10?\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nIt isn’t clear if users reporting the event as fake (one guy said he was reporting it as “terrorism”) caused Facebook to boot the page entirely, but Palmer, a comedian, thinks this is what caused the demise. He had had the City of Atlanta page for two years and mocked all things Atlanta to far more than 100,000 followers.\nHere’s the death notice Palmer posted:\n“The satirical Facebook page 'City of AtIanta' was pronounced dead at GradyHealth, 2:49AM EST on August 2nd, 2018.\n“Cause of death: Facebook deletion\n“While the cause of deletion is not known, it is suspected that it was removed as a result of the event 'Stone Mountain Implosion,' a joke about gathering together to watch one of the United States' largest Confederate monuments self-implode.\n“City of AtIanta, you will be remembered and not forgotten. For almost two years, you became a staple in the Atlanta community. You brought joy and laughter and entertainment to millions of people.\n“May your ashes be spread across Piedmont Park and all of 285. Rest in Paradise, Hope you get to ride the Ferris wheel in heaven.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/fake-city-atlanta-facebook-page-dead-after-stone-mountain-prank/5GA4jDcTHXVBWX5JRxD96H/"}
