{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:45:56","date_modify":"2018-10-30 19:45:56","date_publish":"2017-01-08 18:08:09","description":"The New York Times encourages an effort to \"destroy\" the company by appealing directly to advertisers not to support the website.","filename":"data/vaneerConsumption/FakeNewsPlusFascismNewYorkTimesUrgesBoycottofBreitbart.json","image_url":"https://media.breitbart.com/media/2016/10/FullSizeRender.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_08__1540928756.html","title":"Fake News Plus Fascism: New York Times Urges Boycott of Breitbart","title_page":"Fake News Plus Fascism: New York Times Urges Boycott of Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In two op-ed articles for the New York Times‘ Sunday Review, the Gray Lady attacks Breitbart News and its founder, Andrew Breitbart, and encourages an effort to “destroy” the company by appealing directly to advertisers not to support the website.\nOne article, “How to Destroy the Business Model of Breitbart and Fake News,” written by someone actually called “Pagan Kennedy” (was “Antichrist Roosevelt” not available?) celebrates the flagging effort of anonymous Twitter trolls who have tried to target and intimidate companies whose ads appear alongside Breitbart News articles, via third party platforms.\nThese would-be censors of the totalitarian left have decided that since they cannot defeat conservative views and arguments on the merits, they would prefer to eliminate them.\nThe Times, which prides itself as a guardian of free speech and press freedom, gives its backing to this (unsuccessful) campaign with nearly 2,000 words of space. The article includes instructions on how to join the anti-Breitbart effort, copied verbatim — “Step 1… Step 2…” — from the anonymous activists’ Twitter page.\nAnd Breitbart News, the “biggest fish,” is not the last intended target: the group declares that it “would like to broaden its campaign to take on a menagerie of bad actors.”\nEvidently it is very important to the Times that this failing, and anti-democratic, effort to censor Breitbart News be shored up, because it has allowed several embarrassing factual errors and omissions into the article which undermine both the credibility of the “Pagan” author and the so-called “paper of record” itself:\n“Donald J. Trump … has hired the former editor of Breitbart as his senior adviser.” Stephen K. Bannon is not a former editor. He has been the company’s Executive Chairman. (A simple Google search would have sufficed to check.)\nStephen K. Bannon is not a former editor. He has been the company’s Executive Chairman. (A simple Google search would have sufficed to check.) “Neo-Nazi.” The Times uses this term twice, without offering any proof (there is none) that Breitbart News qualifies. In fact, Breitbart News has a Jerusalem bureau and is one of the most avidly pro-Israel websites in the United States.\nThe Times uses this term twice, without offering any proof (there is none) that Breitbart News qualifies. In fact, Breitbart News has a Jerusalem bureau and is one of the most avidly pro-Israel websites in the United States. “This struggle is about much more than ads on Breitbart News — it’s about using corporations as shields to protect vulnerable people from bullying and hate crimes.” The implication is that Breitbart News is responsible for “bullying and hate crimes.” There is not one example to prove this defamatory, and inflammatory, accusation.\nThe implication is that Breitbart News is responsible for “bullying and hate crimes.” There is not one example to prove this defamatory, and inflammatory, accusation. “I couldn’t believe that these progressive companies were paying Breitbart News.” None of the companies are paying Breitbart News. The article misstates how Internet advertising works — and the Times apparently approves.\nNone of the companies are paying Breitbart News. The article misstates how Internet advertising works — and the Times apparently approves. “In November, NPR reporters interviewed Jestin Coler about his fake-news empire.” The Times includes a story about an actual fake news website without revealing Coler is a left-wing activist who wants to embarrass conservatives.\nSpeaking of “fake news,” the New York Times is a prime exemplar of the genre, having manufactured several stories with the clear intent of attacking and undermining conservatives, including but not limited to Breitbart News. A few recent examples:\nIn November 2016, the Times falsely claimed that Breitbart News is a “Birther” website, despite explicit evidence to the contrary. Despite several requests, the Times has refused to correct the slanderous article, for evidently political reasons.\nThat same month, the Times ran an article about “white nationalism” featuring a photograph of Bannon, despite a total lack of evidence to support the implication, and despite Bannon’s explicit statements that he is not a “white nationalist.”\nAlso in November, the Times accused Breitbart News of “calling attention to [Lena] Dunham’s Jewish faith,” saying that it “feels like a bone thrown to the site’s white nationalist readers.” The Times neglected to report that Dunham had posted a quote from a rabbi about observing “shiva,” the Jewish ritual of mourning, for Hillary Clinton’s loss. And the Breitbart News article — which was straightfoward coverage — was written by a black author, not a “white nationalist.”\nAs far as “hate” is concerned, the Times has published op-eds by avowed terrorists like Ahmed Yousef of Hamas, the anti-Jewish organization that is determined to kill as many Israeli civilians as possible to achieve its genocidal aims. It has also published the work of Russian president Vladimir Putin, who is the left’s bogeyman today, but who in 2013 the Times wished to help reach a wider audience, the better to stop U.S. intervention in Syria and to attack American exceptionalism.\nIn a second Sunday op-ed, “The Tea Party and the Art of the Mean Joke,” British travel writer Jonathan Raban concocts a twisted recollection of the Tea Party convention in Nashville in 2010 to explain, so he claims, the origins of Trump’s rhetorical style.\nRaban claims, erroneously, that Tea Party activists were dreaming of a politically incorrect “strongman” — a ridiculous and false claim, given the ambivalence of the Tea Party movement about political leaders in general (even their own).\nHe goes on to claim that Trump “inherited the mantle of speaking in public like a well-oiled barfly from the man who turned out to be the star of the Nashville show: Andrew Breitbart, founder of the eponymous right-wing media outlet.”\nEvidently Trump’s long public record has eluded Raban, who argues that Trump learned his craft from Breitbart: “The president-elect has the blunt pugnacity of the Breitbartian style. Like his tweets, his policy statements have the brutal concision of jokes.”\nRaban goes on to compare Trump — and, by implication, Breitbart — to a Latin American dictator: “I once heard Jorge Luis Borges talk about how dictators relished cruel jokes as demonstrations of their power,” he says, relishing this bit of recalled armchair political philosophy as some kind of proof.\nIn fact, in his lifetime — as Trump’s many detractors were wont to point out during the election — Andrew Breitbart had criticized Trump at times. (One area where Trump earned Andrew Breitbart’s praise: his ability to see through the media’s pretenses.)\nBut again, never mind the facts. Raban describes Breitbart as a “street-smart bully,” exactly inverting Breitbart’s character.\nAndrew stood up to bullies, and relished nothing more than confronting the bullies in the mainstream media — such as propagandists like Raban, who descend from upon high to pour scorn on the little people of Nashville, tut-tutting their naïve effort at grass-roots democracy as a kind of nascent fascism, making up fake historical “facts” they expect no one will dare to challenge.\nSix years later, the little people of Nashville have finally won something, and the New York Times cannot stomach its loss.\nSo it has attacked Breitbart News in an attempt to “destroy” it. There is no greater accolade than to be considered the Times‘ greatest enemy. But one expects something more effective — and more principled — from such a formerly august institution.\nSadly, the Times has decided to go the fascist route, urging the destruction of its most effective conservative competitor, using “fake news” to make the case for censorship to its credulous left-wing readership. It is an effort as illiberal as it is futile.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2017/01/08/new-york-times-aims-breitbart-misses-badly/"}
