{"authors":[],"date_download":"2018-10-30 21:29:33","date_modify":"2018-10-30 21:29:33","date_publish":"2017-02-07 17:20:00","description":"Falcons cornerback Desmond Trufant said he’s optimistic he will be ready to participate in the...","filename":"data/vaneerConsumption/FalconsTrufantaimingtobehealthyforMaypractices.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/07/Images/newsEngin.17550785_112816-falcons-photos-CC33.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_falcons-tru_93b6497509c730872a4f96437d7dd50c__1540934973.html","title":"Falcons’ Trufant aiming to be healthy for May practices","title_page":"Falcons’ Trufant aiming to be healthy for May practices","title_rss":"NULL","source_domain":"ajc.com","text":"Falcons cornerback Desmond Trufant said he’s optimistic he will be ready to participate in the team’s offseason practices in May following pectoral surgery in December.\n“I should be,” Trufant said Tuesday. “We will see how it goes. The training staff, they’ve got a plan for me. I’m just following that. I know that when it’s time for that first game, I’m going to be better.”\nThe Falcons placed Trufant on injured reserve Nov. 29 and, soon after, he had surgery to reattach his left pectoral at the point where it attaches to his shoulder. Dr. Luga Podesta, the director of sports medicine at St. Charles Orthopedics, said the surgery typically requires six months of recovery.\nTrufant suffered the injury during a game at Tampa Bay on Nov. 3. The Falcons kept Trufant on the active roster for nearly a month with the hope he could rehabilitate the injury and return to play late in the season.\nTrufant said he “played it slow” with the rehabilitation during the early stages. He said the plan is to increase his workload at the end of this month.\n“It’s coming along good,” Trufant said. “I’m working out, rehabbing. Every day I am doing a little more. Just taking it one day at a time. I feel better every day so I’m going to be better when I get back. I can already feel it.”\nTrufant, 26, is one of the Falcons’ top defensive players. The team selected him in the first round of the 2013 draft and he developed into their top cover man as a rookie. By his second season opponents rarely tested Trufant and he was voted to his first Pro Bowl in 2015.\nTrufant finished the final year of his contract in 2016, but the Falcons can pick up an $8.03 million option for 2017. Falcons general manager Thomas Dimitroff said Tuesday that the team plans to work out a contract extension with Trufant soon.\nTrufant was having another strong season when he went down with the injury.\n“I feel like I’m going to be better as a player, as a person,” he said. “I learned a lot from watching. It just added even more hunger. I was already a hungry player. I already had that chip on my shoulder but it’s even more now. I’m excited for the future.”","url":"https://www.ajc.com/sports/football/falcons-trufant-aiming-healthy-for-may-practices/szUKOSowkuHO0JRcJoOa0I/"}
