{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:43","date_modify":"2018-10-23 05:01:43","date_publish":"2016-01-29 20:43:11","description":"DALLAS (AP) — Chevron suffered its first money-losing quarter since 2002 in the final three months of last year, as plunging crude prices chopped more than o...","filename":"data/vaneerConsumption/FallingoilpricespushChevrontofirstlosssince2002.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:0d7b1efdac4b82a60c0566c5d74a3e0f-3bmscybNe842cce83474b59b3e91-398_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423410_Falling-oil-prices-push-Chevron-loss-2002_1540270903.html","title":"Falling oil prices push Chevron to first loss since 2002","title_page":"Falling oil prices push Chevron to first loss since 2002 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Falling oil prices push Chevron to first loss since 2002\nDALLAS (AP) — Chevron suffered its first money-losing quarter since 2002 in the final three months of last year, as plunging crude prices chopped more than one-third from its revenue.\nOil traded this month at levels not seen since 2003, although it has rebounded slightly in the last few days. Cheaper energy is great for consumers, who save with every fill-up, but oil-producing nations and big exploration companies like Chevron and Exxon are paying the price.\nChevron is cutting spending, laying off workers, and looking to sell even more of its assets. The problem with that strategy: It's a buyer's market right now for oil facilities, with too many for-sale signs.\nFILE - This Aug. 20, 2012, file photo, shows a Chevron sign in Miami. Chevron Corp. reports financial earnings on Friday, Jan. 29, 2016. (AP Photo/Alan Diaz)\nThe company has sold off $11 billion worth of facilities such as pipelines over the past two years and hopes to raise up to $10 billion more with sales through 2017. Company executives say, however, that they won't unload assets at fire-sale prices just to get rid of them.\nOil prices are down because growth in demand has slowed and cannot absorb a glut of oil on the market. On a conference call with analysts, Chevron CEO John Watson said he thinks energy demand will grow but that supply is a wild card.\nWatson pointed to forecasts that predict increasing cuts in production by non-OPEC nations could restore the market to balance this year. But until that happens, he said, prices will stay low \"and the financial damage to the energy sector seen in 2015 will continue.\"\nWatson said Chevron is managing through the downturn by cutting spending and investment — it cut fourth-quarter spending by about $9 billion compared with a year earlier. He said the company will finish projects under construction but won't start new long-term projects and will be judicious with short-term ones.\nSan Ramon, California-based Chevron Corp. reported Friday that it lost $588 million in the fourth quarter. That compares with Chevron's profit of $3.47 billion in the same quarter a year earlier, when the slump in oil prices was in its early stages.\nThe loss amounted to 31 cents per share, and surprised Wall Street. The 22 analysts surveyed by FactSet expected, on average, a profit of 45 cents per share, and 10 analysts surveyed by Zacks Investment Research called for 48 cents per share. Chevron does not adjust its results based on one-time events such as asset sales.\nThe loss was concentrated in Chevron's exploration and production business, but even the refining side earned less money due to asset sales.\nRevenue plummeted 37 percent, to $29.25 billion, although that still beat expectations — the average forecast in the FactSet survey was $27.65 billion.\nThe company got $35 for every barrel of oil and other liquids, compared with $66 a year before. Natural gas prices also fell. Even with falling prices, Chevron boosted production of oil and gas by 3.5 percent.\nFor the year, Chevron earned $4.59 billion, or $2.45 per share, on revenue of $138.48 billion. It is the second-largest U.S. oil company behind Exxon Mobil Corp.\nNext week, Exxon Mobil will report earnings. Analysts are expecting it to post a profit of 64 cents a share, less than half of what it earned a year ago.","url":"https://www.dailymail.co.uk/wires/ap/article-3423410/Falling-oil-prices-push-Chevron-loss-2002.html"}
