{"authors":["Will Martin"],"date_download":"2018-10-31 00:25:26","date_modify":"2018-10-31 00:25:26","date_publish":"2018-07-10 00:00:00","description":"BI PRIME: An oft held view in the markets is that when a recession is approaching, one of the first signs that things are starting to go downhill will be a substantial and sustained fall in the stock market.","filename":"data/vaneerConsumption/FallingstockpricesdonotpredictrecessionsMacquariesays.json","image_url":"https://amp.businessinsider.com/images/56d61b998d3eae6b18ff31ca-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_falling-stock-prices-do-not-predict-recessions-macquarie-says-2018-7_1540945526.html","title":"Falling stock prices do not predict recessions, Macquarie says","title_page":"    Falling stock prices do not predict recessions, Macquarie says - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Spencer Platt / Getty Images\nWhen a recession is approaching, one of the first signs that things are starting to go downhill will be a substantial and sustained fall in the stock market. Or so the received wisdom goes.\nNew research from Australian investment bank, Macquarie, however, found that while its true to say stock markets tend to witness big falls around and during recessions, there's no real pattern to how they do it — and that, generally speaking, markets fall more during recessions than they do before the start.\nHere's Macquarie's chart:\nMacquarie\n\"As one would expect, we find that equity prices have historically declined significantly around recessions (as defined by the NBER). However, we find no clear pattern as to the behaviour of equity prices in the lead-up to recessions,\" Macquarie's team of Ric Deverell, Hayden Skilling, and David Doyle wrote to clients.\n\"We also show that, while the equity market typically declines somewhat from its peak around a recession, most of the decline occurs after the recession has begun,\" the continued.\nNot only do equities not follow a pattern of decline before recessions, but they have also completely mispredicted recessions several times in recent decades. Macquarie points to several clear examples of major stock market falls from a peak — a widely watched recession indicator — where no recession has actually followed.\n\"Using a sharp decline in equity prices as an indicator of a forthcoming recession has produced several false signals, with equity market bear markets (declines of 20% or more) occurring in 1962, 1966 and 1987, for example, with no recession following,\" Deverell and his team said.\nFurthermore, Deverell and team argued, there is very little rhyme or reason to the timing peak of a stock market before a recession.\n\"In the 11 post-war recessions, the equity market has peaked (limited to the previous three years) between 1 month and 29 months before the recession, with a median lead of 9 months,\" they wrote.\n\"However, this does not account for the numerous false signals exhibited by equity market peaks taking place between recessions.\"\nHere's the chart:\nMacquarie\nMacquarie's conclusion is that while there are some links between falling stock markets and recessions, they are simply too inconsistent to reveal any particular patterns, and therefore, that using a dropping stock market as a recession indicator is ill-advised at best.\n\"While equity prices are likely to fall once a recession arrives, there is little historical evidence to suggest that equity markets lead recessions.\"\nNumerous banks and financial institutions are making early moves to protect themselves from what they see as an imminent downturn — partially because the stock market appears to near its peak — with Citi bank in particular warning last week that a \"full-on bear market\" and possibly a recession is just round the corner.\nMacquarie, thanks to its research, is a lot more optimistic, with Deverell and team saying they \"expect US growth to remain robust this year and next, adding that \"those looking to pre-position for recession may be moving too early.\"","url":"https://www.businessinsider.com/falling-stock-prices-do-not-predict-recessions-macquarie-says-2018-7"}
