{"authors":["Rob Stein"],"date_download":"2018-10-23 00:58:20","date_modify":"2018-10-23 00:58:20","date_publish":"2016-08-18 00:00:00","description":"Though they're generally safe, strollers and baby carriers are associated with thousands of trips to the emergency room for very young children. Falls are more common than you might think.","filename":"data/vaneerConsumption/FallsFromStrollersAndBabyCarriersCanCauseSeriousInjuries.json","image_url":"https://media.npr.org/assets/img/2016/08/18/stroller_wide-e4186080a00110c0b35fd4fdd634029f47d98957.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_08_18_490468692_falls-from-strollers-and-baby-carriers-can-cause-serious-injuries_1540256300.html","title":"Falls From Strollers And Baby Carriers Can Cause Serious Injuries","title_page":"Head Injury Increase Seen With Strollers And Baby Carriers : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Falls From Strollers And Baby Carriers Can Cause Serious Injuries\nEnlarge this image toggle caption Ghislain and Marie David de Lossy/Getty Images Ghislain and Marie David de Lossy/Getty Images\nWhen parents are trying to keep their children safe, one thing many of them do is transport their kids in a stroller or baby carrier.\nWhile strollers and carriers are generally safe when used properly, a new study is a reminder that even these devices can be dangerous, especially when parents don't use them properly.\nAlmost 361,000 children ages 5 and younger were treated in U.S. emergency rooms between 1990 and 2010 for injuries they suffered in connection with a stroller or carrier, according to the study published in the journal Academic Pediatrics.\nThat works out to about two children every hour, or about 50 a day, according to the analysis of data collected by the National Electronic Injury Surveillance System.\nMost of the injuries occurred when a child fell from the stroller or carrier or when the stroller or carrier tipped over.\n\"As parents we use these devices to transport our most precious cargo. And it's easy to look away just for a second. We want to encourage parents to always buckle their child into these devices and make sure they're properly restrained,\" says Kristin Roberts of the Center for Injury Research and Policy at the Nationwide Children's Hospital in Columbus, Ohio.\nMost of the injuries involved the child's head and face. While many were just bumps and bruises, one-quarter of the stroller injuries — and more than one-third of carrier injuries — resulted in traumatic brain injuries or concussions, the researchers found.\nThe proportion of stroller-related brain injuries doubled during the study period, increasing from 19 percent to 42 percent. The proportion of carrier-related brain injuries tripled, rising from 18 percent to 53 percent.\nThe increases don't necessarily mean strollers and carriers are becoming less safe, the researchers cautioned. It could be that doctors are becoming more aware of the seriousness of head injuries.\n\"We know that traumatic brain injuries can lead to long-term consequences on cognitive development,\" Roberts says. \"So we really want to make sure these injures are avoided.\"\nThe researchers also recommended that parents get a stroller or carrier that fits their child. Parents should never hang heavy items on a stroller's handles that can cause it to tip over.\nAnd make sure to lock the stroller's wheels when it is parked. Carriers should be kept as close to the ground as possible to minimize injuries if falls do occur, researchers say.","url":"https://www.npr.org/sections/health-shots/2016/08/18/490468692/falls-from-strollers-and-baby-carriers-can-cause-serious-injuries"}
