{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:41:25","date_modify":"2018-10-30 19:41:25","date_publish":"2016-06-07 03:34:49","description":"A shadowy anti-American jihadist is serving as the commander of the Iran-backed Shiite militia taking part in the offensive on Fallujah.","filename":"data/vaneerConsumption/FallujahShiiteAntiAmericanIraqiCommanderWorkingwithIranianGeneralSoleimani.json","image_url":"https://media.breitbart.com/media/2016/06/Jamal-Jaafar-Ibrahimi-Abu-Mahdi-al-Mohandes-getty-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_06__1540928485.html","title":"Fallujah: Shiite Anti-American Iraqi Commander Working with Iranian General Soleimani","title_page":"Fallujah: Shiite Anti-American Iraqi Commander Working with Iranian General Soleimani | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A shadowy anti-American Iraqi jihadist is currently serving as the most influential commander of the Iran-backed Shiite militia movement taking part in the offensive to retake Fallujah from the Islamic State (ISIS/ISIL), reports the Wall Street Journal (WSJ).\nJamal Jaafar Ibrahimi, primarily known by his nom de guerre Abu Mahdi al-Mohandes, is considered the right-hand man of the notorious Iranian Major-General Qassem Soleimani, head of Islamic Republic’s elite Quds Force that has long backed Shiite militias across the Middle East.\nThe Iran-backed Ibrahimi, who has a terrorist past and openly promotes the Iranian model of Shiite theocracy, has quickly risen to prominence in Iraq, making the United States nervous, according to the Journal.\nHe now serves as the commander of the Shiite-majority militia movement in Iraq known as the Popular Mobilization Forces (PMF), which receives support from Iran. Both Ibrahimi and Soleimani have American blood on their hands.\nSenior militia leaders and Iraqi officials are quoted by WSJ as saying: “The Iranian [Soleimani] draws up plans for military operations that Mr. Ibrahimi carries out in Iraq, and approves arms and ammunition deliveries from Iran to PMF factions… The two have been seen sitting together in makeshift command centers, poring over maps of Iraqi territory carried over by Mr. Soleimani from Tehran.”\nThe Journal reports:\nBehind the rise of a paramilitary force in Iraq credited with saving the country from Islamic State is an Iran-trained jihadist the U.S. wants far from the battlefield. A decade ago, the Iraqi known to U.S. officials as Jamal Jaafar Ibrahimi was in a cat-and-mouse game with U.S. forces and on the run from a Kuwaiti death sentence for allegedly orchestrating bombings at the American and French embassies there in the 1980s. The U.S. Treasury lists him as a terrorist…. The rise of the commander and the PMF reflect the new realities the U.S. government faces in Iraq, after withdrawing tens of thousands of troops more than four years ago. Iranian proxies that once posed the biggest danger to American troops have become, as the country’s strongest combat force, inadvertent partners in the fight against Islamic State.\nIt is no secret that Ibrahimi believes in the Iranian model of Shiite theocracy, reportedly said Mishaan Jbouri, a Sunni lawmaker in Iraq who considers the PMF commander as a personal friend. “He says he represents Ali Khamenei,” Iran’s supreme leader, noted the lawmaker.\n“Critics of the Obama administration say its aversion to deep military engagement in the Middle East allowed Iran to step in and rise to new prominence,” points out the Journal.\nIraq’s parallel army, the PMF, is at the forefront of the offensive to retake Fallujah from ISIS. The Iraqi army, backed by the United States and the Iran-allied PMF, launched the offensive on May 23.\n“The PMF’s role in the operation has already frightened and angered Fallujah’s Sunni residents, who fear the Shiite-led force will carry out revenge killings in a city that has long harbored Sunni extremists,” warns the Journal. “It has also electrified the country at large, cementing for many Iraqis the omnipresence of Iran and its affiliates in their country.”\n“Fighters in the PMF credit Mr. Ibrahimi for saving their country from a wider onslaught by Islamic State after it seized Mosul, the country’s second-largest city, in June 2014 and pushed toward Baghdad and Erbil, capital of the semiautonomous Kurdistan region in the north,” it adds.\nIbrahimi’s evolution from exile jihadist in Iran to a prominent commander in Iraq is a testament to how Tehran has filled security vacuums across the region with paramilitary fighters who follow its ideology, declares the newspaper.\nNevertheless, the Journal also reports:","url":"https://www.breitbart.com/national-security/2016/06/06/fallujah-shiite-anti-american-iraqi-commander-working-iranian-general-soleimani/"}
