{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 03:25:58","date_modify":"2018-10-23 03:25:58","date_publish":"2016-01-29 18:18:58","description":"Tanya Brown, sister of Nicole, and Fred and Kim, father and sister of Ron Goldman, have accused the TV series of minimizing the death of their loved ones and instead focusing on O.J. Simpson.","filename":"data/vaneerConsumption/FamiliesofmurderedNicoleBrownSimpsonandRonGoldmanhitoutatOJTVseries.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4977C00000578-0-image-a-52_1454090360846.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423099_Families-Nicole-Brown-Simpson-Ron-Goldman-hit-troubling-new-O-J-TV-series-saying-weren-t-consulted-producers_1540265158.html","title":"Families of murdered Nicole Brown Simpson and Ron Goldman hit out at O.J. TV series","title_page":"Families of murdered Nicole Brown Simpson and Ron Goldman hit out at O.J. TV series | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The families of murder victims Nicole Brown and Ron Goldman have hit out at the creators of the television series 'The People vs. O.J. Simpson' for not consulting them during filming.\nTanya Brown, the sister of Nicole, and Ron Goldman's father and sister, Fred and Kim, hit out at FX producers for taking attention away from their loved ones and placing it on Simpson instead.\nSpeaking to Dr Phil in an interview due to air on CBS on Monday, Fred Goldman branded the series 'troubling', saying it would replace the facts of the trial for viewers too young to remember it.\nFred and Kim Goldman (left), the father and sister of Ron Goldman who was one of the murder victims at the center of the O.J. Simpson trial, have hit out at a new TV series based on those events\nTanya Brown, the sister of Nicole Brown Simpson, who died alongside Goldman, also lashed out at producers for not consulting the families during filming, calling the decision 'shameful'\nHe said: 'A whole generation who never saw this take place is going to see this series and assume that everything is fact and that’s going to become the new reality and that’s very troubling to me.'\nNicole, O.J. Simpson's ex-wife, and Ron, a male model she was believed to have been dating, were found brutally murdered outside her California condo on June 13, 1994.\nSimpson was accused of killing the pair in a jealous rage and put on trial - after leading police on an infamous slow-speed chase - before being acquitted in what was dubbed the 'trial of the century'.\nMeanwhile Kim Goldman took issue with the fact that Ron and Nicole play no part in the series before they appear as dead bodies.\nFred Goldman (left) said he finds it 'troubling' that younger viewer who did not see the trial will accept its story as fact, while Kim (right) said directors minimized her brother's role by not featuring him except as a corpse\nJeffrey Toobin, author of the book on which the series was based, insisted that the series is respectful to the victims, adding that he chose to focus on the issue of race - rather than the tragedy of the killings\nShe accused the show's creators of downplaying the tragedy of their deaths by failing to show the people they were before they were murdered.\nShe said: 'I’m horrified that they’re not depicted in this docu-series and if the only way that they’re being depicted is dead bodies. I want people to know how brutally they lost their lives.'\nThe TV series, starring Cuba Gooding, Jr. as Simpson, David Schwimmer as Rob Kardashian, and John Travolta as Robert Shapiro, is based on a book by Jeffrey Toobin.\nTanya Brown hit out at the show's creators for not consulting her during production.\nShe added: 'Jeffrey Toobin, Travolta, Schwimmer, Cuba Gooding, shame on you guys, you should have called the families.'\nBrian 'Kato' Kaelin, the surfer living in Simpson's pool house at the time of the killings and an eventual witness for the prosecution, also disputes the way he is portrayed during the series\nHowever, Toobin rejected criticism of his narrative, saying: 'This is not a story about how the victims were unimportant; this is a story about how the process didn’t give those victims what they deserve.'\nHe said the show is a truthful portrayal of events that was made with great respect for the victims.\nHe added that the mini-series is focused on the importance of race and the justice system and is no way intended to undermine the families who have suffered greatly from the trial.\nMeanwhile Brian 'Kato' Kaelin, the surfer living in Simpson's pool house at the time of the killings, also appeared on Dr Phil to dispute how he is represented in the series.\nKaelin was initially called as a prosecution witness to establish a time when Simpson could have been out of his house long enough to kill Brown and Goldman.\nIn 1994, Nicole Brown Simpson, O.J's ex-wife (left, together), and Ron Goldman, a model assumed to be her boyfriend, were found dead outside her California condo\nSimpson was accused of killing the pair in a jealous rage (crime scene, pictured), arrested after leading police on a slow-speed car chase, and then acquitted of their murders after the 'trial of the century'\nHowever, after four days of rambling and inconsistent testimony he was declared a hostile witness and accused of helping the defense.\nMembers of the Brown family are not the only ones disappointed that they were no consulted during the filming of the series - after Simpson also bashed the producers for not contacting him.\nSpeaking from jail, where he is serving time for an armed robbery in Las Vegas in 2007, the now-67-year-old Simpson accused directors of 'not having the b***s' to speak to him.\nThe TV series, due to start on FX next week, sees Cuba Gooding Jr taking on the role O.J. Simpson\nMeanwhile John Travolta will play lawyer Robert Shapiro, and David Schwimmer will star as Robert Kardashian, another lawyer and close friend of O.J.\nSpeaking to the Dailymail.com, a prison friend speaking on condition of anonymity said: 'OJ is mad because he is being ignored.\n'He says they have created this soap-opera based on what other people are saying and what has been falsely reported in the papers, but nobody had the b***s to talk to him.\n'And he feels it will be just be a bunch of BS because nobody knows what really happened, but OJ. He's also resents that it's a payday for everyone else and it's his story.'\n'The People vs. O.J. Simpson' is a ten-part series which debuts on FX on February 2","url":"https://www.dailymail.co.uk/news/article-3423099/Families-Nicole-Brown-Simpson-Ron-Goldman-hit-troubling-new-O-J-TV-series-saying-weren-t-consulted-producers.html"}
