{"authors":["Tom Wyke For Mailonline"],"date_download":"2018-10-23 04:10:05","date_modify":"2018-10-23 04:10:05","date_publish":"2016-01-29 19:51:19","description":"The family of a British man who has gone missing in Amsterdam are appealing for help to find him after he disappeared four days ago.Richard Cole had been travelling from Copenhagen to Assen.","filename":"data/vaneerConsumption/FamilysfearsformissingRichardColewhovanishedinAmsterdamfourdaysago.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4F60600000578-0-image-a-17_1454095418839.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423304_Family-s-fears-missing-Briton-vanished-Amsterdam-four-days-ago-gone-drinking-people-d-just-met_1540267805.html","title":"Family's fears for missing Richard Cole who vanished in Amsterdam four days ago","title_page":"Family's fears for missing Richard Cole who vanished in Amsterdam four days ago | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The family of a British man who has gone missing in Amsterdam are appealing for help to find him after he disappeared four days ago.\nRichard Cole, 30, from Dursley in Gloucestershire, had been travelling from Copenhagen to Assen via the Dutch city.\nHis last known location was the Thorbeckeplein area of Amsterdam at about 2am UK time on January 25.\nMr Cole had been to some of the bars in the area before he spoke to his girlfriend, Alicia Marie, on the phone.\nRichard Cole, 30, from Dursley in Gloucestershire, had been travelling from Copenhagen to Assen via the Dutch city\nHe had been to some of the bars in the area before he spoke to his girlfriend, Alicia Marie, on the phone\nPolice in the Netherlands and Gloucestershire have both appealed for any information to help trace Mr Cole.\nA spokesman for Gloucestershire Police said: 'Richard is described as white, around 1m 83cm tall and of slim build.\n'He has short, dark-brown hair and could be wearing a shirt, jeans and a black Armani or Superdry jacket.\n'Richard is an experienced traveller and his family are concerned for his welfare.'\nHis mother, Debbie Thornhill, has set up a Facebook page called Help us find Richard Cole.\nShe wrote on the page: 'Thank you everyone for the support we have been given so far, but there has still been no news of Richard.\n'Please keep sharing his photo in the hope that someone in Amsterdam has seen him or knows where he may be.\nRichard Cole's last known location was the Thorbeckeplein area of Amsterdam at about 2am UK time on January 25.\nPolice in the Netherlands and Gloucestershire have both appealed for any information to help trace Mr Cole, who has been described as 'white, around 1m 83cm tall and of slim build with short, dark brown hair'\nAn appeal by the Dutch Police says there has been 'no trace' of Mr Cole since his last phone call\n'Richard is a very special person not only to his family but to all his friends.\n'Life would just not be the same without him. Please help us to keep searching for him.'\nMr Cole's girlfriend Alicia Marie told BBC's Victoria Derbyshire she spoke to Mr Cole in the early hours of January 25.\n'He had been out with some people that he just met, which is common for Richard - he's really friendly,' she said. 'I just said 'it's late, be careful, please go home, get a cab' and we got off the phone.\n'I texted him a picture of his address to show the cab but it never went through. I imagined that he turned off his phone, or his phone died. We just never heard from him.'\nAn appeal by the Dutch Police says there has been 'no trace' of Mr Cole since his phone call to Miss Marie.","url":"https://www.dailymail.co.uk/news/article-3423304/Family-s-fears-missing-Briton-vanished-Amsterdam-four-days-ago-gone-drinking-people-d-just-met.html"}
