{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:31","date_modify":"2018-10-30 19:55:31","date_publish":"2016-12-22 01:51:21","description":"Former 'The Voice' contestant Christina Grimmie was shot and killed while signing autographs for fans after a concert in June.","filename":"data/vaneerConsumption/FamilyofSlainPopSingerSuesGunFreeConcertVenue.json","image_url":"https://media.breitbart.com/media/2016/12/ChristinaGrimmieLawsuit.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_12_21__1540929331.html","title":"Family of Slain Pop Singer Sues 'Gun-Free' Concert Venue","title_page":"Family of Slain Pop Singer Sues 'Gun-Free' Concert Venue","title_rss":"NULL","source_domain":"breitbart.com","text":"The family of late pop singer Christina Grimmie has filed a lawsuit against the “gun-free” concert venue in which she was shot and killed on June 10, 2016.\nA former contestant on reality singing competition The Voice, Grimmie was killed by Kevin James Loibl in the Plaza Live Theater as she signed autographs after performing. Loibl took his own life thereafter and two Glock 9mm handguns were found on his person.\nAccording to ABC News, the Grimmie family’s suit alleges the theater had “negligent security.”\n“The owners of the facility in which she performed and the outside security company hired to provide security for the concert … failed to take adequate security measures to ensure the safety of the performers and the attendees at the concert venue,” the suit alleges.\nOn June 11, the Crime Prevention Research Center reported that the theater was a designated “gun-free” zone. Breitbart News previously reported that Loibl passed a background check for his firearms. Police investigating the attack said Loibl not only passed a background check for his guns but did not pick them up until after completing a waiting period required by Florida law.\n“We are hopeful that our lawsuit will bring widespread attention to the issue of concert security and safety and more effective safeguards will be implemented to protect performers and attendees at concerts around the U.S. in the future,” the family wrote in the suit.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/entertainment/2016/12/21/christina-grimmie-family-sues-gun-free-concert-venue-negligent-security/"}
