{"authors":["Laurel Rosenhall"],"date_download":"2018-10-30 22:48:30","date_modify":"2018-10-30 22:48:30","date_publish":"2016-04-27 08:00:00","description":"As anti-establishment fervor sweeps the nation this election season – forcing the son of a former president to abandon his campaign for the White House –","filename":"data/vaneerConsumption/FamilytiesrunstrongintheCaliforniaCapitol.json","image_url":"https://calmatters.org/wp-content/uploads/Arambula.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939710.html","title":"Family ties run strong in the California Capitol","title_page":"Family ties run strong in the California Capitol | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As anti-establishment fervor sweeps the nation this election season – forcing the son of a former president to abandon his campaign for the White House – a contrary trend has taken hold in the California Capitol: political dynasties are going strong.\nGov. Jerry Brown, the son of a former governor, has occupied the governor’s office longer than any governor in state history. And more children of legislators now serve in the Legislature than at any point in the last hundred years.\nEight current California lawmakers have a parent who served in the state Legislature. A ninth is the son-in-law of a former lawmaker. More family members could be elected this year, with the son of a state senator and the wife of an Assemblyman running for seats in the 120-person Legislature.\n“Politics is very much a family business,” said Jason Snyder, an assistant professor at the University of Utah who published a study on political dynasties in 2009.\nHis research of Congress found that family connections are more prevalent in elected office than in almost every other profession, including doctors, lawyers, plumbers and electricians.\n“Someone gets into a fortuitous position and part of the spoils of that are that they can pass it on,” Snyder said.\nName recognition, advice from a seasoned politician (usually called Dad) and a family ethos for public service have long helped the children of lawmakers get elected. Since the beginning of California statehood, some families have sent multiple generations to the statehouse.\nBut the trend here is increasing, said Alex Vassar, a legislative historian who writes the One Voter Project blog. He identified just 16 sets of parents and children who served in the California Legislature between the 1850s and early 2000s, noting that biographical details of many legislators who served prior to 1920 are hard to track. Since then, Vassar said, there hasn’t been a period with as many second-generation lawmakers as there is today.\nWhy?\nTerm limits could be a factor, with lawmakers elected between 1990 and 2012 limited to six years in the Assembly and eight in the Senate, triggering high turnover. The rising costs of running a campaign could also contribute, because the children of power players gain access to big donors, said Jessica Levinson, a professor at Loyola Law School. And declining civic engagement may play a role too.\n“A lot of people think they are voting for the parent,” Levinson said. “They see the last name and it’s very easy shorthand.”\nA cluster of family ties was evident as California’s newest legislator was sworn in earlier this month. Former Assemblyman Juan Arambula (D-Fresno) watched from the back of the chambers as his son, Assemblyman Joaquin Arambula (D-Kingsburg), took the oath of office. Playing small roles in the ceremony were Assemblymen Ian Calderon (D-Whittier) and Adam Gray (D-Merced) — son and son-in-law, respectively, of former legislators. When it was over, Assemblyman Kevin Mullin (D-South San Francisco) — son of a former assemblyman — stepped to the podium and led the house back to its normal course of business.\n“Having a father who’s been through it, he’s been able to show us what the path is,” the younger Arambula said after he was sworn in.\nKey advice from Dad? “He told me that coming up here is like swimming with sharks.”\nVideo: All in the family\nArambula was elected in an off-cycle election to fill a Fresno-area Assembly seat that became vacant when Henry Perea quit mid-term. The same pattern holds for his colleague, Assemblyman Sebastian Ridley-Thomas, son of a former legislator who was elected in a low-turnout special election in 2013. Now 28 years old, Ridley-Thomas is the Legislature’s youngest member.\n“Yes, having a parent can help significantly open doors, but you have to be able to walk through those doors,” Ridley-Thomas said.\n“Individuals have to have the right composition and a compelling narrative, in addition to having what amounts to a leadership brand or a political brand.”\nMost multi-generational public servants come from the same political party. One exception is Sen. Anthony Cannella, a Republican whose Democratic father served in the Legislature in the 1990s.\n“I benefited from his experience, of course,” the younger Cannella said. “But I certainly didn’t benefit from his connections because they were actively opposing me.”\nAlmost all the parents and children who have served in the California Legislature are fathers and sons. (Many sets of brothers have served too.) Assemblywoman Autumn Burke is the first woman to hold a second-generation spot in the statehouse. Her mother, Yvonne Brathwaite Burke, held several elected offices on and off for 50 years. And her godmother, actress Cicely Tyson, plays a Congresswoman helping her daughter run for office on the Netflix political drama “House of Cards.”\nBurke grew up commuting between Los Angeles and Washington, D.C., with her mom. Now she commutes between Los Angeles and Sacramento with her daughter Isabella, who is almost 2.\n“Hopefully,” Burke said, “she’ll be the third generation to be a legislator.”","url":"https://calmatters.org/articles/family-ties-run-strong-in-the-california-capitol/"}
