{"authors":["Associated Press"],"date_download":"2018-10-23 03:21:11","date_modify":"2018-10-23 03:21:11","date_publish":"2017-04-26 14:45:50","description":"COLUMBIA, S.C. (AP) - The family of a man shot 19 times by police in South Carolina watched a video of his killing and were left with almost as many...","filename":"data/vaneerConsumption/Familyseesvideoofpoliceshootingstillhasquestions.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447868_Family-sees-video-police-shooting-continue-lawsuit_1540264871.html","title":"Family sees video of police shooting, still has questions","title_page":"Family sees video of police shooting, still has questions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"COLUMBIA, S.C. (AP) - The family of a man shot 19 times by police in South Carolina watched a video of his killing and were left with almost as many questions as answers, their attorney said Wednesday.\nSolicitor Chip Finney showed the video to Waltki Williams' family Tuesday. Finney plans a 2 p.m. Wednesday news conference to announce whether he will charge the three Sumter Police officers.\nThe officers were trying to arrest Williams on Dec. 10 after his estranged girlfriend called 911 saying he had pointed a gun at her car at the Sumter Mall, police said at the time. Williams was shot 19 times, 17 of them in the back, attorney Carter Elliott said, citing the autopsy.\nWilliams' family were not shown all the body and dashboard camera video and the footage didn't include the audio either, making it harder to figure out exactly what happened in a few chaotic moments, Elliott said.\n\"It's still hard to understand how we went from a chase to him being shot 17 times in the back in 15 seconds, Elliott said.\nFinney also showed the family photographs of a gun in Williams' hand. Elliott's lawsuit said Williams was unarmed and the lawyer said in the video it doesn't appear Williams has anything in his hand when the chase begins.\nWilliams drove off after police confronted him at the mall, but wrecked and tried to run away, according to the wrongful death lawsuit filed by Williams' sister, Tomekia Kind, against the city of Sumter and its police force.\nSeveral officers tackled Williams and stepped back before at least three of them fired two dozen shots, according to the suit.\nElliott said the family plans to continue its wrongful death and excessive force lawsuit.\nInvestigators have released little information about the shooting, including the videos and the names of the officers involved.\nState police have been reluctant to release police shooting videos in South Carolina until cases are closed, even though First Amendment lawyers said there is no exemption to their release under the state's open records law.\n\"You can't see these videos until you file a lawsuit,\" said Elliott, who has handled a number of police brutality cases in South Carolina. \"It would be better if they just made them available.\"\n___\nFollow Jeffrey Collins on Twitter at http://twitter.com/JSCollinsAP\nHis work can be found at http://bigstory.ap.org/content/jeffrey-collins","url":"https://www.dailymail.co.uk/wires/ap/article-4447868/Family-sees-video-police-shooting-continue-lawsuit.html"}
