{"authors":["Katie Mchugh"],"date_download":"2018-10-30 22:16:03","date_modify":"2018-10-30 22:16:03","date_publish":"2015-07-21 20:21:29","description":"Susan Oliver recounted deputy Danny Paul Oliver's murder. He served in a \"sanctuary city\" that protected the illegals who killed him.","filename":"data/vaneerConsumption/FamiliesofLovedOnesKilledbyIllegalAliensTestifyatSenate.json","image_url":"https://media.breitbart.com/media/2015/07/Laura-Wilkerson-United-States-Senate.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_21__1540937763.html","title":"Families of Loved Ones Killed by Illegal Aliens Testify at Senate","title_page":"Families of Loved Ones Killed by Illegal Aliens Testify at Senate","title_rss":"NULL","source_domain":"breitbart.com","text":"Several Americans who’ve had loved ones murdered by illegal aliens are calling on the Senate to end sanctuary cities and are recounting the agonizing losses they suffered thanks to lax immigration enforcement.\nWitness Susan Oliver recounted, through tears, sheriff’s deputy Danny Paul Oliver’s violent murder. Oliver served in Sacramento County, a “sanctuary city” that protected the very illegals who killed him.\n“He put himself into harm’s way every time he put his uniform on. And on Friday, October 24, 2014, my husband and father of two approached a car on his beat, but this time, it was the last time,” said Oliver. “The last thing my husband attempted to do as a POP [Problem-Oriented Policing] officer was to ask the man inside the car how his day was going. But he never made it to the driver’s window.”\n“At about 10:30 a.m., that man was in the country illegal and armed with numerous illegal weapons. He aimed one out of the car from the parking lot of a Motel 6 at Sacramento and opened fire, killing my husband with a shot to the forehead,” she said with difficulty. “I can honestly say that not a day goes by where this has not effected me… Many people ask if I have gotten past that terrible day, and the answer is no.”\nA twice-deported illegal alien from Mexico shot and killed two Sacramento officers, both Oliver and Sheriff Michael Davis Jr., while injuring another officer and innocent civilian during an October 2014 rampage.\nHe gave authorities a fake name when arrested, Marcelo Marquez, but U.S. Immigration and Customs enforcement determined his real name was Luis Enrique Monroy-Bracamonte. He had been deported back to Mexico in 1997 and 2001.\nOliver criticized the administration’s release of thousands of dangerous criminal aliens who were unlawfully present in the country:\nEvery single day, law officers at the state, local, and federal level are forced to release criminal aliens who pose a threat to community safety—in violation of current laws that require deportation. Additionally, in the last two years, ICE released back onto the streets 76,000 convicted criminals who were in the country illegally. There are 169,000 criminal aliens at large in the United States right now who have criminal convictions and were formally and lawfully ordered deported, but remain here to commit other crimes… The Administration’s tolerance of sanctuary cities has also resulted in another 10,000 potentially deportable arrested aliens being released by local law agencies since January of last year… The man that killed my husband, Danny Oliver, was deported several times for various felonies… However, due to the lack of coordination between law enforcement agencies, he was allowed back into this country.\nOliver also noted that Monroy-Bracamonte eluded hundreds of officers on a six-hour, 30-mile crime spree.\n“My life is forever changed and saddened. Please help put policy in place to make sure that criminal immigrants who are in this country illegally are never allowed to dictate the life of true humanitarians like my husband, Deputy Danny Paul Oliver,” she concluded.\nWATCH:\nBrian McCann, brother of slain Denny McCann, testified next about the violent drunk driving hit-and-run that claimed his brother’s life.\n“Denny was crossing Kedzie Avenue on Chicago’s north side to visit a client of his,” said McCann. “And as he was crossing a walk, this kid [Saul] Chavez came by, drunk as a skunk, and dragged him for about a block and a half and killed him.”\nAlabama Sen. Jeff Sessions has noted that Cook County’s 2011 policy of refusing to hand over illegal aliens to federal authorities, a policy quietly endorsed by the Obama administration, had deadly consequences:\nThe Cook County Board of Commissioners passes an ordinance directing local law enforcement to refuse ICE detainer requests and access to individuals or County facilities. While ICE Director Morton acknowledges that the ordinance poses a serious threat to public safety and likely violates federal law, the Administration’s only action is to offer to pay Cook County to honor the detainers and to set up a “working group,” both of which the Board rejects. ICE’s Executive Associate Director of Enforcement and Removal Operations says the policy presents a major problem for enforcement efforts and is an “accident waiting to happen.” In June 2011, Saul Chavez, who had a prior DUI conviction, was driving with a blood-alcohol content of nearly four times the legal limit when he hits and kills 66-year-old William “Dennis” McCann. While attempting to escape, Chavez drove his car over McCann’s body, dragging him 200 yards before a witness stopped his vehicle. Chavez was charged with two felonies, and ICE issued a detainer asking Cook County to hold him until he could be taken into federal custody. But, pursuant to Cook County’s new anti-detainer law, he was released when he posted 10 percent of his $250,000 bail. He has since disappeared and is believed to have fled the country.\n“All eyes are both the Senate and the House Judiciary Committee. I am convinced this is where resolution rests, because these sanctuary jurisdictions are going to get away with literally murder, passing these policies, and you guys gotta do it,” McCann said.\nWATCH:\nNext came Michael Ronnebeck, uncle of Grant Ronnebeck, shot dead, allegedly by an illegal alien on January 22.","url":"https://www.breitbart.com/politics/2015/07/21/families-of-loved-ones-killed-by-illegal-aliens-demand-an-end-to-sanctuary-cities/"}
