{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 01:56:08","date_modify":"2018-10-23 01:56:08","date_publish":"2017-03-10 10:26:45","description":"Martin Lockett, 70, was flying back from Tenerife with family and friends when they became delayed, and is now fighting Monarch for compensation after the airline refused to pay out.","filename":"data/vaneerConsumption/Familydelayedfor26HOURSbeforeflyingtoWRONGairport.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22491000000578-0-image-a-3_1489142773562.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300622_Family-delayed-26-HOURS-flying-WRONG-airport_1540259768.html","title":"Family delayed for 26 HOURS before flying to WRONG airport","title_page":"Family delayed for 26 HOURS before flying to WRONG airport | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pensioner has told how he and his grandchildren were forced to sleep on airport floors and given just €6 each after their flight home was delayed by almost 26 hours.\nTo add insult to injury, when the family eventually boarded a plane back to the UK, it was to Birmingham - 90 miles south of their original destination of Manchester.\nMartin Lockett, 70, described the experience as horrendous, and said the group had to spend the night huddled on coats and towels on the cold, hard floor.\nMr Lockett was with a 20-strong group of his children, grandchildren and friends were returning home from a holiday in Tenerife in October when their ordeal began.\nMr Lockett's family are shown sleeping on the cold, hard floors of the airport as they wait for a flight back home to the UK\nWhen the family eventually boarded a plane back to the UK, it was to Birmingham - 90 miles south of their original destination of Manchester\n'It went wrong as soon as we boarded the plane,' Martin said. 'We were sat at the gate for four hours, we didn't even get a push-back.\n'The cabin crew told us that the plane had arrived with a fault, then the captain came on and said there was a problem with a generator.\n'We would be taken off the plane and a coach would come and pick us up and take us to overnight accommodation.\n'We went back into the airport and were left in the arrivals area, there were no coaches, no hotels, we were given a €6 voucher and left there overnight.'\nHe added: 'I'm 70 and I was sleeping on the cold hard floors with my grandchildren, the youngest of which is two.\nMartin Lockett (pictured) has told how he and his grandchildren were forced to sleep on airport floors and given just €6 after their flight home was delayed by almost 26 hours\n'We weren't even allowed access to our luggage to get medication for the children and my heart tablets.'\nBut things didn't end there for Martin and his group. When they went to the Monarch desk the next day to find out what was happening, they were told they weren't booked on a flight at all.\nMartin, a retired businessman from Crewe, Cheshire, added: 'The airport staff were so obnoxious, telling us we weren't booked on a flight back when Monarch were saying we were.\n'Eventually we got on a plane and ended up in Birmingham. It was seemed like it took forever and was so frustrating.\n'It was a shocking experience and we haven't had an apology let alone a penny.'\nMr Lockett was with a 20-strong group of his children, grandchildren and friends were returning home from a holiday in Tenerife in October when their ordeal began\nKevin Clarke, from Bott & Co Solicitors who are handling Martin's case, said: 'The law is very clear on this point.\n'Airlines are obliged to provide food, refreshments and overnight accommodation where necessary.\n'When you see the pictures of pensioners and children sleeping on airport floors it is clear why this law is in place - to protect passengers.\n'When airlines don't provide that basic care and courtesy you can understand why passengers are aggrieved and are determined to pursue that compensation.'\nAfter taking legal action against Monarch, Mr Lockett has now been awarded £349 compensation.\nThe rest of his party is likely to receive similar pay-outs - a potential total of £6,976.","url":"https://www.dailymail.co.uk/news/article-4300622/Family-delayed-26-HOURS-flying-WRONG-airport.html"}
