{"authors":[],"date_download":"2018-10-22 22:06:15","date_modify":"2018-10-22 22:06:15","date_publish":"2014-05-09 02:20:01","description":"A Fort Worth couple has filed a $1 million lawsuit against the vet who kept their dog Sid secretly alive for six months.","filename":"data/vaneerConsumption/FamilyFiles1MSuitAgainstVetWhoKeptPetSecretlyAlive.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/412406/140430-vet-animal-cruelty-2338_5f62ebc28dc9ae38ed64f7b5d89fe07b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_family-files-1m-suit-against-vet-who-kept-pet-secretly-n100991_1540245975.html","title":"Family Files $1M Suit Against Vet Who Kept Pet Secretly Alive","title_page":"Family Files $1M Suit Against Vet Who Kept Pet Secretly Alive","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Dallas-Fort Worth\nA Fort Worth couple has filed a $1 million lawsuit against the vet who kept their dog Sid secretly alive for six months after he was supposed to have been euthanized due to a diagnosed congenital spine defect.\nIn their lawsuit, Jamie and Marian Harris allege their vet, Millard Lucien \"Lou\" Tierce III, DVM, said he had discovered in an X-ray that the dog had a birth defect that could not be fixed.\nThe couple, after consulting with the vet, determined the best course of action for their 170-pound Leonberger was euthanasia.\nSix months later, the couple was tipped off by a vet tech at Tierce's clinic that Sid was being kept alive, caged in deplorable conditions and being used for blood donations.\nThe Harrises rushed to the clinic and retrieved their dog. As they left, they said Tierce tried to explain why he had kept the dog alive.","url":"https://www.nbcnews.com/news/us-news/family-files-1m-suit-against-vet-who-kept-pet-secretly-n100991"}
