{"authors":["John Hayward"],"date_download":"2018-10-30 20:36:56","date_modify":"2018-10-30 20:36:56","date_publish":"2015-07-24 03:14:30","description":"Family Claims Abdulazeez Not Radical, Religious, or a Terrorist","filename":"data/vaneerConsumption/FamilyClaimsAbdulazeezNotRadicalReligiousoraTerrorist.json","image_url":"https://media.breitbart.com/media/2015/07/Mohammad-Abdulazeez-Facebook-Yearbook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_23__1540931816.html","title":"Family Claims Abdulazeez Not Radical, Religious, or a Terrorist","title_page":"Family Claims Abdulazeez Not Radical, Religious, or a Terrorist","title_rss":"NULL","source_domain":"breitbart.com","text":"The family of Chattanooga gunman Mohammad Youssef Abdulazeez and their legal representation maintain that he was not radical, a terrorist, or even particularly religious. The narrative they are pushing is that his deadly rampage was born of drug abuse and depression.\n“What happened shocked the family,” said lawyer Abdul-Qader al-Khateeb, who is representing the killer’s uncle in Jordan, to NBC News. “Mohammad wasn’t a political person, or religious. It wasn’t a planned act and not an act of terrorism. Maybe it was a mental breakdown.”\nHe added that according to the family, Mohammad’s life was “very simple and normal.”\nIt would seem difficult to sell the idea that Abdulazeez was not religious, since his last known activities included blog posts on Islam, sending a verse from the Koran to a friend via text message, and searching the Internet for “Islamic materials about whether martyrdom would lead to forgiveness for his sins, like drunkenness and financial debt,” according to the New York Times.\nIt is equally difficult to claim he was not “a political person,” since law enforcement has determined he was checking out the missives of al-Qaeda guru Anwar al-Awlaki on his smartphone. Also, acquaintances have been talking about how he returned from his 2014 trip to Jordan with a heightened interest in political matters, including complaints that the United States and its allies didn’t intervene in the Syrian rebellion to depose the regime of Bashar al-Assad.\nPerhaps news of those developments has yet to reach Jordan, or else al-Khateeb is banking on the intense desire of the American political establishment to conclud that Abdulazeez was a random “lone wolf” lunatic whose true motivations for heavily arming himself and launching a murderous attack on American military personnel in Tennessee can never truly be known.\nThe reason a Jordanian lawyer’s opinions became newsworthy is that the shooter’s uncle, Asa’ad Ibrahim Asaad Abdulazeez, was taken into custody by Jordanian authorities shortly after the July 16 attack in Chattanooga. Actually, according to the NYT, he was asked to come to Jordanian intelligence headquarters, released, called back the next morning, released again, and then arrested at his home on Friday.\nHe has yet to be charged with any offense, but speculation that the Jordanians and/or U.S. intelligence had particular reasons to suspect he might have some connection to his nephew’s actions appears to be valid.\nNBC reports that American law enforcement believes Asa’ad Ibrahim Assad Abdulazeez is a “radical” who “may have influenced his nephew during a recent extended visit between April and November last year.”\nLawyer al-Khateeb maintains that Mohammad came to Jordan to “rest” because he was “depressed in the USA.”\n“He lived with his uncle, worked with him that’s all. He was against terrorism and against [ISIS] … he was far from extremism. He is a normal person and like any other person he was concerned with his family and work,” al-Khateeb said in the NBC article.\n“I want to tell you, Mohammod is not religious, and is not belonging to any group,” al-Khateeb said in an interview transcribed by the New York Times. “I specialize in salafi movements, and this guy has no record with the salafis, not him or his uncle.”\nHe described the younger Abdulazeez as spending his time in Jordan working at his uncle’s cell-phone company, going to the market and malls, sitting home and watching TV, and jogging. He said Mohammad’s Jordanian relatives told him the youth was “very affectionate and kindhearted,” with no sign of a bad temper.\nHe went on to complain about being denied access to his client by Jordanian security forces, who told him the “investigation and interrogation is high security, very secret, and no one is allowed.”\nThe New York Times mentions that lawyer al-Khateeb “said he was the head of the Freedom Party, a human-rights faction of the Islamic Action Fund, the political arm of the Muslim Brotherhood,” but said he was not actually a member of the Muslim Brotherhood.\nU.S. authorities are said to be increasingly convinced Mohammad Abdulazeez was not directed by ISIS or specifically recruited by them as a “lone wolf” operative.","url":"https://www.breitbart.com/national-security/2015/07/23/family-claims-abdulazeez-not-radical-religious-or-a-terrorist/"}
