{"authors":["Lulu Chang"],"date_download":"2018-10-30 23:50:14","date_modify":"2018-10-30 23:50:14","date_publish":"2014-08-12 22:52:10","description":"Her face appears on pancake mixes, syrups, and a variety of other breakfast foods, but Aunt Jemima has never been given credit where credit is due. Now, the family of real-life Aunt Jemima, Anna Short Harrington, is suing Pepsi and Quaker Oats for…","filename":"data/vaneerConsumption/FamilyOfAuntJemimaSuesPepsiQuakerOatsFor2BillionBecauseSheWasReal.json","image_url":"https://imgix.bustle.com/uploads/image/2018/7/9/c3fb2976-4b0f-4618-83f4-2b13d8c5d9d6-fotolia_187520940_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35526-family-of-aunt-jemima-sues-pepsi-quaker-oats-for-2-billion-because-she-was-real_1540943414.html","title":"Family Of Aunt Jemima Sues Pepsi & Quaker Oats For $2 Billion, Because She Was Real","title_page":"Family Of Aunt Jemima Sues Pepsi & Quaker Oats For $2 Billion, Because She Was Real","title_rss":"NULL","source_domain":"bustle.com","text":"Her face appears on pancake mixes, syrups, and a variety of other breakfast foods, but Aunt Jemima has never been given credit where credit is due. Now, the family of real-life Aunt Jemima, Anna Short Harrington, is suing Pepsi and Quaker Oats for $2 billion, nearly 60 years after Harrington's death.\nAccording to Harrington's family, Pepsi and its subsidiary companies, including Quaker Oats and Pinnacle Foods, have used Harrington's image and her recipes since 1935, but have never paid her or her family an \"equitable fair share of royalties.\" The suit alleges that Harrington was originally chosen as the face of the company because of her delicious pancake recipe, which Quaker Oats subsequently to the public.\nBut while Quaker turned a handy profit from Harrington's recipe, selling an estimated $300 million worth of Aunt Jemima products, her family claims that Harrington never saw a dime of the profits. In fact, the company went so far as to deny that Harrington was ever an employee of Quaker Oats, even though her photograph sits in the U.S. Patent and Trademark Office, where it was trademarked in 1937.\nOver the course of the past several decades, the Harrington family alleges that Quaker Oats has taken \"64 original formulas and 22 menus\" without crediting Harrington. Moreover, the lawsuit claims that in 1989, Quaker Oats contacted Harrington's youngest daughter, Olivia Hunter, in order to create a more modernized version of Aunt Jemima. It is Hunter's image, the lawsuit alleges, that serves as the face of Aunt Jemima today.\nIn response to questions about why the family chose to wait so long to file a lawsuit, D.W. Hunter, Harrington's great grandson, has stated that Harrington's death certificate, which identifies Quaker Oats as her employer, was only recently obtained. Despite an alleged \"written contractual agreement to play the actress role of Aunt Jemima\" that granted Harrington a percentage of the profits as well as royalties, her family claims that Harrington was later persuaded to forgo her fair share, and Harrington's legacy and contributions were all but forgotten.\nThe lawsuit also brings up a troubling racial element, as the line of pancakes has, in the past, relied on stereotypes as part of their marketing campaign. In 1935, for example, an ad in Woman's Home Companion emphasized Aunt Jemima's heritage with the slogan, \"Let ol Auntie sing in yo' kitchen.\" Effectively the commoditized version of the mammy archetype, an even earlier depiction of Aunt Jemima was actually former slave Nancy Green.\nThe Aunt Jemima website credits Nancy Green in their historical timeline, but makes no reference to her background as a slave, and also does not mention Harrington in any capacity.\nGiven the \"Screen Actors Guild residuals\" and entertainment industry policies surrounding revenue and royalty distribution, the Harrington family believes that they have a strong case moving forward, though Quaker Oats believes it is unmerited.\nHowever, Aunt Jemima does seem to be one of the few famous faces who has never been recognized, either as a living human being nor for her culinary contributions to her company. Let's take a look at a few other notable spokespeople who have received credit for their work.\nChef Boyardee\nYour favorite canned ravioli came from a real Italian chef, though his last name wasn't quite spelled \"Boyardee.\" The more phonetic version of his name was likely more marketable \"Boiardi,\" as in Ettore \"Hector\" Boiardi, who came to the United States at 16. Just eight years later, he opened his own restaurant, and his customers were so taken by his creations that he started sending his food home with them in jars.\nIn 1946, Boiardi sold his hugely profitable line of sauces and other products for a cool $6 million, and his face remains on many cans of Boyardee products. His life story can also be found on the official Chef Boyardee website.\nOrville Redenbacher\nLook closely at your next box of microwave popcorn, and you'll notice the friendly face of Orville Redenbacher looking right back at you. As the man who essentially revolutionized popcorn, Redenbacher's brand makes up around 45 percent of the $1 billion annual popcorn industry, and of course, Redenbacher never missed out on any of those profits. His family also remains heir to the popcorn fortune.\nWendy's\nScott Olson/Getty Images News/Getty Images\nWell, Wendy wasn't exactly a prominent figure in the making of the franchise, but her father, Dave Thomas, was the founder. He named the fast food chain after his daughter, then 8-year-old Melinda Lou, who always pronounced her own name \"Wenda.\"\nToday, Melinda Lou Morse (her married name), remains the spokesperson for Wendy's, and her net worth is estimated to be around $100 million.","url":"https://www.bustle.com/articles/35526-family-of-aunt-jemima-sues-pepsi-quaker-oats-for-2-billion-because-she-was-real"}
