{"authors":[],"date_download":"2018-10-22 22:20:59","date_modify":"2018-10-22 22:20:59","date_publish":"2014-06-09 19:07:31","description":"The family of an American detained in North Korea released a statement on Monday, saying that he was merely on vacation when he was captured.","filename":"data/vaneerConsumption/FamilyofDetainedAmericaninNorthKoreaSpeaksOut.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_43/497376/140609-fowle-hg-1504_9fe248d19ad65621bb05b8c9d80065d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_family-detained-american-north-korea-speaks-out-n126571_1540246859.html","title":"Family of Detained American in North Korea Speaks Out","title_page":"Family of Detained American in North Korea Speaks Out","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe family of the most recent American to be detained in North Korea released a statement on Monday, saying that he was merely on vacation when he was captured.\nIt was first revealed that Jeffrey Fowle was detained on Friday, when the totalitarian regime put out a statement accusing him of acts \"in violation of the DPRK law, contrary to the purpose of tourism during his stay,\" referring to the country's official name, the Democratic People's Republic of Korea.\nCiting diplomatic sources, Japan's Kyodo News reported that the 56-year-old Fowle, who had entered the country on April 29, was detained after leaving behind a Bible at the hotel where he had been staying.\nIn the statement released Monday, Fowle's family noted that he is the father of three children, aged 9, 10 and 12, and was \"travelling to North Korea as a part of a tour.\"\n\"Jeffrey loves to travel and loves the adventure of experiencing different cultures and seeing new places,\" the family said.","url":"https://www.nbcnews.com/news/world/family-detained-american-north-korea-speaks-out-n126571"}
