{"authors":["Imogen Calderwood In Vienna","Austria For Dailymail.Com","Ruth Styles In Grand Junction","Colorado","For Dailymail.Com"],"date_download":"2018-10-23 02:10:22","date_modify":"2018-10-23 02:10:22","date_publish":"2016-01-29 16:29:17","description":"Lauren Mann's brother-in-law tells Daily Mail Online that the nanny, 25, should be remembered as a 'brilliant, beautiful person'. The Colorado student was found suffocated in her apartment in Austria.","filename":"data/vaneerConsumption/FamilyofLaurenMannsuffocatedtodeathinViennafaceweekswaitingtoburyher.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC5E1800000578-0-image-a-21_1453998834985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422937_Family-Lauren-Mann-American-nanny-suffocated-death-Vienna-face-weeks-agony-waiting-bury-25-year-old-authorities-decide-launch-murder-probe_1540260622.html","title":"Family of Lauren Mann suffocated to death in Vienna face weeks waiting to bury her","title_page":"Family of Lauren Mann suffocated to death in Vienna face weeks waiting to bury her | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her brother in law tells Daily Mail Online she 'wasn't like that' and wants her remembered for being 'brilliant, beautiful person'\nBut family are furious at leak from investigation and said they were 'heartbroken' at her death\nthat Colorado au pair was victim of kinky sex 'game' gone wrong\nPolice are looking into series of theories - including\nThe family of 'murdered' nanny Lauren Mann have said they are outraged by the theory that her death was the result of 'a kinky sex game' gone wrong.\nThe theory, which was put forward by Austrian police, was slammed in a statement released by Lauren's sister Ashleigh Doutis, 30, yesterday in which she described it as 'sensationalized'.\nThe 25-year-old was discovered by police in her apartment in Vienna on Tuesday, half-naked and lying face down on a mattress in a 'considerable amount of blood'.\nAn autopsy found she had been suffocated but toxicology tests are now being carried out as well to help determine whether she was murdered.\nToday, Lauren's brother-in-law Justin Doutis, 31, told Daily Mail Online that the Colorado au pair would 'never' have got involved in anything like that.\nSCROLL DOWN FOR VIDEO\nLauren Mann (pictured in a Facebook photo) was discovered lying half-naked, face-down on a mattress at her fourth district address on Tuesday\nIn mourning: Lauren Mann's mother Shelly Hyde remains at home in Grand Junction, Colorado, while the family faces a lengthy wait to bring their loved one's body home from Austria\nConcerns:The alarm was first raised on Monday when she failed to show up to her au pair job at the home of Michael Kuen and his wife Verena Jaschke-Kuen. She helped care for their family\nMourned at home: In Grand Junction, Lauren's brother-in-law told Daily Mail Online she was being remembered as 'a brilliant, beautiful person'.\n'I knew Lauren and she wasn't like that,' he said.\n'She would never have done anything like that. She just wasn't that kind of a person.\n'There's been a lot of inaccurate stuff written and it's just not right.'\nInstead of dwelling on her death, Doutis said he would always remember her as 'a brilliant, beautiful person'.\n'It's so terrible what happened to her,' he added. 'We're all really upset.\n'She was so excited about living in Europe - she had always wanted to move there. It's a really hard time for all of us.'\nEarlier today, Ashleigh took to social media to thank well-wishers and friends expressing their sympathy following the discovery of Lauren's body on Tuesday evening.\n'Thank you for all your thoughts, love and prayers,' she wrote.\n'My heart is broken. The memories of my sister are cherished.'\nLauren's mother, Shelly Hyde, 63, remains too upset to speak and is being comforted by friends at her spacious home in an upmarket neighborhood of Grand Junction.\nThe family may have to wait 'weeks' before her body is returned to them. Despite an autopsy revealing that Mann was suffocated, it may be weeks before authorities in Austria decide if they will launch murderer inquiry, police said today.\nUntil they do, they may keep her body, leaving the family unable to mourn their loss.\nThe case has been handed over to the State Attorney's Office in Austria to decide whether Mann was murdered or whether the case remains a homicide investigation.\nPolice and firefighters had to force open the door to Ms Mann's apartment inside this building in Vienna, pictured, after her employers became concerned by her unexplained absence from work on Tuesday\nInvestigation: A forensic examination of the 550-euro ($600) a month studio apartment where the student lived was carried out after he body was found\nBut the knot of bureaucracy means that Mann's family in Colorado is unable to say when they will be able to finally lay their daughter to rest.\n'We have to wait for some medical results to come in and until we have them it can't be decided if this is a murder investigation or not,' Vienna police spokesman Thomas Keiblinger told Daily Mail Online on Friday.\n'But it could be a few weeks or more.'\nMeanwhile Nina Bussek, the spokeswoman for the State Attorney's Office, that she too did not have any information as to how long the investigation would take, nor how long the family would have to wait for the return of Mann's body.\nLauren didn't show up for work today without any notice and her phone is flat. This has never happened before and therefore we are a bit worried. Did anyone hear from her or see her today? ... and Lauren, please give us call when you see this. Thank you! Facebook post by her concerned employers on Monday\n'I don't have that information,' she told Daily Mail Online. 'It is up to the doctor to decide when the body will be returned.\n'At the moment the investigation is still ongoing.'\nThe blow to the family came after they spoke of their devastation at their loss and criticized a leak which revealed one theory police are working on - that she was the victim of a sex game gone wrong.\nHer sister Ashleigh Doutis spoke out after it was revealed the theory was one of the lines being pursued by invesitgators in Vienna after the part-time student was found dead.\nThe theory had already been met with skepticism by the University of Colorado graduate's friends in Vienna.\nDoutis, 30, who still lives in the family's home town Grand Junction, Colorado, strongly implied the family also doubt the theory.\n'We are heartbroken to tell you our daughter and sister Lauren Mann has been found dead in her apartment in Vienna, Austria,' she said.\n'An investigation is in progress. It has been released in Austria to the media and is being sensationalized. Please keep us in your thoughts and prayers.'\nHer mother Shelly Hyde, 63, was still too upset to speak when approached at her upscale home in Grand Junction earlier today.\nVienna police have told media that one theory being pursued is that Lauren, whose half-naked body was discovered on Tuesday night, died during 'a kinky sex game gone wrong'.\nAutopsy results released earlier today showed that the 25-year-old language student died from suffocation and was discovered with her face pushed into her mattress.\nThe alarm was first raised on Monday when she failed to show up to her au pair job at the home of Michael Kuen and his wife Verena Jaschke-Kuen.\nDebris: Some of the items left by forensic investigators outside the studio apartment where the 'murdered' student and part-time au pair lived\nSealed: The apartment where Lauren Mann was found dead has been shut by police and its landlord has not been allowed access to it\nWhile Kuen alerted authorities, his wife began a frantic social media search for the 25-year-old.\nIn a post made on Facebook on Monday, she wrote: 'Lauren didn't show up for work today without any notice and her phone is flat.\n'This has never happened before and therefore we are a bit worried. Did anyone hear from her or see her today? ... and Lauren, please give us call when you see this. Thank you!'\nFriends quickly began voicing their concern about her whereabouts with one, John Dūz Dusenbury, saying she hadn't been heard from since the previous Tuesday.\nLauren is thought to have been killed at some point over the weekend and was discovered in her Wieden apartment with a sweater over her head.\nAlong with the sex game gone wrong theory, police are hunting a Gambian illegal migrant who was believed to be sharing her studio apartment at the time of her death. His right to stay in Austria had expired.\nMeanwhile, friends have paid tribute to the murdered au pair, with many highlighting her love of music, generous personality and kind heart.\nWriting on Lauren's social media pages, Ross Gullo, from Parkside, Illinois, described her as 'a great friend.'\nHe added: 'Always nice with something interesting to say. You were a fantastic musician. Your intelligence and brilliance always amazed me.\n'I will cherish the time we spent together and the memories we had. I'm thankful for knowing you. I will be praying for your family. Take care, friend.'\nAnother, Peter Pyotr Petrovich Mathys‎, from Boulder, Colorado, added: 'I'm sorry you had to leave this world so soon.\n'You were a fantastic, kind, intelligent, unique person that had lots of potential and lots to offer.\n'I've realized that you were one of my first and closest friends my freshman year at CU. We shared our love of music and languages and we had many fun moments and deep conversations. I can't thank you enough for making that year special for me.\nAustrian police are looking for an illegal immigrant from Gambia who was living with Ms Mann in the apartment complex, pictured, who has vanished following her death\nYour passing is extremely tragic and heartbreaking. You will be missed, yet never forgotten.'\nClose friend Alexandra Nguyen, also from Boulder, added: 'This is heartbreaking... Lauren was a bright, kind, generous, and luminous young woman. What a terrible loss.'\nThe case is being treated as a 'possible' murder and the Austrian state attorney - the prosecuting authority - will decide if a full-scale murder investigation is to be carried out by police.\nInvestigators are focusing on questioning her friends and family, following suggestions that a 'sex game' led to her death.\nBut neighbors on the peaceful Wiender Hauptstrasse were skeptical of the theory and insisted that Lauren was 'a very lovely girl' and a 'model tenant .\nThe theory is uncannily similar to a claim made by police after the death of an American artist in Italy earlier this month that she was also involved in a kinky sex game.\nPolice there dropped the theory after less than 48 hours and charged an immigrant man she had taken home from a nightclub with her murder.\nIn Vienna today Lauren's landlord cast doubt on the sex-game theory and told Daily Mail Online: 'She was a lovely girl, and I have never had a problem with her. She had a nice character and was a model tenant.'\nThe landlord, who wished to remain anonymous, added: 'She was a quiet and conscientious member of the community.'\nPolice have sealed off the apartment after they were forced to break in to recover Ms Mann's body\nPolice are looking for a man from the Gambia who was also living in the apartment with Ms Mann\nCafe and shop owners on the street, which has the character of a small town, also insisted that although they were not close with the American nanny, they had always been struck by her 'warm personality'.\n'She came in here a few times,' said the owner of a tobacconist opposite Lauren's apartment building.\n'She was not much of a small talker, but she seemed to be a nice person.'\nThe owners of the Sebastiano restaurant, directly below Lauren's flat, insisted that they would not play along with the 'wild' allegations until they 'knew what happened'.\nWhen police entered the apartment, they found that every light bulb in it had blown out and the room was lit only by candles.\nThe landlord said he has not yet been allowed access to the studio by police, but added: 'She was not a very handy girl.\n'What is most likely is that she didn't change the bulbs because she didn't know how or couldn't be bothered, as she would have needed a ladder to do it.\n'There's not a problem with the building or the lights. It was only a problem in her apartment.\n'The man living in the flat opposite her is the building's superintendent, so all she would have had to do to sort it out was knock on his door and ask.'\nAuthorities say the 25-year-old's body was found surrounded by a 'considerable amount of blood' as police confirmed they are treating her death as a homicide\nMann, a nanny from Paonia, Colorado (pictured in Facebook photos) had been studying and working in Vienna\nNeighborhood: The area in Vienna where Mann was living before her death\nMann paid ‎€550 ($600) a month for the studio. She was one of the few tenants in the building who was not a friend of the owner as she had taken the apartment over from a university friend who is the daughter of a Greek diplomat in Vienna.\nMann was studying at the University of Vienna, where she had enrolled in October 2014.\nShe was a high-flying student who had got the top grades, 1s and 2s, in the three courses she had completed towards her degree, for which she had to complete a minimum of 23 courses.\nHer au-pair work had meant that she was effectively studying part-time.\nMann had studied piano and French at the University of Colorado-Boulder's music school before moving to Europe to study German in Vienna.\nThe 25-year-old described herself as an avid reader and lover of art, and literature and music.\nThe U.S. Embassy in Vienna confirmed her death and said it was working with Austrian authorities on their investigation.\n'We extend our deepest condolences to her loved ones,' the embassy told NBC News.\nThe sex game theory has parallels to the investigation into the death of American artist Ashley Olsen in Florence earlier this month.\nShe was found in her Italian apartment and had been strangled with a USB cord.","url":"https://www.dailymail.co.uk/news/article-3422937/Family-Lauren-Mann-American-nanny-suffocated-death-Vienna-face-weeks-agony-waiting-bury-25-year-old-authorities-decide-launch-murder-probe.html"}
