{"authors":["Rachael Burford For Mailonline"],"date_download":"2018-10-22 23:58:19","date_modify":"2018-10-22 23:58:19","date_publish":"2017-04-26 09:01:14","description":"Kyle Ewart, from Macclesfield, was found with serious head injuries in Adelaide on April 12 and is suffering from amnesia. The father of two is being treated for a fractured skull.","filename":"data/vaneerConsumption/FamilydashtoKyleEwartleftfordeadinAustralia.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EBCF200000578-0-image-a-49_1493200424734.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446622_Family-dash-father-left-dead-Australia_1540252699.html","title":"Family dash to Kyle Ewart left for dead in Australia","title_page":"Family dash to Kyle Ewart left for dead in Australia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The mother of a British father who was left for dead in an Australian garden has spoken of the family's ordeal and insisted the police explanation for what happened just 'doesn't fit'.\nKyle Ewart, from Macclesfield, was found with serious head injuries after being dumped on his sister-in-laws lawn in Adelaide on April 12.\nHe has been released from hospital and is staying with he ex partner Keira Campbell with whom he has two daughters, but he is suffering from amnesia.\nThe father-of-two was being treated for a fractured skull and a bleed on the brain in hospital.\nScroll down for video\nKyle Ewart (pictured left), from Macclesfield, was found with serious head injuries in a garden in Adelaide on April 12. Mr Ewart's mother, Christine Ewart, and sister Kendelle (together, right), 25, arrived on April 14\nHis family have spent the last week at his bedside battling for answers to find out what happened\nHis mother, Christine Ewart, 51, and sister Kendelle, 25, arrived on April 14 and have spent the last week at his bedside battling for answers.\nMrs Ewart ,51, spoke to Mail Online from Adelaide about her fight for a thorough police investigation into how he was so badly injured.\nShe rejects a police theory that he son jumped from a moving car and believes he was the subject of an attack with a heavy instrument in the hours before he was found.\nShe said: 'I am absolutely exhausted and very angry with the lack of help I have had from the Australian police.\nThe father-of-two is being treated for a fractured skull and a bleed on the brain in hospital. Mr Ewart's family say he cannot remember what happened\n'If he had jumped he would have other injuries such as a broken arm or other cuts and bruises - not just injuries to his head. It just does not fit.\n'I think he has been hit with a heavy implement of some sort because that is the best explanation of his injuries. He was almost killed.\n'He cannot remember anything because he has amnesia. He still has the blood clot on the brain and is now waiting to go into rehabilitation. He is having seizures and is on medication.\n'I do not feel I am getting anywhere at all with the police. I have come all the way to Australia but wonder what I am doing here. The police are under the impression that he jumped out of the car but my son has no memory of that at all.\nMr Ewart was believed to have been with a man and a woman driving a blue Holden saloon in the hours before he was found in the garden of his sister in law Samantha Burt.\nDetectives believe Mr Ewart (pictured in hospital) was driven to the address and dumped, but his mother says they are also investigating the possibility that he jumped from a moving vehicle\nThe couple were traced and questioned but have been released without charge.\n'Before he was left in the garden, he went into a pub and then a kebab shop to ask for help but this couple dragged him out of there, said Mrs Ewart.\n'They got him into the car and then drove him all the way to his sister in law's house which I believe is half an hour away.\n'If they are innocent , then why did they not get help for my son when he was seriously hurt? My main concern is to find out what happened to Kyle.\n'I told the Australian detective who has spoken to Kyle that I did not believe the story about him jumping from the car and that it should be investigated seriously. He told me I was p***ing him right off by saying that.'\nPolice said two people have been questioned and released without charge and a blue Holden Commodore Sedan was seized for forensic examination. CCTV shows Mr Ewart (right) being led away by a mysterious couple\nDisturbing CCTV of Mr Ewart staggering around less than an hour before he was dumped was shown on Australian news channels\nMr Ewart was found in sister-in-law Samantha Burtt's garden and detectives believe he was driven to the address and dumped.\nIt initially appeared Mr Ewart, who was missing one of his shoes when he was found, had been assaulted and disturbing CCTV of him staggering down the road less than an hour before he was dumped was shown on Australian news channels.\nIn an emotional Facebook post Keira Campbell, the mother of Mr Ewart's two children, described him as a 'great man' who had let an 'evil poison' into his life.\nShe wrote: 'I wish I knew the Kyle I once knew. The man who went to work every day for his family, the man who would wake up in the middle of every night to do night feeds.\nIn an emotional Facebook post Keira Campbell, the mother of Mr Ewart's two children, described him as a 'great man' who had let an 'evil poison' into his life\nKeira Campbell (left and right with Mr Ewart) said: 'I wish I knew the Kyle I once knew. The man who went to work every day for his family, the man who would wake up in the middle of every night to do night feeds'\n'Many nights I wonder what goes through your brain, whether you are safe and warm, or if that evil poison has gotten to your system...my heart hurts for you.\n'The Kyle I knew would give his last dollar to anyone, the Kyle I knew would take his daughters to the park so he could let me sleep and come home and clean the house, the Kyle I knew was to scared to even smoke a spliff because he didn't want to upset me or his girls. Kyle was a great man, and I try hold on to that.'\nSamantha Burtt opened her door just before 10pm on April 12 to find Mr Ewart collapsed on the lawn.\nShe told news.com.au that he was 'on the grass curled up' and 'bleeding'.\nShe added: 'He looked like he had been beaten to the back of the head. I ended up going inside and calling my sister (Mr Ewart's partner). A mate called an ambulance.'\nMr Ewart settled in Adelaide eight years ago while he was backpacking with friends. He met Ms Campbell in the city and the couple went onto to have two daughters now aged three and five.\nThe relationship broke down two years ago, although Mr Ewart remains close by to see his children.\nMrs Ewart (centre, left), Kendelle (left) and brothers Joshua, 27, (centre right) and Warren, 33, (right) are promoting an online fundraising page to help Mr Ewart in his recovery and get him home\nDetective Chief Inspector Shane Addison said that Mr Ewart was known to police but he did not believe the incident was related to other occasions when they have spoken to him.\nHe added that officers were still looking for Mr Ewart's missing blue and yellow shoe.\nMrs Ewart, who works as a lifeline officer for a housing trust, said she was in daily contact with her son before she got the call about his injuries.\nShe said:' After the relationship broke down, he became a bit depressed and talked of coming home for a while although he would always go back to be near the children.\n'He has still got his blood clot which doctors hope will dissolve with medication and he has a soft spot on the back of his head where I believe he was hit.\n'He is a lot better but he gets a little irrational and bad tempered. I have had lots of messages from his friends saying what a lovely lad he is.'\nHis family, which also includes brothers Joshua, 27, and Warren, 33, are promoting an online fundraising page to help Mr Ewart in his recovery and get him home.\nSo far it has raised more than $1,000 of its $3,000 target.","url":"https://www.dailymail.co.uk/news/article-4446622/Family-dash-father-left-dead-Australia.html"}
