{"authors":["Dailymail.Com Reporter","Associated Press"],"date_download":"2018-10-22 20:48:15","date_modify":"2018-10-22 20:48:15","date_publish":"2016-01-29 03:56:45","description":"The family's attorney said the boy was bitten in October 2014 when the snake escaped Disney's Animal Kingdom and bit the boy after dropping from a tree.","filename":"data/vaneerConsumption/FamilysuesWaltDisneyWorldaftersonsufferssnakebite.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AECEE800000578-0-image-a-37_1454039797721.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422168_Family-sues-Walt-Disney-World-son-suffers-snake-bike_1540241295.html","title":"Family sues Walt Disney World after son suffers snake bite","title_page":"Family sues Walt Disney World after son suffers snake bite | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Alabama family suing Walt Disney World claims a relative died of a heart attack after she watched her grandson get bit by a snake in the amusement park.\nMatt Morgan, the family's attorney, said the snake escaped Disney's Animal Kingdom and bit the boy after dropping from a tree in October 2014.\nMorgan said the grandmother witnessed the snake bite the boy and died a short time later after going into cardiac arrest.\nAn Alabama family suing Walt Disney World claims a relative died of a heart attack after she watched her grandson get bit by a snake they say escaped Animal Kingdom (pictured in a file photo)\nMatt Morgan, the family's attorney, said the snake escaped Disney's Animal Kingdom and bit the boy after dropping from a tree in October 2014 (file photo)\nDisney confirmed the snake bite but said it was wild, nonvenomous and not part of Animal Kingdom, it told WKMG.\nJacquee Wahler, a spokeswoman for Disney, says the allegations mischaracterize what happened.\nDisney said the boy was given a Band-Aid by the park nurse and that he and his family then returned to the park.\nIt contends that there was no call for an ambulance for the grandmother after the incident.\nMorgan said he will file a formal lawsuit against Disney for the boy's injuries as well as the wrongful death of his grandmother.\nThe names of the family are not being released at this time.","url":"https://www.dailymail.co.uk/news/article-3422168/Family-sues-Walt-Disney-World-son-suffers-snake-bike.html"}
