{"authors":[],"date_download":"2018-10-22 20:49:39","date_modify":"2018-10-22 20:49:39","date_publish":"2014-06-02 19:47:44","description":"A former Army medic says he knows of two soldiers killed during the mission to find Sgt. Bowe Bergdahl in Afghanistan.","filename":"data/vaneerConsumption/FamilyofSoldierSlaininBoweBergdahlSearchBlastsPrisonerSwap.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2016_02/480376/140601-bergdahl-jms-1627_676968e97715c7a5836864bd70755b58.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_family-soldier-slain-bowe-bergdahl-search-blasts-prisoner-swap-n120596_1540241379.html","title":"Family of Soldier Slain in Bowe Bergdahl Search Blasts Prisoner Swap","title_page":"Family of Soldier Slain in Bowe Bergdahl Search Blasts Prisoner Swap","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe deal that got Bowe Bergdahl released in exchange for five high-ranking Taliban detainees doesn't sit right with the family of an Army lieutenant killed in an ambush while searching for the missing sergeant.\n\"He was killed while looking for this deserter,\" said Andy Andrews, father of 2nd Lt. Darryn Andrews, who died in eastern Afghanistan in September 2009.\n\"If this guy [Bergdahl] had not gone off post, our son would not have been killed.\"\nThe Defense Department has never said Bergdahl was away without leave and has pointedly described him as a \"prisoner of war.\"\nThe Andrews family did not know there might be a connection between the lieutenant's death and Bergdahl until this weekend when the White House announced the prisoner swap — which has drawn sharp criticism from some lawmakers and service members.\nThey said they learned of the reported link from other members of Andrews' platoon, who went public because they were disgusted that Bergdahl, who vanished and was captured under murky circumstances, was being portrayed as a hero.\nA medic who was in Bergdahl's platoon told NBC News that he firmly believes the quiet, bookish sergeant willfully sneaked away, putting himself in harm's way and endangering the lives of fellow soldiers.\n\"He's not a hero,\" Josh Cornelison said of Bergdahl, who has been promoted twice in captivity.\n\"He left the Army. He walked away from his post on his own two feet with his own sound mind. He left by himself to do what he wanted to do. He is not a hero. Heroes are the people who sacrificed their lives for your freedom, for my freedom, for everybody's freedom.\"\nCornelison said after Bergdahl disappeared, the Army flooded the area with troops to find him. For 90 days, it was their top priority, even as the Taliban stepped up their attacks.\n\"Every single mission we did was pointed toward finding Berghdahl,\" Cornelison said. \"Every single person that died was doing something to find Bowe Berghdahl.\"\nHe maintains that's what 3rd platoon was doing when a roadside bomb blew up on them, the precursor to an ambush in which Andrews, 34, and Pfc. Matthew Martinek, 20, were killed.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/family-soldier-slain-bowe-bergdahl-search-blasts-prisoner-swap-n120596"}
