{"authors":["Press Association"],"date_download":"2018-10-23 03:40:36","date_modify":"2018-10-23 03:40:36","date_publish":"2016-01-29 18:49:41","description":"The family of a woman murdered by her police officer husband have paid tribute to a \"caring, fun-loving person\". Jill Goldsmith, 49, died from head injuries ...","filename":"data/vaneerConsumption/Familypaytributetowomanmurderedbypoliceofficerhusband.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-6223d270-e3c9-4a06-a8fa-ecd8b9c85fef-3bmscybNe842cce83474b58e5187-770_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3423178_Family-pay-tribute-woman-murdered-police-officer-husband_1540266036.html","title":"Family pay tribute to woman murdered by police officer husband","title_page":"Family pay tribute to woman murdered by police officer husband | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Family pay tribute to woman murdered by police officer husband\nThe family of a woman murdered by her police officer husband have paid tribute to a \"caring, fun-loving person\".\nJill Goldsmith, 49, died from head injuries after an argument with her husband Adrian Goldsmith at the couple's home near Northamptonshire Police headquarters.\nAdrian Goldsmith, also known as Otis, was a serving officer with the force at the time of the offence last March.\nJill Goldsmith's family said she was 'caring' and 'fun-loving'\nHe was convicted of murder at Stafford Crown Court after a three-week trial and will be sentenced on Monday.\nIn a statement, Jill Goldsmith's family said: \"Adrian Goldsmith has not only taken the life of Jill, but he's also destroyed the life of her son, her mother and her brother.\n\"Jill was a caring, fun-loving person who lived life to the full. She had many good friends and was loved by everyone.\n\"On behalf of the whole family, we would like to thank the police investigation team and the Crown Prosecution Service for bringing Adrian Goldsmith to justice.\n\"We would also like to thank the members of the jury who saw through Adrian Goldsmith as well.\n\"Adrian Goldsmith has left us all devastated by the actions he took that day, we will think of Jill every day and miss her for the rest of our lives.\"\nOfficers were called to the property in Wootton Hall Park, Northampton, on March 26 last year following a 999 call by Goldsmith, now aged 50.\nThey arrested him and he was later charged with the murder of his wife.\nDeputy Chief Constable Andy Frost, from Northamptonshire Police, said: \"My heartfelt condolences go out to the family of Jill Goldsmith.\n\"Otis Goldsmith committed one of the worst crimes possible, taking the life of his wife. The guilty verdict today, I hope, will help bring some form of closure to Jill's family who have had to endure a trial during one of the most difficult times in their lives.","url":"https://www.dailymail.co.uk/wires/pa/article-3423178/Family-pay-tribute-woman-murdered-police-officer-husband.html"}
