{"authors":["Ruth Styles In Grand Junction","Colorado","For Dailymail.Com","Imogen Calderwood In Vienna","Austria For Dailymail.Com","Flemming Emil Hansen In Vienna","Austria"],"date_download":"2018-10-22 23:22:46","date_modify":"2018-10-22 23:22:46","date_publish":"2016-01-28 12:15:28","description":"Lauren Mann's semi-naked body was found face-down on a mattress in her Vienna apartment in after her employers became concerned the Colorado au pair had not turned up for work.","filename":"data/vaneerConsumption/FamilyofLauraMannmurderedinAustriahitoutatpoliceleakingsexgametheory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC5E1800000578-0-image-a-21_1453998834985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420834_How-did-Lauren-Mann-die-Murder-American-nanny-Vienna-remains-mystery-autopsy-fails-discover-killed_1540250566.html","title":"Family of Laura Mann 'murdered' in Austria hit out at police leaking sex game theory","title_page":"Family of Laura Mann 'murdered' in Austria hit out at police leaking sex game theory | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Illegal immigrant from Gambia who had lost right to stay in Austria but was living in same apartment as Mann being looked for\nBut family are furious at leak from investigation and said they were 'heartbroken' at her death\nthat Colorado au pair was victim of kinky sex 'game' gone wrong\nPolice are looking into series of theories - including\nThe family of 'murdered' American au pair Lauren Mann, 25, have been left 'devastated' by her death in Austria - and are furious at a police leak that it could have been the result of a sex game gone wrong.\nHer sister Ashleigh Doutis spoke out after it was revealed the theory was one of the lines being pursued by invesitgators in Vienna after the part-time student was found dead.\nThe theory had already been met with skepticism by the University of Colorado graduate's friends in Vienna.\nDoutis, 30, who still lives in the family's home town Grand Junction, Colorado, strongly implied the family also doubt the theory.\nSCROLL DOWN FOR VIDEO\nLauren Mann (pictured in a Facebook photo) was discovered lying half-naked, face-down on a mattress at her fourth district address on Tuesday\nPolice and firefighters had to force open the door to Ms Mann's apartment inside this building in Vienna, pictured, after her employers became concerned by her unexplained absence from work on Tuesday\nInvestigation: A forensic examination of the 550-euro ($600) a month studio apartment where the student lived was carried out after he body was found\n'We are heartbroken to tell you our daughter and sister Lauren Mann has been found dead in her apartment in Vienna, Austria,' she said.\n'An investigation is in progress. It has been released in Austria to the media and is being sensationalized. Please keep us in your thoughts and prayers.'\nHer mother Shelly Hyde, 63, was still too upset to speak when approached at her upscale home in Grand Junction earlier today.\nVienna police have told media that one theory being pursued is that Lauren, whose half naked body was discovered on Tuesday night, died during 'a kinky sex game gone wrong'.\nAutopsy results released earlier today showed that the 25-year-old language student died from suffocation and was discovered with her face pushed into her mattress.\nLauren didn't show up for work today without any notice and her phone is flat. This has never happened before and therefore we are a bit worried. Did anyone hear from her or see her today? ... and Lauren, please give us call when you see this. Thank you! Facebook post by her concerned employers on Monday\nThe alarm was first raised on Monday when she failed to show up to her au pair job at the home of her employers, a husband and wife couple.\nWhile the husband alerted authorities, his wife began a frantic social media search for the 25-year-old.\nIn a post made on Facebook on Monday, she wrote: 'Lauren didn't show up for work today without any notice and her phone is flat.\n'This has never happened before and therefore we are a bit worried. Did anyone hear from her or see her today? ... and Lauren, please give us call when you see this. Thank you!'\nFriends quickly began voicing their concern about her whereabouts with one, John Dūz Dusenbury, saying she hadn't been heard from since the previous Tuesday.\nLauren is thought to have been killed at some point over the weekend and was discovered in her Wieden apartment with a sweater over her head.\nAlong with the sex game gone wrong theory, police hunting a Gambian illegal migrant who was believed to be sharing her studio apartment at the time of her death. His right to stay in Austria had expired.\nMeanwhile, friends have paid tribute to the murdered au pair, with many highlighting her love of music, generous personality and kind heart.\nWriting on Lauren's social media pages, Ross Gullo, from Parkside, Illinois, described her as 'a great friend.'\nHe added: 'Always nice with something interesting to say. You were a fantastic musician. Your intelligence and brilliance always amazed me.\n'I will cherish the time we spent together and the memories we had. I'm thankful for knowing you. I will be praying for your family. Take care, friend.'\nAnother, Peter Pyotr Petrovich Mathys‎, from Boulder, Colorado, added: 'I'm sorry you had to leave this world so soon.\nDebris: Some of the items left by forensic investigators outside the studio apartment where the 'murdered' student and part-time au pair lived\nSealed: The apartment where Lauren Mann was found dead has been shut by police and its landlord has not been allowed access to it\n'You were a fantastic, kind, intelligent, unique person that had lots of potential and lots to offer.\n'I've realized that you were one of my first and closest friends my freshman year at CU. We shared our love of music and languages and we had many fun moments and deep conversations. I can't thank you enough for making that year special for me.\nYour passing is extremely tragic and heartbreaking. You will be missed, yet never forgotten.'\nClose friend Alexandra Nguyen, also from Boulder, added: 'This is heartbreaking... Lauren was a bright, kind, generous, and luminous young woman. What a terrible loss.'\nThe case is being treated as a 'possible' murder and the Austrian state attorney - the prosecuting authority - will decide if a full-scale murder investigation is to be carried out by police.\nInvestigators are focusing on questioning her friends and family, following suggestions that a 'sex game' led to her death.\nBut neighbors on the peaceful Wiender Hauptstrasse were skeptical of the theory and insisted that Lauren was 'a very lovely girl' and a 'model tenant .\nThe theory is uncannily similar to a claim made by police after the death of an American artist in Italy earlier this month that she was also involved in a kinky sex game.\nPolice there dropped the theory after less than 48 hours and charged an immigrant man she had taken home from a nightclub with her murder.\nIn Vienna today Lauren's landlord cast doubt on the sex-game theory and told Daily Mail Online: 'She was a lovely girl, and I have never had a problem with her. She had a nice character and was a model tenant.'\nThe landlord, who wished to remain anonymous, added: 'She was a quiet and conscientious member of the community.'\nCafe and shop owners on the street, which has the character of a small town, also insisted that although they were not close with the American nanny, they had always been struck by her 'warm personality'.\n'She came in here a few times,' said the owner of a tobacconist opposite Lauren's apartment building.\nAustrian police are looking for an illegal immigrant from Gambia who was living with Ms Mann in the apartment complex, pictured, who has vanished following her death\n'She was not much of a small talker, but she seemed to be a nice person.'\nThe owners of the Sebastiano restaurant, directly below Lauren's flat, insisted that they would not play along with the 'wild' allegations until they 'knew what happened'.\nAustrian police spokesman Thomas Keiblinger said his colleagues were now also waiting for the results of toxicology tests.\nA full forensic search of the apartment took place after the discovery of Mann's body.\nWhen police entered the apartment, they found that every light bulb in it had blown out and the room was lit only by candles.\nThe landlord said he has not yet been allowed access to the studio by police, but added: 'She was not a very handy girl.\n'She called me recently because she had a problem with the heater and said it was broken, but all she would have had to do to fix it was press a button to turn it on.\n'What is most likely is that she didn't change the bulbs because she didn't know how or couldn't be bothered, as she would have needed a ladder to do it.\n'There's not a problem with the building or the lights. It was only a problem in her apartment.\n'The man living in the flat opposite her is the building's superintendent, so all she would have had to do to sort it out was knock on his door and ask.'\nHe also said that he was unaware of the presence of a man in the apartment.\nThe man, an illegal immigrant from Gambia, is being hunted by police. He has not been since since the discovery of her body on Tuesday.\nThe landlord said that a Gambian would have stood out in the almost exclusively-white area.\n'I know the people living here, I talk to the people who live here,' he said. 'I'm sure they would have told me if there was a black man living in the apartment.'\nPolice have sealed off the apartment after they were forced to break in to recover Ms Mann's body\nPolice are looking for a man from the Gambia who was also living in the apartment with Ms Mann\nAuthorities say the 25-year-old's body was found surrounded by a 'considerable amount of blood' as police confirmed they are treating her death as a homicide\nMann, a nanny from Paonia, Colorado (pictured in Facebook photos) had been studying and working in Vienna\nNeighborhood: The area in Vienna where Mann was living before her death\nMann paid ‎€550 ($600) a month for the studio. She was one of the few tenants in the building who was not a friend of the owner as she had taken the apartment over from a university friend who is the daughter of a Greek diplomat in Vienna.\nMann was studying at the University of Vienna, where she had enrolled in October 2014.\nShe was a high-flying student who had got the top grades, 1s and 2s, in the three courses she had completed towards her degree, for which she had to complete a minimum of 23 courses.\nHer au-pair work had meant that she was effectively studying part-time.\nMann had studied piano and French at the University of Colorado-Boulder's music school before moving to Europe to study German in Vienna.\nThe 25-year-old described herself as an avid reader and lover of art, and literature and music.\nThe U.S. Embassy in Vienna confirmed her death and said it was working with Austrian authorities on their investigation.\n'We extend our deepest condolences to her loved ones,' the embassy told NBC News.\nThe sex game theory has parallels to the investigation into the death of American artist Ashley Olsen in Florence earlier this month.\nShe was found in her Italian apartment and had been strangled with a USB cord.","url":"https://www.dailymail.co.uk/news/article-3420834/How-did-Lauren-Mann-die-Murder-American-nanny-Vienna-remains-mystery-autopsy-fails-discover-killed.html"}
