{"authors":["Robert Wilde"],"date_download":"2018-10-30 21:25:19","date_modify":"2018-10-30 21:25:19","date_publish":"2015-08-14 23:09:30","description":"Family of Race Car Driver Kevin Ward Jr. File Wrongful Death Suit Against Tony Stewart","filename":"data/vaneerConsumption/FamilyofRaceCarDriverKevinWardJrFileWrongfulDeathSuit.json","image_url":"https://media.breitbart.com/media/2015/08/ap_tony-stewart_ap-photo-1024x682.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_08_14__1540934719.html","title":"Family of Race Car Driver Kevin Ward Jr. File Wrongful Death Suit","title_page":"Family of Race Car Driver Kevin Ward Jr. File Wrongful Death Suit","title_rss":"NULL","source_domain":"breitbart.com","text":"The family of the late Kevin Ward Jr. filed a wrongful death suit against NASCAR Sprint Cup driver Tony Stewart for causing a fatal accident on a racetrack in upstate New York, which resulted in Ward’s death.\nOn August 9, 2014, Stewart’s and Ward’s cars collided, ricocheting the young driver’s car against the wall at Canandaigua Motorsports Park. Ward got out of his vehicle and walked on the track impervious to the other cars circling. He appeared to walk toward Stewart’s speeding vehicle. Stewart’s car struck Ward with its driver’s side rear wheel. The 20-year-old Ward was pronounced dead within 45 minutes of being hit.\nThe civil law suit alleges that Stewart “lost his temper” and that “his actions” resulted in the death of Ward. Although in September a grand jury decided not to charge Stewart in criminal court, civil court requires lower standards to prove negligence or wrongdoing. Sporting News reported that legal experts, however, give the Wards little chance in court.\nWard’s mother Pam admitted to Good Morning America that she wishes that her son didn’t get out of his car after the collision. She added that she doesn’t believe Stewart intentionally tried to kill her son, but claims that “if Tony would have stayed low on the track and not gunned his engine and headed for my son, my son would still be here.”\nSubsequent Toxicology reports and Ontario County (N.Y.) District Attorney Michael Tantillo suggest that Ward smoked marijuana sometime before race that may have impaired his judgment. Pam told Good Morning America that, ”I do not believe my son was impaired.”\nGMA caught Kevin’s father, Kevin Ward Sr. in an an emotional interview, breaking down in tears recounting the tragic event.\n“Tony races every weekend,” Kevin Ward Sr. said. “Well, I know my son will never get to race again. … He took a very, very big part of my family’s life.”\nESPN legal analyst Lester Munson doesn’t think that the Wards will collect much in damages considering the circumstances. “Based on the use of marijuana and getting out of the car and standing on the track,” Munson opined, “Ward has himself in a situation where he’s going to be in the 75 to 80 percent responsible range would be my guess.”\nYet, Kevin Ward Sr. insists that “there’s no doubt [Stewart] knew what he was doing.” He contends that the stock-car icon revved the motor more than the others in the field as he went by his son.","url":"https://www.breitbart.com/sports/2015/08/14/family-of-race-car-driver-kevin-ward-jr-file-wrongful-death-suit-against-tony-stewart/"}
