{"authors":[],"date_download":"2018-10-30 20:07:15","date_modify":"2018-10-30 20:07:15","date_publish":"2017-03-28 16:19:00","description":"Tasharina Fluker and her 25-year-old daughter were found shot in the head in their Lithonia home, horrifying family. DeKalb police say they were murdered.","filename":"data/vaneerConsumption/FamilymournsmomdaughterkilledinDeKalbdoubleshooting.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/28/Images/Flukers_580x363.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-family-ta_6245087de1fde53139a35e91aa52fb1c__1540930035.html","title":"Family mourns mom, daughter killed in DeKalb double shooting","title_page":"Family mourns mom, daughter killed in DeKalb double shooting","title_rss":"NULL","source_domain":"ajc.com","text":"Monique Fluker had been to her sister’s house more times than she could count. Tasharina Fluker, a single mother of five, always insisted her Lithonia home be the center of family activities no matter how busy and tired she was from the churn of days at Emory Healthcare, kids’ ballgames and lately, problems with her boyfriend.\nBut Monique recalls her eyes so badly washed with tears last Wednesday that she couldn’t find the house in the dark morning. She’d just gotten a grim call from a relative saying he’d tried to get in the house and feared something was wrong.\nMonique was terrified of what might’ve happened to Tasharina, her little sister who’d celebrated her 42nd birthday with dinner only hours earlier.\nMonique wailed as she drove.\nA neighbor heard her.\n“I’m looking for 2659, 2659,” she pleaded to the neighbor, who pointed the way.\nFinally at 2659 Parkway Trail, Monique heard the sound of a baby crying. No one would come to the door.\nMonique and her boyfriend were desperate.\nThe boyfriend smashed a window.\nOn the couch, they found 8-month-old Treajure Myles, alone. At the foot of the stairs, the child’s mother, who was Monique’s niece, lay bloodied with a gunshot wound to the head.\nIn the master bathroom upstairs, Monique saw Tasharina’s body on the floor by the toilet. She had also been shot in the head, according to police.\nMonique was inconsolable. She wanted to do CPR, but there was so much blood.\nWhen authorities arrived, she mentioned her sister’s boyfriend, Michael Thornton.\nMichael Thornton (DeKalb County jail)\nDeKalb County police soon charged him with murder in the deaths of Tasharina and her 25-year-old daughter, Janazia Myles.\nMonique believes Thorton killed them while Tasharina was breaking up with him.\n“He knew he had to leave,” Monique told The Atlanta Journal-Constitution on Monday. “She (told me) he’s a good guy, but he’s not right for her.”\nThornton told a different story after surrendering.\nHe said the victims “jumped” him when he walked in the house, according to the police report.\nThe gun “just went off,” he said.\nThe sound scared him and he ran out of the house, he said.\nMonique quickly brushed off that story as impossible, particularly because of how the bodies were found.\nPolice also allege Thorton pulled the trigger on purpose.\nThe thought of him doing that to Tasharina of all people shocks Monique. She said Tasharina, who worked in patient accounts at Emory, was good to Thorton, helped him get by as he struggled to find steady work and she even thought of letting him stay at her home while he found a place to go after the break up.\nThis was Tasharina: thinking of everybody else.\nA collage made by family for Tasharina Fluker and daughter Janazia Myles, who died in what DeKalb County police said was a double murder near Lithonia. (Family photo)\nShe called to check on her mother religiously. She called Monique to make sure she was taking care of herself. Tasharina doted on the kids and her five grandkids, including that crying little girl on the couch, Treajure.\nHad she lived, Tasharina was planning a trip to see another baby grandchild for the first time.\nTasharina’s influence showed in Janazia's mothering skills.\n“She was a good mother just like her mom was,” Monique said of Janazia, who worked as a home health aide and leaves behind a twin.\nThe list of those mourning the slain mother and daughter goes on and on, Monique said.\nFor her, the grief is relentless.\nThrough sobs so strong they cut off her words, she confessed that she can’t sleep or eat, that her head pounds and her stomach is in knots thinking back to the crime scene.\n“We love them,” Monique said. “We’re just trying to get through this.”\nA joint memorial service for the mother and daughter is Friday at 11 a.m. at Berean Christian Church, 2201 Young Road, Stone Mountain.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/dekalb-family-tale-two-dead-bodies-and-crying-baby-girl/p98qrZV9qxAwlZOODG5iFI/"}
