{"authors":[],"date_download":"2018-10-30 20:10:40","date_modify":"2018-10-30 20:10:40","date_publish":"2016-08-04 18:57:49","description":"Joi Partridge leaned on her mother Dorothy Wright for everything, even to take Partridge’s children to church when she couldn’t.","filename":"data/vaneerConsumption/FamilysuesCollegeParkpoliceafterfatalcrash.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/04/Images/photos.medleyphoto.10832720.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_family-sues_106ee13b5f9005197c6be9893d056a7c__1540930240.html","title":"Family sues College Park police after fatal crash","title_page":"Family sues College Park police after fatal crash","title_rss":"NULL","source_domain":"ajc.com","text":"Joi Partridge leaned on her mother Dorothy Wright for everything, even to take Partridge’s children to church when she couldn’t.\nThat changed when Wright and her two grandchildren were killed in a police chase on their way to church about six months ago.\n“I think about them every day,” Partridge said. “School’s starting back and I’m used to the hustle and bustle, but there’s just nothing there. All that is gone”\nAuthorities originally said only two people, Wright and her 12-year-old grandson Cameron, were killed in the January 31 crash. They later found 6-year-old Layla, who had been ejected from the car. She was heavily covered with shrubbery near the crash scene.\nWith few answers on the crash, Partridge and her family have decided to sue the city of College Park, alleging that the city’s police department acted outside their chase policy when they decided to pursue a man in a stolen SUV.\n“The healing process is still raw because the driver has yet to be caught,” family representative Christopher Chestnut said.\nAccording to the lawsuit, the three officers who initiated the pursuit were reprimanded in other chase instances and traffic issues dating back nearly 10 years. It also says on the morning of the crash that officers were driving more than double the speed limit, including going 74 mph in a 30-mph zone.\n“The officers repeatedly did not slow down before entering intersections with a red light, even going as fast as 58 mph without ensuring that the intersection was safe and clear,” the lawsuit states. None of the officers has been reprimanded to his knowledge, Chestnut said.\nReliving the details of the crash at a news conference Thursday proved to be a bit much for a teary-eyed Partridge, who sat with her husband Doug and recounted the memories.\n“It’s a day-to-day struggle,” Doug Partridge said. “We’re at the cemetery three to four times a week. It’s not a day that we’re not impacted by this.”\nFloid Costner, Layla’s father, said it’s difficult to tell her remaining siblings why she and Cameron are no longer with them.\n“How do you explain this to young children?” Costner said. “We just want justice.”\nA sketch of the alleged hit-and-run driver was released, but he hasn’t been found. According to the lawsuit, the driver may be a teenage boy who took the SUV as part of a joy ride. A Crime Stoppers award was announced for $25,000, but there haven’t been any leads on the case.\nSaid Chestnut: “We have a whole lineage wiped out over a Chevy Suburban, a few tons of steel.”","url":"https://www.ajc.com/news/crime--law/family-sues-college-park-police-after-fatal-crash/pqtNJpF5WP9rNv6SwrXtGI/"}
