{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-23 03:59:37","date_modify":"2018-10-23 03:59:37","date_publish":"2016-01-11 16:55:13","description":"Jayden Ramshaw was just 10-months-old when he and his grandmother Joanne contracted the illness on a 'dream trip' to Sharm El Sheikh in Egypt.","filename":"data/vaneerConsumption/Familyclaimtoddlerwasleftwithbowelconditionafterdreamholiday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BCDB100000578-0-image-a-27_1452527859963.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3394024_Family-claim-toddler-left-bowel-condition-contracting-salmonella-dream-holiday-four-star-Egyptian-resort-flies-undercooked-food_1540267177.html","title":"Family claim toddler was left with bowel condition after 'dream holiday'","title_page":"Family claim toddler was left with bowel condition after 'dream holiday' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A dream trip turned into a holiday from hell for a family after salmonella food poisoning left a toddler in hospital.\nJayden Ramshaw was just 10-months-old when he was struck down with the bug, which left him with an altered bowel habit because of his young age, along with his grandmother Joanne Ramshaw, after visiting Sharm El Sheikh.\nThe family had booked into the four-star Siva Sharm Resort, in Egypt, with Joanne's daughter Gemma, 22, and her son Jordan, 20, in February.\nScroll down for video\nJayden Ramshaw was just 10-months-old when he was struck down with the bug while on holiday in Egypt\nBut their special family holiday turned into a 'disaster' after two of the group were struck down with the illness - which they claim was because of under-cooked food and flies 'swarming around the restaurant'.\nTowards the end of the holiday Joanne and Jayden began to feel unwell. The sick toddler, now 20-months-old, spent most of the plane journey home screaming with a high temperature and Joanne was too ill to look after her distressed grandson.\nWhen back on home soil Jayden was admitted to Newcastle's Royal Victoria Infirmary and was diagnosed with salmonella food poisoning.\nUpset Joanne stayed by her grandson's hospital bed during his week long stay but she was also concerned about her own illness and consulted the environmental health officials. Further tests confirmed she also had salmonella.\nJoanne Ramshaw with her grandson Jayden Ramshaw, 20 months, who were both taken ill on holiday in Egypt with food poisoning\nThe family say that Jayden spent the plane journey home screaming with a high temperature\nJoanne, 38, from Wallsend, Newcastle, suffered from diarrhoea, stomach cramps, dizziness and lethargy and continued to feel ill for weeks after the holiday.\nThe grandmother, who said she now wants answers as to how they fell so ill whilst on holiday, said: 'We spent months saving and looking forward to a special trip abroad together but both I and Jayden ended up so ill that we now wish we'd never booked the holiday.\n'Looking back at the state of the restaurant, the under-cooked food, the flies swarming around the restaurant, it was no surprise that my family fell ill.\n'I wouldn't be surprised if other guests were unwell because the conditions certainly weren't four-star.\n'Hopefully we can get some answers as to why we fell so ill.\n'It was just awful, Jayden was in hospital on a drip to keep him hydrated and had tubes up his nose as he wasn't eating. It was terrible, the worst time of my life. Jayden hasn't been the same since.'\nThe family has now instructed international personal injury lawyers at Irwin Mitchell to investigate the cause of illness at the resort which they booked with London-based Red Sea Holidays.\nLawyer, Clare Pearson, who is representing the family, said: 'It is extremely concerning to hear details of a family with young children suffering from such a serious illness and the impact it continues to have on their lives.\n'This was meant to be a dream family trip but it turned into a nightmare for the family. We are investigating the cause of their illness and to determine if it is linked to the hotel in Egypt.\n'We work with victims of holiday illness on a regular basis and see how these experiences can impact on people, especially children and the elderly who are much more vulnerable.\n'This is not the first complaint registered against the Siva Sharm Resort and if anyone has recently stayed there and experienced similar problems then we urge you to contact us in order to assist with our enquiries.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3394024/Family-claim-toddler-left-bowel-condition-contracting-salmonella-dream-holiday-four-star-Egyptian-resort-flies-undercooked-food.html"}
