{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 02:38:29","date_modify":"2018-10-23 02:38:29","date_publish":"2016-01-29 17:20:27","description":"Eloi Vasquez was run down at around 2.30am on Saturday, March 29, last year by a car going 70mph just an hour after he was last seen leaving Tau Kappa Epsilon alone.","filename":"data/vaneerConsumption/FamilyofUCBerkeleysoccerplayerkilledrunningacrossaninterstateafterapartysuefraternityclaimingtheyservedhimboozedespiteknowinghewasunderage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4652700000578-0-image-a-65_1454088024130.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423171_Family-UC-Berkeley-soccer-player-killed-running-interstate-party-sue-fraternity-claiming-served-booze-despite-knowing-underage_1540262309.html","title":"Family of UC Berkeley soccer player killed running across an interstate after a party sue fraternity claiming they served him booze despite knowing he was underage","title_page":"Family of UC Berkeley soccer player killed running across an interstate after a party sue fraternity claiming they served him booze despite knowing he was underage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The family of a 19-year-old UC Berkeley soccer star who was killed while drunkenly running across an interstate after a college party last year is suing the fraternity who hosted the event.\nEloi Vasquez was run down at around 2.30am on Saturday, March 29, by a car going 70mph just an hour after he was last seen leaving Tau Kappa Epsilon alone.\nHis family believe members of the frat let him in without an ID and served him booze even though they knew he was underage.\nThe family of 19-year-old UC Berkeley soccer star Eloi Vasquez, who was killed while drunkenly running across an interstate after a college party, is suing the fraternity who hosted the event\nAccording to the lawsuit seen by TMZ, his relatives also claim they failed to look after him when he was intoxicated and couldn't take care of himself.\nVasquez, born in Novato, California, was an accomplished soccer player who trained at France's esteemed Racing Club Strasbourg Alsace and the youth academy of Pachuca in Mexico.\nHis body was found on the state's 10 Freeway on a ramp around three blocks from the university's campus.\nPolice initially could not identify him immediately because of his injuries.\nShortly after Vasquez was last seen, he had called a friend saying he was 'screwed' and had lost his way. The economics major and soccer star at the prestigious school had then lost contact.\nReports said he was likely drunk at the time. His cousin Logan Crespan told DailyMail.com: 'He said he was going to the beach when he left the party but the closest beach was 15 miles away.'\nHis family believe members of the frat (pictured) let him in without an ID and served him booze even though they knew he was underage\nVasquez, born in Novato, California, was an accomplished soccer player who trained at France's esteemed Racing Club Strasbourg Alsace and the youth academy of Pachuca in Mexico\nVasquez's mother, Wendy Margolin, said that at around 2.20am her son had called a friend, Aurora, Cardenas, and told her he was 'screwed' and did not know where he was.\n'He pretty much said, \"I need you to come over here, I need help.' I asked him, 'Where are you?' and he told me that he was in LA and that he didn't know where he was at and that he was lost,\" Cardenas told NBC Bay Area.\n'The second time he called it just clicked. I didn't know if his phone died, or if he hung up.'\nVasquez was not a member of a fraternity.\nAt the time Cal Athletics released a statement saying: 'Eloi is a wonderful young man who has excelled both academically and athletically here at Cal,' the press release said. 'Our entire Cal Athletics family is very concerned for Eloi’s safety and our first priority is to help in any way we can to locate him.'","url":"https://www.dailymail.co.uk/news/article-3423171/Family-UC-Berkeley-soccer-player-killed-running-interstate-party-sue-fraternity-claiming-served-booze-despite-knowing-underage.html"}
