{"authors":["Kristie Rohwedder"],"date_download":"2018-10-31 01:41:16","date_modify":"2018-10-31 01:41:16","date_publish":"2018-09-14 19:37:25","description":"Just one day after reports regarding Biebzwin picking up a marriage license at a courthouse surfaced, reports regarding Justin Bieber and Hailey Baldwin reportedly getting married have arrived. And you better belieb the fan reactions to Justin…","filename":"data/vaneerConsumption/FanReactionsToJustinBieberHaileyBaldwinsWeddingReportsAreSuperEmotional.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/128f9007-c531-4819-9835-a157b0215521-photo-2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_fan-reactions-to-justin-bieber-hailey-baldwins-wedding-reports-are-super-emotional-11926006_1540950076.html","title":"Fan Reactions To Justin Bieber & Hailey Baldwin’s Wedding Reports Are Super Emotional","title_page":"Fan Reactions To Justin Bieber & Hailey Baldwin’s Wedding Reports Are Super Emotional","title_rss":"NULL","source_domain":"bustle.com","text":"Just one day after reports regarding Biebzwin picking up a marriage license at a courthouse surfaced, reports regarding Justin Bieber and Hailey Baldwin reportedly getting married have arrived. And you better belieb the fan reactions to Justin Bieber and Hailey Baldwin's wedding reports are rolling in. Again, the couple has yet to officially confirm this, but both People and E! News report sources claim the pop star and the model really did the courthouse wedding thing on Thursday, Sept. 13 in New York City. (Bustle has reached out to reps for Bieber and Baldwin for comment, but did not receive immediate response.)\nUPDATE: A few hours after Friday's marriage reports surfaced, Baldwin addressed the wedding rumors in a tweet, confirming she and Bieber did not wed just yet. She wrote,\n\"I understand where the speculation is coming from, but I’m not married yet!\"\nEARLIER: The longtime on-again, off-again couple took their relationship to new level back in July when they became fiancé and fiancée. And if Thursday's courthouse excursion means what some sources say it means, they may have taken their relationship to yet another new level. Yesterday, TMZ reported the duo was apparently spotted getting a marriage license NYC's Marriage Bureau that very day. But uh, their trip to the courthouse might've involved a little more than simply picking up some paperwork.\nAn insider claimed to People that Bieber and Baldwin “went ahead and [got married] without listening to anyone” on Thursday and plan to throw a religious ceremony and invite “everyone they love.” And according to E! News’ insider, Bieber and Baldwin “didn't tell anyone they were doing it.” The source continued, “They are doing a separate ceremony out of the country with a few family members soon as well.\"\nSpeaking of family, someone extremely close to the situation tweeted something quite curious on Friday. The morning after Bieber and Baldwin supposedly got married, Bieber's mother, Pattie Mallett, tweeted, \"Love is unconditional.\" Make of that what you will.\nAnd speaking of tweets, fans have taken to Twitter to share their reactions to the reports. Unsurprisingly, people are feeling a lot of feelings right now. Joy, shock, heartbreak (yes, beloved pop musician Bieber was already off the market before, but this would mean he is even more off the market!), confusion— it's a cornuco-Bieb-a of emotions.\nLet the caps lock flow.\nLast night, we all fell asleep assuming it'd be another 24 hours before Bieber and Baldwin could tie the knot, according to the NYC City Clerk. Oh, how wrong we might've been.\nWhoa is right.\nJust when you think you're all caught up on Biebzwin news, bam. The courthouse wedding tittle-tattle shows up.\nNot to steal Alexa's thunder, but here you go.\nWhat a kind and thoughtful sister.\nAw.\nZoinks, that truly does sound like a rollercoaster of a Friday.\nTake 'em to the hole.\nSame here. It would've been an honor to stand outside the courthouse and ring some handbells to the tune of \"As Long As You Love Me.\"\nHear, hear.\nIf Bieber and Baldwin did indeed get married at that NYC courthouse yesterday, all of the congratulations to them. And if they did not actually get hitched? Hey, all of the congratulations to the couple on getting us to belieb otherwise.","url":"https://www.bustle.com/p/fan-reactions-to-justin-bieber-hailey-baldwins-wedding-reports-are-super-emotional-11926006"}
