{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:29:46","date_modify":"2018-10-30 21:29:46","date_publish":"2016-06-07 05:17:18","description":"Bernie Sanders supporters took to social media on Monday to protest the Associated Press declaring Clinton the nominee.","filename":"data/vaneerConsumption/FansRejectAPProjectofClintonasNominee.json","image_url":"https://media.breitbart.com/media/2016/05/Bernie-Sanders-rally-in-Carson-Adelle-Nazarian-Breitbart-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_06_06__1540934986.html","title":"Fans Reject AP Project of Clinton as Nominee","title_page":"#StillSanders: Fans Reject AP Project of Clinton as Nominee","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Bernie Sanders (I-VT) supporters took to social media on Monday to protest the Associated Press declaring, one day before the highly-anticipated California primary, that Hillary Clinton had become the Democratic Party’s nominee.\nThe hashtag #StillSanders was trending on Twitter and Facebook as Sanders fans demonstrated their commitment to their candidate. Sanders spokesman Michael Briggs criticized the media’s “rush to judgement” in making such a declaration. Other responses included:\nThe AP issued a statement from its U.S. Political Editor, David Scott.\nIt takes 2,383 delegates to win the nomination of the Democratic Party, and our count finds that Hillary Clinton has reached that number. Most are pledged delegates won in a primary or caucus. Some are superdelegates, who have unequivocally told AP they will vote for her next month at the party’s convention. Hillary Clinton becomes the Democratic Party’s presumptive presidential nominee. https://t.co/40Jz20OX1qpic.twitter.com/nY2loMiOZq — AP Politics (@AP_Politics) June 7, 2016\nMany Sanders supporters have been calling the projection premature, especially since the Democratic Party’s superdelegates are only voting in July and still have time to decide who they will support.\nSanders campaign spokesman Michael Briggs issued a statement shortly after the AP made its announcement, saying the media “rushed to judgment” in declaring Clinton the nominee.\nIt is unfortunate that the media, in a rush to judgement, are ignoring the Democratic National Committee’s clear statement that it is wrong to count the votes of superdelegates before they actually vote at the convention this summer. Secretary Clinton does not have and will not have the requisite number of pledged delegates to secure the nomination. She will be dependent on superdelegates who do not vote until July 25 and who can change their minds between now and then. They include more than 400 superdelegates who endorsed Secretary Clinton 10 months before the first caucuses and primaries and long before any other candidate was in the race. Our job from now until the convention is to convince those superdelegates that Bernie is by far the strongest candidate against Donald Trump.\nA similar scenario took place in 2008, when Clinton was running against Barack Obama and vowed to take the fight for the Democratic nomination to the party’s convention. Obama’s campaign had argued that he was far ahead of Clinton in pledged delegates and that it would be mathematically unreasonable for her to catch up. Clinton’s team had countered, saying that neither candidate had secured the required 2,024 delegates required to be deemed the victor.\nObama went on to recieve enough endorsements from superdelegates to become the nominee on June 3, 2008 and Clinton conceded the nomination to him just four days later.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/local/2016/06/06/stillsanders-bernie-spokesman-says-democratic-party-nomination-still-undecided/"}
