{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:48:54","date_modify":"2018-10-30 21:48:54","date_publish":"2017-02-08 20:35:54","description":"The country music superstar said celebrities and other entertainers should realize what their fans are paying them to see.","filename":"data/vaneerConsumption/FansDontPayHardEarnedMoneytoHearPolitics.json","image_url":"https://media.breitbart.com/media/2017/02/RebaPoliticalOpinions.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2017_02_08__1540936134.html","title":"Fans Don't Pay Hard-Earned Money to Hear Politics","title_page":"Reba McEntire: Fans Don't Pay Hard-Earned Money to Hear Politics","title_rss":"NULL","source_domain":"breitbart.com","text":"Country music superstar Reba McEntire is the latest artist to endorse the idea that entertainers should not preach their political opinions to their fans.\nThe View co-host Joy Behar broached the topic with McEntire Wednesday by referencing rapper Drake’s recent F-bomb-laced anti-Donald Trump rant. “F*ck that man!” Drake told a sold-out crowd in England after a lengthy screed about Trump dividing Americans.\nBehar asked McEntire, “If you ever went on a political rant in the middle of your act, what would happen?”\n“My fans would be shocked,” the two-time Grammy-winner said. “I take it this way: they have paid their hard-earned money to come in there and fill a seat — parking, getting something at the concession stand, go and eat before the concert — I am there to entertain them, to take their worries away from them, so when they walk out, they can kind of have a little lift in their step and go, ‘Aw, that was such a great break from all the problems I have to deal with during daily life.’ So I’m not going to give them my political views.”\nAsked if her decision to keep quiet about her political views is for fear of losing half her audience, McEntire said, “That’s not as important as this is my job to entertain. It shouldn’t be my platform to be up on stage giving my political views.”\nThe Consider Me Gone singer also praised singer Lady Gaga for singing “God Bless America” and focusing on unity during her mostly nonpolitical Super Bowl halftime show performance.\nFollow Jerome Hudson on Twitter @jeromeehudson","url":"https://www.breitbart.com/entertainment/2017/02/08/reba-mcentire-entertainers-shouldnt-talk-politics/"}
