{"authors":["Press Association"],"date_download":"2018-10-23 00:09:07","date_modify":"2018-10-23 00:09:07","date_publish":"2016-01-29 12:54:30","description":"Zayn Malik's debut solo single Pillowtalk has been released for sale online. The former One Direction star tweeted a link to the download and the accompanyin...","filename":"data/vaneerConsumption/Fansdelightaszaynmalikreleasesdebutsingleonline.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-fec6e0cf-38fe-4bf1-a0ac-0fe01316e188-4PuZeKVXE7cd9005b2c876a0fe4e-921_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422245_Fans-delight-Zayn-Malik-releases-debut-single-online_1540253347.html","title":"Fans' delight as zayn malik releases debut single online","title_page":"Fans' delight as zayn malik releases debut single online | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fans' delight as Zayn Malik releases debut single online\nZayn Malik's debut solo single Pillowtalk has been released for sale online.\nThe former One Direction star tweeted a link to the download and the accompanying video after it was played on some US radio stations.\nIt appears to mark a departure from the clean brand of pop produced by his former band, with the song featuring several expletives.\nZayn Malik revealed he did not want to be in One Direction from very early on\nThe music video sees a blond Malik, 23, kissing model Gigi Hadid.\nSome of his fans on Twitter reacted with delight.\nCelebrity blogger Perez Hilton tweeted: \"I'm into the Zayn song!!\"\nEm Hariss, from Oregon in the US, tweeted: \"To be honest, I have never heard just zaynmalik 's voice before. This was a very pleasant surprise.\"\nSinger Brandon Evans said: \"I actually really like PillowTalk. It's exactly what I expected from Zayn.\"\nThe launch of his solo career follows his sudden departure from One Direction early last year.\nAhead of the single's release, Malik revealed he did not want to be in the boy band from very early on.\nMalik spent four years with Harry Styles, Niall Horan, Louis Tomlinson and Liam Payne in the band which was put together on ITV's The X Factor.\nBut he told DJ Zane Lowe: \"I think I kind of always wanted to go.\n\"I just gave it a go because it was there at the time. I think I kind of always wanted to go. From the first year, I never really wanted to be there in the band.\"\nMalik's first album is due out in March.\nWhen Malik left One Direction in March 2015, he said he wanted to be \"a normal 22-year-old who is able to relax and have some private time out of the spotlight.\"\nBut he admitted that he was quickly \"bored\" by the idea as he burst back into the limelight with Pillowtalk.\nMalik told Dave Berry on the Capital Breakfast show that being normal \"worked out for about two weeks and I got bored with it\".\nHe continued: \"I don't think I could ever go back to being completely normal, I guess that's something I accepted - this is as normal as it can get for me. I'm just trying to make music I believe in and I stand for.\"\nAsked about how he coped without the \"support networks\" of the band and his former fiancee Perrie Edwards when he quit, Malik replied: \"I didn't really think through the process, I didn't really have a plan, I just did it. But it's worked out all right, I'm in a good place.\"\nMalik also revealed that he was no longer on talking terms with ex-bandmate Louis Tomlinson, who became a father for the first time earlier this week.\nFans were quick to notice that Malik had liked a retweet of the image Tomlinson shared of him holding baby Freddie, which he said was the nod nod he could offer his former friend.\n\"Obviously I wish him the best of luck and everything and his kid's cute as f*** so I favourited it and everything. We're not talking on friend terms so that's as far as I can go by favouriting his pic,\" he said.","url":"https://www.dailymail.co.uk/wires/pa/article-3422245/Fans-delight-Zayn-Malik-releases-debut-single-online.html"}
