{"authors":[],"date_download":"2018-10-22 20:52:48","date_modify":"2018-10-22 20:52:48","date_publish":"2014-06-03 15:15:39","description":"The 12-year-old suspects, charged as adults, carried out the plot to please the online character Slender Man, Wisconsin police said.","filename":"data/vaneerConsumption/FantasySlenderManMemeInspiresHorrificWisconsinStabbing.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484231/stabbing-ejo-60214_66b495f1fea0a68afcfef54f3eaac06d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_fantasy-slender-man-meme-inspires-horrific-wisconsin-stabbing-n121311_1540241568.html","title":"Fantasy 'Slender Man' Meme Inspires Horrific Wisconsin Stabbing","title_page":"Fantasy 'Slender Man' Meme Inspires Horrific Wisconsin Stabbing","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe morning began with a game of hide-and-seek among three 12-year-old girls in the park. But a far more sinister plan — inspired by an online horror meme — was in the works, Wisconsin prosecutors say.\nAs the middle-school friends played in a wooded area Saturday morning in the Milwaukee suburb of Waukesha, one of them retrieved a five-inch blade tucked inside her waistband, according to a criminal complaint. She and another girl allegedly held the third one down and stabbed her 19 times all over her body.\nThe knife barely missed an artery near her heart, coming “one millimeter away from certain death,” the complaint said.\nThe suspects reportedly fled, leaving her to die. But the victim managed to crawl out of the woods until a bicyclist found her covered in blood on a sidewalk. She remained in stable condition Monday, authorities said.\nThe suspects appeared in Waukesha County court Monday and were charged as adults with first-degree attempted homicide. Bail was set at $500,000 each. (NBC News is not identifying the girls because of their age.)\nThe bizarre nature of the attack has stunned the community of 70,000. Even more unsettling, police say, is how the girls concocted their plan: They allegedly wanted to please an Internet meme known as the Slender Man.\nThe character is featured on the website Creepypasta Wiki, which compiles tales of fictional horror. But the girls allegedly believed Slender Man was real.\nOne of them allegedly told police that they wanted to become “proxies” of the faceless character, and would have to prove their dedication with killing, reported NBC affiliate WGBA in Green Bay. They planned to take their victim’s body to a part of Nicolet National Forest in Wisconsin's north woods, where Slender Man supposedly lives.\nThe girls had been concocting the attack since February, and were finally able to carry it out last weekend, according to the complaint. One of the suspects was allowed to have two friends over for a birthday sleepover Friday. The following morning, they went to the woods and allegedly set their plan into motion.\n“I thought, dear God, this was really happening,” one of the suspects later told police, the complaint said.\nThe victim was stabbed repeatedly in the torso, legs and arms. Police say she screamed, “I hate you. I trusted you,” to her attackers, according to the Milwaukee Journal Sentinel.\nOne of the girls later expressed some remorse, investigators said.\n“The bad part of me wanted her to die, the good part of me wanted her to live,” the girl said, according to the complaint.\nThe girls each face up to 60 years in prison if convicted as adults, although their attorney could request the charges be brought to juvenile court instead. Waukesha County District Attorney Brad Schimel told the Journal Sentinel that he would resist such a move.\n“It’s troubling when a person lashes out in anger,” Schimel said. “It’s more troubling when they lash out in cold blood. Isn’t that the worst kind of killer, the cold-blooded killer?”","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/fantasy-slender-man-meme-inspires-horrific-wisconsin-stabbing-n121311"}
