{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:06:13","date_modify":"2018-10-30 20:06:13","date_publish":"2016-11-29 16:48:13","description":"Nigel Farage has said Brexit was the “inspiration” for Donald Trump's win and “directly led to the establishment getting beaten” in the U.S.","filename":"data/vaneerConsumption/FarageSaysBrexitDirectlyLedToTrumpWin.json","image_url":"https://media.breitbart.com/media/2016/11/Nigel-farage.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_29__1540929973.html","title":"Farage Says Brexit ‘Directly Led To’ Trump Win","title_page":"Farage Says Brexit ‘Directly Led To’ Trump Win","title_rss":"NULL","source_domain":"breitbart.com","text":"Former UKIP leader Nigel Farage has said Brexit “directly led to the establishment getting beaten” in the U.S. and UKIP’s success is now “inspiring” populist movement across Europe.\n“The result of that referendum, well it’s certainly been pretty seismic in terms of British politics, but I think I would argue it may just have had a bit of an effect on the other side of the Atlantic”, UKIP’s outgoing interim leader said in London Monday.\nHe was speaking before announced of the party’s new leader, Paul Nuttall, who added: “Donald Trump has promised to ‘Make America Great Again’… We will put the Great back into Britain.”\n“Normally when it comes to trends…if New York catches a cold, then London sneezes” explained Mr. Farage, continuing:\n“But in this particular, amazing, transformative, and indeed many ways revolutionary year of 2016, it is Brexit that directly led to the establishment getting beaten on the 8th of November, and Donald J Trump about to take the presidency.\n“We were the inspiration behind much of that, and I’m pleased for it.”\n“And across the rest of Europe too… it is UKIP that is seen as the leading Euro-skeptic group”, he also said, addressing matters closer to home.\nSpeaking to the “establishment”, he warned them there is “a lot more bad news to come.”\nHe said it would be “starting in Italy, where [Matteo] Renzi will probably lose that referendum” and “Austria next Sunday, where a candidate will win the presidency who is now committed to… a referendum on their membership of the Union”.\n“And then we roll on to the elections next year. In the Netherlands, in Germany, and in France” he said, alluding the rise Geert Wilders, Marine Le Pen and the AfD.\nMr. Wilder’s Freedom party is currently polling as the largest party in the Netherlands; Mrs. Le Pen’s Front National is set to make it to the final round of France’s presidential elections; and the anti-mass migrant AfD party is more popular than ever in Germany.\n“It is UKIP that is the inspiration of Euroskeptic parties both big and small… and it is UKIP’s success in this referendum that says to people… ‘if you turn out, this rotten, liberal establishment can be beaten” he asserted.","url":"https://www.breitbart.com/europe/2016/11/29/farage-says-brexit-directly-led-trump-win-rise-populists-europe/"}
