{"authors":["Nigel Farage Mep"],"date_download":"2018-10-30 21:57:16","date_modify":"2018-10-30 21:57:16","date_publish":"2015-09-18 13:46:54","description":"The EU is using the migrant crisis to grant itself new powers, especially to defeat the smaller, Eastern Europe countries that can’t cope","filename":"data/vaneerConsumption/FARAGEFORBREITBARTEUJuggernautUsesTheMigrantCrisisToExpandPowers.json","image_url":"https://media.breitbart.com/media/2015/09/GettyImages-487232092.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_09_18__1540936636.html","title":"FARAGE FOR BREITBART: EU Juggernaut Uses The Migrant Crisis To Expand Powers","title_page":"FARAGE FOR BREITBART: EU Juggernaut Uses The Migrant Crisis To Expand Powers","title_rss":"NULL","source_domain":"breitbart.com","text":"Mrs. Merkel’s disastrous decision to say “oh come all ye faithful” has plunged the European Union (EU) into perhaps its worst time yet – the ongoing migrant crisis. After Mr Juncker’s slightly rambling state of the union speech last week, he met at the European Council with all of the Interior Ministers. Once again he pushed his idea of burden-sharing, saying that 120,000 “refugees” needed to be distributed amongst member states.\nAlthough this is a fraction of the real scale of the problem and the ongoing stampede caused by the German call, there was no agreement. In fact reports suggest quite a strong degree of hostility to his plan from Eastern European countries. The nation states had spoken and they refused.\nThen a strange thing happened. The European Parliament Martin Schulz appeared on German national television, ZDF. And during an interview about the migrant crisis and the lack of EU solidarity, Schulz said: “We will eventually have to use force and fight to push ahead” that in the end the countries would have to be forced to do the right thing. This led to some slightly hysterical online reaction with some Poles believing that the tanks were revving up to cross the border.\nFor my part, I simply couldn’t understand what he was saying. As the week then developed, the Schengen system appeared to be disintegrating with fences and borders going up, not just to countries like Serbia, outside the EU, but effectively even between EU member states. Many eurosceptics across the continent were happily predicting the demise of the whole project.\nThe European Parliament met this week for a one day plenary session on Wednesday. On Tuesday afternoon I heard that a special request had been made to extend the sitting to include Thursday going to be an important vote.\nThe EU Commission were proposing legislation to enforce burden-sharing amongst EU countries with the provision for any states that refused of a fining procedure. Never in my sixteen years in the European Parliament have I seen a piece of legislation so rapidly produced and without any warning beforehand.\nI now understood what Schulz had been saying. The fact that the European Council had refused meant that the Commission in Parliament would legislate.\nNo surprise to say that the European Parliament passed this law with an overwhelming majority. I could see a deep sense of self-satisfaction on many people’s faces. I think some of them truly believe that they are doing the right thing.\nThis law now has to go back to the same European Council that last week rejected the very concept of burden-sharing. So you may think they will simply refuse it again. To think such things is to gravely underestimate the fantasism and chicanery that lie deep at the heart of the EU project. They will be able if they choose to push this measure through under a system known as qualified majority voting which effectively means that the big countries can outvote the smaller Eastern European states.\nIt is a paradox with the modern EU that the more each of its grand designs such as the Euro and the current migrant crisis fail, the greater is the ability of Brussels to gain more powers and more centralisation.\nIn nearly every case, from Tsipras’ election victory in Greece to the current crisis, nothing stops the juggernaut. Every objection is overruled. The European Council meets again next week. One day, this whole thing will blow apart though I suspect not just yet. For now, Mr. Juncker can enjoy his fine lunches.\nPay up and look big\nLate last year it emerged that our £55 million per day membership to the EU simply wasn’t good enough and that we were to be surcharged an extra 1.7 billion sterling. Our brave Prime Minister, flushing cheek, indignantly banged the drum for British interests and said we simply would not pay this bill. Doesn’t he look wonderful on such occasions?\nGuess what? We’ve paid it. On that basis don’t hold your breath for a successful renegotiation of our terms.","url":"https://www.breitbart.com/europe/2015/09/18/nigel-farage-for-breitbart-the-eu-juggernaut-uses-the-migrant-crisis-to-expand-powers/"}
