{"authors":["James Delingpole"],"date_download":"2018-10-30 20:06:28","date_modify":"2018-10-30 20:06:28","date_publish":"2015-04-04 16:00:07","description":"An HIV-infected Nigerian immigrant has told a newspaper how \"deeply offended\" he is by UKIP leader Nigel Farage's outrageous suggestion that there might |","filename":"data/vaneerConsumption/FaragesRemarksonHealthTourismAreVeryOffensiveExplainsHIVInfectedHealthTourist.json","image_url":"https://media.breitbart.com/media/2015/04/bisi-alimi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_04_04__1540929988.html","title":"Farage's Remarks on Health Tourism Are Very Offensive Explains HIV-Infected Health Tourist","title_page":"Farage's Remarks on Health Tourism Are Very Offensive Explains HIV-Infected Health Tourist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An HIV-infected Nigerian immigrant has told a newspaper how “deeply offended” he is by UKIP leader Nigel Farage’s outrageous suggestion that there might be something wrong with the fact that HIV-infected immigrants are being treated ‘free’ courtesy of the UK taxpayer by the National Health Service.\nBisi Alimi, 40, was diagnosed with HIV in 2004 but was unable to access treatment in Nigeria for fear of being revealed to be a homosexual. When he was outed in 2007 he came to the UK.\nAlimi told the Independent that his HIV-infected blood “boiled” over Farage’s claims during last Thursday’s TV mass debate that of the 7,000 cases of HIV diagnosed every year, 60 per cent were not British-born.\nThe BBC has attempted to pour scorn on these claims.\nHowever, as Guido reports, what Farage said is quite true:\nOf the 107,800 people estimated by Public Health England to be HIV positive an astonishing 59,300 are originally from Africa. The cost to the NHS to treat just them alone with anti-retrovirals would be £1,186,000,000 per annum – and the numbers are rising.\nBut according to Alimi, this misses the point entirely.\nThe point, apparently, is that everything’s fine because Alimi didn’t come to Britain for the ‘free’ treatment (worth £20,000 a year). He came, simply, because he could enjoy a “better life” here than the one he had in his native Nigeria.\nIf there are more people with HIV infection coming from outside the UK, those people are not coming into this country because they want to take treatment. These are people, who happen to be HIV positive, who want a better life for themselves.\nPhew! Glad we cleared that one up.","url":"https://www.breitbart.com/europe/2015/04/04/farages-remarks-on-health-tourism-are-very-offensive-explains-hiv-infected-health-tourist/"}
