{"authors":["James Delingpole"],"date_download":"2018-10-30 20:06:22","date_modify":"2018-10-30 20:06:22","date_publish":"2015-04-13 13:34:27","description":"Finally, in this dullest and most dishonest of general elections, I've spotted a clear campaign winner. It's the Get UKIP party. Possibly Get UKIP's |","filename":"data/vaneerConsumption/FaragesCommentsonHIVTouristsSoContemptibleThatTheGovernmentHadtoStealHisPolicy.json","image_url":"https://media.breitbart.com/media/2015/04/farage-debate.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_04_13__1540929982.html","title":"Farage's Comments on HIV Tourists: So Contemptible That The Government Had to Steal His Policy","title_page":"Farage's Comments on HIV Tourists: So Contemptible That The Government Had to Steal His Policy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Finally, in this dullest and most dishonest of general elections, I’ve spotted a clear campaign winner. It’s the Get UKIP party.\nPossibly Get UKIP’s finest hour so far was during and after the Leaders’ Debate in which Nigel Farage pointed out unhelpfully and truthfully that over half the patients being treated for HIV by the National Health Service are not actually British nationals. In other words health tourism – which in the case of HIV cases alone is costing the British taxpayer £25,000 per patient per year – is rife and helping to undermine Britain’s national religion.\nHere, just to remind you, is how the various members of Get UKIP responded to Farage’s outrageous case of telling-it-like-it-is.\nLeanne Wood (politician in Wales’s pretend parliament; Get UKIP party) “This kind of scaremongering is dangerous, it divides communities and it creates stigma to people who are ill, and I think you ought to be ashamed of yourself.” Gary Lineker (crisp advertiser; Get UKIP party) “Always reluctant to offer a political view, but Farage is a d***”. George Osborne (Chancellor; Get UKIP party) Asked to comment said that he would “not dignify that with an answer.” Nick Clegg (Deputy Prime Minister; Get UKIP party) “Farage’s comments about foreign people with HIV were simply vile and desperate. Politics of the lowest form.” Nicola Sturgeon (Pimped Up Krankie; Get UKIP party) stated primly during the debate that views those with HIV as human beings and doesn’t ask where they come from.\nPresumably, these members of the Get UKIP party will now be taking to Twitter and other social media forums in order roundly to condemn the Government’s latest policy: under new guidelines issued by the Department of Health, patients seeking free NHS treatment will first be obliged to show their passports to prove they are eligible.\nAmong those affected by this new regulation will be HIV tourists (like this fine, upstanding gentleman from Nigeria who came to Britain for a “better life” not for the free HIV treatment, delightful bonus though that may have been).\nClearly, this will be anathema to the members of the Get UKIP party quoted above, all of whom cleave to the highly principled position that Britain’s medical resources ought to be made free to everyone in the whole world, regardless of whether or not they make any contribution to the UK exchequer.\nBut I wonder if, before they vent their outrage, some helpful adviser might want to point out to George Osborne and Nick Clegg that they both happen to be members of the government which has just introduced this policy. And also that, possibly, there’s just the slightest element of hypocrisy and double-dealing where, one minute, you condemn a politician for saying something and then the next you lift wholesale the policy for which only last week you were criticising him.","url":"https://www.breitbart.com/europe/2015/04/13/farages-comments-on-hiv-tourists-so-contemptible-that-the-government-had-to-steal-his-policy/"}
