{"authors":["Bryan Logan"],"date_download":"2018-10-30 22:52:23","date_modify":"2018-10-30 22:52:23","date_publish":"2016-12-09 00:00:00","description":"Faraday Future remains ambitious, despite its main investor's mounting financial troubles.","filename":"data/vaneerConsumption/FaradayFutureproductionvehiclevideoTeslaFerrariBentley.json","image_url":"https://amp.businessinsider.com/images/584b5203ca7f0cdf1e8b4a45-960-480.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_faraday-future-car-race-video-tesla-ferrari-bentley-2016-12_1540939943.html","title":"Faraday Future production vehicle video Tesla, Ferrari, Bentley","title_page":"    Faraday Future production vehicle video Tesla, Ferrari, Bentley - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A Bentley Bentayga SUV and a Faraday Future vehicle line up for a race. Screenshot via YouTube Faraday Future, the electric-car upstart that plans to reveal a production concept version of its car in Las Vegas in January, released a video on Friday showing its car racing a number of potential competitors.\nThe as-yet-unseen vehicle is heavily disguised in the short clip, lining up with a Bentley Bentayga, Ferrari 488 GTB, and a Tesla Model X before taking off into the distance.\nThe video is a preview, so it is unknown how the Faraday Future vehicle performed.\nAs is typical of battery powered cars, all available torque is on tap from the moment you hit the accelerator, so it is feasible to presume Faraday Future's electric car could perform similarly to a Tesla Model X or a Model S.\nWatch the video here:\nThere are many questions still lingering around Faraday Future, even as it prepares for a second debut at the Consumer Electronics Show in January. The company recently stopped construction work at its $1 billion factory in North Las Vegas due to mounting financial troubles.\nA company spokesperson told Business Insider last month that the company would focus on vehicle development and resume factory construction work sometime in 2017, but doubts remain. Faraday Future's billionaire tech investor, Jia Yueting, has run into financial trouble of late, and according to a report this week from Bloomberg, the cash crunch is spreading throughout his empire.\nStill, Faraday Future has remained confident in its prospects. Whether or not that position proves correct remains to be seen.","url":"https://www.businessinsider.com/faraday-future-car-race-video-tesla-ferrari-bentley-2016-12"}
