{"authors":["Frances Martel"],"date_download":"2018-10-30 19:28:58","date_modify":"2018-10-30 19:28:58","date_publish":"2016-03-21 14:49:13","description":"Secretary of State John Kerry will meet with the head negotiators of the FARC during his visit to Cuba alongside President Obama Monday.","filename":"data/vaneerConsumption/FARCTerroristsWillMeetJohnKerryDuringObamasCubaTrip.json","image_url":"https://media.breitbart.com/media/2016/03/FARC-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_21__1540927738.html","title":"FARC Terrorists Will Meet John Kerry During Obama's Cuba Trip","title_page":"FARC Terrorists Will Meet John Kerry During Obama's Cuba Trip","title_rss":"NULL","source_domain":"breitbart.com","text":"Secretary of State John Kerry will meet with the head negotiators of the Revolutionary Armed Forces of Colombia (FARC), the world’s largest Marxist terrorist organization, during his visit to Cuba alongside President Obama Monday.\nFARC leadership has made Havana its headquarters following years of joint Colombian miltary and CIA counterterrorism operations against them that forced them to flee the country. The group is currently engaged in “peace talks” with the government of Colombia, though the talks have yet to yield any concrete results. It is not clear what will be on the agenda for Kerry and FARC terror leaders to discuss.\nFARC negotiator Pastor Alape and a member of the Colombian government confirmed to Reuters that the meeting had been scheduled. Colombia’s El Tiempo notes that Kerry will meet with the terror leaders “to ratify [Washington’s] position as an ally of the peace negotiations but, at the same time, to give the talks a push so that the final signing of a deal does not continue to get delayed.”\nFARC leaders will meet with Kerry at 4 p.m. local time Monday. Kerry is expected to meet with Colombian government negotiators an hour prior. While Reuters speculated that the meetings may occur during an exhibition baseball game between the Tampa Bay Rays and the Cuban national team, El Tiempo reports the talks will take place at the FARC’s base in El Laguito, a high-end neighborhood in Havana populated by notable communist government allies. President Barack Obama will attend the game with Cuban dictator Raúl Castro.\nThe meeting with FARC leaders may open the Obama administration to further criticism, as the FARC remains one of the wealthiest and deadliest narco-terror organizations in the world.\nPresident Obama removed Cuba from the State Sponsors of Terrorism list last year despite its open ties to FARC leadership, among other terrorist organizations. Forbes has ranked the group the world’s wealthiest non-jihadist organization, and Reuters notes FARC terrorists have killed at least 220,000 people, not including the thousands who have gone missing and were never found. According to a recently-released UN report, peace talks with the Colombian government have done little to slow down the FARC’s violent activities. Since the beginning of peace talks last year, an estimated 1,000 children have been recruited as soldiers for guerrilla groups in Colombia. The FARC has been responsible for displacing another 230,000 during that time. The FARC has destroyed 65 schools in that timeframe, and at least 180 children have been victims of sexual violence at the hands of the terrorist group.\nDespite Cuba’s open support for this terrorist organization, President Obama announced in April 2015 that he would remove Cuba from the U.S. State Sponsors of Terrorism list. El Tiempo notes Congress will also soon debate a $450 million program to help the Colombian government implement a peace deal.\nWhether the Colombian government and FARC negotiators will sign a deal remains to be seen. President Santos announced the existence of a deal in September, holding hands with FARC leader “Timochenko” and Cuban dictator Raúl Castro. The president provided few details, only that the government would agree not to imprison a large percentage of the FARC’s membership should they hand in their weapons and be found guilty of “political crimes,” rather than “crimes against humanity.” The specific definition of these two categories was never clarified.\nSantos and FARC leaders had announced late in 2015 their intention to sign a more specific deal on March 23, 2016. Shortly before the arrival of President Obama in Cuba, Santos announced he did not feel comfortable agreeing to a specific deal by the end of the month. “I am not going to abide by the date with a bad agreement,” he said. FARC leaders agreed to wait to schedule more talks, with little indication that the terror group has ceased its activities during the peace process.","url":"https://www.breitbart.com/politics/2016/03/21/farc-terrorists-will-meet-john-kerry-during-obamas-cuba-trip/"}
