{"authors":["Ben Wilkinson For The Daily Mail"],"date_download":"2018-10-22 21:58:24","date_modify":"2018-10-22 21:58:24","date_publish":"2017-03-16 02:17:41","description":"The body of the boy, named locally as Tyler Warmington, was discovered by police at his Oxfordshire home. His mother Emma was being held on suspicion of murder.","filename":"data/vaneerConsumption/Faringdonmotherarrestedonmurderoffiveyearoldson.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E506A4500000578-0-image-a-4_1489631497270.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318632_Mother-arrested-murder-son-five_1540245504.html","title":"Faringdon mother arrested on murder of five-year-old son","title_page":"Faringdon mother arrested on murder of five-year-old son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The body of the boy, named locally as Tyler Warmington, was discovered by police at his home\nPolice have arrested a woman after her five-year-old son was found dead.\nThe body of the boy, named locally as Tyler Warmington, was discovered by police at his home.\nHis mother Emma was being held on suspicion of murder.\nFloral tributes and cuddly toys were laid in front of a police cordon yesterday at the youngster’s home in Faringdon, Oxfordshire, where he attended the local infant school.\nNeighbour Paul Fothergill, 60, said Tyler used to attend a private prep school run by his parents in Faringdon, but it closed amid financial problems last year.\nMr Fothergill said police had told neighbours that the boy’s 40-year-old mother had been arrested on suspicion of murder.\nHe added: ‘It blows you away. There might have been something that has triggered it. She doted on that little lad. I can say nothing bad about her, she was nice.’\nAnother neighbour said: ‘I think she had a job but was not working at the moment. They moved there a couple of years ago and were quiet. The lad was shy.’\nCrime scene: This is the Oxfordshire home where a child was found dead and a woman, 40, has been arrested on suspicion of murder\nNeighbour Paul Fothergill, 60, said Tyler used to attend a private prep school run by his parents in Faringdon, but it closed amid financial problems last year\nVillager Candice McArthur, 44, said: ‘Everyone is absolutely shocked and horrified. It’s a terrible tragedy, not just for the little man but for the whole wide family.\n'These things can happen anywhere, but you never expect it on your doorstep in a little market town like this. Everybody feels shock and disbelief, with a huge sense of sadness.’\nRay Saunders, the uncle of the boy’s mother, said yesterday at his home in London: ’It’s a terrible time – it’s been very emotional.’\nA card left outside Tyler’s home read: ‘Rest in peace little man! Taken far too soon, thoughts and prayers are with your family at such an awful time. Fly high angel!’\nThe results of a post-mortem examination yesterday had not been released last night.\nSuperintendent Rory Freeman, of Thames Valley Police, said: ‘This is a very shocking discovery.’","url":"https://www.dailymail.co.uk/news/article-4318632/Mother-arrested-murder-son-five.html"}
