{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:45:42","date_modify":"2018-10-23 00:45:42","date_publish":"2017-04-26 10:34:39","description":"A large reptile in Malaysia managed to raid a wooden structure and eaten one of the goats belonging to a farmer that had been sleeping there.","filename":"data/vaneerConsumption/FarmerfightsgiantpythontothedeathinMalaysia.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D88CE00000578-0-image-a-12_1493196679050.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446682_Farmer-fights-giant-python-death-Malaysia_1540255542.html","title":"Farmer fights giant python to the death in Malaysia","title_page":"Farmer fights giant python to the death in Malaysia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A hungry reptile was caught and battered to death after it had eaten a goat belonging to a farmer.\nThe python, which appeared to be 15ft-long, was found sprawled on the floor of the wooden hut in Pahang, Malaysia, earlier this month.\nIt managed to raid a wooden structure and eat one of the goats that had been sleeping there.\nHorrified villagers coaxed the snake out of the shed into a metal cage and tried to trap it with a wooden ladder.\nBut the angry serpent reared up and struck out at the gate before spreading its deadly jaws.\nRaging python caught and battered to death after it had eaten a goat belonging to a farmer. 'The snake was killed for fear,' said one of the farmers\nIt managed to slither away but locals didn't let it escape.\nTerrified inhabitants who were fearing for their safety and the lives of other goats battered the python to death with pieces of wood.\nA photo of the 15 ft python taken earlier this month in Malaysia. It managed to raid a wooden structure and eat a goat belonging to a farmer\nAhmad Riduanz, who recorded the footage, said: 'The snake was killed for fear it would eat the goat again and because of it's giant size, the security of the villagers was also threatened.'\n'The snake did not die easily. It had to be hit many times. It's a common problem so people have no patience. We have to kill them to stay safe.''\nLast month a 23ft long python was captured and cut open in neighbouring country Indonesia after swallowing missing farmer Akbar Salubiro.\nThe region is home to some of the biggest pythons in the world which can be deadly when hunting pray.\nThis is not the first time this sort of incident happened in the country. In 2016, the longest ever captured python died in Malaysia. It measured 26ft.","url":"https://www.dailymail.co.uk/news/article-4446682/Farmer-fights-giant-python-death-Malaysia.html"}
