{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-22 20:21:06","date_modify":"2018-10-22 20:21:06","date_publish":"2016-01-28 01:01:15","description":"As Lachie returns to reality TV having replaced Scott Mitchell on the upcoming series of Farmer Wants A Wife, the 37-year-old said he and his Married At First Sight 'wife' no longer talk.","filename":"data/vaneerConsumption/FarmerWantsAWifesLachieMcAleersayshehascutALLtieswithClareTamas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/23/30A5C0DD00000578-0-image-a-45_1453938767327.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420138_Farmer-Wants-Wife-star-Lachie-McAleer-says-cut-ties-Married-Sight-wife-Clare-Tamas-takes-sly-dig-her_1540239666.html","title":"Farmer Wants A Wife's Lachie McAleer says he has cut ALL ties with Clare Tamas","title_page":"Farmer Wants A Wife's Lachie McAleer says he has cut ALL ties with Clare Tamas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Their on-screen romance was short-lived, but despite Lachie McAleer and Clare Tamas calling it quits about six months ago there might still be some bad blood between them.\nAs Lachie returns to reality TV having replaced Scott Mitchell on the upcoming series of Farmer Wants A Wife, the 37-year-old said he and his Married At First Sight 'wife' no longer talk.\nChatting with OK! magazine on Thursday, the controversial star also took a sly dig at his ex, saying she had 'inundated' Scott with messages following his exclusion from the dating show.\nScroll down for video\n'No, definitely not': Farmer Wants A Wife star Lachie McAleer said on Thursday he has cut ALL ties with his Married At First Sight 'wife' Clare Tamas\nWhen Lachie was asked if he and Clare were still in touch, he answered emphatically: 'No, definitely not.'\nThe countryman from rural New South Wales also made claims that Clare had sent a barrage of calls and messages to ditched farmer Scott.\nHe told the publication he believes that Clare was at one stage calling him and that they got together.\nIndeed, in an interview News.com.au conducted with Scott in July last year, the sheep farmer supported these claims, saying he had been contacted by Clare.\nBad blood? The 37-year-old also took a sly dig at his ex, saying that she plagued Scott Mitchell (pictured) who was replaced by Lachie in the upcoming series of Farmer Wants A Wife\nControversial: Lachie was added to the dating show's cast rather last minute\nBut it was not in a romantic sense, as Scott said she made contact to share her heartbreak and humiliating experience on MAFS and to warn him about the dangers of looking for love on camera.\n'[Clare] wrote me probably 20 messages, she sent me her phone number and she said if I wanted to chat I could, so we chatted for about two hours,' he said.\n'I found it funny that Lachlan was the one that got on the show and his ex-wife is contacting me,' he added.\nCalling it quits: Scott alleges Clare called to lash out at her 'ex husband' and to warn him about the dangers of trying to find love on camera\n'He turned it on when the cameras where on us': Clare made scathing claims Lachie was only interested in MAFS for stardom\nLachie and Clare split shortly after Married At First Sight wrapped in June 2015, with Clare having delivered a scathing account of the pair's relationship in an interview with New Idea.\n'He turned it on when the cameras were on us, then was either cold or rude or distant', his flame-haired ex insisted.\n'He told me that I was his dream girl and he'd never had a connection like that before, and yet quickly departed after the last cameras, with no word,' she said.\nClare has been contacted for comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420138/Farmer-Wants-Wife-star-Lachie-McAleer-says-cut-ties-Married-Sight-wife-Clare-Tamas-takes-sly-dig-her.html"}
