{"authors":["Associated Press"],"date_download":"2018-10-22 23:38:30","date_modify":"2018-10-22 23:38:30","date_publish":"2016-01-11 06:41:36","description":"BOSTON (AP) — Shipping containers have been turned into housing, art, even playgrounds. Now, a Boston company is recycling them into high-tech mobile farms a...","filename":"data/vaneerConsumption/FarminaboxShippingcontainersreusedforfreshproduce.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:e578b87f55994cbe91bb3bf9b4c52c4b-48qEJGFphM8d437f0aaf92166b18-619_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393441_Farm-box-Shipping-containers-reused-fresh-produce_1540251510.html","title":"Farm in a box: Shipping containers reused for fresh produce","title_page":"Farm in a box: Shipping containers reused for fresh produce | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Farm in a box: Shipping containers reused for fresh produce\nBOSTON (AP) — Shipping containers have been turned into housing, art, even playgrounds. Now, a Boston company is recycling them into high-tech mobile farms as part of a new wave of companies hoping to bring more innovation to agriculture.\nFreight Farms and other indoor agriculture companies are looking to meet the growing demand for high-quality, locally grown and sustainable produce by farming fruits and vegetables in non-traditional spaces such as warehouses, industrial buildings and containers.\nThey're using hydroponics and other longstanding methods to grow plants without soil and incorporating technology that automates much of the work and reduces waste.\nIn this Tuesday, Dec. 8, 2015, photo, Freight Farms co-founder Jon Friedman positions a seedling tower under red light, inside a freight container converted into a vegetable garden in Boston. The Boston-based company is repurposing shipping containers as mobile farms. Freight Farms sells 320-square-foot containers equipped with high-tech hydroponic equipment that¿s capable of producing the typical yield for two acres of farmland in any climate, and uses 90 percent less water. (AP Photo/Steven Senne)\n\"The food system needs to be designed around technology and equipment that's available today,\" says Brad McNamara, Freight Farms' CEO and co-founder. \"It was designed 100 years ago without the right technology to reach the level that it needs to. The whole system needs to be modernized.\"\nThe company says its Leafy Green Machine helps farmers produce a consistently bountiful crop — roughly the typical yield of an acre of farmland — while using 90 percent less water, no pesticides, and just 320 square feet of space.\nClimate controls, automated lighting and irrigation systems, and mobile apps for monitoring and maintaining crops remotely also allow farmers to grow year-round with minimal oversight.\n\"Starting a farm is a lot to ask of one person,\" says company president and co-founder Jon Friedman. \"So we've put together a system that gives even a novice the tools to produce thousands of plants and get them to market.\"\nSo far, Freight Farms customers say the benefits outweigh the costs, which include the $82,000 base price for the 2016 model, as well as an estimated $8,000 to $16,500 a year in electricity, water and growing supply costs.\n\"The beauty of the Freight Farm is in its ease of use and its mobility,\" says Thomas LaGrasso III, chief operating officer at LaGrasso Bros., a Detroit produce wholesaler that's been growing lettuce in its unit since September. \"We harvest to meet our customers' daily needs. You cannot have it any fresher.\"\nLaunched in 2010, Freight Farms is considered a pioneer of container farms. About a half-dozen other companies in the U.S. offer them, including CropBox in Clinton, North Carolina; Growtainers in Dallas; and PodPonics in Atlanta.\nFreight Farms has sold 54 Leafy Green Machines, with ones already in operation on Google's campus in Mountain View, California; Stony Brook University on Long Island; and Four Burgers, a restaurant in Cambridge, Massachusetts.\nMost Freight Farm customers are growing high turnover, compact crops the company recommends — lettuce; hearty greens like kale, cabbage and Swiss chard; and herbs like mint, basil and oregano — and selling them to local restaurants and groceries and at community markets, according to McNamara and Friedman.\nJon Niedzielski, who heads the U.S. Department of Agriculture's Farm Service Agency in Massachusetts, says his office has already approved a handful of loans to farmers using Freight Farms' containers.\n\"Efficient, hydroponic systems that need little open space can make a lot of sense, particularly in urban areas with lots of potential consumers willing to pay top dollar, year-round, for lettuce and herbs,\" he says.\nIndustry experts caution that upfront costs and annual operational expenses like electricity for lighting systems that often run 18 hours a day can mean slim profit margins for would-be farmers.\nBut they also suggest technological advances are helping make indoor growing more feasible.\n\"I think it will take some development to make these systems truly sustainable,\" says Andrew Carter, an urban agriculture consultant in New York and North American region manager for the Germany-based Association for Vertical Farming. \"But I'm a firm believer in indoor agriculture and small-scale growing and think it will supply healthy, sustainable, and local food.\"\n___\nFollow Philip Marcelo at twitter.com/philmarcelo. His work can be found at http://bigstory.ap.org/journalist/philip-marcelo\nIn this Tuesday, Dec. 8, 2015, photo, Freight Farms co-founder Brad McNamara displays a lettuce seedling inside a freight container converted into a vegetable garden in Boston. The Boston-based company is repurposing shipping containers as mobile farms. Freight Farms sells 320-square-foot containers equipped with high-tech hydroponic equipment that¿s capable of producing the typical yield for two acres of farmland in any climate, and uses 90 percent less water. (AP Photo/Steven Senne)","url":"https://www.dailymail.co.uk/wires/ap/article-3393441/Farm-box-Shipping-containers-reused-fresh-produce.html"}
