{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 03:44:45","date_modify":"2018-10-23 03:44:45","date_publish":"2017-03-10 13:30:32","description":"Farmer Kenneth Hugill, 83, wept outside Hull Crown Court today after a jury took just 24 minutes to clear him of GBH after he shot a convicted burglar in the foot outside his isolated farm.","filename":"data/vaneerConsumption/FarmerKennethHugillclearedforshootingaburglar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E230FA700000578-0-image-a-8_1489152613356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301324_Farmer-weeps-cleared-shooting-burglar_1540266285.html","title":"Farmer Kenneth Hugill cleared for shooting a burglar","title_page":"Farmer Kenneth Hugill cleared for shooting a burglar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Farmer Kenneth Hugill, 83, has gone on trial for shooting a convicted burglar he thought was stealing diesel from his isolated home\nA farmer who shot a convicted burglar he thought was stealing diesel from his farm cried outside court today after a jury took just 24 minutes to clear him of GBH.\nFather-of-three Kenneth Hugill, 83, who had two hip replacements and a heart-bypass operation, was arrested, finger printed and forced to fund his own £30,000 defence after he shot Richard Stables, 44, in the foot outside his isolated farmhouse at Wilberfoss, near York.\nMr Hugill shook the hand of his solicitor and wept outside court briefly after a jury at Hull Crown Court cleared him of causing grievous bodily harm.\nToday his family revealed that following the incident their home was surrounded by armed police and a helicopter who believed they were holding a hostage more than 15 hours after the shooting.\nThe family criticised both the Police and the Crown Prosecution Service for their decision to prosecute an 83-year-old man defending his home.\nSpeaking outside the court, Mr Hugill said: 'I'm very, very pleased. It's marvellous.\n'We thought I shouldn't have been prosecuted right from the start, I didn't feel it was justified at the time.\n'I pulled the trigger because I thought that car was going to kill me.'\nMr Hugill told the court yesterday that he was 'petrified' when the Land Rover 'revved up' without lights on and set off towards him.\nHe fired two shots – one towards the side of the vehicle and another in the air to frighten the occupants away.\nStables (pictured yesterday) claimed he had stumbled on the farm and were not stealing diesel\nHUGILL FAMILY SPEAK OF THEIR RELIEF FOLLOWING THE VERDICT Speaking outside court, Mr Hugill said: 'I'm very, very pleased. It's marvellous. 'We thought I shouldn't have been prosecuted right from the start, I didn't feel it was justified at the time. 'I pulled the trigger because I thought that car was going to kill me.' His son David, 50, said: 'They (the police) told us they heard there had been a firearms offence and they were looking for hostages. 'We were very shocked with their actions and they didn't give us any explanation. 'Under the circumstances, when an 83-year-old protects his isolated farm in the middle of nowhere and the police response is very, very slow - the police are pushed to the limit and can't cover the countryside and people have the right to protect their property in the middle of the night when there is no response or back-up. 'It (the money) hits us very, very hard with being farmers; we don't have much money and it's money we'll have to borrow to pay back over 20 or 30 years. 'But the justice system works and we're very happy with the result. 'We're pleased it's all over.'\nRichard Stables, a convicted burglar, was hit in the foot and driven straight to hospital by his friend Adrian Barron, a seasoned criminal with convictions for burglary and violence.\nMr Stables suffered serious injuries but survived and gave evidence as a prosecution witness.\nThe Hugill family, pictured after today's verdict, appeared delighte as they left court\nThe terrified farmer, who walks with a crutch and has never previously been in trouble with the law, ended up being charged with grievous bodily harm and put on trial at Hull Crown Court.\nHumberside Police currently are in possession of his gun and it is unclear if he will get it back.\nConcerning his licence, Judge David Tremberg told the court that it was up to the chief constable to look at the 'renewal' of Mr Hugill's licence.\nIt is not known if Mr Hugill's licence will be taken away from him.\nYesterday he hobbled to the witness box to recall the early hours of November 13, 2015.\nThe farmer's son David Hugill, who raised the alarm after Richard Stables was shot, attended court yesterday\nHe was asleep with wife Sheila, 78, at the family farm in Wilberfoss, East Yorkshire, where he has lived and worked for almost his entire life, when he noticed a light outside as he returned from the bathroom at around 2am.\n'I saw it appear again and thought it was somebody with a flashlight, but it was so black dark I couldn't see anything,' he said.\n'The next thing I saw was the silhouette of a vehicle going past the farmhouse. I thought it was creeping up slowly with no noise and no lights on and thought it was up to no good.'\nHugill spoke to his wife, got dressed, put on his hat and went downstairs in the dark. He told police they didn't get electricity until 1954 so he could find his way around without lights.\nHe went into the yard after taking the shotgun – given to him as a 21st birthday present by his parents – and loading it with two cartridges.\n'I walked towards where I thought the vehicle was,' he said. 'I still couldn't see anything really.'\nThe farmer said he was startled by the sound of the Land Rover's engine and had little time to react.\n'I stood still and practically immediately heard the engine, very, very loud. I was petrified for a second or two and thought it was coming at me,' he said.\n'I fired the shotgun to the side of the vehicle towards the floor. The lights of the vehicle were off. I didn't want to hit anybody, just frighten them away.'\nThe isolated farm in Wilberfoss, East Yorkshire, where the incident unfolded in November 2015\nHugill said the closest he got to the car was 12 to 15ft and he never saw anyone in it.\nA second shot was fired 'straight up' as the car drove away to deter the occupants from returning, the court heard.\nOnce back inside the farmhouse he phoned his son who lives nearby, and the son called police, although they did not come out that night.\nThe court heard the men may have been on the site to steal diesel from tanks near the farmhouse and a lock had been 'tampered with'.\nFarmer Kenneth Hugill with his wife Sheila Hugill leaving Hull Crown Court yesterday\nChristopher Dunn, prosecuting, told the jury the issue was 'whether it was reasonable for Mr Hugill to act in the way he did'.\nHe said the Crown's case was that the farmer fired the gun 'recklessly' and 'without shouting' or calling the police first.\nAsked under cross-examination if it was 'a bit much' to take a shotgun outside to investigate, Hugill replied: 'I didn't know who was out there, it was only for protection.'\nYesterday Stables, who uses a wheelchair to get about because of his injuries, claimed to be 'lamping' - hunting for rabbits by torchlight - with a friend and his dog on the night of the incident.\nMr Hugill was asleep with wife Sheila, 78, at the family farm (pictured) where he has lived and worked for almost his entire life, when he noticed a light outside as he returned from the toilet\nHe said they were lost on a country road and pulled up near the defendant's farmhouse to clean up a mess the lurcher dog had made inside their Land Rover.\nMr Stables, 44, told the court he may have pointed the 'lamp' at the farmhouse window by accident but had no idea diesel tanks were nearby.\nSELF DEFENCE LAW There is no rule in law to say that a person must wait to be struck first before they may defend themselves. A person may use such force as is reasonable in the circumstances for the purposes of: self defence\ndefence of another\ndefence of a property\nprevention of crime\nlawful arrest In assessing reasonable of the force used, a judge/jury will consider two questions: Was the use of force necessary in the circumstances, i.e. Was there a need for any force at all?\nWas the force used reasonable in the circumstances?\nHe told the jury he was putting the dog back into the car when he was shot in the foot without warning.\n'As I went to shut the door I saw a figure appear. No words were spoken. Whoever was stood there fired a gun that hit my foot,' he said.\n'I felt excruciating pain. I thought my foot had gone. The shot went all the way through my foot taking all the bones with it.'\n'I thought my foot was not there. I can't remember much after, except we set off driving. I heard another shot. It may have been straight away afterwards. There were definitely two shots. One hit me in the foot. I was bleeding quite lot.'\nMr Stables said he used a rope for a tourniquet and went to York Hospital's accident and emergency unit, where he was dropped off by his friend Barron, 40.\nThe injured man gave three different versions of how he suffered his shotgun injuries before eventually admitting a farmer shot him.\nThe court heard Mr Stables had a criminal history with convictions for burglary, theft and possession of an offensive weapon.\nHe was also on a police intelligence list as a person active in rural crime after an incident in the Yorkshire Dales where an officer threatened him with CS spray.\nThe defence claimed Stables and Barron were there to steal diesel not hunt for rabbits. Roderick Hunt, defending, told Stables: 'You just made it up. It is the dog defence that burglars have when they are stopped by the police.'\nChief Crown Prosecutor for Yorkshire and Humberside Gerry Wareham said today: 'We considered all the evidence in this case extremely carefully, and took full account of the situation Mr Hugill found himself in that evening.\n'We are satisfied that there was sufficient evidence to put the matter before a court and that it was in the public interest to do so. The jury has now returned their verdict and we respect their decision.'","url":"https://www.dailymail.co.uk/news/article-4301324/Farmer-weeps-cleared-shooting-burglar.html"}
