{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-23 00:44:34","date_modify":"2018-10-23 00:44:34","date_publish":"2016-01-29 14:02:36","description":"Before the new reality series even goes to air, farmer Lachlan McAleer was peeking womens's interest on Friday night after new interview.","filename":"data/vaneerConsumption/FarmerWantsAWifesLachlanMcAleerboastsabouthisbedroomhabits.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2D63D00000578-0-image-a-32_1454076601976.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422787_Farmer-Wants-Wife-star-Lachlan-McAleer-boasts-bedroom-habits-new-interview_1540255474.html","title":"Farmer Wants A Wife's Lachlan McAleer boasts about his bedroom habits","title_page":"Farmer Wants A Wife's Lachlan McAleer boasts about his bedroom habits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Farmer Wants A Wife is set to hit screens in a matter of days.\nBut reality star Lachlan McAleer has already sparked the attention of women across Australia by boasting about his habits between the sheets in a behind-the-scenes look at the forthcoming series.\nAppearing on Friday night's edition of A Current Affair, the 37-year-old opened up about his sleeping habits, proudly telling the reporter: 'I don't snore, I keep to my own side of the bed. I think I'm very good in bed'.\nScroll down for video\n'I don't snore, I keep to my own side of the bed. I think I'm very good in bed': Farmer Wants A Wife star Lachlan McAleer, 37, revealed his bedroom habits to A Current Affair on Friday\nHis admission was made in response to a scene in the first episode of Farmer Wants A Wife, in which Lachlan slyly uses his first five-minute date to quiz his lucky ladies about whether they are 'good in bed', before clarifying that he merely meant to find out whether they snored.\n'I did have a bit of a trick question,' explained the New South Wales farmer.\n'It wasn't meant to be in any sort of rude fashion or anything,' the countryman added hurriedly.\nA loaded question! Lachlan slyly uses his first five-minute dates on the reality show to quiz his lucky ladies about whether they are 'good in bed'\nAll in jest! The countryman re-iterated that the question wasn't meant in any sort of rude fashion\n'I didn't get any slaps my way': The farmer managed to stay in the ladies' good books despite the cheeky question\n'I got some mixed responses from that and a bit of laughter. I didn't get any slaps my way so that was a good thing', he cheekily concluded.\nLachlan is back on the dating bandwagon after calling it quits with his former 'wife' Clare Tamas, who he 'wed' on reality show Married At First Sight.\nClare has since unleashed a scathing account of her relationship with Lachlan in an interview with New Idea magazine.\nFormer flame: Lachlan is back on the dating bandwagon after calling it quits with his former 'wife' Clare Tamas, who he 'wed' on reality show Married At First Sight\n'He turned it on when the cameras were on us, then was either cold or rude or distant', the red-head revealed.\n'He told me that I was his dream girl and he'd never had a connection like that before, and yet quickly departed after the last cameras, with no word,' she said.\nThe reality TV starlet says her tale is a cautionary one for the ladies set to encounter the farmer's charm on his next show, citing his appearance on MasterChef in 2010 as another flag for his search for fame.\n'He turned it on when the cameras were on us': Clare has since unleashed a scathing account of her relationship with Lachlan in an interview with New Idea magazine","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422787/Farmer-Wants-Wife-star-Lachlan-McAleer-boasts-bedroom-habits-new-interview.html"}
