{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 00:52:48","date_modify":"2018-10-23 00:52:48","date_publish":"2017-03-16 10:23:39","description":"Motorcyclist Brett Mullineaux said he was left outraged when the irate motorist spat through his visor following a confrontation in Farnworth, Greater Manchester.","filename":"data/vaneerConsumption/FarnworthdriverSPITSatmotorcyclistinhelmetcamvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53600300000578-0-image-a-34_1489659470639.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319470_Road-rage_1540255968.html","title":"Farnworth driver SPITS at motorcyclist in helmetcam video","title_page":"Farnworth driver SPITS at motorcyclist in helmetcam video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This shocking footage shows a female driver spitting twice at a motorcylist during a horrific road rage incident.\nMotorcyclist Brett Mullineaux said he was left outraged when the irate motorist spat through his visor following a confrontation in Farnworth, Greater Manchester.\nMr Mullineaux was wearing a helmet camera when the woman got out of her car on a busy A-road and unleashed a verbal tirade because she believed he cut her up.\nMr Mullineaux was wearing a helmet camera when the woman got out of her car on a busy A-road and unleashed a verbal tirade because she believed he cut her up\nMotorcyclist Brett Mullineaux (pictured with his wife Caroline), was left outraged when the motorist spat through his visor following a confrontation in Farnworth, Greater Manchester\nThe footage appears to shows her spit at his Triumph Speed Triple bike before hurling saliva directly at his face.\nMr Mullineaux, 44, from Radcliffe, Greater Manchester, said: 'I've never been spat at before. It was disgraceful.\n'My wife said \"what if you catch a disease?\" and she's right. I could have caught something.\n'She was effing and blinding at me so I had a go back and she just got out of the car and lost it. I've never seen anything like it.\n'She tried to pull in front of me started gesticulating. Admittedly I had a go back, but you don't expect somewhere to storm out of their car, let alone spit at you.\n'I went over to ask what her problem was and she was already getting out of the car, ranting and raving.\n'She started shouting that I was about to damage her car and then she had the cheek to spit on my vehicle.\n'I reminded her she was on camera and put my hand on her number plate to show I had that too and she took exception and spat in my face.'\nThe footage appears to shows her spit at his Triumph Speed Triple bike before hurling saliva directly at his face\nThe clips shows Brett and the woman arguing on Manchester Road even as traffic around them begins to move again\nThe clips shows Mr Mullineaux and the woman arguing on Manchester Road even as traffic around them begins to move again.\nThe father-of-two, who works as a commercial body repairer, said: 'I didn't really think but I'd opened my visor and she spat straight into my eyes and face.\n'I really had to restrain myself not to retaliate because spitting is one of the most disgusting things someone can do to you.\n'It caused a whole scene and plenty of people saw what she did. It wasn't nice at all.'\nMr Mullineaux confirmed he reported the incident to Greater Manchester Police.\nA spokesman for Greater Manchester Police said they were unable to retrieve details of the incident.","url":"https://www.dailymail.co.uk/news/article-4319470/Road-rage.html"}
