{"authors":["John Hayward"],"date_download":"2018-10-30 20:46:14","date_modify":"2018-10-30 20:46:14","date_publish":"2015-11-22 16:18:35","description":"In this HuffPost Live segment, host Josh Zepps worries that a wave of terrorist attacks will grant political legitimacy to \"fascists.\"","filename":"data/vaneerConsumption/FascistsLikeTrumpLePenOnlySaneVoices.json","image_url":"https://media.breitbart.com/media/2015/11/f2ab5872a37ffdc90b2751082c62597175384824.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_22__1540932374.html","title":"Fascists Like Trump, LePen Only Sane Voices","title_page":"HuffPost Live: Fascists Like Trump, LePen Only Sane Voices","title_rss":"NULL","source_domain":"breitbart.com","text":"The confused, panicked muddle of Leftist thought in the wake of the Paris terror attack is perfectly captured in this HuffPost Live segment with Howard Fineman, in which host Josh Zepps worries that a wave of terrorist attacks will grant political legitimacy to “fascists” like Marine Le Pen in France and Donald Trump in the United States… and admits those “fascists” sound like the “only sane voices in the room” to average voters.\nIt’s a classically foolish and lazy use of the “fascist” slur; fascist doesn’t mean “people a liberal dislikes,” and it’s not even synonymous with “nativist.” It’s fun to watch charges of fascism thrown around as a casual insult by people who don’t really understand what the word means, grow very nervous during serious discussions of what it does mean by people who do understand it, and flip their lids at the suggestion Islamism has fascist tendencies.\nLeaving that aside, Zepps makes an important point about the extremist nature of left-wing rhetoric after Paris. They really do sound like a pack of lunatics, with Hillary Clinton doddering to the stage to make her “Islam has nothing whatsoever to do with terrorism” proclamation just hours before terrorists in Mali began executing hostages who couldn’t recite passages from the Koran.\nWhat Zepps describes as “the Left’s inability to articulate a compelling position on the problem of Islamist jihadism” is more accurately understood as the Left’s ideological inability to understand, or even see, the problem of Islamist jihadism. The enemy is literally invisible to such as Hillary Clinton and Barack Obama, because they refuse to allow themselves to see plain facts right before their eyes.\nInstead, what they see is a delicious opportunity to turn around the narrative of a failed presidency and Clinton’s disastrous tenure as Secretary of State by attacking the enemy they can see, the one that haunts their dreams: Americans who disagree with them. Likewise, the European Left has been more interested in moral preening about their own wonderful compassionate specialness than thinking seriously about the consequences of uncontrolled mass migration, resulting in hastily-closed borders, humanitarian train wrecks, and no-go cities serving as Islamist terror incubators.\nSane, rational people are interested in serious talk about real security issues, not Clinton and Obama staging another liberal morality circus act and commanding their audiences to believe in patent nonsense.\n“We haven’t found a way yet to have a conversation that is anything but, ‘There are extremists in every religion, extremists are extremists, we mustn’t… not all Muslims are terrorists, of course they’re not… we have to be able to figure out a way to talk about it,” Zepps complained.\nAll of that chaos is emanating solely from the Left. No one else has any problem talking rationally about the issue. It’s not some inscrutable puzzle or impossible dilemna. Calling Islamist terrorism and Islamic fascism by their right names is easy, and being honest about the role Islam plays in those ideologies is vital, especially when it comes to the moderate Muslims everyone frets about. We’re not really doing those Muslims any favors by pretending groups like ISIS have nothing whatsoever to do with Islam. The moderate Muslims know better, so Leftist cant sounds unserious to them.\nWe’re simultaneously asking moderate Muslims to take the drivers’ seat around the Islamic world… and pretending we can’t see the chaps who currently occupy that seat. We’ve been telling good Muslim citizens for years that their religion was “hijacked” by extremists… but now the Left is abruptly changing its tune and saying, you know what, forget all that, these guys have nothing whatsoever to do with Islam.\nWell, which is it? Can anyone blame Muslims around the world for being a bit reluctant to sign on with a Western team that doesn’t seem to understand the rules of the game it’s playing? The many Muslims murdered by Islamic conquerors because they practice the “wrong” brand of Islam would certainly disagree with Clinton’s assertion that Islam had nothing to do with their deaths… if they were still around to speak for themselves.\nZepps is, of course, without clue when asked what he’d tell the Left to do differently. “I think you’d align yourself with as many moderate Muslim leaders as you can,” he mused. Really? We’re not doing that already? Where are the moderate Muslim leaders the Western political class hasn’t tried to align itself with since 9/11?\nThen we get the latest presentation of the liberal Strange New Respect award to George W. Bush, who they denounced as either a warmongering cowboy racist idiot or sinister oil-snatching Machiavellian mastermind until the day before yesterday, but is now supposed to be the model for not criticizing Islam.\nZepps gets around to making a serious point about how citizens need a political framework to discuss the problems with the economic, social, and security risks from open-borders dogma without being labeled racist, fascist xenophobes (never mind that he does a good bit of such labeling himself). The alternatives before us are not wide-open, zero-security borders, or a xenophobic zero-immigration police state. That’s one of the many false choices offered by open-borders zealots — in America, Europe, and Australia — who have a great deal of difficult being honest with the public about anything. That’s partially because they understand the weakness of their own position — they’re not as blind as they like to pretend they are — and partially because they loathe and distrust the common people, who they see as a benighted herd all too eager to slip into fascist nationalism.\nHoward Fineman, of course, does not have even the most rudimentary understanding of any of these points.\n“I think I want to write a piece saying ‘we’re all Muslims now,'” he chirped. “Because we all… yes, you don’t want to monkey around with somebody else’s faith — how could you presume to be involved in it? — but unless we’re all involved in the conversation about Islam and what it is, and the good things about it, the peaceful nature of it, the ennobling things about it… unless we stress that, unless we embrace that, unless we bring that into the tradition of the West wholeheartedly, then this is all gonna happen.”\nEvery Islamist terrorist in the world would agree with all that, aside from a wry chuckle over Fineman’s blather about the “peaceful nature” of their warrior faith. Their mission could be summarized as convincing people like Howard Fineman to agree that Western culture must change, and embrace their traditions “wholeheartedly,” or else “this is all gonna happen” over and over again.\nThis is the latest mutation of the Left’s indestructible conviction that Western culture is at fault for everything. We need to understand the grievances of the people who threaten us with death for drawing cartoons of Mohammed, and rewrite our silly First Amendment to accommodate them! What did we do wrong to make so many people hostile? Let’s begin with the Crusades, and make an exhaustive list!\nThe simple truth is that Western culture isn’t the problem, and we have no further need of politicians and “thinkers” who refuse to defend it wholeheartedly. They’re a danger we can no longer afford to indulge. Our culture as-is, our Constitution as written, makes ample room for every religious tradition, including some quite extreme ones… provided they keep their hands to themselves, refrain from imposing their views on others, and don’t demand our system be rewritten to handle their special demands.\nNothing about that system, or any other rational system of government, demands that citizens of the United States abandon their security concerns and throw their borders open. The first duty of our government is, and always will be, to its legal citizens, not foreign nationals. There’s nothing racist, xenophobic, or cruel about acknowledging that. Once the Left accepts that, we can begin having a rational discussion about what to do next.","url":"https://www.breitbart.com/national-security/2015/11/22/huffpost-live-host-fascist-right-like-trump-lepen-sane-voices-room/"}
