{"authors":[],"date_download":"2018-10-30 21:10:23","date_modify":"2018-10-30 21:10:23","date_publish":"2018-08-27 00:00:00","description":"Monday in Atlanta: Fashion does good, sculpture goes outdoors and music goes live","filename":"data/vaneerConsumption/Fashionshowlivemusicsculpture.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/23/Images/JFC2017-BR1_6647_preview%20(1).jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_things-and-around-atlanta-for-monday-aug__1540933823.html","title":"Fashion show, live music, sculpture","title_page":"A Monday to-do list Atlanta: Fashion show, live music, sculpture","title_rss":"NULL","source_domain":"ajc.com","text":"A public service announcement to our readers: Labor Day beckons, and with it, the traditional “bye-bye” to summer.\nThat means you’ve got one more week to stay in a vacation frame of mind. There’s not a minute to waste, so make a date with yourself to check out some or all of these fun activities happening this Monday.\n“JEFFREY FASHION CARES ATLANTA”\nMarking its 26th year here, this always anticipated event is considered the official kick-off to the fall social season in Atlanta — as well as a chance to do real philanthropic good. It begins with a cocktail reception, followed by live and silent auctions. The event culminates in a runway show in which founder, fashion retailer and style arbiter extraordinaire Jeffrey Kalinsky, presents looks from Celine, Christian Dior, Givenchy, Calvin Klein, Dries Van Noten, Sacai, Saint Laurent Paris, Balenciaga, Christian Louboutin and Manolo Blahnik. This year’s Jeffrey Fashion Cares Atlanta benefits Susan G. Komen Greater Atlanta, the Atlanta AIDS Fund (AAF) and the Medical University of South Carolina. 7 p.m. $500 reserved seating. Phipps Plaza, 3500 Peachtree Road, Atlanta. 404-420-2997, www.jeffreyfashioncares.com\n“ARTAROUND ROSWELL”\nBeautiful works of art and a little exercise and fresh air. What could be a better combination? This initiative of the Roswell Arts Fund, in partnership with the city of Roswell, features ten temporary sculptures on loan by their artists, five additional permanent sculptures purchased from earlier sculpture tours and one piece on loan from The Hagan Family Foundation. ArtAround Roswell’s pieces are displayed around Historic Roswell, parks and other parts of the city. You can find descriptions of the pieces and a printable map here. Through March 2019. Free. www.roswellartsfund.org\n“NIKKA COSTA AT CITY WINERY”\nRenowned for her live performances and her unique blend of soul and funk in her singing, Costa’s latest record, “Nikka & Strings,” features versions of Marvin Gaye’s “Ain’t That Peculiar,” Gerry and the Pacemakers “Don’t Let the Sun Catch You Crying” and other wide ranging favorites. But perhaps nothing compares to what Billboard described as her “aching rendering of Prince’s “Nothing Compares 2 U.” 8 p.m. $22-$26. City Winery, 675 Ponce de Leon Ave. N.E., Atlanta. www.citywinery.com/atlanta.\n>>See what’s in store on the weather and traffic front before you head out\nLooking for more? Listen to our weekly accessAtlanta podcast, which offers more ideas for things to do in and around Atlanta.","url":"https://www.ajc.com/entertainment/things-and-around-atlanta-for-monday-aug/PYhLA4B8NzkBB6sxHrZweI/"}
