{"authors":[],"date_download":"2018-10-30 14:07:19","date_modify":"2018-10-30 14:07:19","date_publish":"2018-10-30 00:05:06","description":null,"filename":"data/vaneerConsumption/FastTimesforFiction.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/1280px-The_Reagans_with_Michael_J._Fox_and_Nancy_McKeon.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908439.html","title":"Fast Times for Fiction","title_page":"Fast Times for FictionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Before I began work on my second novel (out this month), I thought long and hard about where, or if, it would fit in the fast-progressing culture. It takes me one year to write a book. A lot can change in a year these days. Same-sex marriage can go from a federally unpopular issue to the law of the land, with the President who vocally opposed it evolving to it at warp speed, even lighting up the White House in rainbow colors to celebrate this. The year-long certainty of electing the first woman President can turn into the shock of a macho Commander-in-Chief instead. And a TV comedienne can recapture her former glory one night only to be washed up a few months later.\nMy new novel, Paper Tigers, seemed especially vulnerable to the vicissitudes of time. It depicts the fraught romance of two new interns at the Washington Post, a cowboy conservative and a feminist fatale, in the mad age of Donald Trump. It only works because Trump won, halting progressives in mid-goosestep on their expected inexorable march toward a socialist paradise, much like the Caribbean utopia I came from, which people still risk death to flee. I worried about how far I could take Nick Jarrett, the politically incorrect half of my main couple, in a hypersensitive age, when even the anti-racism literary classic, To Kill a Mockingbird, gets banned as racist by several school districts. If Hillary had won, Nick Jarrett would have never made it to the page.\nI had already encountered liberal intransigence on my first book, Jake for Mayor, ostensibly a cute family-friendly tale inspired by the true story of a dog that ran for mayor of tiny Erie, Colorado. When my agent peddled the movie rights to leftwing enclave Hollywood, he got told it was sexist, that my protagonist-narrator was overly descriptive of women’s looks (see “The Hollywood Compliance Decree”). We both thought this horror could be easily overcome in a film version, but the “sexist” brand stuck to the work — and to me.\nRather than retreating to a safe space on Paper Tigers, I made Nick an especially “toxic” male, but gave him a foil that progressives would approve of — Laura London, a sharp, witty, sophisticated feminist beauty (there I went again), whom Nick falls for hard. Like Michael Corleone, he’d been “hit by the Thunderbolt.” … Not being a Mafioso, he would have to win Laura the old-fashioned way, with his charm. Certainly not his politics.\nI hope readers across the ideological spectrum will like the book, whether rooting for Nick or for Laura. Nick’s screen prospects would appear far more remote. But thrice in Hollywood history have audiences outwitted the best laid plans of the Industry brains, thanks to casting, or possibly miscasting. First, in the Seventies, when the intended conservative butt of liberal mockery, Archie Bunker, became one of the era’s most beloved television characters, to the consternation of his creator, Norman Lear. A decade later, the same phenomenon made Alex Keaton a hero to Reaganites in Family Ties. And this year, nineties’ feminist icon Roseanne Conner reemerged as a Trumpian champion to spectacular ratings. Of course Carrol O’Connor, Michael J. Fox, and Roseanne Barr were extraordinarily talented actors, who added unexpected dimension to their roles.\nMaybe a similar casting fluke could bring Nick Jarrett to life. It will have to bypass a sad reality — no name Hollywood actor would currently want to play him. But then a lot can change in a year. Culturally it already has.\nLou Aguilar is a published novelist, produced screenwriter, cultural essayist, and former USA Today reporter. His second novel, Paper Tigers — a Washington romance in the mad time of Trump — will be published November 13 by Deeds Publishing.","url":"https://spectator.org/fast-times-for-fiction/"}
