{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 21:18:30","date_modify":"2018-10-30 21:18:30","date_publish":"2016-01-31 14:28:31","description":"Fatah has accused Hamas of robbing Gaza's youth of their future after seven militants were buried alive while working on cross-border tunnels destroyed during in 2014.","filename":"data/vaneerConsumption/FatahCastigatesHamasInWakeOfGazaTerroristTunnelFatalities.json","image_url":"https://media.breitbart.com/media/2015/04/Hamas-tunnel-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_01_31__1540934310.html","title":"Fatah Castigates Hamas In Wake Of Gaza Terrorist Tunnel Fatalities","title_page":"Fatah Castigates Hamas In Wake Of Gaza Terrorist Tunnel Fatalities","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Fatah has accused Hamas of robbing Gaza’s youth of their future after seven militants were buried alive while working to restore a network of cross-border tunnels that Israel destroyed during the 2014 Gaza conflict.\n“Hamas trades the lives of the people of Gaza,” Fatah said on its official Facebook page. “Hamas are merchants of war.”\nThe militants were killed while digging a tunnel into Israeli territory, Hamas officials told Breitbart Jerusalem.\n“The movement gave the residents of Gaza nothing but war,” the Fatah statement read. “Hamas’ merchants of war don’t care about the living, except burying them alive between one war and another. They won’t think about the victims when the Strip is bombed again. They will forever celebrate their ‘victory’ on the ruins of the Strip and the bodies of its residents. These celebrations have one purpose – fundraising – and they are held while our brethren fall into deeper poverty, despair, and sorrow.”\n“When will they understand that they destroy our youngsters’ abilities and future?” the Fatah message continued. “When will they understand that their policy turned our children into cannon fodder and doesn’t contribute to changing reality, only to the death toll and the number of martyrs?”\n“Hamas prefers the destruction of the Gaza Strip to a Palestinian unity government and to a ceasefire with Israel,” Fatah concluded. “The tunnels only lead to death, and Hamas leaders, trying to evade their own distress, only bury more and more young men in the tunnels, whose sole purpose is to shelter the leaders.”\nHamas, in turn, demanded that Fatah apologize for their “disrespect for the spilled blood of our martyred heroes, who dig the tunnels to protect Palestine, while Fatah men promote anti-patriotic and cheap discourse. We call on Fatah to stop these pathetic accusations.”\nIn a speech on Friday, Hezbollah Secretary General Hassan Nasrallah praised the “heroes of Palestine” and said that the tunnels were “among the most effective weapons of the resistance.”\nThe exchange comes against a backdrop of sour relations between Hamas and Iran, after the Gaza leadership rejected an Iranian offer to upgrade relations in exchange for an overt condemnation of Saudi Arabia’s Middle East policy.\nAs Breitbart Jerusalem reported, Hamas has had a difficult few days.\nNot only were seven of its fighters killed last Wednesday while reconstructing a terror tunnel that collapsed in the northeast section of Gaza City.\nTo make matters worse, on Friday several Palestinians required medical treatment when the ceiling of a Gaza City store collapsed due to the number of people standing on the rooftop.\nVideo footage of the funeral incident was posted online by the Watania News Agency. A number of people can be seen falling from the roof, a few hitting the concrete below fairly hard as some in the crowd attempted to catch the falling onlookers.\nAt the funeral, senior Hamas official Ismail Haniyeh, the movement’s former prime minister, vowed to continue building tunnels to attack the Jewish state.\n“The Hamas military wing will continue with its preparations both underground and above ground,” Haniyeh declared. “On land and at sea, we will not stop until the liberation of the holy places [in Jerusalem].”","url":"https://www.breitbart.com/middle-east/2016/01/31/fatah-castigates-hamas-in-wake-of-gaza-terrorist-tunnel-fatalities/"}
