{"authors":[],"date_download":"2018-10-30 20:28:01","date_modify":"2018-10-30 20:28:01","date_publish":"2015-10-21 11:26:03","description":"The man who died in a DeKalb County apartment fire early Wednesday has been identified. Tony Hubert, 37, died in the blaze at The Parke on Covington Apartments in the 3000 block of Covington Highway.","filename":"data/vaneerConsumption/FatalapartmentblazeinDeKalbCountyEverythingsgone.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/21/Videos/4570119432001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_fatal-apartment-_8712f850fd8f160e83e24520801efb50__1540931281.html","title":"Fatal apartment blaze in DeKalb County: ‘Everything’s gone’","title_page":"Fatal apartment blaze in DeKalb County: ‘Everything’s gone’","title_rss":"NULL","source_domain":"ajc.com","text":"The man who died in a DeKalb County apartment fire early Wednesday has been identified.\nTony Hubert, 37, died in the blaze at The Parke on Covington Apartments in the 3000 block of Covington Highway.\nDeKalb County fire Capt. Eric Jackson said, “Unfortunately, we do have one fatality.”\nDeKalb fire Deputy Chief Norman Augustin said the fire appeared to have started in the second-floor room where Hubert was found dead. The cause of the fire is being investigated.\nJackson said another person who jumped from the burning two-story brick building was taken to a local hospital.\nAccording to Channel 2 Action News, Hubert’s sister said he and the woman who jumped were engaged to be married.\nKereya Wade, a neighbor whose family was able to safely get out of the burning building, said three of her neighbors were forced to jump to escape the flames.\n“One, she hurt her leg and her head real bad,” Wade said, “Tomorrow’s not promised. We don’t have anything. Everything’s gone.”","url":"https://www.ajc.com/news/local/fatal-apartment-blaze-dekalb-county-everything-gone/DzgjgpIP2oHUjfeyde2CGK/"}
ust inside I-285 near Redan Road while fire crews doused the flames, but all lanes had reopened by 9:30 a.m.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\n— Please return to AJC.com for updates.","url":"https://www.ajc.com/blog/news/fatal-apartment-blaze-dekalb-county-everything-gone/FOSqe9dNfNTPkwLN2kF75K/"}
