{"authors":[],"date_download":"2018-10-22 20:54:18","date_modify":"2018-10-22 20:54:18","date_publish":"2014-05-04 21:44:33","description":"A Stearman biplane crashed during the Thunder Over Solano Air Show at the Travis Air Force Base in Fairfield, Calif. Sunday afternoon.","filename":"data/vaneerConsumption/FatalPlaneCrashAtTravisAirForceBaseCancelsAirshow.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/419401/140504-plane-crash-jms-1741_ff158ac37e07db54f07c7416ea999192.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_fatal-plane-crash-travis-air-force-base-cancels-airshow-n96821_1540241658.html","title":"Fatal Plane Crash At Travis Air Force Base Cancels Airshow","title_page":"Fatal Plane Crash At Travis Air Force Base Cancels Airshow","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Bay Area\nA Stearman biplane crashed during the Thunder Over Solano Air Show at the Travis Air Force Base in Fairfield, Calif. Sunday afternoon, killing the pilot, the FAA said.\nLocal emergency responders were at the scene of the crash. Thousands of people were at the show, but people attending were told to leave.\nThe official Facebook page of Travis Air Force Base posted a message around 2:40 p.m. which said the air show had been canceled due to the crash:\n\"The Travis Air Expo has been canceled due to the aircraft crash of an aerial performer. Guests of the base should comply with Security Forces instruction to exit the installation. Security Forces requests for individuals to provide photo and video footage of the crash to assist in the investigation. Call 424-2000 for more information about photo and video collection.\"\nThe pilot has been identified as 77-year-old Eddie Andreini of Half Moon Bay. NBC Bay Area was performing an \"acrobatic aerial maneuver\" around 2 p.m. when he crashed, according to Col. David Mott of Travis Air Force Base.\nEyewitness pictures and video on Twitter and Instagram caught the aftermath of the crash, showing thick black smoke and fire engines rushing to the scene.\nBerkeley resident Urso Chappell tweeted out a picture from the parking lot.\n\"This is not what you want to see at an air show. A bi-plane crashed here at Travis Air Force Base.\" Chappell tweeted.\nChappell told NBC Bay Area that \"he did not see the accident happen, just the horrible aftermath.\"\n\"I had already left the air show and was in the parking lot. I just saw fire trucks heading toward the tarmac,\" he said.\nA KCRA 3 employee who was at the air show said the biplane flew into the ground while flying upside down, the station reported.","url":"https://www.nbcnews.com/news/us-news/fatal-plane-crash-travis-air-force-base-cancels-airshow-n96821"}
