{"authors":["Associated Press"],"date_download":"2018-10-23 00:17:00","date_modify":"2018-10-23 00:17:00","date_publish":"2017-03-10 06:19:12","description":"PORTLAND, Maine (AP) - Gone are the days when cyclists had to put away their bikes for the winter. These days, hard-core riders are staying outdoors year...","filename":"data/vaneerConsumption/Fatbikesallowcycliststoconquerwintersnow.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/06/wire-194341-1489127359-826_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300132_Fat-bikes-allow-cyclists-conquer-winter-snow_1540253820.html","title":"'Fat bikes' allow cyclists to conquer winter snow","title_page":"'Fat bikes' allow cyclists to conquer winter snow | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PORTLAND, Maine (AP) - Gone are the days when cyclists had to put away their bikes for the winter. These days, hard-core riders are staying outdoors year round thanks to \"fat bikes\" that allow them to conquer winter's worst instead of staying indoors on a stationary bike.\nThe bikes, with comically large tires, have come into the mainstream in the past couple of years, after being introduced about a decade ago.\nJohn Grondin, 48, of Scarborough, got his fat bike to kick the winter blues.\nIn this Saturday, Feb. 11, 2017 photo a fat tire bicyclist rides on a cross country ski trail during a race at the Sugarloaf ski resort in Carrabassett Valley, Maine. Gone are the days when cyclists had to hang up their bikes the winter. These days, many of them are grinding through winter's snow and spring's mud thanks to trendy new \"fat bikes\" with extra wide tires. (AP Photo/Robert F. Bukaty)\n\"I wanted to get outside and ride in the winter,\" he said. \"I like to ride, period. I'll ride a road bike. I'll ride a mountain bike. I just want to ride.\"\nThe ginormous tires are wide enough to float over snow and bounce over obstacles. Groomed snowmobile trails provide miles and miles of winter riding.\nFat bikes represent the first major bicycle trend in several decades, after BMX bikes in the 1970s and conventional mountain bikes in the 1980s, said Jay Townley, partner in Pennsylvania-based Gluskin-Townley Group, a consultant and market research company focusing on the bicycle business.\nGrowth in the segment has provided something to cheer about for bike retailers and has prevented a slide in bike sales, which number about 18 million units a year, he said.\n\"The industry, quite frankly, needed something. If anything, the fat tire bike helped to keep a stable bike industry instead of losing volume,\" he said.\nThe NPD Group, which tracks retail sales of bikes in the U.S., reports that fat tire bike sales have grown eightfold in the past three years, to $74.7 million in 2016.\nThe growing popularity can be seen at fat bike races.\nEvery weekend there are races and festivals across the nation's snowbelt. Dozens of riders braved single-digit temperatures in February for the \"Sugarloaf Fat Tire Festival\" at Maine's tallest ski mountain.\nThe bikes aren't cheap. Purchased at an independent bike shop, they can easily top $1,000, and the price goes up from there. But less-costly versions are being sold these days at big-box retailers like Wal-Mart.\nBike shops appreciate the extra business during what's typically a slow time of the year.\nThe Bar Harbor Bicycle Shop used to close for the winter but is now offering fat bike rentals for riding inside Maine's Acadia National Park. Cyclists can ride their fat bikes even if there's a lack of snow that sidelines snowmobiles and cross-country skiers and others winter sports, said shop manager Adam Gariepy.\nRange Morton, sales manager at Gorham Bike and Ski in Portland, said fat bike sales creep upward when there's a lack of snow that leads to a corresponding decrease in ski sales.\n\"The fat bikes really help us to get through the winter,\" Morton said. \"They were a big help last year and this year.\"\nDavid Crowell, of Laconia, New Hampshire, said riding takes him back to his childhood, except that he couldn't afford a $5,000 carbon-fiber bike when he was 12.\nGetting outdoors, there's a sense of freedom, and perhaps a bit of danger. After all, there's no way to avoid the occasional spill while bombing around in the snow. Thankfully, riders note, snow hurts less than pavement in a crash.\n\"There's something about those big fat tires - they tend to put a grin on people's faces,\" Crowell, 47, said. \"It's like being a kid. You're out there doing something. Maybe you shouldn't be doing it, but you're doing it anyway.\"\n___\nFollow David Sharp on Twitter at https://twitter.com/David_Sharp_AP. His work can be found at http://bigstory.ap.org/content/david-sharp.\nIn this Saturday, Feb. 11, 2017 photo a fat tire bicyclist rides on a cross country ski trail during a race at the Sugarloaf ski resort in Carrabassett Valley, Maine. The mountain bikes with comically large tires have been around for a decade, but they've come into the mainstream in the past five years. Research firm The NPD Group says sales have grown eightfold over the past three years. (AP Photo/Robert F. Bukaty)\nIn this Thursday, Feb. 8, 2017 photo a fat tire bike, right, is seen next to a mountain bike at the Gorham Bike and Ski shop in Portland, Maine. Fat tires have been around for a decade, but they've come into the mainstream in the past five years. The trend is good news for people seeking to get outdoors year round - and for bicycle shops that are keeping busy during the slow winter months. (AP Photo/Robert F. Bukaty)","url":"https://www.dailymail.co.uk/wires/ap/article-4300132/Fat-bikes-allow-cyclists-conquer-winter-snow.html"}
