{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 02:33:13","date_modify":"2018-10-23 02:33:13","date_publish":"2016-01-29 17:11:11","description":"Former Labour leadership hopeful Chuka Umunna, pictured, said his constituent 'massively regrets' moving his sons to London as it is more dangerous for them then living in Somalia's capital.","filename":"data/vaneerConsumption/FatherwantstotakesonsbacktoSomaliaasLondonismoredangerous.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/0F894F5900000514-0-image-a-19_1454087177034.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423162_Father-begs-allowed-sons-Somalia-s-dangerous-London_1540261993.html","title":"Father wants to take sons back to Somalia as London is more dangerous","title_page":"Father wants to take sons back to Somalia as London is more dangerous | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Unidentified man believes it would be less dangerous in Somalian capital\nChuka Umunna, pictured, said his constituent 'massively regrets' moving his sons to London\nMinisters have been begged to allow two brothers to return to Somalia after they were stabbed in separate attacks in London.\nFormer Labour leadership hopeful Chuka Umunna said his constituent 'massively regrets' moving his sons to London and believes it would be less dangerous for them to live in Somalia's capital, Mogadishu.\nOne of the brothers is living in foster care for 'his own safety' while the other cannot leave hospital as it is judged 'too unsafe' from him to live at home, Mr Umunna said.\nThe MP for Streatham, in south London, insisted the case is a 'damning indictment' of the violence on the capital's streets.\nMr Umunna told the Commons he has written to ministers asking them to issue the appropriate papers to ensure the two brothers can travel back to Somalia to be with their mother - in line with the family's wishes.\nHe raised the case during an adjournment debate addressing the issue of gangs and serious youth violence in London.\nMr Umunna said his constituent's youngest son was stabbed on the Tulse Hill estate.\nHe added: 'In recent weeks, his brother was stabbed on another estate in Streatham, was critically injured, taken to hospital and now cannot leave hospital because it has been deemed too unsafe for him to return home.\n'Both those sons are victims of serious youth and gang violence that continues to grip parts of my community.\n'This constituent had come to the UK with his sons from Somalia, a country ravaged by lawlessness, extreme violence and civil war because he wanted a better future for his children and for them to be safe.\n'He is completely bewildered by what has happened and when I asked him whether he felt his sons would be safer in Mogadishu than in London, he told me it would be less dangerous for his children to live there than here.\nA man carries a large fish through the streets of Mogadishu, Somalia, where an unidentified man said he wished he could move his two children back to from London\nPolice officers at an estate in Tulse Hill. Chuka Umunna told the Commons how the son of one of his constituent's had been stabbed on a Tulse Hill estate, prompting him to want to return his son to Somalia\n'He massively regrets moving them to this capital city of ours. That is a damning indictment of the situation on London's streets.'\nMr Umunna went on: 'I don't want to say any more about the particular case of my Somalia constituents, other than to highlight to the minister that I have written separately, in detail, about the family to ministers.\n'And I would ask, I would beg that ministers exercise their discretion in this case to grant my constituent's two sons, in particular, appropriate papers - they do not have them at the moment - so that those sons may travel back to Somalia to be with their mother as the family wishes.","url":"https://www.dailymail.co.uk/news/article-3423162/Father-begs-allowed-sons-Somalia-s-dangerous-London.html"}
