{"authors":["Liam Deacon"],"date_download":"2018-10-30 19:34:08","date_modify":"2018-10-30 19:34:08","date_publish":"2015-12-24 12:20:12","description":"A Facebook page set up at the address of the family banned from entering the US this week has discovered praising al-Qaeda & the Taliban.","filename":"data/vaneerConsumption/FatherOfMuslimDisneylandFamilyBannedFromAmericaDeniesExtremistLinks.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-24-at-11.29.01.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_24__1540928048.html","title":"Father Of Muslim ‘Disneyland Family’ Banned From America Denies Extremist Links","title_page":"Father Of Muslim ‘Disneyland Family’ Banned From America Denies Extremist Links","title_rss":"NULL","source_domain":"breitbart.com","text":"One of the fathers traveling with the Muslim family banned from entering the U.S. this week has denied any alleged links to Islamist extremism after a Facebook page set up at his home address was discovered, praising al-Qaeda and the Taliban.\nOn Tuesday Mohammad Tariq Mahmood, his brother and nine of their children were pulled from a queue at Gatwick airport by British Border Force guards and barred from traveling to the US on the instruction of U.S. Homeland Security.\nA Facebook account, set up at his London address in the name of Hamza Hussain, has now been discovered listing titles such as “supervisor at Taliban and leader at al-Qaeda”.\nAlthough one of Mr. Mahmood’s sons is called Hamza, when asked about the account, Mr. Mahmood told ITV that hackers may be to blame, adding: “That could be anything, maybe a mistake.”\nA U.S. Customs and Border Protection spokesman said that currently the “religion, faith or spiritual beliefs of an international traveler are not determining factors” when deciding if a person can travel to the US.\nHowever, the spokesman explained, people can be denied entry for a variety of reasons including health-related issues, prior criminal convictions, security concerns or on miscellaneous grounds.\nDespite claiming that they were stopped unfairly, it was reported last night the brothers “hit positive for terror checks”.\nAs reported by Breitbart London, it was revealed yesterday that Mr. Mahmood’s brother was denied entry into Israel and detained eight years ago on a “lads” trip to Middle East with a “group of older gentlemen.”\nThe Muslim Council of Britain, which was recently linked to the Muslim Brotherhood Islamist network in a government report, said that the last-minute denial of boarding privileges without explanation is distressing for Muslims.\n“There is a perception that such decisions are being made due to the faith or political activism of individuals,” the council said.\nYesterday Labour MP Stella Creasy wrote a letter to David Cameron demanding action, claiming that “a growing number of UK Muslim citizens say they have been similarly treated.”\nA Downing Street spokeswoman promptly confirmed the Prime Minister was considering the issues, and would respond in due course.","url":"https://www.breitbart.com/europe/2015/12/24/father-muslim-disneyland-family-banned-america-denies-extremist-links/"}
