{"authors":[],"date_download":"2018-10-22 20:31:01","date_modify":"2018-10-22 20:31:01","date_publish":"2014-05-02 07:32:34","description":"Nathaniel Lee Kangas, 19, was arrested in the deaths of state troopers Sgt. Patrick \"Scott\" Johnson and Gabriel \"Gabe\" Rich, who were killed Thursday.","filename":"data/vaneerConsumption/FatherandSonArrestedinDeathofTwoAlaskaStateTroopers.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/415266/140502-astbadge-4a_5b002024bfa4d2eff7efdf95a585b5d3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_father-son-arrested-death-two-alaska-state-troopers-n95391_1540240261.html","title":"Father and Son Arrested in Death of Two Alaska State Troopers","title_page":"Father and Son Arrested in Death of Two Alaska State Troopers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA 19-year-old man and his father were arrested in connection with the fatal shooting of two Alaska State Troopers who were conducting an investigation in a small, isolated village.\nPolice said Friday they arrested Nathaniel Lee Kangas in the killing of Sgt. Patrick “Scott” Johnson and trooper Gabriel “Gabe” Rich. The pair had just arrived Thursday in Tanana, about 130 miles west of Fairbanks, to follow up on a report of a firearm being brandished.\nKangas was detained following the shooting, although investigators did not immediately provide a motive. Formal charges were being prepared, police said.\nHis father, Arvin Morse Kangas, 58, was later arrested and charged with fourth-degree assault and driving with a revoked license, police said.\nAfter the shooting, troopers in full SWAT gear had surrounded a small brown house where the elder Kangas was holed up with a gun, according to local reports.\nHe was arrested without incident before 10:30 p.m. local time, reported the Alaska Dispatch.","url":"https://www.nbcnews.com/news/us-news/father-son-arrested-death-two-alaska-state-troopers-n95391"}
