{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 03:51:50","date_modify":"2018-10-23 03:51:50","date_publish":"2016-01-11 16:51:50","description":"The humorous clip sees Mike Jones, of Smithville, in Monroe County, Mississippi, staying very quiet while mimicking his daughter's dance moves and later throwing in some of his own steps.","filename":"data/vaneerConsumption/FatheroftwogirlspractisingtheWhipNaeNaesneaksupbehindtheminvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CEC1A00000578-0-image-a-132_1452530954905.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394127_Striking-blow-dad-dancers-Two-girls-practising-Whip-Nae-Nae-totally-upstaged-father-sneaks-shows-athletic-moves_1540266710.html","title":"Father of two girls practising the Whip/Nae Nae sneaks up behind them in video","title_page":"Father of two girls practising the Whip/Nae Nae sneaks up behind them in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"and both shout 'dad' in\nones of his own\nA dad 'videobombed' his two daughters dancing the Whip/Nae Nae in a clip that has taken the internet by storm.\nThe video, which has amassed just shy of a whopping 19 million views, was captured by Terry Delk Blaylock in the town of Smithville, in Monroe County, Mississippi.\nThe video shows Mike Jones sneaking up behind his two daughters as they prepare to show off their moves while dancing to popular Silento track Watch Me (Whip/Nae Nae).\nShh! Dad Mike Jones gestures to his mother to stay silent while sneaking up behind his daughters\nWatch Me! Mike begins upstaging his daughter's performance with some incredibly athletic moves\nMike, who wrestles with Outlaw Wrestling Organization under the name Studd, then begins upstaging their performance with some incredibly athletic steps.\nThe humorous clip sees him staying very quiet while mimicking their hand gestures before he later throws in some of his own moves.\nEventually his daughters sense his presence behind them and turn around to find him shaking his behind with much enthusiasm.\nThe video concludes with the girls shouting 'dad' disapprovingly before laughing as he continues to dance along to the track.\nThe dad stays very quiet while mimicking the dance moves and later throwing in some of his own steps\nThe Northeast Mississippi Daily Journal reported that Mike's daughters, aged 12 and 10, often record their dance routines in the kitchen.\nMike told the paper that after peeking his head around the door he spotted his mother filming the two girls and decided to sneak up behind them.\nIn the video you can see the wrestler gesturing to his mother to stay silent with a finger to the lips.\nMike said he has been contacted from people across the world since the video went viral, the paper reported.\nThe humorous video amassed just shy of a whopping 19 million views since first appearing online\nThe dancing dad has also received nearly 2,500 friend requests and an excess of 10,000 messages on Facebook.\nAs expected the video has received a number of comments in addition to the millions of view it has received since first appearing online.\nOne viewer wrote: 'I just laughed so loud… Greatness,' while many others suggested that the clip should be featured on The Ellen DeGeneres Show.","url":"https://www.dailymail.co.uk/news/article-3394127/Striking-blow-dad-dancers-Two-girls-practising-Whip-Nae-Nae-totally-upstaged-father-sneaks-shows-athletic-moves.html"}
