{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:11:45","date_modify":"2018-10-30 21:11:45","date_publish":"2015-03-12 20:26:40","description":"The father of an Arab-Israeli teen executed by ISIS for allegedly spying for Israel has pledged to fight for the Jewish state against ISIS.","filename":"data/vaneerConsumption/FatherofISISMurderedArabIsraeliTeenMyLoyaltyIstoIsrael.json","image_url":"https://media.breitbart.com/media/2015/03/parents-of-Israeli-teen-Muhammad-Said-Musallam-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_12__1540933905.html","title":"Father of ISIS-Murdered Arab-Israeli Teen: 'My Loyalty Is to Israel'","title_page":"Father of ISIS-Murdered Arab-Israeli Teen: 'My Loyalty Is to Israel' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The father of an Arab-Israeli teenager executed by the Islamic State (ISIS) for allegedly spying for Israel has pledged to fight on behalf of the Jewish state against the jihadi terror group.\nIn an ISIS video released on Tuesday, a young boy, known as a “Cub of the Caliphate,” shoots 19-year-old Muhammad Said Musallam in the head. Then a man standing next to him, speaking in French, goes on to threaten Israel’s destruction.\nThe deceased Jerusalem resident reportedly fled Israel and made his way to Syria to link up with the jihadist network, but then had second thoughts and attempted to disband from the terror group.\n“Muhammad learned about Islamic State on Facebook,” his brother Ahmad told The Jerusalem Post. “They said they’d give him money, a car, a house, a girl. He decided to go to Syria in October to join them,” added Ahmad, who said that Muhammad fled for Turkey in October, before linking up with ISIS just two weeks later. “He said they told him he had to get married and then fight. He thought the war would be over in three or four months,” added the brother.\nIt was then that Muhammad realized that he made the wrong move, according to his family’s testimony. The ISIS recruit called his parents via Skype and said he wanted to get back to Israel, his brother told The Jerusalem Post. “He was very sad and wanted to come back. When they saw he had become afraid and wanted to come home, they became suspicious and claimed he was a spy. The story about the Mossad is not true,” added Ahmad, who was referring to ISIS’s accusations that Muhammad was a recruit for Israel’s Mossad.\nMuhammad’s father, Said, added, “I understood from my son that Islamic State lied to him. I will sacrifice myself and my three other sons to go to war and fight against Islamic State with Israel.”\n“The leader of Islamic State [Abu Bakr Al Baghdadi] will die the way my son died. His death is coming,” pledged the grieving father.\n“My loyalty is to Israel, because my family lives in Jewish neighborhoods and no one gives us any trouble or complications,” he added.","url":"https://www.breitbart.com/national-security/2015/03/12/father-of-isis-murdered-arab-israeli-teen-my-loyalty-is-to-israel/"}
