{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-22 22:17:31","date_modify":"2018-10-22 22:17:31","date_publish":"2016-01-28 10:09:08","description":"Duncan Wilmott, 16, (pictured with his father Ryan) was playing with friends when he dived into a flooded quarry near Ipswich, west of Brisbane, and disappeared in the water.","filename":"data/vaneerConsumption/FatherofDuncanWilmottwhodrownedinCollingwoodParkquarryrefusestoleave.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB0A0E00000578-0-image-a-26_1453992559946.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420587_Father-boy-16-drowned-Collingwood-Park-quarry-refuses-leave-site_1540246651.html","title":"Father of Duncan Wilmott who drowned in Collingwood Park quarry refuses to leave","title_page":"Father of Duncan Wilmott who drowned in Collingwood Park quarry refuses to leave | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The distraught father of a 16-year-old schoolboy who drowned in a flooded quarry has said he will not leave the site until his son's body is found.\nDuncan Wilmott, 16, did not resurface after he jumped from a ledge into a water-filled former mine near Ipswich, west of Brisbane, on Monday while playing with friends.\nHis father, Ryan Wilmott, has reportedly been holding a waterside vigil at the Collingwood Park quarry with other family members as divers continue to search for the body in depths of up to 80m.\n'It's horrible, he's been in there two nights, you can't imagine what it feels like to have your son in the water for that long,' Mr Wilmott said on Wednesday, according to Fairfax Media.\nDuncan Wilmott, 16, went missing after diving into a flooded quarry and his father Ryan (pictured together) has said he will not leave the site until the his body is found\nDuncan did not resurface after he jumped from a ledge into a water-filled former mine near Ipswich, west of Brisbane\n'I'm not leaving here until they find him. We'll be out there every day until he comes up.'\nA devastated friend who was swimming with Duncan when he disappeared in the water has written an emotional tribute, saying how he tried to save the teenager.\n'I just wish everyone knew how hard I tried,' Shane Alston wrote on his friend's Facebook tribute page.\n'We should of had more people with us bro. I'm sorry I turned around and went back to the surface. I'm sorry I let you sink bro.\nDuncan dived into the water, briefly resurfaced, then disappeared below at around 10.45am on Monday\nA dive squad is continuing to comb the flooded quarry for the body, but the search has been hampered by submerged car bodies, trees and large boulders\n'I cry all the time. This time I wasn't quick enough.'\nDuncan dived into the water, briefly resurfaced, then disappeared below at around 10.45am on Monday.\nIt is understood when he resurfaced, a friend was immediately aware that something was wrong and phoned emergency services.\nThey were believed to be part of a group that trespassed on private land at Collingwood Park to go swimming at the old mine site.\nA dive squad is continuing to comb the flooded quarry for the body, but the search has been hampered by submerged car bodies, trees and large boulders.\nThe boy's distraught family reportedly watched on as the search entered its fourth day on Thursday.\nMr Wilmott, an estate agent, posted an emotional tribute (shown) to his 'best mate' on Monday\nThe boy's distraught family reportedly watched on as the search entered its fourth day on Thursday\nDuncan's mother, Nicole Kable, has asked anyone visiting the quarry to avoid throwing anything else into the water as it could hinder the search.\n'We just want a better chance at finding our son,' she said.\nShe has been watching the progress of the search at the waterside vigil along with Duncan's sister and father.\nMr Wilmott, an estate agent, posted an emotional tribute to his 'best mate' on Monday.\n'Today my 16 yo son passed away (sic). We will keep everyone informed of when and where the funeral will be.\n'God bless my son. Duncan Cameron Wilmott. R.I.P my best mate.'\nA devastated friend who was swimming with Duncan when he disappeared in the water has written an emotional tribute, saying how he tried to save the teenager\nSonar equipment has been used in the search, but police said divers were having to battle with difficult and hazardous conditions.\n'The site itself is very hazardous for the divers, it's a very deep site, well past their depth range and the inside of the mine site is full of water, which is quite cold down there, being fresh water,' he said.\nFriends have also paid tribute to the teenager who was due to start his final school year at Ipswich State High School on Wednesday.\nBlake Lewis‎ said: 'I miss you brother. I would give anything to hear your voice once last time.\n'I need you back brother I can't do this with out you. You will always be in my heart.'","url":"https://www.dailymail.co.uk/news/article-3420587/Father-boy-16-drowned-Collingwood-Park-quarry-refuses-leave-site.html"}
