{"authors":[],"date_download":"2018-10-30 01:00:07","date_modify":"2018-10-30 01:00:07","date_publish":"2018-09-03 01:11:30","description":"John Isner cannot wait to be a first-time father, and claims that if his wife Madison McKinley goes into labor before the baby’s due date, September 22, he’s outta here. This might be a shame for American men’s tennis, because with his admirable five-set win over Milos Raonic on Sunday, Isner is the only American in the singles draw during week two.","filename":"data/vaneerConsumption/FatherhoodTakesOveratUSOpen.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Isner_autograph_14523327946.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861207.html","title":"Fatherhood Takes Over at U.S. Open","title_page":"Fatherhood Takes Over at U.S. OpenThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"John Isner cannot wait to be a first-time father, and claims that if his wife Madison McKinley goes into labor before the baby’s due date, September 22, he’s outta here. This might be a shame for American men’s tennis, because with his admirable five-set win over Milos Raonic on Sunday, Isner is the only American in the singles draw during week two.\nTennys Sandgren and Austin Krajicek, as well as Mike Bryan and Jack Sock, are playing the best tennis in the doubles draw, so the loss would be balanced somewhat; and if the baby arrives any day but Tuesday, Friday, or Sunday, all will be well.\nOf course it depends also on how well the happy man continues his run. It is only the second time Isner makes the quarterfinals. Few Americans have been there since Andy Roddick won it all in 2003. Isner’s quarterfinal opponent will be Juan-Martin del Potro, who decisively beat Borna Coric last night and, as it happens, is having a run reminiscent of 2009, the year he beat Roger Federer in a thrilling five-set final. Injuries made him consider retiring from competition, but the Argentine, who led his team to its first Davis Cup triumph in 2016, has steadily rehabbed his body and returned his game to the level of nearly 10 years ago, when he appeared to be the one who would join Federer and Nadal, then Novak Djokovic and Andy Murray, at the top of the Tour.\nIndeed, Murray must have envied the way del Potro demolished Fernando Verdasco, the power-hitting Spaniard whom the great (and sometimes ill-tempered) Scot all but accused of cheating during the ten-minute heat-rule break they took during their third round match. The rule is clear: refreshing ice bath, okay, coaching, no-no. Verdasco’s coach was in the bathroom, or locker room, but Verdasco later said he was going to the bathroom, meaning the toilet, not the bath (sure hope not), and no words were exchanged except, according to Marcos Baghdatis, who was also there — everybody was hot that day, or what? — something like “where’s the john?” no offense to anyone called John. His coach is a man name Nacha Turyol, and maybe he goes to the bathroom often.\nBaghdatis, however, observed that while no words were exchanged, it is correct, by the rules, he should not even have been there and, moreover, the chaperone who is supposed to follow players like hawks whenever they leave the court, was not there. “Nobody knows the rules,” Murray is reported to have thundered. He is surely right, and not only in tennis.\nAt any rate, del Potro took the power that had overwhelmed Andy Murray and swatted it away like flies, winning in three handy sets. Well, Verdasco is by marriage in with the Iglesias music family, he’ll be fine.\nOn the not so fine side, the unpredictable Australian prodigy Nick Kyrgios took the beating of the tournament at the hands of Roger Federer, who played the most flawless tennis of the week. It was simply astonishing, and Kyrgios himself finally could only shake his head in wonder. He made drop shots, Federer caught them; one that was very low and over the deuce side alley he even hit around the post for a winner. He hit lobs, Federer smashed them to smithereens with overheads. He went to the net, Federer passed him like a sniper. Three sets and done, 6-4 6-1, 7-5, and the only reason for the lost games was that Kyrgios’s serve, which Federer has called one of the best in the sport, was working well. But he never came close to a serious challenge, with the maestro sloughing off the few break points the younger man earned and taking back command whenever he needed to.\nIn the most anticipated match of the women’s draw, Serena Williams overwhelmed her sister Venus, who was expected to put up a stiffer resistance and maybe even win, as she did at their most recent match-up at Indian Wells. But she could not do anything to blunt Serena’s top-form serve, while her own redoubtable winners, particularly her mighty backhand, lacked their usual accuracy. The other anti-climatic match came when Maria Sharapova demolished Latvian prodigy Jelena Ostapenko, perhaps signaling that she is at last back from her career-damaging doping suspension and may be a dark-horse contender (she was wearing a tennis version of the little black dress, it would be swell to see that against Serena’s cute tutu, but don’t tell anyone I wrote this). Of course, alternately Jelena (who wore the same sort of dress, same color, plus she too is blonde, it was hard to tell them apart) might have been having an awful night; which explanation may also apply to Venus.\nHowever, there was a superb match, as the young Australian prodigy Alex de Minaur won the first two sets and almost upset former U.S. Open champion Marin Cilic but finally succumbed to the big Croatian’s power and persistence, which observers tend to underestimate.\nWhat you cannot overestimate, however, is some media’s persistence in seeking a story that is not the one in front of their noses. Which is bizarre because you would think the fact that thousands of fans are seeing what is happening would concentrate the mind on what is said and done.\nAsked his view of the umpire climbing down from his chair to talk to Nick Kyrgios during a match he was losing to Pierre-Hughes Herbert, Roger Federer politely observed it is not the ump’s responsibility to check on whether a player is tanking or is ill. The reporter asked Federer if he understood the question. Federer: “I understood your question. Did you understand my answer?”\nToo much to ask, alas. But the show goes on, with daily attendance smashing records despite the heat. So all’s cool in Queens. Cheers to young parents-to-be John and Madison, who know they can always turn for advice to Mr. Roger, who with two sets of twins knows best.","url":"https://spectator.org/fatherhood-takes-over-at-u-s-open/"}
