{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 01:52:31","date_modify":"2018-10-23 01:52:31","date_publish":"2016-01-28 16:20:51","description":"Bruce Jorgensen (right), 58, was arrested Tuesday at Miami International Airport and charged with unlawful desertion of a child. His 16-year-old son, Aage (left), has been missing for over a month.","filename":"data/vaneerConsumption/FatherofmissingFloridateenAageJorgensenarrestedbuyingtickettoNewZealand.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AB523400000578-0-image-a-46_1453997110430.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421165_Father-Florida-teen-s-missing-month-arrested-buying-one-way-ticket-New-Zealand_1540259551.html","title":"Father of missing Florida teen Aage Jorgensen arrested buying ticket to New Zealand","title_page":"Father of missing Florida teen Aage Jorgensen arrested buying ticket to New Zealand | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The father of a 16-year-old Florida boy who has been missing for more than a month was arrested at Miami International Airport after purchasing a one-way ticket to New Zealand.\nBruce Jorgensen, 58, was taken into custody on Tuesday and charged with unlawful desertion of a child.\nThe man's son, Aage Jorgensen, was last seen on December 27 when his father allegedly forced him out of his car in the Fort Lauderdale suburb of Sunrise for being disrespectful.\nScroll down for video\nCaught: Bruce Jorgensen (left), 58, was arrested at Miami International Airport after purchasing a one-way ticket to New Zealand. His 16-year-old son, Aage (right), has been missing since late December\nPolice say Bruce Jorgensen kicked his son out of his car on December 27 for being rude and failed to report him as missing\nPolice said earlier that Jorgensen has been uncooperative with the investigation and never filed a missing person report.\nThey only learned of Aage’s disappearance on January 9 after Bruce Jorgensen was spotted handing out ‘missing’ flyers around town.\nAthlete: The father and son moved to Plantation, Florida, last summer so Aage, pictured above with a trophy, could play tennis there\nIn a press release put out after the father's arrest Tuesday, Plantation police said foul play is not suspected at this time.\nDetective Philip Toman said Aage, a student at American Heritage School, has a history of running away from home, and police suspect he may be hiding in Broward County, reported the Sun-Sentinel.\nKristen Lake, a long-time friend of Bruce Jorgensen’s, told CBS Miami the father and son moved to Plantation in the summer of 2015 so Aage could play tennis there.\nJorgensen has been raising Aage on his own and was said to be estranged from the rest of his family.\nCBS reported that the 58-year-old has been paying in cash for most things, including thousands of dollars in rent and private school tuition for Aage.\nJorgensen withdrew his son from American Heritage School after the winter break.\nWhen interviewed by police, the father said that he kicked his son out of his car while driving along Northwest 136th Avenue in Sunrise on December 27 because the boy was being rude to him.\nA woman later told police that on that day, she was approached by the teen asking her for a ride.\nThe elder Jorgensen had his initial court appearance Wednesday and was ordered held without bond.\nAage Jorgensen is described as 5-foot-9, weighing 140lbs, with short brown hair and brown eyes. He was last seen wearing a peach-colored Adidas T-shirt, white cargo shorts and flips flops.\nAnyone with information on his whereabouts is being asked to call police at 954-797-2100.","url":"https://www.dailymail.co.uk/news/article-3421165/Father-Florida-teen-s-missing-month-arrested-buying-one-way-ticket-New-Zealand.html"}
