{"authors":[],"date_download":"2018-10-22 21:57:02","date_modify":"2018-10-22 21:57:02","date_publish":"2014-05-08 19:08:51","description":"Scientists unravel how polar bears have such an incredibly high-fat diet without clogging their arteries and having a heart attack.","filename":"data/vaneerConsumption/FattyHeartAttackDietNoProblemIfYoureaPolarBear.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/429991/140508-science-polarbears_fe2cb3e5cbeb94eeb7711e52c90245a8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_fatty-heart-attack-diet-no-problem-if-youre-polar-bear-n100636_1540245422.html","title":"Fatty 'Heart Attack' Diet? No Problem - If You're a Polar Bear","title_page":"Fatty 'Heart Attack' Diet? No Problem - If You're a Polar Bear","title_rss":"NULL","source_domain":"nbcnews.com","text":"Multiple genes related to cardiovascular function and fatty acid metabolism have changed radically through mutations to permit a high-fat menu without high risk of heart disease, the researchers said.\n\"For polar bears, being very fat is no problem,\" said Eline Lorenzen, a molecular ecologist at the University of California, Berkeley.\nIn the Arctic regions where they live, energy is in high demand and polar bears have lots of fatty tissue to do the job. Up to half their body weight can be fat and their source of fresh water is metabolic water — water that is a byproduct of the breakdown of fat in the body, Lorenzen said.\n\"They essentially live in a polar desert,\" Lorenzen added.\nThe researchers deciphered the genome — the genetic blueprint — of the polar bear based on blood and tissue samples from 79 polar bears from Greenland. They also used samples from 10 brown bears to study the genome of that species.\nRasmus Nielsen, an evolutionary geneticist at the University of California, Berkeley, said genetic data showed polar bears diverged as a species from brown bears much more recently than previously thought — perhaps 400,000 years ago. Some previous estimates had placed the origin of polar bears as long as 5 million years ago.\n\"In this short amount of time, polar bears have adapted to the cold environment of the Arctic and to a new diet. We see the footprints of this adaptation in the genome of the polar bear,\" Nielsen said.\nThe study was published on Thursday in the journal Cell.\n— Will Dunham, Reuters","url":"https://www.nbcnews.com/science/science-news/fatty-heart-attack-diet-no-problem-if-youre-polar-bear-n100636"}
