{"authors":[],"date_download":"2018-10-22 23:02:00","date_modify":"2018-10-22 23:02:00","date_publish":"2014-06-11 19:26:12","description":"Toyota is recalling nearly 2.3 million vehicles globally, many for the second time, because of Takata air bags that could have problems.","filename":"data/vaneerConsumption/FaultyTakataAirbagsPromptExpandedToyotaRecall.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_12/262776/140319-toyota-logo-930a_c1d0d8a28f5157ba8420f07bc3fae068.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_faulty-takata-airbags-prompt-expanded-toyota-recall-n128786_1540249320.html","title":"Faulty Takata Airbags Prompt Expanded Toyota Recall","title_page":"Faulty Takata Airbags Prompt Expanded Toyota Recall","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTakata Corp.'s safety crisis deepened Wednesday after Toyota Motor Corp. recalled almost 2.3 million vehicles globally, many for the second time, and the Japanese air bag maker warned that further fixes may be needed.\nThe world's largest automaker called back 1.62 million vehicles outside of Japan that it recalled last year as well as 650,000 more in Japan not previously recalled. The additional vehicles brought to more than 7 million the total number of cars equipped with Takata air bags to be called back worldwide over the last five years.\nSign up for top Business news direct to your inbox.\nThe latest recall, which includes Corolla and Camry sedans and Tundra trucks, led U.S. safety regulators at the National Highway Traffic Safety Administration to open an investigation on Wednesday into vehicles equipped with Takata air bags. The company, the world's No. 2 manufacturer of auto safety equipment, said other automakers may have to issue recalls because of problems with tracking potential defects related to air bag inflators that date back over a decade.\nToyota expanded its recall because Takata said it had discovered record-keeping errors at a Mexican plant where potentially faulty air bag inflators were made in 2001 and 2002.\nWhile Toyota’s recall covers passenger side air bags, the NHTSA probe documents cited reports of both driver and passenger side air bags not working properly or rupturing. Takata did not immediately respond to a request for comment on the new investigation.\nToyota's expanded recall comes at a time when General Motors is under intense scrutiny over why it took more than a decade to discover a defective ignition switch linked to at least 13 deaths. In 2013, carmakers including Toyota, Honda Motor Co., Nissan Motor Co. and BMW recalled about 3.6 million vehicles because of flaws in Takata air bag inflators that could cause them to explode in an accident.\nThe Takata-related recall in 2013 was the largest air bag-related recall in history and came after a series of recalls, accidents and at least two deaths alleged to have been caused by faulty air bags.\nNHTSA said it has opened a probe into an estimated 1,092,000 vehicles made by not only Toyota, but also Honda, Nissan, Mazda and Fiat SpA's Chrysler Group after receiving six reports of air bags not deploying properly in the humid climates of Florida and Puerto Rico.\n-Reuters","url":"https://www.nbcnews.com/business/autos/faulty-takata-airbags-prompt-expanded-toyota-recall-n128786"}
