{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 21:47:08","date_modify":"2018-10-22 21:47:08","date_publish":"2016-01-11 01:37:54","description":"A study of 8,000 Britons by a feminist pressure group revealed that women are less likely than men to want full equality between the sexes. It also found the issue less popular among the younger generation.","filename":"data/vaneerConsumption/FawcettSocietysaysmostmenwantwomentohaveequalopportunities.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001DF1300000578-0-image-a-12_1452475838556.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393224_Equality-Men-keen-women-Survey-says-86-cent-want-women-lives-equal-opportunities_1540244828.html","title":"Fawcett Society says most men want women to have equal opportunities","title_page":"Fawcett Society says most men want women to have equal opportunities | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Women are less likely than men to want full equality between the sexes, research by a feminist pressure group reveals.\nThe poll for the Fawcett Society showed that 86 per cent of men wish for women to have exactly the same opportunities.\nBut only 81 per cent of women say they want equality for themselves or the other women in their families.\nBattle of the sexes? A survey shows when it comes to equality men are more keen than women (file photo)\nIn terms of whether equality would be good for the economy, 76 per cent agreed against 71 per cent for men.\nOnly 21 per cent of women think society has done all it can to secure gender equality, compared to 32 per cent of men, the study of 8,000 people revealed.\nIt also found that equality is less popular among the younger generation who are at an age when they are trying to build careers, pay mortgages and start families.\nAmong people in their late 20s and early 30s, the share calling for full equality dropped below 78 per cent.\nThe Fawcett Society’s Sam Smethers said the findings showed ‘we all want a more equal society’ and called for quotas to ensure men make way for female executives.\nShe said: ‘A significant minority of managers - the “barrier bosses” - are holding us back. They are the ones with the power over recruitment and their decisions are likely to be informed by their attitudes to equality.\n'There are many progressive employers who are working hard to drive change, but if they are wondering what is holding up progress in their organisation this may explain why.\n‘Whether it is conscious or unconscious bias, this is discrimination in action.’\nHowever, supporters of the rights of stay-at-home mothers said the findings were evidence of deepening concerns among large numbers of women that the pressure to earn throughout life is restricting choice and forcing reluctant mothers to work while committing their children to long hours of childcare.\nLaura Perrins, of the Conservative Woman website, said: ‘The Fawcett Society now know that men’s attitudes are no barrier to women succeeding in the workplace.’\n'So instead they demand men to donate their hard-earned jobs, which their families are depending on, to women or to “make room” for women.\nCritics claim most women want to stay at home and bring up their own families rather than work (file photo)\n‘Fawcett seem to think that businesses are some kind of hippie commune. It is all a group hug round the camp fire. I wonder how many who work for Fawcett actually run a business?’\nAuthor and researcher on the family Patricia Morgan said: ‘The majority of women want to bring up their own families, and they want the man to be the breadwinner while they do so.\n'They want to go back to work later. Many women do not want to conform to the idea that they must work throughout their lives and they must always be the breadwinner.\n‘Why should men be made to move aside for women? This is a world without choice.’\nThe latest official pay figures from the Office for National Statistics showed in November that women now earn more than men up until the age of 35.","url":"https://www.dailymail.co.uk/news/article-3393224/Equality-Men-keen-women-Survey-says-86-cent-want-women-lives-equal-opportunities.html"}
