{"authors":[],"date_download":"2018-10-30 18:20:26","date_modify":"2018-10-30 18:20:26","date_publish":"2016-12-19 05:00:00","description":"Georgia’s new school Superintendent of the Year is “very much against vouchers” th...","filename":"data/vaneerConsumption/Fayetteschoolssuperintendenttalksvouchersfuture.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/19/Images/newsEngin.17155453_Barrow.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_georgi_0cebb859f7e041d965a70937f01864e3__1540923626.html","title":"Fayette schools superintendent talks vouchers, future","title_page":"Fayette schools superintendent talks vouchers, future","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia’s new school Superintendent of the Year is “very much against vouchers” though he believes parents should have some choice in their children’s public schooling.\nJoseph ‘Jody’ Barrow Jr., the lifelong educator who is Fayette County’s superintendent, is also optimistic about opportunities he thinks technology holds for personalizing learning and assessing it better than the standardized tests people are used to, which he says some call ‘autopsy tests.’\n“One of the goals I strive to meet is being a champion for children,” said Barrow, who “had the good fortune of being a classroom teacher K-12” nine years and a high school principal for many years. He was superintendent in Ware County before becoming Fayette’s superintendent nearly four years ago.\nWith schools often a locality’s largest employer, as in Fayette, a superintendent has to understand business applications and be financially responsible in running, for example, the county’s biggest restaurant and transportation businesses, he said. Barrow said he told Fayette’s school board, “Even though I’ll be spending your money I’ll never waste your money.”\nTwo of his five children attend Fayette schools.\n“I’m not just the superintendent, I’m a customer, too” and he understands that “our industry or work is incredibly complex. We have to do a lot of things for a lot of people,” in a workplace that reflects the world around it.\n“Every social ill, at some time, walks through the door of the public school,” and “a lot of people aren’t happy with public education. I find that ironic,” Barrow said: “If you look at most metrics people think are important such as graduation rates and students going on to further education, public schools are doing better than ever before.”\nOne reason for so much dissatisfaction with public schools, he said, is that society’s expectations have changed. No longer can a dropout expect to earn a decent wage. Today’s knowledge-based economy means people must have a good education.\nFayette County celebrates its tradition as a college-preparatory district, he said, and “I want all of our kids to have a post-secondary education, a B.S. or B.A. (degree.) But at the end of the day I want them to have a j-o-b.”\nBesides faith-based institutions, schools are probably the most stable institutions a community has, he said, but that stability is a double-sided coin. Sometimes schools are slow to change even when change is good.\nTake technology. Schools are probably the slowest to welcome new technology, he said. “I don’t think technology will ever replace a highly skilled teacher but teachers are going to have to embrace that.” He thinks technology could give teachers a more immediate sense, for example, of what each student is learning, individually. While tests like the Georgia Milestones “are a fairly decent indication of what the student has been exposed to during the year — people refer to them as ‘autopsy tests,’ after the fact — what I’d hope we would look at is assessments for learning,” and technology offers that capability, he said.\nBarrow said that through several years of evolving federal education law emphasizing tests, schools have gotten out of balance with accountability, but he hopes under the new Every Student Succeeds Act, giving states and local districts more autonomy, schools will take advantage of opportunities to innovate.\nNoting that both political parties embrace school choice, Barrow said, “There ought to be some choice about how your child’s educated and we have that,” allowing parents to choose schools, for example. But, he opposes vouchers — taking public school dollars to spend on private institutions. “My concern is you’re separating people based on race or gender or religion” or some other criterion, and since everyone has some bias, Barrow said, that “does not level the playing field, it puts it out of kilter.\n“What we don’t want to do is take limited resources and continue to dilute those to the point that public schools can’t survive. My concern is that policies can be created in the interest of providing more choice and the cure is worse than the disease.”\nGeorgia’s school funding formula, he said, is an equitable and fair model — if it’s funded appropriately, and that deals with economics and politics.\n“I’ll look with interest at what happens in the session” of the General Assembly.","url":"https://www.ajc.com/news/local-education/georgia-superintendent-year-talks-vouchers-technology/FVT5dlxQvPxOXkeG5CAi3N/"}
