{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:29:00","date_modify":"2018-10-30 20:29:00","date_publish":"2017-01-04 16:16:42","description":"Newly-released FBI figures show that the number of background checks beat the previous annual record by more than 4 million.","filename":"data/vaneerConsumption/FBI275MillionGunBackgroundChecksin2016NewRecord.json","image_url":"https://media.breitbart.com/media/2015/06/2nd-amendment-George-Frey-Getty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_04__1540931340.html","title":"FBI: 27.5 Million Gun Background Checks in 2016; New Record","title_page":"FBI: 27.5 Million Gun Background Checks in 2016; New Record","title_rss":"NULL","source_domain":"breitbart.com","text":"Newly-released FBI figures show that the number of background checks conducted for gun purchasers in 2016 were so high they actually beat the previous annual record by more than 4 million.\nAccording to FBI figures, there were 2,771,159 background checks conducted in December. That ws down slightly from the record high of 3,314,594 checks conducted in December 2015, but was more than high enough to help make 2016 a historical year for background checks. In fact, a new all-time record of 27,538,673 background checks conducted in 2016.\nOn top of the astounding number of checks, each check could represent more than one gun sold at retail. Checks are performed on the purchaser rather than the gun(s) the purchaser wishes to buy.\nOnce a check is passed, a customer can buy numerous guns. That means 27, 538,673 background checks could amount to 55,077,346 guns sold, if every would-be buyer bought two guns. If each bought three, the figure would be 82,616,019 guns sold.\nIt is interesting to note that 2016 had already broken all prior annual records for background checks by the close of business on November 30. Breitbart News previously reported that there were 24,767,514 background checks January 1 through November 30 alone. The 11-month surge broke previous 12-month records by more than a million checks.\nPresident-elect Donald Trump’s decision to run as a defender of the Second Amendment seems to have caught the mood of the public — at least of consumers in the market for firearms, who were partly driven by concerns that new federal and state restrictions, such as ammunition background checks in California, could limit their ability to own guns and ammunition.\nThe National Rifle Association (NRA) backed Trump and celebrated his victory.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2017/01/04/gun-background-checks-fbi-new-record-2016/"}
