{"authors":[],"date_download":"2018-10-22 21:41:47","date_modify":"2018-10-22 21:41:47","date_publish":"2014-05-07 22:10:12","description":"The two FBI agents who shot James DiMaggio acted reasonably and should not face charges, U.S. Attorney said.","filename":"data/vaneerConsumption/FBIClearedinAccusedHannahAndersonKidnappersDeath.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427671/140507-hannah-anderson-1821_876047a0cb64e4a54f33252b23ceb66e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_fbi-cleared-accused-hannah-anderson-kidnappers-death-n99801_1540244507.html","title":"FBI Cleared in Accused Hannah Anderson Kidnapper's Death","title_page":"FBI Cleared in Accused Hannah Anderson Kidnapper's Death","title_rss":"NULL","source_domain":"nbcnews.com","text":"The disappearance of the teen triggered a massive search spanning much of the western U.S. and parts of Canada and Mexico.\nFBI agents descended on the Frank Church River of No Return Wilderness near Cascade, Idaho, when four horseback riders reported seeing DiMaggio and Anderson. A law enforcement airplane spotted their campsite, and hostage rescue teams were dropped by helicopter.\nAgents moved in when DiMaggio stepped away from Anderson, according to the press release from the prosecutors.\nWith the agents about 100 yards away, DiMaggio fired two rifle shots, and the agents, believing they were being targeted, shot DiMaggio multiple times, the release states. A third agent was able to safely remove the teen from danger.\nOlson said she was declining to prosecute the agents because an investigation showed it can't be established beyond a reasonable doubt that either agent intended to violate the law when they shot at DiMaggio.\nKiiha said Idaho state law allows lethal force to be used in self-defense if a reasonable person in the same situation would believe they were in danger.\n- Associated Press","url":"https://www.nbcnews.com/news/us-news/fbi-cleared-accused-hannah-anderson-kidnappers-death-n99801"}
