{"authors":[],"date_download":"2018-10-22 20:46:39","date_modify":"2018-10-22 20:46:39","date_publish":"2014-06-03 02:00:42","description":"The FBI has been looking for Ryan Kelly Chamberlain II, 42, since Saturday, when sources said FBI officials discovered explosives in his apartment.","filename":"data/vaneerConsumption/FBICapturesRyanChamberlainManatCenterofNationwideAlert.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483121/140602-chamberlain-arrest-jms-2325_6d2ab302972c1fd16d11e8f56815c1d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_fbi-captures-ryan-chamberlain-man-center-nationwide-alert-n120916_1540241199.html","title":"FBI Captures Ryan Chamberlain, Man at Center of Nationwide Alert","title_page":"FBI Captures Ryan Chamberlain, Man at Center of Nationwide Alert","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Bay Area\nThe San Francisco media consultant at the center of a national FBI manhunt has been arrested, FBI officials tell NBC Bay Area, capping a three-day manhunt that reached far beyond the Bay Area.\nThe FBI had been looking for Ryan Kelly Chamberlain II, 42, a well-known social media expert and political consultant, since Saturday, when sources said FBI officials discovered explosives and a chemical that can be deadly in his Russian Hill apartment on Polk Street.\nSan Francisco police and FBI agents at about 6:40 p.m. were approaching Chamberlain's car at Crissy Field to make sure no explosives were in the vehicle.\nFBI officials confirmed a \"credible sighting\" of Chamberlain at about 4 p.m. at the Mad Dog in the Fog bar in San Francisco's Haight district. A person spotted Chamberlain and called 911, according to the FBI.\nAgents responded to the area and were conducting interviews late Monday afternoon.\nOfficials had earlier called Chamberlain \"armed and dangerous,\" but on Monday, two sources told NBC News that Chamberlain was no longer considered an immediate threat to public safety, hours after an apparent suicide note anda tweet from the man's accounts appeared online.\nA message posted Monday to a Twitter account carrying Chamberlain's name said \"nothing they're reporting is true.\"\nAn apparent suicide note titled “Goodbye” was also posted to an iCloud account. The source of both messages could not be independently verified by NBC Bay Area, and the FBI declined to comment on the three-page letter, timed to go out on Monday through the social media management system Hootsuite.\nVarious media outlets, including SF Weekly, reported that the note was sent out on Facebook. But by noon on Monday, that note was not on Chamberlain's Facebook page, though several posters were referencing it and sending out the iCloud link.\nThe note discusses Chamberlain's depression, his mother, whom it calls a \"religious addict,\" and a time in 2003 when he was \"left out\" of getting any credit for helping California's Lt. Gov. Gavin Newsom win his San Francisco mayoral seat in 2003.\nThe letter also discussed his two needs in life: \"A person and a purpose.\" \"All I ever wanted was someone to be madly in love with,\" the letter states. \"Everyone wants that. Lots of people get it. But it always eluded me.\"\nThe letter says that if anyone was reading the note, which he said was posted on Hootsuite delay, \"that means we probably don't know each other anymore, and I owe everyone an explanation.\"\nThe two sources told NBC News that the FBI, taking an abundance of caution, issued a nationwide alert to federal, state and local law enforcement to make sure officers are aware of and take a \"defensive posture\" in dealing with Chamberlain, given the explosive materials recovered from his home Saturday.\nIn addition, the sources told NBC News that Chamberlain has family in multiple states, so they wanted to cast a broad net, though they thought he most likely was still in Northern California.\nFBI spokesman Peter Lee said Sunday, in an effort to dispel some rumors, that agents had not found any ricin or other chemical or biological threats in the home. \"He did possess explosives at his residence,\" however, Lee added.","url":"https://www.nbcnews.com/news/us-news/fbi-captures-ryan-chamberlain-man-center-nationwide-alert-n120916"}
