{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 18:16:06","date_modify":"2018-10-30 18:16:06","date_publish":"2018-08-13 00:00:00","description":"Peter Strzok, a longtime FBI agent who was removed from the Russia investigation over text messages that disparaged President Donald Trump, has been fired by the agency, his lawyer said Monday.","filename":"data/vaneerConsumption/FBIdismissesTrumpcriticStrzoklawyercriespolitics.json","image_url":"https://media.arkansasonline.com/img/photos/2018/08/13/resized_250499-1a-strzok-0814_51-24961_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_14__1540923366.html","title":"FBI dismisses Trump critic; Strzok lawyer cries politics","title_page":"FBI dismisses Trump critic; Strzok lawyer cries politics","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Peter Strzok, whose politically charged texts with a colleague about President Donald Trump led to his removal from the FBI’s investigation into Russian meddling in the 2016 election, was fired by the agency Monday.\nWASHINGTON -- Peter Strzok, a longtime FBI agent who was removed from the Russia investigation over text messages that disparaged President Donald Trump, has been fired by the agency, his lawyer said Monday.\nThe FBI had been reviewing Strzok's employment after the politically charged text messages were discovered last year. Trump's allies have seized on the texts, saying they show that special counsel Robert Mueller's investigation into possible coordination between the Trump campaign and Russia is tainted by political bias.\nConservatives on Monday hailed the move, and Trump used it to suggest the Russia investigation should be dropped.\nAitan Goelman, Strzok's attorney, said FBI Deputy Director David Bowdich ordered the firing Friday, even though the head of the FBI's Office of Professional Responsibility, which normally handles employee discipline, had decided Strzok should face only a demotion and 60-day suspension.\nGoelman said the move undercuts the FBI's repeated assurances that Strzok would be afforded the normal disciplinary process.\n\"This isn't the normal process in any way more than name,\" Goelman said.\nHe said Strzok was removed because of political pressure and \"to punish Special Agent Strzok for political speech protected by the First Amendment.\"\n\"This decision should be deeply troubling to all Americans,\" the lawyer said in a statement.\nThe FBI declined to comment.\nStrzok, 48, was a veteran of more than 20 years at the bureau, and he investigated Russian spies, defense officials accused of selling secrets to China and myriad other important cases. In the twilight of his career, Strzok was integral to two of the bureau's most high-profile investigations -- the case of Russia meddling in the 2016 election and the investigation into Hillary Clinton's use of a private email server while she was secretary of state.\nBut when a Justice Department inspector-general investigation uncovered politically charged messages that Strzok had exchanged with FBI lawyer Lisa Page, with whom he was having an affair, he was relegated to a position in human resources and largely relieved of his duties.\nTrump, who has repeatedly taken aim at Strzok, expressed satisfaction with the firing and called for another look at the Clinton case.\n\"Agent Peter Strzok was just fired from the FBI - finally. The list of bad players in the FBI & DOJ gets longer & longer. Based on the fact that Strzok was in charge of the Witch Hunt, will it be dropped? It is a total Hoax. No Collusion, No Obstruction - I just fight back!\" he tweeted.\nMinutes later, he added, \"Just fired Agent Strzok, formerly of the FBI, was in charge of the Crooked Hillary Clinton sham investigation. It was a total fraud on the American public and should be properly redone!\"\nHouse Republicans also cheered the firing, with Majority Leader Kevin McCarthy, R-Calif., saying on Twitter that it was \"long overdue.\"\nRep. Mark Meadows, R-N.C., who is one of the leading critics of the FBI investigations, said Strzok was fired \"because of what his own written words plainly showed: He was willing to use his official FBI position to try and stop President Trump from getting elected. He tarnished the FBI's sterling reputation and severely damaged public trust in an institution where trust is paramount.\"\nRep. Eric Swalwell, D-Calif., said Strzok's firing did not undercut Mueller's probe, which has produced dozens of indictments.\n\"Sorry, @realDonaldTrump, the #RussiaInvestigation is bigger than one agent (who was at least willing to go under oath),\" Swalwell tweeted.\nStrzok's team launched a GoFundMe page with a lengthy statement seeking to raise money for his \"legal costs and lost income\" and saying that his firing was \"apparently driven by political pressure.\" The site had raised more than $23,000 in the first four hours.\nBecause Strzok was a senior-level FBI employee, and because the FBI's No. 2 official directed his firing, he has few realistic avenues left to get back his job. It was unclear whether he planned to pursue legal action against the bureau.\nANTI-TRUMP MESSAGES\nStrzok's position in the bureau had been precarious since last summer, when the Justice Department's inspector general, Michael Horowitz, told Mueller that the lead agent on his team had been exchanging anti-Trump messages with an FBI lawyer. The next day, Mueller expelled Strzok from the group.\nPage, who had also been a part of Mueller's team, had left a few weeks earlier. She no longer works for the FBI.\nHorowitz concluded that Strzok showed a \"willingness to take official action\" to hurt Trump's electoral prospects, particularly in a text he sent telling Page that \"we'll stop\" Trump from being president.\nTexts between the two included their observations of the 2016 election and criticism of Trump. They used words like \"idiot,\" \"loathsome,\" \"menace\" and \"disaster\" to describe Trump. In a text four days before the election, Page told Strzok that the \"American presidential election, and thus, the state of the world, actually hangs in the balance.\"\nIn an August 2016 text, Page asked Strzok: \"(Trump's) not ever going to become president, right? Right?!\"\nStrzok responded: \"No. No he won't. We'll stop it.\"\nIn a heated congressional hearing last month, Strzok expressed \"significant regret\" for the texts but repeatedly insisted that they did not reflect political bias and had not infected his work. Strzok also sought to rebut the president's attacks on the Russia inquiry.\n\"This investigation is not politically motivated; it is not a witch hunt; it is not a hoax,\" Strzok said.\nHis attorney has said that if Strzok had wanted to prevent Trump's election, he could have leaked that Trump's campaign was under investigation -- a revelation that might have upended his bid to become president.\nStrzok was escorted out of the FBI building in June and effectively relieved of work responsibilities, though he technically remained an FBI employee as he and his attorney challenged the effort to dismiss him. On July 24, they made a final pitch to Candice Will, who leads the FBI's Office of Professional Responsibility.\nGoelman said Will ultimately decided that Strzok should face a demotion and suspension and be subjected to a \"last chance\" agreement. That would have put him on thin ice if he were to commit another offense. But Goelman said Bowdich overruled that decision and ordered Strzok's termination.\nThe inspector general's report that preceded Strzok's firing not only criticized his conduct in sending the texts but also his use of personal email accounts to handle sensitive information. Horowitz found that Strzok had forwarded a proposed search warrant to his personal email account. The inspector general said the email, which included a draft of the search warrant affidavit, contained information that appeared to be under seal.\nIn addition, Horowitz's report criticized Strzok over his decision not to move swiftly to examine new emails related to the Clinton investigation just weeks before the 2016 election.\nStrzok was the lead investigator in the Clinton investigation. The report blamed Strzok and Page for creating an appearance of impropriety through their texts but found that the outcome of the Clinton investigation was not marred by bias. Clinton was cleared in the 2016 investigation.\nHorowitz, however, said he could not rule out that Strzok had slow-walked the examination of the new emails to help Clinton's presidential bid.\nAt the time, Strzok was in the early stages of investigating whether any Trump associates had conspired with Russia's interference in the presidential election, and nearly a month passed before agents and analysts began to act on the emails found on the laptop of former politician Anthony Weiner, who was married to a top Clinton aide.\nStrzok is the second senior FBI agent to be fired as a result of the inspector general's investigation. In March, Andrew McCabe, the former deputy director, was fired after Horowitz accused him of misleading investigators about a media disclosure related to the Clinton case.\nMcCabe has called the firing a politically motivated effort to discredit him as a witness in the special counsel investigation.\nIt is possible that others could still face discipline. The inspector general identified five FBI employees, including Strzok and Page, with some connection to the Clinton email case who had exchanged messages expressing hostility toward Trump, support for Clinton or other political views. Each was referred to the FBI for possible violations of the bureau's code of conduct.\nInformation for this article was contributed by Matt Zapotosky of The Washington Post; by Mary Clare Jalonick and Michael Balsalmo of The Associated Press; and by Adam Goldman and Michael S. Schmidt of The New York Times.\nA Section on 08/14/2018","url":"https://www.arkansasonline.com/news/2018/aug/14/fbi-dismisses-trump-critic-20180814/"}
