{"authors":[],"date_download":"2018-10-22 22:10:32","date_modify":"2018-10-22 22:10:32","date_publish":"2014-06-09 01:43:47","description":"The FBI found child pornography on Josh Powell’s computer before he bludgeoned his sons with an ax, then set his home on fire, killing them and himself.","filename":"data/vaneerConsumption/FBIFoundChildPornonJoshPowellsComputerBeforeHeKilledSons.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_21/455811/140520-susan-powell-jms-1941_8bca26331f79f9da4147a7a93641ed39.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_fbi-found-child-porn-josh-powells-computer-he-killed-sons-n125906_1540246232.html","title":"FBI Found Child Porn on Josh Powell's Computer Before He Killed Sons","title_page":"FBI Found Child Porn on Josh Powell's Computer Before He Killed Sons","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFor Chuck and Judy Cox, the latest revelation about their former son-in-law, Josh Powell, was distressingly routine: In the years before Powell bludgeoned their grandchildren with an ax, then blew up his home, killing them and himself, the FBI had uncovered child pornography on Powell’s computer.\nDespite these findings, which were reported Saturday in the Salt Lake Tribune, Powell had visitation rights with Braden, 5, and Charlie, 7, when he killed them on Feb. 5, 2012.\nPowell was also a person of interest in the 2009 disappearance of his wife—the Coxes daughter—Susan, who vanished from their Utah home in 2009. She has never been found.\n“It’s just one thing after another in terms of bad breaks and bad news and bad action by the authorities,” the Coxes lawyer, Anne Bremner, told NBC News.\n“It keeps getting worse,” she said.","url":"https://www.nbcnews.com/news/us-news/fbi-found-child-porn-josh-powells-computer-he-killed-sons-n125906"}
