{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:37:26","date_modify":"2018-10-30 21:37:26","date_publish":"2018-06-20 14:33:38","description":"Contrary to widespread reports, the FBI did not destroy any of the evidence it collected in its investigation of Hillary Clinton’s email probe.","filename":"data/vaneerConsumption/FBIHasNotYetDestroyedClintonAidesLaptops.json","image_url":"https://media.breitbart.com/media/2016/11/Hillary-Clinton-computer-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_20__1540935446.html","title":"FBI Has Not Yet Destroyed Clinton Aides' Laptops","title_page":"IG Report: FBI Has Not Yet Destroyed Clinton Aides' Laptops","title_rss":"NULL","source_domain":"breitbart.com","text":"NEW YORK — Contrary to widespread reports, the FBI did not destroy any of the evidence it collected in its investigation of Hillary Clinton’s email probe, including the laptops of former Clinton chief of staff Cheryl Mills and ex-campaign staffer Heather Samuelson, according to the recently released report by the Justice Department’s internal watchdog.\nIn 2016, numerous news media reports cited sources saying that as part of immunity deals concluded with Mills and Samuelson, the FBI had agreed to destroy their laptops after the conclusion of its investigation because the devices likely contained classified material.\nThe 500-plus page report authored by the Justice Department’s Office of the Inspector General cites consent agreements for obtaining the laptops as stating that the evidence would ultimately be destroyed.\nThe consent agreements provided: “As soon as the investigation is completed, and to the extent consistent with all FBI policies and applicable laws, including the Federal Records Act, the FBI will dispose of the Device and any printed or electronic materials resulting from your search.”\nA footnote in the report cites draft FBI talking points explaining that the agency “had agreed to destroy the laptops because the laptops contained classified information and, as such, could not be returned to the attorneys following compliance with FOIA and Federal Records Act obligations.”\nThe draft talking points further stated that as of October 2016 the laptops were still intact because the FBI was “under a legal obligation to preserve the laptops and other electronic media due to numerous pending FOIA requests.”\nThe same footnote then reveals that as of June 11, 2018, just prior to the release of the report, the FBI informed the IG’s office that the agency “still had in its possession the culling laptops and all other evidence collected during the Midyear investigation.”\nThe Midyear investigation refers to the Clinton email probe.\nOne part of the report implies that if a new investigation were to be opened and prosecutable evidence is found, it is possible that Mills and Samuelsson could still be held liable despite the immunity agreements, at least according to one interpretation.\nThe report cited two FBI prosecutors:\nThe Department entered into “act of production” immunity agreements with both Mills and Samuelson on June 10, 2016. The immunity agreements provided that the government would “not … use any information directly obtained from” the culling laptops in any prosecution of either witness “for the mishandling of classified information and/or the removal or destruction of records,” pursuant to “18 U.S.C. § 793(e) and/or (f); 18 U.S.C. § 1924; and/or 18 U.S.C. § 2071.” Therefore, Prosecutors 1 and 2 told us it was their view that the government would have been free to use in any future prosecution of Mills and Samuelson leads developed as a result of the FBI’s review of the information on the culling laptops, as well as information provided by Mills and Samuelson during their voluntary interviews.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.\nWritten with research by Joshua Klein.","url":"https://www.breitbart.com/politics/2018/06/20/ig-report-fbi-has-not-yet-destroyed-clinton-aides-laptops/"}
