{"authors":[],"date_download":"2018-10-22 20:32:08","date_modify":"2018-10-22 20:32:08","date_publish":"2014-06-02 03:04:48","description":"An FBI source told NBC Bay Area that crews found a chemical in the apartment that, if not handled correctly, can kill.","filename":"data/vaneerConsumption/FBIHuntforRyanKellyChamberlainAfterSwarmingBuilding.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/480611/140601-ryan-kelly-chamberlain-ii-jms-2238_21e16a7f2e5cc21ab1c60fccc6941273.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_fbi-hunt-ryan-kelly-chamberlain-after-swarming-building-n119996_1540240328.html","title":"FBI Hunt for Ryan Kelly Chamberlain After Swarming Building","title_page":"FBI Hunt for Ryan Kelly Chamberlain After Swarming Building","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Bay Area\nThe FBI has launched a nationwide manhunt for a man named Ryan Kelly Chamberlain II in connection with Sunday's investigation at an apartment building in San Francisco's Russian Hill neighborhood.\nFBI agents, San Francisco police and fire crews, and a hazardous materials team swarmed the building between Jackson and Polk streets early Saturday morning in a search that continued into the early hours of Sunday.\nFBI spokesperson Peter Lee said at a press conference Sunday that the FBI is looking for Chamberlain, 42, a San Francisco resident, for possession of explosive material at his residence.\nChamberlain is 6' 3\" tall, weighs 225 lbs and has blue eyes and brown hair, according to Lee. He was last seen south of San Francisco Sunday, driving a white 2008 Nissan Altima with a California or Texas license plates of either 7FQY085 or BX9M042. He is believed to be wearing a dark blue hooded sweatshirt and blue jeans and is considered armed and dangerous, Lee said.\nThe FBI is encouraging anyone with any information on Chamberlain to notify the agency at 415-553-7400 or call 911.\nThe San Francisco FBI office told NBC Bay Area Sunday that the agency was executing a search warrant at Chamberlain's apartment as part of a criminal investigation.\nthe FBI said the investigation poses \"no threat to public safety,\" and that protective equipment had been used Sunday in the interest of agent safety. Lee said that contrary to what was reported by some news sources, there was no conclusive evidence of the deadly poison ricin at Chamberlain's apartment.\nAn FBI spokesperson said that a bomb squad had shown up at the scene of the investigation, but that it turned out to be a false radiation alarm.\nAn FBI source told NBC Bay Area that crews found a chemical in the apartment that, if not handled correctly, can kill. The person may have bought the chemical -- which is often used in assisted suicide situations -- on the internet, according to the source.\nThe FBI declined further comment on the intent or motive behind the explosive material in light of the ongoing investigation.\n\"Actually, as I was walking down here, I thought it was a film set,\" onlooker Faisal Choudry said. \"And somebody said the FBI is here investigating, and they’ve been here since the morning.\"\nPolice blocked off a section of Jackson Street between Polk Street and Van Ness Avenue Saturday. Jackson street was reopened around 12:30 a.m. and fire and hazmat crews left the scene Sunday morning.\nThose who live in the area said it had been an interesting afternoon.\n\"There are a lot of police, a lot of fire, and there was a bomb squad here earlier,\" neighbor Dianne Dubois said. \"That's very scary for those of us who live here, but it seems like everything is going OK. But it's hard to know. We don't know anything about what's going on, so we have no information at all.\"\nNeighbors said that the FBI had not told them anything about the investigation.\n\"It seems a bit more chaotic down here than it was inside,\" neighbor Tiffany Fechtar said. \"The person’s door is open. There’s stuff outside. They’ve got the hazmat suits on, and I don’t know. what’s going on.\"\nThose who live inside the building told NBC Bay Area the FBI has taken at least two computers from the apartment.","url":"https://www.nbcnews.com/news/us-news/fbi-hunt-ryan-kelly-chamberlain-after-swarming-building-n119996"}
