{"authors":[],"date_download":"2018-10-22 22:24:04","date_modify":"2018-10-22 22:24:04","date_publish":"2014-06-09 22:28:42","description":"This follows documented complaints by immigrant advocacy groups that cases involving officers at the border were left unresolved.","filename":"data/vaneerConsumption/FBIInspectorReplacesBorderPatrolAbusesInvestigator.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_fbi-inspector-replaces-border-patrol-abuses-investigator-n126791_1540247044.html","title":"FBI Inspector Replaces Border Patrol Abuses Investigator","title_page":"FBI Inspector Replaces Border Patrol Abuses Investigator","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Border Patrol official responsible for investigating abuse allegations has been replaced with an FBI agent, a move hailed by immigrant rights advocacy groups.\nCustoms and Border Protection, which oversees Border Patrol and is part of the Department of Homeland Security, removed James Tomscheck Monday afternoon. Mark Morgan, FBI deputy assistant director for inspections, will be leading the office later this month on an interim assignment, The Associated Press reported.\n\"Today's announcement from Customs and Border Protection reaffirms border communities' consistent and urgent call for greater accountability and oversight inside the agency,\" said Christian Ramirez, director of the Southern Border Communities Coalition.\nNews of Tomscheck's ouster comes after CBP Commissioner R. Gil Kerlikowske released an independent, scathing report of the Border Patrol's use of force, that had been kept secret for about a year, and the reissuance of CBP's use of force policy handbook. The new guide includes a several revisions wanted by advocacy groups.\nPressure on the Border Patrol over alleged abuse incidents, including some involving lethal use of force, has been building as media and advocacy groups have documented that many cases were left unresolved and did not result in any consequences for officers involved. Lawsuits were filed and several groups were collectively posting reports about incidents on a website aimed at holding the agency accountable.\nKerlikowske has said changes to the use of force policy are being integrated into training. He also has said other efforts to build transparency and improve accountability would be taking place.","url":"https://www.nbcnews.com/news/latino/fbi-inspector-replaces-border-patrol-abuses-investigator-n126791"}
