{"authors":[],"date_download":"2018-10-30 21:12:50","date_modify":"2018-10-30 21:12:50","date_publish":"2016-10-12 21:14:09","description":"The FBI reissued a statement Wednesday saying agents are investigating a number of recent cyber attacks as WikiLeaks continues to post emails allegedly stolen from Hillary Clinton campaign Chair John Podesta's account.","filename":"data/vaneerConsumption/FBIinvestigatesPodestaclaimshewas.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/12/Videos/5167190060001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national-govt--politic_ffa886c3eb29124b03c7174ed1b7a5a0__1540933970.html","title":"FBI investigates, Podesta claims he was...","title_page":"WikiLeaks emails: FBI investigates, Podesta claims he was...","title_rss":"NULL","source_domain":"ajc.com","text":"The FBI reissued a statement Wednesday saying agents are investigating a number of recent cyber attacks as WikiLeaks continues to post emails allegedly stolen from Hillary Clinton campaign Chair John Podesta's account.\n>> Read more trending stories\n\"The FBI is aware of media reporting on cyber intrusions involving multiple political entities, and is working to determine the accuracy, nature and scope of these matters,\" an FBI spokesperson said in the statement. \"The cyber threat environment continues to evolve as cyber actors target all sectors and their data. The FBI takes seriously any allegations of intrusions, and we will continue to hold accountable those who pose a threat in cyberspace.\"\nThe statement is the same one the FBI released in July when reports surfaced that hackers successfully targeted the Democratic Congressional Campaign Committee, according to Politico.\nNeither the FBI nor the Clinton campaign have confirmed that the thousands of emails posted to WikiLeaks in fact came from Podesta's email account.\nThe former chief of staff to President Bill Clinton on Tuesday said that he has been in touch with FBI investigators \"as a victim\" of hacking, The New York Times reported. He did not confirm that veracity of the leaked emails.\n\"I've been involved in politics for nearly five decades,\" he said. \"This definitely is the first campaign that I've been involved with in which I've had to tangle with Russian intelligence agencies … who seem to be doing everything that they can on behalf of our opponent.\"\nGovernment officials last week said they are \"confident\" that the Russian government is behind the recent cyber attacks.\n\"The recent disclosures of alleged hacked e-mails on sites like DCLeaks.com and WikiLeaks and by the Guccifer 2.0 online persona are consistent with the methods and motivations of Russian-directed efforts,\" the Department of Homeland Security and Office of the Director of National Intelligence on Election Security said in a joint statement on Oct. 7. \"These thefts and disclosures are intended to interfere with the US election process.\"\nThe Russian government has denied any involvement in the attacks. Speaking at a business forum on Wednesday, Russian President Vladimir Putin said both Democrats and Republicans are using Russia as a distraction in order to further their own agendas.\n\"They started this hysteria, saying this (hacking) is in Russia's interests, but this has nothing to do with Russia's interests,\" he said, according to Reuters.","url":"https://www.ajc.com/news/national-govt--politics/wikileaks-emails-fbi-investigates-podesta-claims-was-targeted-russian-hackers/hwmymXe0EzSvHLLdM4MKCP/"}
