{"authors":["John Sexton"],"date_download":"2018-10-30 21:45:19","date_modify":"2018-10-30 21:45:19","date_publish":"2015-11-11 00:42:04","description":"Report: FBI Intensifying Probe of Hillary Clinton's Email Server","filename":"data/vaneerConsumption/FBIIntensifyingProbeofHillaryClintonsEmailServer.json","image_url":"https://media.breitbart.com/media/2015/10/Clinton-closeup-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_10__1540935919.html","title":"FBI Intensifying Probe of Hillary Clinton's Email Server","title_page":"Report: FBI Intensifying Probe of Hillary Clinton's Email Server","title_rss":"NULL","source_domain":"breitbart.com","text":"The FBI’s initial investigation into Hillary Clinton’s private server and her handling of classified information reportedly has expanded into a large-scale investigation.\n“This sounds to me like it’s more than a preliminary inquiry; it sounds like a full-blown investigation,” former FBI assistant director Tom Fuentes told Politico. He added, “When you have this amount of resources going into it …. I think it’s at the investigative level.”\nThe story of the FBI investigation has been mired in politics from the start. When the NY Times reported on July 23rd that a criminal investigation had been opened into Clinton’s private server, both sides of the political aisle erupted.\nBut it turned out the Times‘ source had elements of the story wrong. There had been a so-called “security referral” from the Inspector General for the Intelligence Community to the DOJ, asking them to investigate handling of classified information on Clinton’s server. However, the probe was not directed specifically at Clinton and was not “criminal” in nature.\nWhile the Times became the focus of a Clinton campaign backlash over its errors, the fact that a preliminary investigation connected to her server was underway at the FBI remained a fact.\nThe FBI has not commented on the ongoing investigation but there have been clear signs the probe was making progress. Clinton’s server was seized from Platte River Networks in August and in September Bloomberg reported the FBI had successfully recovered email from the hard drive.\nThe report by Politico today includes an interview with a “former high-ranking policy official at State” who was asked about the contents of Clinton’s email, specifically whether anyone at State had expressed concern about it.\nClinton has repeatedly said none of the information she sent or received was marked classified. However, some observers have argued information is classified whether or not it is marked and that a Secretary of State is expected to know what is and is not classified.\nA Reuters investigation in August suggested that some types of classified information found on Hillary’s server were “born classified,” meaning they should have been recognized as classified material immediately.","url":"https://www.breitbart.com/politics/2015/11/10/report-fbi-intensifying-probe-hillary-clintons-email-server/"}
