{"authors":["John Binder"],"date_download":"2018-10-30 21:09:38","date_modify":"2018-10-30 21:09:38","date_publish":"2016-11-15 15:36:35","description":"African-Americans and whites continue to be the largest targets of hate crimes which are most common in traditional blue states..","filename":"data/vaneerConsumption/FBILegitHateCrimesMorePrevalentinBlueStates.json","image_url":"https://media.breitbart.com/media/2016/06/wi/afp_5bf3af53ac175bb7b036997ba1d4833e7f7b5276-e1466011919978.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_11_15__1540933778.html","title":"FBI: Legit Hate Crimes More Prevalent in Blue States","title_page":"FBI: Legit Hate Crimes More Prevalent in Blue States","title_rss":"NULL","source_domain":"breitbart.com","text":"African-Americans and whites continue to be the largest targets of hate crimes which are most common in traditional blue states, newly released Federal Bureau of Investigation data reveal.\nThe states with the most hate crime offenses in 2015 were California–with over 1,000 hate crimes–while New York, New Jersey, Washington State, and Massachusetts followed closely behind.\nIn 2015, there were 6,418 offenses reported nationwide, a relatively small number when compared to the country’s estimated population of 320 million, while millions of illegal immigrants continue to be imperfectly accounted for.\nBlacks saw at total of 2,125 offenses against them which were racially, anti-black motivated. Whites fell victim in the second largest hate crime demographic slot, with a total of 734 offenses. Hispanics, however, suffered 379 offenses.\nAmericans of Middle-Eastern descent saw far fewer hate crimes in 2015 than other races/eternities with 47 offenses reported by law enforcement.\nWith respect to hate crimes that are motivated against a victim’s religious belief, Jewish Americans saw more than double the hate crimes against them than Muslim Americans. In 2015, Jews saw 695 total offenses, while Muslims experienced less than half that amount with 301 reported offenses.\nAmericans with “other religions” and Catholics were some of the others likely to have hate crimes committed against them.\nGay men, which Breitbart Tech Editor Milo Yiannopoulos has warned, are under threat due to a spike in Muslim migration to the country, have seen disproportionately high hate crime incidents against them when compared to other sexual orientation cohorts. Men, specifically, suffered 758 offenses due to their sexual orientation, a slight increase from 2014 levels. Roughly 18 percent of all hate crimes were because of a bias against a sexual orientation.\nFor Americans with disabilities, physical and mental, hate crimes decreased from 2014 with 88 offenses, compared to the previous 95.\nLiberal-leaning states have largely higher hate crime levels than traditional red states. These figures parallel other studies focusing on the rates of modern racial segregation with respect to school districts and housing. ProPublica recently reported that Illinois and New York lead the nation for rates of black students attending schools with 90%+ minority student bodies. With respect to housing, the left-leaning nonprofit named New York, Chicago, Philadelphia, Detroit, and Cleveland “the nation’s most segregated cities.”\nOthers with some of the highest hate offenses included Ohio, Arizona, Michigan, Minnesota and Tennessee.\nWith Texas’ nearly 27 million population, not including illegal immigrants who are unaccounted for, there were 219 total hate crimes in the state in 2015, the majority of which were classified as assault or intimidation.\nOf the 5,493 known offenders involved in all of 2015’s hate crimes, 48 percent were whites while 24 percent were black.\nJohn Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/border/2016/11/15/fbi-legit-hate-crimes-prevalent-blue-states/"}
