{"authors":["Associated Press"],"date_download":"2018-10-22 20:42:48","date_modify":"2018-10-22 20:42:48","date_publish":"2016-01-28 02:53:26","description":"MILWAUKEE (AP) — Samy Mohamed Hamzeh wanted to shoot up a Milwaukee Masonic event center in the name of Islam because he thought the group that owns it is \"p...","filename":"data/vaneerConsumption/FBIMansaidMasonsplayingwiththeworldlikeagame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d213cc30d6a6474fae2850258d866db6-2vdWmEltwXfba0ce28e632303a90-97_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3418710_FBI-Man-plotted-attack-wanted-kill-Israelis_1540240968.html","title":"FBI: Man said Masons 'playing with the world like a game'","title_page":"FBI: Man said Masons 'playing with the world like a game' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FBI: Man said Masons 'playing with the world like a game'\nMILWAUKEE (AP) — Samy Mohamed Hamzeh wanted to shoot up a Milwaukee Masonic event center in the name of Islam because he thought the group that owns it is \"playing with the world like a game,\" according to federal authorities.\nBut a member of the fraternal organization, which is not a religion, said Wednesday it isn't at \"the root of some of the world's problems.\"\n\"We can hardly plan a pancake breakfast,\" said Gavin DeGrave, who is a secretary for the Valley of Milwaukee, which includes four Masonic chapters.\nSamy Mohamed Hamzeh is seen in an undated photo provided by the Waukesha County (Wis.) Sheriff¿s Department. Federal prosecutors charged 23-year-old Samy Mohamed Hamzeh on Tuesday, Jan. 26, 2016, with unlawfully possessing a machine gun and receiving and possessing firearms not registered to him. Federal agents said Tuesday that Mohamed Hamzeh wanted to storm a Masonic temple with a machine gun and kill at least 30 people in an attack he hoped would show \"nobody can play with Muslims\" and spark more mass shootings in the United States. (Waukesha County (Wis.) Sheriff¿s Department via AP)\nHamzeh, 23, has been charged with unlawfully possessing a machine gun and receiving and possessing improperly registered firearms in what authorities say was a planned mass shooting at a Masonic temple. Some people who know Hamzeh, however, have cast doubt on whether he was capable of such an attack, including a former co-worker who said he smoked a lot of marijuana.\nAt a court appearance Tuesday, Hamzeh told the judge the charges against him are \"not true,\" according to the Milwaukee Journal Sentinel, which obtained an audio recording of the hearing and posted it on the newspaper's website.\nWhile the FBI has not publicly identified which temple, DeGrave said the FBI told the fraternity that the alleged target was the Humphrey Scottish Rite Masonic Center in downtown Milwaukee. That location, he said, had been used for banquets and wedding receptions, but has been restricted since last year to Masonic functions.\nThe federal criminal complaint does not make clear whether Hamzeh or informants recommended the Masonic center as the target. But Hamzeh told informants: \"They are all Masonic; they are playing with the world like a game, man, and ... we don't know what's going on, these are the ones who are fighting, these are the ones that needs to be killed.\" He said later, \"these are the ones who are making living for us like hell.\"\nWisconsin's top federal defender, Daniel Stiller, told The Associated Press in an email that Hamzeh's defense is likely to focus on the accuracy of undercover recordings that were made in Arabic and translated to English. He also said the defense will examine what the informant was \"contributing\" to the conversations.\nDefense lawyers in other federal stings have challenged the operations on the basis that their clients were entrapped and suggested that agents are taking advantage of misguided thoughts or mental illnesses and effectively grooming clients into plotting acts of terror.\nFBI spokesman Leonard Peace said Wednesday he didn't have any additional information. U.S. Attorney's Office spokesman Dean Puschnig said a preliminary hearing is scheduled for Feb. 9.\nHamzeh was being held in the Kenosha County jail, about 30 miles south of Milwaukee. Associate federal defender Craig Albee has been appointed to the case.\nHamzeh hasn't been asked to enter a plea, but during his court appearance on Tuesday, he told U.S. Magistrate Judge David Jones that he had read and understood the federal complaint filed against him, but that he doesn't agree with it.\nIn the recording posted by the Journal Sentinel, when Hamzeh was asked whether he understood he was facing decades behind bars if convicted, he replied, \"Yes I understand, but this is not true, sir.\"\nNo media was in court because the case had been sealed until the hearing.\nHamzeh appeared with federal defender Ronnie Murray, who asked that Hamzeh be released under \"reasonable conditions.\" The judge ordered that Hamzeh be detained.\nStiller told the AP he didn't know whether Hamzeh is an American citizen, and Albee didn't immediately return an email seeking that information. Attempts to reach Hamzeh's father by phone weren't successful.\nAccording to the affidavit, agents were tipped off in September that Hamzeh planned to travel to Israel to attack Israeli soldiers and citizens in the West Bank. He abandoned those plans due to \"family, financial and logistic reasons,\" the affidavit said, instead focusing his efforts on a domestic attack.\nLast week, Hamzeh discussed his plans to attack the Masonic center and kill 30 people with the informants, telling them they needed more machine guns and silencers.\nHamzeh was arrested Monday, after he paid two undercover FBI agents for two automatic machine guns and a silencer and put them in the trunk of his car.\nMasons are members of a fraternal organization that carries out a variety of activities, including charity work. Wisconsin has nearly 11,000 Masons in 180 lodges, according to Frank Struble, grand master of Free and Accepted Masons in Wisconsin.\nBut they were the target of Hamzeh's attack, according to federal authorities.\n\"We are Muslims, defending Muslim religion,\" he said, according to the criminal complaint. \"We have our own group, not with Hamas ... we are here defending Islam, young people together join to defend Islam, that's it, that is what our intention is.\"\nJawad Jawad, a delivery driver for a Milwaukee restaurant, said he has known Hamzeh for about two years and that Hamzeh had been fired from two jobs where they worked together.\n\"He smoked weed all the time. He's crazy. He didn't show up\" for work, the 32-year-old Jawad said. \"He's just a stupid kid, super stupid.\"\nHamzeh also recently was fired from a job as a trainer at downtown kickboxing gym after several member complaints. Gym owner Delia Luna said Hamzeh wasn't a good fit and was \"very intense, very militant.\"\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3418710/FBI-Man-plotted-attack-wanted-kill-Israelis.html"}
