{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:33:03","date_modify":"2018-10-30 21:33:03","date_publish":"2016-08-30 23:39:58","description":"The FBI could release on Wednesday the details of its investigation into Hillary Clinton's email scandal, according to news reports. The FBI's | Politics","filename":"data/vaneerConsumption/FBIMayReleaseDetailsofInvestigationintoHillaryClintonEmailScandal.json","image_url":"https://media.breitbart.com/media/2016/07/AP_16187558448760.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_30__1540935183.html","title":"FBI May Release Details of Investigation into Hillary Clinton Email Scandal","title_page":"FBI May Release Details of Investigation into Hillary Clinton Email Scandal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The FBI could release on Wednesday the details of its investigation into Hillary Clinton’s email scandal, according to news reports.\nThe FBI’s investigation led FBI Director James Comey to the controversial decision not to bring criminal charges against Hillary Clinton, even as he characterized Clinton as being “extremely careless” with the nation’s secrets.\nComey came to the novel determination that Clinton did not “intend” to break the nation’s security laws, meaning she did not “intend” her email server to showcase vital intelligence to enemy hackers.\nEven as he applied the unusual “intention” ruling to Clinton’s case, Comey warned that no other case would be afforded such lenient judgment.\nThe news of the pending release of the FBI report comes on the heels of news that dozens of Hillary Clinton emails about the terror attack on U.S. facilities in Benghazi, Libya had only now been found after she insisted such messages didn’t exist.\nUp to 15,000 “missing” emails have been discovered of which roughly 30 pertain to the debacle at Benghazi that ended in the deaths of four Americans, including the U.S. ambassador to Libya, Chris Stevens.\nThese emails were apparently not included in the original FBI investigation and no one is quite sure why they were excluded.\nDuring the investigation, the agency interviewed Clinton for several hours at FBI headquarters in Washington just days before announcing its decision to close the investigation. The Justice Department accepted the FBI’s recommendation.\nDespite the FBI Director’s finding of no “intent,” though, recent revelations that Hillary tried to permanently destroy emails\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/08/30/fbi-release-results-hillary-clinton-email-investigation-wednesday/"}
