{"authors":["John Hayward"],"date_download":"2018-10-30 20:41:27","date_modify":"2018-10-30 20:41:27","date_publish":"2015-07-10 14:50:09","description":"The FBI announced multiple terror attacks on U.S. soil around the Fourth of July were foiled by the arrest of over ten ISIS-inspired people.","filename":"data/vaneerConsumption/FBISaysArrestsofISISLoneWolvesThwartedDeadly4thofJulyAttacks.json","image_url":"https://media.breitbart.com/media/2015/07/FBI-jacket-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_10__1540932087.html","title":"FBI Says Arrests of ISIS 'Lone Wolves' Thwarted Deadly 4th of July Attacks","title_page":"FBI Says Arrests of ISIS 'Lone Wolves' Thwarted Deadly 4th of July Attacks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"FBI Director James Comey announced on Thursday, as reported by Reuters, that multiple terror attacks on U.S. soil around the Fourth of July holiday were foiled by the arrest of over ten people “inspired by the Islamic State’s recruitment online” over the past four weeks.\nThere was heightened concern about possible terror attacks due to online “chatter” leading up to the Fourth of July, but no attacks were reported. The FBI statement would suggest those concerns were well-founded, but the attacks were thwarted by earlier arrests of potential perpetrators.\n“Comey did not give the details on the number of plots thwarted or their targets,” Reuters reports. “He said dozens of people in the United States who are suspected to be under the influence of Islamic State militants have ‘gone dark’ because of encrypted data.”\nRegarding that concern about terrorists “going dark,” an earlier Reuters post explains that Comey is concerned it would be “easier for Islamic State sympathizers to attack the United States” if law enforcement is not given the tools to crack encrypted communications:\nThe Federal Bureau of Investigation is pushing technology companies to let law enforcement authorities have access to encrypted communications to investigate illegal activities. Those companies have resisted, arguing that such access would weaken systems against criminals and computer hackers. Comey has previously criticized Apple Inc and Google Inc for ramping up encryption. Comey told a U.S. Senate Judiciary Committee hearing that Islamic State, also known by the acronym ISIL, is imploring supporters through Twitter to carry out attacks. Related conversations often take place via end-to-end encryption mobile communications that are unreadable to anyone other than those sending or receiving the messages. “The tools we are asked to use are increasingly ineffective,” Comey said. “ISIL says go kill, go kill. …We are stopping these things so far … but it is incredibly difficult. I cannot see me stopping these indefinitely.”\nHowever, the story goes on to note that Comey “acknowledged to lawmakers that he did not know how often the FBI cannot access encrypted communications,” because he said there was “a lack of reliable data” on the subject.\nIn addition to concerns about Surveillance State invasions of privacy, the computer industry is generally resistant to giving up the kind of access the FBI wants because they fear weakened data encryption would make people more vulnerable to hackers.\nThose skeptical of Comey’s claims about a vaguely described group of suspects arrested just in time to thwart unspecified Fourth of July attacks will doubtless be inclined to accuse the government of concocting a fearsome story to buttress its demands for greater surveillance powers, or perhaps a response to embarrassment that the much-discussed Fourth of July terror threat failed to materialize.\nFor example, writing at CNN, Peter Bergen and Haley Peters accuse FBI, Department of Homeland Security, and CIA officials of “crying wolf” and peddling “sky-is-falling” scares nearly every time the terror alert level has been raised since 9/11.\n“In the post-9/11 world, there are few incentives not to raise the terror alert and issue warnings. In the event of an attack, any indication that intelligence existed that could have thwarted the attack is damning for the departments designed to prevent them,” Bergen and Peters write. “Since there was virtually no downside for U.S. national security officials to issue terrorism alerts, the American public has been regularly warned that some kind of serious terrorist attack is in the offing.”\nThe authors go on to make the case that contrary to what they see as the government’s lax attitude toward threat warnings, “there are significant costs to these terror alerts, both economic and social.”","url":"https://www.breitbart.com/national-security/2015/07/10/fbi-says-arrests-of-isis-lone-wolves-thwarted-deadly-4th-of-july-attacks/"}
