{"authors":["J. Taylor Rushing","U.S. Political Reporter","For Dailymail.Com"],"date_download":"2018-10-23 03:03:34","date_modify":"2018-10-23 03:03:34","date_publish":"2016-01-28 18:22:40","description":"The slow-moving federal train that is the FBI investigation into Hillary Clinton's private email practices may keep running into the general presidential election this fall.","filename":"data/vaneerConsumption/FBIsourcessaydecisiononchargingHillaryClintonwithacrimecouldcomeatanytime.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30A4654100000578-0-image-a-26_1454005248337.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421459_FBI-sources-say-decision-charging-Hillary-Clinton-crime-come-time-height-fall-election-campaign_1540263814.html","title":"FBI sources say decision on charging Hillary Clinton with a crime could come at any time","title_page":"FBI sources say decision on charging Hillary Clinton with a crime could come at any time | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"No 'magical cutoff date' for a prosecution decision about Clinton, says FBI source\nFormer secretary of state used a secret, home-based email server while in office\nFBI probe of Democratic presidential front-runner is still in full swing after six months\nThe slow-moving federal train that is the FBI investigation into Hillary Clinton's private email practices is not slowing down anytime soon - and may keep running into the general presidential election this fall.\nThat's according to a new report in The Hill on Thursday, which said any prosecution decision about the current Democratic race-leader may not come until the time that voters go to the polls for good for 2016.\nThe report quoted FBI sources as saying there is no set time for a final declaration about whether the former secretary of state should be prosecuted for mishandling classified intelligence.\nScroll down for videos\nDemocratic presidential front-runner Hillary Clinton with top aide Huma Abedin at the State Department in 2009\nClinton's email scandal may be perhaps her only hurdle to the Democratic presidential nomination in 2016\n'I don't know that there's any magical cutoff date,' Ron Hosko, an FBI former assistant director, told the newspaper.\nThe Clinton investigation has been the elephant in the room during the Democratic presidential primary process, with audiences wondering if the former first lady could be charged with misconduct.\nDespite a declaration from Clinton's closest rival, Sen. Bernie Sanders - in a nationally televised debate - that Americans are 'sick and tired of reading about your damn emails' - the cloud of prosecution has hung over Clinton's campaign since early last year.\n'It does give pause to Democrats who are concerned that there may be another shoe to drop down the road,' Andrew Smith, a political scientist at the University of New Hampshire, told The Hill.\nCurrently - because Clinton's emails as secretary of state from 2009 to 2013 are still being processed - more than 1,300 emails have been deemed classified that were processed through the server, although some of those classifications may have been retroactive.\nClinton herself has maintained no wrong-doing, and neither the FBI nor the Justice Department would comment to The Hill.\nClinton aide Cheryl Mills lost her Blackberry in 2010 and has been questioned about it by congressional Republicans\nClinton has been plagued with her email scandal since last March\nFBI Director James Comey - a Republican - testified to Congress in December that the Clinton investigation would be 'competent,' 'honest' and 'independent,' telling a Senate committee at one point that 'we don't give a rip about politics.'\nFor his part, President Barack Obama said in an interview last year that he was unaware of Clinton's private email practice, but said he doubted any national security secrets were compromised.\nThat drew a rebuke from the FBI, where agents asserted that they had not finished their investigation - prompting the White House, in turn, to carefully backpedal on Obama's statement, saying it was only his opinion at the time.\nAs The Hill noted in its report, Clinton's top aides at the State Department may end up holding the bag. Her chief of staff, Cheryl Mills, is being investigated by congressional Republicans for possible national security violations, as is longtime Clinton aide Huma Abedin.","url":"https://www.dailymail.co.uk/news/article-3421459/FBI-sources-say-decision-charging-Hillary-Clinton-crime-come-time-height-fall-election-campaign.html"}
