{"authors":["J. Taylor Rushing","U.S. Political Reporter","For Dailymail.Com"],"date_download":"2018-10-23 04:17:28","date_modify":"2018-10-23 04:17:28","date_publish":"2016-01-11 17:22:11","description":"Democratic presidential front-runner Hillary Clinton is facing a still-expanding federal inquiry into her use of a private, home-based email server while she was secretary of state, according to a new report","filename":"data/vaneerConsumption/FBIsourcessayHillaryClintonprobehasgonebeyondheremails.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/3001A4BD00000578-0-image-a-4_1452532810584.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394130_FBI-sources-say-Hillary-probe-gone-emails-public-corruption-linked-Clinton-Foundation_1540268248.html","title":"FBI sources say Hillary Clinton probe has gone beyond her emails","title_page":"FBI sources say Hillary Clinton probe has gone beyond her emails | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hillary has a new headache.\nDemocratic presidential front-runner Hillary Clinton is facing a still-expanding federal inquiry into her use of a private, home-based email server while she was secretary of state, according to a new report published Monday.\nThe report by Fox News says the investigation that was originally initiated to settle whether classified information was mishandled through the secret server in Clinton's New York home is now looking into whether there was any criminal activity involving Clinton Foundation donors and actions by the Sate Department during her 2009-2013 tenure.\nScroll down for videos\nDemocratic presidential front-runner faces a new expansion of a federal investigation into her email practices while secretary of state, this time focusing on the Clinton Foundation\nSpecifically, the expanded probe is examining the 'intersection' of foundation donations and the State Department and whether any public corruption laws were violated, three federal intelligences sources told Fox News.\n'T he agents are investigating the possible intersection of Clinton Foundation donations, the dispensation of State Department contracts and whether regular processes were followed,' one source said.\nConservative critics were quick to pile on Monday morning.\n'The reported expansion of the FBI’s investigation into Hillary Clinton’s secret email server to include public corruption is a very troubling development,' Reince Priebus, chairman of the Republican National Committee, said in a statement.\n'The favoritism toward donors to Clinton’s family foundation from her own State Department is undeniable and Democrats must now be rethinking whether it was smart to put all of their eggs in one basket,' Priebus said.\nThe American Crossroads political committee issued its own statement slamming Clinton.\n'We already know that Hillary Clinton was warned about entangling the State Department with the big-money backers of the Clinton Foundation, and we know that she ignored those warnings—resulting in the first public corruption probe of a U.S. Secretary of State in our generation,' said AC spokesman Ian Prior.\nThe Clinton Foundation global charity has involved all three of the Clintons in recent years. First founded by former President Bill Clinton after he left office in 2001, Hillary Clinton also took a leadership role before resigning to focus on her presidential bid.\nChelsea Clinton now has an executive position in the group, which received more than $144 million in 2013, the most recent year for which information was available.\nClinton was endorsed Sunday by Planned Parenthood of America during a campaign event in New Hampshire\nFox News also reported Monday that pressure over the Clinton case is building within the FBI, and that agents would be upset over a non-prosecution decision in light of the relatively light sentence that former CIA Director David Petraeus received for mishandling classified information.\nPetraus gave secret government data to his mistress and biographer Paula Broadwell, and then lied to FBI agents about it. He eventually pled guilty to a misdemeanor last March.\nAccording to Fox News, the information amassed against Clinton is far greater, with at least 1,340 emails found on her private server that are considered classified. Approximately 100 agents have been assigned to the case, who have each been required to sign non-disclosure agreements.\nAnother source told Fox News, 'the pressure on the lead agents is brutal.'\nOn Sunday, on CBS News’ 'Face The Nation,' Clinton said critics of her email practices were 'people looking for something to throw against the wall... to see what sticks. But there's no there there.'","url":"https://www.dailymail.co.uk/news/article-3394130/FBI-sources-say-Hillary-probe-gone-emails-public-corruption-linked-Clinton-Foundation.html"}
