{"authors":["Associated Press"],"date_download":"2018-10-22 21:25:39","date_modify":"2018-10-22 21:25:39","date_publish":"2016-01-29 06:44:33","description":"BURNS, Ore. (AP) — The FBI released video Thursday of the shooting death of a spokesman for the armed occupiers of a wildlife refuge that appears to show the...","filename":"data/vaneerConsumption/FBIshowsvideoofTuesdayshootingofoccupier.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:761e8a1704c3460b979f5442708419ce-3bmscybNe842cce83474b517e098-204_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420489_3-arrested-Bundy-urges-refuge-occupiers-leave_1540243539.html","title":"FBI shows video of Tuesday shooting of occupier","title_page":"FBI shows video of Tuesday shooting of occupier | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FBI shows video of Tuesday shooting of occupier\nBURNS, Ore. (AP) — The FBI released video Thursday of the shooting death of a spokesman for the armed occupiers of a wildlife refuge that appears to show the man reaching into his jacket before he fell into the snow. The FBI said the man had a loaded gun in his pocket.\nAuthorities showed the video at a news conference to counter claims that the man killed in the Tuesday confrontation on a remote Oregon high country road — Robert Finicum — did nothing to provoke officers.\nRelease of the video came as four occupiers remaining at the Malheur National Wildlife Refuge refused to leave without assurances they wouldn't be arrested. The occupation began nearly a month ago.\nThis photo taken from an FBI video shows Robert \"LaVoy\" Finicum after he was fatally shot by police Tuesday, Jan. 26, 2016 near Burns, Ore. A video released Thursday, Jan. 28, 2016 by the FBI of the shooting death of a spokesman for the armed occupiers of a wildlife refuge shows the man reaching into his jacket before he fell into the snow. The FBI said the man had a gun in his pocket. (FBI via AP)\nDuring the Tuesday confrontation, the FBI and Oregon State Troopers arrested five main figures in the occupation, including Ammon Bundy, their leader.\nThe video, shot by the FBI from an airplane, shows Bundy's vehicle stopped by police on a road. He and an occupier riding with him — Brian Cavalier — were arrested. A white truck driven by Finicum was stopped but took off, with officers in pursuit. The video shows Finicum's vehicle plowing into a snowbank when encountering a roadblock.\nA man identified as Finicum gets out of the truck. At first, he has his hands up, but then appears to reach into his pocket and he falls into the snow.\n\"On at least two occasions, Finicum reaches his right hand toward a pocket on the left inside portion of his jacket,\" said Greg Bretzing, special agent in charge for the FBI in Portland.\n\"He did have a loaded 9mm semi-automatic handgun in the pocket,\" he said.\nBretzing also said Finicum's truck nearly hit an FBI agent before it got stuck in the snow.\n\"Actions have consequences,\" Bretzing said. \"The FBI and OSP tried to effect these arrests peacefully.\"\nThe FBI posted the video to its YouTube channel (http://bit.ly/209MgEw ).\nWith Finicum lying in the snow, the video shows the arrest of two other occupiers as they got out of the stuck truck: Ryan Bundy, who is Ammon's brother, and Shawna Cox. Bretzing said another woman was in the truck but was not arrested. He did not identify her.\nBretzing said agents and troopers \"provided medical assistance to Finicum\" after they were \"confident that they had addressed any further threats.\" He said that happened about 10 minutes after the shooting.\nTwo loaded .223 caliber semi-automatic rifles and a loaded revolver were found in the truck, Bretzing said.\nBretzing said that when Finicum's truck was first stopped, an occupier riding with him — Ryan Payne — got out and surrendered. He said troopers and agents ordered others in the truck to surrender but Finicum sped off.\nBundy and his followers were on their way to a meeting in the community of John Day when then encountered the FBI-led operation to apprehend them. The FBI acted amid growing calls that something be done to end the occupation, including from Oregon's governor.\nThe Oregon State Medical Examiner's Office on Thursday confirmed the person shot in the Tuesday confrontation was Finicum, a 54-year-old Arizona rancher.\nAt the news conference in Burns, Bretzing said four occupiers are still holed up at the wildlife refuge. \"The negotiators continue to work around the clock to talk to those four people in an effort to get them to come out peacefully,\" he said.\nThe occupation by ranchers and others began on Jan. 2, and at one point there were a couple of dozen people holed up, demanding that the federal government turn public lands over to local control. But the compound has been emptying out since the arrest of Bundy, and 10 others over the past few days, and with the death of Finicum.\nOregon Public Broadcasting on Thursday spoke with the holdouts and identified them as David Fry, who is from Ohio, husband and wife Sean and Sandy Anderson of Idaho, and Jeff Banta of Nevada.\nAmmon Bundy on Thursday released a statement through his attorney repeating his call for the last occupiers to leave peacefully: \"Turn yourselves in and do not use physical force.\"\nAll 11 people under arrest have been charged with a felony count of conspiring to impede federal officers from carrying out their duties through force or intimidation. Three of the 11 were arrested Wednesday night when they left the refuge.\nAmmon Bundy is the son of Nevada rancher Cliven Bundy, who was involved in a tense 2014 standoff with the government over grazing rights.\nThe group came to the desert of eastern Oregon in the dead of winter to decry what it calls onerous federal land restrictions and to object to the prison sentences of two local ranchers convicted of setting fires.\nIn a criminal complaint Wednesday, federal authorities said the armed group had explosives and night-vision goggles and was prepared to fight.\nThe charges against Bundy and others say that the refuge's 16 employees have been prevented from reporting to work because of threats of violence.\n___\nPetty reported from Portland, Oregon. Associated Press writers Eric Tucker, in Washington, D.C., Ken Ritter in Las Vegas, Rebecca Boone in Boise, Idaho, and Martha Bellisle and Lisa Baumann in Seattle contributed to this report.\nThis photo taken from an FBI video shows Robert \"LaVoy\" Finicum before he was fatally shot by police Tuesday, Jan. 26, 2016 near Burns, Ore. A video released Thursday, Jan. 28, 2016 by the FBI of the shooting death of a spokesman for the armed occupiers of a wildlife refuge shows the man reaching into his jacket before he fell into the snow. The FBI said the man had a gun in his pocket. (FBI via AP)\nThis photo taken from an FBI video shows Robert \"LaVoy\" Finicum after he was fatally shot by police Tuesday, Jan. 26, 2016 near Burns, Ore. A video released Thursday, Jan. 28, 2016 by the FBI of the shooting death of a spokesman for the armed occupiers of a wildlife refuge shows the man reaching into his jacket before he fell into the snow. The FBI said the man had a gun in his pocket. (FBI via AP)\nThis photo taken from an FBI video shows Robert \"LaVoy\" Finicum before he was fatally shot by police Tuesday, Jan. 26, 2016 near Burns, Ore. A video released Thursday, Jan. 28, 2016 by the FBI of the shooting death of a spokesman for the armed occupiers of a wildlife refuge shows the man reaching into his jacket before he fell into the snow. The FBI said the man had a gun in his pocket. (FBI via AP)\nSecurity was strong at the Mark O. Hatfield U.S. Courthouse in Portland, Ore., Wednesday, Jan. 27, 2016, as the defendants arrested in Harney County had their appearance in court. (Kristyna Wentz-Graff/The Oregonian via AP)\nMike Arnold, left, and Lissa Casey, right, representing Ammon Bundy, spoke briefly after Bundy's appearance in the Mark O. Hatfield U.S. Courthouse in Portland, Ore., Wednesday, Jan. 27, 2016. They read a statement prepared by Bundy which asked the remaining occupiers to \"stand down.\" (Kristyna Wentz-Graff/The Oregonian via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420489/3-arrested-Bundy-urges-refuge-occupiers-leave.html"}
