{"authors":[],"date_download":"2018-10-22 21:20:15","date_modify":"2018-10-22 21:20:15","date_publish":"2014-06-04 16:56:04","description":"Another reason not to miss the previews: $10,000.","filename":"data/vaneerConsumption/FBIsCrackdownonLaserPointersComingSoontoaTheaterNearYou.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/487941/140604-laser-1607_3de81b035589292dbe520b252d86903b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_fbis-crackdown-laser-pointers-coming-soon-theater-near-you-n122541_1540243215.html","title":"FBI's Crackdown on Laser Pointers Coming Soon to a Theater Near You","title_page":"FBI's Crackdown on Laser Pointers Coming Soon to a Theater Near You","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe FBI is going to the movies — to enforce its crackdown on people who point lasers at aircraft.\nThe Bureau announced Tuesday that public safety messages will appear among previews for upcoming flicks, advertising a $10,000 reward for reports on anyone who’s suspected of pointing a laser at an airplane.\n\"We want to encourage people to come forward when they see someone committing this crime, which could have terrible consequences for pilots and their passengers,\" George Johnson, a federal air marshal and liaison officer with the Bureau, said in the FBI’s statement.\nThe nationwide campaign follows a pilot program the Bureau launched in February in a dozen cities including New York, Phoenix, Washington and Chicago.\nSince the program's limited launch, the Bureau found \"lazing\" incidents declined by 19 percent in the targeted areas.\nWhile the pinhole-size beam seems harmless to observers on the ground, its magnitude expands in the sky, and can temporarily blind pilots and cause other hazards, comparable to a camera flash illuminating a dark car.\nIn February 2012, the maximum penalty for aiming a laser at an airplane became a five-year prison sentence and $11,000 fine.\nThe FBI and the FAA began tracking laser strikes in 2005 and have since recorded a 1,100 percent increase in flight obstruction because of these devices.\nLast year, there were 3,960 reports of laser strikes.\nThe FBI encourages anyone with knowledge of “lazing” incidents to dial 911 or contact the local FBI office.\n— Natalie Daher, with the The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/fbis-crackdown-laser-pointers-coming-soon-theater-near-you-n122541"}
