{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:51:40","date_modify":"2018-10-30 22:51:40","date_publish":"2016-12-11 00:00:00","description":"The CEO of the FCA told BI that action against CFD providers from the UK, Germany, and Cyprus' regulators over the last few weeks is a coincidence.","filename":"data/vaneerConsumption/FCACEOAndrewBaileyonglobalcrackdownonCFDindustry.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fca-ceo-andrew-bailey-on-global-crackdown-on-cfd-industry-2016-12_1540939900.html","title":"FCA CEO Andrew Bailey on global crackdown on CFD industry","title_page":"    FCA CEO Andrew Bailey on global crackdown on CFD industry - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Plus500, one of the CFD firms hit by the crackdown, is a shirt sponsor of Spanish football team Atletico Madrid. REUTERS/Michaela Rehle LONDON — Shares in high-risk City companies that let people effectively bet on shares and commodities have collapsed by close to 45% since the start of the month, following a global crackdown on the industry.\nRegulators in Cyprus, Britain, and Germany have all taken action against the companies that offer products known as contracts for difference (CFDs) since the start of the month.\nBritain's Financial Conduct Authority (FCA) found that 82% of customers who use CFDs lose money. The regulator's CEO compared the win-loss ratio to \"stick[ing] it on the horse\" in an interview with Business Insider.\nFCA CEO Andrew Bailey told BI: \"It has to be transparent. Obviously, with an 82%/18% ratio you do have to raise questions about how fair the sector is.\"\nCFDs are essentially bets on whether a share price, a currency, or commodity price will go up or down. The person making the bet wins or loses in increments depending on how close or far the asset is to the price predicted.\nThe instruments, which avoid the fees associated with actually buying a share or commodity, were originally developed in London in the 1990s for hedge funds and other sophisticated investors. But the last two decades have seen a drift towards marketing the product at the so-called \"retail\" market — ordinary people who trade in their spare time.\nThe most controversial aspect of the industry is the amount of leverage it offers. Customers can lose far more money than their initial bet, as CFD providers effectively lend them money. Some platforms offer as much as 200 times leverage — if you deposit £10 you can bet £2,000, meaning you could lose far more than you deposit.\nBailey said: \"To be honest, there are a couple of issues here. You've highlighted how many raise money but I would also highlight the leverage issue, rather than just the winners and losers. You could easily say I could just go down to the betting shop and stick it on a horse, I wouldn't have a better ratio. But this has leverage in it, that's the key issue.\"\nThe FCA has proposed capping leverage for first-time customers at 25:1 and capping all leverage at 50:1. BaFin, Germany's financial regulator, this week also proposed restricting potential losses to only what customers had deposited in their accounts, effectively restricting leverage.\nBailey said the announcements from both BaFin and the FCA in the same week was a complete coincidence. He told BI: \"I can honestly say to you that we were not sitting there knowing that the Germans were going to take action later this week. I think what it reflects is we have exactly the same issues.\"\nThe crackdown has led to a share price bonfire for London-listed providers. The worst hit has been CMC Markets, down almost 45% over the last month: Markets Insider IG Group, another major CFD provider, has seen a similarly dramatic fall: Markets Insider Israeli-based CFD provider Plus500, which was caught up in a major FCA probe last year, has also seen its shares price fall off a cliff over the last month: Market Insider Several platforms have tried to pin the blame on CFD providers operating outside of Europe. IG, for example, said in a statement: \"The Company recognises that there are shortcomings in the approach to the marketing of CFDs and binaries by certain firms, often operating from outside the UK.\"\nThe FCA's Bailey told Business Insider: \"What they highlighted is the fact that it is possible to effectively supply these services from other parts of the European Union. It's true, there are well-known examples of this going on.\n\"However, what I would say they haven't pointed to in their response is they haven't put forward in their responses is we have put restrictions on the marketing of contract for differences by firms coming in from the EU. There we can act. It's not true that we're doing nothing.\"","url":"https://www.businessinsider.com/fca-ceo-andrew-bailey-on-global-crackdown-on-cfd-industry-2016-12"}
