{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:52:03","date_modify":"2018-10-30 22:52:03","date_publish":"2016-12-10 00:00:00","description":"FCA CEO Andrew Bailey says: 'Where one platform doesn't have enough loans, they may take investors money and invest that in loans on another platform.'","filename":"data/vaneerConsumption/FCAonrisksofpeertopeerlendersbuyingeachothersloans.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fca-peer-to-peer-p2p-lenders-buying-each-others-loans-2016-12_1540939923.html","title":"FCA on risks of peer-to-peer lenders buying each other's loans","title_page":"    FCA on risks of peer-to-peer lenders buying each other's loans - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Some platforms are investing in loans originated on rival platforms. Dan Kitwood/Getty Images LONDON — Britain's Financial Conduct Authority (FCA) has found some peer-to-peer (P2P) lending platforms are using customer money to buy loans on rival platforms, rather than fund loans over their own platforms.\nThe FCA's CEO Andrew Bailey told Business Insider: \"What we've seen in a couple of firms in authorisations and supervisions is where one platform doesn't have enough loans at present, they may take investors money and invest that in loans on another platform.\"\nNo platforms involved in the practice were named and Bailey said: \"I don't think it's very common, I think it's quite an early spot from us.\n\"But there are a number of risks there. On the one hand, operationally, if there's too much cross investment you've got a split cap investment trust issues. If one fails it could have knock-on effects throughout the other players. And then also investors may not understand the risks they are getting into because if they've chosen one platform because they like it they might find they're exposed to other platforms.\"\nThe FCA released a new report on regulation of P2P lenders and crowdfunding platforms on Friday suggesting tighter regulation of the P2P lending sector amid concerns that growing complexity is leading to risks that investors may not understand.\nBailey flagged the platform cross-selling risk as one of the regulator's key concerns. The FCA said in Friday's paper that one of the new rules it was proposing for the industry is \"additional requirements or restrictions on cross-platform investment.\"\nP2P lending, also known as marketplace lending, was invented by British company Zopa in 2005. At its simplest, it is people using online platforms to lend directly to either other people or businesses, cutting out banks who normally sit in the middle. Investors get good rates of return and borrowers get quick access to cash.\nOver £8.7 billion has been lent by P2P platforms in the UK since inception, according to AltFi data, with £3.4 billion of that in this year alone. Britain's three biggest platforms — Zopa, Funding Circle, and RateSetter — have all lent over £1 billion each. But business models have become increasingly complex as the industry has evolved and the FCA is concerned that consumers are no longer fully aware of all the potential risks.\nDisclosure has become a major issue in the industry after the CEO of US platform LendingClub, Renaud Laplanche, was forced out in May, in part due to failure to properly flag his own investments in the platform.\nLaplanche failed to disclose a personal interest in a fund that LendingClub was considering investing in and The Wall Street Journal reported he had invested millions in that fund so it could buy LendingClub's loans, effectively to boost demand. The vehicle, which Bloomberg named as Cirrix Capital, bought $114.5 million worth of LendingClub loans in the first quarter of the year, according to a company filing.\nBailey told Business Insider in an interview on Friday that the \"fast-moving, evolving\" peer-to-peer lending industry poses \"some quite big challenges in terms of transparency and fairness.\"\nYou can read the full interview here.","url":"https://www.businessinsider.com/fca-peer-to-peer-p2p-lenders-buying-each-others-loans-2016-12"}
