{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:58:34","date_modify":"2018-10-30 22:58:34","date_publish":"2016-12-09 00:00:00","description":"Andrew Bailey told Business Insider that the 'fast-moving, evolving' peer-to-peer lending industry is 'raising quite difficult issues.'","filename":"data/vaneerConsumption/FCAsAndrewBaileyonpeertopeerlendingChallengesforfairnesstransparencyandregulation.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fca-andrew-bailey-interview-peer-to-peer-lending-fintech-regulation-fairness-transparency-crowdfunding-2016-12_1540940314.html","title":"FCA's Andrew Bailey on peer-to-peer lending: 'Challenges' for fairness, transparency, and regulation","title_page":"    FCA's Andrew Bailey on peer-to-peer lending: 'Challenges' for fairness, transparency, and regulation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Andrew Bailey, FCA CEO. John Stillwell PA Archive/PA Images LONDON — Britain's most senior financial regulator believes that the \"fast-moving, evolving\" peer-to-peer (P2P) lending industry poses \"some quite big challenges in terms of transparency and fairness.\"\nAndrew Bailey, the CEO of the Financial Conduct Authority, told Business Insider in an interview on Friday: \"It's a fast-moving, evolving industry. Some of the directions in which it's going off are posing some quite big challenges in terms of transparency and fairness.\n\"Those are the things that we'll be considering when it comes to the point of proposing and making rules. We always try to balance innovation and competition against having a fair and transparent environment.\"\nBailey was speaking to Business Insider to discuss the watchdog's proposed new rules for the industry, which amount to stricter control of the nascent sector.\nThe FCA is pushing for greater transparency on risks posed to investors and wants more disclosure of the increasingly complex business models that platforms are developing.\nAn £8.7 billion industry that's getting more and more complex\nP2P lending, also known as marketplace lending, was invented by British company Zopa in 2005. At its simplest, it is people using online platforms to lend directly to either other people or businesses, cutting out banks who normally sit in the middle. Investors get good rates of return and borrowers get quick access to cash.\nOver £8.7 billion has been lent by P2P platforms in the UK since inception, according to AltFi data, with £3.4 billion of that in this year alone. Britain's three biggest platforms — Zopa, Funding Circle, and RateSetter — have all lent over £1 billion each.\nBut business models have become increasingly complex as the industry has evolved and the FCA is concerned that consumers are no longer fully aware of all the risks they face.\nI think they should take from it that it's very important that the industry provides them with transparency and clarity, and that they understand what they're investing in\nBailey, who became CEO of the FCA in July, highlighted issues around provision funds — funds reserved to cover expected losses on loans on the platform. He suggested that they blur the lines between P2P and savings accounts, and also cloud the true risks associated with the investment. Provision funds also mean customers are effectively exposed to a wider pool of loans through the provision funds.\nGiven the evolution, Bailey says regulator is considering whether P2P should simply fall under regulation covering collective investment schemes and asset management. He told BI the FCA is \"trying to work out whether it's sensible to distinguish, given the way the industry's evolving, and if so how we distinguish.\"\nHe added that: \"What was envisaged as the business model [for P2P] is not really the one that, in some ways, the industry is moving towards.\"\nDespite the regulatory uncertainty and issues flagged, Bailey told investors not to worry about putting their money on these platforms.\nBailey told BI: \"I think investors should take from this that it's a rapidly evolving industry, it's clearly got a role in terms of financing innovative activity.\n\"But I think they should take from it that it's very important that the industry provides them with transparency and clarity, and that they understand what they're investing in. That's the really crucial message.\"\nWe've reproduced the edited highlights of the interview with Bailey and the FCA's Jason Pope, who authored the P2P and crowdfunding report, below:\nBusiness Insider's Oscar Williams-Grut: The report is about crowdfunding in general but focused on P2P lending, why?\nJason Pope: At the moment that's where we're seeing the most development in the market and where we think we need to focus our time on possibly new rules.\nOWG:Was that driven by the responses to the consultation or what you were seeing in the market?\nJP: A little bit of both. We've been doing a lot of work with authorisation and supervisions. The input from both those areas and the consultation led to that conclusion.\nAndrew Bailey: Just to reinforce what Jason said, I think it's interesting that we've seen a bit of innovation in P2P even while we've been doing the work.\nOWG: One of themes in the report is the growing complexity of the business models and the fact that transparency isn't necessarily increasing alongside that. Presumably, the complexity is not uniform? Do different platforms have different models?\nAB: Absolutely. I'd agree with both your points. As a general matter, the increasing complexity and challenge of transparency, but I also agree with you that that's not a universal or homogeneous development. Probably if anything the business models have become more heterogeneous as time has gone on.\nBailey highlighted issues with platform's advertising no losses, saying it 'obviously an issue.' He did not name RateSetter, but you can see the type of marketing his means on its website. Screengrab Here's the big challenge — there's nothing wrong with that in one sense, that's innovation. That's natural. The challenge for us is to ensure that investors understand the way in which those particular developments are evolving.\nJust to give you one example which we highlight in the paper, it's the question of reserve funds. The challenge there is a couple of things. How transparent is it to investors how that fund operates and what the effect of it is? It's not the same thing as a bank holding capital, where essentially the capital is there to back up the promise that the deposit will be repaid in full.\nWe've seen some funds market saying nobody's ever lost money in our fund and we've got this reserve fund. That's obviously an issue in terms of what message the investor is supposed to take from that.\nThe second reserve fund issue is if you're going to do this is it frankly fair, as in is it equally available to all investors.\nOWG:One of the phrases that stood out to me in the report was: \"Financial promotions do not always meet our requirement to be 'clear, fair and not misleading'.\" Does that relate to the provision fund issues?\nAB: I would say yes.\nJP: Absolutely. Breaking it down a little bit, one thing we look for with that is balance. If benefits are disclosed there should also be prominent disclosure of risks. Sometimes the balance isn't quite right.\nOWG: As these things get more complex, is there an assessment from the FCA on how appropriate they are for non-sophisticated retail investors?\nJP: It's something we look at. In the threshold conditions we look at the business model and as part of that we look at whether it's appropriate. Also in our on-going supervision, we do try to check that firms are treating their customers fairly, acting professionally and in accordance with the best interests of their customers. We're very much alive to that.\nOWG: Back to the provision funds issue, we talked about it in terms of disclosure but the report also talks about how things like provision funds offer new risks as well. What do you mean by that?\nZopa CEO Jaidev Janardana. The company invented peer-to-peer lending in 2005. Zopa JP: We recognise that there are benefits to them but we don't want people to come away thinking that this is an entirely safe investment. We don't want people to think this is the same as a savings account.\nThere are other issues with provision funds — on one hand, they look a little bit like deposits, on the other hand, by pooling risk it brings in the idea that this thing may be looking more like a collective investment scheme. Instead of being exposed directly to individual loans, you're actually exposed to a pool of loans. It suddenly looks much more like an alternative investment fund but without all the fees and the regulatory protections which would apply. There are a number of different risks.\nAB: Just to reinforce Jason's point, some of the investments can be quite lumpy relative to say a classical bank portfolio which would be quite well dispersed. The provision fund could be quite heavily committed to a single failure, let's say. The question then is again transparency. Jason rightly said we're not against provision funds per se, but the way in which they work is very important in terms of fairness and transparency.\nOWG: Are your concerns uniform across P2P or is it just certain platforms that concern you?\nAB: What I would highlight is that it's a fast-moving, evolving industry. Some of the directions in which it's going off are posing some quite big challenges in terms of transparency and fairness. Those are the things that we'll be considering when it comes to the point of proposing and making rules. We always try to balance innovation and competition against having a fair and transparent environment.\nOWG: I was speaking to someone in the industry this week who was speculating that the delay for some platforms to be authorised was because the FCA was concerned a lot of these platforms are beginning to look like collective investment schemes. Is that true?\nAB: That's right. This is the challenge. We've got two things here. We've got obviously a collective investment scheme, which is many investors on one side of the balance sheet and many investments on the other. Then you've also got a bank and the bank deposit world at another point on the map.\nI think the pure P2P model, it's one investor and one borrower. The borrower can have more than one investor but the investor is in for one borrower. That's different to a collective investment scheme. But in practice what we're seeing is that's not the business model, it's evolving. P2P is evolving in a different way.\nThe person you spoke to is, in essence correct, that's the challenge we're facing and that's the challenge the authorisation process is facing. What was envisaged as the business model is not really the one that, in some ways, the industry is moving towards.\nFunding Circle's co-founders, from left, Andrew Mullinger, Samir Desai, and James Meekings. Funding Circle OWG: Does that raise questions about how appropriate a separate regulatory regime is altogether?\nAB: Obviously it does. Obviously, it gives quite a lot of boundary issues.\nOWG: How are you approaching that?\nAB: We're frankly — and this is why it's taking some time — trying to work out whether it's sensible to distinguish, given the way the industry's evolving, and if so how we distinguish, given the industry is evolving.\nOWG: In terms of the authorisation of the big three — Funding Circle, Zopa, and RateSetter — what is the progress there and how does this review affect that?\nAB: We don't comment on individual firms if you don't mind.\nOWG: More generally then, are you still moving authorisations forward at this point or is that on ice while you draw up the new rules?\nAB: No, we are. We are moving forward authorisation and our intention to go through the process. We can't just stop. What I think today, it's an important point, we too want to be transparent about the process and we're very aware that the industry has concerns and questions about how the process is evolving.\nOWG:People in the industry have been telling me they feel this is a tougher new regime that's come in, with both change at the FCA and the Treasury. Is that fair?\nAB: Well, the way I'd respond to that is to go back to the point we've just been discussing, which is that the industry is evolving very rapidly. I wouldn't characterise it as saying this is a fixed point, we took one view in the past and now we've changed our minds and our taking a different view. We're not. We're not contradicting ourselves. We're very conscious that, in the context of rapid innovation, we're dealing with a moving target. It, therefore, does raise issues. There are elements of the innovation that we are heading off in directions that are raising quite difficult issues.\nRhydian Lewis, RateSetter CEO. RateSetter OWG: Another thing that crops up quite a bit in the report is conflicts of interests. Does that relate to what we were talking about earlier with provision funds?\nAB: That's an example. We also highlighted the point that there's institutional money in there as well as retail money. It does raise some questions about, again, whether there is fair treatment of two different sorts of investors in which the relationships could be quite different.\nJP: The institutional-retail split is the main area where conflicts can arise.\nOWG: What should investors on these platforms take from all this?\nAB: I think investors should take from this that it's a rapidly evolving industry, it's clearly got a role in terms of financing innovative activity. But I think they should take from it that it's very important that the industry provides them with transparency and clarity, and that they understand what they're investing in. That's the really crucial message.\nOWG:You wouldn't say hold off investing until we've sorted this out?\nAB: No I wouldn't, but what I would say is that I think it's really important that investors feel they have all that they need to understand the risk that they're taking.\nOWG: And you don't think they do at the moment?\nAB: I wouldn't say that. At the moment it is harder in some areas than it ought to be.","url":"https://www.businessinsider.com/fca-andrew-bailey-interview-peer-to-peer-lending-fintech-regulation-fairness-transparency-crowdfunding-2016-12"}
