{"authors":["John Hayward"],"date_download":"2018-10-30 18:14:17","date_modify":"2018-10-30 18:14:17","date_publish":"2016-04-14 18:24:45","description":"Ajit Pai, one of the two Republicans on the five-member FCC, says a $51 million fraud investigation into the Lifeline cell-phone welfare program was kept hidden until after a key vote to expand the program was held. | Politics","filename":"data/vaneerConsumption/FCCCommissionerAllegesFraudInvestigationKeptQuietUntilAfterKeyObamaphoneExpansionVote.json","image_url":"https://media.breitbart.com/media/2015/10/Cellphone-in-Pocket.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_14__1540923257.html","title":"FCC Commissioner Alleges Fraud Investigation Kept Quiet Until After Key 'Obamaphone' Expansion Vote","title_page":"FCC Commissioner Alleges Fraud Investigation Kept Quiet Until After Key 'Obamaphone' Expansion Vote | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ajit Pai, one of the two Republicans on the five-member Federal Communications Commission, says a $51 million fraud investigation into the Lifeline cell-phone welfare program was kept hidden until after a key vote to expand the program was held.\n“Commissioners were told that the Notice of Apparent Liability could not be released or publicly discussed until April 1, 2016, conveniently one day after the Commission was scheduled to expand the Lifeline program to broadband. That’s not right,” Pai wrote in his dissent from the FCC decision.\n“Pai did not say who issued that directive,” the Washington Free Beacon reported. “However, it had the effect of preventing public knowledge of widespread fraud in the Lifeline program ahead of a contentious vote on expanding it despite persisting concerns about a lack of internal safeguards.”\nPai’s contention was challenged by FCC spokesman Will Wiquist, who insisted that the timing of the enforcement action “was in no way related to the timing of the vote on the program modernization.”\nThe “modernization” Wiquist referred to was expanding the Lifeline program – which began in 1985 as a program to wire the homes of low-income Americans for landline phone service, and was expanded to distribute “free” cell phones in 2005 – so it would provide a subsidy for Internet services as well.\n“The new program could allow Lifeline subscribers to apply a $9.25-per-month subsidy to a broadband service,” International Business Times reported in March. “It will also set minimum service standards, currently at 10 Mbps download/1 Mbps uploads and 150 GB. For now, a subscriber must choose between fixed broadband or stand-alone mobile. The FCC is also proposing a phaseout of a voice-only option and require all Lifeline subscribers to switch to broadband by 2019. In that year, the program will be reviewed. The budget is set at $2.25 billion.”\nIt was estimated that this $2.25 billion program would ultimately extend broadband service to some 55 million people who do not currently enjoy it.\nThe fraud investigation concerned Lifeline phone provider Total Call Mobile, which was accused of “systematic and egregious conduct” and “widespread enrollment fraud” for enrolling tens of thousands of false Lifeline beneficiaries, and keeping the extra $9.7 million in subsidies doled out by the federal government.\n“The FCC caught onto the scheme when the company enrolled an undercover FCC investigator in the program without asking for any eligibility documentation,” the Free Beacon reports.\nFalse enrollments, enrollment for ineligible people, and beneficiaries snagging multiple phones are among the primary complaints against the Lifeline program from critics.\nCommissioner Pai is a longtime critic of waste and fraud in the program, having previously described the lack of safeguards against abuse as “shocking.” In addition to the timing of disclosure about the fraud investigation of Total Call Mobile, he also criticized the Notice of Apparent Liability from the FCC for pursing only a small portion of the duplicate Lifeline enrollments that were discovered, saying that 2,587 cases were cited out of 32,498 that were identified.\nThis dramatically reduced the scale of the financial penalties involved. “Even though we have evidence that Total Call Mobile bypassed federal safeguards to enroll 99.8% of its subscribers, we hold the company liable for only 16%. Under these circumstances, our precedent suggests that a forfeiture of at least $84,295,910 would have been appropriate. Yet the Commission settles for something much less,” Pai wrote in his dissent.\nMichael O’Rielly, the other Republican FCC commissioner, criticized the FCC for “proposing a very large fine that does not appear to be fully supported by the law and Commission precedent,” arguing that some of Total Call’s behavior might fall outside the statute of limitations. Whether the fine is too large or too small, Pai and O’Rielly would seem to agree that the amount is somewhat arbitrary.\nHowever, O’Rielly expressed “extreme frustration” that the Lifeline program uses SNAP – i.e. the food stamp program – as an entry point for beneficiaries, and thought the FCC has a lot of “gall” to claim that Lifeline is a “highly accountable program,” when it’s “painfully obvious to anyone paying attention that SNAP is riddled with waste, fraud, and abuse.”\nHe warned that years of fraud would probably occur before a proposed national verification system for Lifeline eligibility could be put in place, saying that “at best, we will be throwing good money after bad.”\nThe Lifeline program is widely referred to as “Obamaphones” by both beneficiaries and detractors, although the program long predates the election of President Obama. The principal reason the name “Obamaphone” stuck was a viral video from the 2012 election, in which a beneficiary of the program declared at an Ohio event for Republican candidate Mitt Romney that it was important to vote for Obama, because he guarantees a number of benefits, including “free phones.”\nThe phones are not, in fact, “free” – they are financed by a special tax paid by all paying cell phone customers, who are largely unaware the Lifeline program exists. The program is already a welfare-state juggernaut, all but impervious to reform no matter how much waste and fraud is discovered, and the expansion aims to make 55 million people dependent upon it for “free” or heavily subsidized Internet access. As the Free Beacon observes, providers like Total Call have well-financed lobbying operations, and not even multiple regulatory offenses appear sufficient to disconnect them from federal subsidies.\nThe sad truth is that whether Pai is correct or not about pressure to keep the fraud investigation quiet until after the expansion vote, it probably wouldn’t have made much of a difference if it had been widely reported before April 1.","url":"https://www.breitbart.com/politics/2016/04/14/fcc-commissioner-alleges-fraud-investigation-kept-quiet-key-obamaphone-expansion-vote/"}
