{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:17:49","date_modify":"2018-10-30 18:17:49","date_publish":"2015-02-16 22:38:02","description":"Ajit Pai declared that Obama's plan to regulate the Internet via the FCC, coupled with potential FEC regulations would be \"pretty dangerous\"","filename":"data/vaneerConsumption/FCCCommissionerProposedFCCFECRegsPrettyDangerous.json","image_url":"https://media.breitbart.com/media/2015/02/Pai-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_02_16__1540923469.html","title":"FCC Commissioner: Proposed FCC, FEC Regs 'Pretty Dangerous'","title_page":"FCC Commissioner: Proposed FCC, FEC Regs 'Pretty Dangerous' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Republican FCC Commissioner Ajit Pai declared that President Obama’s plan to regulate the Internet, coupled with potential FEC regulations would be “pretty dangerous” on Monday’s “Sean Hannity Show.”\nWhen asked how a website like the Drudge Report would be impacted, Pai stated “there’s not much within the four corners of the document that hint at anything regarding content. What I can tell you is one my friends over at the Federal Election Commission, Lee Goodman has been outspoken about the fact that some of the commissioners there are very interested in looking at content online that, in their view, shapes the political discourse. And so if you pair what the FCC is doing in terms of the Internet’s infrastructure, and what the FEC might do in terms of the Internet’s content, you see a pretty dangerous combination in terms of government control over not just what we say, but how we say it.”\nRegarding the impact of the plan on Internet users, he declared “bills for broadband are going to go up, this order opens the door to a vast array of federal and state fees because it’s going to be treating the Internet, for the first time, essentially as telephone service…Secondly, it’s going to mean that the speeds that your listeners use—the speeds your listeners get when they’re accessing the Internet are going to slow down because obviously these networks don’t build themselves. The private sector has to take the risk and invest the capital to build those networks and if they know the FCC’s going to micromanage them every step of the way, they’re going to be less likely to build some of those high-speed connections,” and that the regulations would lead to “much less competition” over the long term.\nEarlier, after criticizing the plan’s secrecy Pai stated “the details of the plan itself are very intrusive, it’s a massive shift in favor of government control of the Internet. Everything from your wireless service plan, to your wire line connection at home. And I think ultimately it’s going to lead to higher prices, slower speeds for consumers on broadband services, it’s going to be government rate regulation and second-guessing of the private sector, and it’s going to be a bonanza for trial lawyers. We specifically invite all the trial lawyers to sue, class-actions across the country for any and all Internet practices.” He further questioned the legal authority of the FCC to adopt such regulations.\nHe added that net neutrality regulations proposed back in May were a “lighter touch” than the current proposal.\nPai also spoke on interference by the White House in FCC regulation of the Internet, he claimed “White House aides have been running a parallel FCC, and they’ve persuaded the president to pick this issue as one where he would make a pronouncement, now, just to let your listeners know, this never happens, hardly.” And that the new proposal sent out by the FCC’s Chairman was “exactly what the president wanted.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2015/02/16/fcc-commissioner-proposed-fcc-fec-regs-pretty-dangerous/"}
