{"authors":["John Hayward"],"date_download":"2018-10-30 18:17:40","date_modify":"2018-10-30 18:17:40","date_publish":"2016-02-17 16:50:47","description":"FCC Commissioner Ajit Pai warned about the erosion of free speech on Tuesday.","filename":"data/vaneerConsumption/FCCCommissionerFreeSpeechIsEndangeredFromCampusestotheInternet.json","image_url":"https://media.breitbart.com/media/2015/10/free-speech-protest-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_17__1540923460.html","title":"FCC Commissioner: Free Speech Is Endangered, From Campuses to the Internet","title_page":"FCC Commissioner: Free Speech Is Endangered, From Campuses to the Internet | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"FCC Commissioner Ajit Pai warned about the erosion of free speech in an interview with the Washington Examiner on Tuesday, making a crucial point about how a generation comfortable with thuggish intimidation on campuses and the Internet will have a weak immune system against the virus of official censorship. Liberty is a habit, which Pai perceptively warned we are losing.\n“Largely what we’re seeing, especially on college campuses, is that if my view is in the majority and I don’t agree with your view, then I have the right to shout you down, disrupt your events, or otherwise suppress your ability to get your voice heard,” said Pai.\nOff-campus, he cited Twitter’s recent creation of a speech-policing “Trust and Safety” board — loaded with social justice warrior activists — as an example of private censorship that erodes our resistance to government speech and thought control.\n“Private actors like Twitter have the freedom to operate their platform as they see fit, [but] I would hope that everybody embraces the idea of the marketplace of ideas. The proverbial street corner of the 21st century, where people can gather to debate issues is increasingly social media, which serves as a platform for public discourse,” he said.\nWhen free-speech champions criticize Twitter (or the even more draconian speech controls practiced by platforms like Facebook, in open coordination with government officials), they are often told the First Amendment doesn’t apply to such situations, because private companies can restrict the services they offer however they please. The easy answer to that simplistic defense is that the critics of social media censorship have no coercive government power themselves — they are using free speech to criticize a private offense against the idea of free speech.\nWhat twisted interpretation of the First Amendment would require good citizens to silently accept corporate suppression of political dissent? It’s simply astounding that just a few generations after the counterculture movement flourished in the United States, liberal Americans think corporate censorship and mob-enforced conformity are super awesome, provided they crush dissenters with the “wrong” ideas.\nPai makes another vital point about the importance of embracing free-speech ideals. “The text of the First Amendment is enshrined in our Constitution, but there are certain cultural values that undergird the amendment that are critical for its protections to have actual meaning. If that culture starts to wither away, then so too will the freedom that it supports,” he warned.\nThe FCC commissioner touched on an alarming trend that goes well beyond free speech, although it is most clearly on display in that arena: the camouflaging of government power through “voluntary” cooperation between Big Government and Big Business. Pai spoke of influential officials musing that certain information sources, such as the Drudge Report or Fox News, have gained too much power to influence public discourse… at which point Internet service providers might take the hint, using their “private-sector” powers to quietly implement speech restrictions the government can’t order directly.\nThe German government provided a direct example of this by making deals with Facebook, Twitter, and other social media platforms to suppress… unhelpful dissent over Chancellor Angela Merkel’s refugee policies.\nAs indefatigable free-speech champion Mark Steyn put it last week: “It is remarkable how easily vast numbers of people now accept that truth is subordinate to the needs of ideological conformity – as we saw in Europe on New Year’s Eve, when politicians, police and press colluded to cover up mass sexual assault – and, as their cover-up unraveled, millions of self-described progressives and feminists indignantly insisted that the cover-up had been the correct call.”\nGermany doesn’t have the First Amendment — no one else does, which is why it’s madness for America to give up control over Internet domain registration — but those “only government can violate the First Amendment” fetishists should consider that Merkel’s strategy probably wouldn’t run afoul of the U.S. Constitution. Powerful American officials doesn’t have much trouble talking social-media tycoons into “voluntarily” doing what Washington cannot formally compel. It can be done quietly, behind closed doors.\nIf we are not vigilant defenders of free speech — if we lose the habits of liberty Commissioner Pai described — we will lose it. A new generation that considers freedom of expression and association negotiable at best, and problematic at worst, will soon emerge from campus. Uncompromising defense of free expression and association is already dismayingly difficult to find among American voters. This is not something Americans were meant to compromise.","url":"https://www.breitbart.com/tech/2016/02/17/fcc-commissioner-ajit-pai-free-speech-is-endangered-from-campus-to-the-internet/"}
