{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:17:46","date_modify":"2018-10-30 18:17:46","date_publish":"2015-02-27 19:25:35","description":"FCC Commissioner Ajit Pai said that new FCC regulations will make \"state, property, and other taxes go up\" and the effects will be \"severe\"","filename":"data/vaneerConsumption/FCCCommishNewRegsWillHaveSevereTaxImpacts.json","image_url":"https://media.breitbart.com/media/2015/02/Pai-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_02_27__1540923466.html","title":"FCC Commish: New Regs Will Have 'Severe' Tax Impacts","title_page":"FCC Commish: New Regs Will Have 'Severe' Tax Impacts | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"FCC Commissioner Ajit Pai (R) said that new FCC regulations will make “state, property, and other taxes go up” on providers and the “immediate effects in some of the taxation are going to be severe” on Friday’s “Bloomberg West.”\n“Decisions about how the Internet is going to work will now instead of being made by engineers and technologists be made by lawyers and bureaucrats. But, first and foremost consumers are going to see their broadband bills go up. In couple of months, the FCC is going to tee up a proposal to increase the tax — to impose a tax on broadband. Immediately, though providers are going to see their state and property — state, property, and other taxes go up, and those are going to be imposed on consumers as well. And so, I think the wallet, unfortunately, is going to feel the pinch first.” He clarified that the broadband tax proposal was separate from the FCC’s Title II regulations.\nPai continued, “the regulations themselves are going to be very far-reaching as people see, if and when the FCC releases the plan. But some of the immediate effects in some of the taxation are going to be severe also.”\nPai added that he was concerned about “the extent to which the FCC is inserting itself into virtually every aspect of how the Internet works…this goes far beyond that [Net Neutrality], [it] regulates the very nuts and bolts of the Internet. Such things as interconnection, even second-guessing service plans that wireless broadband providers might offer. And, in fact, there’s still a lot of uncertainty about how these rules will be applied. The FCC leadership yesterday was asked ‘well, how will this Internet conduct rule,’ for example, which is a catch-all rule meant to cover any Internet conduct ‘how will that work?’ And he said, ‘we really don’t know.'”\nRegarding Net Neutrality, Pai argued “it’s compelling on the surface. But, from an FCC perspective, when you look at it, it’s going to be worse off for everybody, for edge providers and ISPs. It’s going to be bad, first and foremost, because the FCC doesn’t have the expertise to determine what the agreements — ISPs reach with edge providers in terms of interconnection. But, more fundamentally, the question is this: Do you want an unelected bureaucracy, three bureaucrats in particular, to make decisions about how the internet functions?”\nHe concluded, “Title II will drive competition out of the marketplace. We’ve heard from hundreds and thousands of smaller companies, wireless companies, small cable companies, and others, who say that Title II is a tremendous mistake, and that they don’t have the resources to comply with these regulations. So, if we push some of these smaller providers out of the marketplace ironically enough, we’re going have fewer choices for consumers, rather than more.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2015/02/27/fcc-commish-new-regs-will-have-severe-tax-impacts/"}
