{"authors":[],"date_download":"2018-10-22 22:22:59","date_modify":"2018-10-22 22:22:59","date_publish":"2014-05-09 23:05:33","description":"The robotic arm named for Luke Skywalker and can perform multiple, simultaneous movements, a huge advance over the metal hook currently in use.","filename":"data/vaneerConsumption/FDAApprovesStarWarsRoboticArmforAmputees.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/433386/140509-robotic-arm-1859_fc78b48049ea17844fd829ec8beaf63c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_fda-approves-star-wars-robotic-arm-amputees-n101921_1540246979.html","title":"FDA Approves 'Star Wars' Robotic Arm for Amputees","title_page":"FDA Approves 'Star Wars' Robotic Arm for Amputees","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe U.S. Food and Drug Administration has approved a robotic arm for amputees that is named for the \"Star Wars\" character Luke Skywalker and can perform multiple, simultaneous movements, a huge advance over the metal hook currently in use.\nThe FDA said on Friday it allowed the sale of the DEKA Arm System after reviewing data, including a U.S. Department of Veterans Affairs study in which 90 percent of people who used the device were able to perform complex tasks. These included using keys and locks, feeding themselves, using zippers and brushing and combing hair.\nThe prosthetic arm was developed by New Hampshire-based DEKA Research and Development Corp, founded by Dean Kamen, the inventor of the Segway and other devices.\nThe Pentagon's Defense Advanced Research Projects Agency (DARPA) said it provided more than $40 million in funding to DEKA to develop the robotic arm as part of a $100 million project to improve prosthetics. \"It was designed to produce near-natural upper extremity control to injured people who have suffered amputations. This arm system has the same size, weight, shape and grip strength as an adult's arm would be able to produce,\" said Justin Sanchez, a program manager in DARPA's biological technologies office.\nThe FDA said the device is the first prosthetic arm that can carry out multiple, simultaneous movements controlled by signals from electromyogram electrodes that detect electrical activity caused as a person contracts muscles.\n— Reuters","url":"https://www.nbcnews.com/health/health-news/fda-approves-star-wars-robotic-arm-amputees-n101921"}
