{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:30:34","date_modify":"2018-10-30 20:30:34","date_publish":"2017-01-08 09:28:19","description":"It is Christmas Eve for Egypt’s Copts but Marie Labib is not in a festive mood, with dark thoughts haunting her weeks after a church bombing.","filename":"data/vaneerConsumption/FearfulEgyptCoptsMarkChristmasAfterChurchBombing.json","image_url":"https://media.breitbart.com/media/2016/08/egypt-christian.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_08__1540931434.html","title":"Fearful Egypt Copts Mark Christmas After Church Bombing","title_page":"Fearful Egypt Copts Mark Christmas After Church Bombing","title_rss":"NULL","source_domain":"breitbart.com","text":"CAIRO (AFP) — It is Christmas Eve for Egypt’s Copts but Marie Labib is not in a festive mood, with dark thoughts haunting her weeks after a church bombing killed 28 members of her community.\nCopts, who make up about one-tenth of Egypt’s population of more than 92 million and who celebrate Christmas on Saturday, have long complained of discrimination.\nThe Islamic State group claimed responsibility for the December 11 suicide bombing that killed 28 worshipers during Sunday mass in Cairo, the latest bout of bloodshed in the Muslim-majority country.\n“No one feels festive. I haven’t baked a cake,” said Labib, a 47-year-old mother of two who lives in the upscale Cairo district of Maadi.\nIn her living room a huge picture of Jesus Christ hangs on a wall and a small Christmas tree strung with lights sits on a table.\n“Fear grips me each time one of my three children goes out,” she said, adding that she has urged her daughters to hide the cross worn around their necks “to avoid any possible attack.”\nThe church bombing as well as the murder on Monday in second city Alexandria of a Coptic wine merchant, whose throat was slit by a man for apparently religious motives, has compounded fears among Copts.\n‘Normal to be worried’\n“I don’t feel secure. It is as if someone could kill me thinking that this act would bring them closer to God,” said Marina Najji, one of Labib’s daughters.\nThe 25-year-old bank employee said she would not heed her mother’s advice to conceal her cross under her clothes when she is out “because it is a part of me.”\nBut she quickly added: “This is not a happy holiday and I hope it will pass without any problem.”\nThe December 11 attack was the second church bombing targeting Egypt’s Copts since 2011, when 21 worshipers attending New Year’s Eve mass in Alexandria were killed.\nThe wine merchant’s murder has only deepened the sense of nervousness.\n“It is very normal to be worried after two attacks taking place in less than a month,” said 37-year-old accountant George.\nGeorge, who lives in the Pyramids district of Cairo, said he went to Alexandria last week to attend New Year’s mass and was shocked by the tight security.\n‘You can’t feel safe’\nMetal detectors have been installed at the gates of the churches in Cairo and Alexandria for Coptic Christmas and barriers erected around them to prevent anyone from parking cars in the area.\nGeorge said he was body-searched before he went inside the Alexandria church by security agents checking for explosives.\n“It’s regrettable that even in church you can’t feel safe,” he said.\nEarly Friday morning worshipers thronged the Virgin Mary church in north Cairo, entering one by one through a metal detector.\n“These are merely precautionary measures. They are not meant to frighten worshipers,” said a church official who declined to be named.\nAdel Ishaq, a 30-year-old father of a two-week-old girl, said he knew three people killed in the December 11 church bombing.\nSince that bloody attack he has been struggling with his fear of going to church and his mother has implored him to stay away from the house of worship.\n“Each time I get ready to go to church fear overwhelms me because I think that I could be the next victim, but I manage to overcome it,” he said.\n“Ever since the bombing, Copts feel they have to overcome a challenge,” said Saeed Saadallah, a man in his 70s.\nThere have been dozens of anti-Christian attacks in Egypt in recent years.\nIn August 2013 supporters of ousted Islamist president Mohamed Morsi torched a dozen churches and Coptic properties after a police crackdown that left hundreds of Islamist demonstrators dead.","url":"https://www.breitbart.com/middle-east/2017/01/08/fearful-egypt-copts-mark-christmas-church-bombing/"}
