{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 00:39:02","date_modify":"2018-10-23 00:39:02","date_publish":"2017-04-26 10:27:06","description":"No trace of Wayne Jeffs (pictured with fiancée Carla Holbrook) has been discovered for almost a month, despite police mounting a 'specialist search' near their home in Biggleswade, Beds.","filename":"data/vaneerConsumption/Fearsgrowforfathertobe29missingforthreeweeks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9ECEB900000578-0-image-a-2_1493199939354.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446782_Fears-grow-father-29-missing-three-weeks_1540255142.html","title":"Fears grow for father-to-be, 29, missing for three weeks","title_page":"Fears grow for father-to-be, 29, missing for three weeks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A heavily-pregnant fiancee has pleaded with her partner to return home after he 'disappeared off the face of the earth' three weeks ago.\nWayne Jeffs, 29, was last seen by Carla Holbrook on April 6 when he left the home they shared to go shopping.\nBut despite police mounting a 'specialist search' near their home in Biggleswade, Bedfordshire, no trace of the father-to-be has been found.\nCarla, who is seven months pregnant, made an emotional plea for the safe return of her partner.\nCarla Holbrook (shown left) has pleaded with Waye Jeffs (pictured left and right) to return home after he 'disappeared off the face of the earth' three weeks ago\nShe said: 'I just need to know that he is alright. Even if he doesn't want to come home at the moment, just to know he is safe would be enough.\n'What I can't stand is the not knowing where he is. I can't understand how there has been no trace of him at all, it's like he vanished off the face of earth.\n'There's just no explanation for it, it's so out of character. This is meant to be one of the happiest times of our lives.'\nCarla and Wayne, who have been together for five years, had been due to get married on April 15.\nHowever, they postponed the wedding in November after finding out they were expecting their first baby together.\nCarla last spoke to plasterer Wayne over the phone but shortly afterwards, his phone ran out of battery, and it has not been switched on since.\nThe expectant mother called police when he failed to return home the next day, sparking a three-week search by police and volunteers.\nHe also failed to pick up his wages the day after he was last seen and didn't take any belongings from the couple's home.\nCarla and Wayne (pictured), who have been together for five years, had been due to get married on April 15\nCarla, who also has a ten-year-old daughter Cadey Holbrook from another relationship, said: 'People have been so supportive in helping me try and find him.\n'There can't be a single bit of Biggleswade that hasn't been searched. He can't be nearby or someone would have found him by now.\n'The police have even sent a helicopter up on a few occasions to try and locate him but he's nowhere to be seen.\n'I'm tearing my hair out trying to find answers. He has nothing with him to keep him going for this long.'\nCarla described Wayne as 'distant' on the night he disappeared and believes he may have things on his mind that he didn't want to discuss with her.\nShe said: 'There was something on his mind and if he had been with me, I think I would have been able to find out what it was.\n'I tried to press him on the phone but he just got agitated with me and I was getting nowhere.\nDespite police mounting a 'specialist search' near their home in Biggleswade, Beds, no trace of the father-to-be has been found\n'I wasn't worried when he didn't come home that night as I thought he might have wanted some space and stayed at his dad's or something.\n'But when he didn't turn up for work the next day, I knew something was wrong. Him not collecting his wages was what really made me worry.\n'I don't know what is on his mind but it's nothing we wouldn't be able to sort. He just needs to know that no matter what, he can come home.'\nA Facebook group called 'Find Missing Wayne Jeffs' has been set up to try and help find him, but despite numerous sightings, none have turned out to be him.\nWayne is described as white, around 5'8', slim with brown hair.\nHe was last seen wearing a blue hooded top, navy blue jogging bottoms, and black Nike trainers.\nHe is thought to have a blue hooded top with him from Henlow-based NG Bruce Plastering, his place of work.\nDetectives are appealing for any information regarding his whereabouts.\nDetective Inspector Janine Graham said: 'We have carried out extensive work to find Wayne but as of yet we have been unable to locate him.\n'We're continuing to urge anyone who believes they may have seen a man matching Wayne's description in the last two weeks to get in touch, and we would also like to ask Wayne himself to contact us, in confidence, to let us know that he is alright.'\nAnyone with information on Wayne's whereabouts is asked to contact police on 101.","url":"https://www.dailymail.co.uk/news/article-4446782/Fears-grow-father-29-missing-three-weeks.html"}
