{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-22 22:47:47","date_modify":"2018-10-22 22:47:47","date_publish":"2016-01-28 11:03:24","description":"The 34-year-old posted the saucy snap on Thursday, showing off her slender figure in the squeaky burgundy dress and leaving very little to the imagination.","filename":"data/vaneerConsumption/FearneCottonturnsintoasexysireninracyskintightlatexdress.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A99F3B00000578-0-image-a-50_1453978438524.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420690_Fearne-Cotton-turns-sexy-siren-squeezes-slim-post-baby-figure-racy-skintight-latex-dress_1540248467.html","title":"Fearne Cotton turns into a sexy siren in racy skintight latex dress","title_page":"Fearne Cotton turns into a sexy siren in racy skintight latex dress  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her effortless, eclectic and often vintage boho-chic style.\nSo when Fearne Cotton squeezed her supple and slim post-baby figure into a super-sexy latex dress, it's no surprise her fans were left awestruck.\nThe 34-year-old posted the saucy snap on her Twitter and Instagram pages on Thursday, showing off her slender figure in the squeaky burgundy dress and leaving very little to the imagination.\nScroll down for video\nWhit-woo! Fearne Cotton looked sensational in a skintight latex dress in a picture shared on social media on Thursday, ahead of that evening's episode of her new fashion programme with Gok Wan\nWith the dress sitting snugly to her flawless physique, the former BBC Radio 1 presenter's whittled waistline and svelte hips were accentuated thanks to the garment's design.\nShe also revealed her small but perfectly formed cleavage in the low-cut number, and her enviable shapely pins with a pair of towering heels.\nHer golden blonde locks were coiffed into a chic wavy 'do, and she looked gorgeous with a pop of red on her lips.\nHowever, Fearne confessed it wasn't actually all that comfortable to wear, and that it was all for her new TV show, writing: 'Find out long it took me to squeeze into this latex dress on tonight's Fearne & Gok Off The Rails. #CantBreathe.'\nHer normal look: The sexy style was a huge departure for the 34-year-old who often wears more vintage-effect numbers, like at the National TV Awards last week\nEclectic: The mother-of-two often shares snapshots of her striking ensembles on Instagram - she usually mixes vintage pieces with plenty of colour and always a towering heel\nHer fans couldn't hold back their amazement at Fearne's stunning figure and appearance in the notoriously tricky-to-wear style, one favoured by the likes of bodacious star Kim Kardashian.\n'How can you look like that when you've had children? You look AMAZING!!! Xxx' wrote ‏@Tatie755 in reply to the image.\nAnd @wandatt simply praised her as 'STUNNING,' while ‏@Toastwars commented: '@Fearnecotton you look sooooooo hot.'\n'Beautiful as always! The fact that you can squeeze into it is well beyond my flabby self, so well done!!!!! :)' another follower - ‏@PucatuB - said, full of praise for her post-pregnancy figure.\nFearne currently appears opposite one of the UK's favourite fashion TV stars in the new ITVBe series - called Fearne & Gok: Off The Ralis.\nThe programme sees the fashionable duo being joined by two celebrity experts who give their opinion on what was worn on the red carpet week to week.\nFilming kicked off earlier in the month for the show, which will initially have a six episode run comprising of 60 minute long episodes.\nBoho babe: During her second pregnancy, she favoured floaty, boho-chic styles\nProud mum: Fearne gave birth to her second child, daughter Honey Krissy, in September. She and husband Jesse Wood were already parents to two-year-old son Rex\nThe emphasis will be placed on award season and both Gok and Fearne will give insights into how to prep for the red carpet in all aspects including clothes, hair and make-up.\nIt's one of the first jobs style icon and Very fashion designer Fearne has had since welcoming Honey Krissy Wood into the world in September.\nHer daughter Honey is the star's second chlid with husband Jesse Wood: they were already parents to two-year-old son Rex Rayne.\nMeanwhile, the fashion favourite previously spoke to Glamour about her style moments and the best time to dress up.\nShe said: 'My favourite time to dress up is when I don't, when there's kind of… a non-event, it's like walking from my car to work is the perfect non-event to get dressed up for.\n'Each night I quite like going home and picking a little outfit I might wear tomorrow and how it might look, and I always have little ideas of things I want to try out so, it doesn't really bother me to be honest - it's not extra pressure and if I get it wrong in someone else's eyes, I don't care, it's all good!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420690/Fearne-Cotton-turns-sexy-siren-squeezes-slim-post-baby-figure-racy-skintight-latex-dress.html"}
