{"authors":["David Rosenberg","Gluskin Sheff"],"date_download":"2018-10-30 23:11:57","date_modify":"2018-10-30 23:11:57","date_publish":"2018-07-20 00:00:00","description":"The Federal Reserve's Beige Book released Wednesday had several anecdotes about how hard it is for employers to find enough skilled workers. Gluskin Sheff's David Rosenberg says this is good news for Main Street but bad news for Wall Street.","filename":"data/vaneerConsumption/FedBeigeBookshowsUSeconomyatinflectionpointRosenbergsays.json","image_url":"https://amp.businessinsider.com/images/5b50dd60c1ab5318008b4888-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-economy-labor-market-inflection-point-rosenberg-2018-7_1540941117.html","title":"Fed Beige Book shows US economy at inflection point, Rosenberg says","title_page":"    Fed Beige Book shows US economy at inflection point, Rosenberg says - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"David Rosenberg. Gluskin Sheff\nWhen I discuss that we are late cycle and use the baseball analogy, the two responses I get the most are \"We're going into extra innings\" or \"It may be the eighth or ninth, but the innings are getting much longer, so the fat lady ain't gonna be singing for a long, long time.\"\nWishful thinking. A clear case of hope triumphing over experience.\nAnd it has little to do with the expansion heading into Year 10, as it is rather obvious that we spent considerable time this cycle just climbing ourselves out of the deep hole, and massive spare capacity, left over from the Great Recession.\nWhat it has to do with is a closed output gap. The labor market hitting the wall. Wages accelerating, which both crimps profit margins and generates some moderately higher inflation that then kicks the Fed into a higher gear. In other words, the business cycle is far from dead, even if dormant for an extended period.\nThe Fed's Beige Book was notable in this regard. While the mentioning of \"tariffs\" was the second-highest ever recorded, and an added complication for the business sector, every single region described a situation of there being no more slack at all in the labor market, and at a time when loose immigration policy to alleviate the pressure is, politically speaking, out of the question. At the same time, and as Jay Powell recently indicated, the lack of capital deepening this expansion has left the economy, at least over the near term, bereft of any potential for a productivity pickup.\nAs such, the aggregate supply constraints are acute, the recent fiscal stimulus was nothing more than a classic Keynesian demand-side boost, ill-timed for this stage of the cycle — and, frankly, the latest set of Federal Open Market Committee minutes was rather clear on this issue. Hence, the Fed has more work to do, at a time when the yield curve already is at its flattest shape since just before the last recession, and the big surprise ahead will be a bout of cyclical inflation. Powell will not be smiling for much longer, if my prognosis is correct.\nAnd my confidence level that we have hit — if not breached — the capacity limits of the labor market was on full display in the recent Fed Beige Book, and companies are responding to this situation much as they have in the past when the cyclical baseball game was indeed in the ninth inning.\nHere are some glaring examples:\nBoston:\n\"Manufacturing contacts said the labor market was tight, but the exceptional difficulties were mostly in highly skilled areas like engineering ... Higher freight costs continued to be an issue across a wide array of industries, with the shortage of commercial truck drivers being cited as an important factor. Several manufacturing contacts said that they were only able to pass through a portion of the higher costs to customers. As a result, margins were declining.\"\nNew York:\n\"Businesses reported particular trouble filling senior positions and finding technically skilled workers, especially in IT. One business contact observed that almost all job-seekers are already employed ... Contacts in the transportation industry noted further shrinkage in their workforce.\"\nPhiladelphia:\n\"Staffing firms reported ongoing demand for workers, but a scarcity of candidates, plus difficulty hiring and retaining employees. As the job market tightens, wages have risen, and employers have converted more full-time temporary workers to permanent employees than is normal ... On balance, wage growth appears to have accelerated to a moderate pace and was more widespread. Over half of the nonmanufacturing contacts reported increases in wage and benefit costs. Several banking contacts also noted rising wages, especially for lower-wage jobs.\"\nCleveland:\n\"Contacts reported the dearth of qualified workers constrained hiring across an array of occupations. The problem was most often highlighted by manufacturing, construction, and transportation companies. One steel contact noted the company had significantly increased overtime hours to cope with the worker challenge. A nonresidential builder noticed that worker turnover was somewhat higher than normal.\"\nRichmond:\n\"Employers continued to report tight labor markets, while candidates increasingly receive multiple jobs offers. Firms reported difficulty filling positions for mechanics, construction workers, engineers, commercial lenders, treasury and risk managers, accountants, IT personnel, hospitality workers, and skilled trade positions.\" (Was anyone left out?)\nAtlanta:\n\"Broadly, business contacts across the District cited low availability of quality labor as a growing challenge ... Some contacts cited persistent challenges with turnover; as a result, they were increasingly investing resources in retention efforts.\"\nChicago:\n\"As they have for some time, contacts indicated that the labor market was tight and reported difficulties filling positions at all skill levels. Manufacturers continued to report that they had delayed or turned down projects because of difficulties in finding workers. A staffing firm that primarily supplies manufacturers with production workers reported no change in billable hours.\"\nSt. Louis:\n\"To attract and retain employees, firms reported lowering hiring standards, offering more-generous non-wage benefits, and establishing training programs through partnerships with local schools and non-profit organizations. Contacts noted difficulties filling construction and trucking positions in particular ... Contacts reported that the continued tight labor market has led to increased wages in the services sector, particularly for entry-level positions.\"\nMinneapolis:\n\"A May survey of manufacturing firms showed strong hiring sentiment among respondents in Minnesota and the Dakotas. However, tight labor restricted firms' ability to find workers ... State workforce development offices widely reported relatively stable or higher job postings, but fewer job seekers. In Montana, May job postings with the state rose by 2 percent over a year earlier, while active job seekers fell by 21 percent. A Montana staffing firm reported that 'hiring demand and job orders are up, but [worker] candidates are down.'\"\nKansas City:\n\"A high percentage of contacts in the District reported labor shortages for some skill sets, especially within the manufacturing sector. In particular, contacts noted difficulty finding retail sales staff, skilled IT workers, commercial drivers, and restaurant workers. Wages increased moderately in most sectors, and firms expected a similar pace of growth in the months ahead.\"\nDallas:\n\"Labor market tightness continued across a wide array of industries and skill sets, with several contacts saying difficulty finding workers was constraining growth to some extent. Oilfield services firms noted shortages of mechanics and truck drivers, and one contact said hiring and retaining workers in the bottom 20 percent of their payroll was a challenge ... Wage pressures remained elevated, and firms expected to give employees a larger increase in wages this year compared with 2017. Several firms were employing multiple strategies to recruit and retain employees, such as intensifying recruiting, raising wages, offering on-the-job training and/or increasing variable pay/bonus.\"\nSan Francisco:\n\"Tight labor market conditions persisted across all sectors, leading to a pickup in wage growth. Contacts continued to report challenges retaining workers. In the Mountain West, a few major national employers attracted low-skilled warehouse workers from smaller businesses that could not match their starting wages. Across the District, contacts observed higher starting salaries and increased bonuses to attract skilled financial service and information technology professionals ... Shortages of plumbers, electricians, and other specialized workers drove wage pressures for these positions and led to construction project delays in some cases.\"\nSo there you have it. I have been in the economic/financial market forecasting profession for over 30 years and have never before witnessed a Beige Book so replete with labor supply constraint commentary. This makes a mockery, in fact, of the prior similar messaging written about late in the game of prior cycles. Inflation, especially the wage component, is a classic lagging indicator. But we are at an inflection point where labor cost trends are going to accelerate far more discernibly than has been the case thus far. All the working man (and woman) has to do is read this document to realize the extent that labor is now in the driver's seat.\nWhat it means for the economy\nThis has several implications, all good for Main Street and none very good for Wall Street.\nA wage pickup would help foster positive growth in real personal incomes, especially since companies do not have the flexibility to pass the costs fully through. This then crimps profit margins, at a time when the prior relief from tax cuts and dollar weakness are in the rearview mirror.\nThen there is this other little problem called interest rates. Only the future knows how far the Fed is truly behind the curve at present, but our work suggests 100 basis points, if not more. The Fed has decided to focus on average hourly earnings, which have been distorted by compositional shifts with regard to industry, skills, and demographics.\nFederal Reserve Board Chair Jerome Powell. Jacquelyn Martin/AP\nMeanwhile, fixed-weight indices like the Employment Cost Index, which decades ago was viewed by the Fed as the gold standard for underlying wage trends, is running at a cycle-high pace currently and yet conveniently ignored by today's central bank. The Fed is searching for any reason to move rates up gradually, actually leaving them negative in real terms in the process, and there will be a price for this lack of calibration in the not-too-distant future. The Atlanta Fed wage tracker and unit labor costs are already flagging an upturn, and once all this shows through in average hourly earnings from the nonfarm report, the genie will be out of the bottle.\nIn addition to what the future holds in term of incrementally higher labor costs — not to mention the cost involved of training the plethora of unskilled workers who are being employed (the Beige Book was rife with this experience) — we have this other little problem, which is interest expense.\nPundits seem to have it in their heads that corporate finances are protected this cycle from the premise that businesses, which went on a literal debt spree, locked in their obligations with long-term bonds. Well, partly true, but the reality is that the US corporate sector still has $2.5 trillion of short-term obligations, which will add at least $25 billion to interest expense, a conservative estimate that assumes the Fed isn't ultimately forced to abandon its gradualist posture and move toward a slightly more aggressive stance. Of course, a case can always be made that the Fed moves to the sidelines, but just consider the sort of market pullback that would entail (not pretty).\nSuffice it to say that all the information gleaned in the Beige Book — just how widespread and acute the labor shortages are (both from an industry and a regional perspective), as well as how this is constraining economic growth as is, and how companies are reacting (such as competing for labor now by increasing their entry-level pay) — is late-cycle behavior, pure and simple. Invest accordingly, and that means ignoring the noise on bubblevision and looking straight past the forest for the trees.\nDavid Rosenberg is a chief economist and strategist at Gluskin Sheff, the previous chief North America economist at Merrill Lynch, and the author of the daily economic report \"Breakfast with Dave.\" Follow him on Twitter @EconguyRosie.","url":"https://www.businessinsider.com/us-economy-labor-market-inflection-point-rosenberg-2018-7"}
