{"authors":["Howard Schneider"],"date_download":"2018-10-30 23:45:54","date_modify":"2018-10-30 23:45:54","date_publish":"2018-07-17 00:00:00","description":"Fed Chairman Jerome Powell appeared before the Senate Banking Committee on Tuesday as part of his semi-annual testimony before Congress.","filename":"data/vaneerConsumption/FedChairmanJeromePowelldiscountsrisksoftradewarsayseconomyremainsstrong.json","image_url":"https://amp.businessinsider.com/images/5b4e203d7b67142d058b4bd8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fed-chairman-jerome-powell-discounts-risks-of-trade-war-says-economy-remains-strong-2018-7_1540943154.html","title":"Fed Chairman Jerome Powell discounts risks of trade war, says economy remains strong","title_page":"    Fed Chairman Jerome Powell discounts risks of trade war, says economy remains strong - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Jerome Powell testifies before the Senate Banking, Housing and Urban Affairs Committee on his nomination to become chairman of the U.S. Federal Reserve in Washington, U.S., November 28, 2017. Joshua Roberts/Reuters\nWASHINGTON (Reuters) - U.S. Federal Reserve Chairman Jerome Powell, discounting the risk that a trade war may throw a global recovery off track, said the economy is on the cusp of \"several years\" where the job market remains strong and inflation stays around the Fed's 2 percent target.\nIn written testimony delivered to the Senate Banking Committee on Tuesday, the Fed chair signaled not just that he believes the economy is doing well, but that an era of stable growth may continue provided the Fed gets its policy decisions right.\n\"With appropriate monetary policy, the job market will remain strong and inflation will stay near 2 percent over the next several years,\" Powell said in one of the strongest affirmations yet that the Fed is within reach of its dual policy targets more than a decade after the United States endured a deep financial crisis and recession.\nThe Fed \"believes that - for now - the best way forward is to keep gradually raising the federal funds rate\" in a way that keeps pace with a strengthening economy but does not raise rates so high or so fast that it weakens growth, Powell said.\nStock and bond markets were largely flat as Powell began his testimony, and analysts said there was little of surprise in the initial message.\n\"His takeaway was the job market is strong, inflation is going to stay near 2 percent. To me that means two more hikes this year,\" said Peter Cecchini, chief market strategist at Cantor Fitzgerald in New York.\nPowell did not address his individual views on the appropriate pace of tightening or whether he thinks, as some of his colleagues have argued, that the Fed should pause its rate hike cycle sometime next year if inflation remains under control. But markets expect the central bank to raise rates two more times this year from the current target level of between 1.75 and 2 percent.\nPowell took questions from Senators after presenting his written statement to them, and will appear before a House committee on Wednesday.\nPowell and other Fed officials have in recent remarks pointedly declined to declare \"victory\" in their effort to hit the 2 percent inflation target, though most have acknowledged that, with joblessness at 4 percent, their employment goal has been reached.\nBut the Fed's preferred measure of inflation hit 2.3 percent in May, and was right at 2 percent after excluding more volatile food and energy prices.\nInflation is \"close\" to the Fed's target and \"the recent data are encouraging,\" Powell said as he laid out the reasons why he felt the United States' near decade-long expansion was set to continue.\nStill-low interest rates, a stable financial system, ongoing global growth and the boost from recent tax cuts and increased federal spending \"continue to support the expansion\" Powell said.\nAfter a solid start to the year, growth appears to have accelerated as \"robust job gains, rising after-tax incomes, and optimism among households have lifted consumer spending in recent months. Investment by businesses has continued to grow at a healthy rate,\" Powell said.\nPowell did nod to the uncertainty surrounding the Trump administration's trade policies, which organizations like the International Monetary Fund have warned could curb global growth if ongoing rounds of U.S. tariffs and retaliation by other countries raise prices, lower demand, and disrupt global business supply chains.\nBut \"it is difficult to predict the ultimate outcome of current discussions over trade policy,\" he said. Overall the risks to the economy were \"roughly balanced,\" with the \"most likely path for the economy\" one of continued job gains, moderate inflation, and steady growth.\n(Reporting by Howard Schneider; Additional reporting by Shruthi Shankar; Editing by Andrea Ricci)","url":"https://www.businessinsider.com/fed-chairman-jerome-powell-discounts-risks-of-trade-war-says-economy-remains-strong-2018-7"}
