{"authors":[],"date_download":"2018-10-30 21:08:59","date_modify":"2018-10-30 21:08:59","date_publish":"2018-09-13 16:21:22","description":"The Treasury Department reported Thursday that the federal deficit increased by $214 billion in the month of August, pushing the yearly deficit for Uncle Sam to $898 billion, as with one month left in the fiscal year, this could be the largest yearly amount of red ink for the feds since 2012.","filename":"data/vaneerConsumption/Federaldeficitjumpsby214billioninAugust.json","image_url":"https://cmgajcjamiedupree.files.wordpress.com/2018/09/debt14.jpg?w=122","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/jamiedupree.blog.ajc.com/2018_09_13__1540933739.html","title":"Federal deficit jumps by $214 billion in August","title_page":"Federal deficit jumps by $214 billion in August | Jamie Dupree - AJC","title_rss":"NULL","source_domain":"ajc.com","text":"View Caption Hide Caption\nThe Treasury Department reported Thursday that the federal deficit increased by $214 billion in the month of August, pushing the yearly deficit for Uncle Sam to $898 billion, as with one month left in the fiscal year, this could be the largest yearly amount of red ink for the feds since 2012.\nAugust was the fourth straight month that total federal revenues coming in to Uncle Sam were down from a year ago, as the federal government brought in $219 billion in receipts, but sent out almost twice that in August, a total of $433 billion in spending.\nThe deficit for all of fiscal year 2017 was $665.8 billion – right now, the 2018 deficit is already $233 billion more than that, with one more month to go – as another deficit in September would push the federal government toward a deficit of $1 trillion, a figure not seen since 2012.\nThose higher deficits come at a time of increased economic growth, spurred in part by a GOP tax cut plan, which has reduced corporate income taxes by over $70 billion this year.\nStronger GDP growth, but even bigger deficits: The U.S. budget deficit has widened to 4.4% of GDP in August from 3.3% one year earlier and 2.3% in 2015 https://t.co/7VcAkNZYhA pic.twitter.com/yG3ZSVu3AK — Nick Timiraos (@NickTimiraos) September 13, 2018\nJust last month, the White House estimated that the budget deficit for this year would be $890 billion – it would take a surplus in the month of September to reach that – otherwise, the deficit will spill over $900 billion, which would be largest yearly deficit in six years.\nEven with the benefits of tax cuts spurring new growth, the White House has publicly predicted that the deficit will be back over $1 trillion in 2019 – and stay there for several years.\nAt this pace, President Trump may total up more in deficits in his first two years, than in the final three years of the Obama Administration.\nFor those wondering about the cost of just servicing the existing over $21 trillion debt – interest payments on the debt accounted for $32 billion of the deficit in August.\nSo far in 2018, Uncle Sam has spent $332 billion – just paying interest.","url":"http://jamiedupree.blog.ajc.com/2018/09/13/federal-deficit-jumps-by-214-billion-in-august/"}
