{"authors":[],"date_download":"2018-10-30 14:10:54","date_modify":"2018-10-30 14:10:54","date_publish":"2016-11-07 16:09:00","description":"Federal poll monitors will be stationed in three Georgia counties including Fulton and Gwinnett for the presidential election","filename":"data/vaneerConsumption/FederalmonitorscomingtoGeorgiatowatchelection.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/07/Images/newsEngin.16725952_102716-ELX-Early-Voting-HS03.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_a356a4599af16866e8be9d93081244f0__1540908654.html","title":"Federal monitors coming to Georgia to watch election","title_page":"Federal monitors coming to Georgia to watch election","title_rss":"NULL","source_domain":"ajc.com","text":"Fulton and Gwinnett are among three counties in Georgia where federal poll monitors will be stationed Tuesday on Election Day, the U.S. Justice Department has announced.\nThe deployment is part of a nationwide effort by federal officials in this election that will send more than 500 monitors to 28 states to assure compliance with federal voting laws.\nGeorgia Secretary of State Brian Kemp said Monday morning he was confident the election would go well. He encouraged voters concerned with anything they see at the polls to call his office toll free at 877-725-9797 or to log onto the elections page of the office’s main www.sos.ga.gov website to submit a complaint.\nHancock County, where voting advocates have tussled with election officials over alleged voter purges and polling location closures, is the third Georgia county where federal monitors will be stationed. The Justice Department is also staffing its own toll free hotline at 800-253-3931.\nVoting advocates including the Georgia NAACP had petitioned the Justice Department to consider sending federal monitors here for the presidential election, which is the first since a 2013 U. S. Supreme Court decision striking down a provision in the national Voting Rights Act requiring jurisdictions with a history of racial discrimination to seek approval before making changes to voting rules.","url":"https://www.ajc.com/news/state--regional-govt--politics/federal-poll-monitors-fulton-gwinnett-counties-election-day/cGyF577xSs1laYaEQr2LpO/"}
