{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:11:17","date_modify":"2018-10-30 22:11:17","date_publish":"2016-03-28 18:30:23","description":"On March 28 U.S. District Judge Ramona V. Manglona ruled that a Northern Mariana Islands handgun ban violates the Second Amendment. |","filename":"data/vaneerConsumption/FederalJudgeNorthernMarianaIslandsHandgunBanViolates2ndAmendment.json","image_url":"https://media.breitbart.com/media/2016/03/woman-pointing-handgun-David-Duprey-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_28__1540937477.html","title":"Federal Judge: Northern Mariana Islands Handgun Ban Violates 2nd Amendment","title_page":"Federal Judge: Northern Mariana Islands Handgun Ban Violates 2nd Amendment | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On March 28 U.S. District Judge Ramona V. Manglona ruled that a Northern Mariana Islands handgun ban violates the Second Amendment.\nManglona is the Chief Judge for the United States District Court for the Northern Mariana Islands.\nAccording PR Newswire, Manglona ruled the Commonwealth of the Northern Mariana Islands (CNMI) is bound by the restrictions placed upon it by the Second Amendment to the U.S. Constitution. And Manglona particularly cited the fact that the CNMI handgun ban violates Second Amendment protections.\nThe decision comes in a case in which Li-Rong, a Chinese citizen married to an American, was savagely attacked in 2008 and filed suit for the right to keep a gun for self-defense thereafter. Court filings showed that Li-Rong “[suffered] two broken ribs, facial contusions, and possibly a broken orbital bone and eye socket” while home alone. Her post-attack suit centered on a ban against Northern Mariana residents “from possession and importing handguns and handgun ammunition.”\nLi-Rong’s suit was filed by the Second Amendment Foundation (SAF).\nOn March 28 SAF founder and executive vice president Alan Gottlieb told Breitbart News the ruling “will have a direct impact in the 9th Circuit [and] it is another affirmation of the Second Amendment victories in Heller and McDonald.\nGottlieb added:\nThis ruling makes it harder for the gun prohibitionists to get around these important Supreme Court victories. This is one more Second Amendment Foundation victory in an unprecedented string of court victories. But we still must make sure that President Obama or a Hillary Clinton do not stack our courts with anti-rights judges.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/03/28/federal-judge-mariana-islands-handgun-ban-violates-2nd-amendment/"}
