{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:08:58","date_modify":"2018-10-30 21:08:58","date_publish":"2016-05-29 15:27:10","description":"A hardline German BDS group is conducting anti-Israel campaigns from a city-owned and federally-funded property in Bremen.","filename":"data/vaneerConsumption/FederallyFundedBuildingInGermanyUsedForHardlineBDSGroup.json","image_url":"https://media.breitbart.com/media/2016/05/boycott-israel.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_29__1540933738.html","title":"Federally-Funded Building In Germany Used For Hardline BDS Group","title_page":"Federally-Funded Building In Germany Used For Hardline BDS Group","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A hardline German BDS group is conducting anti-Israel campaigns from a city-owned and federally-funded property in Bremen, the Jerusalem Post reported.\nThe Bremen Peace Forum organizes local protests to urge Bremen residents not to buy Israeli products, holding placards showing “bleeding” oranges. The anti-Israel group calls for boycotting merchandise that is imported from all of Israel and not just those manufactured in the settlements.\n“The Bremen Peace Forum has already publicly supported the BDS movement for some time. This [BDS] is nothing other than an anti-Israel, yes, anti-Semitic idea. It intolerable when such institutions are still publicly supported,” Gitta Conneman, a Bundestag deputy from the Christian Democratic Union, told the Post.\nConnemann, who is also a member of the German-Israel parliamentary group, said, “The Bremen Peace Forum may be convinced that it is not anti-Semitic. But it uses, whether conscious or unconscious, anti-Semitic clichés, prejudices, and language.”\n“Where do the politicians and the administration of the city of Bremen stand? Shouldn’t they distance themselves from BDS and the Peace Forum? Clearly, yes!” she continued.\nAndré Städler, the spokesman for the city’s mayor, Carsten Sieling, told the Post that the Bremen Peace Forum has a contract to lease the property, called the Villa Ichon, until 2031 and the length of time cannot be amended. He added that the City of Bremen condemns calls to boycott Israel.\nCalls and emails for comment sent to the Bremen Peace Forum by the Jerusalem Post were not returned. When reached on the telephone, Ekkehard Lentz, the head of the forum, hung up.\nIn 2013, the Villa Ichon barred Jewish music teacher Noemi Köster and Israeli student Maor Shani from attending a lecture on anti-Semitism organized by peace activists and a local Left Party group.\nAccording to a report in the local Bild newspaper, the doorman at the event turned away Shani, who was sporting a yarmulke, by telling him, “Everything belongs to you already anyway, also the media.”\nAccording to the Post, Bremen is the center of anti-Israel activity in Germany.\nBDS activists hold anti-Israel lectures in a range of municipality-funded institutions from the local natural history and ethnographic museum to the city library to its community center.\nPastor Volker Keller from the Bremen Protestant Church resigned from his post on Thursday as the church’s representative for interreligious affairs on the city’s Council for Integration after confessing that he was an anti-Semite.","url":"https://www.breitbart.com/middle-east/2016/05/29/federally-funded-city-owned-building-germany-used-hardline-bds-group/"}
