{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:22:10","date_modify":"2018-10-30 19:22:10","date_publish":"2015-06-09 23:30:58","description":"Dr. Salomon Melgen, the controversial Florida opthalmologist who has been indicted along with his friend Sen. Robert Menendez (D-NJ) on public corruption charges, remains in a Florida jail. A federal judge wants to know more about Melgen's finances before he considers setting bail. |","filename":"data/vaneerConsumption/FederalMagistrateDelaysDecisiononBondforDrSalomonMelgenWhoRemainsinJail.json","image_url":"https://media.breitbart.com/media/2015/04/AP77182058215.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_09__1540927330.html","title":"Federal Magistrate Delays Decision on Bond for Dr. Salomon Melgen, Who Remains in Jail","title_page":"Federal Magistrate Delays Decision on Bond for Dr. Salomon Melgen, Who Remains in Jail | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Dr. Salomon Melgen, the controversial Florida opthalmologist who has been indicted along with his friend Sen. Robert Menendez (D-NJ) on public corruption charges, remains in a Florida jail on separate Medicare fraud charges a day after a federal magistrate “said he wanted more information about [Melgen’s] finances before setting bond,” as the Palm Beach Post reports.\nMelgen has been behind bars since April 14, when he was arrested on 76 separate health care fraud charges. All told, the Department of Justice claims he made $105 million off this alleged fraud.\nOne month ago, U.S. Magistrate James Hopkins, who asked for the additional information on Monday, ruled that the wealthy Melgen, who owns significant assets and property in his native Dominican Republic, was too great a flight risk to be granted bond under any circumstances.\nMelgen promptly fired his entire defense team, one of whom had been heard calling Hopkins an obscenity, and hired a new defense team, which includes well respected Florida attorney Matthew Menchel.\nMenchel successfully went over Hopkins’ head, presenting an argument that U.S. District Court Judge Kenneth Marra found convincing. Marra overruled Hopkins on Friday.\nMelgen’s family, who were in court on Monday, had hoped that Hopkins would order Melgen’s release, but instead Hopkins delayed the release. The Palm Beach Post says “he was particularly interested in how to secure property and bank accounts Melgen, 61, has in his native Dominican Republic. He gave Melgen’s attorneys until Wednesday to exchange information with federal prosecutors, who are asking for a $20 million bond.”\nMelgen’s attorney Menchel said “he would have more information about bank accounts and the value of a house and other property Melgen owns overseas” by Wednesday. He also promised “to have [a] letter Marra demanded from Dominican officials, pledging they would extradite Melgen.”\nIt has been a rough seven weeks in jail for Melgen.\nAccording to his wife, Flor Melgen, “[h]e has lost at least 30 pounds.”\nHis attorney, Matthew Melgen says “Melgen suffers from gout and anemia, has lost a tooth and needs to be screened for possible prostate cancer.”\nIt is unclear if Magistrate Hopkins will issue a release order for Melgen on Wednesday after his attorney delivers the required information to federal prosecutors. If Melgen is released, he would likely be placed under house arrest.\nFinal trial dates for his health care fraud trial and his public corruption trial have not yet been set.\nThe health care fraud trial will be held in Florida. The public corruption trial is currently scheduled to be held in New Jersey. Attorneys for Senator Menendez and Dr. Melgen have asked for a change of venue in that trial to Washington, D.C., but the Department of Justice has opposed that request. The presiding judge has not yet ruled on the change of venue request.\nBoth Melgen and Menendez were granted bond in the public corruption case.","url":"https://www.breitbart.com/politics/2015/06/09/federal-magistrate-delays-decision-on-bond-for-dr-salomon-melgen-who-remains-in-jail/"}
