{"authors":[],"date_download":"2018-10-22 21:38:36","date_modify":"2018-10-22 21:38:36","date_publish":"2014-05-07 20:56:54","description":"FedEx's plan to charge by size has big implications for online shopping.","filename":"data/vaneerConsumption/FedExPlansToChargeBySizeCouldShakeUpECommerce.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/427446/fedexground_a622e3d547954b397d29f8c629f4b3e3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_fedex-plans-charge-size-could-shake-e-commerce-n99741_1540244316.html","title":"FedEx Plans To Charge By Size Could Shake Up E-Commerce","title_page":"FedEx Plans To Charge By Size Could Shake Up E-Commerce","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOne of the great triumphs of modern America is that you can sit in your underwear and buy a new pair without ever leaving your home or paying for shipping.\nThanks to a new move by FedEx, some holes are about to develop in that plan.\nThe shipping giant announced Friday that it would start charging for ground delivery by package size for all deliveries, instead of just those over 3 cubic feet. This would include smaller items that it used to charge for by weight. The new scope of the \"dimensional pricing\" is directly targeted at bulky but light packages containing things like toilet paper, sweaters and shoes. It could be a major upheaval for online shopping whose growth has been propelled in part by stores offering free shipping.\n\"People are being spoiled with the notion that having delivery to the home doesn't cost any more than the store,\" said Satish Jindel, president of ShipMatrix Inc., a developer of shipment-tracking and analysis software.\n\"You drive a truck down the road and you fill it up with pingpong balls, you will lose money,\" said Jindel.\nUnder the current system, a box of 30 rolls of toilet paper weighing 5 pounds only gets charged for its weight. But the 10-inches-by-14-by-24 box it comes in takes up a lot of space in trucks and cargo planes that could go to smaller and heavier boxes. So starting Jan. 1, the shipment will be billed as if it weighed 21 pounds.\n\"Dimensional weight pricing is a common industry practice that sets the transportation price based on package volume—the amount of space a package occupies in relation to its actual weight,\" said FedEx in a statement. UPS also uses dimensional pricing for certain shipments.\n\"People are being spoiled with the notion that having delivery to the home doesn't cost any more than the store.\"\nThe shift comes as FedEx failed to meet its quarterly profits and cut its forecast due to rising fuel costs. Analysts estimate it will recoup FedEx in the low hundreds of millions of dollars in revenue, a sum dwarfed by the FedEx holding company's nearly $45 billion in revenue for 2013. But as business-to-consumer shipping, driven by the growth in e-commerce, continues to grow, FedEx needs to make sure it's getting paid the right amount for the space it's taking up, said David Vernon, an analyst at Sanford Bernstein.\n\"If someone really wants us to deliver the package, they're going to pay us, or frankly go somewhere else,\" said Vernon of FedEx's mentality.\nMany e-tailers, like Amazon, use UPS Ground. But analysts predict that UPS will match FedEx either with a similar policy change or with a rate increase. In March, Fedex issued a general rate increase of 3 percent and UPS followed by bumping up their rates 4.4 percent. If UPS follows suit again, that means online stores and shoppers, drunk on the gravy of free shipping, will have to adjust.\n\"Shippers will definitely change how they behave,\" said Vernon.\nFor instance, Amazon.com could kick certain items out of its Prime shipping service, which lets shoppers pay a flat annual fee and get free two-day shipping on most goods the company sells directly. Or it might have to get smarter about packaging. The electronic retail giant has been mocked by customers online for putting tiny items inside larger boxes. Amazon didn't respond immediately to a request for comment.\nShipping prices could rise, too. Customers will think twice about ordering that $12 package of diapers if it comes with a $14 shipping and handling cost. That could disrupt services that have gotten customers used to paying for regular delivery of basic staples like household paper goods.\nAmazon recently started testing its own delivery service in parts of the country. But one way or another it will still have to deal with the costs of packing its own trucks full of large, light boxes, and consumers will have to pay for any costs passed down the line.\nWhich means consumers will either have to get off their duff to go get that pack of new underwear, or click and lose their shirt.","url":"https://www.nbcnews.com/business/consumer/fedex-plans-charge-size-could-shake-e-commerce-n99741"}
