{"authors":["Nate Church"],"date_download":"2018-10-30 21:53:09","date_modify":"2018-10-30 21:53:09","date_publish":"2018-06-28 04:38:12","description":"A Virginia grand jury indicted 21-year-old James Alex Fields Jr. with a federal hate crime in the death of Heather Heyer.","filename":"data/vaneerConsumption/FederalJuryIndictsManWhoRanOverCounterProtestersatCharlottesvilleRallyforHateCrime.json","image_url":"https://media.breitbart.com/media/2018/06/James-Alex-Fields-Jr-charlottesville-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_27__1540936389.html","title":"Federal Jury Indicts Man Who Ran Over Counter-Protesters at Charlottesville Rally for Hate Crime","title_page":"Federal Jury Indicts Man Who Ran Over Counter-Protesters at Charlottesville Rally for Hate Crime | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Virginia grand jury indicted 21-year-old James Alex Fields Jr. with federal hate crimes in the death of Heather Heyer.\nHeyer’s tragic death took place at the site of a “Unite the Right” rally in Charlottesville in August 2017, protesting the removal of Robert E. Lee’s statue from Emancipation Park. When the demonstrations turned violent, Gov. Terry McAullife was forced to declare a state of emergency. Unfortunately, it was already too late for Heyer as well as two members of the Virginia State Police: Officers H. Jay Cullen and Berke M.M. Bates.\nFields stands accused of one federal hate crime resulting in death, and 28 more in attempt to kill, causing bodily injury. He also faces one count of racially motivated violent interference with a federally protected activity. A state court has charged him with first-degree murder.\nThe charges allege that Fields left the rally after it was declared an “unlawful assembly” to retrieve his vehicle, then used it to deliberately run down a group of chanting counter-protesters.\nAt the time, President Donald Trump decried all who participated in the violence: “I think there is blame on both sides,” he said. “What about the ‘alt-left’ that came charging at, as you say, the ‘alt-right,’ do they have any semblance of guilt?” Trump asked. “What about the fact they came charging with clubs in hands, swinging clubs, do they have any problem? I think they do.” Many people saw those comments as defensive of white supremacy.\nBut during his announcement of the indictment, Attorney General Jeff Sessions declared: “Hateful ideologies will not have the last word and their adherents will not get away with violent crimes against those they target.” He said the indictment “should send a clear message to every would-be criminal in America that we aggressively prosecute violent crimes of hate that threaten the core principles of our nation.”","url":"https://www.breitbart.com/politics/2018/06/27/federal-grand-jury-indicts-man-who-ran-over-counter-protesters-at-charlottesville-rally/"}
