{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:22:27","date_modify":"2018-10-30 19:22:27","date_publish":"2015-03-08 01:44:44","description":"Details are emerging about the federal corruption charges the Justice Department is expected to file against Sen. Robert Menendez (D-NJ). |","filename":"data/vaneerConsumption/FederalCorruptionChargesSenatorMenendezAllegedlyIntervenedIllegallyinDominicanPortSecurityDealand9MillionMedicareOverbillingCase.json","image_url":"https://media.breitbart.com/media/2015/03/AP727977424048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_07__1540927347.html","title":"Federal Corruption Charges: Senator Menendez Allegedly Intervened Illegally in Dominican Port Security Deal and $9 Million Medicare Overbilling Case","title_page":"Federal Corruption Charges: Senator Menendez Allegedly Intervened Illegally in Dominican Port Security Deal and $9 Million Medicare Overbilling Case | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A federal grand jury in New Jersey is expected to return a bill of indictment on corruption charges against Senator Robert Menendez (D-NJ) within the next several weeks. According to media reports, prosecutors in the Department of Justice have presented the grand jury with compelling evidence that Menendez abused the power of his office to provide illegal help to his close friend, Dr. Salomon Melgen, a Florida ophthalmologist born in the Dominican Republic, on several business matters involving the federal government in return for financial favors.\n“Spokesmen for the U.S. Department of Justice and the U.S. Attorney’s Office for the District of New Jersey both said they could not confirm or deny the report,” the New Jersey Law Journal reported late Friday.\nThough lurid allegations that Melgen helped procure under-age prostitutes in the Dominican Republic for Menendez first captured headlines more than two years ago, it is the charges that Menendez used his position as Chairman of the Senate Foreign Relations Committee to intervene on Melgen’s behalf in these personal business matters that would appear to be at the center of the pending federal case against Menendez.\nThe federal case against Menendez is expected to focus on two specific instances of intervention, in which the government would allege:\n(1) Senator Menendez and his staff personally intervened in meetings with the former Director of the Center for Medicare and Medicaid Services, Marilyn Tavenner, and former Secretary of Health and Human Services Secretary Kathleen Sebelius to press the federal government to drop charges that Dr. Salomon Melgen had overbilled taxpayers for $9 million of medical services.\n(2) Through his staff, Senator Menendez asked the U.S. Customs and Border Protection Service to drop plans to give the government of the Dominican Republic security scanning equipment for free that could be used at their ports of entry because such a donation would impede Dr. Melgen’s ability to pursue a legal case to enforce a controversial and lucrative, though still not yet implemented, contract a company under his control obtained with the government of the Dominican Republic more than a decade ago to be the sole provider of such equipment.\nDetails of these allegations surfaced last week when a document announcing a decision by the Third Circuit Court of Appeals that one current aide and one former aide to Senator Menendez would not have to testify before the grand jury investigating these claims until a hearing was held surfaced briefly on the internet.\n“According to the appeals court opinion, the case concerns two issues: a billing dispute that Melgen, a physician, had with the Centers for Medicare and Medicaid Services (CMS), and Melgen’s exclusive deal to sell port screening equipment to the government of the Dominican Republic,” a reporter for the New Jersey Law Journal who saw the document before it was taken down, wrote.\nThe court document also included some new details uncovered by the federal investigation:\nThe government alleges that Menendez and his staff advocated on behalf of Melgen in a June 7, 2012, meeting with Marilyn Tavenner, then acting administrator of CMS; that Menendez later had a follow-up call with Tavenner; and that Menendez and Sen. Harry Reid, D-Nevada, met on August 2, 2012, with Secretary of Health and Human Services Kathleen Sebelius. With regard to Melgen’s contract for port screening equipment, the appeals court said, Menendez’s former chief counsel, Kerri Talbot, asked a staff member from U.S. Customs and Border Protection via email if that agency would refrain from donating used screening equipment to the Dominican Republic, clearing the way for a contractor controlled by Melgen to make a sale. Michael Barnard, a legislative assistant to Menendez on health-care issues, withheld testimony from the grand jury two times by invoking the speech or debate clause. He refused to answer 50 questions about Menendez’s conversations with Tavenner and Sebelius and about other communications between the senator’s office and Alan Reider, Melgen’s lawyer and lobbyist, about the conversations with those officials. Talbot has also refused to answer questions before the grand jury about whether the senator would invoke the speech and debate clause to challenge use of the emails with Customs and Border Protection.\nOn November 25, a federal judge ruled that both Mr. Barnard and Ms. Talbot were compelled to testify before the grand jury. On appeal of that decision, the Circuit Court ruled that a hearing must be held first to determine whether Senator Menendez’s former aides could invoke the speech or debate clause of the Constitution to avoid testifying.\n“The aides withheld testimony by invoking the speech or debate clause, under Article I, Section 6 of the U.S. Constitution, which holds that a senator may not be questioned about legislative acts anywhere but the floor of the Senate,” the New Jersey Law Journal reported.\nTalbot, a 2002 graduate of Harvard Law School, served as chief counsel to Senator Menendez from 2009 to 2014. She is currently a partner at a Washington lobbying firm, the VENG Group, which specializes in promoting progressive causes.\nMenendez was also caught publicly pushing the State Department to enforce the controversial port security deal (without specifically mentioning it by name) at a Senate subcommittee hearing he chaired in 2012.\nAs Breitbart News reported two years ago:\nOn July 31, 2012, Senator Robert Menendez (D-NJ) pressured a State Department official testifying at a Senate Foreign Relations Committee hearing of the Subcommittee on Western Hemisphere, Peace Corps, and Global Narcotics, which he chairs, to “send a message” to the government of the Dominican Republic.\n“What are we willing to do,” Menendez asked the official, to let the Dominican Republic know that it “cannot go ahead with impunity . . . and violate” contracts with companies that are American owned, and perhaps in particular a port security contract for, among other things X-Raying port cargo, that could be worth $500 million over the next ten years with ICSSI, a Dominican company controlled since 2011 by his friend and major contributor, Dr. Salomon Melgen of Palm Beach, Florida. Dr. Melgen is a native of the Dominican Republic and is implicated as a key player in the ongoing scandal surrounding Senator Menendez. Two weeks later, on August 15, 2012 a Dominican commission established by Dominican Republic President Leonel Fernandez, another friend of Dr. Melgen, issued a report containing recommendations highly favorable to Melgen’s ICSSI.\nThe controversial ICSSI contract to be the exclusive provider of port security equipment to the government of the Dominican Republican was granted by executive fiat to the widow of an assassinated former head of the Dominican Army by the president of the Dominican Republic in 2002.\nThe contract was contested as illegal and unconstitutional by many leading Dominican politicians and journalists from the outset since the company established by the Army head’s widow had virtually no assets. In addition, she herself had no experience in the port security industry.\nThough the ICSSI contract has been contested legally in the Dominican courts since its inception, and is yet to be implemented, Senator Menendez’s close friend, Dr. Melgen, purchased a controlling interest in ICSSI in 2011 for $100,000.\nIn late 2012 and early 2013, Senator Menendez’s efforts to prevent the United States from providing the Dominican Republic with free security screening equipment intensified. As Breitbart News reported earlier, in December 2012:\nPedro Pablo Permuy, former aide to Senator Menendez, former Deputy Assistant Secretary of Defense for Latin America, current President of the US-Spain Council, joins Melgen to call on State Department officials in Washington on behalf of ICSSI. They tell Deputy Assistant Secretary Todd Roberson, whose responsibilities include anti-narcotics enforcement, that the State Department should support enforcement of ICSSI’s disputed contract. Melgen also objects to State Department plans to donate port security equipment to a second Dominican port, as it will hurt his disputed contract. An aide to Senator Menendez follows ups with an e-mail to the State Department that reiterates this concern.\nVincio Castillo Seman, Melgen’s cousin and the attorney who has represented him in the Dominican courts, subsequently claimed that Senator Menendez’s former aide Permuy been added to the ICSSI management team to enhance its security credentials.\nPermuy’s skill set, however, was in lobbying and foreign relations, not the operation of a port security company.\nSeman, who has a long history of political connections to the former Trujillo dictatorship that once dominated Dominican politics, is no longer making that claim about Permuy’s involvement in ICSSI, apparently.\nIn January 2013, Menendez continued to pressure the executive branch to help Melgen with his Dominican security port deal, as Breitbart News reported:\n[A] member of Senator Menendez’s staff [now identified as Kerri Talbot] e-mails officials at Customs and Boarder Protection at the Department of Homeland Security. The aide argues against an American donation of port security equipment to a second Dominican report, stating that the Dominican government may not use it properly. “Only by hiring the unnamed private contractor, the e-mail said, could the United States be assured that port security in the Dominican Republic would be enhanced,” according to the Times.\nA well placed source in the Dominican Republic, very familiar with the details of the port security deal, tells Breitbart News the contract is still tied up in litigation, though a decision on its constitutionality may be coming down soon from the country’s Supreme Court of Justice.\n“The Attorney General’s Office filed a request of opposition to the granting of the contract. So did the Directorate General of Customs, as well as the Industries Association of the Dominican Republic, and the American Chamber of Commerce,” the source says.\n“Everyone says that contract is monopolistic and illegal. The case went to the Supreme Court of Justice, where a ruling on the dispute is pending.”\n“There are rumors that the decision of the Supreme Court of Justice favors Melgen and their lawyers,” the source tells Breitbart News. Senator Menendez’s influence may have played a role in that decision.","url":"https://www.breitbart.com/politics/2015/03/07/federal-corruption-charges-senator-menendez-allegedly-intervened-illegally-in-dominican-port-security-deal-and-9-million-medicare-overbilling-case/"}
