{"authors":["Pedro Nicolaci Da Costa"],"date_download":"2018-10-30 22:46:31","date_modify":"2018-10-30 22:46:31","date_publish":"2018-07-30 00:00:00","description":"Shifts in staffing at the Federal Reserve, in particular a surprise vote to the alternate member Esther George of the Kansas City Fed, make the central bank more likely to keep raising interest rates beyond what markets are expecting.","filename":"data/vaneerConsumption/FedGeorgegetssurprisevoteonratesmakeshikesmorelikely.json","image_url":"https://amp.businessinsider.com/images/5b5f0a158f283537008b4854-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fed-george-gets-surprise-vote-on-rates-makes-hikes-more-likely-2018-7_1540939591.html","title":"Fed: George gets surprise vote on rates, makes hikes more likely","title_page":"    Fed: George gets surprise vote on rates, makes hikes more likely - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Esther George, the president and CEO of the Federal Reserve Bank of Kansas City, at a symposium at the Jackson Lake Lodge in Grand Teton National Park near Jackson, Wyoming. AP/John Locher\nWhat a difference a job opening makes.\nA curious staffing quirk at the highest levels of the Federal Reserve suddenly makes it more likely that the central bank will be more aggressive about raising interest rates than Wall Street is expecting.\nHere's what happened: William Dudley stepped down as president of the New York Fed, the one regional central bank that has a permanent vote on the rate-setting Federal Open Market Committee. John Williams, then the president of the San Francisco Fed, was picked to take Dudley's place under highly unusual circumstances after having reportedly been rejected by President Donald Trump as Federal Reserve vice chair. Williams' departure from the San Francisco Fed, which has a vote on the FOMC this year, gives the hawkish president of the Kansas City Fed, Esther George, a surprise vote on interest rates.\nSome key background: The FOMC has 19 members (when at full mast) and 12 voting members. The Fed's board has as many as seven presidentially appointed governors, and they all have a permanent vote on interest rates. The 12 regional district bank presidents, who are appointed by their boards of directors, get rotating votes on the FOMC.\nSo here's how it plays out, according to Ward McCarthy, the chief financial economist at Jefferies:\n\"With John Williams on board as the NY Fed President, vice chairman of the FOMC and, consequently, a permanent voting FOMC member, the San Francisco Fed vote will rotate to alternate FOMC member Esther George of Kansas City,\" he wrote in a research note.\n\"Esther George is scheduled to be a voting member in 2019 as well, giving the FOMC a very hawkish presence for the next 1 1/2 years.\"\nThe Kansas City Fed has historically advocated higher interest rates than other regional Fed banks, though that call proved all too wrongheaded during the latest recession, when the bank was led by the Federal Deposit Insurance Corporation's vice chairman, Thomas Hoenig.\nWhat does this mean for rates in practical terms? The Fed has tightened monetary policy several times since December 2015 after a prolonged period of zero interest rates during and after the Great Recession. Financial markets expect the Fed to hike just twice more — in September and December — and then be done with it. At the same time, policymakers' own forecasts point to as many as three additional hikes next year.\nThere's one caveat, however, which McCarthy unearths from deep inside the FOMC's official rules.\nThese allow \"for the boards of directors in San Francisco, Kansas City, and Minneapolis to hold a special election to allow San Francisco Fed first vice president Mark Gould to vote over the balance of 2018 rather than the alternate, Esther George,\" he wrote. \"That has not been the precedent, however.\"","url":"https://www.businessinsider.com/fed-george-gets-surprise-vote-on-rates-makes-hikes-more-likely-2018-7"}
