{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:22:59","date_modify":"2018-10-30 21:22:59","date_publish":"2014-05-15 11:00:00","description":"TheEducation Value-Added Assessment System (EVAAS) hascreated quite a stir in Houston ISD.  It'sa teacher and principal job performance metric that the |","filename":"data/vaneerConsumption/FedLedEdsTeacherGradingSystemUnderFireinTexas.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/Texas-School-Rally.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_05_15__1540934579.html","title":"Fed Led Ed's Teacher Grading System Under Fire in Texas","title_page":"Fed Led Ed's Teacher Grading System Under Fire in Texas | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TheEducation Value-Added Assessment System (EVAAS) hascreated quite a stir in Houston ISD. It’sa teacher and principal job performance metric that the district has used previously to award bonuses. However, inthe 2012-13 school year, Houston ISD started using another one of the EVAAScomponents — “value added measures” (VAM). Earlier this month, seven teachers filed a federal lawsuit against Houston ISD in response to VAM.\nEVAASis Fed Led Ed’s diagnostic tool of choice. It’s a contracted product from NorthCarolina company SAS,although the often controversial Michelle Rhee, former DC public schoolchancellor turned charter school maven, is creditedwithpioneering the VAM model.\nU.S.Education Secretary Arne Duncan believes so strongly in VAM that he threatened topunish Washington state for refusing to adopt this method of evaluatingteachers and principals; likewise, VAM is the “central feature of theObama administration’s $5 billion Race to the Top” (RTTT) contest wherestates and/or school districts vie for federal grants, the Huffington Post reported.\nRecently,the Texas Education Agency unveiled the VAM feature of T-TESS (Texas TeachersEvaluation and Support System), which will be piloted in schooldistricts around the state starting school year 2014-15. It’s also part of the No Child Left Behind (NCLB)waiver requirement from the U.S.Department of Education (DOE) on which Breitbart Texas previously reported.\nTheHouston ISD teachers filed the lawsuit with the U.S. District Court for the Southern District of Texas. They cited a major issue with VAM as it evaluatedteachers mainly through student standardized test score results, potentially tetheringjob perks and punishments to the ranking system. The casealso alleged the evaluation tool was “arbitrary, unfair and a violationof teachers’ due-process rights” according to the Houston Chronicle.\nTheTexas branch of the American Federation of Teachers (AFT) posted a website news release for itsmembership about the lawsuit. It targeted EVAAS as an inaccurate measurement tool that was unfair. Similarly, some teachers have claimed that it played a large role injobs, according to the Washington Post.\nRegardlessof its critics, the Houston Chronicle stated that districtofficials defended the method. They saidthat it identified teachers whose students were making the most progress.\nMoreover, Revisiting EVAAS for theparticipants “are required to provide data in support of theirinitiatives, goals, and progress.” It also said ” EVAAS will be an invaluable tool in not onlyestablishing baseline data, but also in providing fair and accurate reportingof real progress.”\nUnlike other Texas schooldistricts, Houston ISD’s accountability is a little trickier because the district answers to the Texas Education Agency (TEA) and complies with the state’s NCLB waiver. However, in December 2013, Houston ISD won a $30 million RTTT-District education grant from the U.S. DOE. That meant, in Texas, a state that rejected the Common Core, Houston ISD applied for the federal grant as a district, independently. On certain accountability metrics, they answer to the DOE because of that the money\nRTTT-D is a provisionthrough which public school districts in states like Texas and California, neitherof which are RTTT grant recipients, can vie for Fed Led Ed dollars. Breitbart Texaspreviously reportedon Houston ISD’s RTTT-D status and about the very accountability metrics theynow want to buck.\nTEA spokeswoman Debbie Ratcliffe toldBreitbart Texas that Houston ISD must follow both state and federal laws.\nThisis not the first lawsuit against VAM. Ithas been challenged in other states, according the Texas AFT website. This lawsuit,though, is just one of the first tochallenge teacher evaluations that hinge on student test results, according tothe Houston Chronicle, who believed that the result of the lawsuit could\nInterestingly, the teacher’s union siteposited that the Houston ISD lawsuit was different than the other cases because itwas filed by “highly recognized” area teachers who “contendtheir poor EVAAS ratings do not correlate with the actual performance”resulting in teachers who would find themselves on performance plans because ofthe low ratings.\nBreitbartTexas asked Houston ISD Press Secretary Sheleah Reed what role the teacher’sunion and its national president Randi Weingarten played in the lawsuit. Although Reed said it was a limited role, AFT’s Weingarten was visibly center stage for the lawsuit press conference held at the local Houston Federation of Teachers chapter office.\nWeingartenalso voiced her support for the lawsuit and her concerns with EVAAS and VAM, accordingto Houston Public Media. Weingarten claimed the two main problems with gradingteachers through this evaluation system were the other, which she believed was even worse, “is that they’re just plainwrong!” the article stated.\nWeingarten’snot the only critic; nor the onlycriticism. The lawsuit alleged that teachers would see their evaluations fluctuate from school year to yearregardless of any changes in their teaching style or methods, according to theHouston Chronicle.\nPerhapsmore importantly, even with opposition to VAM, the lawsuit doesn’t changethe fact that EVAAS and VAM are part of the package deal that Houston ISDsigned onto with RTTT.\nCuriously,what went unnoticed at the press event was a comment by one of the plaintiffs,6th grade Jackson Middle school social studies teacher Daniel Santos, who filedthe suit. He said, “My students arebeing tested on material that is not aligned with our curriculum.”\nWhatstudents are learning and what they are being tested on should be cause forconcern.","url":"https://www.breitbart.com/border/2014/05/15/fed-led-ed-s-teacher-grading-system-under-fire-in-texas/"}
