{"authors":[],"date_download":"2018-10-22 21:38:12","date_modify":"2018-10-22 21:38:12","date_publish":"2014-05-07 19:48:06","description":"The Department of Transportation has ordered railroads to give states advance warning about major rail shipments of crude oil.","filename":"data/vaneerConsumption/FedsRailroadsMustWarnStatesBeforeOilTrainShipments.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_feds-railroads-must-warn-states-oil-train-shipments-n99636_1540244292.html","title":"Feds: Railroads Must Warn States Before Oil Train Shipments","title_page":"Feds: Railroads Must Warn States Before Oil Train Shipments","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAfter a series of fiery oil train derailments, the federal government has issued an emergency order requiring railroads to warn state officials before they ship large quantities of crude oil into a state.\nThe Department of Transportation ordered Wednesday that all railroads moving trains carrying more than 1 million gallons of crude, or about 35 tank cars, must give state emergency management officials advance notice of the volume the trains will carry, their frequency and routes, and which counties they will enter.\nThe agency also issued a safety advisory encouraging shippers to phase out older, problematic DOT-111 tanker cars in favor of newer, sturdier models to increase safety.\n“The safety of our nation’s railroad system, and the people who live along rail corridors is of paramount concern,” said Transportation Secretary Anthony Foxx. “All options are on the table when it comes to improving the safe transportation of crude oil, and today’s actions, the latest in a series that make up an expansive strategy, will ensure that communities are more informed and that companies are using the strongest possible tank cars.”\nThe safety measures follow a number of explosive derailments of oil trains in the U.S. and Canada, including one last July in Quebec that killed nearly 50 people.\nA derailment last week in Lynchburg, Va., that sent leaking oil cars into the James River and sparked a fire many stories high renewed calls for greater oversight of crude by rail. Until now, railroads have not been required to disclose when trains carrying crude pass into states or through towns, though local first responders could request lists of the types of hazardous materials that passed through.\nPoliticians in Virginia, Washington, New York and elsewhere have asked the federal government to step up safety measures as the movement of oil by rail has boomed. Less than 10,000 carloads moved by rail in 2008, but the total rose to more than 430,000 in 2013.\nWednesday’s order may give a glimpse of rules to come. About a week ago, DOT sent a comprehensive proposal on the regulation of crude oil and ethanol transport to the White House Office of Management and Budget. That rule included “options” to improve the safety of the older DOT-111 tank cars, according to a blog post by Secretary Foxx. There have been widespread calls for phasing out or retrofitting the older cars, which for 20 years have been known to be vulnerable to rupture in derailments.\nFollow NBC News Investigations on Twitter and Facebook.","url":"https://www.nbcnews.com/news/investigations/feds-railroads-must-warn-states-oil-train-shipments-n99636"}
