{"authors":[],"date_download":"2018-10-30 01:17:43","date_modify":"2018-10-30 01:17:43","date_publish":"2018-09-05 00:05:00","description":"Last week, the horrific facts behind baby Melanie Sanders’ death finally came to light. Just sixteen weeks old, she died after contracting a virus raging through the neonatal intensive care unit at Children’s Hospital of Philadelphia. Medical staff who examined newborns’ eyes failed to put on clean gloves for each baby. Unclean eye-exam devices were reused on one baby after another instead of being disinfected. A staggering 23 newborns, more than half the babies in the unit, got sick with the virus. Melanie struggled to fight it off but died.","filename":"data/vaneerConsumption/FedsStandByAsInfantsDie.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-Advocate_Lutheran_General_Hospital.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862263.html","title":"Feds Stand By As Infants Die","title_page":"Feds Stand By As Infants DieThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Last week, the horrific facts behind baby Melanie Sanders’ death finally came to light. Just sixteen weeks old, she died after contracting a virus raging through the neonatal intensive care unit at Children’s Hospital of Philadelphia. Medical staff who examined newborns’ eyes failed to put on clean gloves for each baby. Unclean eye-exam devices were reused on one baby after another instead of being disinfected. A staggering 23 newborns, more than half the babies in the unit , got sick with the virus. Melanie struggled to fight it off, but died.\nLike Melanie, tens of thousands of patients of all ages die each year because of careless hospital hygiene. Hospitals would like you to think infections are inevitable. They’re not. Unclean hands and contaminated equipment are largely to blame.\nSome hospitals are almost eradicating infection risk. Not in New York. Hospitals here have infection rates worse than the national average .\nMelanie’s death made headlines because her parents are suing the hospital. Most families don’t have that option. They count on the government to make sure hospitals are safe. Don’t bet on it.\nThe federal Centers for Disease Control and Prevention caters to the hospital industry, keeping hygiene standards lax. The CDC also leaves the public in the dark instead of warning them when an infection outbreak occurs at local hospitals. The entity that accredits most hospitals — the nonprofit Joint Commission — refuses to disclose its inspection findings . This conspiracy of silence is literally killing us.\nThe deaths won’t stop until the public demands transparency. Kudos to Senator Chuck Grassley (R-Iowa) who is pressing the Joint Commission to release its inspection reports. That’s essential, because being an accredited hospital means nothing when more than 99% of hospitals pass , no matter how bad their conditions.\nAs for baby Melanie, she died in a prestigious, fully accredited hospital . Yet two senior infection experts there concluded that the viral outbreak was caused by “ lack of standard cleaning practices ” of the eye equipment and “ limited glove use .” It wasn’t an isolated mistake. It happened at least 23 times in one month. Parents entrusted their newborns to the hospital, and that trust was repeatedly broken.\nExpecting parents were clueless about the risk. The same thing happens everywhere. At the University of California, Irvine Medical Center, MRSA (drug-resistant Staph) raced through the NICU two years ago, sickening 10 newborns . The hospital kept the outbreak under wraps.\nThat’s an outrage. A pregnant woman, like anyone choosing a hospital, has a right to know about an outbreak. Failing to disclose it makes a mockery of “informed consent”.\nThe CDC is supposed to work for us — the public — but it goes along with cover-ups. When 38 patients at Advocate Lutheran General Hospital in suburban Chicago contracted a lethal superbug while being treated with a gastrointestinal scope, the CDC issued a report omitting the hospital’s name, calling it “ hospital A .” The CDC didn’t care about alerting the public or doctors who want to protect their patients.\nScopes and eye-exam devices aren’t the only items spreading germs. Thermometers, finger-tip oxygen level meters, stethoscopes, wheel chairs — virtually all the equipment used to treat patients daily — are covered in germs. These items should be disinfected between patients, but they hardly ever are. Watch a nurse wrap a blood pressure cuff around one bare arm after another, never mind that these cuffs frequently carry MRSA.\nDoes the CDC care? Apparently not. The agency doesn’t even know how many patients are dying from hospital infections. The agency’s data on infection deaths are seven years out of date . In contrast, the CDC website links to statistics on Ebola deaths in the Congo that are current this week , even though Ebola has killed only one person in the U.S.\nThe agency’s priorities are a disgrace. The CDC and other government health agencies need to wage an all-out campaign against the infection scourge, because using a hospital is becoming too dangerous. Whether you’re a baby boomer or a tiny baby like Melanie.","url":"https://spectator.org/feds-stand-by-as-infants-die/"}
