{"authors":["Pedro Nicolaci Da Costa"],"date_download":"2018-10-30 23:29:53","date_modify":"2018-10-30 23:29:53","date_publish":"2018-07-19 00:00:00","description":"ANALYSIS: Federal Reserve Chairman Jerome Powell downplayed the threat of a trade war to the US economy. He also dismissed a key recession signal emerging from the bond market yield spreads, despite its historical reliability.","filename":"data/vaneerConsumption/FedsPowelldownplaystradewarsflatteningyieldcurve.json","image_url":"https://amp.businessinsider.com/images/5b508c4d95d4381b008b475a-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_feds-powell-downplays-trade-wars-flattening-yield-curve-2018-7_1540942193.html","title":"Fed's Powell downplays trade wars, flattening yield curve","title_page":"    Fed's Powell downplays trade wars, flattening yield curve - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Federal Reserve Board Chairman Jerome Powell testifies before the House Financial Services Committee. Chip Somodevilla/Getty\nFederal Reserve chairman Jerome Powell is overlooking two central risks facing the US economy: the prospect of a trade-war induced slowdown and a key recession warning sign from financial markets.\nIn Congressional testimony this week, Powell was upbeat on growth, arguing workers who need a job can find one, and downplayed a lack of wage growth despite a historically low 4% jobless rate.\nPowell also refused to state directly whether the world's major economies are currently in a trade war, even though most economists and trade experts believe President Donald Trump's protectionist policies, including tariffs on steel and aluminum imports on US allies, are well on their way to sparking such a conflict.\n\"His remarks suggested that he remained fairly unperturbed about the escalation of trade and tariff rhetoric and policy action, at least as far as it's currently gone, but he notes risks from a further increase in trade tensions remain,\" Rick Rieder, BlackRock's chief investment officer of global fixed income, in a statement.\nThe problem is that there's no end in sight to the trade wars, and everyone thinks things will get worse before they get better.\n\"The fact is that trade tensions hold the potential for second-order impacts on business and consumer confidence that could prove damaging to growth, if things go too far,\" Rieder said.\nOn Tuesday Trump economic adviser Larry Kudlow berated Chinese President Xi Jinping for not coming to some sort of agreement on trade with the United States, even though no formal trade negotiations are actually under way.\nRieder said such ongoing attrition in global trade relations could cause \"higher input costs for companies (particularly if accompanied by sustained tariffs), as well as a pull-forward of capital expenditures by companies — (and) may lead to an economic slowdown from the second quarter's buoyant pace.\n\"We've also been quite vocal regarding our concern over the deceleration in the pace of growth of global liquidity and think that financial markets are already displaying ample 'canaries in the coal mine' that suggest we may be in store for higher volatility, or financial market shocks, which hold the potential to diminish business or consumer confidence,\" he said.\nThe IMF predicts the tariffs, if implemented, could dent global GDP by 0.5 percentage point or around $430 billion below the current projection for 2020.\nInternatinal Monetary Fund\nRecession warning signs\nAnother key conundrum facing top Fed officials including Powell is the ever-looming possibility that long-term interest rates might slip below their shorter-term counterparts, a phenomenon known as an inverted yield curve, which has been a reliable predictor of economic downturns.\nPowell seems to be taking a \"this time it's different\" outlook on the recent flattening trend in yields, which has seen the gap between ten- and two-year notes fall to just above a quarter percentage point.\nAsked whether \"a dramatic change in the shape of the yield curve in any way influences the trajectory you guys are on with respect to normalizing interest rates and the balance sheet,\" Powell stated \"no,\" adding that \"what really matters is what the neutral rate of interest is.\"\nThat's the interest rate level that neither stimulates growth or slows it down — something that changes over time and which Fed officials try hard to gauge.\nStill, a possible yield curve inversion \"might get them to pause a little earlier,\" James Kahn, Yeshiva University economics professor, told Business Insider. \"It would be a sign that maybe the underlying economy is not as strong as it might seem. Labor markets are a lagging indicator. They can look good and there can be some underlying weakness.\"\nJohn Higgins at Capital Economics said the sharp flattening of the curve is too dramatic to ignore.\n\"The spread between the yields of 2-year and 10-year Treasuries has fallen significantly recently, setting a new post-financial crisis low earlier this week,\" he wrote in a research note.\n\"We think that the spread will shrink further. And while we aren't explicitly forecasting a recession, we are projecting a sharp slowdown in 2019 and 2020. The yield of a bond partly reflects expectations for interest rates. This is why the spread has sometimes been a leading indicator of a recession: when it has turned negative, this has reflected an expectation that rates will fall in the future, as growth slows.\"","url":"https://www.businessinsider.com/feds-powell-downplays-trade-wars-flattening-yield-curve-2018-7"}
