{"authors":["Merrit Kennedy"],"date_download":"2018-10-23 05:51:39","date_modify":"2018-10-23 05:51:39","date_publish":"2017-01-24 00:00:00","description":"The box spring full of cash was discovered during an investigation linked to a massive pyramid scheme. U.S. agents arrested a Brazilian man on a charge of conspiring to commit money laundering.","filename":"data/vaneerConsumption/FedsFind20MillionHiddenUnderAMattressInMassachusetts.json","image_url":"https://media.npr.org/assets/img/2017/01/24/doj-money_wide-3a79adb50e09baed6a5ef36a76bcc03d4250b0e3.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_24_511451628_feds-find-20-million-hidden-under-a-mattress-in-massachusetts_1540273899.html","title":"Feds Find $20 Million Hidden Under A Mattress In Massachusetts","title_page":"Feds Find $20 Million Hidden Under A Mattress In Massachusetts  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Feds Find $20 Million Hidden Under A Mattress In Massachusetts\nIt might have been the first place they looked.\nWhen federal authorities raided an apartment in Westborough, Mass., earlier this month, they found money hidden under the mattress — approximately $20 million.\nPhotos show a box spring stuffed with bricks of cash that were seized during a Homeland Security investigation linked to a pyramid scheme involving a company called TelexFree.\nAgents found the money after they arrested a Brazilian national named Cleber Rene Rizerio Rocha, who was charged with one count of conspiring to commit money laundering. The 28-year-old admitted to federal agents that he was in the U.S. to facilitate a money transfer to a founder of the company, court documents state.\nTelexFree, which sold voice-over-Internet phone service, \"was really a massive pyramid scheme,\" according to court documents. \"It make little or no money from selling VOIP, but took in millions of dollars from people signing up to receive financial bonuses from advertising and recruiting.\"\nFederal authorities executed search warrants against the company in 2014 — and court records state that \"about 965,225 people lost money when TelexFree collapsed, their losses totaling about $1,755,927,755.\" One of the founders fled to Brazil; another pleaded guilty and admitted the company was a pyramid scheme.\nIn the aftermath of the Massachusetts company's collapse, TelexFree executives in Brazil allegedly plotted to retrieve money left behind.\nRocha is said to be one of those people, sent from Brazil. He traveled to the U.S. in January and June 2016, but money hand-offs were cancelled both times, according to court records.\nOn New Year's Eve, Rocha arrived in New York, allegedly for another attempt. He was arrested in Massachusetts on Jan. 4 after he met a \"cooperating witness at a restaurant in Hudson, Mass., and allegedly gave him $2.2 million in a suitcase,\" according to the Department of Justice.\nLater that day, agents found the cash in an apartment Rocha had visited.\nHe faces a maximum sentence of 20 years in prison. On Monday, a federal magistrate judge said he posed a flight risk and ordered him detained pending trial. \"There is no incentive for him to remain in the United States, and every incentive for him to flee given the strength of the case against him,\" she wrote.","url":"https://www.npr.org/sections/thetwo-way/2017/01/24/511451628/feds-find-20-million-hidden-under-a-mattress-in-massachusetts"}
