{"authors":[],"date_download":"2018-10-30 14:38:15","date_modify":"2018-10-30 14:38:15","date_publish":"2018-07-24 22:50:00","description":"At least eight members of former Mayor Kasim Reed’s cabinet of advisers received lump-sum payouts totaling more than $259,000 for accrued leave during his last two years in office, according to an Atlanta Journal-Constitution analysis of the city’s payroll data.","filename":"data/vaneerConsumption/FedsseekinfoonexReedaidespayouts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/07/24/Videos/4446588.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_f_87a3334093d8fdb44c860baca4498922__1540910295.html","title":"Feds seek info on ex-Reed aides' payouts","title_page":"Atlanta City Hall: Feds seek info on ex-Reed aides' payouts","title_rss":"NULL","source_domain":"ajc.com","text":"At least eight members of former Mayor Kasim Reed’s cabinet of advisers received lump-sum payouts totaling more than $259,000 for accrued leave during his last two years in office, according to an Atlanta Journal-Constitution analysis of the city’s payroll data.\nThose payouts are among those targeted in a new subpoena delivered to Atlanta City Hall last week by federal agents, whose investigation over the past 18 months has progressed from an examination of outside contractors, to the city’s contracting practices, to Reed’s use of a city-issued credit card, and now payments made to Reed’s inner circle.\n“This is not a fishing expedition,” said Jessica Cino, a law professor at Georgia State University who is a former white collar criminal defense attorney. “They’re not looking at run-of-the-mill corruption. Here, they’re looking (for) a culture of abusive practices and just a flagrant disregard of policy.\n“This is personal, looking in on people’s sick leave and vacation.”\nThe new subpoena, which the AJC and Channel 2 Action News obtained Monday, requests records for payouts for any type of leave to Atlanta mayoral cabinet members from Jan. 1, 2014, through January 15 of this year. It is the ninth subpoena issued to the city in the investigation.\nReed on Tuesday declined to comment on the new subpoena through a spokesman. Bottoms said that her administration continues to cooperate with the investigation.\nCity ordinances allow for vacation and sick leave, but restrict how unused leave can be cashed out.\nRELATED CONTENT: SUBPOENAS\nThe AJC had previously obtained payroll data for all city employees since Jan. 1, 2016. That spreadsheet shows payouts for accrued vacation but have no information about sick leave.\nAccording to the data, City Council member Andrea Boone received a $27,751 payout on Sept. 1, 2017. At the time, Boone’s position as head of constituent services made her a cabinet member.\nBoone said that money was for unused vacation. On March 7, records show, Boone received a lump-sum $25,772 payment described in the payroll records as a “bonus.” Boone told the AJC on Monday that the money was not a bonus, but a payment for unused sick leave.\nBoone said she returned the sick leave money, after learning it was not “standard practice.”\nBoone’s payout was hardly the largest.\nFormer Atlanta police chief George Turner (left) received a $65,000 check in January 2017 when he left city employment, according to payroll records. JOHN SPINK /JSPINK@AJC.COM (The Atlanta Journal-Constitution)\nAccording to the payroll information: Former Police Chief George Turner received a $65,000 check in January 2017; former Fire Chief Joel Baker was paid $42,529 in March; and Human Resources Commissioner Yvonne Yancy got $30,436 in January.\nTurner did not return messages left for him with his current employer, the Atlanta Hawks.\nTurner and several other cabinet members were the subject of a controversial payout four years earlier.\nIn December of 2013, the Reed administration asked City Council to approve accrued vacation for more than 1,400 employees, totaling $1.2 million.\nIncluded in that list were payments to at least seven cabinet members — including $19,556 to former procurement chief Adam Smith, who is now in prison on bribery charges; $14,825 to Boone; $11,968 to former chief financial officer Jim Beard; and $8,277 to former city attorney Cathy Hampton.\nThose payments were approved by council in 2014 — the first year of payout documentation requested by federal prosecutors.\nRELATED CONTENT: BONUSES\nFormer city councilman Alex Wan, who was chairman of the council’s Finance Committee at the time, said he opposed the payouts because he didn’t think the city should incentivize employees hoarding vacation days for pay.\n“We had limits on the amount of vacation employees could carry over for a reason,” Wan said. “The payouts are only as good as the records kept.”\nCino, the law professor, said the subpoena makes clear that prosecutors want to reconcile the city’s record keeping.\n“What they’re looking for is people (who) did not accurately report sick time or vacation time and instead got really large payouts at the end when they were no longer cabinet members,” Cino said.\n>> COMPLETE COVERAGE: Latest Atlanta City Hall investigative content\nThe government’s investigation became public 18 months ago with guilty pleas from two city contractors and expanded to include the city’s former chief procurement officer, all three of who are now serving federal prison sentences on bribery related charges. And a senior political consultant from Reed’s 2009 campaign, who was a department head during his first three years in office, has been indicted on bribery and money laundering charges.\nThe latest round of subpoenas from 2018 have sought records pertaining to several of Reed’s aides, his brother and Reed himself.\nThe government’s subpoena for leave payouts gives the city until Aug. 28 to produce the records for a grand jury meeting in Atlanta.","url":"https://www.ajc.com/news/local-govt--politics/feds-seek-records-payouts-former-reed-aides-latest-subpoena/5YFEO9yxzT6Jrm4445YXqI/"}
