{"authors":["John Binder"],"date_download":"2018-10-30 21:23:27","date_modify":"2018-10-30 21:23:27","date_publish":"2018-07-13 23:13:15","description":"1-in-5 illegal aliens crossing the border with toddlers are either criminals, not the parent, or present some other danger to the child.","filename":"data/vaneerConsumption/Feds1in5IllegalAliensCrossingwithToddlersAreCriminalsaDanger.json","image_url":"https://media.breitbart.com/media/2018/07/Border-Crossers-with-Child-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_13__1540934607.html","title":"Feds: 1-in-5 Illegal Aliens Crossing with Toddlers Are Criminals, a Danger","title_page":"Feds: 1-in-5 Illegal Aliens Crossing with Toddlers Are Criminals, a Danger","title_rss":"NULL","source_domain":"breitbart.com","text":"About 1-in-5 illegal alien adults crossing the United States-Mexico border with toddlers under the age of five are either criminals, not the child’s parent, or present some other danger to the child.\nA new report released by the White House finds that of the 102 border crossing toddlers who were mandated by the courts to be reunited with the illegal alien adults they arrived with, 21 of the adults were found to be unfit to be reunited with the toddlers they crossed with.\nThis means that about 1-in-5 illegal alien adults arriving in the U.S. with toddlers are not eligible to have those children placed back in their care and custody after being separated at the border.\nThe White House outlined the cases of the 21 illegal alien adults who are unfit to be reunited with the toddlers they arrived with. Those cases include:\n11 of the illegal aliens have criminal records: Warrant for murder in Guatemala Child cruelty and narcotics convictions Suspected transnational criminal organization involvement and human trafficking Outstanding criminal warrant in El Salvador 2 DUI convictions Significant criminal history including assault conviction Outstanding warrant in Florida for DUI DUIs, assault, stolen vehicle Robbery conviction Wanted by El Salvador Criminal charges including assault 7 of the illegal aliens not the parents of the toddler: Adult said he is uncle, not father Negative DNA match, adult indicated he is not the child’s father Adult said she is grandmother, not mother During DNA testing, adult disclosed she is not the child’s mother Negative DNA match, still under investigation Adult disclosed that she is grandmother, not the parent Adult presented false birth certificate, still under investigation 2 of the illegal aliens present a danger to the toddler: Before court order, adult was required to submit information and fingerprints of other adults in household where she will live with the child; background check on adult male in household shows an active warrant for aggravated criminal sexual assault of a 10-year-old female. Child made allegations of abuse against adult 1 of the illegal aliens has a communicable disease: 21. Parent is being treated for communicable disease in ICE custody\nThe White House says that if the Department of Health and Human Services (HHS) had not properly vetted each of the illegal alien adults that arrived with toddlers at the border, the cases would have resulted in seven of the 102 children being reunited with adults who are not their parents, four of which would not have even been related to the children.\nAs Breitbart News previously reported, the separation of illegal alien adults from the border crossing children they arrive in the U.S. with has been occurring since before 2001.\nFor months, the establishment media, Democrats, and the GOP establishment have falsely claimed that President Trump’s “zero tolerance” policy at the border — where all border crossers are criminally prosecuted — has spurred, for the first time ever, a result in which border crossing families are separated.\nIn 2014, Breitbart Texas broke the story of how child border crossers were being crammed into detention centers and facilities by the Obama administration, revealing a number of exclusive Breitbart News photos that went unmentioned by the establishment media.\nLikewise, Breitbart News has exposed how child border crossers were detained without their illegal alien guardians under the Obama administration. The total number of border crossing children who were separated from the adults they arrived with at the border by the Obama administration is unknown, as the Department of Homeland Security (DHS) did not track those records at the time.","url":"https://www.breitbart.com/politics/2018/07/13/feds-1-in-5-illegal-aliens-crossing-with-toddlers-are-criminals-a-danger/"}
