{"authors":[],"date_download":"2018-10-30 20:49:53","date_modify":"2018-10-30 20:49:53","date_publish":"2018-09-12 10:00:00","description":"AJC columnist Bill Torpy on why metro Atlanta areas that have long paid for MARTA are bitter about a deal that finally gets Gwinnett County on board.","filename":"data/vaneerConsumption/FeelingshortchangedbymetroAtlantastransitriches.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/07/Videos/4478145.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-dagg_c0fbb832216c95f2932ac469a9cfe848__1540932593.html","title":"Feeling shortchanged by metro Atlanta's transit riches","title_page":"Feeling shortchanged by metro Atlanta's transit riches | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"Gwinnett County just negotiated a great deal from MARTA to come on board. This caused DeKalb County residents, who have paid into the system for decades, to scream bloody murder.\nAtlanta has a new pile of money for transit because of a new sales tax. This, of course, brings its own problems.\nIn May, MARTA announced a plan to fund a bunch of new projects. Beltline supporters were irritated, seeing that the Emory University area, a congested mess, got a billion-dollar light-rail project squeezed onto the to-do list. This would siphon away funds from their pet project.\nPeople from south Atlanta also criticize Emory for line-cutting. But, they add, Beltline advocates are pushing for funding at the expense of poor, longtime Atlanta residents.\nHere we are, at the Transit Sweepstakes, where various constituencies are pitted against each other, grabbing for limited funding in a once-in-a-generation struggle to control how metro Atlanta’s transit will be shaped for decades.\nThe goal is for a regional system. But everyone wants their own chunk first.\nThe ink on Gwinnett’s sweet agreement was barely dry last week when DeKalb residents grumbled about getting shoved aside and taken for granted.\nIf approved by Gwinnett voters next spring, residents there would pay an extra penny sales tax, which would go to MARTA. Sort of. Actually, 29 cents of each dollar raised would go to the agency and the rest would fund Gwinnett-centric projects.\nSweetening the pot was the only way for MARTA to entice the historically recalcitrant county into the fold. And that left ugly duckling DeKalb feeling jealous as it watched the pretty girl, Gwinnett, stroll into the dance and put a lump in the MARTA board’s throat.\nA group of black leaders from south DeKalb complained that their end of the world was, once again, getting passed over. Extension of the MARTA eastern rail line would remain a far-fetched fantasy as DeKalb’s money continued to fund the transit system’s ravenous appetite.\nThere really was no way around it, said Robbie Ashe, a lawyer who chairs MARTA’s board. To get these new counties in, you must increase the reward. A few years back, Clayton County joined the team, but only after the agency agreed to set aside half of the county’s sales tax offerings into an escrow account to pay for a commuter rail to Jonesboro. Clayton residents worried their money would head north if they didn’t cut such a deal.\nSeeing that, Gwinnett demanded a bigger ransom, especially since its voters are more conservative and more resistant to the joys of transit.\nNancy Dyer of Norcross looks at displays during a Gwinnett County public information session on its proposed transit plan. The event took place at the Gwinnett Justice and Administrative Center in Lawrenceville on April 25, 2018. Curtis Compton/ccompton@ajc.com\nThe move caused DeKalb CEO Michael Thurmond to fire off a letter to MARTA saying Gwinnett’s deal was a “significant departure” from the existing agreement signed decades ago by DeKalb and Fulton counties, as well as Atlanta.\nMARTA needed to “renew its commitment to its original members with the same specificity and deference as the proposed contract offers to its newest prospective member,” they wrote.\nTo sum it up, Thurmond told me, “Don’t forget the one that brought you to the dance. I get it, we’re not the bright shiny thing.\n“DeKalb residents are just livid,” Thurmond added. “This has been festering.”\nDeKalb is thinking about adding a new sales tax, like Atlanta did, to build new MARTA projects. But first, Thurmond says, MARTA must show him some love in the form of better services.\nIn 2016, Atlanta voters OK’d another half-penny sales tax that will bring in some $2.5 billion in the next 40 years. In May, MARTA unveiled a list that would build 22 miles of light rail in Atlanta and 18 miles of bus rapid transit. But the plan only called for funding just 7 miles of light rail on the Beltline.\nWhat pumped up the ire of Beltline advocates was MARTA’s plan to dedicate $500 million (and get the same from the feds) to build a light-rail line from the Lindbergh Center station on the north line to the Emory area. Emory was not even part of Atlanta in 2016 when voters approved the money, they argue. It annexed into the city last year.\nCathy Woolard at a press conference in front of Atlanta’s City Hall in November 2017. BOB ANDRES /BANDRES@AJC.COM\n“People were not thinking of it when they went to the polls,” said Cathy Woolard, an unsuccessful mayoral candidate last year and one of the Beltline’s earliest supporters.\nShe said the Beltline was designed for light-rail running alongside the jogging paths. And it is one of the few places, she said, where trains could run unobstructed on land that is already owned by government, so eminent domain is not needed.\nMoreover, Woolard said, the rush to build housing along the Beltline is bringing the population density that makes transit work. It’s a no-brainer, she said.\nThe plan offered by MARTA, she said, seems to be a helter-skelter of projects trying to please everyone.\n“This shouldn’t be a political decision,” Woolard said. “This should be a smart decision.”\nFormer state Sen. Vincent Fort, who also ran for mayor, called Atlanta’s and Gwinnett’s deals “transit racism.”\nThen-senator Vincent Fort uses a bullhorn during MARTA union negotiations in front of the law offices of MARTA Board Chair Robbie Ashe on October 6, 2014, in Atlanta. (JONATHAN PHILLIPS / AJC FILE)\n“Southwest Atlanta and south DeKalb are getting left behind again,” he said. “The people paying (into MARTA) for 40 years should get some respect.”\nFort criticized the Emory line, as well as demands that the full Beltline get built out. That project, he said, has simply accelerated gentrification.\n“The Beltline has been screaming the loudest,” he said. “They want everything. It’s the very definition of entitlement.”\nIt’s an interesting dilemma: Should MARTA build for people living in apartments yet to be built? Or those who already reside here?\nIn the midst of all this is Ashe, the MARTA guy. All decisions here are to be made in a whirlwind of politics, race, class, economics, geography and, it is hoped, best bang for the buck.\n“Don’t spread (the projects) around so thin that there’s no real impact,” Ashe said. “I accept the reality we’re going to disappoint people.”\nThat is a given.","url":"https://www.ajc.com/news/local/torpy-large-daggers-drawn-the-fight-for-slice-marta-pie/jY52MXeOBd2v2ojghk3pPO/"}
