{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 21:47:20","date_modify":"2018-10-22 21:47:20","date_publish":"2016-01-11 01:36:53","description":"She may not have had her husband with her. But at least Felicity Huffman bumped into one of her old 'Wives. The 53-year-old arrived at the Golden Globes on Sunday night looking stunning","filename":"data/vaneerConsumption/FelicityHuffmanandEvaLongoriareuniteattheGoldenGlobes2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001ACAE00000578-0-image-a-14_1452475466977.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393188_Felicity-Huffman-unveils-new-brunette-locks-Golden-Globes-enjoys-Desperate-Housewives-reunion-Eva-Longoria-Golden-Globes-red-carpet_1540244840.html","title":"Felicity Huffman and Eva Longoria reunite at the Golden Globes 2016","title_page":"Felicity Huffman and Eva Longoria reunite at the Golden Globes 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She may not have had her husband with her.\nBut at least Felicity Huffman bumped into one of her old 'Wives.\nThe 53-year-old arrived at the Golden Globes on Sunday night looking stunning beneath her new brunette locks.\nScroll down for video\nBlondes don't have more fun: Felicity Huffman showed off her new brunette locks on the red carpet of the Golden Globes in LA on Sunday night\nThe actress walked the red carpet in a fabulous floor-length shimmering scarlet sequinned gown.\nFelicity is nominated for her sixth Globe; this time for supporting actress in a TV series or movie, for her turn in American Crime.\nNow in its second season, the anthology follows a different case each series, and has seen the actress play two different leading roles so far.\nSee more of the latest Golden Globes 2016 news, red carpet pictures and video updates\nLady in red: The actress walked the red carpet in a fabulous floor-length shimmering scarlet sequinned gown\nShe's up against Lady Gaga for American Horror Story, Sarah Haye for Flesh And Bone, Queen Latifah for Bessie and Kirsten Dunst for Fargo.\nHuffman already has a Globe under her belt, having landed the Best Actress in a Motion Picture gong in 2006 for her role as a transgender woman in the independent film, Transamerica.\nHalf of all Felicity's nominations came for arguably her most famous TV role as Lynette Scavo in Desperate Housewives - and she had a mini reunion with her co-star Eva 'Gaby Solis' Longoria right there on the red carpet.\nReunion: The 53-year-old had a mini Desperate Housewives reunion with her co-star Eva 'Gaby Solis' Longoria right there on the red carpet\nFit: The Telenovela star showed off her ample asset in a gorgeous trailing white gown\nThe two-ladies might have gossiped about one another on-screen but they are clearly best of buds in real life as they shared a laugh together in the Instagram snap posted by Extra.\nThere was no sign of Felicity's husband of almost 20 years William H Macy on the night.\nThe actor is no stranger to the ceremony himself, having been nominated four times throughout his career - most recently last year for his lead role in Shameless - although he has yet to bag one.\nAbsent: There was no sign of Felicity's husband of almost 20 years William H Macy on the night\n2016 GOLDEN GLOBE AWARDS WINNERS - TELEVISION Best Performance by an Actress in a Limited Series or Motion Picture Made for Television Uzo Aduba, Orange is the New Black Joanne Froggatt, Downton Abbey Regina King, American Crime Judith Light, Transparent Maura Tierney, The Affair Best Performance by an Actor in a Limited Series or Motion Picture Made for Television Idris Elba, Luther Oscar Isaac, Show Me a Hero David Oyelowo, Nightingale Mark Rylance, Wolf Hall Patrick Wilson, Fargo Best Performance by an Actress in a Television Series – Drama Caitriona Balfe, Outlander Viola Davis, How to Get Away with Murder Taraji P Henson, Empire Eva Green, Penny Dreadful Robin Wright, House of Cards Best Performance by an Actor in a Television Series – Musical or Comedy Aziz Ansari, Master of None Gael Garcia Bernal, Mozart In The Jungle Rob Lowe, The Grinder Patrick Stewart, Blunt Talk Jeffrey Tambor, Transparent Best Performance by an Actor in a Television Series – Drama Jon Hamm, Mad Men Rami Malek, Mr Robot Wagner Maura, Narcos Bob Odenkirk, Better Call Saul Liev Shreiber, Ray Donovan Best Performance by an Actress in a Television Series – Musical or Comedy Rachel Bloom, Crazy Ex-Girlfriend Jamie Lee Curtis, Scream Queens Julia Louis Dreyfus, Veep Gina Rodriguez, Jane the Virgin Lily Tomlin, Grace and Frankie\nBest Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Lady Gaga, American Horror Story Sarah Haye, Flesh and Bone Felicity Huffman, American Crimes Queen Latifah, Bessie Kirsten Dunst, Fargo Best Television Limited Series or Motion Picture Made for Television American Horror Story Fargo Flesh And Bone Stars Wolf Hall Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Alan Cumming, The Good Wife Damian Lewis, Wolfhall Ben Mendelson, Bloodline Tobias Menzies, Outlander Christian Slater, Mr Robot Best Television Series - Musical or Comedy Orange Is The New Black Silicon Valley Transparent Veep Casual Mozart In The Jungle Best Television Series - Drama Empire Game of Thrones Mr Robot Narcos Outlander","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393188/Felicity-Huffman-unveils-new-brunette-locks-Golden-Globes-enjoys-Desperate-Housewives-reunion-Eva-Longoria-Golden-Globes-red-carpet.html"}
