{"authors":[],"date_download":"2018-10-30 14:34:25","date_modify":"2018-10-30 14:34:25","date_publish":"2015-03-24 00:00:00","description":null,"filename":"data/vaneerConsumption/FEMAtodenyfundstoglobalwarmingskepticgovernors.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_fema_to_deny_funds_to_global_warming_skeptic_governors_comments_1540910065.html","title":"FEMA to deny funds to global warming skeptic governors","title_page":"Blog: FEMA to deny funds to global warming skeptic governors","title_rss":"NULL","source_domain":"americanthinker.com","text":"Warmist efforts to shut down scientific skepticism – the very heart of the scientific method – have escalated from mere rhetoric to mobilizing the financial might of the federal government to punish those who dare doubt the orthodoxy. Even though the computer models that have failed to predict actual outcomes must be continually rejiggered, they are proclaimed to be “settled science,” and doubters are to be punished. Now, the Federal Emergency Management Agency is preparing to financially punish states whose governors are regarded as heretics. Philly.com reports: The Federal Emergency Management Agency is making it tougher for governors to deny man-made climate change. Starting next year, the agency will approve disaster-preparedness funds only for states whose governors approve hazard-mitigation plans that address climate change. This may put several Republican governors who maintain that the Earth isn't warming due to human... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/03/fema_to_deny_funds_to_global_warming_skeptic_governors_comments.html"}
 have so far failed to predict global temperatures. We are getting into Galileo territory, punishing dissent from a flawed orthodoxy. So far, nobody has advocated execution, but that can’t be far off.\n\"If a state has a climate denier governor that doesn't want to accept a plan, that would risk mitigation work not getting done because of politics,\" said Becky Hammer, an attorney with the Natural Resources Defense Council's water program. \"The governor would be increasing the risk to citizens in that state\" because of his climate beliefs.\nThis may put several Republican governors who maintain that the Earth isn't warming due to human activities, or prefer to take no action, in a political bind. Their position may block their states' access to hundreds of millions of dollars in FEMA funds. In the last five years, the agency has awarded an average $1 billion a year in grants to states and territories for taking steps to mitigate the effects of disasters.\nThe Federal Emergency Management Agency is making it tougher for governors to deny man-made climate change. Starting next year, the agency will approve disaster-preparedness funds only for states whose governors approve hazard-mitigation plans that address climate change.\nWarmist efforts to shut down scientific skepticism – the very heart of the scientific method – have escalated from mere rhetoric to mobilizing the financial might of the federal government to punish those who dare doubt the orthodoxy. Even though the computer models that have failed to predict actual outcomes must be continually rejiggered, they are proclaimed to be “settled science,” and doubters are to be punished.\nNow, the Federal Emergency Management Agency is preparing to financially punish states whose governors are regarded as heretics. Philly.com reports:\nThe Federal Emergency Management Agency is making it tougher for governors to deny man-made climate change. Starting next year, the agency will approve disaster-preparedness funds only for states whose governors approve hazard-mitigation plans that address climate change. This may put several Republican governors who maintain that the Earth isn't warming due to human activities, or prefer to take no action, in a political bind. Their position may block their states' access to hundreds of millions of dollars in FEMA funds. In the last five years, the agency has awarded an average $1 billion a year in grants to states and territories for taking steps to mitigate the effects of disasters. \"If a state has a climate denier governor that doesn't want to accept a plan, that would risk mitigation work not getting done because of politics,\" said Becky Hammer, an attorney with the Natural Resources Defense Council's water program. \"The governor would be increasing the risk to citizens in that state\" because of his climate beliefs.\nSenator Ted Cruz was slurred by California governor Jerry Brown on Sunday as “unfit” for office based on his skepticism toward the models that have so far failed to predict global temperatures. We are getting into Galileo territory, punishing dissent from a flawed orthodoxy. So far, nobody has advocated execution, but that can’t be far off.\nUpdate: Silly me. My memory is not as good as that of Rudy de Haas. As Timothy Birdnow wrote on AT in 21012:","url":"https://www.americanthinker.com/blog/2015/03/fema_to_deny_funds_to_global_warming_skeptic_governors.html"}
