{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-31 00:11:35","date_modify":"2018-10-31 00:11:35","date_publish":"2016-02-23 08:00:00","description":"#WinLikeAGirl at the Governor's Mansion Click here to see more photos from the bipartisan networking event for women in California politics. Photos","filename":"data/vaneerConsumption/FemalelobbyingfirmthrivesinmaledominatedCapitol.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/WinLikeAGirl_overview-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944695.html","title":"Female lobbying firm thrives in male-dominated Capitol","title_page":"Female lobbying firm thrives in male-dominated Capitol | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"#WinLikeAGirl at the Governor’s Mansion Click here to see more photos from the bipartisan networking event for women in California politics.\nPhotos decorating the Political Solutions lobbying firm look like those inside many similar businesses in Sacramento. One shows a firm partner on the golf course with a former assembly speaker. In another, three lobbyists smile alongside Gov. Jerry Brown.\nThen there’s a poster-sized picture indicating something here is a little different. Against the backdrop of the Capitol dome, it’s a close-up of a pink high heel.\n“We didn’t purposely set out to have a female-owned firm,” said partner Tami Miller.\nBut over time, added partner Stacy Dwelley – owner of the pink shoe – “it’s become our brand.”\nWomen have become more prominent in Sacramento’s political scene than they were a generation ago. Two of the last three Assembly speakers are women; the Senate minority leader is a woman for the first time in history; and many women are among the lobbyists who crowd Capitol hallways.\nBut women remain in the minority. Just 26 percent of California’s 120 legislators are female, two of the eight state officers elected statewide are women and women are more likely to be employees than partners at Sacramento’s biggest lobbying firms.\nRoughly 300 firms are registered to lobby in California. Among the top 20 that brought in the most money last year, Political Solutions is the only one owned entirely by women. Its rare position shows both how far women have come in being able to succeed in the business of politics, and how much they remain outsiders in an old-school industry.\n“It’s still very much a male-dominated field,” said Rachel Michelin, CEO of California Women Lead, which helps women run for office and apply for political appointments.\n“While you certainly have more women lobbyists… it’s still very much an insider ball game and most of those insiders are men.”\nMiller, Dwelley and their partner Kristin Beard King established Political Solutions in 2004 after peeling away from a high-profile lobbying firm where they didn’t have an ownership stake. In the dozen years since then, their business has reported significant growth – from revenue of $479,000 in its first year to nearly $3 million in 2015.\nThe firm represents a mix of clients, including corporate giants Home Depot, Nike, Starbucks and Honda, as well as nonprofit groups that promote abortion rights, research birth defects, or serve women with breast cancer. Its policy successes include lobbying for online sales tax collection, expanding newborn health screenings, funding breast and cervical cancer screenings for low-income women and approval of a bill aimed at helping police trace guns used in crimes.\n“It was hard when we had small children and rent, to be selective about the interests that we represented, and we made some mistakes along the way,” Beard King said.\n“But I think that really bode well later in the firm because we do really represent interests that society wants to exist, and that’s one of our philosophies.”\nThe firm is bipartisan: Dwelley and Beard King got their start working for Democratic legislators, while Miller learned to lobby at the side of a Republican.\n“In the beginning we were known as ‘the girls.’ Then as we matured we were known as ‘the ladies.’ Governor Schwarzenegger called us ‘Charlie’s Angels,’” Miller said.\n“Speaker Pérez called us ‘Designing Women,’” Beard King and Dwelley added simultaneously.\n“We don’t take that negatively,” Miller said. “I just think that as we were growing… our success started to catch people by surprise.”\nFormer speaker John A. Pérez, who left office in 2014, said he considers Political Solutions “one of the better, more effective firms in Sacramento,” and enjoyed working with its lobbyists on legislation to promote California tourism and expand organ donation programs.\n“Some lobbying firms really spend most of their time on a couple of clients who are big political donors. That tends not to be the profile of their client base,” Pérez said.\n“They’ve been able to create a level of advocacy that focuses on the substance of the issues, not ever on any external sets of resources.”\nThe firm is active in various efforts to support women in politics — and there are many in Sacramento. At a recent reception inside the historic Governor’s Mansion, 200 women who work in politics fostered a bipartisan network known as #WinLikeAGirl.\nAfter everyone had mingled over wine and cheese, organizer Shawnda Westly asked the group to jump on social media and “say something about how at least one woman in this room has improved our business of politics.”\n“Whether it’s her savvy, her strategy, her work ethic, all of these things,” said Westly, the California Democratic Party’s senior strategist. “We don’t promote ourselves as much as the dudes.”\nAmong the crowd was lobbyist Jennifer Fearing, who said the Political Solutions partners made an early impression on her in launching their firm a dozen years ago. When Fearing wanted to open her own lobbying business, she turned to Dwelley, Miller and Beard King for advice.\n“They were pretty influential in encouraging me,” Fearing said. “Their validation gave me confidence to roll out the way I was hoping to.”\nBev Hansen, a former legislator and veteran lobbyist, described the Political Solutions founders as “pioneers.” When she was a lawmaker in the late 1980s, Hansen said, “there were very few women (lobbyists) in general, but even fewer women who had their names on the door.”\n“It’s still not as prevalent as it should be but it’s so much better than it was,” she said.\nMiller said she was encouraged early on by Craig Biddle, a former lawmaker who became a lobbyist and her mentor.\n“He was very protective to make sure people knew I was in the room, not because I was his secretary, (but) because I was smart and I knew what I was talking about,” Miller said. “He was always the first person to turn and say, ‘Tami knows more about this issue than I do so I’m going to go ahead and let her explain it to you.’”\nMeetings like that offer opportunities to increase gender equity in the political professions for Assemblywoman Cristina Garcia (D-Bell Gardens). She said she uses her position in elective office to help women advance.\n“If I notice it’s a group of men and not a single woman in the room lobbying me, I bring it to their attention,” Garcia said. “And I’ve noticed when that happens, in the future they make sure they include some women in the discussion.”","url":"https://calmatters.org/articles/female-lobbying-firm-thrives-in-male-dominated-capitol/"}
