{"authors":[],"date_download":"2018-10-22 22:19:58","date_modify":"2018-10-22 22:19:58","date_publish":"2014-05-09 19:36:49","description":"British authorities are being more vigilant at airports in an effort to crack down on the practice of \"vacation cutting.\"","filename":"data/vaneerConsumption/FemaleGenitalMutilationArrestMadeatHeathrow.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_female-genital-mutilation-arrest-made-heathrow-n101731_1540246798.html","title":"Female Genital Mutilation Arrest Made at Heathrow","title_page":"Female Genital Mutilation Arrest Made at Heathrow","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLONDON -- A woman has been arrested at London's Heathrow airport on suspicion of conspiracy to commit female genital mutilation (FGM) after arriving on a flight from Sierra Leone, according to a statement from the Metropolitan Police.\nA 13-year old girl traveling with her was taken into the care of social services.\nThe practice of FGM is common across much of Africa, where it is believed to ensure sexual purity before marriage\nAgencies in Britain have run a week-long initiative at several airports aimed at detecting and preventing FGM. Perpetrators of so-called “vacation cutting” – when girls are taken abroad to be cut – are being targeted.\nThe 38-year-old woman taken into custody is a British national born in Sierra Leone. The girl traveling with her is a Sierra Leonean national.\nIt's estimated there are more than 60,000 victims of FGM in the U.K. and there is growing pressure on police and prosecutors to bring perpetrators of FGM to justice.\nThe first prosecution is underway and a dozen other cases are under investigation, according to the Crown Prosecution Service.\n-- Annabel Roberts\nRelated link: Horrific Taboo: Female Circumcision On the Rise in U.S.","url":"https://www.nbcnews.com/news/world/female-genital-mutilation-arrest-made-heathrow-n101731"}
