{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:38:51","date_modify":"2018-10-30 19:38:51","date_publish":"2016-09-30 07:07:06","description":"The world's top female chess players are being forced to wear a hijab at next year's world championship because Iran is the host.","filename":"data/vaneerConsumption/FemaleChessPlayersToldToWearHijabatChampionshipInIran.json","image_url":"https://media.breitbart.com/media/2016/09/female-chess.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_30__1540928331.html","title":"Female Chess Players Told To Wear Hijab at Championship In Iran","title_page":"Female Chess Players Told To Wear Hijab at Championship In Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"The world’s top female chess players are being forced to wear a hijab at next year’s world championship because state sponsor of terrorism Iran has been selected to host the event.\nSome of the players have reacted with dismay. Women in the Islamic Republic are required by law to wear a hijab in public. Failure to do so results in arrest, a fine or public admonishment.\nPlayers have accused the World Chess Federation, known by its French acronym FIDE, of “turning a blind eye to sexual discrimination” by awarding the women’s championship to Iran.\n@nigelshortchess It’s very upsetting that I have to miss my first Women’s World Championship. For many reasons. pic.twitter.com/eGS64dK1Y5 — Nazi Paikidze-Barnes (@NaziPaiki) September 27, 2016\nNazi Paikidze, the U.S. women’s chess champion, declared:\nIt is absolutely unacceptable to host one of the most important women’s tournaments in a venue where, to this day, women are forced to cover up with a hijab. I understand and respect cultural differences. But, failing to comply can lead to imprisonment and women’s rights are being severely restricted in general. It does not feel safe for women from around the world to play here…If the situation remains unchanged, I will most certainly not participate in this event.\nFIDE has defended its selection of Iran to host the women’s championship, urging participants to respect “cultural differences” and accept Iran’s hijab law.\nThe Telegraph reports:\nWithin hours of Iran being revealed as its host country, the prestigious event was plunged into crisis as it emerged players taking part face arrest if they don’t cover up. In response, Grandmasters lined up to say they would boycott the 64-player knock-out and accused the game’s scandal-hit governing body [FIDE] of failing to stand up for women’s rights.\nDaily Mail adds:\nTop women chess players are threatening to boycott the world championship in Iran because they will be forced to wear hijabs. Female Grandmasters will risk arrest if they do not cover up to compete in the strict Middle Eastern country due to host the knock-out tournament next year.\nIn defending the World Chess Federation’s choice of venue, Susan Polgar, the American Grandmaster who chairs FIDE’s Commission for Women’s Chess said:\nI have traveled to nearly 60 countries. When I visited different places with different cultures, I like to show my respect by dressing up in their traditional style of clothing. No one asked me to do it. I just do it out of respect. I personally would have no issues with wearing a headscarf [hijab] as long as it is the same to all players.\nIran, where hijabs for women have been mandated by law since the Islamic Revolution of 1979, is unfriendly to women’s issues. The country has a “morality police” that is charged with enforcing the hijab.\n“Women in Iran are subject to pervasive discrimination both in law and practice, including in areas concerning marriage, divorce, child custody, freedom of movement, employment, and access to political office,” reported human rights watchdog Amnesty International in March.\nThe U.S. Department of State has warned against traveling to the Islamic Republic, noting that American citizens risk being unjustly imprisoned or taken captive because of their nationality.\n“[FIDE] held a smaller Grand Prix event in Iran earlier this year where female players were required to wear the hijab,” reports The Telegraph, adding that “several players were left angry about having to use the scarf.”\nNevertheless, FIDE’s Polgar said:","url":"https://www.breitbart.com/middle-east/2016/09/30/female-chess-players-wear-hijab-upcoming-championship-iran/"}
