{"authors":["Simon Kent"],"date_download":"2018-10-30 18:56:30","date_modify":"2018-10-30 18:56:30","date_publish":"2018-06-28 09:03:34","description":"A Saudi Arabian TV presenter has been forced to flee after claims she had violated the kingdom's strict Islamic dress code for women.","filename":"data/vaneerConsumption/FemaleTVReporterFleesSaudiAfterIndecentExposureAccusations.json","image_url":"https://media.breitbart.com/media/2018/06/reporter.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_06_28__1540925790.html","title":"Female TV Reporter Flees Saudi After 'Indecent' Exposure Accusations","title_page":"WATCH: Female TV Reporter Flees Saudi After 'Indecent' Exposure Accusations","title_rss":"NULL","source_domain":"breitbart.com","text":"A Saudi Arabian TV presenter has been forced to flee the country after claims she had violated the kingdom’s strict Islamic dress code for women.\nShereen Al-Rifaie had finished recording a segment on women finally being allowed to drive in Saudi Arabia when the outfit she was wearing was deemed ‘indecent’ by the Saudi General Commission for Audiovisual Media.\nThe presenter wore a white abaya – a traditional Muslim robe-like dress – which was sufficiently open to reveal a glimpse of white trousers and a top underneath. Her hairline could also be seen even though a loose white scarf for the most part covered her head.\nSaudi Arabia’s royal family and its religious establishment adhere to an austere form of Sunni Islam known as Wahhabism.\nThe authorities for decades enforced a strict dress code on women that required them to wear abayas in public, as well as a headscarf if they were Muslim.\n#Saudi General Authority for Audiovisual Media investigates anchor Shereen Rifai “for violating regulations and instructions” by “wearing indecent clothing” during a report she present on ending the ban on women driving in #SaudiArabia according to Okaz newspaper pic.twitter.com/3PDvRwVe2q — Zaid Benjamin (@zaidbenjamin) June 26, 2018\nThe video caused a social media uproar as users launched the hashtag “a naked woman driving in Riyadh” in Arabic.\nMs al-Rifaie rejected the allegation.\n“I was wearing decent clothes, and God will reveal the truth of what has been said to me,” she was quoted by the Saudi news site Ajel as saying.\nAjel also reported that Ms Rifaie had returned to her current home in the United Arab Emirates.","url":"https://www.breitbart.com/middle-east/2018/06/28/female-tv-reporter-flees-saudi-after-indecent-exposure-accusations/"}
