{"authors":["Ali Waked"],"date_download":"2018-10-30 18:39:34","date_modify":"2018-10-30 18:39:34","date_publish":"2017-04-28 22:26:34","description":"A female passenger on Cairo’s metro reportedly tried to cut off a local young woman’s hair off, because her head was uncovered.","filename":"data/vaneerConsumption/FemaleWearingHijabtriestoCutOffHairofUncoveredWomanonCairosMetro.json","image_url":"https://media.breitbart.com/media/2017/04/cairo-metro.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_28__1540924774.html","title":"Female Wearing Hijab tries to Cut Off Hair of Uncovered Woman on Cairo’s Metro","title_page":"Report: Female Wearing Hijab tries to Cut Off Hair of Uncovered Woman on Cairo’s Metro","title_rss":"NULL","source_domain":"breitbart.com","text":"A female passenger on Cairo’s metro reportedly tried to cut off a local young woman’s hair off, saying this was because she was not wearing any head covering.\nEgyptian journalist Rahma Sami was very surprised when the female passenger with her head covered approached her, pulled out a sharp object and began trying to cut Sami’s hair, claiming that she was making no effort to cover her head.\nThe journalist, Sami, told the Al Arabiya website that she was caught by surprise at the Zahraa metro station south of Cairo when, as she sat in the women’s car, “a female passenger with her head covered … pulled a sharp object out of her bag and tried to cut my hair. The woman told me I’d be happier with my hair and wouldn’t have to cover it.”\nThe shocked Sami added that she miraculously managed to avoid the angry passenger and that a number of other female passengers intervened in order to separate the two.\nAccording to Sami, she tried herself to hold on to the woman’s hand that was trying to cut her hair until the police could arrive but other passengers came to the woman’s rescue and got her away so she wouldn’t be arrested.\nRami noted that the woman was not mentally unstable but that, “She was very aware, held me by brute force and tried to cut my hair by force.”\nThe journalist filed a complaint with the police. Sami questioned how her attacker managed to enter the station with the sharp object despite strict security and thorough searches at metro stations. She demanded that police act quickly to arrest the woman so that she would not try to harm other women who don’t cover their heads.","url":"https://www.breitbart.com/middle-east/2017/04/28/report-female-wearing-hijab-tries-cut-off-hair-uncovered-woman-cairos-metro/"}
