{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:23","date_modify":"2018-10-30 18:48:23","date_publish":"2015-06-04 15:21:03","description":"In the wake of the Bruce Jenner story, a some female Anglican clergy have begun campaigning for a similar sex change of the divinity.","filename":"data/vaneerConsumption/FemaleAnglicansAttempttoTransitionGodtoFemale.json","image_url":"https://media.breitbart.com/media/2015/06/Hilary-Cotton-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_04__1540925303.html","title":"Female Anglicans Attempt to 'Transition' God to Female","title_page":"Female Anglicans Attempt to 'Transition' God to Female | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the wake of the Bruce Jenner story—the most celebrated gender reassignment in the short history of the procedure—female Anglican clergy members have begun quietly campaigning for a similar sex change of the divinity into a female.\nIt was only in January of this year that the Church of England ordained its first female bishop, the Right Rev. Libby Lane, following last November’s change in legislation that allowed the practice. Since then, the church has selected two other women for episcopal consecration.\nWomen and the Church (WATCH), the activist group that successfully crusaded for the ordination of female bishops, have now set their sights on a new goal: identifying God as a woman. Referring to God as a “He” results in “a deficient understanding of who God is,” according to Rev. Jody Stowell, a member of the group.\nWATCH has called for a full overhaul of the church’s official liturgy to better highlight the equal status of women, since the current references to God consist almost exclusively of male language and imagery.\nThe Rev. Emma Percy, chaplain of Trinity College Oxford and a member of WATCH, said that pronoun gender reassignment in reference to the divinity would help get rid of “the notion that God is some kind of old man in the sky.”\nPercy said she has observed that “younger people are much more interested in how gender categories shouldn’t be about stereotypes” and added that the church needs “to have a language about God that shows God can be expressed in lots of diverse terms.”\nNow that the church has women bishops, Percy said, “the church has accepted that women are equally valued in God’s sight and can represent God at all levels.” She said that her group wants to encourage people to be freer. “We want to get the Liturgical Commission to understand that people are actually quite open to this and there is room for richer language to be used,” she added.\nHilary Cotton, the chairwoman of WATCH, has said that the shift away from the traditional patriarchal language of the Book of Common Prayer is already at an “advanced” stage in some quarters.\n“The reality is that in many churches up and down the country something more than the almost default male language about God is already being used,” she said.\n“Quietly clergy are just talking about God as ‘she’ every now and then,” she said.\nWho knows? If their campaign is successful, maybe even God will make the cover of Vanity Fair.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/politics/2015/06/04/female-anglicans-attempt-to-transition-god-to-female/"}
