{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 02:29:07","date_modify":"2018-10-23 02:29:07","date_publish":"2017-03-16 13:04:30","description":"The University of Michigan study involving more than four million veterans showed that female veterans with substance-abuse issues have a higher rate of suicide than their male counterparts.","filename":"data/vaneerConsumption/Femalevetswithsubstanceissueshavehighersuiciderisk.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E542ED800000578-0-image-a-31_1489668749747.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320062_Female-vets-substance-issues-higher-suicide-risk_1540261747.html","title":"Female vets with substance issues have higher suicide risk","title_page":"Female vets with substance issues have higher suicide risk | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Female war veterans who turn to drink and drugs are up to five times more likely to commit suicide than their colleagues, new research claims.\nThe study involving more than four million veterans showed that among both genders, those who develop drug or alcohol problems are more than twice as likely to die by suicide as their comrades.\nBut female veterans with substance-abuse issues have an even higher rate of suicide - more than five times that of their peers, according to the research.\nThe study suggests the risk of suicide differs depending on the type of substance the veteran has problems with.\nThe study involving more than four million veterans showed that female veterans with substance-abuse issues have a higher rate of suicide than their male counterparts (file photo)\nThe highest suicide risks are among those who misuse prescription sedatives, such as tranquilizers.\nFemale veterans who misuse opioid drugs, such as painkillers, also have an 'especially high' risk of suicide, according to the study.\nThe research, published in the journal Addiction, found that much of the difference in suicide risks might be explained by veterans who have both mental health conditions and substance abuse issues.\nThe findings come from one of the largest-ever examinations of substance use disorders and suicide, involving more than 4.4million US military veterans.\nStudy lead author Doctor Kipling Bohnert, of the University of Michigan School of Medicine, said: 'We hope these findings will help clinicians and health systems care for people with substance use disorders, with mental health conditions, and with both - and focus suicide prevention efforts accordingly.\n'Substance use disorders may be important markers for suicide risk.'\nHe said 20 US veterans die by suicide each day - a much higher rate than in the general population.\nBecause two-thirds of the suicides in the study involved firearms, the researchers also note that firearm safety is important in efforts to reduce the toll of suicide on those who have served.\nFemale veterans who misuse opioid drugs, such as painkillers, also have an 'especially high' risk of suicide, according to the study (file photo)\nDr Bohnert and his colleagues looked at records from a large group of veterans from 2004 and 2005. They then tracked suicides among the group over the next six years.\nIn all, 8.3 per cent of men and 3.4 per cent of women in the group had a substance use disorder recorded in their list of diagnoses in 2004-2005.\nAnd 9,087 of the veterans in the study group died by suicide during the following six years.\nUsing statistical techniques, the team calculated suicide rates per 100,000 veterans, and then calculated those rates for veterans with substance use issues overall, and for specific substance use disorders.\nIn all, the suicide rate was 75.6 per 100,000 for veterans with any substance use disorder, compared with 34.7 for veterans overall.\nPrevious research led by Doctor Mark Ilgen who was co-author of the new study, found similarly higher rates in veterans who were tracked from 1999 to 2006.\nBut the new study lets the researchers drill down to the specific substance that veterans had problems with, including alcohol, cocaine and cannabis.\nThe study found the suicide risk was highest for veterans of both genders who misused sedatives - 171.4 per 100,000 - and markedly higher for women who misused opioids, at 98.6 per 100,000.\nThe study involving more than four million veterans showed that among both genders, those who develop drug or alcohol problems are more than twice as likely to die by suicide as their comrades (file photo)\nThe researchers couldn't distinguish between misuse of prescription opioids and problems with other non-prescription opioids, such as heroin.\nMen who misused amphetamines also had a suicide rate of 95 per 100,000.\nThe study couldn't tell whether they were misusing prescription amphetamines, such as those used for attention deficit disorder, or using illegal drugs such as methamphetamine.\nThe researchers then took into account the veterans' age and the overall severity of their medical conditions, and calculated the risk of suicide by type of substance use disorder.\nThey said this somewhat reduced the size of the difference in suicide risks, but most of the original relationships remained.\nBut when the researchers factored in mental health diagnoses, the picture changed.\nAmong women, only alcohol and opioid disorders remained associated with higher suicide risk, independent of mental and physical health. Differences between men and women diminished as well.\nBut both genders with substance use disorders had a higher rate of suicide - even after differences in physical and mental health were factored in.\nDr Bohnert added: 'Assessment and treatment of co-existing psychiatric conditions, in addition to substance use, may be important in lowering the risk of suicide among individuals who have substance use disorders.'","url":"https://www.dailymail.co.uk/news/article-4320062/Female-vets-substance-issues-higher-suicide-risk.html"}
