{"authors":["Richard Spillett","Crime Correspondent For Mailonline"],"date_download":"2018-10-23 00:04:34","date_modify":"2018-10-23 00:04:34","date_publish":"2017-03-16 08:54:40","description":"Children as young as nine are believed to have been led by the women during the thefts from a shop in Leigh-on-Sea, Essex last month.","filename":"data/vaneerConsumption/FemaleFaginsuseagangofCHILDRENtoraidshop.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E52E86900000578-0-image-a-22_1489655829121.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319296_Female-Fagins-use-gang-CHILDREN-raid-shop_1540253074.html","title":"'Female Fagins' use a gang of CHILDREN to raid shop","title_page":"'Female Fagins' use a gang of CHILDREN to raid shop | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CCTV has emerged of a pair of so-called 'female Fagins' using a gang of children to steal from a boutique clothing store.\nChildren as young as nine are believed to have been led by the women during the thefts from a shop in Leigh-on-Sea, Essex last month.\nFootage released by the shopkeeper shows two women stroll into the store with four young children, who are then used to distract the owner of men's clothing store Uptomen.\nBusinessman Mike Wells watched a boy move around the store touching clothes to distract him as a blonde woman swiped items with the help of two other juvenile accomplices.\nThis is the moment a 'female Fagin' shoplifter steals clothes with the help of a gang of children\nThe woman then hands a youth two hoodies - worth £49.99 each - as a slightly older teenager shields them from view.\nAfter the quickly-executed theft, the group walk out of the boutique store.\nMr Wells, 46, slammed the crooks and said: 'It's just not nice and quite shocking,\n'It's horrible to think these kids are not being brought up properly. They have nothing to aspire to and are being lead in the wrong direction.\n'It's a sad reflection of this country. This kid was less than 10 years old and he was given something to walk out of the shop with.\n'I'm horrified by the fact and adult would set this sort of example for a child.'\nCCTV released by the stores owner shows the two women enter the shop with the children\nHe added: 'It is quite clear on the CCTV but I didn't notice it at the time. There were already four people in the shop who were genuine.\n'Then all of a sudden two adult women, a teenager and four little kids came in.\n'One of the children was going around touching everything and he was the one I had my eye on. I don't know if he was supposed to be a distraction.\n'While I was watching the CCTV one of the adults took a couple of hoodies off the rail, the teenager then shielded one of the small children who took them and went straight out the door.'\nOther shops in the seaside town have also been targeted and police are investigating.\nA spokesman said: 'Police are investigating the theft of two hooded tops from Uptomen in Broadway, Leigh-on-Sea, at about 2.15pm on Saturday, February 25.'","url":"https://www.dailymail.co.uk/news/article-4319296/Female-Fagins-use-gang-CHILDREN-raid-shop.html"}
