{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 00:30:16","date_modify":"2018-10-23 00:30:16","date_publish":"2016-01-11 09:56:05","description":"Graffiti artist Vaj Graff, from Bristol, has claimed responsibility for the act - which took place in in Bristol's College Green - insisting 'It ain't vandalism it's a statement.'","filename":"data/vaneerConsumption/FeministgraffitiartistVajGraffdefacesastatueofQueenVictoriainBristol.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/13/2FFB75B100000578-0-image-a-104_1452432064836.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3392506_Feminist-graffiti-artist-sparks-fury-defacing-statue-Queen-Victoria-adding-vulgar-female-genitalia-pubic-hair_1540254616.html","title":"Feminist graffiti artist Vaj Graff defaces a statue of Queen Victoria in Bristol","title_page":"Feminist graffiti artist Vaj Graff defaces a statue of Queen Victoria in Bristol | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A feminist street artist - who is known for drawing female genitalia on buildings and monuments - has provoked a backlash after a 19th-century statue of Queen Victoria was defaced.\nVaj Graff, from Bristol, has claimed responsibility for the act - which took place in Bristol's College Green - claiming she was making statement on the 'male-dominated' art world.\nThe artist, whose real name is unknown, has added a pair of naked legs, private parts and pubic hair to the otherwise fully-dressed figure of Britain's second longest-reigning monarch.\nScroll down for video\n@BertramFiddle tweeted the first picture of the defaced nineteenth-century statue in Bristol's College Green, saying: 'Some idiot has drawn ladybits on the Queen Victoria statue on College Green @BristolPost Done in broad daylight!'\nThe photograph was retweeted more than 300 times, with Twitter divided over whether it was offensive or just funny. Graffiti artist and feminist Vaj Graff has claimed responsiblity for the act\nIt was noticed by a local resident that day and, after their photograph was shared on Twitter, hundreds professed to be disgusted by the act of vandalism - while a large proportion praised it as 'funny' and 'oddly beautiful'.\nThe marble statue is listed and was commissioned in 1887 to mark the monarch's Golden Jubilee.\nThe first person to spot the alteration, which appears to have taken place on the afternoon of 7 January, tweeted on behalf of Bristol-based animation company Bertram Fiddle.\nThey shared a photo of the statue along with the caption: 'Some idiot has drawn ladybits on the Queen Victoria statue on College Green @BristolPost Done in broad daylight!'\nWhile some followers seemed to find it amusing, Bertram Fiddle replied: 'Its NOT funny. It is rude and VULGAR and VANDALISM. There is a school nearby and in a tourist spot.\n'Is this how we want Bristol to be seen? I think it's disgusting and whoever did it needs to be punished.'\nEmma Reynolds agreed, adding: 'I think it's a cheap shot, & have to agree with a comments on the article asking 'What's point is she making?'\nMonsterAndMonster said: 'Shocking!?' Pretty sure you could get hung for this kinda thing 100 years ago...'\nMeanwhile the artist behind the the act, Vaj Graff, remained undeterred, insisting: 'It aint vandalism it's a statement.'\n'Feminist street artist' Vaj Graff has come under fire, but she insisted it was a statement, not vandalism. She said: 'Queen Vic was a power woman. She was the original feminist and she was proud'\nVaj Graff remained defiant, tweeting that she was making a statement about the 'male-dominated' art world\nThe statue was to commemorate Queen Victoria's, pictured, golden jubilee. Vaj Graff, the artist behind it, reasoned: 'All I did was show her how she wanted to be seen. What's so offensive about that?'\nShe told the Bristol Post: 'The art world is male dominated. Fact. Street art is male dominated. Fact. So I've got to represent. I've got to redress the balance.\n'Queen Vic was a power woman. She was the original feminist and she was proud. All I did was show her how she wanted to be seen. What's so offensive about that?\nShe compared herself to London street artist Banksy, adding: 'If Banksy's allowed to paint a naked man hanging out a window of a sex clinic, then why can't Queen Vic be seen in all her glory?\n'Bristol loves shouting about street art but when it comes to something with a real message it can't handle it.'\nShe was referring to Banksy's 'Naked man' mural in nearby Park Street, which features a nude man hanging out of a window.\nAnd it seems there were many who agreed with her. Barry Monkey tweeted: 'That's pretty funny. But why didn't anyone stop them? #onlyinbristol.'\nLouie Stowell said: 'I love it :D' later adding: 'I don't know if art has to make a point. I just find it oddly beautiful.'\nDani Abram waded into the sexism debate, pondering: 'There is a NAKED MAN opposite and that is art but if it's a woman!? Get out.'\nCharlieDickDastardly apparently couldn't see what all the fuss was about, saying: 'I thought it was funny, will cost to wash off sadly but pubic hair isn't the worst thing,' while Hazel Phillips agreed, adding: Exactly, It's only a bush.'\nKika agreed, saying: 'I rather love this,' while Some Bloke In a Hat said: 'It's brilliant :)'.\nVaj Graff, who is 26 and lives in Fishponds, Bristol, told FEMAIL: 'Bristol's gotta whole lot of street art history... MALE street art history. There hasnt been ONE SINGLE woman who represents.\n'You walk down the streets and you see c**ks tagged everywhere... But if you have one single vaj then that's vandalism and I'm a vandal.\n'Other side of the street from Queen Vic is a Banksy cock, a naked man with his c**k out and cos it's a Banksy the council are lovin it.","url":"https://www.dailymail.co.uk/femail/article-3392506/Feminist-graffiti-artist-sparks-fury-defacing-statue-Queen-Victoria-adding-vulgar-female-genitalia-pubic-hair.html"}
