{"authors":[],"date_download":"2018-10-30 17:53:21","date_modify":"2018-10-30 17:53:21","date_publish":"2018-07-10 21:13:00","description":"Two men have jumped the fence at Hartsfield-Jackson International Airport in the last two weeks, and airport officials say they are reviewing potential security improvements.","filename":"data/vaneerConsumption/FencejumpersraisesecurityconcernsatAtlantaairport.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Atlanta_Wsbtv/2018/06/29/Images/779655867_Video%2520shows%2520man%2520jumping%2520fence%2520at%2520Atlanta%2520airport_1530285531299.JPG_12143286_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_fence-jumpers-rais_5e66de6f466d8409646b0453ca5c7232__1540922001.html","title":"Fence jumpers raise security concerns at Atlanta airport","title_page":"Fence jumpers raise security concerns at Atlanta airport","title_rss":"NULL","source_domain":"ajc.com","text":"Two times in two weeks, trespassers have scaled fences to enter off-limits areas at Hartsfield-Jackson International, increasing the sense of urgency for tighter security at the world’s busiest airport.\nThe latest incident occurred at around 2 a.m. Tuesday morning, when an airport maintenance worker spotted someone in a secure area of the Atlanta airport.\nAtlanta police responded to the call about “a suspicious person walking along an access road” around the airfield. The man, later identified by police as E’Donis T. Andrews, 22, was taken into custody and charged with criminal trespass. He had minor cuts and “appeared to be under the influence of alcohol,” according the police.\nTwo weeks ago, a different man scaled a razor-wire fence, ran onto an active taxiway at Hartsfield-Jackson and toward a plane, according to police. The incident, which temporarily halted some flights, was documented by the plane’s passengers, who posted photos and video of the man wearing only underwear outside the aircraft.\nThe airport is surrounded by 29 miles of security fencing, and Hartsfield-Jackson security director Jan Lennon said the airport’s layered security “worked effectively,” resulting in both men being apprehended.\nPolice and airport security officials are “working to determine how the breach occurred,” according to a statement.\nLennon said the airport is looking at structural improvements to the fencing, like putting cement under more fencing to prevent people from crawling underneath and a mesh overlay to prevent people from climbing up.\nThe airport is also considering technology to detect intruders. Technology like infrared motion detection or radar sensors can trigger an alarm if someone climbs a fence.\nLennon said the airport reviewed the possibilities two years ago and made a decision to enhance security, but is not yet ready to disclose what improvements are planned.\n“The administration is serious about security,” Lennon said. But, she added, “it’s a process.”\nOther airports have had fence jumpers too, Lennon said.\n“We have to deal with that,” she said. “That’s why we have to ensure we have a good security program.”\nAirport workers in secure areas are trained to challenge those they see without badges displayed and report incidents.\nWith the airport operating 24 hours a day and workers around the airfield, “it’s very hard not to see something, because you have employees everywhere,” Lennon said.\n“What we do is when we have an incident, we are very good at response. We are very good at recovering,” Lennon said.","url":"https://www.ajc.com/business/fence-jumpers-raise-security-concerns-hartsfield-jackson/6JO3R4lbYJUAjfBqMrYO4J/"}
