{"authors":["Associated Press"],"date_download":"2018-10-22 20:42:29","date_modify":"2018-10-22 20:42:29","date_publish":"2016-01-28 03:00:58","description":"ST. LOUIS (AP) — The Ferguson Police Department has agreed to overhaul its policies, training and practices as part of a sweeping deal with the Justice Depar...","filename":"data/vaneerConsumption/FergusonUSreachtentativedealonpoliceoverhaul.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:2ebdf3829d5949819d13ea29802282a6-2vdWmEltwXfba0ce28e63230fc9e-604_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420005_Ferguson-feds-reaches-tentative-police-reform-deal_1540240949.html","title":"Ferguson, US reach tentative deal on police overhaul","title_page":"Ferguson, US reach tentative deal on police overhaul | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ferguson, US reach tentative deal on police overhaul\nST. LOUIS (AP) — The Ferguson Police Department has agreed to overhaul its policies, training and practices as part of a sweeping deal with the Justice Department following the 2014 fatal police shooting of 18-year-old Michael Brown, city and federal officials announced Wednesday.\nThe recommendations, detailed in a 131-page proposed consent decree, are meant to correct problems identified in a scathing Justice Department report last year that identified unconstitutional and discriminatory practices across the city police force and municipal court system.\nThe city had been under federal scrutiny since the August 2014 shooting of Brown, who was black and unarmed, by white police officer Darren Wilson. The killing led to protests and promoted a wave of national scrutiny about police use of force and law enforcement's interactions with minorities.\nFILE - In this Friday, Nov. 28, 2014, file photo, police and Missouri National Guardsmen face protesters gathered in front of the Ferguson Police Department in Ferguson, Mo. The Justice Department has reached a tentative agreement with Ferguson on systemic changes following the fatal police shooting of 18-year-old Michael Brown in 2014, city officials announced Wednesday, Jan. 27, 2016. The recommended overhaul to the Ferguson Police Department and the city¿s municipal court system follows seven months of negotiations and likely averts a civil rights lawsuit that federal officials can bring against departments that resist changing their policing practices. (AP Photo/Jeff Roberson, File)\nWilson was cleared in the shooting, but a federal investigation into the Ferguson police force found sweeping patterns of racial bias throughout the city's criminal justice system. A Justice Department report in March found that officers routinely used excessive force, issued petty citations and made baseless traffic stops in the city of about 21,000 residents, about two-thirds of whom are black. It also criticized the police force, which was nearly all white, and the court system for leaning heavily on fines for petty municipal violations as a source of revenue for the city government.\nThe recommended overhaul follows seven months of negotiations and likely averts a civil rights lawsuit that federal officials can bring against departments that resist changing their policing practices. City officials posted the tentative deal on its website and scheduled three public sessions for input from residents. A City Council vote is scheduled for Feb. 9.\nThe agreement envisions a top-to-bottom reshaping of basic policing practices as the Justice Department calls for fundamental changes in how officers conduct stops, searches and arrests, use their firearms and respond to demonstrations. Ferguson officials also agreed to rewrite their municipal code to restrict the use of fines and jail time for petty violations.\n\"The agreement also will ensure that the city's stated commitment to refocusing police and municipal court practices on public safety, rather than revenue generation, takes root and will not be undone,\" Vanita Gupta, head of the Justice Department's Civil Rights Division, wrote in a letter to Ferguson Mayor James Knowles III.\nAmong the highlights of the deal is a requirement that all patrol officers, supervisors and jail workers be outfitted — within 180 days of the agreement taking effect — with body-worn cameras and microphones. The cameras, aimed at promoting accountability, are to be activated for all traffic stops, arrests, searches and encounters with people believed to be experiencing a mental health crisis.\nOfficers also would be expected to justify as reasonable each shot they fire, and police department policies will lay out each use of force option and the circumstances in which it's appropriate.\nAs part of the consent decree, police officers and court employees would be given training on \"bias-free policing\" to help them recognize unconscious stereotyping. And new training would also be given on proper stops, searches and arrests, as well as on use of force and appropriate responses to demonstrators and protesters.\nThe city also will develop a recruitment plan to attract diversity to the police force.\nFerguson spokesman Jeff Small said the city hasn't calculated its total financial obligations but called them \"significant.\" Ferguson voters will consider two ballot measures in April that would increase property and sales taxes — without which the city expects to resort to layoffs to help plug a $2.8 million budget shortfall.\n\"We're not just going to negotiate and say, 'Boom. This is what you have to live with as a community,\" Small said.\nThe consent decree represents a milestone moment for a city that attracted national attention after Brown was shot during a street encounter with Wilson. A St. Louis County grand jury declined to indict Wilson in the shooting. The Justice Department also cleared the officer, concluding that evidence backed his claim that he shot Brown in self-defense after Brown tried to grab his gun during a struggle through the window of Wilson's police vehicle, then came toward him threateningly after briefly running away.\nGupta said \"the entire Ferguson community has reason to be proud\" about the deal, saying in her letter Tuesday that its implementation will \"ensure that police and court services in Ferguson are provided in a manner that fully promotes public safety, respects the fundamental rights of all Ferguson residents, and makes policing in Ferguson safer and more rewarding for officers.\"\nThe city's statement called the deal \"the best agreement that the city's representatives were able to obtain for the citizens.\"\n___\nTucker reported from Washington.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420005/Ferguson-feds-reaches-tentative-police-reform-deal.html"}
