{"authors":[],"date_download":"2018-10-22 20:07:09","date_modify":"2018-10-22 20:07:09","date_publish":"2016-01-28 00:15:25","description":"The city of Ferguson said Wednesday it has reached a deal with the US Justice Department to reform its police department and courts in the wake of the police...","filename":"data/vaneerConsumption/FergusonreachesdealwithUStoreformpolicecourts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g4o7-2vdWmEltwXfba0ce28e6321ef5d9-859_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420181_Ferguson-reaches-deal-US-reform-police-courts_1540238829.html","title":"Ferguson reaches deal with US to reform police, courts","title_page":"Ferguson reaches deal with US to reform police, courts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ferguson reaches deal with US to reform police, courts\nThe city of Ferguson said Wednesday it has reached a deal with the US Justice Department to reform its police department and courts in the wake of the police shooting of unarmed black teen Michael Brown.\nBrown's 2014 death sparked weeks of sometimes violent protests and ignited a national debate about race relations and law enforcement in the United States.\nFerguson was required to implement reforms after federal investigators found a widespread pattern of racial discrimination and multiple violations of citizens' constitutional rights in the St. Louis, Missouri suburb.\nPolice stand guard as protesters march in Ferguson, Missouri on August 9, 2015 ©Michael B. Thomas (AFP/File)\nPolice officers in the town of 21,000 regularly pulled over motorists without reasonable suspicion, carried out arrests without probable cause and used excessive force.\nWhile African Americans make up two-thirds of Ferguson's overall population, they accounted for 93 percent of arrests in 2012 through 2014.\nAfrican Americans also accounted for 85 percent of people stopped by Ferguson police, 90 percent of citations issued and 88 percent of instances in which force was used.\nFerguson's local judicial system also came under a harsh light, with the report finding that African Americans were 68 percent less likely than others to have their cases dismissed by a municipal judge.\nAnd the town itself was accused by Attorney General Eric Holder of using law enforcement as a means to boost revenues, rather than ensure public order.\nThe city \"has made some positive changes to its law enforcement practices,\" since the scathing report was released in March, the Justice Department said in a letter to Ferguson's city council.\nThe reforms laid out in a 131-page consent decree will \"ensure that the City's stated commitment to refocusing police and municipal court practices on public safety, rather than revenue generation, takes root and will not be undone,\" it added.","url":"https://www.dailymail.co.uk/wires/afp/article-3420181/Ferguson-reaches-deal-US-reform-police-courts.html"}
