{"authors":["Alicia Lu"],"date_download":"2018-10-30 22:31:23","date_modify":"2018-10-30 22:31:23","date_publish":"2014-08-15 14:19:50","description":"On Friday morning, the police department in Ferguson identified the officer who shot Michael Brown as Darren Wilson, a six-year veteran with no disciplinary history. Thomas Jackson, police chief, released the name during a press conference in the…","filename":"data/vaneerConsumption/FergusonConvenienceStoreRobberyFootageReleasedByPoliceVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/33e9c3ee-5f79-432c-9b72-d3bd963b08a3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35915-ferguson-convenience-store-robbery-footage-released-by-police-video_1540938683.html","title":"Ferguson Convenience Store Robbery Footage Released By Police - VIDEO","title_page":"Ferguson Convenience Store Robbery Footage Released By Police — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"On Friday morning, the police department in Ferguson identified the officer who shot Michael Brown as Darren Wilson, a six-year veteran with no disciplinary history. Thomas Jackson, police chief, released the name during a press conference in the St. Louis suburb. According to the department, Wilson encountered Brown after the teen had been named as the main suspect in a convenience store robbery. Later Friday, authorities clarified that Wilson hadn't known Brown was a suspect at the time, and released video of the robbery.\nFerguson police also released a 19-page report of the incident to the media, which requested it through the Freedom of Information Act.\nThe report, based on surveillance footage from the store and eye witness accounts, alleges that Brown and a second man, Dorian Johnson, stole a box of cigars and Brown aggressively grabbed the store clerk, who tried to lock the door and bar them from leaving. Wilson had been responding to another call when he received the call about the robbery. Minutes after he encountered Brown, Wilson fatally shot the teen, though circumstances and details surrounding the shooting still remain a mystery.\nIn the days after Brown was shot last Saturday, Ferguson erupted in disorder, as angry citizens demanded justice for the slain teen and cops escalated their measures with military tactics. After the police department's initial refusal to identify the shooter, civil rights groups went to court to try to force the release. They weren't the only group that demanded the name.\nOn Thursday, the hacktivist group Anonymous released the name of a cop it believed had killed Brown. After giving Ferguson police an ultimatum — release the name or we will — and posting several warning tweets, the group tweeted the name. However, in light of the official reveal, it appears that Anonymous had named a completely innocent man.\nPeople have taken to Twitter to comment on the newly identified cop who fatally shot Brown.\nSome warn against releasing pictures of the wrong Darren Wilson in haste.","url":"https://www.bustle.com/articles/35915-ferguson-convenience-store-robbery-footage-released-by-police-video"}
