{"authors":[],"date_download":"2018-10-30 23:04:40","date_modify":"2018-10-30 23:04:40","date_publish":"2014-08-14 12:53:53","description":"As violence extended into its fourth night, several public figures at the center of what the nation has seen about Ferguson were detained by police. St. Louis elected official Antonio French and two journalists were arrested on Wednesday,…","filename":"data/vaneerConsumption/FergusonStLouisFourthNightOfProtestsSawTearGasAndReportersArrested.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/05dfa895-4d27-41d2-b001-867b22a6bfae.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35729-ferguson-st-louis-fourth-night-of-protests-saw-tear-gas-and-reporters-arrested_1540940680.html","title":"Ferguson, St. Louis' Fourth Night Of Protests Saw Tear Gas And Reporters Arrested","title_page":"Ferguson, St. Louis' Fourth Night Of Protests Saw Tear Gas And Reporters Arrested","title_rss":"NULL","source_domain":"bustle.com","text":"As violence extended into its fourth night, several public figures at the center of what the nation has seen about Ferguson were detained by police. St. Louis elected official Antonio French and two journalists were arrested on Wednesday, highlighting escalating police presence in Ferguson and a paranoia extending beyond the protesters themselves.\nMeanwhile, police tried to quell protesters with tear gas, stun grenades, and smoke bombs, Reuters reported. One police officer sat with a rifle mounted on the car, a bird's eye view over the protestors, who have been active since the police shooting of unarmed black teenager Michael Brown this weekend.\nThe Washington Post's Wesley Lowery and Huffington Post's Ryan Reilly were arrested at a McDonald's on Wednesday evening while covering the protests. According to The Post , police entered the McDonald's, some dressed in full riot gear, and asked the reporters to leave. When they refused to leave and identified themselves as journalists, the police said they could stay but could not guarantee protection.\nLater, the police returned, demanding that the journalists leave the McDonald's. Lowery began to take a video, and after confusing instructions from officers on how he should vacate the premises, the Post reporter was arrested. Reilly was asked for identification after he snapped a photo when police entered. He refused to present ID, which he believes is the reason for the arrest.\nOfficers say that both reporters did not leave the premises quickly enough, and that Lowery was unlawfully taping the police. The two were released hours later without any charges filed.\nBoth reporters said that officers handled them roughly, with Reilly even using the word \"assault\" to describe his arrest. The police department refused to identify the officer to Reilly after repeated attempts to get his name and badge number.\nLater Wednesday evening, city elected official Antonio French was arrested for unlawful assembly. French, St. Louis county's youngest alderman, had used his popular social media accounts to provide frequent updates from Ferguson.\nFrench's wife, Jasenka Benac French, broke the news on Twitter, and provided developing details on her husband's arrest.\nAs of Thursday morning, tweets are saying that French was released from jail, though he was initially expected to be on a 24-hour hold.\nThere is still little detail known about French's arrest, but police anxiety seems to be at a breaking point. Roughing members of the media and a city official who has been a key element in public information about the protests is not the way to go when the whole world (more specifically, Twitter) is watching.\nStill, Lowery did point out (although it is unclear still if this happened in French's case), that no matter how traumatic his arrest was, it's nothing compared to what the citizens of Ferguson are facing from police.","url":"https://www.bustle.com/articles/35729-ferguson-st-louis-fourth-night-of-protests-saw-tear-gas-and-reporters-arrested"}
