{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 02:25:43","date_modify":"2018-10-23 02:25:43","date_publish":"2016-01-28 17:11:46","description":"Donning a seasonally sensible ensemble on Thursday, the 40-year-old Black Eye Peas singer channelled a classic yet understated and chic vibe in all black.","filename":"data/vaneerConsumption/FergieshowcasesastylishensembleassheleavesParisHauteCoutureFashionweek.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC57C300000578-0-image-a-22_1454001048681.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421262_Fergie-showcases-stylish-travel-chic-ensemble-leaves-Paris-Haute-Couture-Fashion-week_1540261543.html","title":"Fergie showcases a stylish ensemble as she leaves Paris Haute Couture Fashion week","title_page":"Fergie showcases a stylish ensemble as she leaves Paris Haute Couture Fashion week | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of the many famous faces who have graced the FROW at Paris Haute Couture Fashion Week.\nAnd even though it was time to bid 'Au Revoir' to the city's fashion elite on Thursday morning, Fergie still managed to show off her impressive style credentials.\nDonning a seasonally sensible ensemble, the 40-year-old Black Eye Peas singer channelled a classic yet understated and chic vibe in all black.\nScroll down for videos\nLeaving a lasting impresson: Even though it was time to bid 'Au Revoir' to the city's fashion elite on Thursday morning, Fergie still managed to show off her impressive style credentials\nMaking her way way to the Gare du Nord train station, the singer cut an enigmatic figure in the midst of a huge entourage.\nSticking to the age-old rule that you can never go wrong with black, Fergie cut a sartorially swish figure as she went through the process of checking her bags at the station.\nMaking sure no hint of the winter wind bothered her, the singer donned a large overcoat, which featured an oversized box-style collar.\nTraveling in style: Donning a seasonally sensible ensemble, the 40-year-old Black Eye Peas singer channelled a classic yet understated and chic vibe in all black\nKeeping a chic and slick edge for her high-fashion travel ensemble, the Big Girls Don't Cry singer sported the flared trouser suit, which she'd sported the day before at the Jean Paul Gaultier show.\nFeaturing a one-sleeve design, the double- breasted affair allowed her the singer to subtly showcase her sartorial sass.\nShe rounded her wardrobe off with a pair of black patent stilettos - perfectly in keeping with tone of her power-broker vibe.\nMaking tottering tracks: Making her way way to the Gare du Nord train station, the singer cut an enigmatic figure in the midst of a huge entourage\nChic and slick: Keeping a chic and slick edge for her high-fashion travel ensemble, the Big Girls Don't Cry singer sported the flared trouser suit, which she'd sported the day before at the Jean Paul Gaultier show\nSeasonally stylish: Making sure no hint of the winter wind bothered her, the singer donned a large overcoat, which featured an oversized box-style collar\nA well-heeled display: She rounded her wardrobe off with a pair of black patent stilettos - perfectly in keeping with tone of her power-broker vibe\nAdding a suitably quirky edge to her look, the singer - who is married to Transformers star Josh Duhamel - sported a pair of welder-style sunglasses, which featured silver surrounds.\nThe mother-of-one - two-year-old Axl - also chose to wear a single sheer glove over her right hand.\nWearing her blonde mane in a swept-over style, the singer let her hair flow in waves around one shoulders.\nOpting for a subtle and flesh-toned make-up palette, Fergie let her naturally pretty features shine through.\nA shade of sass: Adding a suitably quirky edge to her look, the singer - who is married to Transformers star Josh Duhamel - sported a pair of welder-style sunglasses, which featured silver surrounds","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421262/Fergie-showcases-stylish-travel-chic-ensemble-leaves-Paris-Haute-Couture-Fashion-week.html"}
