{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 22:00:22","date_modify":"2018-10-30 22:00:22","date_publish":"2015-11-11 13:30:51","description":"The USC student senate passed a controversial \"diversity\" resolution Tuesday evening--the latest example of the \"Ferguson effect.\"","filename":"data/vaneerConsumption/FergusonEffectUSCPassesDiversityResolution.json","image_url":"https://media.breitbart.com/media/2015/11/image-1.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_11__1540936822.html","title":"Ferguson Effect: USC Passes 'Diversity' Resolution","title_page":"Ferguson Effect: USC Passes 'Diversity' Resolution | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The University of Southern California student senate passed a controversial “diversity” resolution Tuesday evening–the latest example of the “Ferguson effect” that is seizing campuses around the nation.\nThe resolution calls for $100 million, and possibly more, to be spent on mandatory diversity classes in an attempt to create an “inclusion climate” on campus.\nThe resolution passed with 11 votes in favor and one against, with only Senator Jacob Ellenhorn opposing the resolution. On Facebook, Ellenhorn posted that although he stood alone, he “stood proud” for refusing to be part of the perpetuation “of a damaging culture of victimhood that is currently destroying college campuses across the country.”\nDuring a previous meeting, members of the student body had shouted “impeach now” at Ellenhorn and others who criticized the bill.\n“I think it’s very disappointing that we’ve shown our true colors, that we want to play identity politics,” said a USC student and fraternity president in a heated exchange with USC Senate President Rini Sampath.\nJames also clashed with Shyann Murphy, director of the school’s Women’s Student Assembly (WSA) engaged in a brief but racially-charged exchange. Murphy and others believed the university’s administrators were too white and that there needed to be more diversity among them.\nJames continued, “I find it painfully ironic that your solution to USC have so many administrators that don’t listen to us, is to create more administrators.” Shyann shot back that “our concern is not to add more administrators that will not listen to us. It is to add more administrators that will listen to us. She added that “right now, the administrators are here to support you, not us,” referring to James’s white appearance.\nSampath chimed in saying that “all of the issues could be addressed when we have [administrators] who look like us.”\nSampath, who is of Indian descdnt, was the main push behind the campus diversity resolution after she was allegedly called a racial slur by a drunk member of a fraternity. Many on campus saw the incident as isolated. However, it became the impetus for student protests similar to those that have been taking place throughout the country.\nOn Monday, the president and chancellor of the University of Missouri both capitulated and resigned within hours of each other after being accused of having “white privilege” by black student groups. One complaint was that administrators had not shown enough concern about the shooting death of unarmed black teenager Michael Brown in Ferguson, MO in 2014 after Brown attacked a police officer.\nDuring an October 27 meeting, one of the USC resolution’s co-authors Sophia Li had complained that “every single one of the books we are reading, is written by an old white man…there is no single reading in any one of my classes that is not written by anyone who isn’t like old, white or man.”\nThe diversity resolution’s latest version asserted that the $100 million would not be taken from student tuition. One student even suggested spending less money beautifying the campus–i.e. forgoing planting red and yellow flowers–and using that money towards funding diversity programs.\nStill, the $100 million figure was not sufficient for all. Richard Aviles, local community organizer and prospective student, said the student Senate should have negotiated from a higher place. “I think the $100 million could have been $500 million [or even] $1 billion,” Aviles said.\nAccording to facts and figures from the 2015-2016 academic year, the school’s student body is 18 percent Asian, 5 percent Black/African-American, 34 percent White/Caucasian, and 24 percent “international,” with 7 percent listed as “other.”\nThe majority of students present at Tuesday’s meeting hailed from Latino and African-American backgrounds, although several white and Asian students were also present.\nJT, who is a junior studying journalism with a minor in Spanish, told Breitbart News she that she had experienced racism on campus, “But it was from people of my own race. Not from other races.”\nShe said other black students had told her that she was “not black enough,” adding that “for people who were not black it was more like a compliment, and for people who were black it was more like an insult, if that makes sense.”\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/local/2015/11/11/ferguson-effect-usc-passes-diversity-resolution/"}
