{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-22 23:53:23","date_modify":"2018-10-22 23:53:23","date_publish":"2017-04-26 08:46:48","description":"The Duchess of York, 57, was joined by Beatrice, 28, and Eugenie, 27, at upmarket restaurant Chucs in Mayfair where they enjoyed a catch up before making their way home at 11 pm.","filename":"data/vaneerConsumption/FergiegoesoutfordinnerwithBeatriceandEugenie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D1D3000000578-0-image-a-9_1493191496203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446598_Fergie-goes-dinner-Beatrice-Eugenie_1540252403.html","title":"Fergie goes out for dinner with Beatrice and Eugenie","title_page":"Fergie goes out for dinner with Beatrice and Eugenie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eugenie has just been made director of the art gallery where she works, while Beatrice is forging her own path as a business consultant.\nSo Fergie, 57, and her daughters no doubt had lots to catch up on as they enjoyed dinner at Chucs restaurant in Mayfair last night.\nThe royal was all smiles as she emerged from the eatery around 11pm, wrapped up in a white coat cinched at the waist with a black belt.\nEugenie braved the chill with bare legs, wearing a black coat with grey ankle boots.\nMeanwhile, it was a busy night for Beatrice who joined her mother and sisters after attending a VIP dinner celebrating Mrs Alice for French Sole at The Connaught Hotel.\nSarah Ferguson enjoyed an evening meal with her daughters Princess Beatrice and Princess Eugenie at Chucs restaurant in Mayfair\nPrincess Beatrice was all smiles as she left the upmarket eatery at 11pm after catching up with her mother and sister\nEugenie braved the spring chill, going bare legged in a navy dress teamed with grey ankle boots\nThe royal, 28, posed up a storm with designer Alice Naylor-Leyland who has created two collections with the footwear brand.\nBeatrice looked smart in a navy dress, which she paired with a black belt and suede heels.\nThe budding entrepreneur let her natural beauty shine through, keeping her make-up fresh and natural and let her flame haired locks fall loosely around her shoulders.\nShe then made the short hop to Mayfair to join her mother and sister for a catch up.\nEarlier Beatrice, pictured with designer Alice Naylor-Leyland, attended a VIP dinner celebrating Mrs Alice for French Sole at The Connaught Hotel\nThe princess poses with Alice's husband Tom Naylor-Leyland\nBeatrice kept her makeup to a minimum to let her natural beauty shine through\nGlobe trotting Beatrice has just returned from New York where she attended the Kairos Society Global Summit At One World Observatory last Friday.\nThe Princess is said to be in the process of developing a business start-up since leaving her job at a Manhattan investment firm last summer.\nAt the time, the Queen's granddaughter explained she was determined to pursue her 'entrepreneurial ambitions'.\nGlobe trotting Beatrice has just returned from New York where she attended the Kairos Society Global Summit\nFergie looked animated as she left the Mayfair eatery after enjoying a catch up with her daughters\nAccording to her CV on LinkedIn, she is currently Vice President of Partnerships & Strategy at Afiniti.com, a Washington DC-based computer software company.\nBea is also currently patron of nine charities including the York Musical Society and the Helen Arkell Dyslexia Centre.\nMeanwhile, Eugenie has been promoted to the role of director of the Hauser & Wirth contemporary art gallery in London.\n‘Eugenie is working hard and doing a good job,’ one of her friends reported. ‘The promotion is well deserved.’\nThe royal enjoyed a joke with a well-heeled friend as she left the restaurant","url":"https://www.dailymail.co.uk/femail/article-4446598/Fergie-goes-dinner-Beatrice-Eugenie.html"}
