{"authors":["John Nolte"],"date_download":"2018-10-30 22:01:44","date_modify":"2018-10-30 22:01:44","date_publish":"2015-05-30 13:54:51","description":"The Wall Street Journal is calling the dramatic end of America's two-decade-long drop in crime \"The Ferguson Effect.\" Led behind the scenes by President Obama, America's fraudulent civil rights leaders (Al Sharpton) and the mainstream media (especially CNN), worked together -- starting with their lies in Ferguson -- to launch hate campaigns against the police. |","filename":"data/vaneerConsumption/FergusonEffectAmericasNewCrimeWaveIsAllPartofthePlan.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ap-photo195-1024x750.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_30__1540936904.html","title":"'Ferguson Effect': America's New Crime Wave Is All Part of the Plan","title_page":"'Ferguson Effect': America's New Crime Wave Is All Part of the Plan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Wall Street Journal is calling the dramatic end of America’s two-decade-long drop in crime “The Ferguson Effect.” Led behind the scenes by President Obama, America’s fraudulent civil rights leaders (Al Sharpton) and the mainstream media (especially CNN), worked together — starting with their lies in Ferguson — to launch hate campaigns against the police.\nThe result is an empowered criminal element and by extension a horrific increase in murders, shootings, and other violent crimes:\nGun violence is up more than 60% compared with this time last year, according to Baltimore police, with 32 shootings over Memorial Day weekend. May has been the most violent month the city has seen in 15 years. In Milwaukee, homicides were up 180% … Through April, shootings in St. Louis were up 39%, robberies 43%, and homicides 25%. “Crime is the worst I’ve ever seen it,” said St. Louis Alderman Joe Vacarro at a May 7 City Hall hearing. Murders in Atlanta were up 32%… Shootings in Chicago had increased 24% and homicides 17%. Shootings and other violent felonies in Los Angeles had spiked by 25%; in New York, murder was up nearly 13%, and gun violence 7%. … Shooting incidents are up 500% in an East Harlem precinct compared with last year; in a South Central Los Angeles police division, shooting victims are up 100%.\nAnd who are the victims here?\nNot just the predominantly poor people who huddle in these cities, these are mostly black people.\nFor nearly two years in the mid-eighties I lived in the worst parts of Milwaukee’s inner-city. Crime and the fear of crime is by far the worst part of being poor. If you have a place to live, heat, and food, you can deal with not having much money. Living in constant fear, though, of opening your front door, walking to your car, waiting for a bus, or taking the stairs, is a living nightmare.\nIt’s like living in a Vampire movie. No, really. Unless you’ve experienced it, I know of no other way to describe it. Anything outside of a locked home after dark is filled with an indescribable dread of a very real danger.\nAnd that’s what life is like for everyone. Now imagine being mugged, having your car stolen and your apartment burglarized on top of all that. All of that happened to my wife and I during those two years. We got the hell out. It wasn’t easy but we did. A lot of people don’t.\nSadly, this stunning and unnecessary increase in crime is all part of the Left’s plan. You paralyze the cops with persecution, justify riots and looting, and by extension empower the criminals. The result is city-wide chaos, despair, and hopelessness. The result is victims desperate for someone to blame and even more dependent on a central government. The result is an empowered central government with even more control over the lives of those most in need of empowerment, not dependence.\nKeep ’em down. Keep ’em angry. Pretend you are their savior not their oppressor, and keep ’em voting for the very thing destroying them: big government and the Democrats who control it.\nThis sinister plot is no secret. It’s openly called the Cloward-Piven Strategy.\nThe Ferguson Effect isn’t a bug, it’s a feature.\n#BlackLivesMatter?\nDon’t make me laugh.\nBlack Lives are nothing more than sacrifices to the cause of empowering the elite few who control the levers of Central Government.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/05/30/ferguson-effect-americas-new-crime-wave-is-all-part-of-the-plan/"}
