{"authors":["Associated Press"],"date_download":"2018-10-22 20:02:00","date_modify":"2018-10-22 20:02:00","date_publish":"2016-01-28 00:01:45","description":"BRATISLAVA, Slovakia (AP) — Javier Fernandez of Spain took a huge step toward a fourth straight European title by winning the men's short program on Wednesda...","filename":"data/vaneerConsumption/FernandezMedvedevawinshortprogramsatEuropeanchamps.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:64ce92e1431e408d84ed7aab79d02735-2vdWmEltwXfba0ce28e6321d55d8-938_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419304_Medvedeva-leads-Russia-1-2-3-European-figure-skating_1540238520.html","title":"Fernandez, Medvedeva win short programs at European champs","title_page":"Fernandez, Medvedeva win short programs at European champs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fernandez, Medvedeva win short programs at European champs\nBRATISLAVA, Slovakia (AP) — Javier Fernandez of Spain took a huge step toward a fourth straight European title by winning the men's short program on Wednesday, the opening day of the European figure skating championships.\nSkating to \"Malaguena\" performed by Paco de Lucia and Placido Domingo, Fernardez's opening quad-triple combination was not perfect, but the following quad salchow was.\nFor his impressive performance, Fernandez earned 102.54 points — the highest short program score ever at a European championships. It gave him a convincing lead of more than 14 points and improved his personal best of 96.42 by more than six points.\nJavier Fernandez, of Spain, skates his short program during the European figure skating championships in Bratislava, Slovakia, on Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\n\"I am really satisfied with my program today as I as it was the first time I got over 100 in an international competition, so it was really big for me,\" Fernandez said. \"I did a little step out on the quad-triple but I got a level 4 on the steps and spins.\"\nThe free skate takes place on Thursday.\nRussia's Maxim Kovtun, who took silver last year, finished second with 88.09, while Michal Brezina of the Czech Republic was third with 84.30.\nEarlier Wednesday, Evgenia Medvedeva led a Russian sweep of the top three positions in the women's short program.\nThe Russians dominated even though defending champion Elizaveta Tuktamysheva didn't make the team.\nThe free skate is scheduled for Friday.\nMaking her debut at the top continental competition, Medvedeva earned 72.55 points despite an uncertain landing of the double lutz.\n\"I was a bit more nervous than usual,\" Medvedeva said. \"The European championships are new for me. I did my job but I could have done better. Overall, I'm pleased because I thought through it.\"\nElena Radionova, who took silver at last year's championships in Stockholm, was in second place with 70.96 points. Anna Pogorilaya was in third, more than seven points behind Radionova.\nRoberta Rodeghiero of Italy received 61.01 for fourth, ahead of Angelina Kuchvalska of Latvia.\nJavier Fernandez, of Spain, skates his short program during the European figure skating championships in Bratislava, Slovakia, on Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\nEvgenia Medvedeva from Russia competes during her women's short program at the European Figure Skating Championships in Bratislava, Slovakia, Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\nEvgenia Medvedeva from Russia competes during her women's short program at the European Figure Skating Championships in Bratislava, Slovakia, Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\nAnna Pogorilaya from Russia competes during her women's short program at the European Figure Skating Championships in Bratislava, Slovakia, Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\nRoberta Rodeghiero from Italy competes during her women's short program at the European Figure Skating Championships in Bratislava, Slovakia, Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\nJavier Fernandez, of Spain, skates his short program during the European figure skating championships in Bratislava, Slovakia, on Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)\nMaxim Kovtun, of Russia, skates his short program during the European figure skating championships in Bratislava, Slovakia, on Wednesday, Jan. 27, 2016. (AP Photo/Petr David Josek)","url":"https://www.dailymail.co.uk/wires/ap/article-3419304/Medvedeva-leads-Russia-1-2-3-European-figure-skating.html"}
