{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 03:16:36","date_modify":"2018-10-23 03:16:36","date_publish":"2017-03-10 12:45:12","description":"In the final episode of Celebs Go Dating all jokes are swept to one side, as Ferne McCann becomes tearful over the dating experts' attempts to find her someone.","filename":"data/vaneerConsumption/FerneMcCannfightsbacktearsonCelebsGoDating.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E239ACA00000578-0-image-a-42_1489159266234.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301156_Ferne-McCann-fights-tears-Celebs-Dating_1540264596.html","title":"Ferne McCann fights back tears on Celebs Go Dating","title_page":"Ferne McCann fights back tears on Celebs Go Dating | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"On Thursday night's penultimate episode of the current series of Celebs Go Dating, Ferne McCann was seen heading off for her final blind date, with hopes that it would be a success.\nBut the former TOWIE star was left disappointed once again, returning from the date still single.\nIn the final episode of the series, set to air Friday night on E4, all jokes are swept to one side, as Ferne becomes tearful over the dating experts' attempts to find her someone.\nScroll down for video\n'I feel like a failure and that I've been left on the shelf': Ferne McCann fights back tears on the series finale of Celebs Go Dating as she attends the last dinner party ALONE\n'I have no one!' she says in her final one-to-one session at the dating agency offices. 'I wanted to take this seriously. I wasn’t doing this for a fling. I feel like a failure and I’ve been left on the shelf.\n'I wanted to meet someone and fall in love and that hasn’t happened!'\nFerne gets emotional at this point and begins to well up, taking breaths to calm herself down.\nDating guru Nadia Essex informs the reality personality that there is still one more group dinner party to attend, and that she's strong enough to go alone.\n'I wanted to meet someone and fall in love and that hasn’t happened': Ferne got emotional and started to well up, taking breaths to calm herself down\n'You're strong enough to do this,' Nadia said.\nSpeaking to the camera later on, she has clearly thought things through and decided to go.\n'It will be weird to walk in alone but f**k it!' she says, definatly. 'Maybe they are right, maybe I don’t need to settle for second best.'\nShe is also seen being coached by her former I'm A Celebrity... Get Me Out Of Here! campmate Vicky Pattinson who tells her: 'You’re gorgeous, you’re loyal, you’re fun; my only criticism of you is that you're all or nothing.'\nElaborating on this, she added: 'No one's going to buy the cow if you’re giving the milk away for free. You're a sexy cow who doesn’t need a male cow!'\nStill single: The former TOWIE star was left disappointed once again\nFerne has had a string of blind dates which have proven fruitless on the show.\nSo it stands to reason that the former TOWIE star had reservations about her final date of the series on Thursday.\n'This is my last chance!' she said, with panic in her eyes.\nAssessing how she looked, the brunette observed: 'My hair looks like s**t and my eyelashes were blown off in the wind!\n'They were flapping about like nobody's business, and then I stepped outside and they blew the f**k off!'\nEmotional: In the final episode of the series, set to air Friday night on E4, all jokes are swept to one side, as Ferne becomes tearful over the dating experts' attempts to find her someone\nSad: Dating guru Nadia Essex informs the reality personality that there is still one more group dinner party to attend, and that she's strong enough to go alone\nHowever, the former I'm A Celebrity... Get Me Out Of Here! finalist was more than happy with one element of her appearance.\n'As long as my t*ts are looking good, it's fine,' she said, with her trademark grace. 'They're actually looking bang on!'\nThe emotional roller-coaster that the show has taken her on has evidently been the source of inspiration for the the reality star, who goes on to say that the experience 'has inspired me to write music'.\n'I feel like Adele. Or Amy Winehouse,' she said. 'When they experience pain they write or sing.'\nInspiration: Ferne says the show has 'inspired her to write music'\nHidden talent: Starring alongside former Pussycat Doll Melody Thornton on the celebrity dating show, a source told The Sun that 'Ferne is a secret songstress'\nPressure: It's not been a massive success for Ferne McCann on Celebs Go Dating. She's had a string of blind dates which have proven fruitless\nThis bombshell comes as it was reported that she is in fact planning a pop career.\nStarring alongside former Pussycat Doll Melody Thornton on the celebrity dating show, a source told The Sun that 'Ferne is a secret songstress'.\n'She has been in the recording studio recently and things are going really well,' they said. 'She recently played a bit of a swing version of That’s Life that she has recorded and the reaction has been great.\n'She is a lady of many hidden talents!'\nCelebs Go Dating's season finale airs on Friday night.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301156/Ferne-McCann-fights-tears-Celebs-Dating.html"}
