{"authors":["Associated Press"],"date_download":"2018-10-23 05:24:32","date_modify":"2018-10-23 05:24:32","date_publish":"2017-03-16 16:19:16","description":"MIAMI (AP) - Miami Marlins pitcher Jose Fernandez was the \"probable\" operator of a speeding boat that crashed into a Miami Beach jetty on Sept. 25, killing...","filename":"data/vaneerConsumption/Fernandezwaslikelyoperatingboatindeadlycrash.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/16/wire-229437-1489681170-177_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320918_Fernandez-likely-operating-boat-deadly-crash_1540272272.html","title":"Fernandez was likely operating boat in deadly crash","title_page":"Fernandez was likely operating boat in deadly crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MIAMI (AP) - Miami Marlins pitcher Jose Fernandez was the \"probable\" operator of a speeding boat that crashed into a Miami Beach jetty on Sept. 25, killing the baseball star and two other men, according to a report issued Thursday by the Florida Fish and Wildlife Conservation Commission, which investigated the accident.\nThe 46-page report included a seating chart that had Fernandez at the helm, based on \"physical evidence\" collected during the investigation, including the pitcher's fingerprints and DNA on the steering wheel and throttle and projection of his body as he was thrown from the boat. It also listed drugs and alcohol as factors in the crash.\nFernandez's 32-foot Sea Vee hit Miami's Government Cut north jetty at 65.7 mph just after 3 a.m. on Sept. 25, the report said. Fernandez and the boat's other occupants - Emilio Jesus Macias, 27, and Eduardo Rivero, 25 - were ejected.\nFILE - In this Sept. 25, 2016, file photo, investigators inspect an overturned boat as it rests on a jetty after a crash off Miami Beach, Fla. Miami Marlins pitcher Jose Fernandez was the \"probable\" operator of a speeding boat that crashed into a Miami Beach jetty on Sept. 25, 2016, killing the star baseball star and two other men, according to a report issued Thursday, March 16, 2017, by the Florida Fish and Wildlife Conservation Commission, which investigated the accident. (AP Photo/Gaston De Cardenas, File)\nInvestigators concluded that had Fernandez survived the crash, he could have been charged with multiple crimes, including boating under the influence manslaughter; vessel homicide; and reckless or careless operation of a vessel.\nThe report also included a text message exchange that night between Rivero and Maria Arias, Fernandez's girlfriend. She told Rivero the pair had been arguing and asked him to take care of Fernandez. \"He's been drinking and is not in the best state of mind.\"\nMiami-Dade Fire Rescue crews responded and divers found Fernandez submerged under the boat, pinned between the t-top and a boulder. Macias was submerged in a tidal pool next the jetty's surface and Rivero was submerged, his head and chest under a bolder. They were pronounced dead at the scene.\nThe report describes how officials were not able to identified Fernandez by his driver's license photo because of face trauma. They searched the internet for photos of Fernandez's tattoo, which had a baseball surround by gears, to identify him. They also found a Major League Baseball identification card inside his wallet.\nFernandez's boat was named \"Kaught Looking\" - the \"K'' is backwards, signifying a strikeout when the batter does not swing.\nAccording to the report, Fernandez's mother, Maritza Fernandez, was adamant in telling investigators the day of the crash that her son \"was always the driver\" of his boat. She also said she didn't know her son to be a heavy drinker or user of drugs.\nRalph E. Fernandez, a Tampa-based attorney who is a family friend, also was interviewed in a group setting with the pitcher's mother and several other relatives. He said he knew the pitcher could \"throw 'em down\" and wouldn't be surprised to learn he had been drinking that night. The lawyer also described the pitcher as controlling and a \"hot head.\"\nInvestigators also looked into, and debunked, Fernadez's contention that the pitcher could not have been driving the boat that night because he was aware of someone who was on the phone with the pitcher at the time of the crash. \"He said this person heard Fernandez giving someone directions when suddenly he heard the crash occur and the phone went dead,\" the report said. Ralph Fernandez did not immediately respond to an email seeking comment on the accident report.\nInvestigators met with Yuri Perez, a South Beach club owner who claimed he was on the phone with Fernandez at the time of the crash. But GPS and phone records show Perez was on the phone with Fernandez 12 minutes before the crash, while the boat was still on the Miami River.\nAn autopsy concluded Fernandez and Rivero had cocaine and alcohol in their systems.\n\"The presence of cocaethylene does confirm that alcohol and cocaine were consumed at the same time, from 15 minutes to 2 hours of most recent use,\" the report concludes.\nInvestigators found that Fernandez and Rivero arrived at American Social, a Miami bar, around 1 a.m. on Sept. 25 and spent about an hour and 45 minutes there. Fernandez bought two bottles of tequila, two vodka drinks and one gin drink. Macias bought three vodka drinks, according to the report.\nThe trio left at 2:42 a.m. and the crash occurred at 3:02 a.m.\nThe report says it was calm and dark in Miami - with visibility at 10 miles - when the crash occurred.\nThe families of Macias and Rivero announced last month that they plan to file negligence and personal injury lawsuits against the estate of Fernandez, each seeking $2 million. They are represented by Christopher Royer, an attorney with the law firm of Krupnick Campbell, who declined to answer questions from The Associated Press.\nThe In his four-year career, Fernandez was 38-17 with a 2.58 ERA and had 589 strikeouts. He was a two-time All-Star and the 2013 National League Rookie of the Year.\n\"No matter what the report concluded, nothing will ever diminish Jose's everlasting positive connection with Miami and the Miami Marlins,\" Marlins President David Samson said in an email. \"Nor can it lessen the love and passion he felt for his family, friends, teammates and all his fans in South Florida and around the world.\"\n___\nAssociated Press writer Curt Anderson from Miami contributed to this report.\n___\nThis story corrects spelling of name of Fernandez's mother to Maritza.","url":"https://www.dailymail.co.uk/wires/ap/article-4320918/Fernandez-likely-operating-boat-deadly-crash.html"}
