{"authors":["Press Association"],"date_download":"2018-10-23 02:47:12","date_modify":"2018-10-23 02:47:12","date_publish":"2017-03-10 12:02:07","description":"The former world champion's team and engine suppliers Honda have been plagued by problems which showed no signs of getting any better at the Circuit de Catalunya.","filename":"data/vaneerConsumption/FernandoAlonsosuffersdoublebreakdowninBarcelona.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22F33D00000578-0-image-a-20_1489151424323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_formulaone_article-4301024_Fernando-Alonso-suffers-double-breakdown-Barcelona_1540262832.html","title":"Fernando Alonso suffers double breakdown in Barcelona","title_page":"Fernando Alonso suffers double breakdown in Barcelona | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"McLaren's woeful pre-season continued on the final day of the Barcelona test as Fernando Alonso's MCL32 twice ground to a halt at the Circuit de Catalunya.\nThe former world champion's team and engine suppliers Honda have been plagued by problems which showed no signs of getting any better, with the first race of the season in Australia just over two weeks away.\nAlonso's car stopped twice on the track on Friday's morning session to add to the two red flags on Thursday as the team were again robbed of valuable track time ahead of the Melbourne race.\nMcLaren mechanics bring the car of driver Fernando Alonso back to the pit lane in Barcelona\nAlonso endured another frustrating morning on Friday with no signs of things getting better\nThe former world champion's MCL32 twice ground to a halt at the Circuit de Catalunya\nThe first stoppage came just over halfway into the morning session, with Alonso's car eventually taking its now customary place on the back of the recovery truck after a short break.\nBut when Alonso returned to the track with a little over an hour of the session left it stopped again almost straight away.\nThe double world champion had blamed McLaren's woes on engine supplier Honda earlier in the week, and the last thing he needed was to lose more track time after completing just 15 laps on Friday.\nThere was better news for Red Bull's Jos Verstappen, who had set his team's best time of pre-season so far when Alonso's second breakdown occurred. At that point the Dutchman had Friday's fastest lap of one minute 19.491 seconds to put it in contention with Ferrari and Mercedes.\nSebastian Vettel has set the best time this week after his 1:19.024 achieved on Thursday\nValtteri Bottas was second quickest on the final day of testing at the Circuit de Catalunya\nSebastian Vettel still had the best time of 1:19.024 set on Thursday but with Mercedes' Lewis Hamilton due out on track in the afternoon that could come under threat.\nHamilton's team-mate Valtteri Bottas was second quickest on Friday with 1:19.845 when Alonso's car caused a red flag for the second time.\nRenault's Nico Hulkenburg was consistently quick to post the third best time, making up a little for the lack of time caused by reliability problems earlier in the test when Jolyon Palmer was on duty.\nAlonso was not the only driver who caused a break in on-track action. Sebastien Grosjean's trip into the gravel in the Haas VF-17 at turn five, after appearing to lose control of the rear end of his car, saw the red flag waved for the first time.","url":"https://www.dailymail.co.uk/sport/formulaone/article-4301024/Fernando-Alonso-suffers-double-breakdown-Barcelona.html"}
