{"authors":["Matthew Debord"],"date_download":"2018-10-30 21:28:21","date_modify":"2018-10-30 21:28:21","date_publish":"2016-12-20 00:00:00","description":"Ferrari kindly let us borrow a $360,000 488 GTB for a few days. We adored the car. Here are its best features.","filename":"data/vaneerConsumption/Ferrari488GTBCoolfeatures.json","image_url":"https://amp.businessinsider.com/images/57363e7852bcd063018c2f3d-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ferrari-488-gtb-review-2016-12_1540934901.html","title":"Ferrari 488 GTB: Cool features","title_page":"    Ferrari 488 GTB: Cool features - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Such beauty as hurts to behold. Hollis Johnson\nFerrari builds three types of cars: sports cars, Grand Touring or \"GT\" cars, and of course rare and exotic hypercars, such as the current LaFerrari, which sells for more than a million bucks.\nOf these three, without question the most important for Ferrari's reputation are the sports cars. The only things more important are Ferrari's Formula One race cars, but they are squarely beasts of the track. The road cars define the critical fantasies that animate the brand, that evoke its deep history, and that provoke sane people to part with hundreds of thousands of dollars for the privilege of being what Ferrari calls a \"client.\"\nAnd among the road cars, the sports cars rule.\nBut while Ferrari calls them sports cars, nobody else does. We call them supercars, for good reason.\nUntil 2015, Ferrari could claim that its core supercar, the 458 Italia, was indeed the finest car ever made by human hands.\n\"What a machine!\" enthused former \"Top Gear\" host Jeremy Clarkson when he hooned a 458 around the track.\nThe late, great 458\nThe 458 was the peak achievement of Ferrari's commitment, decades old, to the mid-engine, naturally aspirated V8 sports cars. It began, effectively, with the 308 in the mid-1970s (the \"Magnum, P.I.\" Ferrari) and extended to the 458 in the second decade of the 21st century.\nAnd it was served on a rosso corsa platter that the Ferrari lover craves beyond sexiness and speed: sound. The flat-crank V8 produced and otherworldly scream at its redline, like a wild thing torn from a wild place and barely domesticated behind the driver's head. The sound was the sound of fear and pleasure and raw life raised to type of brutal art. The sort of thing that Ferrari does so, so well.\nThe 458 was also gorgeous, sleek, and fine-boned but intensely purposeful. I've had my eardrums blown out by them at pit stops on racetracks, and I have still always, always been in love with those lines. You have your drive-for-your-life cars and your die-behind-the-wheel cars, and, given a choice, I would perish dashingly and with a smile in a 458.\nEnter the 488 GTB (it stands for \"Gran Turismo Berlinetta\") and the dawn of a new age in Maranello, Ferrari's home in Italy. It was necessary. A 570-horsepower V8 that sucks in air and uses that process of transforming gasoline into velocity is a politically unpalatable dinosaur, so the 458 had to be retired.\nAnd so Ferrari replaced it with a 661-horsepower turbocharged V8.\nFerrari hasn't done turbos in this type of car since the 1980s with the F40, so there was concern, possibly even overt panic, among the Ferraristi.\nYou might be wondering how the Great Shift is going. Well, Ferrari kindly let us borrow a $360,000 488 GTB for a few days. We adored the car — it was a runner-up in fact for our 2016 Business Insider Car of the Year.\nHere are its coolest features.\nPhotos by Hollis Johnson, unless otherwise credited.","url":"https://www.businessinsider.com/ferrari-488-gtb-review-2016-12"}
