{"authors":["Associated Press"],"date_download":"2018-10-23 03:08:36","date_modify":"2018-10-23 03:08:36","date_publish":"2017-03-10 12:34:29","description":"MONTMELO, Spain (AP) - While Ferrari soars into the new Formula One season with high hopes of challenging Mercedes' three-year dominance of the series,...","filename":"data/vaneerConsumption/FerrarifliesMcLarenlimpstowardnewF1season.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/18/wire-197383-1489169353-25_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301128_Ferrari-flies-McLaren-limps-new-F1-season_1540264116.html","title":"Ferrari flies, McLaren limps toward new F1 season","title_page":"Ferrari flies, McLaren limps toward new F1 season | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MONTMELO, Spain (AP) - While Ferrari soars into the new Formula One season with high hopes of challenging Mercedes' three-year dominance of the series, McLaren is barely able to get its car rolling.\nThe two teams concluded eight days of preseason testing on Friday with completely contrasting prospects.\nKimi Raikkonen set the best time of the preseason, pushing his Ferrari below teammate Sebastian Vettel's leading mark from the day before by almost four-tenths of a second.\nFerrari driver Kimi Raikkonen of Finland sits in his car as mechanics push it back to the team box during a Formula One pre-season testing session at the Catalunya racetrack in Montmelo, outside Barcelona, Spain, Friday, March 10, 2017. (AP Photo/Francisco Seco)\nRaikkonen spun his car on turn 13 in the afternoon, causing a red flag to flutter. He went back out later and finished with 111 laps.\nMercedes split the day between drivers Lewis Hamilton and Valtteri Bottas, who clocked the fourth- and fifth-best times behind Carlos Sainz of Toro Rosso.\nBut, as Vettel said on Thursday, it was possible Mercedes was holding something back and may prove to be notably quicker at the season-opening Australian Grand Prix in two weeks.\nTimes by the most race-ready teams have steadily dropped through the preseason, setting new track records since the Circuit Barcelona-Catalunya layout was changed a decade ago. That was expected after F1 issued a major rulebook overhaul this winter to make wider, and thus faster, cars.\nOne team yet to benefit from the new designs was McLaren.\nThe former F1 heavyweight had a woeful final day after Fernando Alonso's car twice sputtered to a stop.\nMcLaren has endured repeated problems with its Honda engine throughout the tests, and back-to-back stoppages during the session when teams want to be priming their cars for the race in Melbourne is alarming.\nAlonso's troubled car was already at the bottom of the timesheets when it ground to a halt after 16 laps. After being hauled back on a flatbed to the garage, the former champion ventured out again, only to provoke a second red flag when his car stopped after only two more laps.\nThe Spaniard returned to the track after McLaren said via Twitter that it repaired \"another electrical issue,\" and managed to inch up to the 11th best time of the 13 drivers, on a total of just 43 laps over eight hours of testing.\nAlonso and new teammate Stoffel Vandoorne have suffered stoppages and a demoralizing lack of speed throughout the preseason. Alonso, considered one of F1's most talented drivers, said this week his car has \"no reliability and no power.\"\nMcLaren said it would not speak to the media on Friday because of \"logistical reasons.\"\nHonda, McLaren's engine maker, summed the tests in a tweet as, \"it's been a challenge.\"\nAs for the middling outfits, Williams' 18-year-old rookie, Lance Stroll, and Sainz crammed in a day's high 132 laps. Sergio Perez was next with 128 in his Force India.\nRed Bull driver Max Verstappen had the second fastest time on Friday. But that was eight-tenths of a second off Raikkonen's pace, indicating that Red Bull seems a step behind Ferrari and Mercedes heading into the season.\nMercedes driver Valtteri Bottas of Finland leaves the team box during a Formula One pre-season testing session at the Catalunya racetrack in Montmelo, outside Barcelona, Spain, Friday, March 10, 2017. (AP Photo/Francisco Seco)\nMercedes driver Valtteri Bottas of Finland steers his car during a Formula One pre-season testing session at the Catalunya racetrack in Montmelo, outside Barcelona, Spain, Friday, March 10, 2017. (AP Photo/Manu Fernandez)","url":"https://www.dailymail.co.uk/wires/ap/article-4301128/Ferrari-flies-McLaren-limps-new-F1-season.html"}
