{"authors":[],"date_download":"2018-10-23 05:53:28","date_modify":"2018-10-23 05:53:28","date_publish":"2017-03-10 15:28:40","description":"Ferrari went faster than ever on the final morning of Formula One's pre-season testing on Friday, with Kimi Raikkonen breaking through the one minute 19 seconds barrier at the Circuit de Catalunya","filename":"data/vaneerConsumption/FerraridriverKimiRaikkonenfastestinF1testingsofar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E21F14400000578-0-image-a-109_1489159600297.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_formulaone_article-4301602_Ferrari-driver-Kimi-Raikkonen-fastest-F1-testing-far_1540274008.html","title":"Ferrari driver Kimi Raikkonen fastest in F1 testing so far","title_page":"Ferrari driver Kimi Raikkonen fastest in F1 testing so far | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ferrari went faster than ever on the final morning of Formula One's pre-season testing on Friday, with Kimi Raikkonen breaking through the one minute 19 seconds barrier at the Circuit de Catalunya, while McLaren stayed slow.\nThe Finn's best effort of 1:18.634 seconds, on supersoft tyres, was a circuit record and 0.804 seconds quicker than Red Bull's Dutch teenager Max Verstappen on the same tyre compound in 1:19.438.\nRaikkonen's team mate and four times world champion Sebastian Vettel had been fastest on Thursday in 1:19.024.\nFerrari went faster than ever on the final morning of Formula One's pre-season testing\nKimi Raikkonen, pictured with his son, broke the one minute 19 seconds barrier\nThe Finn's effort of 1:18.634 was quicker than Sebastian Vettel's 10-year record on Thursday\nBefore that, Mercedes had set the pace with Finland's Valtteri Bottas lapping in 1:19.310 on Wednesday. Triple champion team mate Lewis Hamilton was due to wrap up the test on Friday afternoon.\nThe early signs from testing, which can be deceptive, are that champions Mercedes, Ferrari and Red Bull remain on a different level to the rest but that last season's gaps have closed at the top. The season starts in Australia on March 26.\n'Between the top three and the other ones it is between one second and 1.5 seconds, I think,' said Haas team principal Gunther Steiner.\n'There is no surprise that Mercedes and Ferrari and Red Bull came out better than everybody else. They have more resources to do more testing and that is what it is.'\nMax Verstappen drives his Red Bull covered in sensor equipment around the Barcelona track\nDutch teenager Verstappen was second fastest on Friday morning with 1:19.438\nFernando Alonso had another tough session, as his troubled McLaren team said the double world champion had experienced the same intermittent electrical shutdown that hampered rookie team mate Stoffel Vandoorne on Thursday.\n'Various electrical components in the power unit and chassis were changed overnight, and the team are making further changes to eliminate variables and identify the source of the problem,' said a spokesperson.\nAlonso was bottom of the timesheets, by more than a second, 4.1 seconds off Raikkonen's pace and with only 19 laps to his credit at lunchtime.","url":"https://www.dailymail.co.uk/sport/formulaone/article-4301602/Ferrari-driver-Kimi-Raikkonen-fastest-F1-testing-far.html"}
