{"authors":["Ashleigh Davis For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 22:44:05","date_modify":"2018-10-22 22:44:05","date_publish":"2017-03-16 04:24:50","description":"Festival goers at Falls Festival in Victoria in 2016 have filed a class action lawsuit for negligence against the organisers, after 19 people were hopsitalised and 80 injured during a stampede.","filename":"data/vaneerConsumption/FestivalgoerstosueFallsFestivalforstampedeinjuries.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E507A5900000578-0-image-a-21_1489633372192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318572_Festival-goers-sue-Falls-Festival-stampede-injuries_1540248245.html","title":"Festival goers to sue Falls Festival for stampede injuries","title_page":"Festival goers to sue Falls Festival for stampede injuries | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The statement of claim was filed this week by Maddens Lawyers in Warrnambool\nA group of up to 65 festival goers who were injured in a stampede at the 2016 Falls Festival have filed a class action lawsuit against the event organisers.\nMaddens Lawyers in Warrnambool filed the statement of claim in the Victorian Supreme Court this week, alleging the organiser's negligence led to an 'avoidable' and 'terrifying' accident, Triple J's Hack reported.\nNineteen people were taken to hospital with broken bones and other serious injuries when up to 80 people were hurt as a stampede broke out between acts at the Falls Music and Arts Festival at Lorne on December 30.\nA group of up to 65 festival goers who were injured in a stampede at the 2016 Falls Festival have filed a class action lawsuit against the event organisers for negligence\nUp to 80 people were injured in a human stampede at the festival on December 30, 2016. The lead plaintiff in the lawsuit is 21-year-old Michela Burke (pictured) who suffered nerve damage in her left arm\nPunters leaving the Grand Theatre Tent after watching a set from Australian rock band DMA's were caught up in a human stampede.\nMany were on their way to see a set by UK band London Grammar when a reported 'bottleneck' of people trying to leave via the exits took place.\nThe claim alleges Ash Sounds Pty Ltd, trading as The Falls Music and Arts Festival, restricted the exit from the theatre, causing the crush.\nThe claim says timetabling caused a rush of people to leave, and an adequate risk assessment was not done.\nMs Burke (pictured) told Triple J's Hack she blacked out in the stampede and only remembers sitting on the grass afterwards, being unable to move her arm. She is still on pain medication and receiving medical treatment for her arm three months later\nAt the time, organisers blamed the incident on a 'confluence of events' and said an investigation would be done and released.\nAccording to Brendan Pendergast, from Maddens Lawyers, about 65 festival attendees have joined the class action.\nMr Pendergast said: 'Everyone we've spoken to reports being absolutely terrified.'\n'I think many people are thinking they could've potentially lost their lives.'\nPeople paid anywhere from $249 to $468 plus booking fees to go to the four-day camping festival.\nMaddens Lawyers in Warrnambool filed the statement of claim in the Victorian Supreme Court this week, alleging the organiser's negligence led to an 'avoidable' and 'terrifying' accident\nMr Prendergast says when people hand over that amount of money, they expect to be in a safe environment.\nThe lead plaintiff in the class action is 21-year-old Michela Burke who suffered nerve damage to her left arm when she was caught up in the stampede.\nShe is still on pain medication and receiving medical treatment for her arm three months later.\nMs Burke told Hack she blacked out after being caught in the crush and the next thing she remembers was sitting on the grass with her left arm limp beside her.\nOne of the injured festival-goers Maddy (pictured) who is not part of the class action, suffered severe bruising around her eyes and was left on crutches, unable to work in her retail job\nMichaela was due to fly to Canada days after the festival to attend a university exchange to Montreal, which she also had to cancel.\nAnother festivalgoer Maddy, who is not part of the class action, suffered severe bruising around her eyes and is still unable to work in her retail job as she requires crutches to get around.\nTim Hunt, 29, also suffered possible broken bones in the terrifying melee and was left with deep wounds to his right knee and both ankles, facing weeks in a wheelchair.\nFalls Festival co-producer Jessica Ducrou released a statement on the festival Facebook page soon after the event, apologising and promising a full debrief and investigation.\nMaddy (pictured) said when the stampede happened: 'I was screaming until I couldn't anymore because the air was crushed out of my lungs... I couldn't move any limbs'\nOn Thursday, co-producer Ms Ducrou said in a statement the festival was co-operating with a WorkSafe investigation.\n'We have had regular contact with affected patrons since the incident and are providing ongoing assistance,' she said.\n'However, given the matter is as of today the subject of legal proceedings, we are not in a position to comment further.'\nMs Ducrou confirmed Falls Festival will 'definitely be going ahead in 2017'.\nA spokesperson from Worksafe Victoria confirmed to Daily Mail Australia investigations into the incident were ongoing, but it was inappropriate to comment in the wake of the legal proceedings.\nOn Thursday, Falls Festival co-producer Jessica Ducrou said the festival was co-operating with a WorkSafe investigation but due to legal proceedings was not able to comment any further. She confirmed the festival will be going ahead in 2017","url":"https://www.dailymail.co.uk/news/article-4318572/Festival-goers-sue-Falls-Festival-stampede-injuries.html"}
