{"authors":[],"date_download":"2018-10-23 03:32:18","date_modify":"2018-10-23 03:32:18","date_publish":"2016-01-11 16:21:31","description":"Americans raced to buy lottery tickets Monday in the hope of snagging the largest jackpot in US history, a staggering $1.3 billion after back-to-back draws f...","filename":"data/vaneerConsumption/Feverbuildsforrecord13billionUSjackpot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-701l6-48qEJGFphM8d437f0aaf926df596-895_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394185_Fever-builds-record-1-3-billion-US-jackpot_1540265538.html","title":"Fever builds for record $1.3 billion US jackpot","title_page":"Fever builds for record $1.3 billion US jackpot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fever builds for record $1.3 billion US jackpot\nAmericans raced to buy lottery tickets Monday in the hope of snagging the largest jackpot in US history, a staggering $1.3 billion after back-to-back draws failed to net an overall winner.\nSaturday's winning numbers in the Powerball were 32-16-19-57-34 and 13, but while 25 people matched the first five numbers -- winning $1 million -- no one claimed the $950 million jackpot, rolling it over to a $1.3 billion.\nIn Midtown Manhattan, Shailesh Patel, 40, has done a roaring trade in ticket sales and expects a deluge of extra customers before the next draw on Wednesday night.\nThe winner of the Powerball can choose to be paid the full jackpot in annual installments over 29 years -- or take a lower one-off payment in cash ©Saul Loeb (AFP/File)\n\"People spend money like $10, $20, some people $50. It depends,\" he tells AFP as customers bustle in and out of his bodega to sign up for their lucky numbers -- few content with buying just one ticket.\nThe excitement drove Patel to splurge $10 on the Powerball last week and he says he'll play again this week.\n\"I need to buy a little house, I'd spend a little on my family,\" he says.\nThe Multi-State Lottery Association that organizes the game sought to drive up sales by releasing statistics on the most common Powerball numbers, the most overdue numbers and those drawn the least.\nThe three most overdue numbers? One, three and 35, the lottery tweeted.\nThe draw, which takes place each Wednesday and Saturday at 10:59 pm (0359 GMT), selects five white balls from a drum containing 69 balls, and one red one from a drum with 26.\nTo win the jackpot, a ticket holder has to match all the numbers on the six balls selected. The winner can choose to be paid the full jackpot in annual installments over 29 years -- or take a lower one-off payment in cash.\nThe cash payment for a single jackpot winner on Wednesday would rise to $806 million before taxes, according to the Powerball site.\nTonya Smith, 45, who is studying for her high school diploma after dropping out as a teenager to raise her siblings, is dreaming big.\n- Hoping and praying -\n\"It's enormous, it's unprecedented. Wow. It's huge, it's huge. It makes a player that doesn't play, play,\" the Brooklynite told AFP.\nShe's splashing $10 on tickets for Wednesday's draw and says she is urging all her friends and family to take part.\n\"I'm just hoping and praying like everybody else,\" she says.\nShe wants to donate part of her winnings to charity, take care of her family and travel the world -- Australia, Hawaii, Miami, Barbados and Dubai are on her bucket list.\nShe's scared of flying but jokes that winning the jackpot might help overcome her phobia. \"I'm willing to be more adventurous,\" she laughs.\nThe previous US jackpot record of $656 million, in March 30, 2012, was scooped by three winners from North Carolina, Puerto Rico and Texas.\nGloria Mackenzie, 84, from Florida holds the record for winning the largest single Powerball jackpot, $590.5 million, on May 18, 2013.\nFrankie Melendez, who works for a copying and scan center in Manhattan, says he started buying Powerball tickets when the jackpot passed $500 million last week.\n\"It's crazy,\" he says. \"I'll probably get a card, which is $10.\"\nHe also plans to take care of his family -- his six brothers and sisters -- and his grandmother and grandfather who are still alive.\n\"Oh man listen, my whole family's going to get money,\" he said. \"If I win, I'll share it! Not all of it! But I'll share half of it at least!\"\nPowerball is played in 44 states, the District of Columbia, Puerto Rico and the US Virgin Islands.","url":"https://www.dailymail.co.uk/wires/afp/article-3394185/Fever-builds-record-1-3-billion-US-jackpot.html"}
