{"authors":["Associated Press"],"date_download":"2018-10-23 00:43:42","date_modify":"2018-10-23 00:43:42","date_publish":"2016-01-28 14:48:23","description":"WASHINGTON (AP) — The number of people seeking unemployment benefits fell last week, a sign that employers aren't cutting jobs in response to global economic...","filename":"data/vaneerConsumption/FewerpeopleseekUSjoblessaidsignofstablejobmarket.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:ac27174620ab4214baa18f74ded8aa5f-2vdWmEltwXfba0ce28e6329ae2f6-557_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421005_Applications-US-jobless-aid-fall-278-000_1540255422.html","title":"Fewer people seek US jobless aid, sign of stable job market","title_page":"Fewer people seek US jobless aid, sign of stable job market | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fewer people seek US jobless aid, sign of stable job market\nWASHINGTON (AP) — The number of people seeking unemployment benefits fell last week, a sign that employers aren't cutting jobs in response to global economic weakness and sharp stock market drops.\nTHE NUMBERS: Weekly applications for unemployment benefits fell 16,000 to a seasonally adjusted 278,000. The four-week average, a less volatile measure, dropped 2,250 to 283,000.\nThe number of Americans receiving aid rose 49,000 to 2.27 million. That's still 4.5 percent lower than a year ago.\nIn this Wednesday, Jan. 27, 2016, photo, Nicole Kelly, left, interviews Angelo Falcone, 32, for a bartender job at a job fair held by The Genuine Hospitality Group, in Miami. The restaurant group is expanding in South Florida and is hiring for all positions at its restaurants. On Thursday, Jan. 28, the Labor Department reports on the number of people who applied for unemployment benefits a week earlier. (AP Photo/Lynne Sladky)\nTHE TAKEAWAY: Applications are a proxy for layoffs, and the decline suggests that businesses remain confident enough in future economic growth to hold onto their staffs. Any figure below 300,000 is historically low.\nApplications had reached a six-month high in the previous week, which had sparked some concerns among economists that layoffs might be rising. But the data is also typically volatile in January, when many temporary retail employees are laid off.\nThe government adjusts the figures to reflect those seasonal trends, but isn't always able to do so perfectly.\nKEY DRIVERS: The economy likely slowed in the final three months of last year, weighed down by weaker exports and a cutback in stockpiling by businesses.\nOn Wednesday, the Federal Reserve noted the weaker data and indicated it might slow its pace of interest rate increases this year.\nThe dollar has soared in value in the past year, which makes U.S. goods more expensive overseas, cutting into exports and hurting corporate profits. Lower oil prices have also caused drilling companies to reduce orders for factory goods.\nOrders for long-lasting manufactured products plunged 5.1 percent in December, the fourth decline in the past five months, the Commerce Department said Thursday.\nStill, there are signs that Americans are still willing to spend. Consumer confidence rose in January, the Conference Board said earlier this week. And sales of new homes jumped in December.","url":"https://www.dailymail.co.uk/wires/ap/article-3421005/Applications-US-jobless-aid-fall-278-000.html"}
