{"authors":[],"date_download":"2018-10-22 21:32:27","date_modify":"2018-10-22 21:32:27","date_publish":"2014-05-07 17:16:34","description":"Budget cuts are forcing the Internal Revenue Service to audit fewer people, likely costing the government $3 billion in lost revenue.","filename":"data/vaneerConsumption/FewerIRSTaxAuditsCouldCostUS3Billion.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_11/245911/140312-irs-jms-0037_10d07a5cf80d22431c2ec9acd489d796.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_taxes_fewer-irs-tax-audits-could-cost-u-s-3-billion-n99471_1540243947.html","title":"Fewer IRS Tax Audits Could Cost U.S. $3 Billion","title_page":"Fewer IRS Tax Audits Could Cost U.S. $3 Billion","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe federal government could lose almost $3 billion in revenue during the current fiscal year because budget cuts are forcing the tax-collecting Internal Revenue Service to audit fewer people, the agency's chief said Wednesday.\nTestifying before a congressional panel, IRS Commissioner John Koskinen said the IRS will audit 100,000 fewer individuals this year as part of congressionally mandated cuts to the tax agency's budget. Audits of high-wealth individuals, businesses and partnerships will also decline, he said.\n\"This fiscal year, the IRS's key enforcement programs will operate well below historical levels,\" said Koskinen, who was speaking before a House of Representatives subcommittee about the tax season that ended April 15.\n\"We estimate that the government will lose almost $3 billion in revenues as a result,\" Koskinen said.\nCongress in January cut the IRS's budget by $526 million, or 4 percent, to $11.9 billion for the current fiscal year.\nIn 2013, total IRS audits fell by 5 percent from 2012 to reach the lowest level since 2008.\n\"Our ongoing funding shortfall has major, negative implications for taxpayers and the tax system,\" said Koskinen, a Democrat appointed by President Barack Obama last year.\nKoskinen rejected the idea of hiring private-sector debt collectors to help tax enforcement, saying the IRS's use of these debt collectors in 2006 proved to be inefficient.\n\"We ended up losing money,\" as the IRS had to make sure taxpayers were not being abused by debt collectors, Koskinen said. He said the IRS would be better off with more funding to hire its own revenue agents.\n-Reuters","url":"https://www.nbcnews.com/business/taxes/fewer-irs-tax-audits-could-cost-u-s-3-billion-n99471"}
