{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:59:22","date_modify":"2018-10-30 17:59:22","date_publish":"2015-07-22 13:05:26","description":"Police are swarming Scottish airports to protect girls during peak “cutting season,” otherwise known as female genital mutilation (FGM).","filename":"data/vaneerConsumption/FGMSeasonScottishAirportsonAlertforGirlsBeingTakenOutofUK.json","image_url":"https://media.breitbart.com/media/2015/07/Glasgow-Prestwick-Airport-Scotland-getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_22__1540922362.html","title":"FGM Season: Scottish Airports on Alert for Girls Being Taken Out of UK","title_page":"FGM Season: Scottish Airports on Alert for Girls Being Taken Out of UK | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Police are swarming Scottish airports to protect females during the peak of “cutting season,” otherwise known as female genital mutilation (FGM). The airports provide direct flights to countries where the practice still occurs.\nFGM is illegal in Scotland, but it does not stop families from transporting their unsuspecting daughters to other countries. These family members “choose the summer holidays to give girls time to ‘heal’ before they return to school.”\nAt the airport, officers hand out leaflets to inform all travelers about FGM, the laws in Scotland, and helplines for anyone who underwent the brutal act. Detective Chief Superintendent Lesley Boal, head of Public Protection, released this statement:\nFGM is one of the severest forms of child abuse. It will not be tolerated in Scotland. We are taking direct action at airports across Scotland to remind people that this is an offence, that they can still change their minds and that support is available should they need it. School holidays are an opportune time to remind people flying to countries where this practice takes place. Girls and young women can be taken abroad and return with no-one the wiser about what they may have suffered. We would remind people that FGM is a very serious crime. It is also a crime to take a girl out of the country to undergo FGM. We will take action against anyone who facilitates FGM. We will continue to work with partners in non-governmental organisations and in local communities to prevent this abuse. If anyone is worried that this might be why they are travelling abroad or someone they know is being taken abroad, then please contact Police Scotland on 101 or one of our partner agencies. We can help and we will do everything we can to put a stop to this abhorrent practice. If you are in the UK and think that you are at immediate risk, please contact the police by dialling [sic] 999.\nOrganizations who fight the practice welcomed news of Scotland’s program. Fatou Baldeh underwent FGM when she was only seven years old in Gambia. Now she works with the Dignity Alert Research Forum, which attempts “to stop the practice and support other women who have undergone the procedure.” Baldeh applauds the police’s actions at the airports, but says more needs to be done, especially in schools. She wants to train “teachers to spot vulnerable girls” and provide support for families who originate in countries that partake in FGM.\n“Most girls at risk may not be aware they are in danger as they are tricked into believing they are going to meet family members and are having parties held for them,” she explained. “Those who have already suffered the horrific procedure are too scared to speak up as they fear being judged. We need professionals around these girls to be well-equipped to spot the signs of victims and those at risk.”\nIn 2014, Scotland Yard’s FGM unit dispatched officers to all United Kingdom airports in the summer “to warn parents about taking their children abroad to undergo female genital mutiliation [sic].” They also handed out the leaflets and reminded passengers that FGM is against the law in the UK. Officials arrested a woman in February at Heathrow when she attempted to bring an eight-year-old girl to Ghana.","url":"https://www.breitbart.com/national-security/2015/07/22/fgm-season-scottish-airports-on-alert-for-girls-being-taken-out-of-uk/"}
