{"authors":["Will Martin"],"date_download":"2018-10-31 00:10:40","date_modify":"2018-10-31 00:10:40","date_publish":"2018-07-12 00:00:00","description":"\"The owners should invest in car models that guarantee the future of thousands of people rather than enriching only one,\" a statement from the striking USB union said.","filename":"data/vaneerConsumption/FiatworkerstostrikeoverCristianoRonaldosJuventustransfer.json","image_url":"https://amp.businessinsider.com/images/5b2a29351ae6621f008b45a2-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fiat-worker-strike-over-juventus-cristiano-ronaldo-transfer-2018-7_1540944640.html","title":"Fiat workers to strike over Cristiano Ronaldo's Juventus transfer","title_page":"    Fiat workers to strike over Cristiano Ronaldo's Juventus transfer - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Cristiano Ronaldo. Reuters\nAngry workers at Italian automaker Fiat are set to go on strike to protest soccer club Juventus' signing of star forward Cristiano Ronaldo for around €112 million ($130 million).\nJuventus' owners, the Agnelli family, also controls about 30% of Fiat Chrysler through a holding company. Workers are angry because they believe the huge sum spent on Ronaldo would have been better spent investing in Fiat.\nThe USB Union, which is leading the strike, said that the Agnellis would have been better served helping the lives of workers, \"rather than enriching only one.\"\n\"It is unacceptable that while the (owners) ask workers of FCA... for huge economic sacrifices for years, the same decide to spend hundreds of millions of euros for the purchase of a player,\" a statement from the union said.\n\"The owners should invest in car models that guarantee the future of thousands of people rather than enriching only one,\" it added.\nThe strike will take place at the Melfi plant, a city around 100 miles from Naples. The plant manufactures two Fiat models, the Punto and the 500X, according to the BBC.\nThe strike will begin at 10 p.m. on Sunday and continue until 6 p.m. the following Tuesday.\nRonaldo moved from Real Madrid to Juventus this week. The deal could be worth €300 million ($349 million) when wages are included.\nRonaldo was Real Madrid's top all-time goal scorer, with 451 goals since moving there in 2009. He has won five Ballons d'Or — the most prestigious individual trophy in world soccer — and is arguably the greatest player in the history of the sport.\nHis move caused Juventus' stock price to rise by almost 40% when the news broke. Ronaldo is a huge asset both on the field and off it. Merchandise sales for shirts featuring his name are likely to be worth millions.","url":"https://www.businessinsider.com/fiat-worker-strike-over-juventus-cristiano-ronaldo-transfer-2018-7"}
