{"authors":["Associated Press"],"date_download":"2018-10-23 02:11:31","date_modify":"2018-10-23 02:11:31","date_publish":"2017-04-26 13:10:48","description":"MILAN (AP) - Carmaker Fiat Chrysler Automobiles reported Wednesday that its first-quarter earnings rose by more than a third mainly due to an improved...","filename":"data/vaneerConsumption/FiatChryslerprofitupmorethanathirdasEuropeimproves.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465639-1493215556-834_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447538_Fiat-Chrysler-quarterly-earnings-third_1540260691.html","title":"Fiat Chrysler profit up more than a third as Europe improves","title_page":"Fiat Chrysler profit up more than a third as Europe improves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MILAN (AP) - Carmaker Fiat Chrysler Automobiles reported Wednesday that its first-quarter earnings rose by more than a third mainly due to an improved performance in Europe and by its luxury Maserati brand.\nThe Italian-American carmaker made a net profit of 641 million euros ($700 million) in the first three months of 2017, up 34 percent from 478 million euros in the same period last year.\nThe carmaker, formed from the 2014 merger of Fiat and Chrysler, confirmed its 2017 targets, including net profit of 3 billion euros on revenues of 115 billion-120 billion euros. Shares in the company rose 4 percent to 10.09 euros in Milan trading.\nFILE - This Tuesday, May 6, 2014, file photo shows a sign outside Fiat Chrysler Automobiles world headquarters in Auburn Hills, Mich. Fiat Chrysler and Google said Tuesday, April 25, 2017, for the first time will offer rides to the public in the self-driving automobiles they are building under an expanding partnership. (AP Photo/Carlos Osorio, File)\nFiat Chrysler said adjusted earnings before interest and taxes rose by 85 percent to 178 million euros in Europe, with the Fiat Tipo family and the Alfa Romeo Giulia and Stelvio driving higher shipments, and by 75 percent to 21 million euros in Asia due to a joint venture in China.\nIn North America, adjusted earnings were flat at 1.24 billion euros. Margins improved as shipments dropped 6 percent to 609,000 vehicles due to lower fleet volumes and product changeovers, including the transition to the new Jeep Compass.\nLatin America swung to a 20-million euro loss due to inflation driving up product costs and negative foreign exchange effects.\nThe new Maserati Levante helped boost the luxury marquee's earnings by more than 500 percent to 107 million euros.","url":"https://www.dailymail.co.uk/wires/ap/article-4447538/Fiat-Chrysler-quarterly-earnings-third.html"}
