{"authors":["Rohan Banerjee For Mailonline"],"date_download":"2018-10-23 05:00:29","date_modify":"2018-10-23 05:00:29","date_publish":"2016-01-11 18:14:36","description":"FIFA have announced their FIFPro World XI,with all three nominees of the individual Ballon d'Or award making the line-up. Cristiano Ronaldo joins Lionel Messi and Neymar up front.","filename":"data/vaneerConsumption/FIFATeamoftheYearFIFProWorldXIincludesRonaldoMessiNeymarandPogba.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300D7C7100000578-0-image-a-44_1452535467998.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394308_FIFA-Team-Year-FIFPro-World-XI-includes-Cristiano-Ronaldo-Lionel-Messi-Neymar-Juventus-star-Paul-Pogba_1540270829.html","title":"FIFA Team of the Year: FIFPro World XI includes Ronaldo, Messi, Neymar and Pogba","title_page":"FIFA Team of the Year: FIFPro World XI includes Ronaldo, Messi, Neymar and Pogba | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Marcelo, Thiago Silva, Sergio Ramos and Dani Alves are in defence\nAndres Iniesta, Paul Pogba and Luka Modric are in midfield\nBALLON D'OR 2015 WINNERS: Ballon d'Or: Lionel Messi (Barcelona) Men's Coach of the Year: Luis Enrique (Barcelona) Women's Coach of the Year: Jill Ellis (USA) Puskas Award: Wendell Lira (Vila Nova) Women's Player of the Year: Carli Lloyd (USA)\nFIFA have announced their FIFPro World XI for 2015, with all three nominees of the individual Ballon d'Or award making the line-up in attack.\nReal Madrid's Cristiano Ronaldo is joined by Barcelona pair Lionel Messi and Neymar up front, while Andres Iniesta (Barcelona), Luka Modric (Real Madrid) and Paul Pogba (Juventus) occupy the midfield spots in a 4-3-3 formation.\nBayern Munich goalkeeper Manuel Neuer has been selected between the posts with Marcelo (Real Madrid), Thiago Silva (PSG), Sergio Ramos (Real Madrid) and Dani Alves (Barcelona) in defence.\nL-R: Thiago Silva, Luka Modric Marcelo, Paul Pogba, Sergio Ramos, Neymar, Dani Alves, Lionel Messi, Andres Iniesta and Cristiano Ronaldo pose after being selected in FIFA's FIFPro World XI for 2015\nEx-Barcelona striker Samuel Eto'o (left) presents Marcelo with his award for making the Team of the Year\nEto'o, now playing for Antalyaspor, hands Thiago Silva his award after making the FIFPro World XI\nL-R: Neymar, Alves, Messi, Iniesta and Ronaldo are all smiles as they make FIFA's Team of the Year for 2015\nBayern Munich goalkeeper Manuel Neuer tunes into the Ballon d'Or ceremony live on TV from his home\nLEAGUE BREAKDOWN: La Liga 8 Bundesliga 1 Ligue 1 1 Serie A 1\nThe Premier League was the only of Europe's top five divisions not to have a representative in the team.\nSpain's La Liga led the way by a considerable distance with eight players, while Germany's Bundesliga, France's Ligue 1 and Italy's Serie A each had one.\nNATIONALITY BREAKDOWN: Germany 1 Spain 2 Argentina 1 Brazil 4 Portugal 1 Croatia 1 France 1\nBrazil internationals Neymar, Alves, Silva and Marcelo were the dominant nationality, while Spaniards Ramos and Iniesta signaled the next most common in the team.\nNeuer (Germany), Ronaldo (Portugal), Modric (Croatia) and Pogba (France) were each the only player from their home country.\nBarcelona, who enjoyed phenomenal success in 2015, winning five trophies including the Champions League, had four players out of the 11.\nMadrid, despite not winning any honours last year, also took four places.\nHere are the stars voted in to make up the FIFA/@FIFPro World XIhttps://t.co/XA2rmWKNGF pic.twitter.com/ZXC6NsYVVp — FIFA.com (@FIFAcom) January 11, 2016\nBarca midfielder Iniesta poses for photos with fans on his way into the Ballon d'Or Gala on Monday night\nBrazil captain Neymar poses for a selfie with fans at the Kongresshaus ahead of FIFA's awards ceremony\nReal Madrid's Ronaldo and Barcelona's Messi are widely regarded as two of the best footballers in the world\nAs well as making the Team of the Year, Messi also won the individual Ballon d'Or award for the fifth time\nJuventus midfielder Pogba, wearing a flashy ensemble, gives two thumbs up at the Ballon d'Or gala","url":"https://www.dailymail.co.uk/sport/football/article-3394308/FIFA-Team-Year-FIFPro-World-XI-includes-Cristiano-Ronaldo-Lionel-Messi-Neymar-Juventus-star-Paul-Pogba.html"}
