{"authors":["Associated Press"],"date_download":"2018-10-23 00:43:38","date_modify":"2018-10-23 00:43:38","date_publish":"2016-01-28 14:48:12","description":"GENEVA (AP) — Gianni Infantino is having the best week of any FIFA presidential candidate for public pledges of support to succeed Sepp Blatter, and got Sout...","filename":"data/vaneerConsumption/FIFAcandidateInfantinobackedby10SouthAmericanvoters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:489a6b09d29641ffbc59f989e6b5cd35-4vVdYopwYQ7f641721b07ae44546-432_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420988_FIFA-candidate-Infantino-backed-10-South-American-voters_1540255418.html","title":"FIFA candidate Infantino backed by 10 South American voters","title_page":"FIFA candidate Infantino backed by 10 South American voters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FIFA candidate Infantino backed by 10 South American voters\nGENEVA (AP) — Gianni Infantino is having the best week of any FIFA presidential candidate for public pledges of support to succeed Sepp Blatter, and got South America on his side on Thursday.\nThe 10-nation body known as CONMEBOL said in a statement that its executive committee agreed to give the UEFA general secretary unanimous support in the Feb. 26 election.\nOn Monday, Infantino was backed by the seven federations from Central America, and Trinidad and Tobago also endorsed him on Thursday despite mistakenly referring in its video message to \"Giovanni\" Infantino.\nAntonio Carlos Nunes, recently elected vice-president of the Brazilian Football Confederation, left, and Gianni Infantino, general secretary of UEFA, attend an extraordinary session of Conmebol, the South American football federation, in Luque, Paraguay, Tuesday, Jan. 26, 2016. Representatives elected Paraguayan Alejandro Dominguez as their new president, replacing Angel Napout. (AP Photo/Cesar Olmedo)\nInfantino can count on a big majority of the 53 members in Europe — already giving him more than 70 of the 209 FIFA votes if public promises hold up in the polling booths in Zurich.\nA two-thirds majority of eligible voters is required to win in the first round, and a simple majority will clinch the presidency in subsequent rounds.\nThe strategy of Africa's 54 voting federations should be clearer after the Confederation of African Football has an executive committee meeting on Feb. 5 in Rwanda.\nCAF signed a working agreement this month with the Asian Football Confederation, whose president, Sheikh Salman of Bahrain, appears to be the other leading contender in the five-candidate FIFA race.\nThe other candidates are former FIFA vice president Prince Ali of Jordan, former FIFA official Jerome Champagne of France, and South African businessman Tokyo Sexwale.\nCONMEBOL's endorsement came two days after it elected a new president, Alejandro Dominguez of Paraguay.\nDominguez succeeded another Paraguayan, Juan Angel Napout, who was arrested in Switzerland last month and extradited to the United States to face racketeering charges in the FIFA bribery case.\nNapout previously pledged CONMEBOL's support to UEFA President Michel Platini before both were suspended by FIFA.","url":"https://www.dailymail.co.uk/wires/ap/article-3420988/FIFA-candidate-Infantino-backed-10-South-American-voters.html"}
