{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:09:59","date_modify":"2018-10-30 23:09:59","date_publish":"2014-08-13 22:40:30","description":"Come Valentine's Day 2015, Fifty Shades Of Grey is pretty much guaranteed to do huge business. The book beat Harry Potter as the fastest-selling paperback of all time, after all, and the trailer for the film adaptation's not doing so shabby. Which…","filename":"data/vaneerConsumption/FiftyShadesOfGreyTrailerWithKittensistheMashuptheInternetisBeggingForVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4d25c154-0adf-4d10-9ce9-b1912659a501.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35695-fifty-shades-of-grey-trailer-with-kittens-is-the-mashup-the-internet-is-begging-for_1540940999.html","title":"'Fifty Shades Of Grey' Trailer With Kittens is the Mashup the Internet is Begging For - VIDEO","title_page":"'Fifty Shades Of Grey' Trailer With Kittens is the Mashup the Internet is Begging For — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Come Valentine's Day 2015, Fifty Shades Of Grey is pretty much guaranteed to do huge business. The book beat Harry Potter as the fastest-selling paperback of all time, after all, and the trailer for the film adaptation's not doing so shabby. Which is why it's not at all surprising that someone chose to reenact the Fifty Shades of Grey trailer with kittens.\nCats rule the Internet, of course — often alongside Benedict Cumberbatch — so really, as a populace we should just expect every big movie or TV show or zeitgeisty item to be parodied with cats eventually. Baby cats if you're feeling ambitious. Because Jamie Dornan's Fifty Shades performance may be \"Oscar-worthy,\" but is he a kitten? I think not.\nThat's right: Jamie Dornan may have the real abs of a human man. He may even be rather furry at times. but kittens have something he can never compete with: They can rock the cut-out suits and the cut-out abs with a surrealism he will likely never grasp.\nAnd so, dear readers, enjoy this kitten recreation of the Fifty Shades Of Grey trailer. It just seems like it's something the Internet was built for. Embrace it.\nThe Pet Collective on YouTube\nImage: The Pet Collective/Youtube","url":"https://www.bustle.com/articles/35695-fifty-shades-of-grey-trailer-with-kittens-is-the-mashup-the-internet-is-begging-for"}
