{"authors":[],"date_download":"2018-10-30 01:00:45","date_modify":"2018-10-30 01:00:45","date_publish":"2018-08-07 00:05:39","description":null,"filename":"data/vaneerConsumption/FightingViolentExtremismbyTeachingTolerance.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/TinaRamirezHardwired.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861245.html","title":"Fighting Violent Extremism by Teaching Tolerance","title_page":"Fighting Violent Extremism by Teaching ToleranceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Although terrorism understandably has become the focus of U.S. foreign policy, the problem of religious intolerance and violence is far broader. As Islamic extremism has erupted throughout the Middle East, most dramatically in Iraq and Syria, Christians, Yazidis, and other religious minorities are being driven from their historic homes.\nWhat to do? U.S. “public diplomacy” has been ineffective, essentially attempting to put lipstick on a pig in terms of selling American foreign policy. Washington has spent millions on foreign aid to promote education and provide social services for supposedly at-risk Islamic youth, without any evident impact on violent behavior.\nAmerica’s military response has turned into endless war, which appears to create as many terrorists as are captured or killed. Indeed, America’s multiple interventions and wars have both spawned violent extremists and created chaos in which they thrive. The Islamic State, the fount of so much horror, was merely the most notable beneficiary of misguided U.S. war-making.\nHowever, the fact that there is no simple, quick answer doesn’t mean there is nothing to do. Education can work, but of a unique kind. The group Hardwired, run by Tina Ramirez, a former Capitol Hill staffer, engages in what it calls “rights-based education,” which has had notable if small-scale success in building support for religious tolerance and liberty.\nI witnessed the group’s approach at a conference held in Erbil, Kurdistan. Hardwired brought together people of varying, even contentious faiths and backgrounds — most of whom had suffered persecution at the hands of Islamic radicals. Although divided in beliefs, they came to recognize their shared interest in respecting the rights of others.\nHardwired also has targeted children, efforts detailed in a new study by Lena Smith, Tina Ramirez, and Mary Anne Rea-Ramirez, “Protecting Children from Violent Extremism.” The report reviewed Hardwired’s efforts in Iraq, Lebanon, and Morocco, in which the group taught 56 teachers and 1161 students at 46 different schools. The overall assessment: “students demonstrated greater acceptance of the rights of others, greater respect for the equal rights of women and minority communities, were less intimidated by public expression of belief, and reflected greater resiliency to extremist thinking.”\nAs almost everyone recognizes, kids are the most important target for purveyors of violence. Explained the group, “The threat of intolerance, extremism, and radical ideology is evident everywhere, and children throughout the Middle East and North Africa are particularly vulnerable to its influence.”\nThe problem is not just that children are exploring their way, gaining new experiences, and coming under new influences. With conflict and oppression widespread throughout much of the Islamic world, Muslim kids are particularly vulnerable. Thus, one of the principle fronts for defending against persecution and terrorism is at the school level. However, most teachers, no matter how well-intentioned, are ill-prepared for such a battle.\nHardwired noted some of the shortcomings of existing efforts. For instance, in Iraq, organizations working on educational reform “did not take into account the key misunderstandings about each community that may need to be addressed for people at different beliefs to better understand different religious communities.” Proposals to address “problematic religious texts and teachings” also ran into problems: “given the sensitive nature of religious teachings and religious authority, reforms focused on the removal of certain texts have not been well received by members of society—from both majority and minority religious communities.”\nInto this breach stepped Hardwired. It explained: “To make children resilient to radicalization and reduce the likelihood that they will repeat the violent extremism they have witnessed or experienced, we must change the way they see and treat others.” This takes intensive effort.\nBut it is Hardwired’s specialty. At the seminar I attended, Tina helped lead the diverse attendees who worked together on various exercises. That generated strong personal bonds and practical experience in working with those of radically different backgrounds and beliefs. Out of that came an appreciation for working together to ensure respect for the lives, dignity, and faiths of others.\nHardwired took a similar approach with schoolchildren and their teachers. Explained the group, “Nearly 1,200 children from three countries were taught to value the dignity and freedom of others through simple lessons that used analogies to encourage them to have tough conversations about their beliefs, misconceptions and fear of others.” Much of the effort was directed at kids who had suffered horrific persecution.\nFor instance, Hardwired sought to help them deal with their fears, including “misconceptions of people who may have attacked them or other communities different from their own.” Even more important, though, “for the first time, these severely traumatized children learned that they were valued, regardless of what they believed, and deserved to be treated with respect and dignity.” Doing so is necessary for them to move on with their own lives, as well as improve their communities and reduce threats to others.\nThe group provided several courses, with simple, understandable themes. For instance, “The Peaceful Garden: A Lesson in Valuing the Rights of Others,” builds a lesson around children going to a garden. Another is “Sanctuary Island: A Lesson in the Importance of Religion or Belief in Human Life,” which forces students to consider how to maintain peace among different groups on an island.\nNotably, the program does not attempt to challenge or change religious teachings. Rather, it emphasizes the need to respect others’ lives and dignity. And the objective is not to transform people’s culture or religion, but to change the way people think. That is, “to help individuals develop new ways of understanding their religion and culture compared to the rights of people of different religions and beliefs.”\nReaching teachers is an important aspect of Hardwired’s efforts. Explained the recent report, “the objective of Hardwired’s educational program is to provide teachers with tools to build a more peaceful and inclusive society by leading youth toward a greater respect for the dignity and freedom of people of different religions or beliefs, while at the same time helping teachers promote a positive counter-narrative to the ideas that inspire intolerance and violent extremism.” The idea is to empower kids to not just tolerate, but defend, those with different beliefs.\nThe organization’s efforts in this case were just the start. On their own, teachers were able to continue and even expand the program. Moreover, noted Hardwired, educators “are eager to replicate and expand the program and train other teachers in their communities.” Governments have sought Hardwired’s aid to reach more teachers, and other nations have approached the group about bringing its courses to them.\nThe program is just a start, a pilot, but could become a model for much broader use. Most important: the program’s results warrant expansion.\nHardwired’s new report details how “educating children to value the rights and freedoms of people of different religions and beliefs can influence positive, sustainable changes in their communities. Importantly, children consistently exhibited positive movement in their perspective of and behavior toward others that made them more inclusive of others.”\nExplained the group, children became:\n• More resilient to the ideas of hate and intolerance that fuel extremism,\n• More likely to mitigate conflict through dialogue and understanding,\n• More likely to defend and actively engage people of different religions and beliefs,\n• More supportive of the role of religion in the public and private life of individuals,\n• More likely to support women, girls, and minority groups from discrimination, and\n• More empathetic of others, particularly those who were different from them.\nIt’s an impressive list. Yet it understates the potential for personal change and growth. In Erbil I watched Christians, Yazidis, Sunni and Shia Muslims, and even a Jew, who had lost a hand in a terrorist bombing, work together. Obviously, the problems of persecution and terrorism are huge and reflect broader ideological, political, and spiritual trends. Nevertheless, personal transformation offers the only sure, long-term answer to build a more tolerant, less violent world.\nDoug Bandow is a Senior Fellow at the Cato Institute. A former Special Assistant to President Ronald Reagan, he is author of Beyond Good Intentions: A Biblical View of Politics.","url":"https://spectator.org/fighting-violent-extremism-by-teaching-tolerance/"}
