{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:19:11","date_modify":"2018-10-30 20:19:11","date_publish":"2015-03-05 18:34:24","description":"Michael Bloomberg-funded gun control groups Everytown for Gun Safety and Moms Demand Action for Gun Sense in America are currently running a television ad against Campus Carry which says, \"Backpacks and bullets don't mix.\"","filename":"data/vaneerConsumption/FightCampusAssaultWithBackpacksNotGuns.json","image_url":"https://media.breitbart.com/media/2015/03/Moms-Demand-Action-John-Minchillo—AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_05__1540930751.html","title":"Fight Campus Assault With Backpacks, Not Guns","title_page":"Everytown: Fight Campus Assault With Backpacks, Not Guns","title_rss":"NULL","source_domain":"breitbart.com","text":"Michael Bloomberg-funded gun control groups Everytown for Gun Safety and Moms Demand Action for Gun Sense in America are currently running a television ad against Campus Carry which says, “Backpacks and bullets don’t mix.”\nThe ad is part of their larger push to derail GOP efforts to pass Campus Carry so college women can be armed to fight off sexual assault on campuses in Florida.\nAccording to the Bradenton Herald, Everytown and Moms Demand Action are adamantly opposed to HB 4005/SB 176, which is sponsored by representative Greg Steube (R-Sarasota). The legislation would allow women with concealed carry permits to be armed for self-defense on campus.\nThe measure has already made it through one senate panel and is moving on down the legislative pike.\nSteube is also sponsoring legislation that will allow Florida teachers “and other school employees to carry concealed weapons on public school campuses.” The goal is to prevent a Sandy Hook-like attack from being successfully carried out in the state of Florida.\nEverytown and Moms Demand Action also oppose the push to arm public school teachers against a Sandy Hook-like attack.\nMoms Demand Action’s Chryl Anderson explained: “Our teachers entered the esteemed profession of education to teach, not to become sharpshooters.”\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/03/05/everytown-fight-campus-sexual-assault-with-backpacks-not-guns/"}
