{"authors":[],"date_download":"2018-10-22 23:42:31","date_modify":"2018-10-22 23:42:31","date_publish":"2017-03-16 07:48:13","description":"Top Asian fighter Angela Lee said Thursday she is prepared to headline a \"new era\" for women's mixed martial arts in the region, and looked forward to a...","filename":"data/vaneerConsumption/FightingLeewantstoleadneweraforwomen.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-227143-1489650495-623_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319140_Fighting-Lee-wants-lead-new-era-women_1540251751.html","title":"Fighting Lee wants to lead 'new era' for women","title_page":"Fighting Lee wants to lead 'new era' for women | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Singaporean mixed martial art fighter Angela Lee is one of the sport's most exciting prospects\nTop Asian fighter Angela Lee said Thursday she is prepared to headline a \"new era\" for women's mixed martial arts in the region, and looked forward to a possible fight in China.\nLee, 20, who is of Singaporean and Korean descent, is one of the sport's most exciting prospects and has gained a huge following since becoming the world's youngest MMA champion last year.\n\"I'm really excited to be paving the way for women's MMA in Asia,\" said Lee, who fights under One Championship, the organisation which has spearheaded the growth of the sport in Asia.\nSingaporean mixed martial art fighter Angela Lee hopes to fight in China, raising the sports profile in an untapped market\n\"Now women's MMA is kind of like the new big thing. It's really great because you're seeing a lot of highly skilled athletes now,\" she added.\n\"Before, women's MMA was kind of just pushed to the side, not really a big deal. I think that this is just the beginning of a huge new era.\"\nLee was speaking to AFP at the gym in Singapore where she trains. She had just returned from Bangkok, where she successfuly defended her ONE Championship atomweight world title via a technical knockout of Taiwan's Jenny Huang.\nLee, who divides her time between Singapore and Hawaii, said that in North America, the sport has already taken off but has still room for growth in Asia.\n\"I'm very excited to see all the growth that is to come,\" she said.\nAs the sport also gains popularity in China, Lee said she is open to fighting there.\n\"China is a huge untapped market. I haven't fought in China, it's some place that I do want to go to,\" she said.\n\"I think the more female fights with fighters from all around Asia, it's definitely going to help grow the sport in countries like China, where it is usually not so popular for women to be fighting.\"\nSingapore-based One Championship has 24 events scheduled for 2017.\nLast month, the world's biggest mixed martial arts organisation, the Las Vegas-based Ultimate Fighting Championship, announced its return to Asia with a Singapore show and a desire to debut in China.\n\"I did everything that I wanted to do in that fight,\" said Lee, referring to her fight against the previously unbeaten Huang.\n\"I'm really happy that all the hard work paid off.\"\nLee, who holds a 7-0 record, will launch the second defence of her title in Singapore on May 26 when she faces the also undefeated Istela Nunes of Brazil.\nDespite the quick turnaround, Lee said she will be ready for the clash against Nunes who she described as a \"very tough fighter\".\n\"When I started fighting, I was fighting back-to-back, non-stop, so it feels good actually to get the ball rolling again and go straight into the next fight.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4319140/Fighting-Lee-wants-lead-new-era-women.html"}
