{"authors":[],"date_download":"2018-10-30 14:34:50","date_modify":"2018-10-30 14:34:50","date_publish":"2018-08-01 04:00:00","description":"Late summer is a great time to savor fresh figs while you can","filename":"data/vaneerConsumption/FigPreservesPistachioandFigTartFigJam.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/01/Images/newsEngin.22438953_080218figs_06.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_re_9667b6c17d0be44ffbb1bcca91885c0f__1540910090.html","title":"Fig Preserves, Pistachio and Fig Tart, Fig Jam","title_page":"Recipes: Fig Preserves, Pistachio and Fig Tart, Fig Jam","title_rss":"NULL","source_domain":"ajc.com","text":"On my parents’ property in Clarkston, there used to be an enormous, rambling fig tree. It sprouted up as a “volunteer” (the word my mother uses for things that aren’t planted, but somehow arrive anyway) beside our barn, and grew huge until just a few years ago, when it finally gave out of figs and died.\n>> RELATED: Where to eat in Clarkston\nOne of my favorite things to do in late summer was to pick its figs. I could climb the tree, usually with my mother standing below, and shake the ripe figs free for her to catch. It was rare to emerge from the maze of its furry leaves without being eaten alive by mosquitoes.\nMy itchy bites were a small price to pay, because we would always make fig preserves with our bounty. I still make preserves, even though I miss the tree climbing. I put them up until Christmas, when I give them away as gifts. I leave my figs whole, or cut them in half depending on the size, and simply cook them with sugar until they are soft. I usually leave the stem intact. It’s a simple method my grandmother used that has never failed me.\nSince I grew up with figs, they were never exotic to me. It wasn’t until I lived away from the South that I realized not everyone picked figs and made them into preserves. When I lived in New England, for instance, my friends found figs mysterious. Strange, since they are one of our oldest cultivars, originating from a wild tree from Western Asia and the Middle East.\nTo make them even more exotic, wild figs, or Caprifigs, actually have to rely on a special wasp (the fig wasp, Blastophaga grossorum) for fertilization, since the male and female flowers can’t fertilize each other. “Common Figs” that didn’t need “caprification” from the fig wasp began to spread across warmer climates as far back as the Roman Empire, eventually making their way to the Americas, where they have had great success, from Brown Turkey, to Mission, Kadota and Celeste, and finally, the kind my old tree bore, Calimyrnas (or Smyrna).\nThere are plenty of spots to grab figs as they come into season in early August, and these plump little treats are perfect for pairing with something sweet or savory, as well as using as an ingredient or component in recipes. And while dried figs are a common and easy way to try them, fresh figs are so special.\nGet them fast, though. “Figs come in fast, ripen all at once, and the next thing you know, they’re gone,” writes chef Steven Satterfield of Atlanta’s Miller Union, in his book, “Root to Leaf” (Harper Wave, 2015).\n“Most farmers markets in Atlanta should have great local figs towards the end of the summer, late July through August,” says chef Victoria Shore of Recess in Krog Street Market. “I normally go to the Freedom Farmers Market.”\n>> RELATED: Where to find 2018 farmers markets around metro Atlanta\nSince figs don’t ripen once they’ve been picked, it’s important to choose fruit wisely. “I look for figs that are soft, but don’t have any bruising or wet spots (kind of like peaches),” explains Shore. “I don’t like to wash them, as that tends to bruise ripe figs, but give them a quick rinse in a colander, and be careful not to put too many in at a time. Old egg cartons are a great way to store figs, especially when traveling with them.”\nLocal grocery stores such as Publix and Kroger will begin to have accessible varieties of figs such as Brown Turkey and Mission on their shelves by early August. For other varieties, it’s best to find a farmer, farmers market or a tree to climb.\n“The best source for figs is the one nearest you at the time when they are in peak season,” says Benedetto Varuni, head pizzaiolo at Varuni Napoli. “For us, late summer is the best time when they are plump and juicy. We often use dried figs because we make the Fichissima Pizza during off-season.”\nFresh figs, like a lot of life’s pleasures, are fleeting, and shouldn’t be squandered. They’re versatile in salads, made into jams and preserves or wrapped with prosciutto. I’ve seen sheer joy cross my mother’s face from eating one out of hand, standing at the kitchen sink. Enjoy them while they last.\nRecipes\nFig Preserves\nMy family has been making some form of these easy preserves for 100 years. Place the preserves into sterilized jars and process in a hot water bath for 10 minutes for shelf stability, or place in jars and store in the fridge. We always eat them on hot buttered biscuits.\n<","url":"https://www.ajc.com/lifestyles/food--cooking/recipes-help-you-savor-fresh-figs-while-you-can/Zwdjngry3o9cLTBCoV1LFJ/"}
