{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 04:22:07","date_modify":"2018-10-23 04:22:07","date_publish":"2017-04-26 16:05:37","description":"A crowd gathered to film the sunlight slanting through clouds in Manizales, in the Colombian region of Caldas, where 17 people were killed by landslides caused by heavy rain.","filename":"data/vaneerConsumption/FigureofJesusappearsaboveColombiancity.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0494400000578-0-image-a-60_1493217919835.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448162_The-moment-figure-Jesus-appears-Colombian-city_1540268527.html","title":"'Figure of Jesus' appears above Colombian city","title_page":"'Figure of Jesus' appears above Colombian city | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An astonishing photograph has emerged showing what locals believe is the figure of Jesus appearing over a Colombian city ravaged by a landslide.\nA crowd gathered to film the sunlight slanting through clouds in Manizales, in the north central Colombian region of Caldas, where 17 people were killed by landslides when a month's rainfall fell overnight last week.\nThe rare cloud phenomenon was recorded on a mountain called Sancancio and the glowing figure provided comfort to the residents who lost homes, loved ones and possessions in the natural disaster.\nAn unusual light in the sky which locals believed to be Jesus looking over Manizales, Columbia\nA woman identified as Marya de Iesus recorded what was described as a religious experience and shared it online, where many said it was a sign of Jesus of Nazareth.\nShe wrote with a video: 'Jesus Christ was visiting our Colombian town, he calmed down the sky and was listened to.\n'God blesses us and glory to Lord and Universe King.'\nOn the video seen by MailOnline, a man can be heard in the background saying: 'Oh, my God, my blessed God, come here to see the misery.\n'Look at this, look at this, blessing God. Glory to the Lord.\n'Do you see the Lord there, standing up?'\nAt least 17 people were killed and seven are missing after a landslide sent mud and rocks crashing into several neighborhoods in Manizales, Colombia, the government said on Wednesday, the second deadly landslide in the country this month.\nThe unusual light in the sky was witnessed by residents a week after the natural disaster\nRecent heavy rains have endangered residents in dozens of provincial towns, where makeshift construction on the slopes of the Andes mountains makes neighborhoods particularly susceptible to avalanches and flooding.\nThe landslide in Manizales, capital of coffee-growing Caldas province west of Bogota, followed a similar disaster in Mocoa, Putumayo earlier this month that killed more than 320 people and displaced thousands from their homes.\n'We are helping to find the disappeared and unfortunately the number will rise,' President Juan Manuel Santos said of the death toll after arriving in Manizales.\nAt least 57 houses have been affected, the government said.\nLocal media reported that Manizales received a month's average rainfall just overnight.\nRescuers from the Red Cross, civil defense, firefighters and armed forces are searching for the disappeared in the mud and debris of destroyed buildings.\nRunning water, electricity and gas services have been suspended in the areas affected by the landslides.\nThose reacting to the video online had mixed opinions on what was being seen.\nSandra Mejia said: 'In this moment of pain, people want to believe it is a divine item that gives them hope and strength to keep on living and fighting.\nBut others suggested a more straightforward theory could explain the beamed figure.\nNoe Bazan said a shaft of sunlight breaking through the clouds was the reason people saw Jesus.\n'This is a natural phenomenon with the light of the sun through different types of cloud,' he said.\n'It happens in all parts of the world.'","url":"https://www.dailymail.co.uk/news/article-4448162/The-moment-figure-Jesus-appears-Colombian-city.html"}
