{"authors":["Press Association"],"date_download":"2018-10-22 22:40:21","date_modify":"2018-10-22 22:40:21","date_publish":"2016-01-11 03:32:56","description":"The number of alleged crimes potentially involving people's use of dating apps Tinder and Grindr increased more than sevenfold in two years - including repor...","filename":"data/vaneerConsumption/Figuresrevealdangersofusinghookupdatingapps.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-d91b21ba-d1f3-4033-881b-a43cce730744-56CX32zFKLb7123928b84c9b931b-279_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393327_Figures-reveal-dangers-using-hook-dating-apps_1540248021.html","title":"Figures reveal dangers of using 'hook-up' dating apps","title_page":"Figures reveal dangers of using 'hook-up' dating apps | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Figures reveal dangers of using 'hook-up' dating apps\nThe number of alleged crimes potentially involving people's use of dating apps Tinder and Grindr increased more than sevenfold in two years - including reports of rape, grooming and attempted murder.\nExperts said the findings were \"shocking\" and urged the authorities to launch a campaign to raise awareness of the dangers of meeting strangers on so-called hook-up sites.\nThey said users were vulnerable to \"sextortion\" and warned the figures may be \"just the tip of the iceberg\" as many victims will be too scared or embarrassed to contact police.\nDating hook-up sites pose risks as well as rewards for users\nJust 55 reports of crimes in England and Wales mentioned Grindr or Tinder in 2013, according to figures released to the Press Association under the Freedom of Information Act.\nThis jumped to 204 in 2014 and 412 in the year to October 2015, according to the 30 police forces who gave figures.\nThere were 277 crime reports in which Tinder was mentioned in 2015 - up from 21 in 2013. And 135 alleged crimes in which Grindr was mentioned were recorded in 2015, up from 34 reported in 2013.\nTinder is used predominately by heterosexual daters while Grindr is a gay dating app.\nReports of violent and sexual crimes were the most common, with 253 allegations of violence against the person and 152 reports of sex offences, including grooming, rapes and the sexual exploitation of children.\nThe figures come from police reports where the apps are mentioned in the crime report and does not automatically mean the app was used directly by the criminal.\nBut there have been documented cases in which they were.\nAnd the National Police Chiefs' Council's lead on violence and public protection, Deputy Chief Constable of Merseyside Police Andy Cooke, said: \"The rising popularity of online dating apps and websites has contributed to an increase in the number of recorded crimes. We strongly encourage users to report offences and seek support if they become a victim of any type of crime.\n\"I would urge those who use online dating apps to be as security conscious as possible and not to share personal data with anyone until they are sure about those they are communicating with.\n\"Similarly, individuals should stop all communication with anyone who attempts to pressurise them into something they are not comfortable with.\"\nAndy Phippen, professor of social responsibility in IT at Plymouth University, said it was a \"growing problem, particularly around sextortion-type activities\".\nHe said: \"If we are going to base the formation of a relationship on a photo and a few lines of text, how do we know that person is who they say they are and they have the right intentions?\n\"It is something we tell kids about - don't trust who people say they are online - but the adult population go merrily about their way thinking it is a good way of hooking up.\n\"And there will be people who are using these apps to coerce and groom children, sadly.\"\nLast August, Daniel Edwards and his partner Kristofer Wagner, from Gloucester, were jailed for blackmail after threatening to expose a married man they met on Grindr.\nAnd former teacher Gary Pearce, from Sidcup in Kent, was jailed for five years last September for grooming a 14-year-old boy he met on Grindr.\nIn September 2014 the Garda in Ireland said officers in Dublin had arrested a man on suspicion of raping a woman he met through Tinder.\nBritain's largest force, the Metropolitan Police, recorded the highest number of alleged crimes potentially linked to the apps - 202 in which Tinder was mentioned in 2015 and 91 in which Grindr was mentioned.\nGay and human rights campaigner Peter Tatchell said: \"The steep rises in sexual and violent offences are a worrying trend that seems likely to continue.\n\"Closeted gay and bisexual men who use Grindr may be especially vulnerable to targeting because criminals know they will be less likely to report crimes to the police. I suspect these figures are just the tip of the iceberg.\"\nAn NSPCC spokesman warned that some children are being groomed online.\nH e said: \"Dating apps are, by their very nature, not safe online spaces for children. It's all too easy for children to say they are older, or for an adult to pretend to be younger.\"\nA spokesman for Stonewall said the figures are \"shocking\" and Victim Support said people using the apps should tell a friend where they are going before meeting anyone.\nThe figures come from police reports where Tinder and Grindr has been used in the description of an allegation. This can refer to cases where they were allegedly used to commit a crime, where the victim and suspect met on the app, or where the app was mentioned but was not directly related to the crime - for example when a victim happened to be on Tinder when the crime was committed.\nThe forces which provided figures did not give a breakdown of the different situations.","url":"https://www.dailymail.co.uk/wires/pa/article-3393327/Figures-reveal-dangers-using-hook-dating-apps.html"}
