{"authors":["Associated Press"],"date_download":"2018-10-22 22:18:08","date_modify":"2018-10-22 22:18:08","date_publish":"2016-01-28 10:18:48","description":"Emperor Akihito is making the first visit by a Japanese emperor since World War II to the Philippines, which suffered under Japan's harsh military occupation...","filename":"data/vaneerConsumption/Filipinostalkabout1stvisitbyJapaneseemperorsincewar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:53891c4601ae4e00830c20e02507aff8-2vdWmEltwXfba0ce28e63271a3d3-54_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420596_Filipinos-talk-1st-visit-Japanese-emperor-war_1540246688.html","title":"Filipinos talk about 1st visit by Japanese emperor since war","title_page":"Filipinos talk about 1st visit by Japanese emperor since war | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Filipinos talk about 1st visit by Japanese emperor since war\nEmperor Akihito is making the first visit by a Japanese emperor since World War II to the Philippines, which suffered under Japan's harsh military occupation during the war but now relies on Tokyo as an ally, trading partner and source of aid and investment.\nAkihito was apprehensive when he first visited the Philippines as crown prince in 1962, fearing anti-Japanese feelings were still strong, but his anxiety vanished in the smiles of the Philippine president and Filipinos who welcomed him, according to the emperor's press secretary, Hatsuhisa Takashima.\nA selection of Filipinos' views on Akihito's visit:\nStudents line up the route with Japanese and Philippine flags to welcome visiting Japan's Emperor Akihito and Empress Michiko for another function at Fort Santiago Thursday, Jan. 28, 2016 in Manila, Philippines. The 82-year-old Akihito is paying his respects at memorials for both the Philippine and the Japanese war dead during a five-day state visit.(AP Photo/Bullit Marquez)\n___\n\"I think if the Japanese are offering an apology for what they did, it is better to be friends because we can no longer bring back the past. I am happy about what the emperor said because they have accepted their mistake, but maybe they should help the remaining victims of the war to ease their pain.\" — Joel Abedo, 51, security guard.\n___\n\"I feel very happy because they both looked very kind and it is always an honor to see royalty from other countries visiting the Philippines.\" — Bea Roque, 19, student.\n___\n\"(After) what they did to my sister ... I thought, what is the biggest revenge I can do to the Japanese? Rape as many women as I can. ... I realize now that all that hate was wrong and I asked for forgiveness ... therefore, I welcome very much the visit of Emperor, his majesty, Akihito.\" — Miguel Perez-Rubio, 90, World War II survivor.\n___\n\"We were initially happy that he visited because our only hope is with him, that he will give attention to the 'comfort women' ... but nothing. ... He gave attention to the war dead but he has not even given attention to what his soldiers did (to us) during the war.\" — Hilaria Bustamante, 89, who was forced to work as a sex slave, or \"comfort woman,\" for Japanese troops during the war.\n___\n\"The sentiments (about the war) are still there but enough time I think has passed — 70 years. Most of the wounds have been healed, most of the victims have passed away, although there are still several around. The younger generation looks at Japan in a different light ... in terms of Japanese cars, Japanese cameras, electronics, manga, anime. So the youth's perception of Japan is very different from the elder generation's perception.\" — Ricardo Jose, 58, historian.\n___\n\"My eldest brother was killed by the Japanese military because he was suspected as an American spy. My second brother was killed by Filipino guerrillas for being a mestizo (Filipino of Japanese descent). My younger brother, sister and my mother were killed by American shelling. Only two of us in the family survived. There should never be any war again. ... I welcome the emperor because he is on a peace mission.\" — Carlos Teraoka, 85, Filipino whose father was Japanese.\n___\n\"In meeting your majesties, I am held in awe, recognizing the burdens you have borne as you have had to live with the weight of the decisions made by others during the dark episodes in the history of our nations. It is, however, upon this history that we have built a far more enduring relationship.\" — Benigno Aquino III, 55, Philippine president.\nVisiting Japan's Emperor Akihito and Empress Michiko wave to well-wishers as his motorcade passes by a university at Fort Santiago Thursday, Jan. 28, 2016 in Manila, Philippines. The 82-year-old Akihito is paying his respects at memorials for both the Philippine and the Japanese war dead during a five-day state visit.(AP Photo/Bullit Marquez)","url":"https://www.dailymail.co.uk/wires/ap/article-3420596/Filipinos-talk-1st-visit-Japanese-emperor-war.html"}
