{"authors":["Jennifer Brett"],"date_download":"2018-10-30 18:58:56","date_modify":"2018-10-30 18:58:56","date_publish":"2015-03-18 06:50:16","description":"Here's a story the Georgia Department of Economic Development will eye with interest.","filename":"data/vaneerConsumption/Filmmakerchargedwithtaxcreditfraud.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_filmmaker-charged-with-tax-credit-fraud__1540925936.html","title":"Filmmaker charged with tax-credit fraud","title_page":"Filmmaker charged with tax-credit fraud","title_rss":"NULL","source_domain":"ajc.com","text":"Here's a story the Georgia Department of Economic Development will eye with interest. From the Baton Rouge, La. Advocate:\nGeorge Kostuch , 43, who owned and ran K2 Pictures, is accused of writing checks for more than $500,000 in false expenses, which led to his company receiving $161,850 in tax credits from the state during a period of several months between 2010 and 2011, U.S. Attorney Walt Green said in a news release.\"\nMovie sets like this one are regular sites in Georgia now. (That's Reese Witherspoon in the brown jacket, filming a scene for \"The Good Lie.\") Photo: Atlanta Filming\nGeorgia's growing film industry \"generated an economic impact of $5.1 billion during Fiscal Year 2014,\" Gov. Nathan Deal said in a Georgia Department of Economic Development news release. \"The 158 feature film and television productions that shot in Georgia spent $1.4 billion during that time.\"\nCould Louisiana's film tax fraud woes send business to Georgia? We'll see. It seems clear that North Carolina's dithering over its film tax-credit policies sent the second, third and fourth movies in the \"Hunger Games\" series our way. After the original movie was filmed there, \"Catching Fire\" and \"Mockingly\" parts 1 and 2 came to Georgia - among the many projects fleeing North Carolina after its legislature rescinded tax credits.\n\"The head of the state film office said Tuesday that no new movies are in production or currently planned anywhere in the state,\" Raleigh, N.C. station WRAL reported in January.\nNo such moves seem likely in Georgia, as officials routinely tout the industry as one that puts people to work and bolsters communities across the state.\n“Not only has this industry created jobs and investment opportunities for Georgians, it also has revitalized communities, established new educational programs, tourism product and more,” Gov. Deal said. “I will continue my commitment to growing this industry and to developing a film-ready workforce to meet the needs of the productions that are setting up shop in Georgia.”","url":"https://www.ajc.com/blog/buzz/filmmaker-charged-with-tax-credit-fraud/G5VivR3dPSLwNtUczVnDfI/"}
