{"authors":["Melia Robinson"],"date_download":"2018-10-30 23:38:45","date_modify":"2018-10-30 23:38:45","date_publish":"2016-12-06 00:00:00","description":"Peter Barsoom left the financial industry to create a better marijuana chocolate.","filename":"data/vaneerConsumption/FinancierleftWallStreettostartamarijuanachocolatecompany.json","image_url":"https://amp.businessinsider.com/images/5845ce38ba6eb606688b695f-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_peter-barsoom-wall-street-weed-2016-12_1540942725.html","title":"Financier left Wall Street to start a marijuana-chocolate company","title_page":"    Financier left Wall Street to start a marijuana-chocolate company - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Peter Barsoom. Courtesy of 1906 Peter Barsoom made his way up and down Wall Street over the last 19 years in his job overseeing consumer banking. His résumé includes turns at Merrill Lynch, American Express, and Morgan Stanley.\nMore recently, Barsoom added cannabis connoisseur to the list.\nIn 2014, the former financier saw a business opportunity in the Denver area, where marijuana-infused foods were increasing in popularity — in spite of usability issues. His startup, 1906, brings together scientists, chocolatiers, and cannabis experts to create a premium line of low-dose chocolate edibles.\n\"What I found when we first came out here about two years ago was there was a big gap between what consumers' needs are and what was on the market today, particularly in the edibles market,\" Barsoom told Business Insider.\nLess than 10 years ago, unlabeled pot brownies dominated shelves at dispensaries. Patients rarely knew how much of the drug they were eating until the high hit. Today, buyers can choose from hundreds of brands and find dosage on the packaging. However, the market continues to serve heavy users by stocking a disproportionate number of high-dose edibles.\n\"For the rest of who can't afford to lose our mind for the next six hours, and are looking for a product that's consistent and safe ... there's much to be desired,\" Barsoom said.\n1906 — named for the year Congress passed a law that required food and drug products containing \"addictive\" or \"dangerous\" substances, from alcohol to cannabis, be labeled as such — tackles edibles' usability problem on three fronts: taste, effect, and delivery.\nBarsoom assembled a team of botanists and a chemist, who had years of experience working in dietary supplements, to figure out which organic plant materials could be added to chocolate. They had to mask the taste of cannabis and also complement the drug's intended effect.\n\"We used all of our friends as guinea pigs,\" said Barsoom, who also helps make the edibles.\nThey came up with a suite of marijuana-infused chocolates that can supposedly produce different moods and energy levels.\nCourtesy of 1906\nIn a formulation aimed at helping users fall asleep, dark chocolate is mixed with 10 milligrams of cannabis and Corydalis, a herb used in traditional Chinese medicine to treat insomnia. The bite-sized edible helps \"turn off a long day and the stress with it,\" according to the website.\nA chocolate purported to energize the body and mind contains 10 milligrams of cannabis, caffeine, and L-Theanine, an amino acid found in green tea that some research suggests could cancel out the anxiety often associated with a caffeine buzz.\nThere are more chocolates in the works, according to the website.\nWeed-laced treats offer a different experience than a joint or a bong hit. When eaten, tetrahydrocannabinol (THC), the psychoactive ingredient in marijuana, undergoes a transformation in the liver that turns it into a substance that's twice as strong and lasts twice as long as when it's inhaled. A user's high might not peak until one to three hours after eating.\nBecause it takes so long to process, people often overdo it. While there are no recorded cases of people fatally overdosing on marijuana, it can make patients incredibly uncomfortable.\nBarsoom thinks he's found a way around this.\n1906 uses molds that turn their marijuana-infused chocolate into confectionery gems. Courtesy of 1906\n1906 uses a technique called lipid encapsulation that takes the THC and other key chemical compounds from marijuana and coats the molecules in fat. It allows the drug's psychoactive ingredients to bypass the gut and enter the bloodstream more quickly.\nLipid-based drug delivery systems are not uncommon in the pharmaceutical industry, though there's little research on how this technique works with cannabis.\nA double-blind study conducted in-house asked 50 adults to test the onset time and effectiveness of the company's edible formulations. The results suggested that users start to feel the effects in as little as 15 minutes, Baroom said.\nThe lipid encapsulation technique may also amplify the chocolate's potency, which is why the team starts with a small dose of five milligrams of THC.\n1906 products are sold in select dispensaries in Colorado, where Barsoom hopes to change people's minds about the usability of edibles.\n\"Everybody has a bad story about edibles. It doesn't need to be this way. People don't have a bad story about taking Tylenol,\" Barsoom said. \"This can be done better.\"","url":"https://www.businessinsider.com/peter-barsoom-wall-street-weed-2016-12"}
