{"authors":[],"date_download":"2018-10-22 23:18:39","date_modify":"2018-10-22 23:18:39","date_publish":"2014-07-12 00:00:00","description":"FC Barcelona — home to two of soccer's superstars, Messi and Neymar — has been indicted on tax fraud, a sign that the culture of impunity among Europe's top soccer clubs may be coming to an end.","filename":"data/vaneerConsumption/FinancialScandalsTarnishSpanishSoccerGlory.json","image_url":"https://media.npr.org/assets/img/2014/07/11/messi_taxfraud_wide-6acce44c6df2432d020edc08c14c3ac80083c066.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=330683509_1540250319.html","title":"Financial Scandals Tarnish Spanish Soccer Glory","title_page":"Financial Scandals Tarnish Spanish Soccer Glory : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TAMARA KEITH, HOST:\nWorld Cup competition is wrapping up this weekend in Brazil. And when it's all done, athletes will return to their professional teams, many of them in soccer clubs in Spain. But that country's soccer establishment is facing some financial scandals. As Lauren Frayer reports from Madrid, lots of legal challenges await some of the sport's top players.\nLAUREN FRAYER, BYLINE: They are the biggest names in global soccer - Neymar, Messi, Ronaldo. And they've helped their Spanish club teams get filthy rich. Real Madrid and FC Barcelona top Forbes magazine's list of the world's richest sports teams. You have to scroll down to number four to find the New York Yankee and NFL teams below that. This in a country with a sixth of the U.S. population. Sandalio Gomez heads Spain's Center for Sports Business Management.\nSANDALIO GOMEZ: (Through translator) Soccer makes up 1.5 percent of our economy. The Spanish soccer league is one of the most powerful in Europe, he says. It contributes to huge growth for our country.\nFRAYER: That economic power often comes with impunity. This spring, FC Barcelona was indicted for tax fraud. Prosecutors say the team didn't declare the full amount it paid to sign the Brazilian superstar Neymar - we're talking nearly $120 million. Barcelona's president was forced to resign. He has a court date later this month. and then there's Lionel Messi.\nLIONEL MESSI: (Spanish spoken).\nFRAYER: I'm not worried. I don't do my own taxes, Messi told reporters last year. My dad and I have lawyers and wealth managers to do all that. But Messi and his dad might do well to pay more attention - they too have been indicted. Prosecutors say they tried to lower their tax bill by sending money through shell companies overseas. They paid $6.5 million to try to settle the case. But Messi's dad may still go on trial. All this has hurt Spain's soccer reputation off the field.\n(SOUNDBITE OF TV SHOW, \"THE SIMPSONS\")\nDAN CASTELLANETA: (As Homer Simpson) Red card.\nFRAYER: In a recent World Cup themed episode of \"The Simpsons,\" cartoon Homer is the referee. He hands a red card to a Spanish player for a foul and the Spanish player hands it right back to him with a wad of cash - a pay-off bride.\n(SOUNDBITE OF TV SHOW, \"THE SIMPSONS\")\nCASTELLANETA: (As Homer Simpson) Get out of here.\n(CROWD CHATTER)\nFRAYER: In a packed Madrid bar during a World Cup semi-final - Ricardo de la Pena hangs back away from the TVs. He's not a huge soccer fan because he's disgusted by how little they pay in taxes.\nRICARDO DE LA PENA: For example, they can have $10,000 for one of minute of playing. And, yeah, their declaration of taxes, like, you can laugh about that.\nFRAYER: Ricardo is 20 and works part-time as a driver for handicapped people. He's also angry with the Spanish government for funding soccer while cutting budgets for health and education because of the economic crisis.\nPENA: They are spending a lot of money that we really need because there are a lot of people that - they don't have houses, they don't have jobs. They really need this money and they are spending on these supposed heroes and they are only playing with a ball.\nFRAYER: A recent AP investigation found that 20 soccer teams in Spain's top league together have received more than $450 million in direct Spanish government aid since 2008, when the economy crashed. And they've have received nearly $650 million in indirect aid, like when they don't pay tax. The European Union has opened an investigation. Soccer commentator Mark Elkington explains.\nMARK ELKINGTON: Clubs maybe have gone into administration or they've defaulted on tax payments. And the government maybe haven't chased them down to get that money back. And they're saying, you know, maybe in Germany or in France - maybe the authorities are much harder and they chase the money. And they're saying it's not fair that they don't get punished.\nFRAYER: But they may soon be. Under new financial fair play rules, European soccer's governing body UEFA is giving clubs until next year to balance their budgets and pay all of their taxes. For NPR News, I'm Lauren Frayer in Madrid.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=330683509"}
al obligations can be relegated to lower leagues. That may soon happen more often in Spain. Under new Financial Fair Play rules, European soccer's governing body, UEFA, is giving clubs until next year to balance their budgets — and pay all their taxes.","url":"https://www.npr.org/sections/parallels/2014/07/12/330683509/financial-scandals-tarnish-spanish-soccer-glory"}
