{"authors":["George Odling For Mailonline"],"date_download":"2018-10-22 23:05:29","date_modify":"2018-10-22 23:05:29","date_publish":"2016-01-29 10:53:13","description":"Workers at the Jaguar Land Rover plant in Solihull, West Midlands cheered as the last one was presented with its lights flashing and horn blaring. More than two million have been made.","filename":"data/vaneerConsumption/FinalLandRoverDefenderrollsoffproductionlineinSolihullWestMidlands.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B2563700000578-0-image-a-75_1454071853735.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422338_End-road-Land-Rover-Defenders_1540249529.html","title":"Final Land Rover Defender rolls off production line in Solihull, West Midlands","title_page":"Final Land Rover Defender rolls off production line in Solihull, West Midlands | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The final Land Rover Defender has rolled off the production line.\nWorkers at the Jaguar Land Rover (JLR) plant in Solihull, West Midlands cheered as the last one was presented with its lights flashing and horn blaring.\nMore than two million of the 4x4s have been produced over the past 68 years as it became one of the most-loved and long-lived road vehicles.\nScroll down for video\nThe last Land Rover Defender coming off the production line at Solihull (@jlrpr/Twitter/PA)\nLand Rover announced in October 2013 that production of the vehicle would be winding up, after more than two million had been made\nMotoring experts said production was ended because of difficulties in maintaining safety and emissions standards.\nDefenders are a favourite with the Queen and have featured in a number of films such as James Bond movie Skyfall and Edge Of Tomorrow featuring Tom Cruise.\nThe vehicle, which is exported all around the world, represents the continuation of the very first Land Rover which arrived on the scene in April 1948 and was modelled on the wartime Jeeps.\nJim Holder, editorial director of magazines Autocar and What Car?, said Defenders 'appeal to every level of society'.\nHe told the Press Association: 'It's a classless vehicle. Anyone can drive it. You might be a farmer trying to get over the muddiest field or it might be the Queen driving around Windsor. Neither would surprise you if you saw it.\n'It's got that ubiquity where it can be at home in Chelsea but doesn't look out of place painted white in the middle of a war zone.\nQueen Elizabeth II driving herself in a Land Rover Defender 110 to the stables on the Sandringham Estate in Norfolk in 2000\n'It claims to do everything and to a degree it can do everything.'\nMr Holder believes JLR made the decision to cease production of Defenders because 'regulations have finally caught up with it'.\nHe said: 'They haven't been able to update crash safety or the engine emissions quick enough.\n'The world has overtaken it to a point where they can no longer keep on the right side of emissions and safety laws.'\nJLR is working on a replacement vehicle for the Defender, but Mr Holder claimed it will be a 'massive challenge' to match the status of the original.\n'It's a charming vehicle. It's a go-anywhere, rugged symbol of solid construction,' he said.\n'But the truth is the Defender today doesn't sell in high enough numbers. The challenge is how to broaden its appeal without ruining the key aspects that make it so appealing.'\nLand Rover holds a royal warrant, as supplier to the Royal Household. The royal relationship with Land Rover goes back to 1948 when King George VI viewed the original Land Rover.\nThe Queen, who has been pictured at the wheel of Land Rovers, took delivery of her first one shortly after coming to the throne in 1952 and has used Land Rovers ever since.\nTHE HISTORY OF A 'CLASSLESS VEHICLE': 68 YEARS OF THE LAND ROVER The last Land Rover Defender off the Solihull production line 1947: The Land Rover project was made official and prototypes based on the postwar Jeep began running. 1951: Land Rovers out-sell all other Rover vehicles two to one. The British Army began using Land Rovers from the 1950s. 1983: Production of the model now known as the Defender began. 1988: British Aerospace take over the Rover Group. 1994: British Aerospace sell the Rover Group to BMW. 2013: Land Rover announced production would end in two years. 2015: Designer Paul Smith produces a one-off version of the Defender, inspired by the vehicle's service with the Army, Navy and Air Force as well as fire, coastguard and mountain rescue roles and its association with the British countryside. January 2016: The last Land Rover Defender rolls off the production line.\nQueen Elizabeth II riding in a Land Rover with the Duke of Edinburgh, reviewing 72,000 ex-Service men and women, including the wounded and the veterans of three wars, in Hyde Park, 1953\nThe Duke of Edinburgh drives to the European Horse Trials with the Queen and the Duke and Duchess of Gloucester\nQueen Elizabeth II riding in a Land Rover with the Duke of Edinburgh, as they pass down the lines of Venom fighter planes as they inspect No. 151 Squadron during their visit to RAF Leuchars, Fife, Scotland, in 1957\nQueen Elizabeth II riding in a Land Rover with the Duke of Edinburgh, through the World Scout Jubilee Jamboree camp in Sutton Park, Warwickshire in 1957\nLAND ROVER REMAIN TIGHT-LIPPED ABOUT THE CAR'S SUCCESSOR BUT INSIST THE DEFENDER WILL LIVE ON The DS100 design was unveiled in Frankfurt in 2011 Land Rover remain tight-lipped regarding the future of the Defender nameplate, but insisted it would live on. A concept car, the macho, testosterone-fuelled DS100 was unveiled in 2011 as a possible successor for the Defender. But a Land Rover spokesman said the car was just a design concept and the company could not reveal any plans for future models at this stage. The spokesman said: 'At the time it was a design concept to gauge public reaction about what the Defender could look like in the future. 'That was a long time ago. 'These things are well out of date now. 'All we are saying is that we intend to continue the nameplate and can't give any further details at the moment. 'But the Defender will live on.'\nAn Automobile Association Land Rover in a blizzard helping another motorist in difficulties in 1963\nThe Marquess of Bath, backed by an armed warden, watching a lion at his 'game reserve' at his ancestral Wiltshire home in Longleat in 1966\nThe Queen and the Duke of Edinburgh at the Badminton horse trials in 1968; Land Rover holds a royal warrant, as supplier to the royal household\nFORMER SAS SERGEANT ANDY MCNAB PAID TRIBUTE TO THE CAR THAT WAS THE WORKHORSE OF THE UK MILITARY Former SAS sergeant Andy McNab has paid tribute to Land Rover Defenders for being the 'basic workhorse' of the British military, as Jaguar Land Rover (JLR) ends their production. McNab, now a successful author, recently bought his own Defender after hearing that the last of the 4x4 vehicles was set to roll off the production line at the plant in Solihull, West Midlands. 'I got one at the end of last year because of this,' he told the Press Association. 'I love them. I learned to drive in one. They've always been there because it's been the main vehicle for the military since about the Fifties.' He recalled living in the back of a Defender for two months during an operation in the Middle East with the SAS. 'The role of the Land Rover is quite synonymous with the regiment,' McNab said. 'They are a huge weapons platform. It could take all the weight. It was the basic workhorse.' McNab said Defenders are 'amazing' to drive once their all-terrain capabilities have been mastered. He added that the vehicle compares favourably with the US Army's equivalent. 'The American Humvee is a great machine but it's so wide and cumbersome,' he said. 'The larger machines can't get into areas as quickly as Land Rovers, it's as simple as that. They're fantastic.'\nQueen Elizabeth II, with her sons Prince Andrew (left) and Prince Edward waiting for Princess Anne's arrival in the Cross-Country event of the Windsor Horse Trials, 1972\nQueen Elizabeth II and the Duke of Edinburgh in an open top Land Rover at a children's rally in Royal park, Melbourne\nMembers of the Royal Archers escorting the Army Land Rover carrying the Stone Of Destiny across Edinburgh Castle Esplanade in 1996\nA young boy driving a scale model of a Land Rover during the annual Land Rover Owners get together at Billing Aquadrome, Northampton, as they celebrate 50 years of the Land Rover mark, 1998\nMembers of a Brigade Patrol Troop, part of the Brigade Recce Force, who are an elite team within the Marine Commando Brigade, out in the northern Kuwaiti desert in their 'WMIK' Land Rover in 2003\nAn RAF Chinooks practising lifting an armed Land Rover from the deck of HMS Ocean in 2003\nLand-Rover of the 3 PARA Pathfinder Platoon during the Operation to secure the village of Musakala in Helmand Province, Afghanistan, 2006\nRoyal Marines using a Land Rover during a live firing demonstration at Salisbury Plain, Wiltshire in 2006; the vehicle was originally modelled on the Jeeps used in World War Two\nThe Land Rover that belonged to the Prince of Wales' late grandfather, taken in 2007; the royal relationship with Land Rover goes back to to 1948 when King George VI viewed the original Land Rover\nZara Phillips unveiling a Special Edition Land Rover Defender 90 SVX Soft Top, which the company donated as part of a luxury auction at the British Red Cross Ball in central London in 2007\nMembers of The 40th Regiment The Royal Artillery in a snatch Land Rover during a patrol in Lashkar Gah, Afghanistan in 2009\nA PSNI Land Rover Defender, a 'a go-anywhere, rugged symbol of solid construction,' weathering an attack from some youths\nA Land Rover Defender during the press launch for the cars of Spectre joining the Bond in Motion exhibition at the London Film Museum in London\nDaniel Craig as James Bond in Skyfall (2012) following a high speed chase through Istanbul in a Land Rover","url":"https://www.dailymail.co.uk/news/article-3422338/End-road-Land-Rover-Defenders.html"}
