{"authors":["Press Association"],"date_download":"2018-10-22 23:50:32","date_modify":"2018-10-22 23:50:32","date_publish":"2016-01-11 07:41:51","description":"The final bill for the flood damage caused by this winter's storms is likely to reach £1.3 billion, the Association of British Insurers (ABI) has said. The t...","filename":"data/vaneerConsumption/Finalbillforfloodingdamagesettoreach13bn.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-22a2a5f8-488c-48c9-ab9b-b17042820e94-48qEJGFphM8d437f0aaf9220cddf-492_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393292_Final-bill-flooding-damage-set-reach-1-3bn_1540252232.html","title":"Final bill for flooding damage set to reach £1.3bn","title_page":"Final bill for flooding damage set to reach £1.3bn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Final bill for flooding damage set to reach £1.3bn\nThe final bill for the flood damage caused by this winter's storms is likely to reach £1.3 billion, the Association of British Insurers (ABI) has said.\nThe total figure is made up of flooding damage caused by storms Desmond, Eva and Frank during December and over the New Year to homes, businesses and motor vehicles.\nThe ABI said that n early £24 million-worth of emergency payments have already been made to families and businesses following the devastation caused by this winter's storms.\nMany properties were damaged when the River Ouse flooded in York\nAnd more than 3,000 families are now in alternative accommodation while their homes are being repaired.\nThe ABI, whose figures are based on detailed data collected from its members, said that the average payout expected for each domestic flood claim is £50,000 - compared with an average payout of £31,000 following the winter storms of 2013/14.\nOf the £24 million emergency payments made so far, £9 million has been made to domestic customers and £15 million has been made to businesses.\nThe emergency payouts have covered costs including food, clothing and staff salaries. Costs for alternative home or business accommodation are being paid directly by insurers.\nThe £1.3 billion expected total for this winter's storm damage is still less than half the bill for the floods in 2007, which came to £3 billion.\nThe flooding bill for the storms of 2013/14 was £450 million.\nAs a result of this winter's storms, customers have made nearly 15,000 claims for property damaged by the flooding and more than 5,000 of these claims have come from business customers. There are thousands of smaller claims being dealt with for storm damage, the ABI said. A total of 5,600 motor claims have been received.\nMore than 8,300 initial visits have been made by loss adjusters, who handle the more severe claims.\nJames Dalton, director of general insurance policy at the ABI, said: \"The December storms have brought devastating flooding to significant parts of the UK. Insurers and their representatives have been there to provide practical help and support as quickly as possible to families and businesses coping with the trauma.\"\nHe continued: \"The impact of flooding will be felt for many months to come in affected areas. Cleaning, drying out and repairing flood damaged properties is a major undertaking. Insurers and their expert teams will be there for the long haul to help communities rebuild and repair.\"\nThe ABI's new figures are based on data covering December 3, 2015 to January 3, 2016.\nThe ABI has said that anyone with flood-damaged possessions should:\n:: Contact their home insurer for immediate advice on what to do next. In some cases an inspection of possessions will not be necessary.\n:: Dispose of any items that are a health hazard, such as rotting food.\n:: Take photos of damaged items before throwing them away.\n:: List, as far as possible, details of damaged items.","url":"https://www.dailymail.co.uk/wires/pa/article-3393292/Final-bill-flooding-damage-set-reach-1-3bn.html"}
