{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:51:19","date_modify":"2018-10-30 22:51:19","date_publish":"2016-12-12 00:00:00","description":null,"filename":"data/vaneerConsumption/FinancialConductAuthoritytocrackdownoncrowdfunding.json","image_url":"https://amp.businessinsider.com/images/57bb2c44ce38f298008b81c8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_financial-conduct-authority-to-crack-down-on-crowdfunding-2016-12_1540939879.html","title":"Financial Conduct Authority to crack down on crowdfunding","title_page":"    Financial Conduct Authority to crack down on crowdfunding - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nThe UK's Financial Conduct Authority (FCA) issued its first crowdfunding regulations in 2014, but gave itself two years to review those rules and determine if they remained adequate for the nascent industry.\nFollowing a call for input in July 2016 to launch its post-implementation review, the FCA published its findings on Friday. Its general conclusion is that, given the problems it has identified in the crowdfunding sector, its rules have to be revisited and made more stringent to protect consumers and investors.\nThe review, which examined both investment- and loan-based crowdfunding, identified several concerning characteristics of the current market:\nPoor customer communication and disclosure. In both categories, the FCA found that companies do not effectively explain how their products work, making it hard for investors to assess risks and returns. Pressure to retain customers has also led several companies to conceal underperformance.\nConflicts of interest. A lack of internal communication has led to conflicts of interest in some companies. For example, several were found to have given preferential treatment to lucrative institutional investors at the expense of others.\nUnauthorized risk-taking. Several companies have expanded into investment management and banking activities to remain profitable, without adequate expertise or authorization. In addition, a number of platforms allow cross-investment, i.e. investment in loans on third-party platforms, exposing themselves and investors to potential third-party failures.\nWeak wind-down plans. Many loan-based platforms, specifically, do not have wind-down plans robust enough to enable them to continue servicing existing loans in the case of failure, which endangers both investors and borrowers.","url":"https://www.businessinsider.com/financial-conduct-authority-to-crack-down-on-crowdfunding-2016-12"}
