{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:07:18","date_modify":"2018-10-30 18:07:18","date_publish":"2017-01-04 13:21:54","description":"SeaWorld will bid its iconic orca shows farewell on Sunday, January 8 as the final California performance is held.","filename":"data/vaneerConsumption/FinalSeaWorldSanDiegoOrcaShowComingSunday.json","image_url":"https://media.breitbart.com/media/2016/03/TIlikum-Orca-Gerardo-Mora-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_04__1540922838.html","title":"Final SeaWorld San Diego Orca Show Coming Sunday","title_page":"Final SeaWorld San Diego Orca Show Coming Sunday | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SAN DIEGO, California — SeaWorld will bid its iconic orca shows farewell on Sunday, January 8 as the final California performance is held.\nThe SeaWorld San Diego 25-minute One Ocean Shamu show will close forever after the Sunday performance. The One Ocean show began back in 2011, but Shamu dates all the way back to 1966.\nOne SeaWorld San Diego trainer told local CW6 News that she visited one of the parks when she was 5 — and, upon seeing a female trainer interact with one of the whales, cemented her future. Another trainer recalled attending a show at the age of 9 and knowing that she wanted to be a trainer someday: “I worked the rest of my life to be here at SeaWorld.”\nThe decision to end the orca shows in San Diego came after government regulators forced the park to choose: build a gargantuan habitat expansion for the majestic killer whales and end the shows, or be relegated to the old habitat and halt longstanding plans to give the whales more room and keep the Shamu show. After years of putting up with attacks from animal rights activists, SeaWorld ultimately chose the habitat expansion for the whales over keeping the Orca shows.\nIn August 2014 SeaWorld announced their plans for the construction of the massive new habitat expansion. “Blue World Project” was planned to span 1.5 acres and hold 10.5 million gallons, sinking to a depth of 50 feet. Features of the habitat will include a fast current “whale treadmill.”\nSeaWorld Entertainment announced that it had “pledged $10 million in matching funds for killer whale research and is embarking on a multi-million dollar partnership focused on ocean health, the leading concern for all killer whales and marine mammals.”\nSeaWorld has taken repeated hits in recent years. The controversial anti-SeaWorld movie Blackfish was released in 2013. Since then the company has been saddled with a drop in stock price, a lawsuit detailing investor losses related to the movie, PETA (People for the Ethical Treatment of Animals) protests and lawmaker attempts to shut down the park’s orca shows and breeding program.\nThen-SeaWorld Entertainment CEO Jim Atchison remarked that the habitat expansion project was not undertaken in response to Blackfish and was planned well before its release.\nCalifornia’s Coastal Commission forced SeaWorld San Diego’s hand in October 2015 when it made approval of the massive $100 million habitat expansion contingent on the park shutting down its orca shows and captive breeding program. The park is also prohibited from the sale, trade or transfer of captive orcas under the agreement, so the whales currently in the park’s possession are slated to be the last to grace the park.\nSeaWorld originally moved to sue the Coastal Commission, but ultimately announced in March 2016 that it would shut down the orca shows. Just two days later, CNN re-aired Blackfish.\nIn September 2016 California Governor Jerry Brown signed a bill officially banning breeding of orca whales in captivity as well as the use of the whales in performances conducted for entertainment.\nSeaWorld’s Animal Rescue Center has rescued thousands of animals. In February 2016 SeaWorld San Diego told Breitbart News the number reached 16,000 and “The marine mammal species rescued in 2015 were: 990 California sea lions, 31 northern elephant seals, 24 harbor seals, 10 fur seals and two common dolphins.”\nSeaWorld San Diego posted tips for those who make it out to the show: “If you’re looking to cool off, make sure to sit in the ‘Soak Zone.’ The whales can splash up to the first 16 rows of seats.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2017/01/04/final-seaworld-san-diego-orca-show-coming-sunday/"}
