{"authors":["Benjamin Zhang"],"date_download":"2018-10-31 00:15:07","date_modify":"2018-10-31 00:15:07","date_publish":"2014-08-25 00:00:00","description":"A recent survey by Natixis Global Asset Management shows that a large number of baby boomer won't have enough retirement savings.","filename":"data/vaneerConsumption/FINANCIALADVISORINSIGHTSAugust25.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_financial-advisor-insights-august-25-2014-8_1540944907.html","title":"FINANCIAL ADVISOR INSIGHTS: August 25","title_page":"    FINANCIAL ADVISOR INSIGHTS: August 25 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"An elderly couple sit on a bench as they look at a parasailor during a sunny summer day in Nice, southeastern France, REUTERS/Eric Gaillard FA Insights is a daily newsletter from Business Insider that delivers the top news and commentary for financial advisors.\nSurvey Shows Large Number of Workers Won't Save Enough For Retirement (Natixis)\nA recent study by Natixis Global Asset Management shows that, even with the assistance of a financial advisor and access to a 401K, many workers will not meet their retirement saving goals. This especially the case for the Baby Boomers. The survey featuring 1000 respondents show, \"33 percent of Boomers have put aside less than $50,000. In comparison, 41 percent of participants in the Millennial or Generation Y group (those from ages 18 to 33) already have put aside $50,000.\" In fact, \"Baby Boomers have saved an average of $262,541, about a third of the $805,398 they predict they'll need at retirement.\"\n\"Investors of all ages should take a second look at how much they save and what their needs are likely to be when they retire,\" Hailer said. \"While many workers get it right, others might ask if their investing targets will get the job done. Too many seem to be setting the bar too low because they may lack access to the proper tools, education and guidance,\"says John Hailer, CEO of Natixis Global Asset Management in the Americas and Asia.\nFortunately, the respondents also show that \"employers provide a great deal of retirement information and tools. Among the most popular materials available to them are printed education documents, retirement calculators and interactive planning tools. However, relatively few investors make full use of the offerings. \"\nThe House-Flipping Bubble Has Officially Imploded (Wolf Street)\nAccording Wolf Street's Wolf Richter, the time to make a quick buck by flipping homes has passed. Citing RealtyTrac, \"in Q2 of 2014 fewer than 31,000 single-family homes were flipped across the US, or a 4.6% share of all single-family home sales, down from a 5.9% share in Q1 and down from a 6.2% share in Q2 2013. And single-family homes sales overall were already down from last year.\"\nThis current home-flipping trend started in 2012 when \"flippers\" saw profits from Wall Street private equity firms, REITS, and other institutional investors. However, \"profits have come under pressure. Flippers averaged a gross profit of just over $46,000 per flip, a return on the initial investment of 21%. That's down from 24% in Q1, and from 31% a year ago, the highest return in RealtyTrac's data series going back to 2011.\" In fact,\"profits in dollars are down 23% per flip from a year ago, and it takes 39% longer to complete a flip. \"\nNow Is the Perfect Time To Be A Preferred Securities Investor (Alliance Bernstein)\nNew U.S banking regulations could be a boon to fixed-income investors writes Jeff Skogland, Director of Global Credit Research for Fixed Income, and Shrut Vakil, Global Credit Research Analyst, at Alliance Bernstein. The duo from say that, \"better fundamentals and stricter regulations are creating a good formula for banks' preferred securities.\"\nThey argue that \"as banks rebuild their capital and reduce risk, the market for these securities—which are subordinate to many pure bonds—is set to grow.\" In fact, \"the top 25 US banks have already issued nearly $100 billion of preferred securities. We expect the market to expand to about $130 billion in the next few years, as banks ramp up issuance to satisfy the new Basel III global capital rules, which require them to hold more capital as a cushion against losses.\"\nAccording to Skogland and Vakil, \"as banks have been rebuilding their muscle, bank regulations have raised the bar on what constitutes acceptable risk management.\" They believe, \"a stronger US banking sector makes it more appealing to invest in lower tiers within a bank's capital structure. Preferred securities, also known as Additional Tier 1 (AT1) securities, seem like a particularly attractive opportunity.\"\nWhy Bond Index Funds Are No Longer The Way To Go (Columbia Management)\nCiting Morningstar, Columbia Management indicates that \"there is currently $2.9 trillion invested in taxable bond mutual funds, including ETFs, of which $2.3 trillion is actively managed.\"\nCarl Pappo, head of core fixed income, and Michael Zazzarino, senior portfolio manager, at Columbia Management argue that, actively managed bonds hold a distinct advantage over its passively managed/index counterparts. \"Index funds are at a significant disadvantage to active portfolios in which managers incorporate valuation into their decision making process,\" writes Columbia Management.\n\"The objective of an index fund is to replicate the return of its stated benchmark. While this has proven to be a fairly easy task for the most popular equity indices, fragmentation and illiquidity in the bond market make true replication more difficult.\" Which means, \"there have been instances where the passive approach to bond investing produced significant underperformance relative to a benchmark.\"\nOn the other hand, \"an active manager's objective is to outperform the benchmark. They are able to do this by managing interest rate risk, identifying attractive sectors and utilizing fundamental research to drive security selection. Active management also allows the flexibility to capitalize when interest rates or credit spreads reach unsustainable levels.\"\nIt's Time To Sell Your Stocks! (The Growth Stock Wire)\nIf veteran trader Jeff Clark is correct, now is the time to start selling. According to Clark, \"the NYSE McClellan Oscillator (NYMO) - a measure of overbought and oversold conditions in the market - is saying stocks are ripe for a pullback.\"\nClark says that the NYMO over the past few weeks show that the market was overbought and now exhibit signs of an impending decline. Furthermore, \"the NYMO has a terrific track record of signaling short-term reversals in stocks.\" In fact, previous \"buy\" and \"sell\" signals from the MYMO have lined up perfectly with the rise and fall of the S&P.","url":"https://www.businessinsider.com/financial-advisor-insights-august-25-2014-8"}
