{"authors":[],"date_download":"2018-10-30 17:58:50","date_modify":"2018-10-30 17:58:50","date_publish":"2017-02-27 22:21:37","description":"Lew Horne played on his high school baseball team in New Bedford, Mass.","filename":"data/vaneerConsumption/Financeattorneywasrespectedcoll.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/27/Images/newsEngin.17906450_Horne-Nicklaus.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-obituaries_lewis_afc1331a99abe5d19022bca3afa08ec0__1540922330.html","title":"Finance attorney was respected coll","title_page":"Lewis ‘Lew’ Horne, 66: Finance attorney was respected coll","title_rss":"NULL","source_domain":"ajc.com","text":"Lew Horne played on his high school baseball team in New Bedford, Mass., and was a standout at Dartmouth College. But when his dream of a Major League career ended one summer when he was struck in the mouth with a bat, Horne switched gears.\n“He had the perfect skill set for a lawyer,” daughter Sydney Langdon said. “He was so analytical, and he could read a situation like no one else.”\nLewis “Lew” C. Horne Jr., 66, prominent public finance attorney, golfer and mentor, died Feb. 23.\nHis career spanned 40 years and included a long tenure as counsel for the Development Authority of Fulton County, assisting with bond financing of multifamily housing, hospitals, museums and schools as well as businesses.\nHe represented the Fulton-DeKalb Hospital Authority in the restructuring plan for Grady Health System in 2008 when Grady Memorial Hospital was nearly insolvent. “We were able to avert catastrophe with Grady,” Horne said in a 2010 interview with the Atlanta Tribune. “But the fact of the matter is that public hospitals do die and go away because funding sources dry up.”\nHorne was the first minority lawyer on the board of the National Association of Bond Lawyers. He was one of the first African-Americans listed in the Bond Buyer’s Municipal Marketplace, a national directory of bond lawyers known as the “Red Book.”\n“Lew was very concerned about diversity issues and always encouraged and supported minority lawyers,” said Sandra Z. Zayac, a partner at Arnall Golden Gregory and a friend and colleague of Horne’s for more than a decade. “He understood that being a female or a minority did present unique challenges, and he wanted to be one of the people who would break boundaries so women and minorities could take on positions of responsibility in organizations and law firms.”\nHorne received his undergraduate degree from Dartmouth College in 1972 and both his master’s in public administration and law degree from Harvard University in 1976. But he “would just tell people he went to school in New England so as not to brag,” Zayac said.\nHorne came to Atlanta in the 1970s to work alongside his heroes, Julian Bond and Maynard Jackson, she said.\n“He had so many stories about Atlanta’s history and politics,” Zayac said. “Lew was one in a million. He was kind, caring, compassionate and brilliant. I could not have asked for a better friend and mentor.”\nHorne practiced at well-known Atlanta law firms including Long Aldridge and Norman, Powell Goldstein and Nelson Mullins Riley & Scarborough, Troutman Sanders and Schiff Hardin. He also created a small minority law firm, Arrington & Horne, with then-Atlanta City Council President Marvin Arrington. He joined Arnall Golden Gregory LLP as a partner in 2014.\nJonathan E. Eady, managing partner at Arnall Golden Gregory, said Horne “was one of our most gracious and generous partners. His passing is a tremendous loss to the Atlanta legal community.”\nShelby A. Urbie said she, Horne and Zayac worked as a team at Arnall Golden Gregory,and “His energy was almost magnetic. Working with him, you felt like a better attorney and a better person.”\nWhen the three would go out to lunch, they’d always run into someone who knew Horne, she said. “We’d say: ‘You know everybody,’ ” and Horne would jokingly reply that he couldn’t help it. “ ‘I’m just charismatic,’ he’d say.”\nFriends said Horne had three major passions: the law, golf and his family: wife Audrey, daughters Sydney and Stephanie and 1-year-old granddaughter Cecily.\nHorne took up golf reluctantly when he was 40, at the urging of two of his law firm partners, but was quickly hooked on the game, Zayac said. He served on the board of the American Junior Golf Association and was inducted in 2008 to the National Black Golf Hall of Fame.\nSydney said her dad was “was incredibly nurturing and supportive, but never overbearing. He was always there to offer guidance and mentorship. I feel like he was always the voice of reason in the back of my head.”\nShe and her sister, Stephanie Horne, shared him with his ”golf daughters and sons” and the many young lawyers he mentored. “We were so glad to share him.”\nA memorial service will be held March 4 at 2 p.m. at The Carter Center’s Cecil B. Day Chapel, 453 Freedom Parkway, Atlanta.\nMemorial contributions may be made to the Lewis C. Horne Memorial Fund, supporting minority junior golfers through the American Junior Golf Association. Contributions may be sent to AJGA Foundation, Attention: Lew Horne Memorial Fund, 1980 Sports Club Drive, Braselton, GA 30517, or at www.ajga.org/lewhorne.","url":"https://www.ajc.com/news/local-obituaries/lewis-lew-horne-finance-attorney-was-respected-colleague-mentor/yFKVKH94gPyPyANEIKyjBO/"}
