{"authors":[],"date_download":"2018-10-30 17:59:33","date_modify":"2018-10-30 17:59:33","date_publish":"2016-03-24 14:46:28","description":"The Georgia House and Senate have just started what will likely be a long last day to its contentious 40-day annual session.","filename":"data/vaneerConsumption/Finaldayoflegislativesessionbegins.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/23/Videos/4814275537001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_4958d835c72b5e44899c6f3fa0ad4d84__1540922373.html","title":"Final day of legislative session begins","title_page":"Final day of legislative session begins","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia House and Senate have just started what will likely be a long last day to its contentious 40-day annual session.\nHouse Speaker David Ralston, R-Blue Ridge and Lt. Gov. Casey Cagle gave the tradition strike the gravel, calling order their respective chambers shortly after 10 a.m.\nThe House Rules Committee met at 9 a.m., adding to the long list of bills that await action today.\nCommittee Chair John Meadows, R-Calhoun, set the tone with an opening praise.\n“Let us not do things that don’t please you, and when we do those things please continue to forgive us,” Meadows said.” It’s going to be a long day, help us through it.”\nSenators also were expecting a long day, potentially full of surprises.\n“Our intentions are all good and all honorable,” said Senate Rules Committee chair Jeff Mullis, R-Chickamauga. But you never know until the final countdown what’s happened and what amendments have affected what pieces of legislation. We’re all hoping that it’s all good for Georgia.”\nThree of this year’s bills, dealing with campus carry and religious liberty, have drawn national, and even international attention.\nCampus carry, opposed by university officials, and religious liberty, widely criticized as being anti-gay, have been sent to Gov. Nathan Deal. Deal has threatened to veto the campus carry bill, unless modified, but has been mum on what he’ll do with the religious liberty bill that some say could lead to a business boycott of the state.\nLobbying for the medical marijuana bill is going down to the wire.\nBoth the House and Senate live stream their sessions. Find links to the broadcasts here: http://www.legis.ga.gov/en-US/default.aspx. Both chambers begin their day at 10 a.m. and will likely go until midnight.","url":"https://www.ajc.com/news/state--regional-govt--politics/final-day-legislative-session-begins/2mpMYmtrAQF2PdVcvxN9fN/"}
