{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 05:11:39","date_modify":"2018-10-23 05:11:39","date_publish":"2017-03-16 16:11:41","description":"Charles Miley (pictured), 51, of Rugby, Warwickshire, says he cannot work and finds it hard to concentrate due to the 'severe fatigue' which has plagued him since 2009.","filename":"data/vaneerConsumption/Financierclaims24minsurancepayoutforfatigue.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E54837C00000578-0-image-a-22_1489680196068.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320642_Financier-claims-2-4m-insurance-payout-fatigue_1540271499.html","title":"Financier claims £2.4m insurance payout for 'fatigue'","title_page":"Financier claims £2.4m insurance payout for 'fatigue' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Charles Miley (pictured outside the High Court) says he cannot work and finds it hard to concentrate due to the 'severe fatigue' which has plagued him since 2009\nA high-flying financier who says he was struck down by chronic fatigue is battling accusations that he faked his symptoms to claim millions in insurance payouts.\nCharles Miley says he cannot work and finds it hard to concentrate due to the 'severe fatigue' which has plagued him since 2009.\nOn bad days, the former triathlon competitor lacks the energy to get out of bed or quit his living room sofa, the High Court has heard.\nThe former executive at investment bank, Piper Jaffray Ltd, says he can sometimes do little more than languish in his tracksuit, listening to the radio or watching TV.\nBut Mr Miley has now been confronted with covertly-shot surveillance footage which insurers say shows him guzzling ale and propping up the bar at a beer festival.\nAnd Friends Life claim his account of his symptoms was 'deliberately false' and that the footage confounds the sorry picture painted by Mr Miley.\nThe 51-year-old, from Rugby, Warwickshire, said he hit an all-time low in 2010 when his illness became so debilitating he sometimes couldn't even leave his home.\n'My wife, Rachel, would be out in the garden if it was a sunny day and call me outside, and I wouldn't be able to do it,' he told the court in London.\n'There were times when I could barely speak,' he added.\nBut Mr Miley is now locked in a bitter dispute with Friends Life, who claim he has faked his condition to cash in on a lucrative income protection policy.\nThe policy was taken out for Mr Miley by his employers and entitles him to 75 per cent of his salary until retirement age if he is permanently unable to work.\nMr Miley was Head of Institutional Equity Sales at Piper Jaffray - which has offices in the City of London - earning a £130,000 annual salary.\nFriends Life initially accepted his claim and paid out between 2009 and 2013 following a diagnosis of severe chronic fatigue syndrome.\nBut the company's counsel, Caroline Harrison QC, said it cut off payments in September 2013, claiming that the 'accounts given by Mr Miley of his symptoms and capabilities were deliberately false'.\nAlthough Mr Miley's 'glandular fever symptoms' may have been genuine at the start, by late 2010 they were wearing thin, she claimed.\nFriends Life are now challenging Mr Miley's account in court and are counter-claiming to recoup some or all of the cash it paid out to him.\nMr Miley, a former executive at investment bank, Piper Jaffray Ltd (above), says he can sometimes do little more than languish in his tracksuit, listening to the radio or watching TV. But he has now been confronted with covertly-shot surveillance footage which insurers say shows him guzzling ale and propping up the bar at a beer festival\nMiss Harrison highlighted a June 2013 letter from Mr Miley to the insurers in which he complained of 'mental fog' and having problems driving.\nBut the QC claimed: 'This account is in marked contrast to surveillance evidence taken only the previous day when Mr Miley was seen driving himself and his dog to and from the pub, and enjoying what appeared to be a \"normal\" social drink over a period of several hours'.\nThe barrister, who disclosed that Mr Miley had been secretly filmed by private investigators on behalf of Friends Life, said he was medically assessed in September 2013 in a periodic review.\nHe told a chronic pain specialist he felt 'rotten' after his first assessment, and had to retreat to the sofa at home - being unable to walk or read emails.\nBut the QC told the court: 'In fact, contrary to these assertions, on 24 August 2013 Mr Miley had attended a beer festival at a public house for approximately five hours.\nFriends Life are now challenging Mr Miley's account in court and are counter-claiming to recoup some or all of the cash it paid out to him\n'He had socialised with friends without any apparent difficulty and, after drinking several pints, drove himself, his wife and his seven-year-old daughter home.'\nThese revelations prompted the insurers to cease the payments in light of Mr Miley's 'obvious lie', Miss Harrison told the court.\nMr Miley is asking Mr Justice Turner to rule that he is 'incapacitated by chronic fatigue syndrome' and to hold Friends Life to the terms of his policy.\nHe is claiming around £300,000 to cover the period since his payments were severed in 2013.\nAnd he wants the judge to rule that the Friends Life must - subject to his condition improving - carry on paying him until he is 65.\nIf he continues to be incapable of working until he draws his pension, the policy would net him a total of about £2.4 million.\nIn court, Mr Miley was quizzed about his alleged ability to walk and hop on his bike.\nThe QC also challenged him about complaints made in 2013 that 'I cannot stand unaided for long due to tiredness'.\nMiss Harrison confronted Mr Miley with video footage of him in a pub in August 2013 'where you appear to have no difficulty standing for long periods against the bar while talking to friends'.\n'That's not how I spend most of my days,' he responded.\n'I had been sitting down for two or three hours, and I started to ache through being in the same position, so I stood up,' he added.\nHe insisted the picture painted by the video surveillance was deeply unfair, ignoring the many days when he is confined to his home and stripped of energy.\nHe had good and bad days, but had been advised to make the most of his better days by exercising as much as possible, said Mr Miley.\n'I used the better times as fully as I could', he told the court.\nMr Miley's barrister, David Callow, said the case's central issue is 'whether his account of his illness has been fraudulent'.\nBut he told the judge: 'Mr Miley submits that, properly analysed, his account to Friends Life has been consistent and is both honest and in no way, inconsistent with the surveillance evidence obtained.'\nThe hearing continues.","url":"https://www.dailymail.co.uk/news/article-4320642/Financier-claims-2-4m-insurance-payout-fatigue.html"}
