{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 19:56:30","date_modify":"2018-10-30 19:56:30","date_publish":"2017-02-27 15:32:39","description":"Reading over the menu for the first time at\nMediterranea in Grant Park\n,...","filename":"data/vaneerConsumption/FindglutenfreeMediterraneanatMediterraneainGrantPa.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/27/Images/WPIMAGE_cmgajcfoodandmore_14228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_fi_0e0efedb36e641feb1b8388e2c162251__1540929390.html","title":"Find gluten-free Mediterranean at Mediterranea in Grant Pa","title_page":"First Look: Find gluten-free Mediterranean at Mediterranea in Grant Pa","title_rss":"NULL","source_domain":"ajc.com","text":"Reading over the menu for the first time at Mediterranea in Grant Park , you wouldn’t guess that it’s strictly gluten-free. And that’s exactly the way partners Gerard Nudo and Gary McElroy planned it.\nA little over two years ago, Nudo and McElroy left jobs at Rizzoli Bookstore and Rizzoli Publications in New York City for a new life and a new business in Atlanta.\nThey rented a storefront in a historic 1920 trolley stop building on Ormond Street and renovated it, adding earthy colors and textures and rustic wood accents from the Jack Ellis Company in Avondale Estates, including quarter sawn white oak tables, and a bar fabricated from a fallen pecan tree.\nLast week, Nudo, who does the baking, and McElroy, who oversees the business, sat down at Mediterranea to talk about some of the big ideas behind the bakery, restaurant and bar, which opened a few weeks ago, serving coffee and baked goods weekdays, dinner evenings, and brunch on the weekends.\nMediterranea team with executive chef Rob Haan and co-owners Gary McElory and Gerard Nudo. Photo credit- Mia Yakel.\n<< Ayurvedic herbs and how to use them\n<< 4 favorite vegetarian dishes in Atlanta\n<< 3 best vegetarian brunches in Atlanta\n<< Gluten-free pie lady spills her secrets\n<< 4 Atlanta restaurants to dine gluten-free\n“We wanted to create a comfortable, quiet, conversational vibe,” Nudo said. “We put acoustic panels up on the walls and ceilings to absorb the sound. And the music is mainly 1950s bebop and cool jazz. The theme we were going for is sort of rustic elegant, with simple lines and a focus on the food.”\nAs far as the menu, it’s a combination of Nudo’s Italian family heritage and McElroy’s dietary restrictions since being diagnosed with coeliac disease. There are plenty of vegetarian and vegan options, too. And the bar features a number of Mediterranean wines by the bottle or glass, plus house cocktails that play with Italian spirits such as Campari and Aperol, and beers from Eventide Brewing, just a few blocks away in Grant Park.\n“I was born in Italy and I was used to eating the Mediterranean diet, as it’s called, nowadays,” Nudo said. “That’s how I grew up, with a diet that was vegetable-focused, and with very fresh ingredients, simply prepared.\n“So everything on the menu is gluten-free, except for a couple of beers at the bar. And the kitchen is completely gluten-free. But we tried to design the menu so it’s not overtly in-your-face. Most of the dishes, except some of the baked goods, don’t use substitutions and are just naturally gluten-free.”\nAmong those items from Nudo and executive chef Rob Haan, you’ll find a quartet of lemon artichoke, savory white bean, orange beet, and Calabrese chickpea spreads, a house salad with Boston lettuce, watermelon radish, sweet onion, and pistachio, and pan-seared scallops with fennel and grapefruit.\n“There’s a lot of interest in the vegetarian and vegan items,” McElroy said. “Grant Park has this incredible farmers market, and there are community gardens everywhere. We even get some of our veggies from as close as four blocks away at Freewheel Farm. So we felt that a vegetable-focused menu would be embraced by the neighborhood, and it has been. ”\n“In the mornings, we have people coming in and hanging out, having a coffee and a scone,” Nudo said.”We have wi-fi so it’s a nice place to do some work with your computer. We close up in the afternoon and get ready for dinner. Dinner has been amazing. We’ve gotten such a great reaction from the neighborhood. They’ve really embraced it. We had a couple in last night and it was their fifth time having dinner with us.”\n332 Ormond Street S.E., Atlanta. 404-748-4219, mediterraneaatl.com.\nMore images from a First Look at Mediterranea in Grant Park\nMediterranea Mediterranean Breakfast with fresh fruit, dried fruit, nuts, dolmas, hard cooked egg, yogurt , fig compote, and seasoned bread. Photo credit- Mia Yakel.\nMediterranea pan-seared scallops with fennel and grapefruit. Photo credit- Mia Yakel.\nMediterranea baked feta in red sauce. Photo credit- Mia Yakel.\nMediterranea House Salad with Boston lettuce, watermelon radish, sweet onion, and pistachio. Photo credit- Mia Yakel.\nMediterranea Quartet of Spreads with lemon artichoke, savory white bean, orange beet, and Calabrese chickpea spreads. Photo credit- Mia Yakel.\nMediterranea Involtini with eggplant, yellow squash, and zucchini rolled around pan fried haloumi cheese. Photo credit- Mia Yakel.\nMediterranea Pot de Creme with chocolate chip cookies and pistacho cranberry white chocolate chip cookies. Photo credit- Mia Yakel.\nTake a first look at other metro Atlanta restaurants\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook","url":"https://www.ajc.com/blog/atlanta-restaurants/first-look-find-gluten-free-mediterranean-mediterranea-grant-park/iHeX0gn9cds3GLTp6vVNbN/"}
