{"authors":["Christine Distasio"],"date_download":"2018-10-30 23:47:28","date_modify":"2018-10-30 23:47:28","date_publish":"2014-08-13 04:59:01","description":"MTV wants you to know that they're not screwing around with this family tree — so you can put your twin theories to rest. Astute fans of MTV's new drama seem to think that Finding Carter 's Carter and Taylor aren't really twins and that maybe, just…","filename":"data/vaneerConsumption/FindingCartersCarterTaylorAreDefinitelyTwinsSoPutThatTheoryToRest.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5d8ecddd-76e0-4ae6-a190-6b8e10bc78df.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35551-finding-carters-carter-taylor-are-definitely-twins-so-put-that-theory-to-rest_1540943248.html","title":"'Finding Carter's Carter & Taylor Are Definitely Twins, So Put That Theory To Rest","title_page":"'Finding Carter's Carter & Taylor Are Definitely Twins, So Put That Theory To Rest","title_rss":"NULL","source_domain":"bustle.com","text":"MTV wants you to know that they're not screwing around with this family tree — so you can put your twin theories to rest. Astute fans of MTV's new drama seem to think that Finding Carter 's Carter and Taylor aren't really twins and that maybe, just maybe, Carter might actually be Lori's biological daughter. Well, sorry to burst your bubble, conspiracy theory fans, but MTV just slapped you with a big, fat NOPE on Tuesday night's new episode of Finding Carter. Because Carter and Taylor are absolutely, positively twins and they've got the telepathy and identical taste to prove it.\nTuesday night's episode was a big night for Carter — her birthday, or rather, her shared birthday with her new twin sister Taylor. While it was marred by Carter's desire to run away with Lori following their secret meeting last Tuesday, which would lead any fan to believe that maybe, just maybe, they aren't actually twins after all. But, MTV's not going to let us believe it because they chose this birthday episode to beat fans over the head with proof that Carter and Taylor come from the same womb and that they've definitely got that \"freaky twin thing\" going for them.\nNaturally, the entire family is excited for Carter's first birthday with them, so her grandparents decide to throw a huge party. I mean, it's her first birthday back, after all. And they hand off two gift cards to Macy's to Carter and Taylor to go \"buy something special.\" But, of course, Taylor already knows about Carter's plan to run off and ditch their joint-birthday, thus ruining Taylor's birthdays again like her kidnapping has for the past 15 years. (God, Carter, you're so effing ungrateful. I can't stand it.) And then something so magical and out of a MaryKate and Ashley movie happens.\nCarter plays along with the dress shopping and, what do you know, she and Taylor chose THE SAME EXACT DRESS to wear to their party. Now, if they weren't supposed to be twins, this wouldn't be such a coincidence — it was an extremely plain, little black party dress, anyone could've picked that out. But Finding Carter used this moment to have Taylor tell Carter that the last time they wore matching outfits was at the last birthday party they had together. Ugh, the feels. At which point, Elizabeth produces a photo of the twins, dressed in matching outfits, at their party. Cue the flashback.\nIf Carter were doubting that this was her family, she's definitely starting to see the weird signs of her relationship with Lori — particularly the fact that Lori had the exact photo, laminated, with Taylor cut out. #Awkward. In another flashback, Carter speculates about how great it must be to have a twin — as if she knew that somewhere out there, her twin was waiting for her.\nSo, sorry fans that love a good mystery — but while Carter and Taylor may look nothing alike, MTV says they're twins and they've got the telepathy to prove it.\nImage: MTV","url":"https://www.bustle.com/articles/35551-finding-carters-carter-taylor-are-definitely-twins-so-put-that-theory-to-rest"}
