{"authors":["John Hayward"],"date_download":"2018-10-30 18:14:00","date_modify":"2018-10-30 18:14:00","date_publish":"2017-01-05 04:10:19","description":"Finland is launching a “radical experiment” to see if a simple monthly payment can replace the nation's ever-expanding tangle of welfare programs. | Politics","filename":"data/vaneerConsumption/FinlandTestsPlantoReplaceWelfareState.json","image_url":"https://media.breitbart.com/media/2017/01/AP_858199239516.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_04__1540923240.html","title":"Finland Tests Plan to Replace Welfare State","title_page":"Finland Tests Plan to Replace Welfare State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Finland is launching a “radical experiment” to see if a simple monthly payment can replace the nation’s ever-expanding tangle of welfare programs.\nThe monthly payment, dubbed a guaranteed minimum income, or “universal basic income,” is an idea that has been kicked around for years as a replacement for the traditional welfare state. It has some prominent conservative advocates, including Charles Murray today, and luminaries such as Friederich Hayek and Milton Friedman in the past. In various versions of the basic income plan, everyone is paid the same stipend from the government, or everyone whose income falls below a certain line.\nFinland’s experiment is beginning with a small pool of people who were previously collecting unemployment benefits or income subsidies. As CNN Money describes it, the program’s 2,000 enrollees will now receive the equivalent of $587 per month for a period of two years. The income is guaranteed no matter what happens to the participants, including full employment. This promise is meant to eliminate the problem of unemployed people deciding not to work because it would cut into their benefits.\nCNN Money notes a similar, but much smaller and means-tested, program running in the Italian city of Livorno since June. Guaranteed minimum programs are also under consideration in Canada, Iceland, Uganda, and Brazil. Switzerland considered a $2500 per month minimum income last year, but the referendum was rejected by over 75 percent of voters.\nRussia’s Sputnik News recalls that critics of the Swiss program called it a “Marxist dream” and warned financing it would require huge tax increases, or cuts to other government programs. Also, they worried about “economic chaos from citizens quitting their jobs en masse.”\nThese arguments cover the yin and yang of the Guaranteed Minimum Income idea. Advocates believe it will dissolve the massively inefficient, corrupt, complicated, and redundant welfare state. (A notable feature of the program in Finland is the absence of paperwork – no need to submit any status reports to the government, as is required under traditional unemployment programs.)\nCritics worry about the cost, the disincentives to work, and the inevitable pressure to keep raising the minimum income. Imagine what the people who currently agitate for $15 minimum wages would to a $587 minimum income. Among other headaches, the radically different costs of living in the huge United States would introduce complexities not seen in small, relatively homogenous countries.\nWriting at Forbes, Tim Worstall recalls that Milton Friedman discarded the Guaranteed Minimum Income idea in favor of subsidizing the poor through tax rebates, in what ultimately became the Earned Income Tax Credit.\nWorstall also cites the veritable Mjolnir of a tax hammer which hangs over the British unemployed and under-employed, and which threatens to grab up to 80 percent of what they earn in a job. Finland’s experiment completely removes that disincentive for the 2,000 test subjects, while other unemployed Finns will still have to deal with it. We should, therefore, get an idea of whether the Guaranteed Minimum Income is less of a job- and wealth-killer than traditional welfare plans, which would go a long way toward defraying the cost of such a program.\nIn a new column for the Wall Street Journal this week, Charles Murray addresses the criticism of guaranteed income up front:\nWhen people learn that I want to replace the welfare state with a universal basic income, or UBI, the response I almost always get goes something like this: “But people will just use it to live off the rest of us!” “People will waste their lives!” Or, as they would have put it in a bygone age, a guaranteed income will foster idleness and vice. I see it differently. I think that a UBI is our only hope to deal with a coming labor market unlike any in human history and that it represents our best hope to revitalize American civil society.\nHe addresses that “idleness and vice” problem by noting that we already have it, with 18 percent of unmarried working-age men and 23% of women out of the labor force and receiving benefits, and proposes his UBI plan could lead some people to indolence, but would also bring marginal workers back into the labor force, since they could earn up to $30k without losing any of their simple cash benefit.\nMurray’s proposal is for every American citizen age 21 and over to receive $13,000 per year, paid in monthly installments, with $3,000 of it earmarked for health insurance. The net result is that every American citizen would be paid $833 by the government, every month, for life (with a bit of means testing, as described below) and the rest of the welfare state goes away:\nPeople can make up to $30,000 in earned income without losing a penny of the grant. After $30,000, a graduated surtax reimburses part of the grant, which would drop to $6,500 (but no lower) when an individual reaches $60,000 of earned income. Why should people making good incomes retain any part of the UBI? Because they will be losing Social Security and Medicare, and they need to be compensated. The UBI is to be financed by getting rid of Social Security, Medicare, Medicaid, food stamps, Supplemental Security Income, housing subsidies, welfare for single women and every other kind of welfare and social-services program, as well as agricultural subsidies and corporate welfare. As of 2014, the annual cost of a UBI would have been about $200 billion cheaper than the current system. By 2020, it would be nearly a trillion dollars cheaper.\nMurray, like virtually every other pundit and analyst writing about Finland’s guaranteed-income experiment, notes the idea has gained renewed currency due to the rising threat of advanced automation. If projections that nearly half of all jobs could be threatened by artificial intelligence in the years to come, a new paradigm for the social safety net is needed.\n“We are approaching a labor market in which entire trades and professions will be mere shadows of what they once were,” Murray warns.\nHe makes a provocative argument that Universal Basic Income would disintegrate so much of our overbearing federal and state governments, and put so much wasted money back into the pockets of wage earners, that it would inject “new energy into an American civic culture that has historically been one of our greatest assets, but that has deteriorated alarmingly in recent decades.”\nIn other words, the people would devise efficient local solutions to poverty issues, and the unfettered marketplace would create opportunities for marginal labor, while the ambitious would not be shackled.\nAnother interesting idea floated by Murray is a social realignment, brought about by the sure and certain knowledge that everyone gets the same monthly government stipend. Few could claim to be destitute due to forces utterly beyond their control. The weight of poor decisions would fall heavily upon the irresponsible, with reduced sympathy from the prudent.\nBut that’s also where we find the most devastating argument against the Universal Basic Income idea: at least in the United States, it won’t be possible to get rid of that overweening government and bloated welfare state, due to the existing social pressures. The danger of getting stuck with UBI as just one more bloated social program, in addition to what the Great Society and New Deal already created, is not merely a concern – it’s an absolute certainty.\nLiberal groups, sympathetic elected politicians, and most of the extremely powerful federal bureaucracy would fight the most savage political battle we have ever seen to retain at least some of the social programs Murray envisions eliminating. (Social Security, Medicare, and Medicaid are among them; all by themselves, they make the UBI concept a pipe dream.)\nImagine the wailing and rending of garments over the soaring unemployment rate of government workers, if universal-income advocates burned down the welfare state. They’d be accused of wanting to “kill” a million jobs, in addition to menacing the poor by taking away programs that currently provide far more than $13,000 per year in benefits.\nEven if advocates developed the political muscles to implement such a sweeping reform, it wouldn’t last. Advocacy groups would begin pushing for the return of some programs immediately, or for dramatic increases in the guaranteed income amount. In vast America, some of this pressure would be regional: “You can’t expect a New Yorker to live on the same amount of money as a family in rural Alabama!”\nRemember how ObamaCare was pushed with carefully-selected sob stories of people who couldn’t get insurance under the old health insurance rules? Multiply that a hundredfold, and you’ll have some idea of the pressure to reinstate programs that shelter the homeless, or feed impoverished children, or give counseling services.\nClass-war pressures would slam into the UBI system at once, with loud agitation for the higher-income surtaxes Murray proposes to be increased. There is no way people in the highest income brackets would be allowed to keep that minimal $6,500. Social Security is protected by the political illusion that it’s a “trust fund” beneficiaries “own” because they “paid into” the account during their working lives. No such illusion would keep UBI safe for people who make more than whatever constantly-dwindling income makes you a “millionaire” in the eyes of the Left.\nThe welfare state will find other ways to reappear, even if the social programs replaced by the UBI are kept off the books. Public schools would be an ideal delivery system for supposedly obsolete welfare benefits. We’re talking about a society whose left wing currently argues that college should be “free.”\nThe outgoing President, whose approval ratings are said to be over 50 percent, once called current House Speaker Paul Ryan a “Social Darwinist” (i.e. he wants to murder poor people to improve the quality of the population) because he proposed modest cuts to federal spending, in a bid to stave off inevitable federal bankruptcy. Imagine if he’d proposed “wiping out the social safety net” and replacing it with a monthly stipend, paid to rich and poor alike.\nIt’s unfortunate to dismiss an idea as little more than a thought experiment because implementation is politically impossible. Maybe, just maybe, that looming threat of automation will trigger the kind of social change needed to make the even more powerful social change wrought by a pure minimum-income system possible. Unfortunately, foolish labor, education, and immigration policies have left us very little time to adapt.","url":"https://www.breitbart.com/politics/2017/01/04/finland-begins-universal-basic-income-experiment/"}
