{"authors":["Gianluca Mezzofiore For Mailonline"],"date_download":"2018-10-22 22:11:25","date_modify":"2018-10-22 22:11:25","date_publish":"2016-01-29 08:58:20","description":"Last year, Finland made it more difficult for Iraqis, Afghans and Somalis to get asylum. Migrants whose asylum is rejected will be placed in transit centres and deported back to their home countries.","filename":"data/vaneerConsumption/FinlandfollowsSwedensleadandannouncesitwillexpel20000migrants.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30AA80DD00000578-0-image-a-13_1454056899884.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422350_Finland-follows-Sweden-s-lead-announces-expel-20-000-32-000-migrants-arrived-2015_1540246285.html","title":"Finland follows Sweden's lead and announces it will expel 20,000 migrants","title_page":"Finland follows Sweden's lead and announces it will expel 20,000 migrants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Charter flights will gradually deport them to their home countries\nMigrants will be placed in transit centres and from there repatriated\nAround 20,000 of Finland's asylum-seekers are from Iraq\nFinland made it more difficult for Iraqis, Afghans and Somalis to get asylum\nFinnish government to deport 65 percent of 32,000 migrants arrived in 2015\nFinland has joined Sweden in announcing plans to repatriate tens of thousands of migrants whose asylum requests will likely be rejected.\nThe two Nordic countries are both struggling to cope with with an unprecedented influx of refugees and migrants fleeing war and misery in the Middle East and elsewhere, and they receive among the highest number of arrivals per capita in the EU.\nThe Finnish government said it expect to deport around 20,000 of the 32,000 asylum-seekers it received in 2015.\nSweden and Finland received among the highest number of arrivals per capita in the EU\nThe Finnish government said it expect to deport around 20,000 of the 32,000 asylum-seekers it received in 2015. Pictured: a Syrian refugee with her children in Sweden\nMore than 20,000 of Finland's asylum-seekers are from Iraq. Pictured: Crew members of the Italian navy ship Aliseo take part n a rescue operation in which 290 migrants were save from three dinghies off the Libyan coast on 27 January\n'In principle we speak of about two-thirds, meaning approximately 65 percent of the 32,000 will get a negative decision (to their asylum application),' Paivi Nerg, the ministry's administrative director told AFP.\nLast year, Finland made it more difficult from migrants from Iraq, Afghanistan and Somalia to get asylum, stating that the security situation had improved in certain areas of those countries.\nMore than 20,000 of Finland's asylum-seekers are from Iraq.\n'In previous years around 60 percent (of applicants) received a negative decision but now we have somewhat tightened our criteria for Iraqis, Afghans and Somalis,' Nerg explained.\nShe said that the ministry is planning to set up separate transit centres for those to be deported from those wanting to leave the country on a voluntary basis.\nThe deportations will take place gradually as immigration authorities process applications.\nTwo charter flights to deport Iraqis were already scheduled within the following months and about 4,000 asylum-seekers had already withdrawn their applications.\nFinland is also in diplomatic negotiations with neighbouring Russia to stop migrants from entering Finland via the Arctic region.\nAfter Norway barred migrants from entering the country on its own Arctic border crossing with Russia in December, the flow of migrants turned towards Finland.\nIt comes as neighbouring Sweden was planning over several years to deport up to 80,000 people whose asylum applications are likely to be rejected.\nFinland is planning to set up transit centres for for those to be deported from those wanting to leave the country on a voluntary basis. Pictured: A migrant boy covered with blanket as he waits to cross the Greek-Macedonian border near the village of Idomeni, Greece\nThe deportations will take place gradually as immigration authorities process applications. Pictured: Refugees walk towards the border with Serbia from the transit center for refugees near northern Macedonian village of Tabanovce\nSweden is also planning to deport up to 80,000 people in the following years\nSwedish migration minister Morgan Johansson said authorities faced a difficult task in deporting such large numbers\n'We are talking about 60,000 people but the number could climb to 80,000,' interior minister Anders Ygeman told Swedish media.\nJust like in Finland, the operation would require the use of specially chartered aircraft.\nAnders estimated that Sweden would reject around half of the 163,000 asylum requests received in 2015.\nSwedish migration minister Morgan Johansson said authorities faced a difficult task in deporting such large numbers, but insisted failed asylum seekers had to return home.\n'Otherwise we would basically have free immigration and we can't manage that,' he told news agency TT.\nThe fresh clampdown came as at least 31 migrants died trying to reach Europe.\nThe bodies of 25 people, including 10 children, were found off the Aegean island of Samos.\nThe Italian navy said it had recovered six bodies from a sinking rubber boat off Libya.\nIn Bulgaria, the frozen bodies of two men, believed to be asylum-seekers, were found near the border with Serbia.","url":"https://www.dailymail.co.uk/news/article-3422350/Finland-follows-Sweden-s-lead-announces-expel-20-000-32-000-migrants-arrived-2015.html"}
