{"authors":["Press Association"],"date_download":"2018-10-23 02:08:02","date_modify":"2018-10-23 02:08:02","date_publish":"2017-03-10 11:06:43","description":"Ex-Scotland centre Scott Hastings has been impressed by the development of the playmaker, but he believes the 24-year-old needs to put on a starring show against England.","filename":"data/vaneerConsumption/FinnRussellurgedtocementLionsspotatTwickenham.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E1453B100000578-0-image-a-59_1489143879466.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4300796_Finn-Russell-urged-cement-Lions-spot-Twickenham_1540260482.html","title":"Finn Russell urged to cement Lions spot at Twickenham","title_page":"Finn Russell urged to cement Lions spot at Twickenham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Finn Russell has been told to grasp the opportunity awaiting at Twickenham to book his British and Irish Lions ticket to New Zealand in the summer.\nFormer Scotland centre Scott Hastings has been impressed by the development of the maverick Glasgow playmaker, but he believes the 24-year-old needs to put on a starring show against Eddie Jones' record-chasing England on Saturday if he is to convince Warren Gatland he deserves a seat on the plane.\nThe Lions chief has already stated this week that while he has been pleased by Russell's Murrayfield displays, it is on the road he wants to see them shine as he draws up a plan to shoot down the All Blacks in their own back yard.\nFinn Russell (left) has been told to grasp the opportunity to stake his case for a Lions place\nFormer Scotland centre Scott Hastings has been impressed by the development of Russell\nRussell will be in the Scotland side looking to beat England at Twickenham on Saturday\nSIX NATIONS STANDINGS Points England 13 Ireland 10 Scotland 9 Wales 5 France 5 Italy 0\nHastings - twice a Lions tour member, winning two Test caps against Australia in 1989 - fears candidates such as Ireland's Johnny Sexton, the English pair of George Ford and Owen Farrell, and Wales fly-half Dan Biggar have stolen a march on the Scot in the battle for the number 10 slot.\nNow the ITV commentator has urged Russell to take his chance on the biggest stage the RBS 6 Nations has to offer and prove he can provide the spark the others cannot.\nHastings said: 'This is Finn's chance to show he's ready to become a Lion. After his performances in the first two games he wouldn't have been in the mix - but his performance against Wales was much improved.\n'He outshone Dan Biggar, whose own performance against England would have been enough to put him in a Lions squad. However, it is about consistency and for Finn, he has to back what he did a fortnight ago.\nLions chief Warren Gatland has already stated that he has been pleased by Russell's displays\n'I think everyone realises that Sexton is out there as the number one 10 right now. The Ford/Farrell axis is absolutely crucial to England's game at the moment. Farrell also gives you an option at fly-half, so there is your three picks already.\n'However with Biggar and Finn knocking at the door, it is up to Finn to force Gatland's thought process on whether he can take a risk on him.\n'There is a good charisma around Finn but also the odd question mark. There is some immaturity in his play. His tactical kicking is not always as good as it should be at times and he is about to go into a cauldron, which is a big challenge.\n'Big players deliver on the big stage and Saturday is Finn's opportunity to show he is a big player.'\nHastings was part of Scotland teams who came close to ending their Twickenham hoodoo\nIt is 34 years since a Scottish XV last sacked London and emerged victorious, but Hastings was part of two squads which came closer than most in the capital - first earning a 12-12 draw in 1989 before letting the opportunity of a rare Grand Slam success slip through their fingers in 1995 when they went down 24-12. He hopes this is the year the Scots finally end the hoodoo.\nHe said: 'The record has got to crack some day but what a great opportunity. If I was one of those players I'd be absolutely itching to get out there and try to take the game to England.\n'That's what the '83 squad did and that's what every other side since have been trying to do but haven't quite managed it. In '89 we came close, while in '95 we had the chance to win a Grand Slam but didn't take our chances.\n'There were opportunities in those games and if Scotland can take theirs this week, they will have a great shout.'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4300796/Finn-Russell-urged-cement-Lions-spot-Twickenham.html"}
