{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:16:33","date_modify":"2018-10-30 22:16:33","date_publish":"2016-12-14 00:00:00","description":"Scalable's total assets are growing at a rate of between €3 million and €5 million each week.","filename":"data/vaneerConsumption/FintechroboadvisorScalableCapitalhits100millioninassets.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fintech-robo-advisor-scalable-capital-hits-100-million-in-assets-2016-12_1540937793.html","title":"Fintech 'robo advisor' Scalable Capital hits €100 million in assets","title_page":"    Fintech 'robo advisor' Scalable Capital hits €100 million in assets - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Scalable Capital's UK team, with Adam French pictured far left. Scalable Capital LONDON — Scalable Capital, a so-called \"robo advisor\" online wealth manager, has passed over €100 million (£83.8 million) in assets less than a year after launching.\nThe startup, which launched in Germany 10 months ago and Britain 4 months ago, announced the milestone in a press release on Wednesday.\nScalable's total assets are growing at a rate of between €3 million (£2.4 million) and €5 million (£4.1 million) each week and the company claims this makes it one of the fastest growing digital investment managers in Europe. Business Insider reported in September that it was attracting around €4 million in deposits each week.\nAdam French, cofounder of Scalable Capital and CEO of its UK business, says in an emailed statement: \"Reaching this milestone so quickly underlines the trust our clients put into us. Our growth story is just getting started, and we look forward to more success in 2017 as we build on strong momentum in the UK and our market-leading offering in Germany.\"\nOver half of Scalable's clients have opted for a monthly savings plan, making regular contributions to their accounts of €500 a month on average. These automated payments help explain Scalable's rapid growth.\nThe company has over 2,500 customers, up from 1,600 in September, with an average of €42,000 (£35,220) in their accounts. The average age of Scalable's clients is 42 and bankers are the largest professional grouping, representing 20% of customers.\nScalable Capital's typical customer earns €120,000 (£100,627) a year and has a net worth of €250,000 (£209,600) to €1 million (£840,000), according to a presentation the company gave in September.\nFrench, a former Goldman Sachs banker, says in the emailed statement: \"Within four to five months they [clients] have typically gained enough trust to already double their investment amount.\"\nScalable Capital, which is headquartered in Munich but has an office in London, is a so-called \"robo advisor,\" a fintech startup that automatically invests people's money.\nAt the heart of its model is an investment algorithm that forecasts risks and then automatically optimises people's portfolios on the fly to limit losses.\nDr. Ella Rabener, CMO and UK cofounder of Scalable Capital, says in Wednesday's statement: \"The majority of our clients work with data, formulas or software on a daily basis. They understand the quality and cost benefits of a technology-driven investment approach.\"\nScalable counts at least four Goldman employees among its founding team, as well as the former VP of Barclays Capital and a former associate partner of consultancy McKinsey. It has raised £8.8 million in funding and is regulated by both Germany's BaFin and the Financial Conduct Authority (FCA) in the UK, meaning it is unaffected by Brexit.","url":"https://www.businessinsider.com/fintech-robo-advisor-scalable-capital-hits-100-million-in-assets-2016-12"}
