{"authors":["Associated Press"],"date_download":"2018-10-23 04:46:03","date_modify":"2018-10-23 04:46:03","date_publish":"2017-03-10 14:54:29","description":"FLORENCE, Italy (AP) - Fiorentina unveiled plans Friday for a new stadium, which it hopes to be playing in by 2021.The new stadium will seat 40,000 people,...","filename":"data/vaneerConsumption/Fiorentinaunveilsplansfornew40000seatstadium.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196683-1489159453-293_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301568_Fiorentina-unveils-plans-new-40-000-seat-stadium_1540269963.html","title":"Fiorentina unveils plans for new 40,000-seat stadium","title_page":"Fiorentina unveils plans for new 40,000-seat stadium | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FLORENCE, Italy (AP) - Fiorentina unveiled plans Friday for a new stadium, which it hopes to be playing in by 2021.\nThe new stadium will seat 40,000 people, with the closest fans being only seven meters from the field.\nThe 420 million euro ($447 million) project will regenerate an area in a northwestern suburb of Florence and also includes a shopping center, a hotel and new transport links.\nFiorentina's owner Diego Della Valle, left, Florence's mayor Diego Nardella, center, and Fiorentina's executive president Mario Cognini, right, look at a plastic model of the new stadium in Florence, Italy, Friday, March 10, 2017. Fiorentina has unveiled plans for a new stadium on Friday, which it hopes to be playing in by 2021. The new stadium will seat 40,000 people, with the closest fans being only seven meters from the field. (Maurizio Degl'Innocenti/ANSA via AP)\n\"It's a historic moment. We're presenting an important project for Florence and for all of Italy. It will be a sort of Purple Renaissance,\" Fiorentina owner Andrea Della Valle said.\nPurple is the color of Fiorentina, which is nicknamed the Viola.\nThe first brick is expected to be laid in 2019, with construction taking two years.\n\"We are resolving the last small problems. I imagine that we'll need four years to finish everything,\" said Della Valle, who added that the club is still looking for financial investors for the project.\nOnly three other Italian teams have their own stadiums. The Juventus Stadium was the first when it was inaugurated on Sept. 8, 2011. Sassuolo owner Giorgio Squinzi's company bought his team's stadium in 2013, while Udinese opened its own ground earlier this year.\nRoma's long-delayed stadium plans were given the green light by Rome Mayor Virginia Raggi recently, prompting Lazio to say it wanted its own stadium, too.\n\"Many clubs are trying and that's a good thing. We're one of them and we're moving forward quickly,\" Della Valle said. \"People are talking about Roma's new stadium. We're even further ahead and this is a great opportunity for change for Italian football, which is very behind in this aspect.\n\"Between the stadium and the surrounding area, it's a project of hundreds and hundreds of millions. We really wanted to do something for this city, which deserves it.\"\nAlso at the presentation were Italian sports minister Luca Lotti, Fiorentina President Mario Cognigni and Florence Mayor Dario Nardella.\n\"The stadium will not be a cathedral in the desert,\" Nardella said. \"The redevelopment of the northwestern area will be total.\n\"It will also create 3,000-4,000 jobs. There's a nine-out-of-10 chance it'll be completed.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4301568/Fiorentina-unveils-plans-new-40-000-seat-stadium.html"}
