{"authors":["Yuki Noguchi"],"date_download":"2018-10-23 05:49:54","date_modify":"2018-10-23 05:49:54","date_publish":"2015-09-26 00:00:00","description":"The former Hewlett-Packard CEO defended her business record in the latest Republican presidential debate. But is her past an asset or a hindrance?","filename":"data/vaneerConsumption/FiorinaAsCEOColossalFailureOrTheRightLeader.json","image_url":"https://media.npr.org/assets/img/2015/09/25/ap_930634580606_wide-8dd4abd3e1a6b7d085ed8b03310683993174029c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_09_26_443409390_fiorina-as-ceo-colossal-failure-or-the-right-leader_1540273794.html","title":"Fiorina As CEO: 'Colossal Failure' Or 'The Right Leader'?","title_page":"Fiorina As CEO: 'Colossal Failure' Or 'The Right Leader'? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Fiorina As CEO: 'Colossal Failure' Or 'The Right Leader'?\nEnlarge this image toggle caption Mark J. Terrill/AP Mark J. Terrill/AP\nA strong showing during the Sept. 16 debate has put Carly Fiorina at the top of a crowded field of Republican presidential candidates. But in the corporate world, another debate remains: Fiorina's business record.\nDonald Trump says as a businesswoman, Fiorina would be unqualified to lead one of his companies.\nEnlarge this image toggle caption Chris Preovolos /AP Chris Preovolos /AP\n\"The head of the Yale business school, Jeffrey Sonnenfeld, wrote a paper recently (calling it), 'one of the worst tenures for CEOs that he has ever seen,'\" Trump says.\nSonnenfeld's actual title is senior associate dean, but he says the rest is true: \"Her business record is a colossal failure.\"\nFiorina, the daughter of a law professor-turned-judge, rose quickly at AT&T, becoming its first female senior vice president, then later president of its spinoff, Lucent. Lucent was a business supernova; it burned bright, then faded soon after she left. Part of its downfall lay in questionable-but-legal accounting that boosted revenues by loaning money to its customers.\nStill, Sonnenfeld, along with many others, say Fiorina's biggest misstep was the expensive and unprofitable merger with Compaq. He says the highly controversial, strategically misguided deal she muscled through dragged the company and its stock down.\n\"Stapling together the carcasses of failing businesses is not a successful track record,\" Sonnenfeld says.\nStill, Sonnenfeld says, executives often fail.\nCarly Fiorina's Career: 1980 - Begins working at AT&T as an entry-level sales representative\nBegins working at AT&T as an entry-level sales representative 1990 - Becomes AT&T's first female officer as senior vice president\nBecomes AT&T's first female officer as senior vice president April 1996 - Oversees Lucent Technologies Inc. $3 billion initial public offering\nOversees Lucent Technologies Inc. $3 billion initial public offering 1998 - Becomes president of Lucent Technologies' global service-provider division\nBecomes president of Lucent Technologies' global service-provider division 1998 - Tops Fortune magazine's list of the 50 most powerful businesswomen, maintains the lead six years in a row\nTops Fortune magazine's list of the 50 most powerful businesswomen, maintains the lead six years in a row 1999 - Becomes CEO of Hewlett-Packard\nBecomes CEO of Hewlett-Packard 2000 - HP names Fiorina chair of the board\nHP names Fiorina chair of the board Sept. 3, 2001 - Orchestrates sale of Compaq Computer Corp. to Hewlett-Packard despite opposition from the Hewlett and Packard families\nOrchestrates sale of Compaq Computer Corp. to Hewlett-Packard despite opposition from the Hewlett and Packard families Feb. 8, 2005 - Resigns as H-P CEO\nResigns as H-P CEO Oct. 2007 - Becomes commentator on the Fox Business Network\nBecomes commentator on the Fox Business Network 2008 - Works as an economic adviser for John McCain's presidential campaign team\nWorks as an economic adviser for John McCain's presidential campaign team Nov. 2, 2010 - Loses bid to unseat Sen. Barbara Boxer (D-Calif).\nLoses bid to unseat Sen. Barbara Boxer (D-Calif). 2014 - Launches a political action committee, the Unlocking Potential Project, specifically targeted to tell women voters about conservative positions\nLaunches a political action committee, the Unlocking Potential Project, specifically targeted to tell women voters about conservative positions Feb. 24, 2015 - Carly for America, a super PAC to support Fiorina's presidential campaign, is launched by supporters\nCarly for America, a super PAC to support Fiorina's presidential campaign, is launched by supporters May 4, 2015 - Announces candidacy for president — Kylie Mohr\n\"Leaders go through adversity and we benefit from their failures because they come back from it and tell us how to get through it. But she doesn't, because she doesn't acknowledge it,\" Sonnenfeld says.\nHe believes that instead of accepting criticism, she shoots the messenger. It's a failure of character and leadership, he says.\n\"I get shot at as a result,\" Sonnenfeld says.\nFormer Compaq-turned HP senior vice president Bill Mutell bucks the critics.\n\"She was the right leader at the right time,\" he says.\nMutell, who has not contributed to her campaign, calls Fiorina a leader with character, courage and conviction. He argues the merger was a success that shored up both companies.\n\"Had that merger not occurred, I'm almost certain that [neither] company wouldn't be here today,\" Mutell says.\nMuch of the debate over her corporate performance boils down to two disparate views of HP's woes. Her critics attribute them to her decisions and leadership; her supporters — and Fiorina herself — blame the times.\n\"I led Hewlett-Packard through a very difficult time, the worst technology recession in 25 years,\" Fiorina says.\nTom Perkins is a Silicon Valley venture capitalist and former HP board member who, at the time, voted to fire Fiorina. But in a full-page ad in the New York Times paid for by a PAC supporting Fiorina, he defended her record and leadership.\nMuch of the political criticism of Fiorina's career stems from the 30,000 layoffs soon after the Compaq merger.\nHer eventual successor at HP, Meg Whitman — who, like Fiorina, has run for office in California — has defended that decision.\n\"When Carly made those reductions it was probably — I wasn't here, but I suspect she was trying to do in some ways what I have tried to do, which is to make this company more competitive,\" Whitman told CNN Money in June.\nEnlarge this image toggle caption Richard Drew/AP Richard Drew/AP\nShe says the price of inaction would've been far greater.\nIs Fiorina facing more flack as a female running for office? Yale professor Jeffrey Sonnenfeld points to other strong female contemporaries, saying gender was not Fiorina's issue. She was fired by HP chairwoman Patricia Dunn. Sonnenfeld argues her contemporaries — now IBM CEO Ginni Rometty and former Xerox CEO Anne Mulcahy — have better records.\n\"I do think that there are some added challenges that women CEOs have had, but it doesn't seem to be relevant in the particular case of Carly Fiorina,\" Sonnenfeld says.\nBut that, like everything else, is likely still up for debate.","url":"https://www.npr.org/2015/09/26/443409390/fiorina-as-ceo-colossal-failure-or-the-right-leader"}
