{"authors":["Associated Press"],"date_download":"2018-10-23 04:34:31","date_modify":"2018-10-23 04:34:31","date_publish":"2016-01-11 17:34:21","description":"CLEVELAND (AP) — Celebrity chef and cookbook author Michael Symon says a fire over the weekend has significantly damaged one of his first restaurants in his ...","filename":"data/vaneerConsumption/FiredamagescelebritychefMichaelSymonsOhiorestaurant.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:1ce5f743fa03439fbfe7c103c27a299e-48qEJGFphM8d437f0aaf9276d9ec-736_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394281_Fire-damages-celebrity-chef-Michael-Symons-Ohio-restaurant_1540269271.html","title":"Fire damages celebrity chef Michael Symon's Ohio restaurant","title_page":"Fire damages celebrity chef Michael Symon's Ohio restaurant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fire damages celebrity chef Michael Symon's Ohio restaurant\nCLEVELAND (AP) — Celebrity chef and cookbook author Michael Symon says a fire over the weekend has significantly damaged one of his first restaurants in his hometown of Cleveland.\nThe host of ABC's \"The Chew\" says he's glad no one was hurt in Sunday's fire. Investigators think it started near an oven and don't suspect it was arson.\nCleveland's fire department says the fire at Lolita started on the first floor and destroyed offices upstairs.\nFILE - In this Aug. 26, 2011, file photo, audience members applaud while Iron Chef Michael Symon, co-host of ABC's \"The Chew,\" foreground, starts a segment during a rehearsal for the show in New York. Celebrity chef and cookbook author Symon said a fire Sunday, Jan. 10, 2016, has significantly damaged one of his first restaurants in his hometown of Cleveland. (AP Photo/Tina Fineberg, File)\nSymon opened his first solo restaurant in the building in 1997 and later converted the space into Lolita.","url":"https://www.dailymail.co.uk/wires/ap/article-3394281/Fire-damages-celebrity-chef-Michael-Symons-Ohio-restaurant.html"}
