{"authors":[],"date_download":"2018-10-23 00:48:46","date_modify":"2018-10-23 00:48:46","date_publish":"2016-01-11 10:36:27","description":"A fire at the office of an Israeli NGO that champions human rights in the occupied Palestinian territories led to suspicions of arson Monday, but was later a...","filename":"data/vaneerConsumption/FireinofficeofIsraeliNGOchampioningPalestinianrights.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z6h4-48qEJGFphM8d437f0aaf9238ddd5-179_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393458_Fire-office-Israeli-NGO-championing-Palestinian-rights_1540255726.html","title":"Fire in office of Israeli NGO championing Palestinian rights","title_page":"Fire in office of Israeli NGO championing Palestinian rights | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fire in office of Israeli NGO championing Palestinian rights\nA fire at the office of an Israeli NGO that champions human rights in the occupied Palestinian territories led to suspicions of arson Monday, but was later attributed to a suspected electrical fault.\nThe blaze extensively damaged the Jerusalem office of the group B'Tselem, though there were no injuries as the premises were empty at the time, a spokeswoman for the NGO said in a statement.\n\"A fire broke out at B'Tselem's office in Jerusalem this evening. None of our staff were in the building,\" Sarit Michaeli said on Sunday night.\nFiremen arrive at the building in Jerusalem that houses Israeli rights group B'Tselem office, after a fire broke out overnight on January 10, 2016 ©Menahem Kahana (AFP)\nInitial media reports suggested it could have been an arson attack at a time of tensions between rights activists and right-wing Israeli groups, but the fire department later told B'Tselem it was a suspected electrical fire.\n\"The fire brigade made an official announcement to us and as far as we are concerned that is what we needed to hear,\" Michaeli told AFP Monday.\n\"We are relieved and happy that this is what it was and are going to start cleaning up ASAP.\"\nShe said the fire would not stop the organisation's work of documenting and exposing human rights abuses.\nOn Monday morning the building was sealed off, with forensic teams in white jumps suits carrying bags of evidence out of the offices.\nWindows were smashed along the right side of the building where B'Tselem's offices are located, while other areas appeared to have sustained little damage.\nThe NGO said they had not yet been given access to the building or know the extent of the damage to their archives.","url":"https://www.dailymail.co.uk/wires/afp/article-3393458/Fire-office-Israeli-NGO-championing-Palestinian-rights.html"}
