{"authors":[],"date_download":"2018-10-22 23:09:36","date_modify":"2018-10-22 23:09:36","date_publish":"2016-01-11 04:56:28","description":"Cooler temperatures and easing winds Monday helped firefighters contain a bushfire that killed two people and razed 143 properties, with clean-up efforts get...","filename":"data/vaneerConsumption/FirefighterscontaindeadlyAustralianbushfire.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5tn-48qEJGFphM8d437f0aaf9207b280-342_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393323_Firefighters-contain-deadly-Australian-bushfire_1540249776.html","title":"Firefighters contain deadly Australian bushfire","title_page":"Firefighters contain deadly Australian bushfire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Firefighters contain deadly Australian bushfire\nCooler temperatures and easing winds Monday helped firefighters contain a bushfire that killed two people and razed 143 properties, with clean-up efforts getting underway.\nThe inferno, sparked by lightning six days ago, burnt through 71,000 hectares (175,000 acres) in Western Australia state, leaving a trail of destruction, the latest in a series of summer blazes that have so far left eight people dead.\n\"The weather conditions are great today and they were in the last 24 hours so we have been able to essentially contain this fire,\" Western Australia's Emergency Services Minister Joe Francis told national radio.\nFireman inspect the damage near Waroona, 70 miles south of Perth, after a huge bushfire which has razed about 71,000 hectares in Western Australia state ©Department of Fire and Emergency (Department of Fire and Emergency/AFP)\n\"It's not totally under control yet but we are very optimistic about the next 24 hours as well.\"\nAlert levels have been downgraded from emergency to watch and act for towns in the area including Waroona, Hamel and Yarloop, a historic mill community some 110 kilometres (70 miles) south of Perth where two bodies were found in the blackened ruins of burnt-out houses.\nThe fire, one of the worst to hit the region in recent years, destroyed 143 properties, including 128 homes in Yarloop which was virtually flattened, the state's Department of Fire and Emergency Services (DFES) said.\nWestern Australia's state premier Colin Barnett has declared a natural disaster, giving residents access to greater financial support, with the Insurance Council of Australia estimating losses of at least Aus$60 million (US$42 million).\nFrancis said he was \"exceptionally proud\" of the efforts of hundreds of firefighters, many of them volunteers.\n\"They put themselves through significant danger to get through some exceptionally difficult fires to save people's lives,\" he said.\nBushfires are common in Australia's hotter months, with four deaths in Western Australia in November. Another two people perished in neighbouring South Australia state in the same month.\nDFES commissioner Wayne Gregson warned on Sunday that the worst of the bushfire season was yet to come.\n\"There is still another 10 or more weeks to go in what is predicted to be a difficult bushfire season,\" he said.\nAustralia's worst firestorm in recent years devastated parts of the southern state of Victoria in 2009, destroying thousands of homes and killing 173 people.","url":"https://www.dailymail.co.uk/wires/afp/article-3393323/Firefighters-contain-deadly-Australian-bushfire.html"}
