{"authors":[],"date_download":"2018-10-22 21:57:45","date_modify":"2018-10-22 21:57:45","date_publish":"2014-06-07 12:54:10","description":"With heavy fire spreading through the three-story house and to a home next door, firefighters broke the car's two front windows and fed their fire hose through.","filename":"data/vaneerConsumption/FirefightersBustOutWindowsofCarBlockingHydrant.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_firefighters-bust-out-windows-car-blocking-hydrant-n125201_1540245465.html","title":"Firefighters Bust Out Windows of Car Blocking Hydrant","title_page":"Firefighters Bust Out Windows of Car Blocking Hydrant","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBC 10 in Philadelphia\nIf you needed a reason not to park in front of a fire hydrant, here's one: you might get your windows broken.\nFirefighters in Wilmington, Del. responded to a blaze along the 800 block of Van Buren Street at 11:21 a.m. on Friday to find the street's fire hydrant blocked by a white Ford Fusion sedan.\nWith heavy fire spreading through the three-story house and to a home next door, the firefighters broke the car's two front windows and fed their fire hose through to get water flowing.\nParking within 15 feet of a fire hydrant in Wilmington is illegal, according to the city's parking regulations.\nFire crews were able to get the blaze under control about 40 minutes later, officials said. No one was inside the homes at the time of the fire, but a dog was killed.\nA firefighter also suffered heat exhaustion and was taken to Christiana Hospital for treatment, officials said. He was later released.\nAs for the car, officials said police issued a ticket and that it was set to be towed.\nRelated content:\nCaught on Video: Explosive Blows Apart Coke Machine","url":"https://www.nbcnews.com/news/us-news/firefighters-bust-out-windows-car-blocking-hydrant-n125201"}
