{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 01:00:02","date_modify":"2018-10-23 01:00:02","date_publish":"2017-03-10 08:29:03","description":"An ICO investigation traced the automated calls to Adam Mangan's company Road Accident Consult, trading as Media Tactics, based in Basingstoke, Hampshire.","filename":"data/vaneerConsumption/Firmfined270kformaking22MILLIONnuisancecalls.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21A17800000578-0-image-a-9_1489134365724.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300372_Firm-fined-270-000-making-22-MILLION-nuisance-calls_1540256402.html","title":"Firm fined £270k for making 22 MILLION nuisance calls","title_page":"Firm fined £270k for making 22 MILLION nuisance calls | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An ICO investigation traced the automated calls to Adam Mangan's (pictured) company Road Accident Consult, in Basingstoke\nA sales company which made 22million nuisance calls has been fined £270,000 by the - one of the largest penalities of its kind ever issued.\nAn Information Commisioner's Office investigation traced the automated calls to Adam Mangan's company, Road Accident Consult, which was trading as Media Tactics, based in Basingstoke, Hampshire.\nThey found that Mangan, 49, issued pre-recorded phone messages related to a variety of subjects including PPI, personal injury claims and debt management.\nThe Times reports that the company, which made profits of £445,000 over the last two years, got the victims' telephone numbers from websites including payday loan and insurance brokers, a prize-draw site and even a music streaming service.\nBut Mr Mangan claimed the company was allowed to make the calls - because privacy notices on the sites said the information they collected could be passed on to third parties.\nAn ICO spokesman explained that automated marketing calls which play a recorded message can only be made to people who have specifically agreed to receiving such calls and said that Media Tactics did not have necessary permission.\nSteve Eckersley, ICO head of enforcement, said: 'These 22 million pre-recorded calls will have left many people feeling frustrated.\nThe investigation found he comapyn issued pre-recorded phone messages related to a variety of subjects including PPI, personal injury claims and debt management\n'But some people found them alarming and distressing - we heard from one complainant who found the calls depressing and another who was too frightened to answer any calls at all.'\nThe ICO's investigation was sparked by 182 complaints made to their online reporting tool.\nMedia Tactics told the ICO's enforcement team that it had bought data from other firms and believed the people on the lists had consented to being contacted.\nThe phone numbers were sourced from a range of websites including discount and prize draw websites, pay day loans and insurance brokers and an electronic cigarette seller.\nMedia Tactics (offices pictured) told the ICO's enforcement team that it had bought data from other firms and believed the people on the lists had consented to being contacted\nPeople agreed to their details being shared with 'third parties whose offers we think might interest you'.\nBut the ICO found that the privacy notices on the websites were inadequate as some included long lists of general categories of organisations to which the data would be disclosed including astrology, debt collection, fashion and leisure, legal services and general marketing.\nIn addition to the fine, one of the highest the ICO has issued for nuisance calls, Media Tactics has also been given a legal notice compelling it to stop making unlawful calls and failure to comply could result in court action.","url":"https://www.dailymail.co.uk/news/article-4300372/Firm-fined-270-000-making-22-MILLION-nuisance-calls.html"}
