{"authors":["Breitbart Texas"],"date_download":"2018-10-30 19:59:46","date_modify":"2018-10-30 19:59:46","date_publish":"2016-09-06 20:53:46","description":"One of the largest oil producers in the U.S. is purchasing a privately-held New Mexico company in a $2.5 billion deal.","filename":"data/vaneerConsumption/FirmtoExpandWestTexasEnergyExplorationwith25BDeal.json","image_url":"https://media.breitbart.com/media/2016/09/wi/afp_84fc9451ce3cc8bcc9925887b4eb4c12d3ac5dd2-e1473195170766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_09_06__1540929586.html","title":"Firm to Expand West Texas Energy Exploration with $2.5B Deal","title_page":"Firm to Expand West Texas Energy Exploration with $2.5B Deal","title_rss":"NULL","source_domain":"breitbart.com","text":"ASSOCIATED PRESS — One of the largest oil producers in the U.S. is purchasing a privately-held New Mexico company and some of its subsidiaries in a $2.5 billion deal that will expand its footprint in major energy-producing basins in the West.\nHouston-based EOG Resources, Inc. announced the agreement with Yates Petroleum on Tuesday.\nCompany officials say the transaction will clear the way for the development of premium wells at low costs in the Delaware Basin that spans parts of West Texas and southern New Mexico and the Powder River Basin in Montana and Wyoming.\nEOG is welcoming Yates’ 300 employees and will continue the company’s decades-long presence in southeastern New Mexico.\n“This really isn’t about getting bigger. It’s about getting better. Yates improves the quality and depth of our acreage in some of the most important resource plays in the United States,” EOG chairman and chief executive Bill Thomas said during a conference call Tuesday morning.\nWith the transaction, which is expected to close in early October, EOG will see its acreage position increase by 78 percent in the Delaware Basin alone and acreage in the Power River Basin will double to 400,000 acres.\nThomas called the transaction a “gem,” saying it will allow EOG to concentrate more of its capital in premium parts of the basins, which will drive higher returns in the future.\nYates drilled its first commercial oil well on New Mexico state trust land in 1924 and has assets that includes more than 1.6 million net acres that stretch from New Mexico and Colorado to Utah, Wyoming, Montana and North Dakota.\nYates produces nearly 30,000 barrels a day and has proved reserves of 44 million barrels.\nJohn Yates Sr., chairman emeritus of Yates Petroleum Corp. and son of founder Martin Yates Jr. said EOG was the partner of choice as company officials looked to extend Yates’ 93-year history.\n“As we enter a new era of unconventional resource development, we are excited to join forces with another pioneering company like EOG,” Yates said in a statement.\nEOG plans to start drilling on the Yates acreage later this year with additional rigs added in 2017.\nUnder the deal, EOG will issue shares of common stock valued at $2.3 billion and pay $37 million in cash. EOG also will assume $245 million of Yates debt that will be offset by $131 million in cash anticipated from the New Mexico company.\nFollow Breitbart Texas on Twitter @BreitbartTexas.","url":"https://www.breitbart.com/border/2016/09/06/firm-expand-west-texas-energy-exploration-2-5b-deal/"}
