{"authors":["David Smith"],"date_download":"2018-10-30 18:05:07","date_modify":"2018-10-30 18:05:07","date_publish":"2015-04-16 02:19:00","description":"A Florida energy firm has agreed to build a 500-acre solar energy park in Arkansas County to provide electricity for Entergy Arkansas, the utility said Wednesday.","filename":"data/vaneerConsumption/Firmtobuild500acresolarfarm.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_apr_16_firm-to-build-500-acre-solar-farm-20150__page=2_1540922707.html","title":"Firm to build 500-acre solar farm","title_page":"Firm to build 500-acre solar farm","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A Florida energy firm has agreed to build a 500-acre solar energy park in Arkansas County to provide electricity for Entergy Arkansas, the utility said Wednesday.\nPhoto by Arkansas Democrat-Gazette\nA map showing the location of the proposed 500-acre solar farm.\nNextEra Energy Resources of Juno Beach, Fla., an affiliate of Florida Power & Light Co., will build the 81-megawatt solar farm. The cost of the operation has not been disclosed.\nNextEra bills itself as the largest generator of renewable energy in the world.\nEntergy Arkansas has agreed to buy all of the power produced by the facility, known as Stuttgart Solar. It will be located about seven miles southeast of Stuttgart, near Almyra.\nMany utilities need to do something to offset coal production and work toward compliance with the Environmental Protection Agency's Clean Power Plan, said David Cruthirds, a Houston-based regulatory attorney.\n\"Solar has dropped in price [in part] because the technology is more efficient,\" Cruthirds said. \"I think Entergy is continuing to try to learn about solar, and this is one way for them to do that.\"\nEntergy filed a request with the Arkansas Public Service Commission on Wednesday asking it to approve the agreement for the solar farm.\nIf it is approved, construction would begin on the project next year and be completed in mid-2019, Entergy said. It will generate enough energy to power about 13,000 homes, the utility said.\nThe solar park will consist of tens of thousands of solar panels oriented to the south, said Steven Stengel, a spokesman for NextEra.\n\"That is so they can capture as much of the sunlight as possible throughout the day,\" Stengel said.\nNextEra probably won't use the entire 500 acres for the solar panels, but the majority of the land will be used, Stengel said.\nArkansas will be the 26th state where NextEra has a generating plant, Stengel said.\nEntergy will build a new electric substation in Arkansas County to connect the solar facility to Entergy's transmission system.\nEntergy issued requests for proposals for new electricity generation last year, said Hugh McDonald, Entergy Arkansas' chief executive officer.\n\"I think it makes sense for our customers long term,\" McDonald said. \"[NextEra] will be making the physical investment of the facility.\"\nEntergy's agreement with NextEra is for 20 years and fixes the energy price for the full term of the pact, Entergy said.\nIt is advantageous that Entergy has agreed to buy the power from NextEra, Cruthirds said.\n\"That helps stimulate the market,\" Cruthirds said. \"If it were Entergy building the solar farm itself, that wouldn't necessarily be helping the competitive market.\"\nIn addition to the solar project, Entergy Arkansas plans to invest $2.4 billion from 2014 to 2017 on generation, transmission and distribution improvements to the state's electrical infrastructure.\nThat investment includes about $237 million Entergy Arkansas has agreed to pay for a fourth of the 2,200 megawatt Union Power Station, McDonald said. The company also plans to build transmission lines throughout the state, including spending more than $60 million for a transmission system in southeast Arkansas.\nEntergy Arkansas has about 700,000 customers in 63 counties in the state.\nBusiness on 04/16/2015","url":"https://www.arkansasonline.com/news/2015/apr/16/firm-to-build-500-acre-solar-farm-20150/?page=2"}
