{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:15:02","date_modify":"2018-10-30 21:15:02","date_publish":"2015-08-09 19:31:16","description":"The son of late R&B legend Marvin Gaye is reportedly planning to file a lawsuit against the creators of the Fox television series Empire.","filename":"data/vaneerConsumption/FirstBlurredLinesNowEmpireMarvinGayesSonPlansLawsuitAgainstFoxforStealingHitShow.json","image_url":"https://media.breitbart.com/media/2015/03/ap_marvin-gaye_ap-photo-1024x655.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_08_09__1540934102.html","title":"First 'Blurred Lines,' Now 'Empire?' Marvin Gaye's Son Plans Lawsuit Against Fox for Stealing Hit Show","title_page":"First 'Blurred Lines,' Now 'Empire?' Marvin Gaye's Son Plans Lawsuit Against Fox for Stealing Hit Show","title_rss":"NULL","source_domain":"breitbart.com","text":"The son of late R&B legend Marvin Gaye is reportedly planning to file a lawsuit against the creators of the Fox mega-hit television series Empire, claiming they stole his idea for the show.\nAccording to TMZ, Marvin Gaye III claims he registered a show called Diamonds & Ballads aka Those Sons of Riches! with the Writers Guild of America in 2010, and that Empire creator Lee Daniels ripped off his idea.\nTMZ reports:\nGaye says the treatment describes a family in the music business — “a music based ‘black’ and ‘hip’ version of ‘Dynasty’ … with a little ‘Sopranos.'” We’re told Gaye shopped the treatment around to TV execs and said it was loosely based on the lives of his legendary family and the Berry Gordy family. Gaye insists the people in the industry with whom Lee Daniel’s associates received emails pitching his treatment. And Gaye feels Daniels unwittingly fessed up in 2014 after “Empire” hit big, when he said, “I wanted to make a black ‘Dynasty.'” He also said it was similar to “The Sopranos.”\nGaye’s family successfully sued musicians Robin Thicke and Pharrell Williams for copying the singer’s 1977 song “Got to Give it Up” for their massive hit “Blurred Lines” in 2013. The family was initially awarded $7.4 million in damages before a judge cut the penalty to $5.3 million and rejected the defendants’ petition for a new trial last month.\nThicke and Williams are reportedly expected to appeal the judgement in that case.\nMeanwhile, Gaye’s son plans to name Fox, Daniels and others in a new lawsuit, TMZ reports.\nEmpire shattered ratings records with its first season run, which ended in March. The second season returns to Fox on September 23.","url":"https://www.breitbart.com/entertainment/2015/08/09/first-blurred-lines-now-empire-marvin-gayes-son-plans-lawsuit-against-fox-for-stealing-hit-show/"}
