{"authors":[],"date_download":"2018-10-22 22:17:11","date_modify":"2018-10-22 22:17:11","date_publish":"2014-06-09 16:32:53","description":"Astronaut G. Reid Wiseman posted the first Vine from space after taking the six-second video aboard the International Space Station.","filename":"data/vaneerConsumption/FirstVineFromSpaceStationCatchesSunThatNeverSets.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/496866/140609-vice_from_space-jsw-1225p_75d468a016df766d049313b101ed17a1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_first-vine-space-station-catches-sun-never-sets-n126371_1540246631.html","title":"First Vine From Space Station Catches Sun That Never Sets","title_page":"First Vine From Space Station Catches Sun That Never Sets","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe social media space race has heated up after an astronaut posted the first-ever zero-gravity Vine in which he captured a rare view of a never-setting sun.\nThe six-second snapshot from flight engineer G. Reid Wiseman was taken aboard the International Space Station and shows the sun rising and setting –- but never dipping below the horizon.\n“1st Vine from space!,” Wiseman wrote on his tweet. “Single Earth orbit. Sun never sets flying parallel w/terminator line.”\nThe terminator line separates light from dark for an observer with his or her feet on solid ground. But from time to time the ISS lines up directly with the line during the space station’s 92-minute lap around Earth, creating the surreal effect seen in Wiseman’s video.\nWiseman is a native of Baltimore, Maryland, and a Navy pilot who was deployed during operations Enduring Freedom and Iraqi Freedom, according to his NASA bio page. He completed astronaut training in 2011 -– and his Twitter feed is chock full of amazing views of what the Earth looks like from way, way up.\nAstronauts aboard the ISS have made social media a part of their routine since 2009 when astronaut Mike Massimino sent a message to the Johnson Space Center that was then posted on his Twitter feed.","url":"https://www.nbcnews.com/science/space/first-vine-space-station-catches-sun-never-sets-n126371"}
