{"authors":[],"date_download":"2018-10-22 20:49:17","date_modify":"2018-10-22 20:49:17","date_publish":"2014-05-04 12:29:47","description":"The first funeral for passengers on missing Malaysia Airlines Flight MH370 was due to have taken place in Australia on Sunday.","filename":"data/vaneerConsumption/FirstFuneralMissingJetCoupleMournedinAustralia.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/418821/140504-rod-mary-burrows-malaysia-victims-830a_d6ff7a3df7ede975083bca18a9711692.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_first-funeral-missing-jet-couple-mourned-australia-n96586_1540241357.html","title":"First Funeral: Missing Jet Couple Mourned in Australia","title_page":"First Funeral: Missing Jet Couple Mourned in Australia","title_rss":"NULL","source_domain":"nbcnews.com","text":"“Family members and friends will gather together this Sunday, to celebrate the lives of Rod and Mary Burrows,\" the Burrows family said in that statement, released prior to the service.\n“It is requested media do not attend the church service which is a private and personal event and should not be recorded under any circumstances. Family and friends send their appreciation for the well wishes from the media and public but ask for privacy and request their solitude be respected during this difficult time.”\nIn March, the Burrows family spoke of their heartache, according to the Brisbane Times. Our family is trying to come to terms with this terrible tragedy,\" son Jayden Burrows said in a family statement. \"We dearly love and will miss our Mum and Dad.\"\nThe service was being held as one of Malaysia’s most senior police chiefs denied any link between the arrest of 11 alleged militants and the disappearance of Flight MH370.\nThe suspects, all aged between 22 and 55, were detailed in the Kedah and Selangor regions last week.\nAlastair Jamieson","url":"https://www.nbcnews.com/storyline/missing-jet/first-funeral-missing-jet-couple-mourned-australia-n96586"}
