{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 01:35:04","date_modify":"2018-10-23 01:35:04","date_publish":"2016-01-28 15:53:56","description":"The new State Car, nicknamed The Beast but also known as Limo One on secret service radio channels, appears to feature the same headlight and grille design as the new Cadillac models.","filename":"data/vaneerConsumption/Firstimagesofnewpresidentiallimoleakedasitundergoestopsecrettesting.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB5A5600000578-0-image-a-11_1453996165150.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420984_The-Beast-gets-upgrade-images-new-presidential-limo-leaked-undergoes-secret-testing_1540258504.html","title":"First images of new presidential limo leaked as it undergoes top-secret testing","title_page":"First images of new presidential limo leaked as it undergoes top-secret testing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Previous models included eight inches of armor, tear gas canisters, and even two pints of the President's blood\nDespite months of hard campaigning, we still have no idea who the next President is going to be.\nHowever, we do now have a slightly better idea of what our new Commander in Chief can be expected to drive around in after images of the new State Car were leaked online.\nWhile details of the vehicle itself are a closely-guarded secret, pictures show it sporting the grille and headlight design from the new Cadillac models.\nThe car, nicknamed The Beast, will likely debut on Inauguration Day in January 2017.\nThe new State Car, which will be used to transport the 45th President following their 2017 inauguration, has been pictured for the first time undergoing secret tests. While the car will eventually be black and silver, it has been painted with camouflage to disguise its new features\nThe new car will eventually be painted in the same black and silver as the current vehicle, but is covered with camouflage paint for the time being to disguise new features.\nWhite House officials put out contracts to build a new car, officially called the Presidential State Car but also known as Limo One over secret service radio, in 2013.\nWhile no car maker has claimed responsibility for building the new vehicle, according to Fox News public documents show General Motors has been awarded three contracts.\nDocuments also show that GM has been paid a total of $15million to develop the vehicle.\nThe White House is thought to maintain a fleet of around 12 of the cars, which are deployed around the world to protect the President, with each vehicle costing up to $1.5million each.\nWhile images of the new model are far from conclusive, it appears to be a Cadillac body strapped on to an elongated frame, much like previous models.\nWhile the security features of the new model are a closely guarded secret, the old model had tons of armor plating, run-flat tires, tear gas launchers, and even pints of blood for emergency transfusions\nEach of the doors of the current car are eight inches thick, weigh the same as the door of a Boeing 747 jet, and completely seal the cabin to prevent against chemical or biological attacks\nBut while the appearance of the car might be mundane from the outside, under the skin it is anything but ordinary.\nThe current state car is thought to weigh eight tons due to the huge amount of armor plating built into the frame.\nThe doors are around eight inches thick, each weigh the same as the door of a Boeing 747 jet, and completely seal the cabin to protect it from a chemical or biological attack.\nConcealed in the trunk is an oxygen supply that allows fresh air to be pumped into the cabin in the event that the air outside becomes toxic.\nAll of the windows are completely sealed and unable to roll down, except for the driver's side to allow him to pay tolls, and are able to withstand armor-piercing bullets and explosions.\nThe tires are coated in Kevlar to protect them from bursting, but even if they do, the metal rims are strong enough to hold up the vehicle and keep it rolling in case the outer layer is blown away.\nThe current car debuted in 2009 and is thought to cost up to $1.5million. It weighs around eight tons thanks to all the armor and has a maximum speed of 60mph, but can run in almost any conditions\nThe secret service is thought to maintain a fleet of around 12 of each presidential vehicle which are then handed to other government officials after being retired, with one usually stored in the library associated with the President who used it\nThe fuel tank is coated with armor plating and contains a special foam which expands on impact and prevents it from exploding, even if it suffers a direct hit.\nThe vehicle is also fitted with night vision cameras, GPS tracking and a satellite communication system to allow it to run in any conditions and make sure the President is always in contact.\nThere are even two pints of blood matching the President's type on board in case an emergency transfusion needs to be carried out at the roadside.\nConcealed within the bodywork is a full range of firefighting equipment, shotguns, night vision goggles and even tear gas launchers to help the vehicle get out of trouble.","url":"https://www.dailymail.co.uk/news/article-3420984/The-Beast-gets-upgrade-images-new-presidential-limo-leaked-undergoes-secret-testing.html"}
