{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:47:41","date_modify":"2018-10-30 21:47:41","date_publish":"2016-09-02 13:32:16","description":"After closing its original Sandy Springs location last month, Castellucci Hospitality Group reopened...","filename":"data/vaneerConsumption/FirstLookNewDoubleZeroopeninEmoryVillage.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_fi_1cabb6b8a4f5eed73267b91b530c24c8__1540936061.html","title":"First Look: New Double Zero open in Emory Village","title_page":"First Look: New Double Zero open in Emory Village","title_rss":"NULL","source_domain":"ajc.com","text":"After closing its original Sandy Springs location last month, Castellucci Hospitality Group reopened Double Zero Napoletana today in the former Ink & Elm space in Emory Village.\nWith the new location comes a shorter name, Double Zero , a new contemporary look with nods to Italian-American street culture, and a new menu with an emphasis on sharing and small plates.\nDuring a recent walk-through, Castellucci president Federico Castellucci III, who also conceived the Iberian Pig in Decatur and Cooks & Soldiers in West Midtown, talked about tweaking the Double Zero concept.\n“When we decided to make the move, we really wanted to do it in a way that was like a totally new life for Double Zero,” Castellucci said. “Basically, we decided to scrap everything and start over again from scratch. So I started thinking about the elements that were exciting about the culture of Southern Italy and how that blended with our family’s journey from Italy to the United States.\n“In Southern Italy, there’s this street culture that’s ultimately been transferred to the United States in New York City and the Lower East Side. I wondered what it would look like for us to do a modern Italian-American restaurant. Take some of that culture and the classic dishes, like Neapolitan pizza and fresh pasta, and some street food and small plates, and put a modern spin on it all.”\nCastellucci enlisted Atlanta design firm ai3 to transform the 7,000-square-foot space with those ideas in mind. The result is open kitchen, bar and dining areas that flow together with elements such as neon signs, storefront grates and custom murals by Atlanta street artist Greg Mike.\n“The space is a reflection of the concept with the murals and the neon installations, and taking what was here with the brick walls and the tiles and making it new-meets-old in sort of random ways,” Castellucci said.\nThe new menu from executive chef Edwin Molina features at least 15 small plates, plus meat and cheese plates, five pasta dishes, four wood-fired specialty pizzas, and a few large plates, including a 2-pound braised beef rib and a whole chicken.\nMafalda pasta with mushrooms, peas, veloute, fennel, and green onion. (BECKY STEIN PHOTOGRAPHY)\n“The menu being small plates-oriented, with pasta and pizza, makes it very much of a sharing experience,” Castellucci said. “That allows us to put out higher-quality food in a more casual atmosphere.\n“The menu has really expanded with the small plates. The toppings on the pizzas are all really unique. And I’m excited about the pasta program. They’re all fresh and handmade, and four of them are extruded with unique shapes. You don’t see a lot of that in Atlanta right now.”\nUltimately, though, Castellucci said the new Double Zero is about the old idea of Italian family-style dining.\n“The goal is to get people in large groups to come in and hit as many sections of the menu as possible,” he said. “The way I like to dine out is to try a lot of different flavors. When you’re saddled with an entree, I feel like you get palate fatigue. This way is so much more fun.”\n1577 N. Decatur Road, Atlanta. 404-991-3666.\nMore images from a Sneak Peek at the new Double Zero.\nVeal Cotoletta with honey, Calabrian hot sauce, celery and fennel is on the new small plate menu at Double Zero. (BECKY STEIN PHOTOGRAPHY)\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta.\nClick here to read about dining in Atlanta around the clock.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter. Find us on Instagram @AJC.","url":"https://www.ajc.com/blog/atlanta-restaurants/first-look-new-double-zero-open-emory-village/S9RVsPhTfl4G9kg3RIzc9K/"}
