{"authors":[],"date_download":"2018-10-30 21:44:52","date_modify":"2018-10-30 21:44:52","date_publish":"2015-09-01 04:00:00","description":"Known for his popular Ray’s seafood and steak restaurants in Sandy Springs and Alpharetta, Ray Schoenbaum founded Rio Bravo Cantina in 1984.","filename":"data/vaneerConsumption/FirstLookRaysRioBravoSandySprings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/01/Images/photos.medleyphoto.8071976.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_first-look-ray-rio-bravo-sandy-springs__1540935892.html","title":"First Look: Ray’s Rio Bravo, Sandy Springs","title_page":"First Look: Ray’s Rio Bravo, Sandy Springs","title_rss":"NULL","source_domain":"ajc.com","text":"Known for his popular Ray’s seafood and steak restaurants in Sandy Springs and Alpharetta, Ray Schoenbaum founded Rio Bravo Cantina in 1984. The company expanded to locations around metro Atlanta and into Florida, before it was sold in the early ’90s and eventually left the market.\nBut, according to Schoenbaum, longtime fans kept asking him to resurrect that “Rio Fresh, Rio Fun, Rio Bravo” feeling. In early August, that wish was granted, as Ray’s Rio Bravo opened not far from Ray’s on the River in Sandy Springs.\nThe look: The waterside building on Powers Ferry Road has a legacy as the former home of Peter Chang Chinese Cuisine. But Schoenbaum gutted the lodge-like structure, transformed the two-story facade with brick and rustic stucco, and installed a waterfall to mark the entrance. Inside, the colorful cantina look is back, with a spacious bar area, and the famous “El Machino” tortilla machine on display outside the kitchen.\nThe scene: One Saturday afternoon, the dining room was filled with the kind of large, loud groups common at weekend brunch time. At the bar, a middle-aged woman wearing a Kenny Chesney T-shirt and gripping a margarita greeted friends, saying, “This looks great, doesn’t it? It feels like old times.”\nThe food: Call it Tex-Mex or gringo Mexican, the big box-style menu leans to huge plates with gooey cheese and piles of rice and refried beans. Among original Rio Bravo favorites, find the chicken, skirt steak and jalapeño-lime shrimp fajita combo ($49.95), which comes with sides and all the fixings to serve four. Taco plates ($8.50-$16.95), including shredded brisket, seasonal veggie and fried red snapper, are served three to an order with a choice of corn or flour tortillas, and Spanish rice and charro beans.\nThe drinks: Beyond house-made lemonade, iced tea and fountain sodas ($2.50), the beverage menu is still a work in progress. But look for house and Texas margaritas, specialty cocktails, Mexican lagers on draft and local craft beer in the bottle.\nThe extras: Lunch specials ($9.95-$15.95), served 11 a.m.-3 p.m. Monday-Friday, include plates and soup and quesadilla or salad combos. For dessert, there’s Mexican Coca-Cola cake ($7.95), a chocolate chimichanga ($6.95) and a daily gelato or fresh fruit sorbet ($5.95).","url":"https://www.ajc.com/entertainment/dining/first-look-ray-rio-bravo-sandy-springs/7993wGezFUYwIrwgYPb1II/"}
