{"authors":[],"date_download":"2018-10-30 21:55:15","date_modify":"2018-10-30 21:55:15","date_publish":"2015-10-17 08:23:39","description":"The first bus full of migrants arrived at a Slovenian border after Hungary shut its border with Croatia late on Friday.","filename":"data/vaneerConsumption/FirstMigrantsReachSloveniaAfterHungaryClosesBorder.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_17__1540936515.html","title":"First Migrants Reach Slovenia After Hungary Closes Border","title_page":"First Migrants Reach Slovenia After Hungary Closes Border","title_rss":"NULL","source_domain":"breitbart.com","text":"The first bus full of migrants arrived at a Slovenian border crossing with Croatia on Saturday, the Slovenian police said, after Hungary shut its border with Croatia late on Friday, diverting them towards Slovenia.\n“The bus is on the border crossing (Gruskovje) and the migrants will now go through a registration process,” police spokesman Bojan Kitel told Reuters. He was unable to say how many people were on the bus.\nSlovenia has cancelled all rail traffic with Croatia so that migrants are not able to enter the country by train.\nSlovenia and Croatia said on Friday that they would not restrict the flow of migrants so long as Austria and Germany keep their door open.\nSlovenia said it was in talks with Croatia possibly to direct the flow of migrants through only two border crossings. Slovenia’s national security council is due to meet later on Saturday.\nThe police told Reuters migrants are expected to enter Slovenia on Saturday through border crossings Gruskovje and Petisovci, which are both located in eastern Slovenia, not far from the border with Hungary.\nOver the past month, only about 3,000 migrants passed through Slovenia which has said it was in a position to accommodate up to 8,000 migrants per day.","url":"https://www.breitbart.com/europe/2015/10/17/watch-first-migrants-reach-slovenia-after-hungary-closes-croatia-border/"}
