{"authors":["Myra Butterworth For Mailonline"],"date_download":"2018-10-23 00:42:29","date_modify":"2018-10-23 00:42:29","date_publish":"2016-01-11 10:28:16","description":"The average deposit paid by a first-time buyer has risen by 88 per cent, from £17,499 in 2007 to £32,927 today, while the average price paid for a first home rose 10 per cent last year, from £172,563 to £190,180.","filename":"data/vaneerConsumption/Firsttimebuyersnowneedtofindadepositof33KsaysHalifax.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/08/12/0765300A00000514-0-image-a-11_1452255046097.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-3390304_First-time-buyers-need-deposit-33K-says-Halifax_1540255349.html","title":"First-time buyers now need to find a deposit of £33K says Halifax","title_page":"First-time buyers now need to find a deposit of £33K says Halifax | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The plight of first-time buyers has reached a new level as new research suggests they now need a deposit worth £33,000 on average, while the amount they pay for a home has never been higher.\nThe average deposit for a first-time buyer has risen by 88 per cent, from £17,499 in 2007 to £32,927 today, according to the findings by Halifax.\nThe research also found that people are increasingly taking on 35-year mortgages in order to get on the property ladder, rather than the traditional 25-year term. One in four first-time buyers (26 per cent) now borrow over 35 years, compared to 16 per cent in 2007.\nThe average first-time buyer deposit has risen by 88 per cent, from £17,499 in 2007 to £32,927 today\nThe average price paid by first-time buyers rose by 10 per cent in the last year alone, from £172,563 to £190,180. The previous highest level was in 2007, when first-time buyers paid £174,994.\nThis is highest in Greater London at £367,990 - more than £125,000 higher than the next most expensive region - the South East at £242,111.\nWith an average price of £108,542, Northern Ireland is the least expensive region in Britain to step onto the housing ladder.\nCraig McKinlay, mortgages director at Halifax, said: 'Although the average price of the typical first-time buyer home has grown by 10 per cent in the past year, the number of buyers taking that first step onto the housing ladder has been supported by favourable economic conditions - namely, record low mortgage rates, rising employment and real pay growth.'\nHalifax blamed higher house prices for the increasing size of deposits required by first-time buyers. As such, it is hardly surprisingly that the average first-time buyer deposit is highest in Greater London at £91,409, which is five-and-a-half times more than in Northern Ireland at £16,578.\nIn the South East, the average deposit paid increased by 24 per cent in the past year, from £35,582 to £44,042.\nAVERAGE PRICE PAID BY FIRST-TIME BUYERS AND STAMP DUTY SAVINGS First Time Buyer Average House Price (£s) Stamp Duty Payable before December 2014 Stamp Duty Payable from December 2014 Stamp Duty saving North £118,254 £0 £0 £0 Yorkshire and the Humber £129,326 £1,293 £86 £1,207 North West £132,948 £1,329 £158 £1,171 East Midlands £138,922 £1,389 £278 £1,111 West Midlands £147,554 £1,475 £451 £1,024 East Anglia £178,305 £1,783 £1,066 £717 Wales £124,817 £0 £0 £0 South West £183,408 £1,834 £1,168 £666 South East £242,111 £2,421 £2,342 £79 Greater London £367,990 £11,039 £8,399 £2,640 Northern Ireland £108,542 £0 £0 £0 Scotland £133,178 £1,311 £0* £1,311 UK £190,180 £1,901 £1,303 £598 Source: Halifax\nMost first-time buyers have benefited from the overhaul of stamp duty, according to the research.\nThe largest saving was made in London where the average first-time buyer price of £367,990 means first-time buyers now pay £8,399 in stamp duty fees on average, compared to £11,039 before the changes were introduced by the Chancellor at the end of 2014.\nThe report follows one from the National Association of Estate Agents last week, which said house hunters must be prepared to battle it out as latest figures show there are 10 buyers for each property for sale.\nThe gap between the number of buyers and the number of properties for sale is growing and is fuelling the housing crisis. The NAEA recently warned house prices will soar 50 per cent to an average of £420,000 within 10 years.\nThe outlook is particularly bad for first-time buyers who will continue to feel squeezed out of the property market due to the lack of affordable housing, according to agents.\nMark Hayward, managing director of the NAEA, said: 'It's very normal at this time of year that demand is high and supply is low. House hunters hoping to find their dream property in the New Year have registered interest with agents. But supply is outweighing demand so heavily now that it can't solely be attributed to seasonality.\n'It's clear that we're faced with a crisis here: the housing market needs addressing as a matter of urgency.\nA National Estate Agents Association report last week showed how affordability is being stretched\nMr McKinlay added that affordability is now such a concern that it could prevent many potential buyers from entering the market as the average house price to earnings ratio is 'significantly' above the long-term average of four.\nThe research claimed Copeland in the North West and Inverclyde in Scotland are the most affordable regions, with an average house price 2.8 times the local average gross annual earnings.\nMOST AFFORDABLE AREAS FOR FIRST-TIME BUYERS Local Authority District Region House Price to Average Earnings ratio Copeland North West 2.8 Inverclyde Scotland 2.8 Stirling Scotland 3 Blaenau Gwent Wales 3.1 Renfrewshire Scotland 3.2 West Dunbartonshire Scotland 3.2 East Ayrshire Scotland 3.2 South Lanarkshire Scotland 3.2 North Lanarkshire Scotland 3.3 East Renfrewshire Scotland 3.3 Source: Halifax","url":"https://www.dailymail.co.uk/property/article-3390304/First-time-buyers-need-deposit-33K-says-Halifax.html"}
