{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 18:20:58","date_modify":"2018-10-30 18:20:58","date_publish":"2016-06-06 12:46:46","description":"Hampton + Hudson, the new “community bar and restaurant” from husband-and-wife team Bill...","filename":"data/vaneerConsumption/FirstLookHamptonHudsonanewInmanParkcommunitybar.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/06/Images/WPIMAGE_cmgajcfoodandmore_8637.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_fi_ee5fb3ad20c16a72a561575664c54a5d__1540923658.html","title":"First Look: Hampton + Hudson a new Inman Park community bar","title_page":"First Look: Hampton + Hudson a new Inman Park community bar","title_rss":"NULL","source_domain":"ajc.com","text":"Hampton + Hudson, the new “community bar and restaurant” from husband-and-wife team Billy and Jenn Streck, opened in late May at Inman Quarter in Inman Park. Billy Streck is best known as a partner at Cypress Street Pint and Plate and Grain in Midtown , while Jenn Streck has experience in both the music and bar business.\nThe 3,500-square-foot space is anchored by a large central bar surrounded by a variety of dining areas. The vintage-meets-contemporary design mixes reclaimed 1800s barn wood, tufted booths, Colonial bar stools and handcrafted wood tables with big-screen TVs for watching sports and a custom sound system to accommodate live music and private events.\nThe open kitchen, which boasts a wood-fired grill and rotisserie oven, is the domain of executive chef Jason Hall, who has created menus for lunch, dinner, late night and weekend brunch with an eye toward locally sourced ingredients and multiple price points.\nRecently, the Strecks were at Hampton + Hudson to preview the menu and explain a little more about the concept.\n“We wanted to bring something unique to Inman Park,” Billy Streck said. “Because what you see now is a ton of restaurants going up, but there aren’t a lot of bars. You can come to Hampton + Hudson and have a great pub experience. But you can also come in and have a great restaurant experience.”\n“We wanted to create a place that was a little bit of everything,” Jenn Streck said. “If you have a family, you can come here and watch the game and have a beer, but still have a great meal with a kids menu. Or you can come for a business lunch or happy hour or late night.”\nAs far as the atmosphere, the Strecks said they worked hard to get an older look in a build-out that’s obviously brand-new.\n“I wanted that character of coming in and feeling comfortable, so we really looked to turn of the century, a late 1800s-to-1900s look, and I tried to pick out some things that were very relevant to that era,” Jenn Streck said.\nThe Strecks worked with Hall to come up with dishes that ranged from takes on pub grub classics, such as a signature burger, to things that are tad different, such as steak tartare tacos served in house-made potato chip shells.\n“We definitely wanted to have a menu with food that sort of smacks you in the face but is still affordable and approachable and makes you want to come back,” Billy Streck said.\n“We also wanted a little bit of healthy, some things you can have with beer and wine, things you could eat for a meal,” Jenn Streck said. “But we really love chef Hall because he is very creative in coming up with new ideas and specials, so he’s right on board with us on that.”\nPulling from his experience at Cypress Street and Grain, Billy Streck designed the beverage menu, which includes 20-plus craft beers on draft, plus wine and coffee on draft, and several seasonal cocktails.\n“Things have definitely changed from 10 years ago,” he said. “But I’m still an old-school bartender at heart, so we wanted to have an old-school feel here but also elevate it a bit. Most of all, we want to be very diverse, so you can order a Miller Lite or a nice cocktail. But it’s been a challenge to get it right where we want it and make it very appealing to the neighborhood.\n“When we were getting ready to open, people would ask, ‘How many drafts are you going to have on? Are you going to have TVs? And when are you going to open?’ So we had to respond to all that.”\n299 N. Highland Ave. N.E., Atlanta. 404-948-2123, hamptonandhudson.com.\nHere's more from a First Look at Hampton + Hudson.\nSteak Tartare Tacos served in house-made potato chip shells. PHOTO CREDIT: Tomas Espinoza.\nHampton Hot Chicken Biscuit Sliders, served on fresh herb and cheddar biscuits that are made daily in-house. PHOTO CREDIT: Tomas Espinoza.\nThe Upper East Side cocktail with gin, elderflower liquor, lemon juice, ginger, fresh raspberries, and mint. PHOTO CREDIT: Tomas Espinoza.\nThe 3,500-square foot space in Inman Quarter features a mezzanine, large central bar, and private dining areas. PHOTO CREDIT: Tomas Espinoza.\nThe husband-and-wife team, Billy and Jenn Streck, recently opened Hampton + Hudson, a community-driven bar and restaurant in Inman Park. PHOTO CREDIT: Jessica Bailey.\nMore New Atlanta Restaurants\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter. Find us on Instagram @AJCdining.","url":"https://www.ajc.com/blog/atlanta-restaurants/first-look-hampton-hudson-new-inman-park-community-bar/mti6tCNvzjd5lAQoS3YK4K/"}
