{"authors":[],"date_download":"2018-10-22 21:17:32","date_modify":"2018-10-22 21:17:32","date_publish":"2014-06-04 20:47:19","description":"First Lady Michelle Obama announced a new initiative on Wednesday to help end veteran homelessness by 2015, a goal set by her husband’s administration in 2010.","filename":"data/vaneerConsumption/FirstLadyUnveilsnewEfforttoendVeteranHomelessness.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/488116/140604-michelle_obama_veterans-1715_7452538dd2a610aa93e552589e4a6335.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_first-lady-unveils-new-effort-end-veteran-homelessness-n122826_1540243052.html","title":"First Lady Unveils new Effort to end Veteran Homelessness","title_page":"First Lady Unveils new Effort to end Veteran Homelessness ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFirst Lady Michelle Obama announced a new initiative on Wednesday to help end veteran homelessness by 2015, a goal set by her husband’s administration in 2010.\nSo far, 77 mayors, four governors and four county officials from across the country have signed up for what Mrs. Obama -- who spearheads the effort together with Dr. Jill Biden -- has dubbed “The Mayors’ Challenge to End Veteran Homelessness.”\nRoughly 58,000 American veterans are homeless.\n“When a veteran comes home kissing the ground, it is unacceptable that he has to sleep on it,” the first lady said at a White House ceremony in front of an audience that included a delegation of more than 20 mayors.\nMrs. Obama joined Housing and Urban Development Secretary Shaun Donovan in his call for local collaboration. She said the new initiative will be successful as the city and county officials involved “are best equipped because they know their communities inside out.”\nShe added, “They don’t just have the capacity to reduce the problem, they are going to end it by the end of 2015.”\nSince 2010, the number of homeless veterans has dropped 24 percent. But with less than two years left to meet the deadline, the first lady urged community leaders to make an even bolder push. “The fact that we [still] have 58,000 [homeless veterans] is a moral outrage.”\nNewly-appointed Acting VA Secretary Sloan Gibson said ending veteran homelessness is one of the Department of Veteran Affairs’ three core missions. Gibson also addressed the growing scandal at VA hospitals that still hovers over his office, which culminated in then-VA secretary Eric Shinseki’s resignation last Friday (and which led to Gibson’s temporary appointment to the job). He said his staff was “moving immediately to get veterans off of waiting lists and into clinics” and to address the systemic challenges within the VA to get veterans the healthcare they deserve.","url":"https://www.nbcnews.com/politics/first-read/first-lady-unveils-new-effort-end-veteran-homelessness-n122826"}
