{"authors":[],"date_download":"2018-10-22 20:49:20","date_modify":"2018-10-22 20:49:20","date_publish":"2014-05-04 14:40:17","description":"Robinson would not disclose details about the end of their 25-year relationship but wrote Sunday that he owed a debt to his ex-husband.","filename":"data/vaneerConsumption/FirstOpenlyGayEpiscopalBishoptoDivorceHusband.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/419011/140504-gene-robinson-hg-1031_60c70ed73d557e2df38d1472fcb6aa06.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_first-openly-gay-episcopal-bishop-divorce-husband-n96626_1540241360.html","title":"First Openly Gay Episcopal Bishop to Divorce Husband","title_page":"First Openly Gay Episcopal Bishop to Divorce Husband","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNEW YORK — The first openly gay Episcopal bishop, who became a symbol for gay rights far beyond the church while deeply dividing the world's Anglicans, plans to divorce his husband.\nBishop Gene Robinson announced the end of his marriage to Mark Andrew in an email sent to the Diocese of New Hampshire, where he served for nine years before retiring in 2012.\nRobinson would not disclose details about the end of their 25-year relationship but wrote Sunday in The Daily Beast he owed a debt to Andrew \"for standing by me through the challenges of the last decade.\"\nRobinson did not respond Sunday to email and phone requests for comment from The Associated Press.\nRobinson has never been fully accepted within the more than 70 million-member Anglican Communion, which is rooted in the Church of England and represented in the United States by the Episcopal Church.\nThe bishop endured death threats during his 2003 consecration and intense scrutiny of his personal life, and in 2006, he sought treatment for alcoholism.","url":"https://www.nbcnews.com/news/us-news/first-openly-gay-episcopal-bishop-divorce-husband-n96626"}
