{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:07:01","date_modify":"2018-10-30 18:07:01","date_publish":"2017-03-29 11:07:52","description":"San Diego, California recently saw its first baby born with a severe Zika-related birth defect, microcephaly.","filename":"data/vaneerConsumption/FirstZikaBabyBornwithDefectsinSanDiego.json","image_url":"https://media.breitbart.com/media/2016/11/wi/ap/22/333g3gb-photo-25-e1480002902729.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_03_29__1540922821.html","title":"First Zika Baby Born with Defects in San Diego","title_page":"First Zika Baby Born with Defects in San Diego | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Though national news of Zika infections have quieted with a winter slowdown in spread of the disease, San Diego, California recently saw the first baby born with a severe Zika-related birth defect.\nSan Diego County’s Health and Human Services Agency announced the case on Tuesday with a warning to pregnant women and those who could become pregnant: avoid travel to regions where Zika is spreading.\nThis is the first such case in San Diego county.\nThe child’s mother was infected with Zika while traveling in a country where Zika is common, according to the County of San Diego. The child was born with the birth defect microcephaly, which has been associated with Zika infection in the mother. Microcephaly causes an infant’s brain and head to be abnormally small, typically resulting in developmental and neurological health problems.\n“Pregnant women who must travel to one of these areas should strictly follow steps to prevent mosquito bites and speak with a health care provider upon return,” said County public health officer Wilma Wooten, M.D., M.P.H.\n86 San Diego residents had contracted the disease from 2015-2017 as of March 24 of this year, according to the California Department of Public Health (CDPH). An additional case occurred in a non-resident of the county. Statewide there were 527 cases in the same time frame.\nOften — four out of five times, according to the county — those infected with Zika experience no symptoms. No further details of the mother and child were immediately available due to privacy concerns, but those who do see symptoms from the disease may experience “fever, rash, joint pain, and conjunctivitis (red eyes).” There is not yet a vaccine or treatment for the disease.\nAedes aegypti mosquitos are known to carry the disease. They are not native to California, according to the CDPH, which reports that despite that fact, several California counties have detected the insect since 2011.\nTo date, CDPH states that none of the California cases are a result of local transmission. Early reports of cases in the U.S. suggested that the disease could not be transmitted through sexual contact, but that was later corrected as such cases presented themselves.\nFollow Michelle Moons on Twitter @MichelleDiana\nPhoto: file","url":"https://www.breitbart.com/local/2017/03/29/first-zika-baby-born-with-defects-in-san-diego/"}
