{"authors":["Sophie Inge For Mailonline"],"date_download":"2018-10-22 23:57:43","date_modify":"2018-10-22 23:57:43","date_publish":"2017-04-26 08:53:47","description":"Last night's episode of the dating show saw widower Raymon, 90, revealing his battle with loneliness since his wife died 16 years ago. Raymon was paired with ball dancing enthusiast, Cecilia.","filename":"data/vaneerConsumption/FirstDatesepisodefeaturesprogrammesoldestdater.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D4C6E00000578-0-image-a-27_1493193218527.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4444860_First-Dates-episode-features-programme-s-oldest-dater_1540252663.html","title":"First Dates episode features programme's oldest dater","title_page":"First Dates episode features programme's oldest dater | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 90-year-old widower melted viewers' hearts after becoming the oldest person to appear on First Dates.\nLondoner Raymon left viewers in 'floods of tears' after he described his loneliness after losing his wife 16 years ago.\nLooking for love in his tenth decade, Raymon was matched with retired civil servant and ballroom-dancing enthusiast, Cecilia, who declined to give her age.\nScroll down for video\nRaymon lost his wife shortly before they were due to celebrate 50 years together...and shared a tear-jerking anecdote about their honeymoon\nRaymon, right, told producers that the death of his wife 16 years ago had left him lonely and looking for later life love. He was paired with Cecila, who declined to give her age\nWaltzing towards love? Raymon and Cecilia enjoyed a spin around the First Dates restaurant floor...but didn't make it to a second date\nAt the start of the Channel 4 dating show, the widower spoke of his heartbreak at losing his wife just months before the couple were due to celebrate their 50th wedding anniversary.\n'We adored each other,' he told the producers. 'We had no secrets. We did everything together. Yes, I think I knew love.'\nViewers took to social media to express their sadness at his story with many admitting Raymon had left them in tears.\n@jckr39 wrote: 'My heart breaks when I hear oldies talking about being lonely. I hope Raymon and Cecilia find love.'\nRetired Civil Servant Cecilia loved to dance...but didn't quite find romance in the arms of Raymon\nFirst Dates waiter Sam looked on as Raymon and Cecilia showed off their moves\n@Chelseaaa_93 added: 'Raymond speaking about his wife that passed away is breaking my heart! What a wonderful man.'\nThe nonagenarian also shared an intimate honeymoon memory of his late wife and himself falling through two single beds, which brought tears to his eyes.\nHe admitted how lonely he had been since her death. 'I'm beginning to feel lonely,' he told producers. 'I did before but unfortunately so many of my contemporaries are dying.\nCecilia, whose granddaughter put her forward for the programme, also spoke about her late partner, who died two years ago after 21 years together.\nDespite initially agreeing to meet again, Raymon and Cecilia later decided against a late-flowering love affair.\nViewers were also moved by 21-year-old shop assistant Sarah from Huddersfield, who had to have a leg amputated after suffering from cancer at the age of 16. Despite her fears that 23-year-old rugby coach Philip, from Warrington, would be put off by her disability, the pair hit it off and are still going strong\nThe cameras also followed builder-turned-model Frankie, 22, who is now planning a second date with personal assistant Rosie, 23\nFirst Dates viewers were also moved by 21-year-old shop assistant Sarah from Huddersfield, who had to have a leg amputated after suffering from cancer at the age of 16.\nDespite her fears that 23-year-old rugby coach Philip, from Warrington, would be put off by her disability, the pair hit it off and are still going strong.\nThe cameras also followed builder-turned-model Frankie, 22, who is now planning a second date with personal assistant Rosie, 23.\nLegal executive Katie, 28, from Bridgend, wasn't too sure about 31-year-old marketing manager David, from Bristol, but eventually came round to the idea of a second date\nBut not everyone planned on a reunion with 47-year-old grandmother Helen from Manchester, deciding against a second date with fellow Mancunian Martin, 44\nLegal executive Katie, 28, from Bridgend, wasn't too sure about 31-year-old marketing manager David, from Bristol, but eventually came round to the idea of a second date.\nBut not everyone planned on a reunion with 47-year-old grandmother Helen from Manchester, deciding against a second date with fellow Mancunian Martin, 44.","url":"https://www.dailymail.co.uk/femail/article-4444860/First-Dates-episode-features-programme-s-oldest-dater.html"}
