{"authors":[],"date_download":"2018-10-22 21:06:57","date_modify":"2018-10-22 21:06:57","date_publish":"2014-05-06 00:03:38","description":"Etihad Airways will soon let passengers book a three-room suite with a living room, bedroom, bathroom, shower and personal butler.","filename":"data/vaneerConsumption/FirstClassUpgradeAirlineAddsLuxurySuiteWithButler.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/422051/nn_07_bwi_ethiadste_140505_72ab9b13df954117c396a5cebdb36e9f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_first-class-upgrade-airline-adds-luxury-suite-butler-n97756_1540242417.html","title":"First-Class Upgrade: Airline Adds Luxury Suite - With Butler","title_page":"First-Class Upgrade: Airline Adds Luxury Suite - With Butler","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHow swanky can first-class travel on a commercial airline get?\nEtihad Airways, the national carrier of the United Arab Emirates, will soon let passengers book a three-room suite with a living room, bedroom, bathroom and shower. Also included: a personal butler, trained at the Savoy Butler Academy in London.\n\"This is unheard of for a commercial airline,\" said Raymond Kollau, an analyst at Airlinetrends.com. \"At $20,000 for a single journey, it is aimed at dignitaries and high net-worth individuals on the Abu Dhabi to London, Paris and New York routes, which are among the very few routes where such 'beyond first' class will meet demand.\"\n\"The Residence\" will be available on the airline's new A380 airplanes in a 125-square-foot cabin on the forward upper-deck. Available for single or double occupancy, each Residence will have Ferrari-quality leather, table marquetry, custom carpets, a two-seat reclining sofa and an 82-inch-long double bed.\n\"The new Residence calls into question just how much pandering to the super rich is enough,\" said aviation journalist Christine Negroni, author of the forthcoming book, \"CRASHED: What the World's Most Mysterious Airplane Disasters Teach Us About Design, Technology, and Human Performance.\"\n\"That said, at $20,000, the super-luxe, three-room suite actually is cheaper than flying the same route in a private plane, so maybe for the bargain-hunting billionaire, the Residence may be just the ticket,\" Negroni said.","url":"https://www.nbcnews.com/business/travel/first-class-upgrade-airline-adds-luxury-suite-butler-n97756"}
