{"authors":[],"date_download":"2018-10-22 21:29:01","date_modify":"2018-10-22 21:29:01","date_publish":"2014-05-07 13:05:46","description":"A roundup of the most important political stories of the day","filename":"data/vaneerConsumption/FirstReadsMorningClips.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_first-reads-morning-clips-n99131_1540243741.html","title":"First Read's Morning Clips","title_page":"First Read's Morning Clips","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nABOUT LAST NIGHT: Tillis’ big win\nTop results: NC-SEN: Tillis 46% Brannon 27% Harris 18%\nNC-03 : Jones 51% Griffin 45%\nNC-02 (too close to call) : Aiken 40.8% Crisco 39.5%\nOH-08: Boehner 69% Winteregg 22%\nNORTH CAROLINA: The News & Observer's Rob Christensen: \"This was a good election for the big boys in Washington, for deep pockets and for party connections. Voters tended not to be in a rebellious mood Tuesday, generally giving their votes to candidates who were well within the mainstream of their party. The Republican candidates who won tended to be deeply conservative, well-financed, but also politically seasoned and well-connected to their national parties. This was an insiders’ election.\"\nThe New York Times on the Tillis win: \"A boost for establishment Republicans.\"\nEven before polls closed, the Hagan campaign and national Democrats were highlighting this unearthed 2011 quote from Thom Tillis and comparing it to Mitt Romney's 47% moment. \"What we have to do is find a way to divide and conquer the people who are on assistance. We have to show respect for that woman who has cerebral palsy and had no choice, in her condition, that needs help and that we should help. And we need to get those folks to look down at these people who choose to get into a condition that makes them dependent on the government and say at some point, ‘You’re on your own. We may end up taking care of those babies, but we’re not going to take care of you.\"\nThe Charlotte Observer editorializes this morning: \"Tillis was seen as the “establishment” candidate in this primary, but his record and his rhetoric are clear: He is no moderate, and could come across that way only when sitting next to Greg Brannon and Heather Grant.\"\nThe race hasn't been called yet, but Clay Aiken leads rival Keith Crisco by fewer than 400 votes.\nAnti-war congressman and general thorn-in-the-side-of-leadership Walter Jones defeated challenger Taylor Griffin, a former aide to President George W. Bush, 51 percent to 45 percent.\nOHIO: House Speaker John Boehner coasted to victory as expected Tuesday night over two conservative primary challengers. And more from the Columbus Dispatch: \"The tea party also fell short in its effort to oust Rep. David Joyce, R-Russell Township. In early unofficial returns, Joyce was taking 55 percent of the vote compared with 45 percent for challenger Matt Lynch, a member of the Ohio House.\"\nGov John Kasich has his Democratic opponent for the fall, with Cuyahoga County Executive Ed FitzGerald easily winning the nomination over Dayton-area ex-stripper Larry Ealy.\nINDIANA: \"Primary voters backed all nine of Indiana's House incumbents Tuesday,\" the Indianapolis Star writes of state's undramatic primary night. \"Although six faced one or more primary challengers, none had trouble winning their party's nomination, despite Congress' low approval ratings.\"\nOBAMA AGENDA: Help to Nigeria\nNBCNews.com: American military and law-enforcement personnel will coordinate with Nigerian officials in a stepped-up effort to find nearly 300 schoolgirls who were abducted by Islamic terrorists in the country last month, President Obama and John Kerry said Tuesday.\n\"Most of the people choosing health plans under the Affordable Care Act — about 80 percent — are paying their initial premiums as required for coverage to take effect, several large insurers said Tuesday on the eve of a House hearing about the law,\" writes the New York Times. \"But the health insurance industry said the total of eight million people who signed up included “many duplicate enrollments” for consumers who tried to enroll more than once because of problems on the website.\"\nThe Wall Street Journal notes three reasons that immigration reform could still get passed in 2014.\nHere's Jon Huntsman weighing in on the climate change debate in a New York Times op-ed. \" We need to plan for the impacts of climate change at all levels of government. We need to empower Republicans leading those efforts to make decisions and investments that benefit their constituents, the party and the planet. Denying the science will only hinder their chance for success.\"\nMemoirs a-coming. The AP: “The back-to-back memoirs from former Secretary of State Hillary Clinton and ex-Treasury Secretary Timothy Geithner will be the latest installments in what has become an often awkward Washington ritual: one-time confidants signing big book contracts to examine a presidency that is still ongoing and policy decisions that are still being implemented.”\nCONGRESS: Out of energy\n\"Talks between Reid and Senate Minority Leader Mitch McConnell appear to be at a standstill, which doesn’t bode well for the energy efficiency legislation sponsored by Sen. Jeanne Shaheen, D-N.H., and Sen. Rob Portman, R-Ohio — or a vote on Keystone,\" writes Roll Call.\nDemocrats aren't happy with the framework for the Benghazi special committee, calling its makeup of seven Republicans and five Democrats \"unwise.\"\nThe Wall Street Journal: \"While many Obama administration officials expected little action on NSA overhauls until after the midterm elections, the new movement in the House may prompt action sooner, congressional officials say.\"\nOFF TO THE RACES: Jeb makes an Iowa overture\n2016 alert. The Des Moines Register's Jennifer Jacobs scooped yesterday: \"Jeb Bush is making an overture to Iowa. The former Florida governor will host a fundraiser in Coral Gables for Gov. Terry Branstad on May 22, the Iowan's campaign aides confirmed to The Des Moines Register.\"\nAbout that Monica Lewinsky piece (which we wrote about here) : The Washington Post's Ruth Marcus suggests it's a \"big favor\" to Hillary Clinton. Why? \"Her piece defuses [Rand] Paul’s line of attack. And it does so before any Clinton presidential announcement.\"\nKENTUCKY: Attorney General Jack Conway announced his bid for governor in the Bluegrass State. That race will be in 2015.\nNEBRASKA: Put your kids in a campaign commercial, get this in response. An outside group’s new ad in Nebraska tells Senate candidate Ben Sasse that “Nebraskans protect their families. They don't hide behind them.”\nNEW HAMPSHIRE: A pro-Keystone group’s poll shows Shaheen and Brown in a statistical tie, NHJournal writes.\nPROGRAMMING NOTES.\n***Wednesday’s “Jansing & Co.” line-up: Chris Jansing interviews Sen. Ron Johnson (R-WI), Founder of Burn Bright International Ozioma Egwuonwu, Executive Director of The Nigerian-American Leadership Council Samuel Okey-Mbonu, GOP Strategist Noelle Nikpour, Democratic Strategist Bernard Whitman, White House Reporter for the Washington Post David Nakamura, Senior Political Reporter and Politics Managing Editor for the Huffington Post Amanda Terkel, and Executive Vice President for the Feminist Majority Foundation Kathy Spillar.\n*** Wednesday’s “News Nation with Tamron Hall” line-up: Tamron Hall interviews the Associated Press’s Michelle Faul & Nicole Lee, president of TransAfrica on the missing Nigeria girls; Democratic strategist & Clinton surrogate/fundraiser Robert Zimmerman on Monica Lewinsky; Legal analyst Lisa Green on judge saying alleged rape victim not a “victim” after defendant confesses; High school student Gary Haynes on his vine video catching his own Hail Mary pass; Lucille O’Neal, Shaquille O’Neal’s mother, on Boys & Girls clubs of America recognizing “3 most inspirational moms.”\n*** Wednesday’s “Andrea Mitchell Reports” line-up: NBC’s Andrea Mitchell interviews former UK Prime Minister Gordon Brown, Sen. Amy Klobuchar, Rep. Barbara Lee. Fmr. RNC Chairman Michael Steele, the New Yorker’s Alexis Okeowo and the Washington Post’s Chris Cillizza and Nia Malika Henderson.\n*** Wednesday’s “The Reid Report” line-up: MSNBC’s Joy Reid interviews Rep. Adam Schiff (D-CA) on the Select Committee appointed to investigate the Benghazi attack on the U.S. consulate. Also, former Texas Governor Mark White discusses results of The Constitution Project’s Death Penalty Committee and its recommendation on the 3 drug legal injection cocktail. Plus, Joy has the latest on the efforts to free 276 kidnapped Nigerian girls with writer and social commentator Lola Adesioye .","url":"https://www.nbcnews.com/politics/first-read/first-reads-morning-clips-n99131"}
avid Catanese, NBC’s Kasie Hunt, and Border Action Network Executive Director Juanita Molina.\n*** Wednesday’s “News Nation with Tamron Hall” line-up: Tamron Hall interviews The Daily Beast’s Michael Tomasky, GOP strategist Rich Galen and the Huffington Post’s Amanda Terkel on House Majority Leader Eric Cantor’s primary loss; Politico’s Roger Simon on Defense Secretary Hagel’s testimony today on the Bergdahl prisoner swap; and Nigerian born international policy strategist Ozioma Egwuonwu on Boko Haram kidnapping 20 more Nigerian girls\n*** Wednesday’s “Andrea Mitchell Reports” line-up: NBC’s Andrea Mitchell interviews DNC Chair Rep. Debbie Wasserman Schultz, Rep. Chris Smith, Rep. Luis Guttierrez, Fmr. RNC Chairman Michael Steele, the New York Times’ Jackie Calmes and NBC’s Chuck Todd, Cynthia McFadden and Luke Russert.\n*** Wednesday’s “The Reid Report” line-up: MSNBC’s Joy Reid interviews NBC News Senior Political reporter Perry Bacon, Political Science professor Jason Johnson, journalist & documentary producer Sebastian Junger and The Nation’s Dave Zirin.","url":"https://www.nbcnews.com/politics/first-read/first-reads-morning-clips-n128276"}
