{"authors":[],"date_download":"2018-10-30 21:29:20","date_modify":"2018-10-30 21:29:20","date_publish":"2015-06-23 04:00:00","description":"Last month, owners Billy and Kristin Allin and bakers David Garcia and Abigail Quinn of Cakes & Ale restaurant and Café Cakes & Ale in Decatur opened Proof Bakeshop in the former Dough Bakery space across from the Inman Park MARTA station.","filename":"data/vaneerConsumption/FirstLookProofBakeshopInmanPark.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/23/Images/photos.medleyphoto.7485258.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_first-look-proof-bakeshop-inman-park__1540934960.html","title":"First Look: Proof Bakeshop, Inman Park","title_page":"First Look: Proof Bakeshop, Inman Park","title_rss":"NULL","source_domain":"ajc.com","text":"Last month, owners Billy and Kristin Allin and bakers David Garcia and Abigail Quinn of Cakes & Ale restaurant and Café Cakes & Ale in Decatur opened Proof Bakeshop in the former Dough Bakery space across from the Inman Park MARTA station. The bakery cafe serves breakfast and lunch Monday-Saturday, along with coffee, espresso, tea and “all things baked.”\nThe look: Located in a storefront at the corner of Hurt Street and DeKalb Avenue, the interior is decorated in coffee bar shabby chic style. The counter service setup features glass cases displaying the day’s baked goods. After ordering, grab drinks and utensils, and find a seat among cozy arrangements of couches and chairs or at one of the long communal tables.\nThe scene: One recent afternoon, the sparse crowd included coffee drinkers with laptops, customers grabbing take-away orders, and a few scattered groups enjoying lunch.\nThe food: On the current lunch menu, find a whole or half house salad with veggies and lemon thyme vinaigrette ($4/$8), a daily slice of custardy quiche with a side salad ($10), and several sandwiches made with Proof bread ($6-$8), including an Italian-style soppressata panini with chard, preserved lemon ricotta and Dijon mustard. On the breakfast menu ($5.25-$9.50), there’s a rosemary ham, Gruyere cheese and baked egg melt on an English muffin, yogurt and granola with seasonal fruit, and a smoked salmon bagel plate.\nThe drinks: Proof serves Counter Culture coffee and espresso drinks and Rishi organic tea, along with bottled water, San Pellegrino sparkling fruit beverages, and other fruit and soft drinks.\nThe extras: Of course, there’s a whole lot of sweet and savory stuff from the bakery on offer for breakfast, dessert or boxed to go. Among the favorites are croissants, scones, muffins, doughnuts, pound cake, cookies, and a daily selection of bread, including country sourdough, ciabatta, seeded loaf, honey oat and baguettes.","url":"https://www.ajc.com/entertainment/dining/first-look-proof-bakeshop-inman-park/2vbGz9SnHVHwHoK7tBT7hO/"}
