{"authors":[],"date_download":"2018-10-22 22:31:03","date_modify":"2018-10-22 22:31:03","date_publish":"2014-05-10 21:14:37","description":"A hunger for education should continue beyond graduation and should be used to inspire \"the next generation of geniuses,\" Michelle Obama said.","filename":"data/vaneerConsumption/FirstLadyTellsGradsCultivateThatHungerforEducation.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/434311/140510-140510-michelle-obama-dillard-1711_4ac0ed49e548cfcdeb106f083caaa970.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_first-lady-tells-grads-cultivate-hunger-education-n102256_1540247463.html","title":"First Lady Tells Grads: 'Cultivate That Hunger for Education'","title_page":"First Lady Tells Grads: 'Cultivate That Hunger for Education'","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"This is the realization of the dreams of so many who came before you,\" she said. \"You should be so proud and so happy and so excited, but you shouldn't be satisfied. Ask yourselves, 'What about all those geniuses who'll never get this chance?' ... When people fall behind in school, they fall behind in life.\"\nShe pointed the more than 200 Nigerian girls who were recently kidnapped \"for wanting an education and wanting to go to school,\" and 16-year-old Malala Yousafzai, a Pakistani girl who survived a gunshot to the head by a Taliban gunman in 2012 for advocating education for girls.\nThe first lady ticked off statistics about the high rate of unemployment and poverty in the black community and the number of people from that community in prison or who are victims of violent crimes.\n\"You may be thinking those numbers are terrible, but I'm not a part of that problem ... but folks like you and me, we can't afford to think like that ever, because we're the lucky ones.\n\"We got here today because of so many people who toiled and sweat and bled and died for us ... people who never dreamed of getting a college education for themselves but who worked and saved and sacrificed so that we could be here today. We owe them. We owe them. And the only way to pay back that debt is by making those same kinds of sacrifices and investments for the next generation.\"\nShe encouraged the graduates to start small, such as through volunteering as a tutor or by rallying their communities to start a mentor program, but she didn't reject the possibility of larger contributions, such as serving on a school board, in Congress or as president.\n\"Let's turn that pipeline to prison into a highway to college,\" she said.\n\"I want you all to keep raising your bars,\" she said in closing. \"Let the next generation know that there is no greater investment than a good education.\nObama also received an honorary Doctor of Humane Letters from the university as did U.S. Sen. Mary Landrieu, who joined Obama for a meeting later Saturday with spouses of veterans at an event at the National World War II Museum.\nThe top four Dillard graduates all coincidentally come from Nigeria. The 20-year-old valedictorian, Merrilyn Akpapuna, who comes from the southeastern corner of Nigeria, plans postgraduate study at Western Michigan University in the fall.\n—The Associated Press","url":"https://www.nbcnews.com/politics/politics-news/first-lady-tells-grads-cultivate-hunger-education-n102256"}
