{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:44:26","date_modify":"2018-10-30 21:44:26","date_publish":"2016-12-27 12:02:04","description":"Chinese-American business partners Michael Lo and George Yu have been busy in 2106.","filename":"data/vaneerConsumption/FirstLookAsianmeetslocalatSuzySiusBaosatKrogStreetMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/27/Images/WPIMAGE_cmgajcfoodandmore_12692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_fi_6ea55565dc4d87751d510b66cfb27411__1540935866.html","title":"First Look: Asian-meets-local at Suzy Siu’s Baos at Krog Street Market","title_page":"First Look: Asian-meets-local at Suzy Siu’s Baos at Krog Street Market","title_rss":"NULL","source_domain":"ajc.com","text":"Chinese-American business partners Michael Lo and George Yu have been busy in 2106.\nEarly in the year, they opened Mama Tiger , a steamed bun, noodle and bubble tea shop at Emory’s Dobbs University Center.\nMore recently, they changed the name and concept of their ambitious downtown Decatur pan-Asian restaurant and bar, Makan , rebranding it as Taiyo Ramen and drastically downsizing the menu to put the emphasis on ramen bowls.\nThe newest project from Lo and Yu, Suzy Siu’s Baos , opened last month at Krog Street Market, occupying a bright and tidy food stall space next to Jeni’s Splendid Ice Creams.\nLike Mama Tiger and Taiyo, Suzy Siu’s focuses on a few key menu items. This time, the star of the show is the bao (rhymes with wow), a fluffy, steamed Chinese bun that’s stuffed like a sandwich or taco with local and seasonal ingredients, such as pork belly, Korean-style barbecue brisket or roasted veggies.\nLast week at Suzi Siu’s, Lo and Yu took time out to talk about what it’s been like trying different types of menus and service styles.\n“When we opened Makan, it was our first restaurant, and there were things we wanted to try, and we tested the market,” Lo said. “We still deal with that in terms of the preconceived notions of what Asian food is. But, people kept coming to Makan for the ramen, despite all the other things on the menu.”\n“This place grew out of the buns being really popular at Makan. So, when we talked about doing a concept here, buns made the most sense in this kind of a stall format, with the speed and the price point. I think it’s great to specialize in something and do it very well.”\nFrom his point of view as a chef, Yu said executing the menu for a food stall was fairly easy, but still satisfying. And he still runs it like a restaurant kitchen, with everything cooked and plated to order.\n“From the food perspective, I think it’s great,” Yu said. “I enjoy this as much as I enjoy Taiyo in Decatur. I can jump back and forth, and it keeps it fresh.\n“You can still play with flavors. Like the Korean fried chicken bun here, and the fried green tomato bun, and using things like daikon to make a remoulade instead of regular pickles. That’s my Southern bun, basically.”\nBaos are offered individually, in sets of three or six, and in combos with sides — including roasted Korean street corn with gochujang butter or kimchi fritters with sweet potatoes — that also show off a wide variety of flavors.\n“It’s Asian flavors, it’s ingredients that we get here, but together it’s pretty unique,” Yu said. “The fritter came into play because one of my farmers has a ton of sweet potatoes in the winter. We’ll never get rid of the pork belly bun, but probably 50 percent of the menu will be seasonal.”\n99 Krog Street, Atlanta. 404-996-6504.\nMore images from a First Look at Suzy Siu’s Baos at Krog Street Market.\nPhoto credit- Mia Yakel.\nPhoto credit- Mia Yakel.\nRoasted Veggie and Fried Green Tomato baos with Korean Street Corn. Photo credit- Mia Yakel.\nKimchi Fritters and aioli side dish. Photo credit- Mia Yakel.\nMichael Lo and George Yu behind the counter at Suzy Siu's Baos at Krog Street Market. Photo credit- Mia Yakel.\nMore First Look\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instagram .","url":"https://www.ajc.com/blog/atlanta-restaurants/first-look-asian-meets-local-suzy-siu-baos-krog-street-market/ksorg0aw46D889AHTbpv2J/"}
