{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 03:22:40","date_modify":"2018-10-23 03:22:40","date_publish":"2017-03-10 12:49:51","description":"Reducing levels of a brain chemical helps to regrow the affected area of the eye, new research shows, according to a new study by researchers at the Vanderbilt University, Tennessee.","filename":"data/vaneerConsumption/FISHEYEScouldhelpfindthecureforblindness.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22BC5600000578-0-image-a-9_1489148812820.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4301122_Could-FISH-EYES-help-cure-blindness_1540264960.html","title":"FISH EYES could help find the cure for blindness","title_page":"FISH EYES could help find the cure for blindness | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fish eyes may hold the key to a cure for blindness in humans, scientists claim.\nIn a study on zebrafish, experts identified a trigger that could reverse age-related macular degeneration.\nThis condition, the leading cause of vision loss around the world, occurs when the retina becomes damaged.\nReducing levels of a brain chemical helps to regrow the affected area of the eye, new research shows.\nAnd this process could happen before damage even occurs, preventing humans from ever needing glasses.\nZebrafish eyes contain a chemical that could reverse age-related macular degeneration - the leading cause of vision loss around the world\nResearchers at the Vanderbilt University, Tennessee, found a signal that triggers the repair process in zebrafish.\nTheir retinas are considered to be the same as humans, with their regrowth started by a reduction in a neurotransmitter.\nThey found a drop in GABA is the 'trigger for regeneration', suggesting that the same method could work in humans.\nStudy author Professor James Patton said: 'It might be possible to stimulate human retinas to repair themselves by treating them with a GABA inhibitor.\n'The prevailing belief has been the regeneration process in fish retinas is triggered by secreted growth factors.\n'But our results indicate the neurotransmitter GABA might initiate the process instead.\nThe substance helps to regrow the affected area and this process could happen before damage even occurs, preventing humans from ever needing glasses\n'All the regeneration models assume a retina must be seriously damaged before regeneration takes place, but our studies indicate GABA can induce this process even in undamaged retinas.'\nThe retina contains adult stem cells called Muller glia. In fishes, these play a key role in regeneration.\nWhen triggered in zebrafish, these begin to multiply and turn into replacements for the damaged retinal cells.\nMuller glia cells are also present in the retinas of humans and other mammals, but don't regenerate.\nIn the experiments, published in Stem Cell Reports, they found high concentrations of GABA kept the stem cells inactive.\nInjecting the fish with drugs that kept high levels of the chemicals in the brain suppressed the regeneration process.\nZebrafish are easily blinded but due to their robust regenerative ability their eyes recover in just 28 days.","url":"https://www.dailymail.co.uk/health/article-4301122/Could-FISH-EYES-help-cure-blindness.html"}
