{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:25:08","date_modify":"2018-10-31 00:25:08","date_publish":"2018-07-11 00:00:00","description":"The US Securities and Exchange Commission filed fraud charges against a second person in connection with an alleged manipulation of Fitbit's stock price. In November 2016, a nonexistent company called ABM Capital filed a takeover offer for Fitbit on Edgar.","filename":"data/vaneerConsumption/FitbitstockpricemanipulationallegedbySECsecondpersoncharged.json","image_url":"https://amp.businessinsider.com/images/5b461301d87a8e1a008b468a-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_fitbit-stock-price-manipulation-alleged-by-sec-second-person-charged-2018-7_1540945508.html","title":"Fitbit stock price manipulation alleged by SEC, second person charged","title_page":"    Fitbit stock price manipulation alleged by SEC, second person charged - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Fitbit\nThe US Securities and Exchange Commission on Wednesday said it filed fraud charges against a second person in connection with an alleged manipulation of Fitbit's stock price.\nIn November 2016, a company called ABM Capital filed a takeover offer for Fitbit on the SEC's Edgar portal, proposing to buy the company's shares at a premium. The purported company did not exist, however, and Fitbit confirmed at the time that it had not received offers from any companies.\nFitbit shares spiked shortly after the fake offer was released. The SEC's complaint alleged that a man named Mark E. Burns bought Fitbit call options before a second man, Robert W. Murray, posted the buyout offer on Edgar. The call options, designed to profit from a stock's rise without owning the actual shares, earned Burns a 350% profit of about $13,000 after he sold them, the SEC said.\nFitbit shares were down more than 2% in trading on Thursday. The stock has gained 18% this year.","url":"https://www.businessinsider.com/fitbit-stock-price-manipulation-alleged-by-sec-second-person-charged-2018-7"}
