{"authors":["April Glover For Daily Mail Australia"],"date_download":"2018-10-22 22:45:22","date_modify":"2018-10-22 22:45:22","date_publish":"2017-03-10 01:26:12","description":"Sandra Fog, 32, was declared dead on the operating table but miraculously survived and Fitzy & Wippa surprised her at a Sydney office to gift her and her fiance, Will, a Hawaiian honeymoon.","filename":"data/vaneerConsumption/FitzyWippagiveshoneymoontowomanwhoalmostdied.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F262E00000578-0-image-a-22_1489107980115.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299478_Fitzy-Wippa-gives-honeymoon-woman-died_1540248322.html","title":"Fitzy & Wippa gives honeymoon to woman who almost died","title_page":"Fitzy & Wippa gives honeymoon to woman who almost died | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who was declared clinically dead on the operating table - but miraculously survived - was gifted a honeymoon to Hawaii in a heartwarming video shared by radio hosts Fitzy & Wippa.\nSandra Fog, 32, suffered a life-threatening infection known as septicemia and her heart stopped beating while in the middle of an operation.\nA mountain of medical bills stopped Sandra from celebrating her honeymoon with 31-year-old fiance William, but Fitzy & Wippa caught wind of her story and decided to help out.\nNova radio hosts Fitzy & Wippa found Sandra's story and decided to do something to help\nWilliam told Fitzy & Wippa on air his fiancee actually died on the operating table and was horrified at the thought of losing her.\nHe said: 'The only time I broke down was when I got the call that she had been admitted to the ICU and she had stopped breathing.\nWhen I got there she was unconscious and full of tubes and cords.'\nThe engaged couple are due to marry in six months but growing medical bills meant they could not afford a proper honeymoon.\nWill Poole, 31, (pictured) almost lost his fiancee on the operating table when her heart stopped beating\nSandra Fog, 32, (pictured) was surprised at her Sydney office when Nova presented her with a novelty cheque for a Hawaiian honeymoon\nPiling medical bills meant the young couple could not afford a proper honeymoon when they got married in six months\nFitzy told Will that the couple deserved a honeymoon and they were going to surprise Sandra at her office in Sydney.\nNova newsreader Matty De Groot found Sandra at her desk and gave her a phone where she spoke to Fitzy & Wippa and broke down.\nFitzy said: 'We heard your story and know there's a chance you wouldn't have been here with us today and you survived that.\nSo we want to present you with a honeymoon to Hawaii and we're paying for it.'\n'He's my knight in shining armour': Sandra said she wouldn't have made it through her ordeal without her fiance\nYoung love: The engaged couple will marry in six months and now have a trip to Hawaii to look forward to\nSandra burst into tears and sobbed uncontrollably as Nova presented her with a large novelty cheque and streamers fell from the ceiling.\n'You have no idea what this means to us,' Sandra told Fitzy and Wippa.\n'Will is my knight in shining armour and I wouldn't be able to get through this without him.'\nSandra and Will are set to get married in six months and will enjoy their all-expenses paid trip to Hawaii to celebrate their honeymoon.","url":"https://www.dailymail.co.uk/news/article-4299478/Fitzy-Wippa-gives-honeymoon-woman-died.html"}
