{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 20:41:05","date_modify":"2018-10-30 20:41:05","date_publish":"2015-01-01 21:57:01","description":"An icy cold and strong winds hit much of Southern California Tuesday night into Wednesday, downing trees all over the state and stranding about 180 cars on the highways northeast of Los Angeles. The storm is also responsible for at least five deaths across California, reports Fox News. |","filename":"data/vaneerConsumption/FiveDeadMoreThan100CarsStrandedinRareCASnow.json","image_url":"https://media.breitbart.com/media/2015/01/CA-snow-Lenny-Ignelzi-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_01__1540932065.html","title":"Five Dead, More Than 100 Cars Stranded in Rare CA Snow,","title_page":"Five Dead, More Than 100 Cars Stranded in Rare CA Snow,","title_rss":"NULL","source_domain":"breitbart.com","text":"An icy cold and strong winds hit much of Southern California Tuesday night into Wednesday, downing trees all over the state and stranding about 180 cars on the highways northeast of Los Angeles. The storm is also responsible for at least five deaths across California, reports Fox News.\nTwo people were killed by falling trees in the Northern California city of Paradise on Tuesday, while a fallen tree killed another person Wednesday in Redding.\nA Harbor Patrol officer on Catalina Island was crushed to death between a boat and rocks as he attempted to jump ashore, reports the Los Angeles Times. While authorities searched for the body of the officer, they came across the body of another man floating in the water.\n“The conditions were so horrible, they were unable to go in after him,” L.A. County Sheriff’s Department spokeswoman Nicole Nishida told the Times.\nA search and rescue team from the Riverside County Sheriff’s Department worked together with California Highway Patrol to help extricate cars from snow-packed Ortega Highway in Orange County, Sheriff’s Sgt. Mike Manning told the Orange County Register.\nSiblings Alexa and Blake Ulrich, and their cousin Hayden Willett, were reportedly stuck in their Toyota Camry for 12 hours before a rescue team finally reached them.\n“I don’t think this car had ever seen snow before,” Ulrich told the Register. “We definitely did not see this coming.”\nSouthern California Edison crews were working Wednesday to restore power to 3,600 customers across the Southland.\nStill, some families were delighted by the snow.\n“We want to get the full Orange County experience; snow in the morning, beach in the afternoon,” Santa Ana resident Lucy Gonzalez told the Register. “It’s a great way to end the year.”\nIn Silverado Canyon, dozens of families reportedly headed out to Silverado Canyon Road in the Santa Ana mountains to build snowmen, toss snowballs, and attempt to ride makeshift sleds. Kam Miller, 36, came to play with her three daughters. She told the Register she hadn’t seen snow in Orange County since she was in grade school.\n“They were hoping to sled on their boogie boards but I don’t think there’s enough snow,” Miller told the paper.","url":"https://www.breitbart.com/local/2015/01/01/five-dead-more-than-100-cars-stranded-as-rare-snow-wind-hits-ca/"}
