{"authors":[],"date_download":"2018-10-22 22:53:03","date_modify":"2018-10-22 22:53:03","date_publish":"2014-06-10 19:02:03","description":"The House Armed Services Committee will question the defense secretary on Wednesday.","filename":"data/vaneerConsumption/FiveQuestionsasHousePreparestoGrillHagelonBergdahl.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/479431/140531-bowe-bergdahl-mn-1400_0_5060c22af3f093a5a6a0418209a24da0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_five-questions-house-prepares-grill-hagel-bergdahl-n127626_1540248783.html","title":"Five Questions as House Prepares to Grill Hagel on Bergdahl","title_page":"Five Questions as House Prepares to Grill Hagel on Bergdahl","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDefense Secretary Chuck Hagel goes before the House Armed Services Committee on Wednesday to answer questions about Sgt. Bowe Bergdahl, and he can expect the questioning to be tough.\nThe Republican chairman, Buck McKeon of California, told reporters that \"we ought to look at the price\" — the five Taliban detainees whom the Obama administration released from Guantanamo Bay, Cuba, in exchange for Bergdahl's freedom.\nSign up for breaking news alerts from NBC News\nOutraged Republicans said after a secret administration briefing Monday night that as many as 90 people in government — but no member of Congress — knew about the swap ahead of time. The White House said Tuesday that the figure referred to people who \"had access to intelligence related to Taliban activities in Qatar,\" the country that facilitated the negotiations for Bergdahl's release.\nHere are some of the unanswered questions that may be posed to Hagel.\nDid Bergdahl Desert?\nFormer members of his platoon have said so, but the administration has urged people not to jump to conclusions about the circumstances of Bergdahl's disappearance from his Afghan outpost in June 2009 and capture by the Taliban.\n\"His side of the story matters, too,\" national security adviser Susan Rice told CNN last week. \"We'll have a full and comprehensive review of what happened, and then we'll be able to make that judgment.\"\nBergdahl is working with psychologists at the U.S. military hospital in Landstuhl, Germany, and the military has promised a full investigation. Hagel will probably be asked what, if anything, the military has learned so far.\n\"The key question is what really do we know about Bergdahl's conduct,\" said Eugene Fidell, who teaches military justice at Yale Law School. \"What do we know about his behavior in captivity? What can Secretary Hagel tell us about that?\"\nWhy Wasn't Congress Told?\nThe White House first said that it moved quickly to make the trade because it believed Bergdahl's health was deteriorating rapidly. President Barack Obama told NBC News' Brian Williams last week that it was a \"delicate situation that required no publicity.\"\nThe administration has not said why that would have precluded notifying the Gang of Eight, the small group of members of Congress that is customarily trusted with a heads-up on highly sensitive actions.\nSen. Dick Durbin, D-Illinois, told reporters Tuesday that the administration finalized the exchange only one day ahead of time and knew only an hour ahead of time where it would take place.\nHagel could be pressed for details about a video the Taliban released in December that administration officials have said raised grave concerns about Bergdahl's health. The video has not been publicly released.\n\"It is now obvious that Bergdahl was not in severe ill health,\" said retired Army Gen. Barry McCaffrey, an NBC News military analyst.\nWhat Were the Consequences of Bergdahl's Capture?\nIn the days after Bergdahl was freed, some former members of his platoon blamed him for the deaths of as many as eight soldiers. Nathan Bradley Bethea, for example, wrote that soldiers from Bergdahl's own unit \"died trying to track him down.\"\nBut a review by The New York Times found that the record was far from conclusive, partly because fighting was intense all over Afghanistan at the time and because insurgents had targeted Paktika province, where Bergdahl was, for years.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/five-questions-house-prepares-grill-hagel-bergdahl-n127626"}
