{"authors":[],"date_download":"2018-10-30 01:19:07","date_modify":"2018-10-30 01:19:07","date_publish":"2014-09-02 09:09:11","description":"FiveThirtyEight is a polling aggregation website with a blog created by Nate Silver. Sometimes referred to as 538, the website takes its name from the number of electors in the United States electoral college.[1] Established on March 7, 2008, as FiveThirtyEight.com, in August 2010 the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight:","filename":"data/vaneerConsumption/FiveThirtyEight.json","image_url":"https://www.allsides.com/sites/default/files/logo-all-sides-20px_1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/allsides.com/news-source_fivethirtyeight-0_1540862347.html","title":"FiveThirtyEight","title_page":"FiveThirtyEight Media Bias | AllSides","title_rss":"NULL","source_domain":"allsides.com","text":"FiveThirtyEight is believed to have a center bias rating. Although it formed a partnership with the New York Times, which has a lean left bias, for three years, the AllSides Bias Rating™ for the website remains center. Currently, FiveThirtyEight is owed ESPN. The wesbite has been criticized by several pundits for a perceived left-leaning bias. One of those authors was Dean Chambers, who accused Silver of pro-Obama biases during the 2012 Presidential election after Silver gave Obama a 73 percent chance of re-election. Ultimately, FiveThirtyEight’s prediction model correctly predicted the results in all 50 states, while coming within 0.3 percent of accurately predicting Obama’s popular vote percentage. The website has generally been recognized as a highly accurate, unbiased source for political projections since 2008, though it has gone through some controversy during the 2016 election cycle. As early as June 2015, FiveThirtyEight argued that Donald Trump “isn’t a real candidate” and gave him extremely slim odds of winning the nomination. After Trump became the presumptive nominee in May 2016, Silver published a retrospective “How I Acted Like a Pundit and Screwed Up on Donald Trump.” Meanwhile, FiveThirtyEight was accused of lacking objectivity by media watch group Fairness and Accuracy in Reporting after providing pessimistic predictions for Bernie Sanders’ success in the Democratic primaries.\nMore on FiveThirtyEight\nFiveThirtyEight founder Nate Silver considers the website primarily focused on data journalism rather than politics, with five major sections comprising the site’s content: politics, economics, science, life and sports. Silver gained notoriety after predicting publishing a highly accurate primary election prediction under the pseudonym \"Poblano.\" Silver predicted Barack Obama would win 859 delegates in the 2008 Democratic primary, and Hillary Clinton 829, with the results ultimately coming in at 847 delegates for Obama and 834 for Clinton.\nSources:\nWikipedia: FiveThirtyEight\nFiveThirtyEight","url":"https://www.allsides.com/news-source/fivethirtyeight-0"}
