{"authors":[],"date_download":"2018-10-30 18:18:10","date_modify":"2018-10-30 18:18:10","date_publish":"2017-04-13 16:04:33","description":"Morehouse College: what happened with President John Silvanus Wilson and the trustees","filename":"data/vaneerConsumption/FivethingstoknowaboutwhathappenedatMorehouseCollege.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/04/05/Images/newsEngin.18313195_102215-Morehouse-HS05.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_five-t_be12f436b65db101bb1b4aea67b04837__1540923490.html","title":"Five things to know about what happened at Morehouse College","title_page":"Five things to know about what happened at Morehouse College","title_rss":"NULL","source_domain":"ajc.com","text":"Morehouse College has put itself in the news recently with the release of President John Silvanus Wilson and friction on the board of trustees.\nStrong actions were taken by the board recently to replace Wilson and the former board chairman, and the college has started a nationwide search to find a new president.\nHere are five things to put the recent news in perspective:\n1. Morehouse College is an Atlanta institution with a heritage of graduating men who become leaders in the African American and American community at large. Its leaders and graduates played critical roles in the American civil rights movement, producing multiple leaders from Benjamin Mays to the Rev. Martin Luther King Jr. to Julian Bond.\n2. Facing declining enrollment and financial problems, Morehouse hired John S. Wilson in 2013 as a change agent. Wilson responded by cutting the budget and cutting staff and brought a new focus to fundraising, academics and other changes, such as requiring more students to live on campus. His style of leadership and communication caused friction among some alumni and students.\n3. The board, led by Chairman Robert Davidson, initially voted in January 2017 not to extend Wilson's contract when it expired in June, a decision board leaders never fully explained, citing confidentiality concerns. The board banned student and faculty representatives from the meeting, and student government members sued unsuccessfully to stop the board action.\n4. The word about the in-fighting at Morehouse began to spread, with a petition started by some students calling for Wilson’s resignation and notable graduates such as director Spike Lee and President Barack Obama’s former Homeland Security Secretary Jeh Johnson weighing in and expressing concern.\n5. In early April the board met and released President Wilson from his contract immediately, replaced Chairman Davidson and other board leadership.","url":"https://www.ajc.com/news/local-education/five-things-know-about-what-happened-morehouse-college/E5HuTt1RucyNWKVFa0ezcP/"}
