{"authors":[],"date_download":"2018-10-22 22:31:46","date_modify":"2018-10-22 22:31:46","date_publish":"2014-06-10 07:12:26","description":"The International Security Assistance Force (ISAF) said the soldiers died in southern Afghanistan on Monday.","filename":"data/vaneerConsumption/FiveUSSoldiersDieinAfghanistaninFriendlyFireIncident.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_32/498491/140610-afg-nato-isaf-5a_e85418185722e9dd2ca9af41de400991.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_five-u-s-soldiers-die-afghanistan-friendly-fire-incident-n127076_1540247506.html","title":"Five U.S. Soldiers Die in Afghanistan in Friendly-Fire Incident","title_page":"Five U.S. Soldiers Die in Afghanistan in Friendly-Fire Incident","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFive U.S. soldiers killed in Afghanistan may have been the victims of a friendly-fire incident, officials said Tuesday.\nThe International Security Assistance Force (ISAF) said five of its servicemen had died Monday during a security operation in southern Afghanistan when their unit came in contact with enemy forces.\n\"Tragically, there is the possibility that fratricide may have been involved,\" ISAF said in a statement. \"The incident is under investigation.\"\nIt did not provide further details on the incident or soldiers' nationalities, adding only that the coalition's \"thoughts are with the families of those killed.\"\nDefense and military officials told NBC News that the soldiers were members of U.S. special forces working with the Afghan military.\nThe American and Afghan troops were conducting security sweeps on polling sites ahead of this weekend's run-off for the Afghan presidential election when they came under attack from Taliban forces, the officials explained.\nThe Americans called in an airstrike amid fierce fighting and, according to U.S. officials, the B-1 Stealth Bomber strike somehow went terribly awry.\nThe police chief of Zabul province, Gen. Gulam Sakhi Rogh Lewanai, also told NBC News that the joint ISAF-Afghan army patrol came under attack Monday evening. He said one Afghan national army soldier died in the botched airstrike.\nThe incident is the largest loss of life for ISAF since April, when five British troops died in a helicopter crash in southern Afghanistan.\nThe deaths come just days before the run-off in Afghanistan's presidential election, which pits frontrunner Abdullah Abdullah against former Finance Minister Ashraf Ghani.\nNATO plans to withdraw all combat troops from Afghanistan by the end of 2014.\nPresident Barack Obama recently announced a plan to maintain 9,800 military personnel in Afghanistan after the American combat mission ends there this year, pledging that he will bring the war there to \"a responsible end.\"\nThe 9,800 figure would be cut in half by the end of 2015, and the American contingent would be reduced to “a normal Embassy presence in Kabul” by the end of 2016, Obama said.","url":"https://www.nbcnews.com/news/world/five-u-s-soldiers-die-afghanistan-friendly-fire-incident-n127076"}
