{"authors":[],"date_download":"2018-10-30 21:24:58","date_modify":"2018-10-30 21:24:58","date_publish":"2016-04-29 20:39:36","description":"An apple a day isn't the only thing that keeps the doctor away. A cup of tea can be medicine for the soul. In Savannah, a city oozing with charm...","filename":"data/vaneerConsumption/FiveplacestohaveteainSavannah.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/29/Images/photos.medleyphoto.9563940.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/travel_sip-tea-these-five-places-savannah__1540934698.html","title":"Five places to have tea in Savannah","title_page":"Five places to have tea in Savannah","title_rss":"NULL","source_domain":"ajc.com","text":"An apple a day isn't the only thing that keeps the doctor away. A cup of tea can be medicine for the soul. In Savannah, a city oozing with charm and revelry from the yesteryears, five places in particular make tea their speciality — and do it well.\nGryphon Tea Room\nThis tea room is sleek, and mahogany bookcases give the small café a pseudo library feel. Freshly baked scones with clotted cream and jam and mini sandwiches are tea accompaniment highlights. Afternoon tea $18 per person. Gryphon Tea Room. 337 Bull Street, Savannah. 912-525-5880. web.scad.edu/experience/gryphon.\nGallery Espresso\nOriginal artwork from local artists lines the walls in Gallery Espresso, a coffee shop with equally impressive and delicious teas to sip. Sweet treats are must eats here: blueberry cheesecake, brownies, tea cake and coffee cake. Gallery Espresso. 234 Bull Street, Savannah. 912-233-5348. galleryespresso.com.\nThe Tea Room\nThe experience of sipping a piping hot cup of tea is soothing, according to The Tea Room. Visitors to The Tea Room will feel like they're at a cozy, corner café, as comfy chairs placed around and dim lighting create a warm ambiance. Need a new set of tea cups or any other tea accessory? A wide selection is available for purchase. The Tea Room. 326 Bull Street, Savannah. 912-239-9690. savannahtearoom.com.\nBallastone Inn\nFor a high tea experience fit for a queen, Ballastone Inn pulls out all the bells and whistles to create an experience for guests. Everyday at 4 p.m., the high tea commences with the 19th century inn as the backdrop. Don a fancy hat for theatrics to luxuriate in the full elegance of high tea. Ballastone Inn. 14 East Oglethorpe, Savannah. 912-236-1484. ballastone.com.\nSerenity House Tea Society & Shoppe\nNot only is Serenity House a place for tea lovers to enjoy their favorite teas, but it is also a shoppe with an extensive tea selection for purchase. More than 110 varieties of loose leaf teas can be found here. The art of drinking tea — and health benefits — is central to the Serenity House mission. Serenity House Tea Society. 140 Abercorn Street, Savannah. 912-638-0381. serenityhousetea.com.","url":"https://www.ajc.com/travel/sip-tea-these-five-places-savannah/zeDJxYLHICwtfFwLgeptIN/"}
