{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:01:01","date_modify":"2018-10-30 20:01:01","date_publish":"2016-10-27 16:00:21","description":"While Woodchuck and Angry Orchard continue to dominate the American cider market, their much funkier...","filename":"data/vaneerConsumption/Fivehardciderstotry.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/26/Images/WPIMAGE_cmgajcfoodandmore_11499.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_five-hard-ciders-try__1540929661.html","title":"Five hard ciders to try","title_page":"Five hard ciders to try","title_rss":"NULL","source_domain":"ajc.com","text":"While Woodchuck and Angry Orchard continue to dominate the American cider market, their much funkier forefathers are making their way across the Atlantic. Weighing in at 6-percent ABV or less, ciders are a perfect sessionable alternative to wine or heavy-duty craft beers pushing the alcohol-by-volume limits. Like their English brethren, the fermented juice-producing regions of Normandy and Brittany in France and Asturias and Sagardoa in Spain have been churning out pressed gold for centuries, with palate-pleasers ranging from tannic, dry and sweet like Champagne to funky, acidic and yeasty like sour beer.\nOn a chilled October evening, once again, we gathered a thirsty crew of taste testers on an Atlanta porch to sip ciders from around the world to give you our top five high-octane juice picks for your sipping consideration.\nEnglish\nA familiar style to the American market, English ciders are fermented using bittersweet to bittersharp cider apples found only in the British Isles. Barrel-aged, these ciders tend to be on the drier side with a moderate amount of carbonation.\nThatcher’s Green Goblin, 5% ABV, $3.99, medium dry, bittersweet\nProduced at an 112-year-old traditional cidery out of Somerset, England, Thatcher’s ages their fermented juice in 30-foot-tall, 150-year-old oak vats for six weeks. The Green Goblin contains a blend of Dabinett and Somerset Redstreak apples and drinks like a Moscato with a hint of dry carbonation. This sweeter English style cider is a solid choice for a dessert sipper paired with figs, nuts and sharp cheeses.\nSpanish\nSpanish style ciders (sidra) tend to be vegetal, funky and tart with little to no carbonation much like sour beer. The traditional, slow fermentation process averages four months beginning in October. The juice then rests in chestnut barrels with wild yeast, producing a tannic texture and vinegary profile.\nIsastegi Sagardo, 6% ABV, $11.99, dry, tart, grassy\nA cloudy pour due to residual yeast, Isastegi grabs you right at the nose with a pop of fresh, green apple, preparing your palate for a tart, vinegary sip with hints of lemon typical of the traditional Spanish style ciders. Its salinity and acidity makes it a great alternative to a shrub in a cocktail but can be paired alongside fresh fruits, greens, fried chicken and white fish like grouper or bass.\nGreen Goblin English cider contains a blend of Dabinett and Somerset Redstreak apples and drinks like a Moscato with a hint of dry carbonation. Photo: Beth McKibben\nFrench\nFrench cider-(cidre) making dates back to the twelfth century in Normandy and Brittany with cideries producing clean and crisp Champagne-like juices for which France is known while others lean toward the tart earthiness of their Spanish neighbors.\nDomaine du Verger Brut, 5% ABV, $10, sparkling, dry, slightly sweet\nProduced in Brittany, Domaine’s brut cider is bittersweet, bubbly and contains no added sugars other than those of the apples from which its pressed. Earthy on the nose with a touch of honey and citrus at the front, this cider drinks almost like mead. The carbonation helps to carry the natural sugars and honey notes through mid-palate but dissipates toward the end giving it a slightly thin finish. Nothing another sip won’t cure. We recommend pairing with charcuterie, spiced almonds and soft cheeses like camembert or a tomme.\nTxopinondo Sagarnoa, 6% ABV, $12.49, dry, slightly tart, earthy\nTxopinondo is a beautiful balance between the French and Spanish style ciders. Located in the Basque region in Ascain, France, the cider is aged on lees or dead yeast in barrels for six months like Champagne. The nose throws hints of bright green apple and grassy funk but as you sip it softens into subtle earthiness with hints of sour apple and the occasional pear note. Pair this French stunner with lamb or pork and roasted vegetables or simply sip all by its lonesome.\nAmerican\nWhile American style ciders take their cues from the English, there’s one distinct difference. The apples. England’s bittersweet, tannic cider apples do not grow in the United States, therefore North American cideries are forced to use sweet varieties like Gala or Golden Delicious which make great pies but not necessarily the best ciders. With the renewed interest in all things craft, cideries are beginning to grow and experiment with 100-year-old plus heritage apple varieties that once thrived across the United States.\nUrban Tree Barrel-Aged, 6.5%, $14.99, slightly dry and sweet, woody\nLocated on Howell Mill Road, Urban Tree Cidery falls under the farm winery umbrella which means not only can they sell you a growler, they can also serve you cocktails, beer and wine out of their tasting room. Why? Forty percent of the apples used in their high-octane juices come from an orchard the cidery has purchased in Mountain City, Georgia. Urban Tree hopes the orchard will afford them the opportunity to grow heritage varieties not seen in the state for nearly a century.\nThe barrel-aged is a balanced blend of all four styles, achieved by slowly fermenting then resting the juice with Champagne yeast in oak rum barrels. The cider sips a touch dry and slightly sweet without overpowering the rich apple and wood notes. An all-season sipper, we suggest pairing with funky cheeses, grilled or smoked meats or a hearty stew.\nUrban Tree Cidery, 1465 Howell Mill Road NW, Atlanta. 404-855-5546, urbantreecidery.com.\nHop City Westside, 1000 Marietta St. NW, Atlanta. 404-350-9998, www.hopcitybeer.com .\nHop City Krog Street Market, 99 Krog St. NE, Atlanta. 470-355-2534, www.hopcitybeer.com .\n3 Parks Wine Shop, 880 Glenwood Ave. Ste. C, Atlanta. 678-349-7070, 3parkswine.com .\nTower Package, 2161 Piedmont Road NE, Atlanta. 404-881-0902, towerwinespirits.com.\nRead more of our coverage of the Atlanta bar scene\nWhere to drink cocktails and watch college football around Atlanta\nWhy aren’t you drinking aperitif cocktails?\nOrange wine? Here’s why and where to give it a try\nVIDEO: The art of crafting ice at Japanese cocktail lounge Himitsu\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and@ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/five-hard-ciders-try/WX7OnyjCEMMnWc9WH5HAKO/"}
