{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 03:32:02","date_modify":"2018-10-23 03:32:02","date_publish":"2016-01-11 16:14:26","description":"Five coalition cabinet ministers have taken up potentially lucrative private sector posts in the industries they used to regulate - some raking in hundreds of pounds an hour.","filename":"data/vaneerConsumption/Fivecoalitionministershavenewjobsinsectorstheyonceregulated.json","image_url":"https://www.dailymail.co.uk/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394115_The-revolving-door-David-Cameron-s-cabinet-Five-coalition-ministers-new-jobs-sectors-appointed-regulate_1540265522.html","title":"Five coalition ministers have new jobs in sectors they once regulated","title_page":"Five coalition ministers have new jobs in sectors they once regulated | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Five cabinet ministers from the coalition government have taken up potentially lucrative private sector posts in the industries they used to regulate, it emerged today.\nSome 25 ex-ministers are now working on their former patch - some raking in hundreds of pounds an hour.\nAmong those on the list are Lib Dem ex-energy secretary Chris Huhne - who quit Parliament and was jailed for perverting the course of justice - and ex-health secretary Andrew Lansley, who has been handed a seat for life in the House of Lords by David Cameron.\nAndrew - now Lord - Lansley, left, has taken up healthcare sector jobs since leaving his post as health secretary, while the disgraced ex-Lib Dem energy secretary Chris Huhne, right, has taken jobs in the energy industry\nSome, such as ex-Northern Ireland secretary Owen Paterson, have new private sector jobs while still MPs in the House of Commons.\nThe names emerged following an investigation by the Daily Mirror. None of those involved have broken any rules.\nBut Labour MP Paul Flynn told the paper: 'It is wrong that anyone should be selling their inside knowledge and contacts.'\n'It used to be that a ministerial post was the pinnacle of any career. Now it seems to be a stepping stone to retirement riches.'\nResearch by the Mirror revealed Lord Lansley advises Swiss drugs firm Roche, helps private equity firm Blackstone on healthcare investments, and consults with Bain & Co on healthcare innovation. His salary in the posts is unknown.\nMr Huhne is Europe chairman for Zilkha Biomass Energy and an adviser to the Anaerobic Digestion and Bioresources Association. The Mirror did not disclose his salary.\nMr Paterson earns £50,000 a year for eight hours work a month advising the Belfast-based healthcare firm Randox Laboratories.\nLiberal Democrat Ed Davey, who took over the energy job in the cabinet, is now chairman of Mongoose energy since losing his Commons seat last May.\nDavid Laws, the ex schools minister, now advises the Ark Schools academy chain.\nAmong more junior minister, Tory ex-Africa minister Mark Simmonds - who complained about expenses rules before leaving Parliament - has had 10 jobs since leaving the Foreign Office.\nOwen Paterson, left, does work for a Belfast-based firm after serving Northern Ireland Secretary. Dan Rogerson, second left, was water minister and now chairs the Wessex Water Partnership. Mark Simmonds, second right, left the Foreign Office in 2014 and has taken 10 posts since. Tim Loughton, right, was children's minister and now a paid adviser to the National Fostering Agency.\nHe told the Mirror it had 'all been done within the rules'.\nDan Rogerson, who was a Liberal Democrat water minister, is reportedly now the Chairman of the Wessex Water Paternership on up to £20,000 a year for just five or six days work.\nEx-children's minister Tim Loughton - still a Conservative MP - is earning £600 an hour advising the independent National Fostering Agency, the Mirror said.\nFormer ministers are required to apply to the Advisory Committee on Business Appointments.\nThe committee offers advice on the suitability of roles with a view to avoiding suspicion appointments are a reward for favours, and claims the new employer is gaining an 'improper advantage' from the appointment.\nBut Mr Flynn added: 'It's not a watchdog - it's a pussycat without teeth or claws.'\nTory MP Bernard Jenkin, chairman of the Commons Public Administration Committee, told the Mirror the committee is little more than a \"voluntary arrangement\".\nA Cabinet Office spokesman said: 'All former Ministers must abide by the independent Advisory Committee on Business Appointments for two years after leaving office.","url":"https://www.dailymail.co.uk/news/article-3394115/The-revolving-door-David-Cameron-s-cabinet-Five-coalition-ministers-new-jobs-sectors-appointed-regulate.html"}
