{"authors":[],"date_download":"2018-10-30 17:58:37","date_modify":"2018-10-30 17:58:37","date_publish":"2018-09-14 09:42:00","description":"Tropical Storm Florence is continuing to douse the Carolinas with inch upon inch of rain as it slowl...","filename":"data/vaneerConsumption/FivedeathsreportedfromHurricaneFlorence.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/14/Videos/4483831.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_hurricane-florence-nears-landfall-category-storm__1540922317.html","title":"Five deaths reported from Hurricane Florence","title_page":"Five deaths reported from Hurricane Florence","title_rss":"NULL","source_domain":"ajc.com","text":"Tropical Storm Florence is continuing to douse the Carolinas with inch upon inch of rain as it slowly crawls into eastern South Carolina, Channel 2 Action News reported.\nThe storm has already contributed to five deaths in North Carolina, and the storm is about 15 miles northeast of Myrtle Beach, S.C., according to the 11 p.m. report by the National Hurricane Center.\nTwo long bands wrapping around #Florence pulling more rain off the Atlantic — it’s not going anywhere for a good long while.\nSee you at 6am on Channel 2 from N.C. @wsbtv #StormWatchOn2 pic.twitter.com/IUGwiYYUQz — Brian Monahan, WSB (@BMonahanWSB) September 15, 2018\nFlorence, which is nearly the size of North Carolina itself, has already brought heavy rain and hurricane-force winds and knocked out power for more than 890,000 people as of 8 p.m., according to USA Today.\nThe first deaths attributed to Florence were reported Friday in North Carolina as the storm continued to wreak havoc and dump more than 2 feet of rain in some areas after making landfall earlier in the day.\nEvacuation orders are still in effect as hurricane like conditions are just now hitting a greater portion of the state. If it is safe to do so, please remain where you are. #scwx #sctweets #hurricaneflorence — SCEMD (@SCEMD) September 14, 2018\nA mother and her infant were killed in Wilmington, N.C., when a tree fell on their house, the Wilmington Police Department confirmed in a tweet. The father, who was trapped, was freed from the rubble by emergency workers and taken to a local hospital with injuries.\nWind gusts in the city Friday were reported as high as 105 mph.\nWPD can confirm the first two fatalities of Hurricane #Florence in Wilmington. A mother and infant were killed when a tree fell on their house. The father was transported to NHRMC with injuries. https://t.co/FC5PAhuxig — Wilmington Police (@WilmingtonPD) September 14, 2018\nTwo deaths were reported in Pender County, N.C. A woman had a heart attack and crews were unable to assist her in time, Wilmington-based news station WWAY reported. Also, a 78-year-old man was electrocuted in his home while attempting to connect two extension cords outside in the rain, ABC News reported.\nA fire truck in Wilmington, N.C., drives past a large tree blown over by Florence. (Photo: Mark Wilson / Getty Images)\nA person was also killed in Lenoir County while plugging in a generator, Gov. Roy Cooper’s office told Washington, N.C.-based news station WITN.\n“This storm is going to continue its violent grind across our state for days,” Cooper said Friday. “Be alert. To those in the storm path, if you can hear me — please stay sheltered in place. Do not go out into this storm.”\nChannel 2 Action News reported that the Cajun Navy, which is an informal volunteer group of private boat owners, has rescued 160 people trapped by the storm.\nArmed with boats and air mattresses, Cajun Navy rescues 160 trapped by Florence: https://t.co/Fv1MyYJkLb pic.twitter.com/7U9HABdhHu — WSB-TV (@wsbtv) September 14, 2018\nThe storm made landfall near Wrightsville Beach at 7:15 a.m., according to the NHC. At 11 p.m., Florence had weakened slightly to maximum sustained winds of 65 mph.\n“The flood threat does not diminish as the winds decrease,” Channel 2 meteorologist Brad Nitz said. “Twenty- to 40-inch rainfall totals and extreme flooding threats remain.”\nHigh winds and water surround buildings as Florence hits Swansboro N.C., on Friday. (Photo: Tom Copeland / Associated Press)\nStorm surge warnings north of Salvo, N.C., and south of Myrtle Beach, S.C., have been canceled, the NHC reported. All storm surge watches and hurricane watches were also canceled.\nRELATED: How are hurricanes categorized?\n105 mph gust at Wilmington Intl Airport, the 2nd highest wind gust ever recorded there. The highest gust recorded in Wilmington was 135 mph from Hurricane Helene in 1958. #Florence officially made landfall at 7:15am near Wrightsville Beach. pic.twitter.com/6FPzcN4vax — Katie Walls (@KatieWallsWSB) September 14, 2018\n“We believe it is moving so slowly, it is going to take a good part of the day just to make it to South Carolina,” Channel 2 meteorologist Karen Minton said. “A part of that eye is going to stay out over open water for a few more hours, and that is going to hold its intensity.”\nTremendous rainfall training in this band near Atlantic Beach all afternoon/evening. Confirmed 23\"+ totals so far. pic.twitter.com/6HL5ESZg64 — Brad Nitz (@BradNitzWSB) September 15, 2018\nSeveral locations in North Carolina have recorded more than a foot of rain. Oriental, N.C., has seen more than 20 inches so far, Nitz said.\nPlus an additional 10-20” in these already-inundated areas. Live tracking ahead at 4,5,6 with @GlennBurnsWSB @BradNitzWSB pic.twitter.com/Vgbx6Xpk7G — Katie Walls (@KatieWallsWSB) September 14, 2018\n“This isn’t a storm that is just going to wrap up, go away and that’s going to be it,” Channel 2 meteorologist Brian Monahan said from Wilmington on Friday morning. “We’re going to be talking about days of rain.”\nPhotographer @BFergusonWSB and meteorologist @BMonahanWSB are in North Carolina getting an up close look at the damage from #Florence @LaurenPozenWSB https://t.co/AyJ7jNQgwK — Aaron Diamant (@AaronDiamantWSB) September 14, 2018\nAt the height of the storm in New Bern on Friday, more than 60 people had to be pulled from a collapsing cinderblock motel, according to The Associated Press. Hundreds more had to be rescued elsewhere from rising waters.\n“WE ARE COMING TO GET YOU,” the city of New Bern tweeted Friday. “You may need to move up to the second story, or to your attic, but WE ARE COMING TO GET YOU.”\nThere was also flooding in Wilmington at midday when high tide combined with storm surge, Monahan said.\nFlorence is expected to douse the coastline with inches upon inches of rain over the next 36 hours.\nWhen forecasting rainfall totals 30, isolated 40 inches we hope that were wrong.\nunfortunately we are already seeing 30 inch totals! https://t.co/FHD6kSmBcv — Brad Nitz (@BradNitzWSB) September 14, 2018\n“Even though it is slowing down its wind speed as it passes to our east, over here across South Carolina, North Carolina, it is just going to continue to dump rain today,” Minton said. “It is going to be catastrophic flooding in spots.”\nChannel 2 meteorologist Katie Walls said she expects a “Harvey-like scenario” with days of rain followed by even more days of severe flooding.\nThe North Carolina governor said some storm surges have been as high as 10 feet.\nMORE STORM COVERAGE:\nGeorgians prepare to help Hurricane Florence evacuees\nGeorgia prepares for Florence, hoping storm stays away\nHurricane Florence evacuees begin pouring into Georgia\nGeorgia DOT prepares for Hurricane Florence\nA look at some of Georgia's worst hurricanes\nAs of the latest model Friday, Walls said it isn’t likely North Georgia will get much rain when what’s left of Florence reaches the state Sunday. High winds are not a concern.\n“Really not expecting much in the way of impact here in North Georgia,” she said.\n5pm track update brings a weak tropical depression east of Georgia this weekend.\nJust a few showers and a 20-25 mph breeze locally this weekend. pic.twitter.com/8JsAhiYja3 — Brad Nitz (@BradNitzWSB) September 14, 2018\nSome showers are likely Saturday night into Sunday, especially for the northeastern corner of the state. West Georgia may get little to no rain, according to Channel 2.\nGov. Nathan Deal declared a state of emergency for all of Georgia on Wednesday, citing concerns about high winds and torrential rain.\nThe University of Georgia moved up Saturday’s game against Middle Tennessee to noon due to the storm system.\nMORE: Georgia moves up Saturday’s game time due to Hurricane Florence","url":"https://www.ajc.com/weather/hurricane-florence-nears-landfall-category-storm/G8ueChZZYTVs4xxDRK1JgN/"}
