{"authors":[],"date_download":"2018-10-30 14:27:25","date_modify":"2018-10-30 14:27:25","date_publish":"2017-02-06 03:46:00","description":"The Falcons blew a perfect opportunity to win the franchise’s first Super Bowl.New England quarterback Tom Brady led a furious rally from a 25-point deficit to pull out a 34-28 victory against the Falcons on Sunday in overtime before 70,807 fans at NRG Stadium.","filename":"data/vaneerConsumption/FivethingsthatchangedtheoutcomeoftheFalconsSuperBowl.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/06/Images/newsEngin.17649572_020617-falcons-SB-CC48.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_five-things_e280baec9cfc70773bf9fe16775dad75__1540909645.html","title":"Five things that changed the outcome of the Falcons’ Super Bowl","title_page":"Five things that changed the outcome of the Falcons’ Super Bowl ","title_rss":"NULL","source_domain":"ajc.com","text":"The Falcons blew a perfect opportunity to win the franchise’s first Super Bowl.\nNew England quarterback Tom Brady led a furious rally from a 25-point deficit to pull out a 34-28 victory against the Falcons on Sunday in overtime before 70,807 fans at NRG Stadium.\n“That’s a hard one for us,” Falcons coach Dan Quinn said. “There’s no place to put that one.”\nIt was the biggest collapse in Super Bowl history. It was the Patriots’ fifth NFL championship, making Brady the winningest quarterback in Super Bowl history and he had the most passing yards ever in a Super Bowl with 466.\nOtto Graham won seven pro football championships in the pre-Super Bowl era and Bart Starr has five NFL championshps, including wins in the first two Super Bowls. Brady surpassed Joe Montana and Terry Bradshaw, who won four Super Bowl era titles. Arne Herber won four pre-Super Bowl era titles with the Green Bay Packers in 1930, 1931, 1936 and 1939.\nUnder the guidance of Quinn in his second season as head coach, the Falcons fell apart after holding a 28-3 lead with 8:31 to play in the third quarter.\nBrady completed 43 of 62 passes and was named the game’s most valuable player. The Patriots’ rally was capped when running back James White slammed into the end zone on a 2-yard run in the first overtime game in Super Bowl history.\n“We never felt out of it,” Brady said. “It was a tough battle. They have a great team. I give them a lot of credit. We just made a few more plays than them.”\nThis was the fifth time the Falcons, the NFC South champs, blew a fourth-quarter lead and lost this season.\nFalcons quarterback Matt Ryan, who had a key fumble on sack by Dont’a Hightower, completed 17 of 23 passes for 284 yards and two touchdowns.\nThe Falcons, on just the franchise’s second time in the league’s grandest game over their 51-year history, had a rash of miscues, penalties and bad coaching calls that led to their demise in the final 20 minutes.\n“We just made some mistakes that put us behind the chains,” Ryan said. “This is a tough loss.”\nHere are the 5 things that changed the outcome:\n1. Stripping the ball. With the Falcons ahead 28-12, Ryan dropped back to pass on third-and-1 from their 36. Hightower came on a blitz and leveled Ryan and knocked the ball loose.\nDefensive tackle Alan Branch recovered to ignite New England’s rally. The Patriots added two touchdowns and two two-point conversions to force overtime. The Patriots won the toss and scored on their first possession to earn the Vince Lombardi trophy.\nThe Falcons had used two turnovers to build their lead.\nWith the Patriots on the move at the Falcons’ 33, linebacker Deion Jones pulled the ball out from New England running back LeGarrette Blount and cornerback Robert Alford recovered.\nThat was the play that “set things off” as Quinn likes the say.\nThe Patriots and the Falcons had only 11 turnovers apiece this season.\nThe offense knew what to do with the ball and promptly marched in for the first score.\nAfter the Falcons built a 14-0 lead on a 19-yard touchdown pass to tight end Austin Hooper, Alford stepped in front of a pass intended for New England wide receiver Danny Amendola and returned it 82 yards for a touchdown.\nIt was the second-longest interception return for a touchdown in the title game’s history.\nThe Patriots had scored in the first quarter of 16 of 18 games this season, 14 were touchdowns. The Falcons shut them out in the first quarter.\n2. Offense picked up the tempo. After scoring touchdowns on the opening possession in eight consecutive games, the Falcons were held scoreless in the first quarter.\nLeft tackle Jake Matthews playing in front of family and friends in his hometown struggled early in the game as Ryan was sacked twice in the first quarter.\nThe Falcons got their third possession after Jones’ forced fumble.\nWith the game on the line, the offense sputtered. There was a big sack by Hightower and a holding penalty by Matthews that pushed the Falcons out of field goal range.\nHightower’s play occurred on a questionable pass play on third-and-1 from the New England’s 22. If the Falcons ran the ball, the run have ran some clock and perhaps had a field goal opportunity.\nRyan was sacked five times.\n3. Who had James White? The Falcons knew they had a speed advantage against New England’s slow linebackers. They attacked Shea McClellin and Rob Ninkovich laterally with tosses and other outside runs.\nThen in the third quarter, Ryan found Coleman out of the backfield in the flat. He caught the ball and out-ran Ninkovich to the corner of the end zone. The play-action fake forced the other linebackers to the left side of the field and that left Ninkovich isolated on Coleman in a speed mismatch.\nColeman’s score in the third quarter put the Falcons 28-3 and cheers of “ATL, ATL” rang throughout the stadium.\nIt was the last highlight for the Falcons, who had trouble with White, who caught 14 passes for 110 yards and they couldn’t stop the Patriots from scoring 31 unanswered points.\n4. Pressure on Brady. After an exchange of punts, the Falcons were able to mount a pass rush against Brady on their second possession of the game.\nDefensive tackle Courtney Upshaw steamrolled former Georgia Tech standout Shaq Mason for the franchise’s first Super Bowl sack. Grady Jarrett added the second and force the Patriots to punt.\nJarrett added two more sacks, including a key one in the fourth quarter that stop a Patriots’ threat and forced them to kick a field goal.\nDuring the Patriots’ rally, the pass rush was not a factor. The Patriots had worn out the Falcons’ defense with a nearly 2-1 edge in time of possession.\n5. Goodwin the secret weapon. Converted cornerback C.J. Goodwin, a former wide receiver, was one of the Falcons’ secret weapons against the Patriots.\nThey used him as the sixth defensive back and had him cover running backs Dion Lewis and White out of the backfield early.\nGoodwin was solid in coverage, but eventually the Patriots attacked nickel back Brian Poole and got a spectacular catch by Julian Edelman after Alford tipped the ball up in the air. Quinn challenged the play and lost the team’s third and final time out.","url":"https://www.ajc.com/sports/football/five-things-that-changed-the-outcome-the-falcons-super-bowl-loss/40yNffG54CJbAnLxktwPJJ/"}
