{"authors":[],"date_download":"2018-10-22 22:33:27","date_modify":"2018-10-22 22:33:27","date_publish":"2016-01-28 10:40:28","description":"US officials on Wednesday arrested five people in connection with the escape of three inmates from a southern California prison nearly a week ago. The trio r...","filename":"data/vaneerConsumption/FivearrestedoverCaliforniaprisonescapes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g7nf-2vdWmEltwXfba0ce28e63275eccd-451_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420687_Five-arrested-California-prison-escapes_1540247607.html","title":"Five arrested over California prison escapes","title_page":"Five arrested over California prison escapes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Five arrested over California prison escapes\nUS officials on Wednesday arrested five people in connection with the escape of three inmates from a southern California prison nearly a week ago.\nThe trio rappelled off a roof using knotted bed sheets when they fled the Orange County Men's Central Jail in Santa Ana on January 22.\n\"We have made around five arrests and we are going to make additional arrests throughout this evening and probably into tomorrow,\" said Orange County Sheriff Sandra Hutchens.\nOrange County police believe five escaped prisoners are dangerous, likely armed, and possibly being hidden by Vietnamese accomplices ©David McNew (Getty/AFP/File)\nThe suspects \"have some connection to the individuals who have escaped,\" she said at a press conference.\nPolice say that one of the fugitives, 20-year-old Jonathan Tieu, who was serving a murder sentence, was a member of a Vietnamese gang.\nThe other men who fled were identified as Hossein Nayeri, 37, who was serving time for kidnapping and torture, and 43-year-old Bac Duong, convicted of attempted murder.\nPolice believe the men are dangerous, likely armed, and possibly being hidden by Vietnamese accomplices.\n\"We are continuing to focus on a Vietnamese gangs,\" Hutchens said.\nThe sheriff said investigators believe the escapees must have had \"outside help\" in obtaining cutting tools for the jailbreak.\nThe Federal Bureau of Investigation (FBI) has offered a reward of $20,000 for information leading to their recapture, and the sheriff's department has also offered $30,000 -- $10,000 for each fugitive..","url":"https://www.dailymail.co.uk/wires/afp/article-3420687/Five-arrested-California-prison-escapes.html"}
