{"authors":["Lucas Nolan"],"date_download":"2018-10-30 18:24:11","date_modify":"2018-10-30 18:24:11","date_publish":"2018-08-07 16:04:33","description":"During a hearing before the Senate, Facebook CEO Mark Zuckerberg refused to define what constituted \"hate speech\" on Facebook. Nevertheless, his company used hate speech as a reason to ban InfoWars this week, betraying a complete lack of transparency.","filename":"data/vaneerConsumption/FlashbackFacebookCEOMarkZuckerbergRefusedtoDefineHateSpeechBeforeSenate.json","image_url":"https://media.breitbart.com/media/2018/04/GettyImages-944724820.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_07__1540923851.html","title":"Flashback: Facebook CEO Mark Zuckerberg Refused to Define 'Hate Speech' Before Senate","title_page":"Flashback: Facebook CEO Mark Zuckerberg Refused to Define 'Hate Speech' Before Senate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During a hearing before the Senate, Facebook CEO Mark Zuckerberg refused to define what constituted “hate speech” on Facebook. Nevertheless, his company used hate speech as a reason to ban InfoWars this week, betraying a complete lack of transparency.\nFollowing Facebook’s decision to ban multiple InfoWars related pages for violating their “hate speech” policies, it’s interesting to look back to April when Facebook CEO Mark Zuckerberg refused to define what qualifies as “hate speech” while testifying before the Senate. When Sen. Ben Sasse (R-NE) asked Zuckerberg to define the term, Zuckerberg was unable to do so and instead gave a long-winded explanation of his personal view of acceptable speech.\nFrom the article from April:\nSenator Sasse then simply asked; “can you define hate speech?” to which Zuckerberg replied; “Senator, I think that this is a really hard question and I think its one of the reasons why we struggle with it. There are certain definitions that we have that are around calling for violence or…” Senator Sasse interrupted Zuckerberg saying; “let’s just agree on that, if somebody is calling for violence that shouldn’t be there, I’m worried about the psychological categories around speech, you used language of ‘safety and protection’ earlier, we see this happen on college campuses across the country, it’s dangerous.”\nSasse further pressed Zuckerberg on the type of debate that Zuckerberg deemed accceptable on the platform:\n“Forty percent of Americans under age 35 tell pollsters they think the First Amendment is dangerous because you may use your freedom to hurt somebody else’s feelings. Guess what? There’s some really passionately held views about abortion on this panel today, can you imagine a world where you might decide that pro-lifers are prohibited from speaking about their abortion views on your platform?” said Sasse. “I certainly would not want that to be the case,” replied Zuckerberg. “But it might really be unsettling to people that have had an abortion to have a debate about that, mightn’t it?” asked Sasse. “It might be but I don’t think that would fit any of the definitions of what we have. But I do generally agree with the point that you’re making which is as we are able to technologically shift towards — especially having A.I. — proactively look at content, I think that is going to create massive questions for society about what obligations we want society to fulfill and I do think that is a question we need to struggle with as a country because I know other countries are and they’re putting laws in place and I think that America needs to figure out and create the set of principles that we want American companies to operate under.”\nFacebook’s statement on their decision to remove InfoWars from their platform reads:\nSo what happened with InfoWars? They were up on Friday and now they are down? As a result of reports we received, last week, we removed four videos on four Facebook Pages for violating our hate speech and bullying policies. These pages were the Alex Jones Channel Page, the Alex Jones Page, the InfoWars Page and the Infowars Nightly News Page. In addition, one of the admins of these Pages – Alex Jones – was placed in a 30-day block for his role in posting violating content to these Pages. Since then, more content from the same Pages has been reported to us — upon review, we have taken it down for glorifying violence, which violates our graphic violence policy, and using dehumanizing language to describe people who are transgender, Muslims and immigrants, which violates our hate speech policies. All four Pages have been unpublished for repeated violations of Community Standards and accumulating too many strikes. While much of the discussion around Infowars has been related to false news, which is a serious issue that we are working to address by demoting links marked wrong by fact checkers and suggesting additional content, none of the violations that spurred today’s removals were related to this.\nFacebook also recently chose to block a campaign ad for Republican congressional candidate Elizabeth Heng, stating that it was “too shocking” for their platform.\n“It is unbelievable that Facebook could have such blatant disregard for the history that so many people, including my own parents, have lived through,” declared Heng in a statement. “I’m sure it is shocking for some people to hear about this kind of injustice, but this is reality. This is why I wake up every single day with the fight and determination to have a voice and make a difference in my community.”\n“Neither Facebook nor any other company in the tech industry get to silence our stories,” she continued. “We’ve seen it over and over again with Republican candidates and organizations.”\nFacebook’s complete lack of transparency means both individuals, politicians, and organizations have no idea what standard they are being held to on Facebook, the largest social media platform in the world.","url":"https://www.breitbart.com/tech/2018/08/07/flashback-facebook-ceo-mark-zuckerberg-refused-to-define-hate-speech-before-senate/"}
