{"authors":[],"date_download":"2018-10-22 21:53:39","date_modify":"2018-10-22 21:53:39","date_publish":"2014-05-08 17:20:34","description":"Monica Lewinsky is back in the news this week, but today also marks the anniversary of an earlier political sex scandal.","filename":"data/vaneerConsumption/FlashbackGaryHartScandal.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_flashback-gary-hart-scandal-n100521_1540245219.html","title":"Flashback: Gary Hart Scandal","title_page":"Flashback: Gary Hart Scandal ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMonica Lewinsky is back in the news this week, but today also marks the anniversary of an earlier political sex scandal, once thought to be one of the most explosive in modern politics.\nOn May 8, 1987, Democratic presidential candidate Gary Hart announced his withdrawal from the presidential race, less than a month after he had entered it. The former Colorado senator, once a frontrunner for the Democratic nomination, had long been plagued by rumors of infidelity, and his press conference that day was full of bitterness at the media and journalists who he said had unfairly targeted him.\nBut a week earlier, Hart had famously dared journalists to follow his every move – an unthinkable move for a troubled politician in today’s media climate. In a May 3 New York Times Magazine profile, Hart told E.J. Dionne: ''Follow me around … If anybody wants to put a tail on me, go ahead. They'd be very bored.''\nUnfortunately for Hart, the Miami Herald had been doing just that and spread the story of Hart’s close relationship with 29-year old model Donna Rice across the paper’s front page that same day. In an interview with NBC News that aired the day of the expose (but was taped earlier), Hart showed no signs of concern for his candidacy.\nRiding in his campaign bus just days before he would resign, Hart said: “People can keep asking questions ‘til they’re blue in the face, but that doesn’t do any damage unless there’s something to it.”\nYou can watch the NBC News Weekend Report on Gary Hart, courtesy of NBCUniversal Archives, in the clip below.","url":"https://www.nbcnews.com/politics/politics-news/flashback-gary-hart-scandal-n100521"}
