{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-23 01:38:36","date_modify":"2018-10-23 01:38:36","date_publish":"2017-03-16 11:53:34","description":"What unfolded that afternoon in Sheffield would enter the English football annals as one of those trivia book and pub quiz curiosities that jumps out from a season's mundane list of results.","filename":"data/vaneerConsumption/FlashbacktotheBattleofBramallLane15yearsago.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53A7B700000578-0-image-a-95_1489665058379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319806_Flashback-Battle-Bramall-Lane-15-years-ago_1540258716.html","title":"Flashback to the Battle of Bramall Lane 15 years ago","title_page":"Flashback to the Battle of Bramall Lane 15 years ago | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Article one of law three in the rules of football states simply: 'A match may not start or continue if either team has fewer than seven players.'\nIt's not something invoked too often in an 11-a-side sport but it was 15 years ago in one of the game's strangest abandonments.\nThe Football League Division One fixture between Sheffield United and West Bromwich Albion on March 16, 2002 at Bramall Lane was meant to be pretty run-of-the-mill.\nSheffield United and West Brom players square up during the infamous 'Battle of Bramall Lane' which happened 15 years ago\nReferee Eddie Wolstenholme tries to restore order as United's Keith Curle and West Brom's Scott Dobie square up during a match that was eventually abandoned\nThe controversy led to a bitter war of words between Baggies boss Gary Megson (left) and his Sheffield United counterpart Neil Warnock\nThe Baggies were in third position but not looking too likely to catch their local rivals Wolverhampton Wanderers and snatch the second automatic ticket to the Premier League. The Blades were in 15th and safe from relegation.\nBut what unfolded that afternoon in Sheffield would enter the English football annals as one of those trivia book and pub quiz curiosities that jumps out from the list.\nLooking back at the game's context now, it was actually a decent bet that something out-of-the-ordinary would happen. The respective managers - United's Neil Warnock and West Brom's Gary Megson - were hardly shrinking violets.\nThe previous five meetings between the teams had also witnessed four red cards, so there was a powderkeg feel about things even without any extra animosity based on geography or league placings.\nThen there was the story of United's Georges Santos, who had suffered a double eye socket fracture under challenge from Andy Johnson, then at Nottingham Forest, almost a year to the day before.\nMichael Brown (right) was one of the United players who went off injured when they were already down to eight men, forcing the match to be abandoned\nThe match spiralled out of control during the second half as the Blades had three sent off\nThe Baggies players look on in disbelief as the match is abandoned late on\nMatch facts Division One - March 16, 2002 Sheffield United 0 West Bromwich Albion 3 (Match abandoned after 82 minutes) Sheffield United: Tracey; Uhlenbeek (Santos 64), Page, Curle (c), Ullathorne; Jagielka, Tonge (Suffo 64), Brown; D'Jaffo, Ndlovu (De Vogt 9), Peschisolido Substitutes not used: Javary, Montgomery Sent off: Tracey 9; Santos 65; Suffo 65 Booked: Brown, Curle Manager: Neil Warnock West Bromwich Albion: Houlkt; Balis, Sigurosson (Butler 68), Chambers (Taylor 56), Clement, Gilchrist, Moore; Johnson (Jordao 71), McInnes (c); Dobie, Dichio Substitutes not used: Adamson (GK); Fox Scorers: Dobie 18, 77; McInnes 63 Booked: Sigurosson Manager: Gary Megson Referee: Eddie Wolstenholme (Lancashire) Attendance: 17,653\nIt didn't take too long for the first of many, many flashpoints as Johnson and his West Brom promotion hunters rocked up at the Lane.\nJust nine minutes had elapsed when United goalkeeper Simon Tracey handballed outside the area under pressure from Scott Dobie. That was red card No 1.\nFor almost an hour, a proper game of football then unfolded, with Dobie and Derek McInnes putting the Baggies into a comfortable 2-0 lead.\nJust after the hour mark, Warnock introduced Santos, who was clearly motivated purely by revenge.\nHe'd only been on the field a minute when he sent Johnson flying into the air with a sickening challenge. It was a straightforward decision for referee Eddie Wolstenholme, who was about to be busier than he ever imagined.\nIncensed by the bad tackle, the West Brom players piled in and there was angry pushing and shoving. It was during this melee that Cameroonian Patrick Suffo, who'd come on alongside Santos, headbutted McInnes, drawing blood.\nWolstenholme duly pulled out the red for the third time and the Blades were looking rather blunt with just eight men.\nFrom there, things just got more and more controversial. Dobie added West Brom's third, a tap-in from close range.\nIt was then that United's Michael Brown, lucky to be on the field following a rash challenge minutes earlier, pulled up injured and hobbled out of the fray. Seven men.\nAnd as if by magic, Robert Ullathorne suddenly decided that he, too, had suffered an injury and would have to come off as well.\nScott Dobie celebrates with Neil Clement after scoring West Brom's opening goal\nDerek McInnes celebrates after scoring with a thunderbolt to double the away side's lead\nBlades captain Keith Curle gets in an argument with West Brom's McInnes\nWolstenholme knew that you're not supposed to play on with six men and so called a halt to proceedings with eight minutes left to play.\nMegson was livid: 'They were being told by certain people to go down, come off. Michael Brown wasn't injured. Everybody's heard it, everyone knows what was going on on that line.\n'I've been in professional football since 16 and I'm 42 now. I've never ever witnessed anything as disgraceful as that. There is no place for that in any game of football, let alone professional football.'\nThe Baggies manager said that if forced to replay the game, he would instruct his team to kick-off and then walk off the pitch in protest.\nDobie celebrates after scoring again in the second-half of the game at Bramall Lane\n'I wouldn't imagine Gary will be having a drink with me tonight,' Warnock said, having insisted that Brown was genuinely injured.\nBy the time the first editions had gone to print, the game had been rechristened 'The Battle of Bramall Lane.'\nIn the end, the Football League allowed common sense to prevail, awarding West Brom the 3-0 win and three points.\nUnited were fined £10,000, Suffo £3,000 and a six-match ban, and Santos also a six-match ban. Warnock never selected Santos nor Suffo for the team again.\nCome May, United finished in 13th while West Brom did bridge that huge gap and stole Wolves' automatic promotion place. It had certainly been an eventful season.","url":"https://www.dailymail.co.uk/sport/football/article-4319806/Flashback-Battle-Bramall-Lane-15-years-ago.html"}
