{"authors":[],"date_download":"2018-10-23 00:25:54","date_modify":"2018-10-23 00:25:54","date_publish":"2016-01-28 14:25:25","description":"Novak Djokovic said his sublime first two sets against Roger Federer were the best he's ever played against the Swiss as he reached his sixth Australian Open...","filename":"data/vaneerConsumption/FlawlessDjokovicfloorsFederertoreachAustralianOpenfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g8e5-4vVdYopwYQ7f641721b07ae1d48c-458_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421034_Flawless-Djokovic-floors-Federer-reach-Australian-Open-final_1540254354.html","title":"'Flawless' Djokovic floors Federer to reach Australian Open final","title_page":"'Flawless' Djokovic floors Federer to reach Australian Open final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Flawless' Djokovic floors Federer to reach Australian Open final\nNovak Djokovic said his sublime first two sets against Roger Federer were the best he's ever played against the Swiss as he reached his sixth Australian Open final in convincing fashion on Thursday.\nThe world number one, now into his fifth straight Grand Slam final, was on a different level to the 17-time major winner in the opening two sets as he dished out a dominant, four-set semi-final victory.\nThe five-time winner maintained his hold over world number three Federer, winning 6-1, 6-2, 3-6, 6-3 in two hours, 19 minutes, and will face either Andy Murray or Milos Raonic in Sunday's final.\nSerbia's Novak Djokovic celebrates after reaching his 19th Grand Slam final following his 6-1, 6-2, 3-6, 6-3 victory over Switzerland's Roger Federer at the Australian Open in Melbourne, on January 28, 2016 ©Saeed Khan (AFP)\nIt was the 45th meeting between two titans of the sport, with Djokovic now edging Federer 23-22 in their head-to-head duels.\n\"These first two sets have been probably the best two sets I've played against him overall throughout my career,\" declared Djokovic.\n\"I've had some moments against him in sets where I've played on a high level, but this was, yeah, I think a different level than from before.\n\"I'm just very, very pleased that I was able to perform the way I did from the very beginning till the end.\"\nDjokovic, who was simply irresistible in cruising two sets up in 54 minutes, said he played \"flawless\" tennis.\n\"When you're playing one of your top rivals, somebody of Roger's resume, of course it requires a lot of focus, determination, and a different preparation for that match-up than most of the other matches,\" he said.\n\"I played flawless tennis for first two sets, no doubt about it.\"\n- 'Joyful feeling' -\nDjokovic said he was now going to enjoy his two days off and prepare for his 19th Grand Slam final.\n\"I think it's good for me at this stage. I've played a lot of tennis. Actually it's going to serve me well for my recovery,\" he said.\n\"Tomorrow's match is going to be interesting to watch. Being in the final and watching the other semi-final, of course it's quite a joyful feeling. Whoever wins I'm going to be ready for the great battle.\"\nDjokovic broke Federer's serve five times, dropped his serve just once, won 115 points to 82 and hit 33 winners with only 20 unforced errors, while Federer committed 51 unforced errors.\nThe 10-time Grand Slam champion was in jaw-dropping form in the opening two sets, carving up Federer in their 15th Grand Slam encounter with his dazzling groundstrokes for the loss of only three games.\nHe broke Federer's first service to 15 and then held his serve to lead 3-0, winning 12 of the first 14 points.\nThe Swiss third seed was broken again in the sixth game, netting a forehand with Djokovic in full cry.\nDjokovic's 6-1 first set was his easiest opening set win over Federer. He won 24 points to 11, with the rushed Swiss making 12 unforced errors.\nFederer was broken to love in the third game in a similar start to the second set with the world number one able to do no wrong.\nFour-time winner Federer probed for a way back in, with the Australian crowd urging him on, and he broke Djokovic for the first time in the match in the sixth game.\nThe Swiss was finally putting pressure back on the world number one and he claimed the third set on his third set point, to a thunderous roar on Rod Laver Arena.\nBut both players had to cool their heels as play was delayed temporarily to enable the stadium roof to be closed ahead of expected rain, making for indoor playing conditions.\nDjokovic broke Federer for a fifth time in the match in a sensational eighth game of the fourth set, featuring a forehand return winner for the break, and he safely served out for the match in the following game.\nSwitzerland's Roger Federer waves to the crowd as he leaves the court after losing to Serbia's Novak Djokovic in the Australian Open semi-finals on January 28, 2016 ©Saeed Khan (AFP)\nSerbia's Novak Djokovic plays a backhand return during his semi-final match against Switzerland's Roger Federer at the Australian Open in Melbourne, on January 28, 2016 ©Saeed Khan (AFP)\nSwitzerland's Roger Federer speaks during a press conference after defeat against Serbia's Novak Djokovic in the Australian Open semi-finals on January 28, 2016 ©Peter Parks (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3421034/Flawless-Djokovic-floors-Federer-reach-Australian-Open-final.html"}
