{"authors":[],"date_download":"2018-10-30 01:00:01","date_modify":"2018-10-30 01:00:01","date_publish":"2015-08-14 00:00:00","description":null,"filename":"data/vaneerConsumption/FlexibleObamaIgnoresRussianTreatyViolations.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_08_flexible_obama_ignores_russian_treaty_violations_comments_1540861201.html","title":"'Flexible' Obama Ignores Russian Treaty Violations","title_page":"Articles: 'Flexible' Obama Ignores Russian Treaty Violations","title_rss":"NULL","source_domain":"americanthinker.com","text":"It does not bode well that an Obama administration that assures us that the nuclear deal with Iran will not be violated by the mullahs is clearly looking the other way as Iran’s ally Russia blatantly violates the 1987 Intermediate Nuclear Forces (INF) Treaty signed with the former Soviet Union. The Obama White House is sitting on a Pentagon risk assessment report completed last month that states “that the breach involved a new missile that violates the limits set by the treaty. The treaty bans holding, producing, or flight-testing ground-launched ballistic or cruise missiles with ranges of between 310 miles and 3,418 miles.” As Bill Gertz reports in the Washington Examiner At the Pentagon, spokesman Capt. Greg Hicks said: “The Chairman’s assessment of Russia’s Intermediate-range Nuclear Forces (INF) Treaty violation is classified and not releasable to the public.” Hicks said, however, that steps are being taking “across... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/08/flexible_obama_ignores_russian_treaty_violations_comments.html"}
ype of response, if any.”\n“If any” means nothing likely will be done either in terms of sanctions in the development testing of the Russian RS300 cruise missile or in the deployment of additional missile defenses in Eastern Europe that might offend President Obama’s untrustworthy friend, Russian President Vladimir Putin After all, President Obama has pulled the rug out from under our allies, notably Poland and the Czech Republic, before.\nWhen President Obama took office in January, 2009, sitting on his desk were President George W. Bush’s plans for the deployment of ground-based missile interceptors, such as are deployed at Fort Greely, Alaska, in Poland as well as missile defense radars in the Czech Republic, As Investor’s Business Daily noted over a year ago, President Obama had other plans and his betrayal of our allies was ironically exquisite:\nYet within hours of Medvedev's election as president in 2008, the Russian announced that Moscow would deploy SS-26 missiles in his country's enclave of Kaliningrad situated between our NATO allies Poland and Lithuania. He wanted the U.S. to abandon plans to deploy missile interceptors in Poland and warning radars in the Czech Republic designed to counter a future threat from Iran. What did President Obama do? He caved in and notified the Poles in a midnight phone call on Sept. 17, 2009 -- the 70th anniversary of the Soviet Union's invasion of Poland -- that we were pulling the plug on that system due to Russian objections. Putin then watched in 2012 as Obama promised Medvedev at the Nuclear Security Summit in Seoul, South Korea, that after his re-election he would have more \"flexibility\" to weaken missile defense, which would help him fulfill his dream of U.S. disarmament.\nPutin knows full well Obama’s weakness in responding to any foreign threat to U.S. interests and security. President Obama is the Neville Chamberlain of our time, promising “peace in our time” as he invites war with weakness, apologies, and appeasement.\nRussia is pushing ahead with several missiles in violation of the INF Treaty as part of Putin’s plan to reassemble the old Soviet Union and dominate Eastern Europe once again. Among those missiles is the R-500 cruise missile and the RS-26 Rubezh ballistic missile:\nU.S. intelligence officials have told the Washington Free Beacon that the Yars-M missile, also known as the RS-26, is a clear and blatant violation of the INF Treaty. Mark Schneider, a specialist on Russian missiles at the National Institute for Public Policy in Virginia, agrees that the new Yars M appears to be an INF violation. A June 6 test of the Yars M, first disclosed by the Free Beacon, revealed it was launched from a missile base at Russia's Kapustin Yar and landed at an impact range at Sary Shagan, 1,242 miles to the south. That is \"clearly INF range,\" Schneider said.\nPresident Obama has said his dream is a world without nuclear weapons. What he really means is a world without American nuclear weapons and a credible nuclear deterrent. The Russians are free to develop and deploy nuclear delivery vehicles in violation of signed and ratified treaties. How’s Hillary Clinton’s reset button working for you, President Obama?\nIn light of President Obama’s callous disregard of treaty enforcement and the rising Russian missile threat, why should we believe we can trust him or the Iranians on the nuke deal? President Obama trusts and won’t verify. He not only allows Iran to remain on the threshold of a nuclear weapon but also to later resume developing ballistic missiles whose only purpose is to deliver a nuclear warhead to an Israeli city.\nReset? President Obama has clearly pressed the “snooze” button.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine, and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2015/08/flexible_obama_ignores_russian_treaty_violations.html"}
