{"authors":[],"date_download":"2018-10-22 22:12:47","date_modify":"2018-10-22 22:12:47","date_publish":"2014-05-08 16:04:15","description":"“I’m going to come and kill you next,” an unknown person sent to Sarah Bajc via instant message.","filename":"data/vaneerConsumption/Flight370PhilipWoodsGirlfriendSarahBajcGotDeathThreat.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/238116/140308-malaysia-plane-js-1034_a5a775f88e6ce79ff901171214fb5597.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_flight-370-philip-woods-girlfriend-sarah-bajc-got-death-threat-n100446_1540246367.html","title":"Flight 370: Philip Wood's Girlfriend Sarah Bajc Got Death Threat","title_page":"Flight 370: Philip Wood's Girlfriend Sarah Bajc Got Death Threat","title_rss":"NULL","source_domain":"nbcnews.com","text":"“It was just another straw on the camel’s back, very upsetting,\" Bajc told NBC News.\nAccording to Bajc, the calls and messages began shortly after her apartment was broken into for the first time, midway into the second week after the flight disappeared.\n“Whoever came wasn’t very careful because I’m a real neat freak, so it was immediately apparent to me that some things had been moved,” she said. “My housekeeper was out of town so it couldn’t have been her and I got home before my son got back. The password on my safe had been reset which happens when you try the wrong code three times.\"\nBajc added: “The second time was a couple weeks later and my neighbor saw two people leaving my apartment. I have no illusions of privacy here [in Beijing].”\nShe said the calls stopped after an FBI agent assigned to help her and Wood’s family was informed.\nBajc is among 350 family members of passengers aboard the missing jet who have demanded raw data be released for independent analysis amid questions about how the investigation has been conducted.\nIn an open letter sent to the leaders of Malaysia, China and Australia on Thursday, the relatives questioned how authorities could be certain the Boeing 777 had crashed into the southern Indian Ocean.\nAustralian officials expect a global team of experts will take about two weeks to review all the data relating to the missing plane.\nThe Beijing-bound flight was carrying 239 people. More than two months later, no wreckage has been found.","url":"https://www.nbcnews.com/storyline/missing-jet/flight-370-philip-woods-girlfriend-sarah-bajc-got-death-threat-n100446"}
