{"authors":[],"date_download":"2018-10-22 21:47:28","date_modify":"2018-10-22 21:47:28","date_publish":"2014-05-08 12:15:21","description":"In a letter to leaders of Malaysia, China and Australia, relatives question how authorities could be certain the jet crashed into the Indian Ocean.","filename":"data/vaneerConsumption/FlightMH370FamiliesWeHaveNoFaithinMissingJetProbe.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/428926/140508-mh370-relatives-jsw-1001a_9730c2667cde7e9000080f512e6ff3df.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_flight-mh370-families-we-have-no-faith-missing-jet-probe-n100161_1540244848.html","title":"Flight MH370 Families: We Have No Faith in Missing Jet Probe","title_page":"Flight MH370 Families: We Have No Faith in Missing Jet Probe","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlmost 350 family members of passengers aboard missing Flight MH370 demanded raw data be released for independent analysis amid questions about how the investigation has been conducted.\nIn an open letter sent to the leaders of Malaysia, China and Australia on Thursday, the relatives questioned how authorities could be certain the Boeing 777 had crashed into the Indian Ocean after vanishing without a trace two months ago. No wreckage has been found.\n“Due to the lack of physical evidence that MH370 ended in the Southern Indian Ocean, the families are in urgent need for the conclusion, based on [British satellite communications firm] Inmarsat data analysis, that the aircraft’s flight ended in that ocean to be reconsidered to confirm its accuracy,” they wrote.\nIn a letter titled \"A PLEA FROM THE FAMILIES OF MH370,\" the relatives argued the data analysis “only indicates a probable southern flight path” and does not “support a definitive conclusion that no other flight path was possible.\"\nThey added: \"We feel that it is necessary that the data be subject to independent third-party review. It is our hope that with out of box thinking, the whole world can help to look for the plane.\"\nThe group is calling itself \"The Cry for Truth: Voice370\" and says it has the \"sole intention of finding MH370 and our loved ones.\"\n\"It’s the not knowing that is awful\"\nSarah Bajc, the girlfriend of Flight 370 American passenger Philip Wood, told NBC News on Thursday that most of the victims' families had little confidence in the ongoing probe.\n“We don’t trust the way the investigation has gone so far,” said Bajc, who was among those who signed the letter. “We want pressure on to make this investigation independent, because otherwise things will go from bad to worse.”\nBajc described the limbo of having a missing loved one as \"worse than death.\"\nShe added: \"If we knew our loved ones were all dead, then we would have a proper grieving cycle and move on with our lives. It’s the not knowing that is awful.\"\nBajc accused Malaysian officials of not listening to relatives over the past two months.\n\"We hope that the powers that be take this letter seriously,\" she said. \"If they look at history they should know that families tend to get louder and more aggressive the more they are ignored. We should all have the same goal and that is looking for the plane.\"\nInstead of governments leading the investigation, the families said all the data should be handed to the Wood Hole Oceanographic Institute (WHOI) which found the remains of missing Air France Flight 447 in 2009, almost two years after it crashed into the Atlantic Ocean.\n“In our view, that WHOI is not a commercial entity and its successful location of Air France 447 demonstrates that it has the experience and expertise to conduct the search for MH370 in an ethical manner,” the letter added.\nTheir plea came hours after Australian officials said it would take two weeks for a global team of experts to review all the data relating to the missing plane.\nThe Beijing-bound flight disappeared after leaving Kuala Lumpur on March 8 with 239 people on board.\nMany of the grief-stricken families in China have never accepted investigators’ theories that the Malaysia Airlines plane flew thousands of miles off course.\nTwo weeks after the flight disappeared, emotions boiled over as families of missing passengers shouted angrily at Malaysian officials and accused them of “delaying, concealing and cheating” over the investigation.\nAnd last month, relatives of passengers held Malaysia Airlines workers hostage for almost 11 hours at a Beijing hotel.\nThe 200-strong group \"expressed dissatisfaction\" about the information being given to them, according to a statement by the airline.\nSome of that distrust is the inevitable consequence of life in a country where a lot of information given by government officials and media sources cannot be trusted.\n“Chinese media is highly controlled and much of the information that is given out is done so by the government for government purposes,” Rod Wye, associate fellow with the Asia program at London's Chatham House think tank told NBC News in March. “People are increasingly aware of that and tend to regard official pronouncements with a great deal of skepticism.”\nAppearing on NBC's TODAY last month, Bajc said that family members wanted \"new people looking at the information.\"\nSpeaking to TODAY's Matt Lauer on Day 45 of the search, Bajc added: \"We are basically at the same position we were on on the first day. We want to come back to taking this investigation away from the Malaysian government. We believe it’s been mishandled.\"\nEd Flanagan, Eric Baculinao and Alastair Jamieson of NBC News contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-jet/flight-mh370-families-we-have-no-faith-missing-jet-probe-n100161"}
