{"authors":[],"date_download":"2018-10-22 21:47:34","date_modify":"2018-10-22 21:47:34","date_publish":"2014-06-06 15:25:56","description":"This device can read your mind, and it just might make flying safer.","filename":"data/vaneerConsumption/FlightofFancyPilotingPlanesWithMindControl.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/492366/mindcontrolplane_06bed5befca149141efe512b9c6c33cc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_flight-fancy-piloting-planes-mind-control-n124566_1540244854.html","title":"Flight of Fancy: Piloting Planes With Mind Control","title_page":"Flight of Fancy: Piloting Planes With Mind Control","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"If flying is more intuitive, it is also easier and thus safer,\" Tim Fricke, an aerospace engineer at Technische Universität München in Germany, who helped develop the system, told Live Science. \"Moderately trained general aviation pilots with [little] flying experience would probably benefit the most from this new approach.\"\nDuring the virtual flying simulations, researchers fitted seven pilots with a white cap covered with dozens of electroencephalography (EEG) cables to record the subjects' brain waves. The EEG cables sent electrical signals to a computer, which was running the mind-control algorithm; the computer then converted the electric signals into an action that was carried out wirelessly.\nBrain waves have distinct patterns, so the algorithm can specifically target the pilots' plane-control thoughts.\nJust by thinking commands, the pilots who participated in the experiment were able to complete maneuvers such as takeoffs and landings, and they were able to keep the plane within a few degrees of a given compass direction, the researchers said. The pilots' accuracy surprised the team; if the simulations had been real flights, each of the participants would have passed all the requirements in a pilot license test.\nHowever, the mind-control technique has limitations. During flight, pilots rely on the resistance they feel from the physical controls in order to keep the plane on track through clouds and high winds, the researchers said. In mind-controlled flight, the pilots lack this feedback. Researchers need to design a way to signal to the pilots when they are overcorrecting, Fricke said, adding that this could be accomplished by giving the pilots a visual or auditory signal.\nThis is a condensed version of an article that appeared in Live Science. Read the entire story here. Follow Kelly Dickerson on Twitter. Follow us @livescience, Facebook & Google+.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/weird-science/flight-fancy-piloting-planes-mind-control-n124566"}
