{"authors":["Associated","Press Reporter"],"date_download":"2018-10-22 20:01:38","date_modify":"2018-10-22 20:01:38","date_publish":"2016-01-29 00:03:20","description":"Emails obtained by the advocacy group Progress Michigan reveal state officials acknowledged concerns about the water quality in January 2014, while locals were told not to worry.","filename":"data/vaneerConsumption/FlintgovernmentworkershavebeengettingwaterforaYEAR.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:71fe17c2d2c74f5c9a6dfd2bf4c6beac-2vdWmEltwXfba0ce28e632e24b98-382_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421027_The-Latest-Pistons-owner-offers-10M-resolve-Flint-woes_1540238498.html","title":"Flint government workers have been getting water for a YEAR","title_page":"Flint government workers have been getting water for a YEAR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An official says the state of Michigan has offered fresh bottled water at a state building in Flint for a year - although residents were told not to worry about their tap water until last fall.\nCaleb Buhs, a spokesman for the agency that manages state buildings, says the water coolers began in January 2015 after Flint had flunked some drinking water standards apart from the lead contamination that has caused the current crisis.\nHe says the water coolers still are supplied to a state building in Flint. Employees can also use the drinking fountains if they wish.\nBuhs says it was a decision 'we made as the building owner'.\nScroll down for video\nCity in crisis: Members of the Michigan National Guard load bottled water at a fire station on Thursday in Flint. It was revealed today that government employees have been given bottled water for one year\nEmails released by Progress Michigan, a liberal group critical of Gov. Rick Snyder, show the state was sending bottled water a year ago to state employees in Flint.\nA memo sent January 7, 2015, states that due to the concerns, '[Department of Technology, Management and Budget] is in the process of providing a water cooler on each occupied floor, positioned near a water fountain, so you can choose which water to drink', The Huffington Post reported.\nIn a statement sent to The Huff Post on Thursday, a spokesperson for the Department of Technology, Management and Budget - the managers of the building - said they chose to install the water coolers after receiving a 'violation of a drinking water standard' notice from the city.\nThe water came at a time when Flint announced it had flunked some drinking water standards apart from the lead contamination that has spoiled tap water and caused a crisis.\nLonnie Scott of Progress Michigan says Snyder's administration was taking care of employees while Flint residents were being told to not worry about tap water.\nMelanie Brown, a spokeswoman at the Department of Environmental Quality, couldn't immediately say for how long the state provided water.\nDeluged: Gov. Rick Snyder speaks about the Flint water crisis during a press conference on Wednesday January 27, 2016. Environmental and civil rights groups want all lead pipes in Flint's water system replaced\nOfficials have also announced new recycling efforts in Flint in response to the heavy use of bottled water and filters because of lead-contaminated tap water.\nThe new steps were announced Thursday at a fire station that's doubling as a water distribution site.\nMatt Flechter, a recycling specialist with the state of Michigan, says residents are concerned about the impact of bottles on the environment.\nNational Guard members at the fire station handed out water and plastic bags that residents can use for bottles that don't fit into curbside bins. Residents also can use the bags for recycling if they don't have a bin.\nFlint used the Flint River for 18 months but didn't add corrosion control to the water. As a result, lead has leached from old pipes.\nA state board has rejected petitions to recall Michigan Gov. Rick Snyder over his handling of Flint's lead-contaminated water.\nThe Board of State Canvassers rejected the petitions Thursday, 4-0. The board says the reasons for a recall must be clear and factual, under Michigan law. If they're not, no one can gather signatures to force a recall election.\nFlint resident Quincy Murphy wants to recall Snyder for 'failing to protect the health and safety' of the citizens of Flint. Snyder attorney John Pirich says that's opinion, not fact.\nHelping hand: John Whitaker, executive director of Midwest Food Bank, carries a case of water that was donated on Wednesday in Indianapolis. All of the water will be sent to Flint\nIf petitions were approved, the Detroit Free Press says Snyder's opponents would have to collect about 790,000 signatures in a 60-day period to force an election.\nThe Michigan Legislature has unanimously approved $28 million in additional funding to address the lead contamination of Flint's water.\nThe emergency spending bill includes money for more bottled water and filters and services to monitor for developmental delays in young children. The funds also will help the city with unpaid water bills and cover testing, monitoring and other costs.\nIt is the second round of state funding allocated since the lead contamination was confirmed in the fall.\nState regulators permitted Flint to not treat water for corrosion after the city switched its supply in 2014. That allowed lead from old pipes to leach into the water.\nGov. Rick Snyder has promised to set aside more funding for Flint in his upcoming budget proposal.\nMichigan Gov. Rick Snyder and Flint Mayor Karen Weaver are meeting with area pastors in the city dealing with lead-tainted drinking water.\nThe Michigan Legislature voted Thursday to direct another $28 million to address Flint's water emergency, allocating money for bottled water, medical assessments and other costs in the struggling city\nSnyder said at the beginning of Thursday's meeting it's important for officials to engage with residents as much as possible.\nOutside the mayor's offices, where the meeting was taking place, Lila Cabbil of the People's Water Board and Lynna Kaucheck of Food and Water Watch showed off the 21,000-plus petition signatures they were delivering.\nThey want a moratorium on water bills for Flint residents, arguing people shouldn't have to pay for water they can't use or sickens them.\nState regulators permitted Flint to not treat water for corrosion after the city switched its supply in 2014. That allowed lead from old pipes to leach into the water.\nU.S. Senate Democrats are introducing a measure to provide up to $400 million in new federal funding to replace and fix lead-contaminated pipes in Flint, Michigan.\nThe bill also requires federal action if a state refuses to warn the public about unsafe water and authorizes $20 million a year to monitor lead exposure in Flint.\nDemocratic Sens. Gary Peters and Debbie Stabenow of Michigan were expected to offer the measure Thursday as an amendment to a Senate energy bill.\nLt. Gov. Brian Calley speaks at a press conference on Thursday at a Flint Fire Station. Officials announced new recycling efforts in response to the heavy use of bottled water and filters\nFlint's water became contaminated when the financially-struggling city switched from the Detroit municipal system and began drawing from the Flint River in 2014 to save money.\nRegulators failed to ensure the water was treated properly and lead from pipes leached into the supply, leading to a spike in child lead exposure.\nThe Michigan Senate has unanimously approved $28 million in additional funding to address the lead contamination of Flint's water.\nThe emergency spending bill includes money for more bottled water and filters and services to monitor for developmental delays in young children. The funds also will help the city with unpaid water bills and cover testing, monitoring and other costs.\nIt is the second round of state funding allocated since the lead contamination was confirmed in the fall.\nThe House is expected to send the legislation to Gov. Rick Snyder later Thursday.\nState regulators permitted Flint to not treat water for corrosion after the city switched its supply in 2014. That allowed lead from old pipes to leach into the water.\nSnyder has promised to set aside more funding for Flint in his upcoming budget proposal.\nContaminated: Flint's water became contaminated with lead when the city switched from the Detroit municipal system and began drawing from the Flint River in April 2014 to save the financially struggling city money\nTom Gores, a Flint native and owner of the Detroit Pistons, is pledging to raise $10 million to address the short- and long-term needs of his Michigan hometown, where the drinking water is contaminated with lead.\nGores said in a statement Thursday he has appointed two associates to raise money from other business leaders and identify priorities in Flint.\nGores, who is chairman of Los Angeles-based Platinum Equity, also will contribute. He says Flint once was a 'cornerstone of American industry,' and that people 'from coast to coast' need to step up.\nPistons vice chairman Arn Tellem and Platinum Equity partner Mark Barnhill will lead the effort.\nBarnhill says the residents' immediate needs are important but that long-term opportunities in Flint will also be explored, such as small business assistance.\nThe Michigan Legislature is poised to approve $28 million in additional funding to address the lead contamination of Flint's water.\nThe emergency spending bill up for final voting Thursday includes money for more bottled water and filters and services to monitor for developmental delays in young children. The funds also will help the city with unpaid water bills and cover testing, monitoring and other costs.\nIt is the second round of state funding allocated since the lead contamination was confirmed in the fall.\nState regulators permitted Flint to not treat water for corrosion after the city switched its supply in 2014. That allowed lead from old pipes to leach into the water.","url":"https://www.dailymail.co.uk/news/article-3421027/The-Latest-Pistons-owner-offers-10M-resolve-Flint-woes.html"}
