{"authors":[],"date_download":"2018-10-30 01:17:46","date_modify":"2018-10-30 01:17:46","date_publish":"2018-08-29 00:05:44","description":null,"filename":"data/vaneerConsumption/FlippingGoodforProsecutorsNotthePublic.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Trump_executive_Michael_Cohen_013_5506627816.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862266.html","title":"Flipping: Good for Prosecutors, Not the Public","title_page":"Flipping: Good for Prosecutors, Not the PublicThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"After President Trump’s personal lawyer Michael Cohen pleaded guilty to eight felonies , Trump blasted how federal prosecutors coerce people to plead guilty, whether they’ve done anything wrong or not, and to play ball with investigators to target others. Trump said “ it’s called flipping and it almost ought to be illegal .” A self-serving remark, but totally on the mark.\nLegal reformers like to agree with Trump on this one, though they’re hardly ever on his side.\nA staggering 97% of defendants plead guilty because their sentence would be tripled , on average, if they didn’t. Sounds more like North Korea or the Soviet Union than the United States of America.\nIf Cohen had continued to maintain his innocence, prosecutors were going to pile on the charges so that he faced 65 years behind bars — a life sentence — and the possibility that his wife would be charged. In exchange for a guilty plea, he was guaranteed no more than 63 months in prison and possibly none.\nSixty-three months vs. risking the rest of your life in prison. It’s not a gamble most people would take, even if they’ve done nothing illegal.\nLegal reformers want prosecutors to stop threatening defendants with draconian sentences if they dare plead innocent and go to trial.\nIn the United States, people are supposed to be considered innocent until the government proves its case beyond a reasonable doubt in a courtroom. But with plea deals, there is no standard of evidence, no proof.\nSo much for the U.S. Constitution’s guarantee of a fair trial. It’s disappearing.\nJohn Gleeson, a former federal judge in New York’s Eastern District, calls it the problem of the “ vanishing trial .”\n“Federal criminal defendants are being coerced to plead guilty,” cautions the nonpartisan National Association of Criminal Defense Lawyers . “There is no more heart wrenching task than explaining” to an innocent person that “they must seriously consider pleading guilty or risk the utter devastation of the remainder of their life.”\nYet flipping has plenty of supporters. Peter Zeidenberg, a former federal prosecutor, claims it’s “ fundamental to the process .” Without the threat, prosecutors wouldn’t get defendants to cooperate, meaning provide information about other possible targets of investigation.\nBut how credible is that information if it’s extorted from a terrified defendant to save his own neck? Prosecutors have total discretion to send a letter to the sentencing judge urging no jail time at all for defendants who tell prosecutors what they want to hear. Defense lawyers caution that this practice “ entices defendants to embellish the facts or even lie. ”\nCohen’s plea deal made no mention of cooperating with the New York prosecutors who charged him or with special Counsel Robert Mueller’s investigation. But that deal’s not written in stone. Cohen’s spokesperson, Lanny Davis, is already telling talk show hosts that Cohen “ is more than happy to tell the special counsel all that he knows ” about “ a conspiracy to collude and corrupt the American democracy system in the 2016 election .” If Cohen says enough to implicate the Trump campaign, he could get off with no jail time. How believable is a witness under that kind of pressure?\nFormer organized crime prosecutor Kenneth McCallion dismisses that concern. Just because Cohen “ is trying to get a benefit from his cooperation does not mean that ” what he says is “ fabricated .” McCallion says squeezing defendants to cooperate is essential because the legal system “ places exceedingly high requirements ” on prosecutors to prove guilt beyond a reasonable doubt.\nBut only in a trial, and those are becoming a rarity. Fewer than 3% of the accused ever get one. As Gleeson warns, prosecutors almost always send defendants to prison without having to prove any charges against them using admissible evidence.\nFor nearly all Americans, whether they’re arrested for drug crimes, tax evasion, insider trading, burglary or any other crime, the standard of proof isn’t “exceedingly high.” It’s nonexistent. Blame “flipping.” It needs to be fixed.","url":"https://spectator.org/flipping-good-for-prosecutors-not-the-public/"}
