{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:43:44","date_modify":"2018-10-30 21:43:44","date_publish":"2015-12-01 09:35:28","description":"As reported by EATER Atlanta, the\nFLIP Burger Boutique\nlocation in Ponce...","filename":"data/vaneerConsumption/FlipBurgerinPonceyHighlandisclosed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/01/Images/WPIMAGE_cmgajcfoodandmore_5599.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_flip-burger-poncey-highland-closed__1540935824.html","title":"Flip Burger in Poncey-Highland is closed","title_page":"Flip Burger in Poncey-Highland is closed","title_rss":"NULL","source_domain":"ajc.com","text":"As reported by EATER Atlanta, the FLIP Burger Boutique location in Poncey-Highland is closed, and it looks like a new concept from a new owner will be taking its place.\nHere's a statement on the closing provided by FLIP PR:\nAfter careful consideration we have made the decision to close the FLIP burger Poncey-Highland location due to its close proximity to our successful Howell Mill and Buckhead locations. We thank our loyal fans from the neighborhood and appreciate the support they have shown us over the years. We also thank our wonderful team in the restaurant who gave excellent service to all of our guests. We are working on transferring as many of those employees to our Howell Mill and Buckhead locations and encourage our loyal fans to visit us at those locations. FLIP looks forward to introducing guests to new menu items, exciting events and more in 2016.\nThe Poncey-Highland location has been subject to several changes over the years. It started out in 2011 as chef Richard Blais’ fancy hot dog restaurant, HD1. It was converted to become the fourth FLIP Burger Boutique in 2013. Of course, Blais also is the founding chef of the FLIP concept. A rooftop patio, originally planned for HD1, was part of the redo of FLIP.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook and following Atlanta Dining on Twitter.\nRead the AJC Fall Dining Guide, Atlanta Around the Clock, here .","url":"https://www.ajc.com/blog/atlanta-restaurants/flip-burger-poncey-highland-closed/0uZ3fD41wtyUOLpGagYbtL/"}
