{"authors":[],"date_download":"2018-10-30 21:43:49","date_modify":"2018-10-30 21:43:49","date_publish":"2017-03-10 20:00:00","description":"A popular burger restaurant failed a recent health inspection, with officials noting food, dirt, and grease buildup behind equipment throughout the venue.","filename":"data/vaneerConsumption/FlipBurgerlocationscores37onhealthcheckdirtbuildupreported.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/10/Images/01-hero.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_flip-burger-loca_05b01a50434696f31c741533f1850f96__1540935829.html","title":"Flip Burger location scores 37 on health check; dirt buildup reported","title_page":"Flip Burger location scores 37 on health check; dirt buildup reported ","title_rss":"NULL","source_domain":"ajc.com","text":"This article has been updated to include comment from Flip Burger.\nA notable burger restaurant failed a recent health inspection, with officials noting food, dirt and grease buildup behind equipment throughout the venue.\nFlip Burger’s West Midtown location scored a 37 following the Thursday afternoon evaluation; 69 and below is considered failing. The prior score, from December, was a 99.\nThe burger chain also has locations in Buckhead, Birmingham and Nashville. The Poncey-Highland location closed in December 2015.\nAccording to the report, menus did not provide a consumer advisory regarding temperatures for burgers and eggs.\nOfficials also reported food debris on clean knives and an employee rinsing a knife in the sink without sanitizing it.\nCo-founder and operations manager Barry Mills said all procedures and standards have been reinforced “to maintain excellence at all levels of food quality, service and safety measures.”\n“The inspection observations found yesterday were immediately rectified and upon a re-inspection today, we received a high positive passing score of 85, which reflects a high quality in operating standards,” Mills said in an email. “And we will be soliciting another re-inspection next week to further ensure all standards are continuing to be observed.”\nThe inspection Mills mentioned is not yet listed on the Fulton County health department website.\nThe website lists Richard Blais, arguably the most successful “Top Chef” alum out of Atlanta, as the restaurant’s creative director. However, Mills said Blais is no longer affiliated with the company.","url":"https://www.ajc.com/news/local/flip-burger-location-scores-health-check-dirt-buildup-reported/FIYYhOl81FbCJZGoRXqmfO/"}
