{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 23:12:34","date_modify":"2018-10-22 23:12:34","date_publish":"2017-04-26 07:00:09","description":"Isabel Lucas, 32, was sent cringing when her relationship status became the topic of conversation during an interview with Kyle Sandilands this week.","filename":"data/vaneerConsumption/FlirtyKyleSandilandssendsIsabelLucassquirming.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CCA8700000578-0-image-a-15_1493187388335.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446360_Flirty-Kyle-Sandilands-sends-Isabel-Lucas-squirming_1540249954.html","title":"Flirty Kyle Sandilands sends Isabel Lucas squirming","title_page":"Flirty Kyle Sandilands sends Isabel Lucas squirming | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the successful Australian actress who has mastered the art of dodging the spotlight when it comes to her private life.\nSo it's no surprise Isabel Lucas, 32, was sent cringing when her relationship status became the topic of conversation during an interview with Kyle Sandilands this week.\nDuring an appearance on KIIS FM's Kyle And Jackie O Show this Wednesday, Kyle flirtatiously asked the timid blonde: 'Has anyone asked you to marry them before Isabel? Are you married yet?'\nScroll down for video.\n'Um, I'm not married yet': Isabel Lucas, 32, was sent cringing when her relationship status became the topic of conversation during an interview with Kyle Sandilands this Wednesday\nAfter a painfully awkward silence, she shook her head and whispered: 'Um, I'm not married yet.'\nKyle shot back: 'How does someone like you, sit there on the market there. Maybe because you're hidden away there in Byron Bay. Only come out for the movies and back to your sanctuary. Is that what happens?'\nRefusing to budge, Isabel slyly responded: 'Yeah, you're cheeky.'\nGetting personal: During the interview, Kyle flirtatiously asked the timid blonde: 'Has anyone asked you to marry them before Isabel? Are you married yet?'\n'I just don't understand, you're a lovely girl!' Kyle insisted, apparently trying to diffuse the awkward tension.\n'Thanks, you're a lovely guy too,' a red-faced Isabel murmured.\nIsabelle famously dated fellow Home And Away star Chris Hemsworth in 2005 before splitting in 2008.\nCheeky! Refusing to budge, Isabel slyly responded: 'Yeah, you're cheeky'\nThe actress moved to the US in 2008 but returned to Australia in 2011 to move in with her new boyfriend, folk singer Angus Stone.\nThe pair parted ways a year later, with Isabel telling Daily Life that she had suffered immense heartbreak over the split.\n'I guess we can't ever make someone feel ready for all that comes with big love and long-term commitment.\n'I went through my own process of accepting that and turning a broken heart into something beautiful.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446360/Flirty-Kyle-Sandilands-sends-Isabel-Lucas-squirming.html"}
