{"authors":[],"date_download":"2018-10-30 20:19:21","date_modify":"2018-10-30 20:19:21","date_publish":"2015-12-24 10:48:30","description":"Flood warnings and watches were in effect for large areas of metro Atlanta and north Georgia after a Christmas Eve weather system that spawned deadly tornadoes in Mississippi, Tennessee and Arkansas moved through the area Thursday.","filename":"data/vaneerConsumption/FloodingmorewidespreadacrossmetroAtlantanorthGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/24/Videos/4673809736001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_flooding-more-wides_503cde8587784856ce1235171a6575f4__1540930761.html","title":"Flooding more widespread across metro Atlanta, north Georgia","title_page":"Flooding more widespread across metro Atlanta, north Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Flood warnings and watches were in effect for large areas of metro Atlanta and north Georgia after a Christmas Eve weather system that spawned deadly tornadoes in Mississippi, Tennessee and Arkansas moved through the area Thursday.\nChannel 2 Action News reported that the rain is expected to continue overnight and into Friday.\nGov. Nathan Deal declared a state of emergency in three north Georgia counties amid the torrential storms. The order extends to Fannin, Gilmer and Pickens counties through Jan. 10.\nMeanwhile, there were sewer spills into creeks across in Decatur, including:\n1615 Melanie Ct.\n506 S. McDonough St.\n312 Second Ave.\n3109 Albatross Lane\n1942 E. Starmount Way\n1430 Country Squire Dr.\nMARTA experienced delays on all rail lines due to the weather. Rail service between the Five Points and Oakland City stations was terminated and a bus bridge was established, a spokesman said.\nDowned trees were reported in parts of metro Atlanta, and Georgia Power reported about 450 customers without power statewide just after 8 p.m, down from nearly 10,000 customers around 9 a.m.\nThe rough weather was also caused departure delays of two to three hours at Hartsfield-Jackson International Airport earlier in the day. Delays were less than an hour early Thursday night, Channel 2 reported.\nThe weather system spawned two dozen tornadoes in six states from Indiana and Illinois to the Deep South, killing three people in Mississippi, two in Tennessee and one in Arkansas.\nThere had been no tornadoes reported in Georgia, but the wet and windy weather was causing other problems, from interstate crashes, which left a HERO worker injured, to downed trees in Buckhead and elsewhere in metro Atlanta.\nFlooding\nIn DeKalb County, Interstate 20 west near Stonecrest Mall was backed up for miles as vehicles creeped along the interstate through standing water.\nIn Cobb County, Cumberland Parkway was closed beginning at 4 p.m. due to flooding. The county advised motorists to avoid the area.\nIn Lilburn in Gwinnett County, police said Hillcrest Road was closed due to flooding until further notice.\nIn Alpharetta, sections of the city’s Big Creek Greenway were flooded Thursday, assistant city administrator James Drinkard said. The greenway was built in a floodplain, and usually closes when it rains.\nThere was flash flooding throughout Fulton County, including at the 285 West on-ramp to 85 South. The floods were moving as rain ebbed.\nFulton County police have closed Cascade Road between I-285 and Utoy Springs Road. Enon Road is also closed at Vandiver Road. Motorists should avoid these areas. A flooded bridge at Cochran Mill Road and Cascade Palmetto Highway was closed, as was an area near the intersection of Cochran Road and Rateree Road.\nThere was also flooding at Camp Creek Parkway and Merk Road, though that road remained opened, at Demooney Road where a creek overflowed and in the Anatole subdivision. Police said Cascade Road near I-285 at Utoy may be impassable.\nThe Pickens County sheriff office reported were several road closings because of flooding or washouts:\nHobson Road where the pavement ends\nEvans Road (dirt section at creek)\nDean Mill Road\nTwin Mountain Lake Circle (spillway)\nA flash flood warning was posted for southwestern Fulton County, southeastern Cobb Count, eastern Douglas County, northwestern Clayton County and all of DeKalb County, as another area of heavy rain began to enter the southern metro area.\nAll of north Georgia was under a flood watch through Friday night, with forecasters predicting an additional 1 to 3 inches of rain. A flash flood warning was issued for Gilmer and Fannin counties, where more than 4 inches of rain was recorded early Thursday.\nThe Gilmer County Sheriff’s Office reported on Facebook that numerous roads in the county were closed, and an apartment complex in East Ellijay was evacuated due to flooding.\n“We suggest that you use more than regular caution if you have to be driving on the roads in Gilmer County this morning,” the Facebook posting read. “Excessive standing water is being reported on many roads.”\nCounty officials warned anyone living near one of Gilmer’s three rivers to “evacuate immediately and move to higher ground,” and said that a shelter was being opened at Gilmer Middle School.\nIn neighboring Fannin County, sheriff’s officials posted on Facebook that the county was “currently experiencing heavy flooding” and that several roads were impassable.\nIn the northeast corner of the state, Rabun County was also under a flash flood warning.\nSouthwest of Atlanta, a flash flood warning was issued for Troup County, where 3 to 5 inches had fallen since 7 a.m. Thursday.\nAccidents and trees down\nThe heavy rain was causing other problems in metro Atlanta.\nIn Cherokee County, an 87-year-old woman was rescued Thursday morning after her car left Holly Springs Parkway and plunged into the flooded Toonigh Creek, fire department spokesman Tim Cavender said.\nEarly Thursday, authorities worked to clear several wrecks on I-75 near the Brookwood Interchange. WSB 24-hour Traffic Center reported that a HERO operator was taken to the hospital after being hit by a vehicle while working an earlier crash.\nStrong winds combined with the saturated ground to bring trees down in several locations, including on Tuxedo Drive and West Paces Ferry Road in Buckhead and on Richardson Road in northwest Atlanta.\nNo injuries were reported when a large tree came crashing down on a home on Peyton Woods Court in southwest Atlanta.\nAtlanta fire Assistant Chief Chris Wessels said firefighters helped the resident cover the damaged roof with a tarp.\n“We started getting a lot of calls for trees down a little bit after 8 this morning, and we anticipate that to continue throughout the day and into tomorrow,” Wessels said.\n“If it’s at all possible for us to get our firefighters on the roofs, we try to do what we can to minimize the damage, because we still have a lot of rain coming in,” Wessels told The Atlanta Journal-Constitution. “With the heavy rain, the water damage would be tremendous if we weren’t able to get the tarps up.”\nIn DeKalb County, authorities reported six trees down on houses, one down on a car and one house struck by lightning.\nTornado warnings expire\nA tornado warning was issued just after 5 a.m. for parts of Paulding, Polk and Haralson counties just northwest of Atlanta. That warning was allowed to expire at 5:30 a.m., but was replaced by a severe thunderstorm warning through 6:15 a.m. for parts of Cobb, Cherokee and Bartow counties.\nThat same cluster of storms prompted a “significant weather advisory” for north Fulton, Cherokee and Forsyth counties until 6:45 a.m.\nElsewhere, a tornado watch, indicating that conditions are ripe for the formation of tornadoes, was in effect through 10 a.m. Thursday for 28 counties south of Atlanta in middle Georgia.\nWeather outlook\nThe chance of rain is 60 percent on Christmas Day, diminishing to 20 to 40 percent over the weekend.\nRecord high temperatures are forecast, Channel 2 meteorologist Brad Nitz said, reaching 75 Friday and 76 Saturday.\nThe previous record is 72 on Christmas Day.\nCheck the full forecast and track changes.\nStaff photographer John Spink and staff writers Arielle Kass and David Wickert contributed to this article.","url":"https://www.ajc.com/weather/flooding-more-widespread-across-metro-atlanta-north-georgia/xbJWcUtkenmvHxPC9R5O8J/"}
