{"authors":[],"date_download":"2018-10-23 05:55:22","date_modify":"2018-10-23 05:55:22","date_publish":"2016-01-11 18:42:27","description":"Ringling Brothers, America's best-known circus, announced Monday it will relocate all of its elephants to a conservation center in Florida by May, advancing ...","filename":"data/vaneerConsumption/FloridaretirementcomesearlyforRinglingcircuselephants.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-701cw-3WAQP5SaQH704788ebcf7e217021-50_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394316_Americas-Ringling-circus-moves-elephants-retirement-date_1540274122.html","title":"Florida retirement comes early for Ringling circus elephants","title_page":"Florida retirement comes early for Ringling circus elephants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Florida retirement comes early for Ringling circus elephants\nRingling Brothers, America's best-known circus, announced Monday it will relocate all of its elephants to a conservation center in Florida by May, advancing the retirement date for the giant pachyderms by more than a year.\n\"Feld Entertainment announced today that all of the Asian elephants from their traveling circus units will be moved to their permanent home at the Ringling Brothers Center for Elephant Conservation in Florida in May 2016,\" the parent company for the circus said in a statement.\n\"There they will join the rest of the Ringling Brothers' herd of Asian elephants, for a total of 42 at the conservation center.\"\nElephants walk in the arena during a Ringling Bros. and Barnum & Bailey Circus performance in Washington ©Andrew Caballero-Reynolds (AFP/File)\nThe 145-year old \"Greatest Show on Earth\" -- bowing to criticism from animal rights groups -- announced in March that it would phase out use of their emblematic elephants, long a centerpiece of their annual traveling show.\nFeld Entertainment originally had said the elephants would be gradually withdrawn from the big top and completely gone only by 2018, but it now has accelerated that retirement date.\nHowever, some animal rights advocates, including People for the Ethical Treatment of Animals (PETA) said sending the animals to the Ringling's conservation center is a far from satisfactory outcome.\n\"It's not all sunshine and roses for the 'retired' elephants,\" PETA said in a statement.\n\"At Ringling's grandiosely named Center for Elephant Conservation elephants will no doubt still be chained on a daily basis, be forced to breed, be deprived of opportunities to interact and socialize normally, and continue to live in fear of being hit with bullhooks,\" the statement said.\nIt urged Ringling to send the elephants to a bona fide animal sanctuary with conditions similar to those they would find in their natural habitat.\n\"Pulling elephants from the road is a step in the right direction, but... the elephants should be taken to legitimate sanctuaries, and all the animal acts should come to an end.\"\nRingling Brothers in 2011 had to pay a $270,000 fine after receiving citations over how it treated its animals, among other infractions over the years.\nAn increasing number of US towns and cities have adopted anti-elephant ordinances forbidding circus acts with elephants to enter the municipal limits.","url":"https://www.dailymail.co.uk/wires/afp/article-3394316/Americas-Ringling-circus-moves-elephants-retirement-date.html"}
