{"authors":[],"date_download":"2018-10-22 22:55:28","date_modify":"2018-10-22 22:55:28","date_publish":"2014-05-13 02:24:12","description":"A Florida couple vowed Monday to wage a tenacious legal fight days after being fined more than $300 each for violating a law by feeding the homeless.","filename":"data/vaneerConsumption/FloridaCoupleFinedThreatenedwithJailforFeedingHomeless.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/437676/140512-debbie-chico-jimenenz-1919_e6fcd8226d287e2d6d9edd78c406e09e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_florida-couple-fined-threatened-jail-feeding-homeless-n103786_1540248928.html","title":"Florida Couple Fined, Threatened with Jail for Feeding Homeless","title_page":"Florida Couple Fined, Threatened with Jail for Feeding Homeless","title_rss":"NULL","source_domain":"nbcnews.com","text":"In all, police officers ticketed six people, including four volunteers who helped the Jimenezes on Wednesday – one of them, a man in a wheelchair who recently escaped homelessness and participated “to pay it forward,” Debbie Jimenez said. The fines levied by authorities total $2,238.\nBut Daytona Beach Police Chief Mike Chitwood said the Jimenezes had been warned one week earlier to stop their weekly feeding sessions after local residents complained that some homeless people gathering in the park were defecating and urinating on the grounds, and that some were showing up drunk at dawn.\n\"We as a city have spent millions of dollars to turn that park into a place for families, kids and dog lovers,\" Chitwood said. \"We have an ordinance that says when people want to perform acts of kindness or charity that they must coordinate with our local social service agencies.\n\"They were told (the previous Wednesday) that if they come back there, they would be cited and they could risk going to jail,\" Chitwood said. \"There is a segment of the homeless population that is homeless by choice. I don't want to impugn them all. But some are homeless because they are sex offenders, substance abusers and bank robbers. That's why we ask (Good Samaritans) to coordinate with our social service agencies, because they know who needs to be served.\"\n\"We as a city have spent millions of dollars to turn that park into a place for families, kids and dog lovers.\"\nThe big-buck investments made by Daytona Beach to rebuild Manatee Island Park include boat docks, kayak-launching sites and spots to view families of manatees - plus playgrounds, picnic areas and a dog area, Chitwood said.\nThe Jimenezes contend they never were warned to stay away.\n“We've been down there a year, and the police have been around and not one of them has ever said one word,” Chico Jimenez said. “This time, the police said we are creating more homeless people by feeding them in the park, that we are enabling them by giving them one meal in a week. Does that make sense to you? It’s so crazy.”\nDaytona Beach is not alone among cities that formally and legally restrict non-governmental individuals who seek to share food with homeless people in public or private spaces.\nAccording to a report co-released by the National Coalition for the Homeless and the National Law Center on Homelessness & Poverty, during the past seven years Gainesville, Fla., began “enforcing a rule limiting the number of meals that soup kitchens may serve to 130 people in one day;” Phoenix, Ariz., “used zoning laws to stop a local church from serving breakfast to community members, including many homeless people, outside a local church;” and Myrtle Beach, S.C., “adopted an ordinance that restricts food sharing with homeless people in public parks.”\nThe Jimenezes videotaped their final feeding event, and their interactions with police officers. During one portion of the tape, Chico Jimenez pans the long line of people waiting for a plate of chicken patties topped with cheese, lettuce, tomatoes and onion, plus green beans with sausage, macaroni and cheese, pasta salad, chips, and sodas. He captures several of the volunteer food servers. And he shows police officers using a cruiser hood to write down the volunteers’ identifications.\nOne notable moment captures a Daytona Beach police officer telling Jimenez, “You’ve got to have permits,” as a woman plating food immediately widens her eyes.\n“Each week, we celebrate somebody’s birthday. We have over 100 people every week - it’s always somebody’s birthday,” Chico Jimenez said. “On the tape, you can hear us singing ‘Happy Birthday’ as a group.”\nOn that videotape, the same police officer accuses the Jimenezes of staging “a permanent birthday party,” adding: “You can’t just call it a birthday party.\"","url":"https://www.nbcnews.com/news/us-news/florida-couple-fined-threatened-jail-feeding-homeless-n103786"}
