{"authors":[],"date_download":"2018-10-22 20:39:47","date_modify":"2018-10-22 20:39:47","date_publish":"2014-05-02 19:35:06","description":"Florida will allow undocumented students who have gone to high school in the state for at least three years to pay in-state tuition.","filename":"data/vaneerConsumption/FloridaApprovesImmigrantInStateTuitionBill.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/417146/140502-fl-legislature-in-state-tuition-sl-1605_3433f0869b2b78e8fb6068ba0c085046.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_florida-approves-immigrant-in-state-tuition-bill-n95946_1540240787.html","title":"Florida Approves Immigrant In-State Tuition Bill","title_page":"Florida Approves Immigrant In-State Tuition Bill","title_rss":"NULL","source_domain":"nbcnews.com","text":"Florida students who are not in the country legally but who have attended high school at least 3 years in the state will now be able to pay the substantially lower in-state college tuition rate.\nOn Friday, the House voted in favor of of HB 851, the Postsecondary Student Tuition bill, after it was approved by the state Senate on Thursday. Governor Rick Scott, a Republican, said he would sign the bill.\nFor years, immigration advocates as well as many of the state's educators and a group of legislators had argued it would benefit the state's economy for undocumented immigrant students to be able to afford to go to college and get a degree. Apart from the economic arguments, many said it was just the right thing to do.\nAfter passage of the bill, Florida Republican congressman Mario Diaz-Balart issued a statement:\n\"One of the things that defines the United States is that we are a meritocracy – we judge people not by the actions of their relatives, but by their individual merits,\" said Diaz-Balart. \"This bill allows young men and women who have done everything society has asked of them to seek a degree of higher education and reach their God-given potential.\"\nThough the bill passed with bipartisan support, it still had its opponents.\nRepublican State Senator Kelli Stargel said undocumented students who have been living in the state are \"not Floridians. They're not even U.S. citizens.\"\nBut Florida Democratic congressman Joe Garcia, who supports passage of the state bill, said “thousands of undocumented students across the state consider Florida home, and after more than a decade of stalled action in bringing forth an in-state tuition bill, I am pleased to see our Florida legislature make this a priority.\"","url":"https://www.nbcnews.com/news/latino/florida-approves-immigrant-in-state-tuition-bill-n95946"}
