{"authors":[],"date_download":"2018-10-22 22:20:07","date_modify":"2018-10-22 22:20:07","date_publish":"2014-05-09 20:01:21","description":"The Florida man shot his wife and two kids \"in their respective bedrooms,\" before killing himself, police said.","filename":"data/vaneerConsumption/FloridaFatherShotWifeandKidsBeforeSettingJamesBlakesHomeAblaze.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/432851/140509-tampa-family-fire-1523_15fe1888d67c49a1a9ad644fee49ff1c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_florida-father-shot-wife-kids-setting-james-blakes-home-ablaze-n101776_1540246807.html","title":"Florida Father Shot Wife and Kids Before Setting James Blake's Home Ablaze","title_page":"Florida Father Shot Wife and Kids Before Setting James Blake's Home Ablaze","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Florida man renting the mansion of a professional tennis player shot and killed his wife and two children, then doused the house in gasoline and planted fireworks before setting a fire and killed himself, authorities said Friday.\nThe bodies found in the charred remains of the home Wednesday were identified as those of Darrin Campbell, his wife, Kimberly, and their children, 15-year-old Megan and 19-year-old Colin, said Hillsborough County Sheriff's Col. Donna Lusczynski.\nLusczynski said that Darrin Campbell purchased fireworks, gas cans and gasoline days before the incident.\nCampbell \"systematically\" shot each member of his family in the head \"in their respective bedrooms\" with a Sig-40 handgun that he purchased in 2013, Lusczynski said.\nThe family was renting the five bedroom, five bathroom home from professional tennis player James Blake. He was not in the home at the time.\nCampbell had been an executive for several high-profile businesses, but most was recently working at a records management firm and volunteering at his children's private school, according to The Associated Press.\nCampbell had recently taken a few days off from work, according to a statement from the Hillsborough County Sheriff's Office. The father did not have a criminal record, and the murder-suicide is still under investigation, the statement said.\nInvestigators didn't find a note from Campbell in the house, but detectives are speaking with people who knew the family and conducting a financial audit to determine whether money difficulties played a part, Lusczynski said.\n\"However the reasoning behind this tragedy may never be known,\" said the statement from the Hillsborough County Sheriff's Office.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/us-news/florida-father-shot-wife-kids-setting-james-blakes-home-ablaze-n101776"}
