{"authors":[],"date_download":"2018-10-22 22:03:27","date_modify":"2018-10-22 22:03:27","date_publish":"2014-06-07 21:32:42","description":"The homeowner is upset that city code enforcement officers inspected his house after an anonymous complaint about a Christmas tree on his porch.","filename":"data/vaneerConsumption/FloridaManPaintsAmericanFlagonHouseinProtest.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/494681/140607-us-flag-house-1808_650ac7bbc1ffc20a91b40fd64e3a9229.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_florida-man-paints-american-flag-house-protest-n125446_1540245807.html","title":"Florida Man Paints American Flag on House in Protest","title_page":"Florida Man Paints American Flag on House in Protest","title_rss":"NULL","source_domain":"nbcnews.com","text":"Greer is upset that city code enforcement officers inspected his home in February after an anonymous complaint that a 15-foot-tall Christmas tree on his front porch had fallen over, he said.\nA code enforcement officer came to inspect, and Greer said, \"My wife gladly took it down.\"\nThe officer went on to cite Greer for a list of violations including lack of screens on some windows, peeling house paint, yard debris, and some rotted and loose wood, according to a copy of the complaint provided by Greer.\nCity officials could not be reached for comment. Bradenton Mayor Wayne Poston did not immediately respond to requests for comment.\nA code enforcement hearing is set for June 17 at which Greer said he could be fined $250 a day.\nGreer, who runs a landscaping business and acknowledges the 110-year-old home is not in perfect repair, said he made some corrections but disputes other parts of the citation.\n\"There are no safety issues at my house. None. Zero,\" Greer said.\nThe Bradenton Herald described the house as one of the few old residences along the Manatee River built before a boom in multi-million homes.\nGreer said his wife Catherine, who holds an art degree, and their seven children repainted the house in red, white and blue, complete with stars.\nHe said the family has received an outpouring of support, particularly among veterans. He said they intend to further decorate the house with a painted plywood Liberty Bell which they will place where the Christmas tree had stood.\n\"It's in compliance,\" Greer said.\n— Reuters","url":"https://www.nbcnews.com/news/us-news/florida-man-paints-american-flag-house-protest-n125446"}
