{"authors":["John Hayward"],"date_download":"2018-10-30 22:17:17","date_modify":"2018-10-30 22:17:17","date_publish":"2016-10-06 18:35:40","description":"The Emerson poll has the race at Trump 45 percent, Clinton 44 percent in Florida, while Trump's erstwhile GOP primary competitor Marco Rubio leads Democratic challenger Patrick Murphy by 47 to 39 in the Senate race. | Politics","filename":"data/vaneerConsumption/FloridaPollsShowStatisticalTieInPresidentialRace.json","image_url":"https://media.breitbart.com/media/2016/09/Trump-Melbourne-Florida-Jewel-SamaoGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_06__1540937837.html","title":"Florida Polls Show Statistical Tie In Presidential Race","title_page":"Florida Polls Show Statistical Tie In Presidential Race | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The two most recent Florida polls describe a statistical tie in the presidential race, with Donald Trump ahead by 1 point according to Emerson College, while Hillary Clinton leads by 3 in the University of North Florida survey.\nThe Emerson College poll ran from October 2 to October 4, while UNF had a longer period of September 27 through October 4. The first presidential debate was held on September 26. The two polls had roughly comparable sample sizes (600 respondents for Emerson, 696 for UNF) and similar margins of error (plus or minus 3.6 percent and 3.8 percent, respectively.)\nEmerson has the race at Trump 45 percent, Clinton 44 percent in Florida, while Trump’s erstwhile GOP primary competitor Marco Rubio leads Democratic challenger Patrick Murphy by 47 to 39 in the Senate race.\nCuriously, Emerson finds Clinton slightly ahead among Florida independents (40 to 39), a group where Trump leads in many other surveys, but Trump still has a 1-point lead overall. Clinton leads 59 percent to 36 percent among Hispanics, and 77 percent to 18 percent among black voters.\nThird-party candidates Gary Johnson and Jill Stein were included in the Emerson survey, but were not major factors, drawing 4 percent and 2.6 percent respectively. Just 4 percent of respondents said they were undecided.\nAs for the University of North Florida poll, it found Clinton leading in Florida by 41 to Trump’s 38 in a four-way race. Johnson and Stein were bigger players in this poll, pulling 6 and 3.\nIn a two-way race, UNF finds Clinton’s lead expanding beyond the margin of error to 7 points: Clinton 47, Trump 40.\n“The size of Clinton’s lead drops when the additional candidates (Johnson and Stein) are listed in the question. This suggests that the Clinton campaign should perhaps perceive Johnson as a threat, who is taking more votes from her than Trump,” said poll director Dr. Michael Binder, who thought his survey showed Clinton getting a significant bounce after the first presidential debate.\n“While neither candidate has high favorability for the majority of likely voters in Florida, Clinton’s net negative 9 percent is better than Trump’s net negative 23 percent,” Binder added. However, a slightly higher percentage of Trump’s voters said they were primarily voting against Clinton (46 percent) than Clinton voters said they were voting against Trump (43 percent.)\nBinder noted the UNF poll also found that “for all of the talk about deportation and ‘building walls’, majorities of Democrats, NPAs and even Republicans in Florida are supportive of pathways to citizenship for undocumented immigrants.”\nMore specifically, the most popular option for illegal immigrants was “Allow them to stay in the U.S. and eventually qualify for U.S. citizenship after paying back taxes and fines” with 49, followed by “Allow them to stay in the U.S. and eventually qualify for U.S. citizenship without penalties” at 21.\nImmigration was the fourth-most pressing concern for Florida voters in the UNF poll at 7 percent, behind jobs and the economy (27), education (10), and health care (8).","url":"https://www.breitbart.com/politics/2016/10/06/florida-polls-show-statistical-tie-in-presidential-race/"}
