{"authors":[],"date_download":"2018-10-22 22:52:07","date_modify":"2018-10-22 22:52:07","date_publish":"2014-05-12 21:56:48","description":"Authorities are searching for a man who jumped over a Pompano Beach sub shop counter to grab cash after he became upset at the price of cookies.","filename":"data/vaneerConsumption/FloridaManUpsetOverCookiePricesRobsSubwaySheriff.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_florida-man-upset-over-cookie-prices-robs-subway-sheriff-n103626_1540248727.html","title":"Florida Man Upset Over Cookie Prices Robs Subway: Sheriff","title_page":"Florida Man Upset Over Cookie Prices Robs Subway: Sheriff","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCMiami.com\nAuthorities are searching for a man who jumped over a Pompano Beach sub shop counter to grab cash after he became upset at the price of cookies.\nThe incident, which was captured on the store's surveillance system, happened May 1 at the Subway at 898 N. Federal Highway, the Broward Sheriff's Office said Monday.\nOfficials said the man walked into the store and was acting suspiciously before he began complaining about the price of the cookies. When the man handed the cashier a dollar and the cashier opened the register, the suspect jumped over the counter and grabbed the money.\nThe two men fought until the robber broke free and fled on foot with a fistful of $5 bills, BSO officials said.\nThe suspect is described as a white male, about 5-foot-6, with a thin build and tattoos on his arms and neck. Anyone with information is asked to call Broward Crime Stoppers at 954-493-TIPS.","url":"https://www.nbcnews.com/news/us-news/florida-man-upset-over-cookie-prices-robs-subway-sheriff-n103626"}
