{"authors":["James Wilkinson For Dailymail.Com"],"date_download":"2018-10-22 23:13:16","date_modify":"2018-10-22 23:13:16","date_publish":"2017-03-16 06:04:58","description":"Florida man Carlos Mendoza, 49, left a woman in hospital after he illegally gave her butt injections and other procedures over the course of several months, Miami-Dade police said.","filename":"data/vaneerConsumption/Floridamanchargedwithprovidingbuttinjections.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E52065400000578-0-image-a-58_1489644211459.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318944_Man-charged-providing-illegal-butt-injections_1540249996.html","title":"Florida man charged with providing butt injections","title_page":"Florida man charged with providing butt injections | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Medicine man': A woman said Carlos Mendoza (pictured), 49, gave her illegal butt injections over ten months, leading to her hospitalization with complications\nA Florida man left a woman in hospital after he illegally gave her butt injections and other procedures, Miami-Dade police said.\nThe victim claims that she met Carlos Mendoza, 49, and his girlfriend at the couple's house, where they offered her a range of procedures that would take nine months and $4,300 to complete.\nBut that backfired for her - and them - when she suffered complications that left her languishing in hospital, WPLG Local 10 reported.\nPolice say that Mendoza administered three treatments between May 2016 and last month, as agreed with his 'client'.\nThey included collagen threads - which are supposed to cause a 'natural face lift' - for $400 and three buttock injections, which cost around $1,300 each, they said.\nPricing in the Tampa area ranges from $6,000-8,000 for a butt lift, according to a doctor on the website Real Self.\nAfter she was admitted to Kendall Regional Medical Center for treatment, the woman contacted police.\nMendoza, who doesn't have a medical license, allowed police to search his home on Tuesday, at which point they say they found a slew of medical supplies.\nThe haul included two vials of the local anasthetic lidocaine, dosage units of salt, which can be used to clean wounds; one vial of Botox; and one vial of bacteriostatic water used to dilute injections.\nMendoza was arrested and charged with practicing as an unlicensed healthcare professional causing serious injury; possession of prescription drugs with intent to sell; and possession of prescription drugs without a prescription.\nHe made bail on Wednesday.\nHis girlfriend has not been arrested or charged.","url":"https://www.dailymail.co.uk/news/article-4318944/Man-charged-providing-illegal-butt-injections.html"}
