{"authors":["Javier Manjarres"],"date_download":"2018-10-30 21:53:01","date_modify":"2018-10-30 21:53:01","date_publish":"2015-04-08 01:24:20","description":"Project Veritas released an undercover video, with university officials agreeing that it would be acceptable to send care packages to ISIS.","filename":"data/vaneerConsumption/FloridaCollegeSuspendsStudentforExposingTheirRadicalIslamicSupport.json","image_url":"https://media.breitbart.com/media/2015/04/barry-university-Flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_07__1540936381.html","title":"Florida College Suspends Student for Exposing Their Radical Islamic Support","title_page":"Florida College Suspends Student for Exposing Their Radical Islamic Support | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A couple of weeks back, Project Veritas released an undercover video they shot at Cornell University in upstate New York, where one the assistant deans of students agreed with the undercover operative that it would be acceptable to have an ISIS “freedom fighter” address the student body, as well as agreeing that sending care packages to the terrorist organization was also aboveboard at the school.\nWell, Project Veritas has done it again.\nThis time Veritas enlisted the help of Barry University honor student Laura Loomer, who managed to get a similar reaction from officials at that well-known Catholic school in south Florida.\nLoomer tried convincing school officials to allow her to form a “humanitarian club” that would promote education in the Islamic State, as well as help raise funds to send care packages to those Islamic fighters in need of supplies, such as flashlights.\nOne school official even suggested to the Loomer that the potential pro-ISIS campus club should change the name to “Sympathetic Students in the Support of the Middle East,” instead of referencing the Islamic terrorist group.\nWatch the video:\nNow, because Veritas’s video has caused the university such grief and embarrassment, Loomer has apparently been suspended and not allowed to attend classes or step foot on campus.\nThe alleged Barry University suspension notice to Loomer reads: “Your alleged actions were the cause root of disruption of the University community and the creation of a hostile environment for members of the University staff.”\nBarry University has taken issue and made a statement regarding the video. University President Sister Linda Bevilacqua said, “It is reprehensible to think that any organization would acquire video and edit it in such way as to denigrate the reputation of Barry University or its staff.”\nBut this is not the first time this Catholic university has made news regarding radical Islam. In 2014, the school held an interfaith memorial service to remember the victims of the 9/11 terror attacks, where Imam Nasir Ahmad, leader of the Liberty City Mosque Masjid Al Ansar in Miami-Dade County, repeatedly chanted the ominous phrase “Allahu Akbar” during his 10-15 minute address.\nLoomer, who was also in attendance at that memorial service, said she was offended with the Imam’s use of that insensitive chant, adding that she was “insulted that on a day like 9/11 they would allow for a man of Muslim faith to open the service and chant Allah Akbar, the words that suicide bombers and terrorists chant before blowing themselves up.”","url":"https://www.breitbart.com/politics/2015/04/07/florida-college-suspends-student-for-exposing-their-radical-islamic-support/"}
