{"authors":["Abc News","More Meg"],"date_download":"2018-10-30 00:50:14","date_modify":"2018-10-30 00:50:14","date_publish":"2018-10-29 15:31:28","description":"President Trump called Florida Governor candidate Andrew Gillum a 'thief' on Twitter this morning in voicing his support for GOP Rep. Ron DeSantis.","filename":"data/vaneerConsumption/FloridaGovcandidateGillumrespondstoTrumptweetcallinghimathief.json","image_url":"https://s.abcnews.com/images/Politics/andrew-gillum-ap-jef-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_florida-gov-candid_476914b5b72d8680b75efc236b2fc5fb_story_id=58834240_1540860614.html","title":"Florida Gov. candidate Gillum responds to Trump tweet calling him a 'thief'","title_page":"Florida Gov. candidate Gillum responds to Trump tweet calling him a 'thief' - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"President Donald Trump and Florida gubernatorial candidate Andrew Gillum reignited their feud on Monday in a series of tweets that come as Trump continues to voice his support for GOP Rep. Ron DeSantis in the contentious election.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nIn Florida there is a choice between a Harvard/Yale educated man named @RonDeSantisFL who has been a great Congressman and will be a great Governor - and a Dem who is a thief and who is Mayor of poorly run Tallahassee, said to be one of the most corrupt cities in the Country! — Donald J. Trump (@realDonaldTrump) October 29, 2018\nIf Gillum, a progressive wins, he will be the first African American governor in the state's history. This isn't the first time Trump has gone after Gillum online. The previous has previously said in a tweet that Gillum was a \"failed Socialist Mayor\" and \"allowed crime & many other problems to flourish in his city.\"\nLike he did in August, Gillum responded by telling Trump him to tag him directly and urging Floridians to vote early.\nOn Twitter there is a choice between having the courage to @ the person you are trash talking, or not. @realDonaldTrump is howling because he's weak. Florida, go vote today. https://t.co/I8uOokptJA — Andrew Gillum (@AndrewGillum) October 29, 2018\nAP | Courtesty of the Campaign\nTrump's dig seemed aimed at revelations that Gillum accepted tickets to \"Hamilton,\" an award-winning Broadway musical, from an undercover FBI agent probing public corruption in the state capital.\nDeSantis himself has been under fire for his comments regarding Gillum and the integrity of the race. Last week, he said that Gillum would appoint “Soros-backed activists” to state positions if elected governor. That took place days after an explosive device was found inside the mailbox at the home of Democratic financier George Soros.\nJeff Roberson/AP\nSoros is a prominent Democratic donor and one of the most fervent supporters of Gillum’s campaign, according to the nonpartisan campaign finance site OpenSecrets.\nDeSantis has also been under fire for his comments on FOX News telling voters the day after the primaries that they should not “monkey this up” by voting for Gillum.\nGillum has been a target of robocalls, reportedly ran by a white supremacy group, which impersonate Gillum. The voice on the newest robocall voice impersonates Gillum in an exaggerated accent and refers to the Democratic candidate as a \"negro\" and a \"monkey.\"\n\"Well, hello there. I is the negro Andrew Gillum and I'll be askin' you to make me governor of this here state of Flordia,\" the call says. DeSantis denounced the calls and said he didn't know who was making them, although the group from Idaho made similar robocalls mocking California Democratic Sen. Diane Feinstein.\nTrump at a rally last week denounced moral attacks coming from both sides of the aisle, saying “those engaged in the political arena must stop treating political opponents as being morally defective — have to do that. The language of moral condemnation and destructive routine, these are arguments and disagreements that have to stop.\"\nThe race is one among many in the nation where the chance for turning a governorship blue is possible. ABC partner FiveThirtyEight forecasts Gillum with nearly a five point lead over DeSantis on election day.","url":"https://abcnews.go.com/Politics/florida-gov-candidate-gillum-responds-trump-tweet-calling/story?id=58834240"}
