{"authors":["Thomas Simonetti"],"date_download":"2018-10-21 03:00:42","date_modify":"2018-10-21 03:00:42","date_publish":"2018-07-16 10:00:42","description":"Photographer Scott McIntyre's images of Ernest Hemingway enthusiasts in Key West.","filename":"data/vaneerConsumption/FloridaphotographershowsoldtimersinKeyWestwhodontjustwanttoreadHemingwaytheywanttoBEhim.json","image_url":"https://www.washingtonpost.com/resizer/orC-OMV9QKjNUCn9iTwGHHloZnU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EO3HFU7S4I3IPEMGWMTTGT4344.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_16__1540090842.html","title":"Florida photographer shows old timers in Key West who don’t just want to read Hemingway - they want to BE him","title_page":"Florida photographer shows old timers in Key West who don’t just want to read Hemingway — they want to BE him - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The “Running of the Bulls” during the Hemingway Days Festival in Key West, Fla., in 2017. (Scott McIntyre)\nSloppy Joe’s Bar in Key West has hosted the annual Hemingway Look-Alike contest for 37 years. (Scott McIntyre)\nIt was a visual feast for photographer Scott McIntyre. They say imitation is the highest form of flattery, and each year, scores of Ernest Hemingway look-alikes and enthusiasts descend upon Key West, Fla., to celebrate the late American author.\n“Over 100 silver-haired guys, palling around, getting loud and putting on their best Hemingway-inspired attire all weekend,” McIntyre said. “Certainly seemed visual to me.”\nThis year’s festival, taking place this week, will be the Hemingway Days’ 38th year. According to the festival website, the “literary prowess and (Hemingway’s) exuberant Key West lifestyle are saluted.” One of the main attractions is the Look-Alike contest at Sloppy Joe’s Bar, a frequent hangout of Hemingway’s.\nThe bearded, one-chest-button-opened photographer got more than one comment that he should participate in the festivities himself, though he would be an admittedly young Hemingway. “Most of them would comment that I should compete when my hair and beard get a little whiter,” he said.\nHemingway lived on the island of Key West for most of the 1930s before living in Cuba and later Idaho, where he committed suicide in 1961. He is regarded by many as one of the most influential American novelists. He won the Nobel Prize for literature in 1954.\nFor McIntyre, who lives in Miami, the characters he found in Key West fit in with a broader body of work exploring life in Florida.\n“I have become more and more fascinated with the idea of Florida and the characters who call it home,” McIntyre said. “It’s such a quirky place, filled with people that move here so they can be themselves in another chapter in life or become someone totally different. They’re all over the state and I’m always looking for them and hoping to get to photograph them, learn their stories.”\nContestants in the look-alike contest await their turn on stage. (Scott McIntyre)\nCampaign posters for various Hemingway Look-Alike contest entrants can be found throughout Key West during Hemingway Days. (Scott McIntyre)\nJeff Ownby, center, greets his grandchildren before the annual “Running of the Bulls” in their traditional attire. (Scott McIntyre)\nThe ultimate prize of the 2017 Hemingway Look-Alike contest, a bust of the author, went to Richard Filip, of Houston. (Scott McIntyre)\nAn arm-wrestling competition between the “Papas.” (Scott McIntyre)\nThe cheering section for look-alike competitor Fred Holder at Sloppy Joe’s. (Scott McIntyre)\nThe party continues after the Look-Alike contest. (Scott McIntyre)\nPatrick Blizniak, 62, of Buffalo, N.Y., takes a dip at the El Patio Motel in Key West during the festival. (Scott McIntyre)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nPortraits of the ‘fading American dream’\nCelebrating tradition in ‘No Man’s Land’\nThese surreal nightscapes are a photographer’s ode to Detroit","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/16/florida-photographer-shows-old-timers-in-key-west-who-dont-just-want-to-read-hemingway-they-want-to-be-him/"}
