{"authors":["Associated Press","Karen Ruiz For Dailymail.Com"],"date_download":"2018-10-23 05:38:41","date_modify":"2018-10-23 05:38:41","date_publish":"2017-03-10 15:24:31","description":"Judge Susan Barthle ruled on Friday that 74-year-old Curtis Reeves must stand trial in the death of 43-year-old Chad Oulson. Reeves is charged with second-degree murder.","filename":"data/vaneerConsumption/Floridajudgedeniesexcopstandyourgrounddefense.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/18/3E2478C800000578-0-image-a-23_1489171805871.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301628_Florida-judge-denies-stand-ground-defense-shooting_1540273121.html","title":"Florida judge denies ex-cop 'stand your ground' defense","title_page":"Florida judge denies ex-cop 'stand your ground' defense | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Florida judge has denied a 'stand your ground' defense for a retired Florida police officer who fatally shot a man in a movie theater during an argument over texting.\nJudge Susan Barthle ruled on Friday that 74-year-old Curtis Reeves must stand trial in the death of 43-year-old Chad Oulson. Reeves is charged with second-degree murder.\nReeves said he shot Oulson after he was either punched or hit in the face with a cellphone. The judge said a videotape of the events that afternoon didn't support his testimony.\nA Florida judge has denied a 'stand your ground' defense for ex- cop Curtis Reeves (pictured during a February hearing) 74, who fatally shot 43-year-old Chad Oulson in 2014\nOulson's widow, Nicole (pictured left with her husband and their daughter) - who was in the cinema with her husband at the time, said in 2014 that Chad was texting their daughter's babysitter at the time of the shooting\nThe incident happened at Cobb Grove 16 cinemas in Wesley Chapel in January 2014.\nThe two men got into an argument because Oulson was texting his daughter's day care during the previews of a matinee showing of Lone Survivor.\nThe ex-cop and his wife Vivian had been sitting in the back row of the theater when he leaned forward to tell Oulson to put his phone away.\nAfter complaining to the theater manager about the man's cellphone use during the film screening, Reeves said something to Oulson that led to a physical altercation.\nVideo evidence shows the victim threw a bag of popcorn at the older man's face and that is when Reeves pulled out a gun and shot Oulson in the chest.\nThe 43-year-old walked down to the end of the theater aisle wounded, until he collapsed to his death.\nThis photo released by the attorney's office shows Curtis Reeves handcuffed in the movie theater where he shot Chad Oulson\nA photo released as evidence shows the auditorium in the Grove Cobb 16 theater in Wesley Chapel after authorities say Curtis Reeves shot and killed Chad Oulson in a dispute over texting during previews January 13, 2014\nPhotos of the scene show the popcorn and the cellphone that were allegedly thrown during the argument\nDuring a court hearing last month, Vivian backed her husband up by testifying she was 'horrified' and 'scared' because of how Oulson was behaving.\nThe woman who has been married to Reeves for 49 years, claimed Oulson grew angry and violent after her husband informed him he had complained to management.\nShe told the court she was afraid the man was going to seriously hurt or punch her husband in the face before Reeves fired.\nThe defense also argued that former police officer was injured in his eye after Oulson allegedly threw a cellphone at his face.\nVivian claimed it appeared as though the 43-year-old father was climbing over his chair to get to her husband.\nJudge Barthle said his claims of being injured in the eye were ruled out by 'common sense' and by testimony from a medical examiner, the Tampa Bay Times reported.\nVivian Reeves (pictured) testified last month and told the court she was 'horrified' and 'scared' before her husband shot Oulson\nThe incident happened before the film could even begin at Cobb Grove 16 cinemas in Wesley Chapel in January 2014\nShe added that Reeves's claims were made to 'justify his actions after the fact.'\nThe judge also discredited his wife's argument that Oulson appeared to be coming after Reeves as video shows the victim had only came into contact with him after the popcorn was thrown.\nBarthle said Reeves had been the aggressor as he initiated contact with Oulson, the paper reported.\nLast month, another witness, Joanna Turner contested Vivian's testimony as well.\nTurner told the court she heard Oulson say, 'I'm texting my daughter,' seconds before a shot was fired by Reeves.\nOulson's widow, Nicole - who was in the cinema with her husband at the time, said in 2014 that Chad was texting their daughter's babysitter at the time of the shooting.\n'It was a couple of words. No threats. No harm. No nothing... In the blink of an eye, 30 seconds, it just shattered my world,' she said.\nReeves's attorney plans to challenge the judge's ruling through the Second District Court of Appeals.\nFlorida's stand your ground law states a person has no duty to retreat when faced with a violent confrontation and can use deadly force if he or she fears death or great bodily harm.\nReeves was arrested at the theater and charged with second-degree murder and aggravated battery, but was freed on bond.","url":"https://www.dailymail.co.uk/news/article-4301628/Florida-judge-denies-stand-ground-defense-shooting.html"}
