{"authors":["James Wilkinson For Dailymail.Com"],"date_download":"2018-10-22 21:26:58","date_modify":"2018-10-22 21:26:58","date_publish":"2017-04-26 01:52:48","description":"This is the tense moment a Florida suspect called Gold Teeth had to be rescued from his own van after it crashed an burned during a high-speed car chase on Sunday morning.","filename":"data/vaneerConsumption/Floridapolicedragsuspectfromburningcarafterchase.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/25/23/3F9B031300000578-0-image-a-4_1493159140003.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446062_Suspect-pulled-flaming-van-cops-chase-crash_1540243618.html","title":"Florida police drag suspect from burning car after chase","title_page":"Florida police drag suspect from burning car after chase | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the tense moment a Florida suspect nicknamed Gold Teeth had to be rescued from his own van after it crashed and burned during a high-speed car chase on Sunday morning.\nActing on a tip-off that the driver - also known as Scott Michael Beekman, 28, - was planning a home invasion, cops tracked his white van down to a food store parking lot outside Ocala.\nWhen he spotted the cops he fled, leading to a chase that would have seen his shiny grill melted down if sheriff's deputies hadn't saved the day, police said.\nScroll down for video\nFireball: Florida cops dragged a home invasion suspect from his van after it overturned and crashed during a high-speed pursuit on Sunday morning. He was not seriously harmd\nGold Teeth's van can be seen on a police dashcam weaving from lane to lane for around two minutes before he apparently loses control and topples over.\nAlmost immediately, a fire breaks out, wreathing his vehicle in smoke.\nThree deputies approach with a shield, guns and a fire extinguisher, but Gold Teeth - trapped inside the cab of his van - isn't going anywhere.\nThere follows a tense several minutes as cops wail on the windshield with batons, boots and even the fire extinguisher until it collapses and Gold Teeth can be freed.\nThe suspect can be heard complaining that his arm is hurt as police goad him into leaving the vehicle.\n'It's going to blow up!' one deputy says, 'You're about to burn to death.'\n'Please don't hurt me, I don't hurt no one,' Gold Teeth whimpers as they lay him down next to the vehicle and cuff him.\nSwerving: His van (right) had swerved across the road several times before the crash. Police booked the driver, Scott Beekman (right), also known as 'Gold Teeth' and 'White Gold'\nBut the van is still burning, and the danger of getting caught in the fire is too high, so they have to pull him out - leading to much wailing from the injured criminal.\nAs they lower him back to the ground and check that nobody else is in the van, he moans: 'Why didn't I just stay home?'\nDeputies found a series of loaded guns by the driver's seat, police said: a short-barreled shotgun, a .32 caliber pistol and a sawed-off .22 caliber rifle.\nBeekman, a convicted felon, was also driving on a suspended license, they claimed.\nHe was taken to hospital with non-life-threatening injuries and then placed in jail, where he was slapped with six counts including fleeing with disregard to safety of person or property; three counts of possession of a weapon or ammo by a convicted felon; possession of a short barreled gun, rifle or machine gun; and driving while license suspended or revoked.\nBeekman, whose body is covered in tattoos, also raps under the names Scott Michael and 'White Gold'.\nIn his song 'Constitutional Right,' he raps: 'Constitutional right, we revolutionary fighting, if it go down mother f****er I'm gonna shoot tonight.'","url":"https://www.dailymail.co.uk/news/article-4446062/Suspect-pulled-flaming-van-cops-chase-crash.html"}
