{"authors":["Breitbart Tv"],"date_download":"2018-10-30 20:02:55","date_modify":"2018-10-30 20:02:55","date_publish":"2014-12-18 00:20:58","description":"Wednesday, People magazine published an interview titled","filename":"data/vaneerConsumption/FLOTUSFlashbackWomanAskedforHelpatTargetBecauseSheWasShort.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-TV/2014/12/17/flot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2014_12_17__1540929775.html","title":"FLOTUS Flashback: Woman Asked for Help at Target 'Because She Was Short'","title_page":"FLOTUS Flashback: Woman Asked for Help at Target 'Because She Was Short' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wednesday, People magazine published an interview titled “The Obamas: How We Deal with Our Own Racist Experiences,” in which Michelle Obama claimed it was due to racism that a woman at Target asked her for help to get detergent from a high shelf.\n“I tell this story, I mean, even as the first lady, during that wonderfully publicized trip I took to Target, not highly disguised, the only person who came up to me in the store was a woman who asked me to help her take something off a shelf. Because she didn’t see me as the first lady, she saw me as someone who could help her. Those kinds of things happen in life. So it isn’t anything new.”\nHowever, two years ago the 5′ 11″ first lady told David Letterman it was because the woman “was short,” saying, “I thought I was undercover. I have to tell you something about this trip though. No one knew that was me because a woman actually walked up to me, right? I was in the detergent aisle, and she said, I kid you not, she said, ‘Excuse me, I just have to ask you something,’ and I thought, ‘Oh, cover’s blown.’ She said, ‘Can you reach on that shelf and hand me the detergent?’ I kid you not…And the only thing she said. I reached up because she was short, and I reached up, pulled it down. She said, ‘Well, you didn’t have to make it look so easy.’ That was my interaction. I felt so good.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2014/12/17/flotus-flashback-woman-asked-me-for-help-at-target-because-she-was-short/"}
