{"authors":[],"date_download":"2018-10-23 05:12:53","date_modify":"2018-10-23 05:12:53","date_publish":"2016-01-11 18:21:29","description":"Fans laid floral bouquets and notes of thanks outside David Bowie's New York home Monday, paying tribute to the legendary musician who died after a private b...","filename":"data/vaneerConsumption/FlowerstearsoutsideBowiesNewYorkhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-7024j-48qEJGFphM8d437f0aaf927f5c6c-202_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394374_Flowers-tears-outside-Bowies-New-York-home_1540271573.html","title":"Flowers, tears outside Bowie's New York home","title_page":"Flowers, tears outside Bowie's New York home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Flowers, tears outside Bowie's New York home\nFans laid floral bouquets and notes of thanks outside David Bowie's New York home Monday, paying tribute to the legendary musician who died after a private battle with cancer.\n\"I feel devastated,\" said Penelope Bagieu, 33, who draws comics and lives in Brooklyn, but comes from France.\nShe cried after leaving a bunch of flowers outside the elegant brick building on Lafayette Street in Soho, where admirers laid dozens of bouquets, candles and brief notes.\nMembers of the media do stand ups in front of a memorial outside of the residence of British music legend David Bowie in New York on January 11, 2016 ©Kena Betancur (AFP)\nThey started to arrive before dawn, as soon as they woke to the news that the 69-year-old musician had passed away.\n\"I woke up my husband, 'Steve, Steve, David Bowie is gone',\" said Michelle Lynn, who stopped by on her way to work carrying photographs of Bowie in her handbag.\n\"I have been a fan forever,\" she said. \"My friends and I were all fanatic (about him). We did feel that on the photos he looked gaunt. We were all concerned but you never think that... you think it will go on forever.\n\"I saw him perform many times, the first time at Madison Square Garden. I was blown away,\" she said.\nBowie's death came as a shock just two days after he released his 25th album, capping one of the most influential and innovative pop careers of all time.\n\"Au revoir David,\" said the message from Bagieu on a bouquet placed next to the front door of the building.\n\"Thank you David, may the Gods bless us all,\" read another note left with a bunch of white roses and a candle.\nGeorgina Berrozpe, 45, from Spain who lives in the neighborhood, said she had come to bid farewell to an artist who had fascinated her since childhood.\nShe said she had been listening to his music for an hour since learning of his death.","url":"https://www.dailymail.co.uk/wires/afp/article-3394374/Flowers-tears-outside-Bowies-New-York-home.html"}
