{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 01:45:10","date_modify":"2018-10-23 01:45:10","date_publish":"2017-03-10 10:17:21","description":"McGregor has shown off his latest big purchase - a watch to sit next to the hand he says made his fortune. McGregor showed off the watch in a photo he captioned 'This left hand made me millions'.","filename":"data/vaneerConsumption/FloydMayweatherbeatsMcGregorinbattleofthewatches.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22D43400000578-0-image-a-17_1489149534493.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_ufc_article-4300530_UFC-news-Conor-McGregor-shows-48-000-watch_1540259110.html","title":"Floyd Mayweather beats McGregor in battle of the watches","title_page":"Floyd Mayweather beats McGregor in battle of the watches | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Conor McGregor has shown off his latest big purchase - a watch to sit next to the hand he says made his fortune.\nThe Irish MMA star posted a picture to Instagram of his new Patek Philippe time piece, which has a retail price of $62,300 - approximately £48,000.\nMcGregor showed off the Nautilus Mechanical Blue Dial watch in a photo he captioned 'This left hand made me millions'.\nThe Irish MMA star posted a picture of his new watch which has a retail price of £48,000\nMayweather appeared at a press conference wearing a watch worth an incredible £500,000\nThat may seem like a pretty penny to most people, but not to Floyd 'Money' Mayweather, who is known for his love of expensive jewelery.\nNot to be outdone by his would-be rival, Mayweather appeared in London to promote Gervonta Davis' fight against Liam Walsh on Wednesday.\nDuring the press conference he was seen wearing his green Richard Mille RM 59-01, worth an eye-watering $620,000 - or roughly £500,000.\nThe watch is actually nicknamed the 'Mark of the Beast' after it was created in honour of Jamaican sprinter and brand ambassador Yohan Blake, whose track nickname is 'The Beast'.\nThe Nautilus Mechanical Blue Dial from Patek Philippe, as favoured by McGregor\nHaving lost the battle of the watches, McGregor can console himself with the fact the he could make millions more by fighting Mayweather.\nHowever he didn't seem to have UFC or Mayweather on his mind on Thursday night, instead enjoying a night-out with friends.\nMayweather's Richard Mille RM 011 is worth more than ten times McGregor's watch\nThe 28-year-old posted a picture of him enjoying a flamboyant cocktail at a bar, captioned 'Let's get this party started hahahaha.'\nMcGregor's recent months have been entirely dominated by talk of the possible superfight against Mayweather, who recently called the Irishman out for, as the American put it, 'blowing smoke up everybody's ass'.\nThe long mooted bout is yet to be agreed due to a long standing disagreement over the money, and Mayweather said: 'He doesn’t really want to fight. If he really wanted to fight, sign the contract. He keeps telling everyone I’m scared of you, I'm scared of you.\n'I’m going to sign the contract and then I’m going to get it faxed over to Conor McGregor and see if he’s going to sign it.'","url":"https://www.dailymail.co.uk/sport/ufc/article-4300530/UFC-news-Conor-McGregor-shows-48-000-watch.html"}
