{"authors":["Amitai Winehouse For Mailonline"],"date_download":"2018-10-23 00:48:17","date_modify":"2018-10-23 00:48:17","date_publish":"2017-03-10 07:53:56","description":"Floyd Mayweather has been on a tour of the United Kingdom - and what visit to the country would be complete without a trip to some of its most famous landmarks, Stonehenge?","filename":"data/vaneerConsumption/FloydMayweatherandtheMoneyTeamvisitStonehenge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/07/3E20962E00000578-0-image-a-26_1489132385331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4300258_Floyd-Mayweather-Money-Team-visit-Stonehenge_1540255697.html","title":"Floyd Mayweather and the Money Team visit Stonehenge","title_page":"Floyd Mayweather and the Money Team visit Stonehenge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Floyd Mayweather has been on a tour of the United Kingdom - and what visit to the country would be complete without a trip to one of its most famous landmarks?\nThe Money Man and his Money Team decided to fit in a short stop at Stonehenge on their tour of the country.\nThey could all be seen smiling and posing in front of the famed Neolithic monument in Wiltshire.\nFloyd Mayweather (front left) poses with The Money Team at Stonehenge: (back row, left to right) - Justin Ray (mascot), Adam Plant (bodyguard), Cuzzo, Pat Walsh (bodyguard), Jay Bling (DJ). (Front row, left to right) - Mayweather, Kelly Swanson (PR), Jackie Starr (barber), Courtney Watson (sports scientist)\nMayweather takes a moment to enjoy the quiet solitude at 'a great wonder of the world'\nStonehenge, which is believed to have been constructed between 3000 BC and 2000 BC, may not have had a more famous recent visitor than Mayweather, who brought his crew along for the journey.\nHe wrote on Instagram: 'Travelling through foreign places, sightseeing the wonders of the world; today I went to Wiltshire, England to visit the historical Stonehenge landmark that's been here for nearly 5,000 years.\n'Although it's not one of the 7 wonders of the world, it's still a great wonder of the world.'\nAnd Adam Plant, part of Mayweather's famed crew, was clearly excited by the trip to one of the world's greatest landmarks.\nMayweather was all smiles as he posed alongside sports scientist Watson at Stonehenge\nHe wrote on Instagram: 'THE MONEY FAMILY TEAM MADE IT TO \"STONE HENGE\" #THEMONEYTEAMTRAVELWORLDLWIDE'.\nMayweather has taken in a number of impressive locations around his obligations as part of the 'Undefeated' UK tour.\nOn Thursday he travelled to see the Palace of Westminster and Big Ben, calling it 'the most famous clock in the world'.\nMayweather has also been promoting protege Gervonta Davis' fight against Liam Walsh during his tour of the UK.\nMayweather posted a picture of him stood outside the Palace of Westminster on Thursday","url":"https://www.dailymail.co.uk/sport/boxing/article-4300258/Floyd-Mayweather-Money-Team-visit-Stonehenge.html"}
