{"authors":["Nuzha Nuseibeh"],"date_download":"2018-10-30 23:00:42","date_modify":"2018-10-30 23:00:42","date_publish":"2014-08-14 13:25:41","description":"In case you needed yet another reason to freak out about flying, it turns out that, every once in a while, a pilot's detachable limb will casually detach and fall off. And no, this isn't a dated Monty Python sketch. A report revealed Wednesday that…","filename":"data/vaneerConsumption/FlybePilotsArtificialArmDetachesMidFlightWhichDoesntFazeHim.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/91106ac5-6d99-4996-92eb-b3816ed71fb0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35743-flybe-pilots-artificial-arm-detaches-mid-flight-which-doesnt-faze-him_1540940442.html","title":"Flybe Pilot's Artificial Arm Detaches Mid-Flight, Which Doesn't Faze Him","title_page":"Flybe Pilot's Artificial Arm Detaches Mid-Flight, Which Doesn't Faze Him","title_rss":"NULL","source_domain":"bustle.com","text":"In case you needed yet another reason to freak out about flying, it turns out that, every once in a while, a pilot's detachable limb will casually detach and fall off. And no, this isn't a dated Monty Python sketch. A report revealed Wednesday that a Flybe pilot's artificial arm fell off as he landed in Belfast, causing him to briefly lose control of the passenger plane. Everyone was fine, thanks to the pilot's incredible, one-armed skills — but, er, I might be choosing sea voyages over air travel for a while. Just to be on the safe side.\nAccording to an Air Accidents Investigation Branch (AAIB) report released this week, the plane, which went from Birmingham to Belfast in February of this year, was carrying 47 passengers. Just as the aircraft was coming into Belfast City Airport — reportedly amid windy conditions — the experienced 46-year-old pilot double-checked his prosthetic left arm, and switched off the auto-pilot mechanism.\nPotential disaster struck just before the plane touched down: according to the BBC, the pilot suddenly found that \"his prosthetic limb became detached from the yoke clamp, depriving him of control of the aircraft.\" With too little time to pass control over to his co-pilot, the one-armed pilot instead took the steering column in his right hand and managed to regain control. \"He did this, but with power still applied and possibly a gust affecting the aircraft, a normal touchdown was followed by a bounce, from which the aircraft landed heavily,\" the report said.\nThe plane landed safely, and none of the passengers was any the wiser. \"The senior captain referred to in this report is one of Flybe's most experienced and trusted pilots. The airline confirms that at no time was the safety of its passengers or crew compromised in any way, nor was the aircraft damaged,\" said Captain Ian Baston, Flybe director of flight operations and safety, in a statement in response to the report.\nBruce Bennett/Getty Images News/Getty Images\nIf you think the Flybe pilot is impressive, though, you'll be overwhelmed by Jessica Cox: She's flown planes without both arms, and is, in fact, the world's first armless pilot. And Marine Staff Sgt. Liam Dwyer, who has a prosthetic left leg, manages to race in the IMA Continental Tire SportsCar Challenge's Street Tuner class, by attaching the car directly to his body.\nAnd I'm proud when I manage to use my utensils without spilling.","url":"https://www.bustle.com/articles/35743-flybe-pilots-artificial-arm-detaches-mid-flight-which-doesnt-faze-him"}
