{"authors":["Associated Press"],"date_download":"2018-10-22 21:37:13","date_modify":"2018-10-22 21:37:13","date_publish":"2016-01-28 08:29:46","description":"WASHINGTON (AP) — Philadelphia's Jakub Voracek scored 38 seconds into overtime to give the Flyers a 4-3 win at NHL-leading Washington on Wednesday in the fin...","filename":"data/vaneerConsumption/FlyerswininovertimeatWashingtonheadingtobreak.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d538bac4d3524976bcc10a87798c20cb-4vVdYopwYQ7f641721b07aacea95-776_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420500_Flyers-win-overtime-Washington-heading-break_1540244233.html","title":"Flyers win in overtime at Washington heading to break","title_page":"Flyers win in overtime at Washington heading to break | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Flyers win in overtime at Washington heading to break\nWASHINGTON (AP) — Philadelphia's Jakub Voracek scored 38 seconds into overtime to give the Flyers a 4-3 win at NHL-leading Washington on Wednesday in the final day of games before the All-Star break.\nVoracek's second goal of the night snapped the Flyers' three-game losing streak, while Brayden Schenn and Ryan White also scored for Philadelphia.\nThe Capitals lost at home for the first time since Nov. 19. Andre Burakovsky had two goals and Nicklas Backstrom one.\nPhiladelphia Flyers right wing Jakub Voracek (93), of the Czech Republic, celebrates his game-winning goal in the overtime period of an NHL hockey game with Shayne Gostisbehere (53) against the Washington Capitals, Wednesday, Jan. 27, 2016, in Washington. The Flyers won 4-3 in overtime. (AP Photo/Nick Wass)\nLos Angeles was another division leader to be beaten 4-3 at home, with Colorado taking victory.\nNathan MacKinnon scored the tiebreaking goal with 9:25 to play, three minutes after Gabriel Landeskog tied it for the Avalanche with his second goal of the game. Matt Duchene also scored for Colorado.\nDrew Doughty and Trevor Lewis had given the Kings a 2-0 lead in the first period.\nTampa Bay's Steven Stamokos scored the sole goal as the Lightining made it eight wins from nine heading into the break by downing Toronto 1-0, sending the Maple Leafs to a ninth defat from 10 games.\nNashville completed a perfect four-game road trip by winning 2-1 at Calgary, with Shea Weber's power-play goal in the second period standing as the winner.\nWashington Capitals center Nicklas Backstrom (19), of Sweden, battles for the puck against Philadelphia Flyers right wing Pierre-Edouard Bellemare (78) during the second period of an NHL hockey game, Wednesday, Jan. 27, 2016, in Washington. (AP Photo/Nick Wass)","url":"https://www.dailymail.co.uk/wires/ap/article-3420500/Flyers-win-overtime-Washington-heading-break.html"}
