{"authors":["Associated Press"],"date_download":"2018-10-23 01:03:22","date_modify":"2018-10-23 01:03:22","date_publish":"2016-01-29 14:47:20","description":"WARSAW, Poland (AP) — Poland wants the European Union to guarantee equal treatment to all member states, especially now when the bloc is facing multiple cris...","filename":"data/vaneerConsumption/FMPolandwantsequalrightsinEUhigherNATOsecurity.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422621_FM-Poland-wants-equal-rights-EU-higher-NATO-security_1540256602.html","title":"FM: Poland wants equal rights in EU, higher NATO security","title_page":"FM: Poland wants equal rights in EU, higher NATO security | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FM: Poland wants equal rights in EU, higher NATO security\nWARSAW, Poland (AP) — Poland wants the European Union to guarantee equal treatment to all member states, especially now when the bloc is facing multiple crises threatening its unity, the nation's new foreign minister said Friday.\nMaking his policy speech in Parliament Witold Waszczykowski said the EU has been hit by crises in security; on its borders, where hundreds of thousands of migrants are arriving; and in the idea of the union itself.\nHe said Poland wants to participate in overcoming these problems, but also wants its interests guaranteed.\nPoland's government will \"counter creation of any internal difference, the idea of a mini-Schengen or of discriminating against Polish citizens living in EU countries,\" especially their right to free travel, Waszczykowski said.\n\"We want an EU of free and equal nations,\" he said.\nWaszczykowski is a member of Poland's new conservative government that is making sweeping change to some key legislation. That has prompted the EU to open a preliminary assessment of whether Poland might be violating the bloc's fundamental principle of the rule of law.\nThe crisis over migrants has put in peril the passport-free Schengen Zone within Europe, while Britain is among countries seeking a rollback of the EU free-movement rules that guarantee citizens of all EU nations the same rights.\nWaszczykowski also said that Poland is expecting that the NATO summit to be held in Warsaw in July will offer Poland and the region tangible guarantees of security at a time of increased activity by a resurgent Russia, which is \"going in the direction of revising post-Cold War European order.\"\nHe added, however, that Warsaw wants to have \"pragmatic and matter-of-fact\" relations with Moscow.\nWarsaw also expects strong support from the U.S. in obtaining NATO security guarantees for the alliance's eastern flank,\" he said","url":"https://www.dailymail.co.uk/wires/ap/article-3422621/FM-Poland-wants-equal-rights-EU-higher-NATO-security.html"}
