{"authors":["Associated Press"],"date_download":"2018-10-23 02:24:58","date_modify":"2018-10-23 02:24:58","date_publish":"2016-01-11 14:39:08","description":"WARSAW, Poland (AP) — The shape of Poland's democracy under the new right-wing government is better than some foreign commentators suggest, the foreign minis...","filename":"data/vaneerConsumption/FMPolandsdemocracydoingbetterthanitseemsoutside.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:22fc197c71294a828aee3bbdafaf6a85-48qEJGFphM8d437f0aaf925ee1e4-465_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393654_FM-Polands-democracy-doing-better-outside_1540261498.html","title":"FM: Poland's democracy doing better than it seems outside","title_page":"FM: Poland's democracy doing better than it seems outside | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FM: Poland's democracy doing better than it seems outside\nWARSAW, Poland (AP) — The shape of Poland's democracy under the new right-wing government is better than some foreign commentators suggest, the foreign minister said Monday, inviting German politicians to visit and check.\nThe government that took power in November swiftly moved to change some legislation as it wants to introduce sweeping state and social reforms.\nWitold Waszczykowski spoke after meeting with German ambassador to Poland, Rolf Nikel, whom he had summoned to protest \"anti-Polish\" statements by some German politicians.\nPoland¿s Foreign Minister Witold Waszczykowski, left, and Germany¿s Ambassador Rolf Nikel speak to reporters after talks they held on request from Waszczykowski who protested, what he called, ¿anti-Polish¿ statements by some German politicians, before the Foreign Ministry building in Warsaw, Poland, Monday, Jan. 11, 2016.(AP Photo/Czarek Sokolowski)\nNikel said that Polish-German relations are a \"treasure that should be protected.\"\nLater Monday, German government spokesman Steffen Seibert said that \"Germans and Poles are neighbors, partners, friends, and we've never been so close in our history. This is precisely what we want to preserve, continue and where possible deepen.\"\nWaszczykowski said there was a \"problem in communicating with some German politicians\" and invited his German counterpart, Frank Walter Steinmeier, and other politicians to visit and see that the \"shape of Poland's democracy is not as bad as may seem from far away.\"\nOn Sunday, European Parliament President Martin Schulz likened Poland's current politics to those of Russian President Vladimir Putin. A member of Germany's conservative Christian Democrats Party, Volker Kauder, recently spoke in favor of sanctions against Poland if the country continues, in his view, to ignore the principles of the rule of law.\nThe comments were in reaction to new legislation that Poland's ruling Law and Justice party adopted on a constitutional court and on state media.\nThe European Commission is to debate Poland's rule of law on Wednesday. The step could eventually result in the country losing its EU voting rights on matters that concern the entire 28-nation bloc. Poland joined the EU in 2004.\nSeibert said it was \"right and the usual European route\" for the European Commission to ask questions of the new Polish government.\nThe European Parliament is to debate Poland's politics on Jan.19.\n___________\nFrank Jordans in Berlin contributed to this story\n_________\nThis story was corrected to say that Kauder is a member of the Christian Democrats Party.\nPoland¿s Foreign Minister Witold Waszczykowski, left, and Germany¿s Ambassador Rolf Nikel speak to reporters after talks they held on request from Waszczykowski who protested, what he called, ¿anti-Polish¿ statements by some German politicians, before the Foreign Ministry building in Warsaw, Poland, Monday, Jan. 11, 2016.(AP Photo/Czarek Sokolowski)\nGermany¿s Ambassador Rolf Nikel leaves a meeting with Poland¿s Foreign Minister Witold Waszczykowskito after talks they held on request from Waszczykowski who protested what he called ¿anti-Polish¿ statements by some German politicians at the Foreign Ministry in Warsaw, Poland, Monday, Jan. 11, 2016. (AP Photo/Czarek Sokolowski)\nGerman Ambassador to Poland Rolf Nikel, second left, and Polish Foreign Minister Witold Waszczykowski, left, walk out after a meeting to reporters following their talks in Warsaw, Poland, Monday, Jan. 11, 2016. Waszczykowski has summoned Nikel over recent \"anti-Polish\" statements by German politicians who have criticized the politics of the new right-wing ruling party. (AP Photo/Czarek Sokolowski)","url":"https://www.dailymail.co.uk/wires/ap/article-3393654/FM-Polands-democracy-doing-better-outside.html"}
