{"authors":["Ian Hanchett"],"date_download":"2018-10-30 21:06:31","date_modify":"2018-10-30 21:06:31","date_publish":"2015-07-03 12:43:40","description":"Oren argued Iran has \"internalized\" the message that with the US \"the longer they remain at the table, the more concessions they make\"","filename":"data/vaneerConsumption/FmrIsraeliAmbIranKnowsTheLongerUSNegotiatesTheMoreConcessionsTheyMake.json","image_url":"https://media.breitbart.com/media/2015/06/Oren-623-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_07_03__1540933591.html","title":"Fmr. Israeli Amb: Iran Knows The Longer US Negotiates, 'The More Concessions They Make'","title_page":"Fmr. Israeli Amb: Iran Knows The Longer US Negotiates, 'The More Concessions They Make' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Israeli Ambassador Dr. Michael Oren argued that Iran has “internalized” the message that when it comes to the US “the longer they remain at the table, the more concessions they make” on Thursday’s “Hugh Hewitt Show.”\nOren said of the US-Iran negotiations, “I’m unconvinced…that the Iranians will not try to drag it out ever further, because the message that they have internalized since 2009 is the longer they remain at the table, the more concessions they make, that the administration has said repeatedly that the window for opportunity will not remain indefinitely open, but it’s never really closed. I’m not sure it’s a window. And the Iranians have taken notice of that. They also may conclude that they’re getting so many benefits from the negotiations, for example, they’ve had their — they’ve gained legitimacy for their nuclear program. Even beyond that, they’ve gained recognition of their right to enrich uranium, which is not in the Nuclear Non-Proliferation Treaty. They’ve gotten recognition for their aspirations, their regional aspirations. All of this, so far without paying any price. Why would they want to start paying a price? Because of sanction relief, but maybe they’re banking on the fact that the sanctions will begin to unravel.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2015/07/03/fmr-israeli-amb-iran-knows-the-longer-us-negotiates-the-more-concessions-they-make/"}
