{"authors":["Jeff Poor"],"date_download":"2018-10-30 18:49:22","date_modify":"2018-10-30 18:49:22","date_publish":"2016-12-16 01:26:27","description":"Thursday on Fox News Channel's \"Tucker Carlson Tonight,\" host Tucker Carlson confronted Newsweek's Kurt Eichenwald for his claim that President-elect | Video","filename":"data/vaneerConsumption/FNCsTuckerCarlsonTakesonNewsweeksKurtEichenwaldforClaimTrumpWasinMentalHospitalThisIsaLittleNutty.json","image_url":"https://media.breitbart.com/media/2016/12/Carlson1215.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_12_15__1540925362.html","title":"FNC’s Tucker Carlson Takes on Newsweek’s Kurt Eichenwald for Claim Trump Was in Mental Hospital — ‘This Is a Little Nutty’","title_page":"FNC's Tucker Carlson Takes on Newsweek's Kurt Eichenwald for Claim Trump Was in Mental Hospital --- 'This Is a Little Nutty' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Thursday on Fox News Channel’s “Tucker Carlson Tonight,” host Tucker Carlson confronted Newsweek’s Kurt Eichenwald for his claim that President-elect Donald Trump had spent time in a mental hospital in 1990.\nEichenwald made the claim on Twitter in September, but promptly deleted it.\nWhen pressed by Carlson if he believed Trump had spent time in a mental hospital, Eichenwald attempted to offer a long-winded explanation for the claim, but would never give a direct answer.\n“I knew from people inside the Trump Organization that they were deeply concerned about his condition that he was getting reckless, that he was getting impulsive,” Eichenwald said. “That he wasn’t sleeping. That he was speaking with these sort of great variations of grandeur that he could do anything. And in 1990, because he did so many deals that were so reckless, his whole empire was going into bankruptcy. And he was going through a divorce. And I was told that there was — now, let me say, I’m talking about reporting process. So I’m saying here is what I was told.”\nLater in a segment that featured Eichenwald showcasing a binder with the label “Tucker Carlson Falsehoods” and attempting to bring up the CIA and fallen agents.\n“This is a little nutty, I gotta be honest,” Carlson said.\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2016/12/15/fncs-tucker-carlson-takes-newsweeks-kurt-eichenwald-claim-trump-mental-hospital-little-nutty/"}
