{"authors":["Brian Fanney"],"date_download":"2018-10-30 14:37:29","date_modify":"2018-10-30 14:37:29","date_publish":"2016-10-22 00:00:00","description":"A decade or so ago, a 3-year-old boy was run over by a car in Alabama.","filename":"data/vaneerConsumption/Foefearspotdrivearepeatofopioidpush.json","image_url":"https://media.arkansasonline.com/img/photos/2016/10/22/resized_99261-healthy01_8-22044_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_oct_23_foe-fears-pot-drive-a-repeat-of-opioid-__page=2_1540910249.html","title":"Foe fears 'pot' drive a repeat of opioid push","title_page":"Foe fears 'pot' drive a repeat of opioid push","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A decade or so ago, a 3-year-old boy was run over by a car in Alabama.\nGreg Bledsoe had to tell the mother, who was about 22, that her son died. He asked if he could call her mother. She said the boy's grandmother was the one who ran him over.\n\"Her mom was addicted to prescription drugs, went over to visit the daughter, lost control of the vehicle and crushed the grandchild in the front yard,\" Bledsoe said. \"I can tell you story after story after story just like that. It's a tragedy of epic proportions. We need to squeeze every ounce of learning from this episode so that it never happens again.\"\nThe event is part of why Bledsoe, now Arkansas surgeon general, opposes two competing medical-marijuana measures on the Nov. 8 general election ballot -- Issues 6 and 7. Early voting starts Monday.\n[INTERACTIVE LIST: Find the local races in your county or city]\nHe believes the opioid epidemic -- and the ensuing tragedy -- could have been prevented if doctors on the front lines of care had been heard by hospital administrators, the federal government and advocacy organizations.\nHe sees the national movement to legalize medical marijuana as history repeating itself.\nJust like with the opioid movement, he said, the push for access to marijuana for medical purposes has two elements -- a vocal group advocating for patient rights but also a lackluster body of scientific evidence.\n\"This is not a scientific debate, this is a campaign,\" Bledsoe said. It's the same with debate over vaccines, fluoride in water or helmets on motorcycle drivers, he said.\nAnd that, to him, is the problem.\nFifth vital sign\nIn the late 1990s, Bledsoe was a medical student and his teachers were divided.\nThe older instructors, people Bledsoe looked up to, were generally wary of opioids like oxycodone, methadone and codeine.\nThe younger teachers -- hit with messages from the federal government, advocacy groups, some professors and pharmaceutical companies -- generally told students not to worry about the effects of prescribing more opioids.\n\"Not everyone agreed with this change. I didn't. I know a lot of people who didn't, but enough of them did that it shifted the culture,\" Bledsoe said. \"The older physicians, who were teaching this, were by and large against this. They were discounted.\"\nPain is subjective, Bledsoe said, and before the more powerful opioids gained popularity, doctors generally gave a set amount of morphine based on their experience and the patient's weight.\n\"A lot of these pain experts, this is what they were battling against. They said it was too subjective, but pain is subjective,\" he said. \"There's not a pain-o-meter.\"\nHere are the highlights in the campaign for increased opioid use, according to Bledsoe:\n• A 1985 paper that surveyed 38 patients had told doctors their fears about opioid addiction were overstated.\n\"For reasons which remain obscure and probably involve an interaction of physiological and psychological factors, most people who drink do not become alcoholic,\" according to the paper. \"It is likely, given the data available, that most patients exposed to opioids do not become drug abusers.\"\n• In 1996, the American Pain Society starting talking about pain as the fifth vital sign -- making it the first subjective vital sign, Bledsoe said.\nThe Veterans Affairs Department, known at the time as the Veterans Administration, then adopted those guidelines in its national pain-management strategy.\n• Then, some federal dollars started hinging on patient-satisfaction reports.\n\"The hospital administrator wants happy patients and now they have reason to be justified in leaning on doctors because they've got federal policy backing them up,\" Bledsoe said.\nThe movement led to a well-intentioned policy that sought to reduce pain in patients, but it had consequences, he said.\nIn a statement released earlier this month, the Arkansas Medical Society said the medical-marijuana ballot measures would add to the \"already growing problem of prescription drug abuse and the enforcement of illegal drug laws.\"\nAccording to the American Society of Addiction Medicine, 259 million prescriptions were written for opioids in 2012, which is more than enough to give every American adult his own bottle of pills.\nDrug overdose is the leading cause of accidental death in the U.S., with 47,055 lethal overdoses in 2014, the society said. Opioid addiction is driving the epidemic, the society said, with 18,893 overdose deaths related to prescription pain relievers, and 10,574 overdose deaths related to heroin in 2014.\nThe overdose death rate in 2008 was nearly four times the 1999 rate; sales of prescription pain relievers in 2010 were four times those in 1999; and the admission rate for treatment of substance abuse in 2009 was six times the 1999 rate, according to the society.\n\"Inadequate research leads to inappropriate legislation which leads to unintended consequences -- every time,\" Bledsoe said.\nRise of medical marijuana\nThe rise of opioids is similar to the push for medical marijuana in Arkansas and around the country, Bledsoe said.\n\"You have a handful of people saying that marijuana is good,\" he said. \"You have people rallying around this cause. They're very energetic and very outspoken. And you have a large group of medical professionals saying if we do this irresponsibly, there's going to be a lot of pain.\"\nArkansas could become the first state in the South to allow medical marijuana. The state came close in 2012 when 49 percent of voters were in favor of it.\nIn addition to Bledsoe, various organizations have largely opposed Arkansas' measures.\nThose include the Arkansas State Chamber of Commerce, Arkansas Farm Bureau Federation, Arkansas Prosecuting Attorneys Association and Arkansas Association of Chiefs of Police.\nRepresentatives from physician organizations like the Arkansas Medical Society, Arkansas Hospital Association, Family Physician Association, Pharmacy Association, University of Arkansas for Medical Sciences, Arkansas Children's Hospital, Arkansas Center for Health Improvement, Arkansas Department of Health and Arkansas Heart Hospital have all said they are against both medical-marijuana ballot measures.\nG. Richard Smith, a psychiatrist and addiction specialist at the University of Arkansas for Medical Sciences, was one of those outspoken doctors.\n\"I think there is some parallel to it,\" he said of the debates on opiate use and medical marijuana. \"We don't want to suffer and I think that's a natural human condition, but you know, you really can't alleviate all suffering, especially when there are safety concerns.\"\nPeople want a \"quick fix\" for pain, Smith said.\n\"If we can take it away, we should take it away. It's just that chronic use of opiates is not supported by scientific evidence,\" Smith said.\nA few doctors have supported medical marijuana. Some studies, many with small sample sizes, support their view.\nThe federal government is not opposing the efforts of 25 states, the District of Columbia, Guam and Puerto Rico, which either allow medical-marijuana use or are in the process of doing so, according to the National Conference of State Legislatures. Still, the U.S. Drug Enforcement Administration lists marijuana as a Schedule I drug, same as heroin, LSD and Ecstasy.\nDr. Bill Piechal, a Fayetteville doctor of osteopathy who specializes in pain management, said the human body naturally makes and absorbs chemicals similar to those in marijuana, which affect immune response, inflammation and other body processes. He said approving the Arkansas Medical Cannabis Act would benefit Arkansans while prodding the federal government to allow more research into the drug's medical benefits.\n\"It pushes the ball just a little bit forward,\" Piechal said at a Fayetteville rally for the Arkansas Medical Cannabis Act. \"It puts cannabis in the hands of people who need it and at a price they can afford.\"\nBledsoe said that like the push for increased opioid use, medical-marijuana legalization in Arkansas will cause problems.\n\"We'll have a huge problem on our hands, an unintended consequence, because we rolled this out irresponsibly,\" he said.\nThere is a way to approve medicine through the federal Food and Drug Administration. It can be slow, it requires intense research, but it ensures increased vetting.\nIn a statement, the Arkansas Medical Society said: \"Unlike FDA approved medications, cannabis has not been subjected to rigorous testing to determine proper dosing levels, and methods of administration. There is no way under the various state based medical cannabis laws, that dosing levels can be controlled, particularly with smoking as the most common form of use.\"\nHowever, the society called for federal officials to \"lift the Schedule I classification and create an avenue, along with appropriate funding, to conduct well-designed clinical research that will enable cannabis and its related components to be treated like other prescription drugs, available in dosage controlled delivery systems and subject to the same rigorous product safety testing that we expect from our prescription drug system.\"\nBledsoe said he believes that marijuana probably does contain compounds that are medicinal, but more research is needed to figure out what those are and what will happen if patients use them.\n\"The other side is waging a campaign to get this passed and they're using compassion and they're throwing out research, but they never engage me on my research,\" Bledsoe said. \"I submitted a whole bibliography at the press conference with the governor. I have not had a single comment from the other side, except that all that stuff has been discredited.\"\nUntil there's a scientific consensus, it's better to wait, he said.\n\"The problem with bad policy is you flip a switch and you write the policy and implement it, but the results aren't shown for several years,\" Bledsoe said. \"Getting out of that hole we've dug isn't going to be an easy process and it's expensive.\"\nSundayMonday on 10/23/2016","url":"https://www.arkansasonline.com/news/2016/oct/23/foe-fears-pot-drive-a-repeat-of-opioid-/?page=2"}
