{"authors":[],"date_download":"2018-10-30 01:24:28","date_modify":"2018-10-30 01:24:28","date_publish":"2016-06-20 05:00:17","description":null,"filename":"data/vaneerConsumption/FoggyBottomBreakdown.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/06/Harry_S._Truman_Building.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862668.html","title":"Foggy Bottom Breakdown?","title_page":"Foggy Bottom Breakdown?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"After last week we must conclude that not everyone in the State Department is an idiot. That conclusion — guarded, reluctant, and certainly temporary — is based on a truly earth-shattering event.\nAs the Wall Street Journal reported, fifty-one State Department officials, all of whom are or were advisors on the State Department’s policy on Syria, authored a “dissent channel cable” (State’s grandiose term for an email) petitioning for military strikes against Bashar Assad’s government and urging regime change in Damascus as the only way to defeat the ISIS terrorist network.\nThe petition, in part, says, “Failure to stem Assad’s flagrant abuses will only bolster the ideological appeal of groups such as Daesh [ISIS], even as they endure tactical setbacks on the battlefield.”\nThere is no modern equivalent to that petition. One can only imagine such events. The Harvard faculty could endorse Donald Trump. Al Gore could admit that global warming is a hoax. Or Hillary Clinton could confess to the federal crime of intentionally mishandling top secret information. Nothing else would come close.\nCan it be that, after nearly eight years of gladly helping sell America’s national security down the river that a few of the State Department’s bureaucrats have seen the error of Obama’s, Kerry’s, and Clinton’s ways? That’s one way to read it.\nIt’s entirely appropriate to view the petition with skepticism. It could easily be that a bunch of these folks, coming near their retirements, want to pave their way into the book world. You don’t have to be Sherlock Holmes to detect a whiff of opportunism in it as well as a healthy dose of unreality.\nSome or all of these people must have participated — with Hillary Clinton and Vichy John Kerry — in crafting the disasters of foreign policy we and our allies have endured since 2009. As “experts” on the Middle East, they must have aided Obama’s and Kerry’s dogged efforts — over almost two years — to bully Israel into a peace agreement with the Palestinians on terms that would have sacrificed Israel’s national security to false promises.\nThey must have been there through Obama’s negotiations with Iran, helping craft the nuclear weapons agreement that is everything Obama and Kerry assured us it was not, guaranteeing Iran will have nuclear weapons and the intercontinental missiles to deliver them, as soon as it wants them.\nAnd these same people must have been there, helping Obama and Kerry craft the Syria policy that willfully ignored the facts on the ground and assured that Russia and Iran can control the outcome in the so-called Syrian civil war.\nWhich brings us to the other problem with the petition. It’s fine to say that regime change in Damascus is the way to topple ISIS, but any reasonable person — which means almost anyone outside Foggy Bottom or the White House — would conclude that our window of opportunity in Syria was closed about three years ago.\nRegime change in Damascus is something that American policy — formed in the State Department — has been tacitly supporting since 1979 when the Assad regime, under Bashar’s father Hafez and since, was declared a state sponsor of terrorism. But there was not a peep from this bunch when the Syrian civil war was actually a civil war.\nAnd that’s the other problem with this petition.\nYes, we could take military action against Assad and bring him down even at this late date. But to do that, we’d have to take on half the Russian air force and strike at the Iranian forces in Syria as well.\nAt this point, we probably don’t have the air power and other forces needed to do that. As I’ve written before, about 70% of the Marines’ F-18 strike fighters are incapable of flying combat missions. About 20% of the Navy’s F-18s are in the same sad state. As Rep. Randy Forbes recounted to me a few weeks ago, the Navy is now incapable of meeting 58% of our combatant commanders’ mission requirements. The Air Force isn’t in much better shape. These facts make skepticism about the petition clearer. The signers, even in their ivory towers, must know two things.\nFirst, that neither Obama nor his likely successor — be it Hillary or Trump — are going to be able to follow their belated advice. Second, through the multi-agency clearance process that precedes any congressional testimony, the signers must have known that CIA Director John Brennan was to testify last week that Obama’s two-year war against ISIS has failed to disrupt ISIS’s capability to mount terrorist attacks on a global basis. Brennan’s other testimony, that ISIS is embedding terrorists among the tidal wave of refugees still going to Europe and being brought here by Obama’s specific policy to do so, is more fuel for petitioners’ argument.\nThere’s little to add at this point. It will take years, and many billions of dollars, to rebuild our ability to influence events around the world. We are almost to the point that Europe finds itself. The only way to stop the flow of terrorists among the flood of refugees is, by military action, to remove the reasons that people are fleeing Syria, Iraq, Afghanistan, and so many other terrorist-ridden nations. Our NATO allies have so disarmed themselves, content to rely on our ability to control events, that they lack the forces to do it themselves.\nAnd now, perhaps, so do we. It’s still possible, if we were to engage enough of the Navy’s and Air Force’s combat assets as well as our other military forces, to drive ISIS out of Syria, Iraq, and Libya. We could, if our national security demanded it, take on the Russian and Iranian forces to do so. But if we did, we’d have to be prepared to fight a much wider war. And we’re not, even if we determined that such action was advisable.\nThere’s no evidence that the fifty-one diplomatic advisors who signed the “dissent channel cable” have any thought of those consequences. The news stories reporting on the petition say that it was written with the next president’s policy in mind. That’s why it’s essential to view their petition with skepticism. Even if the State Department suffered a moment of lucidity in its continuous state of delusion, it would be far too little and vastly too late.","url":"https://spectator.org/foggy-bottom-breakdown/"}
