{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:24:00","date_modify":"2018-10-30 23:24:00","date_publish":"2016-12-07 00:00:00","description":"Zopa, RateSetter, and Funding Circle are all still waiting for FCA authorisation, over 2 years after the regulator was put in charge of policing the sector.","filename":"data/vaneerConsumption/Folk2FolkauthorisedbyFCAbutFundingCircleZopaandRateSetterstillwaiting.json","image_url":"https://amp.businessinsider.com/images/5848174ddd089531448b4dbe-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_folk2folk-authorised-fca-peer-to-peer-funding-circle-zopa-ratesetter-waiting-2016-12_1540941840.html","title":"Folk2Folk authorised by FCA but Funding Circle, Zopa, and RateSetter still waiting","title_page":"    Folk2Folk authorised by FCA but Funding Circle, Zopa, and RateSetter still waiting - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Jane Dumeresque, CEO of Folk2Folk. Folk2Folk LONDON — Folk2Folk has become the largest fully authorised peer-to-peer platform in Britain.\nThe company announced on Wednesday that the regulator, the Financial Conduct Authority (FCA), has given it full operating permissions, allowing it to offer the Innovative Finance ISA and giving it a stamp of approval that it can market to customers.\nCornwall-based Folk2Folk lets people lend money to local projects and business in their area and has lent over £125 million ($157.5 million) across its platform since launch in 2013.\nIt is different to other crowdfunding platforms in that it has a network of shops around the countries where businesses and lenders can talk to staff about lending on the platform.\nAt their simplest, peer-to-peer lenders, also known as marketplace lenders, allow individuals to lend money directly to either people or businesses, bypassing banks who usually act as intermediaries. Investors get good interest rates and borrowers often get cash quicker and easier than they would from the banks.\nJane Dumeresque, Folk2Folk's CEO, says in an emailed statement: \"We are delighted that the FCA has granted Folk2Folk its full authorisation for peer-to-peer lending.\n\"I think it speaks volumes about Folk2Folk as a business having gained its full FCA authorisation ahead of many of the industry's leading and larger platforms.\"\nZopa, Funding Circle, and RateSetter — the UK's three biggest peer-to-peer lending platforms — are still waiting to be authorised over 2 years after the government announced that the FCA would authorise the sector. All three are operating under what is known as interim permissions and all three dwarf Folk2Folk, with over £1 billion lent over each platform.\nYou might assume that their sheer size means it takes longer to audit them. But several people I have spoken to close to the authorisation process say they have had little communication from the regulator over the last 6 months and little clarity from on timings.\nAn investigation into the sector launched by the FCA in July appears to be conflicting with the authorisation process, with some platforms being asked questions that they had already answered. Business Insider understands the regulator is due to make a statement on its peer-to-peer funding probe later this week.\nLeadership at both the Treasury and the FCA have changed in the last six months. REUTERS/Phil Noble Several industry sources have suggested that the complexity of some platforms, notably RateSetter, could also be delaying the process. RateSetter operates a provision fund, meant to cover investor losses, and offers fixed-term investment products. (FT Alphaville's Kadhim Shubber has a good summary of RateSetter's complexity here.)\nAn industry insider said RateSetter's structure raised questions about how exactly it was different to a collective investment scheme. However, the Treasury clarified that the structures were not a collective investment scheme in legislation last year.\nA spokesperson for RateSetter told Business Insider: \"We continue to work with the FCA to move to full authorisation as early as possible. This is an involved process and it's right that the FCA takes the time it needs to do a thorough assessment.\"\nThe FCA declined to comment. However, it said in a statement from March: \"How long it takes to consider an application depends on a number of factors including the completeness of the application, the complexity of the business, and the firm's demonstrated compliance with regulatory requirements.\"\nAuthorisations may well also be being delayed by disruption in government and at the regulator. Former Chancellor George Osborne, who was a champion of peer-to-peer lending, left Number 11 in July and Andrew Bailey became the new head of the FCA in the same month.\nWhatever the hold-up, many in the sector believe the FCA is reluctant to authorise any of the big three ahead of the others, for fear of being seen to pick favourites. If true, this is likely to only add to the delay.\nA spokesperson for Zopa told Business Insider: \"We are working with the regulator closely on our application process. Zopa don't have fixed term products and so we have no questions on this.\"\nA spokesperson for Funding Circle said: \"We continue to work with the FCA on becoming fully authorised as soon as possible.\"","url":"https://www.businessinsider.com/folk2folk-authorised-fca-peer-to-peer-funding-circle-zopa-ratesetter-waiting-2016-12"}
