{"authors":[],"date_download":"2018-10-22 23:23:08","date_modify":"2018-10-22 23:23:08","date_publish":"2018-07-07 00:00:00","description":"The Catalan musicians use their culture's tradition to connect difficult memories of the Spanish Civil War to Spain's democracy today.","filename":"data/vaneerConsumption/FolkDuoMariaiMarcelShinesLightOnTheVeryRealTabooOfSpainsCivilWar.json","image_url":"https://media.npr.org/assets/img/2018/07/06/_mg_86381_wide-0a80ee8db35a755b433638fe818206b3397b19b5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=626573802_1540250588.html","title":"Folk Duo Maria i Marcel Shines Light On The 'Very Real Taboo' Of Spain's Civil War","title_page":"Folk Duo Maria i Marcel Shines Light On The 'Very Real Taboo' Of Spain's Civil War  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MARIA ARNAL: Finally today, some music from Catalonia. It's a place that has held on to its distinct culture through the centuries, its struggle to redefine its relationship with Spain. Maria Arnal and Marcel Bages are part of that tradition. They are reimagining Catalan folk music while taking on some of the tough questions that Catalans have faced over their long and tumultuous history, questions about who they are and to what do they owe allegiance. Their 2007 album, \"45 Cerebros Y 1 Corazón,\" or \"45 Brains And One Heart,\" was a big hit in Spain and throughout Europe.\nNow, the duo is bringing their music to the U.S. as part of the Smithsonian Folklife Festival on the National Mall in Washington, D.C. Catalan culture is a focus of the festival this year. Maria Arnal and Marcel Bages are here with us in our studios in Washington, D.C., to share some music with us. Thank you both so much for coming in today to see us.\nMARCEL BAGES: Thank you for inviting us.\nARNAL: Thank you so much.\nMICHEL MARTIN, HOST:\nSo let's just jump right in and give us a taste of what has been selling out shows all over Europe. What are you going to play?\nARNAL: We're going to play a part of the song that gives name to our first album called \"45 Cerebros Y 1 Corazón.\" It's a song that speaks about these 45 brains.\nMARTIN: Don't tell us. Don't tell us. Just sing the song and then we're - then we're going to give the reveal. Don't reveal all. Let's just let it unfold. OK.\nARNAL: Nice.\nARNAL: (Singing in Spanish).\nMARTIN: Wow. Well, that is a perfect example. You are known for your exquisite musicality but also for tackling some very difficult subjects, and the song that you just performed for us is a perfect example. It sounds like this lovely metaphor for community coming together, but in fact, this is a reference to a very - I don't know how else to say it - a heartbreaking discovery of - last July of a mass grave of people shot and killed by General Francisco Franco during the Spanish Civil War - 45 brains and one heart were, in fact, found preserved in that mass grave. Were you immediately inspired to write a song about this when you learned of this?\nARNAL: I read it, and I knew this is a song. This is something I could write about. And we didn't want to relate with this material from the past in terms of romanticism or nostalgia. We were much more interested in this uncomfortable past on our present is built.\nMARTIN: You've said - and I've read in other interviews that you said that the Spanish Civil War, this part of the country's history is something that people still have trouble talking about even 80 years later. Do you think that your music, in a way, allows people to talk about - or even perhaps forces people to talk about it?\nARNAL: This is really how it is, because we chose to have this title for the album in order to be able to make it like obligated not like...\nMARTIN: Front and center.\nARNAL: Yeah, and somehow putting light on this taboo. It is a taboo because it is really like needed to be a taboo, otherwise we would have to look for responsibilities. And responsibilities are on - many people still alive with a lot of power.\nMARTIN: I'm curious about when you perform it in concert, particularly in Spain. What is the reaction?\nARNAL: The reaction - it's - it has been changing, you know. In the beginning it was - I mean, we've been very lucky. And people that follow our project understands our way of relating with these topics.\nMARTIN: But what about your own families, I'm curious, like your parents, your grandparents?\nARNAL: Yes, for example, my grandparent was in jail. And I didn't know about anything of the experiences of my grandparents, grandmothers until when I started to ask for it, you know. And, yeah, I had also like an uncle from my grandmother that was in the Francas (ph) band. My grandmother was in a refugee camp in France for children. She never spoke about this in all her life. You know, it's, I mean, it's still two or three generations. It's not anymore else, you know. And it's - I think it's also a global way of starting to think critically, you know, in terms of power, you know, in terms of (unintelligible), also racism. It's about also sharing different fights. And this is the distance from which we create, and we relate when we play also.\nMARTIN: I mentioned earlier that there is a tradition of folk singing in a Catalonia that it's part of a culture. I mean, is this something that you grow up with? Like, how do you experience it?\nARNAL: You mean like some...\nMARTIN: The folk tradition - the folk traditions.\nARNAL: Yeah. Well, I must say we grew up with lots of different musics. Many of them were from USA also - USA, I would say. And...\nMARTIN: Jackson 5, of course.\nARNAL: Yeah, of course.\nMARTIN: Jackson 5, of course\nARNAL: Of course. It was later when I started like asking to myself, what was the music that was sung here? Is there any like specific music from here? But it was through internet that I was discovering all these archives with field recordings and sounds from Spain, and this is how it work through archives, through internet. And we know that this way of classifying music regionally and also nationalistically, it's not - it's nothing that we are interested in more in the opposite like opening this music and creating with other musics all over the world.\nMARTIN: On the other hand, though, this is a very specific political moment both in your country and frankly in lots of countries. But last year, this referendum for independence passed and it was immediately declared illegal by the Spanish government. There were massive protests. There was violence. There were many arrests. And I'm wondering if that has changed something for you as artists. I have to ask, do you feel a responsibility to be perhaps even more outspoken? How do you see yourselves in this moment?\nARNAL: Well, I think it's been really like a hard time, and I was trying to open up some of the most important issues that for me are not related to nationalism but to social topics, to social things that are real problems. For me, it's about like creating this counter movement, you know, that already exist like speaking about double things, speaking about who has the power, who has not the power, speaking about all these topics, you know. I mean, it's our thing. We are here to speak with our voices about all these topics. And of course, there will be always people that will not like it, but I don't care.\nMARTIN: Thank you for coming. Is there - I know you're going to sing one more song for us. What are we going to hear?\nARNAL: This is a very nice song. The one that appears in the album. It's more like electronic, and it has the electric guitar. We are going to do this version that is acoustic now. And it's a love song with no gender.\nMARTIN: And this is called?\nARNAL: \"Tu Que Vienes A Rondarme.\"\nMARTIN: Which means?\nARNAL: Either come to round me like planet, you know. How would you say this? So if I am here and you come and you circle me like this?\nMARTIN: You who orbits me or...\nBAGES: Orbits me...\nARNAL: Yeah, it could be.\nMARTIN: OK, that's good.\nARNAL: But in Spanish, it's like an old way of saying flirting.\n(Singing in Spanish).\nMARTIN: That's Maria Arnal and Marcel Bages, the Catalan folk duo. We caught up with them when they were in Washington, D.C., as part of the Smithsonian Folklife Festival. Their album is \"45 Cerebros Y 1 Corazon,\" \"45 Brains And One Heart.\"\nARNAL: (Singing in Spanish).\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=626573802"}
