{"authors":["Nuzha Nuseibeh"],"date_download":"2018-10-30 22:56:58","date_modify":"2018-10-30 22:56:58","date_publish":"2014-08-14 15:07:56","description":"Stun grenades, tear gas, smoke bombs — no, this isn't a description of Gezi Park in Turkey, or of Shufat, East Jerusalem. This is Ferguson, Missouri, the epicenter of an escalating crisis involving yet another unarmed black man, Mike Brown, being…","filename":"data/vaneerConsumption/FollowingFergusonProtestsPalestineTurkeysOppressedCitizensPledgeTheirSupport.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b04a2f93-a7b1-4468-84e7-1893194b6324.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35754-following-ferguson-protests-palestine-turkeys-oppressed-citizens-pledge-their-support_1540940218.html","title":"Following Ferguson Protests, Palestine & Turkey's Oppressed Citizens Pledge Their Support","title_page":"Following Ferguson Protests, Palestine & Turkey's Oppressed Citizens Pledge Their Support","title_rss":"NULL","source_domain":"bustle.com","text":"Stun grenades, tear gas, smoke bombs — no, this isn't a description of Gezi Park in Turkey, or of Shufat, East Jerusalem. This is Ferguson, Missouri, the epicenter of an escalating crisis involving yet another unarmed black man, Mike Brown, being shot by a police officer. The ensuing protests have brought forth a shocking display of force from the police; this has, of course, only served to further destabilize the already precarious situation. Last night, journalists covering the scene were arrested. There's no sign of it calming down any time soon.\nThis is, of course, a familiar landscape for many, especially within the Arab world. What's unfamiliar, perhaps, is the reaction — those who have faced police brutality, tear gas, stun grenades, and more, in the stereotypically oppressed parts of the world, are reaching out to the protestors in Ferguson via social media. From Palestine, people are tweeting advice: \"Remember to not touch your face when teargassed or put water on it. Instead use milk or coke!\" one user told Missouri demonstrators. From Turkey, others are tweeting support: \"Turkey stands with you #Ferguson. Enough with the US Police brutality!!! What's the point in shooting tear gas to peaceful protestors?\"\nFrom Greece to Palestine to Egypt, protesters have repeatedly dealt with police brutality of varying types and degrees— and been rightfully condemned for doing so by the U.S. government. When Turkey erupted in demonstrations in June 2013, White House spokeswoman Jen Psaki said “we have had concerns over the past couple of days about instances of police brutality, and we continue to call for, of course, the acceptance of peaceful protests.”\nWhen the Tahrir Square protests in Cairo, Egypt escalated in 2011, President Barack Obama had this to say:\nI want to be very clear in calling upon the Egyptian authorities to refrain from any violence against peaceful protesters.The people of Egypt have rights that are universal. That includes the right to peaceful assembly and association, the right to free speech, and the ability to determine their own destiny. These are human rights. And the United States will stand up for them everywhere.\nThe statements sound less heartwarming now, perhaps, but rather than grabbing onto angry buzzwords (\"hypocrisy,\" \"irony,\" \"posturing\"), maybe what we should focus on is the fact that this — heavy protests, police brutality – happens. No matter how safe or free your country. But no matter where it happens, there will be others out there, voicing their support.","url":"https://www.bustle.com/articles/35754-following-ferguson-protests-palestine-turkeys-oppressed-citizens-pledge-their-support"}
