{"authors":[],"date_download":"2018-10-30 14:32:44","date_modify":"2018-10-30 14:32:44","date_publish":"2015-04-12 00:00:00","description":null,"filename":"data/vaneerConsumption/Foodstampsforablebodiedchildlessadultsdown80inMainefollowing6hrweekworkrequirement.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_foodstamps_for_able_bodied_childless_adults_down_80_in_maine_following_6_hrweek_work_requirement_1540909964.html","title":"Foodstamps for able bodied childless adults down 80% in Maine following 6 hr/week work requirement","title_page":"Foodstamps for able bodied childless adults down 80% in Maine following 6 hr/week work requirement","title_rss":"NULL","source_domain":"americanthinker.com","text":"The food pantry here, just off the main drag in this neat college town, gets busiest on Wednesdays, when the parking lot is jammed and clients squeeze into the lobby, flipping through books left on a communal shelf as they wait their turn to select about a week’s worth of food.\nFoodstamp enrollment by able bodied childless adults in Maine (which has a conservative Republican governor) is down 80% after imposing a very modest requirement that recipients work at least 6 hours a week in a volunteer program. Of course, the media portrays this as an exercise in cruelty.\nThe Mid Coast Hunger Prevention Program is intended to be a supplemental food pantry, but a growing number of clients here and at pantries around the state have little else to rely on because of a change in state policy this year.\nThese are the leeches who don't want to even work 6 hours a week for their check.\nLast year, the administration of Gov. Paul R. LePage, a Republican, decided to reimpose a three-month limit (out of every three-year period) on food stamps for a group often known as Abawds — able-bodied adults without minor dependents — unless they work 20 hours per week, take state job-training courses or volunteer for about six hours per week. The number of Abawds receiving food stamps in Maine has dropped nearly 80 percent since the rule kicked in, to 2,530 from about 12,000. “It means life gets tougher for those childless adults who face barriers already getting back into work,” said Ed Bolen, a senior policy analyst at the Center on Budget and Policy Priorities. He said those adults tended to have limited education and faced a postrecession labor market in which many people who want to work still cannot find jobs\nPlease pass me the world's smallest violin. They don't have to get jobs. They just have to volunteer six hours a week.\n“If the job situation in the area is a really a tough situation, this is an incredibly harsh provision,” said Ellen Vollinger, the legal and food stamp director for the Food Research and Action Center. “There’s going to be harm, and it’s going to show up in greater hunger\nEllen is overlooking the fact, just stated above, that they don't have to get a job. They just have to volunteer six hours a week.\nAround the country, food pantry directors are girding for an influx of hungry adults as the work requirement re-emerges.\nThis I believe. The parasites will gravitate to wherever the no-strings-attached free food can be found.\n“We’re going to run out of food,” said Sherrie Tussler, the executive director of the Hunger Task Force Milwaukee. “It’s going to cause wide-scale hunger here in Milwaukee, and we’re in trouble.”\nDo you think the hunger pangs will be strong enough to get these people to volunteer for six hours a week?\nJackie Dulack, 38, picked up bread and pork at the Brunswick pantry,\nI love how they call these places \"pantries,\" in order to be cute or elicit sympathy. They're not part of someone's kitchen; they're grubby homeless shelters, filled mostly with drug addicts, mentally ill people, and people too lazy to work (with some natural overlap between categories).\nand had no plan for when the food ran out. Ms. Dulack, who said she was unemployed and had no income, received a letter from the state last fall saying she would lose her food stamps if she did not meet the work requirement. She said that her food stamps had since been cut off and that the general assistance office had told her that she would need to be working to get them back.\nNo where does it say in the article what her objection to volunteering six hours a week is. The article simply presumes she will starve.\nLet's face it, 80% of the able bodied childless adults in Maine on Foodstamps didn't need it. Truly hungry people would eagerly volunteer six hours a week for free food. I suspect this 80% figure applies nationwide. Sure, you'll see photos of long lines at \"pantries,\" but most on line will simply be parasites getting their free food, to lazy to work even six hours a week for it.","url":"https://www.americanthinker.com/blog/2015/04/foodstamps_for_able_bodied_childless_adults_down_80_in_maine_following_6_hrweek_work_requirement.html"}
