{"authors":[],"date_download":"2018-10-30 20:33:44","date_modify":"2018-10-30 20:33:44","date_publish":"2014-08-08 14:19:38","description":"Food, beverages and “specialty retail offerings” may be coming soon to a select MARTA station near you.","filename":"data/vaneerConsumption/FoodbeveragescomingtoselectMARTAstations.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/08/08/Images/photos.medleyphoto.5907383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_food-be_93f571b133acdf2b26672e24188de38d__1540931624.html","title":"Food, beverages coming to select MARTA stations","title_page":"Food, beverages coming to select MARTA stations","title_rss":"NULL","source_domain":"ajc.com","text":"Food, beverages and “specialty retail offerings” may be coming soon to a select MARTA station near you.\nThe station locations where patrons will be able to grab snacks or do some light shopping are still to be decided, as is the mix of products. MARTA said in a press release that it will partner with real estate firms Greystone Management Solutions and Smith Real Estate Services to develop the vending program. Greystone has provided similar services to transit agencies in New York and Boston.\n“We look forward to receiving food, beverage and retail concepts that will help create a sense of place in and around MARTA rail stations and improve the overall experience of our customers,” MARTA CEO Keith T. Parker said.\nThe program is designed to bring a new stream of revenue to the transit agency and improve amenities for MARTA customers, said Charles Di Maggio, Chief Operating Officer of Greystone Management Solutions.\nIn addition, MARTA is seeking bids from companies interested in a six-month pilot project to provide food truck concessions at its Vine City station during Georgia Dome events, including the upcoming Atlanta Falcons football season.","url":"https://www.ajc.com/news/transportation/food-beverages-coming-select-marta-stations/o7WsIeIEUdmpt3BOhnvAhK/"}
