{"authors":["Courtney Collins"],"date_download":"2018-10-23 00:52:36","date_modify":"2018-10-23 00:52:36","date_publish":"2016-11-07 00:00:00","description":"Simply shuffling the shelves may be a powerful way to help those living in poverty choose healthier options, a nationwide study of food banks suggests.","filename":"data/vaneerConsumption/FoodPantriesTryNutritionalNudgingToEncourageGoodFoodChoices.json","image_url":"https://media.npr.org/assets/img/2016/11/07/gettyimages-506728542_wide-fad2bda7a79b3db32e1d62c355ac22fa74172988.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2016_11_07_499325457_food-pantries-try-nutritional-nudging-to-encourage-good-food-choices_1540255956.html","title":"Food Pantries Try Nutritional Nudging To Encourage Good Food Choices","title_page":"Food Pantries Try Nutritional Nudging To Encourage Healthy Eating : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Food Pantries Try Nutritional Nudging To Encourage Good Food Choices\nEnlarge this image toggle caption Portland Press Herald/Press Herald via Getty Images Portland Press Herald/Press Herald via Getty Images\nYou see \"nudging\" all of the time at the grocery store, but you probably don't realize it. Think 12-packs of soda stacked in a pyramid near the register, or tortilla chips and salsa placed side-by-side at the end of an aisle.\n\"Nudging\" — a sales tactic that tries to make food look more appealing and easy to reach — encourages people to buy something. And as several food banks around the country have been learning, the tactic works well.\nSharing Life Community Outreach in Mesquite, Texas, looks more like a small grocery store than a food pantry. Its two aisles offer more than canned goods and dried beans. The shelves are loaded with chicken, greens, cauliflower and fresh berries.\n\"Cilantro, I want some cilantro,\" says Shelecia Morris, as she bypasses the bread, cookies and potatoes. She's also loading up on eggs, poultry and fruit.\nMorris has been to Sharing Life many times and says she eats better because of it: \"I look at the different brands that they have, like the organic. I found out that it's very good, so I try to eat as healthy as I can with what I can get.\"\nOne swap she recently made? Whole wheat pasta instead of regular.\n\"It just looked good, so ... why not?\" she says.\nWhole wheat pasta just happens to be one of the foods Sharing Life is \"nudging.\" It has a prominent spot on the shelf, where it's easy to see and grab. Signs touting its health benefits hang nearby, explaining how whole grains may improve cholesterol and lower the risk of diabetes.\n\"Our goal is to try to educate people and not just shove a package of whole wheat spaghetti in their car and say, 'try to deal with this,'\" says Teresa Jackson, executive director of Sharing Life. \"We know it tastes different. We want them to understand why we want them to take this product.\"\nSharing Life and a dozen other food pantries in Texas, New Jersey and Colorado participated in a study conducted by Cornell University and Feeding America, where Christine Rivera is a registered dietitian.\nRivera describes \"nudges\" as \"cues that help us make decisions, especially in our food environment.\"\nSometimes a nudge is as simple as putting food like brown rice in two different spots, and leaving the white rice on a single shelf.\nFor the study, a short list of \"foods to encourage\" was compiled: whole wheat bread, oatmeal, onions, cabbage, oranges and carrots.\nCabbage bins were elevated, so people wouldn't have to stoop. Glossy photos of oranges were hung in food pantry waiting areas. Boxes of oatmeal were stacked next to a sign that said \"Fills you longer,\" in both English and Spanish.\nThe end result? \"Nudging\" led to a 46 percent increase in people taking home at least one of the featured foods.\nIt's not a highly technical tactic, but Sharing Life has research that proves it's working.\n\"At the beginning of the project, we only had about 14 percent of our clients willingly taking the brown rice and the brown pasta,\" Jackson says. \"But after we created these nudges, it went from 14 to 44. As they've tried new things, that makes them more willing to try new things in the future.\"\nMorris is proud to count herself as one of the converts.\n\"I really appreciate just being able to come in to get food, because sometimes you don't know where you're going to get it from,\" she says.\nPeople living in poverty don't always have a lot of choices when it comes to putting food on the table, but the study suggests that \"nudging\" may not only help change mealtime, but overall wellness.","url":"https://www.npr.org/sections/thesalt/2016/11/07/499325457/food-pantries-try-nutritional-nudging-to-encourage-good-food-choices"}
