{"authors":["Imogen Blake For Mailonline"],"date_download":"2018-10-23 01:26:45","date_modify":"2018-10-23 01:26:45","date_publish":"2017-04-26 11:53:30","description":"The Pink Lady Photographer of the Year awards were held last night in central London and the photographs showcase the beauty of food - and how it can bring people together.","filename":"data/vaneerConsumption/FoodPhotographerofYearAwardscelebratefreshproduce.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F2B3200000578-0-image-a-90_1493203986457.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-4446704_Food-Photographer-Year-Awards-celebrate-fresh-produce_1540258005.html","title":"Food Photographer of Year Awards celebrate fresh produce","title_page":"Food Photographer of Year Awards celebrate fresh produce | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An elderly grandmother cooking, a laughing family sharing food, and a fork dipping into gooey macaroni cheese: these stunning images of meals and the people who have lovingly made them have been named as the best food images this year.\nTaken all over the world, the photographs showcase how beautiful food can be in all its forms - and how it can often be used to bring people together.\nThe beautiful and often salivating pictures have all won honours at this year's Pink Lady Food Photographer of the Year awards, which was held last night in central London.\nThe annual competition had more than 8,400 entries from photographers of all ages based in 60 countries, which was whittled down to just 30 winning images.\nAmong the best photographs was an image of a Brahman cook - a member of the highest Hindu caste - preparing religious food for a sea of worshippers about to break a 24-hour fast.\nThe picture - Food for God by Shoeb Faruquee - went on to be crowned Overall Winner, with the photographer taking home a £5,000 cheque handed to him by Pink Lady's managing director, Andy Macdonald.\nA Brahman cook makes religious food for devotees to break their 24 hours long fast after special prayers in Bangladesh. During this prayer, followers of the Hindu Saint Baba Lokonaths burn ghee in a small clay pot. This photograph - Food for God by Shoeb Faruquee - was crowned Overall Winner and also won in the Food for Celebration category at the Pink Lady Food Photographer of the Year 2017 awards\nMany families work together in the rice fields in Nepal. During their break time, everybody shares their food in a huge circle on the rice field. Photographer Leonardo Salomao, who won in the Food for the Family category, captured that moment\nBritish photographer Matthew Thomas photographed pheasants after they had been shot on a UK country estate. They were on their way to be returned to the Great House. His image, Pheasants at Sunset, won in the Bring Home The Harvest category\nUK photographer Sally Ann Stone called this image 'Swiss Chard Forest' as the stalks of the brightly coloured vegetable truly resemble a mighty wood. She won in the Food in the Field category\nThis puts your Instagram food shots to shame! British photographer Darren Eastwood-Hickson won in the Marks & Spencer Food Portraiture category for this mixed leaf salad and tomatoes in a metal bowl against a paint splattered background\nBritish photographer Laura Cook shot the feet of seven-year-old Diana and her little sister Nina as they waited impatiently for their fish stew to cool down in Tole, Cameroon. Her image, Waiting for Stew, won in the Food Sn-Apping category in aid of Action Against Hunger\nEvery two weeks, in the refugee camps near Tindouf in Algeria, women collect egg rations distributed by the Sahrawi Red Crescent. The majority of Sahrawis are refugees today in one of the harshest desert environments in the world, their homeland of Western Sahara is the last colony in Africa and the site of a protracted territorial dispute. The image, Collecting Egg Rations by British photographer Emma Brown, won in the World Food Programme For Life category\nItalian photographers Francesca Brambilla and Serena Serrani beuatifully captured this elderly grandmother concentrating intensely as she stirs a pot in a three-star Michelin kitchen in Italy. They won The Philip Harben Award for Food in Action\nJean Cazals won in the Intercontinental London Park Lane Food at the Table category for this image of the 'perfect mc'n'cheese with the strings to go with it' in a copper pot\nBritish photographer Mick Rock was named the Errazuriz Wine Photographer of the Year in the People category for this stunning image of a port barrel being cleaned\nBritish photographer Robin Stewart, from Crouch End, shot this charming image of a family sharing food at the Indo-American festival in Crouch End last summer\nBritish photographer Jonathan Gregson won in the Production Paradise Food off the Press category for this beautiful image of vegetables, which graced the cover of Waitrose Food magazine in January\nPhotographer Kyriacos Arkatites, from Cyprus, said of this image: 'At the little and idyllic Paphos harbour in Cyprus, there are a few restaurants along the walkway. While passing by with my little children, we could not resist the view of the variety of fresh sea \"goods\" in the freezer. And the kids kept getting excited with their \"discoveries\"'. He won in the Marks & Spencer Food Adventures category\nYoungster Lily-Mae Franklin won in the 11-14 age category for her 'Flowering Tea' image of a pot of Japanese Flower Tea\nBelgian photographer Wesley Dombrecht's stunning image of a smoked mackerel in the process of being smoked won in the Cream of the Crop category\nBritish photographer Azalea Dalton stood at the top of the tower in Villefranche to get this bird's eye view of the Villefranche market stalls in the main square of the French town\nGerman youngster Felicia Frank won in the 15-17 age category for this close-up of a cow grazing on grass. She said: 'This picture came about on a beautiful hike in the Alps. Feeding those hungry cows with grass with one hand and taking pictures with my other hand I was just hoping to get a nice picture'\nFrench photographer Patrick Desgraupes gives an insight into the rosé wine making process with this colourful image: 'Rosé Wine Tank'. He won Errazuriz Wine Photographer of the Year in the Places category\nSouth African food blogger Hein Van Tonder won in the Food Bloggers category for this salivating image of caramel being poured over a baked chocolate pudding\nCould this image be any more symbolic of the British country elite? These wealthy hunters have lined up for a portrait taken by Tom Parker in front of their bagged birds at the end of a shoot that costs £50,000 to take part in. The British photographer won in the Politics of Food category\nUS photographer Robert Holmes was named Errazuriz Wine Photographer of the Year in the Produce category for his image 'Crush at Cristom Vineyards' which shows part of the wine-making process at a vineyard in Oregon","url":"https://www.dailymail.co.uk/femail/food/article-4446704/Food-Photographer-Year-Awards-celebrate-fresh-produce.html"}
