{"authors":["David Gorn","Matt Levin"],"date_download":"2018-10-30 22:38:24","date_modify":"2018-10-30 22:38:24","date_publish":"2018-07-17 21:16:50","description":"A pilot project uses diet to improve the health of people with congestive heart failure—and save the state millions of dollars.","filename":"data/vaneerConsumption/FoodfortheheartinanewCaliforniahealthprogram.json","image_url":"https://calmatters.org/wp-content/uploads/making-food-bags-2-e1531782664449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939104.html","title":"Food for the heart in a new California health program","title_page":"Food for the heart in a new California health program | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Sharon Quenton is feeling pretty good. She’s walking well, breathing well and feels like she’s going to be just fine.\nThe 67-year-old is three weeks removed from her latest trip to the hospital for problems related to congestive heart failure, a condition in which the heart can’t pump properly. That was scary, she said.\n“I had water around my heart. I had to go to the hospital a few times,” Quenton said. “My breathing was acting crazy. But now, I’m cool. I’m all right.”\nOne reason she’s better, she said, is the two large grocery bags that just arrived at the front door of her little apartment in southwest Los Angeles—part of a new state experiment using diet to improve the health of congestive heart failure patients.\n“So I have two bags for you. All your meals for the week,” delivery volunteer Susan Coleman told her. “Now, some of them are frozen …. They should go in the freezer.”\n“Oh yeah, this is good stuff,” Quenton said as she unpacked everything. “It’s wonderful to get it.”\nQuenton is one of those enrolled in a $6 million pilot project authorized last year by the Legislature and Gov. Jerry Brown. Run by the state Department of Health Care Services, it was launched in seven counties for 1,000 congestive heart failure patients in Medi-Cal, the state’s version of federal Medicaid care for the needy.\nThe move is part of California’s push to save millions of dollars by making people healthier and reducing chronic illness, along with the expense of treating it. Taxpayers foot the health care bill for about a third of the state’s residents.\nPatients recently home from the hospital get some nutrition counseling and 12 weeks of homemade, heart-healthy meals with lots of fresh ingredients delivered to their doorsteps. The food is low in salt and carbohydrates, to reduce inflammation and keep the body from retaining excess water that puts extra pressure on the heart. State health officials are monitoring the patients to measure any decline in hospital admissions and emergency-room visits.\nThe pilot program is modeled on a smaller Philadelphia project known as MANNA. That study, which included other chronic conditions in addition to heart failure, showed a nearly 30 percent drop in per-patient medical costs.\nThe American Heart Association estimates that 5.7 million people nationwide have congestive heart failure. Hundreds of thousands of them live in California. About 105,000 Medi-Cal patients have heart failure as a primary diagnosis, state officials say.\nThe new pilot program is important because heart failure patients “consume a lot of health care expenses,” said John Baackes, CEO of the L.A. Care Health Plan, which has helped implement the project.\n“Particularly in Medi-Cal, where dollars are precious,” Baackes said, “if we can demonstrate that providing meals to people with congestive heart failure reduces their readmission rates in the hospitals, that would be a great step forward.”\nCongestive heart failure causes some of the highest hospital readmission rates, said Cathryn Couch, CEO of the Ceres Community Project, a food nonprofit in the Sonoma County city of Sebastopol and another participant in the pilot program. Couch is convinced food will lead the next wave of treatment options in medicine.\n“We need to connect the dots and look at what we’re spending on health care. We should be making food a normal part of health care. Food needs to be considered a health care intervention.”\nThe test program is expected to yield data vital to the shaping of health policy, Couch said, and will carry significant weight if results are similar among the seven counties (Alameda, Marin, San Diego, San Mateo and Santa Clara, in addition to Los Angeles and Sonoma).\n“What’s missing here is big enough research to make policy changes,” she said. “Generally the studies have come from one agency, with a fairly small sample size, and we need to tell a bigger story.”\nCalifornia’s new program is the biggest of its kind in the nation, Couch said, “and the information will be fed directly into the Medi-Cal database, so it’ll be easy to look at utilization and cost.”\nSavings of even $1,000 per person in this pilot project would save the state $10 million, she said. “And if you scale that up to all congestive heart failure patients, or if you’re able to expand it to other chronic conditions, then you’re talking a lot of money saved,” Couch said, citing cancer, obesity, stroke and other ills.\nHow much the state could save by expanding a program like this one to all Medi-Cal patients with chronic conditions would depend at least partly on participation rates, something the pilot project is not tracking.\nIn the meantime, “congestive heart failure doesn’t really go away, but you can prevent it from getting worse,” said Katelyn Tran, nutrition services manager at Project Angel Food in Los Angeles, which delivers fresh fruit, vegetables and a week’s worth of frozen meals in the county’s pilot program.\nTran sometimes helps with deliveries, to meet patients and find out what else is in their pantries and whether their refrigerators can store enough produce. Tran said she sees every day that “fruits and vegetables can heal….With the right food, you’re going to stay away from the hospital.”\nThe three-year program started in April. Patients are still being signed up through physician referrals, and word about the program is still getting around.\nNobody can monitor everything the participants eat. But Tran said she has seen how much the free meals mean to those who receive them. And after years of delivering food to low-income people across Los Angeles, she has seen how much better good food makes them feel and look. She said she has seen people get their lives back.\nEating healthy takes a lot of planning, she added, but once you show people how to do it, it becomes much easier. And that, Tran said, has the potential to carry through the rest of their lives.\nThis is the second article in a series on state efforts to foster healthy living as a way to reduce chronic illness. Listen to the radio version.\nCorrection: This article has been updated to correct the name of Cathryn Couch, CEO of the Ceres Community Project, and to clarify the L.A. Care Health Plan’s role in helping to implement the pilot project.","url":"https://calmatters.org/articles/food-for-the-heart-in-a-new-california-health-program/"}
