{"authors":[],"date_download":"2018-10-22 22:02:56","date_modify":"2018-10-22 22:02:56","date_publish":"2014-05-08 21:45:52","description":"A national food industry group says it will file suit in federal court within weeks challenging Vermont's new law that requires GMO labels.","filename":"data/vaneerConsumption/FoodIndustrytoSueoverVermontGMOFoodsLaw.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/430361/140508-gmo-crops-jms-1736_d470ac24505711e95467ae21919a2cc8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_food-industry-sue-over-vermont-gmo-foods-law-n100791_1540245776.html","title":"Food Industry to Sue over Vermont GMO Foods Law","title_page":"Food Industry to Sue over Vermont GMO Foods Law","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA national food industry group says it will file suit in federal court within weeks challenging Vermont's new law that requires labels on genetically modified foods.\nThe Grocery Manufacturers' Association said Thursday, the same day the Vermont governor signed the law, that government has no compelling interest in warning consumers about foods containing genetically modified ingredients. The national group maintains the foods are not unsafe.\nBut Vermont lawmakers said they crafted the legislation to withstand a legal challenge.\nAnd the governor announced a new website to raise funds to help the state fight any court battles.\nAmericans overwhelmingly favor such requirements for foods containing genetically modified organisms, but the industry fears a patchwork of state policies.\nThe Vermont bill says genetically modified foods \"potentially pose risks to health, safety, agriculture, and the environment\" and includes $1.5 million for implementation and defense against lawsuits expected from the food and biotech industries.\n- Associated Press","url":"https://www.nbcnews.com/business/business-news/food-industry-sue-over-vermont-gmo-foods-law-n100791"}
