{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 02:17:15","date_modify":"2018-10-23 02:17:15","date_publish":"2017-04-26 13:16:05","description":"Jose Castellano-Gonzales, 25, from Tenerife, advertised himself as an au pair, using the glamour of his career in Spain to attract families with football-mad sons.","filename":"data/vaneerConsumption/Footballerworkedasnannysohecouldabuseboys.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F502900000578-0-image-a-16_1493208364968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447570_Footballer-worked-nanny-abuse-boys_1540261035.html","title":"Footballer worked as nanny so he could abuse boys","title_page":"Footballer worked as nanny so he could abuse boys | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sick Jose Castellano-Gonzales, 25, from Tenerife, advertised himself as an au pair, using the glamour of his career in Spain to attract families with football-mad sons\nA Spanish ex-professional footballer who came to Britain to work as a male nanny so he could abuse young boys was jailed today for 11 years.\nPaedophile Jose Castellano-Gonzales, 25, from Tenerife, advertised himself as an au pair and used the glamour of his former career in Spain to attract families with football-mad sons.\nA Devon family employed him in 2015 because they thought his experience in the sport would help him relate to their sons.\nBut Castellano-Gonzales went on to abuse four schoolboys.\nHe also sexually assaulted a fifth child when he was hired by a second family in Bedfordshire.\nSome of the offences happened when he was playing Fifa computer games with the boys and put his hand inside their trousers or pyjamas.\nBefore moving to Britain he had worked in Italy but was sacked amid concerns about his behaviour towards his employers' two sons.\nThe mother in Italy traced the family in Devon to alert them but by then it was too late.\nCastellano-Gonzales denied 13 sex assaults - two involving penetration - involving five boys aged eight to 11 but was convicted by a jury at Exeter Crown Court.\nThe families of his victims wept as he was found guilty - and then gasped as he continued to protest his innocence yesterday.\nCastellano-Gonzales, wearing a tracksuit, appeared without a lawyer because his family could no longer afford to pay for one.\nAsked by Judge Geoffrey Mercer if he had anything to say before he was sentenced he replied: 'Simply that I'm innocent.'\nJudge Mercer told him: 'You clearly have a sexual interest in young boys. To describe what you did as a breach of trust is a gross understatement.\n'The damage you have caused is untold and what you did has totally understandably had profound effects on whole families.'\nThe court heard that Castellano-Gonzales was 'immature' and 'described by some as being almost childlike'.\nHe was a professional footballer for the B Team at Tenerife at a time when the A team were playing the likes of Real Madrid and Barcelona.\nCastellano-Gonzales was emotionless as his interpreter told him he would serve 11 years in prison. He was told that he would have to serve a further year on licence.\nHe was also given a sexual harm prevention order barring him from interacting with boys under the age of 16.\nWhen the details of the order were explained he asked the judge: 'Is this order just for the UK?'","url":"https://www.dailymail.co.uk/news/article-4447570/Footballer-worked-nanny-abuse-boys.html"}
