{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:23:16","date_modify":"2018-10-30 19:23:16","date_publish":"2016-07-16 00:00:00","description":"FAYETTEVILLE - Bentonville West may be in its inaugural season, but it is already establishing a reputation with its opponents.","filename":"data/vaneerConsumption/FootballBentonvilleWestscardiackidsgo52atSouthwestElite7on7.json","image_url":"https://media.arkansasonline.com/img/photos/2016/07/16/107018895_AN-FBH-SWEST-7ON7-005_ORIG_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jul_16__1540927396.html","title":"Football: Bentonville West's 'cardiac kids' go 5-2 at Southwest Elite 7-on-7","title_page":"Football: Bentonville West's 'cardiac kids' go 5-2 at Southwest Elite 7-on-7","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Will Jarrett of Bentonville West throws against Broken Arrow, Okla., on Fridayduring the Southwest Elite 7-on-7 Tournament at Fayetteville High School. - Photo by Anthony Reyes\nFAYETTEVILLE - Bentonville West may be in its inaugural season, but it is already establishing a reputation with its opponents.\nThe Wolverines went 5-2 in Pool D of the Southwest Elite 7-on-7 Showcase at Fayetteville, with three of their victories decided by six points or fewer.\nSouthwest Elite 7on7 at Shiloh Christian Bracket play Today Centennial BYE - Jenks Bentonville West vs. Springdale Har-Ber JV, 9:30 a.m. Everett Marion vs. Rogers Heritage, 9 a.m. Shiloh Christian vs. Gibson Southern, 9:30 a.m. McAlister’s Bentonville High vs. Bishop Kelley, 9 a.m. Fort Smith Northside vs. Springdale High, 9:30 a.m. Skycoach Bishop McGuinness vs. Stillwater, 9 a.m. Midwest City vs. Rogers High, 9:30 a.m. Igloo Bixby vs. Coweta, 9 a.m. Heritage Hall vs. Liberty Tech, 9:30 a.m. BSN Sports Broken Arrow vs. Alma, 9 a.m. Aurora Christian vs. Fayetteville JV, 9:30 a.m. Russell Derby vs. Elkins, 9 a.m. DeSoto Central vs. Little Rock Christian, 9:30 a.m. Chick-fil-A Deer Creek vs. Moore, 9 a.m. Lutheran North vs. Mill Valley, 9:30 a.m.\n\"I had a couple coaches that I know from Oklahoma come up and say, 'You guys are the cardiac kids. You never give up and always hang around,'\" West coach Bryan Pratt said. \"That's the kind of mentality we give our kids.\"\nA six-point win over 2015 Oklahoma Class 6A-I runner-up Broken Arrow was followed by a one-point win over Little Rock Christian to start the day. West dropped a 20-12 decision to Derby before rattling off three straight wins, including a two-point win over Stillwater.\nHowever, with a chance to wrap up the No. 2 seed out of Pool D, the Wolverines lost to Midwest City, 27-7. West scored on its first possession, but gave up 27 unanswered points to end the day.\n\"I'm not going to complain at all,\" Pratt said. \"I would have liked that one to be a little better, but I couldn't be more pleased with the way our kids played early.\"\nWest played some 7-on-7 while at team camp at Tulsa University earlier this summer, but this is its first tournament. It gave Pratt's senior-less team an opportunity to play the \"big boys.\"\n\"We're just trying to get them ready for the speed of the game they're going to play at,\" Pratt said. \"We're coming to events like this to try to get them used to that. The speed here was really fast today.\"\nOne of those players is sophomore quarterback Will Jarrett.\nAs a freshman, Jarrett led the Bentonville Gold junior high team to an 8-1 record. More importantly, though, he played under Pratt, learning the offense. Now he's trying to hone those skills against better competition.\n\"That helps out a lot,\" Jarrett said. \"Going into the spring, I already knew most of the plays and formations. (7on7) helps because you get a lot of reps and read your receivers better.\"\nWhile West slipped to third, Derby won the pool with a 7-0 record. The only other team to finish the day with a perfect record was Bixby, which ended Friday with a 27-21 win over Shiloh Christian in a battle of unbeatens to clinch Pool B.\nThe Saints averaged 33.5 points per game going into the contest and held a 21-12 lead, but a late interception by Connor Reece -- his only one of the day -- ultimately cost them a chance at the No. 1 seed.\n\"We were just trying to run the clock out and their kid made an unbelievable interception,\" Shiloh Christian coach Jeff Conaway said. \"That tied the game up. We had the game. We just let them chip away and they came back and beat us.\"\nThe other two pools came down to tie-breakers. Jenks and Aurora Christian each went 6-1, but Jenks won the head-to-head matchup, 25-15, to win Pool A. Bentonville High and Lutheran North each went 5-1-1, but the Tigers beat the Crusaders, 18-17, in their final game to win Pool C.\nThe double-elimination tournament begins today at 9 a.m., with all games on either Shiloh Christian's campus or next door at Southwest Junior High.\nSports on 07/16/2016","url":"https://www.arkansasonline.com/news/2016/jul/16/football-bentonville-west-s-cardiac-kid/"}
