{"authors":["Stephen Bisset For Daily Mail Australia"],"date_download":"2018-10-23 00:15:30","date_modify":"2018-10-23 00:15:30","date_publish":"2017-04-26 09:43:46","description":"Footy Show funnyman Beau Ryan is about to add another creative feather to his cap after he wrapped up his debut acting turn this week","filename":"data/vaneerConsumption/FootyShowfunnymanBeauRyangushesaboutactingdebut.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D739900000578-0-image-a-9_1493196210289.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446708_Footy-funnyman-Beau-Ryan-gushes-acting-debut_1540253730.html","title":"Footy Show funnyman Beau Ryan gushes about acting debut","title_page":"Footy Show funnyman Beau Ryan gushes about acting debut | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the retired rugby league star who is about to welcome his second child into the world.\nAnd now, Beau Ryan is gearing up to add another feather to his cap, as he wrapped up his debut acting turn this week.\nBeau is due to star in the upcoming Australian film, Chasing Comets and he took to Instagram on Wednesday to gush about his part in the film and to urge his 355,000 followers to follow their dreams.\nNew career? Beau Ryan is due to star in the upcoming Australian movie Chasing Comets and he took to Instagram on Wednesday to gush about his part in the film\nThe post features a photo of a footy uniform-clad Beau, in the dressing room with co-star Dan Ewing, looking as though they had just shot some on-field action.\n'This week was a big step for me. I got to act in my first movie @chasingcometsofficial a dream of mine I have wanted to pursue since I was young,' the long post began.\n'So, before I wrap up, guys, back yourself, support one another and chase that dream. I did and it made me very happy. Yes, I was nervous, yes I was scared, yes I was uncertain. However I had so much support. I appreciate so many people for this moment.'\nKicking goals: The post features a photo of a footy uniform-clad Beau, in the dressing room with co-star Dan Ewing, looking as though they had just shot some on-field action\nThe Footy Show star went on to thank his wife Kara, four year old daughter Remi, the film's producers - former NRL star Jason Stevens and his wife Beck Stevens - for giving Beau 'confidence', director Jason Perini and Home and Away star Dan Ewing for being his 'mentor'.\n'Try it. Embrace It. And it will make you happy and you will have a feeling of fulfilment and joy which is one of the best feelings you will ever experience,' Beau continued.\nThe film will also star New Zealand singer and actor Stan Walker, DJ Havana Brown, former Home and Away actress Isabel Lucas and AFL star Brendan Fevola.\nStoked: Beau thanked wife Kara, four year old daughter Remi, the film's producers for giving him 'confidence', director Jason Perini, and Home and Away star Dan Ewing for being his 'mentor'.\nBeau's tilt at acting isn't the first time the Footy Show funnyman has branched out into other creative pursuits with the blonde beefcake releasing a single, Where Are You From, featuring Justice Crew, in 2014. The song reached number 14 on the Australian music charts.\nBeau announced his retirement, live on The Footy Show, after suffering a neck injury in 2014.\nBeau will have his hands full as, apart from the film role he is about to become a dad for the second time after he and wife Kara announced their pregnancy on Instagram in February\nIt seems Beau will have his hands full as, apart from the film role he is about to become a dad for the second time after he and wife Kara announced their pregnancy on Instagram in February.\nThe news of the pregnancy came over a year after the family was rocked by Beau's alleged cheating scandal.\nThe former Wests Tigers player reportedly had an affair with former Hi-5 singer Lauren Brant, whom he met while working on the stage production of Aladdin.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446708/Footy-funnyman-Beau-Ryan-gushes-acting-debut.html"}
