{"authors":["Press Association"],"date_download":"2018-10-23 00:39:48","date_modify":"2018-10-23 00:39:48","date_publish":"2017-04-26 10:34:09","description":"The 54-year-old Scot suggested he might `slap´ a female reporter.","filename":"data/vaneerConsumption/FootballAssociationchargeSunderlandbossMoyesoverinappropriatecomments.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/16/wire-472325-1493305767-64_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447004_Football-Association-charge-Sunderland-boss-Moyes-inappropriate-comments_1540255188.html","title":"Football Association charge Sunderland boss Moyes over inappropriate comments","title_page":"Football Association charge Sunderland boss Moyes over inappropriate comments | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sunderland boss David Moyes has been charged over comments in which he suggested he might “slap” a female reporter.\nThe 54-year-old Scot was initially asked for his observations on the incident, which took place after the 0-0 Premier League draw with Burnley on March 18, by the Football Association and has now been hit with a charge.\nAn FA statement read: “David Moyes has been charged in relation to comments made after the game against Burnley on 18 March 2017.\nThe incident took place on March 18 (Martin Rickett/PA)\n“It is alleged the Sunderland manager’s remarks were improper and/or threatening and/or brought the game into disrepute, contrary to FA Rule E3(1). He has until 6pm on 3 May 2017 to reply to the charge.”\nHowever, Moyes has not been accused of an aggravated breach of the rule, conviction for which could carry a heavier penalty.\nA Sunderland spokesperson said: “The FA have confirmed that David Moyes has been charged with misconduct, under Rule E3(1) of The FA Rules.\n“In instances where deemed appropriate, the FA can allege an ‘Aggravated Breach’ of this rule, which includes a reference to matters such as gender. For clarification, the FA has made no allegation of such a breach in this instance.”\nSunderland boss David Moyes receives FA charge for comments to a female reporter #SAFC pic.twitter.com/spbX8xENmI — PA Dugout (@PAdugout) April 26, 2017\nShould Moyes either admit the alleged offence or be found guilty by an independent regulatory commission, he would be likely to face a fine and could be asked to attend an education course.\nThe charge arises from a conversation which took place between the Black Cats boss and BBC Newcastle and Radio Five Live reporter Vicki Sparks at the end of a post-match interview.\nMoyes was unhappy with one of Sparks’ questions and warned her to be careful next time and that she “might get a slap”. Although the interview was over, the camera was still running and footage of the incident was published weeks later by a national newspaper.\nDavid Moyes apologises after threatening to slap a female reporter #SAFC pic.twitter.com/3PhrK34NOw — PA Dugout (@PAdugout) April 3, 2017\nAmid a furore, it was revealed that Moyes had later apologised to Sparks – who did not make a complaint – by telephone and that she had accepted it, and he was contrite when questioned about the matter at a subsequent press conference.\nHe said: “In the heat of the moment, I made a mistake in my comments to a BBC reporter, which I profoundly regret. I was disappointed with myself for it. I subsequently phoned the reporter and apologised, which she accepted. It’s not my character, it’s not my type, as most people know and once again I apologise for it.”\nThe club described Moyes’ conduct as “wholly unacceptable”, but continue to stand by him as he battles to preserve Sunderland’s Premier League status with the Black Cats 12 points adrift of safety at the foot of the table heading into Wednesday night’s derby trip to Middlesbrough.","url":"https://www.dailymail.co.uk/wires/pa/article-4447004/Football-Association-charge-Sunderland-boss-Moyes-inappropriate-comments.html"}
