{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 03:26:43","date_modify":"2018-10-23 03:26:43","date_publish":"2016-01-29 18:25:50","description":"AFC Bournemouth midfielder Harry Arter has revealed losing his stillborn daughter Renee last month has inspired his pep talks to his teammates and made him realise life is too short.","filename":"data/vaneerConsumption/FootballerHarryArterrevealshowhisstillborndaughterinspiresteampeptalks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4C39C00000578-0-image-a-9_1454091863253.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423242_Footballer-Harry-Arter-reveals-stillborn-daughter-inspires-team-pep-talks_1540265203.html","title":"Footballer Harry Arter reveals how his stillborn daughter inspires team pep-talks","title_page":"Footballer Harry Arter reveals how his stillborn daughter inspires team pep-talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Premier League footballer Harry Arter has revealed how losing his baby daughter has inspired his pep-talks to his teammates.\nThe 26-year-old AFC Bournemouth midfielder and his fiancée Rachel had a stillborn baby, Renee, last month, just days before Arter helped his team to a historic 2-1 win over Manchester United.\nArter said the experience has taught him how short life can be and he has tried to pass this on to his teammates by encouraging them to give their all because they never know what might happen to them.\nHarry Arter, left, pictured with boss Eddie Howe after becoming emotional during the Man Utd game\nThe Republic of Ireland international told The Guardian: 'I used what happened to say to the lads: 'Listen, I've experienced how short a life can be, what's happened to my little baby could happen to someone in this team, so make sure you give everything today because these football moments are not going to last forever, and what I've learned from this experience is that life can end at any second.'\nArter, who admitted he 'doesn't know how he managed to play in the United game', added the tragedy has only brought him closer to his partner.\nHe said: 'To this day I don't know how Rachel, physically and emotionally, dealt with it. She stayed there the whole night knowing she was still going to have to give birth naturally to our baby that hadn't made it.\nArter, pictured centre hugging Howe, lost his baby daughter Renee days before Bournemouth beat United 2-1. He was taken off after playing for 85 minutes\n'And for her to do that … it's the most respect I'll ever have for anyone. To have to do that, and the way she dealt with it, was unbelievable and made me have an unconditional love for her.'\nHe added: 'Every single game now I go out – and this is the truth – to play for her (Renee). I think I need to do her proud and play as well as I physically can, so that if she’s watching she’ll be happy.'\nOne of the moments that sticks out for Arter during that famous victory in December is when he was standing on the edge of the pitch with tears in his eyes, waiting to come back on after medical treatment, only for boss Eddie Howe to put his arms round him and embrace him.\nThere would be darker times to come for the midfielder, who said he 'lost it' a week later and walked out of the team hotel at midnight.\nThe cause of Renee's death remains a mystery with the results of a post-mortem still to be revealed.\nArter said his family has been touched by the thousands of messages of support they have received, with Republic of Ireland boss Martin O'Neill and his assistant Roy Keane both getting in touch to offer their condolences.\nThe midfielder has been at Bournemouth since 2010 and has scored one Premier League goal this season\nHis teammates have also shown their support, with the midfielder revealing defenders Simon Francis and Charlie Daniels came to his house and packed away the nursery furniture to make life more bearable for the couple.\nArter's journey to the Premier League with Bournemouth started in 2010, when Howe signed him from non-league side Woking for around £4,000.\nThe midfielder said his relationship with the manager helped him through the difficult situation and he explained to the boss how he was determined to keep training and playing, despite now realising he was 'in a bad way'.\nThe manager organised a visit from the club chaplain to say a few words before the Manchester United game which caused both Arter and several of his teammates to cry, while players wore black armbands throughout the game as a mark of respect.\nHe said his and his fiancee's families have been a rock for the couple and helped them through the dreadful experience.","url":"https://www.dailymail.co.uk/news/article-3423242/Footballer-Harry-Arter-reveals-stillborn-daughter-inspires-team-pep-talks.html"}
