{"authors":["Associated Press","Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 03:10:00","date_modify":"2018-10-23 03:10:00","date_publish":"2016-01-11 15:51:31","description":"A work crew inspecting the tracks near the Downtown Berkeley BART station discovered a severed right foot, which officials believe belonged to a woman who was run over by a train on December 20.","filename":"data/vaneerConsumption/FootfoundatCaliforniatransitstation22DAYSafterwomanjumpedontracks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DA9A000000578-0-image-a-6_1452541032477.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394110_Dismembered-foot-California-transit-station_1540264200.html","title":"Foot found at California transit station 22 DAYS after woman jumped on tracks","title_page":"Foot found at California transit station 22 DAYS after woman jumped on tracks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A gruesome discovery was made Monday morning at a busy transit station in Berkeley, California, where workers came upon a dismembered human foot.\nOfficials believed the severed limb belonged to a woman who ended up on the tracks and was run over by a BART train late last month.\nThe victim survived but lost her lower right leg in the December 20 incident.\nGrisly find: A work crew inspecting the tracks near the Downtown Berkeley BART station discovered a severed right foot early Monday morning\nBART spokesman Jim Allison said that no foul play in suspected in connection to Monday's grisly find, which he called 'an unusual start to the work week,' reported KCRA.\nEmergency crews stumbled upon the foot at around 3am while inspecting the tracks near the Downtown Berkeley BART station.\nThe transit hub was briefly shut down but later reopened. The discovery did not cause in any delays to the morning commute.\nAccording to published reports, just before 8.25am on December 20 a woman was seen jumping onto the tracks at the Berkeley station in front of an oncoming norhtbound BART train as it was pulling into the stop.\nAccording to witness accounts, the woman was later heard talking while trapped under the train. About 30 people witnessed the incident, reported Berkeleyside.\nThe injured woman was taken to Highland Hospital, where she was put on a 72-hour psychiatric hold while being treated for her injuries.","url":"https://www.dailymail.co.uk/news/article-3394110/Dismembered-foot-California-transit-station.html"}
