{"authors":["Press Association"],"date_download":"2018-10-23 00:53:13","date_modify":"2018-10-23 00:53:13","date_publish":"2017-03-16 10:28:09","description":"Judges also rejected the former Middlesbrough player´s bid to reduce his six-year jail sentence.","filename":"data/vaneerConsumption/FootballerAdamJohnsonloseschildsexconvictionappeal.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227723-1489660094-581_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319602_Footballer-Adam-Johnson-loses-child-sex-conviction-appeal_1540255993.html","title":"Footballer Adam Johnson loses child sex conviction appeal","title_page":"Footballer Adam Johnson loses child sex conviction appeal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former England footballer Adam Johnson has lost a challenge against his conviction for sexual activity with a besotted 15-year-old fan.\nHis application for permission to appeal was dismissed by three judges in London on Thursday.\nThe Court of Appeal judges also rejected his bid for a reduction in his six-year jail sentence.\nThe decisions in renewed applications made by 29-year-old Johnson – following earlier refusals by a single judge – were made by Lady Justice Rafferty, Mr Justice Sweeney and the Recorder of Sheffield, Judge Julian Goose.\nAdam Johnson was convicted of grooming and engaging in sexual activity with a besotted teenage fan\nAt the start of his trial at Bradford Crown Court, Johnson admitted one charge of sexual activity with a child, relating to kissing her. He also admitted a charge of meeting a child with intent following grooming her.\nHe denied there was any further sexual activity with her in his Range Rover when he met up with her in County Durham in January 2015.\nBut the former Sunderland and Manchester City winger was found guilty by a jury in March last year of one offence of sexual activity with a child.","url":"https://www.dailymail.co.uk/wires/pa/article-4319602/Footballer-Adam-Johnson-loses-child-sex-conviction-appeal.html"}
