{"authors":[],"date_download":"2018-10-30 18:16:12","date_modify":"2018-10-30 18:16:12","date_publish":"2016-05-05 11:00:00","description":"A winning Atlanta high school football coach could face termination after an investigation found thousands of dollars missing or unaccounted for from school accounts, and aggressive confrontations just short of fist fights with a parent and a school visitor.","filename":"data/vaneerConsumption/FootballcoachCoreyJarviscouldbefired.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/05/Images/photos.medleyphoto.9639703.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_winnin_8ac2efa89fd8a8fbf8c18f9868b4f521__1540923372.html","title":"Football coach Corey Jarvis could be fired","title_page":"Atlanta's Mays High: Football coach Corey Jarvis could be fired","title_rss":"NULL","source_domain":"ajc.com","text":"A winning Atlanta high school football coach could face termination after an investigation found thousands of dollars missing or unaccounted for from school accounts, and aggressive confrontations just short of fist fights with a parent and a school visitor.\nThe allegations led to clashes between supporters who saw Mays High School’s Corey Jarvis as a role model for male students and the “savior” of the football program, and critics who thought he shouldn’t be working with students.\nAtlanta Public Schools found more than $10,000 belonging to the football team unaccounted for, according to a report completed this week. That includes more than $6,000 in football receipts recorded by Jarvis that were unable to be traced and more than $4,000 collected by him.\nThe investigation found that in one case, Jarvis told the Mays football booster club president, who had questioned how Jarvis handled football funds, “If you’re so unhappy, why don’t you take your kids and go somewhere else.” In another case, Jarvis appeared to challenge a school volunteer who had criticized him, walking up to him on the school’s campus and telling him “Next time I see you it’s not going to be on school ground.” In both cases, school staff physically restrained Jarvis.\nA lawyer who has represented Jarvis in connection with the allegations did not return calls from The Atlanta Journal-Constitution Wednesday.\nThe report recommends firing Jarvis, who is currently on paid administrative leave.\n>>Read more on MyAJC.com\nMORE NEWS\nHigh school players must choose between soccer title game or key graduation test","url":"https://www.ajc.com/news/local-education/winning-football-coach-could-fired-after-000-goes-missing/zPCeLzhOBmwafQlp7h04eN/"}
