{"authors":[],"date_download":"2018-10-23 05:35:39","date_modify":"2018-10-23 05:35:39","date_publish":"2015-05-27 00:00:00","description":"In her memoir Whatever ... Love is Love, Bello describes the evolution of her \"modern family,\" which includes her romantic partner (a woman), her adolescent son and her son's father.","filename":"data/vaneerConsumption/ForActressMariaBelloFamilyMayBeComplicatedButLoveIsLove.json","image_url":"https://media.npr.org/assets/img/2015/05/27/whateverloveislove-final-cover_wide-749026258317c20703c5e5edd70355301aae79d8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=409981698_1540272939.html","title":"For Actress Maria Bello, Family May Be Complicated, But 'Love Is Love'","title_page":"For Actress Maria Bello, Family May Be Complicated, But 'Love Is Love'  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TERRY GROSS, HOST:\nThis is FRESH AIR. Actor Maria Bello is famous for her roles on \"ER\" and films like \"Coyote Ugly\" and \"A History Of Violence.\" But her new book is about her life off-screen. It's a memoir about love, family and relationships that expands on a column she wrote in 2013 in The New York Times that went viral. In it, she described falling in love with a female friend, telling her 12-year-old son about that romantic relationship and continuing to co-parent with her ex-boyfriend. Maria Bello's new book is called \"Whatever...Love Is Love: Questioning The Labels We Give Ourselves.\" We invited Anna Sale to conduct the interview with Bello. We're fans of Anna's podcast, \"Death, Sex And Money,\" which is from public radio station WNYC. Her interviews frequently focus on the big questions that people are often uncomfortable talking about. Here's Anna Sale and Maria Bello.\nANNA SALE, BYLINE: Maria Bello, welcome to FRESH AIR.\nMARIO BELLO: Thank you. I'm so happy to be here.\nSALE: You write that this book grew out of the overwhelming reaction to your original piece that ran in The New York Times that strict labels need not box in the way we love and how we run our families. But I want to ask you about the decision to write the original column which describes your conversation with your then-12-year-old son when you told him you were in a romantic relationship with the woman he knew as his godmother of sorts. Why did you decide to write about that private moment so publicly?\nBELLO: When I decided to write the Times article, it was before Thanksgiving of 2013, and it was after my son's dad's 50th birthday party. And Clare and Jack and Dan were there. My parents had flown in from Philly. My brother was there, all of Dan's family. And I looked around this room, and I thought, there is so much love here, and there are so many of my partners in this room. So I was just proud of my modern family, and I wanted to share that with the world.\nSALE: Jack is your son.\nBELLO: Jack is my son. He's 14 years old now. He was 12, actually, when, you know, I'd fallen in love with my best friend, who was a, you know, a woman, who's like a godmother to him (laughter). And we'd been together for a bit, and I went to a child psychologist who I knew, saying, gosh, when do I tell him? How do I tell him that? And she said, just wait till he asks.\nSo you know, there were months of me going, oh, God, is he going to ask? When is he going to ask? And when he finally did ask, and I said Clare, he said, whatever, Mom. Love is love. Shout it out to the world. And from that little nugget grew this entire concept and revolution, really, of being whatever.\nSALE: Were you nervous in declaring your relationship with Clare, which, you wrote, you were in the early stages of this relationship? Were you at all nervous about declaring it when it was new?\nBELLO: In the beginning, I certainly was because I've never declared my romantic relationships. You'll really see a picture of me with any men, including Jack's dad online or in a tabloid. I've just never been that public person. You know, and there was also a sense of, you know, how my son would take that and what that would look like. But by the time I finally wrote it, I didn't have any of that fear. I just had a really open heart and pride, and I think that's one of the reasons that people really latched on to the article.\nSALE: When you describe your relationship to Clare, when someone says, is she your partner? Is she your girlfriend? What are the words that you use?\nBELLO: It's funny. Sometimes, people say, how long have Clare and you been together? And I always say, well, what are you asking? Is it from the first time we met? Was it from the first time we kissed? Was it from the first time we had sex? People ask me about Jack's dad. How long were they together? A magazine asked us that. And I said, we're still together. We will always be together no matter how this relationship changes.\nSALE: So you don't use any words that...\nBELLO: Oh, no. I...\nSALE: You're...\nBELLO: It's funny. I use different words. Sometimes, I'll say, my girl. Sometimes, I'll say, my girlfriend. I rarely use partner because I think, again, the labels of partnership can be so limiting.\nSALE: So you call yourself a whatever.\nBELLO: I do.\nSALE: You describe in your book a moment when a lesbian woman says to you, welcome to the club, and you sort of bristle at that. But I want to ask you about, you know - don't you think that labels can be empowering, particularly at a moment when LGBT people are still fighting for public recognition, still fighting to be visible?\nBELLO: Yes. I mean, the LGBT community has really fought and shouted and marched for human rights, and it's a community I'm proud to be a part. And call me LGBTWP. Call me a duck as long as it moves human rights policy. When the woman came up to me, she - I had met her before, and she was really not nice. She was just kind of rude and b***** with me. And so then when I saw her after the article came out and she was so, like, oh, God, welcome to the club, I just thought, I don't want to be a part of your damn club. I want to be a part of a club that is not only moving policy but that people are fighting for who they love and being loving in general. I don't care who you sleep with. I care about who you fight for.\nSALE: You actively co-parent with your son's father...\nBELLO: I do.\nSALE: ...Dan, who you were in a relationship with before. And...\nBELLO: I still am in a relationship with him.\nSALE: You were still in a relationship...\nBELLO: (Laughter).\nSALE: You were in a romantic relationship with him...\nBELLO: There you go.\nSALE: ...Before, to be clear. You describe holidays and carpools together with your son, Jack, with Clare and with Dan. Was that comfort something you had to work for, or did the logistics of parenting require it?\nBELLO: Listen, there - it's so complicated for a family to shift around. And you know, the truth is, life is fluid. Relationships are fluid. They are not static. And as much as we want to hold onto an idea of what they're supposed to be, people grow and change and often in different directions. And then what do we do with that? Some people just throw out the love, and some people can make it work.\nAnd I'm not saying it's easy for us, you know? Some days, like, we can't stand each other - all of us, and then some days, it's different. But we communicate as much as we can. We talk about it. It's certainly not easy, but the only other option is throwing out what we have. And what we have is something very special.\nSALE: You do have the very unusual experience of flipping on a movie and seeing, on your television...\nBELLO: (Laughter).\nSALE: ...The one you had a long affair with. You were together for two-and-a-half years, and you describe it in the book. He was married. He had children.\nBELLO: Yeah.\nSALE: What was it like seeing him on screen with another woman when you had this charged history?\nBELLO: You know, I'm not proud to say I had an affair, but I don't negate it either. And I wouldn't take it back. I wouldn't change it. I would take back the, you know, the hurt that I caused people. But then, bizarrely enough, here I was, watching this movie and hearing him - that he was having an affair with someone and seeing the exact same faces how he looked at me, hearing the exact same words that he said to me. And then, I was just kind of like (imitating vomiting) grossed out. I was like, oh, my God. He was playing a Harlequin romance. But I want to take responsibility too and say, I was too. I was playing my own little Harlequin romance in my head. So that's my responsibility.\nSALE: You were watching him in a movie, and you heard him say words that he had said to you?\nBELLO: Yes (laughter). Yes. And there's facial expressions, and there's certain ways that he looked. And it just kind of made my stomach curl. But I'm sure he probably feels the same way about me when he sees me on screen.\nGROSS: We're listening to the interview that guest contributor Anna Sale recorded with actor Maria Bello about her new memoir, \"Whatever...Love Is Love.\" We'll hear more after a break. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. Let's get back to the interview guest contributor Anna Sale recorded with actor Maria Bello, who's known for her roles in the TV series \"ER\" and \"Prime Suspect\" and the films \"A History Of Violence,\" \"Payback\" and \"Coyote Ugly.\" Bello's new memoir, \"Whatever...Love Is Love,\" is about her personal relationships, including falling in love with a woman who had been her best friend.\nSALE: You write very lovingly about relationships you had with older men that were not sexual that were very important to you.\nBELLO: Yes.\nSALE: One was a priest when you were at Villanova University, Father Jackson, who you - who became your daily lunch companion. When you were a college student, did that surprise you that you wanted to hang out with a priest so much?\nBELLO: It did not surprise me at all. I've always been a seeker. I've always been really curious. Believe it not, I've always been quite shy. I was the girl with my wild girl friends in high school. I'd always be, like, the driver. I'd always be taking care of everybody. But when I met Father Ray Jackson in a class on peace and justice education, we just hit it off right away. And he was curious and a seeker as well, and though we didn't agree on the doctrine of the Catholic Church, what we did agree on was justice, was focusing on poverty, was focusing on peace. And more than anything we laughed together. My grandparents both worked at the university. He knew them both, and, you know, he was the only one besides my family at my 21st birthday party (laughter). And I will never forget that relationship, and he set me free in so many ways. I was on track to be a woman's rights attorney working at the Women's Law Project in Philadelphia. And then I took an acting class and I knew that's what I was supposed to do and I went to him in tears and said, Father, I don't know what to do. I thought I was supposed to be of service in this world and acting seems like such a selfish profession. And he said the words that would set me free. He said, Maria, you serve best by doing the things you love most, and I got it. And so two trash bags filled with clothes and $300, I made my way to New York City, and here I am in New York City. I had Army boots on then. Now I have Manolos on, so it's a different thing kind of.\n(LAUGHTER)\nSALE: That says a lot about what's happened since college in your life. And your son is named for Father Jackson.\nBELLO: That's right.\nSALE: When you were in your mid-30s, you're living in California acting. You become very close friends with producer John Calley, who is in his early 70s at the time. He produced films including \"Catch-22,\" \"Postcards From The Edge,\" \"The Da Vinci Code,\" but this wasn't primarily a professional relationship for you. How did you meet him?\nBELLO: Well, the funny thing was he asked for a meeting with me, and we thought it was going to be business, but as soon as we sat down in this, like, crappy Mexican restaurant that I picked, we just started talking immediately about, you know, love and desire and our lives and books that we loved and being - both of us being seekers. And from that day on, we probably talked every day for five years and saw each other. And he was the guy who - even if I was in some romantic crazy relationship, he was the guy who I talked to about my deepest emotions and he did me and we always talked that we loved the same things. We liked books. We liked to sleep, and we loved to learn and we loved each other. And not that he wasn't in romantic relationships during the time or I wasn't, but it was something so - so much more than that. And part of the reason I wrote the book and I wrote about him in my New York Times article as well is how could you say he wasn't my partner just because we didn't have sex? Like, he was one of the most important people in my life. And he wasn't this idea of a mentor. He was my partner and my daily friend.\nSALE: You write that for people who would maybe see you out in public they might presume that you were having an affair with an older man and a younger woman, but you say if only people knew the truth that he was completely impotent and I was only attracted to young and then you use a more colorful word for jerk.\n(LAUGHTER)\nSALE: That's a great line.\nBELLO: I only say that because he and I used to joke about it a lot with other people so I just - that's kind of a shared joke between us and some of our friends.\nSALE: Do you think your friendship was able to be so emotionally intimate because there was no possibility of a physical relationship?\nBELLO: Perhaps. I've often thought about that in terms of sex and intimacy and the fear of having both things and what that really is to be intimate with someone and sexual. And it's - you know, it's questions I still have, things I'm still working on. And, you know, my book is a series of questions, really. It's personal essays, but they lead to the larger conversation and questions that we all seem to be asking now.\nSALE: Clare - your partner, your girl, you call her a number of things - was your friend first before you became romantic.\nBELLO: Yes.\nSALE: When did you realize you were falling in love?\nBELLO: It was about two years later, and I was sitting in my garden and looking through photos and old journals, and I saw a photo of us from the New Year's Eve before - a photo booth photo. And I thought we are so - we love each other so much. We're so happy. What am I thinking? Because for years I'd been in this push-pull relationship, this, you know, crazy, obsessive relationships with this guy, this beautiful woman, this other person. And I thought what is that? Like, what am I waiting for? What am I - what really makes me happy? And I thought Clare. And it was a really difficult transition for our friends and, you know, the people in our lives and - but we did it and we all worked it out somehow.\nSALE: How did you tell her how you felt?\nBELLO: We were (laughter) we were sitting at a restaurant and she was kind of in the middle of breakup and, as I said, I was having this crazy thing. And I said there was something I need to tell you. It's something important and I started crying a little bit. And she goes like, oh, my God, are you pregnant? Do you have cancer (laughter)? And I said no. I have these feelings for you. And slowly but surely we worked them out and tried to be sensitive with everyone around us. I don't think we always were or did it right, but we tried.\nSALE: Maria Bello, thank you so much for joining us on FRESH AIR.\nBELLO: Thank you for having me. It's been a pleasure.\nGROSS: Maria Bello spoke with guest contributor Anna Sale. Bello's new memoir is called \"Whatever...Love Is Love: Questioning The Labels We Give Ourselves.\" Anna is the host of the WNYC podcast \"Death, Sex And Money.\" Our thanks to Anna and her producers.\n(SOUNDBITE OF MUSIC)\nGROSS: Tomorrow on FRESH AIR, I'll talk with actor David Oyelowo. He played Martin Luther King in \"Selma.\" In \"The Butler\" he was a civil rights activist. Oyelowo grew up in England and Nigeria and says he learned a lot about African-American history through his American movie roles. Living and working in England, Africa and the U.S. has taught him a lot about how race is perceived. He stars in the new HBO movie \"Nightingale.\" I'm Terry Gross.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=409981698"}
