{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:38:20","date_modify":"2018-10-30 19:38:20","date_publish":"2014-12-24 19:16:54","description":"Since Sony Pictures reversed its decision not to release the controversial movie \"The Interview,\" local theater owner Bunny Khorana’s phone has been ringing off the hook at Manassas 4 Cinemas. |","filename":"data/vaneerConsumption/ForALocalTheaterOwnerTheInterviewIsABigChristmasBonus.json","image_url":"https://media.breitbart.com/media/2014/12/the-interview-poster-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_24__1540928300.html","title":"For A Local Theater Owner, ‘The Interview’ Is A Big Christmas Bonus","title_page":"For A Local Theater Owner, ‘The Interview’ Is A Big Christmas Bonus | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Since Sony Pictures reversed its decision not to release the controversial movie “The Interview,” local theater owner Bunny Khorana’s phone has been ringing off the hook at Manassas 4 Cinemas.\nAs luck would have it, he owns one of the few local theaters in the Washington D.C. area to get a copy of the film, which is now one of the hottest movie tickets in the country.\nKhorana said that he got a call from his distributer in New York on Tuesday, early in the afternoon after news broke that Sony would distribute the film despite threats from hackers.\n“He was all charged up and he said ‘Guess what, we’ve got the print!’” recalled Khorana, in an interview with Breitbart News.\nHe jumped at the chance, shifting his movie lineup and getting the news out as quickly as possible.\n“It’s my birthday, as luck would have it, it’s one hell of a birthday present,” he chuckled.\nTickets are selling quickly, but Khorana said that he will open up all four screens in his theater if necessary to accommodate as many people as possible.\nCurrently he has five screenings of the film scheduled for Christmas Day.\nKhorana refurbished the aging community theater three years ago, attracting customers with cheaper ticket prices, including five dollar movie nights, and better concessions.\n“The prices are very good,” he said. “We don’t sell stale popcorn, like a few other of the chains do — it’s made on the spot every day.”\nThe Regal, AMC, and Cinemark mega-theater chains in the area will not be showing the film, giving him an unusual monopoly on showings in the Prince William/Fairfax County area. For those willing to drive, two other independent theaters in Washington D.C. will be showing the film as well as the Alamo Cinema Drafthouse theater in Ashburn, Virginia.\n“Thank God, you know, that Sony has allowed small theaters like us to release such a talked about movie,” Khorana says.\nHe added that although it was good for his business, he was “disappointed” that the chains decided not to show the film.\n“The big chains should be encouraged to open this film and not be bullied by anybody who is making stupid threats against Sony pictures,” he said, “You can’t be bullied by everybody around you, you know, it’s a free country and we have freedom of speech, that has to be safeguarded.”\nHe added that he was not worried about any threats to his business or his website, thanks to the community he lived in.\n“The Prince William police is one of the best,” he said referring to his local police department. He pointed out that the FBI has also indicated that it will be monitoring theaters that show the film.\nKhorana also cited a neighboring business as an additional layer of protection, should his business be threatened.\n“I have a gun store right next door to me,” he said. “We are very well protected.”","url":"https://www.breitbart.com/politics/2014/12/24/for-a-local-theater-owner-the-interview-is-a-big-christmas-bonus/"}
