{"authors":[],"date_download":"2018-10-23 05:45:09","date_modify":"2018-10-23 05:45:09","date_publish":"2017-02-28 00:00:00","description":"Trump has spoken about his commitment to \"buy American and hire American.\" But what exactly does that mean? Some say it could mean higher costs for construction projects.","filename":"data/vaneerConsumption/ForConstructionProjectsBuyingAmericanMeansHigherCosts.json","image_url":"https://media.npr.org/assets/img/2017/02/27/img_5683-9--2_wide-b72ce3c0132f0ace7837d3cf99a21d751981333d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=517495319_1540273509.html","title":"For Construction Projects, 'Buying American' Means Higher Costs","title_page":"For Construction Projects, 'Buying American' Means Higher Costs : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nTomorrow night President Trump will address a joint session of Congress, and he's very much expected to talk about jobs.\nARI SHAPIRO, HOST:\nPromises to bring back blue-collar jobs helped Trump win the election. In a moment, we'll hear from a factory worker in Indiana who voted for Trump for exactly that reason.\nCORNISH: First, we're going to hear a bit more about one of the president's proposals. He wants to spend a trillion dollars on infrastructure, and he wants that money to buy American and hire American. From Chicago, NPR's David Schaper explores what that policy might mean.\nDAVID SCHAPER, BYLINE: I'm standing at the Circle Interchange in downtown Chicago. It's one of the worst traffic bottlenecks in the country. Three major expressways carrying some 400,000 vehicles each day all come together here, so the Illinois Department of Transportation is in the midst of a six-year, $600 million project to untangle and rebuild the circle interchange. It's a massive project using tons of raw materials, and all of those materials were made right here in the USA. So just what exactly will the president's call to buy American mean to the state DOTs and private contractors who build highways and bridges like this one?\nJIM TYMON: I think for the most part, that means business as usual.\nSCHAPER: Jim Tymon is chief operating officer for the American Association of State Highway and Transportation Officials.\nTYMON: There are already requirements in federal law that require state DOTs and local transit agencies to buy American products as they construct infrastructure projects around the country.\nSCHAPER: Those requirements were put in place in the late 1970s after the collapse of the steel industry and eventually were expanded to include most federally funded transportation projects. But preserving American steel industry jobs comes at a cost.\nJEFF DAVIS: Economics is always about tradeoffs.\nSCHAPER: Jeff Davis is a senior fellow at The Eno Center for Transportation, a nonpartisan policy think tank in Washington, D.C.\nDAVIS: Domestic-made steel usually out of the - out of the mill will cost 70, 80 percent more than Chinese steel out of the mill.\nSCHAPER: And Davis says this administration now seems willing to pay that higher price.\nDAVIS: Clearly, President Trump has decided that preserving steel-working jobs is a worthwhile endeavor and is probably worth less efficient procurement of highway and bridge projects.\nSCHAPER: States can get waivers from the federal government's buy-American requirements if complying increases the costs significantly. And some industry groups want those waivers protected, but the president is already going beyond existing mandates. He's requiring American steel in the construction of the privately owned Dakota access pipeline. And Vice President Mike Pence in St. Louis last week hinted buy-American requirements could be expanded even further.\n(SOUNDBITE OF ARCHIVED RECORDING)\nVICE PRESIDENT MIKE PENCE: We're going to rebuild America with American workers and American tools.\nSCHAPER: So could that mean that private contractors on government projects will have to use American-made backhoes and dump trucks, even American-made hammers and wrenches? A White House spokesperson would only say, quote, we \"are currently considering many options, and it would be premature to speak about specifics.\" Rich Juliano of the American Road and Transportation Builders Association worries about how that might play out.\nRICH JULIANO: It might be that, you know, costs of these projects would increase a great deal because of that.\nSCHAPER: Nonetheless, this is one of the rare instances in which President Trump's agenda may have bipartisan support. A number of congressional Democrats are already backing legislation to expand buy-American requirements. David Schaper, NPR News, Chicago.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=517495319"}
