{"authors":[],"date_download":"2018-10-23 01:07:48","date_modify":"2018-10-23 01:07:48","date_publish":"2016-01-28 15:15:26","description":"Ford reported Thursday a jump in annual profits as it benefited from the US auto boom, a return to profitability in Europe and an accounting change in pensio...","filename":"data/vaneerConsumption/FordearningssoaronUSautoboomstrongerEurope.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h1ek-4vVdYopwYQ7f641721b07aea0c82-73_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421128_Ford-earnings-US-auto-boom-stronger-Europe_1540256868.html","title":"Ford earnings soar on US auto boom, stronger Europe","title_page":"Ford earnings soar on US auto boom, stronger Europe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ford earnings soar on US auto boom, stronger Europe\nFord reported Thursday a jump in annual profits as it benefited from the US auto boom, a return to profitability in Europe and an accounting change in pension expenses.\nAnnual profits were $7.4 billion, up from $1.8 billion in 2014 as revenues rose 3.8 percent to $149.6 billion.\nResults reflected the automaker's highest US sales in nine years following the launch of an aluminum-bodied F-150 version of its best-selling F-Series pickup trucks and other revamps.\nFord reported 2015 US auto sales of 2.5 million vehicles, up five percent from 2014 ©Mandel Ngan (AFP)\nFord reported 2015 US auto sales of 2.5 million vehicles, up five percent from 2014.\nNorth America remained the core of the second-largest US automaker's business, with operating profits rising 25.6 percent to $9.3 billion.\nIn Europe, Ford scored an operating profit of $259 million, compared with a loss of $598 million in 2014.\nThe profit, Ford's first in Europe since 2011, follows significant moves to restructure its European operations over the last couple of years, including plant closures and job cuts.\nThe gain in Europe helped to offset an annual loss of $832 million in South America.\nResults were boosted by a shift in the accounting of pension plans. When Ford announced the change on January 7, it said it would boost 2015 pre-tax profit by $1.5 billion.\nEarnings for the fourth quarter were $1.9 billion, up $4.4 billion from the year-ago period. Quarterly profits were 58 cents per share, seven cents above analyst expectations.\nFord confirmed its 2016 forecast for revenue and earnings per share equal or higher to that in 2015.\n\"In 2016, we will continue to build on our strengths and accelerate our pace of progress even further, while transforming Ford into both an auto and a mobility company and creating value for all of our stakeholders,\" said Ford president and chief executive Mark Fields in a statement.","url":"https://www.dailymail.co.uk/wires/afp/article-3421128/Ford-earnings-US-auto-boom-stronger-Europe.html"}
