{"authors":["Lisa Worf"],"date_download":"2018-10-22 23:17:31","date_modify":"2018-10-22 23:17:31","date_publish":"2015-03-20 00:00:00","description":"Tiny Davidson College in North Carolina received its first-ever at-large bid to the NCAA men's basketball tournament after a surprising and unexpected season. The team plays Iowa on Friday.","filename":"data/vaneerConsumption/ForDavidsonCollegeSuccessOnTheCourtComesInPartFromMathAnalytics.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_03_20_394334584_for-davidson-college-success-on-the-court-comes-in-part-from-math-analytics_1540250251.html","title":"For Davidson College, Success On The Court Comes In Part From Math, Analytics","title_page":"For Davidson College, Success On The Court Comes In Part From Math, Analytics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"For Davidson College, Success On The Court Comes In Part From Math, Analytics\nTiny Davidson College in North Carolina received its first-ever at-large bid to the NCAA men's basketball tournament after a surprising and unexpected season. The team plays Iowa on Friday.\nMELISSA BLOCK, HOST:\nThe Davidson Wildcats are taking on the Iowa Hawkeyes tonight in the men's college basketball tournament. Davidson is a small liberal arts school just outside Charlotte, N.C. After the team moved into a tough new conference, it wasn't expected to have a very good season, let alone make it to the big dance. But you could say it was a calculated move. Lisa Worf reports from member station WFAE.\nLISA WORF, BYLINE: Davidson was lucky to land freshman Jason Feldman.\nJASON FELDMAN: One big thing for me is I wanted a small school with top-level basketball.\nWORF: Last week, the Wildcats played a big game against La Salle. Davidson had been behind almost the whole time. And then...\n(SOUNDBITE OF BASKETBALL GAME)\nUNIDENTIFIED COMMENTATOR: They'll win or lose it right here on this possession. Three. Kalinowski. Score from the drive. And Davidson wins.\nWORF: The Wildcats stormed the court and hugged each other, but Feldman wasn't celebrating with them. He's not actually a basketball player. He's on the Cat Stats team with these guys.\nRUSS CRUISEY: I've never played. I'm atrocious.\nGRANT MCLURE: I've grown up watching a ridiculous amount, probably, honestly, a pathetic amount of basketball.\n(LAUGHTER)\nWORF: That's Russ Cruisey(ph) and Grant McClure. They're all Davidson students who love basketball and loves numbers. They scour online stats and put together scouting reports on opposing players, how they tend to play and the kinds of shots they take.\n(SOUNDBITE OF BASKETBALL GAME)\nUNIDENTIFIED COMMENTATOR: Back comes Brian Sullivan before Fordham can set their defense.\nWORF: At a game earlier this year against Fordham, members of the cad stats team weren't watching the action so much as studying the location of where each player shoots. All basketball teams use statistics to some extent. Those in the NBA and a handful of college programs spend big money to buy overhead cameras to record data and pay staff to analyze it. Davidson doesn't have that, but it has Abi Jane(ph) and his friend, who sit on the sidelines.\nABI JANE: We have a map of the court and we just point the plots on the map.\nWORF: They then turn that data into heat maps, showing shot percentages for regions of the court. Another student finds and rates efficiencies to see how Davidson's lineup of players works together. Assistant Davidson coach Will Reigel says they get a report on their opponent before every game.\nWILL REIGEL: That's something we can look at and use and then kind of mix and match our guys in terms of who defends certain things the best way.\nWORF: There's been a lot of fine-tuning. The cat stats team is led by Tim Chartier, who teaches math and computer science. He says the first report they turned into the coaches was a five-page essay. And the analysis took forever.\nTIM CHARTIER: In the beginning when - I think one of the students, it took him 10 hours to do the first game. And it was like, what? And he was like, no, it will get faster. I was like, how much faster?\nWORF: Now it takes just 10 minutes for them to format the data. Several cat stats members have graduated. One now does analytics for the Chicago Bulls. Another teaches the theory in high school. Davidson head coach Bob McKillop says his staff depends on the cat stats team.\nBOB MCKILLOP: I don't think they affect performance. But what they do is they affect the decisions I make in advance of game preparation as to who's going to get shots, where they're going to get them, which is the best side to run on.\nWORF: It's not clear how much of Davidson's success can be chalked up to analytics. But in some hard to measure way, it probably helped the tiny college beat the odds this year. For NPR News, I'm Lisa Worf in Charlotte.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/03/20/394334584/for-davidson-college-success-on-the-court-comes-in-part-from-math-analytics"}
