{"authors":[],"date_download":"2018-10-30 01:24:19","date_modify":"2018-10-30 01:24:19","date_publish":"2016-10-13 00:01:46","description":null,"filename":"data/vaneerConsumption/ForDisasterRecoverytheBestKnowledgeIsLocalKnowledge.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/Wildlife_biologist_Robin_Donohue_surveys_the_debris_field_at_Lido_Beach_WMA._12816459095.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862659.html","title":"For Disaster Recovery, the Best Knowledge Is Local Knowledge","title_page":"For Disaster Recovery, the Best Knowledge Is Local KnowledgeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As residents all along the Southeastern coast start to put their lives back together after a devastating visit by Hurricane Matthew, these communities will face unique challenges. Not surprisingly, the calls for billions of dollars in federal government aid are already coming out loud and clear. In states affected by storms, government is often thought of as the only answer to reconstruction. However, research on the aftermath of natural disasters reveals that more often than not, local residents are better-suited to efficiently address these challenges than government on the local, state and federal levels.\nEven if the federal government could increase the funding to help these communities above and beyond the $5 billion available in FEMA’s disaster relief fund, the money would have to come from an omnibus bill passed by Congress in a lame-duck session, meaning it could be months before they receive an increase in funds. Even if Congress were to approve unlimited funds for rebuilding, it would most likely be surrounded by the type of bureaucracy that benefits a few while undermining true recovery of getting people back into their homes and communities.\nTake a recent investigation by PBS’s Frontline and NPR into flood insurance and aid distribution in the aftermath of Superstorm Sandy. They found that disaster victims’ flood insurance claims were systematically underpaid, while the insurance companies selected by the feds to handle these claims were busy finding ways to increase their profits and limit payouts. Meanwhile, aid programs were slow to distribute funds while punishing homeowners with mountains of red tape and unqualified contractors, which ultimately prevented them from returning to their homes and communities.\nBrad Gair, a disaster recovery manager in New York, said during the Frontline episode: “Did we put a bunch of money out? Yes. Is everybody mad? Yes. Did people get what they needed to get back into a home? No.” These horrifying stories were unfortunately a repeat of previous governmental responses to disasters — for example, after Hurricane Katrina and Hurricane Andrew.\nIn a recent book titled Community Revival in the Wake of Disaster, three of my colleagues at the Mercatus Center — Virgil Henry Storr, Stefanie Haeffele-Balch and Laura E. Grube — explain in detail why we shouldn’t be surprised that governmental responses to disasters lead to high administrative overhead costs and little relief to those who need it the most. They also show how entrepreneurs, “conceived broadly as individuals who recognize and act on opportunities to promote social change,” end up filling this critical role.\nThey reveal how in general, these entrepreneurs promote community recovery by providing necessary goods and services and restoring and replacing disrupted social networks. The entrepreneurs also provide signals to indicate that a community is rebounding. These signals are essential to incentivize people and businesses to stay in the community or, in the event they deserted it during or after the hurricane, come back.\nJust as importantly, they argue that creating space for entrepreneurs to act after disasters is essential for promoting recovery and fostering resilient communities. They tell many uplifting stories of communities that didn’t wait for the various government agencies to rescue them and instead took matters into their own hands, finding ways to obtain funding, clean up and rebuild — which resulted in getting people back into their homes faster.\nStorr and his co-authors link the success of these local entrepreneurs to people’s knowledge of one another’s needs, which allows them to find creative ways to overcome adversity. As opposed to the top-down approach of a distant government bureaucracy, the best knowledge is local knowledge. Those who have lived and worked in these communities know them best and are paramount to revival.\nWhen it comes to the recovery after Hurricane Matthew, policymakers should remember that when social networks are broken by disasters, local knowledge is particularly powerful and holds an even bigger advantage over bureaucrats than usual, no matter how well-intentioned the public officials are. In fact, bureaucratic red tape will only cause more people more pain.\nCOPYRIGHT 2016 CREATORS.COM","url":"https://spectator.org/for-disaster-recovery-the-best-knowledge-is-local-knowledge/"}
