{"authors":["Matthew Debord"],"date_download":"2018-10-31 00:09:07","date_modify":"2018-10-31 00:09:07","date_publish":"2016-12-03 00:00:00","description":"The reason is simple: consumers don't want electric cars. It's the D-word — demand. And demand isn't there.","filename":"data/vaneerConsumption/FordCEObiggestproblemforelectriccars.json","image_url":"https://amp.businessinsider.com/images/5804de478d83b4a6018b4b36-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ford-ceo-biggest-problem-for-electric-cars-2016-12_1540944547.html","title":"Ford CEO biggest problem for electric cars","title_page":"    Ford CEO biggest problem for electric cars - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Ford CEO Mark Fields Ford The year 2010 seems like a long time ago. That was when a bold future for electric cars appeared to be opening.\nTesla was about to roll out its first original design for an EV, the Model S, which would go on to be named Motor Trend's Car of the Year for 2013.\nThere's were numerous electric-car startups aiming to join Tesla, and the major automakers were producing their first EVs since GM had killed it EV-1 in the 1990s.\nSince then, the promise of an electric-car revolution hasn't just failed to materialize — it's actually retreated.\nThe reason is simple: consumers don't want electric cars. It's the D-word — demand. And demand isn't there.\nThis market reality has collided head-on with an increase in federal fuel-economy standards, mandated by the EPA. Automakers want the government to ease up on the timetable, so that they can sell as many profitable pickup trucks and SUV in the US as possible, while sales are running at historically record levels and gas is cheap.\nThis is purely good business — carmakers want to bolster their balance sheets now, while the bolstering opportunity is good, ahead of the inevitable downturn.\nTrump to the rescue?\nAuto industry leaders are now seizing a chance to get President-elect Donald Trump's administration to give them a break, while at the same time not completely backing off the EV aspects of their product portfolios.\nHere's Bloomberg's John Lippert and Jamie Butters:\nFord Motor Co. plans to lobby President-elect Donald Trump to soften U.S. and state fuel-economy rules that hurt profits by forcing automakers to build more electric cars and hybrids than are warranted by customer demand. \"In 2008, there were 12 electrified vehicles offered in the U.S. market and it represented 2.3 percent of the industry,\" Mark Fields, chief executive officer of Ford, said in an interview at Bloomberg's Southfield, Michigan, office Friday. \"Fast forward to 2016, there's 55 models, and year to date it's 2.8 percent.\"\nFields is as committed as anyone to making sure that Ford is part of whatever revolution in transportation occurs in the coming decades, but he doesn't have the luxury of being a starry-eyed visionary. His job is to make sure that Ford is profitable, that it's balance sheet is strong, that it maintains or grows market share in critical parts of the world, and that it doesn't fall behind on innovation, in all areas of the business.\nAn electric Ford Focus. Ford\nIf you look at the simple math that Fields presented, it's not hard to see why he wants the EPA's expectations to be adjusted. There's been a more-than-fourfold increase in the number of EVs for sale in US, and yet the market for those EVs has grown by a negligible 0.5%.\nCompliance for its own sake\nThe billions being spent to develop and market EVs aren't being completely incinerated — these customer-less cars have value as \"compliance\" vehicles to meet government regulations. But building more of them for that goal is now officially running counter to the financial interests of the automakers.\nThis isn't a sustainable situation. Almost all of the planet's vehicles currently run on gas or diesel. That's unlikely to change for decades. Everybody knows that it would be good for the environment to get more gas and diesel cars off he road, but there has to be some kind of business value that the replacement electric vehicles provide.\nUntil consumer and carmakers can figure out how to make that happen, the automakers' case to have the government back off its fuel-economy requirements will be strong.","url":"https://www.businessinsider.com/ford-ceo-biggest-problem-for-electric-cars-2016-12"}
