{"authors":["Associated Press"],"date_download":"2018-10-23 04:45:43","date_modify":"2018-10-23 04:45:43","date_publish":"2017-03-10 14:54:28","description":"JOHANNESBURG (AP) - A South African man and his pregnant Ukrainian fiancee won't face charges in the United Arab Emirates following their arrest for having...","filename":"data/vaneerConsumption/ForeigncouplearrestedinUAEforunwedsexisreleased.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301566_Foreign-couple-arrested-UAE-unwed-sex-released_1540269943.html","title":"Foreign couple arrested in UAE for unwed sex is released","title_page":"Foreign couple arrested in UAE for unwed sex is released | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"JOHANNESBURG (AP) - A South African man and his pregnant Ukrainian fiancee won't face charges in the United Arab Emirates following their arrest for having sex outside of marriage, a South African newspaper reported Friday.\nCharges against Emlyn Culverwell and fiancee Iryna Nohai were dropped in Abu Dhabi, The Herald reported. It quoted the South African's mother, Linda Culverwell, as saying her son telephoned to say he and Nohai, who were released Wednesday on bail, wouldn't be prosecuted.\n\"Emlyn was excited and relieved to see Iryna\" after their release, Linda Culverwell said, according to the newspaper.\nThe couple was arrested Jan. 29 after Nohai sought treatment for stomach cramps and a doctor informed authorities that she was pregnant, South African media reported.\nEnforcement of UAE morality laws regarding sex and alcohol is rare. Arrests tend to follow official reports to police, whether from members of the public or occasionally the unwitting arrestees themselves.\nEmirates officials haven't spoken publicly about the case, and local media largely haven't reported on it.\nThe couple has been working for years at a waterpark in Abu Dhabi, The Herald newspaper reported. The waterpark, Yas Waterworld, didn't immediately respond to a request for comment.\nThe Emirates' desire to promote itself as a cosmopolitan and tolerant corner of the Middle East has at times run up against local laws, which are based in part on Islamic legal codes and forbid sex outside of marriage. Similar laws are on the books across much of the Islamic world.\nThe 2013 trial of a Norwegian woman who reported being raped in Dubai sparked international outrage after she was sentenced to 16 months behind bars on charges of unwed sex and alcohol offenses. She was soon pardoned and allowed to leave the country.\nThe sheikhdoms of Dubai and Abu Dhabi are the largest and wealthiest of the seven that make up the United Arab Emirates federation, a country of over 9 million residents where foreigners vastly outnumber the local population.\n___\nAssociated Press writer Adam Schreck in Dubai, United Arab Emirates contributed.","url":"https://www.dailymail.co.uk/wires/ap/article-4301566/Foreign-couple-arrested-UAE-unwed-sex-released.html"}
