{"authors":["Ildefonso Ortiz"],"date_download":"2018-10-30 20:53:11","date_modify":"2018-10-30 20:53:11","date_publish":"2014-12-07 18:57:14","description":"Mexican authorities are expecting to either confirm or disprove the findings made by a group of South American forensic specialist who claim to have |","filename":"data/vaneerConsumption/ForensicSpecialistsAllegedlyIdentifiedBodyofOneofMexicosMissingStudents.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/12/07/coculajpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_12_07__1540932791.html","title":"Forensic Specialists Allegedly Identified Body of One of Mexico's Missing Students","title_page":"Forensic Specialists Allegedly Identified Body of One of Mexico's Missing Students | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Mexican authorities are expecting to either confirm or disprove the findings made by a group of South American forensic specialist who claim to have identified the remains of one of the 43 students from Mexico that were kidnapped and killed by drug cartels.\nOn Saturday afternoon members of an Argentinian forensic team announced their findings that through examining a bone fragment and a molar, found in the southern Mexican town of Cocula, they had identified 19-year-old Alexander Mora Venancio, Mexico’s El Universal reported.\nIf the information is confirmed by Mexican authorities, it will bring some closure to the families of the students from the rural town of Ayotzinapa who were kidnapped by police in late September only to be turned over to a drug cartel that executed them and set their bodies on fire.\nWhile the reason for the teen’s murder has not been confirmed, preliminary information released by Mexico’s Attorney General (PGR) shows that cartel members mistook the protesters for rival members seeking to infiltrate the area.\nBreitbart Texas reached out to Mexico’s PGR who said the agency would soon make an announcement but declined to confirm or deny the findings made by the group of foreign specialists.\nMexico’s El Universal spoke with Carmen Mendoza, the mother of another one of the 43 students who said that she had not been notified of any findings.\n“If it was true we would be the first to know,” Mendoza said.\nThe disappearance and murder of the 43 students has turned into a rallying cry for Mexican protesters throughout the nation who have become even more outspoken in asking for the resignation of President Enrique Pena Nieto due to the country’s worsening security conditions.\nFollow Ildefonso Ortiz on Twitter @ildefonsoortiz","url":"https://www.breitbart.com/border/2014/12/07/forensic-specialists-allegedly-identified-body-of-one-of-mexicos-missing-students/"}
