{"authors":["Kristin Tate"],"date_download":"2018-10-30 21:26:29","date_modify":"2018-10-30 21:26:29","date_publish":"2014-06-29 14:25:00","description":"HOUSTON, Texas--Up to 2,000 migrants who entered the United States illegally will be transferred to housing facilities in Dallas.","filename":"data/vaneerConsumption/ForeignMinorstoBeHousedinDallas.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/illegalimmigrantfacilityjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_06_29__1540934789.html","title":"Foreign Minors to Be Housed in Dallas","title_page":"Foreign Minors to Be Housed in Dallas | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas–Up to 2,000 migrants who entered the United States illegally will be transferred to housing facilities in Dallas.\nAccording to WFAA, County Judge Clay Jenkins announced the city’s decision to take in minor immigrants at the Democratic Convention in Dallas. He said, “We can’t help all, but we can help some.”\nJenkins apparently “reached out” to the Department of Homeland Security and offered Dallas as a location for migrant facilities, which will be funded by the federal government.\nAt this point, the location of the facilities has not been disclosed. It is also unclear when the migrants will arrive in Dallas.\nThousands of illegal immigrants continue to cross the U.S.-Mexico border each day. Upon arrival, rather than being turned away they are given a myriad of taxpayer subsidized benefits–this includes transportation, housing, food, education, vocational training, and even legal counsel. Ultimately, most of the illegal immigrants will ultimately be allowed to stay in the U.S.\nCurrently young migrants are being housed in facilities in numerous states including Texas, Arizona, California, and Oklahoma.\nFollow Kristin Tate on Twitter @KristinBTate.","url":"https://www.breitbart.com/border/2014/06/29/Foreign-Minors-to-be-Housed-in-Dallas/"}
