{"authors":[],"date_download":"2018-10-23 01:08:15","date_modify":"2018-10-23 01:08:15","date_publish":"2016-03-22 00:00:00","description":"Freemasons are best known for their secrecy, but they are having a very public dispute — about a ban on gay members. Freemasons in Tennessee will decide this week whether to lift the ban.","filename":"data/vaneerConsumption/ForFreemasonsIsBanningGaysOrBeingGayUnMasonic.json","image_url":"https://media.npr.org/assets/img/2016/03/22/2246705_blank_photo_wide-35f3b772dac7e3132a000c681a7263a77c0cbace.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=471414979_1540256895.html","title":"For Freemasons, Is Banning Gays Or Being Gay Un-Masonic?","title_page":"For Freemasons, Is Banning Gays Or Being Gay Un-Masonic? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nA fraternal organization that's best known for its secrets is having an increasingly public dispute. Tomorrow, Freemasons in Tennessee are meeting to decide whether to uphold a ban on gay members. Lodges across the country and overseas are urging Tennessee lift the ban. They say it harms the future of the organization, which is looking to stay relevant and to attract younger members. From member station WKNO in Memphis, Christopher Blank reports.\nCHRISTOPHER BLANK, BYLINE: Last June, on the day the Supreme Court legalized same-sex marriage nationwide, a couple of farmers in rural Somerville, Tenn. tied the knot.\nMARK HENDERSON: It felt exhilarating.\nDENNIS CLARK: There's a sense of validation.\nBLANK: Mark Henderson and Dennis Clark say the neighbors responded within hours.\nHENDERSON: We came home and there was a bottle of champagne in a potato salad bucket on the front porch.\nBLANK: Not so welcoming was the response from another community, one they'd been active in for years.\nCLARK: The first letter that we got from the Grand Lodge of Tennessee was that we were being brought up on charges for un-Masonic conduct.\nBLANK: Clark and Henderson are Freemasons, members of a worldwide fraternity that shares the same rights, symbols and secrets. But every state or jurisdiction has its own penal code. For the last 30 years, Tennessee has banned homosexuality. Enforcement is a new thing. Chris Sanders of the Tennessee Equality Project says that religious backlash to the marriage equality decision has been prominent in the state legislature this year as well as in private organizations such as churches and the Freemasons.\nCHRIS SANDERS: As same-sex marriage continues to be accepted, those who don't accept it will look for new, innovative ways to carve out little realms where they can continue to discriminate.\nBLANK: The suspension of Clark and Henderson in Tennessee inspired the Grand Lodge of Georgia to enact its own ban on gay members last fall. Chris Hodapp, author of \"Freemasons For Dummies,\" says this has stirred an international debate. As Freemasonry struggles to attract new members, lodges worry about the label of bigotry.\nCHRIS HODAPP: When a young man hears that Masons in a state throwing gays out, they just see that as the whole organization doing that and not being isolated to a particular area.\nBLANK: There's no Supreme Court of Freemasonry to stop the Grand Lodges of Tennessee and Georgia. Neither lodge responded to our interview requests, and both restricted its members from speaking to the media. Internal actions were taken by the Grand Lodges of California, Washington, D.C. and the country of Belgium, among a growing list of others. They've suspended relationships with Tennessee and Georgia. Glen Cook, a lawyer and Master Mason, says there is precedence for exclusionary policies.\nGLEN COOK: Some of those who argue against the actions of Georgia and Tennessee have said that we don't discriminate. Well, we do.\nBLANK: In terms, he says, of being an all-male fraternity that asks members to believe in a higher power. Cook himself couldn't be a Freemason in his home state of Utah until its Grand Lodge lifted a ban on Mormons in 1984. Cook suspects that the debate in Tennessee will hinge less on sympathetic appeals and more on whether a ban goes against the founding principles of Freemasonry.\nCOOK: And whether this type of restriction forms any useful purpose and whether it distracts from our goal of elevating mankind.\nBLANK: Over the next two day in Nashville, the Grand Lodge of Tennessee will decide which conduct is more un-Masonic - being gay or banning gay, a decision that could affect freemasons around the world. For NPR News, I'm Christopher Blank in Memphis.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=471414979"}
