{"authors":[],"date_download":"2018-10-22 21:45:00","date_modify":"2018-10-22 21:45:00","date_publish":"2016-11-16 00:00:00","description":"Think playing on sports' travel team will help your kids get a college scholarship? Think again. Commentator John U. Bacon advises that they hit the books instead.","filename":"data/vaneerConsumption/ForgetTheFieldHitTheBooksNPR.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=502274825_1540244700.html","title":"Forget The Field, Hit The Books : NPR","title_page":"To Get A College Scholarship: Forget The Field, Hit The Books : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nIf you're the parent of an athlete, you may not have seen much of him or her recently. It is fall sports season. Winter sports are gearing up, and travel teams are busy. These are teams that can be organized outside school and involve lots and lots of time on the road. But commentator John U. Bacon says those miles just don't add up.\nJOHN U. BACON: Why do we do this? Why do we spend countless hours, week-in and week-out, on endless road trips, transporting our child athletes across the state and even across the country while sacrificing everything else, including other sports, family dinners and even family vacations? Because the coaches tell us we must. If we don't, our kids won't get a college scholarship or even make their high school team, let alone go pro.\nNow, let's start with some cold facts. Nationally, less than 2 percent of high school athletes will get college scholarships. That's true at my alma mater, the University of Michigan, where only 2 percent of students receive athletic scholarships, but a whopping 70 percent receive academic scholarships. That adds up to $23 million for sports, compared to $915 million for academics - 40 times more. You don't have to be an AP Calculus whiz to figure out where to spend your time. You want a scholarship? Forget the fields. Hit the books. It's fool's gold, people. But they keep selling it, and we keep buying it.\nTravel teams are also counterproductive. You don't get better at your sport by sitting in a van. You get burned out. Legendary Yankees catcher Yogi Berra was amazed to see his grandchildren traveling across the country just to take a few at bats. He said when he grew up in St. Louis, playing stickball with his buddy Joe Garagiola, they'd take 48 bats by dinner. Berra learned to hit by hitting.\nAnd what about playing one sport all year? Even the great one, Wayne Gretzky, thinks it's crazy. He said, I was absolutely ecstatic to see the end of hockey season. One of the worst things to happen to the game, in my opinion, has been year-round hockey. Gretzky spent his springs playing lacrosse.\nIn the U.S., hotshot tennis players are pushed to enter junior tournaments year-round and enroll in Florida's tennis academies. But instead of ushering in a golden era of American tennis, it has ruined our most promising players. Since 2003, American men have not won a single major title. On the women's side, the Williams sisters have been dominant. Why? Instead of entering them and endless tournaments across the country, their father, Richard, taught them himself on the public courts of South-Central, L.A. There's your answer. The Williams sisters have won 29 major titles. Their American peers have won exactly five and none since 2002.\nYou want to succeed? Go outside and play. When you come in, do your homework, just like always.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=502274825"}
