{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-23 02:14:20","date_modify":"2018-10-23 02:14:20","date_publish":"2016-01-11 14:04:43","description":"Dan Blackman from Edith Cowan University in Australia, and technical adviser to Western Australia Police, thinks police are missing out on using routers for this key source of information.","filename":"data/vaneerConsumption/ForgetfingerprintsWiFiROUTERScouldsoonhelppolicesolvecrimes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300ADC2200000578-0-image-a-38_1452521016677.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393878_Forget-fingerprints-ROUTERS-soon-help-police-solve-crimes-Data-collected-Wi-Fi-devices-identify-criminals_1540260860.html","title":"Forget fingerprints, Wi-Fi ROUTERS could soon help police solve crimes","title_page":"Forget fingerprints, Wi-Fi ROUTERS could soon help police solve crimes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fingerprints and DNA are key evidence in identifying criminals, but crime scene investigators of the future may add Wi-fi to their toolkit for tracking down lawbreakers.\nIf police were able seize Wi-fi devices at the scene of a crime, they could have access to vital information which could place people at the scene at the time an incident took place.\nDan Blackman, a PhD candidate at Edith Cowan University in Australia, and technical adviser to Western Australia Police, thinks police are missing out by not using this key source of information.\nScroll down for video\nInformation captured by Wi-Fi devices, such as routers stock image left), could identify who was at the scene of a crime at the time an incident took place. They log successful and failed attempts to log on to networks and capture unique identifiers from phones, which could be used by police to identify criminals (illustrated right)\nRouters, for example, capture 'chatter' from smartphones, tablets and wearables, including successful and failed attempts to log onto a network, as well as the time they attempted to connect.\nIn addition, routers capture a media access control (MAC) address from mobile devices, which are unique identifiers for each phone, laptop or tablet that try to connect to the network.\nMr Blackman described the information from Wi-Fi devices as ‘gold’ in terms of evidence for court.\nSpeaking to Science Network WA, he said: ‘These devices could hold a lot of information, but we're not capturing it.’\n‘If we were to look at it from a purely legal perspective, we might be able to place a specific person at a specific location at a specific time.'\nHowever, one of the limiting factors is the often short window of time in which investigators have to secure the information.\nMany devices store a limited amount of information and have limited memory capacity.\nFor older routers, this may be as little as a few hundred kilobytes of data - the equivalent of a few hundred paragraphs of text.\nIn particular, routers can capture media access control (MAC) addresses from mobile devices, which act as unique identifiers for each phone, laptop or tablet, that try to connect to the network. Stock image illustrated\nBy not seizing Wi-Fi devices from crime scenes, an experts has warned police may be missing out on a key source of information, which could place a user's mobile device at the scene of a crime (illustrated with stock image). However, many devices only store a limited amount of information and have limited memory capacity\nAs storing logs isn’t a primary necessity for routers, even more modern devices may fill up within minutes.\nAnd for detectives on the scene looking to freeze the data capture process, switching off the device could cause havoc.\n‘If we power off the Wi-Fi device we lose a heck of a lot of data, which causes issues with seizure,’ explained Mr Blackman.\nOne more pitfall awaits once the device is switched off.\nAs they often contain internal and external antennae for communication, switching off the power can cause the input to switch from one to the other.\n‘So the moment you disconnect the external aerial, [the internal] fires up, and you still have connectivity to the device,’ he added.\nWI-FI DEVICES COULD BE INFORMATION GOLD MINES Information from Wi-fi devices could place people at the scene of a crime (illustrated with stock image) scene of a crime they could have access to vital information which could place people at the scene at the time an incident took place. Dan Blackman, a PhD candidate at Edith Cowan University in Australia, and technical adviser to Western Australia Police, thinks that police are missing out on this key source of information. Wi-fi devices captures chatter from mobile devices, such as smartphones and tablets, including successful and failed attempts to log onto a network, as well as times. In addition, Wi-Fi devices capture a media access control (MAC) address from mobile devices, which are unique identifiers for each phone, laptop or tablet, which try to connect to the network.\nThe use of Wi-Fi as a tool to track criminals is one example of the potential novel uses proposed for the longstanding technology.\nIn 2014, Helsinki airport unveiled controversial plans to track passengers as they move around the terminals via their mobile phones.\nThe technology enabled airport staff to pinpoint the location of mobile phones with Wi-Fi setting turned on, and drew criticism from privacy advocates.\nThe system had been aimed to monitor crowds and eliminate bottlenecks at security checkpoints and shopping areas, as well as send alerts to passengers if their departure times or gates change.\nLondon’s City Airport also recently won £800,000 of funding to develop the tracking technology as part of its Internet of Things.\nWi-Fii is already being used at airports to pinpoint the location of mobile phones with Wi-Fi setting turned on, such as in Helsinki airport. In London, City Airport (pictured) is using the technology to monitor servicing equipment as well as triangulating the location of passengers in the terminal\nThe airport is using the technology to monitor servicing equipment as well as triangulate the location of passengers in the terminal.\nIn more unusual use of Wi-Fi, researchers in the US have used the signals to see through walls.\nThe device transmits wireless signals that travel through the wall and reflect off a person's body back to the device.\nIt begins by scanning the 3D space to capture wireless reflections of objects in the room, including the human body.\nSince only a subset of body parts reflect the signal back at any given point in time, the device then monitors how these reflections vary as someone moves and walks.\nIt can intelligently stitch the person's reflections across time to reconstruct his silhouette into a single image.","url":"https://www.dailymail.co.uk/sciencetech/article-3393878/Forget-fingerprints-ROUTERS-soon-help-police-solve-crimes-Data-collected-Wi-Fi-devices-identify-criminals.html"}
