{"authors":[],"date_download":"2018-10-22 22:03:32","date_modify":"2018-10-22 22:03:32","date_publish":"2014-06-27 00:00:00","description":"Archbishop Emil Nona, the head of the Chaldean church in Mosul, Iraq, was out of town when ISIS captured his city. Now, he is going back to Mosul, as are some 50 Christian families. He knows the dangers, but he says he must tend his flock.","filename":"data/vaneerConsumption/ForIraqiChristiansReturnToCapturedCityIsAFraughtMandate.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=326205937_1540245812.html","title":"For Iraqi Christians, Return To Captured City Is A Fraught Mandate","title_page":"For Iraqi Christians, Return To Captured City Is A Fraught Mandate : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nMosul is northern Iraq's largest city and the takeover by ISIS has prompted an exodus of the last remaining Iraqi Christians there. The seizure raised fears that a thousand years of Christian culture would vanish. But in recent days, some Christian families have returned to Mosul and surrounding villages. And soon they'll be joined by the Archbishop of the Chaldean Church. NPR's Deborah Amos caught up with him in nearby Erbil.\nDEBORAH AMOS, BYLINE: The Christian exodus from Mosul weighs heavily on Archbishop Amil Nona. His black clerical suit is still neatly pressed but his haggard face is gray. He's been helping desperate, displaced families find shelter in Erbil, the capital of Iraq's Kurdish region about 60 miles east of Mosul. But as some Christian families have decided to go back home, he knows he must go, too.\nAMIL NONA: I am Archbishop of Mosul. My diocese is the city of Mosul and around Mosul.\nAMOS: You will go back?\nNONA: Yes, sure.\nAMOS: Are you afraid?\nNONA: No, there's no time for afraid. Now we are - we must work for our families. There's no time for afraid.\nAMOS: These families are the last of a large community that numbered 35,000 in 2003 - dwindled to 3,000 a decade later. There are 20 churches in Mosul and no mass has been said since the Sunni extremists of ISIS seized the city on June 10.\nNONA: I can't say if there is future or not, because we don't know which future we have.\nAMOS: The future of Mosul's Christians is closely watched here in Erbil, a place that's become a refuge from earlier assaults on the community. This church festival raises money for the most recently displaced. Hind Isa left by Baghdad in 2010, when Christians were at risk in the capital. But she was born in one of the small Christian villages in the suburbs of Mosul and her ties are still strong.\nHIND ISA: I have relatives, I have friends there.\nAMOS: Are they still there?\nISA: Yes, not all of them can come here. Now it's difficult.\nAMOS: Most newcomers find safety is expensive. Free accommodations in the new tent camps are dire. And that's why people go back, she says, especially after reports that ISIS militants have not specifically targeted Christians so far. But Hind Isa knows the militant groups repetition. And she's convinced not just Christians are at risk.\nISA: They can start with the Christians but they will kill anyone they don't want. The danger is on all Iraq. It's not just Christians.\nAMOS: That's certainly what Father Nona has seen. Mosul is a mixed city that represents the mosaic of Iraq. Shia Muslims, associated with a government in Baghdad, were the first to be targeted by ISIS. They all fled the city. Some found shelter in Christian villages, now living in churches or schools. And they need extra help.\nNONA: For that we work for them more than Christians.\nAMOS: So you've become the Archbishop of Muslims, as well?\nNONA: (Laughing) Yes, why not? We try do something to all people. It's human beings.\nAMOS: There was a time that Iraqis celebrated holidays together and intermarried, but no longer.\nNONA: There is something missing here in Iraq now. We must find it. We must do it for all, not only for Mosul.\nAMOS: And now Christians are increasingly collateral damage in a sectarian battle between Sunni and Shia Muslims. To help them survive, they turn to reports on Ishtar TV - news about the fighting, about ISIS. This Christian station has reporters in the field and a studio here in Erbil. Sixty-seven-year-old Mowfaq Esa helps to run the station.\nMOWFAQ ESA: Our news is mostly about our people.\nAMOS: Christian people?\nESA: Christian people, yes.\nAMOS: The latest news - an exodus from the village of Qarakosh, about a 20 minute drive from Mosul. The residents were caught in a fire fight between ISIS militants and Kurdish forces. They fled in packed cars and open trucks, arriving in Erbil this week, says Esa.\nESA: The problem is not in Mosul - around Mosul.\nAMOS: And do you think the Christians can stay where they are? They can stay in their villages?\nESA: We must stay. We must stay. What if all Christians leave Iraq? That's a big problem.\nAMOS: It's the shared opinion of Archbishop Amil Nona, who's going back to Mosul to serve a dwindling Christian community. They are part of the history of a city of called Nineveh in the Bible - part of the long history of Iraq. Deborah Amos, NPR News, Erbil.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=326205937"}
ractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/06/27/326205937/for-iraqi-christians-return-to-captured-city-is-a-fraught-mandate"}
