{"authors":[],"date_download":"2018-10-23 00:16:40","date_modify":"2018-10-23 00:16:40","date_publish":"2017-03-10 06:18:21","description":"Satsuki Sekine's home was destroyed in Japan's 2011 tsunami disaster and her family fled in the nuclear panic that followed. But crueller still were the...","filename":"data/vaneerConsumption/ForJapansnuclearrefugeesinsultsandrejection.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/06/wire-194309-1489126706-516_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300128_For-Japans-nuclear-refugees-insults-rejection_1540253800.html","title":"For Japan's nuclear refugees, insults and rejection","title_page":"For Japan's nuclear refugees, insults and rejection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Students from Fukushima rehearse a play dealing with the stigma they met as evacuees from the tsunami disaster that triggered a nuclear panic\nSatsuki Sekine's home was destroyed in Japan's 2011 tsunami disaster and her family fled in the nuclear panic that followed. But crueller still were the insults and stigmatisation she faced in the community where she sought refuge.\nRather than offer sympathy, Sekine's new classmates bullied her with nasty jibes -- part of an epidemic of discrimination in a nation where the vulnerable and the different can be marginalised.\n\"She's a Fukushima kid. She carries contagious radiation\" were among the taunts the evacuee, now 15 years old, endured in her new home far from the ravaged northeast and the crippled Fukushima nuclear plant.\n\"My house was destroyed in the earthquake and swept away in the tsunami,\" Sekine told AFP. \"One of my relatives died in the disaster. We had to flee from the nuclear accident.\"\n\"After all that, I was bullied at school,\" the 15-year-old said. \"I was so depressed that I wanted to die.\"\nSekine is now living back near her original home, in a region which is slowly recovering from the disaster that drove more than 160,000 people from their homes when the tsunami-lashed plant went into meltdown.\nBut she is just one of many children and adults who have faced insults, ostracism and even violence in towns and cities where they sought sanctuary.\n- 'Just go away' -\nJapan is famed for social order and exquisite manners. But behind the facade is a suffocating group identity that can result in bullying of those who stand out, a dynamic blamed for a high rate of child and adult suicides.\nA bullying expert says schools in Japan have a totalitarian atmosphere that makes children prone to pick on the different\nIn the immediate aftermath of the quake-tsunami disaster which left 18,500 people dead or missing, a sense of solidarity swept Japan as it faced its greatest postwar crisis and municipalities welcomed the displaced.\n\"Ganbarou Nippon\" (Don't give up, Japan) was a common refrain as the nation pulled together.\nBut reaction to the refugees at street level was often cold.\nUrara Aoyama, now 16, tried hard not to let her new classmates know her family came from a town beside the stricken plant.\n\"But word spread when I entered middle school,\" said Aoyama, who, with Sekine, now attends high school in the town of Hirono near their original homes, which remain off limits.\nAoyama too was questioned about the contagiousness of radiation, taunted and told she should just go away.\n\"They said such things behind my back, sometimes intentionally in loud voices so I could hear,\" she said.\n- 'Totalitarian environment' -\nAsao Naito, a bullying expert at Tokyo's Meiji University, said Japan's education system suppresses individuality and makes children prone to pick on the different.\nMore than 160,000 people were evacuated when the tsunami-lashed nuclear plant at Fukushima went into meltdown\n\"So evacuees from Fukushima are preyed upon in the totalitarian environment of Japanese schools,\" he said.\nA recent case in Yokohama, south of Tokyo, stirred outrage after it emerged that a boy had been extorted of 1.5 million yen ($13,000) by classmates.\nHe was also slapped and pushed around and accused of living on government \"compensation\".\nHe swallowed the pain for years while secretly siphoning cash from home to pay his tormenters.\nKei Hida, the family's lawyer, said she believed the boy could not bear to open up to his family knowing his mother had also suffered abuse from neighbours.\n\"Garbage was thrown at her and she received an anonymous letter telling the family to leave the neighbourhood,\" Hida said.\nLawyer Tomohiro Kurosawa said that part of the problem is that for many Japanese the Fukushima evacuees are not seen as \"victims\" as nobody in authority has yet been held accountable.\nNot a single arrest has ever been made, plant operator Tokyo Electric Power Co was rescued with public money, and the government of Prime Minister Shinzo Abe is committed to restarting nuclear plants.\n\"When victims speak out under these circumstances, they appear to criticise the nation and are penalised socially,\" Kurosawa said.\n\"Government policies cloud the status of the victims, creating room for others to reject and attack them.\"\n- Wartime echoes -\nKurosawa, who has represented radiation victims from Hiroshima and Nagasaki, said the stigma imposed on Fukushima has historical echoes of the harsh treatment that survivors of the WWII atomic bombs endured.\nDespite their suffering and their status as the first victims of the atomic age, many were shunned -- in particular for marriage -- due to prejudice over radiation exposure.\nOn returning to Fukushima, Sekine and Aoyama began attending a school which was set up primarily for students from contaminated areas. There, they perform with other students in a play describing the region's ordeal.\n\"Through contact with each other, their scars are gradually healing and they themselves are recovering,\" their teacher Shunichi Kobayashi said of the cast members.\n\"Each of them has experienced all sorts of painful events, so that makes them unite with each other.\"\nActing out their trauma is helping overcome the pain, he said. And Sekine says she now no longer wants to die.\n\"I will not run away from hardship,\" she said.","url":"https://www.dailymail.co.uk/wires/afp/article-4300128/For-Japans-nuclear-refugees-insults-rejection.html"}
