{"authors":[],"date_download":"2018-10-22 23:01:52","date_modify":"2018-10-22 23:01:52","date_publish":"2014-06-09 19:36:46","description":"As the World Cup gets ready to kick off, a look at how Latin American soccer teams are not just about 'futbol' but national pride.","filename":"data/vaneerConsumption/ForLatinoFansWorldCupMeansGamesAndNationalPride.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500611/20140610-carlosbacca-colombia-sl-1755_6e526629378a97fda671f8213026763e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_latino-fans-world-cup-means-games-national-pride-n126611_1540249312.html","title":"For Latino Fans, World Cup Means Games - And National Pride","title_page":"For Latino Fans, World Cup Means Games - And National Pride ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Fans all over the world could not help identifying with the 27-year-old underdog who had started playing soccer professionally in Colombia while driving a bus part-time to make ends meet for his family. Now the World Cup dreams of many Colombians depend on Bacca’s ability to score, especially after all star striker Radamel Falcao could not make Colombia’s national team roster.\nA grocer, a meatpacker, an ice seller, a carnival musician, and other working class players became the first world soccer champions from Latin America, inspiring legions of fans.\nAt other times, games go beyond personal victories to reveal much larger stories about people and countries. In the book \"Soccer in Sun and Shadow,\" Uruguayan writer, human rights activist and soccer fan Eduardo Galeano describes how a grocer, a meatpacker, an ice seller, a carnival musician, and other working class players became the first world champions from Latin America.\nGaleano recounts that the 1924 Uruguayan Olympic team had traveled to Europe on borrowed money, slept on wooden benches, and played friendly soccer games for room and board. Their first game against Yugoslavia attracted nearly 2,000 fans, the Uruguayan flag was flown upside down, and a Brazilian march song was played as their national anthem.\nBut with each match, Uruguay seduced and amazed fans in Paris with their short passes and high-speed dribbling. And after winning the gold Olympic medal, their sky-blue soccer jersey became a flag, a symbol of Latin American pride everywhere.\nToday, soccer has become a high-stakes for-profit business. But as Brazil’s president Dilma Rousseff faces criticism for delayed World Cup construction and stalled public works projects, fans remind us that soccer is still the most popular sport in the world because it inspires us to believe.\n“You can cheer for your team… even when they are not winning, because you hope they will,” said Gomez. And it is through the exalted eyes of a soccer fan that stadiums become temples, and players become gods who allow fans to dream big - and in many cases think of home.","url":"https://www.nbcnews.com/news/latino/latino-fans-world-cup-means-games-national-pride-n126611"}
