{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 22:21:27","date_modify":"2018-10-30 22:21:27","date_publish":"2018-10-30 19:23:27","description":"Two former college football players are suing their school and a fellow a student for falsely accusing them of rape in 2016.","filename":"data/vaneerConsumption/FormerFootballPlayersSueStudentCollegeoverFakeRapeClaim.json","image_url":"https://media.breitbart.com/media/2018/06/yovino-e1528316792992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_10_30__1540938087.html","title":"Former Football Players Sue Student, College over Fake Rape Claim","title_page":"Former Football Players Sue Student, College over Fake Rape Claim","title_rss":"NULL","source_domain":"breitbart.com","text":"Two former college football players are suing their school and a fellow student for falsely accusing them of rape in 2016.\nDhameer Bradley and Malik St. Hilaire, who used to play football for Sacred Heart University in Connecticut, filed a lawsuit against Nikki Yovino, 20, of South Setauket, New York, on October 10, accusing her of slander and inflicting emotional distress.\nThe two also sued Sacred Heart University, accusing the school of wrongfully suspending them. Bradley and St. Hilaire are seeking an undisclosed sum in their lawsuits.\nYovino told Bridgeport, Connecticut, police officers that the two players raped her in the bathroom of a house where an off-campus party had been taking place. The two football players got kicked off the team, lost their scholarships, and got expelled from the university as a result of the accusations.\nThree months later, Yovino recanted the rape accusations when police found her story to be inconsistent. While both players admitted to having sex with her, they told the police it was consensual.\nPolice eventually charged Yovino in February 2017 for lying about the incident, and she pleaded guilty in June 2018 to one count of falsely reporting an incident and one count of interfering with police for fabricating her rape claims.\nA judge later sentenced Yovino in August to a year in jail not too long after she accepted a plea deal for a lighter sentence.","url":"https://www.breitbart.com/sports/2018/10/30/former-college-football-players-sue-student-college-fake-rape-claim/"}
