{"authors":["Alexis Rhiannon"],"date_download":"2018-10-31 01:47:34","date_modify":"2018-10-31 01:47:34","date_publish":"2018-08-27 18:37:35","description":"Desiree Hartsock just fave fans a very exciting, and adorable, pregnancy update. Though she had previously announced a new addition to the family, the former Bachelorette has a followup — Desiree Hartsock Siegfried is pregnant with a boy. The…","filename":"data/vaneerConsumption/FormerBacheloretteDesireeHartsockSiegfriedRevealsShesExpectingABoyInAnAdorableInstagramVideo.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/21efe525-fdde-4153-b467-ecb13d9a5dd1-getty-923171956.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_former-bachelorette-desiree-hartsock-siegfried-reveals-shes-expecting-a-boy-in-adorable-instagram-video-10248041_1540950454.html","title":"Former 'Bachelorette' Desiree Hartsock Siegfried Reveals She's Expecting A Boy In An Adorable Instagram Video","title_page":"Former 'Bachelorette' Desiree Hartsock Siegfried Reveals She's Expecting A Boy In An Adorable Instagram Video","title_rss":"NULL","source_domain":"bustle.com","text":"Desiree Hartsock just fave fans a very exciting, and adorable, pregnancy update. Though she had previously announced a new addition to the family, the former Bachelorette has a followup — Desiree Hartsock Siegfried is pregnant with a boy. The mom-of-one shared the happy news with fans on Sunday, Aug. 26, via a video she posted to her Instagram, and it might just be one of the cutest gender reveals ever.\nIn the announcement video, Desiree and her husband Chris Siegfried bookend their first child, Asher Wrigley, as he eyes a cupcake that's been set in front of him. \"It's a...\" Desiree prods, as the soon-to-be-big-brother takes a bite, revealing a mouth full of blue frosting from the cupcake's core. \"It's a boy!\" his mom squeals, leaning over her very confused son to plant an excited kiss on her husband's lips. \"You're gonna have another boy!\" someone says from the crowd, behind the camera, and as the video is ending, Desiree can be seen welling up, as she starts to say, \"Awww, I'm gonna cry!\" Meanwhile, Asher is busy enjoying his sweet treat.\nAnd the former Bachelorette got even more heartfelt in the caption for the video, where she wrote:\n\"It’s a .......BOY!!!!!!! ☺️💙💙💙💙..Asher’s face is priceless! And we are beyond excited to have another baby boy join our family! Can’t even believe we’re already half way there to meeting him. Our hearts are so full right now.\"\nIt's a happy moment in a home that's already seen its fair share of fairytales. The two-part Season 9 finale of The Bachelorette was one of the most unexpected in the franchise's history, in which early frontrunner Brooks Forester sent himself home because he couldn't return Desiree's feelings. After hours of crying over the departure of the man she'd been poised to choose, Desiree finally opened her eyes to the man who'd been steadily, reliably in front of her the whole time: Chris.\nAgainst all odds, after the most heart-wrenching finale many Bachelor Nation fans had ever seen, the two have built a flourishing life together. Chris and Desiree got engaged during the 2013 finale, married on live television in January of 2015, and welcomed Asher into their lives in October of 2016. And now, with their first child just months short of his second birthday, the Siegfrieds have another on the way, and will expand their little Bachelor Nation family again.\nABC on YouTube\nAll the way back in 2013, no one would've suspected that these two would become one of the most successful couples in the franchise. But when they announced this pregnancy in July via an exclusive with Us Weekly, it was clear that Desiree and Chris are a true Bachelor Nation success story.\nThe pair previously told Us Weekly when they announced Desiree's second pregnancy that things are going to be a little different this time around. \"I wasn't working during the first pregnancy,\" the bridal gown designer revealed, but this time, she hasn't taken time off from her bridal designs. \"I've been putting in the work,\" she told Us Weekly. And Chris hasn't been slacking, either. With his wife focused on her career, he's picked up more responsibilities at home, sharing, \"I’ve jumped back into it; I cook and let Des relax as much as she can.\"\nIt sounds like the pair has a good set-up going, and they're as eager to add the fourth member of their family as Bachelor Nation fans are to meet him.","url":"https://www.bustle.com/p/former-bachelorette-desiree-hartsock-siegfried-reveals-shes-expecting-a-boy-in-adorable-instagram-video-10248041"}
