{"authors":["Lauren Frayer"],"date_download":"2018-10-22 21:43:07","date_modify":"2018-10-22 21:43:07","date_publish":"2018-08-16 00:00:00","description":"Vajpayee served as premier three times. He was a poet and nature lover who tested nuclear bombs. He sparked an arms race with Pakistan, but later launched peace talks and a cross-border bus service.","filename":"data/vaneerConsumption/FormerIndianPrimeMinisterAtalBihariVajpayeeDies.json","image_url":"https://media.npr.org/assets/img/2018/08/16/vajpayee_wide-9eb77a180540e3e65aeb45800e84d075d15fa22c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_16_639251265_former-indian-prime-minister-atal-bihari-vajpayee-dies_1540244587.html","title":"Former Indian Prime Minister Atal Bihari Vajpayee Dies","title_page":"Former Indian Prime Minister Atal Bihari Vajpayee Dies : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Former Indian Prime Minister Atal Bihari Vajpayee Dies\nEnlarge this image toggle caption Gurinder Osan/AP Gurinder Osan/AP\nFormer Indian Prime Minister Atal Bihari Vajpayee, who presided over clandestine nuclear tests that confirmed India as a nuclear power but soured relations with rival Pakistan, died Thursday at the age of 93.\nHis death was announced by a New Delhi hospital, where he had been treated for a kidney infection for the past nine weeks, and by the current prime minister, Narendra Modi, who called him \"a great son of mother India\" and a \"leader with no enemies.\"\nVajpayee was a man of contradictions: He was a poet and nature lover who tested nuclear bombs. He sparked an arms race with Pakistan, but later launched peace talks and a cross-border bus service between Lahore and Delhi. A Hindu nationalist, he helped found the ruling Bharatiya Janata Party, but was considered a moderate compared with other more hard-line BJP leaders.\nHe served as India's prime minister three times: first for just 13 days in 1996, then for about a year beginning in 1998 and then for a full five-year term, from 1999 to 2004.\nVajpayee boosted trade with the United States, and he helped organize a 2000 visit to Delhi by President Bill Clinton, the first American president to visit India since Jimmy Carter did so in 1978.\nFriday was declared a mourning holiday in the capital region of New Delhi. Vajpayee's body was moved late Thursday from a hospital to his Delhi home, where mourners gathered. A funeral and cremation are set for Friday, local media reported.\n\"Today India lost a great son,\" tweeted Rahul Gandhi, leader of the opposition Congress party, adding that Vajpayee was \"loved and respected by millions.\"\nVajpayee was born on Dec. 25, 1924, in Gwalior, in central India. As a teenager, he joined the Rashtriya Swayamsevak Sangh (RSS), a right-wing Hindu paramilitary group that was later briefly banned for alleged involvement in Mahatma Gandhi's assassination, but remains powerful in Indian politics today. In 1942, Vajpayee and his brother were arrested during the Quit India movement, rallying for independence from British rule — which ended five years later.\nIn May 1998, with barely two months in office as prime minister, Vajpayee presided over the Pokhran-II nuclear tests, in which India detonated nuclear bombs in the Rajasthani desert. The tests confirmed India as a nuclear power.\nBut they shattered any trust with neighboring Pakistan, and set off a nuclear arms race.\nEnlarge this image toggle caption B.K. Bangash/AP B.K. Bangash/AP\n\"Madam, I was hurt very much,\" the then-prime minister of Pakistan, Nawaz Sharif, told a reporter in June 1998.\nSharif had believed relations with India were improving. Pakistan waited a few weeks, and then conducted its own nuclear tests.\nVajpayee never married but had a longtime companion who died in 2014 and whose daughter he adopted. She survives him, along with a granddaughter.","url":"https://www.npr.org/2018/08/16/639251265/former-indian-prime-minister-atal-bihari-vajpayee-dies"}
