{"authors":["Chris Summers For Mailonline"],"date_download":"2018-10-23 04:13:21","date_modify":"2018-10-23 04:13:21","date_publish":"2017-04-26 15:50:35","description":"A former minor league hockey player from upstate New York who hired a man to kill his wife has been sentenced to life in prison.","filename":"data/vaneerConsumption/Formerhockeyproissentencedtolifeinprison.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/20/3FA1B4D100000578-0-image-a-7_1493235040283.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447978_Former-hockey-pro-sentenced-life-prison_1540268001.html","title":"Former hockey pro is sentenced to life in prison","title_page":"Former hockey pro is sentenced to life in prison | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former minor league hockey player who hired a man to kill his wife has been sentenced to life in prison.\nThomas Clayton, 37, of Corning, New York, was convicted of hiring Michael Beard to murder his wife Kelley, 35, in September.\nClayton had an alibi as he was at a poker game during the killing, but prosecutors said he hired Beard, 44, to kill his wife.\nScroll down for video\nThomas Clayton has been sentenced to life in prison. Thomas and Kelley Clayton pose together in Caton, New York, in 2014.\nThomas Clayton, (right) 37, hired a man to murder his wife Kelley, (left) 35, in September\nThe Elmira Star-Gazette reported Clayton's daughter, Charlie, seven, wrote in a statement which was read to the court: 'I feel my dad is a coward because he asked Michael Beard to kill my mom.'\nKelley's sister Kim Bourgeois said Charlie and her younger brother Cullen had both suffered from post-traumatic stress disorder.\nAndrea Spirawk, a lifelong friend of Kelley, told the sentencing hearing: 'September 29 2015 the music stopped and everything froze. I ask for the maximum sentence so no one else will ever be hurt by that despicable man.'\nClayton was sentenced in Steuben County Court to life without the possibility of parole.\nHe played hockey at Niagara University and later went on to play as a forward for the Elmira Jackals during the early and mid-2000s.\nClayton met his wife Kelley in Elmira when he was with the Jackals and eventually settled down to have two children.\nThe Claytons had two young children who were home at the time of the attack, and they are now being cared for by family members\nClayton's lawyer Ray Schlather (left) said his client (right) had an alibi and denied he paid Michael Beard to kill his wife\nThe children, a boy and a girl, were both at home at the time of their mother's killing, but were not harmed and are now being cared for by family.\nKelley died from blunt force trauma after being bludgeoned and Beard later confessed to police, although he has since retracted that confession.\nDuring the trial the court heard that Clayton cheated on his wife with multiple women and had repeatedly complained he couldn't afford to divorce Kelley.\nLast week Clayton's defense team tried and failed to get a retrial. The jury deliberated just six hours after a nearly seven-week trial.\nHis attorney Ray Schlather had cast doubt on Beard's account.\nClayton (left) was sentenced to life without parole. His former employee Beard (right) is awaiting sentencing\nClayton told the trial jury he 'had nothing to do with this' and said 'Beard is a liar'.\nAfter retiring from hockey, Clayton bought a franchise offering services such as mold remediation and fire damage clean-up in Elmira.\nBeard faced life in prison without parole if convicted of the first-degree murder charge.\nBut he is thought to have accepted a plea bargain.\nThe defendant is a former hockey player for the Jackals in Elmira, New York, where he met and married his wife","url":"https://www.dailymail.co.uk/news/article-4447978/Former-hockey-pro-sentenced-life-prison.html"}
