{"authors":["Eyder Peralta"],"date_download":"2018-10-23 05:50:01","date_modify":"2018-10-23 05:50:01","date_publish":"2015-05-04 00:00:00","description":"Fiorina joins a crowded field of Republicans seeking the nomination. Retired neurosurgeon Ben Carson announced his campaign on Sunday.","filename":"data/vaneerConsumption/FormerHPCEOCarlyFiorinaAnnouncesShesRunningForPresident.json","image_url":"https://media.npr.org/assets/img/2015/05/04/ap453608819124_wide-301741df2121280f595e4e1a37f6ff72836be226.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_05_04_404139563_former-hp-ceo-carly-fiorina-announces-shes-running-for-president_1540273801.html","title":"Former HP CEO Carly Fiorina Announces She's Running For President","title_page":"Former HP CEO Carly Fiorina Announces She's Running For President : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Former HP CEO Carly Fiorina Announces She's Running For President\nEnlarge this image toggle caption Charlie Neibergall/AP Charlie Neibergall/AP\nCarly Fiorina, the former chief executive of Hewlett-Packard, says she will seek the Republican nomination for the 2016 presidential contest.\nFiorina made the announcement on ABC's Good Morning America and later via a simple tweet.\n\"I am running for president,\" Fiorina tweeted.\nFiorina joins an already crowded field of Republicans vying for the presidency. On Sunday, retired neurosurgeon Ben Carson announced his campaign.\nThe New York Times reports that former Arkansas Gov. Mike Huckabee is expected to join the fray on Tuesday.\nSenators Ted Cruz, Marco Rubio and Rand Paul have all already announced their candidacies. Former Florida Gov. Jeb Bush is still exploring a run.\nThe Times adds:\n\"A former chief executive of Hewlett-Packard, Ms. Fiorina is the second woman to make a run for the White House in this election cycle, following Hillary Rodham Clinton's announcement last month. Ms. Fiorina brings strong business acumen and a promise to be a more compassionate version of Mitt Romney, the 2012 Republican nominee. And she has suggested that she is the perfect antidote to Mrs. Clinton, who many believe has an easy path to the Democratic nomination. \" 'I think that if Hillary Clinton were to face a female nominee, there are a whole set of things she won't be able to talk about,' Ms. Fiorina said at a breakfast in Washington last month.\"\nFiorina ran and lost a Senate bid against Democratic incumbent Barbara Boxer.\nOur friends at It's All Politics have more on Fiorina.","url":"https://www.npr.org/sections/thetwo-way/2015/05/04/404139563/former-hp-ceo-carly-fiorina-announces-shes-running-for-president"}
