{"authors":[],"date_download":"2018-10-30 21:04:23","date_modify":"2018-10-30 21:04:23","date_publish":"2018-09-07 20:14:00","description":"President Donald Trump’s former campaign adviser, George Papadopoulos, who admitted last year...","filename":"data/vaneerConsumption/FormerTrumpadviserPapadopoulostobesentencedinRussiaprobe.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/10/30/Videos/4212647.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_mueller-inves_bcec59585893a3b57d665466baaa4e14__1540933463.html","title":"Former Trump adviser Papadopoulos to be sentenced in Russia probe","title_page":"Former Trump adviser Papadopoulos to be sentenced in Russia probe","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump’s former campaign adviser, George Papadopoulos, who admitted last year to lying to FBI agents investigating Russian election meddling, has been sentenced to 14 days in jail, according to media reports.\n>> Read more trending news\nPapadopoulos, who served as a foreign policy adviser for Donald Trump during the 2016 election, pleaded guilty in October to making false statements to the FBI.\nBREAKING: Judge sentences ex-Trump campaign aide George Papadopoulos to 14 days in prison for lying to the FBI in Russia probe pic.twitter.com/p3B9alKUTo — Reuters Top News (@Reuters) September 7, 2018\n>> Jamie Depree: Ex-Trump campaign aide Papadopoulos gets 2 weeks in jail\nUpdate 5:00 p.m. EDT Sept. 7:\nA federal judge Friday sentenced Papadopoulos, in addition to two weeks in a jail, to 200 hours of community service and a $9,500 fine, according to Politico.\nBREAKING: Papadopoulos sentenced to 14 days in prison, a year of supervision, 200 hours of community service, $9,500 fine. — Kyle Cheney (@kyledcheney) September 7, 2018\nDuring the hearing Papadopolous apologized for misleading investigators, but his attorney, Thomas Breen, blamed Trump, saying the president “hindered this investigation more than George Papadopoulos ever could” by launching a “fake news campaign” and calling the FBI Russia probe a “witch hunt,” Politico reported.\nBefore his sentencing, Papadopoulos addressed the judge and read a speech admitting he “was wrong, ashamed and regretful,” according to CNN.\n>> Related: Trump not considered a criminal target in Russia probe: report\n\"People point and snicker and I am terribly depressed,\" he told the judge. \"This investigation has global implications and the truth matters.\"\n\"I am ready to accept my sentence,\" he added.\nProsecutors had recommended up to six months in jail in the case.\n>> More on Robert Mueller's investigation\nCNN reported that Trump weighed in on the sentence on Twitter, tweeting, “14 days for $28 MILLION - $2 MILLION a day, No Collusion. A great day for America!”\nThe tweet, which CNN reported contained what appeared to be an inaccurate number for the cost of the Mueller investigation, comes after Trump told reporters he doesn’t know Papadopolous.\n“I don't know him,” Trump said on Air Force One Friday afternoon. “I saw him sitting in one picture at a table with me. That's the only thing I know about him. I don't know him. But they got him, I guess, on a couple of lies, I guess that's what they're saying.”\nOriginal story:\nIn court documents, authorities said Papdopoulos lied repeatedly during a January 2017 interview. Those lies, they said, resulted in the FBI missing an opportunity to properly question a professor Papadopoulos was in contact with during the campaign who told him that the Russians possessed \"dirt\" on Hillary Clinton in the form of emails.\n>> Mueller investigation: Former Trump campaign adviser George Papadopoulos pleads guilty\n\"Had the defendant told the FBI the truth when he was interviewed in January 2017, the FBI could have quickly taken numerous investigative steps to help determine, for example, how and where the Professor obtained the information, why the Professor provided the information to the defendant, and what the defendant did with the information after receiving it,\" according to a court filing.\n>> Trump on meeting with former campaign adviser Papadopoulos: 'I don't remember much'\nProsecutors have recommended that Papadopoulos spend some time incarcerated and pay a nearly $10,000 fine. Papadopoulos’s attorneys asked Judge Randolph Moss for leniency in a memo last weekend, CNN reported. He hopes the last 13 months he’s spent under house arrest will convince the judge to excuse him from probation immediately after his sentencing, according to the news network.\n>> Paul Manafort guilty on 8 charges in bank fraud, conspiracy trial; mistrial declared on 10 counts\nPapadopoulos pleaded guilty Oct. 5 to lying to federal authorities investigating Russian election meddling as part of the probe headed by special counsel Robert Mueller. The investigation has since led to charges against nearly three dozen other people and entities accused of crimes ranging from money laundering and falsifying income tax returns to lying to FBI investigators.\nFour people have pleaded guilty to charges stemming from the probe. A jury has also found one person, former Trump campaign manager Paul Manafort, guilty of charges connected to the probe.\nThe Associated Press contributed to this report.","url":"https://www.ajc.com/news/national/mueller-investigation-former-trump-campaign-adviser-sentenced/a09IL9Ga3wR3Z3ahkN4NzK/"}
