{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:23:31","date_modify":"2018-10-30 20:23:31","date_publish":"2015-06-24 21:07:47","description":"On Wednesday, former Senator Jim Webb (D-VA) asked people across the country to stop the feeding frenzy that is leading one politician after another to call for the removal of a Confederate flag from their respective state capitols.","filename":"data/vaneerConsumption/FormerSenatorJimWebbQuitBlamingTheConfederateBattleFlag.json","image_url":"https://media.breitbart.com/media/2014/12/Jim-Web-D-VA-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_24__1540931011.html","title":"Former Senator Jim Webb: Quit Blaming The Confederate Battle Flag","title_page":"Former Senator Jim Webb: Quit Blaming The Confederate Battle Flag","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday, former Senator Jim Webb (D-VA) asked people across the country to stop the feeding frenzy that is leading one politician after another to call for the removal of a Confederate flag from their respective state capitols.\nThis same frenzy has led Senator Majority Leader Mitch McConnnell (R-KY) and Kentucky GOP gubernatorial candidate Matt Bevin to call for the removal of Jefferson Davis’ statue from the Kentucky State Capitol.\nWebb wrote on Facebook: “The Confederate Battle Flag has wrongly been used for racist and other purposes in recent decades. It should not be used in any way as a political symbol that divides us.”\nHe pointed out that the causes behind the Civil War were not as monolithic as some pretend and that many southerners — who were not slave-owners — fought against the North as way of fighting an overreaching central government. At the same time, many slave-owners from the North fought against the South for the corollary reason of protecting northern power.\nWebb put it this way:\nBut we should also remember that honorable Americans fought on both sides in the Civil War, including slave holders in the Union Army from states such as Missouri, Kentucky, Maryland and Delaware, and that many non-slave holders fought for the South.\nWebb’s point is clear: The push to banish the Confederate flag rests on ignorance of the multiple factors leading up the Civil War and an exploitation of the emotion that stands in the place of knowledge.\nWebb added:\nIt was in recognition of the character of soldiers on both sides that the federal government authorized the construction of the Confederate Memorial 100 years ago, on the grounds of Arlington National Cemetery. This is a time for us to come together, and to recognize once more that our complex multicultural society is founded on the principle of mutual respect.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/06/24/former-senator-jim-webb-quit-blaming-the-confederate-battle-flag/"}
