{"authors":[],"date_download":"2018-10-30 20:45:22","date_modify":"2018-10-30 20:45:22","date_publish":"2014-06-29 17:50:31","description":"UGA’s Joseph Ian Davis, of Dunwoody, also died in wreck near LaGrange, Ga.","filename":"data/vaneerConsumption/FormerAuburnstarLutzenkirchenkilledincarcras.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/06/30/Videos/3651395126001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_former-auburn-star-lutzenkirchen-killed-car-crash__1540932322.html","title":"Former Auburn star Lutzenkirchen killed in car cras","title_page":"Georgia News: Former Auburn star Lutzenkirchen killed in car cras","title_rss":"NULL","source_domain":"ajc.com","text":"Former Auburn star tight end Philip Lutzenkirchen was killed in a car crash near LaGrange early Sunday.\nThe 23-year-old from Marietta died around 3 a.m. in a one-vehicle accident at the intersection of Upper Big Springs Road and Lower Big Springs Road, the Georgia State Patrol said.\nThe University of Georgia’s Joseph Ian Davis, 22, of Dunwoody, was driving a 2006 Chevrolet Tahoe with three passengers, including Lutzenkirchen, who was in the back seat of the SUV, GSP said. At the T-shaped intersection, Davis apparently missed a stop sign. The SUV barreled about 450 feet through a church yard and flipped over several times before coming to rest on its roof. Davis was partially ejected and killed. Lutzenkirchen was ejected.\nTwo others were injured, the GSP said. Back seat passenger Elizabeth Ann Seaton Craig, 22, of Eatonton, was transported to West Georgia Medical Center in LaGrange. Front seat passenger Christian Tanner Case, 20, from Dadeville, Ala., was treated and released from West Georgia Medical. Case was wearing a seat belt, the state patrol said.\nBlood was drawn from Davis to determine if he had been drinking before the wreck, authorities said. Davis, a baseball player who attended UGA, was listed on GeorgiaDogs.com, but was not on the team’s spring roster.\nAuburn head coach Gus Malzahn issued a statement in the wake of the accident saying: “On the field, Philip was a great player and competitor, but more importantly, he was a great teammate and friend off the field. My thoughts and prayers are with Philip’s parents, Mike and Mary, and all of his family and friends who are grieving his passing. This is a sad day for the entire Auburn family.”\nAuburn athletic director Jay Jacobs echoed those thoughts in his own statement, calling Lutzenkirchen, “the epitome of an Auburn man. I came to know Philip well and I admired everything about who he was and the way he lived his life. He had a strong faith, a big heart and a burning desire to help others. Philip was a bright light this world desperately needed, and his death leaves a void that can’t possibly be filled.”\nLutzenkirchen was one of the state’s top college prospects out of Lassiter High School in Marietta in 2009 when he signed with Auburn. While at Lassiter, the 6-foot-5 Lutzenkirchen caught 72 passes for 1,000 yards, was named the No. 6 tight end by ESPN.com, and was named to The Atlanta Journal-Constitution’s Super Southern 100. At Auburn, he went on to rank first in the number of touchdown catches by a tight end: 14, still the school record. He was a member of the Tigers’ 2010 national championship team.\nLassiter High’s @LassiterSports account tweeted: Trojan Nation mourns the death of our beloved Phillip @lutzenkirchen. Our deepest sympathies to his family and others.\nLutzenkirchen was a teammate and close friend of Georgia quarterback Hutson Mason from their days at Lassiter High.\nEven after he was at Auburn, Lutzenkirchen would come back to Lassiter, especially to watch his younger sister, Abby, play soccer, said Jep Irwin, current Lassiter head football coach.\n“He’d come work in the weight room or catch passes with Hutson if he was around,” Irwin said. “He gave so much back to the Lassiter community and that group of players he was a part of in 2008 really put us on the map. He was a major player in that.”\nDavis, a junior at UGA, was a catcher who transferred to Georgia from USC-Sumter Junior College this past fall with the hopes of making the Bulldogs’ 2014 roster. He did not make team but remained close to the players and coaches. An honor roll student, he was set to graduate and his baseball career was over.\n“You’re just kind of speechless when you hear something like that,” said Georgia baseball coach Scott Stricklin, who heard news of the crash from another Bulldogs player early Sunday afternoon. “He was a kid who had so much ahead of him. He was just a great kid, one of those kids when he walked into a room he lit it up. A really, really bright kid who everybody liked being around. We’re all just really, really heartbroken and our thoughts and prayers go out to his family.”\nStricklin said he had not yet been in touch with Davis’ parents, Swanton and Geena Davis of Dunwoody.\n“It’s a bit of a whirlwind right now,” he said. “I can’t imagine what they’re going through.”\nAs for Lutzenkirchin, Irwin said the former player had been doing some work with a private school in Montgomery and was looking toward being a coach.\n“We were just rooting for him to have wonderful life,” Irwin said.\nStaff writer Taylor West contributed to this report.","url":"https://www.ajc.com/news/former-auburn-star-lutzenkirchen-killed-car-crash/cwDt1hPQyO3Gg7nUKSOp5N/"}
