{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:02:52","date_modify":"2018-10-30 19:02:52","date_publish":"2015-02-06 14:49:54","description":"Americans, including a former U.S. soldier, and other Westerners have joined Kurdish forces battling Islamic State (ISIS, ISIL) jihadists on the ground in Iraq. |","filename":"data/vaneerConsumption/FormerUSSoldierOtherWesternersJoinKurdsinIraqtoBattleISIS.json","image_url":"https://media.breitbart.com/media/2015/02/jordan-mason-fighting-with-kurds-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_06__1540926172.html","title":"Former US Soldier, Other Westerners Join Kurds in Iraq to Battle ISIS","title_page":"Former US Soldier, Other Westerners Join Kurds in Iraq to Battle ISIS | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Americans, including a former U.S. soldier, and other Westerners have joined Kurdish forces battling Islamic State (ISIS, ISIL) jihadists on the ground in Iraq.\n“I’m not going back until the fight is finished and ISIS is crippled,” former U.S. Army soldier Jordan Matson, a 28-year-old from Sturtevant, Wisconsin told The Associated Press. “I decided that if my government wasn’t going to do anything to help this country, especially Kurdish people who stood by us for 10 years and helped us out while we were in this country, then I was going to do something.”\nMatson was described by AP as carrying “a sniper rifle slung over his shoulder and [wearing] a Rambo-styled bandanna around his head.”\nAP spoke to Matson, three other Americans, and an Australian national.\nThe Kurds hope to draw in more foreign fighters like Matson, who AP said wears a tactical vest with the epithet “Christ is Lord” written on it.\nMatson and dozens of other Westerners have now joined the Kurdish ranks, persuaded by Kurdish campaigns featured on social media sites such as Facebook, and a sense of duty rooted in the U.S.-led war in Iraq.\nThe actual number of foreign fighters fighting alongside the Syrian Kurdish militias known as the People’s Protection Units (YPG) and other Kurdish troops is unknown.\nHowever, foreigners and Kurds alike place the estimates in the “dozens,” AP pointed out.\nOn the other side of the coin, the State Department estimates that ISIS counts with the support of more than 18,000 foreign fighters, including at least 3,000 Westerners.\nA dozen or more Americans are believed to be among the Westerners. The foreign fighter force reportedly includes individuals who have traveled to Syria from over 90 countries. At least a handful of Americans are believed to have died after traveling to Syria to partake in the war.\n“You need to know what you’re getting into,” he added. “A lot of times you’re going out, you’re in a mud hut. … You have bullets and a blanket, and sometimes you just have bread, but you need to hold the line.”\nOverall, ISIS can assemble between 20,000 and 31,500 fighters across Iraq and Syria.\n“We remain concerned about the flow of foreign terrorist fighters into and out of Syria and Iraq,” said Katherine Pfaff, a State Department spokeswoman. “We are continuing our engagement closely with partners to counter the flows of foreign terrorist fighters.”\nThere are more than 150 Americans who have traveled or attempted to travel to Syria and Iraq either to fight or otherwise support the conflict, according to the State Department.\nPrior to joining the Kurdish offensive that battled its way into Iraq in January, foreign fighters reached civil war-torn Syria through Turkey. That is the same route that many foreign fighters use to join ISIS.\nUnlike the Australians, Americans are not yet prohibited by their government from fighting with militias against ISIS.\nState Department bulletins warn Americans against traveling to Iraq and Syria, citing security concerns.\nAlthough the U.S. lists the Turkey-based Kurdish Worker’s Party (PKK) as a terrorist organization, PKK members have joined the Syrian Kurds in the fight against ISIS.\nThe Pentagon and State Department declined to comment on Americans fighting against ISIS.\nBreitbart News was referred to the Departments of Justice (DOJ) and Homeland Security (DHS), but they did not immediately respond to requests for comment.\nThe U.S. Embassy in Baghdad also failed to immediately respond to an Associated Press query on the Americans joining the kurds in fighting ISIS.\nAmericans who travel to join ISIS may face repercussions when they get home, something that U.S. officials told Breitbart News would be handled by DHS and DOJ.\nIt will be difficult for the U.S. government to differentiate between those who are fighting for ISIS and those who are fighting against.\nWhile the U.S.-led coalition launches airstrikes against ISIS targets in Iraq, the Kurds and their foreign recruits battle the jihadists on the ground.\nPresident Obama has said on numerous occasions that there will be no U.S. ground troops directly involved in combat operations against ISIS.\nSinjar in Iraq is were the Kurdish fighters and their foreign counterparts are based. That is where thousands of Yazidi residents hid in the surrounding mountains in 2014 during an ISIS led an offensive.\nDefending Kurds, Yazidis, and other ethnic minorities from Islamic extremists is a motivating factor for foreigners like Matson.\n“How many people were sold into slavery or killed just for being part of a different ethnic group or religion?” Matson said. “That’s something I am willing to die to defend.”","url":"https://www.breitbart.com/national-security/2015/02/06/former-us-soldier-other-westerners-join-kurds-in-iraq-to-battle-isis/"}
