{"authors":[],"date_download":"2018-10-30 21:15:19","date_modify":"2018-10-30 21:15:19","date_publish":"2018-09-08 23:17:00","description":"MINNEAPOLIS — The day after a grand jury report revealed that Roman Catholic clergy in Pennsyl...","filename":"data/vaneerConsumption/FormerAtlantanamongCatholicfaithfuldemandingchangeafterse.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/08/Images/Alexanderpic.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_former-atlantan-among-_a9b072ee85994eeec91d6b27609fc469__1540934119.html","title":"Former Atlantan among Catholic faithful demanding change after se","title_page":"Former Atlantan among Catholic faithful demanding change after se","title_rss":"NULL","source_domain":"ajc.com","text":"MINNEAPOLIS — The day after a grand jury report revealed that Roman Catholic clergy in Pennsylvania molested more than 1,000 children over decades, Adrienne Alexander went to Mass at a Chicago church and waited for the priest to say something about the situation.\nHe didn't.\nAnd that left Alexander fuming. So the former Atlanta resident went on Facebook to vent — then organized a prayer vigil in Chicago that became the catalyst for similar laity-led vigils in Boston, Philadelphia and other cities nationwide.\nAlexander — who attended St. Anthony of Padua Catholic Church when she lived in metro Atlanta and is an Agnes Scott College alumna — is among countless Catholics in the U.S. who are raising their voices in prayer and protest to demand change amid new revelations of sex abuse by priests and allegations of widespread cover-ups.\nThey are doing letter-writing campaigns and holding prayer vigils and listening sessions in an effort to bring about change from the pews, realizing it's up to them to confront the problem and save the church they love after years of empty promises from leadership.\n\"I think it's important that the large body hears from us,\" Alexander said. \"We actually make up the church.\"\nTheir grassroots efforts are gaining momentum. In the last week more than 39,000 people have signed their names to a letter demanding answers from Pope Francis himself.\n» RELATED: Pennsylvania report on Catholic abuse cases draws reactions in Atlanta\nAnother effort, sponsored by reform groups, has seized upon the \"Time's Up\" and #MeToo movements and is organizing events across the country this weekend under the CatholicToo hash tag.\nSome of the efforts are calling for specific reforms, such as laity-led investigations and transparency, while others are still brainstorming solutions. One woman in Michigan founded a website to make it easy for anyone to speak up and write to church officials.\n\"I've never seen anything like this before,\" Marjorie Murphy Campbell, a civil and canon lawyer in Park City, Utah, said of the laity's engagement. She said many Catholics feel they have no choice.\n\"You either have to get involved now, because you cannot trust the bishops to solve this themselves, or you leave. ... It's our job to help the mother church get through this.\"\nThe actions come as the church is facing a global crisis over clergy abuse following the scathing Pennsylvania grand jury report and the pope's removal of ex-Cardinal Theodore McCarrick from public ministry amid allegations McCarrick sexually abused a teenage altar boy and preyed upon adult seminarians decades ago.\nFrancis wrote a letter to Catholics in August, saying the laity must help end the clerical culture that has placed priests above reproach. He then found himself immersed in the scandal amid claims that he knew about allegations against McCarrick in 2013, but rehabilitated him anyway.\nA collective of individual Catholic women last week wrote a letter urging Francis to deliver answers. The letter, which had more than 39,000 signatures by Friday, declared \"we are not second-class Catholics to be brushed off while bishops and cardinals handle matters privately.\"\n\"In short, we are the Church, every bit as much as the cardinals and bishops around you,\" the letter said.\nRobert Shine, a Catholic in Boston and vice president of the Women's Ordination Conference, said he believes Catholics are now ready to confront what's been happening in the church and talk about how they can be involved in reform, reflecting a broader trend in the U.S. with people getting more active in protests. Other denominations have been struggling with the issue as well.\n\"People are less willing to look the other way ... This new consciousness and new honesty about politics is sort of being transferred to the Catholic Church as well.\"\nMiriel Thomas Reneau of Ann Arbor, Michigan, founded a website to make letter-writing easy. Her site lists the names and addresses of local dioceses and includes templates for people to write letters to church leaders.\nOthers are withholding donations in protest. Legatus, an association of Catholic businessmen, announced it would put its annual tithe to the Holy See in escrow. Thousands of people have also signed a statement that calls on Catholic bishops in the U.S. to consider resigning as a public act of repentance.\nThere are examples of laity forcing change in other countries. In the city of Osorno, Chile, a group of lay members organized themselves to raise attention to the sex abuse crisis, and their movement helped throw out a bishop. It took more than three years, but they decided it was necessary to try to change their church from within.\nLori Carter of Ocean Springs, Mississippi, and two other women started a \"Wear Gray\" campaign in which they are urging \"prayer warriors\" like themselves to wear gray to Mass and fast as a symbol of repentance. They are also asking people to write letters to the pope and local bishops.\n\"I'm assuming it's going to have to go back to sort of how it was — a church of the people and prayer and holiness,\" she said.\nIn this Friday, Sept. 7, 2018 photo, Chris Damian poses in Minneapolis. Damian believes having more nuanced conversations about hard topics like sex abuse by priests and allegations of cover-ups by church leaders can bring about change. Damian, 27, has organized a group of Catholic young adults to respond to the church crisis. (AP Photo/Jim Mone)\nIn Minneapolis, Chris Damian believes having more nuanced conversations can bring about change.\nDamian, 27, organized a group of Catholic young adults to respond to the church crisis. The group has held a public prayer session, which St. Paul-Minneapolis Archbishop Bernard Hebda attended, as well as a discussion session where more than 100 people gathered to learn about the issue and brainstorm solutions.\nThe group is sending a letter to Hebda that urges pastors to listen to lay people, instead of telling them what to do. The letter also lists concrete recommendations, such as waiving confidentiality agreements for all past settlements and reopening the investigation into a former St. Paul-Minneapolis archbishop who resigned in 2015 after prosecutors filed criminal charges against the archdiocese for failing to protect children from an abusive priest.\n\"We're all really frustrated because things continue to pop up and that's just not acceptable,\" Damian said. \"I think we can spend all this time complaining about how churches aren't being more proactive ... but there's no reason why we can't take this issue and make the solution our own responsibility.\"\nAssociated Press writer Eva Vergara contributed to this report from Santiago, Chile.","url":"https://www.ajc.com/news/former-atlantan-among-catholic-faithful-demanding-change-after-sex-abuse-scandals/OyhfmPX6aZ8uT5IbiSURiJ/"}
