{"authors":["Frances Martel"],"date_download":"2018-10-30 19:24:27","date_modify":"2018-10-30 19:24:27","date_publish":"2015-01-28 18:36:09","description":"A Venezuelan defector to the United Staes plans to file a complaint against Diosdado Cabello for leading a drug smuggling ring.","filename":"data/vaneerConsumption/FormerSecurityChiefAccusesVenezuelasSecondinCommandofLeadingDrugRing.json","image_url":"https://media.breitbart.com/media/2015/01/Diosdado-Cabello-Venezuela-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_28__1540927467.html","title":"Former Security Chief Accuses Venezuela's Second-in-Command of Leading Drug Ring","title_page":"Former Security Chief Accuses Venezuela's Second-in-Command of Leading Drug Ring | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The former head of security for Venezuelan President Hugo Chávez and for current President of the National Assembly Diosdado Cabello has defected to the United States and plans on filing a formal complaint against Cabello for leading a drug smuggling ring.\nLeamsy Salazar is the highest-ranked Venezuelan soldier to ever defect to the United States, and he served as Chávez’s head of security and personal assistant for ten years until the leader’s death.\nAs Spanish newspaper ABC details, Salazar arrived in the United States Tuesday after fleeing Caracas. He is being given protected witness status and being monitored by DEA agents. Salazar will testify against Cabello, accusing him of heading the Cartel de los Soles, a drug ring believed to traffic millions of dollars in drugs between Venezuela and North America. Sources in the southern district of New York tell ABC that Salazar will also accuse the Cuban government of protecting drug smugglers from Venezuela and assisting in creating safer shipment routes to ensure the United States government did not catch the smugglers.\nAs head of security, Salazar claims to have heard conversations in which Cabello gave direct orders to ship large vessels full of “tons of cocaine” and had been privy to information regarding where the drugs were kept before being sent out.\nThe “Cartel de los Soles” (or “Cartel of the Suns”) is so named because it is believed to be run almost exclusively by men in the Venezuelan military; the “sun” is a reference to a design on the Venezuelan military uniform.\nAlso implicated in the drug ring by Salazar is Tareck el Aissami, the governor of Venezuela’s Aragua state and the nation’s head of Islamic Relations. Venezuela maintains friendly relations with Iran and has exhibited its ties overtly with both Syria’s Bashar al-Assad and the Palestinian Authority. Aissami has responded to the allegations by accusing the opposition of targeting Cabello because he is loyal to the socialist cause. “The attacks of the decadent and fascist right commit us even more … to make the Revolution irreversible,” he wrote on his Twitter account.\nCabello himself has also responded to the allegations by denying that Salazar was his chief of security. “I noticed that he refused to look one in the face,” Cabello explained on Colombian radio, “and I requested that he be deployed to further training.” Cabello told the radio show that Salazar refused training and left the country in December.\nVenezuelan newspaper El Universal adds that Cabello also took to insulting Salazar, stating, “It is [shocking] how someone can have such little ethical conviction to sell themselves for money. Now he has to prove that what he says is true.”\nCabello is considered among the most powerful figures in Venezuela. As the highest ranking military official in the country, many have speculated that he has more sway with the nation’s military than President Nicolás Maduro—a former bus driver—and may be plotting to take Maduro’s place. Such rumors have only proven speculation so far, however, and an indictment in the New York court system may further diminish his influence in the country.","url":"https://www.breitbart.com/national-security/2015/01/28/former-security-chief-accuses-venezuelas-second-in-command-of-leading-drug-ring/"}
