{"authors":["Associated Press","Dailymail.Com Reporter"],"date_download":"2018-10-23 04:09:00","date_modify":"2018-10-23 04:09:00","date_publish":"2016-01-28 19:59:52","description":"A New Jersey judge has ordered Arthur Lomando held on $5million bail in the October 2015 killing of special education teacher and divorced mother-of-two Suzanne Bardzell.","filename":"data/vaneerConsumption/FormerNYPDofficerArthurLomandopleadsnotguiltytoexgirlfriendsmachetemurder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30AD274E00000578-0-image-a-16_1454011132256.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421606_Former-NYPD-officer-lost-feet-suicide-attempt-pleads-not-guilty-ex-girlfriend-s-machete-killing_1540267740.html","title":"Former NYPD officer Arthur Lomando pleads not guilty to ex-girlfriend's machete murder","title_page":"Former NYPD officer Arthur Lomando pleads not guilty to ex-girlfriend's machete murder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former New York City police officer who investigators say jumped in front of a train after killing his former girlfriend with a machete has pleaded not guilty to the slaying.\nArthur Lomando appeared in court in Hackensack, New Jersey, on Thursday and had his lawyer enter the plea on his behalf for a murder charge in the October death of Suzanne Bardzell.\nAuthorities say the 44-year-old cop ambushed Bardzell, 48, in her car in Midland Park, New Jersey, and hours later jumped in front of the New York subway.\nFormer NYPD officer Arthur Lomando is wheeled into a courtroom for his initial appearance Thursday in Hackensack New Jersey, where he pleaded not guilty in the killing of his ex-girlfriend\nLomando, who had both feet amputated, is suing New York City's transit authority for $50million, claiming he was either jostled, slipped or was hit by falling debris\nBrutal killing: Lomando (left) is accused of slaying Suzanne Bardzell (right) with a machete-like knife as she sat inside her car in the driveway of her New Jersey home in October 2015\nOn Thursday, Lomando was escorted into Judge Susan Steele's courtroom in a wheelchair for a 10-minute hearing, which concluded with his bail being set at $5million.\nLomando's defense attorney asked the judge to address 'real troubling allegations of mistreatment' during his detention at the Bergen County Jail, claiming that the double-amputee has been given no medication and was in need of urgent care, reported NJ.com.\nSuzanne Bardzell's family, including her ex-husband, were in attendance at the hearing but did not speak to the media, according to NorthJersey.com.\nLast week, Lomando filed a $50million lawsuit against the New York City transit authority claiming he fell from a platform at the subway station at Amsterdam and St Nicholas avenues in Harlem after he was jostled by a crowd of riders or slipped.\nThe 44-year-old man hit debris as he fell, and had to have both his feet amputated.\nAuthorities believe Lomando tried to kill himself by jumping in front of a train in the wake of Suzanne Bardzell's grisly killing.\nLomando was wanted by police after the woman's blood-soaked body was discovered in her parked car on the driveway of her New Jersey home.\nThe grim discovery was made by officers at around 3.30pm on October 22, Bergen County prosecutor John Molinelli told the New York Daily News.\nA judge set Lomando's bail at $5million during Thursday's 10-minute hearing, which was attended by the victim's family\nLomando's defense attorney told a judge his client has been denied medical care while in jail\nLomando was alleged to have repeatedly struck the 48-year-old special education teacher with a large machete shortly after she pulled into the driveway of her home.\nThe Volkswagen SUV was still running when officers arrived at the scene.\nA warrant for Lomando's arrest was issued by detectives investigating her death.\nAt 4.30pm that day, officers found Lomando after learning that a man had thrown himself under a train.\nHe was taken to Harlem Hospital Center, where he underwent surgery for severe head and leg injuries.\nThe special education teacher, who had two teenage sons from a previous marriage, was said to have met Lomando online three years ago.\nHer death came after she filed an order of protection notice against her boyfriend following a number of domestic violence incidents.\n'There's a history of domestic violence between them - they were in a dating relationship for three years, and it looked like for the entire three years, there had been some instance of violence between them,' Mr Molinelli told a press conference at the time.","url":"https://www.dailymail.co.uk/news/article-3421606/Former-NYPD-officer-lost-feet-suicide-attempt-pleads-not-guilty-ex-girlfriend-s-machete-killing.html"}
