{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:08","date_modify":"2018-10-30 19:55:08","date_publish":"2016-01-07 17:27:33","description":"Admitting there is \"zero\" chance of congressional gun control action, a former Bill Clinton official called on Obama to regulate ammo sales.","filename":"data/vaneerConsumption/FormerBillClintonOfficialObamaMustExpandExecutiveActionstoRegulateAmmoSales.json","image_url":"https://media.breitbart.com/media/2015/06/2086942398_34ced80346_z.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_07__1540929308.html","title":"Former Bill Clinton Official: Obama Must Expand Executive Actions to Regulate Ammo Sales","title_page":"Former Bill Clinton Official: Obama Must Expand Executive Actions to Regulate Ammo Sales","title_rss":"NULL","source_domain":"breitbart.com","text":"In a January 6 op-ed admitting there is “zero” chance of congressional action on gun control, Ann Brown, a former Bill Clinton administration official, called on President Obama to expand his executive gun control with one more act: regulate ammunition sales.\nWriting in The Washington Post, Ann Brown, who served as chairman of the U.S. Consumer Product Safety Commission during Bill Clinton’s presidency, said, “On Tuesday, President Obama unveiled a package of executive actions that he hopes will reduce gun deaths in the United States. I urge him to put one more proposal on the table: regulating ammunition. The idea is workable, and Americans could support it.”\nNote: Brown said Americans “could support it,” not that they would support it.\nAnd she spends the rest of her op-ed presenting three reasons she believes Americans ought to get behind the idea of regulating ammunition the way the federal government regulates firearms.\nHer first reason is her claim that “ammunition limits are clearly not prohibited by the Second Amendment.” This statement would be rejected out of hand by lawmakers. In fact, it already has been. During the Obama administration’s attempted AR-15 ammo ban last year, 100 members of Congress banded together to oppose the ban because it interfered with the Second Amendment.\nBrown’s second reason is that “Americans generally support restrictions on ammunition.” She supports this assertion by pointing to a poll that showed support for a ban on “high capacity” magazines on January 18, 2013–the immediate aftermath of the heinous attack on Sandy Hook Elementary School.\nHer third reason is that the government has “the technology” to enforce such a ban. She points to Aurora gunman James Holmes, who passed a background check for all his weapons, then “bought more than 4,000 rounds of ammo” online. She wants a scenario where limits are set for allowable ammunition purchases, where the government monitors those purchases and prevents gun owners from stockpiling rounds.\nOr–option B–online ammo purchases could be prohibited altogether. Thus, Brown ultimately suggests government regulations that require a “license [for] ammunition purchases like drivers, ban online purchases and mandate background checks for [ammo] buyers.”\nAnd she wants Obama to do all this through executive action.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/01/07/former-bill-clinton-official-obama-must-expand-executive-actions-regulate-ammo-sales/"}
