{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:38:39","date_modify":"2018-10-30 19:38:39","date_publish":"2016-12-02 11:42:32","description":"Fearing Donald Trump’s presidency, Iran is accelerating its vision for regional hegemony by bolstering arms for its Middle East proxies.","filename":"data/vaneerConsumption/FormerIsraeliIntelOfficialFearingTrumpPresidencyIranToSpeedUpArmingTerrorProxies.json","image_url":"https://media.breitbart.com/media/2016/11/hezbollah-members-flags-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_02__1540928319.html","title":"Former Israeli Intel Official: Fearing Trump Presidency, Iran To Speed Up Arming Terror Proxies","title_page":"Former Israeli Intel Official: Fearing Trump Presidency, Iran To Speed Up Arming Terror Proxies","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Fearing Donald Trump’s impending presidency, Iran is accelerating its vision of regional hegemony by bolstering its efforts to arm its Middle East proxies, a former director-general of Israel’s Ministry of International Affairs and Strategy told the Algemeiner Wednesday.\nAccording to IDF Brig. Gen. (res.) Yosef Kuperwasser, Iran is concerned that a Trump administration will obstruct its operations in Syria. Kuperwasser’s remarks came after Arabic-language media reported an Israeli Air Force strike that targeted Lebanon-based terrorist organization Hezbollah near Damascus Tuesday night.\nWhile Kuperwasser would not directly confirm whether or not Tuesday’s strike actually took place, he said that “based on past such cases, there is good reason to believe it did.”\nKuperwasser maintained that a strike at this time would have occurred as the result of intelligence gathered by Israel on specific weapons convoys, the report said. He also noted that the IDF is keeping a close eye on Iran’s proxy Hezbollah, which “has been gaining in strength” while fighting for the Assad regime in Syria.\nRegarding Jerusalem’s cooperation with Moscow, Putin will ensure that Hezbollah’s increased power in Syria does not extend to its home territory of Lebanon. Putin’s interest, Kuperwasser said, “is for Hezbollah to be armed for fighting in the Syrian civil war, not for other purposes.”\n“There is a mutual understanding of each other’s interests. Though Russia and Iran are backing Hezbollah combat rebel forces fighting against the Assad regime, Russia understands that Israel cannot allow weapons from Hezbollah in Syria to be moved to Lebanon, where they will be aimed at the Jewish state,” he added.\nHezbollah and the Iranian Revolutionary Guards have assumed critical leadership roles in Aleppo, overseeing Shiite militiamen who are recruited by and trained in Iran.\nHowever, even with Hezbollah’s increased muscle and its attempts to intimidate the Jewish state, including, most recently, a military parade in Homs, Syria to show off its “highly trained” army, the greatest concern for Israel at the moment is not Hezbollah, Kuperwasser said. “It is, rather, Iran’s increasing territorial contiguity — crossing Iraq, Syria and Lebanon.”\nFormer Shin Bet director Avi Dichter said this month that Iran now commands a force of some 25,000 Shiite militants in Syria.\n“History proves that whenever Iranians craft groups like these, such as Lebanese Hezbollah, they don’t give up arms, they don’t stand down and they don’t leave territory that they’ve taken,” he said. “They will be in Syria for years and years, and that will have consequences for everyone.”","url":"https://www.breitbart.com/middle-east/2016/12/02/fmr-israeli-intel-official-fearing-trump-presidency-iran-to-speed-up-arming-terror-proxies/"}
