{"authors":[],"date_download":"2018-10-30 14:34:27","date_modify":"2018-10-30 14:34:27","date_publish":"2015-06-22 22:52:14","description":"A century old granite quarry will no longer be a 400-foot deep hole in the ground. The city of Atlanta will soon bore a five-mile long tunnel from the Chattahoochee River to fill the quarry with an estimated 2.","filename":"data/vaneerConsumption/Formerrockquarrytobecomeoneofthelargestreservoirsin.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/WSBTV/2015/06/22/Images/photos.medleyphoto.7484535.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_former-rock-q_3e90aa88a7d3ec79a435743b462b8707__1540910067.html","title":"Former rock quarry to become one of the largest reservoirs in...","title_page":"Former rock quarry to become one of the largest reservoirs in...","title_rss":"NULL","source_domain":"ajc.com","text":"A century old granite quarry will no longer be a 400-foot deep hole in the ground.\nThe city of Atlanta will soon bore a five-mile long tunnel from the Chattahoochee River to fill the quarry with an estimated 2.5 billion gallons of water.\n\"Once we fill this quarry, we will be able to have a 30-day raw water supply, which can be extended to perhaps 60 or 90 days, if we use conservatively,\" said Atlanta Department of Watershed Management Commissioner Jo Ann Macrina.\n>> Read more trending stories\nThe city of Atlanta purchased the Bellwood Quarry years ago with the intention of converting it into a water storage vessel. Last week, the Atlanta City Council gave the green light for the $270 million project.\nNew pumping stations will be built to draw water through a 10-foot wide tunnel, 200 feet beneath the ground. The tunnel will connect to the Hemphill Water Treatment Plant. A second tunnel will connect the plant to the quarry.\nCurrently, Atlanta only has a 3-day backup water supply in the event of a severe drought or emergency.\n\"By putting this tunnel in, the mayor is insuring we will have a minimum of 100 years of reliable water supply, and that could potentially stretch up to 200 years,” Macrina said.\nRecent events, including river water contamination in West Virginia and drought in the western United States, underscore the critical need for a dependable emergency water supply, according to Macrina.\n\"Our last major drought was in 2008, and with climate variability, we don't know when another drought will hit us,\" Macrina said.\nOnce the tunnel is completed, it's expected to take two weeks to fill the quarry.\nThe depth of the reservoir will be anywhere from 250 to 300 feet deep.\n\"It's unbelievable. It's going to look like a lake. People won't know how deep it is. It's going to be real deep,\" said Atlanta Department of Watershed Management Field Engineer Nathaniel Greenhowe.\nThe first phase of the reservoir is scheduled for completion in 18 months. The reservoir is expected to be one of the largest urban storage reservoirs in the United States.","url":"https://www.ajc.com/news/national/former-rock-quarry-become-one-the-largest-reservoirs-country/3jlm1QmZvCxOt68G8HdBJN/"}
