{"authors":["James Cook"],"date_download":"2018-10-30 20:49:56","date_modify":"2018-10-30 20:49:56","date_publish":"2016-12-26 00:00:00","description":"Lord King was interviewed on BBC Radio 4's Today programme and urged the UK to pursue a more 'self-confident' Brexit.","filename":"data/vaneerConsumption/FormerBankofEnglandgovernorLordKingsaystheUKshouldquitthesinglemarket.json","image_url":"https://amp.businessinsider.com/images/5860e922dd0895a27f8b49a6-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_former-bank-of-england-governor-mervyn-king-says-the-uk-should-quit-the-single-market-2016-12_1540932596.html","title":"Former Bank of England governor Lord King says the UK should quit the single market","title_page":"    Former Bank of England governor Lord King says the UK should quit the single market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Former Bank of England governor Lord King. Getty Images News Lord King, the former governor of the Bank of England, has said in a new interview that the UK should be more \"self-confident\" over Brexit, and suggested that it should leave the single market.\nThe peer gave an interview to BBC Radio 4's Today programme in which he was asked about the possible outcomes of the UK's vote to leave the EU.\n\"I think the challenges we face mean it's not a bed of roses — no-one should pretend that,\" Lord King said. \"But equally it is not the end of the world and there are some real opportunities that arise from the fact of Brexit we might take.\"\n\"There are many opportunities and I think we should look at it in a much more self-confident way than either side is approaching it at present.\"\nLord King said it would be \"more difficult\" to take advantage of the opportunities of leaving the EU if the UK remained in the single market. \"We can redesign our own subsidies in many ways,\" he said. \"I don't think it makes sense for us to pretend that we should remain in the single market and I think there are real question marks over whether it makes sense to stay in the customs union. Clearly if we do that we cannot make our own trade deals with other countries.\"\nA poll in November found that 90% of Leave voters backed staying in the single market, and 94% of Remain voters also wanted to stay. However, Brexit minister David Davis has said that Britain may consider making payments to the EU in order to retain access to the single market.\n\"The major criterion here is that we get the best possible access for goods and services to the European market and if that is included in what he's talking about then of course we would consider it,\" Davis said.\nMark Carney, the governor of the Bank of England, attends a monetary policy committee (MPC) briefing on his first day at the central bank's headquarters in London July 1, 2013. REUTERS/Jason Alden/pool\nElsewhere in the Radio 4 interview, Lord King defended current Bank of England governor Mark Carney, who was criticised by multiple politicians over comments he made before the EU referendum. But Lord King said that Carney had been placed in an \"almost impossible position\" and should be allowed to issue warnings about potential impacts of a Brexit vote.","url":"https://www.businessinsider.com/former-bank-of-england-governor-mervyn-king-says-the-uk-should-quit-the-single-market-2016-12"}
