{"authors":[],"date_download":"2018-10-22 21:59:48","date_modify":"2018-10-22 21:59:48","date_publish":"2014-05-08 19:36:41","description":"Anti-mafia police said Claudio Scajola was arrested for helping a Calabrian businessman leave Italy and transfer his fortune abroad to evade justice.","filename":"data/vaneerConsumption/FormerBerlusconiMinisterArrestedinMafiaProbe.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/430091/140508-italy-scajola-mafia-charge-pmc-1524_9aeff1419cc659307a16c1951cbda8bf.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_former-berlusconi-minister-arrested-mafia-probe-n100671_1540245588.html","title":"Former Berlusconi Minister Arrested in Mafia Probe","title_page":"Former Berlusconi Minister Arrested in Mafia Probe","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nROME – Italian police have arrested Claudio Scajola, industry minister in the last government of ex-Prime Minister Silvio Berlusconi, on suspicion of helping a former party colleague convicted of mafia association to flee justice, authorities said on Thursday.\nThe case adds one more scandal for Berlusconi's Forza Italia party to deal with following his own conviction for tax evasion. But the political fallout, including any impact on the party's vote in the upcoming European election, remains unclear.\nScajola was forced to resign in 2010 over accusations of a shady real estate deal involving the purchase of a luxury apartment near the Colosseum in Rome but was cleared of wrongdoing by a court earlier this year.\nAnti-mafia police in the southern city of Reggio Calabria said Scajola had been arrested over his links with Amedeo Matacena, a Calabrian businessman and former lawmaker from center-right Forza Italia.\nNo comment was immediately available from Scajola's lawyer.\nMatacena, convicted over links to 'Ndrangheta, the powerful Calabrian mafia, is currently a fugitive from justice, the DIA anti-mafia unit said in a statement. According to Italian press reports, he was arrested in Dubai last year but subsequently released from custody.","url":"https://www.nbcnews.com/news/world/former-berlusconi-minister-arrested-mafia-probe-n100671"}
