{"authors":["James Davey","Kate Holton"],"date_download":"2018-10-30 22:51:59","date_modify":"2018-10-30 22:51:59","date_publish":"2016-12-10 00:00:00","description":null,"filename":"data/vaneerConsumption/FormerUKministersaysMurdochsnewSkybidshouldbeinvestigated.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-murdochs-new-sky-bid-should-be-probed-says-former-uk-minister-2016-12_1540939919.html","title":"Former UK minister says Murdoch's new Sky bid should be investigated","title_page":"    Former UK minister says Murdoch's new Sky bid should be investigated - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain's Business Secretary Vince Cable talks during his keynote speech on the second day of Liberal Democrat party's spring conference in Liverpool, northern England, March 14, 2015. REUTERS/Phil Noble LONDON (Reuters) - Rupert Murdoch's new takeover approach for British pay-TV firm Sky should be investigated by the UK's competition authorities, according to the former minister who referred the tycoon's previous bid.\nVince Cable, who was Britain's business secretary at the time of Murdoch's first bid in 2010-11 told BBC radio the media tycoon's new takeover attempt would not be in the public interest.\nOn Friday Murdoch's Twenty-First Century Fox said it had struck a preliminary deal to buy the 61 percent of Sky it does not already own for around $14 billion. It came five years after a political scandal wrecked his previous bid.\nThat attempt to buy Sky through his News Corp business provoked uproar among some UK politicians, who said it would give the billionaire owner of The Sun and The Times newspapers too much control over the country's media.\nIt collapsed in 2011 when Murdoch's UK newspaper business was engulfed in a phone-hacking scandal. It intensified political opposition , resulted in a criminal trial, and led to the closure of his News of the World tabloid.\nCable said the issue was the same five years on.\n\"This is yet again a threat to media plurality, choice, just as it was six years ago when I referred this to the competition authorities and it should be investigated,\" he said.\n\"The ownership of the media, whether you're looking at press, radio, television is very highly concentrated and this makes it even more concentrated.\"\nHowever, analysts said Friday's proposal was likely to have an easier ride, partly because News Corp has now separated from Fox, which means the bidding firm no longer owns UK newspapers, and because there are little or no competition issues, with very material changes in the market for news in the UK since 2010.\nThey also said the British government was keen to promote investment in the wake of the Brexit vote and could present the deal as a sign of confidence in the economy.\n\"It's very likely that even if there is a plurality investigation that this will go through,\" Clare Enders of Enders Analysis told BBC radio.\n\"It is a different situation and the entities have been structured differently.\"\nIt will be up to Karen Bradley, the culture, media and sport minister to decide whether the plurality situation has materially changed since 2010.\n\"Will the government really say he can't own more than 39 percent of it? I don't think so,\" David Yelland, a former editor of Murdoch's Sun newspaper, told Reuters.\n\"It takes a lot of negative energy to block a deal like this and I just don't see it happening this time around.\"\n(Reporting by James Davey and Kate Holton; Editing by Jeremy Gaunt)","url":"https://www.businessinsider.com/r-murdochs-new-sky-bid-should-be-probed-says-former-uk-minister-2016-12"}
