{"authors":["John Hayward"],"date_download":"2018-10-30 22:06:37","date_modify":"2018-10-30 22:06:37","date_publish":"2017-03-25 01:42:48","description":"The uncertain legal status of former Egyptian President Hosni Mubarak appears decisively resolved as he left a Cairo military hospital.","filename":"data/vaneerConsumption/FormerEgyptianPresidentHosniMubarakWalksFreeAfter6Years.json","image_url":"https://media.breitbart.com/media/2017/03/former-egypt-president-Hosni-Mubarak-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_03_24__1540937197.html","title":"Former Egyptian President Hosni Mubarak Walks Free After 6 Years","title_page":"Former Egyptian President Hosni Mubarak Walks Free After 6 Years | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The uncertain legal status of former Egyptian President Hosni Mubarak appears decisively resolved as he reportedly left a Cairo military hospital and returned home as a free man on Friday morning.\n“He went home at 8:30 this morning. I don’t have further details, but he is home and all is well now,” said Mubarak’s lawyer, who said Mubarak enjoyed breakfast with his wife Suzanne, sons Alaa and Gamal, and the rest of his family.\nMubarak was the only Arab leader to be tried and convicted after losing power in the 2011 “Arab Spring” demonstrations. The charges against him included corruption, the driving force behind the Egyptian uprising, and the killing of hundreds of protesters. His subsequent legal history has been complicated, with critics charging he was more hospitalized than imprisoned for the past several years. He has a history of health issues, including intestinal surgery in 2010 and a heart attack in 2011.\nThe last of the charges against him were nullified in mid-March, with a decision that time served on the void murder charges satisfied his corruption conviction.\nThe New York Times writes that Mubarak opponents are “dismayed” at the apparent conclusion of “the long and fruitless effort to hold him accountable for human rights abuses and endemic corruption during his three decades of rule.”\nFreedom for the 88-year-old former president “crushed hopes for change” and summed up “the enduring disappointment of the Egyptians who risked their lives to topple him,” according to the Times, although the Egyptians quoted in the piece seemed fairly quiet about his release. One activist said Mubarak was merely a symbol now, and Egypt’s problems were bigger than any one man. The NYT attributes the silence of other citizens to apathy or fear of “openly speaking their mind.”\nMubarak supporters showed no such reticence. “The lion is back in his den! We feel so vindicated. Now nobody can call him ruthless or corrupt anymore. If he had done something wrong, the courts would not have cleared him,” said a female paratrooper who received a service award from the former president in 2009.\nThe Associated Press notes that man other ministers, aides, and police officers charged alongside Mubarak have been acquitted, and some have made political comebacks.\nMubarak’s acquittal for the murder of protesters “confirmed long-held suspicions that he and scores of police who faced the same charges would never be brought to justice” and made it clear to activists that the Arab Spring “revolution” had been effectively reversed by current President Abdel Fattah al-Sisi, according to the AP report.\nAs in the New York Times piece, activists quoted by the AP sought to downplay the importance of Hosni Mubarak’s release, stress that Egypt’s systemic problems are bigger than any individual politician and lament public apathy over the state of affairs.\n“The economic crisis we are living in and the high prices take priority over everything, as does the fear of terrorism. That is what preoccupies ordinary citizens, not Mubarak,” opposition politician Khaled Dawoud told Reuters.\n“When you see the group of people who show up and cheer and support him, you are talking about 150, 200 people,” Dawoud added, dismissing the importance of pro-Mubarak demonstrations.\nMubarak is not entirely out of the woods, as Sky News notes he is “the focus of a new corruption investigation after allegations he received gifts from the state-owned Al-Ahram newspaper.”","url":"https://www.breitbart.com/national-security/2017/03/24/former-egyptian-president-hosni-mubarak-walks-free-after-six-years/"}
