{"authors":["John Sexton"],"date_download":"2018-10-30 21:46:41","date_modify":"2018-10-30 21:46:41","date_publish":"2015-08-05 02:06:47","description":"Peter Van Buren, a former State Department diplomat, said no one could do what Hillary Clinton did without prompting an investigation.","filename":"data/vaneerConsumption/FormerStateDeptEmployeeNoOneElseCouldDoWhatHillaryClintonDidWithoutanInvestigation.json","image_url":"https://media.breitbart.com/media/2015/05/ap_hillary-rodham-clinton_ap-photo-e1431465912737.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_04__1540936001.html","title":"Former State Dept. Employee: No One Else Could Do What Hillary Clinton Did Without an Investigation","title_page":"Former State Dept. Employee: No One Else Could Do What Hillary Clinton Did Without an Investigation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Peter Van Buren is a former State Department diplomat with 24 years of experience. In an interview on Tuesday he told me how the system for transmitting classified and unclassified material works at the State Dept. under normal circumstances. He also told me no one could do what Hillary Clinton did on her private server without prompting an investigation.\nDespite this, Van Buren is not confident that the DOJ will follow through on the referral from the Intelligence Community Inspector General. In his opinion, politics has been carrying the day on this for nearly six years. People who knew what was going on said nothing during Hillary Clinton’s tenure and after. To make a fuss now, with the political stakes even higher, would be surprising.\nThe interview that follows has been lightly edited for clarity in a few places.\nBreitbart News: Tell me about your time at the State Department.\nPeter Van Buren: I worked for the Department of State as a foreign service officer, a diplomat, for 24 years. I held a top secret security clearance during that time and worked with classified information almost from day one until near the end of my career. That included intelligence information and military information that had been shared with the State Department.\nMy career finished in a somewhat difficult set of circumstances. After my experience working for the State Department in Iraq, I wrote a book about what I saw there called We Meant Well. The State Department objected strongly to the fact that I had written a book that was critical of them and began a series of proceedings against me. I was defended by the ACLU under… that I exercised my First Amendment rights, and in 2012 the State Department conceded and I agreed to retire at that time under my own terms.\nBN: Does this mean that you’re a disgruntled former employee?\nPVB: Absolutely not, I’m very gruntled. I had an exceptional 23 years with the Department of State. I received a number of awards. I was promoted right along on schedule and was looking forward to a much longer career. The book that I wrote was an attempt to bring to people’s attention the deficiencies in our reconstructive program in Iraq and to set a warning that we were not leaving Iraq under a set of conditions that assured stability. The State Department’s objections were based primarily on the fact that one of their employees violated the code, if you will, and spoke publicly.\nBN: What I found interesting about your article at Reuters was your take on the security that is normally used at the State Department for electronic communications. For people who aren’t familiar with it, myself included, can you describe how it works?\nPVB: Sure. There are two electronic systems at the State Department and, in fact, throughout the government. They go by different names in different agencies, but essentially everything in the government world is either classified or unclassified. Every piece of information, every conversation, every document, and every action falls into those categories. And at the State Department they have tools that help you, the employee, make sure that you fulfill your obligations along those lines. The first step is, of course, when you’re going to transmit something, you choose which of these two systems you’re going to use, classified or unclassified. If you’re sending something through either system, it forces you to designate a classification. If it goes through the unclass system, then it’s automatically stamped as unclassified. If it goes through the classified system as part of hitting send, you have to designate a level of classification. There are three general ones, of course: confidential, secret, and top secret.\nBN: What does it look like? Is it a radio button that sits next to the send button?\nPVB: Yeah, it pops up… When I left there in 2012, it popped up on the screen as part of the process of sending. Because you have to designate, under the executive order, what the grounds for the classification are: Intelligence Community information, foreign government information, what have you.\nBN: So if a Secretary of State wanted to transmit classified information, either send or receive, it would be on a system like that?\nPVB: Absolutely. These systems are not simply an isolated computer that we all agree is going to be where the sensitive stuff is. They are physically very different from any computer you or I could go out and purchase. The generic term that is used is Tempested. That’s a series of physical and electronic things that keep the machine from emanating electronically. It isolates that machine from the physical world around it. The same thing is done to all the cables that carry that data inside the system. And there are no physical connections between those systems and unclassified systems so that you cannot have leakage and you can’t have someone use the Internet to reach into a classified system.\nBN: If someone were to violate those rules and, say, put out classified information on an unclassified system at the State Department what would happen?\nPVB: If you do get caught, then there are a series of disciplinary procedures that are applied to you. The most basic thing that happens is your security clearance gets suspended while this all gets sorted out. One of the key issues is severity. Another key issue is the likelihood that the information was exposed to the outside. And another key factor is whether the action was accidental or deliberate. And those factors are churned together and then the security people at the Department of State determine a) if you’re going to get your security clearance back at all, and b) whether or not you are going to be subject to either administrative penalties or potentially criminal penalties. Administrative penalties typically include, in mild cases, a letter to the file which will hurt your promotions, up to suspension which will hurt your wallet as well as your promotions. Criminal penalties step it up a couple of levels. We’ve seen, for example, Jeff Sterling, Ed Snowden, Bradley Manning, John Kiriakou—any number of people who have been prosecuted under the espionage act for leaking or disclosing classified information.\nBN: In Hillary’s case, she set up this system and did so before she was even confirmed as secretary. So this wasn’t an accidental thing she fell into; it was something she determined to do in advance.\nPVB: Exactly.\nBN: A week ago Friday, two Inspectors General put out a joint statement which said some of Hillary Clinton’s emails contained information that was classified at the time it was generated. They were very specific about that. The next day, Hillary denied that and said she had never sent any classified information that was classified at the time. Why do you believe she is making that distinction and contradicting what the IGs are saying?\nPVB: It’s very hard for me to understand why she’s saying that except that she may not have much else to say in her defense and she doesn’t want to admit it. The most important thing to understand about classification is that the information itself is inherently classified or it’s not. Labels are applied as a matter of convenience, if you will, and a matter of standardization so that I know we’ve all agreed this is confidential, not secret, and therefore it’s handled under the procedures for confidential. But at the end of the day, it’s the information itself that is inherently classified or not.\nInformation gets classified one of two ways. One is what’s called derivative classification. If you and I are working at the State Department and I give you a secret document and you write a longer piece based on that secret document. Your piece must be classified at least secret, derived from the source document. So anything they got from the intelligence agencies or the military that originally had a classification on it is itself classified. Whether they excerpt a sentence or they try to talk about it obliquely, it has derivative classification.\nThe other way that something gets classified is by its originator. So you go out and you meet an Iranian diplomat who tells you all sorts of juicy stuff and you come back and you write a report about that. You’re the first person to touch that and you assign a classification to that. You are given training as part of this to understand that information is supposed to be classified. So if Huma and Hillary are bouncing emails back and forth talking about how best to approach the Chinese next week, they are expected to exercise a level of judgment to know that that information is extremely sensitive and should have been labeled classified because it was in fact something that was classified under the executive order which lays down a set of things that are classified.\nSo, her saying that it wasn’t classified at the time, it just doesn’t pass any kind of reality test. It either was derivatively classified from the intelligence community, which is what it sounds like just based on the little bit that we’ve heard, or it was classified information that she and her aides chose not to mark as classified so they could futz it through her homebrew server and not enter the State Department system with it.\nBN: Say there was derivative information that was sent to her and therefore appeared in her inbox. Is it plausible that she didn’t recognize ever, in any case, that any of this material was classified?\nPVB: There’s only two answers to that. One is… Of course she knew it was classified material. And that’s not a good thing at all that she continued to process it on an unclass system. The other would be, forgive me for being a little sarcastic, after all her years in the White House, and in the Senate, and as Secretary of State she didn’t recognize something that should have been classified or was classified? That’s not a good thing either. And those are the only two options I can come up with to explain her statement and neither of them points to a very good thing.\nBN: Is it fair to say that only one of them points to a potential investigation or even prosecution?\nPVB: I’m not a laywer, but I think we have to separate those two words out very clearly. Prosecution is when enough information is available to say someone has violated a law. You can only prosecute someone following some form of investigation. There is no question in anyone’s mind with a security clearance that if a senior official like the Inspector General said “You have had classified information on an unclassified system”… Every single person with a classification understands that they are going to be investigated at some level for doing that. It simply is the opposite of how the system is supposed to work. To say that there is any reason to, sort of, shrug your shoulders at what Clinton has done simply goes against the entire spirit, if not the law, of the concept of protecting the U.S. government’s secrets.\nBN: Based on the referral—which was not specific to Hillary Clinton though it apparently did specify the classified material found in her inbox—do you think there will be DOJ follow through? Are they going to investigate?\nPVB: That obviously gets way deep into the politics of all these things. You know, whether everybody gets treated exactly the same way or whether there are special rules for special people. Now this is just a personal opinion… It’s clear she has done stuff that is way out of the bounds of what any other employee in the State Department would be allowed to do without an investigation. And pretty much anybody in the government… It’s pretty darn hard to imagine someone in the CIA being told by the CIA’s Inspector General that they had classified information on an unclass system and well, you know, sorry about that, we’ll just look the other way.\nNow whether DOJ will do it or not? I have my doubts. I think politics will carry the day here. They have so far. Lots and lots of people inside the State Department knew what was going on. There was no question in anyone’s mind what was going on at senior levels here. And nobody seemed to say anything. People like Pat Kennedy, who was the official classifying authority for the Department of State and who made quite a show testifying against Bradley Manning in that capacity, was sending and receiving email, knowing what Clinton was doing. And nobody said anything about it during the four years she was there. Nobody said anything about it in the two years until this finally came out publicly. If nobody did anything about it during all that time, personally it’s hard to imagine DOJ cranking something up at this point when it’s even more politicized than it would have been a couple of years ago.","url":"https://www.breitbart.com/politics/2015/08/04/former-state-dept-employee-no-one-else-could-do-what-hillary-clinton-did-without-an-investigation/"}
