{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:48:18","date_modify":"2018-10-30 21:48:18","date_publish":"2014-11-04 09:36:55","description":"Owner Dahe Yang broke the news on the restaurant’s website that ...","filename":"data/vaneerConsumption/FormerPeterChangSpotTastyChinaIIClosed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/11/04/Images/WPIMAGE_cmgajcfoodandmore_1833.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_fo_0f72444d2112101bde61d15da6127b16__1540936098.html","title":"Former Peter Chang Spot Tasty China II Closed","title_page":"Former Peter Chang Spot Tasty China II Closed","title_rss":"NULL","source_domain":"ajc.com","text":"Peter Chang\nOwner Dahe Yang broke the news on the restaurant’s website that Tasty China II in Sandy Springs, formerly Peter Chang Chinese Cuisine, would shutter:\nWe are sad to announce that we will be closing for good after dinner service Sunday, November 2. Thank you for 5 great years! We hope to see you at Tasty China in Marietta and at Jia opening in Midtown early next year.\nOf course, the history of the odd riverside location is wrapped around the comings and goings of chef Peter Chang, who seems to be in business nowadays at Peter Chang China Café in Glen Allen, VA. But who knows for sure?\nDubbed the disappearing chef, in 2010 Chang was the subject of lengthy pieces by Calvin Trillin in the New Yorker and Todd Kilman in the Oxford American .\nTrillin and Kilman weighed in as participant-observers of the cult of “Changians” — fans who’ve followed the peripatetic Chang from an unassuming strip center spot in Fairfax, Va., to stops in Marietta, Knoxville and Charlottesville, drawn by his dazzling Sichuan-style cooking, and fascinated by his mysterious ways of suddenly vanishing and reappearing\nAtlanta followers created a major buzz around Chang’s sojourn at Marietta’s Tasty China, and were overjoyed when he resurfaced in December 2011 and joined Yang again for the opening of Peter Chang Chinese Cuisine.\nNow, Yang and Tasty China executive chef, Jiguo Jiang, are set to open a new restaurant, Jia, in Ponce City Market, hopefully in early 2015, serving traditional Szechuan dishes from Tasty China II, plus some new twists from Jiang.\nWith all the new restaurant venues now available, could Chang land back to Atlanta someday soon?\nAnd as one tipster claims, will the once famous Peter Chang Chinese Cuisine really become a Rio Bravo?\nWhat do you think?","url":"https://www.ajc.com/blog/atlanta-restaurants/former-peter-chang-spot-tasty-china-closed/27JCG5jJEMTbRsQpngPnmO/"}
