{"authors":["Kristin Ridley"],"date_download":"2018-10-30 23:29:49","date_modify":"2018-10-30 23:29:49","date_publish":"2018-07-19 00:00:00","description":"Two former traders, including a one-time star employee at Deutsche Bank, were handed jail terms totaling more than 13 years by a London court on Thursday for plotting to rig global interest rates.","filename":"data/vaneerConsumption/FormerDeutscheBankandBarclaystradersjailedforglobalrateriggingplot.json","image_url":"https://amp.businessinsider.com/images/5b50a1ca01180c38008b46bc-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_former-deutsche-bank-and-barclays-traders-jailed-for-global-rate-rigging-plot-2018-7_1540942189.html","title":"Former Deutsche Bank and Barclays traders jailed for global rate-rigging plot","title_page":"    Former Deutsche Bank and Barclays traders jailed for global rate-rigging plot - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Banker, Philippe Moryoussef leaves Westminster Magistrates court in London, Britain, January 11, 2016 Reuters/Peter Nicholls\nLONDON (Reuters) - Two former traders, including a one-time star employee at Deutsche Bank, were handed jail terms totaling more than 13 years by a London court on Thursday for plotting to rig global interest rates.\nChristian Bittar, 46, was sentenced to five years and four months, having pleaded guilty in March to conspiracy to defraud by dishonestly manipulating the Euro interbank lending rate (Euribor).\nOnce of Deutsche Bank and described by investigators as one the world's best-paid traders, Bittarhad been in custody since then.\nPhilippe Moryoussef, who once worked at Barclays, was sentenced to eight years after a jury unanimously convicted of the same offence him last week. He did not attend court, having skipped bail and sought refuge in France.\nThe two Frenchmen, friends outside work who went skiing together, manipulated Euribor, a benchmark for rates on more than $150 trillion of financial contracts and consumer loans, between January 2005 and December 2009.\nThey are the first traders to be convicted of manipulating Euribor in a worldwide investigation that has also examined the rate's London equivalent Libor. Eleven banks and brokerages have paid around $9 billion to settle allegations of rate-rigging.\nBarclays was the first to be fined in 2012. Its $453 million penalty sparked a backlash that forced out former CEO Bob Diamond, an overhaul of rate-setting rules and the British criminal inquiry.\nThree years later, Deutsche Bank was ordered to pay $2.5 billion and was accused of obstructing regulators and \"cultural failings\". Its London-based subsidiary pleaded guilty to criminal wire fraud.\nHowever, the outcome of the Euribor trial is a mixed victory for the UK Serious Fraud Office (SFO) prosecutor. The SFO had originally wanted to prosecute 11 individuals in the case, but French and German authorities refused to extradite five of their citizens.\nMoryoussef, who pleaded not guilty to the charge last year, left for France after Bittar's guilty plea was made public.\nMoryoussef's Paris-based lawyer, Francois De Casto, has said his client is under the protection of French law and will eventually refer his case to the European Court of Human Rights.\nThe SFO is also seeking a retrial for three other former Barclays traders after the jury was unable to reach a verdict in their case last week.\nItalian-born Carlo Palombo, a former trader who reported to Moryoussef, Sisse Bohart, a Danish former junior trader and rate submitter, and her British one-time boss Colin Bermingham are charged with one count of conspiracy to defraud.\nEuribor is calculated daily after a panel of banks submit their estimates for the costs of borrowing between banks over various time frames to an administrator.\nProsecutors alleged the former traders conspired with others at banks including Deutsche Bank, Barclays and Societe Generale to dishonestly skew rates designed to reflect interbank borrowing costs in order to bolster bets on interest rate derivatives.\nThe three have denied dishonesty, saying they learned on the job, communicated openly, were not told they were doing anything wrong, that requests fell within a range of equally valid rates and that they did not profit from the practice.\nA sixth defendant, Deutsche Bank manager Achim Kraemer, was acquitted.","url":"https://www.businessinsider.com/former-deutsche-bank-and-barclays-traders-jailed-for-global-rate-rigging-plot-2018-7"}
