{"authors":[],"date_download":"2018-10-22 20:44:09","date_modify":"2018-10-22 20:44:09","date_publish":"2016-01-29 03:24:43","description":"Ex-England all-rounder Dimitri Mascarenhas will step down as New Zealand bowling coach at the conclusion of next month's series against Australia to spend more time with his family.","filename":"data/vaneerConsumption/FormerEnglandinternationalDimitriMascarenhasquitsNewZealandcoachingroletospendmoretimewithfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/01A8EE6000000578-0-image-a-157_1454037866619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3422161_Former-England-international-Dimitri-Mascarenhas-quits-New-Zealand-coaching-role-spend-time-family_1540241049.html","title":"Former England international Dimitri Mascarenhas quits New Zealand coaching role to spend more time with family","title_page":"Former England international Dimitri Mascarenhas quits New Zealand coaching role to spend more time with family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dimitri Mascarenhas will step down as New Zealand bowling coach at the conclusion of next month's series against Australia to spend more time with his family, the team said on Friday.\nThe former England all-rounder had been in the role for a little under a year, initially on an interim basis as Shane Bond's replacement, before taking it on full-time.\nThe constant travel away from his young family had been the main reason behind his decision to give up the post, the former Otago coach said.\nDimitri Mascarenhas will step down as New Zealand bowling coach after next month's series against Australia\n'At first I thought I could balance the responsibilities but I no longer think that's feasible. I need to be closer to my family,' the 38-year-old said in a New Zealand Cricket statement\n'I had an amazing time with the team. It's probably been the best time I've had in cricket, either as a player or as a coach.'\nMascarenhas said his time as New Zealand coach has 'probably been the best time I've had in cricket'\nAustralia depart for their short tour of New Zealand on Saturday, for an itinerary that begins with the first of three one-day internationals next Wednesday.\nThe sides also play two Tests, the first in Wellington from February 12-16 and the second in Christchurch from February 20.","url":"https://www.dailymail.co.uk/sport/cricket/article-3422161/Former-England-international-Dimitri-Mascarenhas-quits-New-Zealand-coaching-role-spend-time-family.html"}
