{"authors":["Shayan Shankar For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-23 03:36:20","date_modify":"2018-10-23 03:36:20","date_publish":"2017-03-16 14:32:44","description":"Former Sydney Kings star and NBL MVP Chris Williams has died at the age of 36 with Shane Heal and Andrew Gaze among those paying tribute to the classy forward.","filename":"data/vaneerConsumption/FormerSydneyKingsNBLstarChrisWilliamsdiesat36.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54C45200000578-0-image-a-66_1489674646263.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320088_Former-Sydney-Kings-NBL-star-Chris-Williams-dies-36_1540265780.html","title":"Former Sydney Kings NBL star Chris Williams dies at 36","title_page":"Former Sydney Kings NBL star Chris Williams dies at 36 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tributes are pouring in for former NBL MVP Chris Williams, who has died at the age of 36.\nReported to have encountered heart complications due to blood clots, Williams passed away suddenly on Wednesday morning in his home in Birmingham, Alabama.\nConsidered one of the best single season imports in the competition's history, Australian basketball legends Andrew Gaze and Shane Heal have remembered a player who made such an impact in such a short amount of time.\nChris Williams, 36, (pictured) died in his home in Birmingham, Alabama after suffering from 'heart complications' due to blood clots\nStanding at 199cm the American Williams was a basketball standout at the University of Virginia and is the only player in the school's history to rank in the top 10 in career points, rebounds, blocked shots and steals.\nRecruited by current Philadelphia 76ers coach Brett Brown, Williams joined the Sydney Kings in 2002 following his collegiate career, leading the team to its first title win in his one and only season.\nStuffing the stat sheet, Williams averaged 23.6 points, 12.1 rebounds, 4.3 assists. 2.1 steals and 1.3 blocks a game claiming both season and grand final MVP honours.\n'It's a a sad sad day, he was probably the favourite import I ever played with over a long period of time,' said former Boomers' point guard Heal, who was Williams' captain in his sole season with Sydney.\n'An amazing player considering he was so young, 21 or 22 and straight out of college, it was his first pro job.\n'He was just such a good player to play with and played such a valuable role and was critical to us winning a championship.\nWilliams (right), played with the Sydney Kings during the 2002-03 season winning the league MVP and leading the the team to their first title\nFormer Aussie basketball legend Shane Heal took to Twitter to remember his former teammate\nHeal said while Williams put up big numbers he wasn't a selfish player and had an incredible ability to make the team better.\n'He had a great feel for the game, he just made the right decisions, you can't teach that,' Heal said.\nCurrent Kings coach Gaze played for Melbourne Tigers against Williams.\n'Chris made an indelible contribution to the Sydney Kings,' Gaze said.\n'He was instrumental in beginning the championship era in Sydney and was a worthy MVP winner in the 2003 season.'\nAt 199cm Williams was known for his all round game and remembered as a great teammate\nIn a statement by the Kings organisation, Williams was called: 'perhaps the most unselfish superstar to ever play for the team.'\n'An absolute gentleman off the court, loved by all, he was a fearsome competitor on the floor, blessed with remarkable talent and an enormous will to win,' the statement read.\nWilliams wasn't renowned as a shooter despite his impressive scoring deeds for Sydney.\n'He wasn't very tall, and he wasn't a very good shooter, but he saw the game a bit better than most,' said former Boomers' forward and Williams' Kings teammate Matt Nielsen.\n'His ability to use time and space was his greatest strength, and it was amazing what he was able to accomplish with the tool set that he had.'\nAfter leaving Sydney, Williams played in Germany, Korea, Turkey, China, the Philippines and Iran.","url":"https://www.dailymail.co.uk/news/article-4320088/Former-Sydney-Kings-NBL-star-Chris-Williams-dies-36.html"}
