{"authors":["Frances Martel"],"date_download":"2018-10-30 19:26:15","date_modify":"2018-10-30 19:26:15","date_publish":"2015-04-30 15:06:11","description":"Former Assistant Secretary of State for Western Hemisphere Affairs under George W. Bush, Roger Noriega, asserted in multiple interviews this week that the United States has ample evidence that high-ranking government Venezuelan officials are involved in cocaine trafficking, and that Venezuelan President Nicolás Maduro has used drug money to run his campaign. |","filename":"data/vaneerConsumption/FormerDiplomatVenezuelaPresidentNicolsMaduroFundedCampaignwithDrugMoney.json","image_url":"https://media.breitbart.com/media/2015/04/ap_nicolas-maduro_ap-photo-e1430419942801.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_30__1540927575.html","title":"Former Diplomat: Venezuela President Nicolás Maduro Funded Campaign with Drug Money","title_page":"Former Diplomat: Venezuela President Nicolás Maduro Funded Campaign with Drug Money | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Assistant Secretary of State for Western Hemisphere Affairs under George W. Bush, Roger Noriega, asserted in multiple interviews this week that the United States has ample evidence that high-ranking government Venezuelan officials are involved in cocaine trafficking, and that Venezuelan President Nicolás Maduro has used drug money to run his campaign.\nIn an interview earlier this week at University of Miami’s Latin America conference, Noriega, who also served as U.S. ambassador to the Organization of American States, said American officials have “witnesses and documents that support accusations of Diosdado Cabello’s involvement [in the drug trade].” “Everyone recognizes that we are talking about a criminal government,” Noriega added.\nIn a more extensive interview with El Nuevo Herald, Noriega elaborated that there were multiple sources on tap for the U.S. government willing to provide evidence that Cabello was heavily involved in selling drugs. “My sources clearly establish that, at this moment, there are a series of substantial ongoing investigations regarding ties between drug trafficking and high-ranking Venezuelan government officials, and Diosdado Cabello is certainly among them,” he said. “They involve Aragua Governor Tarek El Aissami and Maduro himself.”\nOf the Venezuelan president, Noriega says he is not directly involved in trading drugs, but he has benefited from Cabello and El Aissami’s work. U.S. officials, he notes, “are very aware of his complicit role in drug trafficking and aware that past electoral campaigns he has run have benefitted from drug money, including his presidential campaign.”\nNoriega adds that American investigators have made significant inroads in this investigation “within the past 12 months.”\nNoriega is not the first to implicate the Venezuelan government in drug trafficking. In an interview with Uruguay’s El Observador this month, the Center for International Assessment and Strategy’s Douglas Farah stated clearly of Venezuela: “The state itself directly participates in criminal activities and in the support of terrorism, primarily the Revolutionary Armed Forces of Colombia (FARC) and Iranian Hezbollah. It participates directly in drug trafficking; that is its principal criminal activity.” He added that the Maduro administration has been “more drug trafficking, less terrorism” than the Hugo Chávez regime.\nIn January, a witness surfaced even more closely tied to the Venezuelan regime: Leamsy Salazar, former head of security for Hugo Chávez. Salazar defected to the United States this year, and is reportedly preparing to testify against Cabello and El Aissami. Salazar told American officials that he was present for conversations in which Cabello directly organized cocaine trafficking plans, ordering ships full of “tons of cocaine” on where to travel. Salazar describes Cabello as the “capo” of the Cartel de los Soles, a cocaine trafficking group believed to be composed of Venezuelan military officials. At the time, El Aissami, who served as Chávez’s Minister of the Interior and head of Islamic Affairs, called Salazar’s accusations “decadent and fascist.”\nInsightCrime, a project that catalogues organized crime in Latin America, describes the Cartel de los Soles– named for the sun medallions worn by Venezuelan soldiers– as a series of loosely connected drug-running cells within the armed forces. “It is not clear what the modus operandi is [regarding coordination] between these cells, although it appears that rivalries between these have been lethal in the past,” they note.\nIn addition to working with Cabello to traffic cocaine, El Aissami has been accused of leading an effort to provide Hezbollah terrorists with counterfeit Venezuelan passports, to allow for easier access to Canada and the United States.","url":"https://www.breitbart.com/national-security/2015/04/30/former-asst-secretary-of-state-venezuelan-president-funded-campaign-with-drug-money/"}
