{"authors":[],"date_download":"2018-10-22 20:58:21","date_modify":"2018-10-22 20:58:21","date_publish":"2014-06-03 18:58:43","description":"The man who had been #2 on China’s most wanted list in the wake of the violent 1989 crackdown, 25 years later still can't return home.","filename":"data/vaneerConsumption/ForOneTiananmenExileAWishToReturnToChinaNoMatterTheCost.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/484081/140603-williams-kaixi-89_1_f7ebc70336a0c6fda837ec10c4144f05.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_one-tiananmen-exile-wish-return-china-no-matter-cost-n121521_1540241901.html","title":"For One Tiananmen Exile, A Wish To Return To China, No Matter The Cost","title_page":"For One Tiananmen Exile, A Wish To Return To China, No Matter The Cost","title_rss":"NULL","source_domain":"nbcnews.com","text":"“We decided we would not make this what they wanted, a nationally-broadcast taking down of the students,” Wu’er said. “So I interrupted him and gave him a lecture. We didn’t anticipate this thing would be broadcast nationwide.”\nThe following day, May 19, 1989, Li declared martial law, and two weeks later the tanks moved in to Tiananman Square.\nTwenty-five years on, and the man who had been number two on China’s most wanted list in the wake of the violent crackdown, has become unwanted by China.\nSince 2009, he has tried four times to return to mainland China, wanting to see his frail and ageing parents, even if it means spending time in prison. He was turned away from Hong Kong and Macau, and was not permitted to enter the Chinese embassies in Tokyo or Washington when he tried to turn himself in.\n“I don’t want this exile anymore. It is mental torture for me,” he said.\nHis parents have not been allowed to leave the country to see him.\n“The Chinese government’s act in prohibiting my parents from traveling abroad to see me, means that I haven’t seen them in 25 years,” he said. “It’s been a punishment for them. For nothing they have done.”\nHe has now spent more time in exile than he has in China.\nDuring NBC’s recent visit to Taiwan, he lectured students about the importance of the Tiananmen democracy movement and the pure idealism that drove them.\nHe believes that sooner or later the Chinese Communist Party will have to confront the truth about June 4, 1989.\nAs much as the government tries to suppress history, “the memory of the June 4th massacre is very much present in China today, not in anything published. Not publicly. But in people’s minds.”\nHe still believes real change can come to China, there are so many discontents.\n“Maybe it will come in a different form this time. Maybe a Tiananmen on the Internet,” he said. “I am an exile. I have no other choice but to be optimistic.”","url":"https://www.nbcnews.com/news/world/one-tiananmen-exile-wish-return-china-no-matter-cost-n121521"}
