{"authors":["Associated Press"],"date_download":"2018-10-22 21:06:02","date_modify":"2018-10-22 21:06:02","date_publish":"2017-03-16 00:39:14","description":"LIMA, Peru (AP) - Patricia Calvino has marked every day spent in a Peruvian prison on drug charges since 2013 with a cross through a calendar, a sobering...","filename":"data/vaneerConsumption/ForSpanishdrugmulescaughtinPerualongjourneyhome.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/02/wire-225871-1489631094-402_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318498_For-Spanish-drug-mules-caught-Peru-long-journey-home_1540242362.html","title":"For Spanish drug mules caught in Peru, a long journey home","title_page":"For Spanish drug mules caught in Peru, a long journey home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LIMA, Peru (AP) - Patricia Calvino has marked every day spent in a Peruvian prison on drug charges since 2013 with a cross through a calendar, a sobering reminder of how long she has spent away from her daughter in Spain.\nThree years and seven months later, Calvino will join 30 other Spanish prisoners Thursday on a flight back home - the largest repatriation of Spaniards serving prison sentences abroad in the European nation's history.\nPeru is the world's second-largest cocaine producer, and much of the narcotics arriving in Europe passes through Spain, where traffickers prowl for recruits like Calvino in nightclubs, offering a hefty sum to travel to Lima and bring back cocaine. There are currently more than 200 Spaniards in Peruvian prisons on drug charges, more inmates than from any other foreign country.\nSpanish prisoner Angel Lopez Berlanga, 45, holds Peruvian and Spanish flags one day before being repatriated to Spain, during a press tour of the facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nThe Associated Press visited with Spanish inmates at a prison near this Andean country's capital Wednesday. The agreement under which they will leave Thursday was brokered between the two countries to allow the inmates to serve the rest of their sentences in Spain.\n\"I do not sleep,\" said Calvino, 26, cooling herself with a black fan in a passageway at the Piedras Gordas II prison, on a hill near Lima's desert coast. \"I cannot imagine the hour when I can arrive and embrace my family.\"\nCalvino, who is from Mieres, a town of 45,000 in northern Spain, offered no excuses to justify her crime and said it had taught her an important lesson: the value of the smallest liberties, even, sipping a glass of water.\nLike many \"drug mules,\" Calvino said she was recruited in a club and offered $10,725 to fly to Peru and return with luggage containing cocaine. At the time, she was a new mother in need of money. Officials at Lima's airport caught her with 3.6 kilos (7.9 pounds) of cocaine as she was about to board a flight to Madrid.\nShe spent her first night detained sitting on a chair cuffed by the hands and feet at the airport's anti-narcotics division. She later slept on a mattress she remembers as being filthy and full of fleas.\nOne of the most painful parts of experience was being separated from her daughter, who was born just a few months before the ill-fated trip.\nInmates say the distance from their native Spain means that many don't receive visitors and this increases their loneliness.\nAngel Lopez Berlanga, a 45-year-old native of Madrid serving a 12-year sentence for drug trafficking, said that since he arrived in the Peruvian prison in 2008 more than a dozen Spanish inmates have died from various diseases, including hepatitis. \"But I believe also from sadness because many never received a visitor because their families are far away,\" said Berlanga, who will finish his sentence in Spain.\nAside from the 30 prisoners still serving sentences, 19 former inmates who have been living as indigents in Lima with no means of paying for their return trip to Spain will also be on Thursday's charter flight, Spanish Minister of Foreign Affairs and Cooperation Alfonso Dastis has said.\nMore than 1,700 Spaniards were jailed abroad in 2014, and the largest contingent was in Peru, according to Spanish government figures. In Peru, the foreign inmates are housed in a special pavilion.\n\"Many talk about doing it out of economic necessity, of being short of money,\" Calvino said of those caught carrying drugs. \"But really, it's from a lack of values.\"\n___\nThis story has been corrected to show that Patricia Calvino is 26.\nSpanish prisoners Patricia Calvino, 26, left, and Laura Zerolo, 53, chat inside their jail cell one day before being repatriated to Spain, in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nSpanish prisoner Angel Lopez Berlanga, 45, is examined by a doctor during his last medical check one day before being repatriated to Spain, in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nSpanish prisoner Sebastian Ruiz Hinojoza, 56, stands by two boats he made, miniature replicas of the boats used by Christopher Columbus, in hopes of selling them to other prisoners or their visitors, one day before being repatriated to Spain, in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nSpanish prisoner Laura Zerolo, 53, smiles as she sews purses for the prison population one day before being repatriated to Spain, during a press tour of the facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nSpanish prisoner Remigio Montenegro Torres, 37, holds a cat inside his cell one day before being repatriated to Spain, during a press tour of the Piedras Gordas II prison in Lima, Peru, Wednesday, March 15, 2017. Stray cats come and go from the prison, which inmates care for, leaving out food and water. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nSpanish prisoners Angel Lopez Berlanga, 45, right, and Pedro Cuevas, 54, pause for a portrait as they work in the garden one day before being repatriated to Spain, during a press tour of the facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nSpanish prisoner Pedro Cuevas, 54, stands outside the prison cells one day before being repatriated to Spain, during a press tour of the facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nA prisoner's relative walks toward a jail cell carrying a bag of beverages at Piedras Gordas II in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences here are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nPrisoners gather in the communal dinning room of Piedras Gordas II in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences here are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nPrisoners peer out from behind a fence inside their pavilion during a press tour of the Piedras Gordas II facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences here are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nPrisoners gather in a corridor during a press tour of the Piedras Gordas II facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nPrisoners cook at a makeshift restaurant inside Piedras Gordas II detention center during a press tour of the facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences here are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nRelatives of prisoners wait to enter the Piedras Gordas II facility in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences at this facility are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)\nA woman and child stand outside the Piedras Gordas II detention center before entering to visit a prisoner in Lima, Peru, Wednesday, March 15, 2017. A group of 31 Spanish citizens serving out long drug sentences at this facility are anxiously awaiting to be repatriated Thursday as part of an airlift brokered by the two governments. (AP Photo/Rodrigo Abd)","url":"https://www.dailymail.co.uk/wires/ap/article-4318498/For-Spanish-drug-mules-caught-Peru-long-journey-home.html"}
