{"authors":["Associated Press"],"date_download":"2018-10-23 04:16:42","date_modify":"2018-10-23 04:16:42","date_publish":"2016-01-11 17:18:42","description":"CENTENNIAL, Colo. (AP) — For nearly 14 weeks, they sat in a suburban Denver jury box, listening for hours as witnesses described the searing pain of gunshot ...","filename":"data/vaneerConsumption/Forsometheatershootingjurorstrialbeganafterverdict.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:a4f699293ad04127b4d366174823c8cf-3WAQP5SaQH704788ebcf7e135f2b-323_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394143_For-theater-shooting-jurors-trial-began-verdict_1540268202.html","title":"For some theater shooting jurors, trial began after verdict","title_page":"For some theater shooting jurors, trial began after verdict | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For some theater shooting jurors, trial began after verdict\nCENTENNIAL, Colo. (AP) — For nearly 14 weeks, they sat in a suburban Denver jury box, listening for hours as witnesses described the searing pain of gunshot wounds and the terror they felt as they fled the movie theater, the gunman still firing at them.\nThey sat feet from a poster-sized photo of a 6-year-old girl's bullet-ravaged body. They held the murder weapons. And when the jurors announced they couldn't agree that James Holmes should die for his crimes, they heard the cries of his anguished victims.\nFour months later, they are still haunted — their struggles showing how the scars of a mass shooting can stretch from the victims, to the first responders and even to the jurors who must decide what to do with the perpetrator.\nFILE - In this Jan. 20, 2015, file photo, people enter the Arapahoe County Justice Center in Centennial, Colo. Months after the Colorado theater shooting trial, jurors who served said they're still troubled by flashbacks and nightmares, survivor's guilt and hypervigilance that have made it impossible to return to their normal lives. (AP Photo/Brennan Linsley)\nOne juror cut her hair, fearing she'd be recognized by a victim she saw at a grocery store. Another can no longer hunt with her husband, worried the sound of a gunshot will trigger her post-traumatic stress disorder. Another can't sleep without nightmares.\nSome started seeing therapists as they work through the shame they feel for the flashbacks and anxiety they suffer despite never having set foot inside the theater in July 2012, when 12 were killed and scores of others injured.\n\"I wasn't actually in that theater, but I listened to and felt the experiences of everyone who was, from every angle,\" said a 36-year-old marketer who is still so worried she wanted only to be known by her juror number: 1009. \"I felt their sorrow and their sadness.\n\"And when I left the courtroom,\" she said, \"I took it all with me.\"\nThe names of all the jurors — the 12 who deliberated and 12 alternates — were sealed throughout the trial and remain confidential by court order. Three of them spoke to The Associated Press about their post-trial struggles on condition that only their first names be used, citing concerns for their safety and privacy. The fourth, the marketer, asked to not be identified by name.\nTo cope, the four send each other uplifting text messages, gather for dinners at quiet restaurants and connect during phone calls that sometimes end in sobs. They're also raising money to help pay for a victims' memorial. They briefly dared the spotlight to promote their charitable work.\nIt's unclear how the other jurors are faring. Several reached by AP in the weeks after the verdict wouldn't comment about their experiences, but prosecutors have indicated some of them are still suffering.\nStudies show that, especially in death penalty trials and those with multiple killings, jurors can experience symptoms of post-traumatic stress disorder, nightmares, anxiety and insomnia, sometimes for months after they leave the courtroom.\n\"It's the horrific amount of violence that was done and loss of life that's very distressing to see up close, which you have to do to evaluate a case like this,\" said Valerie Hans, a Cornell Law School professor who has studied juries.\nHans applauded the jurors for forming a support group, saying they are the only ones who can fully understand the experience.\nProsecutors invited all the jurors to come talk to them after the trial, and most did.\n\"They were visibly shaken from what they had learned,\" prosecutor Lisa Teesch-Maguire said. \"Some of them told us they were nervous to talk to us, others thought it was so relieving to be able to talk to people whom they sat so close to in the courtroom.\"\nProsecutors angling for the death penalty relied heavily on victims' vivid and graphic recollections of the carnage Holmes inflicted inside the darkened theater and its continued effect on their lives.\nDefense attorneys were more clinical and less emotional as they tried to convince jurors Holmes was insane.\nIn the end, prosecutors and jurors said, a single juror blocked Holmes' execution, believing his mental illness meant he should get the mercy of a life sentence. Because the jury was unable to unanimously agree on a death sentence, a judge sentenced Holmes to life in prison without parole.\nThat led to jurors becoming targets of vitriol on talk radio, social media and from frustrated victims, at least one of whom suggested there was a plant among them to ensure Holmes survived.\n\"There's a lot of people who blame us, and that's just a really hard burden to bear,\" said Mona, who favored execution.\nMona deliberated; the other three were alternates. Like the 12 main jurors, those three were forced to digest thousands of crime scene photos, coroners' reports and 911 calls. But they didn't get the chance to vote on Holmes' fate.\n\"We're not victims, but the impact on us has been tremendous. We're looking for a little bit of peace, too,\" said Jessica, a 30-year-old high school teacher who, like the others, began seeing a therapist after the trial.\nA recent lockdown drill at school made her unusually nervous about whether she would be able to protect her students if a real gunman roamed the halls. \"And movie theaters?\" she said. \"That's out of the question.\"\nWhen she went to see a movie during the trial, she just stared at the floor and cried.\nOne of Mona's most tormenting flashbacks is that of the face of Ashley Moser when the verdict was read. Moser, a 28-year-old mother who was paralyzed, suffered a miscarriage and whose 6-year-old daughter Veronica was killed in the attack, shook her head and then slowly leaned it against the wheelchair of another paralyzed victim.\nMona can't shake that image, especially when her new sleeping pills don't work. She worries that jurors let the victims down by blocking death for the man who caused such profound and lingering harm and wonders if they should have deliberated longer.\nHer temper is shorter and she is more anxious now. She is so fearful of large crowds that she missed her 16-year-old son's playoff football game.\nThe theater attack has been eclipsed already by so many other acts of mass violence. Even if it feels like the rest of the world has moved on since Holmes' August sentencing, the jurors want people to remember what happened.\nThey are raising money to add artwork to a memorial outside Aurora's city hall. In doing that, they've connected with others tied to the attack — a handful of the victims they had only known from the day-to-day sight of their solemn faces in the courtroom gallery.\nAt one joint interview with a local radio station about the memorial, Jessica broke down crying. She was embraced by Megan Sullivan, whose 27-year-old brother, Alex, was killed in the attack.\nThose connections have been a relief for the jurors: \"Just to know that they don't hate us,\" Mona said.\nHeather Dearman, Moser's cousin, briefly met the jurors through fundraising and expects to keep in touch with them for years.\n\"For them, it's a fresh wound,\" Dearman said. \"I can see that they are in their grief process, at a different place than I am. I just wanted to put my arms around them and hug them and tell them that everything is going to be OK.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3394143/For-theater-shooting-jurors-trial-began-verdict.html"}
