{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:57:12","date_modify":"2018-10-30 22:57:12","date_publish":"2016-08-31 08:00:00","description":"For decades, the standardized test scores of California students have shown that achievement gaps based on race, ethnicity and class—while","filename":"data/vaneerConsumption/Forstudentstheoverlookedtestscoregapthatisntclosing.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/GenderGapPhoto-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940232.html","title":"For students, the overlooked test score gap that isn't closing","title_page":"For students, the overlooked test score gap that isn't closing | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"For decades, the standardized test scores of California students have shown that achievement gaps based on race, ethnicity and class—while troubling—tended to narrow over time. And an alarming gender discrepancy that once showed girls testing significantly behind boys in math has actually vanished.\nBut while the state’s newly released 2016 scores show small improvements overall compared to last year’s results, one largely overlooked gap persists. In virtually every major school district in the state, boys continue to score lower than girls in English. That gender gap is not only dramatic; it actually increased slightly from last year.\nStatewide, 54 percent of California girls passed the 2016 English portion of the exam, compared to about 42 percent of boys. That 12 percentage point gap is 1 point larger than it was in 2015.\nThe reading gender gap\nBut perhaps more remarkable is how consistently girls edged boys across the entire state.\nA CALmatters analysis of the test results that parents will receive about their children this month discovered that out of the 700 school districts where at least 100 students of each gender took the test, only two school districts in the entire state saw male students outperform their female peers. That encompasses a wide swath (about 70 percent) of school districts with students of diverse demographic and socioeconomic backgrounds.\nThe two exceptions: Ballico-Cressey Elementary School District in Merced and Briggs Elementary School District in Ventura.\nNo matter the school district, girls beat boys in reading scores\nGranted, the gap in reading and writing proficiency between California girls and boys is significantly smaller than other longstanding and well-publicized achievement gaps on standardized tests. White students were more than twice as likely to meet state testing standards in English language arts than Hispanic or African-American students. And 35 percent of students from low-income backgrounds scored proficient, compared to 68 percent of their higher-income peers.\nThe gender gap in English reading and writing “is not as wide as other achievement gaps,” said Diane Renter, director of the Center for Education Policy at George Washington University. “But it should be watched because it’s persisted for years now.”\nAnd while class and ethnicity are strong predictors of how a student will do on both the English and math portions of the test, the gender disparity only applies to English language arts. The exact same percentage of girls and boys (37 percent) met the state’s math standard this year.\nThat’s not a one-year anomaly or a result of the state’s new testing regiment, which began last year and is aligned with Common Core, a set of new K-12 learning standards intended to better prepare students for college. Mirroring a national trend, over the previous two decades California girls caught up with boys on the math portion of state standardized tests.\n“There’s been kind of this persistent stereotype that girls don’t do as well as boys at math, and that’s not true,” said Victor Chudowsky, a former researcher with the nonpartisan Center for Education Policy who analyzed gender differences in standardized tests scores across multiple states. “Their level of proficiency is pretty much equal.”\nGirls catch boys in math, lead in English\nThe gender difference on the state’s latest round of standardized testing should come as no surprise to anyone paying attention to how California boys and girls are generally doing in school. The girls lead boys by significant margins in graduation rates (84 percent to 77 percent), graduates meeting California college course requirements (49 percent to 38 percent), and are less likely to be suspended than their male peers.\nBut drilling deeper into the testing data provides an interesting glimpse as to exactly where boys are falling behind.\nOn the “listening” component of the exam, where students are tested on how well they understand spoken information, the percentage of boys and girls who failed to score near the state standard was relatively close. But boys are farther behind in both the reading and writing portions of the test, with more than one out of every three boys failing to score near the standard.\nCalifornia is not the only state to see a stark difference in reading scores between genders. Several other states administered the same Common Core-aligned test as California A roughly 10 percentage-point gap between boys and girls can be found in most of those states among 4th graders who took the test, despite the markedly different demographics of their student populations or overall performance on the test.\nThe reading gender gap across states\nExactly why girls outperformed boys on reading tests is difficult to answer, and is tied to the question of why girls generally fare better in school. Some research by child psychologists shows that boys develop reading skills slower than girls before kindergarten—a divergence that possibly worsens later on. Other researchers suggest a predominantly female teacher workforce may be ill-equipped to handle male students.\nBut images of masculinity that downplay educational achievement may be to blame, especially among lower-income students, according to Claudia Buchmann, an Ohio State sociology professor specializing in gender and education research. “I would argue that a lot of these patterns go beyond schools and how kids are taught,” she said. “The real issue is a culture where some boys have come to equate doing well in school as a feminine pursuit.”","url":"https://calmatters.org/articles/california-students-heres-one-test-score-gap-that-isnt-closing/"}
