{"authors":[],"date_download":"2018-10-22 21:11:17","date_modify":"2018-10-22 21:11:17","date_publish":"2014-06-04 15:51:20","description":"As a bonus, there's an adult entertainment club at street level that pays $1 million a year in rent.","filename":"data/vaneerConsumption/ForSaleDirtiestHotelinAmericaOnly180Million.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/487101/hotelcarter_29a285c94f50f3dc60b5e95363c24ef7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_real-estate_sale-dirtiest-hotel-america-only-180-million-n122431_1540242677.html","title":"For Sale: 'Dirtiest' Hotel in America, Only $180 Million","title_page":"For Sale: 'Dirtiest' Hotel in America, Only $180 Million","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"It's the dirtiest, and best located hotel in New York City,\" Lawrence Wolfe, who has been handling the sale for the seller, said Tuesday. \"It was under-managed and neglected.\"\nAlthough TripAdvisor scrapped the annual dirty list in 2012, some of the recent TripAdvisor reviews echo that same old sentiment: \"Absolutely vile! Unsafe, nasty and falling down!\" Yet it has its fans: \"Amazing location with an exceptionally affordable price tag!\"\nFirst opened in the 1930s as the Hotel Dixie, the Carter recently has been tied up as the estate of the former owner is settled. In recent years it has been in the news for code violations as well as a homicide.\nNow with the travel market rebounding and hotel construction unable to keep up with demand, even the Hotel Carter drew 25 bids from suitors, according to Wolfe, who is the senior managing director and partner at Eastdil Secured, a real estate banking company and wholly owned subsidiary of Wells Fargo.\n\"It is a seller's market,\" said Keith Pattiz, a partner at McDermott Will & Emery, who was on a hotel finance panel with Wolf on Tuesday at the New York University Hospitality Industry Investment Conference.\nThe sale, expected in the $180 million range, will be followed by a full-gut renovation that will cost $100 million to $125 million, Wolfe said.\nA street-level adult entertainment club that pays $1 million a year in rent will remain in the building, Wolfe said.","url":"https://www.nbcnews.com/business/real-estate/sale-dirtiest-hotel-america-only-180-million-n122431"}
