{"authors":["Bob Price"],"date_download":"2018-10-30 20:40:17","date_modify":"2018-10-30 20:40:17","date_publish":"2014-05-22 01:04:00","description":"HOUSTON, TX--FBI Director, speaking before the Senate Judiciary Committee today agreed that Major Nidal Hasan's shooting attack at Fort Hood in 2009 was |","filename":"data/vaneerConsumption/FortHoodShootingHasanInspiredbyAlQaedaAgreesFBIHead.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2013/08/28/5a5a47c1-eb06-4726-9aa4-fde4e5abb28bjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_05_21__1540932017.html","title":"Fort Hood Shooting: Hasan Inspired by Al Qaeda, Agrees FBI Head","title_page":"Fort Hood Shooting: Hasan Inspired by Al Qaeda, Agrees FBI Head | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, TX–FBI Director, speaking before the Senate Judiciary Committee today agreed that Major Nidal Hasan’s shooting attack at Fort Hood in 2009 was inspired by al-Qaeda. The federal government’s official position classified the incident as “workplace violence.”\nThe comment came during questioning by U.S. Senator John Cornyn (R-TX) of FBI Director James Comey during a Senate Judiciary Committee hearing about the 2009 attack on Fort Hood by Army Major Nidal Hasan. In the video below, provided by Sen. Cornyn’s YouTube account, Cornyn asks Director Comey, “Do you agree with the intelligence community’s assessment that Hasan was inspired by al-Qaeda to conduct that attack?” Comey responded, “Yes, sir. Based on everything I’ve read, again, I wasn’t in office at the time, but I’ve read about it since, and I do.”\nCornyn responded, “I appreciate that straightforward answer.”\nKETK TV reported, “Currently, the victims of the Fort Hood terrorist attack have not received the same awards and benefits as their counterparts who are wounded or killed either through enemy action or a terrorist attack, because the perpetrator did not fit the Pentagon’s definition of an international terrorist.”\nBreitbart News reported in Sept, 2013 that Senator Ted Cruz (R-TX) cosponsored legislation, “the Honoring the Fort Hood Heroes Act, filed by Sen. John Cornyn (R-TX) to rightfully designate the Fort Hood shooting as a terrorist attack. In the aftermath of the shooting, the State Department designated the attack as ‘workplace violence’ because the attack took place on U.S. soil rather than in a designated combat zone. This designation has prevented victims from receiving the same awards and benefits as their deployed counterparts who are wounded or killed in the line of duty. The Honoring the Fort Hood Heroes Act would correct this inequity and provide benefits the Fort Hood victims deserve.”\nBreitbart Texas reached out to Senators Cornyn and Cruz for their reactions to this statement by Director Comey. When available, that information will be updated in this story.\nFollow Bob Price on Twitter @BobPriceBBTX","url":"https://www.breitbart.com/border/2014/05/21/fbi-director-agrees-fort-hood-hasan-shooting-was-inspired-by-al-qaeda/"}
