{"authors":["Kenneth Dickerman","Photo Editor","Camilo Leon-Quijano"],"date_download":"2018-10-21 03:01:07","date_modify":"2018-10-21 03:01:07","date_publish":"2018-08-01 10:01:06","description":"Photographer Camilo Leon-Quijano spent time documenting a women's rugby team in France.","filename":"data/vaneerConsumption/FortheseunderprivilegedyoungwomeninFrancerugbyprovidesstrengthresilienceandempowerment.json","image_url":"https://www.washingtonpost.com/resizer/1vtJVJ8PSWoax0hZPZRizYTr9qo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6XPM3NFOTM74FPQTK63FB2WOI4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_01__1540090867.html","title":"For these underprivileged young women in France, rugby provides strength, resilience and empowerment","title_page":"For these underprivileged young women in France, rugby provides strength, resilience and empowerment - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Training day in Chantereine High School under the snow. In the background, the public housing buildings of Sarcelles. (Camilo Leon-Quijano)\nOne of the best players of Chantereine High School, this girl lives in a public housing tower in Sarcelles. The city has the biggest social-housing density of the country. (Camilo Leon-Quijano)\nCamilo Leon-Quijano is a Colombian-born photographer based in Paris. He is also a PhD Fellow in Sociology and a lecturer at the Gender Studies department of the EHESS of Paris (School for Advanced Studies in the Social Sciences). Leon-Quijano uses photography as a way to understand urban spaces. In Sight is sharing a project he did on the women rugby players in a suburb north of Paris. He told In Sight the following about the project:\nIn January 2017, I started following a group of rugby players from the Chantereine High School of Sarcelles, a stigmatized “banlieue” in the north of Paris. Banlieue is a French word to designate a suburb. The banlieues are often socially and politically dismissed by the state. Sarcelles is one of the most impoverished and stigmatized cities in the country, and a significant part of its population has an immigrant background.\nLast year the Chantereine club was one of the best newcomer teams of the country. This was in part due to a collective effort between a young group of women rugby players and their coach, Florian Clement. In 2015, Clement started a project called “20 Rugby Women Sarcelloises.” The main objective of this project was to use rugby as a way to limit school dropouts and to promote citizenship values. In fact, Sarcelles has one of the highest school dropout rates of the country. By virtue of this project and the values promoted by rugby — empowerment, discipline, teamwork — the young women were motivated to obtain their high school diplomas. At the end of the year all of the young women achieved their goals and got their diplomas. In addition, four of them were selected to join professional rugby clubs in Montpellier, Perpignan and Bretigny. They will continue their schooling in these professional training centers for the next three years.\nAt the end of the project, we made a large-format photographic exhibition in the young women’s high school to showcase the girls’ commitment to this sport. Twenty-two photos were displayed on the walls of Chantereine. The exhibition traces the strength, resilience and empowering role of rugby in the girls’ lives.\nFor these young women, rugby is an empowering way to overcome difficulties and gain confidence. It is also a tool to reverse gender, social and racial stereotypes and to change the image of young women living in the French suburbs.\nThis project is part of doctoral research in photography, sociology and visual anthropology at the EHESS (School for Advanced Studies in the Social Sciences of Paris).\nThe players have been training together since 2014. In 2016 they were the best newcomer team of France. (Camilo Leon-Quijano)\nThe team trains in the mud on the “Nelson Mandela” rugby field in Sarcelles. (Camilo Leon-Quijano)\nThe female rugby players sometimes face biases from society, as well as from their families. The image relayed by media about young women living in banlieues is often negative. And some families don’t encourage the girls to practice rugby because they consider it a “rude” sport, suitable only for men. (Camilo Leon-Quijano)\nTenacity and commitment: The players apply these values everywhere, particularly in their everyday lives. (Camilo Leon-Quijano)\nTaking a breath after playing all afternoon in the Coupe du Val d’Oise. (Camilo Leon-Quijano)\nWaiting at the Garges-Sarcelles train station. (Camilo Leon-Quijano)\nInvited by the Olympic Committee to attend the final of the “Top 14” (National Rugby League), the team watches a game at the Stade de France in Saint-Denis. (Camilo Leon-Quijano)\nIn Chantereine, 86 percent of the students come from low-income families. The athletes have been training together since 2014. In this 2017 picture, they prepare to travel to Britain. (Camilo Leon-Quijano)\nOne of the rugby players prepares for school. Her room is decorated with posters of the French Female Rugby 7 Team. (Camilo Leon-Quijano)\nKoumba cries after receiving good news from her coach, Florian: She has been accepted at the USAP, a specialized rugby training center based in Perpignan. She will live and train at the USAP. Before Koumba joined the Chantereine team, she was at risk of being expelled from school for bad behavior. Now she’s one of the best players on the team. (Camilo Leon-Quijano)\nWalking through the fields after receiving the news that she will leave Sarcelles to join USAP. (Camilo Leon-Quijano)\nBack to the field. The rugby players focus before a regional match in Saint-Denis. They are listening to instructions given by their coach Florian. (Camilo Leon-Quijano)\nWarming up before a regional match in Bobigny. (Camilo Leon-Quijano)\nIn spite of the image of being a “rude sport,” rugby promotes values such as teamwork, respect, discipline, humility and solidarity. In addition, it encourages self-confidence. (Camilo Leon-Quijano)\nGetting water after a tournament in Garges. (Camilo Leon-Quijano)\nWaiting in the middle of the field for the next match. (Camilo Leon-Quijano)\nThe captain of the team receives a trophy. (Camilo Leon-Quijano)\nFor these players, rugby has been an empowering way to overcome difficulties and gain confidence. It is also a tool to challenge stereotypes and to change the image of young women living in French suburbs. (Camilo Leon-Quijano)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nThousands entered the iPhone Photography Awards contest. These are the winners.\nInside a mostly faded culture on Norway’s border with Sweden\nHaunting images of life on the St. Lawrence River in Canada","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/01/for-these-underprivileged-french-young-women-rugby-provides-strength-resilience-and-empowerment/"}
