{"authors":["Anya Kamenetz"],"date_download":"2018-10-23 00:57:31","date_modify":"2018-10-23 00:57:31","date_publish":"2014-09-12 00:00:00","description":"One in five newly hired teachers has skipped university preparation for teaching. Indiana is the latest state to make entering the classroom easier.","filename":"data/vaneerConsumption/ForTeachersManyPathsIntoTheClassroomSomeSayTooMany.json","image_url":"https://media.npr.org/assets/img/2014/09/11/manypaths_npred3_wide-9574c032628fe1d40f138f3de11a774277f3485e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ed_2014_09_12_347375798_for-teachers-many-paths-into-the-classroom-some-say-too-many_1540256251.html","title":"For Teachers, Many Paths Into The Classroom ... Some Say Too Many","title_page":"Rise In Alternative Certification For U.S. Teachers : NPR Ed : NPR","title_rss":"NULL","source_domain":"npr.org","text":"For Teachers, Many Paths Into The Classroom ... Some Say Too Many\nEnlarge this image LA Johnson/NPR LA Johnson/NPR\nHey, you there. You have a college degree? How'd you like to be a teacher?\nIndiana has just approved a license that clears a new pathway to the teaching profession. It allows anyone with a bachelor's degree, a B average and approximately three years of related work experience to become a middle or high school teacher in a subject such as math, science or music, provided they pass a content test.\nThe new teachers, called \"career specialists,\" are required to enroll in a program to acquire teaching skills, but they'll essentially be learning on the job.\nThe new license brought pushback from educators like John Jacobson, dean of the Teachers College at Ball State University in Muncie, Ind.\n\"There's no accountability. There's nothing other than the principal saying they can teach,\" he told NPR Ed. \"This is a problem for us.\"\nAlternative certification has grown as a means of addressing teacher shortages, especially in certain content areas.\n\"It's a benefit to districts to find highly qualified teachers, and it's a benefit to career changers to apply their job experience in classroom teaching without having to take a pause for one to two years to go back to school,\" says Michelle Haj-Broussard, president of the National Association for Alternative Certification, a professional association representing these programs.\nBut these programs are controversial, fueling debates over the rigor of preparation, over the importance of teachers having subject expertise, and over programs like Teach for America that offer routes into the profession that bypass traditional colleges of education.\nJacobson says there's no shortage of teachers in Indiana.\n\"Overall we export teachers,\" he says. \"We've got more history and English teachers than we know what to do with.\"\nHe says he was bothered by a lack of oversight or specification for how these teachers will actually learn to teach once they receive their licenses.\nThere have been similar concerns since 1983, when New Jersey became the first state to create an alternative path to the classroom.\nToday, such programs are increasingly popular. One in five new teachers becomes a teacher through means other than a four-year undergraduate program or a master's degree. Many are uncertified the first time they stand in front of students as the \"teacher of record\" — the only adult in the room.\nThese programs vary widely in their design. For example, Teach for America, designed for new college graduates, famously offers just a five-week summer institute before placing teachers in classrooms. The New York City Teaching Fellows program is aimed at midcareer adults, who earn a master's degree in education while teaching full time. And in Texas, many for-profit providers offer teacher preparation that is entirely online.\nThe National Council on Teacher Quality is a nonprofit group that advocates for changes to \"challenge the current structure and regulation of the [teaching] profession.\" The organization reviews and grades teacher-preparation programs around the country.\nThis year, for the first time, researchers there did a pilot study of \"alt-cert\" programs as well. They focused on 85 of the \"most\" alternative programs — those not affiliated with a higher education institution that also prepares teachers the traditional way. The programs were evaluated based on criteria such as the applicants' GPA and the amount of support they received in their internships.\nThe results were not good. Sixty-three of the 85 programs — 74 percent — got a \"D\" or an \"F,\" with for-profit programs faring worst overall. By contrast, only 41 percent of the traditional programs scored this low.\nSandi Jacobs, NCTQ's vice president and managing director for state policy, says the alternative programs were \"weak across the board.\"\n\"They were not very selective. They did not ensure that the teachers had the content background that they needed for the subject, which is a real problem,\" Jacobs says. \"And most alarming of all, the support that the programs were providing was in many cases very minimal and lax.\"\nJulian Vasquez Heilig, a professor of educational leadership and policy at California State University in Sacramento, Calif., co-authored a study showing that alternatively certified teachers had negative impacts on student achievement in Houston.\n\"I fly a lot,\" he says. \"Let's say you go to the airport and you have a choice of three different pilots. One has trained for 30 hours online, the second has five weeks in the summer, and the third has studied, become certified and has spent a year as an intern. Which airplane would you choose?\"\nAlternative certification programs are growing at a time when there has been considerable attention at the federal and state policy level to the importance of quality teachers. Recruitment, preparation and performance evaluation are all coming under scrutiny.\nIt's worth noting that the NCTQ has been critical of traditional certification programs, too.\n\"If traditional programs knocked it out of the park,\" Jacobs says, \"there would be less need for alternative programs.\"","url":"https://www.npr.org/sections/ed/2014/09/12/347375798/for-teachers-many-paths-into-the-classroom-some-say-too-many"}
