{"authors":["Peter Over"],"date_download":"2018-10-22 21:32:10","date_modify":"2018-10-22 21:32:10","date_publish":"2016-12-27 00:00:00","description":"Federal ethics laws were written to cover 20th century wealth, such as stocks and bonds. But President-elect Donald Trump derives much of his fortune from his name. What now?","filename":"data/vaneerConsumption/ForTrumpPresidencyOldEthicsLawsMeetNewMoneyMakingMethods.json","image_url":"https://media.npr.org/assets/img/2016/12/26/ap_16356689767948_wide-a28838bc5fda90de758e77922e5b4d4391bcce57.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_12_27_507031998_for-trump-presidency-old-ethics-laws-meet-new-money-making-methods_1540243930.html","title":"For Trump Presidency, Old Ethics Laws Meet New Money-Making Methods","title_page":"For Trump Presidency, Old Ethics Laws Meet New Money-Making Methods : NPR","title_rss":"NULL","source_domain":"npr.org","text":"For Trump Presidency, Old Ethics Laws Meet New Money-Making Methods\nEnlarge this image toggle caption Andrew Harnik/AP Andrew Harnik/AP\nPresident-elect Donald Trump's type of wealth — based largely on the value of his brand name and on global real estate holdings — doesn't fit well with existing ethics laws, which were written for an earlier time when rich politicos mainly invested in stocks and bonds.\nTo be clear, some ethics laws do apply to the incoming president.\n\"He's still subject to bribery laws, he's subject to the STOCK Act, which prohibits insider trading,\" says Larry Noble, general counsel for the Campaign Legal Center, which supports anti-corruption laws.\nWhat doesn't apply to presidents is the federal conflict-of-interest law. So for example, Trump can own a golf resort while he also shapes the tax, environmental and labor laws that could affect his golf profits.\nNoble says Trump could follow the example of other presidents and voluntarily put his holdings into a blind trust. On Fox News earlier this month, Trump said he would give control of his holdings to his children, but that's a less-than-blind arrangement.\nNow, you may be wondering why there isn't a conflicts law for the president. One argument is that such a law would violate the Constitution. Congress cannot pass a law that restricts a president's decision-making authority. In 1989, a presidential commission was assigned to set ethics standards for all federal officials.\nBut with the Constitution's separation of powers \"we quickly came to the conclusion that that was not possible, for both constitutional and practical reasons,\" says ethics attorney Jan Baran, was served on the commission.\nSo there are conflict-of-interest rules for most government employees. But not the president.\nAnd there's another problem with the ethics laws.\nThey were written to cover 20th century wealth, which typically came from stocks and bonds — paper that could be turned over to a trust.\nBut Trump derives much of his fortune from his name, which he licenses on properties all over the world.\nThat's not uncommon these days. Think of Oprah, or Ralph Lauren. That kind of wealth can't be put into a blind trust.\nBaran says new laws are not needed for this kind of wealth. Presidents just need to do the right thing.\n\"It will require presidents going forward to figure out how to impose rules on themselves,\" he says.\nBut Norm Eisen, a clean-government advocate at the Brookings Institution, says the best approach lies in a clause that's already in the Constitution: the emoluments clause.\nBasically, it says government officials cannot take gifts, or emoluments, from foreign officials. Eisen says the founding fathers left room for an expansive interpretation.\n\"We capture with the very broad language intangible things like the value of Mr Trump's name,\" he explains.\nDemocrats will be pushing for this new interpretation when Congress comes back in January.","url":"https://www.npr.org/2016/12/27/507031998/for-trump-presidency-old-ethics-laws-meet-new-money-making-methods"}
