{"authors":["Associated Press"],"date_download":"2018-10-23 05:37:36","date_modify":"2018-10-23 05:37:36","date_publish":"2017-03-16 16:29:18","description":"HARTFORD, Conn. (AP) - Ousted in a purge of President Barack Obama appointees, U.S. Attorney Deirdre Daly spent the weekend clearing out her office,...","filename":"data/vaneerConsumption/ForUSattorneyssparedinpurgealameduckperiodbegins.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/18/wire-230061-1489689015-592_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320980_For-US-attorneys-spared-purge-lame-duck-period-begins_1540273056.html","title":"For US attorneys spared in purge, a lame-duck period begins","title_page":"For US attorneys spared in purge, a lame-duck period begins | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"HARTFORD, Conn. (AP) - Ousted in a purge of President Barack Obama appointees, U.S. Attorney Deirdre Daly spent the weekend clearing out her office, receiving calls from well-wishers and making tearful farewells. Then, on Sunday night, she learned she would be staying.\nDaly, the top federal law enforcement official for the district of Connecticut, is among a small number of career prosecutors who were given more time to reach service anniversaries that are important for retirement benefits.\nThey now enter lame-duck periods in which experts say they can be just as effective but may not have as much latitude.\nFILE - In this Feb. 4, 2015 file photo, Deirdre Daly, U.S. attorney for Connecticut, stands with other federal officials while announcing a new public corruption task force in New Haven, Conn. U.S. Attorney General Jeff Sessions requested the resignations of 46 remaining U.S. attorneys who had been nominated by former President Barack Obama. Daly learned Sunday night, March 12, 2017, that she is among a small number of career prosecutors who were given more time to reach career service anniversaries before she has to leave office. (AP Photo/Dave Collins, File)\n\"It feels a bit like I've risen from the dead,\" Daly said in an interview. \"I don't at all feel diminished by this. If anything, I feel I've received a lot of support for which I am tremendously grateful.\"\nAttorney General Jeff Sessions, a Republican, on Friday requested the resignations of 46 remaining U.S. attorneys who had been nominated by Obama. It's fairly customary for the 93 U.S. attorneys to leave their posts once a new president is in office, and many had already left or were making plans for their departures.\nDaly, a registered Democrat who never has been active politically, submitted her resignation but was given a reprieve until the end of October, when she completes 20 years with the Justice Department. The U.S. attorney for the Northern District of New York, Richard Hartunian, was allowed to stay through June, when he reaches the 20-year mark.\nFifteen-year Justice Department veteran John Huber, the U.S. attorney for Utah, will stay on an interim basis for another four months.\n\"As a career prosecutor and public servant, this privilege to represent our nation is the pinnacle of my career,\" Huber said. His office declined to comment on the reasons for his extension.\nThe new interim status likely will not have much effect on what these prosecutors do in their jobs, but they may have less influence or less latitude compared to those appointed by President Donald Trump's administration, according to Michael Gerhardt, a professor at the University of North Carolina School of Law.\nDaly, who has led the district since 2013, said she loves the job for the ability to improve the quality of people's lives and she's grateful to stay a while longer. Like the other holdovers, she stressed common ground with Sessions on the commitment to fight violent crime.\nDaly also has been known for outreach on issues that aligned with the priorities of former Attorney General Loretta Lynch, a Democrat. Her office has provided cultural competency and anti-bias training for local police, developed partnerships with Arab, Muslim and Sikh community leaders and worked to bridge a divide between law enforcement and minority communities.\nDaly said she has no trepidation about the transition.\n\"I am optimistic that there will be no need to trim our sails and that we will continue the work that we are so committed to,\" she said.\nStanley Twardy, a former U.S. attorney for Connecticut, said he did not expect there would be any loss of standing for Daly.\n\"She has a lot of respect among the assistants as it is,\" he said. \"That will continue and she is the boss.\"\nA spokesman for Hartunian, in New York's Northern District, said he will not be any less effective.\n\"He is fully familiar with the cases and important issues in the district,\" said Richard Southwick, an assistant U.S. attorney. \"We have every reason to believe he will be the successful chief prosecutor that he has been in the past.\"\n___\nAssociated Press writer Michelle L. Price in Salt Lake City contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4320980/For-US-attorneys-spared-purge-lame-duck-period-begins.html"}
