{"authors":["John Lynch"],"date_download":"2018-10-30 18:34:11","date_modify":"2018-10-30 18:34:11","date_publish":"2016-04-21 00:00:00","description":"Jurors who heard a Little Rock man describe a life-or-death struggle with armed robbers inside a careening car sentenced his 23-year-old assailant to seven years in prison on Thursday.","filename":"data/vaneerConsumption/ForwildrideassaultduringdrugdealLittleRockmansentencedto7years.json","image_url":"https://media.arkansasonline.com/img/photos/2016/04/21/Screen_Shot_2016-04-21_at_4.24.36_PM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_apr_22_for-wild-ride-assault-during-drug-deal-__page=1_1540924451.html","title":"For wild-ride assault during drug deal, Little Rock man sentenced to 7 years","title_page":"For wild-ride assault during drug deal, Little Rock man sentenced to 7 years","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Jurors who heard a Little Rock man describe a life-or-death struggle with armed robbers inside a careening car sentenced his 23-year-old assailant to seven years in prison on Thursday.\nADVERTISEMENT\nMore headlines\nThe defendant, Turod Cortez Jacobs, did not testify at the two-day trial before Pulaski County Circuit Judge Herb Wright, but both prosecution and defense attorneys acknowledged that the Jan. 3, 2015, encounter between the men began when Sheldon Jerome Jones attempted to buy 1½ pounds of marijuana for $1,150 from another man, Jonah \"Skeet Rock\" Willis.\nJones, 41, said he met two men he knew as \"Black\" -- whom Jones identified as Jacobs -- and \"Ghost\" outside his home at the Bristol Park Apartments on Napa Valley Drive. The men said they'd been sent by Willis.\nJones said he got into the back seat of their car, a police-style white Chevrolet Impala, expecting to buy the marijuana. Instead the men turned on him with guns, he told jurors.\n\"Ghost,\" who remains unidentified, took Jones' jewelry and money when Jacobs started driving, Jones said.\nThe men threatened to kill Jones, and he grabbed the gun barrel to keep \"Ghost\" from shooting him, Jones said, but Jacobs used his pistol to beat him.\nJones said he kicked the car's steering wheel, sending the vehicle veering onto Mimi Lane in west Little Rock. With his foot stuck in the wheel, the Impala ended up rolling through a yard in the 800 block of North Shackleford Road, he told jurors.\nHomeowner Geoff Carmack testified that he saw the car make a Dukes of Hazzard-style jump into another yard. He could hear a man screaming for help inside the vehicle, but he couldn't see who was screaming, he said.\nCarmack said he got the car's license number and reported the situation to police.\nThe ride ended at the Sturbridge apartments at Rodney Parham and Old Forge roads when Jacobs pulled the car over and forced Jones out into the parking lot, Jones testified.\nWorkers at a nearby convenience stored called police for him.\nBut what came out of the car with Jones -- a black, fuzzy, woman's boot -- was also significant, prosecutors said.\nA week later, when police pulled the car over, investigators said they found the boot's mate in the trunk. They also reported finding Jacobs in the passenger seat and some of Jones' jewelry in his pocket.\nThe driver of the car at that time was Jacobs' girlfriend, Tyra Grayson, who owned the vehicle, according to testimony.\nDefense attorney Alex Hollowell denounced Jones as a liar who was trying to frame her client and keep himself out of prison. Jones told too many stories to be believed, she said.\nJacobs had actually thwarted an effort by Jones, who is on parole for a 2000 crack cocaine-trafficking conviction in Ouachita County, to take the marijuana by force, Hollowell said.\n\"All they've proved to you is that Sheldon Jones is a liar,\" Hollowell told jurors. \"You have to believe the word of a man who initiated a drug deal, who is a convicted felon involving drugs. When he [Jones] didn't get what he wanted, he came up with a lie to police.\"\nDeputy prosecutor Meredith Strong called Jones' ordeal \"the ride from hell\" that forced him to fight for his life, arguing that police pictures of the older man's bruised and battered face taken the day of the encounter show he was the victim.\nDeputy prosecutor Matt Stauffer said all of the evidence showed that Jones was telling the truth about what had happened.\n\"He's not a liar. He's a man who got struck in the head numerous times, and he told police what happened the best he could,\" Stauffer said. \"Sheldon Jones was telling you the truth today, and it was corroborated by every one of the eight witnesses we put on.\"\nJacobs had been charged with aggravated robbery, but the nine women and three men deliberated about 90 minutes Wednesday to reduce that charge, which has a 10-year minimum sentence and stricter parole qualifications, to simple robbery, which carries a five-year minimum.\nHis only felony conviction was in 2012 for furnishing prohibited articles after being found in a Mississippi County jail cell with a cellphone while under arrest on a traffic violation.\nBut Jacobs has other legal challenges ahead. He's scheduled to stand trial next month in Little Rock on charges of aggravated assault and aggravated residential burglary, which together carry a potential life sentence, over accusations that while out on bond in the Jones robbery, he forced his way into the West 36th Street home of Natassia Sade Sims, 22, on March 4, 2015, and threatened her and her 2-year-old daughter, Londyn Register, with a gun.\nWhen he was arrested on those charges two weeks later, police reportedly found him with a rifle, which resulted in a felony charge of felon in possession of a firearm, court records show.\nAnd he's been under federal indictment with another man, Kristopher Michael Kalson, 28, of Little Rock, since January on charges of being a felon in possession of a firearm, stemming from the men's Aug. 4, 2014, arrest in White County. Jacobs and Kalson, whose crimes include a Washington state conviction for failure to register as a sex offender, are scheduled to stand trial in June.\nMost recently, Jacobs was arrested at Park Plaza on Jan. 26 on a misdemeanor shoplifting charge after he reportedly was caught hiding clothes under his jacket at Dillard's. According to federal court filings, Jacobs, who had been on home detention with an ankle monitor, had been given special permission to go to the mall to apply for a job, but was arrested within an hour of leaving the house.\nProsecutors played store surveillance video of his encounter with police at the store, showing Jacobs running through the store with police chasing, only to surrender when they threatened to use an electric stun gun on him.\nMetro on 04/22/2016","url":"https://www.arkansasonline.com/news/2016/apr/22/for-wild-ride-assault-during-drug-deal-/?page=1"}
