{"authors":[],"date_download":"2018-10-22 20:55:00","date_modify":"2018-10-22 20:55:00","date_publish":"2014-06-03 15:58:10","description":"Questions swirled about Bergdahl's disappearance soon after his capture in 2009.","filename":"data/vaneerConsumption/ForWhiteHouseLongstandingQuestionsCloudBergdahlsRelease.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484441/bergdahl_1af10fa80bc4cb935ebdd03ac6ed087c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_white-house-longstanding-questions-cloud-bergdahls-release-n121346_1540241700.html","title":"For White House, Longstanding Questions Cloud Bergdahl's Release","title_page":"For White House, Longstanding Questions Cloud Bergdahl's Release","title_rss":"NULL","source_domain":"nbcnews.com","text":"Before departing for a week-long European trip, Obama celebrated the former prisoner's release this weekend, appearing alongside Bergdahl’s parents at a hastily-called White House statement.\nA day later, National Security Advisor Susan Rice offered a startlingly favorable assessment of a soldier who served in Afghanistan for only six weeks before his disappearance.\n“He served the United States with honor and distinction,” she said. “And we’ll have the opportunity eventually to learn what has transpired in the past years.”\nBut on Tuesday, Deputy National Security Adviser Tony Blinken was unwilling to echo those words during an appearance on MSNBC, saying only that Bergdahl must “tell his story.”\n\"He hasn't even spoken to his family yet,\" he said. \"He just spent five years in captivity. We want to bring him home.\"\nNow, the military is openly questioning the \"honor and distinction” characterization. The U.S. Army is preparing to launch a full high-level inquiry into the circumstances of Bergdahl’s disappearance from his outpost in Afghanistan. That inquiry will determine whether a formal investigation into possible criminal charges against Bergdahl is warranted.\nBergdahl enlisted in the Army in 2008 and deployed to Afghanistan in May 2009. Just six weeks after his arrival in the region, Pfc. Bergdahl was captured in Paktika province in Afghanistan and taken into captivity. By July 3, the Department of Defense classified his status as “Missing-Captured.”\nWeeks later, his captors released a 28-minute video of Bergdahl, in which the then-23 year old appeared with a shaved head and spoke tearfully about his fear that he would never return home.\nBut questions about his disappearance were already swirling. That summer, U.S. officials confirmed that Bergdahl had “just walked off” the base in a remote region near the border with Pakistan. By 2010, a Pentagon investigation, concluding that Bergdahl had left his unit voluntarily without his weapon or body armor, pulled back the most aggressive efforts to retrieve him, the Associated Press reported. Bergdahl’s platoon members say that those efforts proved deadly to six soldiers as they searched for their vanished colleague.\nWith details still murky, Bergdahl rose in the ranks, even in absentia. Because soldiers who are missing in action are routinely promoted at the same time that their contemporaries are, Bergdahl was promoted to specialist in June of 2010. The following year, he was promoted to sergeant.\nRumors of his possible desertion were further fueled in June 2012, when Rolling Stone magazine published emails that Bergdahl reportedly sent to his parents before his capture, lamenting that he was “ashamed to even be an American.”\nStill, State Department officials continued to press for negotiations for his release. In January of this year, after a fifth video of Bergdahl surfaced, Pentagon press secretary Rear Adm. John Kirby told reporters that “across the spectrum, diplomatically, militarily, even from an intelligence perspective, we’ve never lost focus on Bowe Bergdahl … and on trying to get him home.”\nDiplomacy remained the main route, and a prisoner swap had long been discussed between the U.S. and the Taliban. Those talks – which included a proposal for the release of five Guantanamo Bay prisoners in exchange for the captured American – began as early as 2011 but collapsed several times under stalemate.\nObama said Tuesday that the administration has discussed those terms with Congress “for some time,” but critics say they’ve heard radio silence from the White House since the early days of the negotiations.\n“In 2011, they did come up and present a plan that included a prisoner transfer that was, in a bipartisan way, pushed back,” House Intelligence Committee head Mike Rogers said on Morning Joe Tuesday. “We hadn’t heard anything since on any details of any prisoner exchange.”\nOn Tuesday, two top lawmakers on the Senate Intelligence Committee -- Sens. Dianne Feinstein of California and Saxby Chambliss of Georgia -- said White House officials had called to apologize to them for failing to notify them of the exchange in advance.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/white-house-longstanding-questions-cloud-bergdahls-release-n121346"}
