{"authors":[],"date_download":"2018-10-22 21:15:13","date_modify":"2018-10-22 21:15:13","date_publish":"2014-06-04 19:08:33","description":"Kapteyn b is only around 2 billion years younger than the universe itself. It could also be capable of supporting life.","filename":"data/vaneerConsumption/FoundOldestKnownAlienPlanetThatMightSupportLife.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/487746/kapteyn-b-0mega-centauri_1_04b63479e09e7871fea5251a8fbbbf3f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_found-oldest-known-alien-planet-might-support-life-n122691_1540242913.html","title":"Found! Oldest Known Alien Planet That Might Support Life","title_page":"Found! Oldest Known Alien Planet That Might Support Life","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"It does make you wonder what kind of life could have evolved on those planets over such a long time,\" study lead author Guillem Anglada-Escude, of Queen Mary University of London, said in a statement.\nAnglada-Escude was referring to Kapteyn b and its newly discovered sister world, Kapteyn c, which both orbit a nearby red dwarf known as Kapteyn's Star. But only Kapteyn b, a \"super-Earth\" about five times as massive as our own planet, is thought to be potentially habitable; the larger Kapteyn c is likely too cold, researchers said.\nThe astronomers spotted both alien planets by noting the tiny wobbles their gravitational tugs induced in the motion of Kapteyn's Star. These tugs caused shifts in the star's light, which were first detected using the HARPS spectrometer at the European Southern Observatory's La Silla Observatory in Chile.\nThe team didn't expect to find a possibly habitable world around Kapteyn's Star, which is one-third as massive as the sun but so close to Earth that it's visible in amateur telescopes, in the southern constellation of Pictor.\n\"We were surprised to find planets orbiting Kapteyn's Star,\" Anglada-Escude said. \"Previous data showed some moderate excess of variability, so we were looking for very short-period planets when the new signals showed up loud and clear.\"\nKapteyn b lies in the star's habitable zone, the range of distances that could support liquid water — and thus, perhaps, life as we know it — on a world's surface. The exoplanet completes one orbit every 48 days. The colder Kapteyn c is much farther out, circling the star once every 121 days.\n- Mike Wall, Space.com\nThis is a condensed version of a story on Space.com. Read the entire story here. Follow Mike Wall on Twitter @michaeldwall and Google+. Follow us @Spacedotcom, Facebook or Google+.\nCopyright 2014 SPACE.com, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/space/found-oldest-known-alien-planet-might-support-life-n122691"}
