{"authors":[],"date_download":"2018-10-30 20:53:56","date_modify":"2018-10-30 20:53:56","date_publish":"2018-08-02 22:14:00","description":"For years, high-ranking Georgia Tech officials earning six-figure salaries used their positions to l...","filename":"data/vaneerConsumption/FourGeorgiaTechofficialscaughtinspendingscandals.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/28/Images/newsEngin.22635282_Former-Georgia-Tech-administrators.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional_lax-ov_ab6b3ce2da9308500346c7c12293e710__icmp=np_inform_variation-test_1540932836.html","title":"Four Georgia Tech officials caught in spending scandals","title_page":"Four Georgia Tech officials caught in spending scandals","title_rss":"NULL","source_domain":"ajc.com","text":"For years, high-ranking Georgia Tech officials earning six-figure salaries used their positions to line their pockets, internal investigations have found.\nWith little or no accountability, three misused taxpayer funds and exploited relationships with vendors. There were parties in a football suite, courtesy of a bookstore vendor. Golf outings during work hours. Routine meals and after-hours drinking billed to taxpayers.\nThe watchdog's warnings were ignored until a Channel 2 Action News Investigation\nA fourth official went on jaunts to China to shill products for a vendor whose board of directors he sat on, and he charged the school for his travel expenses. He also steered a Tech contract to the company and pressured employees to use its services.\nThose are findings from a Tech internal audit and a review by The University System of Georgia, both prompted by complaints from employees.\nAll four men are now out of their jobs. They may face more serious repercussions. The reports noted violations of state laws, and the University System has referred the cases to Attorney General Chris Carr’s office. A spokeswoman for Carr told The Atlanta Journal-Constitution on Friday that the office is reviewing the reports to determine “appropriate next steps.”\nThe findings come on the heels of the ouster of a Georgia Tech Research Institute administrator in a controversy over possible misspending of funds for employee morale.\nRELATED: Tech president tightening ethics controls after money scandals\nAn investigation into that matter resulted in a recommendation from the University System that Georgia Tech President George “Bud” Peterson implement an “ethics audit” to assess conduct across the entire university. Peterson declined to talk with the AJC but Tech answered some questions in writing.\nTech will take a hit to its reputation from the latest scandals, said David Williams, president of the Washington-based Taxpayers Protection Alliance.\n“They should have never let this happen in the first place,” Williams said. “From day one, there should have been internal controls and a little bit of common sense. Someone at the university, someone in this whole chain of events, should have said, ‘Wait a second, why are we spending money on this? Who signed off on it?’”\nPeterson himself signed off on an arrangement that led to conflicts of interest for one official.\nFormer Executive Vice President of Administration and Finance Steven Swant earned nearly $476,000 per year from the state, according to the state’s online salary database. Peterson also gave him the OK to serve on the board of directors of a German company, RIB.\nSwant then spent work time promoting products for the company, and the company got a no-bid contract from Georgia Tech Research Corporation and other business from Tech. Swant’s subordinates were also told to give presentations for RIB at conferences, while he chastised employees who objected that the company wasn’t the most cost effective, a review by the University System found. After a supervisor forwarded a worker’s alternative plan, Swant responded in writing, “That’s it!!! You and I need to talk. My patience with (this employee) is running short … I’ll decide what is in the project and what’s not.”\nPeterson wasn’t aware when he granted approval that the Research Corporation, the school’s licensing arm and contracting agency for sponsored research, was doing business with the company, the review found. “Mr. Swant reportedly did not provide complete information for use by President Peterson when approving this participation,” the review said.\nPeterson also thought any procurement involving the company would be handled by the state Administrative Services department, according to the review.\nIn May, Peterson asked Swant to resign from the board “effective immediately.”\nDrinking, partying, golfing\nIn another division of the college, three friends regularly dipped into Tech funds to entertain themselves, an internal audit found. The audit report portrays former Vice President of Campus Services Paul Strouts, listed in the state database as earning $273,000 per year, as the ringleader.\nStrouts convinced Georgia Tech bookstore contractor Barnes & Noble to pay $35,000 a year to Georgia Tech Athletic Association for a football suite. The donation was to be tied to the contract for the purposes of “student outreach.”\nBut over a five-year period, the suite was mainly used by Strouts, his friends, his relatives, Tech employees and their friends and relatives, the audit found. Barnes & Nobles “was effectively paying for GT employees, friends, and relatives to attend football games,” the report says.\nStrouts also asked another vendor, Sodexo, to let him use its football suite so he could entertain people he had previously worked with at Florida State University, along with family and friends. His former colleagues wanted to see the Tech game against Florida State in 2015, the audit says.\n“We all know what happens in those skyboxes. I mean, it’s just one big party,” Williams, of the Taxpayers Protection Alliance, said. “There’s not a lot of education going on.”\nMeanwhile, Strouts and Parking and Transportation Services Executive Director Lance Lunsway — salary: $157,000 — regularly took time away from the office to play golf with Tech vendors and potential vendors, another code of conduct violation.\nDuring the course of his employment, Lunsway also spent nearly 600 hours doing consulting work on Georgia Tech time, allegedly with Strouts’ blessing, according to the report.\nThen there was their friend Tom Stipes, director of digital networks, listed as earning $150,000 per year in the state database. He was hired on Strouts’ recommendation, but auditors found no purpose for his position, nor any accomplishments.\nHe spent his first year doing a feasibility study about his own position, and the prospect of digital signage. He received a $25,000 bonus for his first year, then got a promotion and a $50,000 raise. “However, we were not able to identify a clear set of accomplishments during this time period,” the report, dated July 26, says.\nIn his expense reports, Stipes submitted receipts for nearly $6,000 in meals, many of them routine and multiple times per day. Some receipts were purely for alcohol. Some receipts showed that fellow staffers also were treated, and the stated purpose was “Georgia Tech Digital Signage.”\nA Georgia Tech audit report included a pie chart showing the breakdown of ex-Director of Digital Networks Tom Stipes' meal reimbursements, including those with alcohol, those with staff and those after working hours. (SPECIAL)\nLunsway and Stipes also went on out-of-town trips where they booked in Delta Comfort Plus airline seats.\nWhen auditors confronted Strouts and Lunsway about such spending, they claimed ignorance. Strouts said he signed whatever his executive assistant put in front of him. Both men resigned during the review, and Stipes quit before he could be interviewed.\nNone of the four men accused in the audits and reviews responded to phone messages and emails from the AJC seeking comment.\nWilliams said Georgia Tech should be calling for a criminal investigation.\n“There have been way too many cases of universities sweeping things under the rug,” he said. “They need to have a strong stand on this and say, ‘OK, they’ve resigned or they’ve been fired, but guess what, that’s not the end. They embezzled money. We are going to go after them.’”\nPeterson last week agreed to conduct a comprehensive review of all outside activities and potential conflicts of interest for his direct reports and for those who are ranked as vice president or higher. In response to the University System report, Peterson also said he would clarify Tech’s policy on “consulting leave” to ensure that full-time administrators are not eligible.\nIn a campuswide email Thursday, Peterson also said he is incorporating a new vice president for ethics, compliance and risk management who will report directly to him.\nA Tech spokeswoman said Friday that other concerns raised by employees during the Campus Services audit are “under review.”","url":"https://www.ajc.com/news/state--regional/lax-oversight-allowed-high-paid-tech-officials-misuse-tax-money/KPhr38F6PupvqESYALWWIP/?icmp=np_inform_variation-test"}
