{"authors":["Press Association"],"date_download":"2018-10-23 00:33:04","date_modify":"2018-10-23 00:33:04","date_publish":"2017-04-26 10:19:09","description":"The 39-year-old cyclist won three Paralympic golds for Great Britain at last September´s Rio Games.","filename":"data/vaneerConsumption/FourteentimeParalympicchampionDameSarahStoreyexpectinghersecondchild.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/10/wire-464281-1493199853-547_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446936_Fourteen-time-Paralympic-champion-Dame-Sarah-Storey-expecting-second-child_1540254784.html","title":"Fourteen-time Paralympic champion Dame Sarah Storey expecting her second child","title_page":"Fourteen-time Paralympic champion Dame Sarah Storey expecting her second child | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fourteen-time Paralympic champion Dame Sarah Storey was celebrating the announcement that she is expecting her second child on Wednesday by going out on her bike.\nThe 39-year-old swimmer-turned-cyclist won three Paralympic golds for Great Britain at last September’s Rio Games, three years after the birth of daughter Louisa.\nAnd now Storey and her husband Barney, a Paralympic gold medal winner himself, have announced a further family member is due in October, preventing her from racing in Saturday’s Women’s Tour de Yorkshire race.\nDouble thumbs up for another baby Storey arriving in the autumn! pic.twitter.com/GO8DTJYiIl — Dame Sarah Storey (@DameSarahStorey) April 26, 2017\nStorey, prior to going on a training ride in Lanzarote, told Press Association Sport: “We’re all very excited. It’s not going to be easy to hide it for much longer.\n“I can’t race in Yorkshire on Saturday, so I need to make sure people know why. Hence the announcement today.”\nThe baby is expected before Storey turns 40 on October 26.\nStorey will not race in the Women's Tour de Yorkshire (Martin Rickett/PA)\n“It will be before I’m 40, that’s for sure,” she added.\n“Louisa’s been telling people there’s a baby in my tummy since last summer.\n“Just delighted to be adding to the family with a little brother or sister for Louisa.”\nStorey is planning to ride on to her eighth Paralympic Games in Tokyo 2020. Her first Paralympics was Barcelona 1992 as a 14-year-old swimmer.\nDame Sarah Storey with her Rio Olympics medals ( Tim Goode/PA)\nMike Kenny’s British record tally of 16 golds will be the next major target for Storey.\nShe added: “Rio was fabulous. Having Louisa on the sidelines cheering in Rio was the best part of the whole thing.\n“We never wanted her to be an only child. And I’m still getting faster.\n“We’re at the right part of the Olympic and Paralympic cycle again.\n“It gives us nearly three years to get back to full fitness.\nSarah Storey celebrates with her daughter Louisa after winning gold in the Women's Road Race C4-5 in Rio (Andrew Matthews/PA)\n“I’m actually fitter in this pregnancy, because I’d started training before I got pregnant.\n“General medical advice was that you shouldn’t attempt to get pregnant straight after Rio if you were planning because of the potential effects of Zika.”\nAlthough there were no known cases of Zika following Rio, Storey delayed trying for the baby and was able to continue training and racing.\n“I’m fitter now, I’ve been racing,” she added.\n“I did pretty much everything right last time, in terms of the amount of training I did.\nSarah Storey in action (Adam Davy/PA)\n“I’ve been really well again in this pregnancy. I haven’t had to curb training.\n“I’ve just been carrying on, doing time-trials and things where I’m in control of the pace.”\nStorey recently launched the Storey Racing team, so she will be at the Tour de Yorkshire, just not on the bike.\nBeing in charge a team with husband Barney gives them control over her racing programme.\nShe added: “We’re trying to make sure we have that flexibility, so that when it comes to coming back from having the second baby and getting on the road to Tokyo we’ve got all the balls in our court.”","url":"https://www.dailymail.co.uk/wires/pa/article-4446936/Fourteen-time-Paralympic-champion-Dame-Sarah-Storey-expecting-second-child.html"}
