{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 03:09:51","date_modify":"2018-10-23 03:09:51","date_publish":"2016-01-11 15:52:08","description":"Police found the bodies after the blaze tore through the three-storey, two family home in Rochester, New York, on Sunday night. Poilice have now taken over the investigation to figure out how it started.","filename":"data/vaneerConsumption/FourRochesterpeoplefounddeadinfamilyhomefollowingsuspiciousfire.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B6CE400000578-0-image-a-51_1452527470667.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394129_Four-people-dead-family-home-following-suspicious-house-fire_1540264191.html","title":"Four Rochester people found dead in family home following 'suspicious' fire","title_page":"Four Rochester people found dead in family home following 'suspicious' fire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Four people have been found dead following a fire police says is suspicious.\nPolice found the bodies after the blaze tore through the three-storey, two family home in Rochester, New York, on Sunday night.\nDavid Burroughs arrived at the scene and said his nephew, Michael Adams, was among the victims.\nScroll down for video\nFour people have been found dead after a fire in Rochester, New York, that police are treating as suspicious\nHe told the Rochester Democrat and Chronicle he was a good kid, but didn't know when he had moved into the home.\nThe three others have not been identified.\nThe fire started in the staircase between the second and third floor.\nIt reportedly took 15 minutes to be put out.\nOne of the residents called 911 just after midnight and was outside the apartment when firefighters arrived.\nThe cause of the fire and death of the four adults are under investigation by the Rochester police's homicide unit, Time Warner News reported.\nPolice found the bodies after the blaze tore through the three-storey, two family home. Firefighters were at the scene into the night\nThe fire started in the staircase between the second and third floor. It reportedly took 15 minutes to be put out","url":"https://www.dailymail.co.uk/news/article-3394129/Four-people-dead-family-home-following-suspicious-house-fire.html"}
