{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:07:15","date_modify":"2018-10-30 18:07:15","date_publish":"2016-10-16 22:11:37","description":"A pickup truck swerved and drove over the San Diego-Coronado Bridge on Saturday, immediately killing four people.","filename":"data/vaneerConsumption/FourDeadAfterTruckFliesoffCoronadoBridge.json","image_url":"https://media.breitbart.com/media/2016/10/Coronado-Bridge-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_10_16__1540922835.html","title":"Four Dead After Truck Flies off Coronado Bridge","title_page":"Four Dead After Truck Flies off Coronado Bridge","title_rss":"NULL","source_domain":"breitbart.com","text":"A pickup truck swerved and drove over the San Diego-Coronado Bridge on Saturday, plunged over 60 feet, and landed onto a crowd, crushing and immediately killing four people who were attending the annual La Raza motorcycle event at Chicano Park.\n“The car just came off the freeway and just landed right on top of him,” witness Jack Tellez told the San Diego Union-Tribune. “Everybody flipped the car off the bodies.”\nAn unnamed female witness who had also been attending the annual event said, “I saw a car fly right there, off the bridge… And then we felt the boom and pieces of car parts fell all over and I realized there were people right there where the car had fell. And I knew it was bad.”\nAccording to local ABC affiliate 10News, the truck’s driver — identified as Richard Anthony Sepolio, 25 — was reportedly placed under arrest for suspicion of being under the influence of alcohol. According to the Union-Tribune, Sepolio, who is employed by the U.S. Navy and stationed in Coronado, asked witnesses to contact his commander at a nearby military base.\nAlthough the names of the deceased were not immediately released, the California Highway Patrol said the victims were a man, 62, and a woman, 50, from Chandler, Ariz., and a man 59 and a woman, 49, from Hacienda Heights.\nOne woman reportedly suffered a compound fracture, with the bone showing.\nSocial media users took pictures and videos of the aftermath of the crash:\n#allbad #accident #rip #califas #chicanopark #respect #sd #califas #sandiego A video posted by HUSTLER 4 LIFE 213 703 3229 (@joel213la) on Oct 15, 2016 at 4:56pm PDT\nA memorial and vigil to honor the victim of the tragic incident was set up in the park by Saturday evening. People brought flower and lit candles. By nightfall, people were creating a memorial to the dead with candles and flowers.\nMemorial in #chicanopark for the four killed by suspected dui driver that flew off #CoronadoBridge. #barriologan Photo by Chris Zertuche. pic.twitter.com/39Yqz26Hxw — Desde la Logan (@DesdeLaLogan) October 16, 2016","url":"https://www.breitbart.com/local/2016/10/16/coronado-bridge-deadly-crash-kills-four-after-truck-flies-off/"}
