{"authors":["Frances Martel"],"date_download":"2018-10-30 20:45:39","date_modify":"2018-10-30 20:45:39","date_publish":"2015-07-01 03:30:46","description":"It has been a difficult week for Greece, whose debt to the EU and IMF continues unpaid and with little hope of preventing a default.","filename":"data/vaneerConsumption/FourEurovisionEntriesWarningUsGreeceWasntGoingtoPayBackDebt.json","image_url":"https://media.breitbart.com/media/2015/06/Maria-Elena-Kyriakou-Greece-Eurovision-Song-Contest-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_30__1540932339.html","title":"Four Eurovision Entries Warning Us Greece Wasn't Going to Pay Back Debt","title_page":"Four Eurovision Entries Warning Us Greece Wasn't Going to Pay Back Debt | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"It has been a difficult week for Greece, whose as-of-yet insurmountable debt to the European Union and International Monetary Fund continues unpaid and with little hope of preventing a default.\nWith no viable way to generate the funds to make this month’s payment, Prime Minister Alexis Tsipras is calling for a third bailout that will keep the nation from facing economic doom on a monthly basis, at least for the next two years.\nGreece returning to the drachma currency is a real possibility, particularly in light of a scheduled July 5 referendum in which Greeks will answer whether they are willing to agree to austerity reforms proposed by the EU in order to remain in the euro. Experts have floated all sorts of reasons for why Greece has found itself in this predicament.\nThose who blame the crisis on Greece itself note the high levels of tax evasion in the country, which render running a viable state nearly impossible, or extravagant expenses on the 2004 Athens Olympics. More favorable takes note that Germany forced Greek banks to make billions of dollars in loans to the Nazi regime in 1942 that were never fully repaid, leaving Greek banks too crippled to properly participate in the eurozone, even decades later. Others look at culture and not politics for the reason behind such a devastating financial landscape.\nFor years on the international stage, Greece has kept its public head held high. And on Europe’s biggest cultural stage, the Eurovision Song Contest, Greece has excelled with songs about love, life, and having a good time.\nEurovision forbids political subject matter in song entries—much to the lament of supporters of Georgian disco fight anthem “We Don’t Wanna Put In” (get it?)—but at least a few Greek entries in the past decade have raised eyebrows with veiled threats of fiscal irresponsibility and subliminal messages about starting anew and leaving all that bad stuff behind.\nHere are four of Greece’s most fiscally-questionable Eurovision entries to make you ask, “wait, don’t you guys owe billions of euros?”\n2014: Freaky Fortune feat. RiskyKidd — “Rise Up”\nAn innocent party song, perhaps, in the vein of classics like Lil’ John’s “Shots” and the entire Pitbull discography—except for that last bridge in the song about how much money they’re going to be spending:\nCome on and rise up dance till the final day,\nno need to hold back drink like there is no other way, Yo, I am down to rise up, pour these shots like “why stop”?\nI see you shaking, I’m a have to smack that my god!\nI’m blowing paper, balling call me later, balling call me later, balling call me mason.\nIt definitely sounds like he is saying “Berlin, call me later” in the actual track, yes?\n2010: Giorgos Alkaios & Friends — “Opa!”\nThe general look and feel of the Alkaios effort follows the familiar Greek Eurovision template of muscular men dancing in unbuttoned or low-cut dress shirts (we’re looking at you, Sakis Rouvas), with minimal special effects to match. And yes, for those who do not routinely watch the song contest—these are minimal special effects. But then, the official translation on the Eurovision website raises some questions:\nI set on fire\nEverything that’s old\nI will change everything – OPA!\nAnd I’ll shout it out loud – OPA!\nLet bygones be bygones, let’s start all over again – OPA!\nWhich “bygones,” exactly? And then there’s this stanza, for which we have no comment except the emphasis:\nI burnt the past, my previous nights\nAnd I start from scratch, even if you don’t want it\nBurning tears, lots of lies\nI paid all my dues\nOk.\n2015: Elena Kyriakou — “One Last Breath”\nA depressing breakup song (to Europe?!). Kyriakou begs the object of the song to “take me wherever you have gone/come back and save me,” and then things take a dark turn:\nI’m begging you take me\nout of this firing hell\ncome back and save me\nwhat happened wasn’t fair\nnothing left all that I have\nis one last breath\nWhen the song aired last May during the contest, Twitter users noticed the desperation.\n#Eurovision: One Last Breath is Greece’s entry; are they telling us their government IS going to default? #GE2015 — WilliamHolding (@WilliamHolding) May 23, 2015\nGreece and Germany’s songs are definitely aimed at one another #Eurovision — Ms Fry (@ms_fry) May 23, 2015\n“I struggle to survive, I’m still alive…save me”…Greece sems to have tailored its #Eurovision entry to its economic plight #ESC2015 — Matthew Campbell (@Mcinparis) May 23, 2015\n2013: Koza Mostra feat. Agathon Iakovidis — “Alcohol is Free”\nA song in the pantheon of all-time best Eurovision entries, up there with Ukraine’s “Dancing Lasha Tumbai,” “Alcohol is Free” is a song about being very, very drunk. Our protagonist, according to the official lyrics translation, finds himself lost in the city of Thessaloniki, drinking glass after glass of good old whiskey:\nIn an endless sea of good old whiskey\nCastaways are we, not to be found,\nThe earth is dizzy, it staggers away\nHoles in the head and a car that goes round\nWho gave it sail and wheel?\nWhile continuously referring to being aboard a ship, our narrator finally realizes the vehicle he is navigating is a car, and proceeds to drive home. Yes, drive. But don’t worry, it’s not the whiskey’s fault:\nIt’s not the fault of good old whiskey\nThe ice cubes were spiked\nAnd the ship seems to run on four round wheels!\nAn alcohol test and a traffic cop\nIs of no terror for us\nA downhill within the sea begins.\nWe are left but to wonder: If this formidable amount of alcohol was free for this responsible driver, whose tab did it end up on?","url":"https://www.breitbart.com/national-security/2015/06/30/four-eurovision-entries-that-should-have-warned-us-greece-wasnt-going-to-pay-back-that-debt/"}
