{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:37:35","date_modify":"2018-10-30 18:37:35","date_publish":"2017-02-21 15:14:51","description":"Four people from Ghana living in Italy have been arrested for smuggling around 200 migrants across the Italy-Switzerland border.","filename":"data/vaneerConsumption/FourArrestedforSmugglingHundredsofMigrantsintoSwitzerland.json","image_url":"https://media.breitbart.com/media/2017/02/GettyImages-476854312.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_21__1540924655.html","title":"Four Arrested for Smuggling Hundreds of Migrants into Switzerland","title_page":"Four Arrested for Smuggling Hundreds of Migrants into Switzerland","title_rss":"NULL","source_domain":"breitbart.com","text":"Four people from Ghana living in Italy have been arrested for smuggling around 200 migrants across the Italy-Switzerland border.\nThe four suspects, aged from 21 to 39, are legal residents of Italy and are suspected of smuggling the migrants from the Italian city of Como into the Swiss canton of Ticino.\nAccording to Swiss Info, suspicions were raised when police investigators noted a vehicle that had crossed the border at Ronago, west of Como, 45 times in a month back in October.\nA joint operation between Swiss and Italian police followed, resulting in the arrests. A 23-year-old Ghanaian woman was detained in December; with three more people taken into custody on Friday.\nThe alleged smugglers are accused of demanding 90-150 euros for every migrant illegally brought into Switzerland, driving them to Lugano or even as far as Zurich, more than 140 miles from the border.\nThe border between the two nations has become a flash point in Europe’s on-going migrant crisis.\nItaly is now the most popular landing point for migrants since the Balkans route to Greece was “closed”. Switzerland is a key transit nation on the route to Germany and Sweden, where most migrants wish to go.\nSwitzerland, however, will only allow migrants across the border if they claim asylum there. If they refuse, they are not considered refugees and are sent back across the border into Italy.\nIn July last year, despite criticism from left wing groups, Switzerland strengthen its border with Italy, shortly after the Balkans route was closed off and the number migrants attempting to cross the Italy-Switzerland border reached record levels. Authorities added dozens of guards and even a surveillance drone.\nIn September, a left-wing Swiss politician was arrested after attempting to smuggle four African migrants across the frontier.\nLisa Bosia Mirra, the founder of a refugee aid organisation and a councillor for the Social Democratic Party of Switzerland, was caught driving four underage boys across the border in a van.","url":"https://www.breitbart.com/europe/2017/02/21/four-ghanaians-arrested-smuggling-hundreds-switzerland/"}
