{"authors":["Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-23 02:30:33","date_modify":"2018-10-23 02:30:33","date_publish":"2016-01-11 14:42:56","description":"The crash happened at 2 a.m. on Sunday at the intersection of Industrial Boulevard and Main Street in the community of Palm City, California.","filename":"data/vaneerConsumption/FourpeopleinSanDiegokilledaftertheirspeedingcarranaredlight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/21/300E7BBA00000578-0-image-a-5_1452548057657.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393989_San-Diego-car-sliced-half-wreck-killing-4-people_1540261833.html","title":"Four people in San Diego killed after their 'speeding car ran a red light'","title_page":"Four people in San Diego killed after their 'speeding car ran a red light' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two of the victims have been identified by their families as Karla Chavez, 18 and 17-year-old Karina Guererro\nSan Diego police sergeant said the doomed car was traveling at a speed 'well above what would be appropriate'\nFour people were killed after their car ran a red light, struck a van and then careened into a light pole that cut the vehicle in half.\nThe crash happened at 2 a.m. on Sunday at the intersection of Industrial Boulevard and Main Street in the community of Palm City, California.\nThe speeding car, a silver Acura, blew a red light and collided with a red Honda Odyssey, which had the right of way, according to police.\nScroll down for video\nA silver Acura was cut in half after first striking another vehicle and then careening into a lamp pole. All but one of the five occupants died in the crash in San Diego on Sunday\nThe front part of an Acura that was sheared in two pieces after a fatal crash in San Diego early on Sunday morning\nSan Diego police said they are still investigating what caused the crash where four people died and three people were injured on Sunday\nThree people died after they were ejected from the speeding Acura, and a fourth person died inside the wreck, San Diego police Sgt. Leonard Flake told a reporter from San Diego News Video.\nA fifth person inside the Acura was taken to hospital in critical condition, police said.\nTwo people inside the Honda Odyssey were lightly injured, police said.\nAlthough police have not identified any of the victims, reporters from NBC Dan Diego spoke to mourners at the crash site who said they were family members of those killed.\n'I wanted for her to bury me, not for me to bury her first,' said a woman whose 18-year-old daughter, Karla Chavez, was purportedly one of the victims.\nA woman who said she was the mother (pictured) of 18-year-old victim Karla Chavez at a vigil near the site of Sunday's fatal car crash in San Diego\nMourners cry for the victims of a fatal car crash in San Diego. Four people died as a speeding Acura hit a light post and was sliced in two\nA picture of one of the victims of a fatal car crash in San Diego displayed at a vigil near the crash site. The young woman was identified by attendees at the memorial as 17-year-old Karina Guererro (pictured)\n'She was barely starting to live, at a young age, she still had a lot to live for,' the crying woman said.\nRuben Ortega, who said he knew another victim who he identified as 17-year-old Karina Guererro, told NBC San Diego that he will always remember the young woman's laugh.\n'She had this loud laugh. It was from her gut. She loved to laugh.'\nThe driver was identified by a man, who said he was a family friend, as 24-year-old Ceasar Ortiz.\nOrtiz was expecting a child, the man said.\nThe mother of Ortiz's baby was 'devastated,' the man told NBC San Diego.\n'There are no words that can explain how she feels. She's very hurt,'\nSgt. Flake noted that the Acura appeared to have been traveling at a high speed.\n'In order for it to collide with the van and still be severed in half like that after it hits the light standard, it's traveling at a pretty good speed,' Sgt. Flake said.\n'It's a speed that's well above what would be appropriate for this area.'","url":"https://www.dailymail.co.uk/news/article-3393989/San-Diego-car-sliced-half-wreck-killing-4-people.html"}
