{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-23 02:50:27","date_modify":"2018-10-23 02:50:27","date_publish":"2016-01-29 17:34:05","description":"Chadwick DePew, aged four, from Norwich, New York, managed to answer a FaceTime call from his father Stanley, who told him he had to unlock the door to let in paramedics for his mother Alice.","filename":"data/vaneerConsumption/FouryearoldanswersdesperateFaceTimepleaandsavesmother.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B43E8C00000578-0-image-a-24_1454088072727.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423156_Who-says-tablets-bad-kids-Four-year-old-answers-father-s-desperate-FaceTime-plea-saves-mother-passing-diabetes_1540263027.html","title":"Four-year-old answers desperate FaceTime plea and saves mother","title_page":"Four-year-old answers desperate FaceTime plea and saves mother | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A four-year-old boy has been credited with saving his mother's life after his tablet computer helped her when she passed out from diabetes.\nChadwick DePew, from Norwich, New York, usually uses his iPad to play his favourite games online.\nBut when his mother Alice fell ill when he was alone with her in the family home, he was able to take a FaceTime call from his father who told Chadwick to unlock the house door when 911 arrived.\nChadwick DePew from Norwich, New York, who has been credited with saving his mother's life thanks to his tablet computer\nChadwick's mother Alice fell ill due to diabetes, and the young boy took a FaceTime call from his father, who told him to answer the door for paramedics\nAnd now the young boy is being credited with saving his mother's life after he successfully took the call and followed his father's instructions.\nMrs DePew had been at home with Chadwick last week when she started to feel lethargic and started slurring her speech due to her blood sugar being too low.\nAt the time she was on the phone to her mother in North Carolina, and she immediately rang Mrs DePew's husband Stanley who was at work.\nMr DePew called 911 and then tried to ring his son on the house phone, but got no answer.\nAnd knowing his son loves playing on his iPad, he decided to call the tablet and to his surprise Chadwick answered.\nHe then told his son he would have to unlock the door when the paramedics arrived, and they were able to treat Mrs DePew, who made a full recovery.\nMr DePew, pictured with his son, says he was surprised Chadwick answered as he didn't think he knew how to unlock the tablet\nMr DePew told WBNG: 'I had no idea he knew how to unlock the the tablet to even get on to FaceTime. That was the first time ever.\n'I think that him using the tablet is the reason why his mom is still with us today.'\nWhile four-year-old Chadwick added: 'Daddy was calling me and when I saw that green button I pushed it.'\nDiabetes can cause complications when the blood sugar levels become dangerously high or low.","url":"https://www.dailymail.co.uk/news/article-3423156/Who-says-tablets-bad-kids-Four-year-old-answers-father-s-desperate-FaceTime-plea-saves-mother-passing-diabetes.html"}
