{"authors":[],"date_download":"2018-10-23 04:00:39","date_modify":"2018-10-23 04:00:39","date_publish":"2016-01-28 19:45:40","description":"One Malian soldier was killed in a gun attack while at least three others died in a landmine explosion in the country's north on Thursday, military sources t...","filename":"data/vaneerConsumption/FoursoldierskilledinattackexplosioninnorthernMalimilitarysources.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h4my-2vdWmEltwXfba0ce28e632c3b4b3-677_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421556_Four-soldiers-killed-two-attacks-northern-Mali-military-sources_1540267239.html","title":"Four soldiers killed in attack, explosion in northern Mali: military sources","title_page":"Four soldiers killed in attack, explosion in northern Mali: military sources | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Four soldiers killed in attack, explosion in northern Mali: military sources\nOne Malian soldier was killed in a gun attack while at least three others died in a landmine explosion in the country's north on Thursday, military sources told AFP.\n\"A Malian soldier was shot dead in an ambush Thursday morning on the outskirts of Timbuktu,\" said an army officer in the northwestern desert city, adding that the soldier was driving a military vehicle when he came under attack.\n\"The shooter is on the run,\" he added.\nMalian soldiers patrol between Gao and Kidal on July 26, 2013 in northern Mali ©Kenzo Tribouillard (AFP/File)\nElsewhere, at least three other troops died when their vehicle hit an explosive device near the city of Gao, army spokesman Colonel Souleymane Maiga said.\n\"The (vehicle at the) head of our convoy hit a mine 37 kilometres (22 miles) southwest of Gao, near Douentza. We deplore the death of three of our own,\" he said.\nAnother Malian security source confirmed the information and told AFP that two other soldiers in the convoy were \"in critical condition\".\nNorthern Mali fell under the control of Tuareg rebels and jihadist groups linked to Al-Qaeda in 2012.\nThe Islamists sidelined the Tuareg to take sole control but were largely ousted by a French-led military operation in January 2013.","url":"https://www.dailymail.co.uk/wires/afp/article-3421556/Four-soldiers-killed-two-attacks-northern-Mali-military-sources.html"}
