{"authors":["Associated Press","Alexandra Genova For Dailymail.Com"],"date_download":"2018-10-23 03:53:59","date_modify":"2018-10-23 03:53:59","date_publish":"2016-01-29 19:18:45","description":"More than 100 people fell sick after a matinee performance at the New Theater Restaurant in Overland Park, Kansas City. As of today, 390 are said to have the virus. The theater remains open.","filename":"data/vaneerConsumption/FourHUNDREDpeoplestrickenwithnorovirusatKansastheaterrestaurant.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E9EC00000578-0-image-a-10_1454094763324.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423322_Four-people-stricken-deadly-norovirus-Kansas-theater-restaurant-shows-continue-normal_1540266839.html","title":"Four HUNDRED people stricken with norovirus at Kansas theater restaurant","title_page":"Four HUNDRED people stricken with norovirus at Kansas theater restaurant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 390 people have reported getting sick after a norovirus outbreak in a theater restaurant in Kansas City.\nThe Kansas Department of Health and Environment initially said more than 100 people fell ill after going to the New Theater Restaurant in Overland Park.\nBut as of today, more than 390 individuals have now reported the illness and four people have laboratory specimens that confirmed norovirus, KDHE said.\nKDHE is investigating the source of the illness, which is highly contagious and spreads through food, water or person-to-person contact.\nAs of today, 390 people are said to have caught the deadly norovirus after an outbreak at a matinee performance at the New Theater Restaurant in Overland Park in Kansas City on January 17\nThe virus (pictured left) is highly contagious and can be spread through food, water or person-to-person contact. Rob McGraw (right), vice president of sales and marketing for New Theatre Restaurant, said only a few customers have canceled or rescheduled reservations\nIt is commonly associated with large gatherings of people, and symptoms include vomiting, diarrhea, fever and body aches.\nThe health department said the theater has been fully cooperating with the investigation.\nRob McGraw, vice president of sales and marketing for New Theatre Restaurant, told The Kansas City Star that three employees have been confirmed for norovirus and that those employees served a man who attended the January 17 matinee performance.\nThat man also has been confirmed to have norovirus. No other employees have fallen ill since the performances, McGraw said.\nHOW DEADLY IS THE NOROVIRUS? Norovirus is very contagious and can be caught from an infected person, contaminated food or water, or by touching contaminated surfaces. The virus causes your stomach or intestines or both to get inflamed (acute gastroenteritis). This leads you to have stomach pain, nausea, and diarrhea and to throw up. Norovirus is the most common cause of acute gastroenteritis in the United States. It can be serious, especially for young children and older adults. Each year, it causes 19-21 million illnesses and contributes to 56,000-71,000 hospitalizations and 570-800 deaths. The sickness can be avoided by washing your hands thoroughly and washing fruit and vegetables, laundry and surfaces thoroughly. Source: The Center for Disease Control and Prevention\nThe department asked that people who have attended performances from January 15 until now take part in a confidential online KDHE survey even if they didn't become ill.\nMcGraw said while a few customers have canceled or rescheduled reservations, he has also heard from many supportive season ticket holders.\nHe added that the theater, which holds about 625 people, is sold out nearly through the end of February.\n'They say: \"We know this is not your fault, and we will continue to come\"' McGraw said. 'The theater, the entire theater, is thoroughly cleaned every day.'\nThe theater has not released any formal statement on their website or Facebook page and it appears that the shows are continuing as normal, with no cancellations scheduled.\nThe virus also broke out at a Chipotle restaurant in Boston late last year and an outbreak was reported at Maggiano's Little Italy restaurant in Washington yesterday, with 50 people believed to be sick, reported The Seattle Times.\nSeattle health officials have closed the restaurant.\nThe norovirus can be serious, especially for young children and older adults and causes between 570 and 800 deaths a year in America, according to The Center for Disease Control and Prevention.","url":"https://www.dailymail.co.uk/news/article-3423322/Four-people-stricken-deadly-norovirus-Kansas-theater-restaurant-shows-continue-normal.html"}
