{"authors":[],"date_download":"2018-10-22 23:44:39","date_modify":"2018-10-22 23:44:39","date_publish":"2016-01-11 07:32:20","description":"On the crowded roads of the teeming eastern Pakistani city of Lahore, Tayyaba Tariq zips through the rowdy traffic on her brand new motorcycle. In jeans and ...","filename":"data/vaneerConsumption/FourwheelsgoodtwowheelsbetterforPakistansfemalemotorists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z6ir-56CX32zFKLb7123928b84cbdbed8-920_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393485_Four-wheels-good-two-wheels-better-Pakistans-female-motorists_1540251879.html","title":"Four wheels good, two wheels better for Pakistan's female motorists","title_page":"Four wheels good, two wheels better for Pakistan's female motorists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Four wheels good, two wheels better for Pakistan's female motorists\nOn the crowded roads of the teeming eastern Pakistani city of Lahore, Tayyaba Tariq zips through the rowdy traffic on her brand new motorcycle.\nIn jeans and a bright jacket, with a white helmet clasped over her hair, the 22-year-old student is part of a new wave of female drivers in Pakistan who are pushing the boundaries set for them by men.\nThe idea of women straddling motorcycles, clambering into the cabs of Pakistan's iconic heavy trucks, or driving rickshaws for money is still taboo in the deeply conservative Muslim country of some 200 million, where gender discrimination is routine.\nThe idea of women on motorcycles, clambering into the cabs of Pakistan's heavy trucks, or driving rickshaws for money is still taboo in the conservative Muslim country, where gender discrimination is routine ©Arif Ali (AFP)\nThere has been a slew of recent campaigns by women for greater access to public spaces to which they are often denied, such as roadside eateries -- and the roads themselves.\nThe importance of the issue is underscored by the fact that three quarters of Pakistani women do not participate in the labour market, mainly due to a lack of safe transportation, according to a study by the International Labour Organisation.\n\"If girls learn to ride a motorcycle, they can move freely, come and go independently,\" says Tariq, who rides 25 kilometres (15 miles) to the border with India and back every day for her job as a customs officer on her motorbike, a far more affordable mode of transportation than a car.\nSajjad Mehdi, a traffic police official in Lahore, said he had trained nearly 150 women to ride a motorbike recently.\n\"But there are many women who learned to ride a bike on their own,\" he added.\nThe government of Punjab province has also realised the importance of getting women on to motorcycles, launching an awareness campaign in November titled \"Women on Wheels\" that highlighted gender-based violence and street harassment.\nThe campaign saw 150 women, who had completed a police-run motorbike training programme, ride through the streets of Lahore on Sunday in a rally attended by diplomats and human rights lawyers, as it was revealed that 1,000 subsidised pink scooters would be given to working women and students under the scheme.\n- City in pink -\nTariq may be able to avoid men harassing her by nipping through traffic, but women using Lahore's many rickshaws are often not so fortunate: trapped by necessity in a tiny vehicle with a male driver, getting from A to B can often be a hassle.\nFor Zar Aslam, the solution was obvious: women-only rickshaws, driven by women for women, empowering both passengers and enterprising women who need a source of income.\nAslam launched her Pink Rickshaws scheme in 2014 beginning with just five rickshaws, and paraded them through the streets of Lahore in October last year.\n\"What we are doing is we are trying to help women become entrepreneurs and operators and owners of their own rickshaws,\" she said.\n\"Anyone over 18 and under 102 can drive this rickshaw from any class, from any background,\" said actress Nadia Jameel, an ambassador for the scheme.\n\"Some women will come out and drive because they have to. They need the money.\"\n- Driven by necessity -\nMoney was also the driving force behind Shamim Akhter's decision to become one of the first female drivers of Pakistan's famous heavy trucks, chaotically decorated from top to bottom in merry \"truck art\".\nAbandoned by her husband after the birth of their five children, Akhter struggled in odd jobs for years to feed her family before she clambered into the cab of a truck to make history.\nNow the 53-year-old works night and day to transport bricks in the capital Islamabad.\n\"My husband doesn't live with me, he lives with his second wife and I have to bear the expenses of my family alone,\" she says.\nShe learned to drive a car first then heavy vehicles and passed a test for the newly launched metro bus service in the capital -- but was denied a job by the government because it was not policy to have female drivers.\nSo, she contacted a local trucking company.\n\"I get 1,000 rupees (US$10) for a longer trip outside Islamabad,\" she told AFP, cleaning one of the cabs as she worked.\nThe amount of trips she gets varies, she says, and her income each month usually falls below average for a worker in Islamabad.\n\"It doesn't meet (all of) my expenses but ... one can't sit idle,\" she said. \"If we need 10,000 rupees and get 7,000 rupees, it's better than having nothing.\"\nLearning to drive will hopefully give many women an economic boost but it will still take time for social attitudes to change -- even in Lahore, arguably Pakistan's most cosmopolitan city.\n\"Many times boys follow us (on their bikes),\" Tariq the motorcyclist admits.\n\"They think that a girl can't ride and will be frightened... But I have a message for boys. They should not consider girls inferior.\"\nParticipants raise their helmets at the start of a rally launching the Women on Wheels campaign in Lahore on January 10, 2016 ©Arif Ali (AFP)\nPakistani student Tayyaba Tariq (R) instructs a young woman how to ride her motorcycle in Lahore ©Arif Ali (AFP)\nPakistani housewife Hina Kazmi rides a motorcycle on a street in Lahore ©Arif Ali (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393485/Four-wheels-good-two-wheels-better-Pakistans-female-motorists.html"}
