{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:56:02","date_modify":"2018-10-30 17:56:02","date_publish":"2015-03-30 03:33:09","description":"France announced that a fourth French national died after the terrorist attack at Tunisia’s national museum. The death toll is currently 22.","filename":"data/vaneerConsumption/FourthFrenchVictimofTunisiaMuseumTerrorAttackDies.json","image_url":"https://media.breitbart.com/media/2015/03/Francois-Hollande-Tunisia-Bardo-Museum-march-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_29__1540922162.html","title":"Fourth French Victim of Tunisia Museum Terror Attack Dies","title_page":"Fourth French Victim of Tunisia Museum Terror Attack Dies | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The French government announced a fourth French national passed away due to wounds from the March 18 terrorist attack at Tunisia’s national museum. The death toll currently sits at 22.\nThe woman has only been identified as Madame Dupeu. The government did not release more information on Dupeu or the wounds that killed her. Other victims included nationals from Japan, Italy, Spain, Colombia, and Britain. One Tunisian perished in the attack.\nThe Islamic State (ISIS/ISIL) claimed responsibility for the attack.\nFrench President Francois Hollande attended a march in the capital of Tunis in memory of the victims. Thousands of Tunisians turned out for the march and chanted “Tunisia is Free! Terrorism out!” as they made their way to the Bardo Museum.\n“The Tunisian people proved today that they do not bow to terrorism, and that as one man and one woman, they defend the nation,” said President Beji Caid Essebsi. “When Tunisia is targeted, the whole nation stands as one.”\nSpanish Foreign Minister José García-Margallo y Marfil, Polish President Bronisław Komorowski, and Italian Prime Minister Matteo Renzi were among the foreign dignitaries that attended the march. Hollande vowed French support for Tunisia.\n“We had four French citizens killed there, victims of terrorism, so it was necessary to participate in this march,” he announced. “Today it’s about Tunisia, and the values it represents in the Arab world and beyond.”","url":"https://www.breitbart.com/national-security/2015/03/29/fourth-french-victim-of-tunisia-museum-terror-attack-dies/"}
