{"authors":[],"date_download":"2018-10-30 14:37:13","date_modify":"2018-10-30 14:37:13","date_publish":"2018-08-01 04:00:00","description":"From the menu: Recipe for Fox Bros. Bar-B-Q’s Mac and Cheese","filename":"data/vaneerConsumption/FoxBrosBarBQsMacandCheese.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/01/Images/newsEngin.22071189_foxmac2-UHOEIT8JS20-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_ho_314ad35a099b4a030b1aeda524b3755b__1540910233.html","title":"Fox Bros. Bar-B-Q’s Mac and Cheese","title_page":"Recipe: Fox Bros. Bar-B-Q’s Mac and Cheese","title_rss":"NULL","source_domain":"ajc.com","text":"The Fox Bros. share their secret for the creamy goodness of their macaroni and cheese:\nThanks for having this column in the AJC Food section! You have found some recipes that I have requested as well as published some really good ones from places I haven’t even been yet. Last fall, I attended a wedding reception that was catered by Fox Bros. Bar-B-Q. It was a knockout! I thought I died and went to heaven when I tasted the mac and cheese. If I could make something that was close to that to go with my brisket, I would be an extremely happy camper. Do you have or can you get this recipe? I know that some places won’t share, and I can understand that to some point. Just wondering … thanks for what you do! — Karen Walsh, Lawrenceville\nThe brothers of Fox Bros. Bar-B-Q are very generous with their recipes. Their mac and cheese is definitely a crowd-pleaser, made with three kinds of cheese and a rich, creamy sauce. It’s a very saucy mac and cheese, so be sure your baking dish is up to the challenge. We found it filled a 9-by-13-inch baking dish pretty much to the rim. If you have concerns about filling your dish quite that full, use a roasting pan instead or divide it between two dishes.\nIs there a recipe from a metro Atlanta restaurant you’d like to make at home? Tell us and we’ll try to get it. We’ll also test it and adapt it for the home kitchen. Because of volume, we can’t answer all inquiries. Send your request, your address and phone number to fromthemenu@gmail.com and put “From the menu of” and the name of restaurant in the subject line.\n﻿<","url":"https://www.ajc.com/lifestyles/food--cooking/how-achieve-creamy-goodness-fox-bros-bar-mac-and-cheese/SH1kc7sm0tEOmEDRmEODOK/"}
