{"authors":["Maitri Suhas"],"date_download":"2018-10-30 23:52:13","date_modify":"2018-10-30 23:52:13","date_publish":"2014-08-12 22:01:48","description":"On Monday night, in breaking the tragic news of Robin Williams' suicide, Fox News anchor Shepard Smith ignorantly described the actor as a \"coward.\" He reported: \"Something inside you is so horrible or you’re such a coward or whatever the reason…","filename":"data/vaneerConsumption/FoxNewsShepardSmithApologizesforCallingRobinWilliamsaCowardButHisBehaviorRepresentsaBiggerProblem.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/243e54fa-0fca-4c91-9154-49d119bf3d63.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35523-fox-news-shepard-smith-apologizes-for-calling-robin-williams-a-coward-but-his-behavior-represents-a_1540943533.html","title":"Fox News' Shepard Smith Apologizes for Calling Robin Williams a \"Coward\" But His Behavior Represents a Bigger Problem","title_page":"Fox News' Shepard Smith Apologizes for Calling Robin Williams a \"Coward\" But His Behavior Represents a Bigger Problem","title_rss":"NULL","source_domain":"bustle.com","text":"On Monday night, in breaking the tragic news of Robin Williams' suicide, Fox News anchor Shepard Smith ignorantly described the actor as a \"coward.\" He reported: \"Something inside you is so horrible or you’re such a coward or whatever the reason that you decide that you have to end it. Robin Williams, at 63, did that today.\" Tuesday, Smith apologized, offering as his recompense that he would not purport to know about Williams' inner demons: \"I would never presume to know anything about his private life. And if any of his family members and friends were to have seen me use the word ‘coward,’ I would be horrified.\"\nRegardless of his apology, Smith's attitude about Williams' suicide is indicative of a major and widespread misunderstanding of mental health. In his broadcast Monday, Smith used the word \"coward\" because Williams left behind a family that would be forever grieve his death, thereby inferring suicide as a selfish act. But as so many that struggle with mental illness know, it is not selfishness that drives us to the darkness; it's the darkness itself. An overwhelming loneliness. Many Bustle writers have bravely shared their own struggles with mental illness, like Lisa Newlin, who poignantly writes about exactly why suicide is not selfish. Alicia Lutes writes about the darkness that is so difficult to overcome.\nIf there's anything productive that comes of Smith's apology, it's the recognition that mental illness should be treated in the public eye as precisely what it is — an illness. The stigma that surrounds depression, anxiety and other mental disorders is often fatal to its victims: a fear of opening up and asking for help contributes further to that infinite chasm of isolation that drives so many, including Williams, to suicide.\nKevin Winter/Getty Images Entertainment/Getty Images\nShepard Smith was insensitive, ignorant and out of line in his broadcast, but unfortunately, he represents the views of so many that do not suffer from mental illness or have loved ones that do. Let his apology be a reminder that mental illness is grave and serious, but also severely misunderstood, and if you know someone who you suspect is suffering, please reach out to them.\nRobin Williams was a man of many extraordinary talents; he was absolutely not a coward, nor was he his disease. He couldn't overcome his demons, but that does not mean it's not possible. I know personally that admitting you need help is often the hurdle most difficult to overcome, and the widespread misunderstanding of mental illness has inhibited me to do so in the past. But I can't let it. As angry as I feel toward Smith, I accept his apology, because as hard as it is to endure mental illness, it's also that difficult to understand—but hopefully, in the wake of Williams' premature and unnecessary end, there will be more concerted public efforts towards understanding and education of mental illness. And if it has to start with apology, that's as good a place as any.","url":"https://www.bustle.com/articles/35523-fox-news-shepard-smith-apologizes-for-calling-robin-williams-a-coward-but-his-behavior-represents-a"}
