{"authors":["Jennifer Smith For Dailymail.Com"],"date_download":"2018-10-23 03:57:00","date_modify":"2018-10-23 03:57:00","date_publish":"2017-04-26 15:36:26","description":"Jesse Watters made the comment on The Five on Tuesday as he commentated on footage of Ivanka Trump speaking at a summit in Berlin earlier in the day.","filename":"data/vaneerConsumption/FoxNewshostJesseWattersmakesrudeIvankaTrumpjoke.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA027B700000578-0-image-a-50_1493216957703.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447872_Fox-News-host-Jesse-Watters-makes-rude-Ivanka-joke_1540267020.html","title":"Fox News host Jesse Watters makes 'rude' Ivanka Trump joke","title_page":"Fox News host Jesse Watters makes 'rude' Ivanka Trump joke | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fox News host Jesse Watters has come under fire for making a seemingly lewd comment about Ivanka Trump.\nWatters, who joined The Five last week from the now dissolved O'Reilly Factor, was remarking on the First Daughter's speech at a women in economics summit in Berlin on Tuesday when he smirked: 'I really like the way she is speaking in to that microphone'.\nViewers erupted on social media, accusing the 38-year-old host of being 'sexist' and 'rude'.\nHe refused to apologize for the outrage on Wednesday and insists he meant no offense and that he was merely complimenting her voice which he likened to that of a 'smooth jazz radio DJ'.\nScroll down for video\nFox News host Jesse Watters was slammed for joking that he 'really liked' the way Ivanka Trump spoke in to a microphone at a women in economics summit\nThe show's hosts were reviewing footage of Ivanka's appearance at the summit with German Chancellor Angela Merkel when Watters made the remark.\nThe First Daughter was booed by the audience as she spoke about her father's commitment to empowering women in the workplace.\nShe soldiered on through their jeering, telling the crowd of her 'personal experience' of her father's fairness on the issue.\nPrompted for his view by co-host Kimberly Guilfoyle, Watters said the audience treated Ivanka unfairly with its reaction.\n'It's funny you know the left says they really respect women and when given an opportunity to respect a woman like that they boo and hiss.\n'I always thought the Europeans were supposed to be so sophisticated and well-mannered and now they're treating her like this, like it's a soccer match.\n'I don't understand what's going on. I think Ivanka is supposed to be the moderating voice for her father so I think people in Europe should support that.\n'I don't know why, also, saying her father respects families is controversial.\n'He's probably hired a ton of fathers, mothers and children so I really don't get what's going on here but I really liked how she was speaking in to that microphone,' he said.\nWatters was co-hosting The Five when he made the comment on Tuesday night\nWatters, above with the First Daughter in the White House last week, insisted he was only complimenting her voice\nHis co-hosts swept past it but viewers picked up on the comment immediately and some even called for him to be fired over it.\nThey also pointed to the hypocrisy of chastising the summit audience for being disrespectful to Ivanka by booing her while appearing to degrade her with the remark.\n'It's funny you know the left says they really respect women and when given an opportunity to respect a woman like that they boo and hiss.'\n'This is how Jesse Watters is helping Fox News foster a \"workplace culture of trust & respect.\" The guy should be fired.'\n'Hey Trump, where's your voice on empowering women when Jesse Watters speaks vile if Ivanka. Seriously, this has to stop it's not ok!!' another remarked.\n'Vile Fox News. Have you learned nothing or standing behind your vile culture? Say goodbye to Sky deal,' another mused.\nWatters, who is married with twin daughters, swiftly issued a statement to explain the remark away.\nIvanka was appearing at a women in economics summit in Berlin, Germany, on Tuesday when she addressed the audience\nWatters immediately faced backlash from viewers who deemed the comment 'vile'\nHe insisted he meant no impropriety and that he was merely complimenting the First Daughter's tone.\n'During the break we were commenting on Ivanka’s voice and how it was low and steady and resonates like a smooth jazz radio DJ. This was in no way a joke about anything else,' he told DailyMail.com in a statement.\nThe host later uploaded the same statement to Twitter.\nWatters, who previously interviewed the president and has mingled with Ivanka in the White House, was announced as the newest addition to The Five earlier this month as the dust settled after O'Reilly's ousting.\nUntil then he had a man on the street segment on The O'Reilly Factor titled Watters' World.\nHe defended the remark, claiming he was complimenting Ivanka's 'smooth jazz radio DJ' voice\nWatters started at Fox News on The O'Reilly Factor. He was given a spot on The Five earlier this month after his mentor was ousted from the network\nThe host interviewed Donald Trump earlier this year for a segment on the now axed O'Reilly Factor show\nWatters (pictured with his wife Noelle) insisted he had done no wrong\nHe faced backlash last year over one segment last year that was filmed in Manhattan's Chinatown and saw him interview Asian pedestrians for their views on Donald Trump.\nIt was admonished as racist and cruel, with New York Mayor Bill de Blasio labeling it 'vile'.\nWatters expressed regret over the footage which prompted protests in New York City.\nO'Reilly had his contract terminated last week by Rupert Murdoch and his two sons, James and Lachlan w\nIt came amid growing accusations he sexually harassed colleagues over the course of his 20-year cable TV career.\nHe denies the accusations.\nO'Reilly launched the first episode of a new podcast series on his personal website over the weekend.","url":"https://www.dailymail.co.uk/news/article-4447872/Fox-News-host-Jesse-Watters-makes-rude-Ivanka-joke.html"}
