{"authors":["David Martosko","Us Political Editor For Dailymail.Com In Des Moines"],"date_download":"2018-10-23 01:30:31","date_modify":"2018-10-23 01:30:31","date_publish":"2016-01-29 15:34:09","description":"Thursday's Republican debate had the second-lowest ratings of the seven GOP contests in the 2016 election cycle. But Fox, which aired the contest after Trump announced a boycott, can claim victory.","filename":"data/vaneerConsumption/FoxNewsRepublicandebateoutperformsDonaldTrumpsrally.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30AEBF1E00000578-0-image-a-9_1454081519776.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422898_Ratings-plunge-Trump-free-debate-Fox-News-outperforms-channels-showed-Donald-s-rally_1540258231.html","title":"Fox News' Republican debate outperforms Donald Trumps' rally","title_page":"Fox News' Republican debate outperforms Donald Trumps' rally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Thursday's Republican presidential primary debate had the second-lowest ratings of the seven GOP contests in this election cycle. But the Fox News Channel, which aired the contest after front-runner Donald Trump announced a boycott, can still claim victory.\nAbout 12.5 million people watched the evening broadcast, according to a Fox News press release.\nThat performance would have been remarkable in January four years ago but registered as disappointing given the viewership bonanzas Trump has brought to the table in recent months.\nIt was still Fox's second-highest viewership number of all time, behind the August broadcast that marked Trump's onstage debate debut.\nScroll down for video\nSEVEN, DWARFED: Thursday night's Republican debate in Iowa would likely have been a much bigger TV event if Donald Trump had shown up\nTHE GREAT UNKNOWN: It's impossible to make a fair estimate of how many Americans watched Trump's military fundraiser instead of tuning in to the debate\nWhile seven GOP White House hopefuls duked it out in downtown Des Moines, Iowa, Trump held his own competing rally – a fundraiser for veterans charities – at Drake University a few miles away.\nCNN and MSNBC both cut in and out of live coverage of Trump's event, and neither advertised that The Donald would appear on-air.\nThe two networks combined generated only about one-quarter of Fox News Channel's numbers, according to a CNN analysis.\nC-SPAN aired the Trump rally live nationwide in its entirety, but viewership numbers for the public-service channel weren't available since Nielsen doesn't rate its broadcasts.\nDEBATE NIGHT: The Des Moines contest was the second lowest-rated Republican primary contest so far\nThe only Republican primary debate that drew fewer viewers than Thursday night's was the last one, two weeks ago, broadcast by FNC's sister channel the Fox Business Network from North Charleston, South Carolina.\nNielsen estimated that 7.4 per cent of households with TV sets in the metro markets where it takes measurements were tuned in to watch that broadcast.\nThursday night's debate had a household rating of 8.4 per cent.\nWhen the dust settles, it's possible the two debates' audiences will be about equal.\nThat's because while the Fox News Channel is a staple on every nationwide cable TV system, fewer households have access to the Fox Business Network through their TV providers.\nThe primary debate season's opening event, broadcast from Cleveland, Ohio in August by the Fox News Channel, drew in 25 million pairs of eyeballs to see Trump's first onstage rout of a more experienced political field.\nTHE TRUMP FACTOR: It's impossible to know how big a boost The Donald might have give Fox, had he relented and attended Thursday night's debate\nBy mid-December, a CNN-sponsored debate posted somewhat depressed numbers – with a 12.2 household rating and 18 million total viewers.\nCorey Lewandowski, Trump's campaign manager, said Wednesday on the MSNBC 'Morning Joe' program that 'maybe Fox was going to have a 20 or 25 million person debate [audience], but without Mr. Trump's participation I think they might have a 1 or 2 million person debate.'","url":"https://www.dailymail.co.uk/news/article-3422898/Ratings-plunge-Trump-free-debate-Fox-News-outperforms-channels-showed-Donald-s-rally.html"}
