{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:17:28","date_modify":"2018-10-30 19:17:28","date_publish":"2016-09-07 16:07:16","description":"The chief intelligence correspondent for Fox News reported Tuesday that Hillary R. Clinton's team that they successfully planted questions with Sen. Robert Menendez (D.-N.J.), the acting Senate Foreign Relations chairman for the committee's Jan. 23, 2013 hearing.","filename":"data/vaneerConsumption/FoxNewsHillaryClintonAideEmailsChelseaAboutScriptedSenateBenghaziHearingWeWiredIt.json","image_url":"https://media.breitbart.com/media/2015/03/ap_hillary-rodham-clinton_ap-photo5-1024x782.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_07__1540927048.html","title":"Fox News: Hillary Clinton Aide Emails Chelsea About Scripted Senate Benghazi Hearing 'We Wired It'","title_page":"Fox News: Hillary Clinton Aide Emails Chelsea About Scripted Senate Benghazi Hearing 'We Wired It' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The chief intelligence correspondent for Fox News reported Tuesday that Hillary R. Clinton’s team successfully planted questions with Sen. Robert Menendez (D.-N.J.), the acting Senate Foreign Relations chairman, for the committee’s Jan. 23, 2013 Benghazi hearing.\nCatherine Herridge reported that Phillipe Reines, who served as deputy assistant secretary of state for strategic communications assured Chelsea Clinton that Menendez was on board with the former first lady’s messages goals: “We wired it that Menendez would provide an opportunity to address two topics we needed to debunk (her actions/whereabouts on 9/11, and these email from Chris Stevens about moving locations,)”\nAmbassador J. Christopher Stevens was killed in the Sept. 11, 2012 attack on American facilities and personnel at Benghazi, Libya, along with State Department IT specialist Sean Smith and former Navy SEALs Tyrone Woods and Glen Doherty.\nReines was responding to the former first daughter’s request for an update and the courtier was upbeat: “Very strong opening. She got emotional when talking about the families.”\nWe know the email exchange was between Reines and Chelsea Clinton because Chelsea used one her phony name: “Diane Reynolds.”\nThere Clinton was in her dark green outfit and Coke bottle glasses with her face perched on her hand waiting for what must have been an eternity for Menendez finish reading his script.\n“The ultimate conclusion of Ambassador Stevens was as our needing to be in Benghazi, the cradle of the Libyan Revolution,” the senator droned on to this point: Wasn’t it the idea of our lamented Stevens to have a facility in Benghazi because hotels were too expensive and unsafe?\nThen, the New Jersey senator tossed in his kicker: “What actions were you and your staff taking the night of Sept. 11 into September the twelfth?”\n“I was notified of the attack shortly after 4 p.m.–over the following hours, we were in continuous meetings and conversations both in the department and our team in Tripoli with the inter-agency and internationals,” Clinton replied.\nIt was bat meet ball, like David Ortiz sitting on a hanging curve ball, Clinton spent the next five minutes laying out the operative narrative:\nStevens wanted to be in Benghazi and the compound was his idea.\nThe security at the diplomatic facility and the response to the attack were inadequate, but the best we could do.\nWe partnered with the Libyan government, whose protection of the facility and response to the attack was inadequate, but the best they could do.\nAt one point, Clinton seemed to brag that she ordered her diplomats to “break down the doors” of the Libyan government to get for help for the besieged American personnel at Benghazi.\nNo mention of the Marines in Rota, Spain, members of the Fleet Anti-terrorism Strike Team, ordered off the plane to change into civilian clothes because Clinton’s State Department did not like the optics of uniformed troops invading Libya. Those Marines would deplane one more time to change back into their uniforms, but their plane never took off.\nNor was there mention of the Green Berets three hours away in Croatia. Those Special Forces personnel were ready to go, but after the planes arrived to take them to Benghazi, someone at a headquarters somewhere ordered their pilots to take a mandatory sleep break before flying again. Those men also never took off for Benghazi. Then, there were the paratroopers of the 173rd Airborne Brigade at Vicenza, Italy, the ships at sea off the coast and all the other resources and assets that stayed cold.\nThis hearing was also the time when Clinton, while responding to Sen. Ronald Johnson (R.-Wis.)’s questioning of the official Benghazi timeline, gave her most enduring soundbite:\nWith all due respect, the fact is we had four dead Americans. Was it because of a protest or was it because of guys out for a walk one night who decided that they’d they go kill some Americans? What difference at this point does it make? It is our job to figure out what happened and do everything we can to prevent it from ever happening again, Senator.\nThe hearing an interesting dance of succession and a big deal for Mendendez because he had just taken over from the previous chairman, Sen. John F. Kerry (D.-Mass.), the man set to replace Clinton as secretary of state.\nThe Philadelphia Inquirer wrote:\nWASHINGTON — New Jersey Sen. Bob Menendez is leading a highly-charged hearing this morning in which Secretary of State Hillary Clinton will testify about the terrorist attacks in Benghazi, providing a preview of what will likely be a new, powerful role for Menendez. Menendez, a Democrat, is presiding over the Senate Foreign Relations Committee hearing in place of Sen. John Kerry, the panel’s chairman who is expected to soon be confirmed as Clinton’s replacement as Secretary of State. Once that happens, Menendez is expected to become chairman, giving him control of an influential committee that oversees how the Obama administration interacts with the rest of the world.\nMenendez declared the matter closed May 16, 2013 and he took to the Senate floor that day with what in the Senate passes for passion: “I rise today as the chairman of the Senate Foreign Relations Committee and I am outraged at the implication that we in the Senate have not done enough to investigate what has happened in Benghazi.”\nFor Clinton, the hearing was part of her glide from the public sector back to private life–and the preparations for her 2016 candidacy for president.\n[Breitbart News sought comment and participation from Sen. Robert Menendez (D.-N.J.) with an emailed request and an office visit.]","url":"https://www.breitbart.com/politics/2016/09/07/fox-news-hillary-clinton-aide-emails-boss-scripted-senate-benghazi-hearing-wired/"}
