{"authors":["Jeff Poor"],"date_download":"2018-10-30 21:44:58","date_modify":"2018-10-30 21:44:58","date_publish":"2016-04-01 23:40:43","description":"Friday on Fox Business Network's \"Varney & Co.,\" Fox News legal analyst Arthur Aidala dismissed the notion that Democratic presidential front-runner | Video","filename":"data/vaneerConsumption/FoxNewsLegalAnalystTheresEnoughEvidenceforaClintonGrandJuryInvestigation.json","image_url":"https://media.breitbart.com/media/2016/04/Aidala41.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_04_01__1540935898.html","title":"Fox News Legal Analyst: There's Enough Evidence for a Clinton Grand Jury Investigation","title_page":"Fox News Legal Analyst: There's Enough Evidence for a Clinton Grand Jury Investigation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Friday on Fox Business Network’s “Varney & Co.,” Fox News legal analyst Arthur Aidala dismissed the notion that Democratic presidential front-runner Hillary Clinton was actually looking forward to a meeting with FBI director James Comey.\nAidala pointed out there are penalties for lying to the FBI and that in some cases, the penalties for lying to the FBI are more severe than the actual crime that is being investigated.\n“Sure, people who don’t know what the heck they’re talking about and I’m not saying that in a joking manner. People who don’t really know what they’re saying because when you talk to the FBI, Stuart, if you lie to them, you are subject to jail. Many of my clients, my lower ranking clients, the penalties for lying to the FBI are more severe than what they’re being investigated to, it’s a five-year jail possibility there. Martha Stewart, she went to jail for lying to the FBI.”\nAidala went on to lay out how Clinton’s meeting with Comey would proceed, but speculated there was enough evidence for a grand jury to to conduct its own investigation.\n“I think there’s enough evidence here to put it in front of a grand jury and see if we have an indictment or not,” he added.\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2016/04/01/fox-news-legal-analyst-theres-enough-evidence-clinton-grand-jury-investigation/"}
