{"authors":["Courtney Laermer"],"date_download":"2018-10-30 23:54:59","date_modify":"2018-10-30 23:54:59","date_publish":"2014-08-12 21:50:37","description":"Did anyone else just hear what Fox News contributor Keith Ablow just said? I sure hope I heard him wrong, but, unfortunately, that doesn't seem to be the case. The guy was featured on the network's Outnumbered show, where Ablow announced that…","filename":"data/vaneerConsumption/FoxNewsKeithAblowDeclaresMichelleObamaShouldLoseSomeWeight.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c989b9da-0dc3-4069-aacf-37d058f12c2f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35484-fox-news-keith-ablow-declares-michelle-obama-should-lose-some-weight_1540943699.html","title":"Fox News' Keith Ablow Declares Michelle Obama Should Lose Some Weight","title_page":"Fox News' Keith Ablow Declares Michelle Obama Should Lose Some Weight","title_rss":"NULL","source_domain":"bustle.com","text":"Did anyone else just hear what Fox News contributor Keith Ablow just said? I sure hope I heard him wrong, but, unfortunately, that doesn't seem to be the case. The guy was featured on the network's Outnumbered show, where Ablow announced that Michelle Obama needs to lose some weight. No regret, no apology, and absolutely zero accuracy.\nWhile discussing plans to make American kids healthier and more active, Ablow decided that the challenges regarding healthy children was kinda boring — so why not segue into what he thinks is the first lady's weight issue?\nAnd how well could she be eating? She needs to drop a few. Let’s be honest. We’re taking nutrition advice from who? ...I want nutrition. But let’s be honest, there’s no french fries happening? It’s all kale and carrots? I don’t buy it. Just saying.\nImmediately, his fellow panelists expressed shock. Seriously, though, listen to their exasperated gasps. You can even hear one panelist say, \"Oh no, you didn’t not say that\" and another exclaim, \"Oh my goodness gracious.\" Really, listen to it. And confirm that I did actually hear this.\nLets just take a second to address the obscene double standard clearly in play here. If they were discussing a guy, odds are, nobody would have brought up his weight. But this isn't even the worst part: As the segment progresses, the whole thing gets even worse. Ablow actually had the nerve to compare Michelle to her husband.\nI’m just saying, her husband, I’d like some nutrition information from Barack\nSure, Barack's in great shape. But, really? Is this real life? Are we actually comparing the first lady's figure to her husband's? That doesn't even make sense.\nYouTube\nThe show cut to its visibly appalled host, Sandra Smith. Uncomfortably, she attempted to end the discussion by saying, \"The fitness of the first lady aside and her presentation aside, I have no comments on that.”\nBut don't you worry — Ablow wouldn't let his fun stop there. He snuck in a final comment: \"Join me in my criticism.\"","url":"https://www.bustle.com/articles/35484-fox-news-keith-ablow-declares-michelle-obama-should-lose-some-weight"}
