{"authors":[],"date_download":"2018-10-23 05:02:14","date_modify":"2018-10-23 05:02:14","date_publish":"2016-01-29 20:45:25","description":"Fox News Channel drew 12.5 million viewers for Thursday's Republican presidential debate, its second largest TV audience ever despite the absence of frontrun...","filename":"data/vaneerConsumption/FoxNewsdraws125mnfordebatedespiteTrumpnoshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i5ln-4PuZeKVXE7cd9005b2c876e2144c-803_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423441_Fox-News-draws-12-5-mn-debate-despite-Trump-no-show_1540270934.html","title":"Fox News draws 12.5 mn for debate, despite Trump no-show","title_page":"Fox News draws 12.5 mn for debate, despite Trump no-show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fox News draws 12.5 mn for debate, despite Trump no-show\nFox News Channel drew 12.5 million viewers for Thursday's Republican presidential debate, its second largest TV audience ever despite the absence of frontrunner Donald Trump, who hosted a rival event, Nielsen said.\nThe debate drew the channel's largest audience aside from the debut Republican primary showdown held last August, which drew a record 24 million viewers, early research by the television ratings firm showed Friday.\nFox News's Thursday primetime broadcast handily beat out competing cable channels CNN and MSNBC, even combined.\nEven without Republican frontrunner Donald Trump, who decided to boycott the debate, Fox News attracted 12.5 million viewers on January 28, 2016 for the last GOP showdown before Iowa's caucuses ©Alex Wong (Getty/AFP/File)\nCNN averaged 1.76 million viewers for the period, and MSNBC drew 1.02 million, respectable numbers but far short of the huge haul for Fox News, according to the Hollywood Reporter.\nBoth those channels aired the rally Trump staged in direct conflict with the debate after the billionaire real estate mogul boycotted the event due to his toxic feud with Fox News.\nThe numbers marked a triumph for Fox, especially after Trump taunted the network by predicting the debate would be \"a total disaster\" with low ratings that would see advertising rates \"dropping like a rock.\"\nWhile Thursday's debate attracted more viewers than the previous GOP showdown, it was nevertheless the second lowest viewership of the party's seven presidential debates, which have been hosted by different networks.\nIt was sharply lower, for instance, than the December 15 debate hosted by CNN, which drew 18 million viewers.\nTrump, who overshadowed the debate from afar, had declared victory with his own event Thursday, a fundraiser for US military veterans.","url":"https://www.dailymail.co.uk/wires/afp/article-3423441/Fox-News-draws-12-5-mn-debate-despite-Trump-no-show.html"}
