{"authors":[],"date_download":"2018-10-30 18:17:07","date_modify":"2018-10-30 18:17:07","date_publish":"2015-06-04 21:45:38","description":"Music helped save the Fox Theatre from the wrecking ball in 1975, and music will celebrate its 40-year run of success on Sunday during the free Fox Rock the Block Party.","filename":"data/vaneerConsumption/FoxTheatresRocktheBlockPartytakesfreemusictostreets.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/04/Images/photos.medleyphoto.7378100.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_fox-theatre-r_3ac99d87c52cd1b66fd308344e935a03__1540923427.html","title":"Fox Theatre’s Rock the Block Party takes free music to streets","title_page":"Fox Theatre’s Rock the Block Party takes free music to streets","title_rss":"NULL","source_domain":"ajc.com","text":"Music helped save the Fox Theatre from the wrecking ball in 1975, and music will celebrate its 40-year run of success on Sunday during the free Fox Rock the Block Party.\nParts of Peachtree Street and Ponce de Leon Avenue in Midtown will be closed to vehicular traffic to make way for an afternoon of concerts and other entertainment on two stages.\nMore than 12,000 people already have RSVP-ed on the Fox event’s Facebook page for the noon-6 p.m. smorgasbord including performances from Francine Reed, Alchemy and Dad’s Garage Theatre Company.\n[Read more about the preservation of the Fox Theatre and the Save the Fox campaign]\nIt’s the biggest event in a yearlong “The Legend Lives On” celebration of the 85-year-old showplace’s salvation by the Atlanta Landmarks Inc.\nThe nonprofit citizens group formed after the former movie palace closed, taking over daily operations in 1975. It worked out a deal with Southern Bell (now AT&T), which intended to raze the 1929 theater to make way for a headquarters complex, to instead build behind the Fox on West Peachtree Street. It also orchestrated a “Save the Fox” drive that raised $3 million, paying off the theater’s mortgage in 1978.\n[See photos of the behind-the-scenes tour at the Fox Theatre]\nA March gala honored original Atlanta Landmarks board members; Sunday’s musical street party honors the Atlantans who have supported the theater — then and now.\n“Because we were saved by the community, we want to make sure we stay in touch with the community and engage with the community, and that the community continues to have an affinity for the Fox,” Fox Vice President and General Manager Adina Erwin said.\n[See a timeline detailing the history of the Save the Fox campaign]\nA galaxy of musicians, from pops maestro Arthur Fiedler to singer Andy Williams and rockers including the Allman Brothers Band and Lynyrd Skynyrd, played early benefits that not only raised money for the theater but suggested its future viability.\nRock music was especially strong in the Fox’s early mix, as commemorated by a message inscribed above the stage entrance.\n“Play it pretty for Atlanta,” says the quote by the late Skynyrd singer Ronnie Van Zant, instructions that he gave his band during 1976 Fox concerts that were recorded for its landmark live album, “One More From the Road.”\nMusic and Fox fans can see that inscription and much more during special Behind the Scenes Tours, recently announced by the theater, that will be offered June 9-20 (details: foxtheatre.org/tours).\nThe Fox-Southern rock connection will be represented during the Fox Rock the Block Party by Tribute … a Celebration of the Allman Brothers Band, a nine-member Atlanta group that was founded in 2013.\nFestivities also will include tours of the Fox and family-friendly activities, with food and beverages available for purchase.","url":"https://www.ajc.com/entertainment/fox-theatre-rock-the-block-party-takes-free-music-streets/qkMSeT96zwrg4DqEU7t6xK/"}
