{"authors":[],"date_download":"2018-10-30 14:15:46","date_modify":"2018-10-30 14:15:46","date_publish":"2017-02-23 17:09:00","description":"Legislation creating the first new fracking regulations in Georgia since 1975 passed the state House on Thursday.","filename":"data/vaneerConsumption/FrackingregulationbillpassesGeorgiaHouse.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/23/Images/IMG_0804.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_27b1f17ec19f2a58380f597d26111b34__1540908946.html","title":"Fracking regulation bill passes Georgia House","title_page":"Bill creating Georgia fracking regulations passes House","title_rss":"NULL","source_domain":"ajc.com","text":"The last time Georgia regulated the practice of fracking in 1975 the state collected a fee of $25 for the right to search for underground natural gas.\nLegislation approved in the state House on Thursday would create the first new fracking regulations in a generation.\nThe House voted 162-1 to approve House Bill 205, sponsored by House Rules Committee Chairman John Meadows, R-Calhoun. Meadows said there is one, eight-county, region in northwest Georgia that is ripe for fracking.\n“Northwest Georgia -- I won’t say we’re abundant in water, but we have a lot of wonderful sources of water,” Meadows said. “The intent of this bill is to protect those water sources.”\nMeadows said only three companies have attempted to draw natural gas out of the Conasauga Shale that cuts through that corner of the state. None are currently active. A fracking operation involves lowering a drill and pipe up to 2,000 feet underground.\nMeadows’ bill would empower the state’s Environmental Protection Division to regulate fracking and collect a tax of 1-cent per cubic meter of natural gas drawn from Georgia and 3-cents per cubic meter of oil.\nA company interested in fracking would have to reveal any underground water sources a fracking drill would pass through and what chemical fluids will be used in the operation.\nThe bill now goes to the Senate.","url":"https://www.ajc.com/news/state--regional-govt--politics/fracking-regulation-bill-passes-georgia-house/UT5TOIMvYLZolVn1tjInRN/"}
