{"authors":[],"date_download":"2018-10-23 01:24:11","date_modify":"2018-10-23 01:24:11","date_publish":"2016-01-11 12:21:28","description":"Thailand's ailing but much-loved King Bhumibol Adulyadej left hospital Monday for the first time in several months in a surprise visit to a Bangkok palace, a...","filename":"data/vaneerConsumption/FrailThaikingbrieflyleavesBangkokhospital.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z96d-56CX32zFKLb7123928b84ce85083-239_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393820_Frail-Thai-king-briefly-leaves-Bangkok-hospital_1540257851.html","title":"Frail Thai king briefly leaves Bangkok hospital","title_page":"Frail Thai king briefly leaves Bangkok hospital | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Frail Thai king briefly leaves Bangkok hospital\nThailand's ailing but much-loved King Bhumibol Adulyadej left hospital Monday for the first time in several months in a surprise visit to a Bangkok palace, an official statement said.\nThe 88-year-old king, who is regarded by many Thais as a near-deity and a unifying figure in the bitterly split nation, was driven from Bangkok's Siriraj Hospital to the sprawling Chitralada Royal Villa nearby.\n\"The king went to the Chitralada Royal Villa by personal car,\" according to a statement on the Facebook page of the office of the king's principal private secretary.\nThai well-wishers hold portraits of King Bhumibol Adulyadej ©Christophe Archambault (AFP/File)\nIn a trip lasting around an hour the world's longest-reigning monarch paid a visit to a pond as well as other \"projects\" in the compound before returning to the hospital, the statement added.\nIt was a rare foray outside the hospital where the king has spent much of the last two years. He was last seen in an official photograph distributed in mid-December.\nFew details concerning his health are given out by the palace.\nBut on Sunday it issued an update reporting that the king's pulse and blood pressure had returned to normal after he was given antibiotics to fight an infection and fever.\nIn September the palace released a video of the monarch in a wheelchair, looking visibly weakened, visiting a shop in the hospital.\nMost Thais have only known King Bhumibol on the throne and anxiety over the future once his six-decade reign ends is seen as an aggravating factor in Thailand's bitter political divide.\nThailand has been roiled by a decade of political protests, street violence and coups.\nThe military took over in May 2014 following months of protests that led to the toppling of Yingluck Shinawatra's democratically elected government.\nThe political conflict broadly pits a Bangkok-based middle class and royalist elite, backed by parts of the military and judiciary, against rural and working-class voters loyal to Yingluck and her brother Thaksin, who was also deposed in a coup in 2006.","url":"https://www.dailymail.co.uk/wires/afp/article-3393820/Frail-Thai-king-briefly-leaves-Bangkok-hospital.html"}
