{"authors":[],"date_download":"2018-10-22 21:44:41","date_modify":"2018-10-22 21:44:41","date_publish":"2014-05-08 08:02:32","description":"Around 10 experts from the external DGSE intelligence service with satellite observation knowledge will first be sent to join U.S. and British teams.","filename":"data/vaneerConsumption/FranceSendsAgentstoNigeriatoFindGirlsTakenbyBokoHaram.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/428186/140508-boko-0415_86e7b4cfd84162a9855f0190d0720105.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_france-sends-agents-nigeria-find-girls-taken-boko-haram-n100061_1540244681.html","title":"France Sends Agents to Nigeria to Find Girls Taken by Boko Haram","title_page":"France Sends Agents to Nigeria to Find Girls Taken by Boko Haram","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPARIS -- France said on Wednesday it was boosting intelligence ties with Nigeria and sending security service agents there to tackle Boko Haram after more than 200 girls were kidnapped by the Islamist group.\nPresident Francois Hollande's office said he spoke by telephone with Nigerian leader Goodluck Jonathan and that Paris would dispatch a specialized team to Abuja to help find the girls. With more than 4,000 troops operating between Mali to the west and Central African Republic to the east, Paris has a major interest in preventing Nigeria's security from deteriorating and has voiced concern Boko Haram could spread north into the Sahel.\nHaving ousted al Qaeda-linked militants from Mali last year, France is planning to redeploy its forces across West Africa this summer to target Islamist groups taking advantage of porous borders between southern Libya, northern Chad and Niger.\n\"The president expressed his desire to increase intelligence cooperation with Nigeria, involving all regional countries, so that this terrorist group can no longer carry out such acts,\" a statement on the telephone conversation said.\nEarlier on Wednesday, Foreign Minister Laurent Fabius told lawmakers: \"In the face of such ignominy, France must react. This crime cannot be left unpunished.\"\nAround 10 experts from the external DGSE intelligence service with satellite observation knowledge would first be sent to join United States and British teams, official sources said.\nDemanding an Islamic state, Boko Haram has been fighting in the northeast for the past five years. It attracted global attention with the abduction of girls taking exams in the village of Chibok, also in the south of Borno state.\nFrench interests have already been targeted by Boko Haram. Last November, the group kidnapped a French priest and held him for a month. Earlier last year, in mid-February, they snatched a French family of seven on holiday in northern Cameroon and held them for two months. Hollande at the time denied a ransom had been paid for the family, but a confidential Nigerian government report seen by Reuters said Boko Haram was given the equivalent of $3.15 million by French and Cameroonian negotiators.\nThe kidnappings were among a series of attacks on French targets in West Africa since France launched a military intervention in Mali in January 2013 to oust al Qaeda Islamists who had forged links with Boko Haram.\n- Reuters","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/france-sends-agents-nigeria-find-girls-taken-boko-haram-n100061"}
