{"authors":["Breitbart London"],"date_download":"2018-10-30 20:44:30","date_modify":"2018-10-30 20:44:30","date_publish":"2016-12-09 17:23:54","description":"France's central bank Friday trimmed its growth forecasts for 2016 to 2018 citing a worsening of the global economy and Brexit.","filename":"data/vaneerConsumption/FrancesCentralBankBlamesBrexitForPoorGrowth.json","image_url":"https://media.breitbart.com/media/2016/06/FRANCE-EU-ECONOMY-CURRENCY-EURO-FEATURE-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_12_09__1540932270.html","title":"France's Central Bank Blames Brexit For Poor Growth","title_page":"France's Central Bank Blames Brexit For Poor Growth","title_rss":"NULL","source_domain":"breitbart.com","text":"PARIS (AFP) – Growth paths in top eurozone economies Germany and France are headed in different directions, central bank data showed Friday, raising the prospect of tension between the two powerhouses.\nFrance’s central bank Friday trimmed its growth forecasts for 2016 to 2018 citing a worsening of the global economy and Brexit, while Germany’s Bundesbank lifted its outlook.\nThe diverging projections in the eurozone’s two top economies came a day after the European Central Bank extended measures to underpin the bloc’s economy as it grapples with political uncertainties.\nGermany and neighbouring France both hold crunch elections in 2017.\nThe EU must also negotiate with Britain on its looming exit, as well as navigate Italy’s future after the resignation of Italian Prime Minister Matteo Renzi.\nRevising its GDP growth forecasts down, the Bank of France said in a statement that it was “mainly due to the deterioration in the international environment”.\n– No wriggle room –\n“The projection is thus particularly affected by less favourable foreign demand prospects.., notably as a result of the impact of Brexit on the UK economy and of its dissemination to the euro area economies.”\nThe French central bank revised its 2016 and 2017 growth forecast down to 1.3 percent, having previously expected growth of 1.4 percent this year and 1.5 percent next year.\nIt also predicted growth of 1.4 percent in 2018, down from its previous figure of 1.6 percent.\nECB board member Benoit Coeure, a Frenchman, warned presidential contenders in next year’s elections not to expect any financial wriggle room.\nCandidates should not expect to find on winning “a kitty or budgetary margins of maneouvre that they’re going to be able to spend”, Coeure said on Europe 1 radio.\n“These margins of maneouvre don’t exist and there’s a risk of a rise in interest rates,” he said.\nAnd he pointed out that growth in France would be weaker than in the rest of the eurozone. “France is lagging behind in terms of growth,” he added.\nIHS Markit economist Howard Archer said he saw lower growth rates for French GDP growth this year and next.\n“We suspect that political uncertainty will take an appreciable toll on French economic activity in the first half of the year. Meanwhile, French structural problems remain a concern,” he said in written comments.\nMichael Hewson, of CMC Markets, said the figures highlighted the challenges for Francois Hollande’s successor and “any reluctance to look at structural reforms in the coming months is only likely to heighten tension between Berlin and Paris”.\n– ‘Sound upward path’ –\nMeanwhile European economic powerhouse Germany is “on a sound upward path” for faster-than-expected growth in 2016 and 2017, its central bank said Friday, but remains at risk from Donald Trump and Brexit.\nThe country’s “main driver is buoyant domestic demand, which is being bolstered by the favourable situation in the labour market and by rising household income,” Bundesbank president Jens Weidmann said in a statement accompanying the semi-annual report.\nThe economy should expand by 1.8 percent in both 2016 and 2017, the bank’s forecasters predict, upping their previous forecasts of 1.7 percent growth this year and 1.4 percent next year.\nBut looking to the wider world, the economists warn that “risks are tilted to the downside” in the years ahead, with potential danger from a slowdown in China, Britain’s exit from the EU and uncertain economic policy under US President-elect Donald Trump.\nBritain voted on June 23 to leave the EU, and Prime Minister Theresa May has promised to trigger the two-year divorce process at the end of March.\nECB chief Mario Draghi on Monday highlighted the risks which the referendum result poses for European economies.\n“Looking at the recent events, it is quite clear that geopolitical uncertainty has become the major source of uncertainty for the months to come,” he said.\nIncreased energy prices in future are also expected to cut the amount consumers have in their pockets to spend in both Germany and France, both central banks said.\n(By Kate Millar)","url":"https://www.breitbart.com/europe/2016/12/09/frances-central-bank-blames-brexit-poor-growth/"}
