{"authors":[],"date_download":"2018-10-30 00:54:33","date_modify":"2018-10-30 00:54:33","date_publish":"2014-07-09 08:00:00","description":null,"filename":"data/vaneerConsumption/FrancesSimmeringIntifada.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/07/Screen20Shot202014-06-1020at203.55.3220PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860873.html","title":"France's Simmering Intifada","title_page":"France's Simmering IntifadaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"When gendarmes arrested seven Muslim militants in Strasbourg in a pre-dawn sweep last May, it was the first major move in the government’s stepped-up attempt to stem the flow of French jihadists to Syria to join al Qaeda’s fight against Bashar al-Assad. Not that France has any interest in propping up his regime, au contraire. Rather, French authorities have reason to fear that when they return battle-hardened from Syria, as the seven had, they will put their guerrilla training to deadly use in the restive Arab barrios of Paris, Lyons, Marseilles, and other major cities.\nFrance’s new campaign to rein in its home-grown jihadists is prompted by alarming statistics from domestic intel: Whereas in January some 250 French nationals were known to be fighting in Syria, that figure had doubled by April. Hundreds more, recruited directly in France’s Muslim communities or incited by jihadist websites, are either en route to there or have returned. Thirty-odd are known to have died in the fighting. “Now there are not only more of them,” Foreign Minister Laurent Fabius said recently, “but they are younger, including boys and girls as young as fifteen.”\nIn any case, it seems the problem will only worsen. France is home to the largest Islamic population in Europe. The number of Muslims from North and West Africa and the Middle East is estimated at five million—no official figures exist, it being head-in-the-sand policy to forbid collection of statistics based on race or religion. Crammed into bleak, crime- and drug-ridden suburban public housing tower blocks, the banlieues, their numbers are increasing so fast around Paris that they will soon outnumber the two million inhabitants of the city center.\nRage and resentment have been building in the banlieues since at least the 1970s, when the government authorized immigrant workers to bring in their families. These were boom years for the postwar French economy. Jobs were plentiful for immigrants and they and their families were soon French citizens. But the dream began to sour as they ran up against the country’s innate, visceral xenophobia, with ethnic epithets about Muslims, Jews, and other minorities the stuff of everyday French conversation. Moreover, the official policy of laïcité, or secularism, meant that Muslim immigrants were expected to be loyal citizens of the republic first and Muslims second. For many of the devout, taught that Islamic-style theocracy is Allah’s way, this was impossible.\nThe result has been growing hostility toward the secular French state. Now the Arab neighborhoods often constitute virtual free-fire zones, delicately known as “sensitive urban districts,” where alienated, jobless young people do dope and burn cars for kicks—some 30,000 go up in flames annually. Boom boxes throb with angry gangsta rap. A popular one goes:\nFrance is a bitch\nYou have to f–k her to exhaustion\nYou have to treat her like a whore, man.\nAt international soccer matches, individuals of Arab and African descent sometimes jeer when the Marseillaise is sung before the game. Teenagers speak a mix of French, English, and Arab slang salted with American hip-hop. They derisively call hereditary Frenchmen “sons of Clovis” (a reference to the sixth-century ruler of the Gauls) or “natives,” unless they happen to be Jewish, in which case they are “filthy yid.” Any police who venture into the area hear, in English, “F–k the cops,” when it’s not Na’al abouk la France! (“F–k France!”). Many will inevitably end up in jail—fully 70 percent of France’s prison population is Muslim—where they will be preached jihad and radicalized by other inmates. One commentator calls the country’s prisons “the engine room of Islamic radicalism.”\nSometimes the whole explosive mixture blows. In 2005 the spark was the deaths of two Muslim teenagers accidentally electrocuted in a power station while running from police. The leader of the radical Salafist Group for Preaching and Combat (GSPC from its French initials), Abdelmalek Droukdal, a.k.a. Abu Mossab Abdelwadoud, declared France enemy number one. “The only way to teach France to behave,” he preached, “is jihad and Islamic martyrdom.” Islamist websites picked up on that, praying “Allah, grant us victory” and urging French Muslims to join the fight against a “land of infidels.” Many did, as fired-up youths poured out of the banlieues across the country to loot, burn, and wreak havoc.\nCoordinating their attacks via cell phones, for two weeks they burned thousands of automobiles and trashed hundreds of schools, public buildings, and post offices across France, causing $300 million of damage. President Jacques Chirac declared France’s first nationwide state of emergency since World War II. Police and riot troops, attacked to cries of “Allahu Akbar,” were hit with everything from Molotov cocktails to pickaxes and steel pétanque balls. Catholic churches were firebombed. After the worst was over, police netted two dozen Islamic radicals, several with links to al Qaeda. They also found caches of AK-47s with ammunition, plastic explosives, and bulletproof vests, indicating meticulous, professional preparation.\nSimilar, if less spectacular, confrontations occur so routinely that they no longer make the evening news. Among the more notable have been at Paris’s Gare du Nord, when rioters took over an entire train station for a day of mayhem, and the northern city of Amiens. There dozens of masked youths set upon police with buckshot and other weapons, wounding sixteen while wrecking schools and police stations, causing several million dollars’ worth of destruction. Andrew Hussey contends that these are no ordinary race riots: The savage, eight-year Algerian war of the 1950s and ’60s is still being played out, he says—this time in France itself.\nHussey, a British journalist and academic who heads the University of London Institute in Paris, casts a critical eye on France’s volatile situation in his timely new book, The French Intifada: The Long War Between France and Its Arabs, out now from Faber and Faber. Drawing on the tortuous history of France’s colonial period, as well as writers such as Jean-Paul Sartre, Albert Camus, and the anti-colonial activist Frantz Fanon, he describes an “unacknowledged civil war” in which France is under attack “from the angry and dispossessed heirs to the French colonial project.” It amounts to nothing less than the start of the Fourth World War, resulting from unresolved conflicts due to the sudden, often chaotic breakup of the nineteenth-century European colonies.\nWith hindsight, it’s obvious that the European empires could only breed seething resentment that would one day lead to payback. But whereas the British were motivated mainly by trade and economics and did not attempt to change local cultures, enabling them to exit their Asian and African colonies relatively unscathed, the French insisted on cultural conquest. As part of their mission civilisatrice they would export their political culture and Catholic religion to the benighted natives of Indochina and North and West Africa by force if necessary—turning them into ersatz Frenchmen whether they wanted it or not.\nThe Vietnamese, led by Ho Chi Minh, sounded the death knell of the French colonial empire at the battle of Dien Bien Phu in 1954, but Paris still didn’t get it. Algeria, French leaders insisted, was as French as Burgundy, and would remain so. This despite that, beginning with the first French army landing in the bay of Sidi-Ferruch, fifteen miles from Algiers, on June 14, 1830, the occupation was marked by increasing resistance. It culminated in the horrendous Algerian War starting in 1956.\nWith France’s War Ministry running its colonies, its rule of Algeria amounted to a 130-year combat to bring it under control by systematically erasing its national identity. The army razed and burned whole villages where resistance was strongest. It perfected torture techniques like electrocution and waterboarding, and dropped bound prisoners from helicopters into the Bay of Algiers. The Algerians, led by the National Liberation Front, responded with their own terrorism, slitting throats, slicing off ears, decapitating bodies, and mutilating genitalia, which were then stuffed into victims’ mouths. Prefiguring today’s jihadist tactics, veiled women carried bombs into popular cafés and theaters in Algiers. France threw in the towel and signed a peace agreement in 1962. But the hurt and humiliation Algerians suffered lingers on in the banlieues, making them fertile ground for preachers of jihad against the former colonial masters.\nNo one can predict when the next explosion will come, but come it surely will. As Hussy points out, the rioters in the banlieues often describe themselves as soldiers in a “long war.” Nonetheless, the French government tries to deny that Islamic jihadists can be behind the violence. It prefers to call the periodic uprisings merely a “spontaneous popular revolt” by kids reacting to racism and poverty, and similar euphemisms. As one prime minister put it after some serious car-burning, cop-baiting riots, “There have been no riots in France, only some social unrest.” This at least has the merit of historical consistency: Denial until events forced sudden, catastrophic change was how France mismanaged revolt in Vietnam and Algeria—and how French kings of the ancien régime dealt with popular unrest in the eighteenth century.\nThe mainstream media generally go along with this, downplaying the rioting as just another form of the usual rebellion by malcontents against the powers that be. “Many French political commentators are blind,” says Gilles Kepel, a professor at Paris’s Institut d’Etudes Politiques who has studied and written extensively about Muslims in France. “They do not want to see the world beyond France. And so they do not understand that what happens here is because of our relationship with the Arab world, and our history there.” He likens the current tensions to the convulsive 2011 Arab Spring revolts in the Muslim world.\nNeither he nor Andrew Hussey attempts to predict where this may lead. But as Hussey surveys the French scene, he sees little reason for optimism. “There is a lot of anger and a lot of young men willing to turn themselves into soldiers for God,” he writes. “Most importantly, the rioters, wreckers, even the killers of the banlieues are not looking for reform or revolution. They are looking for revenge.”","url":"https://spectator.org/59575_frances-simmering-intifada/"}
