{"authors":[],"date_download":"2018-10-23 02:26:30","date_modify":"2018-10-23 02:26:30","date_publish":"2016-01-29 16:55:45","description":"French Defence Minister Jean-Yves Le Drian has ordered a probe into allegations of sexual abuse of children by French soldiers in the Central African Republi...","filename":"data/vaneerConsumption/FrancetoprobeallegedchildsexabusebyitssoldiersinCAR.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i2sz-3bmscybNe842cce83474b57fcec5-83_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423142_France-probe-alleged-child-sex-abuse-soldiers-CAR_1540261590.html","title":"France to probe alleged child sex abuse by its soldiers in CAR","title_page":"France to probe alleged child sex abuse by its soldiers in CAR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"France to probe alleged child sex abuse by its soldiers in CAR\nFrench Defence Minister Jean-Yves Le Drian has ordered a probe into allegations of sexual abuse of children by French soldiers in the Central African Republic, aides said Friday.\nThe minister instructed French investigators to pursue the probe \"as soon as he became aware of documents issued on January 19 by the UN High Commissioner for Human Rights\", an aide told AFP.\nThe High Commissioner, Zeid Ra'ad Al Hussein, earlier Friday expressed alarm at new claims of abuse by foreign peacekeepers in the country, including cases involving European Union troops.\nA French soldier standing guard as Muslim people wait to seek refuge at the Boali church, in Boali, some 100km north of Bangui ©Eric Fefferberg (AFP/File)\nThe allegations relate to 2014 but have only come to light in recent weeks, UN officials said.\nFrench soldiers serving in France's Sangaris force are already being investigated in France over allegations that they forced children in CAR to perform sexual acts in exchange for food.\nThe accusations revealed in Geneva on Friday mainly concern peacekeepers from Georgia serving as part of the European Union peacekeeping force EUFOR.\nTwo girls said they were raped and two others said they were paid to have sex with other EUFOR soldiers. The four girls were aged between 14 and 16 at the time of the alleged abuse, according to a UN statement.\nThe French defence ministry said it had passed on the new information it had received from the United Nations to French investigators to allow them to establish whether they were different allegations from those already made.\n\"The United Nations and France are cooperating fully in order to shed all the light possible on these very serious allegations,\" the Le Drian aide said.","url":"https://www.dailymail.co.uk/wires/afp/article-3423142/France-probe-alleged-child-sex-abuse-soldiers-CAR.html"}
