{"authors":["Will Griffee For Mailonline","Associated","Press Reporter"],"date_download":"2018-10-23 00:47:36","date_modify":"2018-10-23 00:47:36","date_publish":"2017-03-16 10:20:28","description":"France coach Guy Noves has made just one change to his starting line-up to face Wales in their final Six nations match. Sebastien Vahaamahina will start at the expense of Julien Le Devedec.","filename":"data/vaneerConsumption/FrancebringinSebastienVahaamahinaforWalesclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53624E00000578-0-image-a-57_1489659429167.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4319554_France-bring-Sebastien-Vahaamahina-Wales-clash_1540255656.html","title":"France bring in Sebastien Vahaamahina for Wales clash","title_page":"France bring in Sebastien Vahaamahina for Wales clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"France coach Guy Noves has made just one change to his starting line-up to face Wales in their final Six nations match.\nNoves has largely kept faith with the players that scored four tries to comfortably beat Italy 40-18 in Rome last weekend.\nHaving recovered from back problems, lock Sebastien Vahaamahina will start at the expense of Julien Le Devedec, who has been named on the bench.\nSebastien Vahaamahina will add some bulk to the French pack in his start against Wales\nFRANCE TEAM TO FACE WALES Backs: Brice Dulin, Noa Nakaitaci, Remi Lamerat, Gael Fickou, Virimi Vakatawa, Camille Lopez, Baptiste Serin Forwards: Louis Picamoles, Kevin Gourdon, Fabien Sanconnie, Yoann Maestri, Sebastien Vahaamahina, Rabah Slimani, Guilhem Guirado, Cyril Baille Substitutes: Camille Chat, Uini Atonio, Eddy Ben Arous, Julien Le Devedec, Damien Chouly, Antoine Dupont, Francois Trinh-Duc, Yoann Huget\nFrance can finish second in the tournament if it beat Wales at the Stade de France on Saturday and England win in Ireland.\nLes Bleus have shown green shoots of recovery after last year's campaign in which they stumbled to a fifth place finish.\nNoves' men look to have developed an improved resilience with shades of the dominant Toulouse side Noves steered to sustained dominance during his time at the club.\nThough the French have suffered defeats by England and Ireland, victory on the final day in front of their home fans would show adequate progress.\nFrance still have the opportunity to finish second in the Championship but need England to win\nBaptiste Serin and Camille Lopez will continue their half-back partnership as combinations are given the chance to flourish after the tinkering of Philippe St Andre's regime.\nWales on the other hand will be desperate to secure an away win to improve their chances of avoiding New Zealand, Australia and England in the draw for Japan 2019.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4319554/France-bring-Sebastien-Vahaamahina-Wales-clash.html"}
