{"authors":[],"date_download":"2018-10-23 00:21:46","date_modify":"2018-10-23 00:21:46","date_publish":"2017-04-26 10:01:22","description":"French intelligence services have scientific proof that the Syrian regime was responsible for a suspected chemical attack that killed 88 people, France's...","filename":"data/vaneerConsumption/FrancesayshasproofSyriaregimelaunchedchemicalattack.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/17/wire-466487-1493223696-74_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446854_French-intelligence-blames-Syrian-regime-chemical-attack_1540254106.html","title":"France says has proof Syria regime launched 'chemical attack'","title_page":"France says has proof Syria regime launched 'chemical attack' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Syrian children receive treatment in the town of Maaret al-Noman, following a suspected chemical weapons attack in Khan Sheikhun, a nearby rebel-held town in Syria's northwestern Idlib province, on April 4, 2017\nFrench intelligence services have scientific proof that the Syrian regime was responsible for a suspected chemical attack that killed 88 people, France's foreign minister said Wednesday.\nJean-Marc Ayrault said analysis of samples taken at the scene of the April 4 attack in rebel-held Khan Sheikhun, in which 31 children were among the dead, showed \"there is no doubt that sarin gas was used\" and that it was produced by Syrian laboratories.\n\"There is no doubt about the responsibility of the Syrian regime given the way that the sarin used was produced,\" Ayrault told journalists after the report was presented at a meeting of French defence chiefs.\nHe said the substance France believes was used in the attack contains hexamine, a component that was also found in a gas attack in Saraqib, northwest Syria, in 2013.\n\"We are able to confirm that the sarin used on April 4 is the same sarin that was used in an attack in Saraqib on April 29, 2013,\" he said.\nAyrault said the chemical fingerprint is \"typical of the method developed in Syrian laboratories\".\n\"This (production) method bears the regime's hallmarks and allows us to determine its responsibility for this attack,\" he said.\nThe report added that \"the presence of hexamine indicates that this manufacturing process is that developed by the Scientific Studies and Research Centre for the Syrian regime\".\nThe report said the analysis was carried out by comparing \"environmental samples\" found at Khan Sheikhun with unexploded ordnance found at the site of the 2013 attack.\n- Washington convinced -\nSyrian President Bashar al-Assad, backed by his ally Russia, has strongly denied allegations that his forces used chemical weapons against the town, describing it as a \"100 percent fabrication\".\nHe has said repeatedly that his forces turned over all chemical weapons stockpiles in 2013, under a deal brokered by Russia to avoid threatened US military action.\nFrance blames Syria over chemical weapons attack\nThat agreement was later enshrined in a UN Security Council resolution.\nIn a policy U-turn, US President Donald Trump ordered air strikes on the Syrian airbase from which Washington believes the attack was launched.\nUS Defence Secretary Jim Mattis said on Friday there was \"no doubt\" Syria has retained some chemical weapons and warned Assad's regime not to use them.\n\"There can be no doubt in the international community's mind that Syria has retained chemical weapons in violation of its agreement and its statement that it had removed them all,\" Mattis said during a visit to Israel.\nMattis added that the Damascus regime would be \"ill-advised to try to use any again\", adding: \"We've made that very clear with our strike.\"\nOn Monday, the US government placed 271 Syrian chemists from the Syrian Scientific Studies and Research Centre and other officials on its financial blacklist in response to their alleged role in the chemical weapons attack.\nWashington says the SSRC was responsible for developing the alleged sarin gas weapon.","url":"https://www.dailymail.co.uk/wires/afp/article-4446854/French-intelligence-blames-Syrian-regime-chemical-attack.html"}
