{"authors":["John Hayward"],"date_download":"2018-10-30 20:46:53","date_modify":"2018-10-30 20:46:53","date_publish":"2015-11-16 17:03:34","description":"France launched what one spokesman described as a \"massive\" series of retaliatory airstrikes against ISIS capital Raqqa.","filename":"data/vaneerConsumption/FranceHitsISISCapitalwith20Bombs.json","image_url":"https://media.breitbart.com/media/2015/11/France-launches-airstrikes-on-ISIS-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_16__1540932413.html","title":"France Hits ISIS Capital with 20 Bombs","title_page":"France Hits ISIS Capital with 20 Bombs","title_rss":"NULL","source_domain":"breitbart.com","text":"In retaliation for the Friday night bloodbath in Paris, France launched what one spokesman described as a “massive” series of retaliatory airstrikes against the Islamic State’s (ISIS/ISIL) capital of Raqqa in Syria. The bombing began on Sunday and continued Monday morning.\nTwenty bombs were dropped, striking “a jihadi recruitment centre, training camp and arms depot run by the extremist group,” according to a French Defense Ministry statement quoted by Sky News. The mission was launched from airbases in the United Arab Emirates and Jordan.\n“More than 30 explosions were reportedly heard across the city,” reports Sky News. “The strikes hit military targets on the northern and southern edges of the city and no civilians were killed, according to the UK-based Syrian Observatory for Human Rights.”\nThe Observatory said there were ISIS casualties, but did not provide totals. An anti-ISIS activist group called Raqqa Is Being Slaughtered Silently told CNN few militants were killed during the attacks, while ISIS itself claimed through its media wing that none of its fighters were killed during Sunday’s bombing.\nAccording to these Raqqa activists, the city’s stadium and museum, which the Islamic State uses as prisons, were both hit during the French airstrikes.\nFrance Interior Minister Bernard Cazeneuve echoed President Francois Hollande by saying the brutal attacks in Paris–which killed 129 people and wounded 350 more–were an act of war.\n“Anybody who attacks the Republic, the Republic will fight back,” Cazeneuve declared. “It is not they who will destroy the Republic. The Republic will destroy them.”\nThe New York Times (NYT) reports Hollande decided on the airstrikes during a meeting with his national security team on Saturday. Until now, the French were reluctant to bomb heavily inside Syria, for fear of strengthening the regime of dictator Bashar Assad by damaging his adversaries.\nThe NYT relates a Twitter message from an anti-government activist in Palmyra pleading for France to avoid endangering civilians in the captive capital of the Islamic State:\nTo the people & government in #France, #Raqqa City residents are not all #ISIS , we please do not targets at random pic.twitter.com/7pWUK9hD4D — Khaled AL Homsi (@PalmyraPioneer) November 15, 2015\nHowever, CNN cites the activists of Raqqa Is Being Slaughtered Silently as claiming “the civilian population does not seem particularly worried” about the French bombing campaign, aside from the city streets and markets being less crowded than usual.\nFrance reportedly obtained its target list in Raqqa from the U.S. military, which raises the question of why American warplanes have not been hitting those targets before now.\n“These target packages were already in folders, as they’re called, and I’m sure the central command handed them over to the French fighters to attack for the symbolism of France being back in the fight,” said retired Lt. General Mark Hertling, a CNN military analyst.\nAnother CNN analyst, retired Maj. Gen. James “Spider” Marks, described the French airstrikes as a “visceral” reaction, designed to send a “strong political message” for “internal consumption within France.” This would seem to imply the targets France struck were not particularly important, and may have been chosen more for the low probability of collateral civilian casualties than their military significance.","url":"https://www.breitbart.com/national-security/2015/11/16/france-hits-isis-capital-20-bombs-destroys-training-camps-arms-depot/"}
