{"authors":[],"date_download":"2018-10-30 21:13:33","date_modify":"2018-10-30 21:13:33","date_publish":"2016-01-13 09:50:51","description":"France's chief rabbi was among Jewish leaders who rejected a call for men and boys to stop wearing skullcaps, after a string of anti-Semitic attacks in |","filename":"data/vaneerConsumption/FrancesChiefRabbiJewsShouldKeepWearingSkullcaps.json","image_url":"https://media.breitbart.com/media/2015/01/jew-poland-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_13__1540934013.html","title":"France's Chief Rabbi: Jews Should Keep Wearing Skullcaps","title_page":"France's Chief Rabbi: Jews Should Keep Wearing Skullcaps | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"France’s chief rabbi was among Jewish leaders who rejected a call for men and boys to stop wearing skullcaps, after a string of anti-Semitic attacks in the southern city of Marseille.\nZvi Ammar, the leader of Marseille’s Jewish community, earlier called on male Jews to stop wearing the kippa “until better days”, because of fears for their safety.\n“Unfortunately for us, we are targeted,” he told AFP. “As soon as we are identified as Jewish we can be assaulted and even risk death.”\n“We have to hide ourselves a little bit,” he said, adding that making such an appeal made him “sick to the stomach”.\nHis warning came the day after a man claiming to act in the name of the Islamic State jihadist group attacked a Jewish teacher who was wearing a skullcap and carrying a Torah.\nBut other Jewish leaders rejected the call, with France’s chief rabbi Haim Korsia telling AFP: “We should not give an inch, we should continue wearing the kippa.”\nRoger Cukierman, the head of the country’s umbrella grouping of Jewish organisations, CRIF, agreed, saying the call reflected “a defeatist attitude”.\n“He (Ammar) knows as well as I do that wearing a kippa or not will not resolve the issue of terrorism,” added Joel Mergui, president of the Israelite Central Consistory of France.\n“If we have to give up wearing any distinctive sign of our identity, it clearly would raise the question of our future in France.”\nFrance’s Jewish community is estimated at between 500,000 and 600,000 people, the largest in Europe and one of the largest in the world.\n‘Not afraid to be Jewish’\nMonday’s attack by a 15-year-old Turkish Kurd was the third on Jews in recent months in Marseille, home to the second-largest Jewish population in France after Paris with some 70,000.\nThe assailant, who investigators believe was self-radicalised via the Internet, attacked Benjamin Amsellem with a machete in the name of the Islamic State group.\nHe slashed the 35-year-old in the shoulder and hand in a scuffle that saw the victim, who fell to the ground, using his Torah as a shield to try to fend off the attack.\nAmsellem’s wife Mazal said he had already decided not to wear a skullcap “and encourages the community to do the same, not because he is afraid or ashamed to be Jewish, quite the contrary, but for security”.\nThe attack followed assaults on three Jews in October, one by a drunken assailant with a knife near a synagogue.\nIn November, another Jewish teacher was stabbed by people shouting anti-Semitic obscenities and support for the Islamic State group.\nFrance’s Jewish community has grown used to living under the surveillance of armed soldiers around synagogues and schools since being targeted in a jihadist attack in Paris last January.\nThis month, France marked a year since the attacks that left 17 people dead, including four gunned down in a Jewish supermarket.\nAnti-Semitic acts have soared in recent years, increasing by 84 percent in the period between January 2015 and May 2015 compared to a year earlier, according to official statistics.\nAt the same time there has been an increase in emigration from France to Israel, with a record 7,900 people leaving last year.\nMarseille prosecutor Brice Robin said that since November’s jihadist rampage in Paris that claimed 130 lives, his city had opened 70 investigations into attacks, threats and incitements to hatred, as well as “defending terrorism”.\nThe frequency of such offences was “much greater than elsewhere” in France, he said.","url":"https://www.breitbart.com/europe/2016/01/13/frances-chief-rabbi-jews-should-keep-wearing-skullcaps/"}
