{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-23 01:58:47","date_modify":"2018-10-23 01:58:47","date_publish":"2016-01-29 16:14:56","description":"Francesca Kentish, from London, quit the arduous beauty regime last year and has found the natural look 'refreshing'. She hasn't picked up a razor for the past two months.","filename":"data/vaneerConsumption/FrancescaKentishdecidedtostopremovingherbodyhairfortwomonths.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B40D6E00000578-0-image-a-108_1454084054098.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422972_Woman-decided-stop-removing-body-hair-two-months_1540259927.html","title":"Francesca Kentish decided to stop removing her body hair for two months","title_page":"Francesca Kentish decided to stop removing her body hair for two months | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A London-based writer has decided to let the hair on her legs, armpits and bikini line grow - and has 'no plans to pick up a razor any time soon'.\nFrancesca Kentish quit the arduous beauty regime last year and has found the natural look 'refreshing'. She hasn't picked up a razor for the past two months.\nMs Kentish also hit out at those who have criticised her decision saying it 'should be no big deal'.\nFrancesca Kentish quit the arduous beauty regime last year and has found the natural look 'refreshing'. She hasn't picked up a razor for the past two months\nMs Kentish told Metro that she felt 'a little awkward' during the first two weeks but after a month she became 'strangely proud of my armpit hair'.\n'It was the first time it had been longer than a half a centimetre in 10 years,' she told the website. 'It was a visible sign that I wasn’t putting up with b******* conventions any longer.\n'I’ve enjoyed not freaking out about getting ingrown hairs on my bikini line any more and no more itchy grow back, with the accompanying red pimples.'\nMs Kentish said she hasn't stopped looking herself and her hygiene hasn't been affected.\nMs Kentish said she hasn't stopped 'looking after myself' and her hygiene hasn't been affected\nArtist Molly Soda shares photographs of her hairy stomach online. She told Dazed: ‘I have a lot of girls messaging me about how my stomach hair makes them feel better/less self-conscious about theirs­­'\nShe said she has found the process liberating and has 'no plans to pick up a razor any time soon'.\nMs Kentish admitted she misses the 'feel of my smooth legs' but that 'everyone can just deal with my pits'.\nMs Kentish, who has been removing her body hair since the age of 12, was inspired by the stories of other women who have abandoned the grooming task.\nArtist Molly Soda shares photographs of her hairy stomach online.\nShe told Dazed: ‘I have a lot of girls messaging me about how my stomach hair makes them feel better/less self-conscious about theirs­­.\n'That’s what I care about – not about whether or not men find it attractive.’\nAnd a photographer called Ashley Armitage takes snaps of her friends coming of age.\nShe wrote on an Instagram post: ‘I want all girls and women to feel comfortable in their bodies. No one needs that kind of hate.\n‘Girls should be able to choose whether or not they shave. If we decide not [to] shave, we should not be shamed.’\nA photographer called Ashley Armitage takes snaps of her friends coming of age","url":"https://www.dailymail.co.uk/femail/article-3422972/Woman-decided-stop-removing-body-hair-two-months.html"}
