{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:08:48","date_modify":"2018-10-22 23:08:48","date_publish":"2017-03-10 01:59:45","description":"The 36-year-old Can't Stop the Feeling! artist took to Twitter on Thursday, writing 'While I’m at it… Frank Ocean had the REAL Album of the Year with BLONDE. #NotFakeNews.'","filename":"data/vaneerConsumption/FrankOceanshouldhavewonGrammysaysJustinTimberlake.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F007F00000578-0-image-a-35_1489107271292.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299632_Timberlake-says-Frank-Ocean-album-won-Grammy_1540249728.html","title":"Frank Ocean should have won Grammy says Justin Timberlake","title_page":"Frank Ocean should have won Grammy says Justin Timberlake | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Justin Timberlake says the Grammy for Album of the Year should have gone to Frank Ocean for Blond - not Adele's 25, the actual winner, or Beyonce’s Lemonade.\nThe 36-year-old hit-maker took to Twitter on Thursday to compliment Ocean for a recent track he did with Calvin Harris and Migos called Slide. The Memphis, Tennessee native added: 'While I’m at it… Frank Ocean had the REAL Album of the Year with BLONDE. #NotFakeNews.'\nThe bold declaration certainly didn't sit well with many in the Twitter-sphere, as some were vocal with their words - and memes - in their insistence Bey's album was the year's tops.\nSpeaking his mind: Justin Timberlake, 36, said Thursday that he felt Frank Ocean should have won the Album of the Year Grammy for Blonde. The pop star was snapped at the Oscars last month\nChiming in: The SexyBack singer gave his opinion on his Twitter account, on which he has more than 58.3 million followers\nNo thanks: Ocean did not submit Blonde for Grammys consideration amid his issues with the Grammys\nOutspoken: Ocean listed a number of virtues he holds preferable to an award on his Tumblr\nWhat the Can't Stop the Feeling! performer may or may not have known was that the 29-year-old Ocean didn't bother to submit his second studio album to Grammy officials for consideration, stemming from creative differences the artist had with the institution.\nOcean, a double-Grammy winner in 2013, expressed a measure of frustration over the Grammys in an interview with the New York Times last November, noting a sparse slate of black winners in the Album of the Year category over the past three decades, as well as an anachronistic system.\n'That institution certainly has nostalgic importance. It just doesn’t seem to be representing very well for people who come from where I come from, and hold down what I hold down,' he said. 'I think the infrastructure of the awarding system and the nomination system and screening system is dated.\nPeople's champ: While Adele won the award and Justin thought Ocean deserved it, many fans trumpeted Beyonce's album as the year's best\nSide eye: A number of users used words and pictures to state their disagreement with Justin's assessment of 2016's premiere album\nOcean said that while Grammy officials had talked to his team, he didn't chat with them before deciding not to submit Blonde for the annual award show.\n'I’d rather this be my Colin Kaepernick moment for the Grammys than sit there in the audience,' he said referencing the NFL quarterback who made headlines last year for not standing during the national anthem in hopes of making a social statement.\nOcean expanded in detail in a subsequent post on his Tumblr addressed to Grammy organizers Ken Ehrlich and David Wild, making clear he didn't find the value in the trophies others might.\nSecond thoughts: Ocean said that he would welcome a chat with Grammy organizers over the issues germane to his estrangement from the proceedings\n'I actually wanted to participate in honoring Prince on the show but then I figured my best tribute to that man’s legacy would be to continue to be myself out here and to be successful,' he wrote. 'Winning a TV award doesn’t christen me successful. It took me some time to learn that.'\nHe added, 'If you’re up for a discussion about the cultural bias and general nerve damage the show you produce suffers from then I’m all for it.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299632/Timberlake-says-Frank-Ocean-album-won-Grammy.html"}
