{"authors":["James Salmon","Transport Correspondent For The Daily Mail"],"date_download":"2018-10-22 21:18:51","date_modify":"2018-10-22 21:18:51","date_publish":"2017-04-26 01:29:30","description":"Franchised workshops charge an average of £99 an hour, compared with an independent garage which charges an average of £56, an investigation has revealed.","filename":"data/vaneerConsumption/Franchisedgaragecosts40morethanindependent.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B64D900000578-0-image-a-5_1493166529590.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445994_Franchised-garage-costs-40-cent-independent_1540243131.html","title":"Franchised garage costs 40% more than independent","title_page":"Franchised garage costs 40% more than independent | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Franchised garages linked to big car manufacturers are typically charging 40 per cent more to fix a car, according to a report.\nAn investigation into more than 6,000 garages across the UK has discovered that some mechanics are charging up to £234 an hour in labour costs.\nIt highlights the startling difference between the amount franchised dealerships of big car companies and ‘fast fit’ firms such as Kwik Fit charge, and the hourly rate charged by independent garages.\nFranchised garages linked to big car manufacturers are typically charging 40 per cent more to fix a car, according to a report. Stock image\nFranchised workshops charge an average of £99 an hour, compared with an independent garage which charges an average of £56.\nSome, including those operated by Porsche and BMW levy an hourly charge of more than £200.\nMany mechanics are charging as much as white collar professionals like lawyers and accountants.\nThe highest individual hourly rate was found at a Porsche dealer in Reading, which charges £234 an hour.\nThis is the equivalent of £486,720 a year - more than three times the prime minister’s salary.\nOverall, Surrey is the most expensive place to get your car fixed - with an average hourly rate of £84 across the county.\nThis is roughly 25 per cent more than the average hourly charge in the UK, at £67 according to the research from motoreasy.\nLast night one prominent motoring campaigner described the prices as ‘extortionate’ and said the government must launch a watchdog to protect motorists from being over-charged.\nHoward Cox, founder of FairFuelUK, said: ‘Drivers are not only ripped off by uncontrolled pricing at the pumps, high fuel taxation and threats of toxin charges, they are now facing extortionate servicing and repair costs.\n‘The new government must introduce a fair motoring regulatory body to protect 37million UK drivers from serial exploitation.’\nThere is also a big North-South divide when it comes to the cost of fixing your car.\nAn investigation into more than 6,000 garages across the UK has discovered that some mechanics are charging up to £234 an hour in labour costs. Stock image\nThe list of the top ten most expensive regions of the UK is dominated by areas in the south, with London garages charging the second most expensive labour rates of £77.42 an hour, followed by Worcestershire (£77.16), Berkshire (£76.77) and Buckinghamshire (£76.65).\nAt the other end of the scale Scottish county Selkirkshire has the cheapest average at £49.69, followed by the Shetland Islands at £53.25 and Inverness at £55.81.\nThe cheapest rate was charged by an independent workshop in Manchester, at just £36.\nThe report did not name the most expensive garages, but a previous investigation from 2014 by Warranty Direct identified three BMW garages based in London and the South East charging £200 and hour or more.\nAt the top up the pile was Berry Chiswick BMW at Brentford in Middlesex, charging £215 an hour.\nDespite this huge differences, more than three in five (62 per cent) say they do not shop around to get the best price before agreeing to have work done on their car, according to a poll of 2,000 drivers by motoreasy.\nAlarmingly, nearly a third (31 per cent) do not even check the final bill before paying.\nWomen are worse than men for not checking what labour rate they are paying, with more than four in five admitting they do not know the hourly cost at their regular garage.","url":"https://www.dailymail.co.uk/news/article-4445994/Franchised-garage-costs-40-cent-independent.html"}
