{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:24:20","date_modify":"2018-10-30 23:24:20","date_publish":"2014-08-13 19:31:38","description":"A lot of eyes have been on the Grande family since Ariana Grande took over the music charts and Frankie Grande took over the Big Brother house. Initially, Frankie didn't want to reveal his true identity — YouTube personality, social media mogul,…","filename":"data/vaneerConsumption/FrankieArianaGrandeSingingSuddenlyFrankieTogetherProvesTheyretheBestSiblingsEverVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/005e4487-f04c-4327-8e37-6aa20c1634a3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35612-frankie-ariana-grande-singing-suddenly-frankie-together-proves-theyre-the-best-siblings-ever-video_1540941860.html","title":"Frankie & Ariana Grande Singing \"Suddenly, Frankie\" Together Proves They're the Best Siblings Ever - VIDEO","title_page":"Frankie & Ariana Grande Singing \"Suddenly, Frankie\" Together Proves They're the Best Siblings Ever — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"A lot of eyes have been on the Grande family since Ariana Grande took over the music charts and Frankie Grande took over the Big Brother house. Initially, Frankie didn't want to reveal his true identity — YouTube personality, social media mogul, Ariana Grande's brother — to his fellow houseguests in order to keep a target off of his back. But since the double eviction episode, Frankie has had all eyes on him in the Big Brother house, and decided to reveal who he was outside of the house.\nAnd although the houseguests were blind to Frankie's life outside the house, we viewers weren't and discovered that the Grandes have the cutest brother/sister relationship to ever exist. If you've seen Frankie talk about Ariana in the house, you know how much he loves and supports his sister, and if you've seen Ariana's tweets since Frankie entered Big Brother, you know how much she misses him. And just when I thought that they couldn't get any cuter (and more enviable for only-child me), a video of the two of them singing together for fans blows all the previous adorableness out of the water.\nThe two cover \"Suddenly, Seymour\" from Little Shop of Horrors, but because they are perfect, they updated the song to be \"Suddenly, Frankie\" and it is just perfect. Check out the video below, and when it is over, just hit replay again, and again.\nHouseOfNightFan01 on YouTube\nI know Frankie was on Broadway, but he's a really good singer. You can tell that having a great voice runs in the family. Here is the movie version of the song for those who want to relive the 1986 classic all over again (or perhaps for the first time if you've never seen Little Shop of Horrors and if that's the case... Go watch Little Shop of Horrors, now!).\njlly16 on YouTube\nNow that Frankie is in a whole new little shop of horrors (because that's definitely what the Big Brother house is) it will be interesting to see if his star power can win him the $500,000 at the end of the season, or if his efforts will just fall flat.","url":"https://www.bustle.com/articles/35612-frankie-ariana-grande-singing-suddenly-frankie-together-proves-theyre-the-best-siblings-ever-video"}
