{"authors":[],"date_download":"2018-10-21 02:48:13","date_modify":"2018-10-21 02:48:13","date_publish":"2018-08-15 00:12:53","description":"Six years after Tice's capture, the National Press Club hosted a reception for an exhibit featuring his photos from Syria.","filename":"data/vaneerConsumption/FredRyandeliversremarksforthesixthanniversaryofAustinTicesdisappearance.json","image_url":"https://www.washingtonpost.com/resizer/kxjLjibHD0DeI_a0La3fDBDNTXU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QCIJGIRETY7MZFUQKJBF7J7C4E.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_14__1540090093.html","title":"Fred Ryan delivers remarks for the sixth anniversary of Austin Tice’s disappearance","title_page":"Fred Ryan delivers remarks for the sixth anniversary of Austin Tice’s disappearance - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"On August 14, 2018, Washington Post Publisher Frederick J. Ryan, Jr. delivered remarks at a National Press Club reception to mark the sixth anniversary of Austin Tice’s disappearance in Syria. Below is the full text of his prepared remarks.\nThank you for having me here this evening to add my voice and that of The Washington Post to the calls for the immediate and safe return of Austin Tice. Thank you Bill McCarren, Tim Grieve and especially to President DeGioia for being here and for all that you are doing in support of a Georgetown student.\nSpecial thanks to Reporters Without Borders for organizing this event and for everything they do every day to protect journalists around the world.\nAnd, to Marc and Debbie Tice, I can’t even begin to tell you how much all of us who have come to know you, respect and admire your singular devotion to Austin’s cause. We stand in solidarity with you. What you have endured is a parent’s worst nightmare. You have been selfless and relentless in your determination to secure Austin’s return.\nThe work of Austin Tice reminds us of the importance, impact, and, yes, dangers of great reporting. His brave work on the ground in Syria provided a critical view inside a conflict that the world did not understand.\nAustin is a talented journalist who took significant risks to cover a war that was really just beginning. The dispatches from his time embedded with Syrian rebels helped paint a picture of how a peaceful uprising turned into a rebel movement.\nHis disappearance in 2012 reminds all of us of the risks reporters face in order to shine light on the dark corners of the world, uncovering the truth others would like to keep hidden. Austin’s story illustrates how incredibly difficult it can be to get firsthand accounts from war zones and other hard to access places.\nToday, journalists reporting from the front lines and on other perilous assignments are in much more dangerous positions than those of earlier generations, or even reporters ten to twenty years ago.\nThe reach of the internet and social media platforms make reporters less useful to warlords and terrorists who feel they can now tell their own stories in any way they choose. They feel they do not need to tolerate journalists’ independent questions the way they had in the past.\nAt the same time, some terrorist groups see journalists as very valuable when kidnapped for ransom, a lucrative business in some areas of the world. And of course, there is an alarming number of authoritarian regimes who detain journalists in an attempt to silence the truth they tell the world.\nDespite this, courageous reporters like Austin Tice continue to put themselves in harm’s way. Often, the reporters at greatest risk are freelance and locally-based journalists who have developed a deep understanding of the places and wars they cover.\nAt The Washington Post, we believe it is our moral obligation to support freelance contributors just as we do our own staff. We will not rest until Austin Tice is safely reunited with his family and colleagues here at home.\nBefore I go, I would like to read you an excerpt from the editorial The Washington Post ran one year ago today. These are words we will continue to loudly echo until Austin is home. “Mr. Tice was not a combatant. To those who imprisoned him, we repeat: He is a journalist who went only to record and report on the plight of people in a wretched war. His ambitions were noble, and he has already paid a very steep price for his courage and determination. It is long past time to set Mr. Tice free.”\nI would now like to hand the microphone over to Tim Grieve, vice president of news at McClatchy.\nThank you.","url":"https://www.washingtonpost.com/pr/wp/2018/08/14/fred-ryan-delivers-remarks-for-the-sixth-anniversary-of-austin-tices-disappearance/"}
