{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 02:48:31","date_modify":"2018-10-23 02:48:31","date_publish":"2016-01-11 15:15:37","description":"A Maryland appeals court has postponed the trial of a police van driver charged with second-degree murder in death of Freddie Gray in Baltimore last year.","filename":"data/vaneerConsumption/FreddieGrayvandrivertrialdelayedONEMINUTEintojuryselection.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CF7CE00000578-0-image-a-33_1452531089523.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394062_Trial-Freddie-Gray-van-driver-delayed-appeals-court_1540262911.html","title":"Freddie Gray van driver trial delayed ONE MINUTE into jury selection","title_page":"Freddie Gray van driver trial delayed ONE MINUTE into jury selection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Officer William Porter, whose case ended in mistrial, argued being forced to testify violates Fifth Amendment\nBut his trial was halted one minute into jury selection by the court of appeals over whether a fellow cop can testify against him\nGoodson is charged with second-degree murder which could mean he faces 30 years in jail if convicted\nHe is the second of six Baltimore police officers to go to trial over the death of the 25-year-old\nThe trial of a police van driver charged with second-degree murder over the death of Freddie Gray has been delayed just one minute into jury selection by the appeals court.\nOfficer Caesar Goodson, 45, is one of six officers facing trial after Gray, a 25-year-old black man, died on April 19 last year of a severe spinal injury he suffered while in police custody.\nToday the jury selection for the trial of police van driver Goodson, who faces up to 30 years in jail if found guilty, was delayed so Maryland Court of Special Appeals can address whether another Baltimore officer can be compelled to testify against him.\nScroll down for video\nCaesar Goodson (pictured, right, at Courthouse East, in Baltimore last week for his motions hearing ahead) has had his trial delayed\nBaltimore Circuit Judge Barry Williams ruled last week that Officer William Porter, whose court proceedings ended in mistrial last month, must testify against fellow cop Goodson.\nBut Porter's defense team had attempted to quash the subpoena for testimony, claiming that the officer had a right not to incriminate himself.\nHis lawyers planned to invoke his Fifth Amendment protections against self-incrimination and said he would decline to take the stand.\nThe court of special appeals last week temporarily blocked the ruling while its judges consider whether to uphold that decision.\nKeeping mum: Lawyers for Baltimore police officer William Porter (left) had filed a motion to keep him from testifying against two fellow officers about the death of Freddie Gray (right) while in police custody\nGray died in April from injuries that prosecutors say he received while riding in a police van following his arrest. Goodson was driving the van.\nGoodson, Porter and White all face manslaughter, assault, misconduct in office and reckless endangerment charges.\nPorter, 26, was the first of the officers to go to trial, last month. Jurors could not reach a verdict, however, and a judge declared a mistrial. Porter's retrial has been scheduled for June 13.\nGoodson, who was driving the police van where prosecutors say Gray, 25, suffered a broken neck and a spinal cord injury, faces an additional charge of second degree ‘depraved-heart’ murder.\nHe was with Freddie Gray for every second of his 45-minute trip from the site of his arrest to the Western District police station, where Gray arrived critically injured and unresponsive.\nBut the driver's account of what happened on that day remains a mystery: He is the only one of six officers charged in Gray's death not to speak to investigators.\nThe trial was to offer the public its first chance to hear Goodson's side of the story.\nProsecutors say the officers should be held accountable for Gray's fatal injuries because they didn't buckle him into a seat belt, nor did they call an ambulance when he indicated he needed medical attention.\nJury selection was delayed Monday so that the Maryland Court of Special Appeals can address whether the other Baltimore officer can be compelled to testify against Caesar Goodson\nPorter, 26, was the first of the officers to go to trial, last month. Jurors could not reach a verdict, however, and a judge declared a mistrial\nGoodson, they say, bears the most responsibility because as the wagon driver, Gray was technically in his custody.\nAfter Porter's case ended in a mistrial, the stakes for Goodson's trial are even higher in a city still on edge from the rioting and unrest in April.\nPorter's attorneys argued in their motion that forcing him to testify would ‘effectively render the Fifth Amendment meaningless.’\n‘Calling Officer Porter at the Goodson and White trials will not only result in his rights being violated, but will necessitate a quagmire in which rights are trampled on all sides in the ensuing free-for-all,’ his attorneys wrote.\nThe defense team also argued that if Porter were to take the stand prior to his own retrial, no matter the outcome, his credibility would be adversely affected.\n‘If Officer Goodson or Sergeant White were to be acquitted it is all but inevitable that jurors would conclude that Porter — the star witness — was not credible,’ the filing reads.\n‘If convicted, the jurors will assume that Officer Porter has knowledge of inculpatory acts that he has now revealed when granted immunity.’\nThis frame from a video shows (from left to right) Officer Caesar Goodson, Officer Garret Miller, Officer Edward Nero, Freddie Gray, Lt Brian Rice on the day of Gray's arrest in April\nGray's death led to widespread protests and unrest in Baltimore that resulted in millions of dollars in damages. This image from November shows a protester holding a sign in front of the courthouse where jury selection began in the trial of William Porter\nProsecutors have revealed little about the case they plan to present against Goodson, who is also black.\nBut in a pretrial hearing last week they said they would call a witness who specializes in 'retaliatory prisoner transport practices,' indicating they intend to bring up the possibility that Gray received a 'rough ride' in the van.\nGoodson, 45, is twice-married and lives with his second wife, Paula, in the Baltimore suburbs. He has two daughters and a teenage son.\nHe is the grandson of a police officer and his nephew Antoine is a promising football player playing wide receiver for the Northwestern Oklahoma State University Rangers.\nDuring the hearing, defense attorneys argued that prosecutors had introduced 'a new legal theory or area of testimony at the proverbial eleventh hour.' The witness is Neill Franklin, a former Baltimore police officer and Maryland state trooper.\nDuring his own trial Porter told jurors that it was Goodson's responsibility to buckle Gray into a safety belt, and that Gray was unrestrained throughout the entire wagon ride.\nPorter also said he told Goodson that Gray wanted to go to a hospital, but Goodson ignored his suggestion.\nDefense attorneys and prosecutors can't comment on the case because they are under a gag order.\nGray's death led to widespread protests and unrest in Baltimore that resulted in millions of dollars in damages. It has also become a national symbol of the Black Lives Matter movement.\nHeaded for trial: Sgt. Alicia White (left) and Lt. Brian Rice (right) both face manslaughter, assault and misconduct in office charges\nOfficer Garrett Miller (left) and Officer Edward Nero (right) both face assault, misconduct in office and false imprisonment charges","url":"https://www.dailymail.co.uk/news/article-3394062/Trial-Freddie-Gray-van-driver-delayed-appeals-court.html"}
