{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 18:35:22","date_modify":"2018-10-30 18:35:22","date_publish":"2016-01-11 18:50:48","description":"The Obama Pentagon announced Monday that Guantánamo detainee Muhammad Abd Al Rahman Awn Al-Shamrani, 40, will be transferred back to Saudi Arabia.","filename":"data/vaneerConsumption/FreedGuantnamoDetaineeSaidHeWouldKillAmericans.json","image_url":"https://media.breitbart.com/media/2016/01/muhammed-abd-al-rahman-awn-al-shamrani-wiki.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_11__1540924522.html","title":"Freed Guantánamo Detainee Said He Would ‘Kill Americans’","title_page":"Freed Guantánamo Detainee Said He Would ‘Kill Americans’","title_rss":"NULL","source_domain":"breitbart.com","text":"The Obama Pentagon announced Monday that Guantánamo detainee Muhammad Abd Al Rahman Awn Al-Shamrani, 40, will be transferred back to his home country of Saudi Arabia.\nWith the Monday announcement, Al-Shamrani became the fourth Guantánamo detainee released in 2016. U.S. officials determined him to be a “high risk” for recidivism, warning he would likely re-engage against the West should he be released from the detention facility. He also allegedly told guards at the facility that he would “kill Americans in Iraq and Afghanistan if released,” according to his leaked confidential file.\nOn January 6th, Al Qaeda-linked detainees Mahmud Umar Muhammad Bin Atef and Khalif Muhammad Salih Al-Dhuby were released from the Guantánamo Bay detention center. On January 8, Faez Ahmed Al-Kandari, another Al Qaeda-linked detainee who was suspected of working as a jihadi recruiter and expert propagandist, was released.\nThe four men are part of a group of 13 more detainees that that the administration will likely be released by the end of this month, according to reports.\nAccording to leaked military documents, Al-Shimrani is an Al Qaeda recruiter who may have served as one of Osama bin Laden’s personal bodyguards. He was deemed to pose a “high risk” against the United States.\n“If released without rehabilitation, close supervision, and means to successfully reintegrate into his society as a law-abiding citizen, it is assessed detainee would immediately seek out prior associates and reengage in hostilities and extremist support activities at home and abroad,” said part of his file.\nYet, a periodic review board set up by the Obama administration determined that he does not pose a “continuing significant threat to the security of the United States.” The periodic review board is made up of executive branch defense officials.\nPresident Obama is expected to address the Guantánamo purge in his State of the Union (SOTU) Address on Tuesday. His chief of staff, Denis McDonough, told “Fox News Sunday” that the President will uphold his 2008 campaign promise to close the prison facility entirely. McDonough said the President will present a plan to Congress during the SOTU, detailing how he would close the detention center.\n“He feels an obligation to the next president. He will fix this so that they don’t have to be confronted with the same set of challenges,” McDonough said.\nThe President has said that Guantánamo serves as a recruiting tool for jihadi terrorists, a claim that has been questioned by national security professionals.","url":"https://www.breitbart.com/national-security/2016/01/11/guantanamo-detainee-freed-monday-said-he-would-kill-americans-if-released/"}
