{"authors":["Associated Press"],"date_download":"2018-10-23 03:32:45","date_modify":"2018-10-23 03:32:45","date_publish":"2016-01-28 19:04:39","description":"WASHINGTON (AP) — Freed Washington Post reporter Jason Rezaian (reh-ZY'-ahn) has triumphantly returned to his company at a ceremony that included Secretary o...","filename":"data/vaneerConsumption/FreedreporterRezaianfetedbypapertopdiplomatKerry.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:5f67a64e64f84174a77c3efe657e39fe-4PuZeKVXE7cd9005b2c87607c70c-371_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421308_Freed-reporter-Rezaian-feted-paper-diplomat-Kerry_1540265565.html","title":"Freed reporter Rezaian feted by paper, top diplomat Kerry","title_page":"Freed reporter Rezaian feted by paper, top diplomat Kerry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Freed reporter Rezaian feted by paper, top diplomat Kerry\nWASHINGTON (AP) — Freed Washington Post reporter Jason Rezaian (reh-ZY'-ahn) has triumphantly returned to his company at a ceremony that included Secretary of State John Kerry.\nRezaian was released from a Tehran jail in a prisoner swap this month. He says his Iranian interrogators told him over 18 months that his newspaper didn't know of his plight and the U.S. government wouldn't lift a finger for his release.\nChoking up, Rezaian thanked those who helped secure his freedom.\nSecretary of State John Kerry, accompanied by Washington Post owner and Amazon CEO Jeff Bezos, right, talks with freed Washington Post reporter Jason Rezaian, left, during an opening ceremony for the new headquarters of The Washington Post, Thursday, Jan. 28, 2016, in Washington. (AP Photo/J. Scott Applewhite)\nFour other Americans were allowed out of Iran as part of the deal that Kerry helped to finalize.\nKerry said he planned to attend Thursday's inauguration of the Post's new headquarters even before he knew Rezaian would be free.\nAfter embracing Rezaian, Kerry cited the military adage that you \"never leave a buddy behind.\"\nFreed Washington Post reporter Jason Rezaian, center, joined by Post Publisher Frederick Ryan speaks about his release from a Tehran jail in a prisoner swap this month, as he returns to his newspaper for the opening ceremony of the new headquarters of The Washington Post, Thursday, Jan. 28, 2016, in Washington. (AP Photo/J. Scott Applewhite)\nFreed Washington Post reporter Jason Rezaian, left, speaks with Secretary of State John Kerry, during an opening ceremony for the new headquarters of The Washington Post, Thursday, Jan. 28, 2016, in Washington. (AP Photo/J. Scott Applewhite)","url":"https://www.dailymail.co.uk/wires/ap/article-3421308/Freed-reporter-Rezaian-feted-paper-diplomat-Kerry.html"}
