{"authors":["Daily Mail Reporter"],"date_download":"2018-10-23 00:06:05","date_modify":"2018-10-23 00:06:05","date_publish":"2017-03-10 05:49:07","description":"It sounds almost too good to be true. Free flights are being offered to New Zealand for job seekers with IT skills. The move comes as officials grow desperate to boost the country's tech sector.","filename":"data/vaneerConsumption/FreeNewZealandtripsofferedtojobseekersintech.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/11/01/044D6269000003E8-0-image-a-6_1489196025113.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300074_Free-trips-New-Zealand-offered-100-tech-workers_1540253165.html","title":"Free New Zealand trips offered to job seekers in tech","title_page":"Free New Zealand trips offered to job seekers in tech | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It sounds almost too good to be true: A free trip to New Zealand to interview for a job in the tech sector.\nBut that's what local authorities and businesses in the capital, Wellington, are offering to 100 talented workers from around the globe as they seek to boost the city's growing tech hub.\nThe idea has caught fire, with 12,000 people completing applications so far and thousands more registering interest ahead of the March 20 deadline.\nMore than 12,000 job seekers have completed applications for 100 posts in New Zealand\nWellington Mayor Justin Lester said the city's tech sector has been growing at an annual rate of 14 percent over the past five years.\nHe said: 'The problem we need to solve is that we have a whole lot of businesses that are struggling to keep up with recruitment.'\nThe LookSee campaign was first promoted in tech hubs like San Francisco, which is more than 10,000 kilometers (6,000 miles) from Wellington.\nAbout one-third of the applicants are from the U.S. but that mix is changing as more people from other parts of the world find out about the offer, said David Jones, who is helping oversee the campaign at the Wellington Regional Economic Development Agency.\nTech developer Nick Piesco moved to New Zealand from Austin, Texas to work for an online accounting software company\nMr Jones said: 'This is the first time a city has approached recruitment in this way. We've been absolutely amazed at the level of interest.'\nSuccessful applicants get free flights to New Zealand and free accommodation during their four-day stay in Wellington. They also get to see some of the sights and meet tech leaders. They are expected to apply for three jobs each but aren't obliged to accept any offers.\nThe 850,000 New Zealand dollar ($588,000) cost of the campaign is paid for by a combination of taxpayer money and contributions from local businesses.\nNick Piesco, 40, moved to Wellington from Austin, Texas, two weeks ago to take a job as a developer at Xero, an online accounting software company.\nHe said his wife Reneau Skinner had loved Wellington when she visited more than a decade ago for an eight-month working holiday and that they made the decision to move to the city before the LookSee offer.\nHe said people in New Zealand seemed to really value having a life outside of work and that he was making some life changes, including foregoing a car.\nNick Piesco has only been in New Zealand for two weeks but has already fallen in love with the country\nHe said: 'I can walk to work, I can walk to the shops. I live between two breweries, so I think I'm pretty well situated.\n'The fact that you live in such a beautiful city in such a beautiful country means that you are urged to get outside and enjoy it.'\nPiesco added said the timing of his move soon after President Donald Trump was elected was 'coincidental but fortuitous.'","url":"https://www.dailymail.co.uk/news/article-4300074/Free-trips-New-Zealand-offered-100-tech-workers.html"}
