{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:07:40","date_modify":"2018-10-30 19:07:40","date_publish":"2016-01-26 15:03:39","description":"Fearful of violating his \"draconian\" parole, Jonathan Pollard abstained from addressing the Conference of Presidents of Major American Jewish Organizations.","filename":"data/vaneerConsumption/FreedSpyPollardUnabletoGiveFirstSpeechin30YearsDuetoDraconianParoleConditions.json","image_url":"https://media.breitbart.com/media/2016/01/Jonathan-Pollard.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_26__1540926460.html","title":"Freed Spy Pollard Unable to Give First Speech in 30 Years Due to Draconian Parole Conditions","title_page":"Freed Spy Pollard Unable to Give First Speech in 30 Years Due to Draconian Parole Conditions","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Fearful of violating his “draconian” parole, abstained from giving an address at the Conference of Presidents of Major American Jewish Organizations on Monday, JTA reported.\nAaron Troodler, a spokesman for the group Justice for Jonathan Pollard, said Pollard briefly introduced himself at the off-record gathering, before asking his wife, Esther, to read from his notes. News of the meeting was leaked to the Forward newspaper.\nThe speech would have been the first Pollard had given in over 30 years since his incarceration for spying on behalf of Israel.\nAccording to Troodler, Pollard’s lawyers feared that anything more than a few remarks could be used against the paroled former spy and send him back to jail.\n“He was unable to present his address at this historic event because of his Draconian parole conditions,” Troodler said.\nEsther Pollard described her husband’s parole conditions as “not only prevent[ing him] from working and from exercising his religious rights, but also effectively prevent him from ever reintegrating into society.”\nEsther also revealed that Israeli President Reuven Rivlin handed President Barack Obama a letter regarding Pollard’s parole conditions during a White House meeting last month. Although activists are working on Pollard’s behalf by lobbying Washington to allow him to emigrate to Israel, the White House has indicated that President Barack Obama would not intervene.\nPollard’s five-year parole includes wearing an electronic ankle bracelet with GPS tracking and surveillance of his and any employer’s computers. He is also sequestered in his New York home between the hours of 7 p.m. and 7 a.m., a demand that Pollard’s attorneys have argued interferes with his ability to properly observe the Jewish Sabbath and certain holidays, in addition to making it more difficult to find a job.\nA statement from the Justice for Jonathan Pollard group emailed to Breitbart Jerusalem reads:\n“Participants of the Conference were deeply dismayed to learn that even if all of the severe Parole restrictions were removed Pollard still has 15 years (the balance of a 45 year life sentence) hanging over his head, and he will always be at risk of being thrown back into prison, for any reason, including political ones regarding Israel. In Esther Pollard’s presentation, Jonathan Pollard’s parole conditions and the unjust restrictions were fully explained and a lot of myths were exploded including the media buzz claiming that Jonathan has a new Shabbat observant GPS device. This is simply not true.”","url":"https://www.breitbart.com/national-security/2016/01/26/freed-spy-pollard-unable-to-give-first-speech-in-30-years-due-to-draconian-parole-conditions/"}
