{"authors":[],"date_download":"2018-10-22 21:14:16","date_modify":"2018-10-22 21:14:16","date_publish":"2014-06-04 06:49:07","description":"The 17-minute video shows a clean-shaven Bergdahl, dressed in white, sitting in a silver pick-up truck prior to his release.","filename":"data/vaneerConsumption/FreedomWatchtheDramaticMomentTalibanReleasedBoweBergdahl.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/486296/140604-bergdahl-jsw-822a_e273f9afd7881df8bf38b1e069317749.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_freedom-watch-dramatic-moment-taliban-released-bowe-bergdahl-n122006_1540242856.html","title":"Freedom: Watch the Dramatic Moment Taliban Released Bowe Bergdahl","title_page":"Freedom: Watch the Dramatic Moment Taliban Released Bowe Bergdahl ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Taliban released a video Wednesday showing the moment former prisoner Bowe Bergdahl was handed over to American custody.\nThe 17-minute video, sent to NBC News by a known Taliban spokesman, shows both sides quickly shaking hands before a clean-shaven Bergdahl is handed over.\nA misspelled message later flashes on the screen, bearing a warning: \"Don' come back to afghanistan.\"\nPentagon spokesman RADM John Kirby told NBC News there was \"no reason to doubt the authenticity\" of the clip.\n\"U.S. officials are currently reviewing the video, but our focus right now is in getting Bergdahl the care he needs,\" Kirby said.\nStaff Sgt. Bergdahl, who was held captive for five years, was released Saturday in exchange for five high-ranking Taliban militants held by the U.S. at Guantanamo Bay.\nThe swap was criticized by members of Congress who say that the Obama administration violated the law by failing to inform Congress of the move in advance. Some lawmakers say the decision to transfer Guantanamo detainees amounts to \"negotiating with terrorists.\"\nBergdahl remains at the U.S. military hospital in Landstuhl, Germany undergoing physical and psychological treatment.\nIn the video released by the Taliban, Bergdahl is shown in white local dress, appearing to blink in the bright light.\nAs a helicopter comes in for a landing, Bergdahl is brought out of the truck to wait, standing and clutching a plastic bag. Armed men dot the hillside above him.\nBergdahl is then led by two escorts - one of them waving a white flag - to greet three other men who have emerged from the helicopter in what appears to be civilian clothing.\nQuick handshakes are exchanged and Bergdahl is patted down. One of the soldier's new escorts flashes a thumbs up to the waiting helicopter, which has soldiers inside.\nBergdahl is frisked again, his plastic bag discarded, and he is then loaded into the chopper.The entire apparent transfer - from helicopter landing to take off - takes just over one minute.\nThe video was also distributed on social media.\nIn the video, a Taliban commander discusses how the transfer was arranged, saying that local tribal elders had been approached to help negotiate with the U.S. and select a location for the handoff that would guarantee security.\nThe Americans were informed about the 18 armed militants who would be present on the hilltops and had asked questions about Bergdahl’s health and even facial hair before the swap, the commander adds.\nThe commander also noted that the U.S. had requested that a green light be carried to the meet, but that it was difficult to find one so a white flag was used instead.\n- Alastair Jamieson contributed to this report.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/freedom-watch-dramatic-moment-taliban-released-bowe-bergdahl-n122006"}
