{"authors":[],"date_download":"2018-10-22 21:45:40","date_modify":"2018-10-22 21:45:40","date_publish":"2014-06-06 14:08:15","description":"\"Noorullah Noori kept insisting he would go to Afghanistan and ‎fight American forces there,” a Taliban commander told NBC News.","filename":"data/vaneerConsumption/FreedTalibanCommanderTellsRelativeHellFightAmericansAgain.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/479516/140531-mullah-norullah-noori-1649_9108cdae0d1cd836cad174ea13ab82af.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_freed-taliban-commander-tells-relative-hell-fight-americans-again-n124451_1540244740.html","title":"Freed Taliban Commander Tells Relative He'll Fight Americans Again","title_page":"Freed Taliban Commander Tells Relative He'll Fight Americans Again","title_rss":"NULL","source_domain":"nbcnews.com","text":"The news comes amid a fierce debate on Capitol Hill over whether the Obama administration should have traded Bergdahl for the five commanders held at Guantanamo. Former members of Bergdahl’s platoon have described him as a deserter who walked away from his outpost.\nAmong the Taliban, the commanders’ release was treated as a victory.\n\"We thought we may not see them again as once you land in the hands of Americans, it's difficult to come out alive,” Noori’s relative said. “But it was a miracle that Allah Almighty gave us Bergdahl and we got back our heroes.”\nAll of the five -- Mohammad Fazl, Mohammed Nabi, Khairullah Khairkhwa, Abdul Haq Wasiq and Noori – were suffering from bad health after their imprisonment and currently being treated in a hospital in Qatar, the relative added.\nA senior Taliban commander in the Pakistani city of Quetta said that 12 years of incarceration had also caused some psychological problems for Noori and Fazl.\nNoori's relative admitted he was having some health issues, but denied he was suffering from any mental disorders.\nThe commanders’ families would soon be traveling to Qatar as well, the relative added.\n\"The wives and children will go there after their travel documents are received. Beside Mullah Fazal, who had two wives, the others have one wife each. They have spoken to us on telephone and seemed very excited,\" according to the relative.\nA relative of Khairkhwa, who also spoke to NBC News from Afghanistan, said he had spoken to his freed family member and been told Qatari government officials had greeted the group upon their arrival on Sunday.\nThe relative said a statement of support from the Taliban's leadership pleased the freed commanders.\n\"The most important thing for them was the statement of Mullah Mohammad Omar and congratulations them upon their release. Khairkhwa told me that like him, the remaining people forgot their years of imprisonment and ordeals after they came to know about Mullah Omar's statement,\" his relative said.\nThe Taliban commander in Quetta said he was in touch with his men in Qatar and they decided not to talk with the five commanders about their imprisonment and their treatment at the hands of the Americans.\n\"We decided not to disturb them by asking them about their ordeals as we know it will evoke the worst of their time in prison,” the Taliban commander said. “It will take them some time to become normal and issue formal statements.”","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/freed-taliban-commander-tells-relative-hell-fight-americans-again-n124451"}
