{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:17:37","date_modify":"2018-10-30 18:17:37","date_publish":"2016-07-24 19:35:26","description":"Employees walking into Twitter's offices in Los Angeles tomorrow will be greeted by a giant #FreeMilo chalk slogan on the sidewalk.","filename":"data/vaneerConsumption/FreeMiloChalkSloganAppearsOutsideTwittersLAOffice.json","image_url":"https://media.breitbart.com/media/2016/07/image6-Cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_24__1540923457.html","title":"'Free Milo' Chalk Slogan Appears Outside Twitter's LA Office","title_page":"'Free Milo' Chalk Slogan Appears Outside Twitter's LA Office | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Employees walking into Twitter’s offices in Los Angeles tomorrow will be greeted by a giant #FreeMilo chalk slogan on the sidewalk in front of their front entrance — the latest in a string of pro-Milo chalkings following the platform’s permanent ban of the Breitbart Tech editor.\nThe chalkings appeared in rainbow colours outside Twitter’s offices in Santa Monica, Los Angeles. Although chalked #FreeMilo slogans have appeared elsewhere — the first incident was at UC Irvine, where the College Republicans called on Milo fans across the country to follow their example — this is the first to take place at Twitter, which maintains offices in multiple locations across the U.S. and around the world.\nIt’s unclear who’s behind the latest slogan-writing incident, although another #FreeMilo slogan was reported just 40 minutes drive away, at the Walk of Fame in Hollywood. Someone commandeered one of the Boulevard’s vacant brass stars to chalk “#FreeMilo,” as well as a Twitter logo.\nYesterday, we also reported on a pro-free speech Muslim family in Nebraska who chalked “Free Milo” on the side of their family mosque.\nIt seems the second chalkening is upon us.\nYou can follow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/social-justice/2016/07/24/freemilo-chalk-appears-outside-twitter-hq/"}
