{"authors":["Breitbart London"],"date_download":"2018-10-30 20:38:06","date_modify":"2018-10-30 20:38:06","date_publish":"2015-01-09 12:35:03","description":"Police stormed a Jewish supermarket in East Paris in a burst of explosions just minutes after colleagues ended another siege in North Paris, with three of |","filename":"data/vaneerConsumption/FrenchPoliceEndKosherStoreSiegeTerroristandFourHostagesKilled.json","image_url":"https://media.breitbart.com/media/2015/01/Hostage-Suspect.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_01_09__1540931886.html","title":"French Police End Kosher Store Siege: Terrorist and Four Hostages Killed","title_page":"French Police End Kosher Store Siege: Terrorist and Four Hostages Killed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Police stormed a Jewish supermarket in East Paris in a burst of explosions just minutes after colleagues ended another siege in North Paris, with three of four terrorists killed so far.\nNew reports now indicate four hostages and one gunman have been killed in the supermarket.\nThe two terrorists takers had threatened to execute their five captives if Said Kouachi and Cherif Kouachi are not allowed to go free from the north Paris printworks where they were under siege and holding one hostage. After an apparently violent end to the first siege, police have entered the supermarket. Press images show the front door of the supermarket being breached in a series of yellow explosions as the security forces streamed in.\nIt was reported this afternoon that two had already been killed in a shoot-out at the Kosher shop, but that version of events is now being challenged and it may be that there have not yet been any civilian deaths in this particular siege.\nFrench authorities have confirmed the dead terrorist is the same man who committed the Thursday murder of a policewoman in the South of Paris, and the incident, which took place in the 11th arrondissement (district), is just streets away from the offices of Charlie Hebdo.\nKilled by police was North African heritage Amedy Coulibaly, 33. He is believed to belong to the same jihadi group as the brothers who attacked Charlie Hebdo on Wednesday, and may have even received training from Al-Qaeda himself.\nThe second suspect has been named as 26 year-old Hayat Boumeddiene, about whom less is known.\nThey were believed to be armed with an AK-47 and another firearm that has yet to be identified.\nThe situation in Paris is now so tense it is reported French police officers are walking with their handguns un-holstered, and Kosher restaurants closed early for the day, fearful of further attacks against the many Jews in the city.\nThere are now so many armed French police officers deployed to respond to the incidents and protect against further attacks, many have been seen carrying heritage carbine rifles dating back to the Second World War.\nFrench media reported another developing situation at the Trocadero centre near to the Eiffel Tower in central Paris, but it has now understood to be a false alarm.","url":"https://www.breitbart.com/europe/2015/01/09/breaking-another-paris-shooting-reported/"}
