{"authors":[],"date_download":"2018-10-30 21:13:43","date_modify":"2018-10-30 21:13:43","date_publish":"2015-12-24 19:42:43","description":"French immigration to Israel reached a record high in 2015, Israeli officials said Thursday, citing \"physical insecurity and financial uncertainty\" as main driving forces","filename":"data/vaneerConsumption/FrenchImmigrationtoIsraelReachedRecordHighIn2015.json","image_url":"https://media.breitbart.com/media/2015/12/GettyImages-500439158.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_24__1540934023.html","title":"French Immigration to Israel Reached Record High In 2015","title_page":"French Immigration to Israel Reached Record High In 2015","title_rss":"NULL","source_domain":"breitbart.com","text":"French immigration to Israel reached a record high in 2015, Israeli officials said Thursday, citing “physical insecurity and financial uncertainty” as main driving forces.\nAround 8,000 French Jews were expected to have arrived over the course of the year, a spokesman for Israel’s immigration ministry told AFP, noting it would be an “all-time record”.\nFinal data for 2015 was not available yet.\nFrance’s Jewish community is estimated at between 500,000 and 600,000 people, the largest in Europe and one of the largest in the world.\nIn January, after four Jews were murdered in an attack on a kosher supermarket in Paris, Israeli Prime Minister Benjamin Netanyahu issued an invitation to French and European Jews to emigrate.\nFrench immigration to Israel this year rose by 10 percent compared with 2014, according to the Jewish Agency, a semi-official organisation that oversees Jewish immigration to the country.\n“That growth is expected to continue for the foreseeable future,” Jewish Agency spokesman Avi Mayer said.\n“A growing sense of physical insecurity and financial uncertainty” were the main reasons behind French Jewish emigration, he said.\n“Strong and longstanding ties between French Jewry and the Jewish state and the sense that Israel will afford them opportunities for a brighter future” led them to choose Israel, he said.\nImmigration to Israel in 2015 was expected to hit a 15-year high with 30,000 Jewish newcomers, the Jewish Agency said.\nOf these, 7,300 were projected to arrive from Ukraine, 7,100 from Russia and Belarus, and another 3,500 from North America, it said.\nIsrael has a policy know as aliyah, which encourages Jews from around the world to emigrate to the country. Since Israel was founded in 1948, more than three million people have done so.\nThe country has an estimated population of 8.4 million, the Central Bureau of Statistics reported in September, of which some 75 percent are Jews.","url":"https://www.breitbart.com/europe/2015/12/24/french-immigration-to-israel-reached-record-high-in-2015/"}
