{"authors":[],"date_download":"2018-10-23 04:37:45","date_modify":"2018-10-23 04:37:45","date_publish":"2016-01-29 20:20:26","description":"An influential French news magazine Friday removed a cartoon of a revered Senegalese Muslim leader that sparked outrage in the west African nation in a row i...","filename":"data/vaneerConsumption/FrenchmagscrapscartooninSenegalrowonIslamhandbagsandgays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i4j7-4PuZeKVXE7cd9005b2c876df8246-685_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423311_French-mag-scraps-cartoon-Senegal-row-Islam-handbags-gays_1540269465.html","title":"French mag scraps cartoon in Senegal row on Islam, handbags and gays","title_page":"French mag scraps cartoon in Senegal row on Islam, handbags and gays | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"French mag scraps cartoon in Senegal row on Islam, handbags and gays\nAn influential French news magazine Friday removed a cartoon of a revered Senegalese Muslim leader that sparked outrage in the west African nation in a row involving Islam, handbags and homosexuality.\nThe row erupted after Jeune Afrique published a story and an illustration on its website Thursday including a caricature of Sheikh Ahmadou Bamba, founder of the Mouride Brotherhood, triggering a wave of protests which forced the magazine to take the offending article down.\n\"We do not accept that a person as illustrious as Sheikh Ahmadou Bamba should be brought into this type of debate,\" Senegalese government spokesman Seydou Gueye told RFM, a private radio station.\nA mural on the streets of Dakar, Senegal shows a depiction of revered Senegalese Muslim leader and founder of the Mourides Brotherhood, Sheick Ahmadou Bamba ©Seyllou (AFP/File)\n\"We cannot accept the dissemination of such a degrading article,\" he said. \"The government has expressed its indignation in the strongest possible way and firmly condemns this article.\"\nMouride spokesman Serigne Bassirou Mbacke Abdoul Khadre, who is based in Senegal's second largest city Touba -- the Brotherhood's spiritual home -- had denounced the article as an attack on Bamba and his followers, several newspapers reported Friday.\n\"The disciple who sees his master attacked could have an unpredictable reaction,\" he warned.\nThe illustration was published with an article about a controversy in Senegal over men carrying handbags following a new fashion trend sparked by a young singer called Wally Seck.\nBut the fad has been widely criticised, with some critics even suggesting it was promoting homosexuality, which is illegal in this country of 14 million people, most of whom are Muslim.\nIn the article, which ran under a cleverly-worded French headline that plays on the word handbag and loosely translates as \"It's all fun and games until somebody gets hurt\", the magazine used a caricature of a westerner smoking a cigar and looking at a photo of Bamba in a traditional long robe, remarking: \"Hey, why's he wearing a dress?\"\n- A profuse apology -\nThere was an immediate backlash on social media sites in Senegal, with Jeune Afrique quickly changing the cartoon to show a man in a long African robe.\nBy Friday, clicking on the article linked to a message from editor-in-chief, Elise Colette, offering the magazine's \"sincere apology\" and saying that in light of the backlash, she had \"decided to take down the cartoon and the accompanying text.\"\n\"With this drawing, our intention was not to insult anyone, and certainly not to harm the image of Sheikh Ahmadou Bamba who is venerated by many followers, but to expose the stupidity of those who cannot differentiate between a caftan and a dress,\" she wrote.\nNinety percent of Senegal's population is Muslim, most following Sufi Islam represented by different brotherhoods which emerged at the end of the 19th century out of resistance to French colonialism.\nThe Mouride brotherhood, founded by Bamba in 1883, is one of the most powerful and its influence pervades all areas of Senegalese life, including politics and the economy.\nBoth President Macky Sall and his predecessor Abdoulaye Wade are members of the Mouride Brotherhood, and many of its members live in the United States and in Europe.\nThe government said it \"noted the apology by Jeune Afrique\", and stressed that Sheikh Ahmadou Bamba \"is a national symbol\".\nDakar \"will take all necessary measures to protect our historical figures, respect for our religious values and beliefs,\" the spokesman said.","url":"https://www.dailymail.co.uk/wires/afp/article-3423311/French-mag-scraps-cartoon-Senegal-row-Islam-handbags-gays.html"}
