{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:04:44","date_modify":"2018-10-30 23:04:44","date_publish":"2014-08-14 12:40:29","description":"Ever since Khloe Kardashian started dating French Montana, their relationship has been rife with cuteness and controversy. For every time we hear how happy Montana is making Kardashian, there are several times in which we're hearing that Kris Jenner…","filename":"data/vaneerConsumption/FrenchMontanasDontPanicMusicVideoTakesRelationshipwithKhloeKardashiantoaCriminalLevelVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/debc17ef-05ed-415e-b5f0-b65aee34d783.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35735-french-montanas-dont-panic-music-video-takes-relationship-with-khloe-kardashian-to-a-criminal-level_1540940684.html","title":"French Montana's \"Don't Panic\" Music Video Takes Relationship with Khloe Kardashian to a Criminal Level - VIDEO","title_page":"French Montana's \"Don't Panic\" Music Video Takes Relationship with Khloe Kardashian to a Criminal Level — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Ever since Khloe Kardashian started dating French Montana, their relationship has been rife with cuteness and controversy. For every time we hear how happy Montana is making Kardashian, there are several times in which we're hearing that Kris Jenner hates him, that they've broken up, or that they're posing with guns for fun. Okay, so that last thing is a real thing that actually happened, but it turns out that we all jumped the gun (pun intended) on criticizing Kardashian and Montana for that stunt. Montana's latest music video is called \"Don't Panic\" and it features Kardashian as his partner in crime in Purge-like set up that makes that infamous Instagram photo look very tame in comparison.\nThe fact that the guns and masks that Kardashian and Montana were sporting in the pictures were from Montana's music video set didn't make their glamorization of guns any less disturbing. However, \"Don't Panic\" is on a whole new level of disturbing. The video opens with a woman tied to a chair and screaming her head off while a man creepily gets all up in her personal space. We then see a gang of clown-mask wearing people brandishing weapons like crossbows, guns, and axes intercut with clips of Montana rapping by himself.\nThe end of the music video reveals that it was all just a prank or a joke, with the screaming woman untying herself with a laugh, but I'm not really sure I get the humor here. Who exactly were they trying to prank? Why did their prank involve setting a car on fire? Could those masks get any more creepy?\nIn all honestly, the only good part of the music video is when Kardashian and Montana unmask themselves and start laughing because they look so happy together that you can truly tell that their relationship is going great for both of them. I'm still puzzled by the rest of the video, but I'm just happy that it's not actually about Kardashian and Montana kidnapping and assaulting a woman. I guess.\nCheck out the video below.\nFrenchMontanaVEVO on YouTube\nImage: YouTube","url":"https://www.bustle.com/articles/35735-french-montanas-dont-panic-music-video-takes-relationship-with-khloe-kardashian-to-a-criminal-level"}
