{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 23:04:21","date_modify":"2018-10-30 23:04:21","date_publish":"2016-12-08 00:00:00","description":"France's chief financial regulator said some international banks are in the process of opening up new subsidiaries in Paris in the wake of Brexit.","filename":"data/vaneerConsumption/FrenchAMFchiefsaidbanksareopeningupinParispostBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_french-amf-chief-said-banks-are-opening-up-in-paris-post-brexit-2016-12_1540940661.html","title":"French AMF chief said banks are opening up in Paris post-Brexit","title_page":"    French AMF chief said banks are opening up in Paris post-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"La Défense, Paris. pisaphotography / Shutterstock France's chief financial regulator said some international banks are already in the process of opening up new subsidiaries in Paris in the wake of Brexit.\nBig financial firms are carrying out the due diligence needed to shift some operations from London to the French capital, Benoit de Juvigny, secretary general of the AMF, France's markets regulator, told the BBC.\nIt's not just banks. De Juvigny added that \"many other companies\" have started to consider Paris as a base of European operations as London braces for the impact of Brexit.\nDe Juvigny said his department would expand to cope with the added demand.\nFinancial officials in London are concerned that leaving the European Union will leave banks headquartered in the UK without tariff-free access to the single market of 27 continental states.\nThe so-called financial passport has allowed London's financial centre to act as a hub for global firms looking to do business in the EU and the current Conservative government does not look likely to fight for it during Brexit negotiations.\nThe Daily Telegraph reported on Monday night that Chancellor Philip Hammond and Brexit Secretary David Davis told a group of 10 City bosses that they wouldn't be given any special treatment during the Brexit process.\nAnthony Browne, the chief of the British Bankers Association, told a conference attended by Business Insider last week: \"All the banks that have any operations across Europe are doing contingency planning,\" in case Britain's financial passporting rights are lost.\nIn September, the chief of Germany's Bundesbank, Jens Weidmann, warned that the UK won't get a special deal from the EU on the passports and will need to allow free movement of citizens from EU nations if it wants to maintain the right.","url":"https://www.businessinsider.com/french-amf-chief-said-banks-are-opening-up-in-paris-post-brexit-2016-12"}
