{"authors":["Mary Chastain"],"date_download":"2018-10-30 20:50:58","date_modify":"2018-10-30 20:50:58","date_publish":"2015-01-09 15:50:54","description":"French authorities classified the death of police officer Clarissa Jean-Philippe, 25, a terrorist attack. The shooting is France’s second terrorist attack within a span of 24 hours. Two gunmen slaughtered twelve people at Charlie Hebdo headquarters on Wednesday as they screamed, “Allahu Akbar!” Even though both are considered terrorist attacks, authorities did not initially link the attacks, though reports are now surfacing that the three suspects may be related. |","filename":"data/vaneerConsumption/FrenchPoliceClassifiedSecondPoliceShootingasTerroristAttack.json","image_url":"https://media.breitbart.com/media/2015/01/Sky19a.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_09__1540932658.html","title":"French Police Classified Second Police Shooting as 'Terrorist Attack'","title_page":"French Police Classified Second Police Shooting as 'Terrorist Attack' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"French authorities classified the death of police officer Clarissa Jean-Philippe, 25, a terrorist attack. The shooting is France’s second terrorist attack within a span of 24 hours. Two gunmen slaughtered twelve people at Charlie Hebdo headquarters on Wednesday as they screamed, “Allahu Akbar!” Even though both are considered terrorist attacks, authorities did not initially link the attacks, though reports are now surfacing that the three suspects may be related.\nOn her fifteenth day on the job, Jean-Philippe responded to a car accident at 8AM local time. A Renault Clio was involved, which is a car the Charlie Hebdo murderers used on Wednesday. Upon her arrival, a man opened fire and she died immediately.\n“The municipal policewoman cut down this morning was a credit to the nation,” mourned French Prime Minister Manuel Valls.\nAhmed Sassi, 38, witnessed the incident from his kitchen window. He told authorities it was “a scene of panic” and he saw “[A] man with dark clothes shot them at point blank range while continuing to run.” Authorities believe the gunman used an M5 rifle. The gunmen also shot a street sweeper in the face, who is currently in serious condition.\n‘It didn’t look like a big gun because he held it with one hand,’ Sassi recounted.\nThe gunfire woke up 19-year-old William Thomas.\n“I was woken up by the first three shots,” he said. “Then I heard someone shout ‘Take that’ and there were another two shots. It was before 8am.”\nOfficers arrested two men in connection to the murder late Thursday night.\n“Two men have been detained, but we can’t at this stage confirm whether it is the author of the shooting,” confided an anonymous source to Le Parisien.\nThe Telegraph reports the police union “called for the arming of all municipal police.” Jean-Philippe and the two officers killed at Charlie Hebdo were not armed.","url":"https://www.breitbart.com/national-security/2015/01/09/french-police-classified-second-police-shooting-as-terrorist-attack/"}
