{"authors":["Associated Press"],"date_download":"2018-10-23 02:59:54","date_modify":"2018-10-23 02:59:54","date_publish":"2017-03-16 13:34:28","description":"PARIS (AP) - A 16-year-old student who had troubled relations with his peers opened fire at a high school in southern France on Thursday, wounding three...","filename":"data/vaneerConsumption/Frenchschoolshooting4shot10hurtstudentarrested.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/00/wire-231471-1489710262-82_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320280_Student-arrested-shots-fired-French-high-school_1540263594.html","title":"French school shooting: 4 shot, 10 hurt, student arrested","title_page":"French school shooting: 4 shot, 10 hurt, student arrested | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PARIS (AP) - A 16-year-old student who had troubled relations with his peers opened fire at a high school in southern France on Thursday, wounding three other students and the principal who tried to intervene, officials said.\nPolice moved into the Alexis de Tocqueville school in the town of Grasse - the country's picturesque perfume capital - and quickly arrested the still-armed suspect, identified by the Interior Ministry spokesman as Killian Barbey.\nThe government minister for victims' affairs, Juliette Meadel, told BFM television there were 4 people shot -three students and the high school principal - and 10 other victims.\nA police car blocks a road after an attack in a high school in Grasse, southern France, Thursday, March 16, 2017. An armed high school student was arrested and police fanned out around a picturesque perfume capital in southern France after a school shooting that left at least two wounded. (AP Photo/Philippe Farjon)\nThe Grasse prosecutor said some of the victims were suffering from \"emotional shock.\" None of the injuries was considered life threatening.\nProsecutor Fabienne Atzori said the young man - armed with a rifle, several pistols and a small grenade - entered a classroom then left, \"not finding the person or people he was searching for.\"\n\"The motivation of the student appears linked to bad relations with other students in this high school in which it appears he had some difficulty integrating,\" Atzori said.\nShe said there was no reason to suspect the shootings were terrorism-related, \"whatever the origin of the terrorist enterprise.\" A national police official said earlier there did not appear to be any other suspects.\nInvestigators were now trying to find out where did the suspect get the arms, she said.\nOfficials variously gave 16 and 17 as the age of the suspect. His Facebook page indicates he is 16.\nAfter the suspect started shooting, students alerted the principle, who was wounded while \"courageously\" intervening, the prosecutor said. Some students only discovered shrapnel in their bodies once home, she said.\nEducation Minister Najat Vallaud-Belkacem, who visited the school Thursday, called it \"the crazy act of a fragile young man fascinated by firearms ... We just missed the worst.\"\nThe suspect's Facebook is filled with violent or gory images.\nDuring the attack, some students hid at the school and others were evacuated. A police helicopter circled overhead in what is normally a relatively quiet corner of France.\nPolice cordoned off the area and worried residents gathered outside in the town, which is 40 kilometers (25 miles) from the southern city of Nice, site of last year's Bastille Day terror attack that killed 86 people.\nThe president of the region, Christian Estrosi, said the principal suffered an arm wound and told him that after being alerted to the presence of the armed student, \"he tried to interpose ... to try to calm him, and unfortunately he didn't succeed.\"\nStudent Charlotte Camel, 18, told The Associated Press she was in the school library when \"a teacher ran into the room shouting, 'There's someone with a gun, go hide!' That's what we did from the very beginning.\"\n\"We all very much panicked. I thought a lot about the other students in my class who were in class and I wandered if they were ok. I thought about my friends and the teachers too,\" Camel said.\nThe attack came amid France's state of emergency, a response to a string of deadly Islamic extremist attacks over the past two years.\nWhile no terrorism link has been identified, \"all this justifies the state of emergency,\" President Francois Hollande said, adding that it would remain in place until July 15, as planned.\nThe government sent out an alert warning of an attack after police reported that shots were fired, but later lifted it. The alert is part of a system implemented by the government after the deadly November 2015 attacks in Paris.\n___\nAngela Charlton and Lori Hinnant in Paris, Alexander Turnbull in Grasse, and Raphael Satter in London contributed.\nA French police message alert is displayed cell phone in Paris, France, Thursday, March 16, 2017. The French government has sent out an alert warning of an attack at the Alexis de Tocqueville high school in the southern French town of Grasse after local police reported that shots have been fired. (AP Photo)\nA French police message alert is displayed on a cell phone in Paris, France, Thursday, March 16, 2017. The French government has sent out an alert warning of an attack at the Alexis de Tocqueville high school in the southern French town of Grasse after local police reported that shots have been fired. (AP Photo)\nIn this image from TV, Police cordon off the area as people gather to view the nearby high school, following a shooting in Grasse, southern France, Thursday March 16, 2017. According to officials, an armed high school student attacked at the Alexis de Tocqueville high school in the town of Grasse, France. At Least two people are known to be injured. (BFM via AP)\nPolice officers take position after an attack in a high school student in Grasse, southern France, Thursday, March 16, 2017. An armed high school student was arrested and police fanned out around a picturesque perfume capital in southern France after a school shooting that left at least two wounded. (AP Photo/Philippe Farjon)","url":"https://www.dailymail.co.uk/wires/ap/article-4320280/Student-arrested-shots-fired-French-high-school.html"}
