{"authors":[],"date_download":"2018-10-30 20:47:02","date_modify":"2018-10-30 20:47:02","date_publish":"2015-11-16 08:47:36","description":"French police raided homes of suspected Islamist militants across the country overnight in the aftermath of the Paris shootings.","filename":"data/vaneerConsumption/FrenchPMWarnsOfMoreAttacksAsPoliceRaidSuspectedIslamistHomes.json","image_url":"https://media.breitbart.com/media/2015/11/Paris-police-evacuate-eiffel-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_16__1540932422.html","title":"French PM Warns Of More Attacks As Police Raid Suspected Islamist Homes","title_page":"French PM Warns Of More Attacks As Police Raid Suspected Islamist Homes","title_rss":"NULL","source_domain":"breitbart.com","text":"French police raided homes of suspected Islamist militants across the country overnight in the aftermath of the Paris shootings, French Prime Minister Manuel Valls said on Monday as he warned of potential further attacks.\nValls said that since this summer, French intelligence services had prevented five attacks.\n“We know that more attacks are being prepared, not just against France but also against other European countries,” Valls said on RTL radio.\nPolice sources told Reuters that authorities conducted at least 110 house searches in cities around France overnight. One of these searches, in the Paris suburb of Bobigny, was part of the judicial investigation into the attacks at a football stadium, bars and a concert hall and where at least 129 people died.\nThe death toll was put 132 on Sunday, but reports on Monday said that increase may have been a counting error.\nFrench media said police also raided houses in Toulouse, Grenoble and Bobigny.\n“We are making use of the legal framework of the state of emergency to question people who are part of the radical jihadist movement…and all those who advocate hate of the republic,” Valls said.\nOn Friday, three coordinated teams of gunmen and suicide bombers carried out the wave of attacks across Paris in what President Francois Hollande called an “act of war” by Islamic State.","url":"https://www.breitbart.com/europe/2015/11/16/french-pm-warns-of-more-attacks-as-police-raid-suspected-islamist-homes/"}
