{"authors":[],"date_download":"2018-10-22 22:10:39","date_modify":"2018-10-22 22:10:39","date_publish":"2014-06-09 10:42:50","description":"Marine Le Pen said her father had been misinterpreted, but for him \"not to have foreseen how this phrase would be interpreted is a political mistake.\"","filename":"data/vaneerConsumption/FrenchFarRightsMarineLePenRebukesDadinAntiSemitismRow.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/495841/140609-marine-le-pen-father-626a_038df321a3f9fdc1c4a29371f5dc5af6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_french-far-rights-marine-le-pen-rebukes-dad-anti-semitism-n126026_1540246239.html","title":"French Far Right's Marine Le Pen Rebukes Dad in Anti-Semitism Row","title_page":"French Far Right's Marine Le Pen Rebukes Dad in Anti-Semitism Row","title_rss":"NULL","source_domain":"nbcnews.com","text":"But for an experienced politician like her father, she said, \"not to have foreseen how this phrase would be interpreted is a political mistake the National Front is (now) paying for.\"\nMarine Le Pen, who has made the FN more acceptable to voters by playing down some hardline traditions, led the party last month to first place in French voting for the European Parliament, the first time it has ever won a nationwide poll.\nFrench and European Jewish groups denounced her father's comments as anti-Semitic. Another prominent leader of the FN, speaking out before Marine Le Pen, said his attack was \"politically stupid and deplorable.\"\nThe controversy began on Friday with a video posted on the FN website in which Jean-Marie Le Pen lashed out at several celebrities - including U.S. singer Madonna, French comedian Guy Bedos and tennis star Yannick Noah - for expressing alarm that the party had swept 25 percent of the European Parliament vote.\nReminded by his interviewer that Jewish singer Patrick Bruel was among the critics, Le Pen chuckled and said: \"That doesn't surprise me. Listen, we'll do up a batch next time.\"\nLe Pen has often used subtle word play to hint at anti-Semitic views without clearly saying them. His word for \"batch\" - fournee - is a baking term that originally meant \"ovenful\".\nHe was convicted of inciting racial hatred in 1996 for saying the gas chambers used to kill Jews in the Holocaust were \"merely a detail in the history of the Second World War.\"\nBruel responded to his video with a tweet saying: \"J.M. Le Pen reoffends ... Did he need to remind us of his true face and that of the FN?\"\nMarine Le Pen told Le Figaro daily, in comments distributed before publication, that the assumption that her father's comments were anti-Semitic was a \"malicious interpretation\" but that the incident \"allows me to reiterate that the National Front most firmly condemns every form of anti-Semitism.\"\n- Reuters","url":"https://www.nbcnews.com/news/world/french-far-rights-marine-le-pen-rebukes-dad-anti-semitism-n126026"}
