{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:13:32","date_modify":"2018-10-30 21:13:32","date_publish":"2015-11-19 16:38:58","description":"French Jews are divided about their future as they face an ever-growing threat from radical Islam.","filename":"data/vaneerConsumption/FrenchJewsAskShouldWeStayOrShouldWeGo.json","image_url":"https://media.breitbart.com/media/2015/05/Poland-Anti-Semitism-APJedrzej-Wojnar.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_19__1540934012.html","title":"French Jews Ask: Should We Stay Or Should We Go?","title_page":"French Jews Ask: Should We Stay Or Should We Go?","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – French Jews are divided about their future as they face an ever-growing threat from radical Islam. Yet, for most, even the attacks that killed 129 people on Friday have not been sufficient for them to consider emigration.\nAnti-Semitic attacks were part and parcel of daily life well before last week’s attacks, with the latest occurring on Wednesday evening in the southern city of Marseilles, where IS supporters stabbed a Jewish teacher in the face.\nRabbi Tzion Saadoun, an openly religious Jew from the Chabad-Lubavitch community, was attacked outside his home, which is on the border between Marseilles’ Jewish and Arab neighborhoods.\nStill, others from the Chabad-Lubavitch community told The Times of Israel that the presence of IS terrorists in their own neighborhoods “will not affect the daily life of the Jewish community.”\nFollowing a police raid in the heavily Muslim neighborhood of Saint-Denis, local Chabad Rabbi Mendel Belinow said he was “not surprised at all” to learn that the suspected perpetrators of Friday’s attacks might be hiding out in his neighborhood, but he added that the news would not put a halt to the local Jewish community’s activities.\n“We are not suspending our activities and are preparing to celebrate Hanukkah as usual,” Belinow said. “It’s a difficult neighborhood that is no stranger to extremism.”\nMost French Jewish institutions resumed activities less than 24 hours after Friday’s massacre. This is in stark contrast to the aftermath of the Charlie Hebdo and Hyper Cacher attacks in January 2015, when many French institutions and businesses – Jewish and non-Jewish alike – remained closed for days.\nTimes of Israel reporter Cnaan Lipshiz notes that even though the November 13 attacks were much deadlier than January’s, the atmosphere in Paris was very different this time around. “Instead of a nation in suspense, I witnessed a life-goes-on attitude that I know from my native Israel — Tel Aviv especially,” said Lipshiz. “There, even the most horrific attacks typically have little effect on the daily routines of its drilled residents, who continue their outings to restaurants, weddings, and dance clubs.”\nAccording to Lipshiz, some French Jews suggested that, since January, Paris has become accustomed to living as normally as possible in the shadow of terrorism – much like Israel. Chief Rabbi of France Haim Korsia said in a sermon that French society “will rise up from its grief like American society rose up from the tragedy of 9/11, and like Israeli society, which never lay down” in the first place.\nDaniel, an immigrant to Israel who grew up in Paris and asked that his last name be withheld, had a slightly more cynical take. “Maybe if there would’ve have been 5,000 dead [from the latest attacks] Jews would think about moving, but this magnitude is just too small,” Daniel said in an interview with Breibart Jerusalem.\nDaniel contends that following the Hyper Cacher kosher supermarket shootings, Jews felt a strong urge to immigrate to Israel, but not this time around. “French people as a whole are going back to work much more quickly [this time] and life is continuing. With [regard] to the Jewish community, they don’t feel as attacked as last time. They are not specifically being targeted as Jews.”\nDaniel’s brother and sister-in-law live in Sarcelles, a poor suburb of Paris that is heavily populated with both religious Jews and Muslims. Daniel said that, following the Hyper Cacher attack, his sister-in-law Myriam felt very afraid and expressed a strong desire to move to Israel, which waned in the months that followed. Since last week’s attacks, the desire has not returned. “If she felt that for one moment her kids’ lives were in danger, of course she would leave straightaway. But for now they are going to school and everything is normal.”\nDaniel attributes part of this change in atmosphere to the government and the way terrorism has been handled by the media. Daniel claims that the media has made a conscious effort to play down the recent attacks. “French TV is not showing graphic videos like those we saw with Charlie Hebdo. There have even been efforts on the part of the government to make sure people remove graphic clips and pictures from social media.”\nDaniel further notes that the language used to describe the terrorists has changed. Whereas in January the media didn’t shy away from using the word “Islamist,” this time any reference to the attackers’ religion is conspicuously absent.\n“I keep watching French news, waiting for them to say ‘Muslim,’ but the only thing they keep saying is ‘radical’ and nothing else. In many ways, this is typically French. They try to understand [the terrorists] and not condemn very harshly. The humanist mentality in France is very strong, you can really feel it. They will not say Islam is bad. I even heard people say that the terrorists are also victims.”","url":"https://www.breitbart.com/europe/2015/11/19/french-jews-ask-stay-go/"}
