{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 18:31:11","date_modify":"2018-10-30 18:31:11","date_publish":"2017-02-21 08:26:37","description":"French police have raided the headquarters of Front National presidential candidate Marine Le Pen over \"fake job\" claims while she is currently on a trip to Lebanon.","filename":"data/vaneerConsumption/FrenchPoliceRaidOfficesofMarineLePen.json","image_url":"https://media.breitbart.com/media/2017/02/rsz_GettyImages-633999762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_21__1540924271.html","title":"French Police Raid Offices of Marine Le Pen","title_page":"French Police Raid Offices of Marine Le Pen","title_rss":"NULL","source_domain":"breitbart.com","text":"French police have raided the headquarters of Front National presidential candidate Marine Le Pen over “fake job” claims while she is currently on a trip to Lebanon.\nThe raid took place Monday afternoon at the Front National (FN) headquarters in Nanterre, Hauts-de-Seine in the suburbs of Paris. the raids are part of an investigation into an alleged “fake job” given to one of Ms Le Pen’s bodyguards using European Union (EU) funds. The FN condemned the raid in a statement released shortly after the operation Le Figaro reports.\n“For the second time there is a search of the same offices, concerning the same alleged facts, which confirms that the first search was unsuccessful,” the FN wrote.\nThe party added: “This is obviously a media operation whose sole purpose is to attempt to disrupt the smooth running of the presidential election campaign and to try to harm Marine Le Pen at the very moment when her candidacy has made a major breakthrough in voting intentions, especially for the second round.”\nLe Pen’s chances of winning the second round have vastly improved over the past week as her main rivals Francois Fillon and Emmanual Macron are marred by scandal. Fillon is under investigation for paying his wife 500,000 euros for a job some claim never existed, while Macron was heavily criticised for calling the colonisation of Algeria a “crime against humanity.”\nThe reason for the raid is a claim by Brussels investigators that Le Pen paid bodyguard Thierry Légier €41,500 (£35,350) in the last four months of 2011 claiming he was an EU parliamentary assistant. According to investigators, Légier could not be considered a parliamentary assistant because he resided in Paris and not Brussels, Strasbourg or Luxembourg where the three main EU offices are located.\nLe Pen is also accused of giving her French-based assistant Catherine Griset close to €298,000 over a six-year period from December 2010 to December 2016.\nThe European anti-fraud office (Olaf), has demanded that Le Pen must pay back the amount of €340,000, which the presidential candidate has refused. The money is currently being deducted per month from LePen’s MEP salary at a rate of €3,000 and all her expenses have been frozen.\nLe Pen has spoken out about the salary deductions saying: “I formally contest this unilateral and illegal decision taken by political opponents … without proof and without waiting for a judgment from the court action I have started.”\nThe investigation into the matter began on December 15th when a French court opened the judicial inquiry into the actions of the FN for potential employment fraud.\nThe raids came about as Le Pen is visiting Lebanon meeting with President Michel Aoun and Prime Minister Saad Hariri to talk about the migrant crisis and the Syrian civil war.\nLe Pen expressed her support for Syrian President Bashar al-Assad and also plans to meet with Christians in the region who have been the victims of persecution by radical Islamic groups.","url":"https://www.breitbart.com/europe/2017/02/21/french-police-raid-offices-marine-le-pen/"}
