{"authors":["Associated Press"],"date_download":"2018-10-23 00:43:46","date_modify":"2018-10-23 00:43:46","date_publish":"2016-01-28 14:49:04","description":"PARIS (AP) — Nicolas Sarkozy's lawyers asked France's highest court on Thursday to throw out evidence obtained through wiretaps of phone conversations betwee...","filename":"data/vaneerConsumption/FrenchtopcourthearscasecrucialtoSarkozysfuture.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420552_French-court-hears-case-crucial-Sarkozys-future_1540255426.html","title":"French top court hears case crucial to Sarkozy's future","title_page":"French top court hears case crucial to Sarkozy's future | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"French top court hears case crucial to Sarkozy's future\nPARIS (AP) — Nicolas Sarkozy's lawyers asked France's highest court on Thursday to throw out evidence obtained through wiretaps of phone conversations between the former French president and his main lawyer.\nIt is one of several legal cases in which the opposition leader's name has appeared, but the most potentially damaging to his political future. He's expected to seek the conservative nomination to run for president again next year.\nSarkozy is under preliminary charges for active corruption and influence-peddling based on information gleaned from the phone taps in 2013-2014. His lawyers have said they were carried out in breach of lawyer-client privilege.\nA lower court ruled the phone taps didn't break any laws, and Sarkozy appealed. The Court of Cassation heard the case Thursday and will rule on March 22. Sarkozy did not attend.\nHis phones were tapped as part of an investigation into suspected illegal financing of his successful 2007 presidential campaign. But conversations heard via the phone taps brought to light a completely new legal case.\nDuring Thursday's hearing, the lawyers also argued that the evidence gathered from the phone taps was illegally diverted from the initial investigation to launch a new one without specific authorization.\nProsecutor Francois Cordier asked the court to uphold the validity of nearly all the wiretapping, except for two minor phone taps, and therefore to rule the investigation was legal overall.\nWhile his name has been mentioned in many legal cases since 2010, Sarkozy has never been convicted of wrongdoing or been sent to trial.\nIf the court rules the wiretapping was legal, the preliminary charges against Sarkozy will stand in the legal case that has the greatest chances of seeing him put on trial in the near future.","url":"https://www.dailymail.co.uk/wires/ap/article-3420552/French-court-hears-case-crucial-Sarkozys-future.html"}
