{"authors":[],"date_download":"2018-10-30 21:12:19","date_modify":"2018-10-30 21:12:19","date_publish":"2016-10-20 21:22:00","description":"Twenty-six years before he shot and killed his wife, Tex McIver let loose his German Shepherds on three teens and fired shots into their car.","filename":"data/vaneerConsumption/FreshdetailsinearlierMcIvershooting.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/20/Images/newsEngin.16530222_Tex-McIver.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_fresh-details-earlier-mciver-shooting__1540933939.html","title":"Fresh details in earlier McIver shooting","title_page":"Police: Tex McIver loosed dogs on teens and fired shots at their car","title_rss":"NULL","source_domain":"ajc.com","text":"Twenty-six years before he shot and killed his wife, Claud “Tex” McIver let loose a pair of German Shepherds on three teens outside his DeKalb County home and fired several shots into their car, according to an investigative file reviewed by The Atlanta Journal-Constitution.\nThe AJC first reported the 1990 shooting incident on Tuesday. Law enforcement records released on Thursday by the DeKalb County district attorney provide fresh details in that case. The 68-page file was released in response to an AJC open records request.\nIn interviews with police, the teens described a frightening attack on Feb. 27, 1990 in which McIver shot twice into the air then fired at their red Ford Mustang, hitting the vehicle twice on the left side. McIver says he chased their car away from the cul-de-sac without firing a shot, records show.\nNo one was injured, though McIver, an Atlanta lawyer, was charged with three counts of aggravated assault, possession of a firearm in connection with a crime, and criminal damage to property. A grand jury found probable cause to indict him, but the case was dropped after the parties settled it privately.\nDetails of the 1990 shooting emerged as Atlanta police investigate another incident last month, which also involved McIver, a gun and a vehicle. On Sept. 25, Tex McIver shot his wife, Diane, as they rode in their SUV near Piedmont Park. He maintains the shooting was an accident. Diane McIver died early the next morning after being taken to Emory University Hospital on Clifton Road.\nThe McIvers were a prominent and well-connected Atlanta couple who donated tens of thousands of dollars to Republican candidates and causes. A top labor attorney, Tex McIver, 73, is the longtime vice chairman of the state’s Board of Elections. Diane McIver, 64, was president of Corey Airport Services based in Atlanta.\nAtlanta police told the AJC said they knew about the prior shooting.\nThe teens maintain they were sitting in the Mustang near Cravey Trail when McIver arrived home and turned loose two German Shepherds.\nMcIver, they said, pointed a gun at them, fired two shots into the air and then fired two shots that struck the car at close range as they drove past him, hitting a side panel near the gas tank and cracking the spoiler.\nOne teen, Kevin Blase, described to police the moment when the teens drove the car past McIver to leave the scene.\n“As we approached the gunman he was standing in front of my car with the gun pointed at my face,” said Blase in a written statement for the police. “He jumped to my side of the car and shot the back left side quarter panel of the car.”\nIn the file, McIver denies firing a gun. He said he went outside to investigate a suspicious car in the cul de sac because he was worried about burglaries and vandalism in the neighborhood.\nThe police report said, “He said he chased a red car from the area that had been racing up and down the street. He said he chased them on foot and did not shoot at them.”\nLast month’s shooting occurred as the McIvers were being driven by a family friend from their 85-acre ranch in rural Putnam County to their other home in Buckhead and pulled off I-85 onto Edgewood Avenue to avoid traffic. Tex McIver was sitting in the rear seat of the Ford Expedition and his wife in the front passenger seat, Tex McIver’s attorney Stephen Maples said. Spotting some people milling about near the exit - an area where homeless people have been known to congregate - the couple pulled their .38-caliber revolver from the SUV’s center console, Maples said.\nThey moved on without incident and soon afterward, Maples said, Tex McIver fell back to sleep in the rear seat. McIver told the Atlanta Journal-Constitution the handgun was in his lap, still wrapped in a plastic Publix bag, when he said he suddenly awoke near Piedmont Park and the gun went off.","url":"https://www.ajc.com/news/local/fresh-details-earlier-mciver-shooting/8u7vm1C01itjXUhhB9ZOgL/"}
