{"authors":["Karen Ruiz For Dailymail.Com"],"date_download":"2018-10-23 03:08:15","date_modify":"2018-10-23 03:08:15","date_publish":"2017-03-16 13:54:03","description":"In a now-deleted Facebook post, owner of Fresno Restaurant Roll One for Mi Steve Wayte complained about Hispanics being bad tippers on Friday. He has apologized for the remark.","filename":"data/vaneerConsumption/Fresnosushirestaurantownerunderfireforracistpost.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E54AF0F00000578-0-image-a-6_1489681174609.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320188_Fresno-sushi-restaurant-owner-fire-racist-post_1540264095.html","title":"Fresno sushi restaurant owner under fire for racist post","title_page":"Fresno sushi restaurant owner under fire for racist post | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The owner of a popular California sushi restaurant landed himself in hot water after accusing Hispanics of being bad tippers on Facebook.\nIn a now-deleted Facebook post, Roll One for Mi owner Steve Wayte said: 'My servers are thinking about building a wall around the restaurant.\n'Why don't many Hispanics tip? Really? Zero, Ziltch, Nada.'\nWayte made the comment after staff complained that their Hispanic customers did not leave enough gratuity on Friday night.\nRoll One for Mi owner Steve Wayte faced massive backlash from his comments criticizing Hispanic customers for not tipping on a Facebook post. Wayte later apologized for his 'lack of judgment'\nWayte made the remark after his staff allegedly complained that their Hispanic customers did not leave enough gratuity on Friday night\nBut his comments quickly caused a stir after Fresno County Supervisor Henry Perea tweeted a screen grab of the post and urged the community to boycott.\n'NE Fresno Business wants to build a wall because Hispanic customer does not tip. let's build an Economic Wall around this establishment,' Perea said in a tweet.\nThe Facebook post prompted such huge backlash that Wayte had to bring in security into the sushi restaurant.\nVideo courtesy of FOX 26\nThe owner said a woman called at least eight times in response to his comments and asked him if he served Mexicans, the Star-Telegram reported.\nHe also received calls from angry customers threatening to protest outside of the eatery on Tuesday.\nWayte brought security into the restaurant located on East Champlain Drive following the threats\nFormer Fresno County Supervisor Henry Perea called for the community to build an 'economic wall' around the restaurant\nPerea, a former mayoral candidate, (pictured) said that Wayte 'indicted the entire Hispanic community,' and felt the need to speak up after people sent him screen grabs of the owner's Facebook post\nWayte eventually apologized for his remarks saying he hoped the community would forgive him for his lack of judgment.\n'There was no malice in my heart and I was just defending my staff that works hard to put a quality product and good service,' Wayte told Fox 26.\n'This was nothing against the Hispanic community.'\nBut Perea told the news station that Wayte 'indicted the entire Hispanic community.' The former county supervisor said he felt the need to speak up after people began to send him screen grabs of Wayte's post.\n'We have the opportunity to flex economic muscle. When we speak through our pocketbook, people will listen,' he said.\nHowever, the restaurateur said he felt hurt by the idea that someone such as Perea would choose to damage him economically.\n'I've done nothing to Henry Perea. It was a joke,' he said.\nChef at Roll One for Mi Carlos Rucker said he expected the comments to draw criticism, but said there is some truth to what Wayte said.\nAs a son of Mexican immigrants he said: 'Sometimes reality is hard to take in. Some Hispanics are very bad at tipping. It may a cultural thing. Not a personal thing.'\nWayte has since deleted his Facebook account following the controversy, and said the scandal has even affected his teenage daughter who received comments about her father being a racist.","url":"https://www.dailymail.co.uk/news/article-4320188/Fresno-sushi-restaurant-owner-fire-racist-post.html"}
