{"authors":[],"date_download":"2018-10-30 17:59:52","date_modify":"2018-10-30 17:59:52","date_publish":"2016-03-09 21:26:59","description":"Today is Friday, March 11th and Day 35 of the 40-day General Assembly sessionThe House and Senate convene at 10 a.","filename":"data/vaneerConsumption/FridayattheLegislatureHeadingintothehomestretch.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_friday-the-legislature-heading-into-the-homestretch__1540922392.html","title":"Friday at the Legislature: Heading into the homestretch","title_page":"Friday at the Legislature: Heading into the homestretch","title_rss":"NULL","source_domain":"ajc.com","text":"Today is Friday, March 11th and Day 35 of the 40-day General Assembly session\nThe House and Senate convene at 10 a.m. A modest schedule of committee meetings follows, and plans remain for Sine Die on March 24th.\nEvents\n8 a.m.-12 noon Women in Radio, Georgia General Assembly – Capitol south wing\n12 noon-5 p.m. Capitol Workout Day, Georgia General Assembly – Capitol rotunda\n12 noon-5 p.m. Caribbean American Legislative Day, Caribbean American Chamber of Commerce of Georgia Inc. – Capitol south wing\n1 p.m.-2 p.m. 50 State Tour, Wisdom and Truth Music – Liberty Plaza across from Capitol\nUp in the House\nSB 273, dealing with certain non-diagnostic, clinical laboratories\nSB 277, the “Protecting Georgia Small Business Act”, specifying that neither a franchisee or franchisee’s employee shall be deemed employee of franchisor\nSB 279, allowing the commissioners of juvenile justice and natural resources, or their designees, to serve on the Georgia Peace Officers Standards and Training Council\nSB 347, the “Georgia Captive Insurance Company Act”\nSB 137 dealing with property insurance and losses by fire\nSB 308, creating the Positive Alternatives for Pregnancy and Parenting Grant Program\nOn the Senate floor\nHB 859, the so-called “campus carry” bill, allowing anyone over 21 to carry guns on college and university campuses, except in a few places including dormitories\nHB 34, Georgia Right to Try Act, allowing some seriously ill Georgians to try advanced but unproven medical options in an effort to stay alive.\nHB 52, requiring parenting plans to be incorporated in final order on child custody\nHB 767, expanding “Spencer Pass Law” to include utility service vehicles\nHB 886, dealing with prescription drugs\nHouse committee meetings\n8 a.m. Judiciary Committee (Civil), Fleming Subcommittee, Room 132 Capitol – SB 3, known as the Supporting and Strengthening Families Act, allowing parent to have power of attorney to have another person take care of a minor child;\n11 a.m. Education Committee, Room 506 CLOB –SB 364, dealing with annual teacher, principal and assistant principal evaluations; SB 348 allowing for college and career academies as charter schools or schools within a strategic waivers school system; SB 355, “Student/Teacher Protection Act,” ending punitive testing consequences for mandated standardized assessments\nSenate committee meetings\n8:30 a.m. Appropriations Committee, Room 341 Capitol — HB 773, increasing the bond limit for the Georgia Housing and Finance Authority; HB 745, authorizing small debts to the state to be written off\n11 a.m. or upon adjournment Rules Committee, Room 450 Capitol\nNoon Health & Human Services Committee, Room 450 Capitol\n2 p.m. Education & Youth Committee, Room 307 CLOB\n2 p.m. Finance","url":"https://www.ajc.com/news/friday-the-legislature-heading-into-the-homestretch/I8xcP7jbCry75HAFZyu5aO/"}
