{"authors":[],"date_download":"2018-10-22 22:05:52","date_modify":"2018-10-22 22:05:52","date_publish":"2014-05-08 15:47:01","description":"A teacher accused of an inappropriate relationship with a student killed himself. Three other staffers have also been hit by allegations.","filename":"data/vaneerConsumption/FridayNightLightsSchoolRockedbySexScandalandSuicide.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/429436/140507-permian-high-school-mn-1205_b0be86790fb03936bba986ac3e40985d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_friday-night-lights-school-rocked-sex-scandal-suicide-n100421_1540245952.html","title":"'Friday Night Lights' School Rocked by Sex Scandal and Suicide","title_page":"'Friday Night Lights' School Rocked by Sex Scandal and Suicide","title_rss":"NULL","source_domain":"nbcnews.com","text":"School officials told NBC News that the campus crime-stoppers program received a tip late Tuesday \"that there might be a potential improper relationship\" between Lampman and a student.\n\"Our administrative team questioned him,\" said Mike Adkins, a spokesman for the Ector County Independent School District. \"He submitted his resignation and left.\"\nThe next day, oil workers found Lampman dead in a field with a self-inflicted gunshot wound to the chest, the Ector County Sheriff's Office said.\nLampman, who worked at Permian for 17 years, had not been charged with a crime at the time of his death and the investigation by the school police force is ongoing, Adkins said.\nHis wife said the family had no comment.\nHe was the fifth staffer accused of inappropriate conduct with a student in a year, though one of those school employees was cleared.\nPermian is a school of more than 3,000 students in Odessa, a west Texas city with a population of 100,000.\n\"It’s my opinion that this type of thing has gone on everywhere for years but for a long time it was accepted or ignored.\"\nThe scandal began last spring when swim coach Kathryn Maples was accused of an affair with a male student. Several weeks later, a trainer at the school, April Collins, resigned amid similar allegations.\nAn indictment accuses Collins of sending explicit pictures of herself and steamy text messages to a student. She allegedly offered to rent a room where they could have sex.\nMaples is also accused of sending a student lewd photos and a text that described her desire to have sex with him, court papers say.\nMaples' lawyer did not return calls. Collins' lawyer, John Green, said charges should never have been brought.\n\"She was an athletic trainer and a basketball player started making passes at her,\" Green said. \"He was 19 years old. He's an adult.\"","url":"https://www.nbcnews.com/news/us-news/friday-night-lights-school-rocked-sex-scandal-suicide-n100421"}
