{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:59:41","date_modify":"2018-10-30 23:59:41","date_publish":"2018-07-13 00:00:00","description":"Wall Street traders had a fun ritual every Friday the 13th to scare off evil spirits that could crash the stock market. The ritual ended after the 1987 stock-market crash.","filename":"data/vaneerConsumption/Fridaythe13thHowWallStreettradersdealtwithTriskaidekaphobia.json","image_url":"https://amp.businessinsider.com/images/59d680e0c68d7b6d118b7efc-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_friday-the-13th-and-triskaidekaphobia-on-wall-street-2018-7_1540943981.html","title":"Friday the 13th: How Wall Street traders dealt with Triskaidekaphobia","title_page":"    Friday the 13th: How Wall Street traders dealt with Triskaidekaphobia - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Until 1987, NYSE traders had a ritual on Friday the 13th to deal with Triskaidekaphobia, fear of the day. AP Images / Bernd Kammerer\nHappy Friday the 13th!\nFor many years, Wall Street traders dealt with their imagined fear of a market crash on this day with a bizarre tradition. Even they couldn't escape Triskaidekaphobia, the fear of the number 13.\nIn a note on Friday, Art Cashin, the veteran trader at UBS Financial Services, recalled Hat Day, when traders wore headgear to fend off bearish evil spirits:\nWe think the negative myth may be based on a novel published back around 1910. It told of a plot by an evil stock trader (ain't they all) to crash the market on Friday the 13th. By a numerical oddity, the 13th of the month falls on a Friday more than any other day. In the last 400 years, we have had 699 Friday the Thirteenths.\nOne further note on Friday the 13th. Triskaidekaphobia is actually fear of the number 13. Fear of Friday the 13th is actually Friggatriskaidekaphobia but that sounds like something that would cause your mom to put a bar of Lifebuoy in your mouth. So, Dr. Donald Dossey coined the term paraskevidekatriaphobia. He says that by the time you manage to pronounce it, your phobia's gone.\nPrior to 1988, floor brokers used to have fun with the myth by declaring Friday the 13th \"Hat Day\". Brokers would don silly and bizarre headgear, pretending to ward off the evil spirits.\nThe last official \"Hat Day\" occurred in 1987. It was on Friday, November 13th, to be exact. A few weeks earlier on Monday, October 19th, U.S. stock markets had suffered their worst selloff in history. The Dow fell 22% in one day. That would be the equivalent of a 5,500 point selloff today.\nThe '87 crash was far, far worse than the '29 crash on a percentage basis. As that day wore on and prices continued to fall and fall, the floor took on a kind of surreal atmosphere, almost like a dream sequence in a movie. You bargained and fought for good prices but there was a sense that this was unreal - that this couldn't really be happening.\nCashin added that because many traders lost their careers in the 1987 crash, the following Hat Day became some sort of \"Survivors Ball\" for those left behind.\nThe NYSE closed the visitor's gallery and cancelled press passes for the day so that the survivors had the floor all to themselves. However, a freelance reporter managed to gain access for an interview and stayed to document the whole day. Months later, he published a story with the headline \"The Fat Cats in Hats.\"\n\"That was the last \"Hat Day\" on the NYSE,\" Cashin wrote. \"They are sorely missed.\"\nOne last tidbit, for what it's worth: stocks have rallied 55%-60% of the time on Friday the 13th. So be greedy when others are fearful.","url":"https://www.businessinsider.com/friday-the-13th-and-triskaidekaphobia-on-wall-street-2018-7"}
