{"authors":[],"date_download":"2018-10-30 21:12:38","date_modify":"2018-10-30 21:12:38","date_publish":"2015-10-18 21:52:00","description":"Friendship Baptist Church broke ground on its new digs Sunday, almost 18 months after vacating its longtime home for the construction of the Atlanta Falcons’ massive new $1.","filename":"data/vaneerConsumption/FriendshipBaptistChurchbreaksgroundonnewhome.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/18/Images/photos.medleyphoto.8287434.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_friendship-baptist-church-breaks-ground-new-home__1540933958.html","title":"Friendship Baptist Church breaks ground on new home","title_page":"Friendship Baptist Church breaks ground on new home","title_rss":"NULL","source_domain":"ajc.com","text":"Friendship Baptist Church broke ground on its new digs Sunday, almost 18 months after vacating its longtime home for the construction of the Atlanta Falcons’ massive new $1.4-billion stadium.\nThe 153-year-old historic church, founded by freed slaves and the birthplace of Spelman College, will construct a 44,000-square-foot home at 80 Walnut St. S.W., just blocks away from the building the congregation vacated in spring 2014.\n“This is a very high point in the life of the church,” Rev. Richard W. Wills, the church’s new pastor, said in reflecting on the day, which brought out city leaders and former Mayor Andrew Young.\n“I have been a member of the clergy for more than 30 years and many of my colleagues have opted to vacate the city for the acreage in the suburbs,” said Wills, who recently became the church’s seventh pastor in its long history. “It is very significant that this congregation decided to be faithful to the disadvantaged of the city and remain in the community.”\nThe city of Atlanta and the Falcons bought the church in 2013 for $19.5 million as part of a plan to construct the retractable-roof Mercedes Benz Stadium just south of the Georgia Dome. The Falcons will continue playing in the Dome until the 2017 opening of Mercedes Benz, after which the Dome will be demolished.\nIn addition to Friendship, another historic church — Mount Vernon Baptist Church — was bought by the Georgia World Congress Center and the Falcons for $14.5 million. It too has been razed.\nFriendship’s new digs are part of a number of changes the church is making as it starts a new chapter in its history. In addition to welcoming Wills, Friendship collaborated recently with Invest Atlanta, the city’s economic development arm, to purchase 37 acres of struggling Morris Brown College for $14.6 million.","url":"https://www.ajc.com/news/local/friendship-baptist-church-breaks-ground-new-home/Su6MeYWuVQ1yiJtB0Oi51M/"}
