{"authors":[],"date_download":"2018-10-23 03:09:18","date_modify":"2018-10-23 03:09:18","date_publish":"2016-01-11 15:46:55","description":"David Bowie's impact on the pop and rock world was immense, with the singer cited as a key influence on artists as diverse as Madonna, Nirvana, the rapper Ka...","filename":"data/vaneerConsumption/FromLadyGagatoNirvanaeveryoneborrrowedfromBowie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-700xg-3WAQP5SaQH704788ebcf7e08d185-704_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394116_From-Lady-Gaga-Nirvana-borrrowed-Bowie_1540264158.html","title":"From Lady Gaga to Nirvana, everyone borrrowed from Bowie","title_page":"From Lady Gaga to Nirvana, everyone borrrowed from Bowie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From Lady Gaga to Nirvana, everyone borrrowed from Bowie\nDavid Bowie's impact on the pop and rock world was immense, with the singer cited as a key influence on artists as diverse as Madonna, Nirvana, the rapper Kanye West and even Lady Gaga.\nIt was from his restless, experimenting spirit -- still present in his final album released only two days before his death -- that so many other artists drew their inspiration.\nMore than any of his peers, Bowie's fanbase crosses musical genres, with rappers, pop stars, indie bands and straight-down-the-line rockers bending the knee Monday to pay tribute to the \"Thin White Duke\".\nFloral tributes are left beneath a mural of British singer David Bowie, painted by Australian street artist James Cochran, aka Jimmy C, following the announcement of Bowie's death, in Brixton, south London, on January 11, 2016 ©Chris Ratcliffe (AFP)\nKanye West said \"David Bowie was one of my most important inspirations, so fearless, so creative, he gave us magic for a lifetime.\"\nMadonna -- who has never made a secret that her ever-changing image owed much to him -- also took to Twitter to share her grief, confessing that \"the first concert that I ever saw\" was a Bowie gig.\n\"A true inspiration,\" said US group the Pixies, posting a photo on Twitter showing the singer surrounded by some his most famous disciples -- Billy Corgan of the Smashing Pumpkins, Foo Fighters frontman Dave Grohl (late of Nirvana) and The Cure's Robert Smith.\n- Gender bender -\nBowie has been regularly voted the single most influential rock artist by other singers and music magazines, with Marilyn Manson telling the British NME weekly, \"Today there seems to be a lack of icons and rock stars in general. When I grew up, there was David Bowie and Iggy Pop -- people who had something to say and had quite an impact on music and society.\"\nThere was something for everyone, it seemed, in Bowie's chameleon quality, his ever-changing and often gender-bending look and the vast musical palate he drew on that stretched from jazz to acid house.\nThe fact that Bowie regularly reinvented himself through characters like Ziggy Stardust or Major Tom only added to the allure.\nThe American site Allmusic.com, which specialises in showing the links between artists, found more than 120 had been greatly influenced by Bowie.\nA plethora of British groups, led by Joy Division, whose leader Ian Curtis venerated \"Ziggy Stardust\", and including Radiohead, Suede and Duran Duran drew heavily on the \"new wave\" Bowie of the late 1970s.\nBut among the more unlikely acts who followed in his wake were the flamboyant American hard rockers Kiss, who borrowed more than mere make-up tips from the glam-rock era Bowie, as well as Lady Gaga, who dramatic costume changes owe much to the master.\nBut it is probably the quirky and equally wide-ranging Icelandic star Bjork -- who shares a love of the avant garde -- who resembles him the most.\n- 'Music was not enough' -\nPerhaps his biggest influence was in showing how artists could rewrite the rules. \"He was genuinely iconoclastic and original,\" music critic Caroline Sullivan of The Guardian told AFP.\n\"Most rock stars come out of one mould or the other, but before Bowie there was no one quite like him, and there will never be anyone like him again.\"\n\"He never sold out,\" said Sullivan, who visited his modest childhood home in the south London suburbs last month for a radio documentary. \"Bowie stayed very much true to himself and his essential Britishness, always English, always eccentric.\"\nFrench documentary maker Christophe Conte, who made a film about the star, said, \"He realised very early that rock, and that music in general, was not enough by itself and should come with lots of other elements. So a Bowie album became an odyssey.\"\nBowie's influence also extended to his collaborations with others, including producing records for Lou Reed and Iggy Pop, as well as teaming up with Brian Eno at the end of the 1970s when they produced their celebrated \"Berlin Trilogy\".\nImitation, of course, is the sincerest form of flattery, and many other artists have covered his songs. While \"Rebel Rebel\" remains a mainstay of pub and garage bands the world over, the most striking covers of Bowie songs are arguably Nirvana's acoustic version of \"The Man Who Sold The World\" and Blondie's 1980 take on \"Heroes\", a song that Moby called \"one of the greatest ever written\".\nLady Gaga attends Billboard's 10th Annual Women In Music at Cipriani 42nd Street in New York City on December 11, 2015 ©Dimitrios Kambouris (Getty/AFP/File)\nDavid Bowie pictured in Helsinki in April 1976\nMadonna performs during a concert at the AccorHotels Arena in Paris on December 9, 2015 ©Francois Guillot (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3394116/From-Lady-Gaga-Nirvana-borrrowed-Bowie.html"}
