{"authors":["Jane Arraf"],"date_download":"2018-10-22 21:48:48","date_modify":"2018-10-22 21:48:48","date_publish":"2016-11-10 00:00:00","description":"A number of foreign leaders have strained relations with the Obama administration over human rights. Several have been quick to praise Donald Trump, hoping for a new start, and perhaps less scrutiny.","filename":"data/vaneerConsumption/FromCairoToManilaHardLineLeadersWelcomeTrumpsVictory.json","image_url":"https://media.npr.org/assets/img/2016/11/10/sissi-putin-11-10-16_wide-a4f876432d180022af4dbdb7668fc644b8a08b3d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_parallels_2016_11_10_501562804_from-cairo-to-manila-hardline-leaders-welcome-trumps-victory_1540244928.html","title":"From Cairo To Manila, Hard-Line Leaders Welcome Trump's Victory","title_page":"From Cairo To Manila, Hard-Line Leaders Welcome Trump's Victory  : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"From Cairo To Manila, Hard-Line Leaders Welcome Trump's Victory\nEnlarge this image toggle caption Alexander Zemlianichenko/AP Alexander Zemlianichenko/AP\nEgypt's President Abdel-Fattah el-Sissi says he was the first foreign head of state to pick up the phone to congratulate U.S. President-elect Donald Trump. But Sissi isn't the only hard-line leader vying to be Trump's best foreign friend.\nIn the Middle East, Asia, Africa and Eastern Europe, leaders known for tough policies that have brought frequent criticism from human rights groups have been quick to hail the results of the U.S. elections.\nSome of these leaders were elected; others came to power by force. In varying degrees, they all have strained relations with the Obama administration and have resented U.S. lectures on human rights and democratic reforms.\nThese leaders appear to believe a Trump administration offers the possibility of a fresh start, with a premium on security matters and less scrutiny of human rights.\n\"A Clinton administration might have been more concerned about ... using the influence and power the United States has in the international community to penalize these people who didn't respect human rights,\" said Steven Cook, senior fellow for Middle East and Africa studies at the Council on Foreign Relations in Washington.\n\"I think Donald Trump has signaled that that's not a major concern of his, and you know, dictators like that idea,\" Cook added.\nIn Hungary, the controversial, right-wing prime minister, Victor Orban, responded to the Trump victory with a Facebook message reading: \"What great news. Democracy is still alive.\"\nOrban's government has fenced off its border with Serbia to keep out migrants, similar to Trump's pledge to build a wall on the U.S.-Mexico border.\nPutin calls for improved relations\nIn Moscow, President Vladimir Putin congratulated Trump and said Russia was prepared to discuss rebuilding better relations with the United States. The two leaders also exchanged compliments during the U.S. campaign.\nTrump has suggested the U.S. could work with the Russian military campaign in Syria and join forces against the Islamic State. However, critics say the Russia effort is more about propping up Syrian President Bashar Assad than fighting ISIS.\nTrump has also said the Islamic State should be the focus of U.S. attention in Syria, not Assad. Under President Obama, the U.S. has been bombing the Islamic State for more than two years, but also says Assad has lost legitimacy and should ultimately go.\nMeanwhile, Philippine President Rodrigo Duterte has directed obscenities at Obama over U.S. criticism of his harsh crackdown on suspected drug dealers. An estimated 2,400 people, some of them children, have been killed in Duterte's war on drugs in the past four months. But Duterte now says he would like to turn a new page with the United States.\n\"I would like to congratulate Donald Trump. Long live,\" Duterte told an audience in Malaysia.\nA change in tone\nIn Cairo, Sissi's satisfaction with Trump's victory reflects a widely held view that as secretary of state, Hillary Clinton supported a U.S. policy that effectively propped up the now-banned Muslim Brotherhood.\nThe Islamist group won Egypt's elections in 2012, a year after protests swept Hosni Mubarak from the president's office. But in 2013, the Egyptian military seized control, which brought Sissi to power. An army general at the time, Sissi has banned protests and jailed thousands of activists in the three years since.\nThe Egyptian president met both U.S. presidential candidates earlier this year on the sidelines of the U.N. General Assembly in New York, where Trump declared Sissi \"a fantastic guy.\"\n\"The Trump campaign put out a very basic, simple statement: 'We support our Egyptian friends in their fight against terrorism,'\" says Cook at the Council on Foreign Relations.\n\"Then you look at what the Clinton team did. They said, 'We support our Egyptian friends' and then there was a whole laundry list of things that were critical of the Egyptians,\" he added. \"They may have been right, but that's not what the Egyptians want, so I think the Egyptians are looking at this as a fresh start.\"\nCook said despite Trump's rhetoric, he doesn't expect significant changes in U.S. foreign policy. But he does expect a change in tone.\n\"When bad things happen in authoritarian political systems — whether it's in Egypt or in Turkey or somewhere else in the world — there will be less criticism coming from the United States,\" he says.\nFor global strongmen sensitive to U.S. criticism, that might be enough.","url":"https://www.npr.org/sections/parallels/2016/11/10/501562804/from-cairo-to-manila-hardline-leaders-welcome-trumps-victory"}
