{"authors":["Associated Press"],"date_download":"2018-10-23 01:28:37","date_modify":"2018-10-23 01:28:37","date_publish":"2016-01-11 12:33:53","description":"LOS ANGELES (AP) — David Bowie's legend was as intrinsically tied to his aesthetic as it was to his genius as a musician. His striking looks and unique chari...","filename":"data/vaneerConsumption/FromfilmtovideosBowiesmostmemorablevisualworks.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393787_From-film-videos-Bowies-memorable-visual-works_1540258117.html","title":"From film to videos, Bowie's most memorable visual works","title_page":"From film to videos, Bowie's most memorable visual works | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From film to videos, Bowie's most memorable visual works\nLOS ANGELES (AP) — David Bowie's legend was as intrinsically tied to his aesthetic as it was to his genius as a musician. His striking looks and unique charisma made Bowie a natural fit for his own music videos and film, where he always lent an eccentric flair in both starring roles and cameos. Here is a look at some of his most memorable visual works:\n\"Space Oddity\" - 1972\nThe concept is alarmingly simple — just a man and his guitar — but through clever cuts, an energetic animated wavelength and a saturated red tint to the visuals, Bowie and director Mick Rock made a truly iconic short film long before the music video had truly developed into a respected stand-alone art form. According to Rock, Bowie once told his manager that \"Mick sees me the way I see myself.\"\n___\n\"Life on Mars?\" - 1973\nRock also directed the elegantly restrained video for \"Life on Mars?\" featuring Bowie in a pale blue suit, with globs of thick eyeshadow that transform from blue to purple as Rock experiments with levels of saturation, adding a pop art element to the video. His milky white skin is offset by a spiky, flaming red mullet. Rock didn't need big tricks to make this a classic, just his otherworldly star.\n___\n\"The Man Who Fell to Earth\" - 1976\nFilmmaker Nicolas Roeg took a chance on Bowie to lead his ponderous mind-bender \"The Man Who Fell to Earth,\" which finds an alien who is on a mission to Earth to get water for his planet but gets swept up by the pleasures and vices of the human race. Bowie's Thomas Jerome Newton is sickly pale and rail thin with a shock of artificial-looking red hair. In his glowing New York Times review of the film Richard Eder called Bowie's casting \"inspired\" and his performance \"extraordinary.\"\n___\n\"Ashes to Ashes\" - 1980\nThis experimental and groundbreaking video co-directed by Bowie and his frequent collaborator David Mallet transports the viewer from scene to scene through tiny shards of glass embedded with moving images. Bowie has a number of characters and costume changes in this mesmerizing video, but it's his pale clown with the major scar and the big red lips that leaves the most lasting (and haunting) impression.\n___\n\"Labyrinth\" - 1986\nA decade after \"The Man Who Fell To Earth,\" Bowie dove headfirst into Jim Henson's \"Labyrinth,\" a more child-friendly movie that has become somewhat of a cult classic after it was met with mixed reviews upon its release. Much of that cult status has to do with Bowie's campy, song-filled performance as the spandex-sporting Goblin King, Jareth.\n___\n\"The Last Temptation of Christ\" - 1988\nBowie played Pontius Pilate in Martin Scorsese's controversial epic \"The Last Temptation of Christ.\"\n___\n\"Twin Peaks: Fire Walk with Me\" - 1992\nBowie had a small, but pivotal role in David Lynch's \"Twin Peaks\" spinoff film \"Twin Peaks: Fire Walk with Me\" as missing FBI agent Phillip Jeffries, whose sudden reappearance and strange tales help set the tone for the film, which was derided at the time, but has since gained more esteem.\n___\n\"Basquait\" - 1996\nJulian Schnabel recruited Bowie to play one of his greatest inspirations, Andy Warhol, who he wrote a song about for his 1971 album \"Hunky Dory\", in his 1996 biopic about postmodern artist Jean-Michel Basquait. But critics were not especially fond of Bowie's Warhol interpretation. Entertainment Weekly's Owen Gleiberman called the impersonation \"a bit rickety (he never stops sounding like Bowie).\" But, Gleiberman wrote that he nonetheless \"has ripe theatrical fun overplaying Warhol's drop-dead murmurings.\"\n___\n\"Zoolander\" - 2001\nBowie played himself in Ben Stiller's absurdist modeling spoof \"Zoolander,\" providing his services as the master of ceremonies of the hilarious \"walk-off.\"\n___\n\"The Stars (Are Out Tonight)\" - 2013","url":"https://www.dailymail.co.uk/wires/ap/article-3393787/From-film-videos-Bowies-memorable-visual-works.html"}
