{"authors":[],"date_download":"2018-10-22 21:44:11","date_modify":"2018-10-22 21:44:11","date_publish":"2016-11-09 00:00:00","description":"Even beyond an open spot on the Supreme Court — preserved by stalling Obama's nominee — the president-elect will get to pick appointees for an eighth of the seats on federal benches.","filename":"data/vaneerConsumption/FromSupremeCourtDownTrumpWillHaveSwiftImpactOnFederalCourtsNPR.json","image_url":"https://media.npr.org/assets/img/2016/11/09/ap_7591058309_wide-eb6985b7d11ee74a6b9075c7712a508686e6c2a2.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=501476919_1540244651.html","title":"From Supreme Court Down, Trump Will Have Swift Impact On Federal Courts : NPR","title_page":"From Supreme Court Down, Trump Will Have Swift Impact On Federal Courts : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nLast night's election directly affected the two elected branches of government, the presidency and Congress. Republicans will soon control both. What of the third branch, the judiciary? Joining us to talk about that is NPR legal affairs correspondent Nina Totenberg. Nina, welcome to the studio.\nNINA TOTENBERG, BYLINE: Nice to see you, Audie.\nCORNISH: Well, let's start with the Supreme Court because the vacancy that's remained unfilled since the death of Justice Antonin Scalia nine months ago was a major topic of this campaign.\nTOTENBERG: Well, the unprecedented policy adopted by Senate Republican Leader Mitch McConnell has in essence been vindicated as he said at a press conference today on Capitol Hill.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMITCH MCCONNELL: I said in February of this year to a hail of controversy that I thought it best that the American people decide who made this appointment to the Supreme Court. And so the American people have spoken.\nCORNISH: Do we know who President-elect Trump might pick, what that process would be, how soon? I have a lot of questions here, you know, like, what the Democrats' reaction will be.\nTOTENBERG: Well, we know at once a lot in a little, Audie. Trump issue two long lists of potential nominees during the campaign, both put together largely by the folks at the conservative Heritage Foundation. The list was to a person, a very, very conservative one. But it also was quite remarkable for who was missing, namely some of the most distinguished conservative judges and lawyers in the country.\nAnd there never was any guarantee that Trump would pick from that list or either list. It was in many ways - they were lists aimed at quelling the fears of religious and social conservatives in the Republican Party. And he may still want to do that.\nCORNISH: So who's advising him on this?\nTOTENBERG: We really don't know. Senate Majority Leader McConnell today made clear he has views, as do other Republican senators.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMCCONNELL: I've got a few suggestions I'd like to make that I won't mention to you. But I - you know, I think he's open to our suggestions about that, and I - that's good. I think it's the way it ought to work.\nTOTENBERG: You'll notice he did not suggest Democrats would have any input. Republicans don't have to do that. President Obama picked Merrick Garland because he was the Democratic appointee that Republicans for years had said was the person on the Democratic list that they thought they could live with - in short, the best they thought they could get.\nAnd Republicans controlled the Senate, so Obama picked in Garland. You aren't hearing that kind of solicitude for Democrats' views from Trump right now because the Republicans still control the Senate.\nCORNISH: Right. I mean could Democrats filibuster the appointments? I mean it takes 60 votes to break a filibuster, and Republicans won't have that many.\nTOTENBERG: If there's a Democratic filibuster, I would imagine the Republicans would change the Senate rules just as the Democrats would have done if they had won control of the Senate and had a Democratic president.\nCORNISH: I want to turn for a moment to the lower courts. What happens with all those vacancies?\nTOTENBERG: Well, there are currently 103 judicial vacancies. That's about an eighth of the federal judiciary. There are 59 Obama judicial nominations pending that will now die. Republicans have been incredibly artful about slow walking these lower court appointments. Indeed the Republican Senate has confirmed only 11 judges since the beginning of the year.\nSo now Trump, once president, will have all those lower court vacancies to fill, too. And I think you can expect the Senate Republicans to revamp the rules on these lower court nominations so that the traditional views of senators from the opposition party in each state are not considered.\nCORNISH: And before I let you go, the Supreme Court docket - could that change?\nTOTENBERG: It could change very quickly. Some of the big cases that are pending involve executive rules promulgated by the Obama administration. Some you can get rid of quickly - probably the transgender bathroom rule and immigration. But a lot of others, you simply cannot.\nCORNISH: That's NPR's Nina Totenberg. Nina, thank you.\nTOTENBERG: Thank you.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=501476919"}
