{"authors":["Elizabeth Jensen"],"date_download":"2018-10-23 01:07:56","date_modify":"2018-10-23 01:07:56","date_publish":"2016-03-24 00:00:00","description":"Links to past candidate interviews not currently available on NPR.org.","filename":"data/vaneerConsumption/FromTheNPRArchivesInterviewsWithThePresidentialCandidates.json","image_url":"https://media.npr.org/assets/img/2016/03/24/last-candidates-promo_wide-6a825b49d5086c05805f12ec9db0f1817e74feea.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ombudsman_2016_03_24_471586519_from-the-npr-archives-interviews-with-the-presidential-candidates_1540256876.html","title":"From The NPR Archives: Interviews With The Presidential Candidates","title_page":"From The NPR Archives: Interviews With The Presidential Candidates : NPR Ombudsman : NPR","title_rss":"NULL","source_domain":"npr.org","text":"From The NPR Archives: Interviews With The Presidential Candidates\nEnlarge this image toggle caption Justin Sullivan; Andrew Harrer; Ralph Freso; Bob Levey; Brendan Smialowski/Getty Images Justin Sullivan; Andrew Harrer; Ralph Freso; Bob Levey; Brendan Smialowski/Getty Images\nAn email came recently from listener Stephen K. Reeder from Cerritos, Calif.:\n\"In the interest of fairness in the 2016 Democratic Primary, I have a request. There is a selectively edited clip of NPR's Weekend Edition, 1/13/1996, featuring an interview with then First Lady, and current Democratic Presidential candidate, Hillary Rodham Clinton. You can hear the clip on YouTube, and it has been linked from numerous websites, and has appeared in my personal Facebook feed about 11 times. The entire interview is nowhere to be found, online or in the NPR archives. In the interest of fairness, I ask that you please release the audio of the full interview.\"\nNPR's Tamara Keith wrote a story about the ad and the original interview, posted earlier today at NPR.org with the full audio and transcript.\nHere is some background about the archives.\nNPR began transcribing its shows in 1990. Until 2009, listeners could request those transcripts for a fee. In 2009, when NPR.org was relaunched, NPR began posting its new transcripts online for anyone to access.\nAs for the NPR content from 1990 to 2009 that has been transcribed but is not on NPR.org, the vast majority of that material has been licensed to seven online databases: EBSCO, Factiva, Gale, LexisNexis, NewsBank, ProQuest, and Thomson Reuters Westlaw. Those services often carry subscription fees, but most public libraries can help get that material for anyone requesting it.\nThat listener-requested 1996 interview falls into that period of material that is available through the paid databases but not on NPR's own site. The listener could have gone to the library, but given that the interview has now come back into the public dialogue, it should be easier to find, so I am also posting it, as did NPR in the Keith piece, along with the transcript, below. Listeners can make up their own minds about it.\nNPR's Research, Archives & Data department has also identified 18 major interviews with three of the five remaining presidential candidates that fall into that archive nether area. (All of the interviews that NPR has conducted with Ted Cruz are online and NPR has never interviewed Donald Trump.)\nLinks to the audio of the 18 interviews, and transcripts where they are available, are also posted below, to make them easier for listeners to access. There are 40 other major interviews with the current candidates that the RAD department identified that are already online at NPR.org, so they are not being posted here. Finally, as an aside, listeners can hear more audio from the archives as part of All Things Considered's fascinating \"First Mention\" feature, whose most recent installment samples audio from a February 1983 piece about Bernie Sanders' bid to be re-elected mayor of Burlington, Vermont.\nHillary Clinton\nInterview: Senator Hillary Rodham Clinton Discusses The Democratic National Convention\nThis interview originally aired on The Tavis Smiley Show on July 29, 2004.\nListen: Interview: Senator Hillary Rodham Clinton Discusses The Democratic National Convention 9:10\nHillary Clinton Revisiting Health Care & Insurance Issues\nThis interview originally aired on Weekend Edition on April 17, 2004.\nListen: Hillary Clinton Revisiting Health Care & Insurance Issues 9:00\nSenator Clinton On Solution To Unpaid Diplomatic Parking Tickets\nThis interview originally aired on Weekend Edition on Nov. 1, 2003.\nListen: Senator Clinton On Solution To Unpaid Diplomatic Parking Tickets 3:00\nHillary Clinton Discusses Her Memoir \"Living History\"\nThis interview originally aired on Morning Edition on June 19, 2003.\nListen: Hillary Clinton Discusses Her Memoir \"Living History\" 8:44\nHillary Rodham Clinton: Senator & Former First Lady\nThis interview originally aired on Fresh Air on June 12, 2003.\nListen: Hillary Rodham Clinton: Senator & Former First Lady 38:00\nSenator Clinton One Year After 9/11\nThis interview originally aired on The Tavis Smiley Show on Sept. 11, 2002. A transcript is not currently available.\nListen: Senator Clinton One Year After 9/11 12:00\nSenator Clinton Comments On Anthrax & US Military Action In Afghanistan\nThis interview originally aired on Morning Edition on Oct. 18, 2001.\nListen: Senator Clinton Comments On Anthrax & US Military Action In Afghanistan 4:25\nHillary Clinton: First Lady @ Book/Scandal\nThis interview originally aired on Fresh Air on Jan. 15, 1996. The transcript is not available at this time.\nListen: Hillary Clinton: First Lady @ Book /Scandal 21:25\nHillary Responds To Critics Allegations\nThis interview originally aired on Weekend Edition on Jan. 13, 1996.\nListen: Hillary Responds To Critics Allegations 13:50\nHillary Clinton On Health Care Reform\nThis interview originally aired on All Things Considered on June 24, 1994.\nListen: Hillary Clinton On Health Care Reform 4:15\nHillary Clinton Interview About Health Plan\nThis interview originally aired on Morning Edition on Oct. 29, 1993.\nListen: Hillary Clinton Interview About Health Plan 8:34\nHillary Clinton Talks About Campaign & Self\nThis interview originally aired on All Things Considered on July 13, 1992.\nListen: Hillary Clinton Talks About Campaign & Self 8:00\nTed Cruz\nAll audio and transcripts are available on npr.org.\nJohn Kasich\nBudget Surplus Projections & Use Options\nThis interview originally aired on Morning Edition on Oct. 3, 1997.\nListen: Budget Surplus Projections & Use Options 5:00\nKasich Predicts Budget Battle Success\nThis interview originally aired on Morning Edition on Oct. 9, 1995.\nListen: Kasich Predicts Budget Battle Success 5:23\nBernie Sanders\nSanders Discusses His Possible Victory As Independent Senator From Vermont\nThis interview originally aired as part of an Election Special on Nov. 7, 2006. The transcript is not available at this time.\nListen: Sanders Discusses His Possible Victory As Independent Senator From Vermont 5:35\nIndependent Rep. Bernard Sanders Interview\nThis interview originally aired on Morning Edition on March 4, 1997.\nListen: Independent Rep. Bernard Sanders Interview 7:20\nDemocratic Socialist Won Vermont Seat\nThis interview originally aired on All Things Considered on Nov. 28, 1990.\nListen: Democratic Socialist Won Vermont Seat 6:15\nSocialist Vermont Mayor Calls It Quits\nThis interview originally aired on Morning Edition on April 3, 1989. The transcript is not currently available.\nListen: Socialist Vermont Mayor Calls It Quits 7:00\nDonald Trump\nNPR has never interviewed Donald Trump one-on-one.\nSpecial thanks to Mary Glendinning, Sarah Knight, NPR's RAD and Online Production teams for their help.","url":"https://www.npr.org/sections/ombudsman/2016/03/24/471586519/from-the-npr-archives-interviews-with-the-presidential-candidates"}
