{"authors":[],"date_download":"2018-10-30 00:50:22","date_modify":"2018-10-30 00:50:22","date_publish":"2018-08-27 01:55:02","description":null,"filename":"data/vaneerConsumption/FromLavrentiBeriatoLannyDavis.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Ready_for_Hillary-0072_15349299884.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860622.html","title":"From Lavrenti Beria to Lanny Davis","title_page":"From Lavrenti Beria to Lanny DavisThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Now here’s something terrifying that’s swinging into action in a big way: the Deep State with dictatorial, unlimited prosecutorial powers. The Deep State is the permanent government of high powered bureaucrats. The most dangerous of these are federal and state prosecutors who can turn a man’s life upside down (woman’s, too) and make life not worth living. A prosecutor has powers that can and do send the innocent to the gas chamber, to prison for life, and frighten even the roughest and toughest of the tough. If they have a political axe to grind, they do it without a second thought.\nThis all comes to mind because of my former classmate at Yale Law School ’70, Lanny Davis, and his client, the deeply unfortunate Michael Cohen.\nI’m not going to bore you with details about the life of Michael Cohen. Suffice it to say, he was a lawyer for Donald Trump and he got into extremely serious trouble about various federal laws involving money. The G-men threatened him with mammoth prison terms, which would frighten anyone. (It frightens me just to think about it.) The G-men also (according to the newspapers) took a page right out of Stalin’s playbook and threatened his wife with major prison time, too, just for signing their income tax returns.\nI don’t know whether Mr. Cohen did any of the things he’s accused of doing. Accusing ain’t proving. But I do know that certain of the items he was charged with — making illegal campaign contributions by paying hush money to sex stars — may not be crimes at all. It all depends on his intent and his state of mind, very difficult things to prove.\nWhat I do know is that when Mr. Cohen (a graduate of American University, where I used to teach roughly 50 years ago and had the best time of my life), was desperate, he did not go to just any lawyer. Washington, D.C. has over 90,000 lawyers. There are many more in New York City, where he was charged. No, Mr. Cohen went to my former law school classmate, Lanny Davis.\nI no longer recall whether Lanny Davis was a super-smart law student like Duncan Kennedy, long of Harvard Law School. I do recall that while the rest of us were rebels, talking back to the teachers and protesting everything that was not nailed down, Lanny Davis made a career as the number one acolyte to the law school faculty and powers that be. He was fanatically devoted to defending even the most hated law school profs.\nNow, of course, he is famous for puckering up in a different way: to the Clintons. Don’t get me wrong. I understand loyalty and I applaud Lanny’s loyalty to the Clinton family and its empire. It’s smart and it shows some guts. It’s not illegal.\nBut here’s my point. When the Feds put the vise on Mr. Cohen’s gonads, he did not run to a brilliant litigator. He ran to the innermost circle of the Clinton Deep State Machine. (And, again, I don’t blame Lanny for being who he is.) What does this tell us, boys and girls?\nThat the people in the know understand that the real power pushing the totally phony witch hunt against Trump are the inner circle of the Deep State, those with prosecutorial powers. When Mr. Cohen surrendered, he went to the Clintons and begged them for mercy via Lanny Davis (at least that’s how it appears to me).\nSo now we have the Special Prosecutor with his 17 Clinton donors in high places and the Clintons’ private attorney working the same side of the main street of Salem, Massachusetts, lighting bonfires for witches.\nThe brutal truth that the whole anti-Trump crusade is largely revanchism of the Clintons is stripped bare by Mr. Cohen throwing himself at the altar of Hillary, via Lanny Davis. The real power lies with the Clintons — still. They’ve got the MSM, the prosecutors, Lanny S. Davis… and these entities can do some serious damage. Mr. Trump may ruin someone’s day with a tweet. But he cannot put anyone in prison. For that, we have to look to the Clintons and the prosecutorial Deep State.\nGoodbye, Department of Justice. Welcome, Ministry of Love. Stalin’s secret police hangman Lavrenti Beria must be laughing in hell. And George Orwell saw it all coming.","url":"https://spectator.org/from-lavrenti-beria-to-lanny-davis/"}
