{"authors":["Krishnadev Calamur"],"date_download":"2018-10-22 23:23:37","date_modify":"2018-10-22 23:23:37","date_publish":"2014-09-17 00:00:00","description":"Scotland's referendum on independence has implications beyond the borders of the United Kingdom. We take a look at several other regions with breakaway movements.","filename":"data/vaneerConsumption/FromQuebecToKashmirSeparatistsWatchScotlandVote.json","image_url":"https://media.npr.org/assets/img/2014/09/17/ap369147560040_wide-3fb1d6e2b3c1a28a06f2fa089fa82ca6782d0854.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_parallels_2014_09_17_349315647_from-quebec-to-kashmir-separatists-watch-scotland-vote_1540250617.html","title":"From Quebec To Kashmir, Separatists Watch Scotland Vote","title_page":"From Quebec To Kashmir, Separatists Watch Scotland Vote : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"From Quebec To Kashmir, Separatists Watch Scotland Vote\nEnlarge this image toggle caption David Cheskin/AP David Cheskin/AP\nScotland's referendum on independence Thursday could resonate far beyond the borders of the United Kingdom. There are many places with separatist movements, like the militias in eastern Ukraine who have been battling the Ukrainian government this year.\nHere's a look at some of the other places with separatists who want to break away from their current rulers, from Canada to Spain to Belgium to India.\nQuebec\nQuebec's separatists have had long and close links to the Scottish National Party, which is spearheading the \"yes\" campaign. The Parti Quebecois is hoping that a \"yes\" vote or even a narrow defeat in Scotland could rejuvenate its own attempts to break away from Canada.\nThe French-speaking province has held two referendums on independence, one in 1980 and the other in 1995. In the more recent vote, the side that supported staying with Canada barely held on. Since then, support for independence has fallen dramatically, according to polls.\nStill, Daniel Turp, a Quebec nationalist politician, is in Edinburgh this week to witness Thursday's vote, and he says the events in Scotland are reminiscent of how the 1995 vote in Quebec played out.\n\"The end of the Scottish campaign is absolutely déjà vu,\" he told The Telegraph.\nHe says he has advised Scottish pro-independence leaders to beware of last-minute promises from the pro-union side.\n\"I said that if they did well, there would be all sorts of late promises of more autonomy and more devolution,\" he said. \"And look what's happening now. Ottawa did the same with us. But these promises are hollow. If Scotland votes no, they will be quickly forgotten.\"\nAndre Lecours, a political science professor at the University of Ottawa, tells The Associated Press that the \"yes\" campaigns in Scotland and Quebec have similarities as well as major differences.\n\"There are lots of similarities, first in that the Yes campaign has been positive, with the same message, that 'we're good enough and big enough, and we can do it,' \" he told the AP. \"And a bit like the PQ, the Yes Scotland campaign has energized Scottish society and reached people that typically aren't involved in the political process.\"\nThe AP adds: \"On the other hand, he said the Scots have avoided an often-cited pitfall of the Quebec separatist movement — a lack of clarity about what exactly would happen in the event of a referendum victory.\"\nFlanders\nThe Flemish-speaking region of Belgium has in recent years uneasily coexisted with the French-speaking south of the country.\nThe New Flemish Alliance, or N-VA, emerged as the single-biggest party in elections in May, and is likely to be at the head of any national government. Flemish nationalist sentiments are strong, and political scientist Dave Sinardet tells Agence France-Presse that a good performance by the \"yes\" vote in Scotland \"could inspire the base of the N-VA.\"\nStill, as De Morgen, a Flemish daily, notes, \"There is little appetite for the economic uncertainties of a separatist adventure\" in Flanders.\nHere's more from AFP on what's a more likely future for the Flemish-speaking part of Belgium:\n\"For Flemish nationalists, a more realistic perspective that Belgium becomes a confederation where Flanders would enjoy almost complete autonomy without breaking up the country. \"If they prove that once in government they are efficient managers, N-VA strategists believe they could emerge strengthened from elections in 2019 and make a big push then for a confederation.\"\nCatalonia\nPolls show more than half the people in Catalonia support independence from Spain, and the region's lawmakers are hoping to put that backing to a referendum on Nov. 9.\nThe Washington Post reports:\n\"Catalonia has long been one of Spain's main industrial engines, representing one-fifth of the whole country's economy, and its politicians believe its future would be rosier if it was free of the wider dysfunctions of the Spanish economy. Madrid, though, has been far less accommodating of Catalan aspirations than the British government under Prime Minister David Cameron has been of Scotland's move toward independence.\"\nThe government of Prime Minister Mariano Rajoy has said he will block a vote, and indeed the country's constitutional court is likely to stop any referendum, which needs government approval. Rajoy has also said an independent Scotland will have to negotiate entry into the EU and NATO, an apparent signal that independent-minded regions should not expect an easy path to international organizations.\nAlbert Royo-Mariné, secretary general of the Public Diplomacy Council of Catalonia, tells USA Today that Spain should learn from \"the way Britain managed to find a way to give the people of Scotland a vote that mirrors their political will.\"\n\"Scotland has been given the opportunity to choose what they want to be, and Spain needs to be inspired by this precedent. This is the way to solve political conflicts,\" Royo-Mariné said. \"Spain is a young democracy, and it cannot afford to block a peaceful movement such as this. That would be dangerous for Spain.\"\nKashmir\nKashmir, the region claimed by both India and Pakistan, has been the scene of a pro-independence movement for decades. As NPR's Julie McCarthy recently noted, a heavy Indian army presence has kept a lid on rebellion.\nAs the BBC notes, several thousand Kashmiris who live in Scotland will vote in Thursday's referendum.\n\"That vote will determine whether a region with a distinct identity can successfully secede from a much larger nation,\" the BBC says — a sentence that can have a parallel in Kashmir as well as Scotland.\nKashmiris were promised a referendum — but only a choice between India and Pakistan, and not independence — soon after the king in Muslim-majority Kashmir joined India in 1947. But that vote never took place. India maintains that conditions aren't right for one, and so chances of a vote are slim to none. The BBC adds:","url":"https://www.npr.org/sections/parallels/2014/09/17/349315647/from-quebec-to-kashmir-separatists-watch-scotland-vote"}
