{"authors":["Npr Staff"],"date_download":"2018-10-23 01:00:36","date_modify":"2018-10-23 01:00:36","date_publish":"2016-11-25 00:00:00","description":"When Saboor Sahely left Afghanistan for the U.S. in 1978, he bore a lesson with him: love for his community. Now a restaurant owner in Utah, he has given out free Thanksgiving meals for 26 years.","filename":"data/vaneerConsumption/FromAfghanistanToUSALessonInLoveOneThanksgivingAtATime.json","image_url":"https://media.npr.org/assets/img/2016/11/23/sahelynpr_wide-d3606c33d7fdbb27a4c6548e0b808788501d47cd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_25_503147094_from-afghanistan-to-u-s-a-lesson-in-love-one-thanksgiving-at-a-time_1540256436.html","title":"From Afghanistan To U.S., A Lesson In Love - One Thanksgiving At A Time","title_page":"StoryCorps: From Afghanistan To U.S., A Lesson In Love — One Thanksgiving At A Time : NPR","title_rss":"NULL","source_domain":"npr.org","text":"From Afghanistan To U.S., A Lesson In Love — One Thanksgiving At A Time\nEnlarge this image toggle caption Cache Valley Family Magazine Cache Valley Family Magazine\nSaboor Sahely grew up in Laghman, Afghanistan, with a large extended family.\n\"I vividly remember there was a lot of happiness and joy in eastern Afghanistan,\" Sahely, 65, tells his youngest daughter, Jessica. On a recent visit with StoryCorps, he tells her about the lessons of community he learned there.\n\"If there was a wedding, the entire village would show up. And you felt very welcomed to go into each other's homes, and we knew who had what for dinner every night and if we didn't like what we had for dinner, we all went to the neighbor's house.\"\nIt was from one of those neighbors, the older woman next door, that Sahely first learned of the United States. Her grandson was a student there. And more and more, he would think about the stories she told him.\nEnlarge this image toggle caption StoryCorps StoryCorps\n\"I kept thinking, you know, I'm gonna figure out a way to get to this faraway magic land someday,\" he says.\nThen came war. In the late 1970s, when violence broke out in Afghanistan, Sahely's father wanted him to leave the country. His father feared things there would only get worse.\nSo, in 1978, Sahely immigrated to the U.S., where he eventually found work.\n\"One Sunday, I came to this restaurant,\" he recalls. \"I walk in there. The dishwasher hadn't shown up, and the manager asked me when can I start, and I said right away. I did that for a few months and he moved me on as a — I became a cook — and then assistant manager.\"\nIn 1983, Sahely opened a restaurant of his own, which he called Angie's. He says he and his staff treat the customers — some of whom eat three meals a day there — as if they're family. If regulars don't show up, he says they'll call to make sure they're OK.\n\"We go to their funerals, we go to their weddings,\" he says. \"These people put shoes on my children's feet and they deserve the best. So, we should turn around and give something back every single chance we get.\"\nEven in the U.S., he bears with him the lessons of community he learned so well in Afghanistan: \"My grandmother, she knew that most of the village did not have enough to eat. So whatever we had for dinner every night, she made sure that she'll have a plateful that I had to carry to different homes.\"\nHe carries the same principle forward in Logan, Utah — especially on Thanksgiving.\n\"So when I was in a position to give something back, we thought on Thanksgiving Day we're going to open our doors to anybody and everybody,\" he says. \"Last year, for instance, we had over 800 people that come to the door.\"\nThursday marked the 26th year Sahely and his restaurant staff provided free Thanksgiving dinner to their local community. And he has no intention stopping soon.\n\"We're very, very lucky. And I don't take that for granted at all.\"\nProduced for Morning Edition by Von Diaz.\nStoryCorps is a national nonprofit that gives people the chance to interview friends and loved ones about their lives. These conversations are archived at the American Folklife Center at the Library of Congress, allowing participants to leave a legacy for future generations. Learn more, including how to interview someone in your life, at StoryCorps.org.","url":"https://www.npr.org/2016/11/25/503147094/from-afghanistan-to-u-s-a-lesson-in-love-one-thanksgiving-at-a-time"}
