{"authors":[],"date_download":"2018-10-22 21:58:06","date_modify":"2018-10-22 21:58:06","date_publish":"2014-06-06 19:26:12","description":"Many businesses are already adapting to deal with climate change, ensuring their businesses can grow and profit amid sustainability challenges.","filename":"data/vaneerConsumption/FromBeertoInsuranceBusinessesBetonClimateChange.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/493116/ja_sabmozambique-oneredeye-0623_2c65fe21a4a2da82ffcc747215c46fa6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_beer-insurance-businesses-bet-climate-change-n124781_1540245486.html","title":"From Beer to Insurance: Businesses Bet on Climate Change","title_page":"From Beer to Insurance: Businesses Bet on Climate Change","title_rss":"NULL","source_domain":"nbcnews.com","text":"Some big companies already are paying to counter weather-related damage. More than 60 S&P 500 companies have spent money to offset climate change, according to a report last month from the Carbon Disclosure Project, which assesses companies and the environment.\nGap, for example, absorbed higher cotton costs after precipitation and drought changes in China, according to the carbon project report. Floods in Thailand in 2011 hit local manufacturing, which affected Hewlett-Packard's revenues. Dr. Pepper Snapple Group noted potential water supply and climate changes could put $2.5 billion of its cost of sales at risk.\nBig companies also are investing now to lower their carbon footprint. Among S&P 500 companies, on average 4 percent of their annual capital expenditure has been allocated to lower emissions, according to the report. The capital expenditure ranged from less than 1 percent for consumer product companies to 23 percent for utilities, which use a lot of water.\nReinsurance\nWater, utilities and energy are among sectors that immediately would be affected by bigger weather changes.\nAnother industry embedding climate change deep into its strategy is reinsurance.\nBased in Zurich, global reinsurer Swiss Re has been involved in the climate debate since the 1980s. Its customers range from companies to cities, trying to manage weather-related hazards.\nSince Hurricane Sandy in 2012, for example, Swiss Re has been working with New York City to quantify climate change-related risks and identify cost-effective measures to shore up buildings and other structures such as elevating electrical systems, and building barriers to a storm surge.\nSandy cost New York City an estimated $19 billion in total losses — $13 billion in physical damage and almost $6 billion in lost economic activity, according to a city analysis. Swiss Re estimates additional climate change-related costs to the city could reach on average about $4.4 billion per year by 2055 if no action is taken.\n\"Can we afford not to adapt is the question,\" said Mark Way, head of sustainability for Swiss Re's Americas operations. \"And yes, it's not just in society's interest. It's very much in our interest, too,\" Way said. \"There is an insurance solution to help governments manage these kinds of risks.\"\nSmoke-free stoves\nAcross the globe in developing nations, climate change exposure has created opportunities for startups.\nIn East Africa, venture developer CleanStar Ventures has helped create a smoke-free ethanol cookstove, an alternative to charcoal. The $35 stoves are being sold and distributed by NDZiLO Mozambique — which the venture developer has a stake in. The stoves can run on ethanol made from local cassava.\nDue to political unrest, ethanol is being imported to power the stoves. But project leaders hope to revive the full supply chain that connects rural farmers with housewives in Mozambique's capital Maputo, who are buying and using the stoves.\n\"The business was designed to deliver both social and environmental values, in addition to being commercially viable,\" said Rahul Barua, a partner at CleanStar Ventures, based in Palo Alto, California.\nBroad reach\nClimate change's reach is broad. Sectors including media, retail and consumer staples are vulnerable to extreme weather liabilities. Hurricane Sandy, for example, lowered U.S. box-office receipts amid closed theaters.\nCampbell Soup is thinking about climate change, too. Many of its suppliers are agricultural producers, so weather shifts would affect transportation and product availability, according to the carbon project report. Raw materials and sourcing often are cited as key climate worries among food and beverage companies.\nA day after the U.S. announced plans to reduce carbon emissions at America's coal-fired power plants, China — the world's biggest greenhouse gas emitter — stepped into the debate Tuesday. China said it will limit its total emissions for the first time by the end of this decade. A major climate change conference is scheduled for Paris next year.\n\"Many people believe we will feel the impact of climate change through the availability of water,\" said William Sarni, a climate-change expert for Deloitte Consulting. \"Now there's a conversation with CEOs about the risk of water scarcity to 'my business.'\"","url":"https://www.nbcnews.com/business/economy/beer-insurance-businesses-bet-climate-change-n124781"}
