{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:21","date_modify":"2018-10-30 22:52:21","date_publish":"2016-11-02 08:00:00","description":"In Florida, it’s Cuban Americans. Within one generation, the children of a loyally conservative immigrant group don’t feel the same attachment to the","filename":"data/vaneerConsumption/FromloyaltolostVietnamesevotersandtheGOP.json","image_url":"https://calmatters.org/wp-content/uploads/Vietnamese_Voters_photo_Kevin_Sullivan_The_Orange_County_Register.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939941.html","title":"From loyal to lost? Vietnamese voters and the GOP","title_page":"From loyal to lost? Vietnamese voters and the GOP | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In Florida, it’s Cuban Americans. Within one generation, the children of a loyally conservative immigrant group don’t feel the same attachment to the Republican Party that their parents did.\nIn California, it’s Vietnamese Americans. And the flight from the GOP among younger Vietnamese voters appears to be happening at very rapid pace.\nThe generational change in Vietnamese voters\nIt’s bad news for a party who has relied on Vietnamese-American voters as a predictably conservative voting bloc since the 1970s, when refugees fleeing Vietnam’s communist regime began populating cities such as San Jose and Garden Grove in large numbers. What once was one of the few key minority groups the California GOP could bank on at the polls increasingly trends Democrat and independent. Today young Vietnamese voters are now more likely to register Democrat than your average young Californian.\nAnd that trend could have major implications for legislative elections across California.\n“It is still a community in transition, but it’s a pretty dramatic transition,” says Karthick Ramakrishan, a professor of public policy and political science at the University of California-Riverside. “Here you have a population that used to be solidly Republican, but they have either become Democrat if you look at the younger generation, or they’ve drifted away from the Republican Party.”\nProportionally, Vietnamese voters make up a smaller share of California’s population than Cuban voters in Florida—although for perspective, in raw numbers they’re not that far off. But because California’s Vietnamese population is heavily concentrated in Santa Clara County and Orange County, they have an outsized influence in their Congressional and state legislative districts, and can swing tight elections even in districts where Democrats predominate.\nAnd symbolically, for a Republican Party often accused of neglecting non-white voters, the loss of a key minority voting bloc may continue to hurt the perception of the party as it tries to appeal to other ethnic groups.\nSo how many Vietnamese voters are there, where are they, and why are they important?\nIt’s difficult to get precise estimates, but there’s a little under 300,000 Vietnamese Americans registered to vote, according to an analysis of voter registration data provided by the data warehousing and consulting firm Political Data Inc. That’s less than 2 percent of California’s registered electorate.\nOverall, Vietnamese voters are now more likely to register as Democrats than Republicans, but also more likely to register without a party affiliation than your average Californian. Registration obviously is not a perfect indicator of party loyalty; some polling of Vietnamese California voters shows a much larger share of the population that considers themselves nonpartisan.\nVietnamese voters in California\nThe potency of the Vietnamese vote is apparent in the unique politics of Senate District 34, which spans the cities of Anaheim and Huntington Beach in Southern California. While Democrats own an 8 percentage point advantage over Republicans in registered voters, the district is represented by Republican Sen. Janet Nguyen, a so-called “1.5 generation” Vietnamese-American who emigrated to the United States as a child.\nIn the last election, she cruised to a 17 point victory over her Democratic opponent. That victory was partly because of the district’s large Vietnamese population, which tilt Republican by about 7 percentage points.\n“For Vietnamese Americans, when my name is on the ballot, I believe that whether they’re young or they’re older, they know I understand the struggle,” said Nguyen.\nBut there’s important variation among Vietnamese voters geographically. Interestingly, although Orange County Republican Vietnamese voters outnumber Democrats, the reverse is true in San Jose and other parts of Santa Clara County, where Vietnamese Democrats outnumber Republicans.\nThe generational split among Vietnamese voters is stark. About 4 in 10 Vietnamese voters over age 55 are registered Republicans. That number drops to 1 in 10 among 18 to 34 year-olds. And perhaps more troublingly for the GOP, those younger Vietnamese voters appear more inclined to register Democrat than your average Californian of the same age.\n“Vietnamese Millennial voters in some ways are similar to other Millennials with issues like racial justice and social justice,” says Ramakrishan. “You also have this dynamic, similar to the Cuban community, where anti-communism and U.S. foreign policy have been the dominant issue for the first generation…but for the younger generation, it’s not as big a draw.”\nThe GOP’s “tough on communism” reputation may have less allure for younger U.S.-born Vietnamese with no memory of the Cold War, but that’s not all that’s motivating the shift away from the right.\nVietnamese versus Chinese voters in California\nJanet Nguyen, the Republican state senator from Orange County, also faults past GOP missteps in failing to show enough empathy for low-income Vietnamese households, many of which receive some form of government assistance. Children in those households are now of voting age.\n“Going back to the 90’s, if you came to me and said those on welfare milk the system, that’s offensive to me,” said Nguyen. “That’s what you might see a lot for the younger generation, knowing their family came here extremely poor.”\nThe question of whether the shift is permanent—whether second generation Vietnamese voters remain solidly Democrat throughout adulthood, or whether the GOP has a chance to woo them back—is still up in the air.\n“In terms of being solidly Democrat, I don’t think we’re quite there yet,” says Madison Nguyen, a former San Jose City Councilwoman and Democrat now running for an Assembly seat in Santa Clara. “When it comes to fiscal issues, even with the younger generation, we’re still pretty moderate, very conservative. That has a lot to do with our upbringing, we tend to save what we have rather than just spend what we don’t have.”\nRepublicans hope that younger Vietnamese voters will trend conservative as they age.\nHow will Donald Trump’s candidacy color Vietnamese voters’ impression of the Republican Party? The early returns are mixed. One survey found that Vietnamese voters had a surprisingly high favorability rating of Trump, at least compared to other Asian American groups.\nVietnamese voters have more favorable view of Trump than other Asian Americans\nParsing out the reasons behind that favorability rating is difficult, but several factors may be at play. The same poll found Vietnamese voters to be the Asian American group least in support of accepting Syrian refugees (29 percent supported it, compared to 50 percent for most other groups). Trump’s anti-China rhetoric may also play well among some segments of the population.\nJanet Nguyen, who says she is not voting for either presidential candidate, also says gender could be an issue, with older voters worried Hillary Clinton may not be strong enough to stand up to foreign dictators.\nBut the same polling that found 50 percent of California Vietnamese voters rating Trump favorably also found only 19 percent of Vietnamese voters said they planned to vote for him, compared to 43 percent for Clinton.\n“With some of the comments that he’s made, I’m offended by some of them myself,” says Janet Nguyen. “And when you have to register to vote, and you’re deciding what party you are, you pause and think of the top of the ticket and ask, does this represent me?”\nWhile it’s difficult to find polling specific to Vietnamese attitudes on local state legislative races, asking voters who they would choose between a Democrat and a Republican on a generic Congressional ballot is a decent proxy.\nHere, the news is also not so good for Republicans. Among California’s Vietnamese voters, 45 percent said they’d be more inclined to vote for a Democrat in their district, compared to 35 percent who said Republican.","url":"https://calmatters.org/articles/from-loyal-to-lost-vietnamese-voters-and-the-california-gop/"}
