{"authors":[],"date_download":"2018-10-23 05:15:54","date_modify":"2018-10-23 05:15:54","date_publish":"2014-10-12 00:00:00","description":"The new film Field of Lost Shoes follows a group of VMI cadets who fought at the Battle of New Market. The film is one in a long history of Civil War movies, many of which have been problematic.","filename":"data/vaneerConsumption/FromVMIToJamesIslandHollywoodBattlesToGetTheCivilWarRight.json","image_url":"https://media.npr.org/assets/img/2014/10/10/ap06102409755_wide-df078087b5007dc824f9b074358240a14dcaaa1a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=355186570_1540271754.html","title":"From VMI To James Island, Hollywood Battles To Get The Civil War Right","title_page":"From VMI To James Island, Hollywood Battles To Get The Civil War Right : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nMovies about the Civil War are almost always problematic. Either they're long and boring or an exercise in revisionist history or they leave out a huge part of the story. And a recent movie in theaters now has its own set of problems. The Civil War is just not an easy story to tell in a feature film, as NPR's Elizabeth Blair reports.\nELIZABETH BLAIR, BYLINE: The latest movie about the Civil War, \"Field Of Lost Shoes,\" begins with a slave auction.\n(SOUNDBITE OF FILM, \"FIELD OF LOST SHOES\")\nUNIDENTIFIED MAN #1: (As character) We got all kinds - old ones, young ones, men and women, gals and boys.\nBLAIR: A young white boy watches as an African-American mother is sold away from her children.\n(SOUNDBITE OF FILM, \"FIELD OF LOST SHOES\")\nUNIDENTIFIED WOMAN #1: ((As character, crying) No.\nBLAIR: Then the movie veers off to six years later at the Virginia Military Institute. In real life, VMI cadets were brought in to support Confederate soldiers in New Market.\n(SOUNDBITE OF FILM, \"FIELD OF LOST SHOES\")\nUNIDENTIFIED MAN #2: (As character) All cadets will appear with canteen, blanket and weapon.\nUNIDENTIFIED MAN #3: (As character) At 8 o'clock tomorrow morning, prepare to March.\nBLAIR: There were many casualties among the cadets, but their actions are said to have helped turn the battle into a Confederate victory, albeit a small one. Tom Farrell is the movie's producer and co-writer.\nTOM FARRELL: These young men who were called up under extraordinary circumstances never expected to actually be engaged and came through with great valor.\nBLAIR: During the Civil War, VMI was important to the Confederate cause, training generals and officers to defend the slaveholding south. Yet in the movie, some of the young cadets expressed doubts about why they're fighting.\n(SOUNDBITE OF FILM, \"FIELD OF LOST SHOES\")\nUNIDENTIFIED MAN #4: (As character) We should not be fighting to keep people in chains.\nUNIDENTIFIED MAN #5: (As character) Will you or will you not defend Virginia?\nUNIDENTIFIED MAN #4: (As character) I will defend my family.\nBLAIR: There is some revisionist history going on here, says Hari Jones, a former Marine and the curator of the African-American Civil War museum in Washington, D.C.\nHARI JONES: In some ways I would term the film as a neo-lost cause film - really trying to redeem those who supported succession. And though they admit - and this is why it's neo - they admit that slavery is the issue early on in it, but then it gets into, well, it's really just defending our home from invading forces.\nBLAIR: The original lost cause Civil War movie was the silent epic \"Birth Of A Nation\" from 1915.\n(SOUNDBITE OF FILM, \"BIRTH OF A NATION\")\nBLAIR: The film is considered a great cinematic achievement for, among other things, its sweeping battle scenes. But in the story, African-Americans are depicted as savages brought to justice after the war by a heroic Ku Klux Klan. Robert Eberwein is the author of \"The War On Film.\"\nROBERT EBERWEIN: From a film historian prospective, it's a extraordinary achievement for 1915 even as it induces nausea from the way in which the African-Americans are treated.\nBLAIR: Despite protests from civil rights organizations, \"Birth Of A Nation\" was a box office hit. Many credit the film with a resurgence of the KKK. Whether it's \"Birth Of A Nation,\" \"Gone With The Wind\" or \"The Red Badge Of Courage,\" Hari Jones says most of the major movies made about the Civil War missed a huge part of the story.\nJONES: The African-American story simply wasn't being told.\nBLAIR: Until 1989.\n(SOUNDBITE OF FILM, \"GLORY\")\nMORGAN FREEMAN: (As John Rawlins) Go tell your folks how kingdom come in the year of jubilee.\nBLAIR: \"Glory\" starring Morgan Freeman, Matthew Broderick and Denzel Washington tells the story of the 54th Massachusetts, an all-black regiment that fought with the Union Army. It was directed by Edward Zwick.\nEDWARD ZWICK: What I came to understand is that this had been, in its day, one of the most famous stories in American history. And its presence had been lost in time.\nBLAIR: The 54th Massachusetts held back confederates at James Island in South Carolina and fought at the Battle of Fort Wagner, where many of them killed. Glory won three Oscars, including Best Supporting Actor for Denzel Washington. But there was also criticism - that the story was largely told from a white man's point of view. The movie centers around the 54th's white commander, Colonel Robert Gould Shaw. The other criticism is that it depicted the African-American soldiers in the 54th as runaway slaves who had no military training - not so says Hari Jones.\nJONES: Most of the soldiers were well-trained, and Robert Gould Shaw writes that. Yet in the movie, they bring in an Irish drill sergeant to teach them how to drill.\n(SOUNDBITE OF FILM, \"GLORY\")\nJOHN FINN: (As Sgt. Maj. Mulcahy) For God's sakes, man, you march like a bunch of crippled old goats. We're going to be here day and night until we get this right.\nBLAIR: But \"Glory\" was a breakthrough says Jones.\nJONES: The importance of \"Glory\" is the advertisement that brings us to the question of African-American service during the Civil War.\nBLAIR: A question, Hari Jones says, even the large academic institutions haven't fully explored. But compelling, true stories are out there, he says. Take the real-life Abraham Galloway, who escaped slavery and then became a union spy.\nJONES: Galloway is like the super secret agent who travels from North Carolina to the Mississippi River Valley, gets captured by the confederates, escapes, takes on two or three men at one time. He's that kind of a guy. But he's almost unbelievable 'cause he's been left out of the narrative for so long.\nBLAIR: One movie that Hari Jones says has helped him teach Galloway's story is Quentin Tarantino's \"Django Unchained,\" a pre-Civil War western where the hero is a freed slaves who gets bloody revenge on white slave owners.\n(SOUNDBITE OF FILM, \"DJANGO UNCHAINED\")\nJAMIE FOXX: (As Django) Last time I saw you, you had your hands on my (gunshot).\nBLAIR: After \"Django Unchained\" came out, Hari Jones was at a middle school talking about Abraham Galloway.\nJONES: And one of the students yelled from the audience, yes, Django. So in his mind now he had an image of an African-American who could perform in such a way.\nBLAIR: Almost 150 years later, it took an audacious spaghetti western to spark an interest in Civil War history that hasn't yet been widely told. Elizabeth Blair, NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=355186570"}
