{"authors":["Breitbart London"],"date_download":"2018-10-30 19:30:00","date_modify":"2018-10-30 19:30:00","date_publish":"2016-09-15 15:58:03","description":"23,000 migrants arrived in Italy in August, most crossing the Mediterranean on what has become the main immigration route into Europe.","filename":"data/vaneerConsumption/Frontex23000MigrantsReachedItalyInAugust.json","image_url":"https://media.breitbart.com/media/2016/09/italian-migrants.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_09_15__1540927800.html","title":"Frontex: 23,000 Migrants Reached Italy In August","title_page":"Frontex: 23,000 Migrants Reached Italy In August","title_rss":"NULL","source_domain":"breitbart.com","text":"BRUSSELS, Sept 15 (Reuters) – Some 23,000 irregular migrants arrived in Italy in August, the European Union’s border agency said on Thursday, most crossing the Mediterranean on what has become the main immigration route into Europe.\nThe vast majority of the 117,900 people who arrived in Italy this year came by boat from Libya. The Frontex agency said the numbers were similar to those in 2015.\nRescuers pulled some 650 migrants to safety and recovered five dead bodies from boats in difficulty off the coast of Libya on Wednesday, Italy’s coastguard said.\nGreece was the main point of entry for refugees and migrants in 2015, when some 1.3 million people reached the European Union, triggering bitter and unresolved disputes in the bloc over how to handle the influx.\nSince Turkey agreed to prevent people from setting sail for Greece from its shores, the numbers taking that route have fallen dramatically. Frontex said some 3,430 people reached Greek islands from Turkey last month, only about three percent of the number in August, 2015.\n“However, August also saw a first noticeable monthly increase since the EU-Turkey statement came into effect,” Frontex said. “In July, the number of detections stood at 2,030.”\nThose taking the Greek route tend to be from Syria, Pakistan, Afghanistan or Iraq, while the Italian route is dominated by Nigerians, Eritreans and Bangladeshis, Frontex said.\nThe EU is working with African countries to step up returns and has said it will make aid conditional on keeping a lid on migration to Europe.\n(Reporting by Gabriela Baczynska; editing by Andrew Roche)","url":"https://www.breitbart.com/europe/2016/09/15/frontex-23000-migrants-reached-italy-august/"}
