{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:44:19","date_modify":"2018-10-30 23:44:19","date_publish":"2014-08-13 13:52:26","description":"Let's play a game of word association. When I say Frozen, what immediately comes to mind? If you say Disney, Elsa, Once Upon a Time, or even snow, then you're just like everybody else. If you say Fifty Shades of Grey, then welcome to the cool people…","filename":"data/vaneerConsumption/FrozenParodyofFiftyShadesofGreyWillTraumatizeYourInnerChildVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/51aae04f-3334-4295-b439-61e84cf4f795.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35574-frozen-parody-of-fifty-shades-of-grey-will-traumatize-your-inner-child-video_1540943059.html","title":"'Frozen' Parody of 'Fifty Shades of Grey' Will Traumatize Your Inner Child - VIDEO","title_page":"'Frozen' Parody of 'Fifty Shades of Grey' Will Traumatize Your Inner Child — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Let's play a game of word association. When I say Frozen, what immediately comes to mind? If you say Disney, Elsa, Once Upon a Time, or even snow, then you're just like everybody else. If you say Fifty Shades of Grey, then welcome to the cool people club. Somehow, some way, one fan decided that what the world really needs in a land of increasingly derivative Frozen parodies and the hot and bothered women going through their daily lives counting down the seconds until the Fifty Shades of Grey movie comes out is a video that combines the two into the only trailer you will ever need to watch for the rest of your life. The trailer, called Fifty Shades of Frozen, is the right mash up of sexy and creepy — just like Fifty Shades of Grey.\nAnna plays the role of the naive, virginal Ana Steele who has to visit Christian Grey, aka Prince Hans, for an interview that will change both of their lives. When Elsa asks Anna what Hans was like, Anna flashes back to their meeting and Prince Hans emphatically telling her that he is looking at her. Then, as we montage through Anna and Hans' relationship, Hans soon reveals that he's not the romance type. In fact, his tastes are so singular that they include a visit to a dungeon, knifeplay, and some sort of ice kink that it's really better not to think too hard about.\nIt's really unclear which is worse: the fact that these clips from Frozen sync up so well with the dialogue of the Fifty Shades of Grey trailer or the fact that someone watched the Fifty Shades of Grey trailer and thought, \"You know what would go really well with this? Frozen!\" Either way, you probably shouldn't let your children click their way to this parody because even knowing what a creepy villain Hans is doesn't make Beyoncé crooning \"uh oh uh oh uh oh ooh-no no\" any less sexy. And if you find yourself thinking this should be a real movie, well, I can't help you.\nWatch the trailer below.\nTranceart Violeta on YouTube\nImage: YouTube","url":"https://www.bustle.com/articles/35574-frozen-parody-of-fifty-shades-of-grey-will-traumatize-your-inner-child-video"}
