{"authors":[],"date_download":"2018-10-22 21:35:29","date_modify":"2018-10-22 21:35:29","date_publish":"2014-06-05 17:48:44","description":"The popularity of the Disney movie \"Frozen\" is motivating fans to visit Norway to see the landscape that inspired the animated movie setting.","filename":"data/vaneerConsumption/FrozenFrenzyInspiresTripstoNorway.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490346/140605-frozen-movie-1436_c78562336a471ecbde6619e6b58e8e7e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_frozen-frenzy-inspires-trips-norway-n123746_1540244129.html","title":"'Frozen' Frenzy Inspires Trips to Norway","title_page":"'Frozen' Frenzy Inspires Trips to Norway","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"We noticed a huge increase from the U.S. already in November and December last year, just after we started our marketing with Disney in October,\" Hansen said.\nHansen said that the increase in traffic is most noticeable in the fjord region, but that there is also more interest in Oslo and Northern Norway, where visitors can see the northern lights — a phenomenon that is also shown in the movie.\nNorwegian Air has also just begun flying direct to Oslo from Orlando, Florida, the airport nearest Disney World.\nThe Disney tour company Adventures by Disney is taking fans on a series of eight-day trips to Norway this year, priced at more than $5,000 a person, including a visit to Geirangerfjord, the fjord that inspired the film's fantasy kingdom of Arendelle. And Disney Cruise Line plans a Norway itinerary for 2015.\nWilderness Travel, another tour company that runs trips to Norway, has also seen an uptick in interest. Even though Wilderness Travel has no formal connection to the movie, \"the film seems to be a big part of the popularity,\" said spokeswoman Barbara Banks.\nSheridan Becker, an American mother of two who's currently living with her family in Barcelona, says she and her kids are planning a trip to Norway \"all because of 'Frozen' — our favorite Disney move at the moment.\"\n— The Associated Press","url":"https://www.nbcnews.com/business/travel/frozen-frenzy-inspires-trips-norway-n123746"}
