{"authors":[],"date_download":"2018-10-30 14:26:51","date_modify":"2018-10-30 14:26:51","date_publish":"2015-01-24 00:00:00","description":null,"filename":"data/vaneerConsumption/FruitLoopObamasPeculiarPriorities.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_01_fruit_loop_obamas_peculiar_priorities_1540909611.html","title":"'Fruit Loop' Obama's Peculiar Priorities","title_page":"'Fruit Loop' Obama's Peculiar Priorities","title_rss":"NULL","source_domain":"americanthinker.com","text":"However, while the Big Apple was steeped in unbearable heartache, with a heavy heart about being otherwise committed and under much emotional duress, a greatly shaken Obama and the first lady did manage to soothe their grief with a $1,000-a-couple dinner at the swanky Hawaiian Vintage Cave .\nBarack Obama is a man who painstakingly sets his priorities. Take, for instance, the recent funerals of two NYPD officers who were shot in the head by a radical Islamist thug as they sat in their parked police cruiser. Sadly, the president was not able to attend either Officer Ramos’s or Liu’s funeral.\nThen there was the terrorist attack in France that killed 17 people. Following the bloodshed, a million-person march descended on Paris. French President Francois Hollande and 44 foreign dignitaries, including leaders from Germany, Italy, Britain, Turkey, Israel, and the Palestinian territories, attended the protest.\nOne would think that not even another fundraiser in Gwyneth Paltrow’s backyard could stop Barack ‘Citizen of the World’ Obama from participating in the show of unity. But again, unfortunately, the president was mysteriously engaged elsewhere, possibly doing whatever he was doing on the night of the Benghazi attack.\nNo matter which way you slice it, Barack Obama is a very busy man with an ever-growing list of concerns to attend to.\nConsider all the time it takes for him to finagle free college tuition for 13th and 14th grade, or to plot how to veto Republican sanctions against Iran. Then there’s the effort he’s investing in releasing every last Islamic insurgent from Gitmo in time for them to get back on the battlefield to do some real damage, and the blood, sweat, and tears it takes to reprimand anyone who says the forbidden words: “Islamic terrorist.”\nThere are only so many hours in a day to clean up the planet and punish overachievers. Moreover, it’s probably Barack Obama himself who chases down and recruits former Democrat campaign staffers to play down-and-out housewives at State of the Union addresses.\nAnd let’s not forget -- when he’s not “fixing” our “broken” healthcare system, Obama is actively about the business of decimating our military, upping the minimum wage on behalf of the “hardest working people in America,” waving millions of illegal immigrants with infectious diseases across the border, and purposely contributing to racial unrest.\nAs if all that effort and responsibility isn’t enough to tucker one man out, now in the midst of “fundamentally transforming the United States of America,” without consulting the president, Republican Speaker of the House John Boehner goes and invites Bibi Netanyahu to address a joint session of Congress on the dangers posed to Israel and the U.S. by Islamic extremism and a nuclear Iran.\nWhy, pray tell, does the Israeli prime minister have to issue this cautionary tale? After all, when and if he decides to, the president will be more than able to convince Iran to do things like release the imprisoned Christian pastor Saeed Abedini. In like manner, with a minimal amount of mediation on his part, an amicable Iran will also happily submit when Obama politely requests that they relinquish their nuclear ambitions.\nThat’s why, when the Israeli prime minister arrives in America, there is absolutely no reason to cut into the president’s packed schedule to meet with a man who was once left sitting in a White House meeting room for daring to defy Obama’s Palestinian-friendly wishes concerning Jewish construction in East Jerusalem.\nTo sum up, the president has no time to attend the funerals of slain police officers, or stand in solidarity with world leaders against radical Islamic terrorism, or waste time feigning hospitality toward allies like France, or worse yet, Bibi Netanyahu’s Israel.\nGone are the days of frivolous #bringbackourgirls hashtags. Instead, Barack Obama attends to truly pressing issues by granting interviews to #YouTubeAsksObama.\nSo, while House Republicans and an incensed Bob Menendez (D-NJ) look forward to gleaning insight from Benjamin Netanyahu, Obama, a man who’s certain his priorities are in order, chats it up with the likes of Hank Green. Hank, together with his brother John Green, author of The Fault in our Stars, rants on YouTube about “Harry Potter, Hong Kong, net neutrality and farting.”\nWhile ISIS lines up teenage boys in front of firing squads for watching soccer games and Boko Haram kills thousands, with her green lipstick and occasional Ebonics the self-proclaimed “Queen of YouTube,” comedian and Internet sensation GloZell Green interviews the president.\nThe buxom GloZell is renowned for YouTube videos such as My Push up Bra will help me get my man; How to Draw Perfect Eyebrows; and GloZell’s Cereal Challenge, where the curvy woman with the unruly curls writhes around in a bathtub filled with Fruit Loops and milk.\nSad to say, but at this juncture it seems natural to utter the words Obama and Fruit Loops in the same sentence.\nNonetheless, during the mesmerizing interview, reminiscent of Obama’s “if I had a son” Trayvon Martin reference, GloZell told the president that, to keep her husband from getting shot by the “po-po,” she cut the hoods off all his hoodies.\nFinally, Derek Hough’s dramatic paso doble partner on \"Dancing with the Stars\" last season, Bethany Mota, also gabbed with the president, who, by the way, did some dancing of his own with Ellen DeGeneres.\nVia YouTube, Bethany announced that she put up Christmas decorations right after Halloween because she “...just decided that [her] room looked really sad.”\nSpeaking of “really sad,” that’s pretty much how Barack Obama has made America look on the world stage.\nAnd so, short of volunteering to inflate deflated footballs or bowing to international protocol and flying off to Saudi King Abdullah’s funeral, as usual, while the world burns Barack Obama believes he has his priorities in order.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2015/01/fruit_loop_obamas_peculiar_priorities.html"}
