{"authors":["Press Association"],"date_download":"2018-10-22 20:37:53","date_modify":"2018-10-22 20:37:53","date_publish":"2016-01-28 02:26:22","description":"Eating fruit and vegetables that are high in a key compound - such as apples, pears, blueberries, strawberries and radishes - may help prevent weight gain. R...","filename":"data/vaneerConsumption/Fruitandveghighinflavonoidsmayhelppreventweightgain.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-1c485f09-3c9d-47d3-b8d9-8af9d81f662b-2vdWmEltwXfba0ce28e6322cc1e8-281_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420309_Fruit-veg-high-flavonoids-help-prevent-weight-gain_1540240673.html","title":"Fruit and veg high in flavonoids may help prevent weight gain","title_page":"Fruit and veg high in flavonoids may help prevent weight gain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fruit and veg high in flavonoids may help prevent weight gain\nEating fruit and vegetables that are high in a key compound - such as apples, pears, blueberries, strawberries and radishes - may help prevent weight gain.\nResearch from Harvard University and the University of East Anglia has found that fruit and vegetables with high levels of flavonoids could help people maintain a healthy weight.\nEven a single 80g serving of the fruit or veg per day may improve health.\nFruit such as apples and pears are high in flavonoids\nFlavonoids are plant compounds found in various foods and drinks, including a wide range of fruit and vegetables, tea, chocolate and wine.\nThey have long been celebrated for their antioxidant effect which is thought to help prevent cell damage.\nIn the study, published in the British Medical Journal (BMJ), experts examined data for 124,086 men and women in the US over a 24-year period.\nThey found that consuming just a small amount of flavonoids was linked with maintaining a healthy weight, and even losing a little.\nThe research focused on three large groups of people - one featuring women with an average age of 36 at the start of the study, another with women aged 48, and the third for men with an average age of 47.\nProfessor Aedin Cassidy, from UEA's Norwich Medical School, said: \"This is the first large study to examine the associations between consumption of all flavonoids and weight gain in middle-aged and older adults.\n\"Most adults gain weight as they age and even small increases in weight can have a substantial impact on risk of high blood pressure, developing heart disease, cancer or diabetes - so strategies to help individuals maintain a healthy weight in middle-age are needed.\n\"We found that an increased consumption of most flavonoids was associated with weight maintenance, and even a modest weight loss. The results were found to be consistent across men and women, and different ages.\n\"However losing even small amounts of weight, or preventing weight gain, can improve health and these modest effects were seen with a small, readily achievable increase in intake of many of these fruits.\n\"Just a single portion of some of these fruits per day would have an important impact on health at a population level.\"\nProf Cassidy said the strongest links were found for foods containing anthocyanins, which are found in blueberries, strawberries, cherries, blackberries, grapes, radishes and blackcurrants.\nHe said: \"We also found that flavonoid polymers - found in tea and apples - were particularly beneficial, along with flavonols - found in tea and onions.\"\nThe experts found that consuming just a small amount (a standard deviation) of flavonoids was linked to maintaining a healthy weight, and even a very small weight loss (0.1kg or 0.22lb).\nHowever, they said many fruits provide more than one standard deviation increase - for example a single serving of blueberries contains up to 121mg of anthocyanins and tea contains a range of flavonoids, including flavonols, flavan-3-ols and their polymers.\nThis means that choosing flavonoid-rich fruits and vegetables could help people shed up to 1lb or 2lb, the team said.\nProf Cassidy said: \"People tend to put on weight as they get older. But we found that people who ate a few portions of flavonoid-rich fruits and vegetables a week maintained a healthy weight, and even lost a little.\n\"We hope that the results will help refine previous dietary recommendations and provide guidance on which specific fruits and vegetables to choose for preventing obesity and its potential consequences.\n\"Losing or preventing even small amounts of weight can reduce the risk of diabetes, cancer, hypertension and cardiovascular disease.\"\nProf Cassidy said that in the US, most people consume less than one cup of fruits and less than two cups of vegetables per day.\n\"This is below the recommended daily intake and should be increased to two cups of fruits, and two and a half cups of vegetables - which equates to the UK's recommended 'five-a-day',\" he said.\n\"And people may be able to improve the health benefits of eating fruit and vegetables by choosing those including high levels of flavonoids, such as apples, pears and berries.\"\nTracy Parker, dietitian at the British Heart Foundation, said: \"Although the mechanisms of the benefit of eating fruit and vegetables are not well understood, this study suggests that eating fruit and vegetables that contain high levels of flavonoids, such as apples, pears, berries, and peppers, could help people maintain a healthy weight.\n\"We know that even small increases in weight can have a substantial impact on risk of high blood pressure, developing heart disease, cancer or diabetes. Eating a balanced diet high in fruit and vegetables along with regular physical activity is an essential part of maintaining a healthy weight.","url":"https://www.dailymail.co.uk/wires/pa/article-3420309/Fruit-veg-high-flavonoids-help-prevent-weight-gain.html"}
