{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 19:51:33","date_modify":"2018-10-30 19:51:33","date_publish":"2014-12-29 19:31:41","description":"Florida State quarterback Jameis Winston insists he's a \"good guy.\" |","filename":"data/vaneerConsumption/FSUQBJameisWinstonImaGoodGuy.json","image_url":"https://media.breitbart.com/media/2014/12/jameis-winston.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2014_12_29__1540929093.html","title":"FSU QB Jameis Winston: I'm a Good Guy","title_page":"FSU QB Jameis Winston: I'm a Good Guy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Florida State quarterback Jameis Winston insists he’s a “good guy.”\n“People always can bring up old things but now I’m doing what I do,” Winston told reporters at a Sunday press conference. “I’m a loving person — I’m loving my teammates. I’m dependable. I’m accountable. I can’t show out to the world that I’m that guy because you’re not in the locker room and a lot of people don’t know me for who I am.”\nWinston’s Seminoles take on Marcus Mariota’s Oregon Ducks in the Rose Bowl on New Year’s Day in a game showcasing the likely first picks of the NFL’s 2015 Draft. The victor plays the winner of Ohio State-Alabama for the national championship. And the winning quarterback will likely find himself under the microscope of the Tampa Bay Buccaneers.\nWinston hasn’t lost a game in two seasons as Florida State’s starting QB. He hasn’t won a public relations break.\nThough a state attorney declined to prosecute him and a retired state judge overseeing an FSU code of conduct hearing cleared him, Winston remains a reviled figure because of a rape accusation made against him by a former Florida State student. Store security capturing him heisting crab legs earlier this year, a BB-gun war his freshman year leaving thousands of dollars in broken windows and damaged property, and an incident this season in which last year’s Heisman winner loudly repeated a vulgar catchphrase involving a word that rhymes with truck and another name for a cat have combined to sully Winston’s reputation.\nAnd given the NFL’s public relations problems with Adrian Peterson, Ray Rice, and other star players, the sophomoric red-shirt sophomore’s public relations problems may hurt him come draft day. Particularly when juxtaposed with Mariota, a humble–meek almost–dual pass-run threat, Winston looks good for the part of the bad boy.\n“Perception is reality,” Winston concedes. “But perceptions can also be false.”","url":"https://www.breitbart.com/sports/2014/12/29/fsu-qb-jameis-winston-im-a-good-guy/"}
