{"authors":["Will Martin"],"date_download":"2018-10-30 20:40:53","date_modify":"2018-10-30 20:40:53","date_publish":"2016-12-28 00:00:00","description":"The FTSE closed up by 0.54% to end the day at 7,106.08. That's its best ever closing price, passing the previous high of 7,103.98 points achieved in April 2015.","filename":"data/vaneerConsumption/FTSE100marketmovementsAlltimehighDecember28.json","image_url":"https://amp.businessinsider.com/images/5863efc7dd0895bc1f8b4a6a-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ftse-100-market-movements-all-time-high-december-28-2016-12_1540932053.html","title":"FTSE 100 market movements: All-time high, December 28","title_page":"    FTSE 100 market movements: All-time high, December 28 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain's benchmark share index, the FTSE 100, closed at an all-time high on Wednesday, the first day of trading after the Christmas break.\nThe FTSE closed up by 0.54% to end the day at 7,106.08. That's the FTSE's best ever closing price, surpassing the previous high of 7,103.98 points achieved in April 2015.\nHere's the FTSE's chart at the close:\nGoogle Finance\nThe record-breaking rally comes as the US dollar continues to strengthen against the pound. The greenback is currently around 0.4% higher against sterling on the day. The pound has weakened ever since the June Brexit vote.\nThough a weaker pound might seem like bad news for UK stocks, about 70% of the revenue earned by the companies that make up the FTSE 100 is derived abroad, meaning they make more money when sterling is weak. That is because the index is full of mining companies, oil firms, and pharmaceutical giants that use the UK as a base but tend to denominate their assets in dollars. Exporters also prefer a weak pound: It makes their goods cheaper than international competitors.\nEssentially, when the pound does badly, the FTSE does well, as evidenced by the near 20% gain in the index since it crashed on the day after Britain's June vote to leave the European Union. At the same time, the UK economy has stayed surprisingly strong. Economists predicted a recession immediately after the Brexit vote, but that never happened. So the FTSE is currently reflecting the best of all worlds: A strong economy coupled to a weak pound.\nUK-listed mining companies led the FTSE's charge on Wednesday, with the likes of BHP Billiton, and gold miners Fresnillo and Randgold Resources all up more than 4% as commodity prices rise on the dollar's strength.\nEarlier on Wednesday Mike van Dulken of Accendo Markets said in an emailed market update: \"The FTSE is boosted by higher oil prices supporting the commodities space, offsetting weakness among some big defensives, airlines (Airbus problems) and real estate (rates to rise and prices to fall in 2017?).\"\nChris Beauchamp, the chief market analyst at IG added: \"The FTSE 100 is the star performer today, helped on its way higher by an excellent turn from the index's mining contingent. The sector was one of the really big winners in 2016, making a remarkable comeback over the past twelve months, and it makes sense to think that investors are looking to juice a few more points out of the rally as the year-end approaches.\"\nThe index previously broke its intraday high earlier this year. At lunchtime on October 11, the index hit 7,128 points, surpassing its previous intraday high of 7,123. It then slumped as the day progressed, eventually closing well below its highs.\nElsewhere in Europe, stocks were broadly pretty subdued, with only Italy's FTSE MIB moving significantly on the day. Here's the scoreboard:","url":"https://www.businessinsider.com/ftse-100-market-movements-all-time-high-december-28-2016-12"}
