{"authors":["Will Martin"],"date_download":"2018-10-30 20:35:10","date_modify":"2018-10-30 20:35:10","date_publish":"2016-12-29 00:00:00","description":"Britain's benchmark share index, the FTSE 100, closed at an all-time high for the second consecutive day.","filename":"data/vaneerConsumption/FTSE100pricemovementsonThursdayDecember29.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ftse-100-price-movements-on-thursday-december-29-2016-12_1540931710.html","title":"FTSE 100 price movements on Thursday December 29","title_page":"    FTSE 100 price movements on Thursday December 29 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Cathal McNaughton Britain's benchmark share index, the FTSE 100, closed at an all-time high for a second consecutive day on Thursday, as UK stocks continue to soar on the back of the weak pound.\nDespite the new record, it was actually a spectacularly uneventful day in the markets and the record was achieved thanks to a gain of just 0.2%, or roughly 14 points.\nOn Wednesday, the index closed at 7,106.08, surpassing the previous high of 7,103.98 points achieved in April 2015. Thursday's new closing high was 7,120, according to data from Google Finance.\nTrading volumes on Thursday were incredibly thin with the majority of City traders enjoying time-off in the week between Christmas and New Year.\nRoughly 245 million shares traded across all the companies on the index on Thursday, while the FTSE's average over the past three months has been just shy of 900 million. Regardless, an all-time high is an all-time high.\nHere's the chart showing the FTSE's new peak: Google Finance UK stocks have taken off since the vote for Brexit, gaining more than 15% since the days before the referendum. This may seem like fantastic news for the British economy, but it has largely been driven by the weakness of the sterling since June 23rd.\nThough a weaker pound might seem like bad news for UK stocks, about 70% of the revenue earned by the companies that make up the FTSE 100 is derived abroad, meaning they make more money when sterling is weak. The index is full of mining companies, oil firms, and pharmaceutical giants that use the UK as a base but tend to denominate their assets in dollars. Exporters also prefer a weak pound: It makes their goods cheaper than international competitors.\nThe FTSE is yet to break past its intraday record, which was broken earlier in 2016. At lunchtime on October 11, the index hit 7,128 points, surpassing its previous intraday high of 7,123.","url":"https://www.businessinsider.com/ftse-100-price-movements-on-thursday-december-29-2016-12"}
