{"authors":["Will Martin"],"date_download":"2018-10-30 20:31:29","date_modify":"2018-10-30 20:31:29","date_publish":"2016-12-30 00:00:00","description":"Markets closed with the FTSE ending 2016's final trading day at 7,142 points — more than 20 points higher than the previous closing high.","filename":"data/vaneerConsumption/FTSE100pricemovementsonFridayDecember30.json","image_url":"https://amp.businessinsider.com/images/58665ea9dd08952b208b4af7-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ftse-100-price-movements-on-friday-december-30-2016-12_1540931489.html","title":"FTSE 100 price movements on Friday December 30","title_page":"    FTSE 100 price movements on Friday December 30 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Jason Cairnduff\nThe FTSE 100, Britain's benchmark share index, hit a fresh closing high in trading on Friday, marking the third time in three days that the index has broken all-time highs.\nIn the final minutes before trading finished for the day at 12.30 p.m. GMT — Friday is a half day in the UK markets — the FTSE popped its head above the previous record intraday high of 7,123, reached on October 11 this year.\nMarkets then closed with the FTSE ending 2016's final trading day up just over 0.3% at 7,142.83 points— more than 20 points higher than yesterday's closing high, and close to 20 points higher than the previous intraday peak.\nHere's Google's chart:\nGoogle\nEarlier this week, the index hit record closing highs on both Wednesday and Thursday.\nFriday's close means that Britain's blue-chip index finished the year roughly 14.4% higher than it started, despite the political turmoil that has engulfed 2016. That makes 2016 the best year in three for the FTSE 100.\nUK stocks have actually taken off since the vote for Brexit, almost 15% since the days before the referendum. This may seem like fantastic news for the British economy, but it has largely been driven by the weakness of the sterling since June 23rd.\nThough a weaker pound might seem like bad news for UK stocks, about 70% of the revenue earned by the companies that make up the FTSE 100 is derived abroad, meaning they make more money when sterling is weak. The index is full of mining companies, oil firms, and pharmaceutical giants that use the UK as a base but tend to denominate their assets in dollars.\nSo good has the fall in the pound been for miners and commodity companies that eight of the ten top performing stocks on the FTSE 100 this year were either oil or mining companies.","url":"https://www.businessinsider.com/ftse-100-price-movements-on-friday-december-30-2016-12"}
