{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:50","date_modify":"2018-10-30 22:52:50","date_publish":"2016-06-12 08:00:00","description":"When 27-year-old Juan Valentin became old enough to get behind the wheel, a friend gave him driving lessons in the agricultural fields surrounding","filename":"data/vaneerConsumption/Fuelingthedreamsoftheundocumented.json","image_url":"https://calmatters.org/wp-content/uploads/JuanValentin_15_1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939970.html","title":"Fueling the dreams of the undocumented","title_page":"Fueling the dreams of the undocumented | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When 27-year-old Juan Valentin became old enough to get behind the wheel, a friend gave him driving lessons in the agricultural fields surrounding Stockton. As an undocumented immigrant from Tijuana, Mexico, Valentin spent the next 10 years driving without a license. In order to get to school or to work, he felt he had little choice.\n“Do you work or do you not work?” said Valentin, who spent many seasons picking grapes and bell peppers, and is now a warehouse worker for a local food producer. “Do you bring food to the table for your kids or not?”\nValentin said every time he drove a car, he had to look over his shoulder. “‘What if I got pulled over, what if I have to walk home? What if I got my kids with me?’”\nValentin had reason to worry. He says his father was deported to Mexico after being pulled over on his way to Washington State to pick cherries about 10 years ago. Valentin himself was cited twice for driving without a license. His car was impounded each time. The second time, he couldn’t afford the $1,500 fee to recover his car. For several months, friends and family gave him rides to and from work while he saved money to buy another vehicle.\nSo when California started allowing undocumented people to get driver’s licenses in January 2015, Valentin signed up. He’s now one of roughly 700,000 undocumented immigrants who have a California driver’s license.\n“My life has gotten so much easier,” he said.\nAmid this election year’s highly charged debate over immigration policies, California stands out for the many rights state lawmakers have granted to an estimated 3 million undocumented residents. The suite of policies goes far beyond driving privileges, providing freedom of movement, work opportunities and protections, access to healthcare coverage and financial assistance for higher education.\nVoices of the undocumented Students speak on how their lives have changed since an executive order by President Obama and policies by California lawmakers.\nResearch suggests that undocumented immigrants give back to the economy. The nonpartisan Washington D.C.-based Institute on Taxation and Economic Policy estimates undocumented immigrants in California contribute more than $3.1 billion annually in state and local taxes.\nKarthick Ramakrishnan, a professor of public policy at the University of California, Riverside, argues that California lawmakers have created the “life chances and free presence” that is out of reach to the undocumented in other states.\n“Over time, (when these policies) accumulate, they start to become so meaningful that they start approximating the kinds of things you might expect from full-blown political membership,” said Ramakrishnan, who has written about California’s immigration policies heading toward “de facto state citizenship” for undocumented immigrants.\nCalifornia has passed immigrant friendly policies since 2001, when undocumented students were given the right to in-state tuition at California public universities and community colleges. But the number and scope of state measures aimed at helping the undocumented assimilate into daily California life have ballooned in the past few years.\nUndocumented children can now get full Medi-Cal coverage, and young adults can get state-funded grants for higher education. Healthcare providers and other professionals cannot be barred licenses to practice in California because of their immigration status. Other measures protect the undocumented by barring law enforcement from detaining people solely because of their immigration status, and preventing employers from checking the legal status of existing employees as well as applicants who have not been offered a job.\nReview state measures granting rights, opportunities and protections to undocumented immigrants. Highlights of state measures granting unauthorized immigrants rights, protections and opportunities. 1996 Prenatal care available for all low-income residents, regardless of legal status. 2001 In-state tuition at public universities approved for undocumented students who attend high school in California for three or more years. 2007 Cities may not require landlords to check whether tenants are in the country legally. 2011 Access to state financial aid granted for undocumented students at public universities and community colleges. State, cities and counties may not require that private employers use E-Verify, a federal program for checking workers’ immigration status. 2012 Those who qualify for President Obama’s Deferred Action for Childhood Arrivals (DACA) order may apply for a California driver’s license as well as Medi-Cal, the state’s health care coverage for the poor. 2013 All undocumented immigrants may apply for a driver’s license. Local law enforcement agencies may not detain people for deportation if they are arrested for a minor crime and eligible to be released from custody. 2014 College students who qualify for may apply for state-funded loans. Undocumented immigrants who pass the State Bar exam may practice law in California. All 40 state licensing boards — for doctors, dentists, security guards, etc — must consider applicants regardless of immigration status. 2015 Comprehensive health care provided to all low-income children, regardless of immigration status. Unauthorized immigrants are protected from deportation if they are victims of certain crimes and cooperate with police. Sources: UC Riverside School of Public Policy, California Department of Health Care Services\nThe federal government has played an important role in allowing California to become more accommodating to the undocumented, Ramakrishnan said, starting with President Obama’s 2012 executive action to allow undocumented young people nationwide to get a temporary stay from deportation, a policy known as DACA (Deferred Action for Childhood Arrivals).\nOther factors pushed California in a pro-immigrant direction. Immigrants rights groups have helped elect leaders supportive of their cause, Ramakrishnan said. New legislative leadership, some with a large Latino population in their district, tout the economic contributions of the undocumented, and say California is filling the void on immigration policymaking at the federal level. Gov. Jerry Brown has approved many of the measures, saying he supports bringing undocumented immigrants “out of the shadows.”\n“You have many folks who are the children of immigrants who are now holding positions of leadership, trying to drive good policy forward,” said state Senate President Pro Tem Kevin de Leon (D-Los Angeles).\nIndeed, state Sen. Ricardo Lara (D-Los Angeles), who has carried bills to give new benefits to the undocumented, is the son of parents who were once unauthorized. Brown recently signed one of Lara’s measures; if approved by the federal government, it would allow the undocumented to buy heath insurance through the state-run marketplace, Covered California, without public subsidies.\n“We have many immigrants who are here to stay,“ de Leon said. “Let’s educate their children, let’s make sure their children are productive citizens that they can contribute to the economy of California.” In March 2016, the governor appointed a director of immigrant integration to oversee new services for the undocumented. He approved $15 million of this fiscal year’s state budget for the “One California” initiative, which helps the undocumented naturalize or benefit from DACA.\n“California is leading the vanguard of states that have been going in a pro-integration direction,” said Randy Capps, director of U.S. Programs of the Migration Policy Institute, a nonpartisan, nonprofit think tank in Washington, D.C. “There are also some states that are moving in the opposite direction right now.”\nIn recent years, Capps said, states such as Texas have tightened border security and enhanced cooperation between local law enforcement and federal immigration officials. Texas officials have also refused to issue birth certificates to Texas-born children of the undocumented, he said. Other states have also restricted benefits to the undocumented, such as prohibiting in-state tuition.\nWhile keeping undocumented immigrants away from U.S. borders and out of taxpayer-funded benefit programs is a central part of the national Republican platform, among California’s GOP, the tone is softer and the voting record is mixed. When California’s minority Republican lawmakers do oppose pro-immigrant legislation, their arguments focus on scarcity of resources.\n“We don’t have enough revenue to take care of every citizen in the State of California,” state Sen. Jeff Stone (R-Riverside) said during a June 2015 debate in the Legislature about a budget proposal to allow undocumented kids in Medi-Cal, the state’s healthcare program for the poor.\n“So I will opine that we should take care of the citizens that are legally here in the State of California.”\nThe conservative-leaning Hoover Institution at Stanford University touts the economic value of immigration. Carson Bruno, a Hoover research fellow, said more people are leaving California than settling here, and he supports measures that enable immigrants to be more productive.\n“Whether it’s high-skilled immigrants who are really driving the new entrepreneurial ventures in Silicon Valley, or if it’s the low-skilled immigrants who really are very important to the agricultural and hospitality industry, immigrants on the net are economic drivers for the state,” Bruno said.\nHowever, Bruno says California should be careful not to allow its policies to become a magnet for illegal immigration, and should evaluate the economic and human impact of its immigration policies.\nIn the coming years, granting more rights and benefits to immigrants — such as voting privileges, serving on juries or running for office — will be a tougher battle, Ramakrishnan predicts. Proposals to expand Medi-Cal to hundreds of thousands of undocumented adults comes with a high price tag, and will have to compete with other budget priorities.\n“The chances of big changes … are smaller,” Ramakrishnan said.\nBut the policy changes California has made so far have already made a difference to Juan Valentin. Since he got his driver’s license last year, he no longer limits his driving to work and getting necessities. He says he now takes trips with his family to the Sacramento Zoo and the coastal town of Santa Cruz.\n“(California laws) have allowed us to be here and feel more a part of the community.” Valentin said.\nIt wasn’t as easy for his parents to acclimate to American society, he said. Their lives consisted only of going to work and staying home. They “didn’t look towards the future,” he said.\nValentin’s 19-year-old sister, Valeria, is already going beyond the walls of work and home. Under President Obama’s executive immigration action, she has temporary legal status. She attended college this year, and was the first of her family to do so. She qualifies for state-funded student financial aid under the California Dream Act, and hopes to use her education to become a psychologist one day.\nA college education felt out of reach to Juan Valentin just a decade ago. He says his kids now have an aunt to look up to.\n“She’s going to go farther than any of us.”","url":"https://calmatters.org/articles/fueling-the-dreams-of-the-undocumented/"}
