{"authors":["Associated Press"],"date_download":"2018-10-23 02:49:59","date_modify":"2018-10-23 02:49:59","date_publish":"2016-01-29 17:29:54","description":"ROME (AP) — Italian police discovered an underground bunker in the countryside of southern Calabria Friday with two mobsters, considered among Italy's most d...","filename":"data/vaneerConsumption/FugitivemobstersfoundinItalybunkerwithgunspastapot.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422888_Mobsters-bunker-Italy-12-guns-pasta-pot_1540262999.html","title":"Fugitive mobsters found in Italy bunker with guns, pasta pot","title_page":"Fugitive mobsters found in Italy bunker with guns, pasta pot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fugitive mobsters found in Italy bunker with guns, pasta pot\nROME (AP) — Italian police discovered an underground bunker in the countryside of southern Calabria Friday with two mobsters, considered among Italy's most dangerous fugitives, holed up and sleeping inside.\nPolice said they are trying to find a network of accomplices they suspect helped 'ndrangheta clan bosses Giuseppe Crea and Giuseppe Ferraro elude capture for 10 years and 18 years respectively.\nCrea, 37, faces 22 years in prison for Mafia association; Ferraro, 48, was sentenced to life imprisonment, including for a murder conviction.\nThe two had a dozen firearms, including a Kalashnikov, neatly hung up on a wall, video released by police of the bunker's interior showed.\nAlso hanging from a wall was a pasta pot. Tomatoes, salad and what looked like a plate heaped with ricotta were on the counter.\nDespite its being dug deep into the ground, the hideout was furnished with electricity, and the mobsters had a satellite TV and a computer, police said. Vines and bushes camouflaged the hideout in the province of Reggio Calabria.\nFerraro is considered one of the last survivors of a decades-long ferocious 'ndrangheta clan feud that claimed at least 20 lives, according to police. Among those victims was a mobster whose body was fed to pigs and a 9-year-old boy who was accidentally shot when his grandfather's car was mistakenly fired on, daily Corriere della Sera reported.\nAnnouncing the capture of the pair, Italian Interior Minister Angelino Alfano noted they were \"both on Italy's list of most dangerous fugitives.\"\nAuthorities described the two as being clan bosses from 'ndrangheta territory near Gioia Tauro, a port on the Tyrrhenian coast which, investigators have long maintained, the syndicate frequently uses as a base for activities such as drug and arms trafficking.\nThis hideout was in remote farm country. But many of the bunkers discovered by police hunting for other 'ndrangheta mobsters in Calabria have been found tunneled under farm buildings or reached through hidden trapped doors leading from kitchens, bedrooms or other rooms in homes.\nFugitive mobsters prefer to stay close to their power bases, where they can count on logistical support and rely on the reluctance of locals to tip police, turning on its head the expression to \"being on the run.\"\nAfter convicted Cosa Nostra chieftain Bernardo Provenzano was captured in 2006 in a farmhouse near Corleone, Sicily, after 43 years as a fugitive, prosecutors said he was able to live on farmland right near his home base because family and friends brought him food and freshly laundered clothes and bedding.\nInvestigators hoped the latest capture would send a message to people in the nearby town of Rizziconi, whose city council was sent packing by the Italian central government because of infiltration by organized crime.\nThe cocaine-trafficking 'ndrangheta is one of the world's most powerful criminal organizations. The Calabrian syndicate's bosses and foot soldiers are overwhelming drawn from family ranks.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422888/Mobsters-bunker-Italy-12-guns-pasta-pot.html"}
