{"authors":[],"date_download":"2018-10-30 18:19:40","date_modify":"2018-10-30 18:19:40","date_publish":"2017-02-14 23:05:14","description":"Fulton’s Achievement Zone has improved literacy rates, teacher retention, graduation rates and more but still lags behind county","filename":"data/vaneerConsumption/FultonAchievementZoneshowsprogresslongroadahead.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/24/Images/photos.medleyphoto.10289264.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_fulton_866c7b29ac7ab6bd7b6717106e3e0af8__1540923580.html","title":"Fulton Achievement Zone shows progress, long road ahead","title_page":"Fulton Achievement Zone improves but still has far to go","title_rss":"NULL","source_domain":"ajc.com","text":"Fulton’s Achievement Zone, a cluster of 10 south Fulton schools, has improved literacy rates, teacher retention, graduation rates and more, but the zone still lags behind the rest of the county.\nThe zone includes Banneker High School and the nine schools that feed into it. Fulton County Schools began an effort to improve the zone’s educational standing in 2015.\nDara Jones-Wilson, the area executive director, told the Fulton County Board of Education Tuesday that the best way to improve education in the Achievement Zone is to attract talent to it.\nSince 2014, Banneker High School has cut the number of teachers with fewer than two years of experience in half while significantly cutting the number of vacant teaching positions.\n“We started our year with almost every vacancy filled for the first time, and filled by higher qualified staff,” said Jones-Wilson.\nNow that vacancies are filling, the zone is focusing on retaining its teachers. Last year, the zone’s teacher attrition rate dropped 5 percent.\n“When teachers don’t get supported, it starts this revolving door of teachers leaving,” said Jones-Wilson.\nAttracting talent to the zone is already showing results, said Jones-Wilson. Banneker’s graduation rate climbed 27 percent over the last three years, and the gap between BHS and the county’s average graduation rate has been cut almost in half.\nThere are other signs that the zone is improving. Approximately ten times more middle school students are taking high school level literature, science and algebra courses than in 2014. Students system-wide missed 1,400 fewer days due to out-of-school suspensions than in 2014. Crime at BHS is down about 85 percent.\nBut there is one major impediment to the zone’s progress that remains: literacy. Last school year, not a single Kindergarten student in the zone could read 75 words presented to them, which is the annual goal for that grade level.\n“Seventy-five words is not a high goal,” said FCS Superintendent Jeff Rose, who told the board that improving literacy rates must be a continual focus.\nJones-Wilson cited studies indicating that children of impoverished families, a significant demographic in the zone, hear about 30 million fewer words than the average child by the age of three. This word gap impairs language development, she said.\nWhile literacy rates have improved for students in Kindergarten, 1st grade and 2nd grade, each grade still falls far below their end of the year goals. Mari Early, principal at College Park Elementary School, acknowledged that the zone’s elementary schools start with a deficit to overcome.\n“We have a lot of work to make up,” she told the board, “but we’re going in the right direction. All of the data is going in the right direction.”\nThe school board was encouraged to see the zone making progress but recognized that much still needs to be done.\nSaid District 7 Representative Julia Bernath, “It’s exciting to see the development, even while there’s a long road ahead.”","url":"https://www.ajc.com/news/local-education/fulton-achievement-zone-shows-progress-long-road-ahead/EcAvkvLqDJXSi8yEDqPwlM/"}
