{"authors":[],"date_download":"2018-10-30 14:30:57","date_modify":"2018-10-30 14:30:57","date_publish":"2016-10-07 19:52:00","description":"From time to time, certain emergencies like inclement weather will prompt Fulton County Schools to shut down operations and cancel classes.","filename":"data/vaneerConsumption/FultonschoolclosingsHowisthedecisionmade.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/27/Images/photos.medleyphoto.11539152.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_fulton-school-closings-how-the-decision-made__1540909857.html","title":"Fulton school closings: How is the decision made?","title_page":"Fulton school closings: How is the decision made?","title_rss":"NULL","source_domain":"ajc.com","text":"From time to time, emergencies like snow or ice will prompt Fulton County Schools to shut down operations and cancel classes.\nHere's information to help better understand how the decision to close is made:\nWho makes the decision?\nThe superintendent has the final say in school closings and bases a decision on recommendations from staff and the following factors:\nRoad conditions\nTime of weather’s arrival\nWeather forecasts\nBuilding and parking lot conditions\nTemperature and wind-chill\nProbability of buses being able to transport students\nWhen is a decision made?\nScheduled meetings take place beginning at 4:30 p.m. the day before expected weather is to arrive. The Fulton County Schools Transportation Department makes contact with various safety organizations to get initial information about weather conditions and the possible effects on roads and schools. A final decision to close schools is made no later than 6 a.m. the following day.\nHow do parents find out?\nRadio and television stations get contacted by the Fulton County Schools Communications Department as soon as the superintendent makes a decision. The information is then posted to the school system’s website, Twitter, which you can follow at @FultonCountySchools, and on the school Facebook account. Individual school’s Facebook and Twitter accounts can provide more specific information.\nChannel 2 Action News also keeps a list of school closings in the metro area.\nWSB radio at 750 on the AM dial also broadcast lists of closings.","url":"https://www.ajc.com/news/local/fulton-school-closings-how-the-decision-made/3MAjD7dniPJi3eNCFiSaQJ/"}
