{"authors":["Ben Kew"],"date_download":"2018-10-30 18:21:04","date_modify":"2018-10-30 18:21:04","date_publish":"2016-04-13 22:22:27","description":"Several events for a charity fundraising week at Ohio University have been canceled after students painted pro-Trump slogans.","filename":"data/vaneerConsumption/FundraisingWeekEventsCanceledatOhioUniversityAfterStudentsPaintProTrumpMessages.json","image_url":"https://media.breitbart.com/media/2016/04/wi/afp_bbeec5ff349b2a1187d9d8b9ff7486afc19f11a7-e1460586128657.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_04_13__1540923664.html","title":"Fundraising Week Events Canceled at Ohio University After Students Paint Pro-Trump Messages","title_page":"Fundraising Week Events Canceled at Ohio University After Students Paint Pro-Trump Messages | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Several events for a charity fundraising week at Ohio University, known as ‘Greek Week,’ have been canceled after students painted a wall designated for graffiti with pro-Trump slogans.\nThe fundraising events were due to take place between April 11 – 16, however the plans were amended after members painted “Build the Wall” and “Trump 2016” along with the GOP party logo.\nThe graffiti is understood to be an endorsement of Donald Trump’s campaign for the Republican Nomination, supporting his policy of building a wall between the US and Mexico to stop illegal immigration into the country.\nThe wall has been an outlet for free speech since the 1970’s, however many students have argued that pro-Trump artwork took it too far.\nA letter sent to all sororities and fraternities signed by various student councils states, “This phrase is offensive and hurtful to many individuals as it is directly tied to the Hispanic/Latino/a community, makes them feel marginalized, and the message was interpreted that they do not belong at Ohio University.”\n“The big picture right now is that some people didn’t feel unified with Greek life,” Matt Falconer, president of OU’s chapter of Sigma Chi, said. “That was one of the main reasons why Greek Week was altered.”\nIn light of an emergency meeting held by the university’s Hispanic and Latino Society, University President McDavis Roderick sent an email to students which read: “Indeed, this wall is a place of free speech and expression; however, the words painted were troubling because they had a very different meaning to some than they may have to others viewing the message or even to those who painted the message.” He also suggested cultural competency classes to encourage students to be more sensitive.\nThe graffiti has since been removed by Hispanic students who painted over it. The university has said the students will not be punished.\n**UPDATE** Ohio University’s Senior Director of Communication Services reached out to Breitbart Tech to stress that the decision to cancel events was not made by university officials but by “student leadership of all four governing councils.” This article’s headline has been updated to make that distinction clearer.\nYou can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at ben@yiannopoulos.net","url":"https://www.breitbart.com/tech/2016/04/13/ohio-university-cancels-fundraising-week-after-students-paint-trump-wall/"}
