{"authors":["Lucy Crossley For Mailonline"],"date_download":"2018-10-23 00:20:00","date_modify":"2018-10-23 00:20:00","date_publish":"2016-01-29 13:10:14","description":"Rita King, 81, (pictured) died at the De La Mer Care Home, in Walton-on-the-Naze, Essex, on December 28. Her husband Ron King, 86, is charged with her murder.","filename":"data/vaneerConsumption/FuneralheldfordementiapatientRitaKingwhowasshotdeadbyhusband.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B278A100000578-0-image-a-18_1454072967139.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422673_Funeral-held-dementia-patient-81-shot-dead-husband-care-home-mercy-killing_1540254000.html","title":"Funeral held for dementia patient Rita King who was shot dead 'by husband'","title_page":"Funeral held for dementia patient Rita King who was shot dead 'by husband' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ron King was not present for the 20-minute service but was allowed to pay his respects privately at chapel of rest\nThe funeral of an elderly dementia patient who was allegedly shot dead by her husband in an apparent mercy killing at her care home was held this morning.\nRita King, 81, died at the De La Mer Care Home, in Walton-on-the-Naze, Essex, on December 28. Her husband Ron King, 86, is charged with her murder.\nToday, friends and family members gathered to say a final goodbye to Mrs King at her funeral at the Weeley Crematorium, less than 10 miles from where the shooting took place.\nThe funeral of an elderly dementia patient Rita King, 81, (left) who was allegedly shot dead by her husband Ron, 86, (pictured right, prior to an appearance Chelmsford Magistrates' Court last month) in an apparent mercy killing at her care home was held this morning\noday, friends and family members gathered to say a final goodbye to Mrs King at her funeral at the Weeley Crematorium, less than 10 miles from where the shooting took place\nKing, who is being held at Chelmsford Prison, did not attend the service but is known to have been granted permission to pay his respects privately at a chapel of rest.\nSpeaking after the 20-minute service at the Tendring District Council-run crematorium, care home manager Julie Curtis said: 'This was a really tragic ending to what was a very, very happy marriage.\n'They would have been married 50 years this year.'\nKing, who is being held at Chelmsford Prison, did not attend the service but is known to have been granted permission to pay his respects privately at a chapel of rest\nJust a handful of mourners attended the short service, including staff at the care home where Mrs King lived\nMrs King had been a care home resident for nine months before she died in December last year\nThe tearful manager of ten years, who was joined by just four other mourners, added: 'Everybody is in shock - I know Ron's family are still in shock.\n'I never ever thought in a million years I would be here after one of my residents died this way.'\nWhen asked about how she and her staff felt about alleged killer King, she answered: 'We really feel for him over what has happened.\nCare home manager Julie Curtis (pictured today) said Mrs King's death had been 'tragic'\n'For an 86-year-old man to be held in prison for what has happened doesn't sound right.\n'He was really desperate. For him to go down to the home a few times a week knowing that she wanted to go home with him was very hard but her really couldn't cope looking after her.\n'He couldn't cope that he was home alone and not with his wife.'\nShe added: 'He wanted to be with her and he really did not like being in the care home. He was really struggling and in desperation he thought this would be an option.\n'I am sure at the time he didn't think it would end up like this.'\nThe short service ended with Frank Sinatra's Fly Me To The Moon being played.\nMrs Curtis added: 'It was a lovely song because they used to go dancing and used to go bowling together.\n'They had a wonderful life together. They had no children and their whole lives had been absolutely devoted to each other.'\nMrs King had been a care home resident for nine months before she died.\nPreviously, Mrs Curtis has described how King, a former serviceman in the British Army, had checked in to the care home to spend Christmas with his wife.\nBut on the morning of December 28, he is said to have used a 1930s Enfield revolver to shoot his wife in head, mumbling: 'She has had enough.'\nHe was arrested at the scene and charged with murder. Police are not looking for anybody else in connection with the death and he is due to appear at Chelmsford Crown Court on March 3.","url":"https://www.dailymail.co.uk/news/article-3422673/Funeral-held-dementia-patient-81-shot-dead-husband-care-home-mercy-killing.html"}
