{"authors":[],"date_download":"2018-10-30 14:08:52","date_modify":"2018-10-30 14:08:52","date_publish":"2018-10-30 09:47:00","description":"The suspect in the shooting massacre at the Tree of Life Congregation Synagogue in Pi...","filename":"data/vaneerConsumption/Funeralsforvictimsbeginaheadofpre.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/29/Videos/4518013.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_reports-activ_d4e55ac158fcbe8f67153b7d2994b209__1540908532.html","title":"Funerals for victims begin ahead of pre","title_page":"Pittsburgh synagogue shooting: Funerals for victims begin ahead of pre","title_rss":"NULL","source_domain":"ajc.com","text":"The suspect in the shooting massacre at the Tree of Life Congregation Synagogue in Pittsburgh Saturday that killed 11 and wounded six more is jailed without bond after a hearing Monday in federal court.\n>> Read more trending news\nSuspect Robert Bowers, 46, surrendered after a firefight with police at the synagogue and is now facing an array of federal charges. Bowers also made several anti-Semitic comments on social media before the rampage and to police officers after the shooting, WPXI reported.\nRelated: Accused synagogue shooter posted anti-Jewish, anti-immigrant conspiracy theories\nHere are the latest updates:\nUpdate 4:30 a.m. EDT Oct. 30: Funerals begin Tuesday for the victims of the synagogue shooting as President Trump and First Lady Melania Trump are set to visit Pittsburgh.\nWPXI is paying tribute to the victims as they are laid to rest and the city prepares for a presidential visit. Click here to watch their coverage here.\nUpdate 10:40 pm EDT Oct. 29: The University of Pittsburgh Medical Center gave an update Monday on four of the victims wounded in the synagogue shooting over the weekend.\nA 61-year-old woman is in stable condition, as is a 55-year-old male officer.\nBoth a 70-year-old man and a 40-year-old male officer remain in critical condition, UPMC officials said on social media. UPDATE AS OF 5 PM ON MONDAY, OCT. 29, 2018: ⬇️ pic.twitter.com/ajp6IPnseZ — UPMC (@UPMCnews) October 29, 2018\nUpdate 9:50 p.m. EDT Oct. 29: President Donald Trump is scheduled to visit Pittsburgh Tuesday afternoon in the aftermath of the massacre at the synagogue Saturday that left 11 people dead and six wounded.\nHowever, the city’s mayor, William Peduto is now asking the White House to postpone the visit over security concerns, according to WPXI-TV.\n\"We do not have enough public safety officials to provide enough protection at the funerals and to be able at the same time draw attention to a potential presidential visit,” Peduto said Monday in a statement.\n“If the President is looking to come to Pittsburgh, I would ask that he not do so while we are burying the dead. I would ask that White House staff contact the families and ask them if they want the President to be here,” he said.\nCommunity leaders are split on the president’s expected visit.\nThe current rabbi of the Tree of Life Synagogue has said he welcomes the president, but the former leader of the synagogue said she does not welcome him, calling the president a purveyor of hate speech.\n\"The president is the grandfather of several Jewish grandchildren. His daughter is Jewish-American and his son-in-law is the descendant of Holocaust survivors. Tomorrow the president and first lady will travel to Pennsylvania to express the support of the American people and grieve with the Pittsburgh community,\" White House Press Secretary Sarah Huckabee Sanders said during a press briefing Monday.\nUpdate 2:40 p.m. EDT Oct. 29: White House press secretary Sarah Huckabee said Monday that the president and first lady plan to visit Pittsburgh on Tuesday, three days after a gunman killed 11 people in a shooting at Tree of Life Congregation Synagogue.\nBREAKING: White House: President Trump and first lady to visit Pennsylvania on Tuesday in wake of 'heinous' synagogue massacre. — AP Politics (@AP_Politics) October 29, 2018\nUpdate 2:30 p.m. EDT Oct. 29: In an emotional statement, White House press secretary Sarah Huckabee Sanders denounced Saturday’s deadly attack at the Tree of Life Congregation Synagogue, saying that those killed “represented the very best of our nation.”\n“Antisemitism is a plague to humanity,” she said. “We are a nation that believes in religious liberty, tolerance and respect, and we are a people who cherish the dignity of every human life.”\nUpdate 1:55 p.m. EDT Oct. 29: U.S. Attorney Scott Brady said Monday that Bowers has been ordered detained without bond.\n“Rest assured, we have a team of prosecutors to make sure justice is done,” he said minutes after Bowers made his first court appearance.\nBowers is expected to appear in court again Thursday at 10 a.m.\nUpdate 1:45 p.m. EDT Oct. 29: Dressed in a blue sweatshirt, Bowers appeared in a federal courtroom in Pittsburgh on Monday for his arraignment.\nBowers was in a wheelchair after sustaining gunshot wounds during Saturday’s shooting, WPXI reported. He did not appear to show emotion while speaking with his court-appointed attorney and signing papers, the news station reported.\nA judge ordered Bowers be remanded to the custody of U.S. Marshals, WPXI reported.\nUpdate 1:35 p.m. EDT Oct. 29: Bowers was escorted Monday into a federal courtroom by U.S. Marshals.\nBowers was in a wheelchair after sustaining gunshot wounds during Saturday’s shooting, WPXI reported.\nUpdate 1:20 p.m. EDT Oct. 29: U.S. Attorney General Jeff Sessions called Saturday’s shooting “an attack on all people of faith” while addressing a group in Boston on Monday.\nRelated: 'He went back in and finished the job in my synagogue:’ Holocaust survivor speaks of rampage\nHe called the deadly attack at Tree of Life Synagogue “an attack on America’s value of protecting those of faith.”\nAttorney General Jeff Sessions speaks about the massacre at a Pittsburgh synagogue and says the FBI and Justice Department will do their “duty” with “vigor and integrity”: “It was an attack on all people of faith … it cannot and will not be tolerated” pic.twitter.com/2VJa9kulf9 — CNN Politics (@CNNPolitics) October 29, 2018\nOn Sunday, U.S. Attorney Scott Brady said he had begun the process to get Sessions' approval as required by law to pursue a capital case against Bowers.\nUpdate 11:40 a.m. EDT Oct. 29: Bowers has arrived at a courthouse in Pennsylvania ahead of a hearing expected at 1:30 p.m. Monday, WPXI reported.\n#BREAKING: Synagogue shooting suspect arrives at courthouse for hearing | LIVE coverage on 11 News at Noon https://t.co/xdkKiAmmXw pic.twitter.com/0mXfiVADeg — WPXI (@WPXI) October 29, 2018\nUpdate 10 a.m. EDT Oct. 29: A spokesperson for Allegheny Health Network told WPXI that Bowers was released Monday morning from Allegheny General Hospital.\nJUST IN: spokesperson for Allegheny Health Network, called the desk to report that Bowers was released from the hospital at 9:45 AM and is no longer there. @WPXI — Mike Holden (@WPXIMikeHolden) October 29, 2018\nBowers is expected to appear in federal court at 1:30 p.m. Monday for his arraignment.\nUpdate 9:20 a.m. EDT Oct. 29: A social media site used by Bowers ahead of Saturday’s deadly shooting and popular with far-right extremists has been taken down.\nIn a message on Gab.com, company officials said it has “been systematically no-platformed by App Stores, multiple hosting providers, and several payment processors.”\nRelated: Pittsburgh synagogue shooting: What is Gab, website used by shooting suspect?\nGab.com officials said the company suspended Bowers’ account and contacted law enforcement immediately, turning over his account. The site said Bowers had accounts on other social media platforms.\nBowers is due in court on Monday.\nPennsylvania State Police said troopers will stop at synagogues and other places of worship Monday to make sure everyone is safe.\nWith the recent tragedy in Pittsburgh, troopers will be vigilant in stopping to check on synagogues and houses of worship throughout their shift to ensure the safety of all. Please don’t be concerned if you happen to notice an increased presence by our men and women in gray. — Troop A Public Information Officers (@PSPTroopAPIO) October 29, 2018\nUpdate 4:30 a.m. EDT Oct. 29: Federal officials said shooting suspect Robert Bowers, who remains hospitalized, is scheduled to appear before a federal judge at 1:30 p.m. Monday to be arraigned.\nRelated: Pittsburgh’s Humane Animal Rescue to open doors for respite, reflection after Tree of Life shooting\nUpdate 1:30 a.m. EDT Oct. 29: In sympathy for the victims of the synagogue shooting, New York City’s Empire State Building went dark Sunday night. An orange halo rolled around its mast to shine a light on gun violence awareness.\n>> See the image here\nIn sympathy for the victims of the attack in Pittsburgh, our tower lights will go dark tonight. Our mast will display an orange halo shining a light on gun violence awareness.\n📷: @isardasorensen pic.twitter.com/ulKFNUTl60 — Empire State Bldg (@EmpireStateBldg) October 28, 2018\nUpdate 10:00 p.m. EDT Oct. 28: Pittsburgh’s U.S. Attorney Scott Brady said he wants to pursue the death penalty against shooting suspect Robert Bowers, but first needs approval from the Department of Justice, according to The Associated Press.\nBREAKING: U.S. attorney in Pittsburgh says he's seeking approval for the death penalty against shooting suspect Robert Bowers — The Associated Press (@AP) October 29, 2018\nBrady said he has started the process needed to get Attorney General Jeff Sessions’ approval to bring a capital case against Bowers, the AP reported.\nBowers, a long haul trucker and independent contractor, is scheduled for a court appearance Monday afternoon.\nUpdate 6:20 p.m. EDT Oct. 28: People gathered by the hundreds Sunday at Pittsburgh’s Soldiers and Sailors Memorial Hall and Museum to remember the victims of Saturday’s mass murder at the Tree of Life synagogue and to show their solidarity for the city’s Jewish community.\nAn overflow crowd of mourners stood in the rain, sharing umbrellas as they listened to the interfaith vigil inside the hall on loud speakers.\nPittsburgh Mayor William Peduto called for tolerance and said that hate and evil needed to be driven back underground.\n“There’s an evil that drives mass murder,” Peduto told the crowd. He said it’s especially hard when the victims are children and the elderly.\nThe victims in Saturday’s rampage were between 54 and 97.\nOverflow Crowd outside Soldiers and Sailirs in Oakland for Community Vigil for Synagogue Shooting Victims pic.twitter.com/CApEgh9JFO — David Johnson WPXI (@DavidWPXI) October 28, 2018\n“At this time of grief, coming together as a community offers us some comfort and solace. We hope that being together will strengthen our bonds at this difficult time,” the CEO of the Jewish Federation of Greater Pittsburgh, Jeffrey Finkelstein, said about the interfaith gathering.\nThe Empire State Building in New York is turning off its nights Sunday night in sympathy for the victims.\n“Our mast will display an orange halo shining a light on gun violence awareness,” building officials said on Twitter.\nIn sympathy for the victims of the attack in Pittsburgh, our tower lights will go dark tonight. Our mast will display an orange halo shining a light on gun violence awareness.\n📷: @isardasorensen pic.twitter.com/ulKFNUTl60 — Empire State Bldg (@EmpireStateBldg) October 28, 2018\nUpdate 3:45 p.m. EDT Oct. 28: Israel’s President Reuven Rivlin will deliver a message in a videotaped message set to open an interfaith vigil Sunday, The Associated Press reported.\nAccording to a transcript provided by Rivlin’s office, it will be a message of solidarity.\n“You are not alone! The people of Israel and the entire Jewish people stand with you,” the transcript says. “We must say loud and clear — this was an act of antisemitism. We cannot, we must not, we will not ignore it or tolerate it.”\nUpdate 3:25 p.m. EDT Oct. 28: WPXI reported that Timothy Matson is one of the Pittsburgh police SWAT officers who was hurt during the active shooter situation.\nOfficer Anthony Seretti, Matson’s brother and a fellow officer started a GoFundMe page to help pay for his medical bills and any other expenses during his recovery. More than $10,000 has been raised toward its $20,000 goal.\nUniversity of Pittsburgh Medical Center said another officer is in stable condition at UPMC Presbyterian Hospital. A 27-year-old officer is also in stable condition at UPMC Mercy Hospital. the fourth officer was treated and released from UPMC Presbyterian Hospital on Saturday.\nUpdate 3:00 p.m. EDT Oct. 28: Pittsburgh sports teams held a moment of silence for the victims of the synagogue shooting.\nThe Vancouver Canucks just held a moment of silence before tonight’s matchup,” the NHL’s Pittsburgh Penguins said on Twitter Saturday.\nBefore the Pittsburgh Steelers and Cleveland Browns NFL game Sunday, the teams had a moment of silence for the victims and families.\nUpdate 10:00 a.m. EDT Oct. 28: The victims of the mass shooting at the synagogue have been identified by authorities, WPXI reported. They are:\nJoyce Fienberg, 75\nRichard Gottfried, 65\nRose Mallinger, 97\nJerry Rabinowitz, 66\nCecil Rosenthal, 59\nDavid Rosenthal, 54\nBernice Simon, 84\nSylvan Simon, 87\nDaniel Stein, 71\nMelvin Wax, 88\nIrving Younger, 69\nUpdate 9:00 a.m. EDT Oct. 28: Multiple figures have issued statements on the incident, including Pittsburgh Steelers President Art Rooney II and Pope Francis.\n“On behalf of the entire Steelers organization, we offer our support and condolences to the families of the attack on peaceful citizens worshiping at the Tree of Life Synagogue,” Rooney said in a statement Sunday.\n“Our hearts are heavy, but we must stand against anti-Semitism and hate crimes of any nature and come together to preserve our values and our community. With that in mind we will ask everyone to join in a moment of silence and prayer prior to our game this afternoon.”\nStatement from Steelers President Art Rooney II. pic.twitter.com/GFwFISshZd — Pittsburgh Steelers (@steelers) October 28, 2018\nOf the synagogue attack, Pope Francis said, “We are all hurt by this inhumane act of violence. May the Lord help us extinguish hate, promote respect for life, moral and civic values.”\n#PopeFrancis on #SynagogueAttack at today's Angelus: Prays for #Pittsburgh & #Jewish community. \"We are all hurt by this inhumane act of violence. May the Lord help us extinguish hate, promote respect for life, moral & civic values. pic.twitter.com/zHBm1ImlNV — Catholic News Service (@CatholicNewsSvc) October 28, 2018\nUpdate 12:48 a.m. EDT Oct. 28: The criminal complaint from Saturday's deadly shooting includes the following details about the incident:\nOf the 11 people killed, three were women and eight were men.\nWhen SWAT officers entered the synagogue, Bowers went to the third floor of the building, according to the criminal complaint.\nDuring an exchange of gunfire there, two SWAT officers were both shot multiple times.\nWhile Bowers was being taken into custody, he made comments that he wanted all Jews to die and that they were committing genocide to his people, according to the criminal complaint.\nThe state is now charging Bowers with the following:\n11 counts of criminal homicide\nSix counts of criminal attempted homicide\nSix counts of aggravated assault\n13 counts of ethnic intimidation\nUpdate 10:25 p.m. EDT Oct. 27: President Trump has ordered flags flown at half-staff at federal buildings in \"solemn respect\" for the synagogue shooting victims.\nIn the proclamation, Trump called for the flags to be lowered until Oct. 31. Earlier in the day he told reporters he would travel to Pittsburgh, but offered no details.\nUpdate 9 p.m. EDT Oct. 27: Robert Bowers is charged with 29 federal counts of violence and firearms charges:\nEleven counts of Obstruction of Exercise of Religious Beliefs Resulting in Death.\nEleven counts of Use of a Firearm to Commit Murder During and in Relation to a Crime of Violence.\nFour counts of Obstruction of Exercise of Religious Beliefs Resulting in Bodily Injury to a Public Safety Officer.\nThree counts of Use and Discharge of a Firearm During and in Relation to a Crime of Violence.\nScott W. Brady, the U.S. Attorney for the Western District of Pennsylvania, announced the charges late Saturday, about 12 hours after they say Robert Bowers opened fire inside the Tree of Life synagogue.\nUpdate 5:30 p.m. EDT Oct. 27: Attorney General Jeff Sessions said the Justice Department intends to file hate crime and other charges against the man accused in the synagogue shooting that killed 11 people, according to The Associated Press.\nThe Latest: Attorney General Jeff Sessions says Justice Department intends to file hate crime, other charges against man accused in Pittsburgh synagogue shooting that killed 11 people. https://t.co/ODwLzfwFW6 — The Associated Press (@AP) October 27, 2018\nIn a statement Saturday, Sessions said the killings were “reprehensible and utterly repugnant to the values of this nation.”\nUpdate 4:05 p.m. EDT Oct. 27: Pittsburgh officials confirmed that 11 people were killed and six people were injured during the synagogue shooting. The six injured includes four police officers. Two officers were injured during an initial confrontation with the suspect, and two officers were injured at a later point during the incident, WPXI reported. The suspect suffered gunshot wounds and is in fair condition, officials said.\nBREAKING: City official says 11 killed, six injured in shooting at Pittsburgh synagogue — The Associated Press (@AP) October 27, 2018\nUpdate 3:23 p.m. EDT Oct. 27: A photo of suspect Robert Bowers has been released, WPXI reported.\n#BREAKING: Law enforcement sources tell @WPXIRickEarle that Robert Bowers entered Tree of Life synagogue with one rifle and three pistols and opened fire this morning: https://t.co/rThtuYc09f pic.twitter.com/718auTzyZA — WPXI (@WPXI) October 27, 2018\nUpdate 3:22 p.m. EDT Oct. 27: President Trump condemned the Pittsburgh synagogue shooting, during remarks at the Future Farmers of America convention, saying there must be no tolerance of anti-Semitism in America.\nBREAKING: Trump condemns Pittsburgh synagogue shooting, says 'there must be no tolerance for anti-Semitism in America' — The Associated Press (@AP) October 27, 2018\nUpdate 3:10 p.m. EDT Oct. 27: The Associated Press is reporting that at least 10 people were killed in Saturday’s synagogue shooting.\nBREAKING: AP sources: At least 10 people killed in shooting at Pittsburgh synagogue. — The Associated Press (@AP) October 27, 2018\nUpdate 2:15 p.m. EDT Oct. 27: Officials have established a hotline for those looking for information on their loved ones who may have been at the synagogue at the time of the shooting.\nOfficials have established a hotline for family members looking for information about loved ones after a mass shooting at Tree of Life synagogue in Squirrel Hill: https://t.co/rHxKlwHn4o pic.twitter.com/yVWO5jVald — WPXI (@WPXI) October 27, 2018\nUpdate 1:42 p.m. EDT Oct. 27: ﻿UPMC Presbyterian gave an update on some of the victims.\nUpdate 1:32 p.m. EDT Oct. 27: The Associated Press has identified the Pittsburgh synagogue shooting suspect as Robert Bowers.\nBREAKING: Law enforcement official: Suspect in Pittsburgh synagogue shooting identified as Robert Bowers. — The Associated Press (@AP) October 27, 2018\nUpdate 1:15 p.m. EDT Oct. 27: Pittsburgh Public Safety Director Wendell Hissrich confirmed at a news conference that there are multiple fatalities and six injured. The shooter was taken to the hospital. Hissrich said the crime scene was “horrific,” and one of the worst he’s seen in his career. The scene has been cleared and there is no further threat to the public, Hissrich said.\nThere were multiple fatalities and six injuries. 4 of the six injured were Police Officers, three of whom were shot. — Pgh Public Safety (@PghPublicSafety) October 27, 2018 Wendell Hissrich: “It’s a very horrific crime scene. It’s one of the worst that I’ve seen.” #WPXI LIVE coverage NOW on Channel 11. https://t.co/rHxKlwHn4o pic.twitter.com/kOHorDBGQ0 — WPXI (@WPXI) October 27, 2018\nUpdate 1:05 p.m. EDT Oct. 27: Pennsylvania Attorney General Josh Shapiro noted an event that was taking place at the synagogue at the time the shooting happened.\nBREAKING: Pennsylvania attorney general says 'shooter claimed innocent lives' at a baby naming ceremony. — The Associated Press (@AP) October 27, 2018\nUpdate 12:45 p.m. EDT Oct. 27: President Donald Trump spoke to the media about the Pittsburgh synagogue shooting.\nBREAKING: Trump says outcome at Pittsburgh synagogue would have been different with armed guard: \"They didn't have any protection.\" — The Associated Press (@AP) October 27, 2018\nUpdate 12:18 p.m. EDT Oct. 27: Police sources have confirmed to WPXI that there were up to 8 people killed in the mass shooting.\nUpdate 11:49 a.m. EDT Oct. 27: Governor Tom Wolf has arrived at the scene of the shooting.\n.@GovernorTomWolf issued this statement about the shooting at Tree of Life Synagogue in Pittsburgh. https://t.co/Ylt8IfAhvJ — The Press Office (@GovernorsOffice) October 27, 2018\nUpdate 11:25 a.m. EDT Oct. 27: Police said three officers were shot.\nUpdate 11:20 a.m. EDT Oct. 27: Police confirm that the suspect, who was injured during a firefight with police, has surrendered. WPXI reports at least four people are dead.\nBREAKING: Suspect surrendering after killing at least 4 people, according to Channel 11 sources. | LIVE coverage NOW on 11 News https://t.co/cysHnaCCEh — WPXI (@WPXI) October 27, 2018\nUpdate 10:20 a.m. EDT Oct. 27: Initial reports of the shooting came shortly after 10 a.m., and was confirmed by the Pittsburgh Public Safety Department on Twitter. The public was warned to avoid the area.\nALERT: There is an active shooter in the area of WILKINS and Shady. Avoid the area. More info will be released when it is available. — Pgh Public Safety (@PghPublicSafety) October 27, 2018\n﻿The Associated Press contributed to this report.","url":"https://www.ajc.com/news/national/reports-active-shooter-tree-life-congregation-synagogue-pittsburgh/pzK9cNBeyiX8IjuNIzJc9N/"}
