{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:22:55","date_modify":"2018-10-30 18:22:55","date_publish":"2015-04-03 18:40:03","description":"Actors James Van Der Beek and Anna Camp mock both conservatives and Indiana’s new religious freedom law in a new Funny or Die sketch, which pits them as |","filename":"data/vaneerConsumption/FunnyorDieSkitIndianaRFRASupportersWanttoBringBackWhitesOnlySodaFountains.json","image_url":"https://media.breitbart.com/media/2015/04/van-der-meek-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_03__1540923775.html","title":"Funny or Die Skit: Indiana RFRA Supporters Want to Bring Back Whites-Only Soda Fountains","title_page":"Funny or Die Skit: Indiana RFRA Supporters Want to Bring Back Whites-Only Soda Fountains | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Actors James Van Der Beek and Anna Camp mock both conservatives and Indiana’s new religious freedom law in a new Funny or Die sketch, which pits them as two TV home shopping hosts attempting to discriminate against potentially gay customers.\nThings grow uncomfortable for the pair when “Don from Fort Wayne” calls the show to inquire about a line of dishes for he and his lover Patrick. He is immediately cut off and then scorned by the hosts.\n“Here in Indiana, we have a religious freedom law,” Van Der Beek sternly explains. “Which means we don’t have to serve anyone who threatens our religion.”\n“I mean, can you imagine a world in which a gay couple asks you to make a cake, and then you actually have to sit down and make it?” Camp says.\n“What’s next? I’ll leave my wife Cindy and then go shack up with Don in a post-modern house in Palm Springs?” Van Der Beek asks.\n“All these liberals,” Camp then says after a round of homosexual callers. “Are we in Utah or something?”\nAfter successfully selling a pair of “retro Bible reading glasses,” and encountering a caller who is now straight after visiting a “gay conversion camp,” the pair yearns for the days of “whites only” segregated soda fountains, Main Street, and drive in movie theaters.\nWatch the video, courtesy of Funny or Die, below:\nIndiana Gov. Mike Pence signed Senate Bill 101 into law last week, which intends to prohibit state and federal government from limiting a person’s ability to exercise their religion. The legislation has been met with heavy criticism from the left, including celebrities, who argue the bill is anti-gay.\nVan Der Beek and Camp now join celebrities such as Miley Cyrus, Stephen King, Seth MacFarlane, Perz Hilton, Nick Offerman and Susan Sarandon in attacking the law as discriminatory.\nRapper Azealia Banks, who recently said she wanted to “f—k” President Obama, called the bill “another example of conservative sociopathy.”\nGov. Pence signed a “fix” to the law Thursday, after a campaign of intimidation and misinformation from the left, which some fear will leave Christians vulnerable to prosecution for choosing to exercise their religious beliefs.","url":"https://www.breitbart.com/politics/2015/04/03/james-van-der-beek-mocks-indiana-religious-freedom-law-in-funny-or-die-skit/"}
