{"authors":["John Nolte"],"date_download":"2018-10-30 22:17:06","date_modify":"2018-10-30 22:17:06","date_publish":"2015-05-12 16:14:40","description":"With 37 reviews in, director George Miller's \"Mad Max: Fury Road\" sits at an impressive 97% fresh on Rotten Tomatoes. Many of the reviews are outright |","filename":"data/vaneerConsumption/FuryRoadALookBackat36YearsofMadMax.json","image_url":"https://media.breitbart.com/media/2015/05/495225-mad-max.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_05_12__1540937826.html","title":"'Fury Road': A Look Back at 36 Years of 'Mad Max'","title_page":"'Fury Road': A Look Back at 36 Years of 'Mad Max' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With 37 reviews in, director George Miller’s “Mad Max: Fury Road” sits at an impressive 97% fresh on Rotten Tomatoes. Many of the reviews are outright raves and make clear that after four decades as a filmmaker, Miller went old school to make the action genre once again feel fresh and vital. “Fury Road’s” action sequences go back to the future by actually respecting the idea of spatial logic. Better still, there is almost no CGI. Gee, what a concept.\nThe fourquel, which hits theatres Friday, is supposed to launch a brand new franchise. Star Tom Hardy, who steps in for Mel Gibson as Max Rockatansky (aka Mad Max aka The Man with No Name aka The Road Warrior), is attached to three more films.\nThis is remarkable for a number of reasons. To begin with, it has been a full 30 years since the last “Mad Max” (1985’s “Thunderdome”). On top of that, Miller is 70 years of age. Most directors are past their prime at that age, especially when it comes to action films. And then there’s the not-small detail that not a single one of the previous “Mad Max” films were huge hits here in America.\n“Mad Max” grossed just $8 million in 1980, which ranked a lowly 67th for the year. The worldwide gross, though, was an astonishing $100 million. Until “The Blair Witch Project” came along in 1999, Miller’s $400,000 directorial debut stood as the most profitable film in history.\n“The Road Warrior” grossed $23.6 million in 1982, not a bad sum, but still less than Richard Pryor’s “Some Kind of Hero,” something called “Young Doctors In Love,” and a flop called “Blade Runner.”\n“Mad Max: Beyond Thunderdome” cost $19 million to produce and grossed just $36.2 million in 1985. Again, not bad but nothing that screamed for an immediate sequel. The lack of that immediate sequel, however, might not have had anything to do with the box office. Miller lost his producing partner in a pre-production helicopter crash. The director was so shaken he took on a co-director to handle everything but “Thunderdome’s” action scenes.\n“Fury Road” is no small gamble. The production budget alone is a whopping $150 million. Add advertising and distribution costs, and you are edging towards a cool quarter billion — with a “B” — dollars. Moreover, Tom Hardy and Charlize Theron are not anyone’s idea of box office draws.\nOn the flipside, dystopia is all the rage again. As are the metal-smashing-need-for-speed “Fast & Furious” flicks.\nAlso working in “Fury Road’s” favor is a 35 year cinematic mythology. Blockbuster status might not have been achieved at the box office but that didn’t stop Mad Max from entering a place of enormous goodwill in our culture. Anyone my age who grew up in the early cable television-era spent many a summer hour watching and re-watching “Road Warrior” and “Thunderdome.”\nOver the past few days, and for the first time in years, I re-watched the trilogy. Here’s how the Australian-produced trilogy holds up:\n**spoilers**\nMad Max (1979)\nA formidable screen presence at 22, in just his second feature film, a baby-faced Mel Gibson launched into instant stardom as a police officer lost in the hell of the Australian outback. It’s the near-future, the energy crisis has taken its toll, and crazed marauders roam the land to scavenge and terrorize small towns and rural communities made vulnerable by their solitude and a disintegrating law enforcement structure.\nThis wasn’t at all the movie I remembered. “Mad Max” is not a revenge film — a “Death Wish” on wheels. Max’s wife and baby aren’t coldly murdered until the end of the second act. Although it’s interrupted by a number of top-notch car and motorcycle chases, Miller was just as interested in making a character study filled with big social themes.\nMax is a loving family man living in a world slowly disintegrating into chaos. He is doing his part to try and hold it all together but knows he’s treading water — risking his life long after the thin blue line has already snapped. After seeing his friend and partner burned beyond recognition, Max is ready to quit the force. Hoping he’ll change his mind, the boss gives his best cop an extended leave. The tragic irony is that it is during this leave when Max loses his family — loses everything he holds dear.\n“Mad Max” is an existential seventies car film in the best sense; a highly original, quirky cult movie in every way. Miller was a first-time director who had a lot to say and seemed to fear he might not get a second chance. Miller’s self-confident desperation is all up there blazing on the silver screen. And now, thanks to the sequels, “Mad Max” is also pure mythology.\n“The Road Warrior” (1981)\nThe original Australian title is “Mad Max 2.” Warner Brothers was concerned no one stateside had heard of the original and felt “The Road Warrior” was a more commercial, less confusing title. Good call.\n“The Road Warrior” is unquestionably a masterpiece, and the masterpiece of the trilogy. Miller was working with a bigger budget, even more confidence, and aimed to turn Max into a mythical character.\nTalk about a bullseye.\nThis is Mad Max as Ethan Edwards, John Wayne’s unforgettable character in John Ford’s “The Searchers” (1956). Five years have passed and except for a stray dog, Max is a loner, secure emotionally in his solitude, and roaming the bleak countryside set on survival auto-pilot.\nMax coldly strikes a deal to save a dying man’s life in exchange for much-needed gasoline. This leads him to a small, ragtag community refining fuel in the middle of the wasteland. Constantly surrounded and menaced by a psychotic gang of barbarians, the small group is barely hanging on and being picked off one and two at a time.\nThe goal is to use the fuel to take everyone out of the desert and into a promised land near the coast — to start over and build a civilization. The way there, though, begins with a suicide run through the bad guys.\nMax avails himself to this optimistic group — for a price. And like Ethan Edwards, even though he made their future possible, Max knows he must stay behind. Although men like him are necessary to make civilization possible, there is no room for men like him among the civilized.\nThrough the narrator who opens the story, at the end we learn that all of this happened long ago, and that the Road Warrior is still remembered and appreciated by a flourishing society that would not exist without him. In this sense Max is much better off than men like Ethan Edwards who, when not forgotten, are reviled by those living spoiled and secure off of the bounty of “historical misdeeds.”\nWhat we best remember about “The Road Warrior” is the still-breathtaking action scenes, all of which are filled with choreography and stunt work that feel even more amazing in a world now addicted to the artistic larceny of CGI.\nIn 1981, “The Road Warrior” was a true game-changer — “The Matrix” of its day, something that came out of nowhere and pushed the limits of a action genre in ways no one thought possible. A full three years before James Cameron’s “The Terminator” (1984), it was Miller who delivered the very first insanely relentless action film filled with jaw-dropping spectacle.\nMad Max Beyond Thunderdome (1985)\nAlthough a bit of a muddle, “Thunderdome” is still worthy thanks to the first and last 35 minutes. The middle 35 minutes, when Max is rescued by a small group of Ewoks tribal children lord-of-the-flying it out in the middle of the desert, are a true buzz-kill.\nMiller seems desperate for a box office smash here. MTV and music videos were at their zenith in 1985, and “Thunderdome” is aimed squarely at that audience. The casting of the kids and The Mighty Tina Turner and the big 80’s score by Maurice Jarre, seem obvious. But “Thunderdome” also looks, feels, and moves like a dystopian music video — which were also big at the time (and probably aping “Road Warrior”).\nI can barely sit through the Peter Pan nonsense, which is such a joy-suck coming right after Max’s adventures in Bartertown. The story opens beautifully with Max uncharacteristically caught off guard and robbed blind. We’re now 15 full years after “Road Warrior” and small villages run by tyrants litter the landscape.\nMax wants his stuff back and offers his services for 24 hours to anyone who can deliver. There’s a power struggle in Bartertown, and Aunty Entity (Turner) sees Max as the answer to her prayers. If Max kills the giant of a man between her and total power, they have a deal.\n“Two men enter. One man leaves.”\nEverything set in Bartertown is just spectacular, most especially the casting of Turner as the arch-villain. At 45 years of age, she was still at the beginning of the most spectacular comeback in music history. Her screen presence and charisma even blow Mel Gibson away. She oozes competence, authority, smarts; she turns every line of dialogue into something iconic and of course bursts with one-of-a-kind sex appeal.\nThirty years later, I am still bitter that after “Thunderdome,” Hollywood had no use for Tina Turner. If memory serves, in her 1986 autobiography “I, Tina,” (a terrific read co-authored by the great Kurt Loder) Turner says she wants an acting career but already fears there is just no place in Hollywood for a black woman in her forties. Other than a cameo in 1993’s “Last Action Hero,” how true that was.\nOne of the most talented, charismatic and gorgeous women of the latter half of the 20th century was left sitting on a shelf. If that’s not a “what if?” tragedy, nothing is.\n“Thunderdome” closes strong with a breathtaking desert chase that once again leaves Max alone, mythical, and fondly remembered among those he delivered to a better place.\n—\nIt will be interesting to see where exactly “Fury Road,” which is set in 2060, fits into all of this. Miller has explained that recasting Max with a younger actor is his own James Bond casting move.\nLike Miller himself, Mad Max will remain forever young.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/05/12/fury-road-a-look-back-at-36-years-of-mad-max/"}
