{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:28:04","date_modify":"2018-10-30 21:28:04","date_publish":"2016-12-20 00:00:00","description":"As the business world shifts online, so too will our money. See the drastic impact of internet technology on the retail & mobile banking and where we the industry is headed.","filename":"data/vaneerConsumption/FutureofBankingIoTRetailMobileBankingIndustryTrends.json","image_url":"https://amp.businessinsider.com/images/57d71483077dcc1c008b541d-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_internet-of-things-banking-retail-mobile-trends-2016-9_1540934884.html","title":"Future of Banking: IoT, Retail & Mobile Banking Industry Trends","title_page":"    Future of Banking: IoT, Retail & Mobile Banking Industry Trends - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Business Insider Intelligence Exclusive:The data provided here is an excerpt from the Internet of Things Report, a comprehensive report that covers the market trends in the IoT industry. For complete analysis, learn more about BI Intelligence and the IoT Report.\nWikimedia Common \\ HLundgaard\nBanking is becoming more convenient thanks to the Internet, and the future of the banking industry is growing increasingly digital.\nWhether discussing the future of retail banking or the future of mobile banking, technology is playing a larger role in our everyday transactions. The Internet of Things (IoT) is part of this rapid evolution toward the bank of the future, and both consumers and financial institutions need to adapt to these retail and mobile banking trends.\nBelow, we've detailed the past, present, and future of the banking industry as it relates to the IoT, and how these emerging technologies will transform the way we conduct our financial business.\nRetail Banking\nRetail banks have actually been using an early prototype of an IoT device for decades: the automated teller machine (ATM). Since their widespread adoption, ATMs have been one of the top IoT devices that make banks far more efficient by removing the need for long wait times to see a teller at a brick-and-mortar bank.\nThere were 2.7 million ATMs installed around the world in 2015, up from 2 million in 2010, according to estimates from BI Intelligence, Business Insider's premium research service, based on World Bank Data.\nBII\nAnd with this surging volume comes more security features, teller-assist functions, and more. These \"smart ATMs\" should help drive down costs for banks by reducing the number of employees needed inside traditional branches. Furthermore, a recent Chase survey showed that younger generations are more likely to use ATMs than older people.\nAs we move forward, banks are turning toward new IoT technologies to enhance the user experience and reduce costs. Some banks have started using beacons, for example, to send customized offers right to customers' smartphones as soon as they enter the branch. And some ATMs now have live stream video support that allows customers to speak to tellers if they need additional assistance.\nFinancial executives are pouring significant money into these technological changes to help stave off competition from tech companies that are sticking their hands into the financial services industry. A recent PwC survey revealed that these executives expect their digital investments to increase their revenues and enhance the customer experience above all else.\nMobile Banking\nPerhaps no technology will disrupt our financial transactions in the future more than mobile tech. The introduction of SMS into the public gave banks an avenue for mobile banking, but the explosion of smartphones in the last decade has truly caused mobile banking to go mainstream.\nToday, mobile banking apps are not an extra benefit in consumers' minds. They are a necessary part of the bank-customer relationship, and their absence could convince customers to switch to another financial institution.\nBut banking apps were just the beginning. Apple, Samsung, Android, Walmart, and more all have their own mobile wallets that allow customers to simply wave their smartphones and be on their way. BI Intelligence's Digital Disruption of Retail Banking report, which surveyed 1,500 millennials, found that approximately 27% of millennials had used their phone to checkout at a store in the last month.\nBII\nPeer-to-peer payment apps have also exploded thanks to their ease of use. The fact that much of the public uses \"Venmo\" as a verb speaks to the widespread influence of P2P apps. These services eliminate the need for consumers to visit an ATM to take out cash, which removes an extra step from the payment process.\nSmall businesses are adopting IoT technology and increasingly installing inexpensive mobile point-of-sale products (such as those offered by Square) in order to accept credit and debit cards when they previously could not. This technology further eliminates the need for cash.\nIn short, the smartphone is becoming the foundation of the future of mobile banking, especially among younger customers who will wield financial influence in the coming decades. Consider the following data from the BI Intelligence survey of millennials:\n71% of millennials say it's very important to have a banking app, and 60% say it's very important to have an app to make payments.\n51% say that they have made a purchase through a mobile website or through an app in the last month.\n27% say they have used their phone to make a payment at a checkout in a store in the last month.","url":"https://www.businessinsider.com/internet-of-things-banking-retail-mobile-trends-2016-9"}
