{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:05:18","date_modify":"2018-10-30 21:05:18","date_publish":"2016-12-22 00:00:00","description":"The payments industry is constantly changing with new startups looking to change the way we move money around the world. See the four latest trends in payment processing.","filename":"data/vaneerConsumption/FutureofPaymentsFourTrendstoKnowinPaymentProcessing.json","image_url":"https://amp.businessinsider.com/images/57b3342ece38f233008b7066-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_future-of-payments-trends-in-payment-processing-2016-10_1540933518.html","title":"Future of Payments: Four Trends to Know in Payment Processing","title_page":"    Future of Payments: Four Trends to Know in Payment Processing - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII The payments industry has been evolving rapidly, especially in the last few years with the growing shift to digital.\nThe global payments ecosystem is constantly changing as new startups try to change the way we move money around the world. Mobile wallets and the increased importance of card security to reduce fraud are some of the major trends that are shaping the future of payments processing.\nBelow, we've compiled a list of these types of innovative payment processing that will mark the future of the payments industry, and provided examples of each.\nFour Trends in Payments Processing\nMobile Wallets\nMobile wallets could be the single biggest transformation in payments processing if they take off in the way that many analysts expect.\nRetailers are particularly excited about mobile payments because they can offer valuable insights about customer transactions that companies can use to enhance the shoppers' experience. The speed of mobile payments can also help increase foot traffic in stores, which in turn would generate more sales.\nIn 2014, Apple was the only major mobile wallet on the market. But in 2015, Google and Samsung launched their own mobile wallets, and Walmart, Chase, and other major players joined the market. BI Intelligence, Business Insider's premium research service, expects in-store mobile payment volume to grow from $75 billion in 2015 to $503 billion in 2020.\nDigital Remittance\nMigrants have been sending money to their families and friends in their home countries for decades, but the digital shift is making that process easier than ever. And while digital still just holds a small portion of the global remittance market, growth at digital startups is tremendous.\nIn 2014, $583 billion were remitted across borders in 2014, and the World Bank expects that number to climb to $636 billion in 2017. BI Intelligence notes that digital accounted for 6% of all remittances in 2014.\nBut digital's share is growing thanks to the work of startups. Xoom, founded in San Francisco in 2001, grew 53% between 2012 and 2013 and 30% between 2013 and 2014. It now makes more revenue from digital than legacy company MoneyGram, the second-largest remittance company in the world.\nBII\nPayments Security\nThe U.S. has a major problem with credit card fraud, which cost retailers $32 billion in 2014. To mitigate this, card networks strongly encouraged merchants to upgrade to EMV security, which is the standard in other parts of the world. EMV cards have an embedded microchip for extra security.\nIn October 2015, fraud liability shifted to merchants from card issuers. And today, interest in EMV terminals is rising.\nSmall business owners had been one of the most hesitant groups in terms of upgrading to EMV, but that has changed as of the third quarter of 2016. In Q3, more than half of all small businesses had upgraded, up from just 31% one year earlier.\nmPOS\nMobile point-of-sale (mPOS) devices were extremely disruptive when they first debuted because they provided a sleek and easy way for all merchants to accept card payments. Today, consumers expect merchants everywhere to accept cards, so mPOS terminals have become even more important.\nBI Intelligence forecasts that there will be 27.7 million mPOS devices in circulation in the U.S. by 2021, up from just 3.2 million in 2014.\nRetailers will be the biggest group pushing the mPOS ecosystem to these new heights. Square, one of the more popular credit card processing companies in the U.S., is evidence of this. Large sellers (those who have more than $125,000 in annualized sales) represented 42%, or $5.25 billion, of Square's gross purchase volume in Q2 2016, up from just 8% in Q2 2011.\nMore to Learn\nMobile shopping trends are pointing to m-commerce as the wave of the future for shoppers. But mobile shopping is just one aspect of the broader payments ecosystem.\nThat's why BI Intelligence spent months compiling the best and most exhaustive guide on the world of payments entitled The Payments Ecosystem Report: Everything You Need to Know About The Next Era of Payment Processing.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of the payments ecosystem.","url":"https://www.businessinsider.com/future-of-payments-trends-in-payment-processing-2016-10"}
