{"authors":[],"date_download":"2018-10-30 14:25:04","date_modify":"2018-10-30 14:25:04","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/FutureCongresswomanChelseasScottishBookFestival.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208582.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2018_08_future_congresswoman_chelseas_scottish_book_festival_1540909504.html","title":"Future Congresswoman Chelsea's Scottish Book Festival","title_page":"Future Congresswoman Chelsea's Scottish Book Festival","title_rss":"NULL","source_domain":"americanthinker.com","text":"Chelsea's book festival session was titled \"Inspiring Women with Chelsea Clinton.\" The event was sold out, and well it should have been. After all, the devoted wife to shady investment banker Marc Mezvinsky, mother to abortion survivors Charlotte and Aidan, New York Times bestselling author, and grifter extraordinaire is self-proclaimed American royalty. In addition to those and many other stellar credentials, fake, phony fraud Chelsea is also vice chair of the Clinton \"Corrupt Money-Laundering\" Foundation and an occasional geriatric nurse to her \" indefatigable \" mother.\nIn the country of President Donald Trump's mother Mary MacLeod's birth, fresh off an appearance at The Rise Up for Roe Tour , on August 19, Chelsea Clinton was a guest speaker at the Edinburgh International Book Festival , where she delivered a hearty dose of vitriol.\nChelsea was invited to Edinburgh because she authors tactical handbooks for tiny social justice warriors with titles like It's Your World and Start Now. But writing picture books about female persistence is where the former NBC news correspondent really honed those literary chops. In 2017, Chelsea shared with Entertainment Weekly that her persistently persistent mother Hillary inspired the up with women series with titles like She Persisted and She Persisted around the World.\nAt the event, Chelsea boasted that, after losing to Trump, Hillary \"[h]as continued to persist forward in trying to have a positive impact in politics and outside politics in the way that I have seen her do my entire life.\" Speaking of persisting, and notwithstanding Hillary's behavior in a Javits Center reception room after she lost the 2016 presidential election, in Scotland, Clinton the Younger praised Mom, who, when not practicing yoga, spends time raising money at DNC fundraisers.\nNot that it matters, but according to the event website, Chelsea's job was to \"celebrate women who have used their voices and determination to change and shape history\" and to inspire attendees by sharing the stories of \"real-life heroes\" such as Marie Curie and J.K. Rowling. Instead, the imperious offspring of two of the smuggest individuals on the planet proceeded to transform a book festival into a Trump-bashing forum where, rather than focus on children's books, she dabbled in softcore sedition and presented herself as a potential savior in a post-Trump apocalyptic world.\nExhibiting familial messiah-complex tendencies, Chelsea shared that \"every day,\" she is \"outraged ... by something our president has done or said or left undone or neglected.\" Then again, a booming economy, Americans working, a soaring stock market, affinity for the Constitution, respect for life, and healed relationships with problematic world leaders are successes that should outrage any self-respecting progressive.\nMimicking her mother's thoughtful mid-sentence pauses and injecting ostentatious vocabulary into a discussion about children's literature, at the U.K. book event, know-it-all Chelsea expressed gratitude toward obstructionist Democrats in Congress erecting barriers to Trump's agenda every step of the way when she said:\nAt the federal level, as much as I abhor so much of what President Trump is doing, I have a great amount of gratitude for what my congresswoman and my senators are doing to try to stop him at every point.\nThen, unaware of how profoundly hypocritical she sounded, especially after appearing in New York City for Rise Up for Roe, where she thanked NARAL and Planned Parenthood for all they've done for the economy by ensuring that 3,000 babies a day are \"ripped\" from the womb and thrown into a garbage heap, Chelsea continued:\nI think I'm just so fundamentally my mother's daughter that I'm far more outraged by the Trump administration ripping children away from their families at the border and not having reunified those children with their families now for months, than I am about anything he has ever done to my families.\nHinting that if the Democrats lose the midterms, she'll be willing help save the nation, Mrs. Mezvinsky reassured attendees that she is contemplating her role in the liberation of America from the ravages of Trump:\nI think my family ... is being really well represented. But if that were to change, if my city councilor were to retire, if my congresswoman were to retire, my senators, and I thought that I could make a positive impact, then I think I would really have to ask my answer to that question.\nHuh?\nNotwithstanding the Clinton vision to reverse or undermine Trump's progress, like mother, like daughter, both power-hungry elitists love to portray themselves as selfless civil servants just \"trying to have a positive impact\" – neither of which could be farther from the truth.\nAdd to that charade mother, who always swears she's not running for president before announcing she's running for president, followed by daughter, who just last year emphatically told Variety: \"Hi, I'm Chelsea Clinton, and one thing you may not know about me is I am not running for public office. I mean, I just – no.\"\nNow, one year later, at a Scottish book festival, Chelsea mused as to whether or not she plans to wrest the baton from mom's death grip. Chelsea called her plans to run for office a \"definite maybe,\" saying, \"For me it's a definite 'no' now, but it's a definite 'maybe' in the future because who knows what the future is going to bring?\" This, translated from Clinton \"it depends upon what the meaning of the word 'is' is\"-speak, means Chelsea's \"no\" is a definite \"yes.\"\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2018/08/future_congresswoman_chelseas_scottish_book_festival.html"}
