{"authors":["Laurie Whitwell For Mailonline"],"date_download":"2018-10-23 00:37:42","date_modify":"2018-10-23 00:37:42","date_publish":"2016-01-29 13:43:59","description":"The Villa manager has looked to offload the 29-year-old, who has featured only 10 times so far this season, to raise cash for new signings and Turkish club Kayserispor are interested.","filename":"data/vaneerConsumption/GabbyAgbonlahorwillnotleaveAstonVillabeforedeadlinedayinsistsRemiGarde.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30ACE97A00000578-0-image-a-52_1454075013655.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422802_Gabby-Agbonlahor-not-leave-Aston-Villa-deadline-day-insists-Remi-Garde_1540255062.html","title":"Gabby Agbonlahor will not leave Aston Villa before deadline day, insists Remi Garde","title_page":"Gabby Agbonlahor will not leave Aston Villa before deadline day, insists Remi Garde | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Remi Garde does not believe Gabby Agbonlahor will leave the club before deadline day.\nThe Villa manager has looked to offload the 29-year-old to raise cash for new signings and Turkish club Kayserispor are interested.\nBut Garde said: ‘By Monday I don’t think so. I think he’ll still be here next week, yes.’\nRemi Garde insists that Aston Villa stalwart Gabby Agbonlahor will not leave the club before deadline day\nThe Villa manager has looked to offload the 29-year-old to raise cash for new signings this month\nThe striker has played only 10 times this season and has not featured for the first-team since early December\nHe added: ‘When I arrived Gabby was injured (calf) and not at training sessions for a long time. He trained last week and seems better – if he’s in the right mood and okay physically he could give us a lift with goals.\n‘Every player who’s not playing is frustrated apart from 11 playing the game. You’re a pro player, you want to start the game.’\nGarde is waiting on a response from the FA over a second work permit appeal for Hadjuk Split goalkeeper Lovre Kalinic and hopes to bring in at least one fresh face before Monday.\nGarde is waiting on a response from the FA over work permit appeal for Hadjuk Split goalkeeper Lovre Kalinic\nHe would not elaborate on any possible loan deal for Arsenal’s Mathieu Debuchy.\n‘Everybody is working on these players, myself and other people at the club involved in this process,’ Garde said.\n‘For many reasons it’s difficult for us to sign players. Before Monday I am still hoping I can add players.’","url":"https://www.dailymail.co.uk/sport/football/article-3422802/Gabby-Agbonlahor-not-leave-Aston-Villa-deadline-day-insists-Remi-Garde.html"}
