{"authors":[],"date_download":"2018-10-23 05:12:49","date_modify":"2018-10-23 05:12:49","date_publish":"2016-01-11 18:22:06","description":"A soon-to-be-released African spinoff of a popular French series on the travails of parenting, made in Gabon, captures a continent divided between tradition ...","filename":"data/vaneerConsumption/GabonlaunchesspinoffofpopularFrenchTVseriesonparenting.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-701j6-48qEJGFphM8d437f0aaf927f9541-252_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394350_Gabon-launches-spinoff-popular-French-TV-series-parenting_1540271569.html","title":"Gabon launches spinoff of popular French TV series on parenting","title_page":"Gabon launches spinoff of popular French TV series on parenting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gabon launches spinoff of popular French TV series on parenting\nA soon-to-be-released African spinoff of a popular French series on the travails of parenting, made in Gabon, captures a continent divided between tradition and modernity.\nThe French original, \"Parenting: a how-to guide\", is only three minutes long but is watched by 4.5 million people who track daily lives of a hapless couple and their progeny aged 16, 12 and eight.\nThe Gabonese version however plays with the themes of age-old customs and Westernisation: two strong parallel strains in a continent trying to catch up with the world while retaining its values and culture.\nStudents standing in the courtyard of their school in Libreville on January 5, 2016 and their daily lives with their parents will be discussed in the African spinoff of the French show \"Parenting: a how-to guide\" ©Steve Jordan (AFP/File)\nThe couple, Magloire and Fatou Ndong, are in their 40s and parents of two teens and a younger child. But that is where the resemblance with the French original ends.\n\"In the African version, we have played upon the idea that there is a transformation today in the continent. On the one side a very traditional father... and on the other a mother who studied in France and is more open,\" said the Franco-Gabonese director Samantha Biffot.\nThe Gabonese version was filmed in November in the capital Libreville and will start airing in February. Sixty of the three-minute episodes have already been shot.\nThere are references to local specialities, including the myriad -- and very particular accents -- that proliferate in the mainly English- and French-speaking continent.\nWhen one of the children asks the parents for help with French \"accents\" -- which guide pronunciation in written French -- the father pitches in, mimicking several accents of neighbouring countries such as Cameroon, Senegal and regional powerhouse Nigeria.\n\"All that's fine, but who knows the French accent marks?\" says the eight-year-old son.\nThe show's makers have sought to be fair in their treatment of the varying ways to raise children.\n\"We have tried to poke fun at both types of upbringing,\" said Biffot, who won a prize for the best TV series in 2013 at Fespaco, Africa's main film festival for \"Eye of the City\".\nOmar Defunzu -- a popular local comedian who plays the father -- says society has been transformed in Gabon, where oil riches have changed the lot of a tiny minority but meant a per capita income four times that of most sub-Saharan Africa.","url":"https://www.dailymail.co.uk/wires/afp/article-3394350/Gabon-launches-spinoff-popular-French-TV-series-parenting.html"}
