{"authors":["Spencer Morgan For Mailonline"],"date_download":"2018-10-23 00:57:29","date_modify":"2018-10-23 00:57:29","date_publish":"2017-04-26 11:00:21","description":"Manchester City forward Gabriel Jesus looks in high spirits as he prepares to make his highly-anticipated comeback from injury.","filename":"data/vaneerConsumption/GabrielJesusrecreatestrademarkphonecelebration.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EA7F600000578-0-image-a-10_1493198867289.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447000_Gabriel-Jesus-recreates-trademark-phone-celebration_1540256249.html","title":"Gabriel Jesus recreates trademark 'phone celebration'","title_page":"Gabriel Jesus recreates trademark 'phone celebration' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester City forward Gabriel Jesus looks in high spirits as he prepares to make his highly-anticipated comeback from injury.\nThe Brazilian, who arrived at the Etihad in January, has been sidelined since suffering a fractured metatarsal in a Premier League clash with Bournemouth on February 13.\nBut he is now closing in on a return, with some reports suggesting the 20-year-old could be included in the squad for Thursday's showdown with rivals Manchester United.\nGabriel Jesus (left) shows off his famous 'phone call celebration' with his mother Vera\nGabriel was not included uin the squad for Sunday's FA Cup semi-final defeat to Arsenal\nAnd Jesus has taken to Instagram to remind City fans of the brilliant start he made to life in Manchester.\nPosing alongside his mother Vera, the youngster recreated the trademark 'phonecall celebration' which is dedicated to her, joking that she has control of the television.\nThe gesture, which Jesus also has tattooed on his skin, was first produced after he scored for the Brazilian national team in a 2-0 win over Venezuela.\nHis mother had rang him prior to the match, concerned about the pressure that was being placed upon her son in the absence of star man Neymar.\nThe youngster had no such concerns and took to the match with aplomb, scoring a spectacular effort and sealing with the now famous phone celebration.\nThe Brazilian recently returned to training after recovering from a fractured metatarsal\nThe highly-rated youngster got the celebration tattooed on his skin earlier this month\nGabriel later explained: 'It was a joke with my friends, a 'hello, mother'. My friends know why. My mother knows too. It was a celebration for them.'\nWhilst inclusion in the squad for Thursday's crucial Premier League game remains a slight possibility, next Sunday's game at Arsenal looks a more realistic target.\nAnd team-mate Fernandinho has urged patience, telling the club's official website: 'Gabriel is coming back now and I think we must be patient and have some caution; a foot injury is always complicated.\n'But we know that whenever he is ready he will come back well and give everything, as always, and he will be very important for us.'","url":"https://www.dailymail.co.uk/sport/football/article-4447000/Gabriel-Jesus-recreates-trademark-phone-celebration.html"}
