{"authors":[],"date_download":"2018-10-23 02:54:34","date_modify":"2018-10-23 02:54:34","date_publish":"2017-03-10 12:18:10","description":"Gambian coalition parties which united last year to deliver the first new president in 22 years are unlikely to run together for legislative elections next...","filename":"data/vaneerConsumption/Gambiacoalitionnearcollapseoverlegislativeelection.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/18/wire-197347-1489168993-865_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301102_Gambia-coalition-near-collapse-legislative-election_1540263274.html","title":"Gambia coalition near collapse over legislative election","title_page":"Gambia coalition near collapse over legislative election | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gambian President Adama Barrow was elected after opposition parties came together to choose one candidate to represent them all\nGambian coalition parties which united last year to deliver the first new president in 22 years are unlikely to run together for legislative elections next month, a senior government source told AFP.\nPresident Adama Barrow said in January his coalition government would \"continue as a family\" in selecting candidates for the national assembly poll on April 6, a declaration now thrown into doubt.\n\"We cannot reach an agreement on how to contest the parliamentary election,\" a senior figure within Barrow's administration told AFP late Thursday.\n\"One of the parties wants 36 of the 53 constituencies to be reserved for them. We are parting ways,\" the source said.\nCandidate registration began on Thursday and lasts until Sunday, pressuring the parties to find a deal.\nThe coalition figure voiced frustration that the infighting was likely to embolden the party of former president Yahya Jammeh, who ruled the country with an iron fist for two decades until leaving for exile in January.\nYankuba Colley, chief campaigner for Jammeh's Alliance for Patriotic Reorientation and Construction (APRC), said he was confident of the party's chances.\n\"We are going to defeat our opponents in the forthcoming election and dominate the National Assembly. We are going to field candidates in all the constituencies. We are the biggest party,\" Colley told AFP.\nThe Gambia at a glance\nBarrow was formerly a member of the United Democratic Party (UDP), the largest opposition grouping in the Jammeh era, but resigned to run as the coalition flagbearer.\nTensions over the coalition led to the assault of a journalist last Sunday by Barrow supporters after he asked if the coalition parties would run together at a press conference.\nThe incident caused an outcry among reporters promised a freer press environment than under the Jammeh regime.\nOn Friday the interior minister Mai Fatty apologised to the journalist involved, Kebba Jeffang of the Forayaa newspaper, an AFP journalist witnessed.\nBarrow's cabinet is made up of the heads of the seven parties and single independent candidate who formed the coalition, and he had barely finished putting his government together before the disagreements began.\nOn Thursday, six new ministers were sworn in, just hours before talks broke down between the coalition parties.\nHowever the position of vice president remains vacant as Barrow's appointment of Fatoumata Tambajang was declared unconstitutional.\nShe becomes the country's new women's affairs minister.","url":"https://www.dailymail.co.uk/wires/afp/article-4301102/Gambia-coalition-near-collapse-legislative-election.html"}
