{"authors":["Vadim Zlotnikov","The Alliance Bernstein Blog"],"date_download":"2018-10-31 00:12:50","date_modify":"2018-10-31 00:12:50","date_publish":"2014-09-23 00:00:00","description":"Take a cue from Fed guidance.","filename":"data/vaneerConsumption/GamePlanForWhenTheFedRaisesRates.json","image_url":"https://amp.businessinsider.com/images/5421d8c56da811fb61c31fd5-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_game-plan-for-when-the-fed-raises-rates-2014-9_1540944770.html","title":"Game Plan For When The Fed Raises Rates","title_page":"    Game Plan For When The Fed Raises Rates - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Investors should have a plan for what to do if interest rates rise faster and farther than originally expected. Suhaimi Abdullah/Getty Images Capital markets could get a jolt if the US Federal Reserve raises interest rates faster and farther than expected. But we don't think there would be a major sell-off in risk assets, and there are several ways for investors to play the possibilities.\nBased on the pricing of futures contracts for the federal funds rate, the key US short-term policy rate, the market expects short-term rates to rise to 0.75% by the end of 2015. That's almost half a percent below the target set by the Federal Open Market Committee (FOMC). In other words, the market doesn't believe that the Fed will follow through on its announced rate-hike plans.\nBy itself, this disconnect isn't too troubling. Historically, interest-rate increases from extremely low levels are generally positive for equities. So, even if the Fed raises rates sooner than markets expect, past data argue against a big decline in risk assets. And the business cycle would seem unlikely to turn down until inflation-adjusted interest rates rise higher than a range of 1.5% to 2%.\nHowever, focusing on the timing and magnitude of the Fed's policy actions may reveal short-term investment opportunities and help with long-term portfolio repositioning.\nTake a cue from Fed guidance.\nIf investors believe that the Fed will act in line with its statements, they can look to profit by taking short positions in fed funds futures, which are trading well below levels indicated by FOMC guidance. This type of position could benefit from faster-than-expected rate increases. However, it's not easy to get the timing right — and being early could lead to losses.\nPosition for higher volatility.\nInvestors can also position their portfolio assets to anticipate that markets will become more uncertain as the Fed starts to raise interest rates, which would lead to higher volatility and a general repricing of risk. One way would be a swap contract that pays off if volatility rises.\nHistory suggests that there isn't much impact on markets early in rate-hike cycles, but this time could be different. Corporate business models, financial products and investor sentiment are highly leveraged to the notion of persistently high market liquidity. Anything that might reduce that liquidity increases uncertainty. Entering this type of position is costly, so it's important to have a view on the timing and size of rate increases to reduce the expense.\nConsider \"tail insurance.\"\nThere may be an opportunity to take a contrarian bet, because the cost of buying protection against a substantial upturn in inflation is very low. The price of an option that will pay off if inflation over the next decade is 2% higher than the current break-even rate—about 2% today—has collapsed. If an investor assumes that the Fed will be behind the curve and that inflation will accelerate, it could be profitable to buy some sort of insurance that goes against the grain of the widely held consensus belief of benign inflation.\nReposition toward rate-friendly investments.\nInvestors might want to start rethinking their portfolio positioning. The goal is to reduce investments that are leveraged to persistently low interest rates in favor of investments with positive or neutral correlation to interest rates. These investments could be equities of companies with large money-market funds, which could become profitable in a rising-rate environment, or a broader set of strategies with low or positive correlation to rates.\nSome investments, such as market-neutral strategies, are directly exposed to an increase in short-term rates. Others, such as real assets or inflation-protection strategies, take a more indirect route. They have a high beta — or responsiveness — to inflation expectations.\nThe sourcing for these investments should come from the most crowded strategies whose performance and liquidity are most leveraged to persistently low funding costs. In our assessment, these may include the riskiest tranches of high-yield debt; bank loans; infrastructure, farm and select real estate investments; and US equities with high debt/equity ratios.\nJust because there's a lack of certainty about how the Fed's plans and market expectations will play out doesn't mean investors have to sit back and wait.","url":"https://www.businessinsider.com/game-plan-for-when-the-fed-raises-rates-2014-9"}
