{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 20:37:23","date_modify":"2018-10-22 20:37:23","date_publish":"2016-01-28 02:22:52","description":"The 27-year-old can pull trucks, airplanes and even smashed a 1,000 year old Viking record by lifting a 1,500 lbs log.","filename":"data/vaneerConsumption/GameOfThronesMountainHafthrJlusBjrnssonrevealsstrengthanddietregime.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A5E20900000578-0-image-a-4_1453941194707.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420172_Game-Thrones-Mountain-Hafth-r-J-l-Bj-rnsson-reveals-strength-diet-regimen-allows-pull-airplanes-lift-1-500-lbs_1540240643.html","title":"Game Of Thrones Mountain Hafthór Júlíus Björnsson reveals strength and diet regime","title_page":"Game Of Thrones Mountain Hafthór Júlíus Björnsson reveals strength and diet regime | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He can pull trucks, airplanes and even smashed a 1,000 year old Viking record by lifting a 1,500 lbs log.\nAnd Game Of Thrones star Hafthór Júlíus Björnsson has revealed the training and diet secrets that have allowed him to become one of the world's strongest men.\nThe Scandinavian strongman, who plays the appropriately named Gregor 'The Mountain' Clegane in the hit HBO show, eats up to eight meals a day and hoists heavy metal as he works his already massive muscles.\nScroll down for video\nMan Mountain: Hafthór Júlíus Björnsson has revealed how he built the body that won him the role of Ser Gregor Clegane on Game Of Thrones\nIn the new issue of GQ he says he had initially been a scrawny basketball player who represented Iceland at under-18 level, but took up weightlifting after injuries halted his career as a professional.\nHe added : 'I just fell in love with the weights, fell in love with training hard.\n“It’s not just all about the training, it’s all around: You have to train well, sleep well, eat well. If you don’t eat, you don’t grow.'\nAnd he is certainly dedicated to his pursuit of pure brawn, as he has never missed a single workout for the last six years.\nWhen all the pieces are put together it allows the 27-year-old, who is a towering 6ft 9ins, to grow from a relatively puny 231 lbs and able maintain a 396 lbs body made up of mostly pure muscle.\nWorth the weight: He said it took six years of painstaking workouts that got him to his current state\nTank pulls truck: And it allows him to achieve amazing feats of strength such as pulling lorries\nTo maintain his size he has to eat between six and eight meals a day, which are made up of meat, fish, chicken, sweet potatoes, cocoa butter, almonds, spinach, avocado and broccoli.\nHe said: 'It is not easy. When I’m filming, I always have to have breaks to eat.\n'I eat very healthy overall, but because of my weight, I need fast carbs.\n'So maybe before a training session or after a training session, I eat what I want.'\nHis dedication has allowed him to pull 15-tonne airplanes and trucks, and to carry a car on his shoulders.\nHowever there is one thing in his strongman career that gives him by far the most pleasure.\nWhat a jerk: He made it look easy as he cleaned these heavy balls of metal\nFavourite feat: He said lifting this 1,500 lbs is particularly memorable as it broke a Viking record that stood for a millennium\nFor when he lifted a 1,500 lbs log he managed to break a Viking record that had stood for a millennium.\nThe actor and athlete said: 'The thing that I’m probably most proud of probably is my Viking record.\n'After that, I felt my body was quite f***ed up. It did heal up quite fast after the record.\n'I did celebrate with my friends, and I ate a lot!'\nThe Iceman: The Iceland-born star is a proud nationalist through and through\nWho needs Charles Atlas? Hafthór is now one of the world's most famous musclemen\nAnd while his most famous on-screen moment was when he duelled the deadly Red Viper Prince Oberyn Martell to the death, ending the fight by crushing his skull with his bare hands, he has fought tough opponents in real life too.\nThe beefcake spoke about his friendly sparring session with UFC featherweight champion Conor McGregor, claiming he went easy on the MMA fighter, who weighs in at a relatively tiny 145 pounds.\nHafthór said: 'He was trying to punch me. I didn’t feel anything. He believes he won it.\n'He does not know that I was taking it easy on him because he has a fight and I didn’t want to break him before the fight. He’s worked too much, so I didn’t want to break him.\nFamous fight: He is best known for facing off against Prince Oberyn Martell in a deadly GOT duel","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420172/Game-Thrones-Mountain-Hafth-r-J-l-Bj-rnsson-reveals-strength-diet-regimen-allows-pull-airplanes-lift-1-500-lbs.html"}
