{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 20:47:01","date_modify":"2018-10-22 20:47:01","date_publish":"2016-01-28 03:41:17","description":"The 29-year-old confirmed that his character was 100 per cent killed at the end of season five in an interview with BBC Breakfast on Tuesday.","filename":"data/vaneerConsumption/GameofThronesKitHaringtonconfirmsJonSnowWASkilled.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A658C400000578-0-image-a-25_1453949433292.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420304_Stone-faced-Kit-Harington-confirms-character-killed-Game-Thrones-expertly-sidesteps-questions-s-coming-back_1540241221.html","title":"Game of Throne's Kit Harington confirms Jon Snow WAS killed","title_page":"Game of Throne's Kit Harington confirms Jon Snow WAS killed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's definitely dead.\nBut that doesn't mean Jon Snow is gone from Game Of Thrones.\nKit Harington confirmed that his character was 100 per cent killed at the end of season five in an interview with BBC Breakfast on Tuesday.\nScroll down for video\nAll me must die: Kit Harington confirmed in an interview on Tuesday his character was killed in Game of Thrones, but expertly sidestepped questions on whether he was coming back\nBut as the interviewer tried to trap him into revealing he will come back 'in some respect', the 29-year-old parried him off with all the expertise of a dancing master.\n'I think anyone who wants to know what happens in season six has to wait until it comes out,' he replied stone-faced, when asked why he was in the promotional material and why he was spotted on set.\n'All I can tell you is Jon Snow... is dead,' he said. 'He died at the end of last season.'\n'But his spirit lives on...?' the interviewer harried.\n'Who knows? We'll have to wait and see. It's going to be a very exciting season,' he recited, before adding with the slightest of smirks: 'so I'm led to believe.'\nRIP: 'All I can tell you is Jon Snow... is dead,' he said. 'He died at the end of last season.'\nJust a fan: When harried on whether he'll come back 'in some respect', he replied: 'Who knows? We'll have to wait and see. It's going to be a very exciting season,' before adding with the slightest of smirks: 'so I'm led to believe'\nEven general questions about the show, the actor carefully answered just like any other unconnected fan.\n'I think they usually release it around April, so I'm expecting it to come out then,' he said. 'I can't wait to see it. I'm really looking forward to it.'\nThe interviewer threw one last desperate bolas in an attempt to trip him up: 'You're not going to miss it?'\n'I'm not going to miss it,' he stoically repeated, knowing any other answer would have given the game away.\nSchtum: The Brit tactically avoided question about the Lord Commander's fate by insisting 'anyone who wants to know what happens in season six has to wait until it comes out'\nMortality: The actor insisted the fact that beloved characters - such as his own - could die at any point in the brutally unpredictable series was what made it such an exciting show\nHe insisted the fact that beloved characters - such as his own - could die at any point in the brutally unpredictable series was what made it such an exciting show.\n'It has been a theme for the show and I think it's what makes the show very exciting, it's what people love about it; there's no safety there, there's no one lead character that's going to make it through,' he said. 'You can't trust that anyone will do that.'\nEarlier in the interview, Kit admitted he didn't think the Game Of Thrones would ever be a success, because the source material was so 'bizarre'... and his original wig was so bad.\nJust a scratch: Ever since he was betrayed and stabbed by his Night's Watch brothers in the closing scene of season five, Game Of Thrones fans have staunchly clung to any rumour, hint or theory the broody bastard son of Ned Stark was somehow not done yet\nNot letting go: Indeed, much of HBO's promotional material has focused on the supposedly deceased black brother: it's teaser poster is just his own darkened, bloodied face\n'I remember what I thought when I first read it, which was [this is] the most bizarre thing I've read, ever,' he said. I thought: how is this going to work? Is this ever going to work? Are people ever going to watch this?\n'So I think it was a really pleasant surprise for us all when it took off the way it did.'\nHe continued: 'I had a horrible wig on in the pilot, it just didn't work. No one has ever seen it, it's in some back room somewhere, and I'd like it to stay there I think.'\nGame Of Thrones returns with season six on April 24.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420304/Stone-faced-Kit-Harington-confirms-character-killed-Game-Thrones-expertly-sidesteps-questions-s-coming-back.html"}
