{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 04:15:28","date_modify":"2018-10-23 04:15:28","date_publish":"2017-03-16 15:36:38","description":"Game Of Thrones' Nathalie Emmanuel is most thankful for roles that promote diversity, because the lack thereof on TV during her own childhood directly affected her self-esteem.","filename":"data/vaneerConsumption/GameOfThronesNathalieEmmanuelinshootforHungermag.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E553DCB00000578-0-image-a-112_1489678373305.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320498_Game-Thrones-Nathalie-Emmanuel-unrecognisable_1540268128.html","title":"Game Of Thrones' Nathalie Emmanuel in shoot for Hunger mag","title_page":"Game Of Thrones' Nathalie Emmanuel in shoot for Hunger mag | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's landed a bigtime role on one of the most-watched cult TV shows in recent times.\nBut Game Of Thrones' Nathalie Emmanuel is most thankful for roles that promote diversity, because the lack thereof on TV during her own childhood directly affected her self-esteem.\nLooking unrecognisable in a shoot for Hunger magazine, the former Hollyoaks actress explains how her mixed heritage was previously underrepresented.\nScroll down for video\nEdgy: Nathalie Emmanuel showed off an edgier side in the new shoot for Hunger magazine, as she spoke about the lack of diversity she saw when she grew up\n'For me, when I was growing up, not seeing anyone on television that looked like me or that I could identify with was really hard, and that can affect someone's self-esteem hugely.'\nNathalie's mother is Dominican and her father is half Saint Lucian, half English but grew up in Southend.\nHer image was certainly not the one that fans of the HBO show will recognise, in this latest photoshoot.\nPunk: The brunette was far from her Game Of Thrones image as she was seen dressed in a leather dress with straight hair\nRead it first: Nathalie speaks to Hunger magazine in the April issue\nShot in black and white, Nathalie's natural curls are no longer as she experiments with a sleek, poker straight style.\nThe edgy pictures see Nathalie balancing a huge weight on her shoulders as she poses elegantly in a busty leather prom dress.\n'There has been an improvement in casting,' she said. 'But what I often worry about is because it's been called out that means that now people are saying, \"Okay, we're going to make it really diverse.\"\n'Will it be that they just do the one film and then it goes back? If you go up for anything, you know there is always a cast of people and a small number of them are [from] a minority.\n'The majority of the cast will be white with a few roles from a different ethnicity. Ultimately that's not the world we live in.'\nWho's that girl: Nathalie is now best known for her role of Missandei in HBO series Game Of Thrones (right)\nSmall role? The series has previously been criticised for the number ethnic minorites it features\nFame: Nathalie's part, alongside Michiel Huisman, from left, Peter Dinklage, Emilia Clarke, and Iain Glen, lead to stratospheric fame around the globe\nNathalie managed her big TV break in 2006 when she played Sasha Valentine in the Channel 4 soap, a role she starred in for four years.\nIn 2013, she scooped the role of Missandei in HBO series Game Of Thrones, leading to stratospheric fame around the globe.\nPreviously, David Oyelowo laid into the producers of Game Of Thrones for using ethnic minorities in minor and secondary roles.\nSpeaking to the Radio Times, the Golden Globe nominee explained: 'The fact that they put any ethnic minorities in that means that there should be space for bigger characters because you’re not just saying \"OK this is purely a white world, and here are very story-driven reasons why that’s the case.\"'\nSpeaking out: Nathalie said that she was affected when she didn't see minorities on television as a child\nGame Of Thrones has featured some ethnic minorities in its ever-changing cast, including army general Grey Worm (Jacob Anderson), pirate Salladhor Saan (Lucian Msamati), wealthy schemer Xaro Xhoan Daxos (Nonso Anozie) and guard Areo Hotah (DeObia Oparei).\nMeanwhile, actress Nathalie was full of praise for the Fast & Furious film series, in which she played Ramsey, saying that it promoted 'nothing but diversity'.\n'Their audience is from all over the world,' she said. 'And they have got people from all parts of the globe in those movies, of all colours and all ethnicities, and I think that is really important.'\nThe full Nathalie Emmanuel shoot appears in issue 12 of Hunger magazine released March 16th","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320498/Game-Thrones-Nathalie-Emmanuel-unrecognisable.html"}
