{"authors":["Frances Martel"],"date_download":"2018-10-30 19:26:03","date_modify":"2018-10-30 19:26:03","date_publish":"2016-01-07 17:09:33","description":"A group of about 30 men in camouflage bulldozed an active hospital in China this morning, destroying an estimated $600,000 worth of medical equipment and trapping doctors and patients inside.","filename":"data/vaneerConsumption/GangBulldozesHospitalwithPatientsStaffStillInside.json","image_url":"https://media.breitbart.com/media/2016/01/China-hospital-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_07__1540927563.html","title":"Gang Bulldozes Hospital with Patients, Staff Still Inside","title_page":"China: Gang Bulldozes Hospital with Patients, Staff Still Inside","title_rss":"NULL","source_domain":"breitbart.com","text":"A group of about 30 men in camouflage bulldozed an active hospital in China this morning, destroying an estimated $600,000 worth of medical equipment and trapping doctors and patients inside.\nThe Fourth Affiliated Hospital of Zhengzhou University in Henan Provice has been reduced to a pile of rubble, doctors and patients attest, after a group of men appeared at the hospital at around 9 AM local time with a bulldozer and took to tearing down the facility, interrupting active radiology exams, and working for ten minutes until the hospital was destroyed. According to the Shanghai Daily, the hospital had been served a land eviction notice from the local government, seeking to build a road where the hospital stood. The men who leveled the building did not identify themselves as government workers, however, and the police claims to be investigating further.\nIt is believed that only three doctors were injured in the affair, as they tried to rush into the building and save patients and equipment. Six bodies at the adjacent morgue are reportedly lost in the rubble, preemptively buried.\nAt least one doctor is missing, Shanghai Daily notes: “Another doctor who took a picture of the car plate number was immediately taken onto a vehicle by five men to grab his mobile phone.”\nChinese state media is reporting the incident as a freak attack on a hospital. The Mandarin-language page of Xinhua, a state-run outlet, described the assailants as “young people wearing camouflage uniforms.” It quotes witnesses saying the entire demolition took “less than a half hour… we had not time to respond.”\nLiu Chunguang, the hospital radiology director, told Xinhua he was doing a chest radiograph when “the house was stabbed… the patient, scared half to death, ran away.” Hospital spokesman Yuan Fang condemned in particular the loss of corpses in the mortuary as signifying “a lack of respect for the dead, I never thought such a thing would happen.”\nImages at the People’s Daily show the extent of the destruction:\nVideo on Chinese social media taken by reporters at the scene also shows what appears to be the aftermath of an explosion, but is in actuality the result of demolition work. One doctor quoted at a social media site admits he first believed he was in the middle of an earthquake.\nOne of the largest newspapers in Brazil, O Globo, appears to be one of the only international outlets to pick up the story. Their report notes that, “although illegal,” such demolition “is common in China due to property disputes in which local governments do not act to control the abuses of construction companies.”\nWhat is particularly uncommon, however, is such acts in a larger city like Zhengzhou. In a 2012 report, the Council of Foreign Relations notes that a study that year found that the Chinese government nationalizes land from an average of 4 million rural Chinese citizens annually, and pays an average of $17, 850 per acre in exchange, about 2.4% of the land’s retail value.\nThe issue rose to international prominence in 2008, as the need for facilities for the Summer Olympic Games triggered a wave of land grabs within Beijing itself. “Isn’t this supposed to be a ‘People’s Olympics’?” a man whose house was destroyed to make way for the Bird’s Nest stadium told Reuters at the time. Rights groups noted that those protesting the evictions were facing threats of violence.\nThe Zhengzhou University hospital system is one of the world’s biggest, and home to the world’s single largest hospital: the First Affiliated Hospital of Zhengzhou University. Despite its size, widespread mistrust in medical care in rural areas keeps Zhengzhou First Affiliated struggling to maintain enough beds for patients, as many travel hundreds of miles for their care rather than visiting local doctors.","url":"https://www.breitbart.com/national-security/2016/01/07/china-camouflaged-gang-bulldozes-hospital-with-patients-staff-still-inside/"}
