{"authors":["Jessica Chia For Mailonline"],"date_download":"2018-10-23 04:08:01","date_modify":"2018-10-23 04:08:01","date_publish":"2016-01-11 17:08:46","description":"David Hall, 48,(pictured) repeatedly knifed 82-year-old widower Dennis Plater after he was told his services as a gardener were no longer needed.","filename":"data/vaneerConsumption/GardenerDavidHalljailedforlifeafterstabbingelderlycustomer40times.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D127200000578-0-image-a-29_1452531672597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394193_Gardener-jailed-life-stabbing-elderly-customer-40-times_1540267681.html","title":"Gardener David Hall jailed for life after stabbing elderly customer 40 times","title_page":"Gardener David Hall jailed for life after stabbing elderly customer 40 times | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hall appeared at former employer's home the next day and 'snapped' after the pensioner mentioned his previous thefts and failed to shake Hall's hand\nDavid Hall, 48, pictured, will serve at least 18 years in jail and may never be released after stabbing his former employer more than 40 times\nA gardener who stabbed an elderly customer more than 40 times has been jailed for life after pleading guilty to murder.\nDavid Hall, 48, repeatedly knifed widower Dennis Plater in the kitchen of his home in Stroud, Gloucestershire after being told he had been replaced.\nHall will serve at least 18 years' imprisonment but may never be released, Bristol Crown Court heard.\nMr Plater, 82, had hired another gardener because Hall failed to turn up to work for five weeks.\nPlater had left an apologetic message on Hall's mobile phone, informing him of the job loss and thanking him for his work.\nHall then visited the model railway enthusiast in November 2014 and stabbed the pensioner in his kitchen after hearing the news in person.\nHe then 'cleared out' all the cash he could find in Mr Plater's home, taking about £100 and leaving just 20p in the pensioner's wallet.\nAt a previous hearing Hall had admitted murder but denied it was for financial gain saying he lost his temper after Mr Plater refused to shake his hand.\nAfter a lengthy legal argument Judge Neil Ford QC, The Recorder of Bristol, ruled Mr Plater's killing was not financially motivated but said Hall stole all the cash he could find afterwards.\n'You went to Mr Plater's home and he invited you in and gave you a drink of water. Only you know what happened thereafter,' the judge said.\n'You say it was when he refused to take your hand, turned his back on you and asked you to leave that you lost your temper.\n'You launched a dreadful attack on Mr Plater in his kitchen stabbing him repeatedly. He suffered over 40 wounds, particularly to his head and face.\nDennis Plater, 82, had left a message on Hall's mobile to tell him his services as a gardener were no longer needed. Hall had failed to turn up to work for five weeks after he stole more than £550 from Costa and secretly moved about 100 miles away to Portsmouth\n'I have no doubt that when you commenced that attack you intended to kill him. You didn't check on him, you didn't call for an ambulance and you didn't call the police.\n'Instead you washed your hands and wiped the knife and removed all the money you could find from that man's home as he lay dead or dying on his kitchen floor.\n'That was by any judgement an extraordinary callous act.'\nThe judge added: 'You gave lengthy evidence and even when you were expressly asked about it you showed not the slightest bit of remorse for your actions.\n'At one stage you said you were sorry. It was wholly insincere and what was abundantly clear to me was that you were most concerned about you own predicament.\n'You have caused a great deal of suffering and loss to Mr Plater's family. It is deeply distressing for them that a loving family man in his twilight years was brutally murdered in his own home where he was entitled to feel safe.'\nDuring the trial, prosecutor Christopher Quinlan QC said the attack was designed 'to inflict pain for sadistic reasons and to extract information'.\nIn October 2014, Hall stole £557.80 from a Costa Coffee, was accused of burgling customers' homes, and secretly moved to Portsmouth without informing Mr Plater of his five-week absence.\nMr Plater's family urged him to find a replacement but the pensioner had said he wished to give Hall a 'second chance'.\nDaughter Susan Barker added: 'He was a very fair and trusting man. We feel sick he may have been made to suffer in any way.'\nHall returned to Stroud to confront his former employer at home, pictured. He said he 'snapped' after Mr Plater mentioned his previous thefts and reportedly refused to shake his hand\nSentencing Hall, Judge Neil Ford QC said: 'You have caused a great deal of suffering and loss to Mr Plater's family. It is deeply distressing for them that a loving family man in his twilight years was brutally murdered in his own home where he was entitled to feel safe'\nAfter Hall received the voicemail message from Plater, he caught a train to Stroud on November 6 and walked straight to his former employer's home.\nGiving evidence at the trial of issue, he said Mr Plater was 'surprised' to see him but invited him inside for a chat.\n'He mentioned that he had a new gardener at the end of the conversation,' Hall said.\n'He also mentioned the thefts. That's when I lost my temper. He asked me to leave. I put my hand out to shake his hand and he just pushed it away.\n'I just snapped. I picked up a knife and I stabbed him.'\nHall left the property, using Mr Plater's key to lock the front door, then threw the used knife and key into a nearby canal.\nHe caught a train back to Portsmouth and was arrested by police in Southsea, Hampshire, two days later. Officers found £107.99 in his rucksack.","url":"https://www.dailymail.co.uk/news/article-3394193/Gardener-jailed-life-stabbing-elderly-customer-40-times.html"}
