{"authors":["Tom Farmery For Mailonline"],"date_download":"2018-10-23 04:08:27","date_modify":"2018-10-23 04:08:27","date_publish":"2016-01-11 17:15:01","description":"Gareth Bale headed to the golf course rather than Switzerland as he finally admitted that he's pleased with life at Real Madrid following the sacking of Rafa Benitez.","filename":"data/vaneerConsumption/GarethBalehitsthegolfcourseastheRealMadridstaradmitsheshappyatclub.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300B2F5700000578-0-image-a-43_1452532028129.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_ballon_dor_article-3394169_Gareth-Bale-heads-golf-course-relax-busy-seven-days-included-Benitez-s-sacking-hat-trick_1540267707.html","title":"Gareth Bale hits the golf course as the Real Madrid star admits he's 'happy' at club","title_page":"Gareth Bale hits the golf course as the Real Madrid star admits he's 'happy' at club | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gareth Bale headed to the golf course rather than Switzerland as he finally admitted that he's pleased with life at Real Madrid following the sacking of Rafa Benitez.\nBale was one of the only stars at Real to speak out about Benitez's sacking. It has been reported that the Welsh winger sent Florentino Perez, the club's president, a text message begging him not to sack the Spanaird, who was in charge for just over six months.\nThe Welshman tweeted a picture of himself on the golf course on Monday as he stayed at home rather than travelling to the Ballon d'Or ceremony in Zurich on Monday night.\n'Good couple hours recovery in the gym, now just having a round with my mate,' Bale wrote.\nThe European Tour golf Twitter account soon responded, knowing Bale plays off a scratch handicap, and wrote: 'FYI, European Tour Qualifying School is in November...'\nNot only have the last seven days included the sacking of Benitez, but they've also coincided with Bale returning from the New Year break in prolific form.\nThe 26-year-old scored a stunning hat-trick in the 5-0 thrashing of Deportivo La Coruna on Saturday.\nAfterwards Bale said that although Benitez's sacking was a 'huge disappointment', he did add that he was 'enjoying my football at the moment, so I'll keep going'.\nBale also said it would be a privilege to play under the guidance of Zinedine Zidane.\n'As a player he (Zidane) was incredible,' added Bale.\n'You try and emulate people like that. He's a legend not just at the club, but for football.\n'We had a chat when he first came in, and I think no matter what I'll always give 100 per cent on a football pitch and that's what I did (against Deportivo).'\nGareth Bale (left) hugs Real Madrid defender Pepe after scoring against Deportivo La Coruna on Saturday\nBale has become a big hit with the fans at Real again after not having the best of times last season\nCristiano Ronaldo and Bale both had significant interest in Monday night's Ballon d'Or ceremony in Zurich\nBale was the only British player to be shortlisted for FIFA's FIFPro World XI at the ceremony in Zurich on Monday night, although he did not make the team.\nHe was also included in FIFA's 23-man Ballon d'Or shortlist for the third successive year.\nBale was one of 11 players from Spain's La Liga to make the list, with the Premier League and Bundesliga each contributing five.\nThe Welshman has been in incredible form recently and it seems the Real Madrid supporters are starting to appreciate his efforts too.\nAt the weekend after the win over Deportivo, Bale tweeted: 'Amazing return to the Bernabeu following the New Year #halamadrid. And a massive thank you to the Bernabeu crowd!! Unbelievable support.'","url":"https://www.dailymail.co.uk/sport/ballon_dor/article-3394169/Gareth-Bale-heads-golf-course-relax-busy-seven-days-included-Benitez-s-sacking-hat-trick.html"}
