{"authors":["Mail Online Reporter"],"date_download":"2018-10-23 02:07:46","date_modify":"2018-10-23 02:07:46","date_publish":"2017-03-10 11:02:24","description":"Earlier this week, the Pop Idol star set Twitter alight with comments about his questionable new look, with many making quips about his 'combover'.","filename":"data/vaneerConsumption/GarethGatesscombovercausesastironceagain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22723A00000578-0-image-a-26_1489146874341.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300820_Gareth-Gates-s-combover-causes-stir-again_1540260466.html","title":"Gareth Gates's 'combover' causes a stir once again","title_page":"Gareth Gates's 'combover' causes a stir once again | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When he shot to fame in 2001, one of his trademarks was his spiky locks.\nNow Gareth Gates' hair has set tongues wagging once again, but not necessarily for the best reasons.\nEarlier this week, the Pop Idol star set Twitter alight with comments about his questionable new look, with many making quips about his 'combover'.\nScroll down for video\nHair he is: Gareth Gates' hair has set tongues wagging once again, but not necessarily for the best reasons, as he appeared on Lorraine on Friday\nGareth returned to TV on Friday to discuss his new super-group, which sees him join fellow pop singers Duncan James, Ben Ofoedu, Jon Lee and Ritchie Neville team up for Boys Allowed, a drag version of Girls Aloud put together for Comic Relief.\nHowever, viewers were once again more concerned with the star's mane.\nOne tweeted: 'Wow Ben looks so young! He hasn't aged at all! but Gareth, oh please sort your syrup out love.'\nThe 32-year-old had appeared Wednesday's edition of This Morning along with fellow stammer sufferer Jennifer Vaughan, 29, to explain how the McGuire Programme helped them overcome their speech impediments.\nAt the height of his fame, Gareth was as well known for his short spiky hairstyle as he was his singing.\nNew look: Gareth returned to TV on Friday to discuss his new super-group, however, viewers were once again more concerned with the star's mane\nNo impressed: One tweeted: 'Wow Ben looks so young! He hasn't aged at all! but Gareth, oh please sort your syrup out love'\nWhat a line up: He was joined by fellow pop singers Duncan James, Ben Ofoedu, Jon Lee and Ritchie Neville team up for Boys Allowed\nNew direction: The singers will perform a drag version of Girls Aloud for Comic Relief\nChanging with the times: The star set Twitter ablaze this week as he showed off his new 'do, which was dramatically different to his trademark spikes\nHowever, his style has changed dramatically since those days in the early noughties and he now sports a sweeping combover.\nHis transformation wasn't lost on viewers, with his look receiving a mixed reaction from the audience.\nOne questioned: 'Oh dear what's happened to Gareth gates (sic) hair'\nPopular: Gareth's determination to become a pop star despite having a severe stammer endeared him to millions of Pop Idol fans in 2001\nCompliments: Viewers flocked to Twitter to praise the buff singer, with one writing: 'Just goes to show, having a stammer shouldn't stop you being a star'\nWhile another wrote: 'What does Gareth Gates look like. Cmon pal'\nAnd a third observed: 'Looks like @Gareth_Gates is losing his #hair #combover #ThisMorning'\nBut there was a lot of love too, with a fan writing: '@Gareth_Gates just gets more gorgeous with age!'\nRaising awareness: Gareth Gates appeared along with fellow stammer sufferer Jennifer Vaughan, 29, to explain how the McGuire Programme helped them overcome their speech impediments\nUnimpressed: One fan seemed upset by Gareth's new hairstyle\nNot for her: Another viewer wasn't so keen on the look\nIt happens: One suggested Gareth chose the style as his hair was thinning\nPraise: There was no shortage of pleasant comments to the star\nAs another said: 'Thankyou for this Gareth, you look and sound amazing xxxxx'\nWhile another enthused: 'you have come a long way be really proud of yourself'\n'Just goes to show, having a stammer shouldn't stop you being a star,' said another.\nJennifer was also praised, with one posting: 'Great interview on @thismorning with @Gareth_Gates and Jennifer! Well done to you both.'\nDay to day conversation: Gareth told the show's presenters Holly Willoughby and Phillip Schofield how he struggled more with his speech away from the spotlight\nGareth told the show's presenters Holly Willoughby and Phillip Schofield how he struggled more with his speech away from the spotlight.\nHe explained: 'You can’t be the person you want to be. I found it really really hard as a kid. It’s not until you meet other people you think there's hope out there.\n'If I've learnt a script and I'm in character it's fine. It's everyday chit chat that I find hard.\n'I've never struggled with performing on stage, it’s a different kind of mindset really.'\nThe McGuire Programme was founded in 1994 by severe stammer sufferer Dave McGuire. He developed a method based on breathing techniques and different psychological approaches to improve the speech of people like himself.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300820/Gareth-Gates-s-combover-causes-stir-again.html"}
