{"authors":["Rory Brigstock-Barron For Mailonline"],"date_download":"2018-10-23 03:52:44","date_modify":"2018-10-23 03:52:44","date_publish":"2016-01-28 19:32:44","description":"Gareth Bale has been gaining inspiration in his battle against injury by watching UFC star Anderson Silva's greatest hits. The Brazilian fights Michael Bisping in London on February 27.","filename":"data/vaneerConsumption/GarethBalewatchesAndersonSilvasgreatesthitsasinjuredRealMadridstarlooksforwardtoUFCLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACFF0E00000578-0-image-a-13_1454009235610.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_ufc_article-3421518_Gareth-Bale-watches-Anderson-Silva-s-greatest-hits-injured-Real-Madrid-star-looks-forward-UFC-London_1540266764.html","title":"Gareth Bale watches Anderson Silva's greatest hits as injured Real Madrid star looks forward to UFC London","title_page":"Gareth Bale watches Anderson Silva's greatest hits as injured Real Madrid star looks forward to UFC London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gareth Bale has been gaining inspiration in his battle against injury by watching UFC star Anderson Silva's greatest hits.\nThe Real Madrid forward, who is currently sidelined with a calf injury, posted a picture of himself watching 'The Spider' with a friend and said he would be watching UFC London next month.\nAnd despite British fighter Michael Bisping taking on the Brazilian at the O2 Arena the Welsh winger has made his allegiances clear ahead of the clash.\nGareth Bale posted a picture of himself watching old Anderson Silva UFC fights with a friend\nThe Real Madrid forward is currently out injured after damaging the soleus muscle in his right leg\nBale is expected to return in about three weeks time and has been stepping up his recovery\n'Now time for a chilled evening watching @ufcfightpass!! Looking forward to watching @spiderandersonsilva at #UFCLondon,' Bale wrote.\nBale was watching one of Silva's most famous UFC knockouts when he went up to light-heavyweight to bamoozle former champion Forrest Griffin.\nThe Welshman, who is expected to make his Real return in around three weeks, is unlikely to attend Silva's fight in London as it falls on the same day as the Madrid derby against Atletico at the Bernabeu on February 27.\nBut the Los Blancos forward will be watching and may be cheering for Silva who makes his return from suspension after testing positive for banned substances a year ago.\nBale was wathcing Silva's 2009 demolition of former light-heavyweight champion Forrest Griffin\nManchester's own Michael Bisping will fight Silva on Ferbuary 27 in arguably the biggest fight of his career\nFellow La Liga star Neymar is also a UFC fan having posted this picture before Jose Aldo's last fight\nAnother La Liga star who will likely be watching Silva is Barcelona's Neymar who posted a picture with his friends on Instagram having woken up to watch fellow Brazilian Jose Aldo's 13 second defeat by Conor McGregor in December.\nNeymar will be hoping for a better result this time around when another Brazlian UFC legend takes on European opposition.\nWhile Manchester's Bisping might not have Bale's support he will certainly have the crowd behind him as he entesr the UFC Octagon for the 24th time, in what could be his last chance to earn that illusive UFC title shot.\nThe fight will undoubtedly be the biggest to have ever been aired on the UFC's streaming service Fight Pass.","url":"https://www.dailymail.co.uk/sport/ufc/article-3421518/Gareth-Bale-watches-Anderson-Silva-s-greatest-hits-injured-Real-Madrid-star-looks-forward-UFC-London.html"}
