{"authors":["Frances Martel"],"date_download":"2018-10-30 19:58:08","date_modify":"2018-10-30 19:58:08","date_publish":"2015-05-04 15:28:50","description":"A tight-lipped Garland, Texas Police Spokesman Joe Harn refused to name either of the two men responsible for an attempted shooting at the Curtis Culwell Center on Sunday, where the Mohammed Art Exhibit and Contest was being held. Harn explained that the two men were shot almost immediately upon opening fire on police, and that no bombs were found in the men's vehicle. |","filename":"data/vaneerConsumption/GarlandPoliceRefusetoIdentifySuspectsinDrawMuhammadShooting.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo185-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_04__1540929488.html","title":"Garland Police Refuse to Identify Suspects in Draw Muhammad Shooting","title_page":"Garland Police Refuse to Identify Suspects in Draw Muhammad Shooting | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A tight-lipped Garland, Texas Police Spokesman Joe Harn refused to name either of the two men responsible for an attempted shooting at the Curtis Culwell Center on Sunday, where the Mohammed Art Exhibit and Contest was being held. Harn explained that the two men were shot almost immediately upon opening fire on police, and that no bombs were found in the men’s vehicle.\nHarn began the press conference by detailing the incident as the police experienced it. Two men drove up to the Culwell center armed with assault rifles in a “dark-colored vehicle” and began immediately shooting at the police vehicle parked outside. Police “began returning fire and struck both men,” Harn added, and “responded within seconds and helped secure the scene.” Both men died outside and did not come close to entering the location.\nHarn confirmed that there are only two suspects so far. “There was a man that we detained that we thought might have been a suspect in this event but, upon being interviewed, we determined he was not a suspect,” he added.\nPolice then began to search the vehicle and the bodies of the attackers for bombs, but did not find bombs in the vehicle. They did find that the gunmen were wearing protective body gear.\nHarn only defined the intent of the shooters as being “to shoot people,” and refused to release names. “Do we think we know who they are? Yes,” he added, though refusing to confirm that social media chatter that has been tied to one of the shooters was definitively linked to the attack. A Twitter account titled “Sharia is Light” tweeted about a “Texas Attack” minutes before the shooting, though no official link has been made between the shooters and the tweet. “We don’t know that it was those people who put that out,” Harn noted. He also refused to confirm whether the shooters were US citizens.\nHarn refused to call the event a “terrorist attack,” though he noted that police “are certainly looking into that.”\nHarn noted that police had been monitoring a potential attack on the Draw Muhammad contest for “months,” finding some “chatter” online but little else, and that event organizers spent an extra $10,000 on security.\nWhile Harn gave no information on the identity of the shooters, the FBI has confirmed the name of one suspect, Elton Simpson, whose Phoenix, Arizona apartment is currently being searched, the Associated Press reports. Simpson was convicted of lying to the FBI in 2010, claiming he had not discussed traveling to Somalia to wage jihad despite the FBI possessing recorded conversations that disproved this.","url":"https://www.breitbart.com/national-security/2015/05/04/garland-police-refuse-to-identify-suspects-in-draw-muhammad-shooting/"}
