{"authors":["Ronnie Esplin","Press Association"],"date_download":"2018-10-23 02:21:36","date_modify":"2018-10-23 02:21:36","date_publish":"2016-01-29 16:47:40","description":"Gary Mackay-Steven is looking to play a full part in a Scottish League Cup final for Celtic after last year's Hampden win over former club Dundee United left him feeling 'awkward' and 'weird.'","filename":"data/vaneerConsumption/GaryMackayStevenhopingthatexperienceofsemifinalglorywithDundeeUnitedwillhelphimguideCeltictoLeagueCupglory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B2D26500000578-0-image-a-3_1454084426463.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423083_Gary-Mackay-Steven-hoping-experience-semi-final-glory-Dundee-United-help-guide-Celtic-League-Cup-glory_1540261296.html","title":"Gary Mackay-Steven hoping that experience of semi-final glory with Dundee United will help him guide Celtic to League Cup glory","title_page":"Gary Mackay-Steven hoping that experience of semi-final glory with Dundee United will help him guide Celtic to League Cup glory | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gary Mackay-Steven is looking to play a full and proper part in a Scottish League Cup final for Celtic after last year's Hampden win over former club Dundee United left him feeling 'awkward' and 'weird.'\nThe 25-year-old winger signed, along with fellow midfielder Stuart Armstrong, from Tannadice on January transfer deadline day a year ago, two days after helping United beat Aberdeen in the semi-final.\nBoth players had to sit in the stands at the national stadium as they were cup-tied when Celtic beat United 2-0 to take the trophy back to Parkhead.\nCeltic's Gary Mackay-Steven is dreaming of chance to play for his first Scottish League Cup crown\nAhead of Sunday's semi-final against Ross County at Hampden, the Scotland international, who spent four years with United, recalled a 'strange experience.'\nHe said: 'Having got to the final with Dundee United and then making the transfer to Celtic and then obviously the two clubs playing each other, it was a bit strange.\n'I wasn't sure who I really wanted to win that game if I am being honest.\n'Obviously I was a Celtic player and you want to celebrate with your new team .\n'But having gone through the whole competition with Dundee United and winning a trophy for Dundee United is a big thing, so I was a little bit....\n'Although I was happy celebrating, I was in the dressing room and it was great but you are a little bit sad for your team-mates.\nThe winger has been with Celtic for just over a year but has made a strong impact since he joined Paradise\nCeltic have enjoyed a fairly routine route to the semi-finals beating Raith Rovers 2-0 and Hearts 2-1\nMackay-Steven didn't play against Hearts but did score two goals in the 3-1 win against St Johnstone last week\n'I would have rather not been there, probably.\n'I was on the pitch but I wasn't really celebrating as such, I was happy for the boys but you are just standing there awkward and the cameras were quite often on you.\n'It was just weird. There were mixed emotions certainly.\nCELTIC'S JOURNEY TO SCOTTISH LEAGUE CUP SEMI-FINAL Third round: 2-0 Raith Rovers (H) Quarter-final: 2-1 Hearts (A) Opponents if they reach the final: Hibernian or St Johnstone\n'I want to be properly involved. Hopefully now I can play my part and definitely hope we win at Celtic.'\nMackay-Steven, back in boss Ronny Deila's plans after a spell on the fringes - he got his first two goals of the season in the 3-1 win over St Johnstone - is now well aware of the difference in expectations between United and Celtic.\nHe said: 'The pressure on Celtic is on every game, not just the semi-final of a cup.\n'You are expected to win every game, you are expected to win with flair and creating a lot of chances so there is definitely added pressure but we don't think too much about that.'","url":"https://www.dailymail.co.uk/sport/football/article-3423083/Gary-Mackay-Steven-hoping-experience-semi-final-glory-Dundee-United-help-guide-Celtic-League-Cup-glory.html"}
