{"authors":["Iain Rogers"],"date_download":"2018-10-22 21:41:30","date_modify":"2018-10-22 21:41:30","date_publish":"2016-01-11 01:17:45","description":"Valencia coach Gary Neville has asked the fans for patience after watching his side stumble to a 2-0 reverse at Real Sociedad in La Liga on Sunday that left him still winless in Spain's top flight.","filename":"data/vaneerConsumption/GaryNevilledisappointedafterValenciaplaybelowexpectationsbutnewbossasksfanstostickbyhimfollowingdefeat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/2FFFEC0300000578-0-image-a-72_1452475008354.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393207_Gary-Neville-disappointed-Valencia-play-expectations-new-boss-asks-fans-stick-following-defeat_1540244490.html","title":"Gary Neville 'disappointed' after Valencia 'play below expectations' but new boss asks fans to stick by him following defeat","title_page":"Gary Neville 'disappointed' after Valencia 'play below expectations' but new boss asks fans to stick by him following defeat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Valencia coach Gary Neville has asked the fans for patience after watching his side stumble to a 2-0 reverse at Real Sociedad in La Liga on Sunday that left him still winless in Spain's top flight.\nAppointed last month to replace the sacked Nuno Espirito Santo, Neville has presided over three draws and two defeats in La Liga, as well as seeing Valencia eliminated from the Champions League thanks to a 2-0 loss to Olympique Lyonnais.\nThey are mired in mid table in La Liga at the halfway stage of the campaign, well short of the European qualification places that the ambitious Singapore-owned club expect to be challenging for.\nGary Neville looks on as his team were beaten by Real Sociedad, and he has still not won in the league\nValencia were deservedly beaten, and have picked up just three points since Neville took over as manager\nNeville told a news conference he wanted the Valencia supporters to understand what the team was trying to do and continue supporting the players while admitting they had squandered possession to the Basque club far too often.\nA late Jonathas double secured victory for Sociedad with Valencia's best moment coming in the first half when a Rodrigo Moreno effort hit the crossbar.\n'Everyone in the dressing room is disappointed, myself more than anyone, but tomorrow everything starts again,' the former Manchester United and England defender said.\n'I can't sit here without saying it's not a blow,' he added.\n'We lost against Villarreal (last month) but I was happy with our second-half performance.\n'Today I can't say that. We played below expectations and we have to start winning regularly.'\nThe former Manchester United boss admitted that he was 'disappointed' and the defeat was 'a blow'\nBut Neville asked for patience from Valencia's fans, and played down the chances of making signings\nNeville reiterated that bringing in reinforcements in the January transfer window was not necessarily the answer.\n'I want to play with these players so they can improve together,' he told reporters.\n'It's not that the club doesn't want to spend money. There have been some important signings and my job is to get the players to perform.\n'I believe I have some excellent players and I assume responsibility for the defeat.'\nValencia play the first leg of their Europa League last 32 tie against Rapid Vienna next month and are well placed to reach the quarter-finals of the King's Cup.","url":"https://www.dailymail.co.uk/sport/football/article-3393207/Gary-Neville-disappointed-Valencia-play-expectations-new-boss-asks-fans-stick-following-defeat.html"}
