{"authors":["Pete Jenson For Mailonline"],"date_download":"2018-10-23 02:08:41","date_modify":"2018-10-23 02:08:41","date_publish":"2016-01-11 13:49:34","description":"PETE JENSON: Gary Neville will be the first to remind us that you CAN win something with kids.  But with his young Valencia team he has now gone five La Liga games without a win.","filename":"data/vaneerConsumption/GaryNevilleunderincreasingpressureasValenciaedgeclosertorelegationplaces.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A9F4300000578-0-image-a-41_1452519437808.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393922_Gary-Neville-increasing-pressure-Valencia-edge-closer-relegation-places-turn-kids_1540260521.html","title":"Gary Neville under increasing pressure as Valencia edge closer to relegation places","title_page":"Gary Neville under increasing pressure as Valencia edge closer to relegation places | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gary Neville will be the first to remind us that you CAN win something with kids.\nBut with his young Valencia team he has now gone five league games without a win and supporters are starting to question why there seems to be no intention of bringing in some much needed experience in the January transfer window.\nIt was a sad day for them on Sunday because the club finally lost its status as ‘Spain’s third club’ in the historic La Liga table that tots up the points tallies of every club since the beginning of the competition.\nGary Neville is under pressure after a poor start to his managerial career with Spanish giants Valencia\nNeville looks on as his team were beaten by Real Sociedad - he has still not won in the league\nValencia started this season in third - 20 points ahead of Atletico Madrid - but at the weekend their defeat by Real Sociedad and Diego Simeone’s side winning meant they dropped to fourth in the all-time points ranking.\nOf more pressing urgency is the fact that they are now closer to the relegation places than the Champions League.\nNeville is not being blamed for it at the moment. The supporters are disillusioned with an absent owner and a president who they consider not to be a football person and the absence of a sporting director.\nNeville has cheered the supporters up with a dynamic positive approach. They have warmed to his enthusiasm but the results have not yet arrived to back up the positive vibes.\nHe set the bar high when he took over citing top four, the Europa League and the Copa del Rey as the aim.\nHe also told the Valencia supporters they had every right to be demanding because their club was a big one.\nValencia striker Alvaro Negredo cuts a frustrated figure during the 2-0 defeat by Sociedad\nSociedad striker Jonatahas Cristian (centre) celebrates scoring Sociedad's first goal of the game\nGARY NEVILLE'S VALENCIA STATS Played: 8 Won: 2 Drawn: 3 Lost: 3\nBut after five league games in charge he will not need to be told that no wins in those five matches is not good enough.\nIt has not all been doom and gloom. Fate saw fit to make him the opposing manager who ended Rafa Benitez' reign at Real Madrid and that 2-2 draw was a performance that promised much.\nBut when, in the next league meeting, he was pitted against Sociedad and the big summer signing that David Moyes banked his San Sebastian future on, Jonathas, the forward scored twice and it was back to the drawing board.\nJonathas’ form arrived too late to save Moyes but bang on time to punish Neville. It was his second league defeat since taking over – that and three draws leave him with three points from 15.\nThe Manchester United legend insisted he is content with his current squad\nNeville has asked for patience from Valencia's fans and played down the chances of making signings\nVALENCIA'S NEXT FIVE FIXTURES Granada (A) January 14 Rayo Vallecano (H) January 17 Deportivo (A) January 23 Sporting Gijon (H) January 31 Real Betis (A) February 7\nThe fixtures have not been easy. Away to Villarreal, home to Real Madrid and away to Eibar, who are in European places having been the revelation team of the season, were all very tough games.\nBut Getafe at home and Sociedad away were gentler fixtures and Neville would have expected a better return.\nReturn is what he needs certain key squad members to do as quickly as possible. The quicker Brazilian goalkeeper Diego Alves is fit to start games the better but after a serious knee injury he still looks around three weeks away.\nAlgerian winger Sofiane Feghouli is another who can’t come back soon enough. He could feature before the end of the month. But other sides have injuries – Real Sociedad were without their top scorer Imanol Agirretxe at the weekend but still beat Valencia – so the excuse only goes so far; and in fairness to Neville it is not one he is leaning on.\nFormer Valencia defender Nicolas Otamendi is still being sorely missed in the centre of defence\nValencia forward Paco Alcacer helps make up one of the youngest squads in La Liga\nNeither is he talking about reinforcements – something that the Valencia supporters cannot understand. He has made it clear that he has come to work with the players who are already at the club. He despises the culture of – ‘this lot are no good, so we will buy some more’. Supporters and local press are a little bemused, however, at the club’s stance.\nOther teams will add reinforcements so why aren’t Valencia? Atletico Madrid have brought in quality midfielders Augusto Fernandez and Matias Kranevitter and they are top of the league. Valencia’s need is greater.\nThe squad is fragile. Key defenders Shkodran Mustafi and Jose Gaya have been unable to stay fit and Enzo Perez started his first league game for Neville in the league at the weekend only to fail to finish it with more injury problems.\nNegredo scored a hat-trick in the 4-0 Copa del Rey victory against Granada - Neville's second win as manager\nThe Valencia supporters remain on Neville's side despite a poor run of results in recent weeks\nThis is a squad that is fighting on three fronts, or at least will be when the Europa League returns. It lacks leadership and experience. Nicolas Otamendi is still being sorely missed in the centre of defence. And when Neville looks around at the rest of his players there is no-one making themselves heard or standing up to lead.\nThis is one of the youngest squads in La Liga. The front four starting on Sunday – Santi Mina, Rodrigo, Paco Alcacer and Rodrigo De Paul – are 20, 24, 22 and 21 respectively, the captain Dani Parejo is only 26, and there was no one over 30 in the team.","url":"https://www.dailymail.co.uk/sport/football/article-3393922/Gary-Neville-increasing-pressure-Valencia-edge-closer-relegation-places-turn-kids.html"}
