{"authors":["Associated Press"],"date_download":"2018-10-22 20:15:16","date_modify":"2018-10-22 20:15:16","date_publish":"2016-01-29 00:57:30","description":"LOS ANGELES (AP) — The utility that owns a natural gas well that has leaked uncontrollably in California for three months knew a devastating blowout was poss...","filename":"data/vaneerConsumption/Gasblowouthappenedinoldwellregulatedbyoldrules.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:38a402459c514f7daf930a3abb7911fc-4PuZeKVXE7cd9005b2c8762fbfb4-289_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421782_Gas-blowout-happened-old-regulated-old-rules_1540239316.html","title":"Gas blowout happened in old well regulated by old rules","title_page":"Gas blowout happened in old well regulated by old rules | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gas blowout happened in old well regulated by old rules\nLOS ANGELES (AP) — The utility that owns a natural gas well that has leaked uncontrollably in California for three months knew a devastating blowout was possible because of its age, design and the way it was being operated, according to state records and testimony.\nAnd state regulators were aware of the situation at the largest gas storage field in the West, but they said they were limited in their ability to stop it.\n\"There are no rules that prevent it or no law that prevents you from doing what they were doing,\" said Annaliese Anderle, a former inspector and supervisor at the state Division of Oil, Gas and Geothermal Resources, which regulates the field.\nThis Dec. 17, 2016 photo provided by Earthworks shows an overhead aerial view of the relief well at the Aliso Canyon facility above the Porter Ranch area of Los Angeles. The utility that owns a natural gas well that has leaked uncontrollably for three months knew a devastating blowout was possible because of its age, design and the way it was being operated, according to state records and testimony. And state regulators were aware of the situation at the largest gas storage field in the West but said they were limited in their ability to stop it. (Pete Dronkers/Earthworks via AP)\nThe blowout near Los Angeles has spewed more than 2 million tons of climate-changing methane and forced thousands of residents to flee their homes amid a sickening stench. Gov. Jerry Brown has declared an emergency and some environmentalists have called it the worst U.S. disaster since the BP oil spill in the Gulf of Mexico.\nSouthern California Gas Co. has apologized for the ongoing leak and defended its safety practices, though public records and testimony from executives show repeated gas leaks and corrosion in wells it operates that average more than a half-century old.\nThe wells in the Aliso Canyon facility near Porter Ranch were being taxed near capacity in the months and days before the blowout — even as the utility sought permission to increase the rate at which gas is pumped into a vacant oil field a mile-and-a-half beneath the Santa Susana Mountains.\nThe blown out well, Sesnon Standard-25, was drilled in 1953 to pump crude oil and found a second career when the field was converted in the 1970s to store gas when prices and demand were low and provide it to heat homes during cold months or fire gas-fueled electric plants when usage soared.\nIn addition to its age, several factors put the well in jeopardy of a blowout, said Anthony Ingraffea, a Cornell University engineering professor who worked in the oil and gas industry 25 years and studied the well's records.\nThe well was built with two outer steel casings that surround and protect an inner steel pipe, or tubing, just under 3 inches in diameter, designed to carry gas in and out of the storage reservoir. However, SoCalGas was pushing gas through the 7-inch casing surrounding that pipe, enabling it to move large volumes.\nThe practice was risky because the casing was under pressures as high as 2,600 pounds per square inch with no secondary protection for more than a mile of its length, Ingraffea said. The metal was exposed to corrosive elements that could get between it and the rocky formation outside.\nA casing failure allowed the gas to escape from the well and a safety valve that might have been able to stop it was gone, Ingraffea said. The valve was removed in 1979 and was not required to be replaced.\nAnderle, who is now consulting for a law firm suing the gas company, and Ingraffea said the leak would probably not have happened if the entire casing was protected by cement.\nThe gas company, which is paying to relocate nearly 8,000 households and facing dozens of lawsuits, refused to answer questions about the blown-out well until it is plugged, which could take another month, and its cause investigated.\nA spokeswoman said it plans to shut down 18 similar wells in the field for aggressive inspection.\nWhile some states now require casings to be fully lined with cement, no such regulations are in place in California. And there's no rule preventing the company from pressurizing both the casing and tubing to deliver gas, said Don Drysdale of the Division of Oil, Gas and Geothermal Resources.\nThe practice is common throughout the state, the division was aware of it and could not have shut down the well under current regulations, Drysdale said.\n\"I didn't think I could be surprised anymore,\" said Bill Powers, a San Diego-based natural-gas analyst and investor. He said the practice of pumping gas at high pressure through the casing removed all \"firewalls of safety.\"\nIn 2014, the utility's operation director noted corrosion and decades of use causing an increasing number of casing leaks and other major mechanical failures among SoCalGas' 229 storage wells.\nMajor repairs for leaks and failed valves climbed from three in 2008 to nine in 2013, the utility executive, Phillip Baker, told regulators.\n\"The possibility of a well-related incident still exists, given the age of the wells and their heavy utilization,\" Baker warned California's Public Utility Commission, in written testimony.\nAt the time, the utility was asking regulators for rate increases to pay for stepped-up repairs at Aliso Canyon and its three smaller fields. The roughly $30 million a year rate-hike request is still pending before the PUC.\nDespite the utility's own safety concerns, SoCalGas got state permission for upgrades nearing completion that will allow them to inject gas at higher pressures to increase the rate it can fill Aliso Canyon by half.\nIn October, the time of the blowout, the utility had pumped Aliso Canyon to 93 percent of capacity, the utility said. State records show 2014 was a near-record year for injections, filling 71 billion of Aliso Canyon's 86 billion cubic feet capacity.\nFormer PUC President Loretta Lynch said state regulators should have kept a tighter rein on storage amounts. The utility commission allowed SoCalGas operators \"to run the hell out of those pipes, and found in the process it had endangered thousands of people.\"\nThe PUC is now studying the possibility of how it will ensure a reliable gas supply if Aliso Canyon is shut down.\nThe oil and gas division has proposed emergency regulations for underground gas storage that would require a risk management plan and corrosion assessment of uncemented casings. Drysdale said the plan should identify if pressurizing casings and tubing is hazardous, though the language doesn't specify that.\nIngraffea said the proposed regulations fall far too short because they don't address the operation of wells where only a single barrier, such as a pressurized casing, stands between a smooth operation and a blowout.\n\"If there are any wells in any field in California where you have gas pressure one metal thickness away from a blowout, that is unacceptable,\" Ingraffea said.\nThis Dec. 17, 2016 photo provided by Earthworks shows an overhead aerial view of the relief well at the Aliso Canyon facility above the Porter Ranch area of Los Angeles. The utility that owns a natural gas well that has leaked uncontrollably for three months knew a devastating blowout was possible because of its age, design and the way it was being operated, according to state records and testimony. And state regulators were aware of the situation at the largest gas storage field in the West but said they were limited in their ability to stop it. (Pete Dronkers/Earthworks via AP)\nThis Dec. 17, 2016 photo provided by Earthworks shows an overhead aerial view of the relief well at the Aliso Canyon facility above the Porter Ranch area of Los Angeles. The utility that owns a natural gas well that has leaked uncontrollably for three months knew a devastating blowout was possible because of its age, design and the way it was being operated, according to state records and testimony. And state regulators were aware of the situation at the largest gas storage field in the West but said they were limited in their ability to stop it. (Pete Dronkers/Earthworks via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3421782/Gas-blowout-happened-old-regulated-old-rules.html"}
