{"authors":[],"date_download":"2018-10-30 18:24:25","date_modify":"2018-10-30 18:24:25","date_publish":"2017-02-27 19:25:00","description":"A sales tax increase for DeKalb County passed the Georgia Senate on Monday, one of several pending tax proposals.","filename":"data/vaneerConsumption/GaSenatepassesDeKalbsalestaxbill.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/27/Images/012716%20leg%20dye%20job%20ba04.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_s_c3eeccfbf093732df261653e97e07698__1540923865.html","title":"Ga. Senate passes DeKalb sales tax bill","title_page":"Georgia Senate approves DeKalb County sales tax bill","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia Senate passed a bill Monday that would allow DeKalb County voters to decide on a sales tax hike for transportation and public safety construction, but prohibit additional funding for MARTA.\nThe Senate voted 36-18 to approve Senate Bill 156, which now moves to the state House of Representatives for further consideration.\nA DeKalb sales tax increase, from 7 percent to 8 percent, would primarily pay for repairs to dilapidated roads. The special purpose local option sales tax (SPLOST) could also be used to repair and rebuild broken-down police and fire stations.\nThe legislation caps sales taxes for MARTA expansion at their current level of 1 percent. A separate pending measure, Senate Bill 251, calls for an additional 0.5 percent sales tax for MARTA expansion in DeKalb.\nSen. Fran Millar, R-Atlanta, said the county has a “great need” for infrastructure improvements in several areas, but he resisted an extra MARTA tax.\nSen. Emanuel Jones, D-Decatur, said the legislation would “tie the hands of DeKalb” unlike any other county. Most SPLOSTs can also fund parks, libraries, water lines and other infrastructure.\nHe said the measure is unfair, especially since DeKalb’s six Democratic senators oppose the bill that’s being sought by Millar, the county’s only Republican senator.\nThe legislation exempts food and prescription medications from the new sales tax.\nSeveral other DeKalb tax measures are pending in the Georgia General Assembly, but Senate Bill 156 was the first to pass either the Senate or House.","url":"https://www.ajc.com/news/local-govt--politics/senate-passes-dekalb-sales-tax-bill/o06RjnVeINnUPjPH2MgwmN/"}
