{"authors":["Seth Millstein"],"date_download":"2018-10-31 01:48:30","date_modify":"2018-10-31 01:48:30","date_publish":"2018-09-14 02:06:41","description":"On Thursday evening, there were over 70 gas explosions and fires across three Massachusetts towns, NPR reports, causing thousands of residents to evacuate. Although the exact cause of the incidents is unclear, authorities suspect it may be a gas…","filename":"data/vaneerConsumption/GasExplosionsInMassachusettsSetHomesOnFireForcedEvacuationsIn3Towns.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/a0c1697e-8bb8-49e8-a834-06f83518d91b-screen-shot-2018-09-13-at-70354-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_gas-explosions-in-massachusetts-set-homes-on-fire-forced-evacuations-in-3-towns-11916198_1540950510.html","title":"Gas Explosions In Massachusetts Set Homes On Fire & Forced Evacuations In 3 Towns","title_page":"Gas Explosions In Massachusetts Set Homes On Fire & Forced Evacuations In 3 Towns","title_rss":"NULL","source_domain":"bustle.com","text":"On Thursday evening, there were over 70 gas explosions and fires across three Massachusetts towns, NPR reports, causing thousands of residents to evacuate. Although the exact cause of the incidents is unclear, authorities suspect it may be a gas leak; in the wake of the explosions and fires, Columbia Gas shut off its service to the three affected towns: Lawrence, Andover and North Andover.\n\"Residents in the affected towns of Lawrence/North Andover/Andover who have gas service from Columbia Gas should evacuate their homes immediately if they have not already done so,\" Massachusetts State Police tweeted Thursday. \"Gas lines are currently being depressurized by the company it will take some time.\"\nAccording to NPR, at least ten people who were injured in the explosions are being treated at Lawrence General Hospital. Several people were injured in Andover as well, according to a statement from that town's police department.\nIn Andover, a total of 35 fires broke out Thursday, police said, with 18 fires burning simultaneously at one point. They have all since been extinguished. According to WPVI, no fewer than 39 homes in Lawrence erupted in flames; extinguishing these fires required the entire Andover Fire-Rescue department and all of its fire trucks, the Eagle-Tribune reports; Andover fire chief Michael Mansfield requested, and received, 20 additional fire engines and 10 ambulances from the Massachusetts Emergency Management Agency to fight the blazes.\nOfficials are urging those near the affected areas to play it safe and evacuate their homes. Lawrence Mayor Daniel Rivera said that residents of Lawrence who live south of the Merrimack River need to \"get out your house and go north of the river,\" WCVB reports.\n\"If you are out of your house, stay away from your house until we have made it safe for everyone,\" he added. Several shelters in the city have been opened for evacuees, and the city is providing transportation to them at several locations across town.\nSimilarly, North Andover's town manager advised all residents with natural gas to leave their homes. He later added that 1,850 homes in the city are without power, presumably due to Columbia Gas having shut off power in the region.\nMassachusetts Gov. Charlie Baker addressed the incidents on Twitter, urging state residents to stay tuned to local officials for safety announcements.\n“Governor Baker is actively monitoring the situations in the Merrimack Valley and is communicating with first responders and public safety officials,\" the governor's office tweeted. \"The administration urges residents to heed instructions from local officials for important public safety announcements, including evacuations and suspending gas usage.” He has been actively retweeting announcements from local and state officials.\nColumbia Gas addressed the incidents in a statement, saying that the company's \"first priority for our crews at the scene is to ensure the safety of our customers and the community by supporting first responders and completing safety checks on our system and in the surrounding area.\" In Andover police said that, in addition to Columbia Gas cutting gas, National Grid is shutting off electricity in the affected areas in an attempt to limit spark-initiated fires.\nAs a precautionary measure, school has been cancelled Friday in Lawrence, Andover and North Andover.","url":"https://www.bustle.com/p/gas-explosions-in-massachusetts-set-homes-on-fire-forced-evacuations-in-3-towns-11916198"}
