{"authors":["Associated Press"],"date_download":"2018-10-23 00:00:02","date_modify":"2018-10-23 00:00:02","date_publish":"2017-03-10 05:19:10","description":"CALGARY, Alberta (AP) - After a miserable start to the season, Johnny Gaudreau and Brian Elliott are rolling right now for the resurgent Calgary...","filename":"data/vaneerConsumption/GaudreaupowersFlamespastCanadiensfor8thstraightwin.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/07/wire-194489-1489129453-520_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300016_Gaudreau-powers-Flames-past-Canadiens-8th-straight-win_1540252802.html","title":"Gaudreau powers Flames past Canadiens for 8th straight win","title_page":"Gaudreau powers Flames past Canadiens for 8th straight win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CALGARY, Alberta (AP) - After a miserable start to the season, Johnny Gaudreau and Brian Elliott are rolling right now for the resurgent Calgary Flames.\nGaudreau had a goal and three assists, and the Flames beat the Montreal Canadiens 5-0 on Thursday night for their eighth consecutive victory.\nElliott had 24 saves for his first shutout of the season. After assisting on all three second-period goals as the Flames blew open a 1-0 game, Gaudreau added his 14th goal at 16:12 of the third period.\nCalgary Flames goalie Brian Elliott gets his stick on the puck during first-period NHL hockey game action against the Montreal Canadians in Calgary, Alberta, Thursday, March 9, 2017. (Jeff McIntosh/The Canadian Press via AP)\nCoach Glen Gulutzan was proud of Calgary's methodical play in the final period, preserving Elliott's first shutout with the Flames.\n\"No one says it on the bench, no one says the word. But everybody knew what we were playing for,\" Gulutzan said. \"I don't think we turned the puck over in the third. We just wanted to make sure that we were playing the right way the whole way. That was a complete game.\"\nElliott, playing his finest hockey of the season, improved to 11-1-1 in his last 13 starts. He has a .931 save percentage over that span. He is 19-13-3 on the season.\n\"It's just fun to be on this ride right now with the guys,\" Elliott said. \"Personally, you want to stay playing well and feeling good seeing the puck. When the guys are playing like they are in front of you, you just stop a couple and they do the rest.\"\nGaudreau has 13 points (three goals, 10 assists) during the Flames' win streak. It's the longest streak for Calgary since it also won eight in a row in November 2005.\nGaudreau is benefiting from the play of Micheal Ferland, who joined his line with Sean Monahan in the first game of the streak. Ferland scored in the second period against Montreal, running his total to six goals since the trio was put together.\n\"He's been a great fit for us,\" Gaudreau said. \"We have to just keep building some chemistry and go from there.\"\nMonahan had a goal and an assist, giving him nine points over the same stretch.\n\"We're playing well right now. We're playing as a group,\" Monahan said. \"When you come to the rink every day and it's fun like this, it makes you want to keep building on it. \"\nMark Giordano and Michael Stone also scored for Calgary (37-26-4), which visits Winnipeg on Saturday.\nStone (upper body) and Dougie Hamilton (lower body) both left the game. Gulutzan said both players would be re-evaluated in the morning.\nMontreal (38-22-8) had won six in a row. The Canadiens were without goaltender Carey Price (flu), who was supposed to start for the 10th time in the last 11 games but instead served as the backup to Al Montoya - although he didn't appear on the bench.\n\"We looked like a tired team tonight for some reason,\" Canadiens coach Claude Julien said. \"Our skating legs weren't there across the board and it showed. When you don't have the energy, when your skating game's not there, the rest of your game suffers.\"\nMontoya had 33 stops.\n\"They play well in their building and they've been rolling,\" Montoya said. \"The second period did us in, the three goals, so it's a tough one to swallow.\"\nNOTES: Calgary's franchise record win streak is 10 in a row from Oct. 14 to Nov. 3, 1978, while the team was in Atlanta. ... Julien coached his 1,007th game, tying him with Jacques Demers for 25th on the NHL's career list.\nUP NEXT\nCanadiens: Visit Edmonton on Sunday night.\nFlames: Visit Winnipeg on Saturday night.\nMontreal Canadiens' Brendan Gallagher, right, tries to get the puck past Calgary Flames goalie Brian Elliott during second-period NHL hockey game action in Calgary, Alberta, Thursday, March 9, 2017. (Jeff McIntosh/The Canadian Press via AP)\nMontreal Canadiens' Brendan Gallagher, left, tries to get past Calgary Flames' Michael Frolik, of the Czech Republic, during second-period NHL hockey game action in Calgary, Alberta, Thursday, March 9, 2017. (Jeff McIntosh/The Canadian Press via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4300016/Gaudreau-powers-Flames-past-Canadiens-8th-straight-win.html"}
