{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:08:13","date_modify":"2018-10-30 18:08:13","date_publish":"2016-11-15 21:48:25","description":"California gubernatorial candidate Gavin Newsom leads the 2018 race for California governor -- with 2 Republicans in 2nd and 3rd.","filename":"data/vaneerConsumption/GavinNewsomLeads2Republicansin2018GovernorsRace.json","image_url":"https://media.breitbart.com/media/2016/07/Gavin-Newsom-Associated-Press-e1484178367828.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_11_15__1540922893.html","title":"Gavin Newsom Leads 2 Republicans in 2018 Governor's Race","title_page":"Poll: Gavin Newsom Leads 2 Republicans in 2018 Governor's Race","title_rss":"NULL","source_domain":"breitbart.com","text":"A newly-released Field Poll shows California gubernatorial candidate Gavin Newsom leading the 2018 race for California governor with 23 percent support from likely voters in his bid to replace retiring Gov. Jerry Brown.\nThe poll also notes that Republican mayors Kevin Faulconer (San Diego) and Ashley Swearengin (Fresno) polled second and third behind Newsom. With 16 percent and 11 percent, respectively, they are ahead of former Los Angeles Mayor Antonio Villaraigosa, a Democrat who finally entered the race last week. Villaraigosa received the support of just 6 percent of the voters who took the online survey.\nNo sample error was reported.\nCurrent Los Angeles Mayor Eric Garcetti has 7 percent, although he has yet to announce whether or not he will run.\nNewsom, who was previously the Mayor of San Francisco and is the current Lieutenant Governor, has solid name recognition, which has made him an early favorite among a growing pool of candidates. He announced his candidacy in February of last year and was the first of four fellow Democrats to enter the race.\nAn early Field Poll released in October of 2015 showed Newsom and Villaraigosa neck-and-neck in terms of voter support, with the former LA mayor just one point ahead of Newsom. With the election a full two years away, it is likely those figures will change again.\nThe newly-released Field Poll further notes that fellow Democrat and state Treasurer John Chiang received just two 2 percent support. He trails behind billionaire left-wing environmentalist Tom Steyer (5 percent) and Secretary of State Alex Padilla (4 percent). Steyer and Padilla have not yet entered the race but are rumored to be considering a run.\nFormer State Schools Superintendent Delaine Eastin, another Democrat, was not included in the poll because “the survey was taken before the announcement by [her] that she intends to be a candidate for Governor in 2018.” The Field Poll was completed online by YouGov between October 25-31, 2016 in both English and Spanish.\nField Poll Director Mark DiCamillo told the San Jose Mercury News that political party affiliation helped candidates garner more support, especially when it came to Republicans like Swearengin, whose support reportedly droppped from 11 percent to 3 percent when her political party was not mentioned. Faulconer reportedly went from 16 percent to 6 percent without having the “R” next to his name.\n“When you include the party designation, the voters flock to those candidates,” DiCamillo told the Mercury News. “When you don’t mention the fact that they’re Republicans, they don’t get nearly as much support.”\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2016/11/15/field-poll-newsom-leads-2018-race-followed-by-two-republicans/"}
