{"authors":[],"date_download":"2018-10-30 21:03:39","date_modify":"2018-10-30 21:03:39","date_publish":"2016-12-31 02:40:00","description":"A Georgia Waffle House waitress took matters into her own hands after three robbers demanded cash and threatened to shoot everyone.","filename":"data/vaneerConsumption/GaWaffleHousewaitresspulledgunonrobberswhotook200.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/30/Videos/5266492610001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_waffle-house-wai_d5e247faa3859e2283f289b5196ff932__1540933419.html","title":"Ga Waffle House waitress pulled gun on robbers who took $200","title_page":"Ga Waffle House waitress pulled gun on robbers who took $200","title_rss":"NULL","source_domain":"ajc.com","text":"A Waffle House waitress took matters into her own hands after three robbers entered the restaurant and demanded cash.\nHeather Burkinshaw-Stanley followed three robbers out of the restaurant and fired a shot after they stole $200 from the Waffle House worked at in Newnan on U.S. 29, according to a police report.\nThe three men walked into the diner about 2:30 a.m. Thursday and ordered a meal, according to a police report.\nTwenty minutes later, one of the men walked over to the counter and presented a note threatening to shoot every one inside if he didn’t get “all of the money,” according to the report. The waitress at the counter told police she didn’t see a gun and one was never shown.\nThe waitress gave the man $200 and the suspects walked to their car.\nCoweta County authorities looking for suspects after a robbery at a Waffle House involving a waitress firing a shot. Details @ 5:30. pic.twitter.com/RTtQMo8W2I — Matt Johnson (@MJohnsonWSB) December 30, 2016\nBut before they could even get in it, Burkinshaw-Stanley went to her car, grabbed her gun and fired a shot in the air.\nThe suspects drove to the BP next door before heading south on U.S. 29. Witnesses say a red Ford Crown Victoria followed behind the robbers’ gold or tan SUV.\nWitnesses told police the man who handed the note has a cross tattoo in the middle of his forehead. Another man was wearing light blue jeans with holes in them and a pair of white Nike’s with an orange or pink top, according to the police report.\nThe robbery was the third at that Waffle House since September, Channel 2 Action News reported. Authorities are not yet sure if they are connected.","url":"https://www.ajc.com/news/local/waffle-house-waitress-pulled-gun-robbers-who-threatened-shoot-everyone/N36D8suXaeg82x3mdW9a0M/"}
