{"authors":[],"date_download":"2018-10-22 22:55:19","date_modify":"2018-10-22 22:55:19","date_publish":"2014-05-13 01:06:05","description":"More than 200 gay couples obtained Arkansas marriage licenses Monday after a judge tossed out the state's 10-year-old same-sex marriage ban.","filename":"data/vaneerConsumption/GayCouplesMarryinArkansasasManyClerksSitOut.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/437836/140512-arkansas-same-sex-marriage-jms-2204_16c43c58c6d77879d5d02317a4188e6e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_gay-couples-marry-arkansas-many-clerks-sit-out-n103756_1540248919.html","title":"Gay Couples Marry in Arkansas as Many Clerks Sit Out","title_page":"Gay Couples Marry in Arkansas as Many Clerks Sit Out","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLITTLE ROCK, Ark. — More than 200 gay couples obtained Arkansas marriage licenses Monday after a judge tossed out the state's 10-year-old same-sex marriage ban, but only at a handful of courthouses as an overwhelming majority of county clerks in this part of the Bible Belt said they first wanted the state Supreme Court to weigh in.\nAttorney General Dustin McDaniel — who recently announced his personal support for same-sex marriage rights but said he would defend the law — filed paperwork Monday to at least temporarily preserve the ban, which voters approved by a 3-to-1 margin.\nIn other states that have seen gay-marriage bans overturned, judges either issued stays with their orders or state lawyers sought them with some immediacy. McDaniel's office requested a stay from the local judge Friday night but had to wait until the full court record was available Monday before going to the state Supreme Court, under the justices' rules. Justices gave both sides until midday Tuesday to file arguments.\nWith the weddings Saturday and Monday, Arkansas became the 18th state to allow same-sex marriages, and the first among former states of the Confederacy.\nOn our licenses, it automatically prints 'Mr.' and I told the girls just to change that to 'Ms.'\" said Becky Lewallen, the county clerk in Washington County, which is home to the University of Arkansas. She was among those who requested a stay.\nA Pulaski County circuit judge tossed out the 2004 constitutional amendment, along with a 1997 state law, after business hours Friday. Carroll County, home to the town of Eureka Springs and known for its arts environment and liberal policies, issued 15 licenses to same-sex couples Saturday but stopped Monday to await word from the state's high court.","url":"https://www.nbcnews.com/news/us-news/gay-couples-marry-arkansas-many-clerks-sit-out-n103756"}
