{"authors":[],"date_download":"2018-10-23 01:08:16","date_modify":"2018-10-23 01:08:16","date_publish":"2016-03-20 00:00:00","description":"Page's new TV show on Viceland is called Gaycation. The actress and co-host Ian Daniel speak to NPR's Michel Martin about the show, in which they explore LGBT culture around the world.","filename":"data/vaneerConsumption/GaycationEllenPageExploresLGBTLivesGloballyOnTravelShow.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_03_20_471194934_gaycation-ellen-page-explores-lgbt-lives-globally-on-travel-show_1540256896.html","title":"'Gaycation': Ellen Page Explores LGBT Lives Globally On Travel Show","title_page":"'Gaycation': Ellen Page Explores LGBT Lives Globally On Travel Show : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'Gaycation': Ellen Page Explores LGBT Lives Globally On Travel Show\nYouTube\nAs LGBT people have gained greater acceptance and rights in the United States and many Western countries, in other parts of the world gay people face discrimination and even death.\nActress Ellen Page and friend Ian Daniel set out to explore what it's like to be LGBT — the good and the bad — in different parts of the world. They're doing it in a new travel documentary show called Gaycation on the recently-launched Viceland channel.\nIn the first three episodes, the two travel to Japan to watch a man come out to his mother; interview an alleged hitman of LGBT people in Brazil; and see how dancehall music and Rastafari affect views on homosexuality in Jamaica.\nEllen Page and Ian Daniel spoke with NPR's Michel Martin about what they hope people learn from watching the show.\nInterview Highlights\nOn the genesis of the show\nPage: The original idea was in a sense a travel show of course, but to go to other countries and solely focus on the LGBTQ community and culture in that country.\nDaniel: I just was completely interested in the idea of LGBTQ culture and politics around the world. I just had an innate curiosity of — what is that like? What are those stories? I think it was that simple and it was a no-brainer for me really.\nOn filming a scene that features a Japanese man coming out to his mother, who did not know\nPage: Honestly we thought about that a lot. And when this young man reached out to have us be there for this moment — it was spontaneous that came up while we were in Japan, that wasn't a planned thing before we went. I understand the dilemma in regards of whether to do it or not. And we did talk about it, but we did decide to do it and be there and it does seem to have moved a lot of people. Their intimate moment and their generosity in deciding to share that story, in a lot of responses we've seen, seems to have affected people.\nDaniel: We feel honored to be in the presence of people who are so willing to share their stories. And I think on some level they risk their safety by talking to us and potentially being on camera. And I think there's a sense of honor and love and open-heartedness. And then there's the sense of — to be honest, sometimes despair. And sadness and just confusion about why these people have to experience violence and brutality and hiding and shame. So it's a combination of those two things.\nYouTube\nOn meeting a Brazilian man who is alleged to have murdered LGBT people\nPage: What I just recall even now talking about it is feeling it physically, in my body, which I think is obviously what you're seeing when you see us have that interaction. ... I would be lying if I said we weren't afraid. Of course you're nervous. Of course you're nervous after you share that you are a gay person. But I think honestly, for the most part, you're not thinking about yourself. You're thinking of those who are in the community and potentially at risk of being hurt by this person. I think that's what you think about when you walk away.\nYouTube\nOn what people will gain from watching the show\nPage: I feel grateful to be a part of a show that's offering more — just representation, just simply, for the LGBTQ community. Of course the show explores the triumphs and the joys, or even the nightlife. But sadly, unfortunately, it also focuses on and has to focus on how much discrimination affects people's lives. And I think a lot of people just don't always know the ways in which people struggle. Hopefully the show could potentially — in sharing these stories — reflect that in some way.\nDaniel: It's about creating a space where we can just share those stories basically. When you think about the viewers, you just want them to enter that space as open-minded as possible and to take the journey with us as fully as they possibly can. And I think that you just want people that watch the show to feel more connected to other stories around the world. Maybe there are people that watch the show that don't agree that LGBTQ people deserve rights or dignity. And we hope at some level that those people are watching and that challenges their personal views and their feelings. And maybe the show then encourages them to question if discriminating against people is actually making their lives better or other people's lives better. I think that's part of the foundation of what the show is.","url":"https://www.npr.org/2016/03/20/471194934/gaycation-ellen-page-explores-lgbt-lives-globally-on-travel-show"}
