{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 03:54:41","date_modify":"2018-10-23 03:54:41","date_publish":"2016-01-29 19:27:20","description":"Jussie Smollett would 'label himself as a gay man'. But more importantly than that, he labels himself as someone capable of love. The 32-year-old Empire star spoke to Out magazine","filename":"data/vaneerConsumption/GayEmpirestarJussieSmollettacceptshecouldfallinlovewithawoman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4C25700000578-0-image-a-9_1454092079476.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423281_Gay-Empire-star-Jussie-Smollett-accepts-fall-love-woman_1540266881.html","title":"Gay Empire star Jussie Smollett accepts he could 'fall in love with a woman'","title_page":"Gay Empire star Jussie Smollett accepts he could 'fall in love with a woman' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jussie Smollett has said he would 'label himself' as a gay man.\nBut more importantly than that, he labels himself as someone capable of love.\nThe 32-year-old Empire star spoke to Out magazine about his identity as a gay black man, a 'label' he has no problem with, besides the constraint of being labeled.\nScroll down for video\nLet it happen: Gay Empire star Jussie Smollett told Out Magazine he could 'fall in love with a woman' - as all people should just be open to love and not worry about gender\n'I am a gay man with an extremely open heart,' he said. 'If I had to label myself, I would label myself as a gay man.\n'With that said, I believe that love is the only thing that matters, and I would hope that anybody would leave themselves open – not to gender, but to love.\n'I would hope that people would not close themselves off from what could be if, lo and behold, you meet somebody that just sweeps you off your feet, and you just can’t do anything about it.'\nThe actor, who plays gay singer songwriter and middle Lyon child Jamal, questioned that if people truly believe that we are born this way, then why do we try to stifle the way we were born?\nHe said: 'I believe that love is the only thing that matters, and I would hope that anybody would leave themselves open – not to gender, but to love'\nOut in front: The 32-year-old is the cover star of the latest issue\n'If I fall in love down the road with a woman, I’m going to love that woman,' he insisted.\nThe California-born star conceded such a sentence was bound to be misconstrued, but added it 'is a conversation that deserves to be had/\n'Because we don’t all understand each other,' he said. 'You’re not going to tell me that loving someone is wrong. That does not mean that heterosexuality is not very real. It does not mean that bisexuality is not very real. It does not mean that homosexuality is not very real. They are all very real.\n'But what I’m saying is, I am a gay man. I am a gay man. I am a gay man. I don’t know how many times I have to say that.'\nSmollett 'came out' - despite claiming at the time 'There’s never been a closet that I’ve been in' - during a backstage interview with Ellen DeGeneres in March.\nHe decided to do this, despite his on-screen mom Taraji P Henson telling him in no uncertain terms that he was under no obligation to do so.\n'She said, \"Who gives a f*ck? I don’t tell these motherf*ckers that I’m straight. Why the fuck do you have to tell them that you’re gay?\"' he recalled.\nIn and out: Smollett 'came out' - despite claiming at the time 'There’s never been a closet that I’ve been in' - during a backstage interview with Ellen DeGeneres in March\nBusy: As for his current love life, Jussie admitted he is so caught up sharing his love with the world he hasn't had time to find some for himself\n'That was so OG, and it just made me love her even more.'\nAs for his current love life, Jussie admitted he is so caught up sharing his love with the world he hasn't had time to find some for himself.\nI have so much love inside that it pains me sometimes,' he said. '“You end up finding yourself all-consumed by the issues of the world, and that’s something I don’t want to change about myself.\n'So until the love of my life shows up, until I find my boo, I’m just going to be out, up in this piece, a lone ranger.\n'I have way too much love to give not to find my baby for life, but I don’t think now is the time.,' he added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423281/Gay-Empire-star-Jussie-Smollett-accepts-fall-love-woman.html"}
