{"authors":["Lauren Barbato"],"date_download":"2018-10-30 23:09:57","date_modify":"2018-10-30 23:09:57","date_publish":"2014-08-13 22:52:28","description":"Another gay marriage ban bites the dust: A federal appeals court refused to delay its ruling striking down Virginia's same-sex marriage ban, which means gay couples can start marrying legally in the Old Dominion as early as next week. The 4th…","filename":"data/vaneerConsumption/GayMarriageIsLegalInVirginiaNowAndWeddingsCouldStartNextWeek.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/50e62d19-2241-4db4-b1b4-cf0d5b4efac2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35690-gay-marriage-is-legal-in-virginia-now-and-weddings-could-start-next-week_1540940997.html","title":"Gay Marriage Is Legal In Virginia Now, And Weddings Could Start Next Week","title_page":"Gay Marriage Is Legal In Virginia Now, And Weddings Could Start Next Week","title_rss":"NULL","source_domain":"bustle.com","text":"Another gay marriage ban bites the dust: A federal appeals court refused to delay its ruling striking down Virginia's same-sex marriage ban, which means gay couples can start marrying legally in the Old Dominion as early as next week. The 4th Circuit Court of Appeals green-lit gay marriage on Wednesday, after denying a request to stay its July ruling. Virginia must also recognize same-sex marriages that were legally performed outside the state.\nIn a 2-1 decision last month, the 4th Circuit struck down Virginia's voter-approved gay marriage ban, saying it violated the due process and equal protection clauses of the Constitution. The decision upheld a lower court's decision, which also found the ban unconstitutional.\nIn its July decision, the 4th Circuit wrote:\nWe recognize that same-sex marriage makes some people deeply uncomfortable. However, inertia and apprehension are not legitimate bases for denying same-sex couples due process and equal protection of the laws. Civil marriage is one of the cornerstones of our way of life. ... The choice of whether and whom to marry is an intensely personal decision that alters the course of an individual’s life. Denying same-sex couples this choice prohibits them from participating fully in our society, which is precisely the type of segregation that the Fourteenth Amendment cannot countenance.\nBill Pugliano/Getty Images News/Getty Images\nAs it stands now, same-sex couples can marry in Virginia starting Aug. 20 unless the Supreme Court issues a stay of ruling, which would prevent it from taking effect. Opponents of same-sex marriage vow to fight the 4th Circuit's ruling and appeal to the Supreme Court.\nByrone Babione of the Alliance Defending Freedom, which is defending Virginia's gay marriage ban in court, issued a statement earlier this month expressing the defendants' disappointment in the 4th Circuit:\nEvery child deserves a mom and a dad, and the people of Virginia confirmed that at the ballot box when they approved a constitutional amendment that affirms marriage as a man-woman union. ... In its Windsor decision, the Supreme Court declared that the states have the authority to define marriage for their community. If the high court remains consistent with that principle, the states will ultimately be free to preserve man-woman marriage should they choose to do so. In the meantime, the 4th Circuit should put a hold on its decision to ensure an orderly and dignified resolution of this important constitutional question.\nThe request for a stay will now go to Chief Justice John Roberts, who will then refer it to the full court. The Supreme Court may block the 4th Circuit ruling from taking effect, as it recently did with Utah's same-sex marriage ban. After the 10th Circuit Court of Appeals struck down the state's ban, the high court asked Utah to not perform any same-sex marriages, leading marriage equality advocates and foes to believe that a larger gay marriage case is in their future.\nImages: Getty Images (2)","url":"https://www.bustle.com/articles/35690-gay-marriage-is-legal-in-virginia-now-and-weddings-could-start-next-week"}
