{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:26","date_modify":"2018-10-30 18:48:26","date_publish":"2015-10-27 18:08:56","description":"The Rainbow group also offered limited praise of the Catholic synod’s final document,","filename":"data/vaneerConsumption/GayRainbowCatholicsForeseeNewEraofPastoralCare.json","image_url":"https://media.breitbart.com/media/2015/08/sweden-gay-pride-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_27__1540925306.html","title":"Gay Rainbow Catholics Foresee ‘New Era’ of Pastoral Care","title_page":"Gay Rainbow Catholics Foresee ‘New Era’ of Pastoral Care | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Global Network of Rainbow Catholics is out with a response to the recently concluded Vatican synod on marriage and the family, noting its optimism that “a new era for inclusive pastoral care of LGBT people is going to start after the synod.”\nThe gay advocacy group found the Pope’s final address to the synod fathers especially encouraging, particularly his criticism of an attitude of pharisaism that sits in judgment over others. The Pope said that among other things the synod “was also about laying bare those closed hearts, which frequently hide even behind the Church’s teachings or good intentions, in order to sit in the chair of Moses and judge, sometimes with superiority and superficiality, difficult cases and wounded families.”\nThe Rainbow group also offered limited praise of the synod’s final document, asserting that since it is explicitly mentioned that “specific attention should be paid to families that have a member with homosexual tendencies,” there is, they claimed, “no longer any reason not to include same-sex couples themselves, as well as children with same-sex parents in such a pastoral focus.”\nYet despite the positive tone with which the group begins its statement, it proceeds to list a series of criticisms of the synod’s final document.\nThe group regrets, for example, the inability of the bishops “to reach a more positive consensus about the inadequacy of previously used terminology to describe variant sexual orientation.” The LGBT movement typically objects to expressions used in the Catechism of the Catholic Church that describe homosexual acts as “intrinsically disordered” and as “acts of grave depravity” that are “contrary to the natural law.” The Catechism also speaks of the homosexual inclination, or same-sex attraction, as “objectively disordered,” a term that many gays find offensive.\nThe Rainbow group also expressed its regret over “the implication that the best interests of a child, in adoptive or fostering situations, necessarily requires parenting by opposite sex couples,” a teaching that Pope Francis has repeated throughout his pontificate.\nTheir response to the synod also criticized the final report for giving “serious credibility to the term, ‘gender ideology’, created, even without any scientific evidence, by those who seek to find an excuse not to listen and respond pastorally to the realities of LGBT lives.” Here, too, the group seems to engage in a veiled criticism of Pope Francis, who has led a tireless crusade against gender ideology.\nFollowing the June referendum that recognized same-sex marriage in Ireland, Pope Francis insisted that the “complementarity of man and woman” is essential to marriage, but is under attack from “so-called gender ideology, in the name of a freer and fairer society.”\nIn his critique of gender politics, Francis has used exceptionally strong language, calling modern gender ideology “demonic,” and comparing gender theory with “the educational policies of Hitler.” The Pope has also said that gender theory fails to recognize “the order of creation.”\nThe Pope has received considerable pushback from the LGBT lobby for criticizing “an academic perspective that sees gender identities as a spectrum rather than as binaries.” Basing himself on Biblical theology, the Pope has insisted that God creates people as “male and female,” rather than an ever expanding spectrum of contrived pseudo-sexual genders.\n“I wonder,” said Pope Francis last April, “whether the so-called theory of gender is not an expression of frustration and resignation, which tries to erase sexual differences because it doesn’t know how to handle them.”\nDespite setbacks to their stated goals, the Global Network of Rainbow Catholics ended its statement on the synod on a positive note.\n“Even though the 2015 Synod did not manage to bring itself to develop a stronger statement of LGBT acceptance,” it said, there was “a language of apology for past harmful and inaccurate language addressed to LGBT people and their parents.”\n“The door for a more sensitive attentiveness to LGBT issues in the Church has been opened through the Synodal processes of 2014-2015 and, despite opposition, cannot now be closed,” it concluded.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/politics/2015/10/27/gay-rainbow-catholics-foresee-new-era-pastoral-care/"}
