{"authors":[],"date_download":"2018-10-30 01:17:01","date_modify":"2018-10-30 01:17:01","date_publish":"2017-04-12 00:04:24","description":null,"filename":"data/vaneerConsumption/GayRightsandJudicialActivismBrazenEndRunonCongress.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/Dirksen_United_States_Courthouse_Chicago_Loop_Chicago_Illinois_11004248426.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862221.html","title":"Gay Rights and Judicial Activism: Brazen End Run on Congress","title_page":"Gay Rights and Judicial Activism: Brazen End Run on CongressThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Senate Judiciary Committee confirmation hearings on Supreme Court nominee Judge Neil Gorsuch were a week-long tutorial on the separation of powers under our Constitution. The proceedings examined in excruciating detail the role of the Congress to make laws and the courts to interpret the laws and the Constitution. The hearings underscored the importance of judicial restraint and refraining from legislating from the bench.\nMeanwhile, in a Chicago appeals court, separation of powers was being tested in very real terms. The 7th Circuit Court of Appeals in Chicago, in Hively v. Ivy Tech, recently ruled 8-3 that workplace discrimination on the basis of sexual orientation violates Title VII of the Civil Rights Act of 1964, despite the fact that law makes no mention whatsoever of sexual orientation discrimination.\nRegardless of the progressive judicial perspective of the majority decision, the mechanism for changing the law to prohibit sexual orientation discrimination is simple and straight-forward… Just amend Title VII of the Civil Rights Act of 1964 — the federal law which currently prohibits discrimination on the basis of race, color, religion, sex, or national origin — to include gays and lesbians under its comprehensive protections.\nCongress has considered such legislation before and continues to consider expanding Title VII. The Employment Non-Discrimination Act (ENDA), which would prohibit discrimination in hiring and employment on the basis of sexual orientation, has been introduced in every Congress since 1994. ENDA came close to passage in 2007, when it passed the House 235–184 but died in the Senate. If the current law prohibited discrimination on the basis of sexual orientation as the 7th Circuit has ruled, there would be no need for ENDA.\nWhile today there is no federal law prohibiting discrimination based on sexual orientation, 21 states and the District of Columbia have passed laws prohibiting employment discrimination based on sexual orientation, and 16 states and D.C. also prohibit discrimination based on gender identity.\nAdditionally, 434 (88 percent) of the Fortune 500 companies have implemented non-discrimination policies that include sexual orientation, and 282 (57 percent) have policies that include gender identity. So, American industry is generally supportive of protecting equal opportunity based on sexual orientation. Of course, labor unions have enthusiastically supported non-discrimination based on sexual orientation for decades.\nDespite all that support for a legislative amendment to extend employment discrimination protection to gays and lesbians, Congress has yet to act. So, it’s with that backdrop that the 7th Circuit Court of Appeals has decided to judicially legislate a change to the discrimination statute. In doing so, the court has jumped the gun and exceeded its constitutional authority.\nJudge Sykes, joined by Judges Bauer and Kanne, vigorously disagree with the 7th Circuit majority’s extension of judicial power to “amend the statute.” They argue persuasively that the Congress alone should be deciding whether the law should be extended to prohibit discrimination on the basis of sexual orientation. Their dissent succinctly and persuasively presents the argument:\nIt’s understandable that the court is impatient to protect lesbians and gay men from workplace discrimination without waiting for Congress to act. Legislative change is arduous and can be slow to come. But we’re not authorized to amend Title VII by interpretation. The ordinary, reasonable, and fair meaning of sex discrimination as that term is used in Title VII does not include discrimination based on sexual orientation, a wholly different kind of discrimination. Because Title VII does not by its terms prohibit sexual orientation discrimination, Hively’s case was properly dismissed.\nThe simple fact is that, under our Constitution, the issue of legal prohibition of sexual orientation discrimination in employment is one for Congress, not the courts, to decide. Most likely, newly confirmed Associate Supreme Court Justice Neil Gorsuch would agree.","url":"https://spectator.org/gay-rights-and-judicial-activism-brazen-end-run-on-congress/"}
