{"authors":[],"date_download":"2018-10-22 20:46:50","date_modify":"2018-10-22 20:46:50","date_publish":"2016-01-28 03:45:25","description":"Omar had long dreamt of escaping discrimination in Syria, and drawn by exuberant images of the Gay Pride march in Amsterdam he hoped to find a new life in th...","filename":"data/vaneerConsumption/GaySyrianrefugeeshopeofnewlifetestedbyDutchcamps.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5gg-2vdWmEltwXfba0ce28e632372dd2-218_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420294_Gay-Syrian-refugees-hope-new-life-tested-Dutch-camps_1540241210.html","title":"Gay Syrian refugee's hope of new life tested by Dutch camps","title_page":"Gay Syrian refugee's hope of new life tested by Dutch camps | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gay Syrian refugee's hope of new life tested by Dutch camps\nOmar had long dreamt of escaping discrimination in Syria, and drawn by exuberant images of the Gay Pride march in Amsterdam he hoped to find a new life in the Dutch city after fleeing war at home.\nBut four months after arriving in the Netherlands, the 20-year-old was shocked to find himself the victim of insults, taunts and intimidation from his fellow travelling companions.\n\"Coming to the Netherlands, which is the country of freedom and expressing yourself, and being bullied there as a gay person, it was completely crazy,\" he told AFP, speaking in English.\nOmar, a 20-year-old Syrian gay refugee, speaks about his journey and about abuses against gay migrants by fellow travellers, during an interview with AFP in Aalsmeer, the Netherlands ©Emmanuel Dunand (AFP)\nHe is among more than 54,000 refugees who made it to the Netherlands in 2015, crossing by boat to Greece and then flying to Holland in September on a fake Spanish passport.\n\"It was surprising that those people, after making a long journey, tiring journey, after they get there, they’re still capable of bullying and harassing me,\" he said.\nOmar's experience has not been unique, as gay refugees have found themselves caught between the conservative cultural outlook of refugee families, and the more tolerant Dutch attitude.\nThe Netherlands was the first country in the world to legalise gay marriage as far back as 2001, but acceptance of sexual diversity has not been the norm in Dutch refugee centres.\n- Intimidated, isolated -\nFor Omar, a svelte law student from a well-off Syrian family with a carefully groomed five o'clock shadow and neatly coiffed hair, discovering that the asylum camps did not live up to his expectations was a shock.\n\"I read all these articles that said that the Netherlands is very tolerant towards gays and that Amsterdam is the capital of the LGBT community. I saw the images of Gay Pride,\" he said.\nBut he says he was insulted by other refugees. \"They threatened to kill me, they told me I was the shame of the refugees, they pushed me in the queue to get coffee.\"\nIntimidated and isolated, many like Omar didn't dare leave their rooms. He would spend hours there, headphones clamped to his ears.\n\"I was lucky that I wasn't physically attacked,\" said Omar, who has finally found shelter thanks to Lianda, a 25-year-old gay Dutch woman who offered him a room.\nAccording to the COC, an association working to defend gay rights, some gay refugees have had even worse experiences including being sexually abused. The Dutch daily AD reported some had their clothes set on fire or beds smeared with food and faeces.\nAnother group Secret Garden revealed two gay refugees tried to commit suicide.\nOne man was so scared that he slept for a week in the woods surrounding the centre, AD said, before like Omar, he found a place to stay with a welcoming Dutch host.\nBetween mid-October and the end of December, the COC said it received 14 complaints of mistreatment or abuse of gay refugees, compared to usually one or two every few months.\n\"We think this is only the tip of the iceberg,\" said COC director, Koen van Dijk.\nMost gays refuse to lodge official complaints or to speak out publicly, fearing reprisals or not knowing who to turn to.\n- Vulnerable -\nIn a bid to protect them, the Amsterdam municipality opened up two safe houses from October to December for about a dozen people as an emergency measure.\nThe COC welcomed the move, while insisting it should only be a temporary step. Now those who were briefly accommodated in the safe houses have been re-lodged in centres more adapted to their needs.\nFive have been placed in a separate wing of a smaller centre, where any abuse can be more easily spotted and dealt with.\nThe Dutch governmental organisation which receives and handles refugees, COA, has sought to educate other migrants about the need for tolerance.\nIn extreme cases the police can be called in, with COA considering gays a \"vulnerable\" group along with children or victims of domestic violence.\nOmar believes he will only truly begin his new life, once he has been granted asylum. But he is already making new friends among Dutch society.\n\"I expected to meet people who would accept me the way I am, and I did,\" he said with a smile.\n\"Walking in the street hand-in-hand with your boyfriend without fearing what people will do, it's great.\"\nOmar, a 20-year-old Syrian gay refugee, pictured next to Lianda, a Dutch teacher who decided to host him at her home after hearing his story via socila networks about the abuses against gay migrants by fellow travellers, in Aalsmeer ©Emmanuel Dunand (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3420294/Gay-Syrian-refugees-hope-new-life-tested-Dutch-camps.html"}
