{"authors":[],"date_download":"2018-10-30 01:10:00","date_modify":"2018-10-30 01:10:00","date_publish":"2015-04-05 00:00:00","description":null,"filename":"data/vaneerConsumption/GayweddingcakesvstheMarchjobsreport.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_gay_wedding_cakes_vs_the_march_jobs_report_1540861800.html","title":"Gay wedding cakes vs. the March jobs report","title_page":"Gay wedding cakes vs. the March jobs report","title_rss":"NULL","source_domain":"americanthinker.com","text":"A few days ago, I posted that the Indiana uproar was all about the left picking fights to avoid the reality of a lousy foreign policy and bad economy.\nThe sputtering U.S. economy created just 126,000 jobs in March as bad weather, weak consumer spending and flailing corporate profits resulted in the worst report since December 2013. Economists expected nonfarm payrolls to rise 245,000 in March, with the unemployment rate holding steady at 5.5 percent, according to Reuters. February's numbers were revised lower to 264,000 from the initially reported 295,000, while January's number fell from 239,000 to 201,000. The total fell well short of the 269,000 average over the past year and was the first time in 14 months that the number dropped below 200,000. However, the overall unemployment rate held steady at 5.5 percent, as a generational low in labor force participation helps keep the figure low. A separate gauge that includes those who have stopped looking for work as well those employed part-time for economic reasons—the underemployed—edged lower from 11 percent to 10.9 percent. The jobs numbers come as both the economy and corporate profits have been weakening substantially.\nThis is a lousy report. I understand that there will be good and bad months, but this is now a bad economy that doesn't get better.\nHow are blacks doing in the seventh year of our first black president? The answer is a \"Record 12,202,000 Black Americans Not in Labor Force\"!\nHow are women doing? The answer is no better: \"56,131,000 WOMEN AREN’T IN THE LABOR FORCE, A RECORD HIGH\"\nSo get ready for lots of hysteria about wedding cakes and photography. Look for the gender and race cards to come back for another round.\nThe left can't deal with the results of seven years of hope and change. So they are out to change the subject rapidly.\nP.S. You can hear my show (CantoTalk) or follow me on Twitter.","url":"https://www.americanthinker.com/blog/2015/04/gay_wedding_cakes_vs_the_march_jobs_report.html"}
