{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 20:28:37","date_modify":"2018-10-30 20:28:37","date_publish":"2015-09-12 04:29:29","description":"Gaza-based terrorists Jaysh al Islam has reportedly pledged its services to the Islamic State terror group’s branch in the Sinai Peninsula.","filename":"data/vaneerConsumption/GazaJihadistGroupPledgesToISIS.json","image_url":"https://media.breitbart.com/media/2015/09/Jaysh-al-Islam-Army-of-Islam-military-training-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_11__1540931317.html","title":"Gaza Jihadist Group Pledges To ISIS","title_page":"Report: Gaza Jihadist Group Pledges To ISIS","title_rss":"NULL","source_domain":"breitbart.com","text":"The Gaza-based terrorist group Jaysh al Islam [Army of Islam] has reportedly pledged its services to the Islamic State terror group’s branch in the Sinai Peninsula, according to a message that circulated jihadist Internet networks this week.\nThe statement reads, according to the Jerusalem Post:\nWe, the soldiers of Jaish al-Islam in the Gaza Strip and our leader Mumtaz Dughmush, may Allah preserve him, we consider ourselves to be an integral part of Wilayat Sinai [ISIS in the Sinai Peninsula]…we pledge allegiance to Abu Bakr al-Baghdadi al-Qurayshi, the Caliph to all Muslims in the House of Islam and each place where Muslims reside.\nThe statement continued: “We swear to our brothers that, with might, we will not stop our fight against the Jews and the apostates in Gaza and in the Sinai” until the flag of the Islamic State is raised above them.\nThe group was officially designated as a terrorist organization by the U.S. State Department in May 2011. The outfit “has been responsible for numerous terrorist acts against the Governments of Israel and Egypt, as well as American, British and New Zealander citizens,” the statement read.\nMumtaz Dughmush, a Salafist jihadi who resides in Gaza, is said to be the leader of the terror group. He is also individually designated as a terror leader by the U.S. State Department.\nJaysh al Islam “subscribes to a Salafist ideology of global jihad,” the U.S. terror designation added, noting that the group has previously worked with al-Qaeda and the Gaza-based Hamas terror organization.\nJaysh al Islam is reportedly funded by foreign individuals and organization that promote its global jihadist ideology. Its members are known to travel to the Sinai Peninsula, Syria, and Yemen for training, according to reports.\nIf it is indeed true that the outfit has linked up with ISIS, it would represent a significant addition to ISIS’s presence in the Gaza Strip. In recent months, terror attacks have been carried out in Gaza that have been claimed by individuals who say they are part of ISIS. Their appeal has become attractive to Gazans who feel that Hamas has not been aggressive enough in their attempts to install a global Islamic caliphate.","url":"https://www.breitbart.com/national-security/2015/09/11/report-gaza-jihadist-group-pledges-to-isis/"}
