{"authors":[],"date_download":"2018-10-23 02:05:19","date_modify":"2018-10-23 02:05:19","date_publish":"2016-01-29 16:25:27","description":"Dramatic video footage of armed clashes in Abidjan and bloodied corpses lining the streets on Friday opened the second day of the landmark trial of former Iv...","filename":"data/vaneerConsumption/GbagbotrialshowndramaticvideoofAbidjanclashes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i06n-3bmscybNe842cce83474b57d57e3-88_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423086_Gbagbo-trial-shown-dramatic-video-Abidjan-clashes_1540260319.html","title":"Gbagbo trial shown dramatic video of Abidjan clashes","title_page":"Gbagbo trial shown dramatic video of Abidjan clashes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gbagbo trial shown dramatic video of Abidjan clashes\nDramatic video footage of armed clashes in Abidjan and bloodied corpses lining the streets on Friday opened the second day of the landmark trial of former Ivorian president Laurent Gbagbo.\nThe prosecution accuses Gbagbo, 70, and his former youth militia leader Charles Ble Goude, 44, of orchestrating a plan to ensure the west African strongman remained in power despite being narrowly defeated by his bitter rival Alassane Ouattara in November 2010 elections.\nPro-Gbagbo forces \"shot at the crowds... causing death and grievous bodily injuries,\" ICC senior trial lawyer Eric MacDonald told the three-judge bench at the International Criminal Court (ICC).\nMore than 3,000 people were killed in post-election violence across the Ivory Coast in 2010 ©Issouf Sanogo (AFP)\n- 'Get an ambulance' -\n\"They were shot simply for showing Ouattara support,\" he added.\nGbagbo on Thursday became the first ex-head of state to stand trial at the world's only permanent war crimes tribunal.\nHe and Ble Goude have denied four charges of crimes against humanity for his role in deadly post-election violence that prosecutors say killed some 3,000 people.\nProsecutors are focusing on four specific incidents in a five-month orgy of violence in the world's top cocoa producer until Gbagbo's eventual arrest in April 2011.\nOne incident focuses on a march on a pro-Gbagbo television station in December 2010 during which 45 people were killed and 16 women and girls were raped.\nA video shot on December 16, 2010, shows a loud explosion followed by more shots.\n- Six witnesses -\n\"Two people were killed by a hand grenade. Get an ambulance!\" one protester calls out as limp and bloodied bodies are dragged out of the line of fire.\nAnother video of a women's march in the northern Abobo suburb on March 3, 2011, shows how pro-Gbagbo forces opened fire on unarmed women, leaving bloodied bodies on the streets.\nSeven women were killed and three others injured.\n\"These women were unarmed. They only carried tree branches,\" MacDonald said.\nHe played yet more videos including one of the alleged shelling of the Abobo market quarter on March 17, 2011 in which at least 40 people died.\nSeveral bodies were seen sprawled on tables and next to market stalls.\n\"Mr Gbagbo failed to take all the necessary measures to prevent these crimes and investigate them,\" MacDonald said.\n\"On the contrary, the evidence will show that Mr Gbagbo made attempts to cover up these crimes.\"\nClosing his opening statement, MacDonald told the judges the prosecution would call six material witnesses when it starts presenting its evidence -- likely some time next week.\n\"We will call six Ivorian men and women ... who will tell their stories of suffering,\" MacDonald said.\n\"The prosecution's evidence in this case, and nothing else, will speak for itself.\"\nWearing a black suit, white shirt and dark striped tie, Gbagbo sat motionless as the videos were played, but calls of disbelief rang out from the public gallery where some of his supporters had gathered for a second day.\nAt the end of proceedings, Gbagbo smiled and waved to the supporters, who sang the Ivorian national anthem, many with clenched fists.\n\"We don't care what so-called evidence gets presented,\" said one who declined to be named.\n\"In the end our president Gbagbo will walk free,\" the man said.\nThe defence is set to give its opening statement on Monday in the trial likely to last three to four years.\nBle Goude has indicated he wants to make a statement, but it was unclear whether Gbagbo will also address the courtroom.\nFormer Ivory Coast president Laurent Gbagbo denied four charges of crimes against humanity as he stood trial at the International Criminal Court in The Hague, on January 28, 2016 ©Peter Dejong (POOL/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3423086/Gbagbo-trial-shown-dramatic-video-Abidjan-clashes.html"}
