{"authors":[],"date_download":"2018-10-22 23:34:17","date_modify":"2018-10-22 23:34:17","date_publish":"2016-01-28 12:40:25","description":"The groundbreaking war crimes trial in The Hague on Thursday of former Ivory Coast president Laurent Gbagbo has rekindled a bitter row across Africa over the...","filename":"data/vaneerConsumption/GbagbotrialrekindlescontroversyinAfricaoverwesternjustice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5he-4vVdYopwYQ7f641721b07ad34fc5-571_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420356_Gbagbo-trial-rekindles-controversy-Africa-western-justice_1540251257.html","title":"Gbagbo trial rekindles controversy in Africa over western justice","title_page":"Gbagbo trial rekindles controversy in Africa over western justice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gbagbo trial rekindles controversy in Africa over western justice\nThe groundbreaking war crimes trial in The Hague on Thursday of former Ivory Coast president Laurent Gbagbo has rekindled a bitter row across Africa over the international justice system.\nWith Gbagbo the first ex-head of state hauled into the dock at the world's only permanent war crimes court, some in Africa are lashing out at the International Criminal Court (ICC) for allegedly pursuing Africans alone.\nThe continent, they argue, instead should have its own court.\nFormer Ivory Coast president Laurent Gbagbo pictured before the start of his trial at the International Criminal Court in The Hague on January 28, 2016 ©Peter Dejong (Pool/AFP)\n\"It leaves me a bit puzzled to see former African leaders dragged before the ICC,\" Babacar Ba, who heads a judicial forum in Senegal, told AFP.\n\"It's as if we Africans are incompetent to decide the law or lack the resources to judge our own people,\" added Ba.\nInstead of trying Gbagbo at the ICC, \"we could've set up Extraordinary African Chambers as we did for Hissene Habre,\", he said, referring to the special court set up in Dakar by the African Union to try the former Chadian leader.\nDelayed for years, the first phase of the Habre trial for atrocities wrapped up in December, setting a historic precedent as up until then African leaders had been tried in international courts for such abuse.\nThe Habre trial has set a precedent in the struggle to end impunity as it sees a former African head of state forced to account for his actions in another African nation's court under the principle of \"universal competence\".\nUN Secretary-General Ban Ki-moon this month said the Habre trial, along with several cases before the ICC, showed \"the surge in accountability mechanisms.\"\n\"The world is witnessing a sea change in ending impunity for atrocious crimes,\" Ban added in his New Year message.\nAt stake at the Habre trial that opened last year was Africa's \"capacity to judge its own children so others don't do it in its stead\", said Marcel Mendy, spokesman for the Extraordinary African Chambers.\n- Row over Sudan's Bashir -\nBut Babacar Ba said it was key for African states to follow Senegal's lead and adopt the principle of \"universal competence\" to enable them to hold such trials.\nSet up in 2002 as the last resort to try war criminals and perpetrators of genocide never tried at home, the ICC has opened probes involving eight nations, all of them African: Kenya, Ivory Coast, Libya, Sudan, Democratic Republic of Congo, Central African Republic, Uganda and Mali.\nAfrican leaders have accused it of acting as the judicial arm of foreign powers.\nThe creation of the ICC \"was strongly backed by Africa\", which now considers it \"no longer a tribunal for all,\" said Ethiopian Foreign Minister Tedros Adhamon Ghebreyesus, speaking on behalf of the African Union in November.\nThe ICC prosecutor, herself an African, Fatou Bensouda of Gambia, disagrees. \"All the cases we have, with the exception of Kenya, Sudan and Libya, were initiated on the request of African states,\" she told AFP in November.\nBut the case of Sudanese President Omar al-Bashir, who has been wanted by the ICC since 2009 for war crimes, crimes against humanity and genocide, repeatedly reignites the row, with the African Union publicly opposing his arrest several times on the grounds of his immunity as head of state.\nAt an AU summit in Johannesburg in June 2015, a South African court ordered the government to arrest him -- but authorities allowed him to make a rapid exit from the country, triggering a domestic row.\nThe legal battle to force the government to arrest Bashir was launched by the Southern Africa Litigation Centre (SALC), a non-profit lawyers' group.\n\"It is important for South Africa and other signatories to the Rome Statute to support the ICC,\" Angela Mudukuti of the SALC told AFP ahead of Gbagbo's trial. \"The ICC is the only permanent international justice mechanism mandated to handle egregious crimes.\n\"Most importantly,\" she added, \"victims need justice.\n\"Suspected perpetrators of these crimes need to understand that the long of arm of the law will catch up with them.\"\nGbagbo's trial, said his lawyer Emmanuel Altit, will be \"an important trial for Cote d'Ivoire and for Africa.\"\nAfrican leaders pursued by the ICC ©K.Tian/A.Bommenel, abm/pld (AFP)\nFormer Chadian leader Hissene Habre gestures as he leaves a Dakar courthouse after an identity hearing on June 3, 2015 ©Seyllou (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420356/Gbagbo-trial-rekindles-controversy-Africa-western-justice.html"}
