{"authors":[],"date_download":"2018-10-23 04:00:59","date_modify":"2018-10-23 04:00:59","date_publish":"2016-01-28 19:50:26","description":"A sea of orange hats flooded a blustery Dutch promenade outside a war crimes court Thursday as supporters of fallen Ivorian strongman Laurent Gbagbo loudly d...","filename":"data/vaneerConsumption/GbagbosupportersbringtasteofAfricatostaidICC.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h3lb-2vdWmEltwXfba0ce28e632c45980-687_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421598_Gbagbo-supporters-bring-taste-Africa-staid-ICC_1540267259.html","title":"Gbagbo supporters bring taste of Africa to staid ICC","title_page":"Gbagbo supporters bring taste of Africa to staid ICC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gbagbo supporters bring taste of Africa to staid ICC\nA sea of orange hats flooded a blustery Dutch promenade outside a war crimes court Thursday as supporters of fallen Ivorian strongman Laurent Gbagbo loudly denounced a French plot to \"kidnap\" their hero.\nHundreds from the widespread Ivory Coast diaspora bused in from Paris and Brussels, and even from as far away as Switzerland, in a determined bid to get their message across that the wrong man is on trial for the bloodshed that scarred the nation from 2010 to 2011.\n\"This trial is a disgrace because our president was elected democratically before being expelled from power by arms, by the rebels of Ouattara,\" said one supporter, 58-year-old Colacicco.\nSupporters of former Ivory Coast president Laurent Gbagbo and former minister Charles Ble Goude rally outside the International Criminal Court of The Hague on January 28, 2016 ©Peter Dejong (ANP/AFP)\nHe was referring to President Alassane Ouattara who was declared the winner of the November 2010 elections, despite Gbagbo's refusal to acknowledge his defeat and step down.\nDecked out in the colours of the Ivorian flag, orange, green and white, hundreds of supporters enjoyed a rare sunny day outside the International Criminal Court nestled in the dunes by the sea in the Dutch city of The Hague.\nInside the fortress-like building, a relaxed-looking Gbagbo, 70, and his ally, former militia leader Charles Ble Goude, 44, pleaded not guilty to four charges of crimes against humanity including murder, rape and persecution.\nPolice estimated there were some 300 protesters, but organisers put the figure at closer to 1,000.\nThe supporters contend that Gbagbo's arrest in April 2011 and subsequent transfer to the ICC was a plot by the French to get their hands on Ivory Coast's riches.\nThe west African nation had been seen at the time as a bastion of democracy. But when Gbagbo refused to concede defeat, its economic capital Abidjan descended into chaos.\nIt was the French government that \"concocted the fall of president Gbagbo,\" said one protester from Paris who identified himself only as Eric.\n\"Truth will trump the lies,\" said one of the organisers, Abel Naki, maintaining Gbagbo was \"kidnapped and deported.\"\n\"This reminds us of the years of slavery and colonisation,\" he said.\nLarge screens were erected on a stage outside in a bid to allow the protestors to watch the proceedings amid singing, chanting and drum playing.\n- Heros and lions -\nInside the public gallery were 50 supporters who were allowed access. They followed the proceedings intently, tutting and even occasionally booing as yet another allegation was levelled against their champion.\nWhen presiding judge Cuno Tarfusser closed for the day they remained glued to the glass windows separating the public gallery from the courtroom as Gbagbo was escorted away.\nThey cheered and applauded their fallen leader, who waved back after earlier in the day having blown kisses -- clearly enjoying the attention after five years behind bars far from his African homeland.\nGbagbo's supporters are bitterly angry that Ouattara's camp has not been investigated for an alleged string of abuses during the unrest.\n\"My brother was killed by Ouattara's rebels,\" says Edwige, 20, from Paris.\nOuattara \"is the real criminal. He's the one who should be on trial.\"\nBut chief prosecutor Fatou Bensouda said in her opening statement there was \"a vast body of evidence\" against the accused, earning hisses and catcalls from the public gallery.\nBensouda's statements \"are dangerous,\" Naki told AFP.\n\"It's full of lies and based on nothing else than elements provided by Ouattara.\"\nProtester Eric from Paris used an old tale to explain how in his view the victor always gets to write history.\n\"When the story is told by the hunters, the lions are always in the wrong,\" he said.\nFormer Ivory Coast president Laurent Gbagbo looks on before the start of his trial at the International Criminal Court in The Hague on January 28, 2016 ©Peter Dejong (Pool/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3421598/Gbagbo-supporters-bring-taste-Africa-staid-ICC.html"}
