{"authors":["Sam Ramsden"],"date_download":"2018-10-31 01:48:25","date_modify":"2018-10-31 01:48:25","date_publish":"2018-09-14 10:42:24","description":"The Great British Bake Off is a competition which sets out to discover the nation's finest baking talents, so you might assume that those in charge of critiquing the contestants' efforts would also love nothing more than making bread, cakes, pies,…","filename":"data/vaneerConsumption/GBBOJudgePrueLeithDoesntLikeBakingTheReasonActuallyMakesSoMuchSense.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/6b8479ff-b692-4089-87e7-31b5b8b08091-gbbo9-royal-tour-5305.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_gbbo-judge-prue-leith-doesnt-like-baking-the-reason-actually-makes-so-much-sense-11910305_1540950505.html","title":"'GBBO' Judge Prue Leith Doesn't Like Baking & The Reason Actually Makes So Much Sense","title_page":"'GBBO' Judge Prue Leith Doesn't Like Baking & The Reason Actually Makes So Much Sense","title_rss":"NULL","source_domain":"bustle.com","text":"The Great British Bake Off is a competition which sets out to discover the nation's finest baking talents, so you might assume that those in charge of critiquing the contestants' efforts would also love nothing more than making bread, cakes, pies, and biscuits. So it may come as a surprise to many fans to learn that judge GBBO Prue Leith doesn't actually like baking. According to The Mirror, the chef and restaurateur made the revelation while teaching at Truro School in Cornwall during a pop-up cookery school. Erm, where was my invite?\nDuring the session she was quizzed by students about her assumed \"passion\" for all things baking, however The Mirror reports that those in attendance received a surprising answer when the Bake Off star said \"I don’t have a passion for baking - I have a passion for eating cakes\". She explained, “I am more interested in savoury cooking than baking\". Although most of us can relate to Leith's love of munching on cake, I reckon this was the last thing viewers would expect to hear from a Bake Off head judge. Luckily for Leith, contestants do whip up the odd savoury treat, and with her judge status she's able to do what she likes best — eat cake rather than bake it.\nCharlie Fearn / Channel 4\nIt isn't the first time the TV judge has surprised fans during her time on the Channel 4 show. Just last year Leith sent the Twitterverse into meltdown after prematurely posting the identity of the 2017 winner before the final episode had actually aired. The Bake Off star later tweeted an apology to fans of the show for the mishap, writing, \"I am so sorry to the fans of the show for my mistake this morning, I am in a different time zone and mortified by my error\".\nLeith, who was in Bhutan at the time explained that the error had been caused by a timezone mix-up. To be fair, they are very confusing. She told Press Association, \"The time difference is massive. I thought that they got [the result] six hours ago\". Despite a bit of grumbling from fans in the aftermath of \"tweet-gate\", it didn't take long for the highly celebrated chef and restauranteur to bounce back. And she's been receiving high praised from fans during episodes of the show, with one even dubbing her \"the high priestess of baking\".\nWhile Leith will have enjoyed the savoury delights of the recent Bread Week, where contestants including the ever-popular Rahul and Terry grappled with Chelsea buns, naan and korovai, she might not be quite so keen on Dessert Week. The Express reports that the episode description teases challenges including chocolate, meringue and something \"wobbly\". Very intriguing. But maybe a little sweet for Leith's tastes.\nSo, while I have to admit I'm still reeling from the revelation that Leith doesn't actually like baking cake, I'm entirely on board with her approach to eating it. And I think the judge's ability to keep surprising fans is a massive part of what makes her such a perfect fit for The Great British Bake Off. You do you Prue, you do you.","url":"https://www.bustle.com/p/gbbo-judge-prue-leith-doesnt-like-baking-the-reason-actually-makes-so-much-sense-11910305"}
