{"authors":["Local"],"date_download":"2018-10-30 21:46:13","date_modify":"2018-10-30 21:46:13","date_publish":"2018-10-30 21:10:00","description":"GBI confirms teen among multiple people dead inside south Georgia home","filename":"data/vaneerConsumption/GBIconfirmsteenamongmultiplepeopledeadinsidesouthGeorgiahome.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Local_Wsbtv/2018/10/30/Images/863234358_MultipleDeaths_1540933668707_13536487_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gbi-confirms-tee_efe8faab23ff539a08f8405c3ae9d49d__1540935973.html","title":"GBI confirms teen among multiple people dead inside south Georgia home","title_page":"GBI confirms teen among multiple people dead inside south Georgia home","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities say they are investigating multiple deaths in a rural area of southeast Georgia.\nGeorgia Bureau of Investigation spokeswoman Nelly Miles said in an email Tuesday that agents had been dispatched to Charlton County, where \"there are multiple deaths confirmed.\"\nAmber Krycka, a reporter with our sister-station Action News Jax, is at the scene and reports that the GBI confirmed to her that two women and a teen are dead at the home. Agents told her a family member found them.\nUpdate: Two females + 1 teenager is confirmed deceased. There is no immediate threat to the community. https://t.co/33xdpOucrH — GA Bureau of Invest (@GBI_GA) October 30, 2018\nWe're working with out sister-station, Action News Jax, and speaking with the GBI to learn the latest on this developing story, for updates on Channel 2 Action News at 5 p.m.\nKrycka said she has seen GBI agents taking boxes of evidence from the home.\nGBI taking boxes from the home and loading them into an SUV. — this is where they say multiple people are dead. pic.twitter.com/5ZjZ92YROr — Amber Krycka (@AmberANjax) October 30, 2018\nNeighbors told Krycka that a 10-year-old lives inside the home.\nA neighbor tells me a 10yo boy lives in this home where GBI is now investigating and say multiple people are dead. pic.twitter.com/rOYcAya5sR — Amber Krycka (@AmberANjax) October 30, 2018\nHelicopter video from the scene showed law enforcement officials surrounding the home.\nThe metal-roofed house sits on a wooded lot with multiple outbuildings.\nCharlton County is located at the Georgia-Florida state line and includes eastern portions of the Okefenokee Swamp.\nInformation from Action News Jax and The Associated Press contributed to this article.","url":"https://www.ajc.com/news/local/gbi-confirms-teen-among-multiple-people-dead-inside-south-georgia-home/MO4UhkADrylEcj3eFpHuCJ/"}
