{"authors":[],"date_download":"2018-10-30 20:17:10","date_modify":"2018-10-30 20:17:10","date_publish":"2016-02-18 21:44:45","description":"Officers in northeast Georgia early Thursday shot and killed a 25-year-old man they say held up an object they believed to be a firearm and charged toward them, the Georgia Bureau of Investigation said.","filename":"data/vaneerConsumption/GBIPoliceofficersshootkillmaninnortheastGeorgia.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_gbi-police-_1e417e3fb6f0ae07ba11dd2ed9ebe7c8__1540930630.html","title":"GBI: Police officers shoot, kill man in northeast Georgia","title_page":"GBI: Police officers shoot, kill man in northeast Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Officers in northeast Georgia early Thursday shot and killed a 25-year-old man they say held up an object they believed to be a firearm and charged toward them, the Georgia Bureau of Investigation said.\nJust before 12:15 a.m. Thursday, three Commerce police officers responded to a domestic disturbance call at a home in the 100 block of Ashford Lane, GBI spokesman Scott Dutton said.\nA man answered the door and told the officers to come inside and detain his son, authorities said.\nInside the home, officers searched the home and found Joseph Noel hiding in the attic, Dutton said.\nOfficers issued verbal commands, but Noel held up the object and refused to comply with their instructions, the GBI said.\n“During the verbal exchange,” Dutton said, “Noel charged the officers and the officers deployed a Taser and fired shots, striking him” in the leg.\nNoel was taken to Athens Regional Medical Center, where he later died.\nDutton said the GBI Medical Examiner’s Office will perform an autopsy. The GBI is investigating the incident, which is standard protocol in officer-involved shootings.\nOnce the GBI’s investigation is complete, the case will be turned over to the Jackson County District Attorney’s Office, Dutton said.\nCommerce is nearly 70 miles northeast of Atlanta.","url":"https://www.ajc.com/news/crime--law/gbi-police-officers-shoot-kill-man-northeast-georgia/77iXEibVQS6aoUIUubkyCI/"}
