{"authors":["Sian Boyle For The Daily Mail"],"date_download":"2018-10-22 21:35:23","date_modify":"2018-10-22 21:35:23","date_publish":"2016-01-11 00:58:55","description":"GCSE pupils will be taught that some of the UK’s earliest inhabitants were Africans who arrived before the English, as part of a history syllabus. Some have called this 'pro-immigrant propaganda'","filename":"data/vaneerConsumption/GCSElessonsaboutAfricansinBritaincalledproimmigrationpropaganda.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/1CB8439300000578-0-image-a-24_1452473798239.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393189_Plans-teach-GCSE-pupils-Africans-came-Britain-English-branded-pro-immigration-propaganda-critics_1540244123.html","title":"GCSE lessons about Africans in Britain called 'pro-immigration propaganda'","title_page":"GCSE lessons about Africans in Britain called 'pro-immigration propaganda' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Plans to teach children about claims that Africans arrived in Britain before the English have provoked uproar and were denounced as ‘pro-immigration propaganda’.\nGCSE pupils will be taught that some of our country’s earliest inhabitants were Africans who arrived here before English people, as part of a history syllabus offered by the Oxford and Cambridge examination board (OCR).\nThe course, Migration To Britain c. 1,000 to c. 2010, will be offered to thousands of history students throughout England from September.\nGCSE pupils will be taught some of Britains’s earliest inhabitants were Africans who arrived before the English\nOne of the key texts on the course reading list is the 1984 book Staying Power: The History of Black People in Britain, by English Marxist writer and journalist Peter Fryer.\nThe Mail on Sunday reported that in the book Mr Fryer writes: ‘There were Africans in Britain before the English came.’\nHe refers to a Roman legion of North Africans briefly stationed on Hadrian’s Wall in the 3rd Century, before the arrival of Anglo-Saxons.\nUp to 500 ‘Aurelian’ Moors – named in honour of Emperor Marcus Aurelius, popularised in the film Gladiator – manned a fort near Carlisle. But there is no evidence they ever settled there.\nThe course literature states that: ‘This course will enable students to learn how the movement of people – European, African, Asian – to and from these islands has shaped the story of this nation for thousands of years.’\nIts creators claim the course addresses the ‘white male-dominated’ view of history – but it has outraged some of Britain’s most eminent thinkers.\nThe course was created with academics from the Black and Asian Studies Association but has been condemned as ‘pro-immigration propaganda’ at a time when the subject is especially sensitive.\nBooker and Nobel prize-winning novelist V.S. Naipaul told the Mail on Sunday: ‘Once again political correctness is distorting our history and the education of our children.’\nAnd historian Sir Roy Strong, author of The Story Of Britain, said: ‘This stands history on its head, projecting back on to the past something that isn’t true.’\nCampaign for Real Education chairman Chris McGovern said: ‘The country is being sold down the river by the politically correct brigade and national identity sacrificed for minority groups to feel included. It’s pro-immigration propaganda.’\nThe creators of the course claim the class will address the ‘white male-dominated’ view of history, but some are calling it 'pro-immigration propaganda'\nBut Professor Mark Ormrod, of York University, one of the historians researching the new topic, said: ‘It is an outstanding example of how a long view of history helps us to understand and to find a place for ourselves in contemporary society.\n‘Our research project shows how, for example, in the late Middle Ages, no one was more than ten miles from an immigrant.’\nMike Goddard, head of history at OCR, told the Mail on Sunday: ‘There is no political bias. The GCSE will present facts. It is not pushing any particular argument.’\nAnd Martin Spafford, of BASA’s education committee, stressed that ‘students will hear both positive and negative views about migration. It’s been a controversial subject and we don’t shy away from that’.","url":"https://www.dailymail.co.uk/news/article-3393189/Plans-teach-GCSE-pupils-Africans-came-Britain-English-branded-pro-immigration-propaganda-critics.html"}
