{"authors":[],"date_download":"2018-10-30 14:08:28","date_modify":"2018-10-30 14:08:28","date_publish":"2018-10-30 09:26:29","description":"The Georgia Department of Transportation has opportunities across the state for service providers to...","filename":"data/vaneerConsumption/GDOTsupportedfundingprogramhiringveterans.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23303181_GDOT-State-Supported-Funding-Program.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gdot-supported-funding-program-hiring-veterans__1540908508.html","title":"GDOT supported funding program hiring veterans","title_page":"GDOT supported funding program hiring veterans","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia Department of Transportation has opportunities across the state for service providers to participate in a variety of transportation-related routine maintenance projects. The GDOT State Supported Funding Program (SSFP) will hold a breakfast specifically targeting veterans 10 a.m. to noon Nov. 7 at the GDOT District 1 office, 1475 Jesse Jewell Parkway, Suite 100 in Gainesville.\nDuring this event, attendees will learn about the certification process, as well as the resources and opportunities available to Veteran-owned small businesses. Participants will have an opportunity to meet GDOT’s EEO District Officer and the GDOT District Engineer. A light breakfast will be served.\n“Georgia DOT wants to do business with small businesses,” said Georgia DOT Director of Equal Employment Opportunity Kimberly King. “That’s why we’re traveling across Georgia to reach out to small business owners and disadvantaged business enterprises (DBEs) about the routine maintenance projects planned in their districts. We will discuss the projects, how to become qualified to participate as a vendor, how to register for notifications about opportunities and a lot more.”\nInformation: Anthony Miles at amiles@mhm-cpa.com or 678-420-5500. Register here: www.tinyurl.com/GDOTVeterans.","url":"https://www.ajc.com/news/local/gdot-supported-funding-program-hiring-veterans/9V7RLOMG3d2PUyYYblaTxL/"}
