{"authors":[],"date_download":"2018-10-30 18:35:26","date_modify":"2018-10-30 18:35:26","date_publish":"2016-10-06 17:01:00","description":"George H. Bell, 50, of Lithonia was sentenced to four and a half years for allowing 2,600 truckloads of “unsuitable” dirt to be dumped.","filename":"data/vaneerConsumption/GDOTofficialwhotookbribesinDeKalbsentenced.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/06/Images/dump%20truck.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gdot-official-wh_dfeeaec25ce49b50bd02406c1cd4c447__1540924526.html","title":"GDOT official who took bribes in DeKalb sentenced","title_page":"GDOT official who took bribes in DeKalb sentenced","title_rss":"NULL","source_domain":"ajc.com","text":"A now-former Georgia Department of Transportation foreman who took bribes and caused $1.5 million in environmental damage in DeKalb is headed to federal prison.\nGeorge H. Bell, 50, of Lithonia was sentenced to four and a half years for allowing 2,600 truckloads of “unsuitable” dirt to be dumped at GDOT sites across the county, according to the U.S. Attorney’s Office in Atlanta.\nThe dirt came from construction sites worked by The Dirt Company and contained nails, concrete and asphalt fragments and metal, a news release said. Some ended up in a protected wetland and in Stone Mountain Lake.\n>>RELATED: Jury convicts 3 executives in DeKalb County bribery case\nU.S. Attorney John A. Horn said Bell, who worked for GDOT for 15 years, took $15,000 in bribes in 2014.\n“Bell’s greed and willingness to compromise the trust of his public office has left all Georgians with environmental damage and a clean-up tab of more than $1.5 million,” Horn said.\n>>RELATED: DeKalb murderer who fled court arrested in South Carolina\n-\nLike DeKalb County News Now on Facebook | Follow us on Twitter and Instagram","url":"https://www.ajc.com/news/local/gdot-official-who-caused-environmental-damage-across-dekalb-sentenced/lFrQLJ66W196FkPoPm2sLP/"}
