{"authors":["Associated Press"],"date_download":"2018-10-23 01:53:43","date_modify":"2018-10-23 01:53:43","date_publish":"2016-01-29 16:04:56","description":"EVENDALE, Ohio (AP) — GE Aviation is cutting 238 engineering jobs in southwestern Ohio and 69 at other U.S. sites as it trims more than 7 percent of its engi...","filename":"data/vaneerConsumption/GEAviationcuttingmore7percentofengineeringworkforce.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422829_GE-Aviation-cutting-7-percent-engineering-workforce_1540259623.html","title":"GE Aviation cutting more 7 percent of engineering workforce","title_page":"GE Aviation cutting more 7 percent of engineering workforce | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GE Aviation cutting more 7 percent of engineering workforce\nEVENDALE, Ohio (AP) — GE Aviation is cutting 238 engineering jobs in southwestern Ohio and 69 at other U.S. sites as it trims more than 7 percent of its engineering workforce.\nA spokesman for the General Electric Co. unit based in the Cincinnati suburb of Evendale said Thursday that the cuts are not due to any decline in business.\nNo jobs will be affected in the Dayton-area, but sites in West Chester Township will be affected by reductions, said spokesman Rick Kennedy.\nKennedy said the cuts are necessary as the company's new jet engines move from development and testing to production. He said the company is unable to maintain its current level of more than 4,300 engineers in the United States.\nAffected engineers will receive severance benefits and continue getting wages and medical coverage for an amount of time based on how long they've worked at the company, he said.\nNotifications will begin at the end of January.\nGE Aviation still will employ more than 3,000 engineers in the area after the cuts and has offered voluntary early retirement to several hundred eligible engineers, Kennedy said.\n\"Significant effort has been made to move as many engineers as possible to other positions at GE Aviation and other GE businesses,\" he said.","url":"https://www.dailymail.co.uk/wires/ap/article-3422829/GE-Aviation-cutting-7-percent-engineering-workforce.html"}
