{"authors":[],"date_download":"2018-10-22 21:22:25","date_modify":"2018-10-22 21:22:25","date_publish":"2014-05-06 23:34:22","description":"A special police escort managed to coax a family of geese off of the interstate Tuesday.","filename":"data/vaneerConsumption/GeeseCrossingFeatheredFamilyGetsPoliceEscort.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_geese-crossing-feathered-family-gets-police-escort-n98706_1540243345.html","title":"Geese Crossing: Feathered Family Gets Police Escort","title_page":"Geese Crossing: Feathered Family Gets Police Escort","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA special police escort managed to coax a family of geese off of the interstate Tuesday.\nSeven geese -- two adults and five goslings -- were walking along the side of the I-80/94 followed by two police cruisers and a tow truck.\nA couple of good Samaritans in vehicles initially provided an escort for the family of geese until police showed up.\nThe birds headed west and crossed the Illinois state line into Lansing, approaching the Wentworth Bridge.\nThe goslings, which cannot fly, were occasionally ducking into traffic in the left lane, creating several close calls with passing vehicles.\nPolice closed the interstate temporarily and guided the geese into the right lane.\nPolice blocked the geese just past Wentworth Avenue at a turnaround on the shoulder.\nThe geese were then guided off the highway into an adjoining neighborhood and appeared to be acclimating well to their new surroundings, although not staying away from local roads.\nThe situation caused extensive traffic backups in the area, according to Sky 5's Mike Lorber.","url":"https://www.nbcnews.com/news/us-news/geese-crossing-feathered-family-gets-police-escort-n98706"}
