{"authors":["Genevieve Van Voorhis"],"date_download":"2018-10-31 01:46:00","date_modify":"2018-10-31 01:46:00","date_publish":"2018-08-27 19:45:53","description":"If you've been keeping up with So You Think You Can Dance Season 15, which airs Monday nights at 8 p.m. E.T. on Fox, then you've probably noticed that there's one pair that seems to go together together like Travis Wall and a soulful, romantic…","filename":"data/vaneerConsumption/GenessySlaviksInstagramsShowThatTheSoYouThinkYouCanDancePairHaveMoreInCommonThanJustSmoothMoves.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/bf4742b9-1d01-490b-9d21-a4060b81d3de-screen-shot-2018-08-27-at-65239-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_genessy-slaviks-instagrams-show-that-the-so-you-think-you-can-dance-pair-have-more-in-common-than-just-smooth-moves-10249153_1540950360.html","title":"Genessy & Slavik’s Instagrams Show That The ‘So You Think You Can Dance’ Pair Have More In Common Than Just Smooth Moves","title_page":"Genessy & Slavik’s Instagrams Show That The ‘So You Think You Can Dance’ Pair Have More In Common Than Just Smooth Moves","title_rss":"NULL","source_domain":"bustle.com","text":"If you've been keeping up with So You Think You Can Dance Season 15, which airs Monday nights at 8 p.m. E.T. on Fox, then you've probably noticed that there's one pair that seems to go together together like Travis Wall and a soulful, romantic contemporary routine. Yes, I'm talking about dynamic duo Slavik and Genessy, who have been charming audiences and the judges since they first partnered up. While the pair have major chemistry that has caused the fandom to wonder whether they're an item, the partners insist they're just friends. The young dancers didn't meet until filming the show, but Slavik and Genessy's Instagram posts show that this modern Fred and Ginger actually have even more in common than you might have thought.\nSlavik Pustovoytov, born in the Ukraine and raised in the US, is just 19 years old. Originally a hip hop and freestyle dancer, as he showcases on his Insta, Slavik has managed to pick up choreography and always make it look effortless and cool. Part of that is thanks to his talented partner, Genessy. Genessy Castillo is just 18, herself. She grew up in Jamaica, Queens, and is trained in contemporary dance, along with multiple other styles, as she shows on her Instagram.\nWhile these two might not be an official couple, it makes sense they get along so darn well on So You Think You Can Dance. According to their respective Instagrams, these platonic friends actually have a ton in common.\nThey Both Belong To The Class Of 2017\nLast June, both Slavik and Genessy shared pics of themselves and their friends clad in caps and gowns at their respective high school graduations. Genessy attended Fiorello H. Laguardia High School of Music and Performing Arts in NYC, while Slavik went to Stillwater High in Oklahoma.\nThey've Both Been Dancing At An Elite Level For A While\nGenessy shared this clip of her smashing a contemporary routine as part of the Tremaine Dance Convention, a premiere program of master classes and competitions for dancers. Slavik shared a video of him competing in a dance battle behind the scenes at World of Dance, another master class program that partners with the NBC TV series of the same name.\nThey Both Practice A LOT\nYou don't get to be as good as Slavik and Genessy without putting in many hours of hard work. Both of them frequently share vids of themselves hard at work in the studio (Genessy) or strip malls/empty rooms/the great outdoors (Slavik).\nThey Love Hanging Out With Their Friends\nFor all their talent, Slavik and Genessy are just teenagers, after all, so it's pretty darn cute that they still want to share grainy snapshots of themselves messing around with their friends, in between all the gorgeous vids of them stepping and twisting into mind-boggling shapes.\nThey're Not Above Posting A Good Mirror Pic\nI mean, it's not exactly surprising that these guys aren't shy about uploading a mirror selfie, which is arguably the most confidant of all selfies. This shot of Slavik makes me suspect that either sorcery or photoshop is at work here. Either way, I'm impressed.\nThey Dance Well With Others\nSlavik and Genessy might be tailor-made for one another, but that doesn't mean they aren't pretty close to perfect when they dance with others, too. Slavik shared a video of him freestyling with SYTYCD Season 10 winner, Fik-Shun, and they're both charming as heck. Genessy shared a short clip of her and some other young lady dancers doing what can only be described as The Wave, but with legs. Tens, tens, tens across the board!\nAfter just a few weeks of dancing together, Slavik and Genessy are pushing Kate and Leo status. Pretty much every move they make has their fans falling more and more in love with them. As SYTYCD Season 15 winds toward its end, definitely keep an eye on their respective Instas — or maybe even an official combined one?? — after the show to see if these two continue to bless the world with that Slenessy sauce. My guess is that they definitely will.","url":"https://www.bustle.com/p/genessy-slaviks-instagrams-show-that-the-so-you-think-you-can-dance-pair-have-more-in-common-than-just-smooth-moves-10249153"}
