{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:54:37","date_modify":"2018-10-30 17:54:37","date_publish":"2016-08-11 13:47:36","description":"U.S. troops fighting the Islamic State alongside their Afghan counterparts were forced to leave behind military equipment last month.","filename":"data/vaneerConsumption/GeneralAfghanIslamicStateForcedUSTroopstoAbandonWeapons.json","image_url":"https://media.breitbart.com/media/2016/08/US-soldiers-abandoned-gear-to-ISIS-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_11__1540922077.html","title":"General: Afghan Islamic State Forced U.S. Troops to Abandon Weapons","title_page":"General: Afghan Islamic State Forced U.S. Troops to Abandon Weapons","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. troops fighting the Islamic State alongside their Afghan counterparts in eastern Afghanistan were forced to leave behind military equipment and weapons, along with the identification cards of a fellow soldier, when they came under fire last month, according to Gen. Charles Cleveland, an American military spokesman.\nGen. Cleveland’s explanation came after Afghanistan Times quoted another U.S. military spokesman, Cmdr. Ron Flesvig, as saying, “No weapons [were] captured at all,” referring to the confrontation, which took place in July in eastern Afghanistan’s Nangarhar province, a stronghold of the Islamic State branch in the region, known as the Khorasan province (IS-KP/ISIL-K).\nDespite President Barack Obama declaring an end to America’s combat mission in Afghanistan in December 2014, U.S.-backed Afghan troops recently launched an offensive against ISIL-K in Nangarhar, which lies along the Pakistan border.\nThe military equipment and some weapons abandoned by U.S. troops reportedly fell into the hands of ISIL-K jihadists.\nLas Saturday, ISIL-K disseminated photographs of the I.D. cards belonging to a U.S. Army soldier (SPC Ryan Larson), a rocket launcher, grenades, ammunition, and encrypted radio in addition to other military equipment, saying they had captured all of it.\n#ISIS ‘Amaq posted photos of documents and gear of #American soldiers allegedly taken by ISIS fighters in #Nangarhar pic.twitter.com/UDat7qOFvX — SITE Intel Group (@siteintelgroup) August 6, 2016\nAlthough Flesvig denied that weapons had been seized by ISIL-K, Gen. Cleveland now says in a statement:\nWe have been able to determine that the I.D. card and most of the pictured equipment was lost during recent operations in southern Nangarhar. The soldiers were involved in actions at a temporary collection point for casualties (referred to as a casualty collection point, or CCP). CCPs are a standard aspect of every operation. In this case, the CCP came under effective enemy fire. As a result, the CCP was moved to a safer location. In the course of moving the CCP to a safe location, some equipment was left behind.\nThe general denied that ISIL-K overran any U.S. positions or personnel.\n“For understandable reasons, the lives of soldiers were not put at risk to recover the equipment,” he noted, adding, “To protect the privacy of those involved, we won’t comment on any specific injuries. And, in an effort to protect capabilities, we won’t discuss the specifics of any of the equipment pictured.”\nReuters notes, “Despite the sensitive nature of some of the items, Cleveland said he did not expect there would be ‘any measurable operational impact’ from the loss.”\nThe general did not explicitly say when in July the fight took place.\nHowever, the U.S. military revealed that five American troops had been wounded during the operation against ISIL-K in Nangarhar on July 24 and 25, noting that none of the injuries were life-threatening.\n“Our combat mission in Afghanistan is ending and the longest war in American history is coming to a responsible conclusion,” declared President Obama in December 2014.\nAlthough he vowed to end the war, Obama has stepped up operations in recent months, granting the U.S. military greater authority to combat the Taliban and the ISIL-K.\nHe has also increased the U.S. military footprint by at least 350 service members, from 8,850 as of the end of February to about 9,200 as of May 31, 2016, according to the U.S. Special Inspector General for Afghanistan Reconstruction (SIGAR), an oversight agency.\nThe President plans to maintain about 8,700 troops into 2017. U.S.-backed troops have been recently successful against ISIL-K and Taliban jihadists, killing hundreds of them, including key leaders.","url":"https://www.breitbart.com/national-security/2016/08/11/general-afghan-islamic-state-forced-u-s-troops-abandon-weapons/"}
