{"authors":["Alwyn Scott","Rachit Vats"],"date_download":"2018-10-30 23:16:40","date_modify":"2018-10-30 23:16:40","date_publish":"2018-07-20 00:00:00","description":"The conglomerate earned an adjusted $0.19 a share on revenue of $30.1 billion — both ahead of estimates.","filename":"data/vaneerConsumption/GeneralElectricprofitplunges28amidweaknessinpowerrenewablebusinesses.json","image_url":"https://amp.businessinsider.com/images/5b33d78b1ae6621d008b5868-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_general-electric-profit-plunges-28-amid-weakness-in-power-renewable-businesses-2018-7_1540941400.html","title":"General Electric profit plunges 28% amid weakness in power, renewable businesses","title_page":"    General Electric profit plunges 28% amid weakness in power, renewable businesses - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"General Electric Chairman & CEO John Flannery is interviewed on the floor of the New York Stock Exchange. AP/Richard Drew\n(Reuters) - U.S. industrial conglomerate General Electric Co reported a 28 percent drop in quarterly profit on Friday, as weakness in its power and renewables businesses offset gains in its aviation, oil and gas and healthcare units.\nEarnings from continuing operations attributable to GE shareholders fell to $736 million, or 8 cents a share, in the second quarter ended June 30, from $1.03 billion, or 12 cents a share, a year earlier. Total revenue rose to $30.1 billion from $29.1 billion.\nOn an adjusted basis, which excludes certain pension and restructuring costs, GE earned 19 cents a share, down from 21 cents a year ago.\nAnalysts had expected GE to post adjusted earnings of 17 cents a share, according to Thomson Reuters I/B/E/S, and had cut their estimates after weak first-quarter results.\nAnalysts also were looking for higher cash flow to convince them that GE can hit its adjusted free cash flow target of $6 billion to $7 billion for the year. Adjusted free cash flow from industrial activities swung to a positive $258 million in the quarter from a negative $1.7 billion in the first quarter.\nGE affirmed its full-year adjusted EPS target of $1.00 to $1.07 a share, but cut its annual cash target to $6 billion.\n(Reporting by Alwyn Scott in New York and Rachit Vats in Bengaluru; Editing by Saumyadeb Chakrabarty and Nick Zieminski)","url":"https://www.businessinsider.com/general-electric-profit-plunges-28-amid-weakness-in-power-renewable-businesses-2018-7"}
