{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 20:36:07","date_modify":"2018-10-30 20:36:07","date_publish":"2016-07-19 11:45:05","description":"\"We have become the best enemy and the worst friend-and that has to stop,\" said Army Lt. Gen Michael T. Flynn, who retired from a 30-year career as the director of the Defense Intelligence Agency. | Politics","filename":"data/vaneerConsumption/GenFlynntoGOPDelegatesWakeUpAmerica.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-577295444.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_19__1540931767.html","title":"Gen. Flynn to GOP Delegates: Wake Up America!","title_page":"Gen. Flynn to GOP Delegates: Wake Up America! | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Retired three-star general Michael Flynn provides GOP convention goers with a harsh assessment of America’s national security posture.\n“We have become the best enemy and the worst friend-and that has to stop,” said Army Lt. Gen Michael T. Flynn, who retired from a 30-year career as the director of the Defense Intelligence Agency.\n“I am here tonight as a determined America, who loves our country and my message to you is very clear: Wake Up America!”\nTerrorists are at war with America and her allies, he said.\n“I am certain–I am deadly certain that we cannot win this war unless we are free to cal our enemy by name: Radical Islamicists and failed tyrants,” he said.\nDespite being a former adviser to President Barack Obama, Flynn says he never met with the president. But, “because of Obama’s ill-advised actions, the world has lost American leadership.”\nThreats are mounting, the general said.\nIn addition to the rising powers of China and Russia, America is faced with an unready military, demoralized allies and a struggling economy, he said.\nThere is a loss of confidence in and respect for America around the world, he said.\nA week ago, Flynn was on the short list for the vice-president slot on the ticket. He remains an adviser to Trump.\n“These next four years, these next for years, will be consumed by the perils that we now face,” he said.\nGiven the problems America is facing, Flynn said, Americans need to elect Trump.\n“I promise you, I promise you that Donald Trump knows, Donald Trump knows that the primary role of the president is to keep us safe,” he said.\n“Donald Trump’s leadership, decision-making and problem solving will restore America’s role as the undeniable and unquestioned world leader.”","url":"https://www.breitbart.com/politics/2016/07/19/gen-flynn-gop-delegates-obama-america-became-best-enemies-worst-friends/"}
