{"authors":[],"date_download":"2018-10-22 21:19:28","date_modify":"2018-10-22 21:19:28","date_publish":"2014-05-06 22:01:05","description":"An analysis of research papers suggests that biologists are biased toward studying male genitalia due to outdated assumptions about male dominance.","filename":"data/vaneerConsumption/GenitaliaGapBiologistsPreferthePenisButWhy.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/424691/140506-genital_eed48a9306dcb896cfb0e13f8417c513.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_genitalia-gap-biologists-prefer-penis-why-n98661_1540243168.html","title":"Genitalia Gap: Biologists Prefer the Penis - But Why?","title_page":"Genitalia Gap: Biologists Prefer the Penis - But Why?","title_rss":"NULL","source_domain":"nbcnews.com","text":"She and her colleagues considered other explanations — for example, that a male's protruding parts are generally easier to study than the female inner parts, or that there's more variation in male genitals — but they found no correlation with those factors. They even checked whether researchers preferred to study their own gender, but found that the bias toward male genitalia applied to papers written by women as well as by men.\nIn a pair of papers published a decade ago, biologists said more attention needed to be paid to the role of females in sexual dynamics — but the latest study found that the male bias has become stronger in recent years.\nMenno Schilthuizen, a zoologist at the Naturalis Biodiversity Center in the Netherlands, said he thinks Ah-King and her fellow critics are on to something. \"I've been asking the same question over the past few days,\" he told NBC News.\nSchilthuisen, who has just come out with a book about the biology of sex titled \"Nature's Nether Regions,\" said the preference may well be due in part to the perceived importance of particular parts. \"That's certainly true in the medical field,\" he said. \"In one medical encyclopedia, there's a whole chapter on the penis, and a paragraph on the clitoris.\"\nSo, to paraphrase Sigmund Freud, what do biologists want? \"We think that this analysis can increase the awareness of gender bias and its impeding effects on research, and thereby enable a broadened understanding of genital evolution in the future,\" Ah-King said.\nSchilthuisen agreed: \"Being aware of it is part of the remedy.\"\nIn addition to Ah-King, the authors of \"Genital Evolution: Why Are Females Still Understudied?\" include Andrew Barron and Marie Herberstein. They selected the studies to analyze by searching through the Web of Science database for relevant search terms, then weeding out hundreds of papers that did not focus on original research into the evolution of genitalia. Check \"Literature Analysis Methods\" in the PLOS Biology paper for details.","url":"https://www.nbcnews.com/science/weird-science/genitalia-gap-biologists-prefer-penis-why-n98661"}
