{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-23 02:52:07","date_modify":"2018-10-23 02:52:07","date_publish":"2017-04-26 14:08:33","description":"Channel Nine's Amber Sherlock became known around the world after her infamous jacketgate meltdown for not wanting her colleagues to also be dressed in white.","filename":"data/vaneerConsumption/GeogiaLoveposeswithAmberSherlockmockingjacketgate.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F9DB000000578-0-image-a-85_1493209260313.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447676_Geogia-Love-poses-Amber-Sherlock-mocking-jacketgate_1540263127.html","title":"Geogia Love poses with Amber Sherlock mocking jacketgate","title_page":"Geogia Love poses with Amber Sherlock mocking jacketgate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Channel Nine's Amber Sherlock became known around the world after her infamous jacketgate meltdown for not wanting her colleagues to also be dressed in white.\nAnd The Bachelorette's Georgia Love couldn't help but poke fun when the pair ran into each other at The Logies on Sunday both in white frocks.\nGeorgia, a fellow journalist, posed with Amber in a hilarious snap, before applauding her attitude: 'Good on you for being able to have a laugh about #jacketgate @ambersherlock9 and for still rocking white.'\nScroll down for video\n'Good on you for being able to have a laugh about #jacketgate': Geogia Love posts hilarious snap with Amber Sherlock at The Logies in white frocks mocking her infamous meltdown\nThe shocking leaked exchange of Amber asking her colleague Julie Snook to change into a jacket to avoid BOTH wearing white fast became the butt of many TV and internet jokes and memes around the world.\nThe pair were both arrived at the TV night of nights in elegant white gowns, later bumping into each other inside the function.\nThe brunette beauties posed together side-by-side, with Georgia uploading a collage comparison with and without a black jacket.\n'One of you is going to have to put a jacket on...': The brunette beauties posed together side-by-side in their white gowns, with Georgia uploading a collage comparison with and without a black jacket, presumably her boyfriend Lee Elliott's\nGeorgia captioned the post: 'One of you is going to have to put a jacket on...'\nThe quote was in reference to Amber's original statement in the leaked footage from Nine's The Chatroom.\nIt appears Gerogia was able to recreate the moment in the hilarious snap by using her boyfriend Lee Elliott's suit jacket as a prop.\nLeaked: The leaked footage showed her demanding Julie put on a jacket so the two women were not both wearing white on screen\nFeud: Julie defended herself in the video, insisting she did not have time to change out of her outfit, but Amber refused to back down, replying: 'Come on I told you two hours ago'\nIn a massive tell-all interview with The Daily Telegraph in March, the Nine News reporter admitted she 'possibly overreacted,' after getting upset at Julie for wearing the same colour outfit, before citing stress, tiredness and the hot weather in defense of her actions.\n'I am the first to put up my hand and say that for whatever reason — I was stressed, I was tired, I possibly overreacted, there are better ways to deal with it,' she admitted.\nThe journalist also claimed the high-pressure news environment meant the presenters didn't get a chance to talk anything through.\n'Julie was fine with it, I was fine with it. Everyone has their opinions, but if you look at the tape, I feel everyone massively overreacted,' she explained.\n'I asked you specifically not to wear fuchsia. You need to put a jacket on': At the Logies, hosts The Project's Peter Helliar and Offspring's Kat Stewart poked fun at the Channel Nine reporter's infamous meltdown on stage\nDespite insisting the media attention and coverage was overblown, Amber has become the direct target of many 'jacketgate' related parodies and jokes.\nAt the Logies, hosts The Project's Peter Helliar and Offspring's Kat Stewart poked fun at the Channel Nine reporter's infamous meltdown on stage.\nThe pair came out on stage in identical bright purple ensembles - Kat in an off the shoulder dress and Peter in a suit, shirt and bow ties in the same garish colour.\nAs they began to present their award, Peter interrupted Kat, saying: 'I'm sorry, I'm sorry, you need to change, can we get wardrobe, can we get wardrobe, I asked you two hours ago, I asked you specifically not to wear fuchsia. You need to put a jacket on.\n'I've been flat out, I haven't had time,' Kat retorted as the camera panned to Amber who was sitting in the crowd.\nWhile she forced a smile, the 41-year-old appeared slightly upset about the skit before letting out a small chuckle.\nLaughing it off: While she forced a smile, the 41-year-old appeared slightly upset about the skit before letting out a small chuckle\nMeanwhile, Georgia also took to social media to dote over her Logies date and beau Lee Elliott, who was dressed in a suave suit for the evening.\nShe tagged Lee and wrote: 'The best red carpet accessory any girl could dream of having on her arm.'\nThe pair have been inseparable since finding love on The Bachelorette last year.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447676/Geogia-Love-poses-Amber-Sherlock-mocking-jacketgate.html"}
