{"authors":[],"date_download":"2018-10-30 14:25:16","date_modify":"2018-10-30 14:25:16","date_publish":"2018-08-08 17:51:00","description":"Twin brothers from Hall County described by federal authorities as career offenders are headed back...","filename":"data/vaneerConsumption/Georgiatwinsreturningtoprisonondrugconvictions.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/04/11/Images/KemecaKecole.JPG_web.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_georgia-twins-returning-prison-drug-convictions__1540909516.html","title":"Georgia twins returning to prison on drug convictions","title_page":"Georgia twins returning to prison on drug convictions","title_rss":"NULL","source_domain":"ajc.com","text":"Twin brothers from Hall County described by federal authorities as career offenders are headed back to prison for the second time in four years on drug convictions.\nKecole and Kemeca Dukes, 41, of Gainesville, were sentenced Tuesday after officials said they conspired to sell crack cocaine on multiple occasions to informants for the Hall County Multi-Agency Narcotics Squad and the Bureau of Alcohol, Tobacco, Firearms and Explosives.\nConvictions in Hall County in 2011 sent the twins to prison until 2014. Less than a year later, “both brothers were back to selling crack cocaine,” according to U.S. Attorney Byung J. \"BJay\" Pak.\nFrom August 2015 to October 2016, Kemeca Dukes was the primary contact and sold drugs to informants 10 times, officials said. Kecole Dukes provided the drugs on three occasions and acted as a lookout for his brother during drug exchanges, according to Pak.\nThey were arrested in 2016 and convicted in March.\nMORE: Georgia twins convicted of distributing crack cocaine\nKecole Dukes was sentenced to eight years in prison after a jury found him guilty of three counts of distributing crack cocaine as well as an additional count of conspiring to possess with intent to distribute at least 28 grams of crack cocaine. Kemeca Dukes was sentenced to seven years and six months for distributing crack cocaine.\n“The Dukes brothers could have chosen a different life path,” Arthur Peralta with ATF said Wednesday in a statement. “Unfortunately, they did not.”\nIn other news:","url":"https://www.ajc.com/news/local/georgia-twins-returning-prison-drug-convictions/JyQZyappgyIiIdvQvxbJQN/"}
