{"authors":["Stephanie Haney For Dailymail.Com"],"date_download":"2018-10-22 22:20:13","date_modify":"2018-10-22 22:20:13","date_publish":"2017-04-26 04:14:40","description":"A Georgia server named Kailyn took it upon herself to give Jamie Mathews Heustess the support she needed when the setting restaurant proved too much for her autistic son, Ian, on Friday.","filename":"data/vaneerConsumption/Georgiamotherofautisticboymovedbynoteserverleft.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/04/3F9BDFEC00000578-0-image-a-33_1493175661687.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446186_Mother-autistic-boy-moved-sweet-note-server-left_1540246813.html","title":"Georgia mother of autistic boy moved by note server left","title_page":"Georgia mother of autistic boy moved by note server left | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A server at the Cracker Barrel in Pooler, Georgia left a sweet note praising Jamie Mathews Heustess's autistic son that moved her to tears after her husband, Chris, had to take the boy home before they could have their meal on Friday.\nAn employee named Kailyn took it upon herself to give Heustess the encouragement she needed when she was already in tears of frustration after the restaurant setting proved too much for her son, Ian.\n'Your child is amazing Mommy. Be strong. Keep your head up,' she wrote on a note attached to Heustess's carryout order. 'You are doing a great job. Have a great night. [heart] Your server, Kailyn.'\nA Georgia server named Kailyn gave Jamie Mathews Heustess (R) the support she needed when the setting restaurant proved too much for her autistic son, Ian (R), on Friday\nHeustess now has the note hanging on her refrigerator at home, for those times when she 'needs to be reminded of the kindness of strangers' and when parenting a child with autism it's just a little bit tougher than usual.\nTheir server had visited their table 'five or six times' to try to get her family's order when she finally told her it would only be a to-go order, Heustess explained in a Facebook post from Friday.\nHer husband had taken Ian home to reduce the stimuli around him, after a long day of karate, awards and shopping.\nHeustess now has the note hanging on her refrigerator at home, for those times when she 'needs to be reminded of the kindness of strangers' and when parenting a child with autism it's just a little bit tougher than usual\n'Our server was gracious and sweet,' Heustess wrote in her post; she said her faith in humanity had been restored after the Cracker Barrel encounter\n'By this time I was crying and having a moment, not because I was embarrassed that my son is autistic, but because he is a good kid and I didn't want anyone to think he was just a spoiled kid being a brat,' Heustess wrote in her post.\n'Our server was gracious and sweet. She said it was not a problem, that she would get my order in quickly.'\nAbout 15 minutes later, Heustess's food was ready and when she went to pay, Kailyn said it had been taken care of.\n'I started crying all over again,' Heustess wrote. 'I asked if she was sure and she reassured me it was taken care of, not to worry.'\nHer tears kept flowing as she walked out of the restaurant. That's when she noticed the piece of paper stapled to the bag holding her dinner was not a receipt like she initially thought.\n'It was something far more precious,' Heustess wrote. It was Kailyn's note.\nHer tears kept flowing as she walked out of the restaurant; That's when she noticed the piece of paper stapled to the bag holding her dinner was not a receipt like she initially thought\n'In the midst of my own meltdown she reached out with words of encouragement and a kind heart. I am very thankful,' she said.\nHeustess later learned that Kailyn had planned to pay for Heustess's meal out of her own tips, but when the store's manager, James, learned of the situation, he took care of the bill.\n'Little did I know this was TRULY a collaboration and work of love between two dedicated employees,' Heustess wrote. 'Their caring and thoughtfulness did not go unnoticed.'\nThey restored Heustess's faith in humanity that day.\nThe full text of her post from Friday can be ready below.\nHeustess later learned that Kailyn had planned to pay for Heustess's meal out of her own tips, but when the store's manager, James, learned of the situation, he took care of the bill\n'I had a good cry walking out of our local Cracker Barrel in Pooler, Ga this evening... I had posted earlier about the trials and adventures of trying to have a dinner out when you have a child with autism. It is truly hit or miss...most days we do ok. After Chris and Ian left, our waitress came to ask if we were ordering. This was probably her 5th or 6th time stopping by the table...I said yes, a to go order, just for me. She asked if my husband or son wanted anything and I said no, my husband took our son home to reduce stimuli around him. I told her Ian was autistic and had had a long day, awards, karate, Wal-Mart.... His breaking point was the Nemo/Dory toy-that was neither of those characters. By this time I was crying and having a moment, not because I was embarrassed that my son is autistic, but because he is a good kid and I didn't want anyone to think he was just a spoiled kid being a brat. Our server was gracious and sweet. She said it was not a problem, that she would get my order in quickly. I sat quietly and made a post to my page about the realities of autism that you never quite know until you experience it. About 15 minutes later, out comes my server with my bag of dinner. She smiled and told me that my dinner had been taken care of, no need for payment. I started crying all over again. I asked if she was sure and she reassured me it was taken care of, not to worry. I cried walking out, sure the other customers and employees thought I was crazy. There was a piece of paper stapled to my bag, I thought it wad the receipt.....no.... it was something far more precious. In the midst of my own meltdown she reached out with words of encouragement and a kind heart. I am very thankful. EDITED TO ADD: Little did I know this was TRULY a collaboration and work of love between two dedicated employees, Kailyn & her manager, James. While she didn't have enough tips to cover right then, she was sure she would by end of shift.... her manager took care of the bill after learning about her actions....She left me the words I needed to hear, that I think EVERY MOM needs to hear. Their caring and thoughtfulness did not go unnoticed...my note from Kailyn is now hanging on my fridge, for those moments I need to be reminded of the kindness of strangers... #CrackerBarrel #SuchABlessing #GreatEmployees #FatihInHumanityRestored.'","url":"https://www.dailymail.co.uk/news/article-4446186/Mother-autistic-boy-moved-sweet-note-server-left.html"}
