{"authors":["Naomi Ackerman","Ciara Farmer For Mailonline"],"date_download":"2018-10-23 05:51:54","date_modify":"2018-10-23 05:51:54","date_publish":"2017-03-16 16:30:10","description":"Marty McKenna, 22, teased fans as he groped his ex-girlfriend and series newbie Sarah Goodhart at a Geordie Shore Radge Academy launch event on Thursday.","filename":"data/vaneerConsumption/GeordieShoresMartyMcKennagropesexSarahGoodhart.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E53A77800000578-0-image-a-99_1489679993520.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320660_Marty-McKenna-gropes-ex-girlfriend-Sarah-Goodhart_1540273914.html","title":"Geordie Shore's Marty McKenna gropes ex Sarah Goodhart","title_page":"Geordie Shore's Marty McKenna gropes ex Sarah Goodhart | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He brought huge drama to Geordie Shore with his playboy antics and turbulent relationship with Chloe Ferry.\nAnd Marty McKenna, 22, teased fans with the suggestion of upcoming intense scenes as he groped his ex-girlfriend and series newbie Sarah Goodhart at a photocall for the MTV series - with Chloe standing just inches away.\nThe full cast gathered in Soho on Thursday to launch Radge Academy, which will see the permanent cast teach the newbies the ropes of life on the MTV show.\nScroll down for video\nCheeky! Marty McKenna, 22, teased fans as he groped his ex-girlfriend and series newbie Sarah Goodhart at a Geordie Shore Radge Academy launch event on Thursday\nChloe, 21, split with Marty just months ago after the long term on/off couple called it quits - as she professed her unrequited love for the hunk in the last season.\nAnd viewers will be wondering what will happen if there is a budding relationship in the new series between her recent flame Marty and his long-term ex girlfriend Sarah.\nOne-time Ex On The Beach star Sarah, who appeared on the dating show as Marty's ex, looked sensational at the Radge Academy launch in a grey marled jumper with her tie and a leather skirt.\nAnd, as they posed for a group snap, Marty and Sarah seemed to hint at a reunion as he snuggled up to her while grasping her assets in a shock display. Chloe was not pictured having noticed the move, but only time will tell.\nSexy: As they posed for a group snap, Marty and Sarah seemed to hint at a reunion as he snuggled up to her while grasping her assets in a shock display\nThey're bo-obsessed! Aaron Chalmers also got in the action as he lurched forth to grab Chloe Ferry's breast\nDramatic: Viewers will be wondering what will happen with Chloe if there is a budding relationship between her recent flame Marty and his long-term ex girlfriend Sarah\nHot stuff: Marty McKenna's ex-girlfriend and one-time Ex On The Beach star Sarah looked sensational in a grey marled jumper with her tie and a leather skirt\nMarty and Chloe had a famously turbulent relationship on Geordie Shore, full of brief moments of passion followed by boozy and often violent bust-ups.\nAnd Chloe arrived at the event looking fabulous as her recent ex - who cruelly dumped her in the last season of Geordie Shore - cosied up to his former ex.\nThe curvy star went for a similarly edgy look as she slipped into a white crop top paired with high-waisted black leggings and a staggering pair of nude heels.\nHot stuff: Marty McKenna's ex-girlfriend and one-time Ex On The Beach star Sarah Goodhart looked sensational in a grey marled jumper with her tie and a leather skirt\nCheeky! Chloe went for a similarly edgy look as she slipped into a white crop top paired with high-waisted black leggings and a staggering pair of nude heels\nSizzling! The long-standing cast member knew how to pose for the cameras\nSarah chose to show an edgier side her preened cohorts, she rocked a nose ring, lip piercing and a thick pair of geek chic style glasses.\nMarty, who shot to fame in the third season of Ex On The Beach in 2015, originally joined Geordie Shore in May last year as a new cast member for the 12th season.\nThe reality star rocked his signature blonde-tipped spiky hairstyle with a white t-shirt and black ripped jeans.\nChaos: They had a famously turbulent relationship on Geordie Shore, full of brief moments of passion followed by boozy and often violent bust-ups\nBetrayal: Though Marty cheated on Chloe, leading to a very public heartbreak, Chloe was not afraid to get her own back after the couple split at the end of last year\nAs she stood alongside the group she posed and pouted while dramatically jutting out her back to best show off her derriere to the cameras awaiting her.\nThough Marty betrayed Chloe with a steamy romance on screen, leading to a very public heartbreak, Chloe was not afraid to get her own back after the couple split at the end of last year.\nThe reality star sought sweet revenge on her party-loving love interest after he enjoyed a number of dalliances with other women by sharing photos hooking up with other men.\nHot stuff: The Lothario put on an extremely cheeky display as he giggled while cupping her cleavage - in hilarious scenes hammed up for the cameras\nAll in together: Chelsea, Eve, Sarah and Abbie (left-right) were joined by fellow newbie and current Ex On The Beach star Zahida Allen\nThe figure skater took to social media as the latest series of Geordie Shore aired, defending her own up and down behaviour.\nChloe explained how hard it had been to watch someone she cared about chasing after other women.\nShe said: 'The main reason why I was kicking off so much was that every single day I woke up wondering what's the day going to bring... what girls will he be going to pull?,' she said.\nShe added: 'End of the story is I liked him and I wanted to be with him, but he didn't want to be with me and that's why I kicked-off, because it hurt us seeing him with other girls.'\nThe boys: Elsewhere fellow hunks Nathan Henry (right) and Aaron Chalmers (third left) were watching on as they launched the new show\nAnother of Chloe's former flames, Scotty T was in attendance looking dashing in a denim jacket as he jokingly grappled with her assets.\nThe Lothario put on an extremely cheeky display as he giggled while cupping her cleavage - in hilarious scenes hammed up for the cameras.\nClearly struggling to keep his hands to himself, Scott also enjoyed a cheeky grope of Chelsea's derriere - in what could be a hint at a new romance.\nWhile other attendees included stalwart Marnie Simpson in a racy nude number and newbies Eve Shannon and Abbie Holborn in sexy schoolgirl outfits.\nLeaving nothing to the imagination: Marnie's outfit skimmed closely over her flat stomach\nHere come the girls: Eve Shannon and Abbie Holborn (left-right) went for matching ensembles comprising of racy mini skirts and cropped shirts","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320660/Marty-McKenna-gropes-ex-girlfriend-Sarah-Goodhart.html"}
