{"authors":[],"date_download":"2018-10-30 21:53:13","date_modify":"2018-10-30 21:53:13","date_publish":"2018-07-02 20:57:00","description":"With Congress taking a look at an overhaul of the Endangered Species Act, we wondered, which animals...","filename":"data/vaneerConsumption/Georgiasendangeredspecieslistisamostlyslimybutimportantone.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/02/Images/interrupted-rocksnail%20%20Photo%20by%20Tom%20Tarpley,%20Alabama%20Department%20of%20Conservation%20and%20Natural%20Resources.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_georgia-endan_899b701f42fb3fa9f67cb063e74fbd94__1540936393.html","title":"Georgia’s endangered species list is a mostly slimy but important one","title_page":"The health of Georgia's endangered species is an ecological barometer","title_rss":"NULL","source_domain":"ajc.com","text":"With Congress taking a look at an overhaul of the Endangered Species Act, we wondered, which animals in Georgia could be impacted?\nFluffy squirrels? Hardly. Adorable raccoons? No. Cuddly bunnies? Please.\nThe list, provided by the US Fish and Wildlife Service's Southeast Region, is far more slimy. (Here’s the whole thing). Of the 33 critters officially deemed as endangered in Georgia, 18 have neither fur nor feathers .. not even a face. They are mussels.\nThe Georgia pigtoe and the Cumberland monkey-face pearly mussel, which sound way cuter than they are, and the shinyrayed pocketbook, which is indeed pretty stylish, all make the list. Two types of sea turtle, including the fetching Kemp’s ridley, and the handsome red-cockaded woodpecker also make the roster but then we’re back to more mussels, not to mention the reticulated salamander and interrupted rocksnail. *Shudder.*\nIn seriousness, the mollusks that comprise the majority of Georgia’s endangered species play an ecologically significant role and state of their health can be seen as a broader environmental barometer state and region-wide.\n“Save the pigtoe,” reads a poster created by University of Florida students to our south, who are working with the Alachua Conservation Trust.\n“The oval pigtoe is a good indicator of overall stream health, and where they are, the river is probably in good condition,” Chris Burney, project manager at Alachua Conservation Trust, told WUFT. “And where they’re absent, it means we’ve probably heavily impacted the area.”\nThe rocksnail needs clean, flowing water to survive. Photo: Paul Johnson, Alabama Department of Conservation and Natural Resources\nDevelopment that dumps sentiment into waterways is often to blame, he added: “They get choked to death basically. The dirt just piles up on them.”\nNext door in Alabama, the rocksnail needs clean, flowing water to survive, said Paul Johnson, director of the Alabama Aquatic Biodiversity Center with the Alabama Department of Conservation and Natural Resources. Agricultural runoff is a threat, he said.\nRELATED: Here’s the latest in the ongoing water wars that pit Florida and Alabama against Georgia\nEnvironment and Public Works Committee Chairman John Barrasso, a Wyoming Republican, is the politician on point for the potential redo of the Endangered Species Act. The aim is to give states more flexibility, he says, although environmental advocates fear weakened protections.\nIt’s not a new or entirely partisan effort. Last year, as a federal court lifted federal protections for gray wolves, a Democrat from Minnesota said the law had prevented farmers from taking action even against wolves that attacked their pets or livestock.\n\"The states, not the federal government, are best equipped to manage their gray wolf populations by balancing safety, economic and species-management issues,\" U.S Rep. Collin Peterson said at the time.\nA ﻿2015 poll commissioned by Defenders of Wildlife and Earthjustice ﻿found strong support for the Act, something activists are eager to cite as politicians ponder change.\n“While nine out of 10 Americans want to protect endangered species and their habitat, Congressional leaders are spending their time dismantling the ESA in favor of special interests,\" Jamie Rappaport Clark, president and CEO of Defenders of Wildlife, said then. \"Enactment of any of these bills will only hasten the disappearance of endangered and threatened species from our planet.\"","url":"https://www.ajc.com/entertainment/georgia-endangered-species-list-mostly-slimy-but-important-one/jNrbggcq56lHTxDRkSG5fL/"}
