{"authors":[],"date_download":"2018-10-30 00:54:02","date_modify":"2018-10-30 00:54:02","date_publish":"2017-04-18 00:04:28","description":null,"filename":"data/vaneerConsumption/GeorgeSorossContributionstoaCannabisHotbed.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/Secretary_Kerry_Shakes_Hands_With_Albanian_Prime_Minister_Rama_Before_Bilateral_Meeting_at_NATO_Summit_in_Wales_14961134157.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860842.html","title":"George Soros’s Contributions to a Cannabis Hotbed","title_page":"George Soros’s Contributions to a Cannabis HotbedThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Albania’s socialist prime minister, Edi Rama, is the only foreign leader who came to the U.S. to trash talk Donald J. Trump last year, possibly at the behest of his close friend, George Soros.\n“God forbid” Trump wins the Republican nomination Rama told CNN’s Richard Quest.\nTrump’s election would “harm a lot America and it would harm a lot the world,” predicted the 52-year-old professional artist.\nYet, Rama continues to benefit from a massive USAID program managed by his second wife (of four) and to manipulate a sympathetic U.S. embassy, even as he runs the country into the ground while fomenting chaos in neighboring Macedonia.\nU.S. policy needs to make a U-Turn in Albania, assuming it’s even on the radar in Foggy Bottom.\nTirana Update\nSimply put: Albania is a mess.\nOne of the country’s two major political powers, the center-right Democratic Party, is boycotting parliament and refuses to participate in June elections as long as the governing Socialist Party is in charge.\nMeanwhile, former political dissidents surged through Tirana streets last month protesting Rama’s appointment of a new Interior Minister, Fatimir Xhafaj, who was a state prosecutor during Enver Hoxha’s malevolent, highly repressive communist regime and has a brother indicted for international drug trafficking.\nHoxha imprisoned close to 100,000 people in inhuman jails and camps; some 5,500 people were executed without trial. Among the groups he wiped out were poets, writers, intellectuals, and Christian clergy. Pope Francis beatified 38 Albanian martyrs last year.\nIncredibly, 27 years after communism’s collapse, Albanian politics is still vexed by predatory clans empowered during the Stalin-, then Mao-inspired dictatorship.\nDid the West fail to aid Albania on its path toward democracy?\nOn the contrary, Albania (some three million people living in a country the size of Connecticut) has received extensive assistance from Western institutions including the European Union and U.S. government.\nUSAID spent $60 million in the country’s justice sector alone, 2000 to 2015 — often coordinated with George Soros’ Open Society Foundation under the last administration. As Albanian newspaper editor Erl Murati explained earlier this year, “U.S. official interests coincide with the activity of Soros. It’s difficult to distinguish where the interest of one begins and the other ends. His interests became synonymous with American policy.”\nBut Western aid has mainly reinforced a dysfunctional State while enriching a nepotistic network.\nAs explored in the first part of this series, “Macedonia to George Soros and USAID: Go Away,” this external aid is helping the Socialist Party and its fifth column of NGO allies, employing violence as one of its noteworthy tactics, try to gain power against conservatives.\nSoros’ analogous plan for Albania succeeded already in 2013, when Edi Rama’s Socialist Party defeated the Democratic Party in a victory preceded by violence.\nSmoking Gun\nAlbania actually figured in the 2016 American election.\nThe WikiLeaks revelation of Clinton emails last summer included a smoking gun: Proof that billionaire tax-evader, George Soros, directed Secretary of State Hillary Clinton to take specific action, namely to intervene in Tirana on behalf of Edi Rama, leading violent street protests in January 2011.\nClinton’s staff immediately responded. Within days, a EU envoy suggested by Soros, Slovak diplomat Miroslav Lajcak (current foreign minister for the governing Direction-Social Democracy Party, he was a Communist Party member before 1990), arrived in country.\nAt the time, Rama was Tirana’s mayor and the country’s opposition leader, locked in a power struggle with the governing Democratic Party, which had narrowly defeated his side two years before.\nRama instigated the demonstrations — which killed four people and injured more than 150 — to protest government corruption, revealed by a video secretly recorded by the economy minister, showing how he was ordered by Deputy Prime Minister Ilir Meta to commit fraud involving public contracts and bribes. The two men belong to the same party, the Socialist Movement for Integration, DP’s coalition partner at the time.\nSuperficially, Edi Rama, a 6-foot 6-inch former national basketball player, turned artist, turned politician, has a cool, hipster vibe — at least, that’s what he strives to project.\nElected in 2000 to serve as mayor of the capital city (where over 800,000 people live, approximately 30 percent of the population), having spent two years as Minister of Youth, Rama made a global impression for ordering drab, Soviet-style housing blocks painted with whirls, swirls, and checkerboards from a Crayola palette.\nHe polished an international reputation as a post-modern innovator, giving, for example, a Ted Talk in Thessaloniki on how his urban paint projects brought down crime — although there’s no evidence they did — and bragging to the Guardian, “Once the buildings were colored, people started to get rid of the heavy fences of their shops. In the painted roads, we had 100% tax collection from the people, while tax collection was normally 4%. People accepted to pay their share for the city, because they realized that through the colors the city exists.”\nPedigree\nBut Rama is not new at all. In fact, he has purebred communist pedigree. He’s related through his mother to Spiro Koleka, a politburo member close to Hoxha. Documents reveal he participated with Hoxha and other Politburo members in the actual executions of anti -communist Albanians.\nEdi Rama’s father, Kristaq, was a sculptor and top party member who enforced a hardline to control the arts. As one Albanian intellectual explains, “Kristaq Rama, arguably the most important sculptor of the Communist period, was part of the elite. He belonged to the Central Committee, and in the late 1980s served in the chairmanship of the Kuvendi Popullor, the Communist version of parliament. In that position, in 1987, he refused to grant a pardon to Havzi Nela, a poet sentenced to death for anti-regime propaganda.”\nAfter communism fell, when other young political activists were joining the new Democratic Party (DP), Edi Rama lined up with old cadres in the renamed Socialist Party (SP).\n“The enormous weight of Communism is still on the backs of the Albanian people,” explains Stephen Suleyman Schwartz, founder of the Center for Islamic Pluralism and a journalist who lived in the Balkans in the late 1990s.\n“The Albanian Socialist Party is just the Communist Party slightly refurbished. They look at the whole country in a predatory way,” he continued. “It’s their personal refrigerator or farm, their personal property — just not backed up by a concentration camp or murder anymore.”\nMeanwhile, George Soros’s Open Society Foundation of Albania, established in 1992, was cultivating a new elite, with new cadres, often children of the old guard.\nIt singled out young talent to be sent abroad on scholarships and given new NGOs to lead. One unstated requirement: His beneficiaries could not be religious because so many of Soros’s pet policies antagonize organized religion and traditional values. Rama ran with this crowd.\nIn 2010, Rama, a former Soros board member, married his fourth wife, Linda Basha Xhillari, an Open Society board member at the time — members of the same clan.\nRama’s Renaissance\nPreparing for parliamentary elections in 2012, Rama made two bold moves: He engineered a photo with Barack Obama and forged an alliance with an ostensible enemy.\nFirst, at a San Francisco fundraiser, Rama managed to snag a photo with the president.\nUsing the image in campaign materials was extremely effective because Albanians have been wildly pro-American, especially since the 1999 U.S.-led bombing of Serbia on behalf of Kosovo, where more than 80 percent of the population is ethnic Albanian.\nBut the photo was procured as a result of a crime.\nAlbanian-American Bilal Shehu, a New Jersey limo driver, bought two $40,000 fundraiser tickets via the Obama Victory Fund, then brought Rama to the party instead of his wife. Shehu and businessman William Argeros eventually pled guilty to laundering an illegal $80,000 donation from Tirana in order to procure the tickets.\nForeign contributions to presidential campaigns are illegal. Rama denies he was behind the scheme. Some claim the money came from drug dealers, a flourishing occupation.\nRama’s second pre-election accomplishment was joining forces with Ilir Meta, the politician who was filmed orchestrating corrupt deals in 2011, the one who sparked death and destruction in Tirana’s streets!\nThe alliance between Rama and Meta broke the Democratic Party’s governing coalition. (Today, Meta is speaker of the parliament.)\nTogether with a raft of small political entities, including minuscule Green and Communist party formations, Rama’s Alliance for a European Albania won the 2013 parliamentary elections.\n“The Renaissance has won,” the egocentric leader declared, according to the BBC. Three months later, he was celebrating in New York with pal George Soros, at the octogenarian’s third wedding.\nAs prime minister, Rama staffed his cabinet with a blend of old guard and new elite. The old guard includes Gramoz Ruçi, the most powerful Socialist Party leader after Rama. Ruçi leads the party’s parliamentary group. In yesteryear, he was minister of interior, one of the last goons of the Communist period, chief of the secret police, in 1990.\nThen there’s the new elite: men such as Albania’s foreign minister since 2013, Ditmir Bushati.\nBushati benefited from Soros support while studying at Harvard University. Then, he came home and served as the Open Society Foundation’s national coordinator to monitor progress toward European integration. From there he went to parliament and a leadership role in the Socialist Party.\nOr look at Ejon Veliaj, Rama’s first minister of social welfare and youth, elected mayor of Tirana in 2015. Veliaj’s main credential for running a ministry that managed about 30 percent of the country’s budget was leadership of an NGO created by the Open Society Foundation, Mjaft! (Enough!), which spawned a slew of other NGOs to create what one blogger describes as the “Soros octopus.”\nSoros’s structures groomed people like Bushati and Veliaj to lead the country, together with numerous others playing key roles in government and media.\nWhat old and new seem to share, unfortunately, is a predatory attitude toward the state, based on economic data and public opinion. Because on dimensions such as prosperity or happiness, precious little progress has been made under Rama’s government.\nCannabis and Corruption\nHow is the Renaissance coming along, almost four years later? Excellent, if you’re in the drug trade. Rather badly, if you are a regular citizen.\nAlbania is Europe’s “main source” for cannabis, according to the 2017 Serious and Organized Crime Threat Assessment, released annually by Europol. As the best independent, English-language news site Exit.al points out, last year, the country was one producer among several (Bulgaria, Kosovo, and Serbia), but Albania appears to have displaced the others.\nCannabis production is the most important agricultural income generator, especially in mountainous regions. An Italian blog explains, “Cannabis plantations have grown up like mushrooms all over the country” in the last four years, in part because a new Vietnamese seed that grows quicker is being used.\nAccording to Italy’s top anti-mafia prosecutor, Franko Roberti, cannabis trafficking from Albania to Italy increased 300 percent over the last year — and receipts are linked to financing for Islamic extremists, the Italians believe.\nAn onsite BBC report in December estimated the industry is worth approximately five billion euros a year, which is about half of the country’s GDP.\nHeroin from Afghanistan also transits Albania on its way to Europe, and Albanian émigrés comprise a distribution network throughout Europe.\nAlthough Rama points to a marked increase in marijuana confiscation by police, independent journalist Vincent W.J. van Gerven Oei assessed a new drug action plan prepared for the EU and concluded it won’t make a dent in prosecuting organized crime — an unsurprising weakness considering the new interior minister’s brother is an international cocaine dealer under indictment in Italy.\nIn a different case, a major drug dealer wanted by the Greek government for financing multiple cannabis shipments, Klemend Balili, can’t be touched, due to his connections with Socialist Party national and local officials, write Balkan Insight and CNN Greece based on police sources.\nThe drug trade is enabled by ubiquitous corruption marring Albanian law enforcement, justice, and politics.\nA European Union study found an increase between 2014 and 2016 in citizens being expected to bribe officials — and more public hopelessness, as well.\nMeanwhile, Albanian news sites are filled with bizarre accounts of both bad behavior by politicians and brazen disregard for attempts to make them accountable: Two SP mayors investigated for document fraud were protected by the Central Election Commission as was a SP parliamentarian who assaulted colleagues. At least, the deputy accused of murder in Belgium and of plotting to kill Speaker Meta eventually did lose parliamentary immunity.\nNew York University Professor Shinasi Rama, an Albanian-American (no relation to the prime minister), confirms, “Albania is totally and thoroughly corrupt, criminalized to the core, a mafia state.”\nThe country “is being used by international crime syndicates with terrible consequences for the State, its people, social values, and of course, for democracy, because the mafia only recognizes one form of rule, its own, and it wants to impose this rule over politicians as well,” he continued.\n“Basically politicians are the capos of the mafia, jostling for power, because who ever loses the State loses a lot more than administrative authority,” said the international relations specialist, who helped found the Albanian Bee, an anti-establishment diaspora group.\nNo Accomplishments\nIt shouldn’t be a surprise that a morally challenged elite presiding over a cannabis kingdom have trouble producing positive economic indicators. World Bank data shows a sharp decrease in foreign direct investments between 2013 and 2015.\nAccording to the Legatum Prosperity Index, Albania’s economic prosperity has fallen significantly since 2013, due to unemployment, poor infrastructure, and corruption.\nPerhaps Albania’s saddest decline is on the United Nation’s Happiness Report, which ranks counties based on six dimensions of a nation’s life: income, life expectancy, social support systems, generosity, freedom, and trust.\nWhile in the U.N.’s 2012 report (its first year with rankings), the country was ranked 63 out of 156, this year, Albania fell to 110.\nEdi Rama has managed to accomplish something for himself, though: The inveterate opportunist promotes his felt-pen doodles worldwide, combining official visits to Berlin, Munich, and Hong Kong with exhibit openings in 2015 alone.[1]\nHe even got an Art in America review in February for his exhibit at a New York gallery of the same old doodles, plus printed wallpaper (of doodles), and some new, messy ceramics.\nThe critic wasn’t wowed, though, finding something “perverse” in contrasting the slight drawings to the reality of Albania as “one of Europe’s poorest countries… plagued with rampant corruption,” as though Rama’s ministerial office were merely “an aesthetic prompt.”\nDubious Projects, Empowering Soros\nReviewing various taxpayer-dollar-wasting programs promoted by the U.S. Agency for International Development (USAID), the National Endowment for Democracy (NED), and the U.S. embassy, especially focusing on “democracy building” over the last eight years, shows how fundamentally irrelevant they are to the country’s main problems.\nMillions of dollars were spent to install high-tech digital audio recording equipment in 160 courtrooms, as part of a five-year, $9-million program implemented by Chemonics International, between 2010 and 2015. Installing trial scheduling software was another activity to improve court efficiency.\nA 2013 assessment by USAID’s inspector general found a serious risk that the equipment could not be sustained since it depended on ongoing investments in server capacity and network upgrades, which Albanian public budgets could hardly afford.\nIn 2016, USAID/Tirana selected a new contractor, East West Management Institute (EWSI) — a training consultancy financed by George Soros in the 1990s — for a $8.8-million project, “Justice for All,” once again dedicated to improving the country’s justice system through greater transparency, accountability, accessibility bla bla bla.\nAt about the same time, USAID/Skopje awarded a multi-million contract to EWSI for “civic engagement” in partnership with Soros’s Open Society Foundation in Macedonia.\nEWMI and Soros World maintain close connections; one of EWMI’s four directors is George Vickers, former director of international relations for the Open Society Institute.\nGuess who oversees the EWSI programs in Albania and Macedonia?\nEdi Rama’s ex-wife, Delina Fico, is EWMI’s director of civil society programs.\nHer current partner is Bledi Çuçi, Rama’s minister of state for local issues until last month, when he was moved to a regional SP campaign position — part of a government reshuffle to satisfy EU anti-corruption demands.\nThus, USAID in the Balkans has empowered the incestuous Soros clan, embedded in the region’s socialist parties, to fly the American flag over its partisan, nepotistic activities.\nU.S. Favoritism\nAnd the U.S. government has pressured the Democratic Party to defer to the SP on important internal matters.\nLast summer, Assistant Secretary of State Victoria Nuland came to Tirana to persuade Lulzim Basha, leader of the DP (who defeated Rama in the 2011 Tirana mayoral race), to give in to the prime minister regarding judicial reform in order to inspire the EU to open membership talks with Albania. Basha’s party boycotted the vote.\nNuland’s long gone, but Embassy Tirana continues to be embroiled in Albania’s partisan politics, siding with the SP, as is well documented by Luke Coffey, director of the Heritage Foundation’s Center for Foreign Policy Studies.\nAmong the recent fights U.S. Ambassador Donald Lu has picked, he canceled U.S. visas for approximately 70 judges and prosecutors, including the country’s general prosecutor, all DP members, none, reportedly, from the SP.\nSix U.S. senators wrote to Secretary of State Rex Tillerson on March 15 asking him to investigate funds dispersed by USAID and embassy in Albania as well as Macedonia that might benefit socialist parties and policies advanced by George Soros’s foundations.\nWith regard to Albania, the letter says, opposition leaders believe judicial “reforms” promoted by Embassy Tirana “are ultimately aimed to give the prime minister and left-of-center government full control over judiciary power.”\nFailed Experiment\nProfessor Shinasi Rama considers Albania over the last 25 years to exemplify a “failed experiment.”\nHe explains, “Albania was a guinea pig, an experiment with new forms of organization suggested, recommended, and imposed from outside.”\nIn the U.S., for example, various groups are organically created and privately funded, Professor Rama pointed out, but in Albania, outsiders, whether USAID or Soros, “tried to press templates on locals,” calling it civil society.\nAs a result of facing “international factors which were multiple and conflicting,” the professor says, Albanian politicians “started playing a double game: Cooperate by day, undo it by night. Every law that was passed, included a lot of ‘back doors.’”\nOverall, the professor concludes, “There was too much desire on the part of outsiders to change the people and the State.”\nToday, Shinasi Rama sees “perpetual crisis, a country that can’t solve its own problems so it’s about to be captured by criminal forces.”\nStephen Schwartz has a similar assessment of the negative impact of outside solutions, explaining that Albanian identity has always been strongly attached to the land, yet Hoxha’s forced collectivization destroyed agriculture and the peasant’s great wealth of knowledge.\n“They went from Hoxha telling them how to be an Albanian to Soros telling them, ‘You have to be a European the way I tell you how to be a European,’ imposing his mentality, which has no use for religion, culture, or education,” said Schwartz, who was a Soros grantee for work on Croatia.\nSchwarz said he escaped the “prescriptive materialism” of the Soros mentality, likening it to “Communist style corruption of the intelligentsia.”\nWhat all of the Western advisers ignored is the real treasure of the region: “I said in ’87, Balkan Muslims are a precious resource for Europe. They can create a commercial Metropole like Hong Kong. What we need is a dialogue of the religious, based on the experience of co-existence and entrepreneurship,” Schwartz said. “None of this penetrated the mind of Brussels.”\n“Instead, Clinton and Soros offered exactly the same thing. Prescriptive imperialists. They think only they know what is good for you because they know! You don’t know what you need… all under the U.S. flag,” the Muslim scholar sighed, ruefully.\n(Our series, “Soros in the Balkans Under the American Flag,” will continue.)","url":"https://spectator.org/george-soross-contributions-to-a-cannabis-hotbed/"}
