{"authors":["David Wickert"],"date_download":"2018-10-30 18:01:45","date_modify":"2018-10-30 18:01:45","date_publish":"2018-09-11 14:49:00","description":"The Georgia Department of Transportation is adding roadside assistance units in some parts of the state as South Carolinians prepare to evacuate ahead of Hurricane Florence.","filename":"data/vaneerConsumption/GeorgiaDOTpreparesforHurricaneFlorence.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/09/11/Images/newsEngin.19806576_Hurricane_Irma_Georgia_3222_20180911104450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_commuting_georgia-dot-prepares-for-hurricane-florence__1540922505.html","title":"Georgia DOT prepares for Hurricane Florence","title_page":"Georgia DOT prepares for Hurricane Florence","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia Department of Transportation is preparing for trouble as Hurricane Florence bears down on the East Coast.\nSpokeswoman Natalie Dale said GDOT has increased the number of responding CHAMP operators on I-20, I-95 and I-16 in anticipation of increased traffic as residents of South Carolina prepare to evacuate. The CHAMP units provide highway assistance, clear debris and help at accident scenes. To call for road assistance in Georgia, call 511.\nThe latest forecast shows Florence making landfall in the Carolinas on Thursday or Friday. But Dale said the department is prepared to take additional action if the hurricane takes a turn toward Georgia. That could include converting I-16 to westbound-only traffic to aid evacuation of coastal areas.\nGDOT has some recent experience with hurricanes. A year ago, Hurricane Irma led the agency to reverse traffic on I-16 and on the I-75 South Metro Express Lanes south of Atlanta as the evacuation of hundreds of thousands of people from Florida snarled traffic.","url":"https://www.ajc.com/blog/commuting/georgia-dot-prepares-for-hurricane-florence/mK56zG6TooFg3fJNfrzYJL/"}
