{"authors":[],"date_download":"2018-10-30 14:24:53","date_modify":"2018-10-30 14:24:53","date_publish":"2017-03-06 16:54:00","description":"Aubrey Franklin Arnold of Athens faces feticide and other charges.","filename":"data/vaneerConsumption/Georgiawomanlosesbabyafterchaseendsincrash.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/06/Images/allen-couple.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_pregnant-wo_ff3577826e289a68757fecaecae6cd6d__1540909493.html","title":"Georgia woman loses baby after chase ends in crash","title_page":"Georgia woman loses baby after chase ends in crash","title_rss":"NULL","source_domain":"ajc.com","text":"A 27-year-old woman lost her unborn child after a police chase in Barrow County ended in a three-car crash last week, the sheriff’s office said Monday.\nNichole Faith Allen of Winder was recovering in the hospital Monday but was unable to speak, Channel 2 Action News reported.\nAllen’s Kia Forte was hit head-on Thursday as she was driving west on Ga. 82, sheriff’s spokesman Capt. Ryan Sears said in a news release.\nAubrey Franklin Arnold’s mug shot from August 2016. (Credit: Barrow County Sheriff's Office)\nDeputies were chasing Aubrey Franklin Arnold, who was wanted on felony warrants in Barrow and Jackson counties, Sears said.\nArnold was going well over 100 mph when he lost control, slid and caused the crash, Channel 2 reported.\nNichole Allen's Kia Forte was damaged extensively after a head-on crash. (Credit: Channel 2 Action News)\nAllen was 18 weeks pregnant with her first child, a boy, according to a GoFundMe Page set up for medical expenses. She had another surgery scheduled for Monday, the page states.\nThe sheriff’s office received a report that Arnold, 36, of Athens, was in the parking lot of a Shell gas station at 1233 Atlanta Highway, Sears said.\nA deputy went to the gas station, approached Arnold and asked him to step out of a Chevrolet Silverado. Rather than comply, Arnold drove off and hit the deputy with the side of the truck, Sears said.\nDeputies chased Arnold, who was ejected from his truck after hitting Allen just east of Ga. 211, Sears said.\nWitness Wayne Ridgeway told Channel 2 he watched as Arnold’s body flew through the air, he said.\nArnold and Allen both were taken to Athens Regional Medical Center. The deputy Arnold hit was not seriously injured, Sears said.\nA third vehicle involved in the crash did not sustain much damage and the driver wasn’t seriously hurt.\nThe deputies involved in the chase and crash are still trying to deal with what happened, Barrow County Sheriff Jud Smith said.\n“They are all struggling with the fact of what happened to this young lady, this innocent lady, and her family,” Smith told Channel 2.\nArnold faces aggravated assault on a law enforcement officer, feticide by vehicle, DUI and multiple traffic charges.\nSmith said Arnold will be booked when he is released from the hospital.\nAccording to records obtained from the Superior Court of Barrow County, Arnold has been arrested and convicted multiple times on different charges in Barrow and Jackson counties, Sears said.\nAllen’s family has denied requests to talk about their tragedy.\n“Our thoughts and prayers go out to the Allen family in this extremely difficult time,” Smith said.\nIn other news:","url":"https://www.ajc.com/news/crime--law/pregnant-woman-loses-baby-after-chase-ends-crash/1UeEc88jBSxTKRk05gCQdM/"}
