{"authors":[],"date_download":"2018-10-30 18:00:05","date_modify":"2018-10-30 18:00:05","date_publish":"2018-09-11 17:21:00","description":"Georgia nonprofits, individuals and faith communities are gearing up to help people from the Carolinas and Virginia who are fleeing Hurricane Florence.","filename":"data/vaneerConsumption/GeorgianspreparetoaidHurricaneFlorenceevacuees.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/10/Videos/4479906.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_georgians-prepar_ae5fe1c97a3c58c795f35f8f7c682276__1540922405.html","title":"Georgians prepare to aid Hurricane Florence evacuees","title_page":"Georgians prepare to aid Hurricane Florence evacuees","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia nonprofits, individuals and faith communities are implementing plans to help people from the Carolinas and Virginia who either fled Hurricane Florence or stayed behind.\nThe monster hurricane made landfall, producing damaging winds and storm surges.\nGeorgia-based MAP International's Disaster Response Team is supporting emergency management teams.\nMAP's team delivered an initial shipment of 1,500 Disaster Health Kits to staging centers in Bertie County, NC. These staging sites will be used by crews assisting thousands of hurricane evacuees across southeast North Carolina.\nMAP's Global Medicines Distribution Center in Brunswick, GA is also preparing another 15,000 Disaster Health Kits for distribution to potential areas affected by the storm. MAP's Disaster Health Kits provide essential health items to prevent the spread of disease. One kit will assist a person living in a shelter for one week.\nCongregation Beth Shalom in Dunwoody welcomes evacuees from Hurricane Florence.\nCongregants have offered their homes to individuals, including several who can We have many congregants who have offered to open their homes to individuals, including some who can accommodate individuals who keep kosher and or who have pets.\nFamilies evacuating the hurricane are welcome to join Congregation Beth Shalom at its Yom Kippur services as well.\nGwendolyn Coley turned to Facebook to invite people and their animals to stay on her 58-acre farm in Fort Valley. Part of that area is fenced in where owners can put larger animals such as horses and goats. She also has two cabins that sleep as many as 20 people.\nRelated: Hurricane Florence evacuees offered discounts to Legoland Atlanta\nRelated: Hurricane Irma is perfect storm as nonprofits face multiple disasters\n“I know that if I needed to evacuate, I have horse friends and other friends that I’m sure would do the same thing,” she said. “I opened this to friends, but if someone else contacted me, I would even take in a stranger.”\nEdward Ahmed Mitchell, executive director of CAIR-Georgia Chapter, said mosques around the state are putting plans in place to open their doors as shelters to people in the path of the hurricane as their did during Hurricane Irma in 2017.\n“Most mosques are open spaces,” he said. “So they can fit a lot of people.”\nICNA (Islamic Circle of North America) Relief is leading the effort.\nTeams are being readied to go to North and South Carolina to help before and after the hurricane hits.\nThere is a need for blankets, pillows, toothpaste, toothbrush, hand sanitizer, towels, toilet paper, wet wipes, hand sanitizer, cleaning supplies, women’s hygiene products, soap, and shampoo, Hefty or Glad brand large trash bags, durable paper plates, drinking cups and cutlery, over -the -counter medication (cough medicine, Ibuprofen, allergy medicine).\nRelated: Hurricane Florence: South Carolina pets find shelter in metro Atlanta\nMore: A NASCAR track is providing a home for evacuees of Irma\nLast year, 15 Georgia mosques sheltered nearly 1,000 people and also provided food, water and other critical items, said Hamid Qureshi, regional director of ICNA Relief.\nIn one case, a family’s car broke down and members of a mosque donated a van to help them get home. Another family needed help with rent when they returned.\nSo far, 10 have signed up to open their mosques as shelters.\nAtlanta Motor Speedway, located about 25 miles south of Atlanta, will open its camping facilities to Florence evacuees.\nThe campgrounds, which are equipped to handle thousands of campers during the track's annual NASCAR weekend, will again be made available free of charge for dry RV and tent campers in the Legends Campground.\nIn 2017 more than 100 campers parked at the Speedway during Hurricane Irma.\nLocated adjacent to the campgrounds, AMS will also open The Rinnai Shower Station camper bath house, allowing evacuees free access to hot showers and restroom facilities during their stay.\nIt may to be too soon for some groups to assess what the needs will be or how they can help. Often, officials asks nonprofits and those offering relief to wait .\nHabitat for Humanity International, for instance, is closely monitoring the storm.\nThere are several local Habitat for Humanity organizations throughout the region that are expected to be affected by Hurricane Florence, said spokesman Bryan Thomas.\n“Our role is primarily in the long-term recovery of disaster-stricken communities, following the immediate response,” he said. “This phase tends to be the most underfunded aspect of disaster response and recovery. Storms like Florence tend to most adversely impact the lower income populations that Habitat serves.”\nGenerally, he said the organization asks volunteers not to deploy in the immediate aftermath of a major disaster, so that we give room to first responders and don’t put a drain on needed resources (like hotel rooms). We’re monitoring so that whatever asks we make (monetary, supplies, volunteers) will match the need on the ground.”\nThe American Red Cross of Georgia is also keeping a close eye on the weather.\nSherry Nicholson, regional communication director, said the nonprofit is preparing for people who are likely to come to Georgia for shelter. Volunteers are on standby and the Red Cross has already identified shelters for evacuees.\nNicholson said the organization has already moved supplies, such as toiletries, cots and blankets, closer to the areas where they may be needed along evacuation routes.\n“We’re basically standing by and ready to respond as needed,” she said.\nShe encouraged peopel to download the Red Cross mobile app, which not only provides information about what to do before, during and after the hurricane, but helps identify water availability and shelters and also lets people track their loved ones.\nPeople interested in volunteering can go to the American Red Cross Web site and register. There is always a need for financial contributions in disasters.\nYou can make a donation to the Red Cross through its Web site or by text.\nAtlanta Motor Speedway\n770-946-4211\nwww.atlantamotorspeedway.com\nHabitat for Humanity International\nDonations to support Habitat’s response to Hurricane Florence can be made at: habitat.org/hurricaneflorence\nThe Peach Pit\nFort Valley\nc/o Gwendolyn Coley\nwww.thepeachpitgeorgia.org\nAmerican Red Cross\nwww.redcross.org\nwww.redcross.org/volunteer\n1-800-RED CROSS (1-800-733-2767) / text the word REDCROSS to 90999 to make a $10 donation\nApple Store:\nhttps://itunes.apple.com/us/app/emergency-by-american-red/id954783878?mt=8\nGoogle Play Store:\nhttps://play.google.com/store/apps/details?id=com.cube.arc.saf\nOr text: \"GETEMERGENCY\" to 90999\nCongregath Beth Shalom\n770-399-5300 or email: Linda@bshalom.net.\nICNA Relief\nAny evacuee who wants to stay at one of the participating mosques should call 770-558-3519.\nAny masjid that wants to serve as a shelter should contact ICNA Relief- h.qureshi@icnarelief.org or abdulbasit.khan@icnarelief.org.\nAnyone who would like to volunteer contact- swada@icnarelief.org\nTo donate items or financial contributions: www.icnarelief.org/florence.\nMAP INTERNATIONAL\nMAP is accepting donations to support those in need. Donate online at www.map.org/Florence.\nGlobalGiving\nThe Disaster Recovery Network at GlobalGiving launched a Hurricane Florence Relief Fund to initially support storm preparation and meet survivors' immediate needs for food, fuel, clean water, hygiene products, and shelter. Once initial relief work is complete, the fund will transition to support longer-term recovery efforts run by local organizations.","url":"https://www.ajc.com/lifestyles/georgians-prepare-help-hurricane-florence-evacuees/aK0ogcoZiternjehqP0gUK/"}
