{"authors":[],"date_download":"2018-10-22 21:57:24","date_modify":"2018-10-22 21:57:24","date_publish":"2014-06-06 15:59:14","description":"The man killed after he shot a deputy at a Georgia courthouse had been scheduled for court and had filed a lawsuit against the sheriff's department.","filename":"data/vaneerConsumption/GeorgiaCourthouseGunmanMeanttoKillasManyPeopleasHeCould.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/492581/140606-forsyth-ourthouse-mn-1230_3cccc7c87ce8d99fdf42786f1fa1a842.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_georgia-courthouse-gunman-meant-kill-many-people-he-could-n124591_1540245444.html","title":"Georgia Courthouse Gunman Meant to 'Kill as Many People as He Could'","title_page":"Georgia Courthouse Gunman Meant to 'Kill as Many People as He Could'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn explosives-laden Georgia man who was gunned down after he shot a sheriff's deputy in the leg had a long history with law enforcement, who said Friday they had found even more explosives in his home.\nThe suspect, identified as Dennis Marx, was wearing body armor and a gas mask when he was shot multiple times and killed by the deputy while he made a beeline for the Forsyth County Courthouse in the town of Cumming, officials said.\nDeputy James Daniel Rush, 46, suffered a fractured fibula and tibia and underwent surgery Friday afternoon, NBC station WXIA of Atlanta reported. The injuries didn't appear to be life-threatening, and Rush told friends online: \"I am ok.\"\nRush was monitoring the entrance to the courthouse when he saw Marx raced up about 10 a.m., and he was praised for stopping Marx.\n\"It would be a guess to think how many lives he saved had he not engaged him right there,\" Sheriff Duane Piper said, saying Marx arrived \"with the specific purpose of killing as many people as he could.\"\nMarx, who had been scheduled to appear in court Friday on drug and weapons charges, appeared to have been planning the attack for some time, Piper told reporters Friday afternoon.\nHe was carrying a smoke grenade, multiple several homemade hand grenades, smoke grenades, tear gas grenades, other homemade explosive devices and several magazines of ammunition when he raced toward the entrance of the courthouse, Piper said.\nAt Marx's home, investigators found even more explosives but no booby-traps, Piper said. He said they were specifically on the lookout for traps because Marx had been known in the past to have booby-trapped his home with pits and punji sticks — sharply pointed spears planted upright to impale anyone who fell in.","url":"https://www.nbcnews.com/news/crime-courts/georgia-courthouse-gunman-meant-kill-many-people-he-could-n124591"}
