{"authors":[],"date_download":"2018-10-30 20:25:25","date_modify":"2018-10-30 20:25:25","date_publish":"2015-11-03 13:20:20","description":"A Georgia state senator spent Monday night in the Douglas County Jail after a judge found him in contempt of court.","filename":"data/vaneerConsumption/GeorgiasenatorjailedoncontemptchargeinDouglasCounty.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_90c8b7eaea715909d3184323ba1347d0__1540931125.html","title":"Georgia senator jailed on contempt charge in Douglas County","title_page":"Georgia senator jailed on contempt charge in Douglas County","title_rss":"NULL","source_domain":"ajc.com","text":"A Georgia state senator spent Monday night in the Douglas County Jail after a judge found him in contempt of court.\nChannel 2 Action News reported that Sen. Curt Thompson, D-Tucker, who is also an attorney, was summoned before Douglas County State Court Judge James Barker to explain why he shouldn’t be held in contempt for failing to show up to court on a civil matter.\nThompson’s initial excuse was he had another case in DeKalb County that conflicted with the Douglas County court date, but an investigation determined Thompson allegedly lied about the conflict, according to Channel 2.\nAt a hearing Monday, Barker found Thompson, 46, in contempt, and sentenced him to 10 days in jail.\nDouglas County Sheriff Phil Miller told Channel 2 after spending the first 24 hours in jail, Thompson will be allowed to post bond and remain free while he appeals the contempt charge.\nOnline records show Thompson was booked into the jail about 7:30 p.m. Monday.\nThompson made headlines a year ago when he proposed that marijuana be fully legalized in Georgia,","url":"https://www.ajc.com/news/state--regional-govt--politics/georgia-senator-jailed-contempt-charge-douglas-county/1hEeJ9Shr69VlJXDp5KDPM/"}
