{"authors":[],"date_download":"2018-10-30 19:31:32","date_modify":"2018-10-30 19:31:32","date_publish":"2018-08-29 16:48:00","description":"For Georgia State’s Jamal and Nathaniel Paxton, the 2018 season opener against Kennesaw State...","filename":"data/vaneerConsumption/GeorgiaStateKennesawStateseasonopenerafamilyaffairforPaxton.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/24/Images/photos.medleyphoto.8424627.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_georgia-state-kennes_dda308f2294ff20f98eaefd50fdb4997__1540927892.html","title":"Georgia State-Kennesaw State season opener a family affair for Paxton","title_page":"Georgia State-Kennesaw State season opener  a family affair for Paxton","title_rss":"NULL","source_domain":"ajc.com","text":"For Georgia State’s Jamal and Nathaniel Paxton, the 2018 season opener against Kennesaw State is a family affair.\nJamal is the starting center for Georgia State, while older brother Nathaniel –– Nate –– is a graduate assistant on the strength staff after playing on the Panthers’ defense from 2012-15.\nThe youngest Paxton brother, Terrell, signed with Kennesaw State in February. Jamal played a role in his younger brother’s path to signing, telling Terrell to find his second family, as he and Nate did at Georgia State.\n“I just wanted him to go somewhere and be happy,” Jamal said. “I didn’t want him to go far off and not know what to do. I told him, “on your official visit, go where it’s a family.” He chose Kennesaw State, and I feel like that was a good pick for him.”\nNate and Jamal are only 25 miles away from Terrell, but on Aug. 30, the two will compete against their younger brother inside Georgia State Stadium. However, competition is not something that is unfamiliar to someone who has grown up with two brothers.\n“It was real competitive,” Jamal said. “We got into arguments about who’s better. Nate could beat me, then I could beat Terrell. I want Terrell to get up there, but he’s not better than me right now.”\nFor the Paxtons, the trash talking started long before preseason camp started. According to Nate and Jamal, the trash talk started the moment Terrell signed with the Owls.\n“Yeah, there’s been a lot of that from both sides,” Nate admitted. “Me being an alumni from here (Georgia State) and my brother playing center here, I have a great amount of affection for this school. My other brother, I love him to death, but he didn’t go here, so there’s a lot of trash talking going on right now.”\nThat affection of the Georgia State football program brought Nathaniel back as a graduate assistant in January 2016. As a part of the strength staff, Nate is able to coach his younger brother Jamal –– something he’s been doing since they were kids.\n“That’s the reason I came here in the first place to be playing alongside of him,” Jamal said. “He’s a role model for me, so I mean I like playing under him. He coaches me up. He helps the defensive lineman, but he still coaches me up. He’ll tell me if I am leaning or what I am doing wrong. He knows everything, so I go to him anytime I need some help.”\nThe coaching from his brother, coach Shawn Elliott speaks highly of the Paxton brothers, dubbing Jamal one of the hardest workers on the team.\n“Their parents have done a heck of a job in raising those two individuals,” Elliott said. “If you’re around them, you know what they stand for. It’s very easy to just know that their parents sit back and know how proud they are of them.”\nThe Panthers open the 2018 season against Kennesaw State on Aug. 30. Jamal and Nate will wear blue and white, Terrell will wear black and gold, and their parents will wear all four.\n“My dad actually went out and bought him and my mom a half-and-half shirt,” Nate said.” “So they’re going to be divided at the moment, but they know where this will land at and where it’ll stay.”","url":"https://www.ajc.com/sports/georgia-state-kennesaw-state-season-opener-family-affair-for-paxton-brothers/WSP1JDFP8m9Ogu4S6PFo3L/"}
