{"authors":["Breitbart News"],"date_download":"2018-10-30 21:00:53","date_modify":"2018-10-30 21:00:53","date_publish":"2015-03-02 00:19:00","description":"For President Barack Obama, it's a week to invoke America's civil rights struggles from past to present. |","filename":"data/vaneerConsumption/GeorgeWBushtoAccompanyObamatoSelmaonCivilRightsTrip.json","image_url":"https://media.breitbart.com/media/2015/03/george-w-bush-obama-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_01__1540933253.html","title":"George W. Bush to Accompany Obama to Selma on Civil Rights Trip","title_page":"George W. Bush to Accompany Obama to Selma on Civil Rights Trip | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — For President Barack Obama, it’s a week to invoke America’s civil rights struggles from past to present.\nThe nation’s first black president plans a speech Saturday from the Edmund Pettus Bridge in Selma, Alabama, the site of one of the movement’s stirring moments, and will refocus on last year’s fatal shooting by a white police officer of a black 18-year-old in Ferguson, Missouri.\nRecommendations were expected Monday from the president’s Task Force on 21st Century Policing, appointed after Michael Brown’s death in August. Attorney General Eric Holder has said he expects to announce results of his department’s investigation of the case before he leaves office, and that word could come within days.\nObama’s actions are an important gesture toward the black community, which strongly backed him in his two White House races and will be critical for Democrats in the 2016 presidential campaign and their efforts to retake control of Congress.\nFormer President George W. Bush and his wife, Laura, also plan to be at the Selma commemoration, and a large bipartisan congressional delegation planned to be a part of a three-day civil rights pilgrimage to the state.\nThe week also highlights the personal racial politics of the first black president’s past and future as he plans Friday to make his first return to South Carolina since the 2008 primary campaign in which he and Hillary Rodham Clinton fiercely fought for the state’s black voters.\nObama’s South Carolina event is tied to his 1-year-old My Brother’s Keeper initiative aimed at improving the lives of young minority men, expected to be a continuing focus for the president after he leaves office.\nFrom the Pettus bridge on March 7, 1965, white police officers beat civil rights protesters in 1965. Obama last visited the bridge in 2007 when he was a presidential candidate; this time he is bringing his entire family.\n“When I take Malia and Sasha down with Michelle next week, down to Selma, part of what I’m hoping to do is to remind them of their own obligations. Because there are going to be marches for them to march, and struggles for them to fight,” Obama said at a White House event Thursday celebrating Black History Month.\nThe Rev. Raphael Warnock, pastor of Ebenezer Baptist Church in Atlanta, where Martin Luther King once preached, said voting rights and criminal justice reform were the main topics of a private meeting Obama held with civil rights leaders shortly before his public remarks.\n“There was agreement in the room that voting rights is crucial, that it is urgent and it ought to be a nonpartisan issue,” Warnock said.\nWarnock decried lawmakers for celebrating Selma’s anniversary while failing to restore the Voting Rights Act. In 2013, the Supreme Court struck down the section that determines which states and localities must get Washington’s approval for proposed election changes. The requirement was an effort to stop voting discrimination, mostly in the South. Congress has yet to come up with a new formula.\n“The worst assault on voting rights since the Voting Rights Act was passed is happening right now,” Warnock said. “You can’t celebrate Selma and sit on the reauthorization.”\nWarnock said Obama’s presidency has been a living tribute to the sacrifices of the generation that protested in Selma and elsewhere to promote civil rights. But he argued that a recent discussion among possible 2016 Republican presidential candidates over whether Obama loves his country is one example of how Obama’s election has highlighted continuing racism in America.\n“I think there are people who still traffic in the narrow alley of bigotry and I think that there are politicians who sell bigotry as a means of elevating their argument or a narrow partisan interest,” Warnock said.\nObama’s Monday meeting with the police task force follows the three-month deadline he set for recommendations about how police can build trust, accountability and transparency with the communities they serve.\nWhen he announced the task force’s creation in December, Obama promised the result would not be “an endless report that we’re going to have collecting dust on the shelf.”\n“Part of the reason this time will be different is because the president of the United States is deeply invested in making sure this time is different,” Obama said.\n—\nFollow Nedra Pickler on Twitter at https://twitter.com/nedrapickler","url":"https://www.breitbart.com/politics/2015/03/01/george-w-bush-to-accompany-obama-to-selma-on-civil-rights-trip/"}
