{"authors":["Jeff Powell For Mailonline"],"date_download":"2018-10-23 01:47:14","date_modify":"2018-10-23 01:47:14","date_publish":"2016-01-29 15:54:16","description":"JEFF POWELL: George Groves always talks a good fight and the proverbial hind leg of the donkey has been gnawed ragged in the build up to his comeback this Saturday night.","filename":"data/vaneerConsumption/GeorgeGrovesaimsforanotherworldtitleshotashepreparesforhislatestcomebackagainstAndreaDiLuisa.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B2AF7C00000578-0-image-a-94_1454081488055.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-3423032_George-Groves-aims-world-title-shot-prepares-latest-comeback-against-Andrea-Di-Luisa_1540259234.html","title":"George Groves aims for another world title shot as he prepares for his latest comeback against Andrea Di Luisa","title_page":"George Groves aims for another world title shot as he prepares for his latest comeback against Andrea Di Luisa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"George Groves always talks a good fight and the proverbial hind leg of the donkey has been gnawed ragged in the build up to his comeback this Saturday night in what is now London’s old Olympic Park.\nSaint George is an intelligent pugilist and as such one of the most persuasive salesmen in the Barnum and Bailey world of boxing.\nHis eloquence played a major part in attracting a modern-era record crowd of 80,000 to Wembley Stadium for his re-match with Carl Froch.\nGeorge Groves and Andrea Di Luisa face off ahead of their catch-weight fight at the Copper Box\nNow it feels as if Groves has granted even more interviews in hope of filling the more modest 7,000 capacity of the Copper Box, which was the venue for handball and the fencing element of the modern pentathlon at the 2012 Games.\nGiven the on-going fascination with Groves among many of his fellow Londoners, this is a reasonable expectation even though Italy’s Andrea Di Luisa is an opponent of whom the description modest would be an exaggeration.\nThe 27-year-old from Hammersmith arrives, in Stratford, at a cross-roads in his career.\nHe makes that short journey having talked at considerable length about such topics as the inadequacy of his immediate past trainer when he failed in his third unsuccessful bid for a world super-middleweight title, the loneliness of the prize-fighter and the remorseless ticking of his biological clock as he struggles to achieve his lofty ambitions.\nGroves is returning to the ring after his third failed attempt to win a world title\nGroves lost his last world title attempt on a split decision against Badou Jack in Las Vegas in September\nGroves, with promoter Kalle Sauerland, is now trained by Shane McGuigan (right)\nGroves has been critical of former trainer Paddy Fitzpatrick since splitting from him\nMore optimistically, Groves expects his new young mentor to apply the world title gloss to his not inconsiderable talent. Shane McGuigan, son of the great Barry, is making his own name as trainer to Carl Frampton, David Haye and now Groves.\nMcGuigan has replaced Paddy Fitzpatrick, the man in the hat who Groves blames for wearing flip-flops during training for his defeat by WBC champion Badou Jack in Las Vegas last September, failing to turn up in time for a press conference and giving him the wrong advice in the corner.\nFroch, who had a fractious rivalry with Groves, now hopes that the man he KO’d twice will recover to win at least one of those alpha-belts: ‘I would like to see George get his world title and that would make my victories over him look even more impressive.’\nGroves weighed in two pounds under the 12st 4lbs limit for the fight with Di Luisa\nBut the Nottingham Cobra has his doubts and has voiced them by echoing the view of fearsome world middleweight champion Gennady Golovkin, who sparred with Groves recently, that the three setbacks have drained the Saint of some of his punching power and fighting intensity.\nAlthough the last of those reversals came only four months ago, this fight classifies as a comeback because Groves nursed doubts about his ring future after losing to Jack and began pondering alternative means of supporting his wife and the children they are planning.\nBoth Groves and Di Luisa weighed in almost two pounds lighter than their agreed catch-weight of 12 st 4 lbs, which makes it all the more peculiar that this bout was not made at the super-middleweight 12 stone limit.\nGroves says he is on the comeback trail with new trainer McGuigan\nGroves says: ‘Although I’ve only been working with Shane for a couple of months we are on the come-back trail. Hopefully my fans will see some improvements in an explosive performance with me sharp and hitting hard, the way I’ve been doing in the gym. I should be ready for another world title shot by the summer.’\nThis weekend’s bout may give us a clue to that potential but not a complete answer.\nDi Luisa is a former European champion but his three defeats have come by stoppage each time he has stepped up in class. The last two were inflicted by Christopher Rebrasse, who was comprehensively out-pointed by Groves, and Lucian Bute, who was demolished by Froch.\nThe bookmakers’ odds speak even more eloquently than those statistics. SkyBET make Groves a massively prohibitive 1-66 on favourite, with Di Luisa a 14-1 under-dog.\nFor Groves, defeat is unthinkable. What he needs is an emphatic statement of renewed intent.","url":"https://www.dailymail.co.uk/sport/boxing/article-3423032/George-Groves-aims-world-title-shot-prepares-latest-comeback-against-Andrea-Di-Luisa.html"}
