{"authors":["Jabeen Waheed For Mailonline"],"date_download":"2018-10-23 02:41:00","date_modify":"2018-10-23 02:41:00","date_publish":"2017-03-10 11:53:32","description":"Georgia Kousoulou and Tommy Mallett have opened up about their romance on ITV's Lorraine on Friday, with the blonde confessing she didn't take a like him at first before eventually falling 'in love'.","filename":"data/vaneerConsumption/GeorgiaKousouloudidntlikeTommyMallettatfirst.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22A3D000000578-0-image-a-117_1489146838630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300882_Georgia-Kousoulou-didn-t-like-beau-Tommy-Mallett-first_1540262460.html","title":"Georgia Kousoulou didn't like Tommy Mallett at first","title_page":"Georgia Kousoulou didn't like Tommy Mallett at first | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Their three year relationship has stood the test of time on TOWIE.\nAnd now Georgia Kousoulou and Tommy Mallett have opened up about their romance on ITV's Lorraine on Friday morning, with the blonde confessing she didn't take a liking to him at first, before eventually falling 'in love'.\nHer 24-year-old reality star beau also spoke about the future of their partnership, revealing he would like to follow in the footsteps of their parents who got married on television.\nScroll down for video\nSpilling the beans: TOWIE's Georgia Kousoulou and Tommy Mallett have opened up about their romance on ITV's Lorraine on Friday morning, with the blonde confessing she didn't take a liking to him at first, before eventually falling 'in love'\nGeorgia looked absolutely stunning for her appearance on the show in a shaggy navy zip-up jacket, which had the letter M etched to one side.\nShe teamed the look with a pair of ankle-grazing jeans and in true Essex girl style amped up the sexiness in towering blue heels.\n'We’re the only sensible ones that have stayed together for three years. We don’t know anything different because we met on the show,' she spoke to the show's stand-in host Christine Lampard.\n'Viewers have grown with our relationship, they’ve seen it every step of the way,' the choker-clad stunner continued.\nOpening up: Georgia's reality star beau also spoke about the future of their partnership to stand-in host Christina Lampard, revealing he would like to follow in the footsteps of their parents who got married on television\n'We don't know any different': Georgia, who donned an edgy choker, spoke about how she got together with Tommy on the ITVBe series\n'They've seen it every step of the way': The blonde beauty revealed that the show's viewers have grown with them during their romantic journey\n'I didn’t like Tommy for about an hour and then I realised I’m in love. I then called my mum and told her \"oh my god, I'm in love\".'\nDespite finding love, Georgia admitted she didn't compromise when it came to what she would stand for in a romance, revealing: 'I set 2 pages of ground rules.'\n'It became my bible,' Tommy jokingly admitted.\nWhen quizzed by Christina over the potential of tying the knot, the hunky star squirmed: 'Marriage? Put me on the spot. I suppose so... it’s on the cards!'\nFashionista: Georgia looked absolutely stunning for her appearance on the show in a shaggy navy zip-up jacket, which had the letter M etched to one side\nSubtle glamour: She teamed the look with a pair of ankle-grazing jeans and in true Essex girl amped up the sexiness in a pair of towering blue heels\nHandsome: Tommy looked hunky with slicked back locks and a cool denim jacket\n'My parents got married on TV on Gretna Green. Made a programme about it, and my mum and dad turned up with half of Ireland, I was in it. I'm hoping to follow in their footsteps!' he revealed.\nMeanwhile, the couple previously opened up about their plans to say their vows in a big Greek and Irish-themed wedding when they eventually tie the knot to pay tribute to each of their family's heritage.\nTommy told OK! magazine last year: 'We’ll have a big Greek and Irish-themed wedding.\n'I didn't like him at first': Georgia revealed she initially didn't fancy Tommy, but quickly realised she was 'in love'\n'It's my bible': Tommy was a good sport as his girlfriend confessed she gave him '2 pages of ground rules'\n'My parents got married on TV!' Tommy also revealed he would like to follow in the footsteps of his parents and get married on-screen\n'You get to smash plates, do some mad Greek dancing and pin £50 notes on each other!’'\nWhile they have the ITVBe reality show to thank for their romance, the loved-up pair explained they had to work extra hard on their relationship in order to avoid the dreaded TOWIE curse that has broken up so many of their friends.\n'It only puts pressure on you if you allow other people to get involved,' Tommy said.\n'The curse is going on personal appearances and cheating on your girlfriend, but I haven’t done that.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300882/Georgia-Kousoulou-didn-t-like-beau-Tommy-Mallett-first.html"}
