{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 01:09:51","date_modify":"2018-10-23 01:09:51","date_publish":"2017-04-26 11:18:46","description":"He became a household name after wowing judges with his street dancing on Britain's Got Talent in 2008.","filename":"data/vaneerConsumption/GeorgeSampson23isfinallygettingahairtransplant.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F154E00000578-0-image-a-4_1493203427328.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447074_George-Sampson-23-finally-getting-hair-transplant_1540256991.html","title":"George Sampson, 23, is finally getting a hair transplant","title_page":"George Sampson, 23, is finally getting a hair transplant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He became a household name after wowing judges with his street dancing on Britain's Got Talent in 2008.\nBut George Sampson, 23, has revealed he is set to undergo a £9k hair transplant and years of head-spinning, amongst other things, have caused severe bald patches.\nTaking to Twitter on Wednesday, he wrote that he has been debating whether or not to go through with the procedure for years, but has decided to take the plunge.\nScroll down for video\n'It comes from head-spinning': 'Stressed' George Sampson, 23, revealed he's finally getting a £9k hair transplant on Wednesday after dance moves caused severe balding\nHow does he do it? George became famous for his daring head-spins while on BGT in 2008\nHe penned: 'So on the 26th April, 2017, I will be travelling to the Juvida clinic, Skipton, to have a HAIR TRANSPLANT...\n'This is something I've considered having done for years, I have always been convincing myself I'm not worried, or it's not a big deal but really it is.\n'I am only 23. It's not only for my own confidence but also being in my line of work which is very image orientated and unfortunately, I felt my hair (lack of) could affect my work.\nOpen and honest: George took to Twitter to tell his followers that he is going to be having the operation\n'My hair loss comes from three things; alopecia (caused by a lot of stress and loss of a family member), genetics and head spinning as the hair loss is not only a receding hair line but a strip down the centre of my head.'\nLamenting his situation, George said it was time for him to do something for his own confidence.\nHe continued: 'I spend so much time doing my hair (well Lauren does) to try and cover up as much as I can and to make use of the hair that I do have.\nClose: George says his partner Lauren has been helping him to style his hair in order to disguise his bald patches\n'I've decided I've had enough of that. I want my own hair. I am only 23 and balding seems like something which happens to older men.'\nHe concluded by thanking his fans for their support - his operation will take place on Wednesday.\nMeanwhile, the latest series of Britain's Got Talent is underway.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447074/George-Sampson-23-finally-getting-hair-transplant.html"}
