{"authors":[],"date_download":"2018-10-30 18:00:16","date_modify":"2018-10-30 18:00:16","date_publish":"2018-09-13 13:23:00","description":"The University of Georgia announced on Thursday that its football game against Middle Tennessee has...","filename":"data/vaneerConsumption/GeorgiamovesupSaturdaysgametimeduetoHurricaneFlorence.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/13/Videos/4482357.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_georgia-move_d58173d8b71df05fd4dcc69465c67179__1540922416.html","title":"Georgia moves up Saturday’s game time due to Hurricane Florence","title_page":"Georgia moves up Saturday’s game time due to Hurricane Florence","title_rss":"NULL","source_domain":"ajc.com","text":"The University of Georgia announced on Thursday that its football game against Middle Tennessee has been moved up to a noon kickoff.\n» More: High football games in Georgia affected by hurricane\nStatement from University of Georgia Athletic Association:\nAfter extensive evaluation involving the uncertainly of weather conditions on the east coast, and consideration of all constituencies involved including fans, support staff, and law enforcement, the Saturday Georgia-Middle Tennessee State game has been moved from 7:15 p.m. to a 12 noon kickoff in Sanford Stadium. The game will be televised on ESPN News and will stream live on the ESPN app. The University of Georgia encourages fans to support disaster relief efforts through the Red Cross by texting “REDCROSS’ to 90999 to donate $10 from your phone, call 1-800-RED CROSS, or go online.\nThe game can be heard on 95.5 FM and AM 750 WSB.\nFlorence weakened to a Category 2 storm Wednesday night, but Channel 2 Action News meteorologist Karen Minton said that sustained winds of 110 mph, with gusts of 130 mph, are still a serious threat to the Carolina coast.\nHurricane Florence made landfall Friday morning near Wrightsville Beach, a few miles east of Wilmington, as a Category 1 storm.\nLatest Florence Information relative to UGA Sanford Stadium. More information at National Hurricane Center https://t.co/sZBjakYgdc and https://t.co/hM8XeKLMzW. pic.twitter.com/V1w9KpUbil — UGAFootballWx (@UGAFootballWx) September 13, 2018\nThe No. 3-ranked Bulldogs (2-0) are coming off a 41-17 victory over South Carolina in Columbia last Saturday.\nThe Gamecocks, along with several other teams in the Carolinas, have canceled their schedule game this week.","url":"https://www.ajc.com/sports/college/georgia-moves-saturday-gametime-due-hurricane-florence/crWxW944c4Ed6vLpgOIGkN/"}
