{"authors":[],"date_download":"2018-10-30 20:50:56","date_modify":"2018-10-30 20:50:56","date_publish":"2018-08-23 22:46:00","description":"Tips took months to fully investigate, records show","filename":"data/vaneerConsumption/GeorgiaTechdraggeditsfeetoninvestigation.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/23/Images/newsEngin.22861131_Former-Georgia-Tech-administrators.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_georgi_d0b8e29f505d6489fea5025eb06a7d78__1540932656.html","title":"Georgia Tech dragged its feet on investigation","title_page":"Tipster: Georgia Tech dragged its feet on investigation","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia Tech reacted so slowly to anonymous ethics complaints last spring that a tipster threatened to go to the news media, in a move that elevated the case to authorities above the university and led to the resignation of three employees, according to records obtained by Channel 2 Action News.\n“Since you have done nothing but tip off the fraudsters and cover your own corrupt doings, this is going to Richard Belcher, so he can do something about it,” the tipster complained on Tech’s ethics website on May 15.\nA copy of that complaint, and several others obtained by Channel 2’s Belcher, depict a lethargic university ethics enforcement system that left concerned employees feeling isolated.\nTech President George P. “Bud” Peterson has been under a bright light since the wayward ethics controls at his university were exposed in July.\nHis boss, University System of Georgia Chancellor Steve Wrigley, told him in a letter Monday: “you are ultimately responsible.”\nPeterson has promised to “fix” the situation, and has already made some organizational changes.\nIt all seems to have started with the threat by that tipster to go public.\nThat mid-May complaint got action: Officials at the University System learned about it that day, emails show. Tech launched an investigation into the activities of three Tech administrators: Paul Strouts, Lance Lunsway and Tom Stipes. They resigned before the results were released July 26.\nThe tipster also complained that their boss, Executive Vice President Steve Swant, knew about their activities — from goofing off when they were supposed to be working to exploiting vendor relationships for personal benefit. Swant, though, did not disclose the information from his meeting with the tipster, university system officials said.\nSwant, a leader of one of Tech’s three big divisions who was making half a million dollars a year, was ultimately fired, but not because he failed to corral his wayward employees.\nPeterson fired him July 19, one day after the University System released the results of its own investigation. It turned out that Swant had been serving as a paid board member of a company with contracts to do work for Tech, and that Swant was helping the company get work at Tech, the system investigation said.\nPeterson knew about the former but not the latter, the University System determined. It launched its investigation after a tip on May 21 about Swant and his three employees bypassed Tech, going straight to the system’s hotline.\n“These issues have been going on and people raise them without any follow-up,” the tipster complained.\nGeorgia Tech’s Internal Auditing office received seven tips between March 16 and March 23 about Lunsway, Stipes, and Strouts, according to the reports obtained by Channel 2. The tips said Lunsway and Strouts falsely reported time away from the office to play golf and to go to a baseball game, and Strouts asked a vendor to pay for meals at Ferst Hall, a campus eatery. Strouts asked a vendor to take him and Lunsway golfing, but the vendor “is uncomfortable with this as she can’t see a business purpose,” the tipster reported.\nOne of the tips said the information had been forwarded to Swant. “Employees are concerned about retaliation,” the tipster reported.\nThe May 15 tip — the one to Tech that got the University System’s notice — showed clear frustration: “You people have been provided with MULTIPLE complaints with proof about high level fraud, theft, abuse, retaliation and many other things. You’re not getting another chance,” the tipster said.\nThe tip a week later that went straight to the University System’s hotline showed the corrosive effect on morale of a failure to enforce ethical behavior.\n“It’s not clear if these behaviors are okay or are ignored,” the May 21 tip says. “We’re trying to do the right thing, but seeing these types of things happen repeatedly is discouraging. Are these types of things okay to do?”\nAisha Oliver-Staley, who will become Tech’s interim vice president for ethics, compliance and risk management on Sept. 1, said in a message to faculty and staff Tuesday that to help Tech regain trust, ethics and other complaints will go to the University System’s Office of Organizational Effectiveness.\n“One of the recent breakdowns was the failure of management to properly handle an in-person complaint. It is important to me and to the success of Georgia Tech that every single complaint is pursued,” she wrote.","url":"https://www.ajc.com/news/local-education/georgia-tech-dragged-its-feet-investigation-tipster-complained/iOFOjZh511hbF9W8lTQbDI/"}
