{"authors":[],"date_download":"2018-10-30 19:37:04","date_modify":"2018-10-30 19:37:04","date_publish":"2018-09-14 20:36:00","description":"The Bulldogs held steady at No.","filename":"data/vaneerConsumption/GeorgiaMiddleTennesseeTVonlineradioinformation.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/13/Videos/4438103.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_georgia-midd_659ff1cfea4ac7f3944c7beace277a1a__1540928224.html","title":"Georgia-Middle Tennessee: TV, online, radio information","title_page":"Georgia-Middle Tennessee: TV, online, radio information","title_rss":"NULL","source_domain":"ajc.com","text":"The Bulldogs held steady at No. 3 in both national polls after their 41-17 road victory against South Carolina last weekend.\nThey take a break from SEC play as Middle Tennessee of Conference USA arrives in Athens.\nThe game was moved from a 7:15 p.m. start to a noon start because of the presence of Hurricane Florence in the Carolinas and the possibility that effects of the storm could reach parts of Georgia.\nHere is some important information regarding how to follow the action:\nTime: Noon ET\nDate: Saturday, Sept. 15\nLocation: Sanford Stadium, Athens\nTelevision: ESPN News will televise the game. Beth Mowins is handling play-by-play. Anthony Becht is the analyst, and Rocky Boiman is the sideline reporter.\nStreaming: The game is available online on GTV at georgiadogs.com.\nLocal radio: The game will be broadcast on the Georgia Bulldogs Sports Network, heard in metro Atlanta on WSB (750 AM/95.5 FM). Scott Howard is handling play-by-play. Eric Zeier is the analyst, and Chuck Dowdle is the sideline reporter.\nSatellite radio: You can listen on Sirius/XM Channel 113/192.\nHere are five other things you may want to know:\n» Georgia and Middle Tennessee have played once, a 29-10 Bulldogs victory in Athens in the second game of the 2003 season.\n» Middle Tennessee’s quarterback is Brent Stockstill, the son of Blue Raiders coach Rick Stockstill.\n» If Georgia again reaches 40 points scored, it would be the first time for the Bulldogs to reach 40 in each of its first three games since 2012. That season Georgia scored more than 40 points in each of its first five games.\n» The Blue Raiders are the first of three opponents from Tennessee scheduled to play at Sanford Stadium this season. Tennessee and Vanderbilt are set for games Sept. 29 and Oct. 6.\n» In each of its first two games, Georgia started three sophomores and a redshirt freshman on the offensive line.","url":"https://www.ajc.com/sports/college/georgia-middle-tennessee-online-radio-information/wLfUcXi6k8Wm2GC4NyMHeM/"}
