{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 01:35:25","date_modify":"2018-10-23 01:35:25","date_publish":"2016-01-28 15:55:13","description":"The 24-year-old actress was seen chowing down on a tasty pain au chocolat and a no doubt much needed coffee as they refuelled on their latest tour stop.","filename":"data/vaneerConsumption/GeorgiaMayFooteandGiovanniPernicechowdownontastytreats.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB497000000578-0-image-a-150_1453996503333.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421140_Georgia-Foote-boyfriend-Giovanni-Pernice-chow-tasty-treats-departing-Sheffield-rest-Strictly-crew-nationwide-tour-continues_1540258525.html","title":"Georgia May Foote and Giovanni Pernice chow down on tasty treats","title_page":"Georgia May Foote and Giovanni Pernice chow down on tasty treats | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're currently hotfooting across the UK on the Strictly Come Dancing tour.\nAnd partners on and off the stage, Georgia May Foote and Giovanni Pernice, clearly worked up an appetite as they grabbed a quick bite to eat from a coffee shop in Sheffield on Thursday.\nThe 24-year-old actress was seen chowing down on a tasty pain au chocolat and a no doubt much needed coffee as they refuelled on their latest tour stop.\nScroll down for video\nBit peckish? Strictly's Georgia May Foote and Giovanni Pernice appeared to have worked up an appetite as they grabbed a quick bite to eat from a coffee shop in Sheffield on Thursday\nThe former Coronation Street star was clad in a casual ensemble, as was her dancer beau, as they sauntered along the street together.\nWrapping up in the chilly weather, Georgia sported a knitted khaki jumper, which she paired with grey sweatpants and black hi-top trainers.\nShe added extra layers by wrapping a scarf around her neck, though ensured her look wasn't too androgynous by adding some large gold hoop earrings.\nSee more of the latest on the Strictly couple Georgia May Foote and Giovanni Pernice\nYum! The 24-year-old actress was seen chowing down on a tasty pain au chocolat and a no doubt much needed coffee as they refuelled on their latest tour stop\nDressed down: The former Coronation Street star was clad in a casual ensemble, as was her dancer beau, as they sauntered along the street together\nKeeping warm: Wrapping up in the chilly weather, Georgia sported a knitted khaki jumper, which she paired with grey sweatpants and black hi-top trainers\nHer brunette locks were swept into an easy top knot, while her face looked to be sporting a minimal make-up look - reinforcing just how comfortable she is around her man.\nGiovanni was dressed just as pared-back in a navy padded jacket and tracksuit bottoms as he too tucked into a sweet treat.\nGeorgia and the Sicilian dancing champion have already revealed that they are planning to move in together in London, and it seems that the prospect of spending an infinite amount of time together isn't the least bit daunting.\nBling bling! Georgia added extra layers by wrapping a scarf around her neck, though ensured her look wasn't too androgynous by adding some large gold hoop earrings\nSo, long! It looked as though the Strictly team were on their way out of the city as judges Len Goodman, Bruno Tonioli and Craig Revel Horwood were seen hauling their suitcases out of their hotel the same morning\nKeeping close: Jay McGuiness departed alongside dance partner Aliona Vilani\nSpeaking to Star Magazine, the actress revealed: 'At the end of the tour it will be six months where we've been together every single day.'\nAnd while after one month many couples are still unsure of each other, Georgia explained she's hoping to replicate the 'amazing experience' she had with Giovanni on TV on the live tour.\n'We had such an amazing experience on Strictly,' she said. 'It's nice to be able to go on tour together now and experience this together now.'\nSwoon: Gleb Savchenko looked typically handsome as he posed for photos with fans before leaving the city\nLooking good! Helen George and Anita Rani both opted for stylish jumpsuits for their day in the city\nIt looked as though the Strictly team were on their way out of the Northern city as judges Len Goodman, Bruno Tonioli and Craig Revel Horwood were seen hauling their suitcases out of their hotel the same morning.\nCelebrity dancers Jay McGuiness, Ainsley Harriot, Jake Wood, Frankie Bridge, Anita Rani and Helen George were also seen departing the hotel, as well as tour host Mel Giedroyc.\nOn to the next one: Ainsley Harriot cut a casual figure in a padded jacket and sweatpants\nTravelling in style: Jake Wood and pop star Frankie Bridge whizzed off in the EastEnders actor's convertible\nToned: Professional Karen Clifton showcased her dance-honed legs in printed leggings","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421140/Georgia-Foote-boyfriend-Giovanni-Pernice-chow-tasty-treats-departing-Sheffield-rest-Strictly-crew-nationwide-tour-continues.html"}
