{"authors":[],"date_download":"2018-10-30 18:00:21","date_modify":"2018-10-30 18:00:21","date_publish":"2018-09-11 19:23:00","description":"From the Atlantic coast to the Atlanta airport, officials across Georgia are preparing to help states expected to be hit by Hurricane Florence, while hoping the massive storm doesn’t turn south.","filename":"data/vaneerConsumption/Georgiapreparesforstormwatchesforecast.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/10/Videos/4479906.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_power-mass-outag_7a04bf3041b55a6d93c8f44cca373cff__1540922421.html","title":"Georgia prepares for storm, watches forecast","title_page":"Hurricane Florence: Georgia prepares for storm, watches forecast","title_rss":"NULL","source_domain":"ajc.com","text":"From the Atlantic coast to the Atlanta airport, officials across Georgia are preparing to help states expected to be hit by Hurricane Florence, while hoping the massive storm doesn’t turn south.\nOn Tuesday, the Category 4 storm was projected to strike farther north, leading governors to declare states of emergency in South Carolina, North Carolina, Maryland and Virginia. Georgia Gov. Nathan Deal’s office was monitoring the storm's path and coordinating with coastal communities in case Florence makes a sudden southward shift.\nState emergency and utility workers were planning to help those closer to the projected Thursday landfall in North Carolina.\nGeorgia Power doesn’t expect mass power outages, if the forecast holds.\n“These storms can change paths pretty quickly,” said spokeswoman Meredith Stone. “It is very early. It’s a fluid situation.”\nThe Georgia Emergency Management and Homeland Security Agency activated its special operations center in Atlanta, where employees were preparing for a potential influx of evacuees from other states. They also urged preparedness in Georgia, just in case.\n“We encourage everyone to take this opportunity as a reminder to prepare their ready kits and review communications plans for their family, and to pay attention to guidance from local officials and trusted news sources for the most updated information,” said Catherine Howden, the agency’s chief of staff.\nHartsfield-Jackson International Airport employees were getting ready for stranded travelers if flights into areas affected by the storm are grounded.\nAtlanta-based Delta Air Lines has capped fares for certain flights out of cities in the path of the hurricane and is waiving a change fee for travelers with flights booked to, from or through affected cities. The airline is also temporarily waiving fees for all baggage and pets in the airplane cabin for those same flights.\nDelta said it has not announced how many flights may be canceled due to the hurricane, because it typically has enough detail to predict the exact impact of a hurricane to airports it serves within 48 hours of the storm hitting land.\nUtility companies also need to wait to see if they’ll be needed to help in other states.\nAt this point, Georgia Power hasn’t been asked to deploy crews to any other states, the spokeswoman said. Even if such a request comes, Stone said the company would make sure Georgia faces no threat of mass outages before sending crews out of state.\nRELATED: Florence may miss Georgia, but residents aren’t taking chances\nAlso: A look at some of Georgia’s worst hurricanes\nAnd: Where is Florence now?\nAs long as needs don’t emerge in Georgia, electric cooperatives in the state are planning to send about 150 line workers to South Carolina to help restore power. Terri Statham, a spokesperson for the Georgia EMC, said the number of EMCs and personnel from Georgia lending help could increase depending on the severity of the hurricane and the extent of damage.\nOne of the states’ most important economic engines, the Georgia ports, remained in normal operations Tuesday, said Georgia Ports Authority executive director Griff Lynch.\nSome ship traffic headed south toward Georgia will be delayed by the storm. But Lynch said he doesn’t expect any impact on the 60 percent of Georgia port traffic that arrives from farther south.\nPorts are nearly midway through peak deliveries of imported goods arriving for the retail holiday season, he said. Lynch said he doesn’t expect delays in those deliveries to the state’s Savannah port.\nAt the Georgia Department of Transportation, spokeswoman Natalie Dale said the number of responding CHAMP operators has been increased on I-20, I-95 and I-16 in anticipation of increased traffic as residents of South Carolina prepare to evacuate. The CHAMP units provide highway assistance, clear debris and help at accident scenes.\nAJC reporters Greg Bluestein, Kelly Yamanouchi, Mitchell Northam, Matthew Kempner and David Wickert contributed to this report.\n» For a detailed forecast, visit The Atlanta Journal-Constitution weather page.\n» Download The Atlanta Journal-Constitution app for weather alerts on-the-go.","url":"https://www.ajc.com/news/local/power-mass-outages-not-expected-from-florence-but-early/ozdqpV0lHSlYoDtAyp9L0J/"}
