{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:59:20","date_modify":"2018-10-30 19:59:20","date_publish":"2016-09-12 01:18:37","description":"Staff at a Veterans' Affairs hospital in Georgia granted a dying veteran his two last wishes: to be baptized and to go fishing one last time.","filename":"data/vaneerConsumption/GeorgiaVeteransDyingWishtoBeBaptizedGoFishingIsGranted.json","image_url":"https://media.breitbart.com/media/2016/09/georgia-veteran-gets-dying-wish-to-go-fishing-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_11__1540929560.html","title":"Georgia Veteran's Dying Wish to Be Baptized, Go Fishing Is Granted","title_page":"Georgia Veteran's Dying Wish to Be Baptized, Go Fishing Is Granted | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Staff at a Veterans’ Affairs hospital in Georgia granted a dying veteran his two last wishes: to be baptized and to go fishing one last time.\nU.S. Navy Veteran Connie Willhite told the VA staff at Carl Vinson VA Medical Center in Dublin that he wanted to be baptized so he could “crossover” to the next life and that he wanted to go fishing one last time.\nThe VA chaplain performed the baptism ceremony in Willhite’s room.\nThe fishing trip, however, required a lot more ingenuity on the part of the VA staff.\nWillhite had to remain bedridden because of his advanced colon cancer, but that didn’t stop VA staff members from granting his dying wish.\nGreg Senters, a social worker at the VA hospital, arranged for a mobile motorized hospital bed for Willhite so he could fish from the lake located behind the hospice unit at the VA center, KTLA reported.\nWillhite didn’t even care if he caught any fish, but the 69-year-old Navy veteran wound up catching a few fish.\n“There’s nothing like fishing. Even when they’re not biting, it’s still a good day to be outside, Willhite said to KSLA, “I know I’m dying and the cancer is going to get me, but as long as I can go, I want to fish.”\n“I’ll never forget the look on his face… Seeing Mr. Willhite achieve success in his final days was more than gratifying, it’s a memory that I’ll always cherish. Moments like that make me proud to be in social work and to serve veterans,” Senters said to KSLA.\nWillhite died peacefully three days after his last fishing trip.","url":"https://www.breitbart.com/politics/2016/09/11/georgia-veteran-dying-wish-go-fishing-last-time/"}
