{"authors":[],"date_download":"2018-10-30 20:52:23","date_modify":"2018-10-30 20:52:23","date_publish":"2018-07-27 22:31:00","description":"Georgia Tech President George P.","filename":"data/vaneerConsumption/GeorgiaTechinvestigationsrevealmisspendingethicsissues.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/27/Images/newsEngin.22638834_Andrew-Gerber.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional_tech-p_87d4e7e9affeb905550129411630d8d2__icmp=np_inform_variation-test_1540932743.html","title":"Georgia Tech investigations reveal misspending, ethics issues","title_page":"Georgia Tech investigations reveal misspending, ethics issues","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia Tech President George P. “Bud” Peterson has agreed to tighten his oversight over employee compliance with ethics policies after a series of scandals caught the attention of his bosses.\nThe University System of Georgia, as it happens, will have an ethics awareness week in mid-November, noted Chancellor Steve W. Wrigley in an email to Peterson last week. “I expect a strong and visible presence and participation from you and your senior leadership team,” Wrigley wrote.\nThe email said Peterson had agreed to more substantial changes aimed at tightening controls to avoid more violations of the type that have resulted in the departures of several senior staffers.\nThree top administrators recently resigned amid recent internal investigations and another was fired.\nRELATED: Lax oversight allowed high-paid Tech officials to misuse tax money\nThe scandals that prompted their departures were only the latest signs of weak oversight at Tech.\nOn June 5, Tech removed Andrew Gerber from his leadership role at the affiliated Georgia Tech Research Institute, a spokeswoman said on Friday. Gerber, who was paid about $400,000 a year, subsequently resigned.\nGerber was the focus of an April report by Channel 2 Action News that said GTRI had spent more than $1 million on employee “morale” events. The spending included $73,000 for Georgia Aquarium visits by employees and their families, $109,000 for a staff picnic at Six Flags, $26,000 at a Braves game, nearly $12,000 for go-karts and laser tag at Andretti’s and $7,300 at Topgolf, including more than $1,000 in cocktails, beer and wine.\nTech initially defended the use of the federal money, but the tone changed after Wrigley’s team looked into it.\nA May 25 letter to Peterson from John M. Fuchko, one of Wrigley’s vice chancellors, describes an ethics reporting system that seemed designed for abuse, with an organizational chart that “substantively and symbolically” marginalized an ethics and compliance officer.\nOne of the top executives who designed that org chart, Executive Vice President Steven C. Swant, was fired by Peterson last week, the day after he got the results of a separate investigation into Swant’s dual roles as both the member of a company board and the leader of the division that hired the company as a vendor for Tech, Channel 2 reported Thursday.\nThese are only the latest scandals at GTRI. In 2016, three employees were indicted on federal charges involving Georgia Tech purchasing cards and consulting activities. The charges against James G. Maloney, GTRI’s principal research engineer, are still pending. The two other employees pleaded guilty and are awaiting sentencing.\nWrigley’s email to Peterson last week gave the Tech president until Aug. 15 to overhaul his ethics oversight, noting the changes they’d agreed upon.\nPeterson didn’t wait on one of the measures, sending an all-campus email Thursday that said the internal auditor is already reporting directly to him.","url":"https://www.ajc.com/news/state--regional/tech-president-tightening-ethics-controls-after-money-scandals/4tLIZknhtoHepDp64iL0dJ/?icmp=np_inform_variation-test"}
