{"authors":["Greg Bluestein"],"date_download":"2018-10-30 19:07:46","date_modify":"2018-10-30 19:07:46","date_publish":"2014-11-24 16:12:54","description":"Georgia's top emergency management official, who weathered a series of mishaps during the icy blast...","filename":"data/vaneerConsumption/Georgiasonceembattledemergencymanagementchieftostepdown.json","image_url":"https://politics.myajc.com/rf/image/PortalConfig/np-paid/assets/politics.myajc/images/og-share-icon.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_georgia-once-_d22799dc94d73032efaac9374e5abba5__1540926466.html","title":"Georgia's once-embattled emergency management chief to step down","title_page":"Georgia's once-embattled emergency management chief to step down","title_rss":"NULL","source_domain":"ajc.com","text":"Charley English, who has led the Georgia Emergency Management Agency since 2006, will become the office's deputy director. He is to be replaced by Jim Butterworth, a former Republican state senator who has headed the Georgia National Guard since 2011.\nJoe Jarrard, a 20-year Army veteran who is Butterworth's top deputy, will now lead the Guard.\nEnglish was on the hot seat in late January after the icy wave that left thousands of motorists stranded on gridlocked north Georgia streets for hours. But he seemed to have redeemed himself in the eyes of Deal and other top state officials for his handling of another blast of wintry weather that struck just two weeks later.\nIt's one part of a broader staff change, which will take root in January, that was set in motion by the governor's re-election.\nAmong the changes: Gretchen Corbin, who heads the Department of Community Affairs, will helm Georgia’s tech school system. And Camila Knowles, retiring U.S. Sen. Saxby Chambliss’ top aide, is taking Corbin’s job.\nOne name not mentioned in Deal's internal overhaul is Harris Blackwood, the highway safety chief who recently apologized for making inappropriate comments to staffers. Deal's aides have said he enjoys the full confidence of the governor.\nEnglish, a decades-long public servant who came to GEMA in 1996, took responsibility in January for the state's response to the icy January front that made Georgia the butt of national jokes.\nHe apologized for failing to awaken Deal early Jan. 28 when national forecasters updated winter warnings and urged drivers to stay off the road. And he vowed to act with more urgency after documents obtained by the AJC suggested a lackadaisical approach (“Sure is warm outside,\" he said in one dispatch) to the approaching weather.\nDeal stuck by English amid mounting criticism, which included a Change.org petition calling for his ouster.\nThe governor would later say his faith in the veteran administrator had paid off.\nYou can read more about the staff shakeup at myajc.com by clicking right here.","url":"https://politics.myajc.com/blog/politics/georgia-once-embattled-emergency-management-chief-step-down/8kTUD0j4FlyGMjFEE0lR5K/"}
