{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 00:55:33","date_modify":"2018-10-23 00:55:33","date_publish":"2016-01-28 15:00:08","description":"The reality stars looked refreshed and ready to entertain the masses with more of their outrageous antics as they each grinned from ear to ear while sauntering through the city's train station.","filename":"data/vaneerConsumption/GeordieShoresChloeFerryandMarnieSimpsoninNewcastletoshootnewseries.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAEB2700000578-0-image-a-132_1453992279653.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420991_The-girls-Toon-Geordie-Shore-s-Chloe-Ferry-Marnie-Simpson-snatch-attention-cast-return-Newcastle-shoot-new-series_1540256133.html","title":"Geordie Shore's Chloe Ferry and Marnie Simpson in Newcastle to shoot new series","title_page":"Geordie Shore's Chloe Ferry and Marnie Simpson in Newcastle to shoot new series | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They've spent the past couple of months enjoying a break from their on-screen mayhem.\nBut the cast of Geordie Shore were seen touching down in Newcastle on Wednesday as they prepared to shoot yet another season of the wild MTV show.\nThe reality stars looked refreshed and ready to entertain the masses with more of their outrageous antics as they each grinned from ear to ear while sauntering through the city's train station.\nScroll down for video\nHere come the girls! The cast of Geordie Shore were seen touching down in Newcastle on Wednesday as they prepared to shoot yet another season of the wild MTV show (Pictured: Chloe Ferry and Chantelle Connelly)\nIn typical fashion, cast member Chloe Ferry ensured all eyes were on her as she sauntered through the station with her case, before accidentally toppling it over in the street.\nThe 21-year-old braved the cold in an over-sized checked shirt, while she teamed with leggings and, somewhat bizarrely, a pair of flip flops as she chatted with co-stars Chantelle Conelly and Marty McKenna.\nShe attempted to banish the cold beneath a khaki bomber jacket, around which her raven locks cascaded.\nCamera shy? A coy Marnie Simpson concealed her face beneath a baseball cap as she dared to go bare-legged in a knitted jumper dress\nEntertaining: Chloe ensured all eyes were on her as she sauntered through the station with her case alongside co-star Marty McKenna\nChantelle opted for a more sporty style in a velvet navy tracksuit that she brought to life with neon Nike trainers and a zebra print handbag.\nShe tied her brunette tresses into an easy ponytail, atop of which was an embellished black baseball cap.\nAlso rocking some sporty headwear was Marnie Simpson, which she used to conceal her face as she pounded the pavement in a knitted sweater dress and lace-up tan boots.\nBeaming: The reality stars looked refreshed and ready to entertain the masses with more of their outrageous antics as they each grinned from ear to ear while sauntering through the city's train station\nWhoops! 21-year-old Chloe saw the funny side after knocking over her suitcase in the street\nPared-downL Chantelle Connelly opted for a more sporty style in a velvet navy tracksuit that she brought to life with neon Nike trainers and a zebra print handbag\nAnimated: Marty looked excitable as always as he marched through the train station\nCo-star Gary 'Gaz' Beadle was also seen arriving in his native city alongside Aaron Chalmers, with the close friends seemingly clad in matching black tracksuits, and even the same style of trainer.\nThe outing marked the first time that Gaz has been seen since a suspicious video surfaced over the weekend of him snorting white powder.\nMaking his over 2 million Twitter followers aware of his return to the reality series on Thursday, the 27-year-old posted two tweets, with the first reading: 'It's that time again,' punctuated with a camera emoji, while the second aptly stated: 'Byyyeeeee'.\nThe boys are back in Toon! Gary 'Gaz' Beadle arrived in his native city alongside Aaron Chalmers, with the close friends seemingly clad in matching black tracksuits, and even the same style of trainer\nStill smiling: The outing marked the first time that Gaz has been seen since a suspicious video surfaced over the weekend of him snorting white powder","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420991/The-girls-Toon-Geordie-Shore-s-Chloe-Ferry-Marnie-Simpson-snatch-attention-cast-return-Newcastle-shoot-new-series.html"}
