{"authors":[],"date_download":"2018-10-30 18:48:22","date_modify":"2018-10-30 18:48:22","date_publish":"2018-09-04 19:28:00","description":"Committee to study how short summer breaks and varied fall start dates are affecting tourism industry","filename":"data/vaneerConsumption/Georgiasenatorstostudyschoolsummervacationtiming.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/05/26/Images/newsEngin.18788066_OhanaPreviewParty_25mar17--15-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-educat_7a77f278ee7a6dc343fa505f3d083e60__1540925302.html","title":"Georgia senators to study school summer vacation timing","title_page":"Georgia Senate to study economic effect of school calendars on tourism","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia senators will weigh the effect of the state’s varied back-to-school calendars on tourism.\n“Our goal is to determine if a later start date is feasible,” said Sen. Steve Gooch, R-Dahlonega.\nThe statement by the Senate majority whip was released minutes before 6:30 p.m. Friday, a spot in the news cycle unlikely to attract much attention, especially before a holiday weekend.\nSchool calendars proved contentious in some metro Atlanta districts, including Cobb and DeKalb counties, earlier this decade. Many have adopted so-called “balanced” calendars featuring shorter summer breaks, with additional brief breaks sprinkled throughout the school year. The timing is out of sync with the Northeast, where school tends to resume closer to the fall.\nVIDEO: More on back-to-school\nVIDEO: Learn more about back-to-school vaccinations in Georgia (Mandi Albright/The Atlanta Journal-Constitution)\nOne goal in Georgia was to reduce the summer “slide” effect, as the long break led too many children to forget what they’d just learned, starting the fall semester behind where they’d been in the spring.\nBut summer is also an important time for the state’s tourism industry, with its half a million jobs and its $61 billion estimated “economic impact,” notes Senate Resolution 1068, of which Gooch was the chief co-sponsor.\n“Whereas, the summer travel season is a prime revenue generator for the industry,” the industry employs students and “varied school start dates affect both employment and visitation opportunities,” says the resolution adopted during this year’s legislative session, it would be a good idea for the Senate to empanel a committee to study the issue.\nThe statement Friday said Lt. Gov. Casey Cagle was appointing Gooch to lead the committee.\nThe Georgia Travel Association applauded Gooch and the Senate leadership “for taking steps to fully examine Georgia’s school start date and its impact on the state’s tourism industry ... .” The association wants “sensible guidelines” for more uniformity in school start dates, which currently are set by each of the state’s 180 local school boards.\n“We look forward to working with this committee to take a comprehensive look at an issue that has a significant impact on our students, families and communities,” the association said.\nThe 11-member committee will include the chairmen of the Senate Economic Development and Tourism, Education and Youth, and Appropriations committees. It has until Dec. 1 to report its findings — a month ahead of the 2019 legislative session.","url":"https://www.ajc.com/news/state--regional-education/georgia-senators-study-summer-vacation-timing/Qb9fU9XQfYpE7T0WQIslHP/"}
