{"authors":["Hugo Duncan","James Salmon For The Daily Mail"],"date_download":"2018-10-22 20:05:43","date_modify":"2018-10-22 20:05:43","date_publish":"2016-01-29 00:24:12","description":"Analysts warned that the slowdown could hit British tax receipts as profits and wages disappoint, forcing the Chancellor to announce another raid on middle-class households to make ends meet.","filename":"data/vaneerConsumption/GeorgeOsborneleftstrugglingtobalancethebooksafteroutputfallsby07.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/2FE358DC00000578-0-image-a-27_1454027034243.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421948_Middle-classes-face-fresh-tax-raids-growth-slows-Osborne-left-struggling-balance-books-output-falls-0-7_1540238743.html","title":"George Osborne left struggling to balance the books after output falls by 0.7%","title_page":"George Osborne left struggling to balance the books after output falls by 0.7%  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Analysts warned that the slowdown could hit British tax receipts as profits and wages disappoint, forcing the Chancellor to announce another raid on middle-class households to make ends meet\nBritain faces another round of painful tax rises as the slowing economy leaves George Osborne struggling to balance the books, experts warned last night.\nOfficial figures showed output rose 2.2 per cent in 2015 – down from 2.9 per cent in 2014 and weaker than the 2.4 per cent expected by the Treasury.\nIt is now feared that growth will not be as strong as anticipated this year as turmoil in financial markets and the downturn in China take their toll on Britain.\nAnalysts warned that the slowdown could hit tax receipts as profits and wages disappoint, forcing the Chancellor to announce another raid on middle-class households to make ends meet.\nThe weaker-than-expected growth is also likely to delay any interest rate rise until late this year, or well into next year.\nMr Osborne, who last week warned that the UK faced ‘a dangerous cocktail of risks’ from around the world, conceded that there could be ‘bumpy times ahead’.\nBut he added that Britain was ‘growing steadily’ and must ‘stick to the plan’.\nExperts warned that the Chancellor might raise taxes, such as duty on fuel and beer, to make ends meet.\nSam Alderson, of the Centre for Economics and Business Research, said: ‘We think there will be some tax rises. We expect fuel duty will start to rise given what is happening with petrol prices. There could be other rises in duties such as on alcohol. Beer duty has been cut and others have been frozen so we could see some rises’.\nIt is also feared that the Chancellor is planning a raid on savers’ pension pots. Money Mail has launched a campaign to stop the Treasury targeting middle-class savers’ tax breaks to raise funds.\nThe economy grew by 0.5 per cent in the final three months of 2015. This was up from 0.4 per cent between July and September, but still meant output rose by just 2.2 per cent across the whole of last year.\nGrowth in the fourth quarter of 2015 was driven by the services sector, where output rose 0.7 per cent. Industrial production fell 0.2 per cent and construction was down 0.1 per cent, suggesting the recovery remains unbalanced.\nLLOYDS SHARES SALE DELAYED The Chancellor has delayed plans to sell £2billion of Lloyds shares to the public because of stock market turmoil. George Osborne had intended to offload taxpayers’ final stake in the state-backed lender in the spring, but Lloyds’ share price has fallen from 78p when he announced details of the sale in October to just over 64p yesterday. A sale at this level would be a loss for taxpayers as it is well below the 73.6p ‘break even’ price paid by the previous government during the £20.5billion bailout of the bank in 2008. Mr Osborne said yesterday he would not give the go-ahead for the sale until the markets have calmed down. ‘We will sell Lloyds to the British people but we will do so when the time is right,’ he added.\nBritain was the strongest economy in the Group of Seven leading industrialised nations in 2013 and 2014 – but figures today are likely to show it lagged behind the US last year.\nBorrowing has fallen from a record of more than £153billion under Labour in 2009-10 to £94.7billion last year.\nBut experts believe the Government will borrow more than the £73.5billion planned by the Treasury this year. That could put Mr Osborne’s goal of running a surplus of £10.1billion in 2019-20 in jeopardy – unless he raises taxes or cuts spending.\nPhilip Shaw, an economist at banking group Investec, said: ‘The Chancellor has so much political capital invested in achieving a surplus that he would do almost anything to achieve it.’\nMr Osborne has already announced £91billion of tax rises since the election. The increases – which cover the five years to 2020-21 – have been only partly offset by £36billion of tax cuts.\nMr Osborne said: ‘There may be bumpy times ahead ... we must stick to the plan that’s cutting the deficit, attracting business investment and creating jobs.’","url":"https://www.dailymail.co.uk/news/article-3421948/Middle-classes-face-fresh-tax-raids-growth-slows-Osborne-left-struggling-balance-books-output-falls-0-7.html"}
