{"authors":[],"date_download":"2018-10-30 19:37:08","date_modify":"2018-10-30 19:37:08","date_publish":"2018-09-14 20:12:00","description":"A rough outing at South Florida last weekend leaves Georgia Tech hungry for a win in its ACC opener...","filename":"data/vaneerConsumption/GeorgiaTechPittsburghTVonlineradioinformation.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/30/Videos/4428275.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_georgia-tech_727c459baa5717bc7b7dc87410dc76e7__1540928228.html","title":"Georgia Tech-Pittsburgh: TV, online, radio information","title_page":"Georgia Tech-Pittsburgh: TV, online, radio information","title_rss":"NULL","source_domain":"ajc.com","text":"A rough outing at South Florida last weekend leaves Georgia Tech hungry for a win in its ACC opener Saturday.\nThe Yellow Jackets are 1-1 as they travel to Pittsburgh to take on the Pitt Panthers. Waiting for them will be a Panthers team a week removed from a 51-6 thrashing at home against Penn State.\nB-back KirVonte Benson was injured against South Florida and will miss the Jackets’ remaining games. Linebacker David Curry was called for targeting in the second half Saturday and will miss the first half of the game at Pitt.\nHere is some important information regarding how to follow the action:\nTime: 12:30 p.m. ET\nDate: Saturday, Sept. 15\nLocation: Heinz Field, Pittsburgh\nTelevision: Fox Sports South will televise the game. Wes Durham is handling play-by-play. James Bates is the analyst, and Rebecca Kaple is the sideline reporter.\nStreaming: The game is available online at WatchESPN.com.\nLocal radio: The game will be broadcast on the Georgia Tech IMG Sports Network, heard in metro Atlanta on The Sports X 1230/106.3. Andy Demetra is handling play-by-play. Sean Bedford is the analyst, and Wiley Ballard is the sideline reporter.\nSatellite radio: You can listen on Sirius/XM Channel 105/392.\nHere are five other things you may want to know:\n» Pitt leads the all-time series against Tech 7-5, but the Yellow Jackets have won three of their past five games against Pitt, all since the Panthers joined the ACC for the 2013 season.\n» Last season at Bobby Dodd Stadium, Tech defeated Pitt 35-17.\n» The Jackets rushed for 419 yards Saturday at South Florida, after rushing for 439 yards the previous week against Alcorn State.\n» If the Jackets lose against Pitt, Tech’s record would fall to 1-2 for the first time since 2003. That season Tech’s first three games included road losses at BYU and Florida State, with a home victory against Auburn sandwiched between the losses.\n» Tech is 20-15 all-time in ACC openers.","url":"https://www.ajc.com/sports/college/georgia-tech-pittsburgh-online-radio-information/uAw7csBrZBRRhAhrKxHprJ/"}
