{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:37:57","date_modify":"2018-10-30 21:37:57","date_publish":"2015-05-05 11:35:27","description":"UPDATE: This post erroneously stated that no James Beard Awards went to Georgians -- in fact, Keith...","filename":"data/vaneerConsumption/Georgialosesoutforchefawardsat2015JamesBeardAwards.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/05/05/Images/WPIMAGE_cmgajcfoodandmore_3229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ge_62d5a378eb277a2cda1ffa394d2c20f0__1540935477.html","title":"Georgia loses out for chef awards at 2015 James Beard Awards","title_page":"Georgia loses out for chef awards at 2015 James Beard Awards","title_rss":"NULL","source_domain":"ajc.com","text":"UPDATE: This post erroneously stated that no James Beard Awards went to Georgians -- in fact, Keith Schroeder, chef and founder of High Road Craft Ice Cream in Marietta, won a Focus on Health book award for \"Cooking Light Mad Delicious: The Science of Making Healthy Food Taste Amazing.\" The award was announced in April at the James Beard Foundation's Book, Broadcast & Journalism Awards Dinner in New York.\nOriginal post:\nAll of Georgia semifinalists for cooking at this year's James Beard Awards were knocked out of contention before last night's big event in Chicago -- except for one. When the semifinalists were whittled down to final nominees in March, Steven Satterfield, the executive chef at Miller Union up for the Best Chef: Southeast award, was the state's last hope for recognition.\nIt wasn't meant to be -- the award went to Jason Stanhope, the chef at FIG in Charleston, S.C. It was the third year in a row that Satterfield was up for the award, and was endorsed by Eater as the chef who should take the prize this year.\nCheck out the full list of winners here.\nMORE:\nRead about Satterfield's battle with testicular cancer\nSatterfield shares his healthy dishes for summer","url":"https://www.ajc.com/blog/atlanta-restaurants/georgia-loses-out-for-chef-awards-2015-james-beard-awards/2l8dK2Im6jnHq0lTthLpYL/"}
