{"authors":[],"date_download":"2018-10-30 20:33:48","date_modify":"2018-10-30 20:33:48","date_publish":"2014-08-05 23:13:16","description":"How to address a staggering $74 billion shortfall in Georgia’s transportation funding needs over the next two decades?","filename":"data/vaneerConsumption/Georgialawmakerswrestlewithtransportationfunding.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/08/06/Images/photos.medleyphoto.5875652.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_georgia_1890481099f4d727ea5d85144ed45da8__1540931628.html","title":"Georgia lawmakers wrestle with transportation funding","title_page":"Georgia lawmakers wrestle with transportation funding","title_rss":"NULL","source_domain":"ajc.com","text":"How to address a staggering $74 billion shortfall in Georgia’s transportation funding needs over the next two decades?\nThat is the question a group of state lawmakers will be wrestling with over the next three months.\nThe message from citizens, transportation experts, government leaders and business professionals who lined up to talk at the first of eight meetings Tuesday was nearly universal: The federal government is not coming to the rescue, and Georgia must find a way forward that relies less on Uncle Sam. Currently, two-thirds of the money spent on road and bridge construction projects in the state comes from the federal government.\n“We cannot and really should not depend on the federal government to meet our needs,” Georgia Department of Transportation Commissioner Keith Golden warned.\nA sharply divided Congress has been unable to agree on a long-term transportation funding bill since the last one expired in 2008, and has instead put in place a series of temporary patches.\nLast week, federal lawmakers approved yet another patch, which will last through May. That move narrowly averted a 28 percent reduction in money flowing to the states that would have taken effect Aug. 1.\nPolitics aside, the trust fund is dwindling. Its revenue comes from an 18.4-cent-per-gallon federal tax on motor fuel, which hasn’t been raised since 1993. Over those two decades, cars have become more fuel-efficient, meaning Americans are paying less into the fund.\nThe state’s legislative study committee on transportation infrastructure funding will make recommendations in November that will likely become a basis for legislation in January.\nFormer U.S. Transportation Secretary Ray LaHood told the committee that Georgia is not the only state struggling with inadequate resources to fix a growing backlog of transportation needs.\n“Every transit system is 50 years old and crumbling,” LaHood said. “The interstates are crumbling. Bridges are falling down.”\nAt the state level, one idea to generate more money is to capture the fourth penny of the state’s 4 percent motor fuel sales tax. That money, about $180 million a year, is currently diverted to the general fund.\nOther suggestions include increasing the flexibility of local governments to raise sales taxes for transportation, and possibly even raising the state motor fuel tax.\nBut any tax increase could be politically unpopular, a fact which the lawmakers know all too well. A proposed regional transportation sales tax was overwhelmingly rejected by voters in most parts of the state in 2012.\nTuesday, State Sen. David Lucas, D-Macon, asked a representative from the Georgia Chamber of Commerce if the group will support legislators if they have to explain to tax-averse constituents why they should raise the state motor fuel tax.\nThe chamber rep, Michael Sullivan, assured him that it would. “We’ll be in front of the line, taking the bullets for you” Sullivan said, if a good case can be made for doing so.\nOthers, like Benita Dodd of the Georgia Public Policy Foundation, a limited-government think tank, urged the group to look at other alternatives. Dodd recommended public-private partnerships and imposing more user fees, such as tolls on new and existing roads.","url":"https://www.ajc.com/news/transportation/georgia-lawmakers-wrestle-with-transportation-funding/iyltaZzICV0fpadEbqmNmI/"}
