{"authors":[],"date_download":"2018-10-30 18:06:47","date_modify":"2018-10-30 18:06:47","date_publish":"2016-11-10 19:45:49","description":"Stop what you're doing and watch this adorable video featuring Georgia Aquarium sea lions participat...","filename":"data/vaneerConsumption/GeorgiaAquariumsealions.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/10/Images/Screen%20Shot%202016-11-10%20at%202.33.47%20PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_georgia-aquarium_037e31ecdd11c176e759d12fb0aa3489__1540922807.html","title":"Georgia Aquarium sea lions","title_page":"Mannequin Challenge: Georgia Aquarium sea lions","title_rss":"NULL","source_domain":"ajc.com","text":"Stop what you're doing and watch this adorable video featuring Georgia Aquarium sea lions participating in the viral #MannequinChallenge sensation.\nOur sea lions did the (almost) perfect #mannequinchallenge. pic.twitter.com/R6Za3nzfZL — Georgia Aquarium (@GeorgiaAquarium) November 10, 2016\nGeorgia Aquarium shared the video on Twitter, writing: \"Our sea lions did the (almost) perfect #mannequinchallenge.\"\nRELATED: 10 things you didn’t know about the Georgia Aquarium\nThe viral #MannequinChallenge involves participants holding frozen poses and standing still—just like a mannequin—to capture their dramatic stills on film.\nThe craze started in late October when a group of students sat motionless in different poses in a 45-second video posted to Twitter with the misspelled hashtag #manquinchallenge.\nThe videos are set to the song \"Black Beatles\" by rap duo Rae Sremmurd. According to The Telegraph, the duo participated in the video meme during a concert in Denver when they asked the crowd to stay still while they recorded.\nNow celebrities, sports stars and even staffers at The Atlanta Journal-Constitution have joined the internet craze. Watch below:","url":"https://www.ajc.com/news/local/georgia-aquarium-sea-lion-mannequinchallenge-the-best-thing-you-see-all-day/Jbd4zCnxI2OBQ3d4NP3PON/"}
