{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-22 22:09:57","date_modify":"2018-10-22 22:09:57","date_publish":"2016-01-28 09:54:06","description":"The official figures from the Office for National Statistics showed growth in the final part of 2015 was marginally stronger than earlier in the year. Overall economic growth for the year was to 2.2%.","filename":"data/vaneerConsumption/GeorgeOsborneinsistsBritainispushingaheadthroughglobalturbulence.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A913CE00000578-0-image-a-18_1453975194010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420609_George-Osborne-insists-Britain-pushing-ahead-global-turbulence-new-economic-data-showed-economy-grew-0-5-cent-end-2015_1540246197.html","title":"George Osborne insists Britain is 'pushing ahead through global turbulence'","title_page":"George Osborne insists Britain is 'pushing ahead through global turbulence' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britain's economy grew by 0.5 per cent in the last quarter of 2015 and Chancellor George Osborne today said the showed Britain was 'pushing ahead' despite global turbulence.\nThe official figures from the Office for National Statistics showed growth in the final part of 2015 was marginally stronger than earlier in the year. It pushed overall economic growth for the year to 2.2 per cent.\nThe Chancellor said: 'Latest stats show economy grew at 0.5 per cent. Shows UK continues to grow steadily and despite turbulence in global economy we're pushing ahead.'\nThe UK economy has now grown for 12 consecutive quarters but 2015 saw a much slower expansion than 2014 as George Osborne warned of global turbulence\nGeorge Osborne, pictured today a visit to Airbus in Bristol, has warned the British economy faces a 'dangerous cocktail' of risks in the global economy\nMr Osborne continued: 'With turbulence in world, there may be bumpy times ahead. UK must stick with plan that's cutting deficit, attracting business, creating jobs.'\nPrime Minister David Cameron added: 'It's good news that the economy is growing steadily, meaning more jobs and security for people.\n'Global risks mean we will stick to our plan.'\nBut shadow chief secretary Seema Malhotra said: 'This growth is welcome but there is no room for complacency from the Chancellor. This has been the slowest recovery in living memory and we are entering a period of global uncertainty without the long term investment we need for the future.\n'It's further disappointing that there continue to be few signs of the vital rebalancing of the economy. We continue to wait for George Osborne's so-called 'March of the Makers', with construction still shrinking and manufacturing stagnating.\n'That is why in a week when questions over the UK's tax system have dominated, manufacturing and steel firms will be wondering about the lack of government support they get whilst the Chancellor praises an unfair tax settlement with Google which has shocked politicians, UK businesses and the public alike.'\nThe official statistics release said the growth in GDP was driven by the service sector and agriculture.\nThe ONS said: 'Services increased by 0.7 per cent and agriculture increased by 0.6 per cent.\n'In contrast, production decreased by 0.2 per cent, while construction output decreased by 0.1 per cent.'\nBut TUC General Secretary Frances O'Grady said: 'It's a big concern how fragile the recovery still looks, and how unbalanced it is with growth almost entirely dependent on services.\n'We need a stronger recovery that's built to last and that reaches all sectors of the economy.\nHargreaves Landsdown senior economist Ben Bretell said: 'Your interpretation of today's gross domestic product figures will depend on whether you take a 'glass half full' or a 'glass half empty' view of the UK economy.\n'The bigger picture is that growth remains lacklustre, but reasonably resilient.'\nShadow chief secretary Seema Malhotra, file picture left, said growth was 'welcome' but said the Chancellor could not be complacent. TUC general secretary Frances O'Grady, right, said the recovery remained 'fragile'\nMarkit chief economist Chris Williamson said: 'Uncertainty over Brexit, weak overseas growth and financial market volatility are all creating an unsettling business environment and point to downside risks to the economy in 2016.'\nIHS Global Insight chief UK & European economist Howard Archer said the UK was 'clearly finding growth hard to come by', adding that he expected UK expansion to be limited to 2.1 per cent this year.\n'The weakness of manufacturing and construction is no surprise given the government's lack of a proper industrial policy to boost the economy and protect crucial industries like steel.'\nStock markets around the world have had a dire start to the year plunging deep into the red in the worst new year trading since the Great Depression of the 1930s.\nGrowth in China has slowed prompting fear - and sometimes panic - about the future of the world economy.\nAt the same time, the oil price had also continued to fall.\nMr Osborne recently warned the UK faced a 'dangerous cocktail of new threats' such as falling commodity prices, recessions in Brazil and Russia and rising tensions in the Middle East.\nPrime Minister David Cameron said the figures were 'good news' but warned about 'global risks' facing the British economy\nChancellor George Osborne tweeted the results, which mean overall the economy grew by 2.2 per cent in 2015 - slower than the year before","url":"https://www.dailymail.co.uk/news/article-3420609/George-Osborne-insists-Britain-pushing-ahead-global-turbulence-new-economic-data-showed-economy-grew-0-5-cent-end-2015.html"}
