{"authors":["Ben Kew"],"date_download":"2018-10-30 18:22:12","date_modify":"2018-10-30 18:22:12","date_publish":"2016-09-12 16:30:06","description":"The Provost of George Washington University has indicated that his administration will reject a policy of using \"trigger warnings.\"","filename":"data/vaneerConsumption/GeorgeWashingtonUniversityProvostRejectsMandatoryTriggerWarnings.json","image_url":"https://media.breitbart.com/media/2016/01/south-park-safe-space.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_09_12__1540923732.html","title":"George Washington University Provost Rejects Mandatory Trigger Warnings","title_page":"George Washington University Provost Rejects Mandatory Trigger Warnings | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Provost of George Washington University has indicated that his administration will reject a policy of using “trigger warnings,” according to the university’s student paper.\nForrest Maltzman, the provost of the university, said that a policy of compulsory trigger warnings would be an infringement on academic freedom, and he would not pursue it.\n“I’m not in favor of requiring them and I’m not in favor of prohibiting them,” he explained. “I think individual faculty need to make decisions that will vary based upon their course content and what they think is in the best interest of sort of engaging our students in critical thinking.”\nStaff will be allowed to use trigger warnings if they so desire, but will not be forced to.\nThe news will come as blow to social justice warriors, who continuously try to enact a compulsory culture of trigger warnings and safe spaces, especially if conservative ideas are being discussed.\nThe decision follows the Dean of Chicago University writing a letter to incoming freshmen warning them not to expect a culture of safe spaces and triggers warnings, adding that one of the university’s defining characteristics is their “commitment to freedom of inquiry and expression.”\nYou can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at ben@yiannopoulos.net","url":"https://www.breitbart.com/tech/2016/09/12/george-washington-university-provost-rejects-mandatory-trigger-warnings/"}
