{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 20:36:08","date_modify":"2018-10-30 20:36:08","date_publish":"2015-06-05 12:59:13","description":"The female beluga whale calf born at the Georgia Aquarium 26 days ago has...","filename":"data/vaneerConsumption/GeorgiaAquariumbelugawhalecalfdies.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p6/MyAJC/2015/06/04/Images/WPIMAGE_cmgajcartsculture_3131.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_arts-culture_georgia-aquarium-beluga-whale-calf-dies__1540931768.html","title":"Georgia Aquarium beluga whale calf dies","title_page":"Georgia Aquarium beluga whale calf dies","title_rss":"NULL","source_domain":"ajc.com","text":"The female beluga whale calf born at the Georgia Aquarium 26 days ago has died.\nWhile the baby began nursing successfully from her mother, Maris, at five days old, aquarium staff became concerned because the calf was not gaining sufficient weight.\nAs of the last week of May, the newborn beluga had only gained 1 pound form her birth weight of 126 pounds. The Georgia Aquarium staff had been supplementing her caloric needs with formula, which mimics beluga milk.\nAccording to Dr. Gregory Bossart, senior vice president and chief veterinary officer at Georgia Aquarium, “Preliminary diagnostics, including consultation from veterinary specialists, indicated that the calf had gastrointestinal issues that were preventing her from properly absorbing and assimilating nutrients that she needed to grow and thrive.”\nEarly Friday morning, the calf began showing signs of lethargy and needed assistance to swim. While next to her mother and in the arms of the staff at the aquarium, the calf’s heart stopped just after 7 a.m.\nThe pregnancy was the second for 20-year-old Maris. The calf was fathered by Beethoven, who lived at the Georgia Aquarium for several years before being transferred to the Shedd Aquarium in Chicago on a breeding loan.\nA female whale calf born to Maris and Beethoven at the aquarium in May 2012 died after less than a week.\nOdds for calf survival increase with each of the mother’s consecutive pregnancies. The aquarium veterinarian team and other outside animal health specialists will conduct a necropsy. All tests and evaluations will be finalized within the next few weeks, but it is possible that an exact cause of death cannot be determined.\nAccording to the aquarium, the beluga whale exhibit, which has been closed, will be reopened when it is deemed in the best interest of the animals.","url":"https://www.myajc.com/blog/arts-culture/georgia-aquarium-beluga-whale-calf-dies/hKMAEocHBnbBEab026lBWK/"}
