{"authors":[],"date_download":"2018-10-30 21:18:02","date_modify":"2018-10-30 21:18:02","date_publish":"2016-12-31 19:39:00","description":"In a matchup with more extracurricular feistiness than any Georgia Tech has had in recent memory, th...","filename":"data/vaneerConsumption/GeorgiaTechstopsKentuckyinTaxSlayerBowl.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2016/12/31/Images/newsEngin.17176315_TAXSLAYER_BOWL_FOOTBALL_267.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_georgia-tech-stops-kentucky-taxslayer-bowl__1540934282.html","title":"Georgia Tech stops Kentucky in TaxSlayer Bowl","title_page":"Georgia Tech stops Kentucky in TaxSlayer Bowl","title_rss":"NULL","source_domain":"ajc.com","text":"In a matchup with more extracurricular feistiness than any Georgia Tech has had in recent memory, the Yellow Jackets met their objective of a nine-win season. Under overcast skies, Tech leveraged one of its best defensive efforts of the season to take care of Kentucky 33-18 in the TaxSlayer Bowl on Saturday afternoon.\nTech held Kentucky to 324 yards and produced three three-and-outs, impressive work considering that the Wildcats had averaged 512 yards in the final six games of the regular season. Tech’s defense made the first big play of the game, a sack and forced fumble of quarterback Stephen Johnson by defensive tackle Patrick Gamble that linebacker P.J. Davis scooped up and returned 38 yards for a touchdown on the game’s fourth play from scrimmage.\nIt gave Tech a 7-0 lead that the Wildcats, making their first bowl appearance since the 2010 season, were never able to overcome.\nThe Jackets defense made another game-changing play in the second quarter, stopping the Wildcats on a fourth-and-1 from the Tech 5-yard line when defensive ends KeShun Freeman and Antonio Simmons brought down running back Jojo Kemp in the backfield.\nTech then drove 94 yards for a touchdown and a 17-3 lead, a drive that included a fourth-and-1 conversion on Tech’s 15.\nIn his final game, kicker Harrison Butker drilled a career-high four field goals, including a 52-yarder to end the first half. Butker’s first point of the game, the extra point after Davis’ touchdown, made him the school’s all-time leading scorer with 323 points, breaking his tie with Tech great Luke Manget.\nB-back Dedrick Mills ran 31 times for 169 yards, both career highs. His final carry was a 3-yard touchdown run with 2:18 remaining that put the game out of reach after the Wildcats had scored 15 fourth-quarter points to close the score to 26-18 with 3:57 remaining. He was named game MVP.\nThe game was interrupted by a couple of incidents of pushing and shoving after plays, one of which earned Tech a bench penalty in the second quarter after Terrell Lewis blocked a Kentucky punt. Kentucky coach Mark Stoops also appeared to be yelling at coach Paul Johnson across the field after an injury to a Wildcats defensive lineman. He said he was upset that someone on Tech’s bench was speaking to him.\nTech finishes the season 9-4, just the 10th nine-win since Bobby Dodd’s retirement after the 1966 season. Johnson owns four of them. Johnson challenged his team to win nine games and earn its spot as one of the better teams in that timespan after the Jackets had fallen out of the ACC Coastal race. Tech finishes the season with wins over five bowl teams, including the Wildcats. Tech has also won three of its past four bowl games after the Jackets had lost seven consecutive bowls.","url":"https://www.ajc.com/sports/college/georgia-tech-stops-kentucky-taxslayer-bowl/O7ghIHUbh4vvgu5jytYttM/"}
