{"authors":[],"date_download":"2018-10-30 21:09:38","date_modify":"2018-10-30 21:09:38","date_publish":"2016-12-28 18:17:00","description":"What arguably is the biggest college football game in Georgia Dome history also will be the last.","filename":"data/vaneerConsumption/GeorgiaDomesavesitsbiggestcollegefootballgameforlast.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/28/Images/peach%20bowl.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_georgia-dome_91afd2cc32fc14e8063498803e2eee95__1540933778.html","title":"Georgia Dome saves its biggest college football game for last","title_page":"Georgia Dome saves its biggest college football game for last","title_rss":"NULL","source_domain":"ajc.com","text":"What arguably is the biggest college football game in Georgia Dome history also will be the last.\nSaturday’s Chick-fil-A Peach Bowl between No. 1 Alabama and No. 4 Washington — a College Football Playoff semifinal — will cap the prominent role the Dome has played in the sport since its opening in 1992.\nWhile best known as the home of the Falcons, the Dome will host its 152nd college football game, its 25th Peach Bowl.\nThe building is scheduled to be demolished next year and replaced by the $1.5 billion Mercedes-Benz Stadium, under construction next door and now slated to open by August.\nThe Dome will be the site of at least two more Falcons games — the team’s regular-season finale against the Saints on Sunday and at least one playoff game. The building is scheduled to close in March, when a Monster Jam trucks show is currently its last booked event.\nBut one big part of Georgia Dome history ends Saturday, one that shouldn’t go unnoticed.\n“The Dome has helped cement Atlanta as the capital of college football,” Dome spokesman Jason Kirksey said. “This building has been the stage for so many unbelievable college football games over the years, it is only fitting that our last college football game is a playoff semifinal.”\nGary Stokan, president and CEO of Peach Bowl Inc., is a big fan of the Dome, which he cites as a key reason for the bowl’s growth.\n“I still believe in my heart that for indoor college football facilities — and I have been to them all — the Georgia Dome has the best sight-lines and is the finest in the country,” Stokan said. “I’m including (Cowboys owner) Jerry Jones’ stadium, which has all the trappings. But from the standpoint of sight-lines, compactness, close-to-the-field atmosphere, the Georgia Dome is better.\n“I say that, but also with excitement as we look forward to what is going to be the newest and best state-of-the-art facility in the world in August with Mercedes-Benz Stadium.”\nStokan said there are no current plans for any type of ceremony Saturday to commemorate the final college game in the Dome because of the bowl’s high stakes and the remaining Falcons games and other events there.\nIn the Dome’s first college football game on Sept. 4, 1992, Clark Atlanta defeated Morris Brown 28-20.\nIn the building’s last college game, Alabama and Washington will vie for a berth in the national championship game, which will be played Jan. 9 in Tampa, Fla.\nIn addition to 25 Peach Bowls, the unofficial count of 152 college football games in the Dome includes 23 SEC Championship games, 11 season-opening Chick-fil-A Kickoff games, 44 Georgia State games, 23 Atlanta Football Classics (1992-2014), seven Heritage Bowls (1993-99 seasons), two Celebration Bowls (2015-16) and assorted other games.\nOne game was even relocated to the Georgia Dome by a hurricane: the Sugar Bowl on Jan. 2, 2006, after Hurricane Katrina’s devastation forced it out of New Orleans.\nSaturday’s game marks the first time the College Football Playoff, now in its third season, plays a semifinal in Atlanta. Based on that, Peach Bowl officials have labeled this the most significant college football game ever played in the city.\nAn argument also could be made that several SEC Championship games in the Dome were equally significant, albeit without the official designation of national semifinal.\nThree SEC title games matched teams ranked in the top three nationally by the Associated Press poll — 2008 (No. 1 Alabama vs. No. 2 Florida), 2009 (No. 1 Florida vs. No. 2 Alabama) and 2012 (No. 2 Alabama vs. No. 3 Georgia).\nEach of those three games was effectively a play-in for the Bowl Championship Series title game, which determined the national championship from 1998 until the launch of the four-team playoff in 2014. Indeed, in each of those three cases, the SEC champ went on to win the national title.\nThe BCS title game was never played in Atlanta. Next season’s College Football Playoff championship game will be played in Mercedes-Benz Stadium on Jan. 8, 2018.\nAlabama seems an appropriate team to play in the Dome’s final college game, considering coach Nick Saban’s remarkable record there. He is 12-1 in the building, including 9-1 as Alabama’s coach and 3-0 as LSU’s. Alabama has won eight consecutive games in the building.\nFor the Dome staff, this weekend will be one of its busier stretches, with the Alabama-Washington and Falcons-Saints games followed by the start of the Passion 2017 Conference on Monday. Combined, the three events will bring about 200,000 people to the Dome.\n“I think you could make the argument that this weekend is the biggest conversion in Dome history, going from a Peach Bowl semifinal game on Saturday to the last Falcons regular-season game on Sunday to a full concert set with stage and chairs on the floor for the Passion Conference starting on Monday,” Kirksey said.","url":"https://www.ajc.com/sports/college/georgia-dome-saves-its-biggest-college-football-game-for-last/U7IWoatnkXvEMqmTY6EO2H/"}
