{"authors":[],"date_download":"2018-10-30 19:09:49","date_modify":"2018-10-30 19:09:49","date_publish":"2015-02-15 18:10:27","description":"The Georgia Department of Transportation says it is getting out in front of the first winter weather event of the year forecast for metro Atlanta.","filename":"data/vaneerConsumption/Georgiaagenciesrampingupforwinterweather.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/02/15/Videos/4056967457001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_georgia-agencies-ramping-for-winter-weather__1540926589.html","title":"Georgia agencies ramping up for winter weather","title_page":"Georgia agencies ramping up for winter weather","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia Department of Transportation says it is getting out in front of the first winter weather event of the year forecast for metro Atlanta.\nMetro Atlanta could get a wintry mix of snow, sleet and ice starting as early as Sunday night.\nGDOT dispatched 10 trucks to treat the region’s interstates with a salt-water mixture known as brine. The pre-treatment is a best practice and was a major takeaway for the state’s Winter Weather Task Force, which advised Gov. Nathan Deal on reforms and suggested changes to the state’s approach to handling winter storms.\nThe task force was created after last year’s January storm that attracted unwelcome national media attention when drivers were trapped in their cars overnight, abandoned cars littered the interstates and surface roads, and thousands of children were trapped overnight in schools.\n“We have a minimum of 10 brine trucks on the road, spraying all the metro interstates,” GDOT spokeswoman Natalie Dale said. “It will take them the remainder of the day to get a good coat on those interstates ahead of the storm. We have not had the materials and equipment to do this in the past.”\nThe brine makes it more difficult for snow and ice to stick to roads. Tonight, GDOT crews will spread and rock and salt mixture over roadways to give motorists traction. The mixture also helps break up any snow or ice that did bind to roads.\nIn the past, the rock and salt mixture was the first treatment GDOT used.\nThe Georgia Emergency Management Agency is also ramping up. It will open its Operations Center at noon. That facility is a coordination center for GDOT, state patrol, and various state government agency directors that have to deal with the storm response.\nGEMA spokesman Ken Davis said the state will be ready for anything Mother Nature throws at them.\n“I think we are sort of clear that it’s going to be a wintry mix. It’s a matter of where, exactly,” Davis said. “We’re watching it. We’re not taking anything for granted.”\nCLOSINGS\nSeveral metro Atlanta school districts already had planned to be closed Monday for Presidents Day.\nStudents in Marietta, Fulton, Atlanta, Clayton, Gwinnett, Decatur, DeKalb and Douglas County will not have school Monday. Late Saturday, Cobb County Schools also decided to cancel classes on Monday in anticipation of the winter weather.\nMany federal agencies were also already scheduled to be closed because of President’s Day.\nAtlanta Weather: Tips and info to weather the storm\nCheck here for power outages in your area\nHelp your landscape recover from a hard freeze\nGallery: A brief history of Georgia’s deep freezes","url":"https://www.ajc.com/news/local/georgia-agencies-ramping-for-winter-weather/BUhEEQ7Nqi6C7ONoPj0nEI/"}
