{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 01:04:49","date_modify":"2018-10-23 01:04:49","date_publish":"2017-03-16 10:44:26","description":"The trio of stunners were joined by the show stalwarts as they prepared for the launch of Radge Academy, which will see the permanent cast teach the newbies the ropes of life on the MTV show","filename":"data/vaneerConsumption/GeordieShoreseason14launchseesstarsflashtheflesh.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53A94500000578-0-image-a-139_1489662649512.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319646_Geordie-Shore-newbies-make-grade-series-launch_1540256689.html","title":"Geordie Shore season 14 launch sees stars flash the flesh","title_page":"Geordie Shore season 14 launch sees stars flash the flesh | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They are the latest batch of stars set to bed, booze and brawl on Geordie Shore.\nSo the newbies ensured they made their mark at the launch of series 14 as Chelsea Barber, Eve Shannon and Abbie Holborn all slipped into racy school girl uniforms while preening and posing in London on Thursday.\nThe trio of stunners were joined by the show stalwarts as they prepared for the launch of Radge Academy, which will see the permanent cast teach the newbies the ropes of life on the MTV show.\nScroll down for video\nHello there: And the newbies ensured they made their mark at the launch of series 14 as Chelsea Barber (pictured), Eve Shannon and Abbie Holborn all slipped into racy school girl uniforms while preening and posing in London on Thursday\nAs the girls prepared for fame, it was clear to see they have taken to the scantily-clad Geordie ways to perfection, with Chelsea using her assets to make herself known.\nThe stunning newcomer wore a skin-tight white shirt fastened with extremely strained buttons across her heaving cleavage - which she inspected closely.\nWhile the other girls opted to slip on red and black ties to work their sexy looks, she opted to break the mould and wrap her tie around her head.\nAgain going against other styles, Chelsea slipped into a tight leather skirt paired with super racy stockings and staggering heels.\nHere come the girls: Eve Shannon and Abbie Holborn (left-right) went for matching ensembles comprising of racy mini skirts and cropped shirts\nOh my! As the girls prepared for fame, it was clear to see they have taken to the scantily-clad Geordie ways to perfection, with Chelsea using her assets to make herself known\nLeather lady: Again going against other styles, Chelsea slipped into a tight leather skirt paired with super racy stockings and staggering heels\nHold on! Clearly struggling to keep his hands to himself, Scotty T also enjoyed a cheeky grope of Chelsea's derriere - in what could be a hint at a new romance\nFollowing on was her Eve, who put on a show-stopping display in a white shirt with the near-entirety of her black bra on show underneath.\nShe paired the look with a tiny black skirt with a thick frill around the hemline while she styled her uniform-issued tie around her shoulders to look like braces. The sizzling getup was perfected with her racy suspenders.\nHer ombre tresses were flawlessly coiffed into loose waves falling from a side parting while adding sparkling gold watch with a designer feel.\nEve's beaming grin was totally understandable as she is no doubt delighting in her role in the show after years of 'fan girling' over the programme and the cast - as historic Tweets from five years ago confirmed.\nSaucy: Following on was her Eve, who put on a show-stopping display in a white shirt with the near-entirety of her black bra on show underneath\nSaucy: She paired the look with a tiny black skirt with a thick frill around the hemline while she styled her uniform-issued tie around her shoulders to look like braces. The sizzling getup was perfected with her racy suspenders\nFinally! Eve's beaming grin was totally understandable as she is no doubt delighting in her role in the show after years of 'fan girling' over the show and the cast - as historic Tweets from five years ago confirmed\nIn her messages on the microblogging site, she revealed she was awarded with the 'Most Likely To Star On Geordie Shore' at her school leaving assembly.\nShe wrote: 'Leavers assembly, won the most likely to be a wag and most likely to end up on Geordie shore! Hahahaha'.\nThe blonde beauty even worked for the show's resident 'boss' Anna Parkin, who has been dictating the cast's work since season one in 2011 - acting as a rep for her club nights back in 2012. She penned a Tweet reading: 'Can't wait for tonight, promoting @indigoatthegate get yourself down! @AnnaBossGshore'.\nStylish: Stockton-on-Tees native Abbie looked sensational in a lookalike ensemble as she showed off her endless legs in a pair of creamy boots with a peep toe\nStockton-on-Tees native Abbie looked sensational in a lookalike ensemble as she showed off her endless legs in a pair of creamy boots with a peep toe.\nMarty McKenna's ex-girlfriend and one-time Ex On The Beach star Sarah Goodhart looked sensational in a grey marled jumper with her tie and a leather skirt.\nShowing an edgier side her preened cohorts, she rocked a nose ring, lip piercing and a thick pair of geek chic style glasses.\nHot stuff: Marty McKenna's ex-girlfriend and one-time Ex On The Beach star Sarah Goodhart looked sensational in a grey marled jumper with her tie and a leather skirt\nLook at me! Showing an edgier side her preened cohorts, she rocked a nose ring, lip piercing and a thick pair of geek chic style glasses\nAs they posed for a group snap, Marty and Sarah seemed to hint at a reunion as he snuggled up to her while grasping her assets in a shock display.\nWith his one-time flame Chloe Ferry standing just inches away the couple could be seeking trouble as she loitered nearby.\nChloe went for a similarly edgy look as she slipped into a white crop top paired with high-waisted black leggings and a staggering pair of nude heels.\nAs she stood alongside the group she posed and pouted while dramatically jutting out her back to best show off her derriere to the cameras awaiting her.\nCheeky! As they posed for a group snap, Marty and Sarah seemed to hint at a reunion as he snuggled up to her while grasping her assets in a shock display\nCheeky! Chloe went for a similarly edgy look as she slipped into a white crop top paired with high-waisted black leggings and a staggering pair of nude heels\nSizzling! The long-standing cast member knew how to pose for the cameras\nAnother of Chloe's former flames, Scotty T was in attendance looking dashing in a denim jacket as he jokingly grappled with her assets.\nThe Lothario put on an extremely cheeky display as he giggled while cupping her cleavage - in hilarious scenes hammed up for the cameras.\nClearly struggling to keep his hands to himself, Scott also enjoyed a cheeky grope of Chelsea's derriere - in what could be a hint at a new romance.\nCheeky! Another of Chloe's former flames, Scotty T was in attendance looking dashing in a denim jacket as he jokingly grappled with her assets\nHot stuff: The Lothario put on an extremely cheeky display as he giggled while cupping her cleavage - in hilarious scenes hammed up for the cameras\nMarnie Simpson meanwhile proved that there's life in the old cast yet, as she stole the show at the Series 14 press day for Geordie Shore after admitting that she may have 'embarrassed' ex-boyfriend Lewis Bloor during filming for the new episodes.\nNewly-single Marnie turned heads in a completely nude bodysuit, which clinged to every inch of her fabulous figure.\nMarnie opted to tease her figure, as she hinted at her hourglass shape in a one-piece outfit that drew special attention to her pert behind and ample bust in something of an eye-popping display.\nCheeky: Marnie Simpson drew attention to her enviable curves in a nude bodysuit on Thursday, as she turned out for the Geordie Shore series 14 photocall in London\nLeaving nothing to the imagination: Marnie's outfit skimmed closely over her flat stomach\nShe's done this before: Marnie knew all of her best angles as she rotated for the cameras\nAll nude everything: The brunette even topped off the look with nude boots\nFrom the front, the bodysuit skimped over her flat stomach and protruding hip bones to accentuate her curves. Marnie helped unveil the most outrageous season, dubbed New Radgie Rampage, to date.\nRadge is among one of the cast's favourite Geordie slang terms, used to mean 'out of control'. As such, the brunette recently made the confession that her behaviour during filming for Series 14 could have gone so far as to embarrass now-ex Lewis.\n'I didn't behave like a lady or an appropriate girlfriend when I was filming Geordie Shore, and that embarrasses him,' Marnie told Star magazine this week.\nHer cousin Sophie Kasaei, who was recently reinstated into the cast after being booted off the show for making an alleged racist slur in 2013, opted to tough up the ensemble with leather trousers and a slinky striped shirt.\nElsewhere fellow hunks Nathan Henry and Aaron Chalmers were watching on as they launched the new show. The show's only remaining original cast member Gary Beadle was absent as he enjoyed a six week holiday to Australia with his girlfriend Emma McVey.\nTough stuff: Her cousin Sophie Kasaei, who was recently reinstated into the cast after being booted off the show for making an alleged racist slur in 2013, opted to tough up the ensemble with leather trousers and a slinky striped shirt\nThe boys: Elsewhere fellow hunks Nathan Henry (right) and Aaron Chalmers (third left) were watching on as they launched the new show","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319646/Geordie-Shore-newbies-make-grade-series-launch.html"}
