{"authors":["Ariel Zilber For Dailymail.Com"],"date_download":"2018-10-22 21:52:43","date_modify":"2018-10-22 21:52:43","date_publish":"2017-03-10 00:01:42","description":"If Hollywood wanted to terrify moviegoers about what a global warming-induced apocalypse would look like, it may have succeeded with Geostorm.","filename":"data/vaneerConsumption/Geostormtrailerdepictstheendoftheworld.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EDFBE00000578-0-image-a-46_1489103854970.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299442_Geostorm-outlandishly-depicts-end-world_1540245163.html","title":"'Geostorm' trailer depicts the end of the world","title_page":"'Geostorm' trailer depicts the end of the world | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If Hollywood wanted to terrify moviegoers about what a global warming-induced apocalypse would look like, it may have succeeded with Geostorm.\nThe latest end-of-the-world disaster film, which is set to open in theaters on October 20, is produced by Warner Brothers.\nIts director, Dean Devlin, was also the writer and producer of Independence Day and Godzilla, two other blockbuster movies whose plotlines followed similar motifs.\nIt stars Scottish actor Gerard Butler, who plays a scientist that needs to fix sophisticated satellites that control the earth's weather.\nIf Hollywood wanted to terrify moviegoers about what a global warming-induced apocalypse would look like, it may have succeeded with Geostorm\nThe satellites suffer a malfunction that cause them to destroy the Arctic, setting off a chain of events that includes the wiping out of cities, buildings collapsing like dominoes, tornadoes that destroy markets, dead birds and frozen airplanes dropping out of the sky, and tsunami waves that flood coastal towns.\nThe trailer is set against a creepy-sounding cover version of Louis Armstrong's What a Wonderful World.\nButler heads an A-list cast that includes Ed Harris, Abbie Cornish, Andy Garcia, and Jim Sturgess.\nThe filmmakers appear to be banking on the fact that their previous efforts at end-of-the-world fear-mongering were well-received at the box office.\nThe film stars Scottish actor Gerard Butler (above second from left), who plays a scientist that needs to fix sophisticated satellites that control the earth's weather\nThe film tells the story of climate-controlling satellites (seen above) that malfunction and set off a chain of events that leads to catastrophic destruction of cities\nOne of the consequences of the satellite malfunction is the flooding of coasts (like the one seen above)\nIn Geostorm, city buildings are toppled like legos as massive tsunamis lay waste to shores\nScientists who have warned of global warming say that rising ocean levels threaten coastal areas\nBuildings fall over like dominoes in this Asian city as depicted in the film Geostorm\nMassive flash tornadoes rip through an Asian market during the above scene as depicted in Geostorm\nAn explosion rips through the street of a major Asian city in the above scene depicted in Geostorm\nIts director, Dean Devlin, was also the writer and producer of Independence Day and Godzilla, two other blockbuster movies whose plotlines followed similar motif\nIts director, Dean Devlin, was also the writer and producer of Independence Day and Godzilla, two other blockbuster movies whose plotlines followed similar motifs\nIndependence Day, the 1996 movie about an extraterrestrial invasion that threatens the future of humanity, generated $817.4million worldwide.\nIts 2016 sequel, Independence Day: Resurgence, grossed nearly $390million.\nThe Day After Tomorrow, the 2004 sci-fi hit distributed by 20th Century Fox, earned $544.3million at the box office.\nCritics say the film bears a resemblance to another end-of-the-world apocalyptic sci-fi thriller, The Day After Tomorrow, which stars Dennis Quaid (left). The 2004 film depicts what a worldwide catastrophe caused by global warming would look like (right)\nAll three films were directed by German filmmaker Roland Emmerich, whose on-screen cataclysms have made him the 20th highest grossing director of all time, according to Box Office Mojo.\nEmmerich is not involved in Geostorm, but it appears that his colleague Devlin is poised to carry on the disaster-flick tradition.","url":"https://www.dailymail.co.uk/news/article-4299442/Geostorm-outlandishly-depicts-end-world.html"}
