{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:33:09","date_modify":"2018-10-30 20:33:09","date_publish":"2015-06-23 22:17:58","description":"Germany is expected to train a Yazidi force in northern Iraq to seize back their homeland from the Islamic State (ISIS/ISIL), German television channel N24 reports.","filename":"data/vaneerConsumption/GermanyToTrainYazidiForcetoCombatISIS.json","image_url":"https://media.breitbart.com/media/2015/06/DSC005011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_23__1540931589.html","title":"Germany To Train Yazidi Force to Combat ISIS","title_page":"Germany To Train Yazidi Force to Combat ISIS","title_rss":"NULL","source_domain":"breitbart.com","text":"Germany is expected to train a Yazidi force in northern Iraq to seize back their homeland from the Islamic State (ISIS/ISIL), German television channel N24 reports.\nThat revelation comes as hundreds of Yazidi families remain stranded on Iraq’s Mount Sinjar after Kurdish troops, assisted by U.S.-led airstrikes, broke an ISIS siege there in December 2014.\nYazidis are a Kurdish religious minority who were attacked as ISIS swept through Iraq and seized the Sinjar area along with other Kurdish-held territory in northern Iraq. Thousands of Yazidi civilians fled their homes in Iraq’s northern Nineveh province.\nThey went to Mount Sinjar for protection from the onslought of ISIS jihadists. Thousands were killed, kidnapped, or enslaved before they were rescued.\nGermany’s Deutsche Welle (DW) interviewed Yazidis who remain in Mount Sinjar. Some say they do not want to leave their homeland and go somewhere else, noting that they currently lack food, shelter, clothing, and access to healthcare.\nUrsula von der Leyen, Germany’s defense minister, said the German government will send military advisers to northern Iraq to train train “Yazidis in the conflict areas who want a force to retake their homeland from [ISIS],” N24 reported on Monday.\nGermany is reportedly deploying “at least 70 military advisers to train [Kurdish] Peshmerga forces and providing them with military equipment,” noted NRT TV, a Kurdish news outlet, citing the N24 report.\n“Yazidis are members of an ancient, pre-Islamic faith, which [ISIS] considers a form of ‘devil-worship,’” added NRT.\nUnlike the U.S., Germany has provided direct assistance to Iraq’s Kurdistan Regional Government (KRG) as it takes on ISIS, bypassing Iraq’s central government. Kurdish forces have been more effective in combating ISIS than their Iraqi counterparts.\nCiting the Yazidi humanitarian crisis in northern Iraq, President Obama authorized the beginning of U.S.-led airstrikes against ISIS in Iraq in August 2014. That operation was extended to Syria the following month.","url":"https://www.breitbart.com/politics/2015/06/23/germany-to-train-yazidi-force-to-combat-isis-as-hundreds-remain-stranded-on-mount-sinjar/"}
