{"authors":[],"date_download":"2018-10-30 21:58:09","date_modify":"2018-10-30 21:58:09","date_publish":"2016-03-10 18:49:03","description":"The German and Greek leaders blasted Balkan countries for shutting their borders to migrants ahead of an EU ministers meeting Thursday.","filename":"data/vaneerConsumption/GermanAndGreekLeadersBlastBalkansNationsForClosingMigrantRoute.json","image_url":"https://media.breitbart.com/media/2016/03/Screen-Shot-2016-03-10-at-18.45.20.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_10__1540936689.html","title":"German And Greek Leaders Blast Balkans Nations For Closing Migrant Route","title_page":"German And Greek Leaders Blast Balkans Nations For Closing Migrant Route | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(AFP) – The German and Greek leaders blasted Balkan countries for shutting their borders to migrants ahead of an EU ministers meeting Thursday, with Greek Premier Alexis Tsipras warning that the EU “has no future if it goes on like that”.\nGermany’s Chancellor Angela Merkel said the closures are “neither sustainable nor lasting” in tackling Europe’s biggest migrant crisis since World War II and would leave Greece bearing the burden of the influx.\nUnderlining the deep divisions cleaving the bloc, Merkel and Tsipras’ reactions flew in the face of the response of EU President Donald Tusk, who welcomed the route closure as being part of a collective response of the 28-member EU.\nThe strong words came after Slovenia and Croatia barred entry to transiting migrants from Wednesday and Serbia indicated it would follow suit.\nEU member Slovenia said it would allow in only migrants wishing to claim asylum there or those seeking entry “on humanitarian grounds and in accordance with the rules of the Schengen zone”.\nPrime Minister Miro Cerar said the move meant that “the (Balkan) route for illegal migrations no longer exists”, while Tusk on Twitter called the decision “not a question of unilateral actions but common EU28 decision”.\n“I thank Western Balkan countries for implementing part of EU’s comprehensive strategy to deal with migration crisis,” he wrote.\nTsipras retorted on Twitter that Tusk should “focus efforts on implementing our common decisions and not encourage those who ignore them”.\n– Leaving Greece in the lurch –\nThe EU has been locked in dispute over how to stem an unprecedented influx of migrants that reached more than a million in 2015, many from Syria, Afghanistan and Iraq and most aiming to reach wealthy Germany, Austria and Scandinavia.\nUnder pressure at home to reduce the influx, Merkel acknowledged that the western Balkan states’ action “will obviously bring us fewer refugees, but they put Greece in a very difficult situation”.\nHer Vice Chancellor Sigmar Gabriel noted that while some at home are “secretly pleased that the Balkan states… are doing Germany’s dirty work”, their actions would not help in the long term.\nMerkel is battling to avoid leaving Greece in the lurch as the number of migrants stranded there is still steadily growing.\nGreek authorities said Thursday there were 41,973 asylum seekers in the country, including some 12,000 stuck at Idomeni on the closed Macedonian border.\nMigrants also did not appear dissuaded by latest developments, and were still risking their lives to cross to Europe.\nAt least another five migrants, including a baby, drowned as they tried to sail from Turkey to Greece, the Dogan news agency reported on Thursday.\nMerkel wants a comprehensive European deal with Turkey to stop asylum seekers from jumping on unseaworthy rubber boats to get to Europe.\nThe plan involves joint action with Ankara to tighten the EU’s external borders, while also distributing refugees among EU members.\n“If we do not manage to reach a deal with Turkey, then Greece cannot bear the burden for long,” she told public radio MDR.\n“That’s why I am seeking a real European solution, that is, a solution for all 28 (EU members),” stressed Merkel, who was once vilified in Greece over her hardline push for austerity, but who is today standing firmly by Athens.\n– Vienna criticises Turkey deal –\nBut the mooted Turkish deal is controversial, and ahead of an EU interior ministers meeting later Thursday, Vienna signaled its opposition.\n“I am extremely critical. I am seriously wondering whether we are taking ourselves and our values seriously or if we are throwing them overboard,” said Austria’s interior minister Johanna Mikl-Leitner, in a reference to concerns over human rights violations in Turkey.\nIn return, Turkey wants six billion euros ($6.6 billion) in aid, visa-free access to Europe’s passport-free Schengen zone and a speeding up of Ankara’s efforts to join the EU.\nAnkara’s EU affairs minister Volkan Bozkir underlined Thursday however that the deal would not be retroactive, and would “not include the existing refugees on the Greek islands”.","url":"https://www.breitbart.com/europe/2016/03/10/german-and-greek-leaders-blast-balkans-nations-for-closing-migrant-route/"}
