{"authors":["Associated Press"],"date_download":"2018-10-23 04:45:36","date_modify":"2018-10-23 04:45:36","date_publish":"2017-03-10 14:54:26","description":"BERLIN (AP) - German police said Friday they have arrested a 49-year-old woman and are seeking her brother in connection with the killing of two elderly...","filename":"data/vaneerConsumption/Germanpolicearrestwomanseekmanoverdoublekilling.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/17/wire-197287-1489167861-13_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301564_German-police-arrest-woman-seek-man-double-killing_1540269936.html","title":"German police arrest woman, seek man over double killing","title_page":"German police arrest woman, seek man over double killing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - German police said Friday they have arrested a 49-year-old woman and are seeking her brother in connection with the killing of two elderly people in February.\nIn a statement, Bavarian police said the woman, whose name wasn't released, was arrested in the eastern German town of Prenzlau on suspicion of accessory to murder.\nHer brother, identified by police as 43-year-old Robert Pludowski, is believed to have fled the country. Pludowski, who was described as possibly armed and dangerous, is wanted on suspicion of murder and robbery.\nFILE - In this Feb. 26, 2017 file photo, a policeman stands in front of a house in which two people were killed and another person gravely injured near Koenigsdorf, Germany. Police in Germany say they have arrested a 49-year-old woman and are seeking her 43-year-old brother in connection with the killing of two people in February. Police said both suspects are Polish nationals. The two victims, a 76-year-old woman and an 81-year-old man, were discovered dead Feb. 26 at a house in Koenigsdorf, about 30 kilometers (19 miles) south of Munich. (Andreas Gebert/dpa via AP,file)\nBoth suspects are Polish nationals, German police said.\nThe two victims - a 76-year-old woman and an 81-year-old man - were discovered dead Feb. 26 at a house in Koenigsdorf, about 30 kilometers (19 miles) south of Munich, police said.\nThe 76-year-old owner of the house was found with serious injuries and couldn't yet be questioned. The female suspect had previously worked as a caregiver for the injured woman, police said.\nAuthorities are also looking for second man who they believe may have information about the crime.","url":"https://www.dailymail.co.uk/wires/ap/article-4301564/German-police-arrest-woman-seek-man-double-killing.html"}
