{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:04:19","date_modify":"2018-10-30 22:04:19","date_publish":"2016-12-21 18:30:16","description":"Germany has experienced 21 months of Islamist suicide bombings, shootings, axe attacks, and now a truck rampage.","filename":"data/vaneerConsumption/GermanysTwoYearsofIslamistTerror.json","image_url":"https://media.breitbart.com/media/2016/10/GERMANY-TERROR-WARNING-STOPPAGE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_12_21__1540937059.html","title":"Germany’s Two Years of Islamist Terror","title_page":"Timeline: Germany’s Two Years of Islamist Terror","title_rss":"NULL","source_domain":"breitbart.com","text":"This week, Germany experienced its worst terror atrocity since the 1980s, following 21 months of Islamist suicide bombings, shootings, axe attacks, and now a truck rampage.\nThe terrorist killers responsible have included numerous “refugees” from Syria, Iraq, Afghanistan, and Algeria, as well as several German citizens of Turkish decent indoctrinated in radical Islam. Around seven of the plots and attacks are thought to have been linked to Islamic State.\nGermany appears to have become a target of Islamist aggression since the beginning of the migrant crisis in the summer of 2015, with many blaming Chancellor Angela Merkel’s opened border mass migration policy.\nApril 2015\nAs the migrant crisis brewed, police foiled an Islamic State attack planned by two German citizens of Turkish descent. The men were aged 34 and 35.\nThe men were thought to be plotting a Boston-style attack on the Eschborn-Frankfurt City loop bike race in Oberursel, and police found bomb-making materials in their home near the race route.\nSeptember 2015\nAs the migrant crisis reached a late summer peak, an Iraqi citizen and convicted terrorist who was claiming asylum in Germany was shot dead after stabbing a female police officer in the neck.\nRafik Mohamad Yousef, 41, was a member of a terrorist group with links to al-Qaeda, but claimed his “human rights” would be violated if he were sent back to Iraq.\nFebruary 2016\nThree Algerians who were said to have “lived in refugee shelters” and had links to Islamic State were arrested for plotting to attack Berlin.\nThe Berlin prosecutor’s office said they were aware of a “concrete” plan to target the German capital.\nFebruary 2016\nLater that month, another police officer was stabbed in the neck and severely injured when a 15-year-old girl of Moroccan origin, acting “on behalf of the Islamic State,” walking into a police station and attacked.\nThe girl held a German passport but had spent time living on the Turkish-Syrian border before being brought back to Germany by her mother, and it is possible she was radicalised by Islamic State there.\nApril 2016\nTwo “radicalised” teenagers of Turkish descent blew up a Sikh temple in the city of Essen during wedding celebrations, injuring three people.\nThe bombers were found guilty of attempted murder and causing an explosion – but not terrorism. This is despite their links to local Salafist organisations and Islamic State.\nA court later heard they had planned to kill kindergarten children with poisoned ice cream before detonating a bomb in a school car park.\nMay 2016\nThree Syrian migrants and suspected members of Islamic State were arrested in the state of North Rhine-Westphalia.\nAuthorities said two of the men planned to blow themselves up in downtown Düsseldorf, while the other attacker and a fourth jihadist arrested in France planned to target pedestrians with guns and explosive devices.\nJuly 2016\nThree months later, a 17-year-old Afghan refugee went on an axe-wielding rampage on a train near the city of Würzburg, reportedly yelling “Allahu Akbar” and leaving four people injured before being shot dead by police.\nJuly 2016\nJust six days later, a 27-year-old Syrian refugee who pledged allegiance to Islamic State committed the first ever suicide bombing on German soil in Ansbach.\nHe had originally planned to attack a music festival; but after he failed to get in, he detonated himself outside a wine bar, injuring more than a dozen people.\nOctober 2016\nPolice in Leipzig arrested 22-year-old Syrian refugee Jaber al-Bakr after a two-day manhunt following the discovery of explosives and other bomb-making equipment at his apartment in Chemnitz.\nHe was suspected of plotting to attack a Berlin airport. Two days later, he hanged himself in his prison cell.\nDecember 2016\nAt least 12 people died and around 50 were injured after a truck smashed its way through a Christmas market in Berlin in a suspected terror attack.\nIslamic State claimed the attack, describing the driver as “a soldier of” of their jihadi terror group, and police are currently searching for a 24-year-old Tunisian immigrant suspect named as Anis A. thought to have Islamist links.","url":"https://www.breitbart.com/europe/2016/12/21/timeline-germanys-two-years-islamist-terror-migrant-crisis/"}
