{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 18:39:02","date_modify":"2018-10-30 18:39:02","date_publish":"2018-06-28 17:20:27","description":"Forty-two MPs of the anti-mass migration Alternative for Germany (AfD) have put their names behind an initiative to bring criminal charges of people trafficking against German migrant transport NGOs which they say \"must be stopped\".","filename":"data/vaneerConsumption/GermanMPstoBringCriminalChargesAgainstMigrantNGOs.json","image_url":"https://media.breitbart.com/media/2018/06/GettyImages-985561914.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_28__1540924742.html","title":"German MPs to Bring Criminal Charges Against Migrant NGOs","title_page":"Exclusive: German MPs to Bring Criminal Charges Against Migrant NGOs","title_rss":"NULL","source_domain":"breitbart.com","text":"Forty-two MPs of the anti-mass migration Alternative for Germany (AfD) have put their names behind an initiative to bring criminal charges of people trafficking against German migrant transport NGOs which they say “must be stopped”.\nThe move to bring criminal charges was organised by AfD foreign policy committee spokesman Petr Bystron, and will see the party file the charges in Augsburg this weekend, according to a statement seen by Breitbart London.\nThe Bundestag members plan to bring charges of “aid or assisting in illegal immigration repeatedly or on behalf of several foreigners” against the NGOs SOS Mediterranée, Sea-Watch, Sea-Eye, and Mission Lifeline.\nAccording to the release, Bystron and the MPs were first made aware of the migrant crisis in the Mediterranean by the Identitarian Movement’s Defend Europe mission last year and cited the reporting of Canadian journalist Lauren Southern who was banned from entering the UK earlier this year.\nNGO ‘Rescue’ Ship Carrying Over 600 Migrants BLOCKED by Italy’s New Govt https://t.co/K1XNNGMro9 — Breitbart London (@BreitbartLondon) June 11, 2018\nFollowing Italian Interior Minister Matteo Salvini’s ban on allowing migrant transport vessels to dock in Italian ports, the Lifeline NGO was forced to dock in Malta earlier this week.\nThe AfD members also cited a Facebook post which claimed that several Maltese who were protesting the docking of the ship, which had 234 migrants on board, were attacked by German far-left extremist Antifa movement members who they speculated may have been part of the crew of the vessels.\n“Germany is the last country in Europe still keeping its borders open to mass illegal immigration. The activity of these radical left-wing NGOs offers an incitement for illegal migrants to risk their lives on the Mediterranean in unseaworthy craft, and must be stopped,” Bystron said.\n“We urge the Maltese government to arrest the crews of the Sea-Eye, Sea-Watch 3, and Lifeline and impound their vessels, while we are filing criminal charges in Germany for human trafficking. It is the only way to put a stop to illegal immigration and prevent more people from drowning,” he added.\n“They are making a lot of money with this, ” Bystron told Breitbart London. “SOS Mediterranée makes four million [euros] a year, another one, 1.7 million and the smallest one, which has been caught now, a quarter million a year.”\nBystron then blasted left-wing politicians saying that they were the ones who created the environment that has led to the crisis and the misery of the migrants explaining that the migrants would not get into the boats if they did not know there would be NGO vessels waiting off the coast to collect them.\nThe charges will coincide with the AfD’s political conference that is set to be held in Augsburg this weekend.\nSeveral weeks ago, Antifa extremists released a “riot tourist” terror handbook encouraging other members of the movement to attack the conference, as well as war memorials, and also contained links to a website which directed activists to a document called “Prisma” that shows extremists how to make remote-detonated bombs.\nExclusive: German Populist MP Wants to Help Grant ‘Political Prisoner’ Tommy Robinson Asylum… ‘1984 is Now’ https://t.co/mQbMkGYTfV — Breitbart London (@BreitbartLondon) May 29, 2018\nThe move to press charges against the NGOs comes a month after Bystron made headlines by supporting granting asylum to UK citizen journalist and activist Tommy Robinson who was arrested while filming outside Leeds Crown Court in May and sentenced to 13 months in prison for contempt.","url":"https://www.breitbart.com/europe/2018/06/28/german-populist-mps-levy-criminal-human-trafficking-charges-migrant-transport-ngos/"}
