{"authors":["Associated Press"],"date_download":"2018-10-23 02:53:36","date_modify":"2018-10-23 02:53:36","date_publish":"2017-03-16 13:34:19","description":"BERLIN (AP) - The German government says Chancellor Angela Merkel and China's president have stressed their commitment to free trade in a telephone...","filename":"data/vaneerConsumption/GermanChineseleadersstresscommitmenttofreetrade.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228655-1489671262-861_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320304_German-Chinese-leaders-stress-commitment-free-trade_1540263216.html","title":"German, Chinese leaders stress commitment to free trade","title_page":"German, Chinese leaders stress commitment to free trade | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - The German government says Chancellor Angela Merkel and China's president have stressed their commitment to free trade in a telephone conversation - a day before Merkel is expected in Washington to meet President Donald Trump.\nGermany this year chairs the Group of 20 industrial powers, and Merkel will be hosting Trump, Chinese President Xi Jinping and the other leaders at a summit in Hamburg in July.\nMerkel's office said in a brief statement that the chancellor and Xi stressed Thursday they would \"support free trade and open markets.\"\nGerman Chancellor Angela Merkel visits the section for measuring brain waves at the new research center for dementia diseases DZNE at the university hospital in Bonn, Germany, Wednesday, March 15, 2017. (Wolfgang Rattay/Pool Photo via AP\nIt said the two discussed conditions for the expansion of the electric car market in China.\nThere is widespread concern in Europe about Trump's approach to trade in general, while Trump has signaled a tough stance on trade with China.","url":"https://www.dailymail.co.uk/wires/ap/article-4320304/German-Chinese-leaders-stress-commitment-free-trade.html"}
