{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 23:10:20","date_modify":"2018-10-30 23:10:20","date_publish":"2016-12-08 00:00:00","description":"Bloomberg News cited a report by German regulator Bafin that said there were \"abnormalities\" in internal indexes.","filename":"data/vaneerConsumption/GermanregulatorsawabnormalitiesinDeutscheBankindexesusedforMontePaschideal.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_german-regulator-saw-abnormalities-in-deutsche-bank-indexes-used-for-monte-paschi-deal-2016-12_1540941020.html","title":"German regulator saw 'abnormalities' in Deutsche Bank indexes used for Monte Paschi deal","title_page":"    German regulator saw 'abnormalities' in Deutsche Bank indexes used for Monte Paschi deal - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Stefano Rellandini Deutsche Bank allegedly struck a deal with Banca Monte dei Paschi di Siena in 2008 to flatter the Italian lender's accounts, according to a Bloomberg News report.\nBloomberg News cited a report by German regulator Bafin that said there were \"abnormalities\" in internal indexes that were used as price benchmarks for a set of complex derivatives transactions with Monte Paschi. The suggestion is Deutsche Bank may have manipulated the internal indexes.\nA spokesman for Deutsche Bank declined to comment.\nThe study, by German banking authority Bafin, will feature in a trial brought by Italian prosecutors against Deutsche Bank in Milan this month.\nStaff at the German lender \"appear to have traded in the futures contracts that determined the development\" of the benchmarks used in the deal with Monte Paschi, Bloomberg cited the report as saying.\nThe regulator did not conclude \"unequivocally\" that the German lender did indeed manipulate the benchmark indexes. The indexes were tied to Euribor contracts - financial products that derived their value based on interbank lending interest rates at Eurozone banks.\nMonte Paschi is at the centre of an on-going Italian banking crisis and requires a €5 billion bailout. Italy is asking the European Central Bank to give it until mid-January to arrange the deal, the Financial Times reported on Thursday.\nSeparately, the European Commission on Wednesday fined Crédit Agricole, HSBC, and JPMorgan Chase €485 million for operating a cartel in euro interest-rate derivatives.\nThe Commission said the banks \"colluded on euro interest rate derivative pricing elements, and exchanged sensitive information, in breach of EU antitrust rules.\"\nDeutsche Bank, along with Barclays and Royal Bank of Scotland, settled its cartel case with the European Union in 2013. The German lender was fined €465 million for the breach at the time.","url":"https://www.businessinsider.com/german-regulator-saw-abnormalities-in-deutsche-bank-indexes-used-for-monte-paschi-deal-2016-12"}
