{"authors":["Associated Press"],"date_download":"2018-10-23 01:33:06","date_modify":"2018-10-23 01:33:06","date_publish":"2017-03-10 09:54:10","description":"BERLIN (AP) - German police said Friday that two Italian tourists were among nine people injured when a man randomly attacked passengers with an ax in...","filename":"data/vaneerConsumption/GermanpoliceItaliantouristsamongvictimsofaxattack.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196083-1489151055-81_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300560_German-authorities-Ax-attacker-acted-alone_1540258386.html","title":"German police: Italian tourists among victims of ax attack","title_page":"German police: Italian tourists among victims of ax attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - German police said Friday that two Italian tourists were among nine people injured when a man randomly attacked passengers with an ax in Duesseldorf's main train station.\nThe suspect, a 36-year-old man from Kosovo, was arrested shortly after the attack late Thursday, said Dietmar Kneip, a senior police official. The man, who wasn't named, is being treated in hospital for injuries suffered when he jumped from a bridge while trying to elude police.\nKneip said there was no indication that the attack was politically or religiously motivated. Rather, the man appeared to be suffering from psychological problems and may have been receiving treatment, he said.\nSpecial police forces leave the Duesseldorf, western Germany, main station Thursday, March 9, 2017 after several people had been injured in an axe attack. (Federico Gambarini/dpa via AP)\n\"He said in a first interview that he was trying to get police to shoot him,\" said Kneip. \"We call it 'suicide by cop'.\"\nMedical documents found at the man's home in the nearby city of Wuppertal indicated that the suspect had been diagnosed with paranoid schizophrenia, he said.\nKneip said the suspect had been sitting in a commuter train and began attacking fellow passengers as they tried to get out at Duesseldorf station, striking at their heads with an ax.\nOne passenger was able to shove the man out of the train and the driver shut the doors, preventing him from getting in again.\nFour female passengers, including the two Italians and a 13-year-old girl, and five men were injured in the attack. Four were seriously injured but none were in a life-threatening condition.\nProsecutors Martin Stuecke said the man, who came to Germany in 2009 and was granted temporary residency for humanitarian reasons, would be charged with nine counts of attempted manslaughter.\nGerman authorities have heightened security measures following a series of attacks in public places over the past year. Within minutes of Thursday's incident, shortly before 9 p.m. (2000 GMT), heavily-armed police arrived at the station to respond to a possible extremist attack, a fear that soon proved unfounded.\nIn total, almost 600 police were called to the scene.\nSpecial police forces walk in the main train station in Duesseldorf, western Germany, Thursday, March 9, 2017 after several people have been injured in an attack with an ax. (David Young//dpa via AP)\nPolice officers stand outside the Duesseldorf, western Germany, main station Thursday, March 9, 2017 after several people had been injured in an axe attack. (Federico Gambarini/dpa via AP)\nA police marker marks a blood stain on the floor of the Duesseldorf, western Germany, main station Friday morning, March 10, 2017 after a man had attacked people with an ax. (Federico Gambarini/dpa via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4300560/German-authorities-Ax-attacker-acted-alone.html"}
