{"authors":["Cindy Tran For Daily Mail Australia"],"date_download":"2018-10-22 20:22:21","date_modify":"2018-10-22 20:22:21","date_publish":"2016-01-29 01:19:51","description":"The German tourists were travelling in a Ford Laser along the Arnhem Highway in Northern Territory when their vehicle crashed head-on into a Toyota Landcruiser about 9pm on Thursday","filename":"data/vaneerConsumption/GermantouristkilledandanotherseriouslyinjuredafterNorthernTerritorycrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE326B00000578-0-image-a-49_1454030144913.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422061_German-tourist-killed-seriously-injured-Northern-Territory-highway_1540239741.html","title":"German tourist killed and another seriously injured after Northern Territory crash","title_page":"German tourist killed and another seriously injured after Northern Territory crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A German tourist has tragically died and another remains in hospital with serious injuries following a head-on collision on an Australian outback highway.\nThe pair were travelling in a Ford Laser along the Arnhem Highway, 20 kilometres east of Humpty Doo in Northern Territory when their vehicle crashed head-on into a Toyota Landcruiser about 9pm on Thursday.\nPolice alleged the tourists had driven on the wrong side of the road when their sedan collided with an oncoming four-wheel-drive, ABC News reported.\nA German tourist has died and another remains in hospital with serious injuries following a head-on collision\nThe pair were travelling along the Arnhem Highway, 20 kilometres east of Humpty Doo in Northern Territory\nThe male passenger died at the scene and the driver was rushed to the Royal Darwin Hospital with serious injuries where he remains in a critical condition.\nPolice are yet to confirm the identity of the deceased male.\nThe driver of the four-wheel-drive reportedly escaped with minor injuries.\nThe cause of the crash is under investigation, and the Major Crash Unit remains on the scene.\nDaily Mail Australia has contacted Northern Territory Police for further comment.","url":"https://www.dailymail.co.uk/news/article-3422061/German-tourist-killed-seriously-injured-Northern-Territory-highway.html"}
