{"authors":["John Hayward"],"date_download":"2018-10-30 20:47:00","date_modify":"2018-10-30 20:47:00","date_publish":"2015-11-17 19:27:09","description":"A soccer match between Germany and the Netherlands was canceled less than two hours before it was scheduled to begin, and the stadium in Hannover evacuated, due to unspecified \"security concerns.\"","filename":"data/vaneerConsumption/GermanyNetherlandsSoccerMatchCanceledEvacuated.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo1903-e1447788417608-1024x766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_17__1540932420.html","title":"Germany-Netherlands Soccer Match Canceled, Evacuated","title_page":"Germany-Netherlands Soccer Match Canceled, Evacuated","title_rss":"NULL","source_domain":"breitbart.com","text":"Update, 3:45 PM EST: The German interior minister, Thomas de Maiziere, confirmed that no live explosives have been found in the Hannover stadium. However, he said German intelligence had seen an “overwhelming amount of chatter” about possible attacks on the game.\n“In such a difficult situation that is in doubt, the protection of humanity is the priority,” the minister declared, according to CBS News.\nCBS adds that a second event, a concert at the Hannover Pavillion, was also canceled.\nHaaretz quotes the German Bild news website reporting that “German security services were alerted more than a day in advance that a group of North African men were planning an attack. According to the report, the group, which is known to authorities, had explosives and firearms in its possession. Later, French intelligence reportedly relayed intelligence that an Iraqi man was planning to attack the stadium.”\nUpdate, 3:15 PM EST: Judging by the most recent comments by the police, it sounds as if they are convinced there was a genuine threat against the stadium, and a suspicious package was investigated, but they have not recovered any actual explosives from the scene.\n“After the first object turned out to be harmless, we got a tip that had to be taken seriously that an attack was being planned,” said police chief Volker Kluwe, as quoted by the UK Daily Mail – which is one of several sources to describe the suspicious object as a suitcase.\nUpdate, 2:50 PM EST: “There was a device intended to be detonated inside the stadium,” said the Hanover chief of police at a press conference.\nUpdate, 2:45 PM EST: Local media have been reporting the cause of the bomb threat was an ambulance packed with explosives, discovered outside the stadium. However, other sources, such as the UK Independent, say the suspicious object was a suitcase found at the stadium.\nIn any case, the German police confirmed there were “concrete plans to cause an explosion” at the Hannover stadium.\nThere are reports that a suspect connected with the bomb threat has been confronted by the police.\n*****\nA soccer match between Germany and the Netherlands was canceled less than two hours before it was scheduled to begin, and the stadium in Hannover evacuated, due to unspecified “security concerns.” According to Conflict News, there are now reports that German police “discovered a truck bomb disguised as a rescue vehicle” near the stadium.\nAccording to the Associated Press, German Chancellor Angela Merkel was among the VIPs set to attend the match, “to send a signal that Germany wouldn’t bow to terrorism in the wake of the Paris attacks.”\nThe AP report adds that a bomb threat was made against the stadium about an hour before the evacuation. Another Associated Press dispatch said a “suspicious object” was found at the stadium.\nA similar friendly match between Spain and Belgium was canceled in Brussels on Monday over security fears, according to the BBC.\nThe situation in Hannover seems more serious than the one in Brussels, judging by this development:\nBREAKING: Trains have been stopped heading away from the stadium. Pedestrians being told to move on foot. #GERNED — DW Sports (@dw_sports) November 17, 2015\nHowever, the AP reports “no signs of panic, with most fans seemingly accepting the decision with resignation.”","url":"https://www.breitbart.com/national-security/2015/11/17/germany-netherlands-soccer-match-canceled-stadium-evacuated/"}
