{"authors":["Associated Press"],"date_download":"2018-10-23 05:55:37","date_modify":"2018-10-23 05:55:37","date_publish":"2016-01-11 18:43:40","description":"BERLIN (AP) — A string of attacks on women in Cologne on New Year's Eve blamed largely on foreigners was \"intolerable,\" Chancellor Angela Merkel's spokesman ...","filename":"data/vaneerConsumption/GermanyPakistanisSyrianattackedinCologneamidtension.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:f866ee3b338044c0a6cf0e7940dbdf0c-48qEJGFphM8d437f0aaf9282c1c4-536_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393520_Germany-Pakistanis-Syrian-attacked-Cologne-amid-tension_1540274137.html","title":"Germany: Pakistanis, Syrian attacked in Cologne amid tension","title_page":"Germany: Pakistanis, Syrian attacked in Cologne amid tension | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Germany: Pakistanis, Syrian attacked in Cologne amid tension\nBERLIN (AP) — A string of attacks on women in Cologne on New Year's Eve blamed largely on foreigners was \"intolerable,\" Chancellor Angela Merkel's spokesman said Monday, but added nothing excuses retaliatory assaults on immigrants.\nMerkel has proposed making it easier to deport immigrants involved in crimes, and her spokesman Steffen Seibert emphasized the government is looking into both \"possible consequences for criminal law (and) possible political consequences for the intolerable crimes.\"\nBut after Cologne police said a group of Pakistanis and a Syrian were attacked in the city on Sunday, Seibert said Germans must not blame all the nearly 1.1 million migrants who entered the country last year, and said the government is also focused on their welfare.\nDemonstrators protest against racism and sexism in the wake of the sexual assaults on New Year's Eve, in front of the main station in Cologne, Germany, Saturday Jan. 9, 2016. After the sexual assaults around Cologne's main station on New Year's Eve, various groups have called for demonstrations on Saturday. (Oliver Berg/dpa via AP)\n\"We're doing all of these things to protect the population in Germany,\" he said. \"We are also doing this for the great majority of innocent refugees who have sought refuge from bombs and war in our country, and who should get this protection and who are prepared to adapt to the rules and values in our country.\"\nThe six Pakistani nationals were attacked Sunday by around 20 people, and two of them were briefly admitted to a hospital, police said. Also Sunday evening, five people attacked a Syrian man, who was injured but didn't need treatment.\nPolice official Norbert Wagner said authorities are treating those attacks as anti-foreigner crimes and believe the assailants arranged to meet via social media, news agency dpa reported.\nThe New Year's Eve assaults stoked tensions over Germany's open-door policy to refugees and prompted politicians to call for tougher laws against migrants who commit crimes.\n\"As abominable as the crimes in Cologne and other cities were, one thing remains clear: there is no justification for blanket agitation against foreigners,\" Justice Minister Heiko Maas said, adding that some people \"appear just to have been waiting for the events of Cologne.\"\nIn the eastern city of Leipzig on Monday night, supporters of the anti-Islamic PEGIDA movement demonstrated, carrying signs with slogans like \"RAPEfugees not welcome\" and \"Freedom for Germany.\"\nCounter-demonstrators, led by Mayor Burkhard Jung, carried a banner saying \"Welcome in Leipzig\" and placards saying \"No PEGIDA.\"\nPolice refused to give a crowd estimate but witnesses said about 2,000 people were on hand for either side.\nAuthorities and witnesses said the New Year's Eve attackers were among a group of about 1,000 people, described as predominantly Arab and North African men, who gathered at Cologne's central train station. Some broke off into small groups and groped and robbed women, police said.\nMaas has said German authorities need to quickly determine whether the assaults were coordinated or were linked to similar offenses in other cities including Hamburg. Incidents also were reported in Sweden and Finland.\nNorth Rhine-Westphalia state police told lawmakers Monday, however, that so far their investigation had found no indication the Cologne attacks were coordinated, or linked to others, dpa reported.\nCologne police say 516 criminal complaints have now been filed with them in connection to the New Year's attacks. About 40 percent involve allegations of sexual offenses.\nCologne's police drew criticism both for their response and for their slowness to release information. Police chief Wolfgang Albers was dismissed Friday by North Rhine-Westphalia state's interior minister, Ralf Jaeger.\nAt a session Monday of the state legislature's home affairs committee, Jaeger said Cologne police hadn't called in reinforcements who were offered.\nOf the 19 suspects identified by name by Cologne police, 10 were asylum-seekers and the other nine were believed to be in Germany illegally, according to a report Jaeger submitted to the committee. None was registered as living in Cologne, and four are now in custody for robberies committed during the New Year events.\nSeparately, 32 suspects have been identified by federal police, who have jurisdiction over the Cologne train station security, the Interior Ministry said. They include 22 asylum-seekers but also three Germans and an American, among others.\nIn Sweden, where police are also investigating New Year's Eve assaults in the city of Kalmar, police confirmed reports there had also been widespread sexual assaults at a music festival in Stockholm last summer. Stockholm police spokesman Varg Gyllander refused to give the nationality of the suspects, but did say \"this involves young men who are not from Sweden.\"\nIn a separate incident in Germany, police said Sunday that a Syrian and an Afghan were arrested in northern Germany on suspicion of attacking and robbing a French man who was wearing a Jewish skullcap at the Puttgarden ferry port. The incident happened on Saturday, and the two men had been denied entry to Denmark the previous day.\n___\nFrank Jordans and David Rising in Berlin and Karl Ritter in Stockholm contributed to this story.\nPeople stand in front of posters and flowers near the main train station in Cologne, western Germany, Monday, Jan. 11, 2016. A group of Pakistanis and a Syrian were attacked in Cologne amid tensions over New Year's Eve assaults in the city that have been blamed largely on foreigners, police said Monday. (Oliver Berg/dpa via AP)\nCORRECTS DAY - People hold candles to protest against a demonstration of Leipzig's Europeans against the Islamization of the West (LEGIDA), a group linked with the PEGIDA movement, in Leipzig, eastern Germany, Monday, Jan. 11, 2016. Slogan reads 'show courage'. (AP Photo/Markus Schreiber)\nCORRECTS DAY - People hold candles to protest against a demonstration of Leipzig's Europeans against the Islamization of the West (LEGIDA), a group linked with the PEGIDA movement, in Leipzig, eastern Germany, Monday, Jan. 11, 2016. Slogan read 'show courage'. (AP Photo/Markus Schreiber)","url":"https://www.dailymail.co.uk/wires/ap/article-3393520/Germany-Pakistanis-Syrian-attacked-Cologne-amid-tension.html"}
