{"authors":["Associated Press"],"date_download":"2018-10-23 02:15:55","date_modify":"2018-10-23 02:15:55","date_publish":"2016-01-29 16:39:45","description":"SEEFELD, Austria (AP) — Olympic Nordic Combined champion Eric Frenzel of Germany won a World Cup on Friday for his ninth consecutive victory in the resort of...","filename":"data/vaneerConsumption/GermanysFrenzelwins1steventofNordicCombinedTriple.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:48dd677b958b456b86df5de129412230-4PuZeKVXE7cd9005b2c876c4d3ed-228_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423017_Germanys-Frenzel-wins-1st-event-Nordic-Combined-Triple_1540260955.html","title":"Germany's Frenzel wins 1st event of Nordic Combined Triple","title_page":"Germany's Frenzel wins 1st event of Nordic Combined Triple | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Germany's Frenzel wins 1st event of Nordic Combined Triple\nSEEFELD, Austria (AP) — Olympic Nordic Combined champion Eric Frenzel of Germany won a World Cup on Friday for his ninth consecutive victory in the resort of the 2019 world championships.\nThe event also counted as the opening round of the Nordic Combined Triple, which adds the results of all three competitions this weekend with the overall winner earning double World Cup points.\nFrenzel, who was second after the ski jumping, finished the five-kilometer cross country 6.2 seconds ahead of Akito Watabe of Japan. The rest of the field was more than 43 seconds behind.\nGermany's winner Eric Frenzel celebrates in the finish area after the Nordic Combined World Cup competition in Seefeld, Austria, Friday, Jan. 29, 2016. (AP Photo/Kerstin Joensson)\n\"Seefeld is a good place for me,\" said Frenzel, who has won 10 of his 26 career World Cups here. \"I like the hill here, and I am usually doing very well on this track.\"\nWatabe jumped 107 meters to lead after the ski jump, and started the ski race eight seconds ahead of Frenzel. The German soon closed the gap and then cooperated with Watabe to increase their lead. Frenzel accelerated in the final kilometer to take the win.\nFrenzel's teammate, Fabian Riessle, was 43.6 behind in third, with two more Germans, Johannes Rydzek and Manuel Faisst, placing fourth and fifth.\nRiessle remained in the overall World Cup lead, just three points clear of Frenzel.\nOlympic silver medalist Magnus Moan was disqualified during the ski jump for an equipment irregularity, which also ruled out the Norwegian for the two remaining events this weekend.\nOnly the top 50 finishers will be allowed to start in Saturday's second event, which includes a 10-kilometer cross-country race.\nGermany's winner Eric Frenzel skis during the Nordic Combined World Cup competition in Seefeld, Austria, Friday, Jan. 29, 2016. (AP Photo/Kerstin Joensson)\nGermany's Eric Frenzel soars through the air during the Nordic Combined World Cup competition in Seefeld, Austria, Friday, Jan. 29, 2016. (AP Photo/Kerstin Joensson)","url":"https://www.dailymail.co.uk/wires/ap/article-3423017/Germanys-Frenzel-wins-1st-event-Nordic-Combined-Triple.html"}
