{"authors":["Gianluca Mezzofiore","Sara Malm For Mailonline","Allan Hall In Berlin"],"date_download":"2018-10-23 00:01:17","date_modify":"2018-10-23 00:01:17","date_publish":"2016-01-11 08:23:58","description":"Rally organised in Leipzig by xenophobic group PEGIDA targets Chancellor Angela Merkel and refugees blamed for sexual violence at New Year's Eve in Cologne.","filename":"data/vaneerConsumption/GermanyprotestersdemonstrateinLeipzigoverinfluxofmigrants.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/21/300E751100000578-0-image-a-28_1452547491890.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393543_Two-Pakistanis-Syrian-man-injured-gang-attacks-Cologne_1540252877.html","title":"Germany protesters demonstrate in Leipzig over influx of migrants","title_page":"Germany protesters demonstrate in Leipzig over influx of migrants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Protesters chanted 'We are the people', 'Resistance!' and 'Deport them!'\nThousands of protesters have waved anti-migrants signs and xenophobic flags in the eastern German city of Leipzig as they demonstrated against a record refugee influx they blamed for sexual violence at New Year's Eve events in Cologne.\nThe rally was organised by LEGIDA, the local chapter of xenophobic group PEGIDA, the Patriotic Europeans Against the Islamisation of the Occident,\nMany chanted 'We are the people', 'Resistance!' and 'Deport them!'. Others vented their anger and frustration at Chancellor Angela Merkel, who is accused of destroying Germany by letting in 1.1 million asylum seekers in 2015.\nScroll down for video\nProtestors from the PEGIDA movement (Patriotic Europeans Against the Islamisation of the Occident) march during a rally in Leipzig\nProtesters chanted 'We are the people', 'Resistance!' and 'Deport them!', in reference to the refugees they accused of sexual violence at New Year's Eve events in Cologne\nA poster of German Chancellor Angela Merkel (R) and one of the Hungarian prime minister Viktor Orban (L) reading 'Thank you' is held aloft by a PEGIDA protester\n'Refugees not welcome!' read one sign, showing a silhouette of three men armed with knives pursuing a woman, while another declared 'Islam = terror'.\nA heavy police presence, with water canon at the ready, kept watch over the crowd, and separated them from a group of counter-demonstrators, as rain poured down.\nWaving a sign declaring 'State of injustice', 44-year-old demonstrator Lukas Richter said 'Merkel is breaching the constitution and must go,' and that 'the government must close the borders and return all illegal migrants'.\nHe charged that the New Year's Eve mob attacks in the western city of Cologne - where hundreds of women reported being groped and robbed by men described as Arabs and North Africans - highlighted 'the violence of foreigners in Germany that has existed for years'.\nA 44-year-old demonstrator, Lukas Richter, said 'Merkel is breaching the constitution and must go'\nLutz Bachmann, leader of the PEGIDA movement, speaks to protesters in Leipzig\nA heavy police presence, with water canon at the ready, kept watch over the crowd\nA protestor opposing PEGIDA is seen holding a candle while attending a counter rally in Leipzig\nThe rally came as vigilante mobs have been attacking Pakistani and Syrians in Cologne, leaving at least two in hospital, following calls on social media for 'revenge' in the wake of the New Years Eve assaults.\nThe attacks were carried out by groups of young men, allegedly specifically targeting foreigners, after reports Cologne police are focusing their investigation on asylum seekers and migrants.\nMore than 500 criminal complains have now been filed over the events outside Cologne's famous cathedral on New Years Eve, where young women were sexually assaulted, raped and robbed.\nAttacks: Right-wing supporters attend a to protest against the New Year's Eve sex attacks in Cologne, as police reports that a number of Pakistani and Syrian men have been attacked by vigilante groups\nTwo Pakistani nationals were admitted to hospital after six men were attacked by a mob of 20 people near the city's main train station - the scene of the New Years Eve attacks - on Sunday.\nIt is unclear what their condition is although the police are looking to press charges of 'serious bodily harm' against their attackers who kicked, beat and abused them verbally.\nAccording to the Cologne Express newspaper, a group of 'hooligans, rockers and bouncers' linked up on Facebook for payback for the mass sexual frenzy on the last day of the year that was allegedly carried out largely by foreigners and refugees.\nThe Express said the Facebook vigilante groups had promised an 'orderly clean up' of the old town centre in their 'manhunt.'\nPolice confirmed one Syrian man was also hurt in an attack on Sunday, which took place just 20 minutes after the first, but is believed to have been carried out by a separate group of five men.\nTwo Pakistani nationals were admitted to hospital after six men were attacked by a mob of 20 people near Cologne's main train station(pictured)\nRacial tension: Supporters of Pegida, Hogesa (Hooligans against Salafists) and other right-wing populist groups protest against the New Year's Eve sex attacks in Cologne, Germany, this weekend\nToo little too late? Police presence has now been heightened in Cologne, but many criticise the force's actions on New Years Eve, saying not enough was done to stop the mob assaults on women\nThe 39-year-old man was injured but did not require medical treatment.\nPolice say they are still investigating whether the attacks were racially motivated and whether there was any link to the New Year assaults.\nToday, the minister for North Rhine-Westphalia, the German state where Cologne is located, admitted that people of foreign descent were responsible for virtually all of the violence on New Year's Eve in the city.\n'Based on testimony from witnesses, the report from the Cologne police and descriptions by the federal police, it looks as if people with a migration background were almost exclusively responsible for the criminal acts,' Ralf Jaeger, interior minister from the state of North Rhine-Westphalia told a special commission on the Cologne violence.\n'All signs point to these being north Africans and people from the Arab world,' he added. 'Based on what we know now from the investigation, asylum seekers who arrived in the past year are among the suspects.'\nCologne has a significant first and second generation immigrant population and racial tension has heightened in the wake of New Years Eve.\nMob violence: More than 500 criminal complains have now been filed over the events outside Cologne's famous cathedral on New Years Eve, where young women were sexually assaulted, raped and robbed\nThe city, which has a population of just over one million, has more than 120,000 practicing Muslim residents and the largest Jewish communities in Germany. Just over 5.5 per cent are born in Turkey.\nOver the past week, the police presence in the city has been heightened, but many has called the efforts 'too little too late', questioning why officers had not been able to stop the mass attacks.\nThe assaults on women in Cologne and other German cities have prompted more than 600 criminal complaints, with the police investigation focusing on asylum seekers and migrants.\nIn Cologne alone, 516 criminal complaints had been filed by individuals or groups in relation to assaults on New Year's Eve, while police in Hamburg said 133 similar charges had been lodged with the north German city.\nOn Monday, a regional parliamentary commission in the state of North-Rhine Westphalia, whose largest city is Cologne, will question police and others about the events on New Year's Eve.\nThe anti-Islam political movement, PEGIDA, whose supporters threw bottles and fire crackers at a march in Cologne on Saturday before being dispersed by riot police, will hold a rally in the eastern German city of Leipzig on Monday evening.","url":"https://www.dailymail.co.uk/news/article-3393543/Two-Pakistanis-Syrian-man-injured-gang-attacks-Cologne.html"}
