{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:28:48","date_modify":"2018-10-30 18:28:48","date_publish":"2017-01-16 17:38:14","description":"Facebook has launched new features in Germany to counter so-called “fake news” after authorities claimed such stories could help populists.","filename":"data/vaneerConsumption/GermanFacebookUsersCanNowReportFakeNews.json","image_url":"https://media.breitbart.com/media/2017/01/Fake-News-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_01_16__1540924128.html","title":"German Facebook Users Can Now Report ‘Fake News’","title_page":"German Facebook Users Can Now Report ‘Fake News’","title_rss":"NULL","source_domain":"breitbart.com","text":"Facebook has launched new features in Germany to counter so-called “fake news” after authorities claimed such stories could help populists in this year’s elections and threatened to sue the social media firm.\nThe measures include “disrupting financial incentives for spammers” and “third-party fact checking”. So-called “disputed” stories will be flagged to users of the platform before they read or share them.\nUsers who are worried or offended by certain articles will be able to report them in a few clicks, and “onboarding third-party fact checking organizations in Germany who are signatories of Poynter’s International Fact Checking Code of Principles” will help decide if they are flagged.\n“We’ll use the reports from our community, along with other signals, to send stories to these organizations”, Facebook wrote in a blog post this Sunday. The “third-party organizations” are thought to include the German-based Correctiv investigative journalism newsroom.\n“We fear that these threats [from fake news] will become even more massive in the coming months, whether it is the NRW election or the election of the Bundestag in autumn,” Correctiv said in a statement to Deutsche Welle. “For this reason, we are determined to do as much as we can to fight fake news. Our democracy must not be abused by lies and liars.”\nIn their statement, Facebook was keen to stress they are only targeting the “worst of the worst offenders” and said they “believe in giving people a voice and that we cannot become arbiters of truth ourselves…”\nIn August 2016, Facebook fired its entire Trending News team, formerly responsible for curating the platform’s “Trending News” list, after Breitbart and others reported accusations of progressive, liberal biases.\n“If the fact checking organizations identify a story as fake, it will get flagged as disputed and there will be a link to the corresponding article explaining why. Stories that have been disputed may also appear lower in News Feed,” Facebook explain.\n“We’re testing several ways to make it easier to report a hoax if you see one on Facebook, which you can do by clicking the upper right hand corner of a post. We’ve relied heavily on our community for help on this issue, and this can help us detect more fake news,” they add.\nContinuing: “It’s important to us that the stories you see on Facebook are meaningful to you. We’re excited about this progress, but we know there’s more to be done. We’re going to keep working on this problem and will keep you updated on other updates.”\nIn December, German officials proposed creating a special government unit to combat fake news, and the Justice Minister even threatened to sue Facebook unless unfavourable content was deleted quickly.\nSome German politicians have said that populist parties and foreign nations could use fake news to try and influence parliamentary elections happening this September or October – after campaigners claimed the Brexit vote and U.S. presidential campaigns were influenced by fake news.\nLocal authorities and the German press even attempted to dismiss a Breitbart London story about migrants and New Year’s Eve disturbances as fake news earlier this month.\nThe fact that I wrote three stories about Germany this week is one hint that it has become a fake-news hotspot:https://t.co/1oFx7CEM2s pic.twitter.com/4w8fW43FiS — Craig Silverman (@CraigSilverman) January 15, 2017\nThe left-wing website Buzzfeed has claimed that, overall, fake news accounted for 10.6 million of the 21.5 million shares, reactions, and comments on U.S. politics stories on Facebook last year.\nHowever, Donald. J. Trump accused Buzzfeed themselves of being “fake news” last week after the website published lurid and unsubstantiated claims about the president-elect.\nFacebook announced a similar fake news fact-checking programme in the U.S. in December, partnering with partisan organisations such as ABC News, and the British parliament is set to launch an inquiry into fake news this Spring.","url":"https://www.breitbart.com/europe/2017/01/16/german-facebook-users-report-fake-news-government-pressure/"}
