{"authors":[],"date_download":"2018-10-22 21:00:51","date_modify":"2018-10-22 21:00:51","date_publish":"2014-05-05 15:19:03","description":"A German start-up believes happy animals \"bring good karma to the consumer, the farm animals and the rest of the world.\"","filename":"data/vaneerConsumption/GermanysMyLittleFarmWantsYoutoMeetYourMeat.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/419656/140505-german-farm-pigs-7a_d33cb5c5b2d6057ab490a7983e8082b0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_europe_germanys-my-little-farm-wants-you-meet-your-meat-n97271_1540242051.html","title":"Germany's My Little Farm Wants You to Meet Your Meat","title_page":"Germany's My Little Farm Wants You to Meet Your Meat","title_rss":"NULL","source_domain":"nbcnews.com","text":"According to the latest studies, Germany slaughters more than 730 million animals per year, most of them in highly industrialized production plants.\n“Today, shoppers have no clue where the meat in their supermarkets comes from and how far it eventually traveled,” said 36-year old Dennis Buchmann, who jokingly calls himself CPO (Chief Pig Officer) of the small company.\n“The farmers we work with have organic, free-range farms and breed their animals close to the consumer,” he added.\nBuchmann launched the project in 2011 when Germany was rocked by several food scandals, including the sales of dioxin-contaminated products and out-of-date meat. And last year German officials detected horse meat in frozen lasagna which was on sale in supermarkets across Europe – with outrage spreading from the U.K. and throughout the continent.\nAnalysts applaud Buchmann’s message of “less meat, more respect.”\n“We need to lower our meat consumption significantly and change the way we produce meat,” said Christine Chemnitz from the Heinrich-Böll-Foundation. The organization is linked to Germany’s environmentalist Greens Party, which promoted a national ‘Veggie Day’ as part of its campaign in last year’s federal election.\n“We need to consume meat more sensibly, as our high meat consumption is ecologically and socially not sustainable,” said Chemnitz, one of the authors of the foundation’s annual ‘Meat Atlas’ study.\nFor My Little Farm, which recently was recognized for its sustainable food production by the German government, it is all about transparency when it comes to the different ‘Schnitzel’ and ‘Wurst’ (sausage) variations on German consumers’ plates.","url":"https://www.nbcnews.com/news/europe/germanys-my-little-farm-wants-you-meet-your-meat-n97271"}
