{"authors":[],"date_download":"2018-10-23 03:44:54","date_modify":"2018-10-23 03:44:54","date_publish":"2017-03-10 13:32:45","description":"Germany will kick off 2018 with friendlies against Spain and Brazil as the reigning world champions prepare for their title defence at the World Cup in Russia a few months later.","filename":"data/vaneerConsumption/GermanytoplaySpainandBrazilaheadof2018WorldCup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3C06F4B600000578-0-image-a-39_1489152515635.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301232_Germany-play-Spain-Brazil-ahead-2018-World-Cup_1540266294.html","title":"Germany to play Spain and Brazil ahead of 2018 World Cup","title_page":"Germany to play Spain and Brazil ahead of 2018 World Cup | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Germany will kick off 2018 with friendlies against Spain and Brazil as the reigning world champions prepare for their title defence at the World Cup in Russia a few months later.\nThe German Football Association (DFB) said they will host Spain on March 23 in Dusseldorf and then take on Brazil four days later in Berlin.\nThe DFB said it was a request from the team's coaching staff to secure top opponents for their few opportunities for friendly matches ahead of the World Cup.\nWorld champions Germany will kick off 2018 with friendlies against Spain and Brazil\n'The matches against Spain and Brazil will certainly offer a taste of what is to come at the World Cup in Russia where the team under Joachim Loew will give everything it has to defend the title,' DFB President Reinhard Grindel said.\nGermany have not yet booked their ticket to the World Cup but are top of their qualifying Group C with four wins out of four matches, five points ahead of second-placed Northern Ireland.\nGermany won their first World Cup as a unified nation at the 2014 tournament in Brazil, beating Argentina in the final.","url":"https://www.dailymail.co.uk/sport/football/article-4301232/Germany-play-Spain-Brazil-ahead-2018-World-Cup.html"}
