{"authors":["Allan Hall In Germany For Mailonline"],"date_download":"2018-10-23 00:33:54","date_modify":"2018-10-23 00:33:54","date_publish":"2017-03-16 09:57:25","description":"The huge police operation involving 30 elite officers usually reserved for terrorism incidents was launched on Wednesday when the cyclist ditched his bike on a motorway in Germany.","filename":"data/vaneerConsumption/Germanpoliceshootcyclistwhohadarubberhorrormask.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E533CFF00000578-0-image-a-5_1489658206710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319332_German-police-shoot-cyclist-rubber-horror-mask_1540254834.html","title":"German police shoot cyclist who had a rubber horror mask","title_page":"German police shoot cyclist who had a rubber horror mask | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"German police shot a cyclist carrying a rubber horror mask who tried to flee across a field after officers attempted to stop him.\nThe huge police operation occurred on Wednesday and involved the elite SEK, usually deployed in terrorism and hostage situations.\nThere has been no official line regarding the incident, leading to speculation the man - who was wounded and underwent emergency surgery for his injuries - was a terror suspect.\nTwo armed police officers make their way up the embankment in pursuit of the cyclist\nThe operation to seize him was launched after he rode a bicycle on to the A52 autobahn near Gelsenkirchen.\nWhen police chased after him he abandoned his bike, ran up an embankment and sprinted across fields.\nThat was when police opened fire on him.\nAmong his possessions police found a rubber 'horror' mask.\nA police spokesman was unable to say why 30 SEK officers were deployed to catch one rogue cyclist and said an investigation was 'ongoing'.\nThe man was shot at 5.30pm and the motorway stayed closed for seven hours.\nHe is said to be in a stable condition.","url":"https://www.dailymail.co.uk/news/article-4319332/German-police-shoot-cyclist-rubber-horror-mask.html"}
