{"authors":[],"date_download":"2018-10-23 03:45:19","date_modify":"2018-10-23 03:45:19","date_publish":"2016-01-11 16:37:48","description":"Former German chancellor Gerhard Schroeder held talks Monday with top officials in Tehran on boosting trade links and Iran's diplomatic crisis with Saudi Ara...","filename":"data/vaneerConsumption/GermanexchancellorSchroederonIranbusinessvisit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z7ct-3WAQP5SaQH704788ebcf7e0e061e-414_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394215_German-ex-chancellor-Schroeder-Iran-business-visit_1540266319.html","title":"German ex-chancellor Schroeder on Iran business visit","title_page":"German ex-chancellor Schroeder on Iran business visit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"German ex-chancellor Schroeder on Iran business visit\nFormer German chancellor Gerhard Schroeder held talks Monday with top officials in Tehran on boosting trade links and Iran's diplomatic crisis with Saudi Arabia.\nThe visit comes ahead of the expected implementation of a nuclear deal with Iran that will open its economy to Western investment after years of sanctions on its banks and key industries.\n\"We envisage a good future for Iran-Germany relations after the final implementation of the nuclear deal,\" he told Foreign Minister Mohammad Javad Zarif, according to an official statement from Iran.\nFormer German chancellor Gerhard Schroeder (left) shakes hands with Iranian security official Ali Shamkhani in Tehran, on January 11, 2016\n\"German companies and business owners are ready to participate in all economic and industrial fields\" in Iran, he said.\nSchroeder also stressed Iran's role in regional peace and security.\n\"After the closing of the nuclear file, Europe and Germany hope to make utmost use of Iran's great potential to solve regional crises,\" he said.\nZarif said Tehran was entering \"a new phase of relations with Germany\".\nSchroeder and Zarif also spoke about Saudi Arabia, which has severed diplomatic ties with Iran in a row over the execution of a Shiite cleric. The execution triggered protests and an arson attack at the Saudi Arabian embassy in Tehran.\n\"Extremism is the real threat in the region, the ideological and financial sources of which are rooted in Saudi Arabia,\" Zarif said.\nSchroeder was to meet the ministers of oil and transport, and President Hassan Rouhani, on Tuesday, a German embassy official said.\nSchroeder is the honorary chairman of NUMOV, the Berlin-based German Near and Middle East Association, which works to boost trade.\nGermany was the first member of the P5+1 countries (Britain, China, France, Russia and the United States plus Germany) to send a major trade delegation to Tehran after the nuclear deal was struck on July 14 last year.\nThat trip was led by Sigmar Gabriel, Germany's economy minister and Chancellor Angela Merkel's deputy.\nIran has said it needs tens of billions of dollars of investment and Western technology to revive projects in its oil, gas and petrochemical industries, which have suffered under sanctions.\nThe Islamic republic's 78 million population and educated workforce has long been seen as untapped, and its energy sector is considered ripe for deals.","url":"https://www.dailymail.co.uk/wires/afp/article-3394215/German-ex-chancellor-Schroeder-Iran-business-visit.html"}
