{"authors":[],"date_download":"2018-10-22 23:56:12","date_modify":"2018-10-22 23:56:12","date_publish":"2016-01-11 07:51:27","description":"German Angelique Kerber defied fierce heat and early lethargy to maintain her trouble-free build-up to next week's Australian Open on Monday. The fourth seed...","filename":"data/vaneerConsumption/GermantennisstarKerberstayshealthyinSydneyheatbattle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z6jv-56CX32zFKLb7123928b84cc0f557-953_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393510_German-tennis-star-Kerber-stays-healthy-Sydney-heat-battle_1540252572.html","title":"German tennis star Kerber stays healthy in Sydney heat battle","title_page":"German tennis star Kerber stays healthy in Sydney heat battle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"German tennis star Kerber stays healthy in Sydney heat battle\nGerman Angelique Kerber defied fierce heat and early lethargy to maintain her trouble-free build-up to next week's Australian Open on Monday.\nThe fourth seed, one of the few members of the women's world top 10 not to have suffered a setback in the lead-up to the year's first Grand Slam, came from a set down to oust Ukraine's Elina Svitolina 4-6, 6-0, 6-3 in the opening round of the Sydney International.\nKerber, who lost to Victoria Azarenka in last weekend's final at the Brisbane International, is looking for more matches to hone her form leading into the Australian Open in Melbourne.\nGermany's Angelique Kerber hits a return against Ukraine's Elina Svitolina during their women's singles first round match at the Sydney International on January 11, 2016 ©Peter Parks (AFP)\nWhile defending champion Petra Kvitova and second seed Agnieszka Radwanska pulled out of the Sydney event citing injuries, Kerber powered on to get in some valuable match practice.\nKvitova and Radwanska's withdrawals came after injury problems at other Australian tournaments for the world's top-ranked stars including Serena Williams (knee), Simona Halep (Achilles), Garbine Muguruza (foot) and Maria Sharapova (forearm).\n\"I had a lot of matches last week, but that was actually also my plan to come to Australia, to have a lot of matches, and also to play a few more matches here,\" Kerber said.\n\"I don't know how far I can get. I'm healthy. I have no pain anywhere. I will just try to recover and see how I feel tomorrow. But my body feels good.\"\nKerber struggled with the intense heat early in her match, dropping the opening set without winning a game, but she battled on.\n\"It's good to have a match like this under my belt. It's always hot in Australia. I think it was a good match to prepare for Melbourne,\" she said.\nWith temperatures hitting 37 Celsius (99 Farenheit) the WTA's extreme heat policy came into force, allowing Kerber and Svitolina to take a 10-minute break before the third and deciding set.\nOther first-round winners on Monday were Italy's world number 19 Sara Errani over Spanish seventh seed Carla Suarez 6-3, 6-3, and German Sabine Lisicki, who eased past Slovenia's Polona Hercog 6-4, 6-3.\nIn the men's draw, Italian fifth seed Andreas Seppi eliminated Denis Istomin of Uzbekistan in three sets, but compatriot Simone Bolelli went out to American qualifier Alexander Sarkissian 6-2, 7-6 (7/5).","url":"https://www.dailymail.co.uk/wires/afp/article-3393510/German-tennis-star-Kerber-stays-healthy-Sydney-heat-battle.html"}
