{"authors":["Breitbart News"],"date_download":"2018-10-30 22:00:45","date_modify":"2018-10-30 22:00:45","date_publish":"2015-09-13 16:25:21","description":"Germany will introduce temporary border checks on the Austrian frontier in a bid to limit the influx of refugees.","filename":"data/vaneerConsumption/GermanytoEnactEmergencyBorderChecksoverFloodofMigrants.json","image_url":"https://media.breitbart.com/media/2015/09/ap_ap-photo718-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_13__1540936845.html","title":"Germany to Enact Emergency Border Checks over Flood of Migrants","title_page":"Germany to Enact Emergency Border Checks over Flood of Migrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"BERLIN (AP) — Germany will introduce temporary border checks on the Austrian frontier in a bid to limit the influx of refugees, the interior minister said Sunday.\nThe measure might lead to disruption of railway services, Interior Minister Thomas de Maiziere said without giving further details.\nGermany and Austria agreed over a week ago to let in migrants who had gathered in Hungary, saying it was a one-time measure to ease an emergency. Still, the influx has continued and German officials have said over the weekend that the speed of the arrivals was straining the country’s ability to provide accommodation.\nHungarian police say more than 186,000 people have passed through Hungary from Serbia this year en route to Austria and the migrants’ major destination, Germany, which says it has taken in more than 50,000 newcomers in the past week alone.\nAbout 450,000 migrants have arrived in Germany this year. The country is expecting at least 800,000 in 2015 – by far the most in the 28-nation EU.\nIn another tragedy on Sunday, at least 34 people seeking a better life in Europe drowned as they attempted a wind-swept crossing from Turkey to Greece, a journey often made more dangerous because smugglers require asylum seekers to pilot the overloaded craft themselves in choppy seas.\nGreece’s coast guard said the dead, including four infants and 11 older children, drowned when their wooden boat containing more than 130 people capsized near Farmakonissi. The island lies midway between Samos and Kos, two of the favored targets for smugglers sending thousands daily to Greek islands off Turkey’s coast. Smugglers typically stay behind to avoid arrest in Greece.\nCoast guard officials said the boat may have tipped over in part because of wind gusts exceeding 50 kph (30 mph).\nRescue officials said 68 others were rescued from the sea while 30 more swam to the barely populated island. They said the survivors and the body of one child were taken to the nearby larger island of Leros. The other dead were taken aboard a Greek navy gunboat and a coast guard vessel bound for Rhodes, which has autopsy facilities.\nOn Saturday, two other boats carrying asylum seekers capsized in the Aegean and at least five people – four children and a 20-year-old man – were presumed drowned. The coast guard said they still were searching for those bodies.\nSuch risks have not deterred scores of boats to make the crossing daily to Greece’s eastern islands, from where migrants pursue a more than 1,000-mile (1,600-kilometer) odyssey to the heart of the European Union via the Balkans and Hungary, where authorities have vowed to fortify their southern frontier and prosecute those who try to evade border police.\nHungarian army engineers spent Sunday expanding the country’s planned 174-kilometer (109-mile) border fence with Serbia and crowning it with coils of razor wire as the government warned that, from Tuesday onward, any asylum seekers caught breaking through the barrier would be arrested and charged with a criminal offense.\nPolice said 4,330 were detected crossing on foot in the previous 24 hours, more than 700 higher than the previous one-day record, as trekkers strove to reach Hungary before the tougher security measures take effect.\nHungarian Prime Minister Viktor Orban says he’s determined to make his country a more difficult challenge, with deployments of troops and potential prison terms part of the deterrent.\nHungary’s lawmakers have not voted yet on whether to back government plans to deploy more than 3,000 troops in support of border police, but dozens of soldiers already were patrolling the fence Sunday. Some drove along the dirt track beside the fence in jeeps while others patrolled on foot with attack dogs. While many migrants viewed the military presence with suspicion, they were able to walk through a gap in the fence without being challenged. All soldiers appeared to be armed with assault rifles.","url":"https://www.breitbart.com/national-security/2015/09/13/germany-to-enact-emergency-border-checks-over-flood-of-migrants/"}
