{"authors":[],"date_download":"2018-10-21 02:47:43","date_modify":"2018-10-21 02:47:43","date_publish":"2018-07-25 13:15:24","description":"Shih, who joins from the Associated Press, will work in Beijing alongside bureau chief Anna Fifield.","filename":"data/vaneerConsumption/GerryShihjoinsTheWashingtonPostasChinacorrespondent.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_07_25__1540090063.html","title":"Gerry Shih joins The Washington Post as China correspondent","title_page":"Gerry Shih joins The Washington Post as China correspondent - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Foreign Editor Douglas Jehl and Deputy Foreign Editor Mary Beth Sheridan:\nWe’re very happy to announce that Gerry Shih of the Associated Press will join The Post as a China correspondent, based in Beijing.\nGerry is a fluent Mandarin speaker who has reported from Beijing for the last four years, first for Reuters and then for the AP. He has distinguished himself as one of the most gifted and perceptive young reporters in China today, particularly in his reporting about China’s Muslim minority Uighur community. His run of impressive scoops has included revelations documenting the impact of China’s ethnic policies and the significant involvement of Uighur militants in the war in Syria.\nGerry began his career at the New York Times, where he was a James Reston reporting fellow in New York. He covered politics and government for the Bay Citizen in San Francisco when that organization was producing a Bay Area section for The Times. He joined Reuters to cover Silicon Valley, then moved to China as technology correspondent, covering cybersecurity and the impact of China’s policies on companies like Apple, IBM and Huawei. He has worked for the AP since 2015, traveling extensively in China and beyond and covering domestic politics, society, law and human rights.\nGerry was born in the Bay Area and is a graduate of Stanford University, where he studied economics and Japanese. He also speaks conversational Spanish.\nIn moving to The Post, Gerry will join bureau chief Anna Fifield in our two-correspondent operation in Beijing. He will succeed Emily Rauhala, who is moving to Washington this fall as part of a Foreign desk initiative. Gerry will start work in the newsroom on Sept. 4; he’ll return to Beijing after training, orientation and the requisite visa approval by the Chinese authorities.","url":"https://www.washingtonpost.com/pr/wp/2018/07/25/gerry-shih-joins-the-washington-post-as-china-correspondent/"}
