{"authors":[],"date_download":"2018-10-22 23:32:33","date_modify":"2018-10-22 23:32:33","date_publish":"2016-01-11 06:21:27","description":"Ricky Gervais again proved his penchant for provocation as he returned as host of the Golden Globe Awards, ribbing Hollywood's A-listers with at times uncomf...","filename":"data/vaneerConsumption/GervaisprovokesHollywoodinreturntoGoldenGlobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5vw-48qEJGFphM8d437f0aaf92144b96-193_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393324_Gervais-provokes-Hollywood-return-Golden-Globes_1540251153.html","title":"Gervais provokes Hollywood in return to Golden Globes","title_page":"Gervais provokes Hollywood in return to Golden Globes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gervais provokes Hollywood in return to Golden Globes\nRicky Gervais again proved his penchant for provocation as he returned as host of the Golden Globe Awards, ribbing Hollywood's A-listers with at times uncomfortable jokes.\nThe sharp-tongued British comic -- the host of the awards from 2010-2012 before being replaced by Tina Fey and Amy Poehler -- appeared to relish his bad boy reputation as he took the stage at the Beverly Hilton on Sunday.\n\"Shut up, you disgusting, pill-popping deviant scum!\" he said by way of greeting the crowd.\nRicky Gervais arrives for the 73nd annual Golden Globe Awards, at the Beverly Hilton Hotel in Beverly Hills, California, on January 10, 2016 ©Valerie Macon (AFP)\n\"One Hollywood publication said that me hosting would mean that some film stars would stay away for fear of being made fun of. As if film stars would stay away from the chance of winning a Golden Globe -- particularly if their film company has already paid for it,\" he said, alluding to longstanding criticism on the process for selecting the winners.\nGervais poked fun at Olympic decathlon champion turned Hollywood celebrity Caitlyn Jenner, a pioneer for transgender rights by speaking publicly about her gender change but who was also involved in a deadly car crash last year.\n\"What a year she's had. She became a role model for trans people everywhere, showing great bravery in breaking down barriers and destroying stereotypes.\n\"She didn't do a lot for women drivers, but you can't have everything, can you?\" Gervais said to applause.\nGervais got noticeably less laughter when he joked about French-Polish director Roman Polanski, who stays away from the United States to avoid prosecution for the 1977 statutory rape of a 13-year-old girl.\nReferring to \"Spotlight,\" a nominated movie about The Boston Globe's investigation into child abuse by Catholic priests, Gervais quipped: \"Roman Polanski called it the best date movie ever.\"\n- A political punch -\nThe Briton also took aim at the presidential race in the United States with a jab at Republican front-runner Donald Trump, who has repeatedly criticized immigrants.\nIntroducing two Hispanic stars to present an award, Gervais said: \"Eva Longoria and America Ferrera aren't just beautiful, talented actresses. They are also two people who your future president, Donald Trump, can't wait to deport.\"\nGervais also did not shy away from jokes about Hollywood celebrities' private lives.\nHe welcomed to the stage Matt Damon as \"the only person Ben Affleck hasn't been unfaithful to,\" in a reference to the high-profile personal relationships of Damon's friend and sometime collaborator.\nThe Hollywood Foreign Press Association had itself said in 2011 that Gervais caused \"anger and resentment\" with his one-liners, explaining the mixed reaction to inviting him to return.\n- New showdown with Mel Gibson -\nBut Gervais -- himself a Golden Globe winner in 2004 for \"The Office\" -- also found at least one butt of his humor capable of making a quick comeback.\nThe comedian introduced actor-director Mel Gibson, who earned notoriety over incidents in which he drunkenly used anti-Semitic and other racist language.\nGervais gleefully mocked Gibson at the 2010 Golden Globes and quipped Sunday: \"Mel's forgotten all about it, apparently. That's what drinking does.\"\n\"I want to say something nice about Mel before he comes out.\n\"Okay, here you go -- I'd rather have a drink with him in his hotel room tonight than Bill Cosby,\" said Gervais, referring to the veteran entertainer who has become a pariah after more than 50 women accused him of drugging and sexually abusing them.\nGervais, drinking beer throughout the Golden Globes, theatrically whisked his pint glass away as Gibson approached the podium.\nBut Gibson, at least outwardly, took the barbs in stride.\n\"I love seeing Ricky once every three years because it reminds me to get a colonoscopy,\" he said.\nImmediate reviews for Gervais were not favorable, with some critics saying the host's joy in offending guests had become formulaic.\n\"However much the producers and (broadcasters) NBC relish the publicity that Gervais generates -- and apparently, they don't know how to quit him -- it's time they put more effort into shaping the broader ceremony,\" wrote Brian Lowry, a critic for entertainment magazine Variety.\nAn advert for the upcoming 73nd annual Golden Globe Awards is seen in Beverly Hills, California, on January 9, 2016 ©Robyn Beck (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393324/Gervais-provokes-Hollywood-return-Golden-Globes.html"}
