{"authors":[],"date_download":"2018-10-30 14:33:40","date_modify":"2018-10-30 14:33:40","date_publish":"2018-08-16 20:30:00","description":"The Chick-fil-A College Football Hall of Fame in downtown Atlanta will offer free admission inside, and a party outside, on Saturday, Aug. 25.  The Atlanta attraction dedicated to all things college football is kicking off the upcoming season in a big way.","filename":"data/vaneerConsumption/GetintotheCollegeFootballHallofFameforfreetomorrow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/07/Videos/4433482.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_here-how-kick-of_ebb66717d0c61ea0f08f7059a384f5b9__1540910020.html","title":"Get in to the College Football Hall of Fame for free tomorrow","title_page":"Free day at College Football Hall of Fame in Atlanta Aug 25 2018","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta attraction dedicated to all things college football is kicking off the upcoming season in a big way.\nThe Chick-fil-A College Football Hall of Fame will offer free admission inside, and a party outside, for everyone on Aug. 25.\nREAD | Midtown development committee to hear plans for Georgia Tech Microgrid\nREAD | 10th artist chosen to plaster Atlanta with murals for Super Bowl 2019\nRELATED | More Things To Do this weekend in Atlanta\nGuests may enter the business at no charge from 9 a.m. to 6 p.m. that day. Meanwhile, the second annual Chick-fil-A Peach Bowl Football Fest will take place the same day in front of the Hall of Fame, at 250 Marietta St., from 9 a.m. to 4 p.m.\nEntertainment will consist of music, DJs, drum lines, step teams and cheerleaders, a press release said. The street will also be filled with inflatables and football-themed games.\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/here-how-kick-off-the-college-football-season-atlanta-for-free/37A84gx84wx9bqYr5sTU2H/"}
