{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 17:50:13","date_modify":"2018-10-30 17:50:13","date_publish":"2018-10-30 16:17:52","description":"Taste wine and candy during a special sampling event.","filename":"data/vaneerConsumption/GetLeCreusetitemsfortheholidaysandmorefoodeventsinmetroAt.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/Ray's%20at%20Killer%20Creek%20Interior.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ge_40a08aab1dafdfc27ef39df98ad496ae__1540921813.html","title":"Get Le Creuset items for the holidays and more food events in metro At","title_page":"Get Le Creuset items for the holidays and more food events in metro At","title_rss":"NULL","source_domain":"ajc.com","text":"Taste wine and candy during a special sampling event. Shop for holiday items—for you or in preparation of Thanksgiving dinner—during Le Creuset’s factory sale. There are several fun, food events happening in metro Atlanta, so add one or all four of the following activities to your calendar. Be prepared to eat, drink and have a grand ole time.\nTuesday, Oct. 30: Head to Virginia-Highland for Scary Good Pairings, a wine tasting with Halloween candy beginning 6:30 p.m. at Murphy’s. Dinner and small plates will be available a la carte. Event tickets, which are $25, may be purchased here.\n997 Virginia Ave. NE, Atlanta. 404-872-0904, murphys-atlanta-restaurant.com.\nWednesday, Oct. 31: Join Hampton + Hudson to celebrate the 90s with half-off wine carafes, beer specials, a DJ spinning tunes from the decade and lots of candy beginning at 7 p.m. A costume contest winner will receive a prize at 10 p.m.\n299 N. Highland Ave. NE, Atlanta. 404-948-2123, hamptonandhudson.com.\nThursday, Nov. 1: For a six-course wine dinner featuring pork belly and lobster steamed buns, lamb tenderloin Wellington and Kobe beef strip steak all paired with Wagner Family Wine from Napa Valley, head to Ray’s at Killer Creek. A reception with blue crab and andouille beignets, caviar potatoes and wine will begin at 6:30 p.m.; dinner will start at 7 p.m. A seat at the table will be $99; call the restaurant for reservations.\n1700 Mansell Road, Alpharetta. 770-649-0064, raysrestaurants.com/raysatkillercreek.\nNov. 2 – 4: Get prepared for cooking Thanksgiving dinner and ahead of your holiday shopping with Le Creuset’s factory-to-table sale at the Cobb Galleria Convention Center (2 Galleria Pkwy. SE, Atlanta). Tickets, available for purchase in two-hour slots here, are $10 for Nov. 2 – 3 from 9 a.m.-7 p.m. and free with online registration Nov. 4, 10 a.m.-5 p.m. All ticket proceeds will be donated to Georgia Organics as well as scholarships for education with the Atlanta chapter of Les Dames d’Escoffier International.\n﻿\n﻿Nov. 3-9: Try the best of Sandy Springs’ restaurant during the fifth annual Sandy Springs Restaurant Week. Participating restaurants, including Food 101, Under the Cork Tree and Chef Rob’s Caribbean Cafe will be offering exclusive prix-fixe menus along with additional promotions, sweet treats and other unique offerings.\nvisitsandysprings.org/restaurantweek/\nRead the 2018 AJC Fall Dining Guide: Dining on Buford Highway\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/get-creuset-items-for-the-holidays-and-more-food-events-metro-atlanta-this-week/rgaA9S7Bl4d6xRbVeX79PL/"}
