{"authors":["Ben Kew"],"date_download":"2018-10-30 18:01:39","date_modify":"2018-10-30 18:01:39","date_publish":"2018-06-29 14:06:09","description":"Left-wing documentary filmmaker Michael Moore put out a clarion call to the leftist Resistance Thursday, urging them to put their bodies on the line to bring down the Trump presidency.","filename":"data/vaneerConsumption/GetOffTheCouchandPutBodiesontheLinetoStopTrump.json","image_url":"https://media.breitbart.com/media/2017/06/MichaelMooreClimateCrimeAgainstHumanity-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_06_29__1540922499.html","title":"'Get Off The Couch' and 'Put Bodies on the Line' to Stop Trump","title_page":"Michael Moore Demands the Resistance: 'Get Off The Couch' and 'Put Bodies on the Line' to Stop Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"Left-wing documentary filmmaker Michael Moore put out a clarion call to the leftist Resistance Thursday, urging them to put their bodies on the line to bring down the Trump presidency.\nIn an interview with Late Show host Stephen Colbert, Moore said he disapproved of violence and intimidation but said the anti-Trump resistance must be “willing” to risk their bodies to help bring him down.\n“We don’t have to be violent, we have to remain non-violent, but if the worst that happens to anybody in the Trump administration is that they don’t get to have a chicken dinner in Virginia, I mean, I don’t know,” Moore told Colbert. “But that’s not what’s going on now. We’re not talking about political differences. We’re talking about thousands of children being kidnapped and put in jails.”\n“Sadly, Trump is not going to leave,” Moore continued. “He plans to be reelected, he loves the term ‘president for life.’ The only way that we’re going to stop this is eventually we’re all going to have to put our bodies on the line. You’re going to have to be willing to do this.”\nThe 64-year-old filmmaker went on to say that most Americans are “very liberal” and pointed to the fact that Democrats have won the popular vote in all but one of the last seven presidential elections.\n“The majority of Americans are very liberal. They take the liberal position on most issues. They believe women should be paid same as men, they believe there is climate change, they don’t believe people should be thrown in jail for smoking marijuana,” the Oscar-winner explained.\n“The majority of Americans are liberal and we the Democrats have won the presidency, popular vote, in six of the last seven presidential elections,” Moore continued. “The Republicans have only won once since 1988—in 2004, with Bush, that’s the only time they’ve won the popular vote! The country we live in doesn’t want the Republicans in the White House! They don’t want them running this country! We’re the majority!”\nMoore, whose films typically center on exploring left-wing causes, correctly predicted Donald Trump’s 2016 election victory, calling it the “biggest fuck you in history,” and has also claimed that Trump will win re-election in 2020.\nNevertheless, Michael Moore remains one of Hollywood’s most vocal opponents of the Trump administration, describing the president as a “sociopath” who presents a “singular threat to humanity.”\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.","url":"https://www.breitbart.com/entertainment/2018/06/29/michael-moore-4/"}
