{"authors":[],"date_download":"2018-10-22 22:42:37","date_modify":"2018-10-22 22:42:37","date_publish":"2014-05-12 14:51:27","description":"The cost of motoring is going down -- about 2.7 less than ownership and operating costs averaged last year,the AAA says.","filename":"data/vaneerConsumption/GetOutOnTheHighwayTheCostofDrivingWentDownThisYear.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/436381/140512-140512-gasoline-1120_130a26a6c580811ff530eb0b53a5a6d9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_get-out-highway-cost-driving-went-down-year-n103111_1540248157.html","title":"Get Out On The Highway: The Cost of Driving Went Down This Year","title_page":"Get Out On The Highway: The Cost of Driving Went Down This Year","title_rss":"NULL","source_domain":"nbcnews.com","text":"Fuel costs have become one of the single most expensive parts of the equation, and are expected to come to an average 13 cents per mile – but that is a 10-percent decrease as fuel prices have tumbled.\nFuel prices aren’t the only factor in lowering motorists’ gas bills, however. Drivers have also been benefiting from the steady improvement in vehicle fuel economy, AAA officials noted.\nA number of other factors contributed to the drop in ownership and operating costs. The AAA study shows a 1.71 percent decline in vehicle depreciation – which the study shows averaging $3,510, down from $3,571 last year.\nTire costs also are down about 3 percent in the latest study. Give credit to automakers who apparently are equipping many of their vehicles with less expensive rubber. But tire prices, in general, have been coming down after several years of sharp increases in rubber and other raw material prices.\nEven insurance premiums are down, albeit a modest 0.58 percent, the study says. A typical motorist can expect to write a check for $1,023 to cover a year’s premiums, a $6 annual decline. But the organization notes insurance rates “vary widely by driver and driving record, issuing company and geographical region.”\nDriving expenses overall vary widely depending on the type and size of the vehicle you own, AAA noted. While it might cost 59.2 cents per mile to operate the “average” sedan, that jumps to 65.0 cents per mile, or $9,753 overall, for a minivan, and 73.6 cents per mile, or $11,039 for a four-wheel-drive SUV.\nThe Driving Costs study has been published by AAA since 1950, and back then, the typical motorist clocked 10,000 miles per year at a cost of 9 cents per mile. Gasoline, that year, sold for 27 cents per gallon.\nSports Car or Plug-In Hybrid? New BMW i8 is Both\nStable Fuel Prices Send American Buyers Back to Pickups, SUVs\nElio Moving Ahead on 84 mpg, 3-Wheeled Car Coming in at $6,800","url":"https://www.nbcnews.com/business/autos/get-out-highway-cost-driving-went-down-year-n103111"}
