{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 04:45:22","date_modify":"2018-10-23 04:45:22","date_publish":"2017-03-16 15:57:55","description":"University of Warwick researchers concluded that getting a good night's sleep is perhaps the most effective, simple and cheap method of raising the health and wellbeing of society.","filename":"data/vaneerConsumption/Gettingabetternightssleepfeelslikewinning200000.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55141400000578-0-image-a-24_1489679946581.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4320504_Getting-better-night-s-sleep-feels-like-winning-200-000_1540269922.html","title":"Getting a better night's sleep feels like winning £200,000","title_page":"Getting a better night's sleep feels like winning £200,000 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ever wondered why you feel like a million dollars when you wake up after a long night's sleep?\nAccording to new research, getting a better night's sleep is as beneficial to your mental health as winning the lottery.\nBoosting the number of hours you get beneath the sheets is comparable to that of grabbing a £200,000 jackpot, scientists claim.\nAnd it's not just the length. The biggest benefit comes from improving the quality of your sleep, according to the researchers from the University of Warwick.\nScientists believe that getting a good night's sleep is the most effective, simple and cheap method of raising the health and wellbeing of society as a whole\nThey say that it is perhaps the most effective, simple and cheap method of raising the health and wellbeing of society as a whole.\nThe team of scientists analysed the sleeping patterns of 30,500 people across Britain over the course of four years.\nParticipants were all asked to complete the General Health Questionnaire every so often, which is used by experts to monitor mental wellbeing.\nThey found improved quality and quantity of sleep were linked to better scores on the mental health test.\nGetting a better night's sleep is as beneficial to your health as winning the lottery, experts say\nWhile needling to use less sleep medication to get a good night's rest had the same effect, they noted.\nTOO MUCH SLEEP COULD BE DEMENTIA Sleeping for more than nine hours a night could be an early warning sign of Alzheimer's disease. Scientists last month found people who consistently spend this long in bed are twice as likely to develop dementia over the next decade. A change in sleep patterns is a red flag for Alzheimer's as it shows the brain, which controls wakefulness, has suffered damage. Boston University researchers also found those who slept nine hours or longer also had smaller brain volumes, took longer to process information and showed signs of memory loss.\nImproved sleep scored a two-point positive change in the results - similar to that of eight weeks of cognitive therapy.\nConversely, it was found that a lack of sleep, bad quality sleep, and using more sleep medication can lead to worsened medical and emotional states.\nStudy author Dr Nicole Tang said: 'The current findings suggest a positive change in sleep is linked to better physical and mental wellbeing further down the line.\n'It is refreshing to see the healing potential of sleep outside of clinical trial settings.\n'This goes to show that the benefits of better sleep are accessible to everyone and not reserved for those with extremely bad sleep requiring intensive treatments.'\nDoctors have long known that people who suffer from insomnia are at risk of depression, anxiety and mood problems.\nShe argues that working on getting good quality sleep, and the reduction of sleep medication, should be promoted more widely to improve health.\nBut Dr Tang was keen to stress that the research, published in the journal SLEEP, is far from showing a causal relationship.","url":"https://www.dailymail.co.uk/health/article-4320504/Getting-better-night-s-sleep-feels-like-winning-200-000.html"}
