{"authors":[],"date_download":"2018-10-30 21:18:57","date_modify":"2018-10-30 21:18:57","date_publish":"2018-09-14 17:10:00","description":"Bugs may be part of the solution to saving our planet.","filename":"data/vaneerConsumption/Getthelatestnewsonedibleinsects.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/14/Images/newsEngin.22985046_IMG_0380.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_hungry_2a8b5cd82bfe3f300a22640a52175196__1540934337.html","title":"Get the latest news on edible insects","title_page":"Get the latest news on edible insects","title_rss":"NULL","source_domain":"ajc.com","text":"Picture a hornet, a scorpion, some black ants, red termites and a few crickets, all dead and dried, lying in the palm of your hand. Pop them into your mouth. Crunch down. Chew. Swallow.\nDoes the thought of eating creepy crawlers make you squirm like a worm? Me, too. But I’m trying to get over it.\nBugs may be part of the solution to saving our planet. Farming insects produces far less greenhouse gas than raising livestock, and there’s a lot of protein in silkworm pupae. If people in 80 percent of countries around the world consume more than 1,000 different kinds of bugs as part of their diet, why shouldn’t I?\nActually, I did. A few weeks ago, I attended an insect dinner party at the State Botanical Garden of Georgia in Athens, an event held in conjunction with the three-day Eating Insects Athens conference at the University of Georgia.\nJoseph Yoon prepared the critter dinner that night. He’s operated his Yummy Eats private chef-catering company in New York City for more than seven years. He’s also the brains behind the fledgling Brooklyn Bugs, an organization that promotes the “gastronomical, sustainable and ecologically friendly aspects of entomophagy.” In other words, Yoon wants more humans to eat insects.\n“It’s not a food trend, it’s a movement,” Yoon said as he greeted me at the door.\nWe were live at Eating Insects Athens to learn more about the rise of insect cuisine – and eat some bugs.\nHe sounded like a prophet. I wondered if there was some sort of bug baptism ritual in store for believers. As it turns out, many of the folks who traveled to the conference from as far away as China, Thailand and Norway have lofty goals for the future of insects as food and feed.\nEating Insects Athens wasn’t just a gathering of professors with a Ph.D in entomology, although they, too, were present. The 140 attendees also represented small and large insect farms, educational nonprofits, marketers and food entrepreneurs who want to sell you on why, if you already eat shrimp, making the move to crickets and scorpions isn’t that big of a leap. They’re all arthropods, after all.\n“We see ourselves as being the voice of insect agriculture in North America,” said Marianne Shockley, a professor in the Department of Entomology at UGA and director of the North American Coalition for Insect Agriculture. “We have very active members who are personally and emotionally into this idea.”\nNACIA is just two years old. It got off the ground officially at the Eating Insects Detroit conference in 2016. And, it collaborates with counterparts from other international entomophagy groups, including the International Platform of Insects for Food and Feed, Asia Food and Feed Insect Association and the Insect Protein Association of Australia.\nThe past few years have seen the rise of food-grade insect farms, and food innovations, like bug burgers, bug meatballs and bug pet treats. The biggest buzz is over insect feed as a puzzle piece for waste management: Raise the black soldier fly on food waste, then feed the fly to salmon, or the fly larvae to chickens.\nGuests at the Insectual Dinner Party in Athens could sample a variety of edible insects at a bug bar. CONTRIBUTED BY JOSEPH YOON FOR BROOKLYN BUGS (The Atlanta Journal-Constitution)\nShockley has been involved in the bug ag movement professionally for the past 10 years. In her work as a social scientist, she focuses on engaging audiences with edible insects.\n“You can be strategic about how you do that,” she said. Strategic would be sending a bunch of her students to DragonCon in Atlanta recently in hopes of opening the minds of at least a few of the 80,000 attendees to the wide world of bugs. Her bug brigade will be at Creature Comforts in Athens on Oct. 25 for Octobeefest, an annual event during which people get double buzzed talking bees and other pollinators while sipping beer. This year, there will be insect food for sampling.\nI attended the insect dinner party because I wanted to open my own mind — and mouth — to insect cuisine. For 15 minutes, I stood in front of a camera with Yoon, live on Facebook, as he fed me the likes of black ants that looked sort of like caviar atop pink cocktail shrimp, a Manchurian scorpion — solo, and on a cucumber slice — and red termites that garnished chocolate mousse.\nI had to close my eyes when I ate that scorpion. I crunched and munched as quickly as I could. Swallowing wasn’t fun.\nAnd, that’s where I’m struggling. I know that food is fuel, but I get great pleasure from eating, and I’d like to get excited about consuming gusano worms with chips and guac. Currently, though, if I’m going to eat a bug, I’d rather it be ground up, because I don’t want to stare it in the face.\nWhat will it take to remove the stigma from eating insects? Availability and visibility, according to Shockley. That means grocery stores stocking their shelves with products from the emerging category of insect-based edibles: chocolate-covered candies, protein bars, chips, crackers, and even pasta, like that from Nebraska start-up Bugeater.\nCricket-coated fried chicken was among the dishes served at the Insectual Dinner Party in Athens. The event was held in conjunction with the three-day Eating Insects Athens conference. CONTRIBUTED BY JOSEPH YOON FOR BROOKLYN BUGS (The Atlanta Journal-Constitution)\nShockley thinks people are past the novelty stage of bugs as food. “It’s not the first time they’ve heard of it.”\nBut, while more people may be willing to eat food made with insect powder, “we are not quite ready to put a cricket on our tacos,” she said.\nA few years ago, I had a bad experience with a grasshopper taco at a Mexican restaurant in the Midwest. I recounted to Shockley that the critter was horribly prepared: wet instead of crunchy, the thorax grayish instead of a roasted brown. Its legs got stuck between my teeth.\n“I commend the chefs pushing the boundary and trying to be creative,” she replied. “If we want chefs to pick this up, we need to be the ones to educate them.”\nWe are making strides, she added, noting that there was an edible insect panel at the Research Chefs Association conference held in Savannah this past March.\nIn the meantime, I want Yoon from Brooklyn Bugs as my insect cooking instructor. His fried chicken coated in cricket powder was delicious.\n“I view insects as an ingredient, as I would a new vegetable or protein,” Yoon said. “It’s not just like, ‘Here’s a cricket or cricket powder.’ I take time to research it, understand the flavor profile, how it reacts to frying, to baking.”\nYoon’s next project unites him with folks at San Diego State University to produce a lexicon on the properties of edible insects, a sort flavor bible on cooking with bugs.\nRaspberry cheesecake with chapulines, wasps, ants, termites and scorpions. CONTRIBUTED BY JAMES RICCI (The Atlanta Journal-Constitution)\nI’m gearing up to get bug-eyed from that book.\nAs we wait to see whether insect cuisine will fly in this nation, it’s clear that bugs for animal consumption are big business. Here in Atlanta, Patrick Pittaluga and his cousin Sean Warner are killing it with their Grubbly Farms, purveyor of black soldier fly grubs as feed for backyard chickens.\nSince launching the product in August of 2016, these recent Georgia Tech grads have averaged around 10 percent sales growth, month over month, and now have six full-time employees and two part-timers. They hope to make a fully formulated grub-based chicken feed in the near future. (Right now, the grubs are more like a chicken snack, not a well-rounded diet for the bird.) They’ve also got their sights set on expanding into dog treats.\nBut, what about human-grade grubs? “While people are starting to accept eating things with cricket powder, I don’t know if people are ready to eat fly larvae,” he said.\nStill, it’s not out of the question. “I could see a possibility of us coming out with some human food line of products.”\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/entertainment/dining/hungry-for-slice-bug-cake-the-latest-chirps-edible-insects/pjIGC8Eie4NECIysxRjocK/"}
