{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:45:30","date_modify":"2018-10-30 21:45:30","date_publish":"2017-02-23 14:05:20","description":"There’s just something about the winter (even the unseasonably warm one we’ve been havin...","filename":"data/vaneerConsumption/Getyourcoffeewithasideofcuteatthese6OTPcafes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/17/Images/WPIMAGE_cmgajcfoodandmore_13988.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ge_6cdd089465685e03599f317c57d3bd3d__1540935930.html","title":"Get your coffee with a side of cute at these 6 OTP cafes","title_page":"Get your coffee with a side of cute at these 6 OTP cafes","title_rss":"NULL","source_domain":"ajc.com","text":"There’s just something about the winter (even the unseasonably warm one we’ve been having here in Atlanta) that makes us want to huddle up in a coffee shop with a good book, or a laptop, and a hot cup of joe for the afternoon. Whether you’re looking for a spot to lounge on cozy sofas while chatting with a friend or a coffeehouse to grab a bold jolt of espresso while you get caught up on email, there’s a cute café OTP to suit your mood. Check out these six contenders below.\nLand of a Thousand Hills Coffee House With two OTP locations (in Cumming and Roswell), Land of a Thousand Hills Coffee House is an indie coffee shop where you can drink coffee and score good karma points all at once (the coffeehouse uses their profits to invest in sustainable village projects in Rwanda, where it also pays its coffee growers higher than Fair Trade prices). The Roswell location’s large outdoor patio is a restful respite on good weather days, while the indoor space offers laid-back vibes, free Wi-Fi, pastries, desserts and lunch items. They serve their coffee only by French press or Chemex—and don’t miss their talented baristas’ latte art! 5095 Post Rd., Cumming, 678-947-4142; 352 S. Atlanta St., Roswell, 770-645-1149; landofathousandhills.com.\nMugs on Milton With OTP locations in downtown Alpharetta and Crabapple/Milton, Mugs on Milton is an adorable coffee shop serving up coffee, espresso, teas and baked goods (try one of their extra-soft scones or the salted chocolate chip cookie), enveloped in a warm, welcoming atmosphere. Rustic wooden tables and accents, mismatched chairs, a chalkboard menu and eclectic decor lend a casual and friendly feel to the shop. The cheery and bright space is equally good for meeting up with friends or working remote. Try the vanilla latte in one of their actual mugs (unless you want it in a paper cup to-go) for an extra-homey touch. Note: they also offer up a limited number of lunch items every day, but tend to sell out quickly. 35 Milton Ave., Alpharetta, 470-268-8544; 12670 Crabapple Rd., Ste. 100, Milton, 470-545-6106; mugsonmilton.com.\nPerk-N-Pooch Perk-N-Pooch takes the dog-friendly coffee shop to a new level. It’s a dog wash and coffee café in one, located in Sandy Springs. And yes, there are separate areas for each side of the shop, so you don’t have to worry about a clump of Fifi’s fur landing in your cappuccino. Stop by with your dog to use their DIY Wash area (bath essentials provided) or let the experts do the washing with their Express Wash—professional, breed-specific grooming is also available, among other services. After the wash or while you wait, order a coffee or smoothie from their extensive drink menu, or try the ice cream. You can book appointments on their website. 6690 Roswell Rd., Ste. 360, Sandy Springs, 678-500-9237, perk-n-pooch.\n45 South café Chill out at 45 South Café in Norcross, which invites you to come in and linger over a cup of locally roasted coffee—or a glass of wine. Touting itself as a “coffee kitchen” and community-focused “third house,” this cute shop is part coffeehouse, part café, part wine bar. Ample seating and exposed brick walls lend to the cozy appeal of this inviting shop that offers up a wide variety of menu items (try the fried green tomato salad) for breakfast, brunch, lunch and dessert—they even have a kids’ menu! If you stop by on a Friday or Saturday night, you’ll get to enjoy live music from local musicians. 45 S. Peachtree St, Norcross, 770-409-4009 , 45southcafe.com.\nCool Beans Coffee Roasters Coffee aficionados will appreciate a visit to Marietta’s Cool Beans Coffee Roasters, a micro-roaster and retailer that roasts small batches in-house a few times a week (the beans are also often sold in their shop and online). The shop is housed in a quaint brick building, with ample light from its windows (we love the stained glass ones) and vibrant artwork on the walls. An array of caffeinated beverages grace the menu, from a sweet caramel cappuccino to an Americano, café au lait, espresso and house specials like the 8-Ball and the T-Man (three shots of espresso, chocolate flavor, plus one flavor of your choice, steamed milk and whipped cream), among others. Drinks come in three simple sizes: 12 oz., 16 oz. and 20 oz. They also offer a host of cold and frozen drinks, and pastries and sweets. 31 Mill St Suite 100, Marietta, 770-422-9866, coolbeanscoffeeroasters.com.","url":"https://www.ajc.com/blog/atlanta-restaurants/get-your-coffee-with-side-cute-these-otp-cafes/mfj8Kp5QWd5UpuDdBweOBN/"}
