{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 19:53:41","date_modify":"2018-10-30 19:53:41","date_publish":"2017-02-02 15:08:26","description":"Pop, pop, Atlanta.","filename":"data/vaneerConsumption/GetyourSuperBowl2017partypoppingwiththesepopcornrecipes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/02/Images/WPIMAGE_cmgajcfoodandmore_13548.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ge_a56bcb79def7741991e819fd35bbe51a__1540929221.html","title":"Get your Super Bowl 2017 party popping with these popcorn recipes","title_page":"Get your Super Bowl 2017 party popping with these popcorn recipes","title_rss":"NULL","source_domain":"ajc.com","text":"Pop, pop, Atlanta.\nIt's almost time for Super Bowl Sunday, and while we hope the game will be poppin' in our favor, if nothing else, at least the snacks should be.\nCheck out these recipes from popcorn company Doc Popcorn to make popcorn -- 3.8 million pounds of which is consumed on game day alone -- for your Super Bowl party that should please just about everyone.:\nSugar & Spice Popcorn\nCombine 2 tablespoons of paprika, 2 tablespoons of finely chopped fresh parsley leaves and 1 teaspoon popcorn salt.\nDrizzle 8 cups of popped popcorn with 2 tablespoons extra-virgin olive oil in a large bowl and toss to coat.\nAdd the seasoning mix, toss again and serve.\nSnobby Popcorn:\nToss 8 cups of popped popcorn in 1 tablespoon of truffle oil.\nThen, add 2 tablespoons of sea salt.\nTop it off with freshly grated parmesan cheese and season with salt to taste. (Optional, for more decadence: add 2 – 3 tablespoons of melted butter to the truffle oil).\nSuper Cheese Popcorn:\nToss 8 cups of popped popcorn with 1 cup of shredded cheddar cheese and 1 cup of grated parmesan.\nSpread evenly on baking sheets and bake at 350 degrees until the cheese melts (about 5 minutes).\nSalt to taste.\nMORE:\nSweetwater, Boston Beer founders make Super Bowl predictions\nBeer Pick: What to drink at your Super Bowl party\nTake flight with these 'Dirty Bird' recipes\nWhere to watch the Atlanta Falcons rise up for Super Bowl 2017\n3 meal kits that will make your Super Bowl party\nMake these delectable chili recipes for your party\nWatch Atlanta, Boston doughnut shops wager on Super Bowl\nEverything you need to know about the Super Bowl\nGet Super Bowl food to-go at these Atlanta restaurants\nYour ultimate guide to Atlanta Falcons tailgating\nHealthy dips to serve for Super Bowl 2017\nA guide to tailgating without packing on the pounds\nTackle the urge to overeat with these tips\nThe best bowls of chili you’ll find in Atlanta\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter","url":"https://www.ajc.com/blog/atlanta-restaurants/get-your-super-bowl-2017-party-popping-with-these-popcorn-recipes/ebvOuk7i78VF0DHtEPIe5L/"}
