{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:29:51","date_modify":"2018-10-30 21:29:51","date_publish":"2016-07-29 23:01:48","description":"Ghostbusters director Paul Feig doesn't have a problem with the pro-Hillary Clinton tweet sent out by his film's official Twitter account this week, and would not have deleted it if the decision were up to him. | Entertainment","filename":"data/vaneerConsumption/GhostbustersDirectorBlastsSonyforDeletingProHillaryTweet.json","image_url":"https://media.breitbart.com/media/2016/06/PaulFeig3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_07_29__1540934991.html","title":"'Ghostbusters' Director Blasts Sony for Deleting Pro-Hillary Tweet","title_page":"'Ghostbusters' Director Blasts Sony for Deleting Pro-Hillary Tweet | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ghostbusters director Paul Feig doesn’t have a problem with the pro-Hillary Clinton tweet sent out by his film’s official Twitter account this week, and would not have deleted it if the decision were up to him.\nOn Wednesday, the official Twitter account for the female-led Ghostbusters remake sent out what appeared to be an endorsement of Democratic presidential nominee Hillary Clinton. The tweet made reference to smashing a “glass ceiling” and featured the popular pro-Clinton hashtag, “#ImWithHer.”\nApparently the Ghostbusters account deleted this tweet. pic.twitter.com/QeHBbiDR2d — Sonny Bunch (@SonnyBunch) July 28, 2016\nAfter media reports drew attention to the tweet, Sony officials removed it and released a statement saying that the tweet was “never intended to be a political endorsement.”\n“It was a shout-out to our own glass ceiling-busters,” a Sony spokeswoman said in a statement to theWrap.\nBut in a follow-up statement to the outlet, Ghostbusters director Paul Feig said he was surprised that Sony would take the tweet down.\n“This is the first I’m hearing about this but I guarantee that none of us — producers or filmmakers — would have taken this tweet down,” Feig told the outlet on Friday. “We are pro-woman and all about smashing the glass ceiling and we support the message of this deleted tweet. And I personally am very much pro-Hillary.”\nGhostbusters has become one of the most divisive films of the summer, as its creative team have repeatedly called critics of the film misogynist and sexist. In June, Feig said that criticism of the film was primarily fueled by “misogynistic,” “right-wing radio monsters.”\nThe controversy surrounding the film may have factored in to its box office performance.\nThe film took in $86 million through its first ten days at the domestic box office, a weak figure given the film’s approximate $250 million budget, when marketing costs are factored in. Ghostbusters was expected to pull in just $10 million in its third weekend of release, according to Box Office Mojo. Box office analysts say the film will need to perform well overseas if it is to make a profit, an uphill battle as China will not screen it and the 30-year-old franchise is an unknown quantity in most international markets.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/07/29/paul-feig-blasts-sony-deleting-ghostbusters-pro-hillary-tweet-smashing-glass-ceiling/"}
