{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 00:29:32","date_modify":"2018-10-23 00:29:32","date_publish":"2017-03-10 07:08:59","description":"Large vessels entering Europe routinely turn off their GPS tracking to ‘disappear’ from monitoring systems after making dubious stops close to terrorist hotspots.","filename":"data/vaneerConsumption/GhostshipsturningoffGPSwhenenteringEuropeanwaters.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21F1C800000578-0-image-a-28_1489138692377.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300170_Terror-fears-hundreds-ghost-ships-turning-GPS_1540254572.html","title":"Ghost ships turning off GPS when entering European waters","title_page":"Ghost ships turning off GPS when entering European waters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of 'ghost ships' turn off their tracking devices and sail suspiciously close to terror zones before entering European waters - including dozens who ended up off the British coast, it was revealed today.\nLarge vessels entering Europe routinely turn off their GPS tracking to ‘disappear’ from monitoring systems after making dubious stops close to terrorist hotspots.\nIt is fuelling concerns they are smuggling people and weapons to the continent, especially on the route between Libya and Greece.\nData from Windward, an Israeli-based maritime analytics company, shows that in total, 2,850 ships ‘went dark’ by halting transmission of their location before entering European waters in the first two months of this year.\nAround 45 did this off the British coast for up to 24 hours - 50 other entered British waters without proper paperwork.\nRevealed: Large vessels entering Europe routinely turn off their GPS tracking to ‘disappear’ from monitoring systems after making dubious stops close to terrorist hotspots (file picture)\nShip one: This is the route taken by an Italian oil tanker from Libya to Greece where it became a ghost ship and turned off its GPS in areas that are hotspots for people smuggling\nClose up: It made two suspicious stops near Crete and then near mainland Greece (pictured) while hiding its location\nThe practice, uncovered in an investigation by The Times, raises fears that the lack of resources Britain devotes to maritime security leaves it vulnerable to terrorist attacks.\nWindward also revealed that that in January and February forty ships entered Europe from Libya, close to where ISIS is operating, after turning off their tracking devices.\nAnother 20 vessels stopped transmitting their location and made suspicious stops for up to six hours in Syrian or Lebanese waters before reaching the Continent.\nIs it illegal for ships to turn off their GPS? A ship's Automatic Identification system (AIS) must always be turned on when they are out of port and moving or at anchor. The only circumstances when this can change is if the captain believes that they are in imminent danger from a threat to safety, like pirates. If GPS is switched off, it must be recorded in the ship's main logbook. Turning off AIS makes it impossible for them to be tracked and in large stretches of water it has been described as trying to find 'a needle in a haystack'.\nExperts said the majority of these absences were likely to be deliberate, and warned terrorist groups could be exploiting vulnerabilities in ocean security to move weapons and people.\nSpeaking to The Times, Admiral Lord West of Spithead, the former first sea lord, said: ‘There has to be real concern over the picture of what’s happening on the surface of the sea. It can be exploited.’\nGerry Northwood, the chief operating officer at Mast, a maritime risk management consultancy, told the newspaper British authorities are carrying out increasing levels of counterterrorism maritime intelligence work.\nHe said: ‘There’s always that risk that something will get through. The terrorists only have to get it right once. We have to be wary — the UK has a long and complex coastline which is difficult to watch all the time. Those who are adventurous and innovative will have a good chance of getting through.’\nShip two: A large cargo ship from Cyprus went from Ukraine to the Med before drifting for almost a fortnight off Algeria and Morocco after sailing towards Gibraltar. It turned its GPS intermittently including for nearly 30 hours on one occasion before sailing into the Atlantic\nShip two: The same ship then sailed north all the way into British water - spending 11 hours off Islay in Western Scotland - miles away from any major port\nYesterday it emerged that migrant smuggling has expanded dramatically and is so prevalent in Europe it is now comparable to the illegal drugs market.\nA new report says criminal gangs have raked in huge sums of money amid the surge in refugees and migrants attempting to reach the continent.\nA report from Europol, the EU's law enforcement agency, describes people smuggling as a 'highly profitable and widespread criminal activity'.\nThe 60-page study noted: 'The migrant smuggling business is now a large, profitable and sophisticated criminal market, comparable to the European drug markets.'\nResearchers found that the demand for smuggling services had grown significantly since 2014.\nFigures suggested networks offering 'facilitation services' to either reach or move within the EU generated an estimated 4.7 billion euro to 5.7 billion euro in profit in 2015, equivalent to between £4.1 billion and £5 billion at current exchange rates.\nThese profits dipped last year, falling by nearly two billion euro, or £1.7 billion at today's rates, according to the assessment.\nIt said: 'This development is in line with the overall decrease in the number of irregular migrants arriving in the EU and as a result of a fall in the prices for migrant smuggling services following the peak of the migration crisis in 2015.'\nWorries: It is fuelling concerns they are smuggling people (pictured off the Libyan coast) and weapons to the continent\nA report from Europol, the EU's law enforcement agency, describes people smuggling as a 'highly profitable and widespread criminal activity'. Pictured: Refugees wait to be assisted by an NGO aboard an overcrowded rubber boat, about 20 miles North of Sabratha, Libya\nMigrant smugglers originating from over 122 countries were involved in facilitating the journeys of irregular migrants to the EU, according to the study, while gangs relied heavily on social media to advertise their services.\nThe findings emerged in the agency's serious and organised crime threat assessment for 2017.\nIt revealed that more than 5,000 international organised crime groups were under investigation in the EU.","url":"https://www.dailymail.co.uk/news/article-4300170/Terror-fears-hundreds-ghost-ships-turning-GPS.html"}
