{"authors":[],"date_download":"2018-10-22 21:04:05","date_modify":"2018-10-22 21:04:05","date_publish":"2014-06-03 23:58:16","description":"The extinct creature has been named Anthracosuchus balrogus after the fiery Balrog in in J.R.R. Tolkien's novel \"The Lord of the Rings.\"","filename":"data/vaneerConsumption/GiantBeast900PoundAncientCrocDevouredTurtles.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/485706/140603-science-ancient-crocodile_128b45b8b97ce8fd60e536b7c976ab21.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_giant-beast-900-pound-ancient-croc-devoured-turtles-n121881_1540242245.html","title":"'Giant Beast': 900-Pound Ancient Croc Devoured Turtles","title_page":"'Giant Beast': 900-Pound Ancient Croc Devoured Turtles","title_rss":"NULL","source_domain":"nbcnews.com","text":"Four specimens of the new species were unearthed in a layer of rock in the fossil-rich Cerrejón coal mine of northern Colombia, where scientists previously have found huge turtles with shells as thick as high-school textbooks and skeletons of the world's largest snake, Titanoboa, a 48-foot-long (14.6 m) beast that recently starred in a Smithsonian Channel documentary.\nA. balrogus is the third new species of ancient crocodilian found at Cerrejón, scientists say. (Another, Acherontisuchus guajiraensis, was described in the journal Palaeontology in 2011.) The newly named croc belonged to an intrepid family known as the dyrosaurids.\nThese creatures arose in Africa, paddled across the Atlantic Ocean to South America about 75 million years ago and remarkably survived the mass extinction that wiped out the dinosaurs about 65 million years ago, scientists say. Some dyrosaurid species, such as A. balrogus, adapted to freshwater ecosystems like the rainforest of Cerrejón, which was much warmer and swampier 60 million years ago than it is today.\n\"This group offers clues as to how animals survive extinctions and other catastrophes,\" Alex Hastings, a postdoctoral researcher at Martin Luther Universität Halle-Wittenberg and former graduate student at the Florida Museum of Natural History, said in a statement. \"As we face climates that are warmer today, it is important to understand how animals responded in the past. This family of crocodyliforms in Cerrejón adapted and did very well despite incredible obstacles, which could speak to the ability of living crocodiles to adapt and overcome.\"","url":"https://www.nbcnews.com/science/science-news/giant-beast-900-pound-ancient-croc-devoured-turtles-n121881"}
