{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 01:25:46","date_modify":"2018-10-23 01:25:46","date_publish":"2016-01-29 15:20:20","description":"A second massive sinkhole has opened up on the other side of a highway along the coast of southern Oregon where another sinkhole appeared last month after storms battered the area.","filename":"data/vaneerConsumption/GiantsinkholeinOregoncausesmoredamagealongahighway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B2ED0C00000578-0-image-a-6_1454080704435.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422927_Giant-sinkhole-causes-damage-Oregon-highway-began-slip-away-hit-torrential-rain_1540257946.html","title":"Giant sinkhole in Oregon causes more damage along a highway","title_page":"Giant sinkhole in Oregon causes more damage along a highway | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A second massive sinkhole has opened up on the other side of a road along the coast of southern Oregon where another sinkhole appeared last month.\nThe ground became unstable after storms battered the local area and a section of Shopping Center Avenue began to slip away, transportation officials said Thursday.\nThe initial sinkhole happened in December in the parking lot of a local diner after torrential rain.\nThe landslide started around noon, after an overnight storm dumped nearly 1.5 inches of rain on the area causing a second sinkhole along U.S. Highway 101\nA landslide about 50ft from the sinkhole collapsed the entire road.\nThe slide started around noon after an overnight storm dumped nearly 1.5 inches of rain.\nOregon Department of Transportation spokesman, Jared Castle, said the widening sinkhole is threatening to undermine all four lanes of the highway, according to the Curry Coastal Pilot.\n'The hole was only the size of a volleyball, but it was a seven-foot hole,' Castle said.\nCastle said the ODOT would like to get Shopping Center Avenue repaired first to cut down on the detour-travel time, 'but that also could be the biggest challenge, as the roadbed and soil is gone'.\nA detour along U.S. Highway 101 went into effect at 9pm on Thursday night and drivers were advised to use caution and reduce speeds along the detour.\nThe sinkhole has continued to widen as a series of storms pummeled the area causing it to overflow multiple times.\nIn western Oregon landslides and heavy rain wreaked havoc in coastal areas of the state in December.\nA sinkhole swallowed a car, damaged homes and prompted evacuations of more than 30 homes in the town of Newport.\nTransportation officials set up a detour along U.S. Highway 101 on Thursday night and have warned drivers to reduce speeds along the detour","url":"https://www.dailymail.co.uk/news/article-3422927/Giant-sinkhole-causes-damage-Oregon-highway-began-slip-away-hit-torrential-rain.html"}
