{"authors":[],"date_download":"2018-10-23 04:25:57","date_modify":"2018-10-23 04:25:57","date_publish":"2016-01-28 20:30:26","description":"New York Giants quarterback Eli Manning and receiver Odell Beckham will be teammates again Sunday at the NFL Pro Bowl, the league's annual all-star showcase ...","filename":"data/vaneerConsumption/GiantsManningBeckhamcombointactforProBowl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h51n-2vdWmEltwXfba0ce28e632c73c6a-884_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421662_Giants-Manning-Beckham-combo-intact-Pro-Bowl_1540268757.html","title":"Giants' Manning-Beckham combo intact for Pro Bowl","title_page":"Giants' Manning-Beckham combo intact for Pro Bowl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Giants' Manning-Beckham combo intact for Pro Bowl\nNew York Giants quarterback Eli Manning and receiver Odell Beckham will be teammates again Sunday at the NFL Pro Bowl, the league's annual all-star showcase matchup in Honolulu.\nManning was the second overall selection in Wednesday night's selection of all-star talent by Hall of Fame team captains Michael Irvin and Jerry Rice, with Seattle quarterback Russell Wilson going first overall to Team Irvin.\nThat left Manning available for Team Rice, whose player assistant captains were St. Louis defensive tackle Aaron Donald and Beckham, who had received a tongue-in-cheek warning from Manning that a snub could prove costly next season.\nOdell Beckham (L) of the New York Giants is congratulated by his teammate Eli Manning after scoring a touchdown on October 19, 2015 in Philadelphia, Pennsylvania ©Rich Schultz (Getty/AFP/File)\n\"I told Odell, 'Don't feel any pressure to draft me. But if you don't draft me, don't expect to catch any balls next year. No pressure at all,'\" Manning said.\nBeckham led Giants receivers with 96 catches for 1,450 yards and 13 touchdowns, ranking fifth in the league overall.\nManning completed 387 of 618 passes for 4,432 yards and 35 touchdowns with 14 interceptions this past season for the Giants, who missed the playoffs at 6-10.\nManning's older brother Peyton, the 39-year-old quarterback for the Denver Broncos, won't be in Hawaii. He is preparing for a Super Bowl showdown against Carolina on February 7 for the NFL crown. Players from Super Bowl squads are ineligible for the Pro Bowl.\nTeam Rice's offensive selections also included NFL rushing leader Adrian Peterson of Minnesota, who ran for 1,485 yards this past season, and run yardage runner-up Doug Martin of Tampa Bay, who finished 83 yards behind Peterson.\nTeam Rice also features quarterbacks Derek Carr of Oakland and Tyrod Taylor of Buffalo as well as receivers Jarvis Landry of Miami and Amari Cooper of Oakland.\nTeam Irvin, whose player captains are Atlanta Falcons running back Devonta Freeman and Cincinnati Bengals defensive tackle Geno Atkins, selected NFL reception yardage leader Julio Jones, who caught 136 passes for 1,871 yards and eight touchdowns.\nTeam Irvin's attack also includes quarterbacks Jameis Winston of Tampa Bay and Teddy Bridgewater of Minnesota, Oakland running back Latavius Murray and St. Louis rusher Todd Gurley, third in the NFL with 1,106 yards on the ground for a Rams team that is moving to Los Angeles next season. Receivers include A.J. Green of Cincinnati and Houston's DeAndre Hopkins, third among pass catchers with 1,521.\nDefensive standouts for Team Rice include Liberian-born linebacker Tamba Hali of Kansas City; Oakland linebacker Khalil Mack, who ranked second in the NFL with 15 quarterback sacks; Kansas City's Marcus Peters, who shared the NFL interceptions lead with eight.\nTeam Irvin's defenders include Ghana-born Detroit defensive end Ezekiel Ansah, who was third in the NFL with 14.5 sacks; San Francisco linebacker NaVorro Bowman, the NFL tackles leader with 154.","url":"https://www.dailymail.co.uk/wires/afp/article-3421662/Giants-Manning-Beckham-combo-intact-Pro-Bowl.html"}
