{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-22 23:29:22","date_modify":"2018-10-22 23:29:22","date_publish":"2016-01-29 11:21:17","description":"Astronomers in Baltimore, Maryland, found the Smith Cloud was catapulted out of a galaxy 70 million years ago and is now plummeting back towards the Milky Way.","filename":"data/vaneerConsumption/GiantgascloudhurtlingtowardstheMilkyWaycouldcreate2MILLIONnewstarsIntergalacticfogisonacollisioncoursewithourgalaxy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1E0AE00000578-0-image-a-47_1454070100945.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422552_Giant-gas-cloud-hurtling-Milky-Way-create-2-MILLION-new-stars-Intergalactic-fog-collision-course-galaxy_1540250962.html","title":"Giant gas cloud hurtling towards the Milky Way could create 2 MILLION new stars: Intergalactic fog is on a collision course with our galaxy","title_page":"Giant gas cloud hurtling towards the Milky Way could create 2 MILLION new stars: Intergalactic fog is on a collision course with our galaxy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An enormous cloud of gas that was catapulted out of the Milky Way millions of years ago has been spotted plummeting back towards the galaxy.\nThe huge Smith Cloud, which is travelling at nearly 700,000mph (1,126,540 km/h) is expected to crash into the galactic disk of the Milky Way.\nThe collision will set the galaxy ablaze when it does hit, with the production of more than two million new stars.\nBut sadly we won't see this in our lifetimes because the impact won't happen for 30 million years.\nScroll down for video\nScientists have found a massive cloud of intergalactic gas that was ejected from the Milky Way 70 million years ago is on a collision course with our galaxy again. It is set to collide in 30 million years (illustrated) and could trigger the birth of two million new stars from the gas it contains\nScientists had previously believed the 11,000 light year-long cloud of gas was hurtling towards the Milky Way from intergalactic space.\nBut new observations using the Hubble Space Telescope have revealed it was actually launched out of our own galaxy around 70 million years ago.\nIt is now boomeranging back on a collision course with the Milky Way.\nWHAT IS THE SMITH CLOUD? The Smith Cloud is a high speed comet-shaped ball of gas that is hurtling through the Aquila constellation. It was discovered in 1963 by Gail Bieger, who was an astronomy student at Leiden University in the Netherlands at the time. The cloud was initially thought to be composed of hydrogen gas had from Earth has a diameter roughly 20 times wider than the moon. In reality it is 11,000 light years long and 2,500 light years across. Astronomers have now found it also contains heavy atoms normally only created in stars, suggesting it was once part of our own galaxy before being kicked out 70 million years ago.\nDr Andrew Fox, from the Space Telescope Science Institute in Baltimore, Maryland, who led the research, said: 'The cloud is an example of how the galaxy is changing with time.\n'It's telling us that the Milky Way is a bubbling, very active place where gas can be thrown out of one part of the disk and then return back down into another.\n'Our galaxy is recycling its gas through clouds, the Smith Cloud being one example, and will form stars in different places than before.\n'Hubble's measurements of the Smith Cloud are helping us to visualise how active the disks of galaxies are.'\nDiscovered in the 1960s, the Smith Cloud was initially thought to be a failed starless galaxy or a gas cloud moving through intergalactic space.\nHowever, in these scenarios it would be mainly composed of hydrogen and helium gas and not the heavier elements that are made by stars.\nAstronomers used ultraviolet light from three active galaxies shining through the cloud of gas to help determine its composition, finding it contains heavier elements found within our sun.\nIn particularly they found it was as rich in sulphur atoms as the Milky Way's outer disk, which lies around 15,000 light years from our own solar system.\nThe astronomers said the presence of heavy atoms normally found within stars, suggest the Smith Cloud was once part of the Milky Way before it was kicked out into intergalactic space 70 million years ago (illustrated)\nMeasurements taken by the Hubble Space Telescope have suggested the Smith Cloud has started to fall back towards the galactic disk of our galaxy (illustrated)\nThe Smith Cloud forms a comet-shaped ball of gas close to the Aquila constellation which is hurtling towards the Milky Way at 700,000 mph (pictured)\nThis suggests the Smith Cloud has been enriched by material from stars and so it appears to have been ejected from the Milky Way and is now boomeranging backwards.\nDr Nicolas Lehner, an astrophysicist at University of Notre Dame who also took part in the research, said the cloud contained enough gas to generate more than two million new stars.\nHe said: 'We have found several massive gas clouds in the Milky Way halo that may serve as future fuel for star formation in its disk, but, for most of them, their origins remain a mystery.\n'The Smith Cloud is certainly one of the best examples that shows that recycled gas is an important mechanism in the evolution of galaxies.'\nResearchers examined ultraviolet light from three galaxies shining through the Smith Cloud to measure its composition (illustrated), discovering it had the same levels of sulphur as the Milky Way's outer disk","url":"https://www.dailymail.co.uk/sciencetech/article-3422552/Giant-gas-cloud-hurtling-Milky-Way-create-2-MILLION-new-stars-Intergalactic-fog-collision-course-galaxy.html"}
