{"authors":["Associated Press"],"date_download":"2018-10-23 01:06:50","date_modify":"2018-10-23 01:06:50","date_publish":"2016-01-11 11:33:14","description":"BEIJING (AP) — A Chinese village has abruptly demolished a statue of communist China's founder, Mao Zedong, after images of the structure covered in gold pai...","filename":"data/vaneerConsumption/GiantgoldenstatueofMaodemolishedincentralChina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:9af8c1db683c4f1db650ee387d6dcbc2-48qEJGFphM8d437f0aaf9240bb7f-14_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393465_Giant-golden-statue-Mao-demolished-central-China_1540256810.html","title":"Giant golden statue of Mao demolished in central China","title_page":"Giant golden statue of Mao demolished in central China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Giant golden statue of Mao demolished in central China\nBEIJING (AP) — A Chinese village has abruptly demolished a statue of communist China's founder, Mao Zedong, after images of the structure covered in gold paint and looming 37 meters (120 feet) high over farmland attracted heated discussion on social media.\nAlthough the official reason for the demolition is unknown, with even a high-level Communist Party newspaper struggling to explain the episode, the rise and fall of the Mao monument in central China's rural Henan province highlights the political sensitivities in the country surrounding a historical figure alternatively revered and criticized by both the public and the government.\nThe project, reportedly financed by entrepreneurs, cost $460,000 and was near completion last week when it was nixed by local officials after images of the statue elicited mixed reactions on Chinese social media, and the story was picked up by domestic and international media.\nFILE - In this Monday, Jan. 4, 2016 file photo, a construction crane rises next to a 36.6-meter (120-foot) tall gold-colored statue of former Chinese leader Mao Zedong in Tongxu County in central China's Henan province. A village in central China has demolished the statue of the country's founder, Mao Zedong, after images of the structure covered in gold paint and looming 37 meters (120 feet) high over farmland attracted heated social media discussion. (Chinatopix via AP, File) CHINA OUT\nThe People's Daily, the official Communist Party newspaper, said the statue may have lacked approval from cultural management authorities, though it also cited an official as saying that did not appear to be the reason. Local officials could not be reached for comment on Monday, and some agencies' publicly listed telephone numbers appeared to be disconnected.\nSince his death in 1976, Mao has been both revered as a founding father and blamed for political turmoil and disastrous economic policies that claimed millions of lives. Successors including Deng Xiaoping, China's paramount leader during the 1980s, openly rebuked the cult of personality that had been built around Mao and warned cadres about the risk of overly concentrated influence.\nEven as China's current president, Xi Jinping, consolidates power to a degree that has drawn comparisons to Mao, he warned in a 2013 speech against \"worshipping\" revolutionary leaders without pointing out their mistakes.\nStill, Mao, known as the \"Great Helmsman,\" has kept a firm grip on the imagination for a large swath of the population, particularly the dissatisfied, rural poor, drawing notice of central authorities.\nLast month, the Global Times, a Communist Party tabloid, reported on the latest Mao statue to rise in rural northwestern China, where villagers sang revolutionary songs in a quasi-religious ceremony that featured \"ecstatic dance\" and a shamanistic figure brandishing a sword.","url":"https://www.dailymail.co.uk/wires/ap/article-3393465/Giant-golden-statue-Mao-demolished-central-China.html"}
