{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 04:33:37","date_modify":"2018-10-23 04:33:37","date_publish":"2017-03-16 15:53:38","description":"The 21-year-old was spotted out in New York City on Thursday. Combined with her thigh-high snake print boots, Gigi was a magnet for attention as she headed out in the chilly Big Apple.","filename":"data/vaneerConsumption/GigiHadidwearsrevealingallwhitelookinNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/06/3E5ABB7200000578-0-image-a-160_1489733893708.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320520_Gigi-Hadid-flashes-skin-revealing-white-look_1540269217.html","title":"Gigi Hadid wears revealing all-white look in New York","title_page":"Gigi Hadid wears revealing all-white look in New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was stepping out in snowy New York City.\nBut the Big Apple's practically freezing cold temperatures didn't stop Gigi Hadid from showing a little skin in as she headed out in an all-white look on Thursday.\nThe 21-year-old was spotted flashing plenty of leg in an unusual pair of trousers that had two long side slits.\nScroll down for video\nPutting in the leg work! New York's practically freezing cold temperatures didn't stop Gigi Hadid from showing a little skin in as she headed out for her day in an all-white look on Thursday\nCombined with her thigh-high snake print boots, Gigi was a magnet for attention as she headed out in the chilly Big Apple.\nThe statuesque star looked gorgeous as she wore her light brunette tresses down in a bedhead style that swept across her face.\nShe sported a pair of circular print sunglasses and appeared to have worn very little makeup.\nA M2MALLETIER backpack slung over her back, the stylish climbed inside her car as she got her day going.\nOh la la: The model's skirt split open even further as she negotiated the snowy walkways\nThese boots were made for walking! Combined with her thigh-high snake print boots, Gigi was a magnet for attention as she headed out in the chilly Big Apple\nForces of nature: Hadid ducked her head as she faced a gust of breeze\nGigi is not only one of the biggest names in fashion, but she is also dating one of the hottest stars in music.\nThe model has been with former One Direction singer Zayn Malik since November 2015, and the couple recently teamed up professionally for Versace's diffusion fashion line, Versus.\nZayn stars in a the fashion line's spring-summer 2017 campaign, which was shot by Gigi at Hollywood venue Chateau Marmont.\nNatural beauty: She sported a pair of circular print sunglasses and appeared to have worn very little makeup\nMatters of the heart: The catwalk queen is not only one of the biggest names in fashion, but she is also dating one of the hottest stars in music, Zayn Malik\nReflecting on the shoot in an official statement, Zayn admitted he revelled in the opportunity to work with Gigi and designer Donatella Versace.\n'It was sick to work with Versus,' he said. 'Dontella is a G. It was extra special that Gigi shot the campaign.\n'Looking forward to following up with my Versus collection that drops in June.'\nChange of pace: The model headed out later and dressed more for the weather this time\nLow key: the young star wore black leggings with a white turtleneck and coat then accessorized the look with blue boots and Givenchy hat\nThe celebrated designer was equally complimentary about her young muse, adding: 'The Versus campaign captures everything that is special about ZAYN, Gigi and Adwoa.\n'They are young people who define the mood of their generation with their honesty, energy and their love.'\nFilmed by Gigi using iPhones and digital cameras, the campaign images will feature individually on social media and collectively in print.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320520/Gigi-Hadid-flashes-skin-revealing-white-look.html"}
