{"authors":["Kelsea Stahler"],"date_download":"2018-10-30 23:09:49","date_modify":"2018-10-30 23:09:49","date_publish":"2014-08-14 00:38:40","description":"Look, I'm not exactly a Big Brother expert. I come in and out here and there — it's one of the mainstays of summer TV after all — but I just about lost it when I heard Iago from Aladdin voicing the aggro Otev during Big Brother's Power of Veto…","filename":"data/vaneerConsumption/GilbertGottfriedReallyVoicedOtevonBigBrotherSoAladdinsParrotPlayedaDemandingPenguin.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8e87c660-14fe-42a1-a8ac-151f42ac6953.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35708-gilbert-gottfried-really-voiced-otev-on-big-brother-so-aladdins-parrot-played-a-demanding-penguin_1540940989.html","title":"Gilbert Gottfried Really Voiced Otev on 'Big Brother' - So Aladdin's Parrot Played a Demanding Penguin","title_page":"Gilbert Gottfried Really Voiced Otev on 'Big Brother' — So Aladdin's Parrot Played a Demanding Penguin","title_rss":"NULL","source_domain":"bustle.com","text":"Look, I'm not exactly a Big Brother expert. I come in and out here and there — it's one of the mainstays of summer TV after all — but I just about lost it when I heard Iago from Aladdin voicing the aggro Otev during Big Brother's Power of Veto competition. I would have spit out a cloud of my own feathers... if I was an animated Disney character. That's right: Gilbert Gottfried actually voiced a Big Brother \"character.\"\nSorry, Big Brother purists, but while the houseguests worked tirelessly to bring the demanding penguin overlord, Otev, cardboard cocktails named after departed houseguests, all I could think about was how much Otev sounded exactly like another obnoxious bird from our past. Of course, Zach went on to best the damn demanding penguin, bring him all the right \"cocktails\" based on cryptic riddles, and win the Power of Veto (giving us this incredible sound byte: \"Take that, Penguin. You're a freakin' punk\"), but that wasn't enough for me. I had to know: was this really happening? Were the worlds of Disney and the messed up realm that is Big Brother really converging?\nAs it turns out, the answer is a big ol' \"YES\" and this isn't even the first time:\nAnd as shocked as I was to find out the truth, if you really think about it, Gottfried is kind of the only person who could voice a larger-than-life (literally) and bigger-than-necessary bird with a set of ridiculous demands.\nObviously.\nFor more on the houseguests, check out Bustle’s very own Big Brother podcast, The Diary Room. Listen to the latest episode below, and be sure to check out future episodes on Bustle’s SoundCloud page and iTunes.\nImage: Walt Disney Pictures; Giphy","url":"https://www.bustle.com/articles/35708-gilbert-gottfried-really-voiced-otev-on-big-brother-so-aladdins-parrot-played-a-demanding-penguin"}
