{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:13:45","date_modify":"2018-10-22 23:13:45","date_publish":"2017-03-16 06:12:19","description":"Her new self help book focuses on the power of women. So it makes sense that Gillian Anderson showed up to discuss her new tome at a Tribeca Talk in support of the UN","filename":"data/vaneerConsumption/GillianAndersonlooksyouthfulinallblackensemble.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51C8F600000578-0-image-a-71_1489637786411.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318882_Gillian-Anderson-looks-youthful-black-ensemble_1540250025.html","title":"Gillian Anderson looks youthful in all-black ensemble","title_page":"Gillian Anderson looks youthful in all-black ensemble | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her new self help book focuses on the power of women.\nSo it makes sense that Gillian Anderson showed up to discuss her new tome at a Tribeca Talk in support of the UN Women's HeforShe equality initiative on Wednesday night.\nThe 48-year-old X-Files vet looked youthful and vibrant in an all-black outfit.\nSpeaking out: Gillian Anderson, 48, showed up to discuss her new self-help tome at a Tribeca Talk in support of the UN Women's HeforShe equality initiative on Wednesday night\nAs it was only a few days after a freak blizzard, Gillian bundled up in a knee-length black fur coat as she walked into the venue.\nInterestingly, she did don some very high stiletto heels initially, but later changed her footwear.\nOnce inside, she removed her outerwear, revealing a unique black top with three metal buttons on each shoulder and yellow elbow patches.\nStaying warm: As it was only a few days after a freak blizzard, Gillian bundled up in a knee-length black fur coat as she walked into the venue\nUnexpected: Once inside, she removed her outerwear, revealing a unique black top with three metal buttons on each shoulder and yellow elbow patches\nBlack trousers and some black pointed-toe boots completed the demure look.\nShe parted her famous flaxen tresses on the right and tied them back into a small ponytail.\nDistinctive black-frame glasses complemented her youthful visage, which was adorned with pale rose lipstick, light blush and some smokey eye make-up.\nHaving a good time? While Gillian seemed to enjoy delving into the details of her book, she recently opened up about her struggle with mental health problems\nCo-author of We: A Manifesto For Women Everywhere Jennifer Nadel was dressed in a similar outfit for the event.\nWhile Gillian seemed to enjoy delving into the details of her book, she recently opened up about her struggle with mental health problems.\nGillian, who has had therapy since the age of 14, told the Guardian: 'There were times when it was really bad. There have been times in my life where I haven’t wanted to leave the house.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318882/Gillian-Anderson-looks-youthful-black-ensemble.html"}
