{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 04:32:13","date_modify":"2018-10-23 04:32:13","date_publish":"2017-04-26 16:09:28","description":"Michael Johnson, 18, ran down 70-year-old Trevor Hadlow down as he bravely attempted to stop the teenage thief from stealing a trailer from the Kent farm where he worked.","filename":"data/vaneerConsumption/Gillinghamteenagethiefmoweddownandkilledfarmer70.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA01ECF00000578-0-image-a-32_1493219142920.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448234_Teenage-thief-mowed-killed-farmer-70_1540269133.html","title":"Gillingham teenage thief mowed down and killed farmer, 70","title_page":"Gillingham teenage thief mowed down and killed farmer, 70 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michael Johnson, 18, ran down 70-year-old Trevor Hadlow down as he bravely attempted to stop the teenage thief from stealing a trailer from the Kent farm where he worked\nA teenage driver who knocked down a traffic warden to avoid getting a parking ticket killed an elderly farm worker by mowing him down just four months later.\nMichael Johnson, 18, ran down 70-year-old Trevor Hadlow down as he bravely attempted to stop the teenage thief from stealing a trailer from the Kent farm where he worked.\nMr Hadlow walked back to his caravan after the incident, where he collapsed and died from his injuries.\nHe was discovered two days later by the owner of the farm, which is in Gillingham, who had grown concerned about being unable to contact him.\nThrough an extensive analysis of CCTV footage, automatic number plate recognition and mobile telephone data, officers from the Kent and Essex Serious Crime Directorate were able to prove it was Johnson who had driven the vehicle in question.\nJohnson, of Sheppey, Kent, was arrested and charged with Mr Hadlow's death, and later pleaded guilty to causing his manslaughter whilst stealing the trailer.\nMaidstone Crown Court heard how Johnson drove a white Peugeot Expert van onto the farm shortly after 7.30pm on November 20 last year, before attempting to leave about a minute later with a trailer attached.\nHandyman Mr Handlow, who lived and worked on the site, had noticed the vehicle and closed the gate in an attempt to stop it from leaving.\nMr Hadlow walked back to his caravan after the incident, where he later collapsed and died\nInstead the van was driven straight into him, knocking him down before it exited the farm.\nFollowing the discovery of his body on Tuesday November 22, officers viewed CCTV footage of the incident and began to trace the movements of vans that matched the same description.\nCoincidentally the vehicle driven by Johnson had been seized by local patrols on Eastchurch, Kent, about an hour after the incident.\nThe van was empty but still had the trailer attached and contained a fuel syphoning kit, tools and empty fuel canisters, which led the officers to believe it had been used in a crime.\nWhen further examined, the van was found to contain a number of distinguishing features that proved it was the same as the one involved in Mr Hadlow's death, including damage to the front of the van.\nJohnson was arrested at his home address on six days later.\nWhile in custody, officers established that Johnson matched the description of a man who had also run a traffic warden over in High Street, Eastchurch, on Friday 8 July 2016.\nTraffic warden David Drury was allegedly run down by a teenage driver as he sped off in an attempt to avoid a parking ticket\nJohnson was found guilty of dangerous driving and not guilty of attempting to cause grievous bodily harm to the traffic warden following a trial at Maidstone Crown Court, which followed his earlier guilty plea for the manslaughter of Mr Hadlow.\nDetective Sergeant Adam Marshall of the Kent and Essex Serious Crime Directorate said: 'Trevor Hadlow was well-liked in the local community and was always willing to help out friends and neighbours.\n'His life was cruelly taken from him by Michael Johnson, who demonstrated scant regard for his welfare when he knocked him down in a callous attempt to escape the scene of his crime.\n'The shocking footage of him driving a car at a traffic warden shows just how little he cares for those affected by his actions.\n'Fortunately the victim of that particular incident escaped with his life whereas Mr Hadlow was not so lucky.\n'I am very proud of all the officers who worked on this case, who built an exceptionally strong collection of evidence against Johnson and left him with little choice but to admit he was responsible for causing Mr Hadlow's death.\n'I would also like to pay tribute to the officers who seized the vehicle in question without knowing anything about the incident, instead relying on their intuition and good old-fashioned police work to know the person driving it had been up to no good.'\nSentencing on the manslaughter, theft and dangerous driving offences was adjourned by Judge Philip Statman until June 16. Johnson was remanded in custody.","url":"https://www.dailymail.co.uk/news/article-4448234/Teenage-thief-mowed-killed-farmer-70.html"}
