{"authors":["Associated Press"],"date_download":"2018-10-23 00:06:27","date_modify":"2018-10-23 00:06:27","date_publish":"2016-01-11 08:35:39","description":"BANGKOK (AP) — Gillian Wong, a veteran journalist who has spent more than a decade reporting on China and elsewhere in Asia, is returning to The Associated P...","filename":"data/vaneerConsumption/GillianWongnamedAPsnewsdirectorforgreaterChina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:b3ef173adee440329a3643bea12408ad-48qEJGFphM8d437f0aaf92263f14-84_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393560_Gillian-Wong-named-APs-news-director-greater-China_1540253187.html","title":"Gillian Wong named AP's news director for greater China","title_page":"Gillian Wong named AP's news director for greater China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gillian Wong named AP's news director for greater China\nBANGKOK (AP) — Gillian Wong, a veteran journalist who has spent more than a decade reporting on China and elsewhere in Asia, is returning to The Associated Press to lead its coverage of the world's most populous nation and second-largest economy.\nWong, who currently covers technology at The Wall Street Journal, will be based in Beijing as the AP's greater China news director. In that role, she will oversee coverage in video, text and photos, across a territory that includes the mainland, Taiwan and Hong Kong.\nWong's appointment was announced Monday by Ted Anthony, the cooperative's Bangkok-based director of Asia-Pacific news.\nIn this Jan. 10, 2016, photo, Gillian Wong poses for a photo in Beijing, China. Wong, a veteran journalist who has spent more than a decade reporting on China and elsewhere in Asia, has been named Greater China news director for The Associated Press. She will oversee coverage in video, text and photos, across a territory that includes the mainland, Taiwan and Hong Kong. (Photo via AP) NO SALES, NO ARCHIVE\n\"I know few journalists in Asia or anywhere else who are as intrepid and creative as Gillian,\" Anthony said. \"Her comprehensive understanding of the China story, after years of covering it inside and outside the country, will help the AP deliver what its customers expect about one of the biggest stories in the world — and more.\"\nWong, 33, has been reporting from China since 2008, including six years as a correspondent with the AP's Beijing bureau, where she covered a wide range of stories.\nWong's journalism chronicled the strides China's leaders made in responding to public crises such as flu epidemics and major earthquakes. She also focused on Beijing's growing challenges with ethnic unrest in its remote west and environmental protests in its more prosperous east.\nIn 2014, Wong detailed rare, on-the-record accounts of torture suffered by several Communist Party members and former officials at the hands of the party's secretive internal anti-graft detention system. She also covered the high-profile 2013 downfall of Bo Xilai, a charismatic Chinese leader embroiled in what was then the country's biggest political scandal in years.\nDuring a spate of self-immolations by Tibetans protesting Beijing's rule in 2012, Wong was one of a few reporters who got into a tightly guarded Tibetan area in the western province of Sichuan and interviewed residents. In 2010, she reported that dozens of minority Uighurs had secretly fled China in the wake of a security crackdown imposed in their homeland of Xinjiang after ethnic riots killed nearly 200 people.\nWhile at the AP, Wong was also sent to Myanmar, Bangladesh, Malaysia and South Korea to cover disasters both natural and human-made, ranging from the devastating cyclone that hit Myanmar in 2008 to the sinking of the South Korean ferry Sewol in 2014.\nAt The Wall Street Journal, Wong's reporting has tracked the ambitions of China's Internet giants as well as the challenges faced by U.S. technology companies operating in a business environment that's increasingly intertwined with cybersecurity concerns. She has also covered the country's rapidly growing Internet finance sector.","url":"https://www.dailymail.co.uk/wires/ap/article-3393560/Gillian-Wong-named-APs-news-director-greater-China.html"}
