{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 00:27:53","date_modify":"2018-10-23 00:27:53","date_publish":"2017-04-26 10:06:26","description":"The businesswoman and former model unveiled her latest campaign to limit the impact of leaving the EU after Theresa May urged voters to give her a 'mandate' for looming talks with Brussels.","filename":"data/vaneerConsumption/GinaMillerurgestacticalelectionvotestocurbBrexit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F1A8600000578-0-image-a-4_1493204169461.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446902_Gina-Miller-urges-tactical-voting-curb-Brexit_1540254473.html","title":"Gina Miller urges 'tactical' election votes to curb Brexit","title_page":"Gina Miller urges 'tactical' election votes to curb Brexit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gina Miller, pictured at her launch event in London today, is urging people to vote 'tactically' against Brexit on June 8\nGina Miller urged Remoaners to vote 'tactically' to curb Brexit today as she launched an election campaign after raising nearly £300,000 in just a week.\nThe businesswoman and former model unveiled her latest campaign to limit the impact of leaving the EU after Theresa May urged voters to give her a 'mandate' for looming talks with Brussels.\n'Only tactical voting at this election will ensure that Parliament plays its full role,' she told an event in central London.\nMs Miller also insisted she did not think it was impossible that Brexit could be stopped altogether. But she ruled out standing for election herself.\nA spokeswoman for the campaign confirmed that it is the 'trading name' for the UK-EU Open Policy group, which has been supported by Virgin boss Sir Richard Branson.\nBest for Britain will support candidates in the June 8 poll who want to limit the impact of quitting the EU.\nBut Tory MP Peter Bone told MailOnline it was clearly a 'party political' vehicle aimed at the Conservatives and disrupting Theresa May's efforts to get the 'best possible deal' for the UK with Brexit.\nMs MIller said: 'In this election it will be about voting for candidates that will reflect the views of all of their constituents and put principles above politics.\n'That is why last week I set up a crowdfunding page which almost 10,000 people have already donated to, raising an incredible £300,000.\n'This grassroots movement wants what’s Best for Britain and they are supporting our call to elect MPs in Parliament who are prepared to put party politics to one side to ensure that the best deal for Britain is achieved. In terms of Brexit that means MPs who want to see all options on the table.\n'People are worried about the future direction of this country, they believe in Parliamentary democracy and they believe, as do we, that only tactical voting in this election can ensure that Parliament plays their full part in the future of this country.'\nGina Miller launched her Best for Britain campaign today after raising nearly £300,000 in less than a week\nMs Miller pictured with campaign chief executive Eloise Todd at the launch event in central London today\nA Best for Britain spokeswoman confirmed it is a 'trading name' for the UK-EU Open Policy group, which the Mail previously revealed has received support from Virgin boss Sir Richard Branson\nIn her appeal on thegofundme website, Ms Miller said she would tour marginal constituencies to ensure the government did not have a mandate to 'destroy our rights and our relationship with Europe'.\n'We need to prevent MPs and the people being forced into an extreme Brexit that is not in Britain's best interests,' she wrote.\n'We will support candidates who campaign for a real final vote on Brexit, including rejecting any deal that leaves Britain worse off.\nGina Miller has now raised more than £280,000 to support anti-Brexit candidates in the general election\nThe Best for Britain campaign being championed by Ms Miller (pictured at the launch today) is pledging to prop up any candidate who is against 'hard' Brexit.\nPosting on the gofundme website, Ms Miller said she would tour marginal constituencies to stop 'extreme Brexit'\n'We will use the money to back candidates who pledge to support a full and free vote on the Brexit deal. We will also work with organisations with the same goals.'\nThe UK-EU Open Policy group was set up last October by Europhiles including Blairite former minister Alan Milburn.\nThe Mail revealed earlier this year that Sir Richard - who was a prominent campaigner for Remain in the EU referendum - had given office space for the project as well as £25,000.\nWithin 15 hours of the Best for Britain campaign's launch last week, it had received pledges of more than £1,500. The total has now reached around £285,000.\nMs Miller came to prominence last year when she challenged Mrs May's right to trigger the Article 50 process using executive powers.\nInstead, the government pushed through the Brexit Act despite efforts by Remain-supporting MPs and peers to water it down.\nThe 52-year-old has made clear she will carry on fighting to limit the impact of Brexit despite receiving abuse and death threats.\nLast month Ms Miller threatened another legal challenge unless Theresa May guarantees a 'meaningful vote' on any new deal with the EU.\nGina Miller said she could not think of 'anything better to do' with her money than ensuring the PM brings the package back before the Commons.\nThe comments came after campaigners obtained legal advice that Britain's 'actual withdrawal' will have to be authorised by a fresh act of Parliament.\nTory MP Mr Bone said: 'Obviously she is entitled to campaign for whomever she wants.\n'But personally I think whatever view you have on the EU you should make those views known, but you really should not be involved in what is clearly an attempt to vote against Conservative candidates and not support Theresa May in her efforts to get the best deal for the UK.\n'This is clearly an entry into party politics from somebody who has always claimed she was doing this in the national interest.'\nTheresa May, pictured on a visit to a steel works in Newport yesterday, has said she needs a mandate to push through the Brexit negotiations","url":"https://www.dailymail.co.uk/news/article-4446902/Gina-Miller-urges-tactical-voting-curb-Brexit.html"}
