{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-23 03:12:16","date_modify":"2018-10-23 03:12:16","date_publish":"2016-01-29 18:05:29","description":"Gina Rodriguez has made her Twitter follower Jessica Casanova's dream come true by offering to lend her 2015 Golden Globes dress to the teen.","filename":"data/vaneerConsumption/GinaRodrigueztolendingherGoldenGlobesdressoutforteensprom.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4B5CD00000578-0-image-a-29_1454091721504.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423239_It-honor-Gina-Rodriguez-makes-fan-s-dream-come-true-lending-Golden-Globes-dress-teen-s-prom_1540264336.html","title":"Gina Rodriguez to lending her Golden Globes dress out for teen's prom","title_page":"Gina Rodriguez to lending her Golden Globes dress out for teen's prom | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She plays a character whose baby is considered a miracle by some.\nAnd Gina Rodriguez has had a hand in creating a wonder of her own for one luck fan of the Jane the Virgin star.\nThe actress has made her Twitter follower Jessica Casanova's dream come true by offering to lend her 2015 Golden Globes dress to the teen.\nScroll down for video\nMaking dreams come true: Gina Rodriguez has had a hand making one Twitter fan's prom the best ever - she is seen here at the 2016 Golden Globes\nGina, 31, got a Tweet from her teen fan, who lives in Buffalo, NY, saying: so would love to wear your golden globes dress to prom.'\nShe was referring to the stunning Zac Posen frock which the actress wore to the 2016 ceremony.\nThe stunning off the shoulder blue frock got much admiration on the red carpet.\nStunned: Jessica Casanova - seen here with her boyfriend Nathan Cohen - tweeted the star saying how much she admired her dress at this years ceremony\nNot available: Gina responded she couldn't help her out with the Zac Posen frock but...\n...she then revealed she would be happy to lend out her 2015 gown - which she is seen in here - for Jessica for her prom\nBig hearted: Gina then tweeted saying they could maybe make it happen\nTo Jessica's delight the star responded to her Tweet saying: 'Where do you live? I only own my first globes dress the one from last year..maybe we can make this happen.'\nThe dress - a black fitted strapless fishtail cut, was designed by Badgley Mischka.\nJessica responded with a shock face emoji explaining where she lived, and Gina replied: 'Do you know which one I am talking about?'\nLucky: The stunning Badgely Mischka frock is the gown she took home her award for Best Actress in a Comedy series\nAnother fan helpfully posted a shot of the dress - which the actress wore to the 2015 Golden Globes ceremony - the one at which she took home the award for Best Actress in a Comedy series.\nJessica, no doubt stunned and ecstatic replied: 'It would be an honor to wear it. its beautiful.\nGina, springing into action said: 'Let's talk about it. I'm reaching out.'\nJessica, who has been with her boyfriend Nathan Cohen for two years and five months, posted an emoji of a smiley face with hearts for eyes and added the comment: 'Being privileged to wear @HereIsGina dress to prom, and its like a dream come true.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423239/It-honor-Gina-Rodriguez-makes-fan-s-dream-come-true-lending-Golden-Globes-dress-teen-s-prom.html"}
