{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 01:32:33","date_modify":"2018-10-23 01:32:33","date_publish":"2017-03-16 11:39:18","description":"Lily Beddall's picture is now on show in every one of the chain's 217 UK stores after the toddler from Sawbridgeworth won a competition to become the face of the retailer.","filename":"data/vaneerConsumption/GirlwithDownssyndromebecomesthefaceofMatalan.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/21/3E58602F00000578-0-image-a-27_1489700113136.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319812_Girl-s-syndrome-face-Matalan_1540258353.html","title":"Girl with Down's syndrome becomes the face of Matalan","title_page":"Girl with Down's syndrome becomes the face of Matalan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A two-year-old girl with Down syndrome has won a nationwide modelling contract with fashion retailer Matalan - and her family say it's the best thing to have happened to them.\nLily Beddall's picture is now on show in every one of the chain's 217 UK stores after she won a competition to become the face of the retailer.\nProud mother Vicki Beddall, 37, a full-time mother and former proof reader from Sawbridgeworth, said: 'The contract is all about inclusion and changing the face of beauty. It is wonderful that Matalan chose a child with Down syndrome.\nLily's proud mum Vicki says the modelling shots of Lily are intended to help 'break down stereotypes' and she couldn't be more proud of the youngster\nLily Beddall, two, who has Down's syndrome has won a nationwide modelling contract with fashion retailer Matalan. This picture is now on show in every one of the chain's 217 UK stores\n'We are so proud of her and we are so proud of everything she has achieved. It is the best thing to have happened to us.\n'Down syndrome is not what you expect. It is hard work sometimes, but she was going to be hard work anyway as she is two years old.\n'She has lots of friends and she is not unable to do anything that other children do.\n'It's all about breaking down stereotypes and showing that beauty comes in all shapes, sizes and abilities.'\nThat's me! When the tot saw her own likeness in a Matalan store, she recognised herself straight away and even posed in front of her picture according to her proud parents\nThe youngster, pictured with mum Vicki, 37, and Eddie, 44, now appears in Matalan stores up and down the country and her amazing achievement came around thanks to a charity\nAfter her photo went up in the stores, mother Vicki and father Eddie, 44, took Lily to see the result of her work.\nLily recognised herself straight away and even posed in front of her picture.\nVicki added: 'She is the face of her age group and her photo is in every Matalan in the UK.\n'It came about because we are involved with Harlow charity Upwards with Down's. Matalan wanted a child model who had Down syndrome and the agency contacted and asked if they had models.\n'Beuaty comes in all shapes, sizes and abilities': Lily's parents are hoping that her story will serve as an example to others\nAfter her photo went up in the stores, mother Vicki and father Eddie, 44, took Lily to see the result of her work\nLily's mother Vicki said: 'The contract is all about inclusion and changing the face of beauty. It is wonderful that Matalan chose a child with Down syndrome'\nEddie Beddall with daughter Lily in a Matalan store with the picture of Lily which is being used for the toddler range\nVicki said it is the best thing to have happened to them and it came about because they are involved with Harlow charity Upwards with Downs\nHer mother said: 'We are so proud of her and we are so proud of everything she has achieved. It is the best thing to have happened to us'. Vicki explained that Down syndrome is not what you expect and is 'hard work sometimes'\nVicki explained that the company phoned them about her starring in the campaign and they agreed before Christmas\n'They phoned us and we said we would like to do it. She had the photos taken at the end of November.'\nIn 2016 a four-year-old girl with Down syndrome became a Matalan catalogue model.\nRosie Daniels' mother Rachel, 45, wrote to the retail giant and said it would be refreshing to see more diversity in their advertising.\nThis then led to her little girl being offered the opportunity to model a range of the store's clothes.","url":"https://www.dailymail.co.uk/femail/article-4319812/Girl-s-syndrome-face-Matalan.html"}
