{"authors":["Harvey Day For Mailonline"],"date_download":"2018-10-23 01:56:46","date_modify":"2018-10-23 01:56:46","date_publish":"2017-03-10 10:29:07","description":"WARNING: GRAPHIC CONTENT. Nickie Knowles, 26, and Richard Ashton, 29, have each been jailed for two years for the vicious attack which was caught on CCTV cameras in Exeter, Devon.","filename":"data/vaneerConsumption/GirlknockedoutbydrunkenthugsinExeterDevon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2345AA00000578-0-image-a-2_1489155375817.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300650_Shocking-moment-girlfriend-knocked-drunken-thugs_1540259806.html","title":"Girl knocked out by drunken thugs in Exeter, Devon","title_page":"Girl knocked out by drunken thugs in Exeter, Devon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This shocking video shows a girl being floored by a single punch after she came to the aid of her partner as he was subjected to a 'mindless' attack by two drunken yobs.\nNickie Knowles, 26, and Richard Ashton, 29, have each been jailed for two years for the vicious attack which was caught on CCTV cameras.\nThe footage begins by showing the boozed-up duo chasing innocent victim Guiseppe Nicotra, 28, down a street in the city centre of Exeter, Devon.\nThis shocking video shows a girl being floored by a single punch after she came to the aid of her partner as he was subjected to a 'mindless' attack by two drunken yobs\nNickie Knowles, 26, and Richard Ashton, 29, have each been jailed for two years for the vicious attack which was caught on CCTV cameras\nThey are then shown repeatedly punching and kicking him while he lay in the middle of the street.\nAnd when the victim's girlfriend Polina Koshcheeva, 24, pleaded with them to stop, Knowles punched her in the face and knocked her out.\nThe violence continued when a third victim, who tried to intervene, was floored by Ashton.\nAll three told Exeter Crown Court, they feared for the lives during the unprovoked attack.\nThe victims of the attack have both spoken out after the sentencing and Mr Nicotra said he feels the punishment was too lenient.\nWhen Mr Nicotra's girlfriend Polina Koshcheeva tried to stop the attack, Knowles 'walked up to her, exchanged words and punched her once in the face', said Mr Richings\nHe said: 'I am angry as this attack was unprovoked and unfair. It was four chasing me for no reason other than they just wanted to hurt someone and inflict as much damage as possible.\n'This has a massive affect on me. I feel sick when I go Exeter and don't want to go there again. It makes me think twice about going out after dark and being around drunken people.\n'I would not wish this on my worst enemy. Two years is not long enough. They were not going to stop hitting me until I stopped breathing.\n'I could not eat for three days as my jaw was in so much pain. All I wanted to do was sleep. This attack has really knocked my confidence with people.'\nHis former partner Polina, who was knocked unconscious by a punch to the head during the incident, said she was recovering well.\nShe added: 'I am satisfied with the decision that was made by court.\n'I am fine now. I would rather say nothing else (about her attackers) as they got what they deserved I suppose.'\nKnowles was seen in the CCTV kicking and stamping on the victim Giuseppe Nicotra 18 times\nJudge Geoffrey Mercer QC told both defendants that shocking violence of this sort would not be tolerated.\nHe said: 'This was drunken, mindless, gratuitous street violence in the centre of Exeter at night.\n'It's the sort of incident which sickens the public and will not be tolerated.\n'You attacked a wholly innocent victim, essentially just for the sake of it and he was knocked to the ground and he was punched and kicked and stamped on to the body and the head repeatedly, as I've seen on the CCTV.\n'It's a matter of pure chance that your victim was not much more seriously hurt.\n'It was bad enough but it could have been much, much worse.'\nIn a victim impact statement Mr Nicotra said: 'I had to watch my girlfriend being knocked unconscious. This incident has broken our relationship up'\nThe court was played film of the attack which happened at 1am on Monday, July 11.\nProsecutor Gordon Richings said Mr Nicotra was walking with his girlfriend, Polina Koshcheeva, when they came across a group of four men and one bumped in to her\nShe told him to watch where he was walking and Mr Nicotra was told to control his girlfriend.'\nMr Nicotra said nothing but was so frightened by the men that he started to run away. Knowles chased him and threw him to the ground.\nMr Richings said: 'While on his back he set about punching and kicking him to the face, head and back repeatedly.\n'Ashton joined in and the pair continued to assault him while he was on the floor.'\nKnowles was seen in the CCTV kicking and stamping on the victim 18 times. Ashton inflicted 20 kicks and blows to the face, body and head.\nWhile they beat him they screamed 'Control your girlfriend.' The victim pleaded for them to stop.\nThe footage begins by showing the boozed-up duo chasing innocent victim Guiseppe Nicotra down a street in the city centre of Exeter, Devon\nAnd when the victim's girlfriend Polina Koshcheeva pleaded with them to stop, Knowles punched her in the face and knocked her out\nWhen Mr Nicotra's girlfriend tried to stop the attack, Knowles 'walked up to her, exchanged words and punched her once in the face', said Mr Richings.\nThe blow knocked the woman out and she was unconscious for about one minute.\nA third victim Callad Gayle, tried to reason with the men to stop and was punched twice.\nIn a victim impact statement Mr Nicotra said: 'This was a completely unprovoked attack that could have happened to anyone.\n'The way they were stamping and kicking me they could easily have killed me if they landed on my temple.\n'I had to watch my girlfriend being knocked unconscious. This incident has broken our relationship up.'\nThe violence continued when a third victim, who tried to intervene, was floored by Ashton\nAll three told Exeter Crown Court, they feared for the lives during the unprovoked attack\nMr Nicotra suffered a split lip, lumps to the back of the head, a swollen jaw, aching ribs and neck, and wobbly teeth.\nHis girlfriend suffered headaches, bruising to the left side of her face, cuts and felt deafness in one of her ears.\nShe was fearful the scars were visible when she attended her university graduation ceremony two days later.\n'I was scared to even go out for a few days and I was worried they would come after me again.'\nJudge Geoffrey Mercer QC told both defendants that shocking violence of this sort would not be tolerated\nAston of Exeter, and Knowles, of Torquay, Devon, both admitted two counts of causing Actual Bodily Harm and one count of assault by beating\nPaul Grumbar, in mitigation, said both men were normally 'sober, personable' men 'who you would not imagine seeking out violence for the sake of it'.\nHe added: 'They are both deeply apologetic.\n'They are not heavily convicted dangerous people, providing they stop drinking and grow up.'\nAston of Exeter, and Knowles, of Torquay, Devon, both admitted two counts of causing Actual Bodily Harm and one count of assault by beating.","url":"https://www.dailymail.co.uk/news/article-4300650/Shocking-moment-girlfriend-knocked-drunken-thugs.html"}
