{"authors":["Jamie Primeau"],"date_download":"2018-10-31 01:35:50","date_modify":"2018-10-31 01:35:50","date_publish":"2014-08-12 19:29:38","description":"On Girls, Shoshanna Shapiro is the quirky, bubbly twentysomething with the ridiculous hairstyles. But the actress who plays her has a much more serious secret. Zosia Mamet opened up about her struggle with an eating disorder in the September issue…","filename":"data/vaneerConsumption/GirlsStarZosiaMametsEssayAboutHerEatingDisorderIsMovingImportant.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0159c652-cb05-4846-a2f1-aebf673af8ea.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35461-girls-star-zosia-mamets-essay-about-her-eating-disorder-is-moving-important_1540949750.html","title":"‘Girls’ Star Zosia Mamet’s Essay About Her Eating Disorder Is Moving & Important","title_page":"‘Girls’ Star Zosia Mamet’s Essay About Her Eating Disorder Is Moving & Important","title_rss":"NULL","source_domain":"bustle.com","text":"On Girls, Shoshanna Shapiro is the quirky, bubbly twentysomething with the ridiculous hairstyles. But the actress who plays her has a much more serious secret. Zosia Mamet opened up about her struggle with an eating disorder in the September issue of Glamour. She wrote a column to share the story of a battle with her body that she's dealt with since childhood. It's a poignant, important read. She sheds light on the reality of eating disorders and how body image is something that affects everyone. The article begins with a courageous confession:\nDo you have a secret? Is your secret something that could kill you, a silent gnawing feeling that's slowly melting you away, little by little, something deadly that nobody else can see? Mine is. And it is this: I've struggled with an eating disorder since I was a child. This struggle has been mostly a private one, a war nobody knew was raging inside me. I tried to fight it alone for a long time. And I nearly died.\nHer column is so well-written you have to read the entire thing yourself. I'm actually resisting the urge to copy-and-paste every paragraph, because it's that moving. She comments on how she's not alone in this struggle and 30 million Americans share this same secret. Even if not everyone has a full-fledged eating disorder, she admits, \"I would venture to say it's a rarity to find a woman without body issues of some sort.\" Yup, I definitely think we can all agree that's an accurate statement.\nJamie McCarthy/Getty Images Entertainment/Getty Images\nIn the piece, she classifies herself as \"an addict in recovery,\" and comments on how this is a topic that needs to be taken seriously. Instead of being considered taboo, women (and even men) need to know they're not alone. Feeling ashamed sometimes prevents people from speaking up and getting help, Mamet says. She cites the statistic that eating disorders are the mental illness with the highest death rate.\nFor Mamet, it all began at age eight. Someone made a comment about her being \"fat,\" although she reflects now that she never actually was fat. It unleashed a monster in her, as she puts it. A monster who \"convinces me my clothes don't fit or that I've eaten too much. At times it has forced me to starve myself, to run extra miles, to abuse my body.\" As a teen, she'd stand in front of the fridge, opening and closing the door, deciding if she should eat. When she did take food, she'd spit into the garbage. She writes, \"I was only 17, living in misery, waiting to die.\"\n\"We all suffer in some small way; we are all a little bit ashamed of that second cupcake. Let's diminish the stigma. Let's remind one another that we're beautiful.\"\nLuckily, recovery came thanks to her dad stepping in. The message hit home when he told her that she couldn't die. Although she didn't care if anything happened to her, she realized her family did. While the 26-year-old is at a healthy weight now, she admits her obsession will always be with her.\nHer honesty will hopefully inspire others to seek treatment and know that they're not alone. She encourages everyone to diminish the stigma — to not be ashamed to grab that second cupcake or to ask for help when needed. According to her, we have to change the ideal of what is considered beautiful. I'd say her essay is definitely a huge, brave step in that direction. Bravo, Zosia!\nImages: Getty Images","url":"https://www.bustle.com/articles/35461-girls-star-zosia-mamets-essay-about-her-eating-disorder-is-moving-important"}
