{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:29:00","date_modify":"2018-10-30 22:29:00","date_publish":"2014-08-15 15:31:46","description":"How would you feel if you found out that the nice young man or woman you’d been messaging on your online dating site of choice was actually a robot? Would you feel upset? Used? Would you find it hilarious and squirrel it away as a story to tell your…","filename":"data/vaneerConsumption/GirlsWhoDateComputersTumblrUsesCleverbottoMesswithPeoplesHeadsandHeartsonOKCupid.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9a6bb534-9493-4a8e-8d02-e078945df809.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35929-girls-who-date-computers-tumblr-uses-cleverbot-to-mess-with-peoples-heads-and-hearts-on-okcupid_1540938540.html","title":"'Girls Who Date Computers' Tumblr Uses Cleverbot to Mess with People’s Heads and Hearts on OKCupid","title_page":"'Girls Who Date Computers' Tumblr Uses Cleverbot to Mess with People’s Heads and Hearts on OKCupid","title_rss":"NULL","source_domain":"bustle.com","text":"How would you feel if you found out that the nice young man or woman you’d been messaging on your online dating site of choice was actually a robot? Would you feel upset? Used? Would you find it hilarious and squirrel it away as a story to tell your grandkids if and when you end up having them? I probably wouldn’t be too thrilled, but hey, if I ever wanted to suss out my feelings on the topic for certain, all I’d have to do would be to seek out Schuyler Hunt on OKCupid. In the name of science (or “science,” as the case may be), Hunt has been conversing with potential matches through a fake profile — but not as himself. He’s been using Cleverbot to steal the ladies’ hearts.\nAccording to BuzzFeed, 28-year-old Hunt moved from Boston to New York for work four months ago. Like many, he signed up for OKCupid on arrival, and like many, he felt a little discouraged by his experience on the site—although not due to rejection. It seemed rather to him that the women messaging him weren’t interested in him, per se; they just wanted not to be alone (as the character Amy puts it Stephen Sondheim’s Company, they wanted to be with some somebody, rather than somebody). Having just seen Spike Jonze’ film Her, Hunt then wondered whether a bot could successfully date on OKCupid.\nSo he created a fake profile with a fake name and a photo of one of his friends and set some ground rules for his experiment: One, any conversations that might arise had to be initiated by real people on the site — Hunt’s fake profile wouldn’t initiate any itself — and two, all conversations would be run through Cleverbot, with Hunt pasting the bot’s responses directly into OKCupid without any editing or revision. An ongoing project, he’s chronicling the results on a Tumblr called Girls Who Date Computers. Some are calling it art; others think it’s as far from art as you can get; and me? I think it might be somewhere in between.\nOn the one hand, it is kind of an interesting experiment; Cleverbot, although capable of passing the Turing test, has no real, discernable personality, making it a blank slate for all its potential matches to draw upon as they will. Some of them think it’s kind of cute:\nAnd:\nOthers, not so much:\nAnd there’s also no denying that sometimes the results are laugh-out-loud funny. For example, Cleverbot seems to dislike Norway intensely:\nAs Maggie Lange of NY Mag’s The Cut wrote, “He's not so hot at wooing women, but he’s just a little non-sequitur gem.”\nThat said, though, I find the experiment troubling for a lot of reasons. First off, none of these women agreed to participate in the experiment. Sure, a portion of them probably are more interested in not being alone than in being with a specific person; but I also seriously doubt that all of them are of that mindset. As such, it seems needlessly cruel and duplicitous to be feeding them a robot in the guise of a human.\nAnd second, on some level, it feels like a somewhat childish response to some hurt feelings: “None of you really want to get to know me, so watch me turn the tables on you! How do you like them apples?”. Creating a fake profile on OKCupid is as easy as it is to message every single possible match you get, which I’ve no doubt was why the majority of Hunt’s initial messages felt impersonal to him. When a service like OKC is free, people are much more willing to exploit it — which kind of puts Hunt and the women he had such a strong, negative reaction to on his original profile in the same camp.\nUltimately, the experiment seems to say less about the state of dating and more about how easy or difficult people searching for love are to trick. It implies that there’s something wrong with trying to continue a conversation even in the face of weirdness is a flaw, not a strength — which, to be honest, I think is bullshit. I would argue that attempting to keep an exchange going even when you’re getting responses as bizarre as Cleverbot’s is a testament to the human desire to connect, not a statement against it. As Mark Shrayber noted on Jezebel, “BuzzFeed refers to this project as ‘poignant,’ but the only poignant thing about this conversation is that the woman Hunt is feeding to Cleverbot seems to be trying hard to make a connection, which is the exact opposite of his thesis.” I imagine the thought process on the women’s end to be something like this: “Sure, sometimes this dude’s responses are a little strange; he’s also funny and charming in an offbeat kind of way, so maybe he’s worth talking to.” Why is that a bad thing?\nBut hey, as is always the case with dating both online and off, at least you’ve always got the power to say, “Thanks, but no thanks.” Cleverbot doesn’t seem to be capable of making concrete plans to meet up with any of its matches; as such, it’s likely that all of its conversations will peter out eventually and its matches will move on to others — actual human beings. Online dating isn't all bad, after all.\nImages: ninnet/Flickr; bitcherific/Tumblr","url":"https://www.bustle.com/articles/35929-girls-who-date-computers-tumblr-uses-cleverbot-to-mess-with-peoples-heads-and-hearts-on-okcupid"}
