{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 02:13:16","date_modify":"2018-10-23 02:13:16","date_publish":"2017-03-10 11:08:24","description":"The missing military man's partner, April Oliver, shared a selfie showing the pair, smiling while sat in a convertible in Norfolk, and wrote: 'I miss you every second of every day.'","filename":"data/vaneerConsumption/GirlfriendofmissingCorrieMcKeaguesharespicture.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E2271DB00000578-0-image-a-55_1489145348197.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300860_Girlfriend-missing-Corrie-McKeague-shares-picture_1540260796.html","title":"Girlfriend of missing Corrie McKeague shares picture","title_page":"Girlfriend of missing Corrie McKeague shares picture | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The pregnant girlfriend of missing RAF airman Corrie McKeague has shared a heartbreaking photograph of the couple together in one of their favourite spots.\nThe missing military man's partner, April Oliver, shared a selfie showing the pair in a convertible in Norfolk, and wrote: 'I miss you every second of every day.'\nThe 21-year-old found out she was expecting just two weeks after the 23-year-old disappeared in September last year.\nThe missing military man's partner, April Oliver, shared a selfie showing the pair, smiling while sat in a convertible, and wrote: 'I miss you every second of every day'\nThe young couple had met on a dating site and had only been together for around five months before he went missing almost six months ago.\nSince announcing her pregnancy, April has kept quiet but last night shared the image with the 125,000 members on Corrie's missing page.\nPolice searching for Corrie said on Wednesday that it could take 10 weeks to scour a rubbish dump in Milton, Cambridge, where his body is thought to be following a blunder over a bin lorry linked to the case.\nIt is feared the 23-year-old RAF airman may have fallen into a bin following a night out in Bury St Edmunds last September, before being transported to a waste tip.\nBut long delays were caused to the search when the rubbish truck's weight was wrongly recorded as 24lbs rather than more than 180lbs.\nPolice are continuing to scour a rubbish dump in a search for missing Corrie McKeague\nMr McKeague, pictured (right) with girlfriend April Oliver, went missing after a night out\nIt could take the team of eight trained search officers up to 10 weeks to sift through 60 tons rubbish up to eight metres deep, covering around 920 square metres of the dump in Milton, near Cambridge.\nThe detective heading up the search, Detective Superintendent Katie Elliott, insisted she would not call the mistaken weight of a bin during the investigation an 'oversight'.\nShe said: 'I wouldn't describe it as an oversight. We check and recheck data we are provided. It's only when we've gone back and looked through thousands of lines of data we've found this.'\nMs Elliot added that she was 'confident' that his body would be found at the site.\nSpeaking as her officers raked through piles of rubbish, she said: 'I have a strong belief that we will find him here.'\nMs Elliot described finding out about the correct weight of the load in the bin as 'very sobering'.\nShe added: 'I would have liked to have had the information sooner that would have led us to this point.\nPolice say it could take up to 10 weeks to scour the site where his body may have been dumped\nDetective Katie Elliott (left) denied that a mistake in the lorry's weight was an oversight\n'It's frustrating for me, I think it must be terribly frustrating for Corrie's family.\n'We've been working tirelessly on this investigation to try and find Corrie - that's been our priority the whole way through.\n'To have that information really reinforced the decision that we'd already made that we needed to come and search this landfill site.'\nMr McKeague's mother, Nicola Urquhart, said to day that she is 'just trying to keep it together' as police continue to trawl the landfill site for her son's body.\nResponding to the bin lorry weight issue, Ms Urquhart, said: 'It could be the most innocent of errors that has not only dragged a family through this but I've brought thousands of people into this and that's a lot to handle.\n'I have one thousand questions going through my head - not one of them will help me find Corrie.\n'We need to find Corrie and then hopefully we might get some answers. All I can say right now is that I'm just trying to keep it together.'\nMr McKeague's mother, Nicola Urquhart said that she is 'just trying to keep it together'\nShe wrote an emotional post on Facebook last night saying the lorry weight was devastating\nMr McKeague, from Fife, vanished on a night out with friends in Bury St Edmunds, Suffolk, on September 24.\nA bin lorry was seen on CCTV near Brentgovel Street in the town around the time Mr McKeague was last seen, and it took a route which appeared to coincide with the movements of his phone.\nThe area of the landfill site where the load was deposited is now being searched, with a digger mechanically excavating mounds of waste and officers in white protective suits raking through it on the ground.\nA 26-year-old man had been arrested on suspicion of perverting the course of justice over the discrepancy in the lorry's load weight. But the man, who is not the bin lorry driver, faces no further action.\nDetective Superintendent Elliott said she does not believe there was a 'deliberate attempt to mislead' the investigation, and that the focus had to be on finding Mr McKeague.\nThe six-month investigation has cost more than £300,000 to date and the search of the landfill site could cost more than £500,000 if it runs to 10 weeks.","url":"https://www.dailymail.co.uk/news/article-4300860/Girlfriend-missing-Corrie-McKeague-shares-picture.html"}
