{"authors":["Mary Kekatos For Dailymail.Com"],"date_download":"2018-10-23 05:53:04","date_modify":"2018-10-23 05:53:04","date_publish":"2017-03-10 15:25:03","description":"Janet Sylva, 12, from The Gambia had a tumor growing inside her mouth for more than three years. It had grown to the size of a grapefruit, but doctors successfully removed it and she is now recovering.","filename":"data/vaneerConsumption/Girl12beamsafter6lbtumorwasremovedfromhermouth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2369B300000578-0-image-a-3_1489157106966.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4301456_Girl-12-beams-6lb-tumor-removed-mouth_1540273984.html","title":"Girl, 12, beams after 6lb tumor was removed from her mouth","title_page":"Girl, 12, beams after 6lb tumor was removed from her mouth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For three years, Janet Sylva was unable to eat, talk, or smile.\nThe 12-year-old girl from The Gambia had a tumor the size of a grapefruit growing on her jaw that left her unable to even close her mouth.\nBut now Janet is beaming after a groundbreaking US surgery removed the six-pound tumor - one of the largest New York doctors had ever seen.\nThe mass had made her breathing so difficult that they were afraid she might die within a year if nothing was done.\nAt a press conference on Thursday, surgeons revealed that recovery since the operation has gone smoothly and that Janet can finally return home.\nBeaming: Janet Sylva (left) and her mother, Philomena, smile during a press conference at Cohen Children's Medical Center in New Hyde Park, New York, where a groundbreaking surgery took place to remove a tumor that was growing in Janet's mouth\nCrippling pain: The tumor has been growing for more than three years and reached the size of a grapefruit, leaving Janet unable to eat properly, talk or even close her mouth\nJanet was born in The Gambia and was a relatively healthy child. Her mother, Philomena, said Janet didn't start complaining of mouth pain until she was nine years old. Doctors soon discovered a tumor growing on her lower jaw.\nAccording to Dr David Hoffman, head of Oral Maxillofacial Surgery at Staten Island University Hospital, the tumor could have been treated when she was younger and first diagnosed.\nHowever, the benign tumor was left untreated to the point that it became impossible to correct in her home country.\nIn three years, Janet's tumor has tripled the size of her mandible, or lower jaw, and had deformed her face - reaching the size of a grapefruit.\nShe often walked with her face wrapped in a scarf and was reluctant to go to school or engage with friends.\nDr Hoffman was contacted through the nonprofit group Healing the Children, after they'd been notified of her condition from one of her local doctors in The Gambia.\nThe surgeon then contacted Elissa Montanti, the founder of the Global Medical Relief Fund - a charity that helps children who have been injured due to war, natural disaster or illness - in September and asked for help.\nJanet did not start complaining of mouth pain until she was nine years old. She and her mother sought help at home and in Senegal, but to no avail. The tumor was left untreated\nHappy: Elissa Montanti (left) of the Global Medical Relief Fund, smiles with Janet. Montanti arranged for Janet's travel to the US for the groundbreaking operation\nMontanti arranged for transportation, housing and a visa for Janet and set her up in a home on Staten Island.\nBack in January, she told Daily Mail Online that it took months for doctors to figure how to treat Jannet.\n'Originally, Janet was going to be treated at Staten Island University Hospital, but it wasn't until Dr Hoffman first saw her in person that he realized the extent of her condition,' she said.\n'Between September and November, the tumor had grown. And it continued to grow right up until the day of surgery.'\nThe medical reason behind Janet's tumor is unknown. Montanti suspects it may have something to do with water as accessible, clean drinking water is hard to come by in Janet's home country.\nDr Armen Kasabian, chief of plastic surgery at North Shore University Hospital, led the team in performing the delicate operation.\nDoctors not only had to remove the tumor but also rebuild her jaw using part of a bone from her leg.\nDr Kasabian said the team knew they had to get it right the first time because Janet and her mother would only be in the US for a short time\nHe said: 'We don't have the luxury of operating on her 10 times.\n'We have to try and get the most that we can out of just one operation.'\nDoctors practiced on 3D models created from Janet's CAT scans in addition to a great amount of virtual surgery practiced on a computer.\nDr David Hoffman (left) and Dr Armen Kasabian, hold a model of a tumor and the actual six-pound tumor, pictured in the brighter red. The surgeons said the tumor was one of the largest they had ever seen\nAfter surgery: Janet's lower jaw was reconstructed using the fibula, or calf bone. She's undergone extensive therapy to learn and how to talk and eat again and has been cleared to return home next month\nSurgeons had to become before familiar with how to take the fibula, or calf bone, which is normally straight and reconstruct it into a curved jaw bone.\nFinally, on January 16, Janet underwent an approximately 12-hour operation surrounded by Dr Hoffman's team of head and neck, pediatric, and plastic surgeons, as well as an interventional radiologist.\nAfter recovering in the ICU, Janet underwent extensive therapy to learn and how to talk and eat again.\nJanet and her mother are preparing to return to Gambia next week, said Montanti\nBefore heading home, the pair returned Thursday to Cohen Children's. Through an interpreter, speaking their native language of Wolof, the mother and daughter thanked the medical staff.\n'I'm very happy and grateful because I have my daughter back,' Philomena said.\nAnd Janet is now smiling more than ever, and said the scarf she had worn to hide her face has been thrown away.","url":"https://www.dailymail.co.uk/health/article-4301456/Girl-12-beams-6lb-tumor-removed-mouth.html"}
