{"authors":["Cameron Phelps For Daily Mail Australia"],"date_download":"2018-10-23 04:34:44","date_modify":"2018-10-23 04:34:44","date_publish":"2017-03-10 14:48:53","description":"The girl who cannot be named faced the Children's Court at Maroochydore after raping the child between August 1 and December 31, 2014 when she was aged between 14 and 15.","filename":"data/vaneerConsumption/Girl17digitallyrapedherfiveyearoldstepniece.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E22FD2200000578-0-image-a-36_1489155652191.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301460_Girl-17-digitally-raped-five-year-old-step-niece_1540269284.html","title":"Girl, 17, digitally raped her five-year-old step-niece","title_page":"Girl, 17, digitally raped her five-year-old step-niece | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 17-year-old girl who digitally penetrated a five-year-old has been ordered to undergo a psychological program for young sexual offenders.\nThe girl who cannot be named faced the Children's Court at Maroochydore after raping the child between August 1 and December 31, 2014 when she was aged between 14 and 15, according to the Sunshine Coast Daily.\nThe teenager was also placed on probation for the offence on her step-niece which occurred one morning in the child's father's house.\nA 17-year-old girl who digitally penetrated a five-year-old has been ordered to undergo a a psychological program for young sexual offenders (stock image)\nLegal aid lawyer Mark Dixon who represented the teenager, said his client was sexually and physically abused from 12 to 16 years old and was now suffering from depression and anxiety.\nHe also said that she had also been homeless for the last 18 months to two years after losing contact with her parents.\nThe little girl has since become emotional, according to Crown prosecutor Alex Stark.\nThe teenage girl was sentenced to two years probation and ordered to attend the Griffith Youth Forensic Service which provides specialist assessment and treatment services to youth in relation to sexual offence\nJudge Garry Long also did not record a conviction.","url":"https://www.dailymail.co.uk/news/article-4301460/Girl-17-digitally-raped-five-year-old-step-niece.html"}
