{"authors":[],"date_download":"2018-10-22 20:46:35","date_modify":"2018-10-22 20:46:35","date_publish":"2014-06-03 00:23:00","description":"Police in Waukesha, Wisconsin, say two 12-year-old girls lured a friend into a wooded area where one held her down and the other stabbed the victim.","filename":"data/vaneerConsumption/GirlStabbingSuspectsChargedAsAdults.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_girl-stabbing-suspects-charged-adults-n120861_1540241195.html","title":"Girl Stabbing Suspects Charged As Adults","title_page":"Girl Stabbing Suspects Charged As Adults","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Chicago\nTwo 12-year-old Wisconsin girls accused of holding down and stabbing their 12-year-old friend were charged as adults in court Monday.\nPolice in Waukesha say the girls lured their friend into a wooded area Saturday where one girl held her down and the other stabbed the victim 19 times.\nBoth suspects were charged as adults with attempted first-degree intentional homicide, as a party to a crime. If convicted, they could each serve 65 years in prison. (NBC 5 is not naming the suspects or showing their faces due to their age).\nThe 12-year-old girl survived the attack, and police say her condition is stable.\nThe girls may have been motivated by a fictitious character named \"Slenderman,\" a criminal complaint revealed Monday.\nSlenderman is a character thought to have originated as an Internet meme around 2009. He is often depicted as a tall, thin man wearing a suit with a blank face.\nAccording to the criminal complaint, one of the girls stated that \"many people do not believe Slenderman is real,\" and she \"wanted to prove the skeptics wrong.\" Their goal may have been to become a \"proxy of Slender,\" which required the girls to \"physically kill someone,\" the complaint says.\nAuthorities said the two suspects had planned to kill the victim for several months before Saturday's attack.\nThe girls all attended the same middle school, according to police, and were together at a sleepover over the weekend.\nThe two suspects are accused of luring the girl into a wooded area near Rivera Drive and Big Bend Road under the premise of playing a game, police said.\nThe victim was stabbed in the torso, legs and arms but was able to crawl out of the woods to a road, where she was discovered by a passing bicyclist.\nAuthorities say the suspects were arrested several hours later. A knife believed to have been used in the stabbing has been recovered.","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/girl-stabbing-suspects-charged-adults-n120861"}
