{"authors":["Bryant Hevesi For Daily Mail Australia"],"date_download":"2018-10-23 00:27:22","date_modify":"2018-10-23 00:27:22","date_publish":"2017-04-26 10:03:43","description":"A mother has watched on in horror as her five-year-old daughter was killed after being hit by a truck on the NSW Central Coast. The girl had just stepped off a school bus when she was struck.","filename":"data/vaneerConsumption/GirlkilledafterbeinghitbyatruckonCentralCoast.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D912D00000578-0-image-a-2_1493195811461.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446740_Girl-killed-hit-truck-Central-Coast_1540254442.html","title":"Girl killed after being hit by a truck on Central Coast","title_page":"Girl killed after being hit by a truck on Central Coast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother has watched on in horror as her five-year-old daughter was killed after being hit by a truck.\nThe girl had just stepped off a school bus on Wednesday afternoon and was trying to cross a road when she was fatally struck.\nIt is believed the girl had walked out in front of the bus and did not see the truck approaching, 7 News reported.\nEmergency services raced to the scene at Hastings Street, Rocky Point, on the New South Wales Central Coast, about 3.40pm, on what the first day back from school holidays.\nScroll down for video\nA five-year-old girl has died after she was hit by a truck on the New South Wales Central Coast\nIt is believed the girl was crossing a road when she was fatally struck on Hastings Street, Rocky Point on Wednesday afternoon\nEmergency services raced to the scene and rendered first aid but the girl could not be revived\nThey found the five-year-old girl with multiple injuries. Paramedics rendered first aid but she died at the scene.\nThe girl's mother was waiting to pick up her daughter after she got off the bus.\nShe was taken to nearby Wyong Hospital to be treated for shock, according to the Sydney Morning Herald.\nA second person was also taken to the hospital by paramedics.\nA report will now be prepared for the Coroner and police said the truck driver will undergo mandatory drug and alcohol testing.\nAnyone who witnessed the accident is urged to contact CrimeStoppers on 1800 333 000.","url":"https://www.dailymail.co.uk/news/article-4446740/Girl-killed-hit-truck-Central-Coast.html"}
