{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:47:10","date_modify":"2018-10-30 18:47:10","date_publish":"2016-12-29 17:53:03","description":"An eight-year-old girl in Secaucus, N.J., says Boy Scout officials should treat her as a transgender boy, and let her join a boys' Cub Scout pack. | Politics","filename":"data/vaneerConsumption/GirlWantsBoyScoutGrouptosaysheisaTransgenderBoy.json","image_url":"https://media.breitbart.com/media/2016/12/Screen-Shot-2016-12-29-at-12.10.39-PM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_29__1540925230.html","title":"Girl Wants Boy Scout Group to say she is a Transgender Boy","title_page":"Girl Wants Boy Scout Group to say she is a Transgender Boy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An eight-year-old girl in Secaucus, N.J., says Boy Scout officials should treat her as a transgender boy, and let her join a boys’ Cub Scout pack.\nThe child, who is a biological girl but has been living as a “transgender boy” for more than a year, was asked to leave the pack following reported protests from parents.\nKristie Maldonado said her child, Joe, had been a member of Cub Scout Pack 87 for about a month, when a Boy Scout official notified her that the girl could not remain in the boys’ Cub Scout group. “Not one of the kids said, ‘You don’t belong here,’” the mother said of the boys in the pack, according to NorthJersey.com.\n“I’m a girl. I just don’t want to be a girl,” the girl told NorthJersey.com. “My identity is a boy.”\nGay political groups say the federal government should force Americans and their many civic society groups — including kids in K-12 schools’ biology classrooms and bathrooms — to accept the groups’ ideological claim that each person’s changeable “gender identity” should determine that person’s legal sex. In contrast, Americans prefer to rely on science and biology when gauging the sex of people who are seeking entry into single-sex sports leagues, bathrooms, showers, social groups and other civic institutions.\nTransgender behavior is rare. A recent study of the 2010 census showed that only one-in-2,400 Americans adults had changed their name from one sex to the other.\nAccording to the news report:\nThe Scouts declined to say whether they have a written transgender policy. Effie Delimarkos, the communications director for the Boy Scouts of America, said in a statement that the organization’s Cub Scouts programs are for boys age 7 to 10 and that “the classification on the participant’s birth certificate” would be used to “confirm legal status.” She did not provide additional details and did not specify whether the Boy Scouts have ever examined gender statuses on birth certificates. “No youth may be removed from any of our programs on the basis of his or her sexual orientation. Gender identity isn’t related to sexual orientation.” Effie Delimarkos, communications director, Boy Scouts of America\nThe controversy over a transgender child comes following the recent uproar over the Boy Scouts’ decision to end its bans against gay Scouts and Scout leaders.\nIn May of 2015, the Boy Scouts caved to pressure from corporate donors, the media, and government officials to accept gay Scouts, even though the organization is private and voluntary.\nFormer U.S. Secretary of Defense and then-Boy Scouts of America president Robert Gates warned a national annual gathering of Boy Scout attendees that failing to accept gay Scout leaders would open the organization up to legal challenges and a decline in membership.\n“We must deal with the world as it is, not as we might wish it would be,” said Gates, reported the Washington Post. “The status quo in our movement’s membership standards cannot be sustained.”\nThe Boy Scouts, however, had only addressed gay Scouts, and not children confused about their gender.\nIn July, Delimarkos told the Associated Press that transgender children would be permitted to participate in co-ed Boy Scouts programs, but not in Cub Scouts and Boy Scouts programs for boys only.\nBut the pro-gay pressure groups are beginning to pressure the scouting movement.\n“The Boy Scouts as a national organization have a decision to make,” said Justin Wilson, executive director of Scouts for Equality. “Are they going to exclude a transgender boy for the first time, or welcome transgender boys?”\nWilson added that the use of birth certificates to determine gender would be “a new, unfair arbitrary standard” for membership in the Boy Scouts.\nThe mother said she thought her daughter was a tomboy because she enjoyed tree-climbing and other typically male activities. She said that when the girl was five years old, the child began to read about transgenderism. Last year, the mother allowed the girl to live as a boy, and now says the girl is “much happier.”\nThe American College of Pediatricians states that gender ideology is harmful to children and that transgendered children are psychologically confused and at risk for mental health disorders. The College says:\nNo one is born with a gender. Everyone is born with a biological sex. Gender (an awareness and sense of oneself as male or female) is a sociological and psychological concept; not an objective biological one… A person’s belief that he or she is something they are not is, at best, a sign of confused thinking. When an otherwise healthy biological boy believes he is a girl, or an otherwise healthy biological girl believes she is a boy, an objective psychological problem exists that lies in the mind not the body, and it should be treated as such. These children suffer from gender dysphoria. Gender dysphoria (GD), formerly listed as Gender Identity Disorder (GID), is a recognized mental disorder in the most recent edition of the Diagnostic and Statistical Manual of the American Psychiatric Association (DSM-V)…\n“According to the DSM-V, as many as 98% of gender confused boys and 88% of gender confused girls eventually accept their biological sex after naturally passing through puberty,” the College asserts. “Conditioning children into believing that a lifetime of chemical and surgical impersonation of the opposite sex is normal and healthful is child abuse.”\nSimilarly, Youth Trans Critical Professionals, a group of self-described “left-leaning, open-minded, and pro-gay rights” professionals, say it is risky to affirm young people who claim to be transgender and provide them with hormonal and surgical treatments to change their bodies.\n“Our concern is with medical transition for children and youth,” states the group. “We feel that unnecessary surgeries and/or hormonal treatments which have not been proven safe in the long-term represent significant risks for young people.”\n“Policies that encourage — either directly or indirectly — such medical treatment for young people who may not be able to evaluate the risks and benefits are highly suspect, in our opinion,” says the organization, which is composed of psychologists, social workers, doctors, and other professionals.\nThe professionals express “alarm” that, because of the current trendiness of being transgendered, many young people have decided they are a member of the opposite sex simply as a result of “binges” on social media sites. They describe a process of transgender activists recruiting these young people for their “cult.”\n“There is evidence that vulnerable young people are being actively recruited and coached on such sites to believe that they are trans,” the professionals say.\nDespite such potential mental health problems associated with gender confusion, children who claim to be the opposite sex are no longer legally permitted to see a therapist to get stabilizing “conversion therapy” in some states. Youth Trans Critical Professionals sees such state prohibitions as dangerous since they may block the process of critical thinking and evaluation of the young person regarding the reasons why he or she desires to become a transgender member of the opposite sex.\n“While the sentiment behind this legislation is laudable, in some cases, it is being interpreted to mean that therapists cannot explore gender identity with a youth who is professing to be trans,” argue the professionals. “This would mean we can’t ask why; we can’t explore underlying mental health issues; we can’t consider the symbolic nature of the gender dysphoria; and we can’t look at possible confounding issues such as social media use or social contagion.”","url":"https://www.breitbart.com/politics/2016/12/29/transgender-mother-says-girl-boy-scout/"}
