{"authors":["Associated Press"],"date_download":"2018-10-23 04:57:39","date_modify":"2018-10-23 04:57:39","date_publish":"2017-03-16 16:04:19","description":"PARIS (AP) - Givenchy has announced the appointment of Clare Waight Keller as its new designer - signaling a surprise change in artistic direction for the...","filename":"data/vaneerConsumption/GivenchyappointsdesignerKellersignalsnewdirection.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/16/wire-229359-1489680266-556_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320886_Givenchy-appoints-designer-Keller-signals-new-direction_1540270659.html","title":"Givenchy appoints designer Keller, signals new direction","title_page":"Givenchy appoints designer Keller, signals new direction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PARIS (AP) - Givenchy has announced the appointment of Clare Waight Keller as its new designer - signaling a surprise change in artistic direction for the Paris fashion house.\nBritish-born Keller showcased her last collection for Chloe at this month's Paris Fashion Week. She is known for her saleable hippy-chic, '70s aesthetic.\nIn a statement Thursday, she said house founder \"Hubert de Givenchy's confident style has always been an inspiration\" and that she was grateful to write \"a new chapter in this beautiful story.\"\nFILE - In this March 2, 2017 file photo, British-born fashion designer Clare Waight Keller acknowledges applause at the end of the presentation of Chloe's Fall-Winter 2017-2018 ready to wear fashion collection, in Paris. Givenchy has announced Thursday March 16, 2017 the appointment of Keller as new designer, signaling a change in artistic direction for the Paris fashion house. (AP Photo/Francois Mori, File)\nKeller replaces Italian designer Riccardo Tisci who won plaudits during his 12-years at the LVMH-owned house for styles that mixed gothic and street culture.\nThey attracted a whole new generation of fans to the brand, including Kim Kardashian and Kanye West who were regulars at the catwalk shows.","url":"https://www.dailymail.co.uk/wires/ap/article-4320886/Givenchy-appoints-designer-Keller-signals-new-direction.html"}
