{"authors":[],"date_download":"2018-10-30 20:49:44","date_modify":"2018-10-30 20:49:44","date_publish":"2018-09-05 11:12:00","description":"AJC columnist Bill Torpy on why he's bothered by the Atlanta development authority's decision to donate $7.5 million to the Georgia Aquarium.","filename":"data/vaneerConsumption/GivingmoneytoAtlantadevelopersnowfishierthanever.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/08/22/Videos/4466765.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-welf_a4c3b88e948c7e7c51925142f32de8de__1540932584.html","title":"Giving money to Atlanta developers now fishier than ever","title_page":"Giving money to Atlanta developers now fishier than ever | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"The term “affordable housing” gets tossed around a lot these days as the cost of keeping a roof over one’s head increases faster than most people’s bosses are willing to pay them.\nSo, it’s encouraging to see Invest Atlanta step up to do something about it. The city’s development authority has started its Affordable Housing Program for Big, Scary Fish.\nOn Aug. 29, the board voted 4-3, under the urging of Mayor Keisha Lance Bottoms and some other well-connected honchos, to donate $7.5 million to the Georgia Aquarium, which is building a $108 million addition to house sharks.\nMankind has been unmerciful to sharks, killing millions each year just to make soup. So it’s heart-warming to see that some of them will survive in a safe, rent-free environment — the only cost to them being their freedom.\nThose pushing for the aquarium giveaway spouted the usual reasons for taxpayer largess: jobs, prestige, spin-off jobs and more sales tax. It has become a maxim of governments that you must spend tax money you currently have to chase future possible dollars. The math is often complicated and fuzzy, kind of like New Math for millionaires.\nThe other explanation that supporters gave for the payout is that Bernie Marcus just ain’t getting the love that he deserves.\nWho knew that Bernie Marcus, the tough-as-nails businessman who (co-)founded Home Depot and gave Atlanta a $250 million aquarium, needs so badly to have his tummy rubbed by city leaders?\nBut there they were, a line of heavy hitters including A.J. Robinson, the head of Central Atlanta Progress; Steve Labovitz, a silk-stocking lawyer and veteran governmental insider; and Mayor Bottoms, all saying the city needs to step up and have some skin in the aquarium game to show Bernie that we appreciate him.\nLabovitz noted that Invest Atlanta “invested” in the Center for Civil and Human Rights, the museum next door. In fact, it got $28.5 million from the Westside Tax Allocation District (TAD), the same fund that will cut a check to the aquarium. A TAD is a zone, often impoverished, where property tax collections are frozen and future increases in property values are used to fund improvements in that area, such as infrastructure or low-cost housing for people getting squeezed out.\nThe mayor stepped into the discussion, adding, “As a body, we should not penalize Mr. Marcus for his philanthropy. … We cannot ignore the investments the Bernie Marcus Foundation has made to this city and the potential investment we can lose in this city.”\nRobinson, also known as Mr. Downtown, noted that the state gave the aquarium some sales tax breaks but “we haven’t invested in it.” (That “we” means the city.)\nAt a news conference in Atlanta in 2005, Bernie Marcus, benefactor of the Georgia Aquarium, announces that the aquarium will open as the largest in the world. (Brant Sanderlin / AJC File)\nI must pause to point out that the city might not have officially cut the aquarium a check, but several years back, Invest Atlanta chose to issue $25 million in funding from the New Markets Tax Credit to benefit what used to be the World’s Biggest Fish Tank!!! (China has now outdone us.)\nAccording to the Tax Policy Center in Washington, D.C., “the credit provides an incentive for investment in low-income communities. The U.S. Treasury competitively allocates tax credit authority to intermediaries that select investment projects. Investors receive a tax credit against their federal income tax.”\nOn that occasion, the “low-income community” in question was the Georgia Aquarium. Tom Coburn, an Oklahoma Republican who was a U.S. senator at the time, later called the award the “Flipper Tax Credit,” named for the most adorable dolphin ever. Or was it a porpoise? I mix those up.\n“The proponents of the project openly admit the tax assistance was not even needed,” Coburn’s report stated, “but its availability allowed the popular aquarium to spend money on other projects.”\nThat’s the case, once again.\nThe Georgia Aquarium Expansion 2020 will begin construction in April. Among the changes will be a new shark gallery, a new entrance that extends onto the plaza and increased animal interactions. CONTRIBUTED\n“If we are going to give $7.5 million of taxpayer money, then the question becomes, ‘What are we getting that we wouldn’t already get?’” asked new Invest Atlanta board member Fred Smith, an Emory University School of Law professor. “This is going to happen regardless if we put in the $7.5 million, (so) that really doesn’t work for me.”\nSmith came from San Francisco, where you can barely rent a broom closet for two grand a month. Intown Atlanta is headed that way. So he voted no.\nCity Councilwoman Natalyn Archibong, who is on the board, worried about “mission creep” with city tax money, that affordable housing is at a crisis point, and that those on the margins will get dumped on once again.\n“The least of these are the ones I’m most concerned about,” she said.\nI get why the aquarium folks might want some public money. Everyone else is getting it.\nThe Braves got nearly $400 million to move out to Cobb County. The Hawks are getting $142 million to redo their 20-year-old arena. And the Falcons, owned by Bernie Marcus’ old Home Depot partner Arthur Blank, got $200 million in tax money to help build Mercedes Benz Stadium. And the Falcons may receive another $500 million over the next 30 years to help with debt service, capital improvements, operations and maintenance.\nBut tax money is not just for football and fish.\nAtlanta Hawks principal owner Tony Ressler (left), Atlanta Mayor Keisha Lance Bottoms, and members of the Hawks pose on Aug. 29, 2018, in Atlanta in front of a banner for the State Farm Arena, formerly Philips Arena. State Farm Arena, the new home of the Hawks, will open its doors following the completion of a $192.5 million renovation. BOB ANDRES / BANDRES@AJC.COM\nDunwoody recently gave a $9.4 million tax abatement to developers putting up a 16-story office tower next to the town’s MARTA stop. These tax schemes were originally designed to help developers look at downtrodden areas. The intention was to help make projects happen that otherwise wouldn’t have worked.\nAnd yet Dunwoody, one of the richest areas in Georgia, a place having trouble figuring out where to squeeze all these great towers, is giving away money for a prime spot next to the rail line.\nBut business developers — in fact, just about anyone building anything of note — expect giveaways and incentives as routinely as senior citizens rely on their Social Security checks.\nIt’s just that the guys in suits get a few added zeroes on theirs.","url":"https://www.ajc.com/news/local/torpy-large-welfare-for-sharks-aquarium-the-latest-tax-train/zVL6ZPoelhpmNaU815sUuO/"}
