{"authors":[],"date_download":"2018-10-23 00:47:22","date_modify":"2018-10-23 00:47:22","date_publish":"2016-05-06 00:00:00","description":"David Greene visits Glacier National Park in Montana to explore the extent to which concerns involving climate change may inform Montanans' view of the presidential election.","filename":"data/vaneerConsumption/GlacierNationalParkGivesMontanansACloseViewOfClimateChange.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=476993975_1540255642.html","title":"Glacier National Park Gives Montanans A Close View Of Climate Change","title_page":"Glacier National Park Gives Montanans A Close View Of Climate Change : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nGetting the view from Big Sky Country, we are in Bozeman, Mont., with a live audience at the Feed Cafe. You want to wake up the rest of America?\n(APPLAUSE)\nGREENE: You know, I have to tell you all, you live in a beautiful state and...\n(APPLAUSE)\nGREENE: No amount of research could've prepare me for just how stunning Glacier National Park was going to be and...\n(APPLAUSE)\nGREENE: David Parker is sitting with me. He's a political scientist from Montana State University. And, David, you must go to Glacier a lot. You're lucky to be so close.\nDAVID PARKER: I go to Yellow Stone a lot. I've been up to Glacier once but, you know, it's stunning. The whole state is stunning. And to be a Westerner, you can't escape a connection to the beautiful landscapes that we live in, right? We recreate on the land and most Montanans, in one way or another, make a living from that land.\nGREENE: Well - and the land is changing. And that's one thing that we wanted to see when we decided to go up and visit Glacier. And, you know, we're getting the view this election year from Montana and we wanted to understand the role that climate change and the environment might be playing in voter's minds.\nAnd when we were up at the park we met up with Daniel Fagre. He is the expert on climate at Glacier. He's a scientist with the U.S. Geological Survey. We were standing right on the shore of one of the lakes there. He said he's been watching the glaciers, these massive sheets of ice clinging to mountains, getting thinner and thinner.\nHow ominous is your prediction for these glaciers?\nDANIEL FAGRE: Well, the glaciers will be gone. It's already too warm to keep them, so it's just a matter of watching them decline and ultimately disappear. So we're already past the tipping point for these glaciers.\nGREENE: A lot of changes he's watching. There's a longer fire season now. The lake we were standing on, it used to freeze. There was ice skating back in the day but no longer. And he is certain about what's happening.\nFAGRE: From a science standpoint, it's really clear. It's human caused to a large degree and that it is happening more and more quickly.\nGREENE: Now, down the road from this lake, we pulled into another place that is named for the glaciers, the Glacier Bible Camp. And we found Zella Whitter, who works there. She's been in this community most of her life, cares about it as deeply as anyone. She is worried about those glaciers but...\nZELLA WHITTER: I guess I have a different take on it because, I mean, we had an ice age and weather evolves. But I also know that God's in control and whatever is going to happen is going to happen.\nGREENE: And when we asked her about the election...\nWHITTER: I put my faith in Christ. I don't put in politicians because politicians will let you down.\nGREENE: David Parker, let me bring you back here. Two starkly different views in a state where the environment is so, so important - what do we take from that?\nPARKER: Well, one of the things I think listeners need to realize is that Westerners see the effects of climate change. And perhaps more than most places, we have to deal with those effects in our daily lives. This is an extreme place. We are a dry state, the fifth driest in the country, and a low snowfall effects us throughout the year, right? It effects our water supply. It effects our fire season.\nAnd the problem with climate change - and I think this is why it's so difficult - is that while we experience its effects, it is so big as an idea that many of us have trouble wrapping our heads around it. And it's really hard to think of ways that we can solve the problem or make a difference. It's just - it's overwhelming.\nGREENE: And sometime - I mean, so overwhelming you really don't know where necessarily to kind of explain it. I mean, obviously a lot of people listen to scientists and they make an incredibly compelling case, but she really struggles with that.\nPARKER: Yeah, it is very, very difficult but certainly we here in Montana see the effects when it comes to fishing. Warmer water hurts the trout. And certainly those fire seasons, last summer in Bozeman in August, it was difficult to run or be outside.\nGREENE: Let me bring in another voice here. I met Kelsey Moates-Conners along the river right near Glacier. And she pulled up in her pickup with her two dogs who were jumping around the bed of the truck. They were desperate for a swim.\nKELSEY MOATES-CONNERS: I am a wedding planner\nGREENE: Oh, cool.\nMOATES-CONNERS: Yeah, so I have a wedding...\nGREENE: This is an ugly place to get married, I'm sure this is not...\nMOATES-CONNERS: I know.\nGREENE: ...Attractive at all.\nMOATES-CONNERS: Nobody wants to get married with these, like, stunning mountain backdrops.\nGREENE: Now, just think about this - if August is sweltering, if there is a forest fire, a couple postpones a wedding, it's a huge hit on Kelsey's business, which she runs by herself. And she said she would love to hear a candidate talk about protections for her, like maybe more accessible insurance for small businesses operating in risky environments.\nMOATES-CONNERS: It's more than sort of saddling yourself up with a candidate who believes in climate change or who is passionate about climate change. But I think it's a little bit more complicated in terms of, you know, like, how do you balance out regulations that will help slow down climate change while also allowing small businesses to not be, you know, totally buried.\nGREENE: So she votes generally for Democrats but she's open to Republicans who support small businesses. And let's hear from a Republican who seems to fit that mold. Her name's Becky Beard. She's a first-time politician. She runs her own business. She does grant writing for local governments and now she wants to serve herself. She's running for a House seat in the Montana legislation. And we met her at a park right here in Bozeman.\nDo you really have a blanket there? We can sit in the park...\nBECKY BEARD: I'm a former...\nGREENE: ...On the blanket?\nBEARD: I'm a former Girl Scout leader...\nGREENE: Oh, wow.\nBEARD: ...Yeah, I have a blanket.\nGREENE: That's perfect.\nSo Becky Beard - not convinced by the science on climate change.\nBEARD: It's not all man-made. It is a cyclical thing throughout the millennia.\nGREENE: She is convinced that she's the kind of leader, if elected, who could help Kelsey and her wedding business.\nWhat would you tell someone like her?\nBEARD: OK. I would tell her think about a Republican like me because the more we talk to each other the more we can see that we are working toward a balance.\nGREENE: You said tell her that she should talk to Republican like you.\nGREENE: Yes, because I am not a party Republican. I'm not a moderate Republican. I'm not an overt conservative Republican. I'm not a tea party. I am all of the above.\nGREENE: Are you a Republican like Donald Trump?\nBEARD: I wish I could say I was. I like that he's not politically correct. I like that about him. We need a shakeup.\nGREENE: Let me bring back David Parker here from Montana State. Does a Republican like Becky Beard stand a chance of capturing a young voter like Kelsey who owns a business, cares about the environment?\nPARKER: You have to understand the first thing about Montanans is they're independent, so they split their tickets more than any other place in the country. Now, many of my college students would say they're Republicans, but they feel pulled in these two different directions. One, they worry about making it here. It's hard to make it here, and many young people do leave the state to get jobs elsewhere. And one of our gubernatorial candidates is talking about that.\nAt the other time, the other force is that they're socially liberal. So they support gay marriage, they tend to be pro-choice, and they think climate change is a problem. And the GOP, in that respect, feels out of touch to them.\nGREENE: All right. That's David Parker from Montana State with us here at the Feed Cafe in Bozeman. And here's a little more from Montana singer-songwriter Jenn Adams.\nJENN ADAMS: (Singing) Well, I am driving to the mountains. Don't even ask to slow me down. The Kansas plains...\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=476993975"}
