{"authors":["Mariella Mosthof"],"date_download":"2018-10-31 01:52:00","date_modify":"2018-10-31 01:52:00","date_publish":"2018-09-13 21:11:42","description":"Being a queer professional in a very straight workforce is always fraught. From figuring out your \"work drag\" to patiently explaining to your outreach team why an office blood drive is hella discriminatory against its queer employees, queer laborers…","filename":"data/vaneerConsumption/GlassdoorsLGBTQWorkplaceGuideIsFullOfAdviceForQueerEmployees.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/3b1e4192-1662-40fd-a3b2-3c415d74b750-fotolia_167777217_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_glassdoors-lgbtq-workplace-guide-is-full-of-advice-for-queer-employees-11782065_1540950720.html","title":"Glassdoor's LGBTQ+ Workplace Guide Is Full Of Advice For Queer Employees","title_page":"Glassdoor's LGBTQ+ Workplace Guide Is Full Of Advice For Queer Employees","title_rss":"NULL","source_domain":"bustle.com","text":"Being a queer professional in a very straight workforce is always fraught. From figuring out your \"work drag\" to patiently explaining to your outreach team why an office blood drive is hella discriminatory against its queer employees, queer laborers face a host of exhausting challenges that their straight, cisgender colleagues simply don't have to worry about. So it's a huge deal that Glassdoor recently published its first ever LGBTQ Workplace Guide with meaningful advice for how queer employees can better navigate their careers while remaining authentic to themselves.\nAs Erin Uritus, CEO of queer workplace equality nonprofit Out & Equal, notes in the guide, \"Twenty percent of millennials identify as LGBTQ. That's going to be 75 percent of the workplace by 2025.\" So the good news is, queer employees are literally taking over the workforce and the tide of discrimination they've historically faced will hopefully turn as a result. In the meantime, Glassdoor's guide, compiled by Andy Talajkowski, a writer for its blog, offers useful tips, from the interview process to when its time to quit working in a harmful environment. And although it's nice to see the challenges of queer employees centered, the onus for overhauling workplace culture is, of course, not on its most marginalized group.\n\"We’ve also created a supplemental employer guide that helps empower employers and company leaders to create welcoming environments for everyone,\" a rep for Glassdoor tells Bustle, \"and improve workplace culture within your company if there are areas that should be improved.\"\nThe Workplace Guide For LGBTQ Professionals acknowledges that it's up to individuals to decide whether or not they want to be out at work. But for those who do, it suggests showing up to the very first interview presenting as the person you're most comfortable as. \"Softening\" your look or your values to get the job only means you'll have to continue \"faking it\" in the workplace, as one queer employee quoted in the guide points out. It's better, she argues, to leverage a company's discomfort with your identity as a useful filtering mechanism to suggest that you may not be happy working there.\nOther red flags that a workplace may not be queer friendly, according to the guide, include a bad gut feeling during your interview process, lack of diversity in the company's employee ranks, cringey social media posts by management, a low-ball salary offer, a lack of inclusive benefits (such as transition health care or fertility benefits regardless of an infertility diagnosis), and an overworked staff. Queer folks have been conditioned by a lifetime of hostility toward their identities to ignore their intuition when they're being mistreated, but it's actually a useful tool for ending up on a more sustainable career path.\nThe guide also encourages queer employees to cultivate a strong support network of fellow queers in their field, both inside and outside the workplace, for solidarity in navigating thorny issues. It can be hard to identify what constitutes discrimination in the workplace when it feels so \"normal\" to be discriminated against, but queer workers have a right to hold their employers accountable. The guide outlines things like being overlooked for promotions, being written up or fired for no clear reason, being treated differently after coming out, and being misgendered as valid discrimination complaints to bring up with HR.\nHowever, it's important to keep in mind that the purpose of HR is to protect the company — not employees. If your company doesn't actively and inclusively acknowledge the LGBTQ+ community in its workplace policies or social outreach, it's possible that they simply won't be educated or competent enough to handle your valid discrimination complaint. And as queer employees are all too aware, that frequently means punishment for or retaliation against coming forward.\n\"You may not be able to find an effective resolution to your concerns within the organization,\" the guide states, and in that case, \"You might want to consider looking for a more inclusive employer.\"\nBut you don't have to let a problematic employer off the hook, even if you move to a more inclusive company. The guide includes links to several organizations that can help with discrimination cases, like Lambda Legal, the ACLU's LGBTQ Rights Division, Out & Equal, and the Equal Employment Opportunity Commission. Glassdoor's rep adds, \"If faced with discrimination at work, LGBTQ professionals should know they’re not alone. There are a lot of external resources and organizations that exist to help workers who may have experienced workplace discrimination.\"","url":"https://www.bustle.com/p/glassdoors-lgbtq-workplace-guide-is-full-of-advice-for-queer-employees-11782065"}
