{"authors":["Georgette Eva"],"date_download":"2018-10-30 23:21:40","date_modify":"2018-10-30 23:21:40","date_publish":"2014-08-13 19:41:54","description":"When she isn’t Beyoncé’s shoulder to cry on or when she isn’t too busy pep talking to water, the Oscar-award winning actress might be spending more time back at William McKinley High School, because the gossip around the teacher’s lounge is that…","filename":"data/vaneerConsumption/GleeSeason6NeedsaGwynethPaltrowBradFalchukEpisodeFeaturingChrisMartin.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d2ffd84c-ff4a-44cc-9648-fdf6c415cc2a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35652-glee-season-6-needs-a-gwyneth-paltrow-brad-falchuk-episode-featuring-chris-martin_1540941700.html","title":"'Glee' Season 6 Needs a Gwyneth Paltrow & Brad Falchuk Episode - Featuring Chris Martin","title_page":"'Glee' Season 6 Needs a Gwyneth Paltrow & Brad Falchuk Episode — Featuring Chris Martin","title_rss":"NULL","source_domain":"bustle.com","text":"When she isn’t Beyoncé’s shoulder to cry on or when she isn’t too busy pep talking to water, the Oscar-award winning actress might be spending more time back at William McKinley High School, because the gossip around the teacher’s lounge is that Gwyneth Paltrow is reportedly dating Glee co-creator Brad Falchuk. According to Us Weekly, “things started off professionally” between the two — which makes sense seeing as Paltrow was a popular returning guest star, even winning an Emmy for her role as sexy, fun substitute teacher Holly Holliday. It’s not official, but rumors began when Paltrow and Falchuk were seen on a dinner date in Los Angeles. Of course, it could just be a meal between two past co-workers, but since the actress and mother of two split from rocker husband Chris Martin in March, of course there will be whispers around the school.\nThen again maybe Paltrow and Falchuk are just working on a new episode for the final season of Glee, and seeing as the Goop editor is involved, the episode can either deal with comparing kale salad recipes or perhaps deal with an entire plot dedicated to conscious uncoupling? Paltrow was the one who coined the phrase when she and Martin chose to amicably separate, and for a show that’s as current as Glee it would make sense to jab at 2014 vernacular, especially seeing as we probably won’t see the next generation glee club members Marley, Jacob, Ryder, Kitty, and Unique. I can see the 2.0-ers doing some sort of farewell with Gloria Gaynor’s “I Will Survive”.\nOther songs for the consciously uncoupled episode of Glee could include:\nAlanis Morissette’s \"You Learn\" sung by Rachel Berry\nBackstreet Boys \"All I Have to Give\" sung by Kurt\nBarenaked Ladies \"It’s All Been Done\" sung by the ensemble\nFrank Sinatra’s “My Way” sung by Mr. Shuester\nBut more importantly, and because it only seems right to give Paltrow's consciously uncoupled partner and Coldplay lead a part, Martin can do his single \"Emotional Objects with Chris Martin.\" It technically wasn't part of his band's repertoire, but hey, as the iHeartRadio video explains, Martin does have a voice that can make things that aren't really emotional, feel emotional. He takes everyday objects like an old shoe, and old banana, and the saddest of tale of all, a Blackberry and makes us feel deep squishy feels.\niHeartRadio on YouTube\nFine maybe not that song exactly, but hey if anyone was going to add his vocal stylings to a completely made-up Glee episode of my design, it would be Martin. I mean, I really loved his \"Emotional Objects with Chris Martin,\" and I think he could do a lot with everyday objects in the classrooms of McKinley or even the streets of New York (though rumor has it the final season won't be in either). In fact, I'd love to see what Martin could do with the everyday objects found at a dinner table between — and I'm just spitballing here — his ex and her new date slash TV producer. It would be super emotional to say the least.\nImages: Giphy","url":"https://www.bustle.com/articles/35652-glee-season-6-needs-a-gwyneth-paltrow-brad-falchuk-episode-featuring-chris-martin"}
