{"authors":["Ben Shapiro"],"date_download":"2018-10-30 18:17:09","date_modify":"2018-10-30 18:17:09","date_publish":"2015-01-24 01:07:34","description":"On Thursday, President Barack Obama sat down with YouTube sensation GloZell Green.","filename":"data/vaneerConsumption/GloBamaGoesFullTroll.json","image_url":"https://media.breitbart.com/media/2015/01/obama-glozell.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_23__1540923429.html","title":"GloBama Goes Full Troll","title_page":"GloBama Goes Full Troll | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday, President Barack Obama sat down with YouTube sensation GloZell Green – she of the bathing in Froot Loops and the cinnamon challenge – to discuss issues ranging from SportsCenter (Obama’s favorite pastime) to the “po-po” (GloZell’s terminology).\nThe same day, the White House announced that it would not be hosting Israeli Prime Minister Benjamin Netanyahu after Netanyahu accepted an invitation from Speaker of the House John Boehner to address a joint session of Congress.\nHe’s got a busy schedule, after all.\nThis president is a mockery. Even as Obama tete-a-teted with GloZell over the Castro brothers putting the “dick in dictatorship,” he had nothing of substance to say about the Iranian takeover of Yemen. That’s no surprise. The same man who skipped the rally for free speech in Paris because he was too busy watching NFL games, who performed interviews with Pimp With a Limp and “Between Two Ferns” but was nowhere to be found as our consulate burned in Benghazi, who made sure to comment on the death of Robin Williams but not Chris Kyle – that man has his priorities straight.\nAnd make no mistake: Obama has priorities. They’re just a parody of actual priorities.\nObama’s top priority at this point: troll hard, troll often.\nDuring his State of the Union address, Obama set his troll knob to 11. After bloviating about his desire for bipartisanship, Obama lectured Republicans about engaging in a “better politics” in which “we debate with demonizing each other.” Then, when Republicans clapped at his announcement that he had run his last campaign, he asserted with hurricane-level smugness, “I know because I won both of ‘em.”\nIn that same State of the Union address, Obama trolled America with a story about two honest young Americans trying to scrape by with young children – and neglected to mention that one of them was a campaign chief for Democrat Senator Patty Murray of Washington. He also made sure to mention transgenders but ignore al Qaeda, pretend sanctions against Russia have been wildly successful and that ISIS was on the run, and most of all, claim that negotiations with Iran were working.\nAnd when it comes to Iran and Israel, Obama’s trollery enters an entirely new domain. For the Obama administration to chafe at Netanyahu’s visit is the height of irony. The Obama administration leaked to favored hard-left Israeli newspaper Ha’aretz that it was fighting mad at Netanyahu: “He spat in our face publicly and that’s no way to behave. Netanyahu ought to remember that President Obama has a year and a half left to his presidency, and that there will be a price.”\nThis comes from the exact same Obama administration that once publicly labeled Netanyahu “chickens***.” It comes from the same president who said just three days ago in his State of the Union address that he would veto any harsher sanctions on Iran, prompting even fellow Democrat Bob Menendez of New Jersey to blast Obama’s “talking points straight out of Tehran.”\nTo cast Obama as an attention-seeking troll doesn’t do justice to his full-blown Cave Trollery. Obama makes a conspicuous point of slapping our allies in the face, siding with our enemies, and making time for the dumbest among us even while pretending to uphold the sanctity of the presidency. Remember when Obama was going to return dignity to the Oval Office? For GloBama, the time for dignity is past.\nBen Shapiro is Senior Editor-At-Large of Breitbart News and author of the new book, The People vs. Barack Obama: The Criminal Case Against The Obama Administration (Threshold Editions, June 10, 2014). He is also Editor-in-Chief of TruthRevolt.org. Follow Ben Shapiro on Twitter @benshapiro.","url":"https://www.breitbart.com/politics/2015/01/23/globama-goes-full-troll/"}
