{"authors":["Associated Press"],"date_download":"2018-10-22 23:36:22","date_modify":"2018-10-22 23:36:22","date_publish":"2017-04-26 08:20:38","description":"SEOUL, South Korea (AP) - Shares were mixed in Europe on Thursday after another day of gains in Asia as investors awaited U.S. President Donald Trump's...","filename":"data/vaneerConsumption/GlobalstocksmixedasinvestorsawaitTrumptaxcutplan.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/10/wire-464205-1493198748-461_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446608_Asian-stocks-climb-hopes-US-tax-cuts-budget-deal_1540251382.html","title":"Global stocks mixed as investors await Trump tax cut plan","title_page":"Global stocks mixed as investors await Trump tax cut plan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - Shares were mixed in Europe on Thursday after another day of gains in Asia as investors awaited U.S. President Donald Trump's announcement on tax cuts that could give a boost to U.S. companies and household spending.\nKEEPING SCORE: Britain's FTSE 100 lost 0.1 percent to 7,272.31 while France's CAC 40 added 0.1 percent to 5,283.04. Germany's DAX was steady at 12,463.31. Wall Street looked set for a tepid start, with Dow futures up 0.1 percent and S&P futures down less than 0.1 percent.\nU.S. TAX REFORM: Trump plans to reveal details of big tax cuts for businesses later Wednesday as part of a sweeping overhaul of the tax system. White House officials said the plan would reduce the top corporate income tax rate from to 15 percent from 35 percent. Expectations businesses will pay lower taxes have been boosting share prices since late last year.\nA currency trader watches monitors near screens showing the foreign exchange rates at the foreign exchange dealing room in Seoul, South Korea, Wednesday, April 26, 2017. Asian stocks marched higher on Wednesday as expectations for the impending tax cuts by U.S. President Donald Trump and the record-breaking gains overnight on Wall Street boosted investor sentiment. (AP Photo/Lee Jin-man)\nANALYST'S VIEWPOINT: \"In spite of concerns that the Trump administration will be unable to deliver his fiscal stimulus promises any time soon, many investors remain hopeful of future reforms, particularly after the White House signaled this week that it plans to introduce legislation aimed at reducing the corporate tax rate,\" said Margaret Yang, a market analyst at CMC Markets Singapore. Investors expect the tax cuts would improve U.S. companies' profitability and encourage household spending, Yang said.\nASIA'S DAY: Japan's Nikkei 225 jumped 1.1 percent to 19,289.43 and South Korea's Kospi rose 0.5 percent to 2,207.84. Hong Kong's Hang Seng index advanced 0.5 percent to 24,578.43 and the Shanghai Composite Index was up 0.2 percent to 3,140.85. Australia's S&P/ASX 200 rose 0.7 percent to 5,912.00. Stocks in Taiwan, Singapore and Indonesia were also higher.\nOIL: Benchmark U.S. crude oil lost 14 cents to $49.42 per barrel in electronic trading on the New York Mercantile Exchange. The contract rose 33 cents to $49.56 per barrel on Tuesday. Brent crude, which is used to price international oils, fell 13 cents to $52.44 per barrel in London.\nCURRENCIES: The euro fell to $1.0902 from $1.0930 while the dollar rose to 111.19 yen from 111.09 yen.\nA currency trader walks by a screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room in Seoul, South Korea, Wednesday, April 26, 2017. Asian stocks marched higher on Wednesday as expectations for the impending tax cuts by U.S. President Donald Trump and the record-breaking gains overnight on Wall Street boosted investor sentiment. (AP Photo/Lee Jin-man)\nA man looks at an electronic stock board showing Japan's Nikkei 225 index at a securities firm in Tokyo, Wednesday, April 26, 2017. (AP Photo/Eugene Hoshiko)\nA currency trader talks on the phone near screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at the foreign exchange dealing room in Seoul, South Korea, Wednesday, April 26, 2017. Asian stocks marched higher on Wednesday as expectations for the impending tax cuts by U.S. President Donald Trump and the record-breaking gains overnight on Wall Street boosted investor sentiment. (AP Photo/Lee Jin-man)\nA woman walks past an electronic stock board showing Japan's Nikkei 225 index at a securities firm in Tokyo, Wednesday, April 26, 2017. Asian stocks marched higher on Wednesday as expectations for the impending tax cuts by U.S. President Donald Trump and the record-breaking gains overnight on Wall Street boosted investor sentiment. (AP Photo/Eugene Hoshiko)\nA man runs past an electronic stock board showing Japan's Nikkei 225 index at a securities firm in Tokyo, Wednesday, April 26, 2017. Asian stocks marched higher on Wednesday as expectations for the impending tax cuts by U.S. President Donald Trump and the record-breaking gains overnight on Wall Street boosted investor sentiment. (AP Photo/Eugene Hoshiko)\nMen walk past an electronic stock board showing Japan's Nikkei 225 index at a securities firm in Tokyo, Wednesday, April 26, 2017. Asian stocks marched higher on Wednesday as expectations for the impending tax cuts by U.S. President Donald Trump and the record-breaking gains overnight on Wall Street boosted investor sentiment. (AP Photo/Eugene Hoshiko)","url":"https://www.dailymail.co.uk/wires/ap/article-4446608/Asian-stocks-climb-hopes-US-tax-cuts-budget-deal.html"}
