{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:17:34","date_modify":"2018-10-30 19:17:34","date_publish":"2016-10-14 19:15:25","description":"Gloria Allred, the lawyer who appeared Friday with Summer Zervos was also a Hillary Clinton delegate to the Democratic National Convention.","filename":"data/vaneerConsumption/GloriaAllredWasHillarysDelegateatDemocraticConvention.json","image_url":"https://media.breitbart.com/media/2016/10/IMG_2425.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_14__1540927054.html","title":"Gloria Allred Was Hillary's Delegate at Democratic Convention","title_page":"Gloria Allred Was Hillary's Delegate at Democratic Convention","title_rss":"NULL","source_domain":"breitbart.com","text":"Gloria Allred, the lawyer who appeared Friday with Summer Zervos, the newest woman to claim she was the victim of inappropriate sexual conduct by Republican presidential nominee Donald Trump, was also a Hillary Clinton delegate to the Democratic National Convention in Philadelphia in July.\nAllred was an elected delegate, representing the majestic beachfront-and-mountainside community of Pacific Palisades, in Los Angeles, home to many Hollywood A-listers.\nBreitbart News spoke with Allred informally at the convention as she took up her seat on the night Hillary Clinton formally accepted her party’s nomination, becoming the first female candidate of a major political party in the United States to do so.\nAllred frequently appears alongside women who are seeking legal action or public vindication against those, primarily men, who are alleged to have behaved inappropriately toward them.\nShe is also a committed Democrat — though in 2011, Allred also represented a woman who claimed to have had a relationship with then-Rep. Anthony Weiner (D-NY).\nAllred has targeted Republicans frequently in past election years with similar press conferences, including Meg Whitman, who ran for governor in California in 2010, and whom Allred accused of abusing a domestic employee who was in the country illegally.\nIt is not clear why Zervos would have needed to use Allred to present her allegations, which concern Trump’s behavior on the set of The Apprentice, the reality television show Trump hosted and on which Zervos was a contestant.\nIt is also unclear whether Allred can distinguish in this case between her role as a lawyer, and her role as a political operative — and elected delegate — on behalf of Hillary Clinton’s presidential campaign.\nFederal Election Commission records indicate that Allred also gave Clinton a $2700 contribution, the maximum allowable individual amount.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2016/10/14/gloria-allred-hillary-clinton-delegate-democratic-convention/"}
