{"authors":["Kara Manke"],"date_download":"2018-10-23 00:53:02","date_modify":"2018-10-23 00:53:02","date_publish":"2014-08-07 00:00:00","description":"It's not always easy for people with celiac disease to find gluten-free food. And it's even harder for lower-income people with the disease who rely on food pantries to help them fill their bellies.","filename":"data/vaneerConsumption/GlutenFreeFoodBanksBridgeCeliacDiseaseAndHunger.json","image_url":"https://media.npr.org/assets/img/2014/08/07/gluten-free-1_wide-a1b4c8afdc5ea207dd9ac674e739317f99678062.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2014_08_07_338593844_gluten-free-food-banks-bridge-celiac-disease-and-hunger_1540255982.html","title":"Gluten-Free Food Banks Bridge Celiac Disease And Hunger","title_page":"Gluten-Free Food Banks Bridge Celiac Disease And Hunger : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Gluten-Free Food Banks Bridge Celiac Disease And Hunger\ntoggle caption Courtesy of Pierce's Pantry\nFor people with celiac disease, eating gluten-free can be a struggle. But it's even harder for those who aren't always sure where their next meal will come from.\nTwo grass-roots organizations, Pierce's Pantry in Massachusetts and the National Gluten-Free Food Bank Movement in Denver, are working to help those people who are trapped between celiac disease and hunger. They're reaching out to food pantries to help them better serve their gluten-free clients by supplying more options and teaching pantries to identify and sort the gluten-free donations that they already have.\nThough both organizations are focused on serving their local communities, they hope that more people around the country soon recognize the importance of meeting the needs of this population. Of course, no one really knows how many people with Celiac need food assistance, because no one is collecting the data.\nBut with the abundance of gluten-free foods these days, and new FDA labeling guidelines that should make gluten-free food easier to identify, they say solving this problem is primarily a matter of education.\nGail Sawyer of Acton, Mass., is one of the estimated 2 to 3 million Americans afflicted with celiac disease. She receives food stamps and says she regularly has to supplement these SNAP benefits with food from a pantry.\nFor a long time, she had difficulty finding enough food there she could actually eat.\n\"You'd walk away with two potatoes, maybe a tomato, a couple of carrots, if you were lucky you could find a canned chicken,\" she says. \"It got to the point where it was almost not worth going to the food pantry because at that point there was nothing that I could have.\"\nPart of the problem is that many packaged foods — like soups and salad dressings that don't contain wheat — can contain starches or flavorings that have gluten. And other cheap staples, like oats, can often be contaminated with gluten because of where they're manufactured.\nEnlarge this image toggle caption Courtesy of Dee Valdez/The National Gluten-Free Food Bank Movement Courtesy of Dee Valdez/The National Gluten-Free Food Bank Movement\n\"Gluten really is in a lot of things — a lot of things you wouldn't think it was in,\" Sawyer says.\nPierce's Pantry now supplies gluten-free staples like breads, pastas and cereals to the Acton Community Supper and Food Pantry, where Sawyer goes. \"Now I can walk away with a grocery bag or two of food,\" she says.\nTracy Keegan, who manages Pierce's Pantry, says that she gets calls all the time from people who have celiac disease and can't find the food they need at pantries.\n\"Because there are so few people out there doing this right now, I actually hear from people from across the country,\" says Keegan. \"They email from Chicago, from California, from Florida, from Texas, asking 'Hi, I'm hungry, where do I get help?' \"\nCurrently, Pierce's Pantry only serves food pantries in Massachusetts. Keegan says she would love to expand the model nationally, but it is challenging given the inherently local nature of food distribution. So she and her son Pierce have created an instructional video on how to start a gluten-free food bank — to help people meet the needs of their own communities.\nDee Valdez, who started the National Gluten-Free Food Bank Movement in Denver in 2009, says she also receives calls from people from across the country.\n\"At least once a month I get a request from an individual or food bank who needs gluten-free food, and the food bank doesn't know how to deal with it,\" says Valdez.\nAccording to Valdez, the problem isn't necessarily a lack of gluten-free options coming into pantries, but a lack of awareness and organization.\n\"When food gets donated to a large food bank or to a local pantry, most people don't have anything in place to sort or store it,\" she says. \"[Gluten-free food] gets mixed in with everything else and isn't distributed to people who really need it.\"\nWhen a pantry calls asking for help, she says the first thing she does is teach the workers how to read labels and pick out which foods would be suitable for clients with celiac disease.\n\"Gluten-free food is two to three times more expensive,\" she says, \"so it is a pretty big loss when it doesn't go to the right family.\"\nRoss Fraser, a spokesman for Feeding America, a national organization that provides food to pantries and soup kitchens, says that while it is working to bring more healthful, naturally gluten-free foods to pantries, it has not received many requests to address the issue of gluten- or allergen-free food on a national level. They are aware that some pantries are addressing it on a case-by-case basis.\nThis is in line with Sawyer's experience. Sometimes she goes to a different pantry that does not have a dedicated gluten-free section. And while pantry workers are happy to set gluten-free things aside for her, she says it is still a process of education.\n\"I'll go, 'Hey, that's gluten-free,' and they'll look at it and say, 'Oh, that's another thing for us to start checking for,' \" says Sawyer. \"So it's kind of like we're teaching them — as celiacs we're teaching the pantry that this is gluten-free.\"","url":"https://www.npr.org/sections/thesalt/2014/08/07/338593844/gluten-free-food-banks-bridge-celiac-disease-and-hunger"}
