{"authors":[],"date_download":"2018-10-30 20:49:48","date_modify":"2018-10-30 20:49:48","date_publish":"2018-09-10 10:00:00","description":"Despite the GBI's findings, an Atlanta columnist thinks Georgia police facilitated a crazed cop's ability to murder his estranged wife and her friend.","filename":"data/vaneerConsumption/GlynnCountypoliceinactionnotactionablein2murders.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/10/Images/newsEngin.22903134_Robert-Cliffton-Sasser-051518.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-law-_642980b575b65d46f40cd908496ffff1__1540932588.html","title":"Glynn County police inaction not actionable in 2 murders?","title_page":"Glynn County police inaction not actionable in 2 murders? | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"An intense GBI investigation found no evidence that a murderous Glynn County cop got help from colleagues in tracking down his estranged wife and her boyfriend.\nBut the voluminous investigative file indicates the justice system there totally failed the doomed woman who had repeatedly — and desperately — warned officials that her husband, Lt. Robert “Cory” Sasser, was a menace. In fact, it was like law enforcement officials there worked hard with their inaction to let him remain free.\nOn the night of June 28, Sasser used a shotgun he bought that day to kill his wife, Katie Kettles, and her new boyfriend, John Hall Jr., at Hall’s home in Darien.\nIn doing so, the deranged Sasser made good on a threat he allegedly made two nights earlier at a Brunswick pizza joint, where he saw Kettles and Hall. Sasser had court orders to stay away from her. Still, he showed up at the restaurant and glared at the couple for perhaps 20 minutes. Then he allegedly used his thumb and index finger as a pretend gun to point it at Hall.\nBrunswick District Attorney Jackie Johnson, whose office missed previous chances to corral the cop, said in a statement: “Sasser admittedly made a hand gesture while at (the pizza place), but it is unclear as to whether it was a shooting gesture and whether it was directed at either Hall or Katie.”\nActually, three people, including Hall, told police that Sasser made the gesture. Still, they somehow determined there was no way to arrest a man who was out on bond who had orders to stay away from his wife.\nMind you, Sasser was an emotional — and certifiable — mess. Everyone in law enforcement there knew it. Sasser is one of two cops who gained infamy in the 2010 shooting death of Caroline Small, an unarmed mother who led police in a slow-speed chase and was finally hemmed in by police cars.\nIt was as blatant a case of unjustifiable police homicide as you’ll see, but DA Johnson did nothing to bring justice in that case. In fact, GBI agents who investigated it were angered by the resistance to address it. Sasser was not charged with anything and even thrived, getting promoted to lieutenant. According to testimony, he earned $130,000 last year.\nThis year, Sasser and his wife separated. On May 13, he went to her home and found Hall in the living room. Sasser threatened to kill them. She called cops and they pulled him away from the door. He was let go and arrested a couple of days later.\nOn May 17, learning his wife would divorce him, Sasser got in an armed standoff with his fellow cops, threatening suicide and ultimately kicking two responders in the groin. He was charged with felonies but was again bonded out after a short stint in a psychiatric facility. If you or I pull that, we’re still sweating it out in the slammer.\nHe was supposed to stay out of Glynn County, steer clear of his wife and keep away from guns. He said he’d do that, Scout’s honor.\nHe returned to attend a court hearing on his divorce on June 26. Sasser rode an emotional roller coaster, alleging that the county was persecuting him to get him fired, that the Caroline Small case was at the bottom of his troubles, and that his wife was doing him wrong. The judge upped his child payments and would not allow him to visit his 8-year-old son without supervision.\nHours later, he walked into the pizza place, put in an order and stayed for 20 minutes, stewing and glaring at his wife. He then made the finger/gun threat. Freaked out, Kettles called the cops.\nSasser, being a cop, suspected what would happen and immediately called several comrades to tell his version of the story and ask if he was going to be arrested. The visit to the restaurant was happenstance, he said. Oh, yeah, he added, he might have waved at someone at the restaurant.\nRELATED: Torpy at Large: Murderous cop’s law-and-order enablers\nRELATED: Torpy at Large: Something stinks in Brunswick\nOfficers interviewed Kettles at her home, and spoke with others at the restaurant.\nHall, not trusting the department because of previous inaction, asked to be interviewed at his lawyer’s office. During the interview with Detective Stephanie Oliver, Hall said he feared for his and Kettles’ safety.\nOliver secretly recorded the interview. Interestingly, when she was interviewed later by the GBI, Oliver asked that it not be recorded.\nAccording to the GBI report:\n• Oliver said she called the magistrate judge (who earlier allowed Sasser to bond out) about the complaint against Sasser.\n• She said he told her to call CSRA, the private probation firm overseeing Sasser.\n• Oliver did so and believed CSRA would call the district attorney.\n• A probation officer called the district attorney’s office, which had earlier asked to be removed from the Sasser case. “DA’s office was to be conflicted out and did not know which office was taking control, holding pattern until court date could be scheduled if warrants were to be issued,” the probation officer wrote.\n• On June 27, Oliver interviewed a man who was at the pizza place the previous night and said he saw Sasser’s threat. He was the third person to do so, the other being a restaurant manager and Hall.\n• On June 28, Oliver ran into the probation worker at court. The probation worker told her they couldn’t revoke bond unless new charges were filed.\n• The detective conferred with Capt. Tom Jump. “They came to the conclusion there was not enough to substantiate new charges,” the GBI report states.\n• Despite that, CSRA said they still might try to revoke bond. But they were waiting for the police report.\nDuring this time, June 27-28, Sasser bought a new truck. And a shotgun. He drove on an odyssey that took him to Florida, Alabama, and Savannah, Jesup and Darien, Ga.\nHe was also trying to find out where Hall lived. He called fellow cops, looking for them to run Hall’s info through the computerized law enforcement system. It’s a big no-no for cops to do unauthorized searches. They turned him down. But no one, apparently, told their supervisors that Sasser, now a walking basket case, was doing this.\nLate on June 28, he arrived at Hall’s home. Sasser apparently rang the doorbell and then ambushed Hall in the driveway. Police found three shotgun shells at the scene.\nThen he kicked in the front door, booted in another door upstairs, and killed a terrified Kettles with a single blast.\nMinutes later, an “eerily calm” Sasser called his sister.\n“It’s done,” he told her. “I killed them both.”","url":"https://www.ajc.com/news/local/torpy-large-law-enforcement-dithered-crazed-cop-sought-his-prey/wv6vr936qyuvy6WwI7olBO/"}
