{"authors":[],"date_download":"2018-10-22 21:03:57","date_modify":"2018-10-22 21:03:57","date_publish":"2014-06-04 00:32:13","description":"GM apologized to families of accident victims who have been notified to bring in cars for replacement of defective ignition switches.","filename":"data/vaneerConsumption/GMApologizesforSendingRecallNoticestoVictimsFamilies.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_38/397316/140424-gmearns_0756_d91a79306098efc7f81d87eeaa31c72b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-apologizes-sending-recall-notices-victims-families-n121896_1540242237.html","title":"GM Apologizes for Sending Recall Notices to Victims' Families","title_page":"GM Apologizes for Sending Recall Notices to Victims' Families","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGeneral Motors on Tuesday apologized to families of accident victims who have been notified to bring in cars for replacement of defective ignition switches.\n\"We are deeply sorry to those families who received a recall notice,\" said GM spokesman Greg Martin in response to questions from Reuters.\nGM has recalled 2.6 million of its most popular models to replace a defective switch that it has linked to 13 fatalities. Some families who lost loved ones in fatal crashes have complained that GM should not have sent them notices to bring in cars for repairs.\nTerri DiBattista, who lost her 16-year-old daughter Amber Marie Rose in a 2005 Maryland accident involving a Chevrolet Cobalt, told Reuters she received two recall notices from GM last week asking her to bring in the vehicle to fix the ignition switch and power steering. The car was destroyed when Rose crashed into a tree.\nThe postcards were mailed to the family at its new address in South Carolina, where DiBattista said they moved to recover from the loss. Sent by a local GM dealer, the cards detailed three different recalls GM has issued involving the Cobalt in recent months.\nDiBattista said GM could have identified the destroyed car through a simple check of Vehicle Identification Numbers.\nRose has been identified as one of the 13 victims GM links to the faulty switch.\nFederal regulators now say they believe that GM’s death toll is an undercount. A Reuters analysis of federal crash data found at least 74 people have died in General Motors cars in accidents with some key similarities to those that GM has linked to the defective switches.\nMartin said in an email that GM \"continues to look into all claims we are made aware of in the recall population.\"\n-Reuters","url":"https://www.nbcnews.com/storyline/gm-recall/gm-apologizes-sending-recall-notices-victims-families-n121896"}
