{"authors":["Matthew Debord"],"date_download":"2018-10-30 21:17:20","date_modify":"2018-10-30 21:17:20","date_publish":"2016-12-21 00:00:00","description":"The GMC Acadia Denali has most of the amenities you'd find in a luxury SUV, but it also has an edge.","filename":"data/vaneerConsumption/GMCAcadiaDenaliluxurySUVREVIEW.json","image_url":"https://amp.businessinsider.com/images/5805101bc524021c008b4d51-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_gmc-acadia-denali-luxury-suv-review-2016-12_1540934240.html","title":"GMC Acadia Denali luxury SUV: REVIEW","title_page":"    GMC Acadia Denali luxury SUV: REVIEW - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Serious business. Matthew DeBord/BI The main problem with luxury SUVs is that they're not much good at the \"sport utility\" part of \"sport utility vehicle.\"\nUnless you're talking about purpose-built off-roaders — SUVs from Land Rover or Toyota — the modern premium SUV is a station wagon on steroids. Its core purpose is to haul families, groceries, gear, and pets around the nation's suburban enclaves.\nGMC has been around for a century and has long been thought of as an upscale truck-maker, especially under the Denali subbrand. There are no passenger cars in the GMC portfolio, just pickups and SUVs/crossovers, and the division has lately been making an enviable boast: Its average transaction price is stratospheric for a \"non-luxury\" brand, at $45,000.\nAlmost a third of all GMCs sold are Denalis, which means that GMC is something of money-printing machine inside General Motors.\nAcross the board, however, GMC has a lofty brand promise to live up to: upscale utility. These are trucks and SUVs for the discerning contractor or the demanding rancher. If you want to bust up your truck in fields and streams, then look to Chevy. If you want to get cleaned up for a night on the town once the day's labors are done, check out GMC.\nThis credibility means that GMC SUVs and crossovers in particular can also appeal to Lexus/Acura/BMW/Mercedes/Audi customers who might doubt the ability of, say, a Lexus RX 350 or BMW X3 to get down and dirty.\nWe got the chance to put this all to the test when we recently borrowed a 2017 GMC Acadia Denali with all-wheel drive. This maxed-out mid-size crossover, which shares a platform with the new Cadillac XT5, is stickered at $52,185, with numerous options. It is possible, however, to get a base Acadia for around $30,000.\nHere's what we thought:","url":"https://www.businessinsider.com/gmc-acadia-denali-luxury-suv-review-2016-12"}
