{"authors":[],"date_download":"2018-10-22 22:32:07","date_modify":"2018-10-22 22:32:07","date_publish":"2014-06-10 14:44:42","description":"GM announced last week that 15 workers, including some executives, had been shown the door.","filename":"data/vaneerConsumption/GMCEOMaryBarraDoesntExpectMoreFiringsinIgnitionCrisis.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/498966/140610-mary-barra-jsw-933a_3a9cb3bcd8027911eaaf1bf864a3c1a4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-ceo-mary-barra-doesnt-expect-more-firings-ignition-crisis-n127306_1540247527.html","title":"GM CEO Mary Barra Doesn't Expect More Firings in Ignition Crisis","title_page":"GM CEO Mary Barra Doesn't Expect More Firings in Ignition Crisis","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGeneral Motors CEO Mary Barra said Tuesday that she does not expect the company to fire more employees over defective ignition switches blamed for 13 deaths.\nGM announced last week that 15 workers, including some executives, had been shown the door. It took the company more than a decade to start recalling cars because of the problem. An internal investigation cited a pattern of “misconduct or incompetence.”\n“We feel we’ve taken the appropriate actions as it relates to the ignition switch recall,” Barra told reporters Tuesday at the GM annual meeting.\nShe repeated that the company expects to issue more recalls. GM has recalled 2.6 million cars because they may have bad switches, which can slip out of the on position while the car is on the road, causing a stall.\nBarra and other GM executives took questions from stockholders. Of seven who asked questions, none had significant criticism of how the company handled the matter last week, and most praised Barra’s leadership.\nThe Rev. Jesse Jackson, who called in to urge more minority representation in the company, also gave Barra good marks: “You faced a crisis with integrity and courage and transparency and contrition.”\n— Erin McClam","url":"https://www.nbcnews.com/storyline/gm-recall/gm-ceo-mary-barra-doesnt-expect-more-firings-ignition-crisis-n127306"}
