{"authors":[],"date_download":"2018-10-22 21:23:47","date_modify":"2018-10-22 21:23:47","date_publish":"2014-06-05 11:43:34","description":"CEO Mary Barra is expected to outline a number of steps the company has taken or will take as a result of an internal investigation.","filename":"data/vaneerConsumption/GMCEOTakingSignificantActionsFollowingInvestigation.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/487051/140604-140604-barra2-1136_0be4a308cba4504a503f58e6abc2203d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-ceo-taking-significant-actions-following-investigation-n123266_1540243427.html","title":"GM CEO Taking 'Significant Actions' Following Investigation","title_page":"GM CEO Taking 'Significant Actions' Following Investigation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGM CEO Mary Barra will take \"significant actions\" that include holding specific employees accountable for the ignition switch defect that has plunged the automaker into a crisis.\n\"Mary will not be holding back and will be extremely candid\" sources familiar with the investigation and its conclusions told CNBC.\nThursday morning Barra is expected to outline a number of steps the company has taken or will take as a result of an internal investigation conducted by former U.S. Attorney Anton Valukas.\nSources would not comment on whether those steps include firing employees linked to the defective ignition switch and GM's failure to notify the public and federal investigators about the flawed part. The Wall Street Journal, citing people familiar with the matter, said Valukas' report is not expected to blame Barra or senior management. Instead it will focus on problems with the carmaker's culture.\nGM is expected to announce the dismissal of \"a number of people,\" including the engineer who designed the ignition switch, Raymond DeGiorgio, and some members of the company's legal department, the newspaper said.\nThose familiar with internal probe say Barra will \"not be holding back or glossing over of the facts about what went wrong.\"\nGeneral Motors said 13 deaths and 47 accidents have been linked to 2.6 million models recalled because of defective ignition switches.\nA key part of the investigation into why GM failed to act sooner is whether or not the way in which the automaker is structured contributed to its slow action on safety issues.\nBarra is expected to outline steps to make identifying safety issues a top priority for GM.\nHer approach has been characterized as \"bold and decisive.\"\nShortly before Barra releases the findings of the internal investigation to GM employees she and other top General Motors executives will brief key members of Congress and with the National Highway Traffic Administration.\nTwo committees on Capitol Hill and NHTSA have conducted their own investigations into the GM ignition switch recall.\nBarra promised to keep key players in Washington appraised of the results of the three-month probe.\nDespite a steady flow of damaging headlines and the recall of over 15 million vehicles worldwide, General Motors has weathered the bad news better than many expected.\nEarlier this week, GM announced May sales in the United States climbed 12.6 percent, almost double the growth analysts were forecasting for the month.","url":"https://www.nbcnews.com/storyline/gm-recall/gm-ceo-taking-significant-actions-following-investigation-n123266"}
