{"authors":[],"date_download":"2018-10-22 21:53:57","date_modify":"2018-10-22 21:53:57","date_publish":"2014-06-06 20:38:48","description":"GM on Friday announced four more recalls covering 105,688 cars and trucks globally, a day after it was slapped by an internal investigation.","filename":"data/vaneerConsumption/GMIssues4MoreRecallsDayAfterScathingReport.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_15/314946/140410-gm-nasa-0948_1c32b1bb6d7efd7db21fb0c47665154e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-issues-4-more-recalls-day-after-scathing-report-n124881_1540245237.html","title":"GM Issues 4 More Recalls Day After Scathing Report","title_page":"GM Issues 4 More Recalls Day After Scathing Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGeneral Motors on Friday announced four more recalls covering 105,688 cars and trucks globally, a day after it was slapped by an internal investigation and predicted more recalls were likely.\nGM's 34 recalls so far this year cover almost 13.9 million vehicles in the United States, including 2.6 million older cars with a defective ignition switch linked to at least 13 deaths. Globally, GM has recalled about 15.9 million vehicles. Almost 90,000 of the vehicles recalled on Friday were sold in the United States.\nGM's largest recall on Friday covers 69,552 heavy-duty Chevrolet Silverado and GMC Sierra full-size pickup trucks from model years 2014 and 2015, as well as Chevy Tahoe and Suburban, and GMC Yukon SUVs from model year 2015.\nThe vehicles are being recalled because the base radio may not work, preventing audible warnings if the key is in the ignition when the driver's door is opened, GM said. There also would not be an audible chime if a front seat belt is not buckled. GM said it was not aware of any crashes or injuries related to the possible defect.\nVehicles with this condition would not meet federal standards for theft protection, rollaway protection and occupant crash protection, GM said. Dealers will reprogram the radio control module.\nGM also is recalling 36,012 2012 model Buick Verano, Chevy Camaro, Cruze and Sonic compact cars for a defect that could cause the driver's air bag not to deploy. GM said there was one crash with an injury related to the issue and it is aware of other crashes where air bags did not deploy but it is not known if they were related to this condition.\nGM said it conducted two previous recalls for this issue involving 7,116 of these vehicles with no confirmed crashes in which this issue was involved.\nGM also has two smaller recalls. It is recalling 87 2013-2014 model year Chevy Spark and 2013 Buick Encore vehicles made in South Korea for a possible defect that could prevent the passenger airbag from deploying properly.\nAnd it is recalling 37 2014 model-year Chevy Corvette cars because an internal short-circuit in the sensing and diagnostic module could disable front air bags, seat belt pretensioners and the automatic occupancy sensing module. GM said it is unaware of any crashes or injuries related to the latter two issues.\n-Reuters","url":"https://www.nbcnews.com/storyline/gm-recall/gm-issues-4-more-recalls-day-after-scathing-report-n124881"}
