{"authors":[],"date_download":"2018-10-22 21:59:56","date_modify":"2018-10-22 21:59:56","date_publish":"2014-05-08 19:53:21","description":"In certain 2014 model year Buick LaCrosse and Chevy Malibu sedans, rear brake rotors may have been installed in the front brake assembly.","filename":"data/vaneerConsumption/GMRecallsAbout8500BuickChevyCarsforBrakeProblem.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-recalls-about-8-500-buick-chevy-cars-brake-problem-n100691_1540245596.html","title":"GM Recalls About 8,500 Buick, Chevy Cars for Brake Problem","title_page":"GM Recalls About 8,500 Buick, Chevy Cars for Brake Problem","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGeneral Motors Co. said Thursday it has recalled 8,590 Buick and Chevrolet sedans in North America to address a potential braking problem.\nThe No. 1 U.S. automaker said it recalled certain 2014 model year Buick LaCrosse and Chevy Malibu sedans for possible reduced braking performance because rear brake rotors may have been installed in the front brake assembly, which could shorten the life of the front brake pad and increase the risk of a crash.\nGM said it was unaware of any accidents or injuries related to the issue. It added it expects a very small percentage of the recalled vehicles will contain the front brake assembly misbuild.\nA rear brake rotor is 7 millimeters thinner than a front version by design and over time higher heat generated by the thinner rotors will shorten brake pad life, GM said.\nAffected in the recall were 8,208 cars sold in the United States, 209 in Canada and 173 in Mexico, GM said. Of the recalled cars in the U.S. market, only 1,694 are in consumer hands, with most still at dealers.\nGM said people who have taken delivery of a vehicle that may be affected will be notified by letter and may request a courtesy vehicle until dealers inspect and, if necessary, replace the front brake rotors.\nEarlier this year, GM announced a massive recall of 2.6 million cars over a defective ignition switch related to 13 deaths.\n-Reuters","url":"https://www.nbcnews.com/storyline/gm-recall/gm-recalls-about-8-500-buick-chevy-cars-brake-problem-n100691"}
