{"authors":[],"date_download":"2018-10-22 21:19:34","date_modify":"2018-10-22 21:19:34","date_publish":"2014-05-06 22:41:45","description":"General Motors says the automatic transmission shift levers can show the wrong gear, a problem it's known about for more than two years.","filename":"data/vaneerConsumption/GMRecallsAbout60000SaturnstoFixGearShifts.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_12/271621/140321-gm-wire-ef-1743_a443098c50ce4eca87f4bc517d7ec962.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-recalls-about-60-000-saturns-fix-gear-shifts-n98671_1540243174.html","title":"GM Recalls About 60,000 Saturns to Fix Gear Shifts","title_page":"GM Recalls About 60,000 Saturns to Fix Gear Shifts","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGeneral Motors is recalling nearly 60,000 Saturn Aura midsize cars because the automatic transmission shift levers can show the wrong gear, and it says it has known about the problem for more than two years.\nThe problem, caused by failure of the transmission shift cable, has led to 28 crashes and four injuries but no deaths during the past seven years, GM said in a statement issued Tuesday. The Auras can roll away unexpectedly because the driver may think the car is in \"Park\" when it's in another gear.\nIn November 2011, GM covered the cars with an extended 10-year, 120,000-mile warranty because of the problem. But drivers had to experience trouble with their shifters for the coverage to kick in. At that time, GM thought the extended warranty was sufficient to handle the problem, spokesman Alan Adler said.\nGM is already dealing with the delayed recall of 2.6 million small cars due to a deadly ignition switch problem. Two congressional committees, the Justice Department and National Highway Traffic Safety Administration are investigating how GM handled that problem, which it knew about for at least a decade before deciding to recall the cars in February.\nThis latest recall affects certain Auras from the 2007 and 2008 model years, mostly made in the U.S., with four-speed automatic transmissions. The shift cable can fracture, according to GM. If the problem happens while the car is moving, the gear shift could show the wrong gear, and the driver won't be able to shift into \"Park\" or remove the ignition key.\nGM says it will notify owners and replace the cable and mounting bracket at no cost to owners. GM hasn't determined yet when repair parts will be available.\nThe affected Auras were made between April 24, 2006, and Oct. 31, 2007, GM says. GM stopped making Saturn vehicles in 2009 as it headed into bankruptcy protection.\nGM midsize cars, including some Auras and the nearly identical Chevrolet Malibu and Pontiac G6, were part of a recall of 426,000 cars for a similar problem in 2012. That problem, though, involved the end of the shift cable and not the cable itself.\nNHTSA, the U.S. government's auto safety watchdog, began investigating GM's shifter cables in May 2011, and the investigation remains open, according to agency documents.\n-The Associated Press","url":"https://www.nbcnews.com/storyline/gm-recall/gm-recalls-about-60-000-saturns-fix-gear-shifts-n98671"}
