{"authors":[],"date_download":"2018-10-22 21:32:53","date_modify":"2018-10-22 21:32:53","date_publish":"2014-06-05 18:43:03","description":"Internal investigation says engineer in charge of ignition switch linked to deadly crashes was only person in company who knew it didn't meet specs.","filename":"data/vaneerConsumption/GMReportEngineerApprovedSwitchFromHellEvenThoughItDidntMeetSpecs.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_12/260406/140318-slides-17-gm-ignition-switch-1339_f1afe8b43537c330841954a97984ad02.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_gm-report-engineer-approved-switch-hell-even-though-it-didn-n123791_1540243973.html","title":"GM Report: Engineer Approved 'Switch From Hell' Even Though It Didn't Meet Specs","title_page":"GM Report: Engineer Approved 'Switch From Hell' Even Though It Didn't Meet Specs","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe GM engineer who approved production of a faulty ignition switch implicated in at least 13 deaths was the only person within the company who knew prior to 2013 that the part did not meet manufacturing specifications, according to an internal report released on Thursday.\nThe engineer spent so much time dealing with the part’s technical issues that he referred to it in a 2002 memo as “the switch from hell,” according to the report.\nThe internal report, prepared by former federal prosecutor Anton Valukas, faulted numerous GM employees for failing to “understand or solve the problem,” but it singled out Ray DeGiorgio, the engineer in charge of the faulty ignition switch, for particularly harsh criticism.\nDeGiorgio, it said, approved the part for production in 2002 despite knowing that it did not meet technical specifications and had failed “rotational torque” tests.\n“After interviewing hundreds of witnesses, we have not identified any GM personnel, other than DeGiorgio, who received or reviewed these test results, or knew (prior to 2013) that the Ignition Switch failed to meet the Specification when it was approved for production,” it said.\nIt said DeGiorgio told investigators that he approved production of the switch because no performance issues were brought to his attention during its development and “he had no awareness that the below-specification torque would have an impact on the safe operation of the car.”\nIn some cases, the problem resulted in ignition switches accidentally being turned from “run” to the “accessory” or “off” position while a car was being driven, shutting down power brakes, power steering and airbags. GM’s own figures have linked ignition problems to 13 deaths.\n15 fired, 5 others disciplined\nGM CEO Mary Barra told employees at a town hall meeting earlier Thursday that 15 GM employees had been fired and five others disciplined as a result of the review. She did not identify the fired employees, but sources within the company told NBC News that DeGiorgio, program engineering manager Gary Altman, and safety lawyer William Kemp were among them.\nBarra also said that the internal review found no evidence of a cover-up. Rather, she said, it found a pattern of “misconduct or incompetence” that prevented company officials from linking the faulty ignition switch sooner to deadly crashes that occurred when the cars suddenly stalled on the road.\nDeGiorgio has previously been in the spotlight in the wake of the recall, particularly when Barra was questioned about his role in the mishandling of the ignition switch problem during congressional hearings in April. But the GM report for the first time clarifies the key role he played in approving the faulty part, and how his actions may inadvertently have prevented other GM experts from connecting the dots.\nNBC News has made repeated but unsuccessful attempts to contact DeGiorgio for comment. No one answered the door at his suburban Detroit home on Thursday.\nThe report indicated that rotational torque problems with a prototype of the ignition switch were first noted by a GM engineer two years earlier than previous reported.\nIt said that design release engineer Calvin Wolf told investigators that a “very early” prototype of the ignition switch under development for use in the Saturn Ion had failed tests for “rotational torque values” in 1999 and that he and representatives of the part’s manufacturer, Eaton, had discussed possible fixes for the problem. But Wolf said he was transferred to a different job in another department soon after the meeting and never heard anything more about the issue.\nDeGiorgio, who succeeded Wolf as the lead engineer on the ignition switch, approved production of the part and also later recommended that it be used in a new GM model, the Chevy Cobalt, the report said.\nOfficials with Delphi, which bought Eaton’s switch division in 2001, told congressional staff in March that GM signed off on what’s known as a Production Part Approval Process, or PPAP, document in February 2002 for the switch “even though sample testing of the ignition switch was below the original specifications set by GM.” The company has declined to otherwise comment on the matter.\nThe report noted that another significant but different problem with the ignition switch – occurrences of it not cranking or starting vehicles in cold weather – may have preoccupied DeGiorgio and other engineers and delayed them from addressing reports of the “moving stall” problem.\nThe report cited a 2002 email where DeGiorgio instructed a GM supplier, Delphi, not to immediately change the faulty ignition switch because doing so “would compromise the electrical performance of the switch.” Still, the email stated that changes might be necessary before the ignition switch could be used in the Cobalt, which was scheduled for launch in 2004.\nThe e-mail was signed, “Ray (tired of the switch from hell) DeGiorgio.”\nFollow NBC News Investigations on Twitter and Facebook.\nThe report noted that GM engineers working on the Chevy Cobalt also played a role in the ignition switch problem going undetected, saying they “failed to understand what others at GM already knew: when the ignition switch was inadvertently turned to ‘off’ or the accessory position – by design -- the airbags would not deploy.”\nAs a result of that misunderstanding, it said the engineers categorized the ignition switch problem as a “convenience” issue rather one of safety. Consequently, instead of implementing a solution to the problem, they “debated partial solutions, short-term fixes, and cost,” it said.\nAs NBC News first reported in March, it was DeGiorgio who eventually ordered a design change to the switch in 2006 – the use of a slightly longer version of component known as a “detent plunger” -- aimed at preventing the switch from inadvertently being turned off. But he didn’t instruct the manufacturer to change the part number, which could have led GM to notify existing car owners of the defective switch.\nAn engineer working for an attorney representing the parents of a Georgia woman who died in the crash of a Chevrolet Cobalt found that GM had changed two internal ignition parts to make them bigger. The changes would make a key less likely to slip from the “on” to “accessory” position in the ignition while a vehicle was in motion. McSwain Engineering\nThose actions, the report said, \"prevented investigators for years from learning what had actually taken place.\"\nDeGiorgio testified last year in a wrongful death lawsuit in Georgia that he didn’t remember ordering the change and was, in fact, unaware that it had been made. GM’s report noted that “even today … DeGiorgio claims not to remember doing so.”\nRelated\nGM's Compensation Offer Not Enough, Victim's Father says\nDocuments Show GM Engineer Approved Ignition Switch Change\nWhile DeGiorgio was intimately familiar with the shortcomings of the ignition switch, he said last year when he testified at the wrongful death hearing in Georgia that he never believed they would affect the safety of the vehicles they were installed in, noting that he had given his son a 2007 Cobalt.\n“There’s no way I would have done that … had I any reservations,” he said.\nNBC News' Mike Brunker contributed to this report.","url":"https://www.nbcnews.com/storyline/gm-recall/gm-report-engineer-approved-switch-hell-even-though-it-didn-n123791"}
