{"authors":[],"date_download":"2018-10-22 20:48:42","date_modify":"2018-10-22 20:48:42","date_publish":"2014-05-04 00:17:15","description":"GM said in a letter to NHTSA the fuel gauge reading could be off by as much as one-quarter of a tank.","filename":"data/vaneerConsumption/GMRecallsNearly52000SUVsforInaccurateFuelGauge.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/418566/140503_general-motors-logo_01cc9912b0e94b81aedbd4d419f1e79b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_gm-recalls-nearly-52-000-suvs-inaccurate-fuel-gauge-n96461_1540241322.html","title":"GM Recalls Nearly 52,000 SUVs for Inaccurate Fuel Gauge","title_page":"GM Recalls Nearly 52,000 SUVs for Inaccurate Fuel Gauge","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGeneral Motors Co is recalling 51,640 Buick Enclave, Chevrolet Traverse and GMC Acadia SUVs of the 2014 model year because faulty software may cause the fuel gauge to read inaccurately, U.S. regulators said on Saturday.\n\"An inaccurate fuel gauge may result in the vehicle unexpectedly running out of fuel and stalling, increasing the risk of a crash,\" the National Highway Traffic Safety Administration (NHTSA) said on its website.\nGM said in a letter to NHTSA the fuel gauge reading could be off by as much as one-quarter of a tank. To fix the problem, GM dealers will reprogram the vehicles' engine control modules.\nGM has recalled about 7 million vehicles this year, including 2.6 million Chevrolet Cobalts, Saturn Ions and other models for faulty ignition switches that are linked to at least 13 deaths.\nThe automaker is under investigation by NHTSA, Congress, the Justice Department and the Securities and Exchange Commission for waiting until February to begin ordering the ignition switch recall, despite first learning of the defect more than 10 years ago.\n—Reuters","url":"https://www.nbcnews.com/news/us-news/gm-recalls-nearly-52-000-suvs-inaccurate-fuel-gauge-n96461"}
