{"authors":[],"date_download":"2018-10-30 19:40:47","date_modify":"2018-10-30 19:40:47","date_publish":"2018-08-03 10:29:00","description":"Summer isn't over and there's still a lot to do in Atlanta this weekend Aug. 3-5, 2018, including theater at the Hapeville Performing Arts Center, musical theater in Marietta, Goat Yoga at Serenbe and the Springer Mountain Farms Southern Wing Showdown food festival.","filename":"data/vaneerConsumption/GoatyogaBettyeLaVetteandwings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/013114kessler_2.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_things-aug-goat-_b134faf7855192462064943ac72267b9__icmp=np_inform_variation-control_1540928447.html","title":"Goat yoga, Bettye LaVette and wings","title_page":"Things to do in Atlanta Aug. 3-5: Goat yoga, Bettye LaVette and wings","title_rss":"NULL","source_domain":"ajc.com","text":"School is back in session for some metro school districts, but that doesn’t mean summer fun is over.\nYou can drive to Serenbe and do yoga with goats or sample a variety of wings at the Springer Mountain Farms Southern Wing Showdown.\nThen, if you want more grown-up entertainment, check out Bettye Lavelle, the fabulous R&B singer at City Winery Atlanta and a play about Jackie Wilson in Marietta.\n“HOW TO BE AN IMMIGRANT”\nA Jamaican immigrant finds her hard-fought life crumbling when her business fails and her sons turn against her and the old ways. She must decide whether to fight for what she has established or to return home. Has her life been in vain?\nThe play, by Gillian Royes, runs through Aug. 19 at the Hapeville Performing Arts Center in Hapeville and is co-produced with Impact Theatre Atlanta . It’s hosted by the Academy Theatre.\nIt is directed by Brenda Porter and stars Barbara Smith-Washington, Jessica Briana Kelly, Jason-Jamal Ligon, Duran Butler, Claudette Alexander-Thomason and Ezell Brown.\n“How to Be An Immigrant.” 3 p.m. or 8 p.m. Aug. 3-Aug. 19. $32.04 including fee. Hapeville Performing Arts Center, 599 North Central Ave. Hapeville. Tickets. 404-474-8332.\n“THE EVE OF JACKIE”\nAward-winning actor Chester Gregory channels the dynamic spirit of singer Jackie Wilson in the “Eve of Jackie: The Legacy of Jackie Wilson,” for two nights at Marietta’s NewTheatre in the Square.\nGregory received praise for his role as Berry Gordy in “Motown: The Musical.” He also appeared in the Broadway classics “Sister Act,” “Dreamgirls,” “Hairspray,” and “Tarzan.”\nDuring this night, Wilson shares his thoughts on the valleys and peaks in his personal life and career in show business that produced such hits as “Lonely Teardrops” and “Your Love Keeps Lifting Me.”\n“Eve of Jackie,” 8 p.m. July 4-5. $35, Marietta’s New Theatre In The Square, 11 Whitlock Ave. S.W. 770-426-4800, www.theatreinthesquare.net\nBefore you go, check out the weather\nGOAT YOGA\nIf you can run with the wolves, you can certainly do yoga with the goats on Aug. 4-5 at Serenbe.\nGoat yoga is practiced among Nigerian Dwarf goats with each class providing a different experience. The class, sponsored by Serenbe Yoga + Bodyworks, is for families and covers all levels. Children under the age of 16 must be supervised by an adult.\nThe class is held outdoors, weather permitting. Mats are provided and participants shouldn’t mind getting a bit dirty. You can also book a private goat yoga tour at info@serenbeyoga.com. If you want to spend more time at Serenbe, you can book a stay at the Inn at Serenbe or contact The Farmhouse at 770-463-2622 to reserve a table for lunch.\nGoat Yoga. 9:15 a.m. and 11:15 a.m. on Aug. 5. $35. Reservations required. The Animal Village at Serenbe, 10950 Hutcheson Ferry Road, Chattahoochee Hills, 678-506-8416, www.eventbrite.com/e/goat-yoga-tickets-45530481897\nListen: Nappy Roots on getting into the craft beer market\n“SPRINGER MOUNTAIN FARMS SOUTHERN WING SHOWDOWN”\nWings are the thing Aug. 5 at the third annual Springer Mountain Farms Southern Wing Showdown. The event, produced by Taste of Atlanta and also co-sponsored by the Big Green Egg, will feature unique takes on wings chefs from Alabama, Georgia, Mississippi, North Carolina, South Carolina and Tennessee. These chefs will battle it out for the “Best Wing” title.\nThe event will be held at The Fairmont, 1429 Fairmont Ave. N.W., a newly opened modern and industrial venue.\nBoth general admission and VIP First Taster tickets offer attendees all-inclusive wings, side dishes, wine, beer, cocktail samples and live music from local Atlanta musician Alex Guthrie.\nThe event will benefit Angel Flight and Second Helpings Atlanta.\nSouthern Wings Showdown,2 p.m. Aug. 5. $55-$70 (VIP First Taster tickets allow guests to enter the event an hour early at 1 p.m.). The Fairmont, 1429 Fairmont Ave. N.W. www.southernwingshowdown.com.\nBettye LaVette\nThree-time Grammy nominee Bettye LaVette will perform Aug. 5 at City Winery Atlanta.\nBettye LaVette. photo by (Richard Mitchell) (Richard Mitchell)\nLaVette, 72, recently released a new CD, “Things Have Changed,” on Verve featuring Bob Dylan covers. She grew up in Detroit, where her parents sold corn liquor and and sandwiches out of their living room was sometimes visited by popular groups of the day. She’s often said that she is one of the few R&B singers who didn’t get her start in the church. A native of Detroit, her first single was “My Man - He’s a Loving Man” in the fall of 1962. Other notable songs include “Let Me Down Easy,” and “Things have Changed.”\nDuring her career, she toured with Otis Redding and Ben E. King.\nLavette also won the Pioneer Award from the Rhythm and Blues Foundation and co-wrote her autobiography, “A Woman Like Me” with David Ritz.\nIn 2008, she participated in a tribute to the Who at the Kennedy Center.\n8 p.m. Aug.5. $24-$34. City Winery Atlanta, 650 North Ave., 404-946-3791, www.citywinery.com.\nBOOTH MUSEUM SINGER-SONGWRITER SHOWCASE\nJoin Scott Thompson, Jefferson Ross and other singer-songwriters as they perform original music and share the stories behind the lyrics during an event at the Booth Western Art Museum in Cartersville.\nAspiring songwriters are also invited to bring their creations at 1:30 p.m. Aug. 5 for a critique prior to the show, which is sponsored by the Booth Writers Guild.\nFollowing the performance, the songwriters will mingle with the audience and have CDs available for purchase.\nBooth Museum Singer-Songwriter Showcase,2 p.m. Sunday. Free for members, $9-$12. Bergman Theatre, Booth Museum, 501 Museum Drive, Cartersville, 770-387-1300, www.boothmuseum.org.","url":"https://www.ajc.com/lifestyles/things-aug-goat-yoga-jackie-wilson-and-all-the-wings-you-can-eat/RoJdmhCXcfvVmjV3NC7YqN/?icmp=np_inform_variation-control"}
