{"authors":[],"date_download":"2018-10-22 21:58:28","date_modify":"2018-10-22 21:58:28","date_publish":"2015-09-21 00:00:00","description":"She used pods from the moringa tree to make a delicious lentil stew. And it turns out she was on to something: Researchers now say the tree, which grows in Asia and Africa, is packed with nutrition.","filename":"data/vaneerConsumption/GoatsandSodaNPR.json","image_url":"https://media.npr.org/assets/img/2015/09/21/istock_000056729444_medium_wide-b043a7ae0d67d6def9f147bdd0a498403e677c8d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=439509739_1540245508.html","title":"Goats and Soda : NPR","title_page":"My Mom Cooked Moringa Before It Was A Superfood : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RENEE MONTAGNE, HOST:\nAnd now we take a look at what could be the next American super-food craze - moringa. This tropical tree produces leaves and seed pods packed with proteins and vitamins. People in Asia and Africa have been eating it for years. And this hearty plant may be not only nutritious but able to stave off disease. NPR's Maanvi Singh reports.\nMAANVI SINGH, BYLINE: In India, moringa is known as the drumstick tree because it has these long, drumstick-like seed pods. It's common in Mumbai, where I grew up. My mother would use young, tender pods to make this delicious lentil stew called sambar. I called her up to reminisce.\nUNIDENTIFIED WOMAN: It used to be our favorite, especially with hot rice and a big dollop of fresh, homemade butter.\nSINGH: I loved this stuff, even as a kid who generally rejected wholesome foods.\nUNIDENTIFIED WOMAN: I mean, oddly, you fussed over a lot of vegetables. You never fussed over drumstick sambar, which was very surprising.\nSINGH: It turns out, all that moringa I gorged on as a child might have been healthier than I ever realized. Jed Fahey at the Johns Hopkins Bloomberg School of Public Health has been studying this tree for years. He says it grows wicked fast, it's drought resistant and it makes for good firewood. But more importantly...\nJED FAHEY: Its leaves are an extraordinarily good source of vitamin A and vitamin C and iron.\nSINGH: The seed pods are also a great source of protein and omega-3 fatty acids. All told, its nutritional value rivals that of milk, yogurt and eggs. That's why Fahey says its real value lies in its ability to feed poor communities across Asia and Africa, which is where it grows best. But lately, moringa supplements and energy bars are becoming fashionable in the U.S. Fahey encourages everyone to try it. It does taste great, like a green bean but better.\nFAHEY: I just think that we should remember that this is essentially a novelty at the moment.\nSINGH: He and other scientists are still looking into its medicinal value. There's good evidence that moringa has some anti-diabetic and cancer prevention properties, but the research is still in its early stages. Meanwhile, my mom says, in southern India, some folks have other thoughts.\nUNIDENTIFIED WOMAN: (Laughter) They thought it was an aphrodisiac.\nSINGH: Yeah, at this point, there's no scientific proof to back that one up. I'm Maanvi Singh, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=439509739"}
and a woman named Mariatu Fofanah turns back to her cassava stew, which is simmering over a small fire. I ask her what she thinks of this three-day Ebola lock down.\nMARIATU FOFANAH: (Speaking Krio).\nKELTO: She says, to be honest, it's making her life difficult. She can't sell food on the street. That's her usual form of work. And it's really hard to feed her kids. But she says she'll somehow manage.\nI leave the area and head into downtown Freetown. Normally, it's jam-packed with people, but now it's completely abandoned. The only sound is a police van driving slowly and blasting a song about Ebola.\n>>KELTO; The lyrics say Ebola is real. It's a terrible disease. There's no cure. You can hear the song playing throughout the empty streets. Anders Kelto, NPR News, Freetown, Sierra Leone.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=349850811"}
of Egypt, especially the poorest areas, lack of knowledge and access to resources about autism can have harmful consequences for the patient — and delay treatment.\n\"In suburban or rural areas, people say [children with autism] have been touched by the devil or cursed — and sometimes parents even cage them,\" she says. \"They're very poorly treated. They're not understood.\"\nThe stigma doesn't stop after a child's diagnosis — especially in Egyptian culture, where reputation and status are important across all social classes. \"I have people who come to me under fake names. Parents hide it from the grandparents and other members of the family,\" she says.\nThey're worried that a diagnosis of autism could affect the child's marriage chances — or even discourage a prospective marital partner for a sibling, says Soliman.\nSince she was a child, Soliman has loved working with children with special needs. The daughter of a diplomat, she grew up in the Czech Republic, Liberia, the U.K. and Australia, but back home in Egypt for summers, she'd volunteer at a nursery specifically for special needs kids.\n\"I was an annoying 11-year-old ... who [knew I wanted] to be a psychologist for children [with special needs],\" she wrote on the Society's blog last year. To make that happen, she studied psychology as an undergrad at the University of New South Wales in Sydney and in grad school at Bangor University in the U.K. She was then certified in TEACCH, a course that trains teachers how to run children's autism units, at the University of North Carolina.\nAfter graduating, she set up a classroom in her apartment in Cairo and started diagnosing and treating autistic children, teaching them everything from how to recognize their parents to how to socialize.\nWith a growing number of patients, she started her own organization in 1999: the Egyptian Autistic Society. She wanted it to be a nonprofit to help those who couldn't afford to pay. She was just 24 years old.\nAnd she kept learning. In 2002, she earned her masters in special education at the University of Birmingham.\nToday, the Society has worked with more than 5,000 children autism and has a staff of more than 40. The annual fee is a little over $2,800 — quite expensive for a country where a quarter of the population lives below the poverty line. \"Those who can pay, pay,\" says Soliman, but about a third of the students are given free services so the group can serve all parts of society.\nOn top of the day-to-day work, Soliman and her group lobby the Egyptian government for more rights for children with autism. So far, they helped facilitate military exemption for people with autism. They met with President Sisi and urged him to build six autism centers across the country. And now, they're tackling the Egyptian education system.\n\"There are a lot of legal loopholes that make it difficult to mainstream autistic children in school,\" she says. \"I want to prove that autistic children are educable.\"\nEnlarge this image toggle caption Courtesy of the Egyptian Autistic Society Courtesy of the Egyptian Autistic Society\nThat was particularly difficult during the Egyptian revolution, she says. The administration kept changing. \"The second we started doing any kind of legal or advocacy work, the ministry would change and [all our work would be] gone. So basically we'd wait to see the next social minister or health minister. It was like waiting for your next class teacher.\"\nOne campaign that has helped make noise for autism in a big way has been National Autism Awareness Month. Soliman brought the global moment — which takes place every April — to Egypt five years ago. It's marked by a flurry of public walks, runs and bike rides, VIP galas and the piece de resistance: lighting up Egypt's spectacular monuments blue, the official color of the global campaign. In addition to the Pyramids, Soliman has helped turn the Alexandria Library, the Cairo Tower and the Citadel blue.\nThe weeks after Autism Month have now become the busiest time of the year for the Society, with new clients coming in from across the country. The Society's Facebook page — which has become the group's main platform to communicate internationally across classes — hums with messages of support and photos from awareness events. But Soliman sees even more work ahead — making sure medical students are taught about the condition, for example.\nYehia, whose son Nadeem is now 9 years old, never doubted Soliman's drive for a second. As an autism activist and the head of a youth-based NGO, she feels that it has become much easier for Egyptian parents like her to find resources for autism.\n\"There is integrity and passion in everything she does,\" she says of Soliman, who has worked with her son since 2012. \"This is not her profession, this is her life.\"","url":"https://www.npr.org/sections/goatsandsoda/2016/06/20/478548029/she-turned-the-pyramids-blue-and-got-egyptians-to-talk-about-autism"}
