{"authors":["Don Gonyea"],"date_download":"2018-10-22 20:03:38","date_modify":"2018-10-22 20:03:38","date_publish":"2018-09-11 00:00:00","description":"Don Gonyea visits musician Lee Greenwood to talk about the song that, after three decades in political campaigns, might be more popular than \"Hail to the Chief.\"","filename":"data/vaneerConsumption/GodBlessTheUSAACountryAnthemWithEnduringPoliticalPower.json","image_url":"https://media.npr.org/assets/img/2018/09/10/gettyimages-463515289_wide-7976b465df6470d30a5c27c2d9e24597aaf1d847.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_09_11_645270955_god-bless-the-u-s-a-a-country-anthem-with-enduring-political-power_1540238618.html","title":"'God Bless The U.S.A.,' A Country Anthem With Enduring Political Power","title_page":"'God Bless The U.S.A.,' A Country Anthem With Enduring Political Power : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'God Bless The U.S.A.,' A Country Anthem With Enduring Political Power\nEnlarge this image toggle caption Paul Natkin/Getty Images Paul Natkin/Getty Images\nThis story is part of American Anthem, a yearlong series on songs that rouse, unite, celebrate and call to action. Find more at NPR.org/Anthem.\nLee Greenwood sits at the grand piano in his living room outside Nashville, noodling at the keys and battling a summer cold. He sings softly to himself, tapping out a few bars of \"Your Song\" by one of his favorite artists, Elton John — before sharing the tale of almost joining the band The Rascals, whose single \"Good Lovin' \" would become a No. 1 hit. \"So I missed that one,\" he says playfully. He is full of stories like this.\nNow 75 and still touring, Greenwood had lived a whole career before he wrote the song that would come to define him. Released in 1984, \"God Bless the U.S.A.\" was meant from the start to be an anthem, a song suited for big patriotic moments. It was nominated for a Grammy for best country song, and has been a go-to selection at times of national strife — though as the songwriter has learned, the reactions to it don't always inspire a sense of unity.\nYouTube\nBorn in Southern California, Greenwood began gigging at 16. Though he'd missed out on the Rascals job, he took as many others as he could — mostly in Las Vegas and Reno, making money and building his reputation in casinos and lounges. He recalls working in Sparks, Nev., at the Nugget Casino resort, playing in a revue called Naughty but Nice.\n\"The Nugget in Sparks was a great place for me. I did a number called 'Short People,' \" he says, and sings a few bars of the Randy Newman classic. Then he clarifies something about the show: \"I'm featured, but it's a line of girls that are featured [too]. This is a nude show. This is a topless show.\"\nEventually, he decided to give country music a try, leaving behind a life as a successful bandleader and heading to Music City.\n\"Lee didn't come to Nashville to build a career. He came with a career,\" says Bill Ivey, a former head of the Country Music Hall of Fame who also served as chair of the National Endowment for the Arts. \"So, right out of the gate he was a serious guy, with a lot of experience in L.A. and Las Vegas.\"\nGreenwood signed with a major Nashville label, and before long made it onto the Billboard charts. The song \"I.O.U.,\" from his 1983 album Somebody's Gonna Love You, earned him a Grammy (for best country vocal performance, male).\nSoon after that came the song that would cement his fame. Greenwood says he was inspired by the military veterans he'd see at his concerts, and got to thinking about writing an anthem.\nHenry Horenstein for NPR YouTube\n\"I wanted to put God first, because I'm a conservative Christian, and I wanted to make sure that God was honored in the song,\" he says. As for the music, \"The Sousa marches were in the back of my head — I did a lot of those as drum major for my high school marching band. And I wanted some pomp and circumstance.\"\nIvey says \"God Bless The U.S.A.\" nails it as a patriotic anthem. \"He opens with gratitude, what a great gift it is. If we had nothing else, freedom would be precious,\" Ivey says. \"Then he goes into the chorus, which is pride, and talks about sacrifice, and invokes the military and how hard it was to create this freedom that he values so much.\"\nThe song didn't catch on right away: Though nominated for a best country song Grammy, it faded from view after peaking at No. 7 on the country chart. But it had more lives to come.\nIts first high-profile use in a political setting came at the Republican National convention Convention in 1984. Greenwood explains, \" 'God Bless the U.S.A.' got associated with President Reagan. They made a film of his life,\" in which the song was part of the soundtrack.\nEnlarge this image toggle caption /Henry Horenstein for NPR /Henry Horenstein for NPR\nDuring the 1991 Gulf War, it became a staple at parades and homecomings. Then came Sept. 11: Greenwood performed the song twice at Yankee Stadium, once for a firefighters' memorial and again at Game 4 of the 2001 World Series.\nAs its stature grew, covers and interpretations followed — by Beyoncé, Dolly Parton and contestants on American Idol. Greenwood himself recorded an alternate Canadian version. The musician says that when he wrote \"God Bless the U.S.A.,\" the goal was always to unite people. \"I meant that the nation would kind of 'kumbaya' — gather arms and let's love each other,\" he says.\nIn many cases, it has certainly done that. But over the years, it has also become more and more partisan.\nYou're far more likely to hear the song at GOP events — like a recent Trump rally in Elkhart, Ind., where I found it blasting from speakers mounted on a pickup truck out in the street. People had been lined up all day waiting to get inside, among them college student Ben Hirschman, who had the words \"Proud to be an American\" printed on his shirt.\n\"Oh, I love the song,\" he told me. \"It's my favorite song that I heard when I was younger, right after 9/11. It has a lot more meaning now.\"\nDown the block was another gathering, this one anti-Trump. Attendee David Kolhoff, a retired attorney, said, \"I'm not a fan of that song, even though I'm proud to be an American. I was kind of raised [with] the idea you should be quiet — you should do things quietly.\"\nHenry Horenstein for NPR YouTube\nAsked about such partisan reactions, Greenwood says he wishes it weren't so, and that he's proud to have sung the song for five presidents — Republican and Democrat. But more than that, he's honored that there are those who do consider it an anthem.\n\"When you say the word 'anthem,' it takes it to another category,\" he says. \"After 30-some years that I've sung this on stage, people do get up as if it is an anthem for their lives, for their country. Pretty cool.\"","url":"https://www.npr.org/2018/09/11/645270955/god-bless-the-u-s-a-a-country-anthem-with-enduring-political-power"}
