{"authors":[],"date_download":"2018-10-30 01:08:21","date_modify":"2018-10-30 01:08:21","date_publish":"2014-08-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Godblessthepolice.json","image_url":"https://www.americanthinker.com/images/bucket/2014-08/192977.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_08_god_bless_the_police_1540861701.html","title":"God bless the police","title_page":"God bless the police","title_rss":"NULL","source_domain":"americanthinker.com","text":"Every single day, the police face an infinite number of challenging and dangerous situations on our behalf as they put their lives on the line to protect others. I don’t know about you, but I can’t imagine what it’s like to go to work knowing I may be called to a scene where some lunatic is threatening the lives of innocent people, including potentially, my own.\nDespite increasing anti-police fervor, I’m going to go out on a limb and say: God bless the police.\nAnd now as we witness sheer madness unfolding in Ferguson, the police are being framed by the media and in public discourse as if they are the problem. All the while evil-doers are running rampant in the streets.\nThe very media that is eager to legitimize Hamas while condemning Israel is pulling the same stunt in many of their reports out of Ferguson as they frame the good guys -- the police -- in a negative light.\nWhat do people want from the police? If police presence is deemed insufficient, they are damned. If their presence is deemed over-the-top, they are damned for that, as well.\nIt’s easy to sit at home and presume we know where that sweet spot is between too much and too little response. Claire McCaskill is one of those who pontificates on the matter, as Yahoo News reports:\n\"We overpoliced for a few days, and then we completely underpoliced…\"\nThanks, Claire. We’d all been waiting with bated breath for your statement.\nMeanwhile people are spitting on the police, screaming at them, threatening them. People are looting stores, setting fires, inciting violence. There are chaotic mobs hurling Molotov cocktails and bricks. There is gunfire aimed at the police. Some people are calling for Officer Wilson’s death. Many are chanting the now familiar “no justice, no peace” -- a promise that chaos will reign until…what? Until the mob gets what they want?\nJust how would those who are critical of the police like them to respond? Would they like them to stand idly by, observing anarchy without taking action? Would they like to see police officers injured in the line of duty\nAnd what about police attire? Should they not be in full riot gear when a riot is storming? Yahoo News reports:\nBut police said some in the crowd hurled bottles, rocks and petrol bombs at officers, who responded by firing gas-filled canisters and a noise cannon to try to disperse the throng. State Highway Patrol Captain Ron Johnson, who is overseeing security in Ferguson, said officers had come under \"heavy gunfire\" but did not return it. Riot police did confiscate two guns and what looked like a petrol bomb from protesters\nAnd what about the media? Should they be allowed to physically interject themselves into highly charged and violent situations where the police cannot discern who is who, without consequence? As Captain Ron Johnson noted in a recent press conference (video embedded in the article):\nJohnson also defended the arrests of journalists, saying police, in many cases, are not able to differentiate between protesters and the press. \"In the midst of chaos, when officers are running around, we're not sure who's a journalist and who's not,\" Johnson said. \"And yes, if I see somebody with a $50,000 camera on their shoulder, I'm pretty sure. But some journalists are walking around, and all you have is a cellphone because you're from a small media outlet. Some of you may just have a camera around your neck. So yes, we are -- we may take some of you into custody.\" Earlier, police formed a line, telling journalists to disperse or face arrest.\nJohnson has also been critical of how the media is “glamorizing” violence. Breitbart reports:\nOn Tuesday, Ron Johnson, the captain of the Missouri Highway Patrol, blamed the media for \"glamorizing\" and giving a platform to violent thugs intent on causing violence and agitating crowds in Ferguson, Missouri. In an appearance on MSNBC's Daily Rundown after another night of rioting and confrontations, Johnson told host Craig Melvin that \"we have a lot of media that have not done a great job\" and made the situation worse--and tougher for police. He said that on Monday evening, when small crowds started to swell in size, \"that criminal element, that got out here with masks on, that wanted to agitate and build up the crowd, would stop in front of the media.\" \"The media would swarm around them, give them a platform and glamorize their activity,\" Johnson said. \"The crowd would stop. And then before we knew it, the crowd is 100, now it’s 200, now it’s 300. And now those criminals began to start throwing things out of the crowd that was staying within the media.” At least 30 people were reportedly arrested on Monday evening, and Johnson blamed criminals from outside of Ferguson for agitating along with residents of Ferguson and St. Louis. Criminals from California and New York were among those who were reportedly arrested on Monday evening. Johnson said he was grateful to the media for what they have done and the journalists who have \"been our partners in reporting,\" but he emphasized that those walking around with handkerchiefs around their faces and talking about nothing but violence are not protesters. He said the media should be careful about giving them publicity and putting them on air.\nJournalists are finding numerous ways to get the story backwards. Jack Tapper is a prime example.\n\"I want you to look at what is going on in Ferguson, Missouri, in downtown America,\" Tapper said. \"These are armed police, with semi-automatic rifles, with batons, with shields, many of them dressed for combat. Now why they’re doing this I don’t know, because there is no threat going on here, none that merits this. There is none. \"Absolutely there have been looters, absolutely over the last nine days there’s been violence, but there is nothing going on on (sic) this street right now that merits this scene out of Bagram,\" Tapper continued. \"Nothing! So if people wonder why the people of Ferguson, Missouri are so upset, this is part of the reason. What is this? This doesn’t make any sense!\"\nIt did not seem to occur to Tapper that the reason all was quiet was precisely because there was a strong police presence. That the police had gotten the area Tapper was observing under control. And they didn’t do so by showing up in their pajamas, riding tricycles, and wielding plastic spoons. (We reserve that for the president.)\nBut then again, Tapper happily joined the chorus of voices just a few weeks ago legitimizing Hamas and condemning Israel, so what should one expect from him? He seems to have lost his ability to grasp basic facts or discern right from wrong.\nThere is a script the media follows that, among other things, appears founded on the principle that whoever is most successful in upholding law and order is to be scorned.\nSo to the police who risk their lives to uphold that very law and order upon which our nation is founded I would like to express a heartfelt thank you.","url":"https://www.americanthinker.com/blog/2014/08/god_bless_the_police.html"}
