{"authors":[],"date_download":"2018-10-22 21:04:31","date_modify":"2018-10-22 21:04:31","date_publish":"2014-06-04 02:57:36","description":"He didn't invent the drug but rediscovered it and developed an easy way to synthesize it, though he expressed regret at its abuse outside therapy.","filename":"data/vaneerConsumption/GodfatherofEcstasyAlexanderShulginDiesat88.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/485896/140603-shulgin-ga-2250_87c4194d434ba758951b7d349796e33f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_godfather-ecstasy-alexander-shulgin-dies-88-n121971_1540242271.html","title":"'Godfather of Ecstasy' Alexander Shulgin Dies at 88","title_page":"'Godfather of Ecstasy' Alexander Shulgin Dies at 88","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlexander Shulgin, a respected chemist famed for dusting off a decades-old recipe for the psychedelic drug ecstasy, died Monday at his Northern California home. He was 88.\nShulgin's wife, Ann, said liver cancer was the cause. She said he had been diagnosed about a year ago and was surrounded by family and friends when he died at \"the farm,\" his sprawling residence and lab in a remote part of Lafayette, California, about 22 miles east of San Francisco.\nShulgin created more than 200 chemical compounds for use in psychotherapy, and tested them on himself, his wife and a small group of friends and others at his home, recording each experience in lab notebooks.\nHe didn't invent MDMA, better known as ecstasy, but rediscovered the compound some 65 years after its 1912 invention and introduced it as a possible mental health treatment. He and his wife published two seminal books on chemical compounds.\nShulgin said he was interested only in MDMA's potential use in therapy and was unhappy to see its abuse as a recreational drug.","url":"https://www.nbcnews.com/news/us-news/godfather-ecstasy-alexander-shulgin-dies-88-n121971"}
