{"authors":[],"date_download":"2018-10-30 22:26:57","date_modify":"2018-10-30 22:26:57","date_publish":"2018-09-06 12:54:40","description":"CBN spoke with Quarterback Nick Foles who led the Eagles to the championship as a backup. Foles talked about the season ahead and the primary importance of his relationship with Jesus Christ.","filename":"data/vaneerConsumption/GodHasaPlanYouJustGottaTrustItSuperBowlWinningQBNickFolesReturnsforBigGame.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/standard/images/nickfoles_si_0.jpg?itok=OIfYaD0y","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_entertainment_2018_september_god-has-a-plan-you-just-gotta-trust-it-super-bowl-winning-qb-nick-foles-returns-for-big-game-tonight_1540938417.html","title":"'God Has a Plan, You Just Gotta Trust It': Super Bowl Winning QB Nick Foles Returns for Big Game","title_page":"'God Has a Plan, You Just Gotta Trust It': Super Bowl Winning QB Nick Foles Returns for Big Game | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"The NFL season opened Thursday night with the defending Super Bowl champion Philadelphia Eagles playing in the first game of the season.\nThey did it again?\nYES! Nick Foles is catching passes. Philly Special: Part II #ATLvsPHI @Eagles pic.twitter.com/Gct9Yt4h3O — NFL (@NFL) September 7, 2018\nIn the lead-up to the game, CBN spoke with Quarterback Nick Foles who led the Eagles to the championship last season as a backup. Foles talked about the season ahead and the primary importance of his relationship with Jesus Christ.\nFoles' impressive NFL career has been a wild ride, from back-up to starter to Super Bowl MVP.\n\"No matter what, I just want to play without fear and that's a win,\" he says.\nAfter starting Quarterback Carson Wentz suffered an injury, Foles stepped up to take the Eagles to their first-ever Super Bowl championship.\n\"I had an opportunity to be a part of a great team and win a Super Bowl. Doesn't seem real when you're holding a Super Bowl ring, but it's not everything,\" Foles says.\nAs a man of faith, this MVP makes sure his focus is on something greater than football.\n\"Many people win awards or even the Super Bowl that say, 'I feel like there should be more but there's not.' And I'm holding my daughter and we go hoist the trophy, I'm just thinking my greatest achievement was giving my life to Christ, so this isn't going to fulfill me. I've already been fulfilled,\" he explains.\nAt the start of the 2018 season, Eagles fans have hopes of a Super Bowl repeat.\n\"Eagles fans want us to go out there and play well. Though 2017 is something we will always remember, and it will live forever in Eagles history, but life goes on. That's just sort of how the sport is. It's a humbling sport,\" he says.\nWith Carson Wentz getting healthy, the starting QB role in Philly is up for grabs, and the MVP champ's starting position is in question.\n\"The biggest challenge this off-season was a month after the Super Bowl when I got put on the trading block,\" Foles said. \"Then you think, 'I can be a starter, I've proven that.' Then you get sort of distracted. But that's where staying rooted in Christ, going through it, trusting him but struggling, there's times I struggle. And then it was just getting ready to go back to Philly to be a back-up.\"\nRegardless, off the field, he'll continue to be a strong spiritual leader for his teammates.\n\"Life is meant to be lived in fellowship, with one another. To me, relationship in Christ is a relationship, not a religion, and I'm just grateful for it,\" Foles says.\nNo matter where this Eagle lands in the 2018 season... \"God always has a plan, you just got to trust it,\" he said.","url":"http://www1.cbn.com/cbnnews/entertainment/2018/september/god-has-a-plan-you-just-gotta-trust-it-super-bowl-winning-qb-nick-foles-returns-for-big-game-tonight"}
