{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:50:15","date_modify":"2018-10-30 18:50:15","date_publish":"2015-10-20 14:54:22","description":"In his homily Tuesday, Pope Francis reminded hearers that in God’s goodness, He waits “to throw a party” for those who come home to Him.","filename":"data/vaneerConsumption/GodIsReadytoThrowaPartyforRepentantSinners.json","image_url":"https://media.breitbart.com/media/2014/12/Pope-Birthday-Cake-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_20__1540925415.html","title":"God Is Ready to ‘Throw a Party’ for Repentant Sinners","title_page":"Pope: God Is Ready to ‘Throw a Party’ for Repentant Sinners","title_rss":"NULL","source_domain":"breitbart.com","text":"In his homily Tuesday morning, Pope Francis reminded his hearers we are all sinners, but that in God’s abundant goodness, He is waiting “to throw a party” for His sons and daughters who come home to Him.\nQuoting Saint Paul from the day’s Scripture readings, Francis said that “where sin increased, grace overflowed all the more,” underscoring God’s overwhelming generosity and willingness to forgive even our gravest transgressions.\nGod gives without measure, Francis said, without counting out how much He is giving and how much He is receiving. God gives “all of Himself,” he said.\nLike the father of the prodigal son, the Pope said, God is “not stingy” and bears no grudges. “He keeps watch, waiting for us to convert,” he added.\nMoreover, Francis said, God is not inert, but active. He “is a God who comes out looking for each one of us.” He continued by saying that “He looks for us, searches for us” every day like a shepherd looking for his lost sheep or a woman looking for her lost coin.\n“God seeks. God waits actively. He never gets tired of waiting for us,” Francis said.\nGod’s attitude is like that of the father who sees his son coming from a long way off and immediately runs out to meet him and embrace him, he said. “God awaits us always, with open doors,” he asserted, because “His heart is not closed; it is always open.”\n“And when we come home like that son,” Francis said, God “embraces us and kisses us; He throws us a party.”\nThis is what Jesus meant, Francis said, when he announced that “there will be more rejoicing in heaven over one repentant sinner than over a hundred who have no need of repentance.”\n“It’s hard for us, with our human standards—we are so small, and limited—to understand the love of God,” Francis said. It’s a grace to meet people—the saints—to whom God has given the grace to understand His love, he said.\nThat’s why we should ask the Holy Spirit “for the grace to understand this love” even a little, and for the desire to “be embraced” by God, who gives without measure.\nThe Holy Spirit teaches us to call God our Dad, Francis said. Jesus usually spoke of “the Father,” but “at one moment, He says, ‘Dad.’”\nSo, Francis said, “thanks to the Spirit, we can call Him ‘Dad.’”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/politics/2015/10/20/pope-francis-says-god-ready-throw-party-repentant-sinners/"}
