{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:03:31","date_modify":"2018-10-30 21:03:31","date_publish":"2015-09-02 17:36:40","description":"Faith-based film 'War Room' is a box office sleeper hit - and director Alex Kendrick thinks its message is more timely than ever.","filename":"data/vaneerConsumption/GodNotGovernmentCanFixtheIssuesDestroyingOurCulture.json","image_url":"https://media.breitbart.com/media/2015/08/Screen-Shot-2015-08-28-at-2.12.03-PM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_09_02__1540933411.html","title":"God, Not Government, Can 'Fix the Issues Destroying Our Culture'","title_page":"'War Room' Director: God, Not Government, Can 'Fix the Issues Destroying Our Culture'","title_rss":"NULL","source_domain":"breitbart.com","text":"Alex Kendrick, writer, producer, director and star of the recently released faith-based movie War Room, has to be pleased with the reception accorded his latest project.\nWar Room debuted in second place at the box office last weekend with an impressive $11 million haul, well ahead of analysts’ expectations and second only to the end-of-summer smash hit Straight Outta Compton.\nKendrick’s film tells the story of a family that appears to have it all; good jobs, good health, and a beautiful home. But when the family’s spiritual strength is tested, they must turn to the only force strong enough to overcome their struggles: prayer.\n“This film hits a need in our culture that is becoming more and more obvious,” Kendrick told the Wrap in an interview this week. “We need to return to prayer! Politicians, government programs and political correctness can’t fix the many issues that are destroying our culture – but God can.”\nKendrick knows a thing or two about prayer; along with being one of the most successful independent film producers working today (his faith-based films, made with his brother Stephen, have grossed north of $80 million on $5 million worth of production budgets), Kendrick is reportedly an ordained minister who once worked as a Christian radio DJ.\nBut Kendrick was caught off guard by the success of War Room, which cost just $3 million to produce.\n“Literally, we prayed for the best, and worked for an $8 million weekend or better,” Kendrick told the Wrap. “We thought we had a shot at the top five, but didn’t expect to be near the top. The response has been incredible! We’ve been overwhelmed with people who were inspired and moved by the film. Already we’ve gotten more social media messages than we could ever read.”\nKendrick told the entertainment website that War Room‘s central premise–that prayer can help heal and empower in ways that people and institutions cannot–is an important reminder in a society constantly looking for answers.\n“We’re not endorsing politicians at this point,” Kendrick said when asked if he would back conservative political candidates who have reached out for support. “We’re more interested in calling people of faith to pray and ask God to intervene in our culture. We need to turn back to God as a nation before turning our hopes toward another politician.”\n“We can tell a huge difference in the result when we fight our battles in prayer first,” he added.\nThe Wrap also asked Kendrick if he’d ever thought about producing a Christian superhero movie.\n“We pray about every project. So if we truly believed God was prompting us to go in that direction, we’d do it,” Kendrick replied. “But I doubt that would happen. As far as increasing the scope of future films, we want to do whatever the story needs.”\nCheck out the rest of Kendrick’s interview with the outlet here.\nWar Room is now playing in select theaters nationwide.","url":"https://www.breitbart.com/entertainment/2015/09/02/war-room-director-god-not-government-can-fix-the-issues-destroying-our-culture/"}
