{"authors":[],"date_download":"2018-10-22 20:40:51","date_modify":"2018-10-22 20:40:51","date_publish":"2014-06-02 17:43:22","description":"Scientists have just discovered the \"Godzilla of Earths\" — a new type of huge and rocky alien world about 560 light-years from Earth.","filename":"data/vaneerConsumption/GodzillaofEarthsDetectedAroundanAlienSun.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482076/140602-space-godzilla_d8f5f0635873ca3b7f9f1086554a4e12.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_godzilla-earths-detected-around-alien-sun-n120441_1540240851.html","title":"'Godzilla of Earths' Detected Around an Alien Sun","title_page":"'Godzilla of Earths' Detected Around an Alien Sun","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"This is the Godzilla of Earths!\" the CfA's Dimitar Sasselov, director of the Harvard Origins of Life Initiative, said of Kepler-10c in a statement. \"But unlike the movie monster, Kepler-10c has positive implications for life.\"\nThe discovery of Kepler-10c was presented on Monday here at the 224th American Astronomical Society meeting.\nThe mega-Earth orbits its parent star once every 45 days. Kepler-10c is probably too close to its star to be hospitable to life, and it isn't the only planet orbiting the yellow star. Kepler-10 also plays host to a \"lava world\" called Kepler-10b that is three times the mass of Earth and speeds around its star in a 20-hour orbit.\nNASA's Kepler space telescope first spotted Kepler-10c, but it wasn't able to tell whether the world was gaseous or rocky. CfA astronomer Xavier Dumusque and his team used the HARPS-North instrument on the Telescopio Nazionale Galileo in the Canary Islands to measure Kepler-10c's mass. They found that the planet is, in fact, rocky and not a mini-Neptune.\nScientists think the Kepler-10c system formed less than 3 billion years after the Big Bang. The system's early formation suggests that, although the materials were scarce, there were enough heavy elements like silicon and iron to form rocky worlds relatively early on in the history of the universe, according to the CfA.\n\"Finding Kepler-10c tells us that rocky planets could form much earlier than we thought,\" Sasselov said. \"And if you can make rocks, you can make life.\"\n— Miriam Kramer, Space.com\nThis is a condensed version of a report from Space.com. Read the full report. Follow Miriam Kramer on Twitter and Google+. Follow Space.com on Twitter, Facebook and Google+.","url":"https://www.nbcnews.com/science/space/godzilla-earths-detected-around-alien-sun-n120441"}
