{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 22:06:23","date_modify":"2018-10-22 22:06:23","date_publish":"2017-03-16 02:45:19","description":"RHOS this week saw the Gogglebox audiences wonder out loud if they had just witnessed the Lisa Oldfield's marriage breakdown on national television.","filename":"data/vaneerConsumption/GoggleboxstarsurgeLisaOldfieldtoendhermarriage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E50D47600000578-0-image-a-21_1489638547678.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318560_Gogglebox-stars-urge-Lisa-Oldfield-end-marriage_1540245983.html","title":"Gogglebox stars urge Lisa Oldfield to end her marriage","title_page":"Gogglebox stars urge Lisa Oldfield to end her marriage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're both reality TV shows known for their controversial outbursts.\nBut on this week's episode of Gogglebox, audiences were left almost speechless while watching Lisa Oldfield breakdown in tears on the Real Housewives Of Sydney.\nLisa's emotional reaction, which saw her crying over her struggling marriage to David, saw the Gogglebox audiences wonder out loud if they had just witnessed the couple's marriage breakdown on national television.\nScroll down for video\n'Get a divorce!' Gogglebox stars urge Lisa Oldfield to end her marriage to David after explosive Real Housewives Of Sydney episode saw the couple fight and Lisa break down in tears\nThe drama started on RHOS when David took digs at Lisa for not doing enough around the house or telling him how much she appreciates him.\nTrying to remain optimistic after the tongue lashing, Lisa said in her confessional: 'At the end of the day we both want the same thing, which is a happy marriage back on track and two happy little boys.'\nDavid's put downs of Lisa left Angie furious, fuming: 'This is what I hate about men when women work and they stay at home. It’s like, shut up!'\nUnhappy : Lisa broke down in tears while talking about her marriage with friend Victoria Rees, who recommended she see a divorce lawyer\n'I feel like I'm a failure as a mother and a wife': The businesswoman revealed the constant put downs from her husband were getting to her\nHowever later in the episode, Lisa broke down in tears while talking about her marriage with friend Victoria Rees, who recommended she see a divorce lawyer.\n'I feel like I'm a failure as a mother and a wife,' Lisa said. 'There doesn't feel like there's any love or support there, and I feel very lonely.'\nThe three generations pf Silbery women, who are all single, all yelled some straight-talking advice at the television.\n'F**king get rid of him then!' The three generations pf Silbery women, who are all single, all yelled some straight-talking advice at the television\n'F**king get rid of him then!' They cried in unison. 'Get a divorce!'\nMum Kate Dalton, however, disagreed with Lisa discussing her marriage problems so publicly.\n'I think it’s a bit wrong how they’re talking about their family like this,' she said.\nInteresting take: Anastasia fortunately offered a lighter moment to the otherwise drama-filled episode of RHOS, giving her unique critique of Athena X's artworks\nMale housemate Symon mused that he had seen something seismic occur: 'Wow. We’ve just seen a divorce happen on national TV.'\nAnastasia fortunately offered a lighter moment to the otherwise drama-filled episode of RHOS, giving her unique critique of Athena X's artworks.\n'You know what it looks like? Bed sheets in a Target catalogue,' she quipped to her friend Faye.\n'You know what it looks like? Bed sheets in a Target catalogue': Athena has previously said her artwork is the result of out of body experiences","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318560/Gogglebox-stars-urge-Lisa-Oldfield-end-marriage.html"}
