{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 14:07:48","date_modify":"2018-10-30 14:07:48","date_publish":"2018-10-30 11:48:00","description":"The seafood restaurant Goin Coastal is closing after eight years.","filename":"data/vaneerConsumption/GoinCoastalclosinginVirginiaHighland.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p4/AJC/2013/12/19/Images/photos.medleyphoto.4247174.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_go_59832373e29dc71b1efd140f8a2cd76a__1540908468.html","title":"Goin' Coastal closing in Virginia-Highland","title_page":"Goin' Coastal closing in Virginia-Highland","title_rss":"NULL","source_domain":"ajc.com","text":"A Virginia-Highland seafood mainstay announced it will close this weekend after eight years.\nGoin’ Coastal, located at 1021 Virginia Ave. NE, addressed the closure on its Facebook page, Tomorrow’s News Today first reported:\nTo our friends and family of our Atlanta location:\nWith a heavy heart we unfortunately announce that our Goin Coastal in Virginia Highlands will be closing after this Saturday, November 3rd. We have loved serving this wonderful community for the past 8 years and truly appreciate all of the special memories and friendships that were made! We hope to see you all this week for one last hurrah and to have the chance to personal thank you all for the support over the years.\nSincerely,\nThe Goin Coastal Team\nThe restaurant, which also has a location in Canton that opened in 2006, specialized in sustainable fish and other seafood dishes.\nFormer AJC food critic John Kessler called Goin Coastal “a little bit Gulf seafood shack, a little bit uptown bistro and a whole lot of unconvincing Lowcountry-style cookery,” when he reviewed it in 2010.\n“Goin' Coastal trumpets a wonderful mission statement, and that's what it needs to focus on,” he wrote. “We're in a huge non-coastal city with the world's busiest airport, but nowhere near the seafood cultures of the Gulf and Atlantic coasts. Focus on buying fish from responsible sources, cook it with the care it merits, and then I'll bite.”\nRELATED:\nMore intown Atlanta dining news\nMore metro Atlanta restaurant closures\nEast Cobb restaurant charts sustainable seafood course\nAre you a responsible seafood eater?\nRead the 2018 AJC Fall Dining Guide: Dining on Buford Highway\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/goin-coastal-shutter-this-weekend-virginia-highland/LKLQmj42BvkYEf68K3Xp7L/"}
