{"authors":["Jr Thorpe"],"date_download":"2018-10-31 01:41:05","date_modify":"2018-10-31 01:41:05","date_publish":"2018-09-14 20:26:52","description":"What ends up on your plate can have a serious impact on the planet. From the land needed for dairy and grain production, to chemical fertilizers and food miles, many different factors influence how food production impacts the planet. But…","filename":"data/vaneerConsumption/GoingVegetarianCanImproveYourWaterFootprintANewStudySaysItHasAMajorImpactOnTheEarth.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/093662fc-b93b-4708-9d82-6db1d1c76f90-fotolia_211108434_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_going-vegetarian-can-improve-your-water-footprint-a-new-study-says-it-has-a-major-impact-on-the-earth-11900273_1540950065.html","title":"Going Vegetarian Can Improve Your Water Footprint, A New Study Says, & It Has A Major Impact On The Earth","title_page":"Going Vegetarian Can Improve Your Water Footprint, A New Study Says, & It Has A Major Impact On The Earth","title_rss":"NULL","source_domain":"bustle.com","text":"What ends up on your plate can have a serious impact on the planet. From the land needed for dairy and grain production, to chemical fertilizers and food miles, many different factors influence how food production impacts the planet. But fortunately, as a new study published in Nature Sustainability shows, going vegetarian or pescatarian can improve your water footprint, thereby reducing your diet's impact on the planet.\nBasically speaking, to grow food of any kind, you need water — and lots of it. If you're raising animals for meat, you'll need water to grow the grain they feed on, on top of the water necessary for processing and shipping. The amount exactly depends on what kind of food you're consuming and where it's coming from, but the amount of water that your diet likely needs might astonish you.\n\"It goes to 3,000 - 4,000 liters per person per day; these are enormous amounts when you compare them with direct water use at home,\" Dr. Davy Vanham from European Commission's Joint Research Centre, who headed the study, told the BBC. That's around 790 to 1050 gallons per person, per day.\nThe study looked at the water footprints for food in the United Kingdom, France, and Germany, and how people actually ate in different parts of the country. The three countries studied had slightly different water footprints on average, because of different cultural diets: the UK's average per-day per-person water consumption is 728 gallons, while Germany's is 774 gallons and France's 1020 gallons. And those differences can tell us a lot about what sorts of foods can help us lower our water consumption footprint.\nThe data from the three countries shows that it's worth pursuing a diet with low amounts of fast food and trans fats, and high amounts of fruit and veggies. That diet change, for meat-eaters, can reduce their water footprint by 11 to 35 percent. If you go further and cut out meat altogether, opting for fish only, your water footprint can decrease by 33 to 55 percent, while going fully vegetarian reduces it by 35 to 55 percent. The data did not measure the effect of veganism or other lifestyles.\nIf you can't go pescatarian or vegetarian, pay attention to where your meat comes from and be a water-wise consumer.\nThis study isn't saying everyone needs to stop eating meat or else; rather, it shows that there are concrete steps people can take in their everyday lifestyles to effect positive change. There's definite leeway in these results for meat-eating that reduces water footprint size — focusing on animals that require smaller amounts of water, such as sustainably-raised chicken, or eating meat less frequently. And it's excellent motivation for anybody who'd like to cut out meat altogether in favor of fish or an all-veggie diet, or is thinking about revamping their consumption to make it greener.\nExpect to hear more about your water footprint in the future; it's going to shape a lot of our conversations about sustainability. And your supermarket shop will figure heavily in how big yours is. If you can't go pescatarian or vegetarian, pay attention to where your meat comes from and be a water-wise consumer. It pays off in the long run for the planet.","url":"https://www.bustle.com/p/going-vegetarian-can-improve-your-water-footprint-a-new-study-says-it-has-a-major-impact-on-the-earth-11900273"}
