{"authors":["Alexandra Thompson Health Reporter For Mailonline"],"date_download":"2018-10-23 03:06:42","date_modify":"2018-10-23 03:06:42","date_publish":"2017-04-26 14:24:30","description":"Patients who are admitted to hospital at the weekend are more likely to die within 30 days. The latest findings of 133 NHS Trusts support evidence of a so-called NHS 'weekend effect.","filename":"data/vaneerConsumption/GoingtoNHShospitalonaweekendmaybedeadly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FBCCD00000578-0-image-a-77_1493211349221.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4447542_Going-hospital-weekend-deadly_1540264002.html","title":"Going to NHS hospital on a weekend may be deadly","title_page":"Going to NHS hospital on a weekend may be deadly | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Patients who are admitted to hospital at the weekend are more likely to die within 30 days, official figures show.\nAn emergency trip to hospital on a weekend slightly increases the length of a patient's hospital stay.\nThe latest findings, which were collated and released by the NHS, support evidence of a so-called 'weekend effect'.\nExperts suggested it could be down to a lack of services available both in and out of the hospital at weekends - an issue widely cited by researchers.\nGoing to hospital on a Saturday or Sunday increases the risk of death within 30 days, official new figures suggest\nSenior doctors are rarely present on Saturdays and Sundays and there are not always staff on hand to carry out x-rays, blood tests or other vital scans.\nHealth Secretary Jeremy Hunt has previously cited evidence of this issue in his attempt to push for a seven-day NHS and a new contract for junior doctors.\nData of more than 16.3 million patient admissions, collected by the health service and released last October, backed up his claims.\nWhile the new report, based on hospital admissions between October 2015 and September 2016 from 133 NHS trusts, also pointed in his favour.\nIt found those who go on a 'transition' day, Monday or Friday, have a higher mortality risk than people who enter on a Tuesday, Wednesday or Thursday.\nBeing discharged at the weekend or Friday increases a patient's likelihood of having an emergency readmission within seven days.\nWHAT IS THE WEEKEND EFFECT? The 'weekend effect' describes how NHS treatment is supposedly riskier on a Saturday or Sunday. Senior doctors are rarely present at weekends and there are not always staff on hand to carry out x-rays, blood tests or other vital scans. Health Secretary Jeremy Hunt has previously cited evidence of the issue in his attempt to push for a seven-day NHS. Data of more than 16.3 million patient admissions, collected by the health service and released last October, backed up his claims. They showed that those admitted to hospital over the weekend were more likely to die within 30 days. Sir Bruce Keogh, medical director of the NHS, once calculated that 11,000 deaths a year are down to the 'weekend effect'.\nSir Bruce Keogh, medical director of the NHS, once calculated that 11,000 deaths a year are down to the 'weekend effect'.\nProfessor Mike Grocott, critical care specialist, the University of Southampton, previously said: 'It might be about how quick people get to hospital, how many porters or other non-medical staff are working.\n'It might be that people are sicker when they get to hospital, because they may have been sitting at home for longer waiting for a GP appointment - we just do not know.'\nThe new findings come after researchers from Bristol University found elderly patients with fractured hips who have surgery on a Sunday are 10 per cent more likely to die in the following month.\nExperts believe provisions for such procedures are inadequate in many hospitals across the country, leaving people at risk.\nThe researchers looked at every single hip fracture that occurred in England and Wales between 2011 and 2014.\nThe researchers also found that being discharged from hospital on a Sunday for a fractured hip dramatically increased the risk of death.\nSuch patients had a 51.5 per cent higher chance of dying in the 30 days following the operation - when they are most at risk.\nYet a major study by Edinburgh University found the complete opposite.\nThe researchers concluded that weekend surgery is safe and those admitted on a Saturday or Sunday were more likely to be operated on sooner.\nResearch by Oxford University last May found that the discrepancies in death rates is down to differences in the way deaths are recorded - or 'coded'.\nThe lead author, Professor Peter Rothwell, said that when these inaccuracies are stripped out, the weekend effect disappears completely.\nAn NHS England spokesperson said: 'The NHS has set out clinical standards supported by the relevant medical royal colleges for improving weekend services, in the interests of staff and patients.'","url":"https://www.dailymail.co.uk/health/article-4447542/Going-hospital-weekend-deadly.html"}
