{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-22 23:39:09","date_modify":"2018-10-22 23:39:09","date_publish":"2016-01-11 06:59:16","description":"The 26-year-old actress had just one the first Golden Globe of her career. She stars in the drama Room.","filename":"data/vaneerConsumption/GoldenGlobesAward2016winnerBrieLarsonsaysKatyPerrysburgerswerebestmoment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/3005583600000578-0-image-a-99_1452491740201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393396_Brie-Larson-admits-favourite-moment-Golden-Globes-digging-hot-fresh-burgers-provided-Katy-Perry_1540251549.html","title":"Golden Globes Award 2016 winner Brie Larson says Katy Perry's burgers were best moment","title_page":"Golden Globes Award 2016 winner Brie Larson says Katy Perry's burgers were best moment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was just awarded the first Golden Globe of her career.\nBut forget the trophy - Brie Larson is still reeling from the moment Katy Perry shared out her InNOut burgers.\nThe 26-year-old referred to the surreal experience as her 'favourite moment' of the night as she spoke with the Golden Globes for an Instagram video.\nScroll down for video\n'Hot and fresh!' Brie Larson admitted that her favourite moment from the Golden Globes was returning to a table of In-N-Out Burgers that were provided by Katy Perry\nDig in! Brie's boyfriend Alex Greenwald, seated on either side of his girlfriend and Katy Perry, chowed down on a burger provided by Katy\n'My favorite moment was after I went back to my table after winning a Golden Globe, Katy Perry had a round of In-N-Out burgers for everybody! Hot and fresh!,' Brie said.\n'I've been feeling like I'm in a dream,' she added.\nThe actress' boyfriend Alex Greenwald was captured digging into one of the burgers as he sat on either side of Katy and Brie.\nSee our full Golden Globes coverage on the winners and red carpet moments\nLate night snack: Tablemate Denzel Washington seemed to be digging into the burgers as well\nCELEBRITY FAVOURITE BURGER CHAIN IN-N-OUT: In-N-Out Burger was founded in California by Harry and Esther Snyder in 1948. Now, 68 years later, the privately owned company boasts restaurants in 305 US locations. The fast food giant has famously become a celebrity favourite, with stars including Selena Gomez, Chloë Grace Moretz and Gordon Ramsay professing their love for the burger chain. The diner-style eatery offers three classic options - hamburger, cheeseburger and the 'Double-Double' although a secret menu is available at every branch.\nTablemate Denzel Washington also appeared to be enjoying a burger as well.\nBrie had just won the gong for Best Performance By An Actress In A Motion Picture Drama for her role in the film Room.\nRoom follows the story of Ma (Brie) who has been kidnapped and repeatedly raped in a shed, which she calls Room.\nShe gives birth to a son, Jack (Jacob Tremblay), and tries to use creativity and imagination to create a fulfilling life for her five-year-old son.\nAfter the mother-son duo escape, the boy's eyes are opened as he finally gets to see the outside world.\nBrie made sure to thank Jacob in her speech, referring to the young actor as 'half of this award! Half of my performance!\nShe came with food: Larson says Perry, pictured at the Golden Globes in Beverly Hills, brought a round of In-N-Out burgers for the table\n'I'm in a dream': The actress recalled the surreal experience, which took place directly after she gave her speech\nGrateful: Larson thanked her mother, her boyfriend Alex, and her co-star Jacob Tremblay after winning the first Golden Globe of her career\nThe actress also expressed gratitude towards Room author Emma Donoghue, her mother, and her boyfriend Alex Greenwald.\n'I can't believe this!' Brie gushed as she clutched her statue. 'I'm sorry to anyone I forgot, I'll write you a thank you card.'\nBrie, who has been in show business for nearly 20 years, was astonished when the nominations were announced.\n'What the heck you guys?' she sweetly said to the Today Show.\n'I can't even figure this whole thing out...so I was sitting between my parents and I still can't tell if this is a dream or not. It feels so special. I mean this is beyond anything I could've ever imagined.'\nAstonished: The actress was clearly stunned she had been named the winner as she gazed towards her boyfriend\nGolden girl: The 26-year-old flashed the flesh in a plunging gold metallic dress as she mingled on the red carpet\nHot metal: The 21 Jump Street actress turned heads in her glittering dress\nAward winning: Larson cuddled with her on-screen son Jacob Tremblay in Room\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393396/Brie-Larson-admits-favourite-moment-Golden-Globes-digging-hot-fresh-burgers-provided-Katy-Perry.html"}
