{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-22 23:51:12","date_modify":"2018-10-22 23:51:12","date_publish":"2016-01-11 07:46:52","description":"She's at the top of her game in every sense of the word, and Jennifer Lawrence made sure to celebrate her Golden Globe win on Sunday night in the best possible style.","filename":"data/vaneerConsumption/GoldenGlobewinnersJenniferLawrenceandLeonardoDiCapriocelebrate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3005E7C900000578-0-image-a-62_1452499775213.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393493_Leggy-Jennifer-Lawrence-looks-sensational-glitzy-LBD-fellow-winner-Leonardo-DiCaprio-celebrate-star-studded-Golden-Globes-FOX-afterparty_1540252272.html","title":"Golden Globe winners Jennifer Lawrence and Leonardo DiCaprio celebrate","title_page":"Golden Globe winners Jennifer Lawrence and Leonardo DiCaprio celebrate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's at the top of her game in every sense of the word, and Jennifer Lawrence made sure to celebrate her Golden Globe win on Sunday night in the best possible style.\nThe star - who won the award for Best Performance by an Actress in a Motion Picture Musical or Comedy for her role in Joy - looked sensational as she stepped out at the FOX afterparty in Los Angeles on Sunday sponsored by Heineken, hours after the glittering ceremony.\nAfter rocking the red carpet hours beforehand in an ab-flashing cut-out column gown, the 25-year-old opted for a far more party-friendly look, in a tiny black dress with glitzy embellishments.\nScroll down for video\nCelebrating in style! Jennifer Lawrence looked utterly sensational in a tiny LBD as she headed up the stars at the FOX Golden Globes afterparty in Los Angeles on Sunday\nJoining her at the post-show event was fellow award-winner Leonardo DiCaprio, who had bagged the Best Performance by an Actor in a Motion Picture Drama gong for The Revenant.\nGolden Globes golden girl Jennifer wowed as she flaunted her lovely, toned legs in the thigh-skimming little number that certainly signalled party time.\nComplete with mirrored embellishments, a low-plunging neckline and delicate straps, the dress flattered her enviable figure.\nSee the latest Jennifer Lawrence updates as she celebrates her Golden Globes win\nFlashing the flesh: Her tiny dress was cut to a tiny length, while also allowing the star to flaunt her toned arms and a hint of her chest\nWinning look: The 25-year-old - who won the award for Best Performance by an Actress in a Motion Picture Musical or Comedy for her role in Joy - glowed in her second outfit of the night\nWell don! Leonardo DiCaprio looked thrilled as he attended the post-show party, clutching his own Golden Globe, won for his role in The Revenant\nChuffed! Leo had addressed the audience at the Globes for his win, calling it 'an incredible honour' and that it 'meant a lot'\nHollywood's finest: The Hunger Games star oozed confidence as she posed up a storm on the red carpet\nThey're a powerful pair: Inside the soiree, Jennifer posed with Joy's director David O. Russell\nCongrats! Leonardo joined The Revenant's director Alejandro González Iñárritu, each of them clutching their prizes - Leo won Best Actor, while Alejandro bagged Best Director\nAfter having worn her blonde locks slicked back into a faux crop, the Hollywood beauty let them loose, worn in elegant curls hovering above her bare shoulders.\nShe looked thrilled as she prepared to party the night away at the star-studded bash, and was later seen inside the bash clutching her Golden Globe, her fourth.\nLeonardo, meanwhile, looked handsome in his slick tuxedo, proudly holding up his own golden prize on the red carpet with a huge smile on his face.\nGlamorous as ever! Lady Gaga was a true stunner in her figure-hugging off-shoulder black gown as she arrived at the post-show party\nMwah! The award-winning singer-turned-actress hammed it up on the red carpet\nSealed with a kiss! Gaga couldn't contain her excitement after accepting her prize\nAltogether now: Gaga posed with the CEO of Fox Jim Gianopulos (centre) and David O. Russell before heading into the bash\nShe won't let go! Lady Gaga kept her Best Actress Golden Globe - won for her role in American Horror Story - firmly as an accessory while inside the party\nBlonde bombshell: The star was channeling Marilyn Monroe with her platinum blonde bob\nBeautiful couple: Matt Damon - who won the Best Performance by an Actor in a Motion Picture Musical or Comedy prize for The Martian - was joined by his gorgeous wife Luciana Barroso\nThe 41-year-old star scored the Best Actor gong for hard-hitting flick The Revenant, which swept the board at the awards ceremony, winning Best Director for Alejandro González Iñárritu and also Best Picture Drama, beating out Carol, Mad Max: Fury Road, Room, and highly touted Spotlight.\nPlenty of other big-name stars took themselves from the Golden Globes ceremony - held at the Beverly Hilton in Los Angeles - to the FOX afterparty, including Matt Damon and his wife Luciana Barroso, Saoirse Ronan and Lady Gaga.\nSinger Gaga held on tightly to her Golden Globe - she won the Best Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television prize for her role as The Countess in American Horror Story.\nStill smiling: Saoirse Ronan may not have won the award she was nominated for on the night, but she still looked in great spirits as she attended the FOX bash\nWonder what they're joking about? Leo, 41, shared a joke in the giggling director's ear\nSo thrilled! Jennifer mingled with Jim Gianopulos at the star-studded afterparty, the look of glee firmly fixed on her face\nStunning: She showed off her enviable toned, tanned pins in the thigh-grazing mini dress\nHollywood hottie: Jennifer wore her golden locks in loose waves, tickling her bare shoulders\nThe 29-year-old wowed in her off-shoulder, figure-hugging black dress, kept on from her earlier turn at the ceremony, clearly feeling it had more to give and a night-time to last.\nSaoirse, 21, may not have won the Best Performance by an Actress in a Motion Picture Drama award for Brooklyn, but she looked in fantastic spirits as she went to join the other A-listers at the FOX party.\nThe one to watch wore a gorgeous white flowing gown, complete with a backless detail and long, ethereal skirt.\nMeanwhile, The Affair actress Ruth Wilson wowed in a marigold dress, a strapless number that clung tightly to her slender curves.\nParty hopping: Katy Perry headed on to the FOX party following the Weinstein bash\nProud moment: Director Ridley Scott, co-winner of the Best Motion Picture - Musical or Comedy award for The Martian, and leading man Matt Damon clutched their trophies as they posed with FOX executives\nGolden girl: Ruth Wilson wowed as she rocked up to the FOX 'do in a figure-hugging marigold dress\nBreakout star: Brooklyn beauty Saoirse Ronan kept her look classic and elegant\nChilling: Tobey Maguire cut a relaxed figure as he enjoyed himself at the bash\nGlam twosome: Terrence Howard and his wife Miranda Pak arrived arm-in-arm\nGlittering: Actress Gabourey Sidibe turned on the charm in her eye-catching pewter glittering gown\nBold look: Empire star Kaitlin Doubleday showed off a hint of her legs in a strapless black sheer-skirted number\n2016 GOLDEN GLOBE AWARDS WINNERS MOVIES Best Motion Picture - Drama: The Revenant Best Motion Picture - Comedy or Musical: The Martian Best Actress In A Drama: Brie Larson - Room Best Actor In A Drama: Leonardo DiCaprio - The Revenant Best Actress In A Musical Or Comedy: Jennifer Lawrence - Joy Best Actor In A Musical Or Comedy: Matt Damon - The Martian Best Supporting Actress: Kate Winslet - Steve Jobs Best Supporting Actor: Sylvester Stallone - Creed Best Director: Alejandro G. Iñárritu - The Revenant Best Screenplay: Aaron Sorkin - Steve Jobs Best Animated Film: Inside Out Best Foreign Language Film: Son of Saul - Hungary Best Original Score: Ennio Morricone - The Hateful Eight Best Original Song: Sam Smith Writing’s on the Wall from Spectre Cecil B DeMille Award: Denzel Washington TV Best Series - Drama: Mr Robot Best Series - Musical or Comedy: Mozart in the Jungle Best TV Movie Or Limited Series: Wolf Hall Best Actress In A Drama: Taraji P. Henson – Empire Best Actor In A Drama: Jon Hamm - Mad Men Best Actress In Musical or Comedy: Rachel Bloom – Crazy Ex-Girlfriend Best Actor In A Musical or Comedy: Gael García Bernal – Mozart in the Jungle Best Actress In A Limited Series or TV Movie: Lady Gaga – American Horror Story Best Actor In A Limited Series or TV Movie: Oscar Isaac – Show Me a Hero Best Supporting Actress: Maura Tierney – The Affair Best Supporting Actor: Christian Slater – Mr. Robot","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393493/Leggy-Jennifer-Lawrence-looks-sensational-glitzy-LBD-fellow-winner-Leonardo-DiCaprio-celebrate-star-studded-Golden-Globes-FOX-afterparty.html"}
