{"authors":["Cassie Carpenter For Dailymail.Com"],"date_download":"2018-10-22 22:00:50","date_modify":"2018-10-22 22:00:50","date_publish":"2016-01-11 02:01:03","description":"The 31-year-old trans-actress was joined by her OITNB co-stars Uzo Aduba and Taylor Schilling","filename":"data/vaneerConsumption/GoldenGlobes2016seesLaverneCoxbarehertonedarmsinElizabethKennedygown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/30025E1A00000578-0-image-a-69_1452480885427.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393152_Laverne-Cox-bares-toned-arms-white-Elizabeth-Kennedy-gown-attend-Golden-Globes-ceremony_1540245650.html","title":"Golden Globes 2016 sees Laverne Cox bare her toned arms in Elizabeth Kennedy gown","title_page":"Golden Globes 2016 sees Laverne Cox bare her toned arms in Elizabeth Kennedy gown | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Laverne Cox opted for virgin white to attend her very first Golden Globes ceremony at the Beverly Hilton in Beverly Hills on Sunday.\nStylist Christina Pacelli dressed the 31-year-old trans-actress in a sleeveless Elizabeth Kennedy gown, emerald Lorraine Schwartz jewelry, and a Nathalie Trad clutch.\nThe Orange Is the New Black star opted for a romantic updo with curled tendrils, long lashes, and vampy cabernet lipstick.\nScroll down for video and full list of winners\nRide that train! Laverne Cox opted for virgin white to attend her very first Golden Globes ceremony at the Beverly Hilton in Beverly Hills on Sunday\nThe back of Cox breathtaking, bridal-style gown was V-shaped, offering a long look down her toned back.\nBefore hitting the red carpet, Laverne got glam and pumped to the tunes of rapper Nicki Minaj's The Pinkprint album.\nThe Daytime Emmy winner had just landed in Los Angeles Saturday following a relaxing holiday in a mysterious tropical, beachy locale.\nSee our full coverage on the Golden Globes winners and red carpet style\nFierce: Stylist Christina Pacelli dressed the 31-year-old trans-actress in a sleeveless Elizabeth Kennedy gown, emerald Lorraine Schwartz jewelry, and a Nathalie Trad clutch\nStatuesque: The Orange Is the New Black star opted for a romantic updo with curled tendrils, long lashes, and vampy cabernet lipstick\nBack it up! The back of Cox breathtaking, bridal-style gown was V-shaped, offering a long look down her toned back\nWhile passing the press lines, the 5ft11in stunner bumped into Regina King, who matched her in a sleeveless gold-sequinned gown featuring a long white cape.\nAside from rooting for her Netflix hit to win best comedy series, Cox was likely cheering for possible best actress in a feature comedy - Lily Tomlin.\nThe LGBTQ advocate played a tattoo artist friend of the 76-year-old Oscar nominee in last year's indie drama Grandma.\n'#FeelingMyself': Before hitting the red carpet, Laverne got glam and pumped to the tunes of rapper Nicki Minaj's The Pinkprint album\nSun-kissed: The Daytime Emmy winner had just landed in Los Angeles Saturday following a relaxing holiday in a mysterious tropical, beachy locale\nHey girl! While passing the press lines, the 5ft11in stunner bumped into Regina King, who matched her in a sleeveless gold-sequinned gown featuring a long white cape\nGo girl! Aside from rooting for her Netflix hit to win best comedy series, Cox was likely cheering for possible best actress in a feature comedy - Lily Tomlin\nInked: The LGBTQ advocate played a tattoo artist friend of the 76-year-old Oscar nominee in last year's indie drama Grandma\nLaverne will reprise her role as Litchfield Penitentiary's hairdresser Sophia Burset in the 13-episode fourth season, which premieres in June.\n'It's changed my life and has an unprecedented diversity of women on television,' the Alabama-born beauty told E! reporter Ryan Seacrest on the red carpet.\n'We're going deeper into the issues of these women and the criminal justice system...It's getting even more real, if you can believe it.'\n'It's changed my life': Laverne will reprise her role as Litchfield Penitentiary's hairdresser Sophia Burset in the 13-episode fourth season, which premieres in June\nThe Alabama-born beauty told E! reporter Ryan Seacrest on the red carpet: 'We're going deeper into the issues of these women and the criminal justice system...It's getting even more real, if you can believe it'\nCox's co-star Uzo Aduba was the only OITNB castmember to score a solo nomination, but lost the supporting trophy to The Affair's Maura Tierney.\nThe Emmy winner - who turns 35 next month - donned a sophisticated black-sequinned gown selected by her stylist Cristina Ehrlich.\nThe American-born Nigerian actress - born Uzoamaka - also scored a SAG Award nod for her eccentric character Suzanne 'Crazy Eyes' Warren.\nBetter luck next time! Cox's co-star Uzo Aduba was the only OITNB castmember to score a solo nomination, but lost the supporting trophy to The Affair's Maura Tierney\nConnected sleeves? The Emmy winner - who turns 35 next month - donned a sophisticated black-sequinned gown selected by her stylist Cristina Ehrlich\nScene stealer: The American-born Nigerian actress - born Uzoamaka - also scored a SAG Award nod for her eccentric character Suzanne 'Crazy Eyes' Warren\n'Behind the scenes': Laverne and her fellow 'inmates' will also compete for SAG's best comedy ensemble trophy at the ceremony airing January 30 on TNT/TBS\nFlashing her chest: Also at the Globes was the TIME cover girl's co-star Taylor Schilling, also rocking a romantic updo\nHead-to-toe black: Stylist Penny Lovell dressed the willowy 31-year-old blonde in a plunging black sparkly jumpsuit, matching pumps, and a clutch by Anya Hindmarch\nLaverne and her fellow 'inmates' will also compete for SAG's best comedy ensemble trophy at the ceremony airing January 30 on TNT/TBS.\nAlso at the Globes was the TIME cover girl's co-star Taylor Schilling, also rocking a romantic updo.\nStylist Penny Lovell dressed the willowy 31-year-old blonde in a plunging black sparkly jumpsuit, matching pumps, and a clutch by Anya Hindmarch.\nNBC airs the 73rd Annual Golden Globe Awards Sunday night, and the booze-filled ceremony will be hosted for the fourth time by Ricky Gervais.\n'I'm on my way': NBC airs the 73rd Annual Golden Globe Awards Sunday night, and the booze-filled ceremony will be hosted for the fourth time by Ricky Gervais\n2016 GOLDEN GLOBE AWARD WINNERS - TELEVISION Best Performance by an Actress in a Limited Series or Motion Picture Made for Television Uzo Aduba, Orange is the New Black Joanne Froggatt, Downton Abbey Regina King, American Crime Judith Light, Transparent Maura Tierney, The Affair Best Performance by an Actor in a Limited Series or Motion Picture Made for Television Idris Elba, Luther Oscar Isaac, Show Me a Hero David Oyelowo, Nightingale Mark Rylance, Wolf Hall Patrick Wilson, Fargo Best Performance by an Actress in a Television Series – Drama Caitriona Balfe, Outlander Viola Davis, How to Get Away with Murder Taraji P Henson, Empire Eva Green, Penny Dreadful Robin Wright, House of Cards Best Performance by an Actor in a Television Series – Musical or Comedy Aziz Ansari, Master of None Gael Garcia Bernal, Mozart In The Jungle Rob Lowe, The Grinder Patrick Stewart, Blunt Talk Jeffrey Tambor, Transparent Best Performance by an Actor in a Television Series – Drama Jon Hamm, Mad Men Rami Malek, Mr Robot Wagner Maura, Narcos Bob Odenkirk, Better Call Saul Liev Shreiber, Ray Donovan Best Performance by an Actress in a Television Series – Musical or Comedy Rachel Bloom, Crazy Ex-Girlfriend Jamie Lee Curtis, Scream Queens Julia Louis Dreyfus, Veep Gina Rodriguez, Jane the Virgin Lily Tomlin, Grace and Frankie\nBest Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Lady Gaga, American Horror Story Sarah Haye, Flesh and Bone Felicity Huffman, American Crimes Queen Latifah, Bessie Kirsten Dunst, Fargo Best Television Limited Series or Motion Picture Made for Television American Horror Story Fargo Flesh And Bone Stars Wolf Hall Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Alan Cumming, The Good Wife Damian Lewis, Wolfhall Ben Mendelson, Bloodline Tobias Menzies, Outlander Christian Slater, Mr Robot Best Television Series - Musical or Comedy Orange Is The New Black Silicon Valley Transparent Veep Casual Mozart In The Jungle Best Television Series - Drama Empire Game of Thrones Mr Robot Narcos Outlander","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393152/Laverne-Cox-bares-toned-arms-white-Elizabeth-Kennedy-gown-attend-Golden-Globes-ceremony.html"}
