{"authors":["Portia Crowe"],"date_download":"2018-10-30 23:04:09","date_modify":"2018-10-30 23:04:09","date_publish":"2016-12-08 00:00:00","description":"\"He's a very smart guy, a businessman,\" Blankfein said in an interview with Germany's Handelsblatt. \"I am not pessimistic at all because he won.\"","filename":"data/vaneerConsumption/GoldmanSachsLloydBlankfeininterviewonTrump.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-lloyd-blankfein-interview-on-trump-2016-12_1540940649.html","title":"Goldman Sachs' Lloyd Blankfein interview on Trump","title_page":"    Goldman Sachs' Lloyd Blankfein interview on Trump - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Goldman Sachs CEO Lloyd Blankfein. Joe Raedle/Getty Images Goldman Sachs CEO Lloyd Blankfein may not have voted for President-elect Donald Trump, but he is ready to give him the benefit of the doubt.\n\"Mr. Trump may turn out to be a much better president than anyone else might have been in that place,\" Blankfein said in an interview with the German newspaper Handelsblatt.\n\"He's a very smart guy, a businessman …I am not pessimistic at all because he won.\"\nBlankfein supported Trump's rival, Democratic nominee Hillary Clinton, in the election, and donated to her campaign in 2008.\n\"I think her positioning, not only in terms of her ideology, but what I regard as a pragmatism that I saw demonstrated when she was our senator and in earlier stages of her political career when she could cross the aisle and engage other people to get things done, I admire that,\" Blankfein said in a CNN interview in October.\n\"It stands out a little today — that kind of willingness to engage and compromise, but let's just stop at engage — that willingness to engage is a scarcer commodity these days.\"\nBut now he says he's going to give Trump a chance.\n\"If there are policies that are more stimulative, our fortunes rise along with that. ... The declared policies of Mr. Trump are therefore a good thing,\" he told Handelsblatt.\nThe Wall Street executive also said he would consider joining the administration, according to the interview, though he has not been approached by Trump's transition team.\nTrump appointed former Goldman Sachs banker Steven Mnuchin Treasury secretary last month, and Steve Bannon, his incoming chief strategist, is also a Goldman Sachs alum. The president-elect is also reportedly considering Goldman Sachs COO and President Gary Cohn for a role in the administration.\nGoldman Sachs shares are up 30% since Trump's victory on November 8.\nRead the full interview in Handelsblatt»","url":"https://www.businessinsider.com/goldman-sachs-lloyd-blankfein-interview-on-trump-2016-12"}
