{"authors":["Portia Crowe"],"date_download":"2018-10-30 21:48:52","date_modify":"2018-10-30 21:48:52","date_publish":"2016-12-18 00:00:00","description":"Goldman Sachs has undergone a changing of the guard in 2016.","filename":"data/vaneerConsumption/GoldmanSachsleadershipshakeup.json","image_url":"https://amp.businessinsider.com/images/58571a56a1a45e95648b580a-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-leadership-shakeup-2016-12_1540936132.html","title":"Goldman Sachs' leadership shakeup","title_page":"    Goldman Sachs' leadership shakeup - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Goldman Sachs CEO Lloyd Blankfein. Joe Raedle/Getty Images There has been a changing of the guard at Goldman Sachs in 2016.\nThe global investment bank's no. 2 executive, COO and President Gary Cohn, on December 12 announced he would leave the bank to join President-elect Trump's administration as National Economic Council director.\nThe 56-year-old executive who spent 26 years at the firm will be replaced by the current chief financial officer, Harvey Schwartz, and global investment banking cohead David Solomon, who will split both roles.\nThe current chief information officer, Marty Chavez, a former tech exec, will take over as CFO. Richard Gnodde and Pablo Salame have been named vice chairmen at the bank.\nIt's not just Cohn who has left the firm this year. A handful of senior partners and members of the management committee — the all-important \"inner circle\" of senior executives — have departed in recent months.\nThose include Michael Sherwood, the London-based co-CEO of Goldman Sachs International who was seen as a future CEO contender, and Mark Schwartz, a vice chairman and chairman of Goldman Sachs Asia Pacific. Together with Cohn, they made up three of the four most senior people at the firm.\nA look at the management committee list on Goldman Sachs' website drives the point home. Only one of the four people remain: CEO Blankfein himself.\nGoldman Sachs\nThe order in which the committee members are listed is not immediately obvious: first come the CEO and COO, then the vice chairmen, then the rest of the management committee members are listed by partner year. Within partner year, they are listed alphabetically.\nThese are not the only senior level changes in past 12 months at Goldman Sachs. This time last year, the bank named Gregg Lemkau, Marc Nachmann and Jim Esposito to the management committee. They replaced Gordon Dyal, John Weinberg, and Christopher Cole on the panel, all of whom retired.\nStill, the placement is symbolic of Blankfein's indisputable hold of the firm's top job — a position he's held for just over 10 years. The 62-year-old CEO, who was diagnosed with cancer in 2015 and is now in remission, has repeatedly said he has no plans of retiring anytime soon.\nThere have been senior level changes below the management committee in 2016, too. Business Insider reported in September that there had been 18 partner-level departures from key roles in the securities business in the US and Europe in 2016.\nThose include Tom Cornacchia, the global cohead of fixed income, currency and commodity — FICC — sales at the bank, left the firm in September. His former cohead, Dalinc Ariburnu, left earlier in the year. Most recently, the bank announced that Richard Tufft, the co-chief operating officer of research, would retire from the bank.\nIn short, it appears room is being created for a new generation of leaders at Goldman Sachs.","url":"https://www.businessinsider.com/goldman-sachs-leadership-shakeup-2016-12"}
