{"authors":["Kayla Caldwell For Dailymail.Com"],"date_download":"2018-10-23 03:31:12","date_modify":"2018-10-23 03:31:12","date_publish":"2016-01-11 16:06:08","description":"The Empire star swapped out her striking Stella McCartney gown for a fitted number with a slightly smaller train after her gorgeous dress was trampled twice during the show.","filename":"data/vaneerConsumption/GoldenGlobewinnerTarajiPHensonditchesthedramaticcapeforapinkgown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300CEE2400000578-0-image-a-53_1452532517555.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394031_Taraji-P-Henson-ditches-dramatic-cape-fitted-pink-gown-Golden-Globes-party-dress-stepped-TWICE-show_1540265472.html","title":"Golden Globe winner Taraji P. Henson ditches the dramatic cape for a pink gown","title_page":"Golden Globe winner Taraji P. Henson ditches the dramatic cape for a pink gown | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Taraji P. Henson was elated on Sunday, as she took to the stage to accept her first Golden Globe for portraying Empire fan-favorite Cookie Lyon.\nBut the 45-year-old hit a bit of a snag as someone stepped on her dress as she walked onstage - the second time it had happened that night.\nSo when she arrived at the InStyle and Warner Brothers Post-Party, she made sure to ditch the glamorous cape train in a fitted, pale pink frock that highlighted her toned figure.\nScroll down for video\nPretty in pink! Taraji P. Henson looked gorgeous in a form-fitting pink gown as she arrived at the InStyle and Warner Brothers Post-Party following the Golden Globes on Sunday\nThe spaghetti strap dress featured a low cut neckline with lace embellishments as well as floral detailing around the bust.\nThe flattering dress fell to the floor, also featuring a slightly smaller train than Taraji's earlier Stella McCartney stunner.\nShe wore the figure-hugging number without a necklace, instead opting for dramatic, dangling earrings and a few coordinating silver rings.\nWinner, winner: The Empire star smiled as she showed off her Golden Globe after being rewarded for her performance on the Fox hit as fan-favorite Cookie Lyon\nQuick change: The raven-haired beauty swapped out her dramatic, white gown for a pale pink number with a slightly shorter train as she headed to Golden Globes after parties\nAnd of course, the newly announced award winner toted her Golden Globes trophy as she arrived at the party.\nTaraji showed off a big smile as she posed alongside her Empire family: Jussie Smollett, Grace Gealey, and Trai Byers.\nJussie looked suave for the occasion in a black suit, worn with a coordinating bow tie and shiny, black dress shoes.\nCelebrating: Taraji excitedly held her award in the air as she posed beside her Empire co-stars (L to R) Jussie Smollett, Grace Gealey, and Trai Byers\nDapper: The Fox stars all looked stunning for the Golden Globes after party at The Beverly Hilton Hotel\nAnother of Taraji's onscreen sons Trai stood out in a purple suit with black trim, which he sported with a black tie and coordinating dress shoes.\nGrace - engaged to co-star Trai - stunned in a strapless, crimson gown with cut-outs along the front and sides, and a flowing train.\nThe mother-of-one held her award in the air as she posed beside her cast members, before putting it down for another shot in which she could be seen shouting in excitement.\nClose cast: Taraji looked thrilled to be posing beside two of her onscreen sons as well as her onscreen rival, Grace\nNot again! As she made her way to the stage to accept her award, someone stepped on her beautiful Stella McCartney dress - the second time it had happened that night\nMeanwhile, earlier that night the FOX star had had someone yank on her dress as she made her way up to the stage for her big moment.\nShe couldn't hide her dismay as the train of her gown was caught under someone's shoes, a look of shock coming across her face before she made her emphatic speech.\nJust before that, Taraji's co-star Terrence Howard had stepped on her gown when they presented an award together.\nAs the 46-year-old actor accidentally stepped on her floor-length frock she made sure to exaggerate her reaction for the crowd.\nOver it: The Golden Globe winner clearly did not appreciate someone stepping on her stunning gown for the SECOND time that night, and later switched into a dress with no cape and a shorter train\nWhoops! Taraji's Empire co-star Terrence Howard had accidentally stepped on her gown when the two were onstage together presenting the award for Best Performance by an Actress in a Television Series - Musical or Comedy\nTerrence clearly felt terrible about the incident, as he was then seen checking on his gorgeous co-star after his misstep.\nTerrence, who plays drug dealer turned music mogul Lucious Lyon, looked dapper in a chocolate brown tuxedo at the star-studded awards ceremony.\nHenson stars in the hit show as ex-con turned 'momager' Cookie Lyon, which is executive produced by Lee Daniels and is set for a spin-off, which will be a prequel to Empire.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394031/Taraji-P-Henson-ditches-dramatic-cape-fitted-pink-gown-Golden-Globes-party-dress-stepped-TWICE-show.html"}
