{"authors":["Matt Turner"],"date_download":"2018-10-30 21:44:26","date_modify":"2018-10-30 21:44:26","date_publish":"2016-12-19 00:00:00","description":"We're closing in on the end of 2016, and that means it's rankings time.","filename":"data/vaneerConsumption/GoldmanSachstopsMArankings.json","image_url":"https://amp.businessinsider.com/images/58482d27e02ba730208b7aea-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-tops-ma-rankings-2016-12_1540935866.html","title":"Goldman Sachs tops M&A rankings","title_page":"    Goldman Sachs tops M&A rankings - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Goldman Sachs Chairman and CEO Lloyd Blankfein attends the Clinton Global Initiative), on September 24, 2014 John Moore/Getty Images We're closing in on the end of 2016, and that means it's rankings time.\nYes, Wall Street banks care a lot about where they stack up against their rivals. They tout where they placed in each business line at the top of their earnings statement, and their ranking appears in just about every pitch book they hand out.\nAnd in the M&A business, there's one clear winner. It's not even close. Goldman Sachs dominated the competition, and is on course to finish 2016 at the top of the volume and fee rankings globally, in the US, in Europe, and in Asia Pacific (ex Japan), according to Dealogic.\nGlobal M&A stands at $3.69 trillion in the year to December 16, down from the 2015 full year total of $4.66 trillion, but still one of the most active years on record. Goldman Sachs worked on $919.7 billion of deal activity, good for a 25% market share, according to Dealogic.\nThe performance is especially striking, as Goldman missed out on the two biggest deals of the year: the $108 billion AT&T deal for Time Warner, and Bayer's $66.3 billion deal for Monsanto. Still, it landed a role on six of the remaining eight biggest deals.\nHere are the rankings from Dealogic:","url":"https://www.businessinsider.com/goldman-sachs-tops-ma-rankings-2016-12"}
