{"authors":["Matt Turner"],"date_download":"2018-10-30 22:23:28","date_modify":"2018-10-30 22:23:28","date_publish":"2016-12-14 00:00:00","description":"There has been a shake-up in the ranks at Goldman Sachs, and a tatted-up former tech exec has been handed a key role.","filename":"data/vaneerConsumption/GoldmanSachsnamesMartyChavezCFO.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-names-marty-chavez-cfo-2016-12_1540938208.html","title":"Goldman Sachs names Marty Chavez CFO","title_page":"    Goldman Sachs names Marty Chavez CFO - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images/ Fernanda Calfat There has been a shake-up in the ranks at Goldman Sachs, and a tatted-up former tech exec has been handed a key role.\nThe US bank named David Solomon and Harvey Schwartz as co-chief operating officers for the bank, replacing longtime COO Gary Cohn, according to an announcement on Wednesday.\nSchwartz is CFO of the company and will stay in that role until the end of April 2017, when he will be replaced by Martin Chavez, who is currently the chief information officer.\nChavez is far from your average Wall Streeter. He has been leading Goldman Sachs' technology efforts, and he led the development of the firm's own programming language for risk calculations.\nHe also breaks the mold of a typical Wall Street executive. A onetime tech startup founder, he is part of a small group of senior Latino executives at Goldman; just 3.5% of the firm's senior officials and managers identify as Hispanic or Latino.\nWhen he joined the bank in 1993, he was one of its first openly gay employees. He sports a sleeve of tattoos.\nChavez has followed an unusual path to the C-suite at Goldman Sachs. In a candid conversation with Goldman interns earlier this year, Chavez confessed that before attending Harvard he had never been east of New Mexico, where he grew up.\nHe was approached by a headhunter for Goldman while pursuing a Ph.D. in computer science at Stamford, joining the US bank to be a \"computer geek,\" before eventually moving to the commodities trading desk.\nHe then left to join Credit Suisse before leaving banking altogether to found Kiodex, a commodities risk-management software company. SunGard acquired Kiodex in 2004, and Chavez retired to a beach house on Fire Island.\nCohn later called Chavez to congratulate him on the sale of his company. Then he said, \"I was just calling to share with you that you're coming back.\"\nA decade later, Cohn's departure has led to Chavez getting a big promotion.","url":"https://www.businessinsider.com/goldman-sachs-names-marty-chavez-cfo-2016-12"}
