{"authors":["Valerie Siebert For Dailymail.Com"],"date_download":"2018-10-22 22:16:37","date_modify":"2018-10-22 22:16:37","date_publish":"2016-01-11 02:58:53","description":"The 73nd Annual Golden Globe Awards took place at The Beverly Hilton Hotel, California on Sunday night and while many attendees shone brightly, others simply fell flat.","filename":"data/vaneerConsumption/GoldenGlobes2016redcarpetworstdressedwithCateBlanchettandJaneFonda.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001D98500000578-0-image-a-84_1452476165954.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393256_From-disastrous-dresses-ridiculous-ruffles-terrible-tuxedos-FEMAIL-reveals-celebrities-vying-title-WORST-dressed-year-s-Golden-Globes_1540246597.html","title":"Golden Globes 2016 red carpet worst dressed with Cate Blanchett and Jane Fonda","title_page":"Golden Globes 2016 red carpet worst dressed with Cate Blanchett and Jane Fonda | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's not only a big night for Hollywood talent looking for recognition of their on-screen talent, but it's also a night where fashion is a main focus.\nAnd while many of the attendees of this year's Golden Globes lived up to the awards show's glamorous name, many of the big hitters on the red carpet suffered a serious swing and a miss.\nThe usually-elegant Cate Blanchett, 46, missed the mark in a pale pink Givenchy dress, which was covered in hair-esque tassels, including a long chunk that appeared to emerge from her rear like a horse's tail.\nFringe from tip to tail: Cate Blanchett, 46, was all lace, fringe and cotton candy pink in her unique Givenchy red carpet pick\nLoving lamp: Jane Fonda looks fabulous at 78, but the massive ruffles on this gown distracted from an otherwise-gorgeous look\nCake top: Jane's massive, triple-tiered ruffle complicated an otherwise elegant ensemble and even inspired a variety of comedic comparisons including to a French custard dessert and a Pierrot clown\nThe backless number also included a series of lace panels at the front in a sort of cross shape and her odd asymmetrical hairstyle didn't win her any extra elegance points.\nJane Fonda is looking phenomenal for 78, but that doesn't mean we want to see her jumping out of a cake any time soon. Yet that appeared to be just what the Grace and Frankie actress seemed to be doing in her red carpet effort.\nPart wedding cake, part lampshade, the simple white frock was topped with a huge, triple-tiered ruffle that engulfed the top half of her body. Twitter immediately reacted with a series of hilarious comparisons to everything from a toilet brush to a Pierrot clown.\n30-year-old Rooney Mara's Alexander McQueen's flesh-colored gown had the Carol star looking totally washed out - although her make-up and hair were beautifully done - not to mention the dress appeared to be purposefully-torn on the sleeved and bodice.\nRegina King, 44, went the route of extreme glitter, but looked as if she had just rolled off the set of Thor with a golden Krikor Jabotian dress adorned with massive sequins sewn in the shape of giant flowers.\nBut the worst part of the outfit was a genuine white cape that emerged from the neck piece on the outfit it a true superhero style.\nTattered: Rooney Mara, 30, looked washed out and messy in this torn-up, nude Alexander McQueen gown\nFly away: Regina King could have been a Marvel film superhero extra in this heavily-sequined Krikor Jabotian dress, which was finished off with an over-the-top white cape emerging from the neck piece\nHiding away: Despite losing an impressive 50 pounds, funny lady Melissa McCarthy, 45, didn't opt to show off her figure at all in this draping, shiny outfit, which did little to flatter her newly-slimmed down physique\nToo much going on: While Eva Longoria, 40, was able to showcase her enviable curves in her gown, the design itself looked slightly like an embroidered dinner napkin and had far too much embellishment in the form of the flowers, belt, and bow detailing\n40-year-old Texan beauty Eva Longoria hit the carpet without her new fiancé Jose Antonio Baston but sported a white gown that was a thing of beauty from the back - but less so from the front.\nThe dress resembled a fancy dinner napkin, complete with embroidered flowers on each hip and a thin gold belt around her middle, which looked somewhat like a piece of leftover Christmas wrapping ribbon. On the upside, the form-fitting number did allow Eva to showcase her enviable hourglass figure, and from the back looked simply stunning.\nMelissa McCarthy, 45, is looking slim and fantastic of late after dropping 50lbs, but opted not to show off her figure at all with and extremely flowing, extremely shiny ensemble that hid her curves.\nThe color-blocked curves on 29-year-old Olivia Palermo's Delpozo gown similarly did nothing to accentuate her phenomenal figure.\nOn the flip side, Ugly Betty star America Ferrera's dress was a-ok when it came to the shape - but failed miserably in the color department. The brash yellow shade of the gown did little to flatter the star's complexion, and the crystal-esque embellishments did little to improve its overall appearance.\nGame of Thrones star Natalie Dormer, 33, also missed the mark in her ruby red and black J. Mendel gown with an obscure neckline - which was beautiful from the back, but, from the front, left the blonde beauty looking somewhat boxy. The color, on the hand, was a total hit, and did a great deal to flatter the actress' British rose coloring.\nBoxed away: The color-blocked curves on 29-year-old Olivia Palermo's chunky Delpozo outfit hit her fantastic figure\nNot-so-mellow yellow: America Ferrera's garish gown drew a little bit too much attention, in all the wrong ways thanks to its over-the-top coloring and slightly tacky embellishments\nFailing to impress: Game of Thrones star Natalie Dormer, 33, similarly fell short with this boxy red J. Mendel gown\nOver-the-top: Carly Chaikin, 25, (left) overdid the sequins with her black, teal and purple dress, while Sarah Hay, 28, (right) took tulle to dizzying heights\nCarly Chaikin, 25, and Sarah Hay, 28, also fell victim to sartorial excess with their red carpet looks; the former went over the top with too many sequins and the latter simply opted for too much tulle which, coupled with the pale grey shade of the dress, left her looking somewhat washed out.\nWiz Khalifa, 28, meanwhile, looked more like a schoolboy skipping class in his loosened tie and too-short Tom Brown trousers - and certainly did nothing to dispel that idea as he made a smoking gesture at the cameras. He also skipped out on socks, but did manage to redeem himself by adding a swanky pair of Gucci loafers.\nOn his arm was his mother Katie 'Peachie' Wimbush, who turned up looking like the teacher to her son's schoolboy in a business-like button-up blouse and skirt, with her hair in a series of knots atop her head.\nWhile there is nothing wrong with a stylish pantsuit on the red carpet, Transparent star Judith Light, 66, made the odd choice of going all-white - but failed to even match every element of her outfit in the same shade, instead choosing slightly varying tones for her shirt and suit, which featured a garish racing stripe down the side of her pant leg. She then topped off the look with a matching over-sized cummerbund.\nQuite the pair: Wiz Khalifa, 28, looked like a schoolboy with his short pants and loose tie while his mother Peachie Wimbush took on a teacher-type style\nActing his age: Wiz made a smoking gesture at the photographers, while sporting a Tom Brown suit with pants swinging above his ankles, which did, in fairness, allow him to show off his swanky Gucci loafers\nStaying bright: Transparent star Judith Light, 66, (left) matched white with off-white and topped it off with a cummerbund while 44-year-old Michaela Watkins' custom Siriano gown seemed snug and loose in all the wrong places\nStaying alive: Portia Doubleday, 27, of Mr. Robot tried to go futuristic, but ended up looking like a walking disco ball\nActress Michaela Watkins, 44, may have picked a stunning color for her custom Siriano gown, but the tailoring was way off when it came to flattering her figure, leaving her waistline surrounded by too much material, creating a disappointingly-dowdy effect.\n27-year-old Mr. Robot star Portia Doubleday certainly lived up to the futuristic premise of her show with a silver textured gown. However, the overall effect was more disco ball than cyber-stylish.\nOlive Kitteridge actress Zoe Kazan, 32, on the other hand, was nearly a red carpet hit with a pale pink and peach-colored chiffon gown with crisscrossing lines, but sadly missed with the ill-fitting bodice, which likely would have been improved with the addition of a padded bra.\nSo close: Paul Dano's lady Zoe Kazan, 32, of Olive Kitteridge fame was close to glory with this dress, but things just didn't fit right up top\nAll black: Maril Davis seemed to be channeling Morticia Adams in a sundress with her strange black lace ensemble\nBlacking out: Tiziana Rocca (left) was simply too much in this over-ruffled, yet see-through gown while Caitriona Balfe, 36, (right) was nearly perfection but for the ill-placed ruffles","url":"https://www.dailymail.co.uk/femail/article-3393256/From-disastrous-dresses-ridiculous-ruffles-terrible-tuxedos-FEMAIL-reveals-celebrities-vying-title-WORST-dressed-year-s-Golden-Globes.html"}
