{"authors":["Abe Hawken For Mailonline"],"date_download":"2018-10-23 04:56:41","date_modify":"2018-10-23 04:56:41","date_publish":"2017-04-26 16:32:08","description":"The adorable pet immediately fell to the ground in Barcelona after hearing the wind instrument being played - and would not move until the classical song had finished.","filename":"data/vaneerConsumption/GoldenRetrieverliesdowntolistentoBarcelonamusician.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3F9FEE9200000578-0-image-a-84_1493220183125.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448298_Golden-Retriever-lies-listen-Barcelona-musician_1540270601.html","title":"Golden Retriever lies down to listen to Barcelona musician","title_page":"Golden Retriever lies down to listen to Barcelona musician | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Golden Retriever was enjoying a busker's performance so much that it refused to move until the end of the classical piece.\nThe adorable pet immediately fell to the ground in Barcelona after hearing the wind instrument being played.\nHis owner tried to pull him up by tugging on its lead but the dog was not budging, despite receiving a lot of attention from the locals.\nThe dog was just yards away from the busker who was playing a wind instrument in Barcelona\nTwo people who were passing by stopped to stroke the dog who had decided to lay down on the ground in the city centre.\nAt the end of the song, he jumped up and was ready to walk back to its home.\nNeil Kean was outside the famous Cathedral of the Holy Cross and Saint Eulalia in Barcelona and filmed the fascinating moment the dog decided to lie down.\nOne person commented: 'Probably remembering his puppy love days.'\nAfter hearing the classical song, the Golden Retriever dropped to the ground so it could appreciate the music","url":"https://www.dailymail.co.uk/news/article-4448298/Golden-Retriever-lies-listen-Barcelona-musician.html"}
