{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 00:00:49","date_modify":"2018-10-23 00:00:49","date_publish":"2016-01-11 08:06:52","description":"After both winning Golden Globes, undoubtedly their parts will go on and on. Kate Winslet and Leonardo DiCaprio had themselves a Titanic reunion at the Beverly Hilton on Sunday night.","filename":"data/vaneerConsumption/GoldenGlobewinnersKateWinsletandLeonardoDiCapriohuginTitanicreunion.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005E54200000578-0-image-a-44_1452498301906.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393495_Kate-Winslet-Leonardo-DiCaprio-hug-Titanic-reunion-winning-Golden-Globes_1540252849.html","title":"Golden Globe winners Kate Winslet and Leonardo DiCaprio hug in Titanic reunion","title_page":"Golden Globe winners Kate Winslet and Leonardo DiCaprio hug in Titanic reunion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kate Winslet and Leonardo DiCaprio had themselves a Titanic reunion at the Beverly Hilton on Sunday night.\nThe 40-year-old actress was among the first to congratulate her former co-star after he scooped the Best Actor in a Drama award for his turn in The Revenant.\nAs the two embraced, Twitter ignited with nostalgic tweets about what arguably remains both their most famous roles, now almost 20 years old.\nScroll down for video\nNever let go, Rose: Kate Winslet and Leonardo DiCaprio hugged it out in a Titanic reunion after both winning Golden Globes on Sunday night\nLeo no doubt had a few congratulatory words to whisper in Kate's ear too, as she had scooped the very first award of the night - Best Supporting Actress - for her role in Steve Jobs.\nThe pair are currently tied on 11 all time Golden Globe nominations each - both picked up noms for Titanic, as well as their other collaboration, 2008's Revolutionary Road, although Kate followed through with a win that year.\nSee Leonardo DiCaprio updates as he and Kate Winslet reunite after Golden Globe wins\nYou jump, I jump: The 40-year-old actress was among the first to congratulate her former co-star after he scooped the Best Actor in a Drama award for his turn in The Revenant\nReciprocated: Leo no doubt had a few congratulatory words to whisper in Kate's ear too, as she had scooped the very first award of the night - Best Supporting Actress - for her role in Steve Jobs\nKate can also gloat with her four wins to his three - plus she can boast being one of only four people to have ever won two acting Globes in the same year: Best Actress in a Drama for Revolutionary Road and Best Supporting actress for The Reader in 2009.\nThat was also the year Winslet finally won her Oscar for The Reader - an accolade that has thus far eluded DiCaprio despite five previous nominations - although many believe this may be his year.\nAlthough winners acting surprised is a well worn cliche at awards ceremonies, Winslet looked genuinely stunned when he name was read out at the top of the night for her portrayal of Joanna Hoffman in the Apple co-founder's biopic.\nRace: The pair are currently tied on 11 all time Golden Globe nominations each - both picked up noms for Titanic, as well as their other collaboration, 2008's Revolutionary Road\nEdging it: Kate can also gloat with her four wins to his three - plus she can boast being one of only four people to have ever won two acting Globes in the same year\nJack & Rose: As the two embraced, Twitter ignited with nostalgic tweets about what arguably remains both their most famous roles, now almost 20 years old\n'I am extremely surprised and overwhelmed. I just want to start by saying what an incredible year for women in film,' she said. 'These categories are so crowded and crammed with incredible integrity and skill and I feel prouder than ever to be included.'\nAfter picking up the penultimate award of the night to a standing ovation for his portrayal of fur trapper Hugh Glass in the revenge epic, DiCaprio diverted all the praise onto the film's director.\n'This film was about survival, adaptation and the triumph of the human spirit and more importantly it was about trust,' he said.\nFlying: Titanic - which won four Golden Globes - currently holds the joint-records for most Academy Award nominations (14, with All About Eve) and wins (11, with Ben-Hur and The Lord Of The Rings: The Return Of The King)\nAcclaimed: Winslet won on the night for her portrayal of Joanna Hoffman in the Apple co-founder's biopic; while Leo picked up the penultimate award of the night to a standing ovation for his portrayal of fur trapper Hugh Glass in the revenge epic\n'There is nobody more deserving of that trust than our director Alejandro Inarritu. I've never had an experience like this in my entire life. The depths he went to are unfathomable.'\nTitanic - which won four Golden Globes - currently holds the joint-records for most Academy Award nominations (14, with All About Eve) and wins (11, with Ben-Hur and The Lord Of The Rings: The Return Of The King).\nThe 2016 Oscar Nominations will be unveiled on Thursday.\nModest: In his acceptance speech, DiCaprio diverted all the praise onto the film's director, Alejandro Inarritu\nShocked: Although winners acting surprised is a well worn cliche at awards ceremonies, Winslet looked genuinely stunned when he name was read out at the top of the night","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393495/Kate-Winslet-Leonardo-DiCaprio-hug-Titanic-reunion-winning-Golden-Globes.html"}
