{"authors":["Ollie Gillman For Dailymail.Com"],"date_download":"2018-10-22 22:08:50","date_modify":"2018-10-22 22:08:50","date_publish":"2016-01-11 02:36:29","description":"This year's Golden Globes was more obscene than graceful, with celebrities swearing in nigh on every speech.","filename":"data/vaneerConsumption/GoldenGlobes2016wasthemostfoulmouthedoneyetwithAmySchumerandJonahHill.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/3005373200000578-0-image-a-2_1452493877150.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393257_Amy-Schumer-censored-dropping-C-word-teaming-BFF-Jennifer-Lawrence-Golden-Globes_1540246130.html","title":"Golden Globes 2016 was the most foul mouthed one yet with Amy Schumer and Jonah Hill","title_page":"Golden Globes 2016 was the most foul mouthed one yet with Amy Schumer and Jonah Hill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is supposed to be a night of glitz and glamour, with celebrities arriving in elegant gowns and suave suits to celebrate the great and good of the film industry.\nBut this year's Golden Globes was more obscene than graceful, with celebrities swearing in nigh on every speech.\nJonah Hill started as the A-listers meant to go on, dropping the F-bomb twice as he took to the stage wearing a bear hat with Channing Tatum.\nTrainwreck star Amy Schumer was next up, letting fly with the C-word just minutes after the awards show got under way.\nAnd while Jaimie Alexander looked stylish in an emerald green dress, her language was less than ladylike as she shouted the word 's**t' while presenting an award.\nScroll down for video\nTrainwreck star Amy Schumer (left, with Jennifer Lawrence) let fly with the C-word just minutes after the awards show got under way\nSchumer gasped after saying the word 'c**t' while presenting an award with the Hunger Games star\nWild card: Schumer was censored when she said the C-word while presenting at the Golden Globes\nJonah Hill dropped the F-bomb as he took to the stage wearing a bear hat with Channing Tatum\nUnbearlievable: The 21 Jump Street co-stars cracked up as Hill continued to pretend to be a bear\nHill swore twice in a matter of minutes in what was a foul-mouthed affair in Los Angeles\nWith more than 7,500 glasses of free Moët Champagne poured, perhaps the 2016 edition of the Golden Globes was always going to be an expletive-ridden affair.\nSchumer took to the stage with Jennifer Lawrence early on in the show and they about the outspoken comedian taking up the nickname A-Schu.\n'Amy, you can't just give yourself a nickname,' Lawrence said. 'It has to come naturally. What do people usually call you?'\n'Usually they just call me c**t', Schumer replied, as the censors jumped in to bleep her out.\nSchumer and Lawrence were following up Jonah Hill, who presented the first award of the night wearing a bear hat.\nPretending to be the bear from Leonardo DiCaprio film The Revenant, Hill - who was on stage with his 21 Jump Street co-star Channing Tatum - said the word 'f***ing' twice despite only speaking for a couple of minutes.\n'I’m a bear and honey is f***ing delicious,' Hill said.\n'There are some studio heads I wouldn’t mind taking a swipe at later tonight. But don’t be mad because don’t forget I’m a bear. I don’t f***ing care.'\n'Dude, who's typing this s**t?' Actress Jaimie Alexander and Amber Heard had to briefly pause on stage while presenting the Best Actor in a Limited Series as the person working the teleprompter made a mistake\nHeard burst out laughing but Alexander looked a little embarrassed after she accidentally swore\nThe pair looked stylish in their gowns, but Alexander's language was ever so slightly less graceful\nAs Mel Gibson took to the stage to present an award, host Ricky Gervais said: 'What the f*** does sugart**s even mean?'\nThe pair traded barbs at the star-studded affair in Los Angeles, with Gervais stirring up tensions by bringing up Gibson's DUI arrest in 2006\nNext to swear was Blindspot actress Jaimie Alexander, who was presenting an award with Amber Heard.\nThe pair had to briefly pause while presenting the Best Actor in a Limited Series award as a teleprompter operator made a mistake.\n'Dude, who's typing this s**t?' Alexander asked as the ladies stumbled over their words while on stage.\nWith Ricky Gervais hosting the Golden Globes, producers behind the scenes at the awards show knew they would have to contend with the odd profanity.\nAnd they were quick to jump in and bleep when the true-to-form funnyman welcomed Mel Gibson to the stage to present a gong.\nAs Gibson stepped forward, Gervais said: 'What the f*** does sugart**s even mean?'\nAfter being pulled over by a female police officer for a DUI stop in 2006, the Braveheart actor reportedly said: 'What do you think you're looking at, sugart**ts?'\nThe British comedian could be seen giggling as he wandered back to the side of the stage, with Gibson visibly annoyed.\nSWEARING CELEBS: WHAT A-LISTERS SAID DURING THE GOLDEN GLOBES 'What the f*** does sugart**s even mean?' Ricky Gervais to Mel Gibson, referencing his foul-mouthed rant at a police officer in 2006. 'Dude, who's typing this s**t?' Jaimie Alexander after struggling with a teleprompter. 'I’m a bear and honey is f***ing delicious. There are some studio heads I wouldn’t mind taking a swipe at later tonight. But don’t be mad because don’t forget I’m a bear. I don’t f***ing care.' Jonah Hill, pretending to be the bear from The Revenant. 'Usually they just call me c**t.' Amy Schumer on potential new nicknames.\nShocked: Veep star Julia Louis-Dreyfus cracked up at Schumer's antics, giggling after the actress swore\nIf looks could kill: Jane Fonda shot a very unimpressed look at Channing Tatum and Jonah Hill's bear gag, which was followed by Hill swearing\nMark Wahlberg, actor Gael Garcí a Bernal and director Alejandro Iñárritu also uttered profanities during the show.\nThis year's Golden Globes may have been the most foul-mouth yet because of the sheer amount ot booze on offer to guests.\nMore than 7,500 glasses of Champagne were poured, as well as countless other drinks and Ricky Gervais' beer, which was never far from him during the show.\nWith the event sponsored by Moët & Chandon, organizers are keen for celebrities to be seen sipping away, even making miniature bottles for A-listers to hold as they saunter down the red carpet.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393257/Amy-Schumer-censored-dropping-C-word-teaming-BFF-Jennifer-Lawrence-Golden-Globes.html"}
