{"authors":["Tsvetana Paraskova"],"date_download":"2018-10-30 23:29:43","date_modify":"2018-10-30 23:29:43","date_publish":"2018-07-18 00:00:00","description":"The bank says crude could hit $80 a barrel, but not until later in the year.","filename":"data/vaneerConsumption/GOLDMANSACHSBrentCrudeoilcouldspikeagainbutnotuntillaterthisyear.json","image_url":"https://amp.businessinsider.com/images/5b4f80dc7dd0241b008b4717-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-brent-crude-oil-could-spike-again-but-not-until-later-this-year-2018-7_1540942183.html","title":"GOLDMAN SACHS: Brent Crude oil could spike again - but not until later this year","title_page":"    GOLDMAN SACHS: Brent Crude oil could spike again — but not until later this year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The flow of crude oil is seen in a container while an oilfield worker works on a drilling rig at an oil well operated by Venezuela's state oil company PDVSA Carlos Garcia Rawlins/Reuters\nGoldman Sachs—which has been bullish on oil for most of this year— continues to expect that Brent Crude prices could retest the $80 a barrel threshold this year, but probably only late in 2018, not this summer, as uncertainties mount over the timing and magnitude of global supply disruptions.\n\"Production disruptions and large supply shifts driven by U.S. political decisions are the drivers of this new fundamental volatility, with demand remaining robust so far,\" Goldman Sachs said in a note on Monday, adding that Brent Crude is expected to trade in the $70-$80 a barrel range amid this new fundamental volatility.\nAt 10:40 a.m. EDT on Tuesday, Brent Crude was unchanged for the day at $71.84, and WTI Crude was down 1.15 percent at $67.28.\nA month ago, the investment bank kept its forecast that Brent Crude would hit $82.50 a barrel this summer and would end 2018 at $75 per barrel, citing strong demand growth and further supply losses pointing to continued declines in inventories and higher oil prices for the rest of the year.\nGoldman still thinks that Brent could retest the $80 a barrel market, but only late this year, instead of in the summer, depending on U.S. oil policies.\nTwo weeks ago, the investment bank also said that concerns over a U.S.-Chinese trade war that could dampen prices and demand were \"oversold.\"\nIn recent weeks, supply disruptions in Venezuela, Canada, and Libya, and the prospect of significantly lowered Iranian oil exports, have supported oil prices, while Saudi Arabia and Russia boosting production and the U.S.-China trade war have dragged prices down.\n\"The uncertainty on the magnitude and timing of the supply shifts has muddied the near-term outlook for oil fundamentals,\" Goldman said in its note this week, carried by Reuters.\nThe U.S. signaled on Monday that it could consider waivers in some cases for countries who need more time to wind down purchases of Iranian oil, with U.S. Treasury Secretary Steven Mnuchin saying that \"We want people to reduce oil purchases to zero, but in certain cases if people can't do that overnight, we'll consider exceptions.\"","url":"https://www.businessinsider.com/goldman-sachs-brent-crude-oil-could-spike-again-but-not-until-later-this-year-2018-7"}
