{"authors":["Sarah N. Lynch"],"date_download":"2018-10-30 21:00:39","date_modify":"2018-10-30 21:00:39","date_publish":"2016-12-22 00:00:00","description":"To date, the CFTC has imposed penalties of over $5.2 billion (£4.2 billion) on banks for alleged rate rigging.","filename":"data/vaneerConsumption/GoldmanSachstopay120milliontosettlejackedratescase.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-pays-120-million-to-settle-cftc-case-on-alleged-isdafix-rigging-2016-12_1540933239.html","title":"Goldman Sachs to pay $120 million to settle 'jacked' rates case","title_page":"    Goldman Sachs pays $120 million to settle CFTC case on alleged ISDAFIX rigging - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Goldman Sachs. REUTERS/Brendan McDermid/File Photo Goldman Sachs will pay a $120 million (£97 million) penalty to resolve civil charges that it attempted to manipulate a global benchmark for interest rate products known on Wall Street as \"ISDAFIX,\" U.S. derivatives regulators said Wednesday.\nThe case against Goldman Sachs, brought by the Commodity Futures Trading Commission (CFTC), was the latest in a series of broad investigations into manipulation by big banks of a variety of global benchmark rates.\nTo date, the CFTC has imposed penalties of over $5.2 billion (£4.2 billion) stemming from these probes, which include Libor and Euribor, foreign exchange benchmarks, and the US Dollar International Swaps and Derivatives Association Fix, or USD ISDAFIX.\nA number of banks have also resolved parallel criminal charges related to the manipulation of various global benchmarks.\nGoldman Sachs, which was also accused by the CFTC of making false reports on the benchmark rate, will settle the case without admitting or denying the charges.\n\"We are pleased to have resolved these matters and have already taken steps to enhance our policies and procedures,\" bank spokesman Michael DuVally said in a statement.\nISDAFIX rates are used to help value the cash settlement of options on interest rate swaps and other products. Pension funds and local governments often rely on products priced off the benchmark rate to help hedge against future interest rate changes.\nThe CFTC said that emails and audio recordings showed traders at Goldman discussing their plans to try to move the benchmark rate in directions that benefited their own positions.\nThey tried to skew the bank's submissions used to help come up with the \"print,\" or the reference rate that is captured each day at 11 a.m., the CFTC said.\nThey also traded various products at the 11 a.m. fixing time \"in a manner deliberately designed\" to influence the published rate, the CFTC added.\nThe CFTC said traders discussed trades as being based on the \"jacked price\" and not the \"fair price,\" and how they had managed to \"game the fix\" to benefit their own positions.\nThe agency also accused the bank of failing to adequately cooperate earlier in the investigation by initially failing to produce certain documents.\nGoldman Sachs is the third bank to settle an ISDAFIX benchmark case with the CFTC. The other two were Barclays in 2015 and Citigroup in 2016.","url":"https://www.businessinsider.com/goldman-sachs-pays-120-million-to-settle-cftc-case-on-alleged-isdafix-rigging-2016-12"}
