{"authors":["Edith Cooper","Goldman Sachs"],"date_download":"2018-10-30 23:45:16","date_modify":"2018-10-30 23:45:16","date_publish":"2016-12-05 00:00:00","description":"She has conducted thousands of job interviews over the course of her career.","filename":"data/vaneerConsumption/GoldmanSachsEdithCooperonacingjobinterviews.json","image_url":"https://amp.businessinsider.com/images/576aae8691058425008cabc8-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-edith-cooper-on-acing-job-interviews-2016-12_1540943116.html","title":"Goldman Sachs' Edith Cooper on acing job interviews","title_page":"    Goldman Sachs' Edith Cooper on acing job interviews - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Edith Cooper is global head of Human Capital Management for Goldman Sachs. Bloomberg Recruiting done right is not about filling seats, it's about building the future of a business. Over the past several years, companies across industries have evolved their approach to evaluating candidates.\nWhen it comes to assessment techniques, we're seeing the use of machine learning and data analytics, personality questionnaires, online case studies, video interviewing and more.\nThat said, the primary objective of the recruiting process remains the same - to measure the strength of a candidate and determine whether there is an intellectual chemistry between that individual and his or her future colleagues.\nInterviews are an integral part of making that determination. I've had the opportunity to conduct thousands of them over the course of my career, and reflecting on what differentiated the great candidates, I'd like to share five tips to help you ace your next interview.\nEdith Cooper is global head of Human Capital Management for Goldman Sachs. This piece previously appeared on LinkedIn.","url":"https://www.businessinsider.com/goldman-sachs-edith-cooper-on-acing-job-interviews-2016-12"}
