{"authors":[],"date_download":"2018-10-30 01:05:54","date_modify":"2018-10-30 01:05:54","date_publish":"2018-08-04 01:20:03","description":"Apple Inc.’s stock value topped one trillion dollars yesterday.","filename":"data/vaneerConsumption/GoldenDeliciousAppleIncHits1Trillion.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Apple_store_fifth_avenue.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861554.html","title":"Golden Delicious: Apple Inc. Hits $1 Trillion","title_page":"Golden Delicious: Apple Inc. Hits $1 TrillionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Apple Inc.’s stock value topped one trillion dollars yesterday. Apple gained 2.9% from its opening, briefly tipping to one trillion, followed by a selloff. The stock ended the day above one trillion at $207.39 a share.\nThe first member of the FAANG (Facebook, Amazon, Apple, Netflix, and Alphabet’s Google) pack to reach the symbolic mark, Apple continues its dominance on the back of its iPhone. Apple may be breaking current stock records, but PetroChina Co. was the first to claim the trillion dollar crown in 2007. Still, the mark is reminder of how bullish the market is on technology. FAANG stocks account for about fifteen percent of the S&P 500 and jumped to incredible heights over the last few months. Apple, for example, gained 23% this year alone. Yet, the startup-esque growth rates of these established companies do worry experts—how long can it last?\nThe trillion dollar mark is a nod to CEO Tim Cook’s leadership, especially since the death of tech saint Steve Jobs. Apple has come a long way since its debut in 1976, and even more so since its near death in the 1990s. The chief product, the iPhone, continues to dominate the smartphone market, particularly in China. Cook was instrumental in opening up China to Apple products, which now accounts for one-fifth of Apple’s sales.\nCritics and stock experts are worried about Apple’s over-reliance on the iPhone as a singular product. Fifty-six percent of Apple’s sales came from the phone this quarter. Cook, however, has shrugged such concerns while moving Apple into the service industry and new markets like China.\nThe FAANG pack is the stock to watch in the coming weeks. With the exception of Facebook, the pack has weathered the consumer protection storm of this spring well. A Federal Reserve hike this fall, however, is sure to put downward pressure on these high-flying stocks.","url":"https://spectator.org/golden-delicious-apple-inc-hits-1-trillion/"}
