{"authors":["Akin Oyedele"],"date_download":"2018-10-30 22:52:46","date_modify":"2018-10-30 22:52:46","date_publish":"2018-07-28 00:00:00","description":"BI PRIME: President Donald Trump's trade war doesn't show sings of ending soon. With the US and China threatening more tariffs on each other's goods, Goldman Sachs' equity strategists have laid out the impact escalating tensions could have on the market, and how investors can hedge.","filename":"data/vaneerConsumption/GOLDMANHowTrumpstradewaraffectsstocksandwhattoinvestin.json","image_url":"https://amp.businessinsider.com/images/5b562a3457a20720008b45c0-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-trade-war-impact-on-stock-market-and-how-to-prepare-goldman-sachs-2018-7_1540939966.html","title":"GOLDMAN: How Trump's trade war affects stocks and what to invest in","title_page":"    GOLDMAN: How Trump's trade war affects stocks and what to invest in - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"David Kostin has some recommendations for investors worried about trade tensions. Brendan McDermid/Reuters\nSo far, trade disputes between the US and China have resulted in only brief episodes of volatility in the stock market.\nSome investors aren't even going as far as calling the conflict a full-blown trade war yet. But with neither country showing any signs of backing down, Goldman Sachs' equity strategists have laid out the impact that escalating tensions could have on the market.\nThe Trump administration has imposed a 25% import tax on $34 billion worth of Chinese goods this year and has also threatened to hit another $400 billion worth of products with tariffs because of China's retaliation. It has also imposed and threatened tariffs on Canada, the European Union, and Mexico in its quest for what the administration considers fairer trade.\nThere are two ways trade disputes could hurt the earnings of S&P 500 companies, according to David Kostin, Goldman's chief US equity strategist.\nThe first is by undercutting the revenue of companies that export to China, mainly, and other countries with which the US is fighting.\n\"The tariff impact on S&P 500 EPS through lower revenues is minimal,\" Kostin said in a note to clients on Friday. This is because just 2% of aggregate S&P 500 sales come from China, he added. Even if the trade war went global, with 5% tariffs on all trading partners, Goldman sees its 2019 S&P 500 earnings-per-share forecast lower by just 1%, to $169.\nThe second, more meaningful impact to US companies is via lower margins, Kostin said. The flow of trade between the US and China is much heavier in the China-to-US direction, and roughly 15% of the cost of goods sold has origins outside the US.\n\"If tensions spread and a 10% tariff were implemented on all US imports (highest rate since 1940s) our EPS estimate would fall by 15% to $145,\" Kostin said.\nInvestors have shrugged off this risk for now. Kostin saw no strong link between trade disputes and the performance of industries with heavy imports, such as petroleum and coal. The S&P 500 has been stuck in a tight range and most recently hit an all-time high 122 trading days ago, according to Bespoke Investment Group. It's still up 5% this year.\nBut for investors worried that the trade war will worsen, Goldman had two recommendations:","url":"https://www.businessinsider.com/trump-trade-war-impact-on-stock-market-and-how-to-prepare-goldman-sachs-2018-7"}
