{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 00:43:31","date_modify":"2018-10-23 00:43:31","date_publish":"2016-01-11 10:35:13","description":"The publicist, 33, stylishly concealed her pregnancy in a chic black dress as she and her Oscar-winning husband, also 33, arrived at the NBC Universal after-party in Los Angeles, on Sunday.","filename":"data/vaneerConsumption/GoldenGlobeswinnerEddieRedmayneswifeHannahBagshaweconcealsbabybump.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/30072E2A00000578-0-image-a-59_1452507096968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393647_Hannah-Bagshawe-conceals-baby-bump-layered-black-dress-attends-Golden-Globes-bash-husband-Eddie-Redmayne-confirming-pregnancy_1540255411.html","title":"Golden Globes winner Eddie Redmayne's wife Hannah Bagshawe conceals baby bump","title_page":"Golden Globes winner Eddie Redmayne's wife Hannah Bagshawe conceals baby bump | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Earlier in the evening the couple confirmed they are expecting their first baby.\nBut Hannah Bagshawe made sure to downplay any sign of her blossoming baby bump as she accompanied her husband Eddie Redmayne to the NBC Universal Golden Globes after-party.\nArriving at the event in Los Angeles on Sunday, the 33-year-old publicist stylishly concealed her pregnancy in a chic layered black dress as she arrived with her Oscar-winning husband, also 33.\nScroll down for video\nConcealing the baby bump: Hannah Bagshawe made sure to downplay any sign of her blossoming baby bump as she accompanied her husband Eddie Redmayne to the NBC Universal Golden Globes after-party\nHannah - who married Eddie in 2014 - channelled an effortlessly stylish yet understated look as she hit the red carpet with her husband.\nDonning a layered ruffled black number, the London-born beauty subtly concealed her tummy while also showing some skin thanks to the low-cut neckline.\nAnd while her husband confirmed the pregnancy rumours earlier on in the evening, the ruffled layer detailing on the low-half of Hannah's dress helped to subtly cover any signs her pregnancy.\nLooking equally as glamorous as when she arrived with Eddie at the 73rd Annual Golden Globe Awards, held at Hilton Hotel in Beverly Hills, Hannah's perfectly tousled hair remained in place.\nDelighted: Arriving at the event in Los Angeles on Sunday, the 33-year-old publicist stylishly concealed her pregnancy in a chic layered black dress as she arrived with her Oscar-winning husband, also 33\nAnd despite losing out to Leonardo DiCaprio in the Best Actor category, Eddie maintained a dapper demeanour in his stylish twist on classic evening wear - which he accessorised with an OMEGA Globemaster watch.\nUnable to keep the smile from his face, Eddie was clearly delighted to be at the bash alongside his wife, and was appeared to barely leave her side during the event.\nArriving arm-in-arm at the Golden Globes earlier on in the evening Eddie had revealed the couple's happy news to veteran TV host Ryan Seacrest - who asked whether they were expecting.\nA very happy man: Unable to keep the smile from his face, Eddie was clearly delighted to be at the bash alongside his wife, and was appeared to barely leave her side during the event.\nOfficially expecting: Arriving arm-in-arm at the Golden Globes earlier on in the evening Eddie had revealed the couple's happy news to veteran TV host Ryan Seacrest - who asked whether they were expecting\nResponding to Ryan's question, Eddie simply said: 'That is true.'\nThe couple were then presented with baby shower gifts which included onesies saying 'You Should See My Crib' and 'Milking My 15 Minutes'.\nLaughing, Eddie responded: 'I’m sweating now – she’s calm I’m not.'\nThe arrival, which is thought to be expected in late Spring, will be the couples' first child together.\nEddie's The Danish Girl co-star Alicia Vikander also made an appearance at the party, and despite losing out on the Best Supporting Actress gong, the 27-year-old actress was also all smiles.\nStill smiling: Eddie's The Danish Girl co-star Alicia Vikander also made an appearance at the party, and despite losing out on the Best Supporting Actress gong, the 27-year-old actress was also all smiles\nCongratulations? The Swedish star appeared to congratulate the actor on his and Hannah's happy news\nHugs all around: Eddie also received a huge hug from a delighted Maryam Lieberman","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393647/Hannah-Bagshawe-conceals-baby-bump-layered-black-dress-attends-Golden-Globes-bash-husband-Eddie-Redmayne-confirming-pregnancy.html"}
