{"authors":["Heather Waugh","Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 22:23:53","date_modify":"2018-10-22 22:23:53","date_publish":"2016-01-11 03:05:10","description":"Taraji P. Henson wore a chic white gown with long train to the Golden Globes and took to the stage to present with Terrence Howard following behind, as he accidentally stepped on her full-length piece","filename":"data/vaneerConsumption/GoldenGlobes2016winnerTarajiPHensonhasgownsteppedonaSECONDtime.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/03/30049C2E00000578-0-image-a-91_1452484566331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393225_Cookie-having-words-Terrence-Howard-steps-Empire-star-Taraji-P-Henson-s-white-gown-onstage-Golden-Globes_1540247033.html","title":"Golden Globes 2016 winner Taraji P Henson has gown stepped on a SECOND time","title_page":"Golden Globes 2016 winner Taraji P Henson has gown stepped on a SECOND time | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Taraji P. Henson was not impressed when she had her Stella McCartney gown stepped on for a second time at the Golden Globes on Sunday evening.\nThe actress was picking up the award for best actress in a TV drama for Empire when her long white dress got caught under someone's shoes - just minutes after her co-star Terrence Howard had done the same thing.\nThe 45-year-old couldn't hide her dismay when she yanked on the train of her dress on her way to the podium before her acceptance speech.\nScroll down for video\nWhoops! Taraji P. Henson looked shocked as the train of her long white Stella McCartney gown got stepped on for a second time as she accepted her first Golden Globe award\nOnce she'd gathered up the fabric out of harm's way, the actress channeled her onscreen alter ego Cookie as she addressed the banquet hall - and refused to be rushed.\nShe first announced 'Cookies for every tonight! My treat.\n'I mean who knew that playing an ex con would take me all around the globe? It just goes to show... it was Cookie who spent 17 years in jail for selling crack!'\nSee our full Golden Globes coverage on all the winners and red carpet fashion\nNot again! A gent on the stage behind her appeared to be the culprit this time around as the 45-year-old actress was pulled back by her train getting caught\nNo way! The actress couldn't believe it was happening again during her big moment\nTaraji then refused to cut her speech short: '\"Please wrap!\" Wait a minute. I waited 20 years for this. My fans been praying for this. You gotta give me time.\n'Thank you for believing in me! My beautiful boys who play my sons. I am taking this home for the entire Empire. Terrence Howard I am nothing without you. Cookie is nothing without Lucious.'\nEarlier in the night Taraji had her gown stepped on by her Empire co-star Howard when they presented an award together.\nAs the 46-year-old actor accidentally stepped on her full-length frock she made sure to exaggerate her reaction for the crowd.\nDisbelief! Taraji got all diva on the offender giving him an incredulous look as Kate Bosworth and Sophia Bush stood smiling behind the actress\nHer big moment! The Empire star then proceed to milk her first Golden Globes speech by not letting the producers rush her\nMajor misstep! Earlier in the evening Taraji's Empire co-star Terrence Howard, 46, accidentally stepped on her white gown\nTerrence clearly felt terrible as he was seen checking on his gorgeous co-star after his misstep.\nTaraji scintillated in the strapless gown which highlighted a bit of cleavage and showcased her feminine curves.\nThe Oscar-nominated actress accessorized her ensemble with vintage diamond jeweled drop earrings and strappy heels.\nShocking! Taraji was quick to correct the blunder but made sure to put on a full display in shock of Howard's mistake\nApologetic: Terrence clearly felt terrible as he was seen checking on his gorgeous co-star after his misstep\nHandsome Howard! Terrence, who plays drug dealer turned music mogul Lucious Lyon, looked dapper in a chocolate brown tuxedo at the star-studded awards ceremony\nShe kept her makeup to a minimum to highlight her natural beauty but added a shimmery smokey eye and glossy pink lip for some added sex appeal.\nTerrence, who plays drug dealer turned music mogul Lucious Lyon, looked dapper in a chocolate brown tuxedo at the star-studded awards ceremony.\nHenson stars in the hit show as ex-con turned 'momager' Cookie Lyon, which is executive produced by Lee Daniels and is set for a spin-off, which will be a prequel to Empire.\nThey did it! Taraji posed with fellow Golden Globe winner Lady Gaga backstage\nFlawless! Taraji scintillated in the strapless gown which highlighted a bit of cleavage and showcased her feminine curves\nDazzling! The Person of Interest star kept her makeup to a minimum to highlight her natural beauty but added a shimmery smokey eye and glossy pink lip for some added sex appeal\nGetting along: The two had earlier posed together on the red carpet for the show\nIt was announced last month by TMZ that transgender model Amiyah Scott has been cast as the young Loretha 'Cookie' Lyon.\nScott was set as a cast member in this season of Bravo's Real Housewives of Atlanta but reportedly quit after only a month of filming.\nAmiyah was allegedly fed up with the way producers were trying to 'sexualize' her by pushing her to wear lingerie and play the part of the 'vixen,' according to the news site.\nThe actress was approached by Empire creator Daniels in August to read for the show, after she created buzz around the reality show.\nNew show! Taraji's Fox hit show, Empire - which is executive produced by Lee Daniels - is set for a spin-off, which will be a prequel to Empire\nSpinoff star! It was announced last month by TMZ that transgender actress Amiyah Scott has been cast as the young Loretha 'Cookie' Lyon\n2016 GOLDEN GLOBE AWARDS WINNERS - TELEVISION Best Performance by an Actress in a Limited Series or Motion Picture Made for Television Uzo Aduba, Orange is the New Black Joanne Froggatt, Downton Abbey Regina King, American Crime Judith Light, Transparent Maura Tierney, The Affair Best Performance by an Actor in a Limited Series or Motion Picture Made for Television Idris Elba, Luther Oscar Isaac, Show Me a Hero David Oyelowo, Nightingale Mark Rylance, Wolf Hall Patrick Wilson, Fargo Best Performance by an Actress in a Television Series – Drama Caitriona Balfe, Outlander Viola Davis, How to Get Away with Murder Taraji P Henson, Empire Eva Green, Penny Dreadful Robin Wright, House of Cards Best Performance by an Actor in a Television Series – Musical or Comedy Aziz Ansari, Master of None Gael Garcia Bernal, Mozart In The Jungle Rob Lowe, The Grinder Patrick Stewart, Blunt Talk Jeffrey Tambor, Transparent Best Performance by an Actor in a Television Series – Drama Jon Hamm, Mad Men Rami Malek, Mr Robot Wagner Maura, Narcos Bob Odenkirk, Better Call Saul Liev Shreiber, Ray Donovan Best Performance by an Actress in a Television Series – Musical or Comedy Rachel Bloom, Crazy Ex-Girlfriend Jamie Lee Curtis, Scream Queens Julia Louis Dreyfus, Veep Gina Rodriguez, Jane the Virgin Lily Tomlin, Grace and Frankie\nBest Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Lady Gaga, American Horror Story Sarah Haye, Flesh and Bone Felicity Huffman, American Crimes Queen Latifah, Bessie Kirsten Dunst, Fargo Best Television Limited Series or Motion Picture Made for Television American Horror Story Fargo Flesh And Bone Stars Wolf Hall Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Alan Cumming, The Good Wife Damian Lewis, Wolfhall Ben Mendelson, Bloodline Tobias Menzies, Outlander Christian Slater, Mr Robot Best Television Series - Musical or Comedy Orange Is The New Black Silicon Valley Transparent Veep Casual Mozart In The Jungle Best Television Series - Drama Empire Game of Thrones Mr Robot Narcos Outlander","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393225/Cookie-having-words-Terrence-Howard-steps-Empire-star-Taraji-P-Henson-s-white-gown-onstage-Golden-Globes.html"}
