{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 20:57:49","date_modify":"2018-10-30 20:57:49","date_publish":"2016-12-23 00:00:00","description":"If you followed Warren Buffet's investing mantra – be greedy when others are fearful and fearful when others are greedy – then 2016 should have been great.","filename":"data/vaneerConsumption/GoldmanSachsdebtchart.json","image_url":"https://amp.businessinsider.com/images/585cdcf3dd08959b7f8b48bb-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-debt-chart-2016-12_1540933069.html","title":"Goldman Sachs debt chart","title_page":"    Goldman Sachs debt chart - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"James A. Michener Art Museum If you followed Warren Buffet's investing mantra - be greedy when others are fearful and fearful when others are greedy - then 2016 should have been a bumper year.\nDebt traders that loaded up on newly downgraded bonds early on in 2016 made a lot more than their peers.\nThe so-called fallen angels - bonds issued by companies that were unexpectedly downgraded by credit rating agencies - had their best year since 2003, according to Goldman Sachs.\nThe commodities crash around January and February led to sudden downgrades of mining and oil companies, allowing buyers to pick up bargains cheaply.\n\"The sizeable supply of downgraded bonds has been met with an equally strong investor demand, allowing fallen angels to deliver their best performance since 2003,\" Goldman Sachs credit analysts said in an end-of-year note to clients.\n\"As shown by Exhibit 10, the Citi Yield Book time-weighted fallen angel index, which assigns a higher weight to recently downgraded bonds, has generated a total return of 37%, more than double the total return in the broader HY market. Again, this solid performance reflects the heavy concentration of the supply of downgraded bonds in the Energy and Metals and Mining sectors.\"\nHere is the chart:\nGoldman Sachs\nThe Goldman analysts said risk had shifted from the commodities sector to the retail industry. If bonds are downgraded in 2017, the recovery is unlikely to be swift.\n\"As we discussed in our 2017 Global Outlook, the biggest pocket of downgrade risk going forward is in the Retail sector, while the Energy and Metals and Mining issuers have no bonds outstanding on downgrade watch,\" Goldman Sachs said.\n\"Given the numerous secular decline challenges facing the Retail sector, we think the performance of fallen angels will likely be much more modest in 2017.\"","url":"https://www.businessinsider.com/goldman-sachs-debt-chart-2016-12"}
