{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:12:47","date_modify":"2018-10-30 21:12:47","date_publish":"2016-12-21 00:00:00","description":"'Ultimately, we expect the negotiations to result in a UK-EU FTA that applies to goods but not services and a loss of the UK’s rights to financial passporting.'","filename":"data/vaneerConsumption/GOLDMANSACHSWethinkBritainwilllosepassportingrightspostBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-expects-uk-to-lose-financial-passporting-rights-post-brexit-2016-12_1540933967.html","title":"GOLDMAN SACHS: We think Britain will lose passporting rights post-Brexit","title_page":"    Goldman Sachs expects UK to lose financial passporting rights post-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Goldman thinks passporting rights will be lost post-Brexit. REUTERS/Francois Lenoir/Illustration LONDON — Goldman Sachs expects Britain to lose financial passporting rights after Brexit.\nThe investment bank made the call in its latest \"Top of Mind\" note sent to clients on Monday, saying: \"Ultimately, we expect the negotiations to result in a UK-EU FTA [free trade agreement] that applies to goods but not services, and a loss of the UK's rights to financial passporting.\"\nIf Britain does lose passporting rights it would be a huge blow to the financial services industry. The EU's passporting rules allow businesses to sell services across the union from anywhere within it and only require companies to be regulated in one country, rather than everywhere they operate.\nJPMorgan and UBS have both publicly warned they will have to move jobs elsewhere in Europe if passporting rights are lost. Goldman Sachs itself is also said to be planning behind closed doors to move 2,000 jobs to the continent if the rights are lost.\n5,500 companies with a combined turnover of £9 billion rely on passporting in the UK, according to the Financial Conduct Authority (FCA). However, a House of Lords report in to the potential impact of Brexit on financial services, released last week, pointed out that the interconnectedness of financial services in Britain meant that many firms relied on passporting without knowing it.\nHSBC chairman Douglas Flint told the committee: \"Everyone is affected by passporting rights to a greater or lesser degree.\" Market insight company Mlex estimates that 13,500 companies in Britain depend on the rights.\nThe UK appears likely to lose passporting rights because the government has made a point of prioritising controlling immigration as part of Brexit negotiations. European officials have repeatedly said that Britain cannot have access to the single market, through passporting or customs unions, unless it accepts the EU's \"four freedoms\"— freedom of movement for capital, goods, services, and people across the 27-nation bloc.","url":"https://www.businessinsider.com/goldman-sachs-expects-uk-to-lose-financial-passporting-rights-post-brexit-2016-12"}
