{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 21:41:16","date_modify":"2018-10-22 21:41:16","date_publish":"2016-01-11 01:14:32","description":"Melissa McCarthy, 45, had her newly svelte body on display in an inky black gown on Sunday at the Golden Globe Awards.","filename":"data/vaneerConsumption/GoldenGlobes2016redcarpetwelcomesMelissaMcCarthyandhershrinkingframe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/3001A53800000578-0-image-a-10_1452473789448.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393202_The-incredible-shrinking-Melissa-McCarthy-Comedian-showcases-slimmed-frame-Golden-Globes-red-carpet_1540244476.html","title":"Golden Globes 2016 red carpet welcomes Melissa McCarthy and her shrinking frame","title_page":"Golden Globes 2016 red carpet welcomes Melissa McCarthy and her shrinking frame | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Melissa McCarthy had her newly svelte body on display in an inky black gown on Sunday at the Golden Globe Awards.\nThe 45-year-old actress has lost more than 50 pounds in the past year and showed off her new figure in the floor length gown with a plunging neckline and front leg slit.\nMcCarthy was nominated in the Best Performance by an Actress in a Musical or Comedy for her portrayal of Susan Cooper in Spy.\nScroll down for video\nOn a roll: Melissa McCarthy had her trimmed down figure on display in an inky black gown on Sunday at the Golden Globe Awards in Beverly Hills, California\nThe action spy comedy written and directed by Paul Feig also was nominated in the Best Motion Picture - Musical or Comedy category.\nMcCarthy during a red carpet interview told E! that the Golden Globes 'was my favourite one' among the Hollywood awards shows.\n'It's like a wedding where I get to see everyone,' McCarthy said upon arriving at the awards ceremony held at the The Beverly Hilton Hotel in Beverly Hills, California.\nSee live updates on the Golden Globes 2016 with more of the latest red carpet pictures\nSpy star: The actress was nominated for her portrayal of Susan Cooper in Spy\nSlimmed down: Melissa's weight loss since the Oscars in February 2012 was clearly evident\nShe also revealed that she'd be open to a Spy franchise.\n'It's certainly a character I loved, I would go back to her in a minute, but we'll see. I have no idea,' McCarthy said.\nMcCarthy was escorted to the awards ceremony by her 42-year-old actor husband Ben Falcone.\nHusband and wife: Ben Falcone escorted his wife to the awards ceremony\nFalcone had a minor role in Spy portraying an American Tourist and has been in minor roles in several of McCarthy's films including Bridesmaids and Identity Thief.\nHe posted a photo on Twitter earlier on Sunday showing him and Melissa headed to the awards ceremony.\n'Heading to the @goldenglobes with the lovely @melissamccarthy - we're single and ready to mingle! Wait...,'\nFunny couple: The actor and director shared a Twitter picture of him and Melissa headed to the ceremony and wrote 'we're single and ready to mingle! Wait...'\nI'm not sure Ben knows what that saying means, but Ashley Madison did sponsor his tux. https://t.co/VUMWZz5HT9 — Melissa McCarthy (@melissamccarthy) January 10, 2016\nMcCarthy and Falcone have been married since October 2005 and have two daughters together.\nFeig also directed McCarthy in the upcoming Ghostbusters reboot due out in July that also stars Kristen Wiig, Kate McKinnon and Leslie Jones.\nMcCarthy earlier this month won the People's Choice Awards for Favorite Comedic Movie Actress and Favorite Comedic TV Actress for her work on Mike And Molly.\nComing soon: Melissa also teamed up with Paul Feig for the upcoming Ghostbusters reboot due out in July\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393202/The-incredible-shrinking-Melissa-McCarthy-Comedian-showcases-slimmed-frame-Golden-Globes-red-carpet.html"}
