{"authors":["Belinda Cleary For Daily Mail Australia"],"date_download":"2018-10-22 20:30:46","date_modify":"2018-10-22 20:30:46","date_publish":"2016-01-29 02:00:05","description":"Two puppies have been stolen from a Gold Coast breeder, the thieves demanding money for their safe return but breeder Melissa Forsythe says she can't afford to pay them.","filename":"data/vaneerConsumption/GoldCoastdognapperswhostolepedigreepuppiesdemand5kransom.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE64C900000578-0-image-a-2_1454032752557.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422078_Dognappers-demand-5-000-ransom_1540240246.html","title":"Gold Coast dognappers who stole pedigree puppies demand $5k ransom","title_page":"Gold Coast dognappers who stole pedigree puppies demand $5k ransom | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One puppy is still missing after thieves tricked a breeder into letting them take home two of her pure-bred British bulldogs.\nThe thieves replied to an advertisement selling the dogs on Gumtree, and arranged to pick them up from the breeder - Melissa Forsythe - who lives on the Gold Coast in Queensland.\nMs Forsythe says she spoke with a man and a woman when they arrived to pick up the dogs.\nScroll down for video\nHugo is still missing after being stolen from his breeder, Melissa Forsythe, on Saturday, January 23\nThe puppy was one of two stolen, the thieves demanding a $10,000 ransom for their return\n'They provided me with a fake bank transfer form to say they had put the money in the bank,' Ms Forsythe told Daily Mail Australia.\nThe next day the breeder new she had been ripped-off after being contacted by a concerned would-be buyer.\n'A man phoned me to tell me that the dogs had been advertised again for $3000 for the pair, he thought it was a bit suss because they were too cheap and found my original listing so he could tell me.\nThe messages between Ms Forsythe and the people she says stole her dog got violent after she failed to meet up with them with the ransom money\nFrank (pictured) has been returned to the owners who found him at a pet store in Ipswich, Queensland\n'That is when I knew that I wouldn't be getting the money for the puppies.'\nMs Forsythe was in contact with the people who collected the animals from her premises.\nThey promised she could have the dogs back if she agreed to pay them $4,000, and sent a photo to prove the puppies were ok.\nA drop-off time and location was arranged between the two, but Ms Forsythe says she didn't show up because she couldn't pay them, this angered the people she had been speaking with.\nThey threatened to break the puppies necks in text messages seen by Daily Mail Australia\nThe puppies were stolen after they were advertised on Gumtree, the thief arranged to pick up the dogs, provided proof of a transfer and their driver's licence number, but the money never came\nThey messaged her to threaten the dog's safety.\n'After the f*** around last night unfortunately people that I work for would rather brake there necks I'm sorry but you had your chance to get them home (sic),' one message read.\nThe thieves then increased the price and demanded $5,000 for the puppies.\nThe puppies were advertised for a lower price on Facebook after they were stolen, however they were labeled as one male and one female\nThe same photo used in the false advertisement had already been sent to the breeder as confirmation her dogs were ok\n'You continue to post things on Facebook and waste people's time and you play victim if you don't have $3500 just for frank of $5000 for both then stop wasting my time please Melissa,' a text read.\nMs Forsythe replied to the message and tried to explain how much the puppies meant to her and her family.\nThe reply wasn't what she expected.\nThe dog's breeder have tried to find the puppies using Facebook\n'I would have sympathy and remorse for my actions but after you wasting a lot of our time last night I have none for you or your family you shouldn't have lied people I'm working for wanted to cut frank open and send him back to you just to show you how things can get out of hand.'\nMs Forsythe has since found the puppy known as Frank. He was sold to a pet store in Ipswich, but his brother Hugo is still missing, and communication with those responsible has stopped.\n'Once it turned nasty I stopped all contact, I just want my puppy home end of story,' she said.\nThey located one at a pet shop, CCTV footage shows the puppy being brought in to the store\nInitially the contact was friendly the person texting Ms Forsythe even told her not to worry 'you're safe we aren't going to hurt you'.\nThe breeder now thinks she could be in danger.\n'(Alleged thief's name) put a comment on his page about how it isn't how it rolled out and I need to remember that he knows where I live.\n'I wasn't scared because he had never made any threats to me or my family but now I am.'\nThe message started nicely with promises of safety, Ms Forsythe now believes her family could be in danger\nThe dog was for sale at the pet shop for $1,500 when it was worth $4,500 according to the breeder\nMs Forsythe says that the money from the sale of the puppies was supposed to help pay for vet bills for the dog's sister who is unwell and assist with getting her four children to school.\n'My kids are now at school without their proper books, or proper school shoes because of what these people have done,' she said.\n'It is amazing what these drug addicts do to get money.\n'They look at people like us and think they can rip us off and we won't feel it, but we do.\n'This is my last litter, I am not selling anymore but it has shown me how easily we can be manipulated,' she said.\nA post by the man who had been speaking with Ms Forsythe has made her fear for her safety because he knows where she lives, and made a point of mentioning it\nAn advertisement which shows the same picture of the dogs sent to Ms Forsythe's home has popped up on Facebook.\nThe advertisement describes the puppies as one male and one female the breeder says she thinks that is to throw people off.\n'The photo they used in the ad is the one they sent me when I wanted proof that the dogs were alive, someone posted it on Facebook saying they were doing it for a friend,' she said.\nMs Forsythe says when she gets the dog back he will be sold again but she will 'thoroughly investigate' the next buyer.\nFrank, who was found in a pet shop on Wednesday has already been sold to someone the breeder knows personally. Ms Forsythe says he was excited to arrive home, and even more excited to see her at the pet store where he was found.\nThe breeder took photos of CCTV footage which shows the puppy Frank being delivered to the pet shop. The shop was selling the dog for $1,500 Ms Forsythe says they retail for $4,500.\nPolice are investigating the matter.","url":"https://www.dailymail.co.uk/news/article-3422078/Dognappers-demand-5-000-ransom.html"}
