{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-23 00:30:23","date_modify":"2018-10-23 00:30:23","date_publish":"2016-01-11 09:53:34","description":"She took home the Desert Palm achievement award at the Palm Springs International Film Festival Awards last week.","filename":"data/vaneerConsumption/GoldenGlobenomineesCateBlanchettGeorgeMillerandBenMendelsohnleaveemptyhanded.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/30065F9000000578-0-image-a-36_1452505710752.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393531_Cate-Blanchett-fails-nab-Best-Actress-George-Miller-Ben-Mendelsohn-leave-handed_1540254623.html","title":"Golden Globe nominees Cate Blanchett, George Miller and Ben Mendelsohn leave empty handed","title_page":"Golden Globe nominees Cate Blanchett, George Miller and Ben Mendelsohn leave empty handed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She took home the Desert Palm achievement award at the Palm Springs International Film Festival Awards last week.\nBut it seems Cate Blanchett's hopes at earning a clean sweep at this year's award season have been dashed, with the actress leaving empty handed at the Golden Globes on Monday.\nThe Australian star, nominated for Best Actress in a Drama Motion Picture for her role in 1950s romantic-drama Carol, lost out to Room actress Brie Larson.\nScroll down for video\nLosing out: Cate Blanchett's hopes at earning a clean sweep at this year's award season have been dashed, with the Australian actress leaving empty handed at the Golden Globes on Monday\nWhile her chances at winning an Oscar may now have waned, she was nothing but positive when speaking about her Golden Globe's loss, telling AAP: 'I'm just proud so many of the facets of Carol have been recognised because I've been with it for a long time'.\nStarring alongside Rooney Mara, the Australian beauty plays the character of a 1950s housewife who finds herself drawn into a lesbian affair.\nSpeaking of the project recently, Cate told of her excitement at having been able to work alongside the film's director, Todd Haynes.\nSee our full Golden Globes coverage as Helen Mirren fails to win at the coveted award\nA challenging role: Cate was nominated in the category of Best Actress in a Drama Motion Picture for her role in 1950s romantic-drama Carol, in which she plays a married woman who is lured into a lesbian affair\n'What's interesting about the film that Todd's made, and also about Patricia Highsmith's novel, is that in the end it's about falling in love,' she told Deadline.\n'And it's as much about the age gap between the women as it is about the outsider nature of their love.\nMeanwhile, another Australian who missed out on a golden statuette was Melbourne-born actor Ben Mendelsohn, who clawed his way to the category of Best Supporting Actor in a Series for Bloodline, but lost at the last hurdle to Mr. Robot's Christian Slater.\nEmpty handed: Meanwhile, another Australian who missed out on a golden statuette was Melbourne-born actor Ben Mendelsohn for his supporting role in Bloodline\nAustralian director George Miller also failed to win his category of Best Director in a Motion Picture for his work on hit action flick Mad Max: Fury Road.\nThe outcome may have come as a surprise to Mad Max fans, as the film was been met with outstanding critical success, having won 78 other awards to date.\nThe director of Leonardo DiCaprio-fronted survival epic The Revenant, Alejandro González Iñárritu, instead took out the coveted prize.\nThe Revenant proved itself as the front-runner for the impending Oscars after scooping a Golden Globe for best dramatic picture and best lead actor Leonardo Dicaprio,\nNot a Globe in sight: Australian director George Miller also failed to win in his category of Best Director in a Motion Picture for his work on hit action flick Mad Max: Fury Road\nTipped to win: The outcome may have come as a surprise to Mad Max fans, as the film was been met with outstanding critical success so far","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393531/Cate-Blanchett-fails-nab-Best-Actress-George-Miller-Ben-Mendelsohn-leave-handed.html"}
