{"authors":[],"date_download":"2018-10-22 21:24:48","date_modify":"2018-10-22 21:24:48","date_publish":"2016-01-28 07:40:25","description":"Klay Thompson outshone teammate Steph Curry as the Golden State Warriors avenged last month's loss to the Dallas Mavericks with an emphatic 127-107 victory. ...","filename":"data/vaneerConsumption/GoldenStateWarriorsavengeMavericksdefeatwithconvincingwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g669-4vVdYopwYQ7f641721b07aa58b9a-349_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420473_Golden-State-Warriors-avenge-Mavericks-defeat-convincing-win_1540243488.html","title":"Golden State Warriors avenge Mavericks defeat with convincing win","title_page":"Golden State Warriors avenge Mavericks defeat with convincing win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Golden State Warriors avenge Mavericks defeat with convincing win\nKlay Thompson outshone teammate Steph Curry as the Golden State Warriors avenged last month's loss to the Dallas Mavericks with an emphatic 127-107 victory.\nThompson on Wednesday poured on 45 points and five rebounds in a superb display as the Warriors romped home against one of only four teams to defeat them this season.\nThe Mavericks had beaten a Curry-less Warriors line-up in Dallas last month, winning 114-91 in a rare off night for the reigning NBA Champions.\nKlay Thompson of the Golden State Warriors slips while being guarded by Wesley Matthews of the Dallas Mavericks, at ORACLE Arena in Oakland, California, on January 27, 2016 ©Ezra Shaw (Getty/AFP)\nBut with Thompson in blistering form and Curry restored to the line-up on Wednesday, there was never much chance of the Mavericks pulling off a repeat victory.\nThe Warriors surged into a double-digit lead in the first quarter and kept the Mavs at bay thereafter as they extended their unbeaten home record to 21-0 this season, 42-4 overall. Dallas fell to 26-22.\nThe Mavericks, with German star Dirk Nowitzki given a night off, flickered briefly in the third quarter when Chandler Parsons drained a three-pointer to cut the Warriors lead to 65-54.\nBut the Mavericks fightback was snuffed out as the Warriors went on a 30-point blitz to build a comfortable 95-77 lead.\nCurry finished with a relatively modest 14-point haul, just ahead of Harrison Barnes (13) and Draymond Green (10).\n- Chasing the Bulls? -\nWednesday's win follows blowout victories over the Cleveland Cavaliers and San Antonio Spurs in recent weeks.\nHaving opened the season with a record unbeaten streak, the Warriors are now on track to eclipse the Chicago Bulls' 72-win season in the Michael Jordan era set in the 1995-1996 campaign.\nThe Warriors next big hurdle as they aim to edge closer to the Bulls record mark is likely to come against Western Conference rivals the Oklahoma City Thunder early next month.\nThe Thunder, who have the third best record in the West, improved to 35-13 with a battling 126-123 win over the Minnesota Timberwolves on Wednesday.\nKevin Durant led the scoring for Oklahoma City with 27 points, with nine rebounds and five assists. Durant's haul included nine points during a nervy final quarter where the momentum swung wildly.\n\"We didn't play particularly well, but the name of the game at the end of the day, you look at who had more points than the other,\" Durant said.\n- 'Surreal' for Lue -\nThunder guard Russell Westbrook, just short of a triple-double with 24 points, 15 assists and eight rebounds, said the team were happy to complete a four-game road trip with a 3-1 record.\n\"We like to win, but at the same time, we know there's room for improvement on the defensive end,\" Westbrook said. \"But we definitely take our victories and get back home.\"\nIn Cleveland, the Cavaliers ensured new coach Tyronn Lue would be in charge of the Eastern Conference team at next month's All-Star Game with a 115-93 win over the Phoenix Suns.\nLue has only been in charge of the Cavaliers for three games since the shock dismissal of David Blatt last week. Yet he will take charge for the All-Star game after Cleveland made sure that they will finish January with the best record of any team in the Eastern Conference (32-12).\n\"It's a tribute to Coach Blatt and the players and the hard work the assistant coaches put in to get us to this point,\" Lue said Wednesday.\n\"It's going to be a great honor to represent the Cleveland Cavaliers and having a chance to do this, I know my coaches are excited, and I know it's going to be a surreal moment.\"\nStephen Curry of the Golden State Warriors is covered by Raymond Felton of the Dallas Mavericks, at ORACLE Arena in Oakland, California, on January 27, 2016 ©Ezra Shaw (Getty/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3420473/Golden-State-Warriors-avenge-Mavericks-defeat-convincing-win.html"}
