{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-22 22:08:20","date_modify":"2018-10-22 22:08:20","date_publish":"2016-01-11 02:23:39","description":"He won critical acclaim for his performance in The Danish Girl. But Eddie Redmayne has confirmed he's gearing up for the absolute role of a lifetime - specifically, first-time fatherhood.","filename":"data/vaneerConsumption/GoldenGlobewinnerEddieRedmayneconfirmswifeHannahBagshaweispregnant.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/300228B100000578-0-image-a-67_1452478951469.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393247_Eddie-Redmayne-bundle-nerves-attends-Golden-Globes-pregnant-wife-Hannah-Bagshawe_1540246100.html","title":"Golden Globe winner Eddie Redmayne confirms wife Hannah Bagshawe is pregnant","title_page":"Golden Globe winner Eddie Redmayne confirms wife Hannah Bagshawe is pregnant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He may have won critical acclaim for his performance in The Danish Girl.\nBut British actor Eddie Redmayne has confirmed that he's gearing up for the role of a lifetime - namely, fatherhood.\nThe award-winning star used the 73rd annual Golden Globes to share the news, which delighted both film fans and critics alike.\nScroll down for video\nExpecting: Eddie Redmayne used the 73rd Golden Globes to confirm that wife Hannah Bagshaw is pregnant\nSpeaking to veteran TV host Ryan Seacrest at the Hilton Hotel in Beverly Hills - who asked whether they were expecting - Eddie replied: 'That is true.'\nThe couple, who married in 2014, were then presented with baby shower gifts which included onesies saying 'You Should See My Crib' and 'Milking My 15 Minutes'.\nLaughing, Eddie responded: 'I’m sweating now – she’s calm I’m not.'\nSee our full Golden Globes coverage on the winners and red carpet fashion\nOh dear: He was up for Best Performance By An Actor In A Motion Picture Drama - and it's fair to say that Eddie Redmayne had let his nerves get the better of him\nHe told Ryan Seacrest: 'I’m sweating now – she’s calm I’m not' of his wife\nThe arrival, which is thought to be expected in late Spring, will be the couples' first child together.\nClearly feeling protective of his wife, Eddie could then be seen guiding her across the busy red carpet.\n'It's a bit like Waterloo Station at rush hour', he quipped as security guards tried to clear the celebrity gridlock on the long and winding red carpet.\nThe good news will surely eclipse the fact he missed out on a gong for his performance in The Danish Girl. He was up against Leonardo DiCaprio, who eventually won for The Revenant.\nHappy times: Ryan also asked Eddie: You have a baby on the way?' To which Eddie said: 'That is true'\nGift: The television host and producer then gave them onesies that said - 'You should see my crib' emblazoned across the front\nThe Danish Girl is a fictitious love story loosely inspired by the lives of Danish artists Lili Elbe and Gerda Wegener. In it, Lili (Eddie) and Gerda's (Alicia Vikander) marriage and work evolve as they navigate Lili's groundbreaking journey as a transgender pioneer.\nThat aside, Eddie looked incredibly dapper in a navy suit which had delicate polka dots running throughout, as well as a bow tie and white shirt.\nHannah looked amazing in a complementary black dress which hid any sign of a bump thanks to its layered ruffled design.\nLast minute dash: Earlier on in the day, Eddie was pictured arriving at LAX airport a matter of hours before the show was set to start\nOn the move: The star wore a casual eagle sweater and thick-framed glasses as he carried his briefcase through the terminal\nShe wore a pretty green beaded necklace as he cosied up to her man while they posed for photographers.\nEarlier on in the day, Eddie was pictured arriving at LAX airport a matter of hours before the show was set to start.\nThe star wore a casual eagle sweater and thick-framed glasses as he carried his briefcase through the terminal.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393247/Eddie-Redmayne-bundle-nerves-attends-Golden-Globes-pregnant-wife-Hannah-Bagshawe.html"}
