{"authors":["Portia Crowe"],"date_download":"2018-10-30 22:46:16","date_modify":"2018-10-30 22:46:16","date_publish":"2016-12-12 00:00:00","description":"Gary Cohn will be allowed to defer paying any capital-gains taxes from the sale.","filename":"data/vaneerConsumption/GoldmanSachsGaryCohntodefercapitalgainstaxonsharessold.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_goldman-sachs-gary-cohn-to-defer-capital-gains-tax-on-shares-sold-2016-12_1540939576.html","title":"Goldman Sachs' Gary Cohn to defer capital-gains tax on shares sold","title_page":"    Goldman Sachs' Gary Cohn to defer capital-gains tax on shares sold - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Gary Cohn, Goldman Sachs' chief operating officer and president. Jim Young/Reuters Gary Cohn, Goldman Sachs' COO and president, has been named to a big position in the Trump administration — and it makes for a big payday for him.\nThe Wall Street executive has been named as assistant to the president for economic policy and Director of the National Economic Council.\nHe will need to sell his shares in Goldman Sachs to avoid a conflict of interest. As of November 14, he held 872,712 shares worth about $210 million in total, according to Bloomberg.\nWhat's more: Cohn will be allowed to defer paying any capital-gains taxes from the sale.\nThe same thing happened when the former Goldman Sachs CEO Henry Paulson became Treasury secretary in 2006.\nAs Fortune explained at the time, government officials are allowed to hold off on paying capital-gains taxes on assets they sell to avert conflicts of interest — as long as they reinvest the proceeds in government securities or a government-approved mutual fund.\nFortune's Stephen Gandel on Monday reported that Cohn's holding had gained $52 million in value since the election on November 8.","url":"https://www.businessinsider.com/goldman-sachs-gary-cohn-to-defer-capital-gains-tax-on-shares-sold-2016-12"}
