{"authors":["Brittany Valadez For Dailymail.Com"],"date_download":"2018-10-22 21:22:30","date_modify":"2018-10-22 21:22:30","date_publish":"2016-01-11 00:38:00","description":"Jamie Lee Curtis' daughter Annie brought a whole new meaning to the phrase, 'just like her mother.'","filename":"data/vaneerConsumption/GoldenGlobesredcarpetseesJamieLeeCurtisdaughterAnniesportsilverhair.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/23/3001426500000578-0-image-a-113_1452469255160.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393091_Jamie-Lee-Curtis-daughter-Annie-sports-silver-hair-match-mom-pair-walk-Golden-Globes-red-carpet_1540243350.html","title":"Golden Globes red carpet sees Jamie Lee Curtis' daughter Annie sport silver hair","title_page":"Golden Globes red carpet sees Jamie Lee Curtis' daughter Annie sport silver hair | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With a mother as stylish as hers, Annie Guest didn't need to look far to find inspiration for her Golden Globes look.\nThe 29-year-old dancer copied Jamie Lee Curtis' silver hair as the two arrived together for the awards ceremony on Sunday.\nCurtis, 57, wore her silver barnet short and cropped, while Annie's was a flattering tousled shoulder length\nScroll down for video\nA family affair: On Sunday, Jamie Lee Curtis, 57, was joined by daughter Annie Guest, 29, at the 73rd annual Golden Globes in Beverly Hills\nJamie looked ravishing in a navy blue floor-length gown complete with black flower detailing.\nThe Scream Queens star kept her makeup to a minimum, with a simple nude lip and lined eyes.\nAnnie was classically dressed in a white floor-length gown, sans a train unlike her mother's.\nThe dress featured a cinched waist, held together by a sparkling broach.\nThe light-haired beauty opted for a slightly more dramatic make-up look with winged liner and a pink lip.\nSee live updates on the Golden Globes 2016 with the latest red carpet pictures and videos\nStyle twins: Dancer daughter Annie was the star's plus one for the night, looking similar to her mother with her grey-tinted hair\nRed-carpet ready: The 29-year-old beauty was classically dressed in a white flloor-length gown, sans a train unlike her mother's\nJamie is nominated for Best Performance by an Actress in a Television Series - Musical or Comedy for her work in Fox's new show, Scream Queens.\nShe's up against last year's winner, Gina Rodriguez, who made waves for her work in the CW's Jane the Virgin.\nJust like Jamie, Gina also brought a family member to the red carpet, her father Genaro Rodriguez.\nA nod of her own: Jamie is nominated for Best Actress in a Television Comedy for her work in Fox's new show, Scream Queens\nFierce competition: She's up against last year's winner, Gina Rodriguez, who made waves for her work in the CW's Jane the Virgin\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393091/Jamie-Lee-Curtis-daughter-Annie-sports-silver-hair-match-mom-pair-walk-Golden-Globes-red-carpet.html"}
