{"authors":[],"date_download":"2018-10-22 21:41:48","date_modify":"2018-10-22 21:41:48","date_publish":"2014-05-07 22:27:56","description":"A laser weapon being developed by Lockheed Martin successfully disabled two boats in a recent test off the California coast.","filename":"data/vaneerConsumption/Gonein30SecondsPrototypeKillerLaserTakesOutBoatsaMileAway.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/427611/140507-laser-boat_473bc8358c1dddfce6d85d422a70cb2e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_gone-30-seconds-prototype-killer-laser-takes-out-boats-mile-n99836_1540244508.html","title":"Gone in 30 Seconds: Prototype Killer Laser Takes Out Boats a Mile Away","title_page":"Gone in 30 Seconds: Prototype Killer Laser Takes Out Boats a Mile Away","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA new laser weapon being developed by Lockheed Martin successfully disabled two boats a mile away in a recent test off the California coast, the company said.\nLockheed Martin is developing the ground-based high-energy laser weapon, known as the Area Defense Anti-Munitions (ADAM) system, as a potential military defense against short-range threats, including drones, small boats and homemade artillery rockets.\nThe defense contractor on Wednesday posted a video online showing the first tests of the laser weapon against targets at sea. In less than 30 seconds, the company said, the system’s high-energy laser zeroed in on and burned through multiple compartments of the rubber hull of the military-grade small boats operating in the Pacific.\n“Our ADAM system tests have shown that high-energy lasers are ready to begin addressing critical defense needs,” Tory Bruno, president of Lockheed’s strategic and missile defense systems, said in a statement.\nLockheed Martin has previously demonstrated the prototype laser system’s ability to destroy free-flying Qassam-like rocket targets.\n— NBC News staff","url":"https://www.nbcnews.com/tech/innovation/gone-30-seconds-prototype-killer-laser-takes-out-boats-mile-n99836"}
