{"authors":["Bob Price"],"date_download":"2018-10-30 20:53:29","date_modify":"2018-10-30 20:53:29","date_publish":"2016-08-08 19:14:10","description":"Two armed men picked the wrong Whataburger to try and rob early on Monday morning.","filename":"data/vaneerConsumption/GoodGuysWithGunsStopArmedRobbersinTexasWhataburger.json","image_url":"https://media.breitbart.com/media/2016/08/Whataburger-robbery-in-Spring-KTRK-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_08_08__1540932809.html","title":"Good Guys With Guns Stop Armed Robbers in Texas Whataburger","title_page":"Good Guys With Guns Stop Armed Robbers in Texas Whataburger","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas – Two armed men picked the wrong Whataburger to rob early Monday. As the attempted robbery unfolded, they discovered two off-duty Harris County sheriff’s deputies were dining in the restaurant. One robber was shot and the other escaped.\nTwo men entered the Whataburger located on FM 2920 in Spring, Texas early Monday morning, intending to rob the restaurant, ABC13 in Houston reported. One of the men entered through the back door, while the second came in through the front and went straight to the cash register.\nOne of the suspects was wearing a mask and the second had on a hood, according to witnesses who were dining inside the popular burger chain. The robber who came through the front door allegedly began assaulting the store’s cashier. Harris County sheriff’s spokesman, Deputy Thomas Gilliland told ABC13, “It was a very chaotic scene at the very beginning.”\nThe two off-duty deputies had stopped for a meal after returning from a concert. One of the deputies confronted the robber at the cash register. He told the other patrons of the Whataburger to get out of the building. “He had told us to get out, get out, three times and the third time, he yelled at so we ran out of the restaurant,” the witness told the ABC reporter.\nGilliland told the reporter the situation could have been much worse had the deputies not been at the scene when the attempted robbery unfolded.\nOne of the deputies discharged his firearm during a struggle with one of the robbers. He fired approximately 10-12 shots, some of which struck one of the suspects. After collapsing on the floor, the robber was transported to a local hospital where he is expected to survive. The second suspect fled from the scene and has not been captured. Police investigators found the suspects’ guns at the scene.\nThe two deputies have been placed on administrative leave for four days, the local ABC affiliate reported. During that time, they will be evaluated by a medical doctor. They will also receive a psychiatric exam per the department’s standard policy.\nJust last week, Breitbart Texas reported on another armed robbery that was thwarted when the store’s employees locked themselves in a bulletproof room. The three armed men were captured by video tape from the store’s security system as they tried shooting their way into the safe room. No one was injured in that incident, but some of the customers had cell phones and wallets stolen.\nA Waffle House restaurant in the Dallas metropolitan suburb of DeSoto, Texas, was also the scene of an armed robbery where the suspect was stopped by a man with a Texas License to Carry handgun. Breitbart Texas reported the suspect was taken to a hospital where he was said to be on life support.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2016/08/08/good-guys-guns-stop-armed-robbers-texas-whataburger/"}
