{"authors":["Aaron Klein"],"date_download":"2018-10-30 19:13:23","date_modify":"2018-10-30 19:13:23","date_publish":"2018-06-29 19:03:54","description":"House Judiciary Committee Chairman Bob Goodlatte (R-VA) revealed that during his closed session interview with the House Judiciary and Oversight committees, former FBI official Peter Strzok refused to answer multiple questions.","filename":"data/vaneerConsumption/GoodlattePeterStrzokRefusedtoTestifyAboutAnyTalkswithFusionGPS.json","image_url":"https://media.breitbart.com/media/2018/02/hillary-clinton-peter-strzok-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_29__1540926803.html","title":"Goodlatte: Peter Strzok Refused to Testify About Any Talks with Fusion GPS","title_page":"Goodlatte: Peter Strzok Refused to Testify About Any Talks with Fusion GPS | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NEW YORK — House Judiciary Committee Chairman Bob Goodlatte (R-VA) revealed that during his closed session interview with the House Judiciary and Oversight committees, former FBI official Peter Strzok refused to answer multiple questions, including whether he communicated with the author of the discredited anti-Trump dossier or with the firm paid by Hillary Clinton’s campaign to produce the infamous dossier.\nGoodlatte made those revelations during the televised portion of Wednesday’s hearing.\nAt that section of the hearing, Goodlatte stated (emphasis added):\nWe went through a lot of questions about a lot of things for which we got answers, but we were also stymied time and time and time again because the FBI counsel instructed him not to answer because it was, as she called it, an ongoing investigation. Now we have an ongoing investigation here as well. … Mr. Strzok was expected to answer questions regarding his involvement in both of these investigations. Not from this standpoint of the substance of the investigation but from the standpoint of what his role was in a contemporaneous time with some of the most unbelievably, outrageously biased, vulgar texts that he was exchanging at the same time that he was being introduced into this investigation. So questions regarding has he ever communicated with Mr. Steele, or Glenn Simpson, who is a journalist, or other matters like this to find out what his role was in the start of that investigation is critical to our investigation. And we need the answers to those questions. And we are now being blocked again from the FBI.\nSimpson, a former journalist with the Wall Street Journal, is the co-founder of Fusion GPS, the controversial firm that hired former British spy Christopher Steele to produce the dossier. Simpson’s Fusion GPS was paid for its anti-Trump work by Trump’s primary political opponents, namely Clinton’s 2016 presidential campaign and the Democratic National Committee (DNC) via the Perkins Coie law firm.\nAfter the hearing, Goodlatte appeared on Fox News to further comment on the FBI counsel’s refusal to allow Strzok to answer certain questions. The Congressman said that some of Strzok’s testimony was “not believable” when it came to the “hateful nature” of his anti-Trump text messages.\n“His explanations for … those questions about that hateful attitude are not believable,” Goodlatte told Fox News.\nStrzok was the lead FBI agent on the agency’s probe of Clinton’s private email server. It was later revealed that he was romantically involved with FBI attorney Lisa Page, who served in a liaison role in the FBI’s Clinton investigation.\nPage and Strzok have been the subject of public controversy following revelations last December that they exchanged a series of anti-Trump text messages. Still more messages were revealed in the recently released 500-plus page report by the Justice Department’s Office of the Inspector General.\nThe IG report cited previously unknown text messages between Page and Strzok in which the pair discussed stopping Trump from becoming president.\n“[Trump’s not ever going to become president, right? Right!?” Page texted Strzok in one August 2016 message.\n“No. No he won’t. We’ll stop it,” Strzok responded.\nAs Breitbart News reported, FBI witnesses speaking to the Justice Department’s internal watchdog described an extraordinary system of communication set up between Page and former deputy director Andrew McCabe that bypassed the ordinary chain of command to communicate important information about the agency’s probe of Clinton’s email server. The method of communication also involved Strzok, the IG report found.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.\nJoshua Klein contributed research to this article.","url":"https://www.breitbart.com/politics/2018/06/29/goodlatte-peter-strzok-refused-testify-talks-fusion-gps/"}
