{"authors":[],"date_download":"2018-10-30 00:51:12","date_modify":"2018-10-30 00:51:12","date_publish":"2017-02-14 00:05:18","description":null,"filename":"data/vaneerConsumption/GoodAlcoNewsAmericasSpiritsBusinessIsBooming.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/1952_Ford_F100_table_top_6879998274.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860672.html","title":"Good Alco-News: America’s Spirits Business Is Booming","title_page":"Good Alco-News: America’s Spirits Business Is BoomingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The U.S. drinks business is booming, despite the finger-wagging by neo-prohibitionists. Last year’s liquor volume sales climbed 2.4 percent to 220 million cases, and the revenues were up 4.5 percent to $25.2 billion according to data released by the Distilled Spirits Council.\nDoes this means America is on a bender? No. In fact, Americans are not drinking more per capita. Binge drinking is down as is underage drinking.\nThe growth of the sales of spirits volumes partly reflects that more Americans are adding spirits to their intake. Some 28 percent of Americans call spirits their first choice for tippling, according to a Harris poll. Robert Simonson’s recent book, A Proper Drink: The Untold Story of How a Band of Bartenders Saved the Civilized Drinking World, well tells how cocktails have gone from low-quality and uncool to top-notch and chic over the past 20 years.\nAnd when Americans drink spirits they increasingly are drinking pricier stuff from the top-shelf. High end and super premium sales are growing for nearly every category, as the table below shows.\nSource: Distilled Spirits Council of the United States, “Annual Briefing Support Tables,” Feb. 2017.\nRising sales and revenues also also reflect continued export expansion. U.S. spirits exports increased 6.8 percent, despite the dollar being strong relative to many foreign currencies. Canada, the U.K., Australia, Spain, Germany, and Japan were the top export markets, each purchasing more than $100 million in hooch.\nWhat will the future bring for drinks sales? Certainly, the neo-prohibitionists pose a threat. They continues blaming alcohol as an evil and advocating higher taxes and more restrictions on access. To date, the domestic market has ignored their macabre tales. Indeed, over the past decade states and localities have expanded access by permitting liquor tastings at distilleries and paring back Sunday sales restrictions.\nInternationally, things are a bit more difficult to predict. Certainly, the world is falling in love with American whiskeys — as well they should. However, our teetotaler President Donald J. Trump’s threats to renegotiate trade deals adds a wildcard into the mix. If he can cut America a better deal or partners with Congress to enact policies to weaken the dollar, drinks sales could climb. But exports could suffer if Trump greatly antagonizes foreign leaders or pulls a Brexit-type maneuver, sales could fall — which would hurt American distilleries and anyone with drinks stocks in their portfolios. Time will tell.","url":"https://spectator.org/good-alco-news-americas-spirits-business-is-booming/"}
