{"authors":[],"date_download":"2018-10-22 21:22:31","date_modify":"2018-10-22 21:22:31","date_publish":"2014-05-06 21:05:06","description":"Workers and good Samaritans who found a Colorado mom after she had been trapped in her car for at least six days said her survival was miraculous.","filename":"data/vaneerConsumption/GoodSamaritansRecountRescueofColoradoCrashMomKristinHopkins.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/424731/140506-hopkins-car-jms-1816_21de4788f74af65ddead401d157d65d2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_good-samaritans-recount-rescue-colorado-crash-mom-kristin-hopkins-n98601_1540243351.html","title":"Good Samaritans Recount Rescue of Colorado Crash Mom Kristin Hopkins","title_page":"Good Samaritans Recount Rescue of Colorado Crash Mom Kristin Hopkins","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRescue workers and good Samaritans who found a Colorado mom after she had been trapped in her totaled car for at least six days said Tuesday that her survival was miraculous.\n\"I never expected to find what I found,\" said Andy Lombard, who spotted Kristin Hopkins' crumpled, overturned Chevrolet Malibu some 120 feet down an embankment and climbed down to help.\n\"I wish I could have found her sooner.\"\nHopkins, a 43-year-old single mother of four, went missing on April 27. On Sunday, Lombard and his wife Hope were driving on the highway, when he spotted something amiss and told her to pull over.\n\"I happened to look out the window at the right time at the right place and I saw a car upside down in the aspen trees,\" he said.\n\"It was a horrific crash scene,\" he said.\nHe clambered down, peered through the tinted windows of the wreck, saw what he assumed was a dead body and called police.\nWhen Fairplay Police Chief David Gottschalk got to the road above the embankment and looked down, he saw the mangled red Malibu and debris scattered about.\nHe was certain the driver must be dead and was stunned when two firefighters who went down yelled up, \"She's alive.\"\nEven more shocking: a red and white umbrella propped up against the side of the car was not just a vestige of the crash but an SOS note a desperate Hopkins had scrawled with a marker.","url":"https://www.nbcnews.com/news/us-news/good-samaritans-recount-rescue-colorado-crash-mom-kristin-hopkins-n98601"}
