{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:53:41","date_modify":"2018-10-30 20:53:41","date_publish":"2016-10-05 00:51:46","description":"More details on the September 28 Townville Elementary Shooting have emerged, and they show that a good guy with a gun stopped the shooter in his tracks after two students and one teacher had been wounded. | Politics","filename":"data/vaneerConsumption/GoodGuyWithAGunStopsSCSchoolShooting.json","image_url":"https://media.breitbart.com/media/2016/10/awr-Screen-Shot-2016-09-28-at-2.43.39-PM-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_04__1540932821.html","title":"Good Guy With A Gun Stops SC School Shooting","title_page":"Good Guy With A Gun Stops SC School Shooting | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"More details on the September 28 Townville Elementary Shooting have emerged, and they show that a good guy with a gun stopped the shooter in his tracks after two students and one teacher had been wounded.\nThe good guy was volunteer firefighter Jamie Brock, who was at a “nearby farm” when he heard reports of the shooting. Armed, he raced to the school and “confronted Jesse Osborne,” the 14-year-old accused of killing his father then going to the school and shooting two 6-year-old boys and a teacher. One of the boys–Jacob Hall–died from his wounds on Saturday.\nWYFF reports that Brock reached “the elementary school moments before other officers could respond to a 911 call.” Fire Chief Billy McAdams accompanied Brock and told reporters that Brock “took the shooter down.” But McAdams did not mention that Brock had a gun. It has since been confirmed that he did.\nThere is no confirmation on how Brock utilized the firearm–whether he fired at Osborne, held Osborne at gunpoint, or simply had his hand on the handle of the holstered gun to show he was ready to draw if the attack did not end. Either way, Brock ended the attack.\nBrock released a statement on the incident, saying:\nThe true heroes of (the) senseless tragedy are the teachers that put their lives on the line to protect their students and the principal who through fears of her own did what’s right to ensure the safety of the school. They deserve to be called heroes, and to them I tip my hat.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/10/04/good-guy-gun-stops-sc-school-shooting/"}
