{"authors":[],"date_download":"2018-10-30 19:43:52","date_modify":"2018-10-30 19:43:52","date_publish":"2018-07-06 19:10:00","description":"Two years ago, conditions at Creekside Forest Apartment Homes in DeKalb County drew outrage. But Thursday, the complex smelled not of garbage, but of sawdust from the construction crew renovating a development once so bad DeKalb County officials wanted to tear it down and arrest the owner.","filename":"data/vaneerConsumption/GoodthingscomingfornotoriouscrimeinfestedDeKalbcomplex.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/05/Images/IMG_0007.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_good-things-comi_49a1bb203aaa7d895997a9504d8a9df3__1540928632.html","title":"Good things coming for notorious, crime-infested DeKalb complex?","title_page":"Good things coming for notorious, crime-infested DeKalb complex?","title_rss":"NULL","source_domain":"ajc.com","text":"Two years ago, conditions at Creekside Forest Apartment Homes drew outrage. The grounds were covered with old diapers, beer cans, syringes. Families had no water and power, and spoke of squatters and gangs taking over, of gunshots and the blood of a dead boy staining the pavement.\nBut Thursday, the complex smelled not of garbage, but of sawdust from the construction crew renovating a development once so bad DeKalb County officials wanted to tear it down and arrest the owner — if they could just find him.\nAt the gate, security guard Lavarus Smith said he hadn’t had issues with squatters in recent months while the renovations have been underway. He said there are no residents at all in the development, which property records say got a new owner, Falcon GA Investments, in 2017.\nCounty Commissioner Larry Johnson, who lived in the complex years ago before its decline, said the progress is an example of more to come in DeKalb, where officials are getting aggressive against blight. He hopes the work will spur development in the Candler Road, I-20 area, which has long struggled with crime and poverty.\n“It will help a lot,” he said Thursday. “It’s a great area for investment.”\nCreekside Forest Apartment Homes shown in early September 2016. JOSHUA SHARPE/JOSHUA.SHARPE@AJC.COM\nJohnson was among the officials who worked for months in 2016 with then-owners, Creekside by TAG, to get the complex cleaned up. Code enforcement issued hundreds of violations. The leasing office sat empty, vandalized. The post office stopped bothering to deliver mail, residents said, and tenants complained they didn’t even know who to pay for rent. One man said he had mushrooms growing from his carpet and the living conditions caused so much stress it helped end his relationship with his fiancé.\nThe broader public was unaware of the conditions until September 2016, when DeKalb Commissioner Nancy Jester, stepped far out of her northern district, into Johnson’s, to call attention to the problems.\nThe county released detailed plans for relocating residents.\nEvictions came.\nCreekside Forest Apartment Homes in early September 2016. (Brant Sanderlin/AJC)\nWorkers at DeKalb County Schools suddenly had to scramble to help students find new housing and deal with the uncertainty. Fifty students from Flat Shoals Elementary alone were among the evicted.\nREAD: Meth, ‘the Devil’s drug,’ is back and killing more people than ever\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nREAD: ‘A murderer I am not’: Woman tells judge she was abused before killing\nThat November, a judge issued a bench warrant for the owner when he didn’t show up to court to answer to code violations. He reportedly lived in New York, and officials couldn’t even agree on his name. It’s unclear if he was ever arrested.\nBut his company relinquished the property in February 2017, according to property records.\nSince then, Johnson and Jester, who have often clashed, agree the county has a strong commitment to fighting the decline of such properties.\n“DeKalb was ignoring blight like this property for years,” Jester said Thursday. “Now, we have new ordinances, more compliance officers and even a blight court to hold property owners accountable.”\nOne thing, Johnson said, that must be kept in mind is keeping housing affordable while also safe.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/good-things-coming-for-notorious-crime-infested-dekalb-complex/dMa0VOdF68Ukhd0NhgzF9N/"}
