{"authors":[],"date_download":"2018-10-22 22:46:40","date_modify":"2018-10-22 22:46:40","date_publish":"2014-06-10 23:03:23","description":"Upscale movie theater chain Alamo Drafthouse has joined a growing group of businesses in banning Google Glass — while the film is playing, at least.","filename":"data/vaneerConsumption/GoogleGlassBannedatAlamoDrafthouseTheaterChain.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/216896/googleglasstitanium_973830d676d2ad3d7150974891a0a1a5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_google-glass-banned-alamo-drafthouse-theater-chain-n127876_1540248400.html","title":"Google Glass Banned at Alamo Drafthouse Theater Chain","title_page":"Google Glass Banned at Alamo Drafthouse Theater Chain","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUpscale movie theater chain Alamo Drafthouse has joined a growing group of businesses in banning Google Glass — at least, banning moviegoers from wearing it during the film.\nThe news was announced by the chain's founder, Tim League, on Twitter.\nLike other Glass bans, this was followed by a flurry of questions and responses as others on Twitter cheered or deplored the action.\nShortly after the announcement, League explained that the ban is \"only about privacy concerns,\" adding \"but on a personal level, I advocate turning off distractions during a movie.\" He also noted that video cameras have always been banned from theaters.\nYou can wear them in the lobby, however, and in the theater before the movie starts. It's only when the lights dim that Glass becomes a potential problem.\nThe Alamo Drafthouse appears to be the first theater chain to specifically ban Glass, but that doesn't mean it's safe to use elsewhere. It was only a few months ago that a man was pulled from a movie in Ohio and grilled by federal agents after being spotted wearing glass into the theater.","url":"https://www.nbcnews.com/tech/gadgets/google-glass-banned-alamo-drafthouse-theater-chain-n127876"}
