{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:23:47","date_modify":"2018-10-30 23:23:47","date_publish":"2016-12-07 00:00:00","description":null,"filename":"data/vaneerConsumption/GoogleparticipatesinLemonades34Mround.json","image_url":"https://amp.businessinsider.com/images/58483237e02ba75e658b6d47-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_google-participates-in-lemonades-34m-round-2016-12_1540941827.html","title":"Google participates in Lemonade's $34M round","title_page":"    Google participates in Lemonade's $34M round - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence This story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nNew York-licensed insurtech Lemonade continued to exhibit the stellar performance of its first year with the completion of a $34 million Series B funding round confirmed on Tuesday.\nParticipants included General Catalyst, Thrive Capital, Tusk Ventures, Sequoia, and GV (formerly Google Ventures), the VC arm of Google's parent company Alphabet. The latest round brings Lemonade's total funding to $60 million, and comes less than two months after its launch, and less than a year after its Seed round. Lemonade also confirmed that it had filed for a license in California, and while it did not specify what the new funds would be spent on, it seems likely that at least some of the money will go toward further US expansion.\nAlphabet continues its push into insurance. While the tech giant decided to withdraw its proprietary auto-insurance product in February, its investment in Lemonade suggests that it hasn't given up on the sector completely. GV has previously made insurtech investments — notably, it invested $32 million in health insurtech Oscar last year. And participation in Lemonade's round signals that Alphabet may well have decided investing in insurance startups will bring greater rewards than building its own products.\nThe firm's continued interest in the insurance industry is likely to worry legacy insurers. Some incumbents may be uneasy about insurtech newcomers, but many consider legacy tech giants to be a much bigger concern. This is because tech giants like Alphabet, Amazon, and Apple have both the resources to invest in startups and the savvy to leverage newly-acquired technology to improve their own offerings. Moreover, they have nimble governance structures that allow them to easily enter new industries, where they can become dominant players. GV's investment in Lemonade highlights the need for legacy insurers to continue shoring up their businesses against insurtech disruption.\nThe global insurance industry is worth nearly $5 trillion, and insurance companies are at risk of losing a share of this valuable market to new entrants. That's because these legacy players have been even slower to modernize than their counterparts in other financial services industries.\nThis has created an opportunity for a group of firms known as insurtechs. These startups are leveraging new technology and a better understanding of consumer expectations to increase efficiencies in the insurance industry. Some are helping incumbents deliver better end products, while others are directly competing with legacy players.\nSarah Kocianski, senior research analyst for BI Intelligence, Business Insider's premium research service, has compiled a detailed report on insurtechs that looks at the drivers behind the increasing number of insurtech companies, how they are helping or disrupting legacy players in the insurance industry, and where legacy players are innovating off their own backs.\nHere are some of the key takeaways from the report:\nThe opportunity is currently biggest in the US and Europe. That's because these regions have large, very mature insurance industries.\nInsurtechs' products and services mostly target retail customers. This includes small businesses and consumers.\nMost insurtechs are acting as enablers. This means that they offer products and services that help insurers and reinsurers improve their processes and better serve customers.\nOf the main players in the insurance industry, brokers are most at risk of disruption. This is because insurtechs can easily replicate their services and are solving historical industry problems faster than legacy players.\nLegacy players are also innovating. In particular, insurers and reinsurers are investing in insurtechs and fintechs working with relevant technologies. At the same time, they are improving their own direct-to-consumer digital interfaces, increasing their disruptive threat to brokers.","url":"https://www.businessinsider.com/google-participates-in-lemonades-34m-round-2016-12"}
