{"authors":[],"date_download":"2018-10-30 01:12:37","date_modify":"2018-10-30 01:12:37","date_publish":"2017-03-22 20:31:00","description":"The company recently unveiled a maps feature that will allow users to share their exact location with friends as they’re a navigating to a destination.","filename":"data/vaneerConsumption/GoogleMapstoreleasenewlocationsharingfeature.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/22/Images/GettyImages-158329789-RrmR5iUFkC3kS5lAqQqp4ML-680x383%2540AJC.com.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/technology_the-new-google-m_055fca68a3419876a939f5a1c94b5dc9__1540861957.html","title":"Google Maps to release new location-sharing feature","title_page":"Google Maps to release new location-sharing feature","title_rss":"NULL","source_domain":"ajc.com","text":"Are you tired of your friends’ constant tardiness? If so, put some pep in their step with an assist from Google’s new location tracker.\n»RELATED: VIDEO: 7 hidden Google Maps features you never knew about\nThe company recently unveiled a maps feature that will allow users to share their exact location with friends as they’re navigating to a destination. Designed for short-term use, you can can allow people to track you for a period time or until you arrive.\nYou’ll be able to access it from the menu bar within Maps by selecting “share trip progress.” Then you can choose the people you want to view your status.\nWhen you do, your buddies will see that you’re not “five minutes away” from the movies but at the Starbucks 15 miles from them.\nYou’ll no longer be able to fib about the “standstill traffic” on the expressway or the “hold up” at your imaginary doctor’s appointment. Google is shutting down all bogus excuses.\nA few years ago, the corporation tried something similar with an app called Latitude, but it was removed in 2013. While product manager Ben Greenwood told Mashable there are a lot of similarities between the two, programmers have “added a lot here in terms of control.”\nThere’s no exact release yet for the feature but not to worry. There will soon be a possible cure for your pals’ chronic lateness.\n»RELATED: iPhone 8 leak confirms wireless charging, but reveals Apple’s expensive secrets","url":"https://www.ajc.com/technology/the-new-google-maps-tracker-will-ruin-your-lies-about-being-late/LiQgH70Y4V4WuYl53HBg7L/"}
