{"authors":["Tim Collins For Mailonline"],"date_download":"2018-10-23 01:31:11","date_modify":"2018-10-23 01:31:11","date_publish":"2017-04-26 11:57:01","description":"Google has today updated its map app to allow smartphone users to mark where they have parked, as well as adding a timer which will notify them when their parking ticket is about to run out.","filename":"data/vaneerConsumption/GoogleMapsupdatecouldendparkingticketsandlostcars.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F816200000578-0-image-a-51_1493209819464.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447198_Google-Maps-update-end-parking-tickets-lost-cars_1540258271.html","title":"Google Maps update could end parking tickets and lost cars","title_page":"Google Maps update could end parking tickets and lost cars | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wandering aimlessly in search of your parking spot could soon be a thing of the past, thanks to the latest update to Google Maps.\nAbsent-minded drivers can now easily pinpoint their car and find the best way to get back to it, using the app on their smartphone.\nAnd the new feature also provides a countdown timer and notifications, which could mean drivers return before landing a fine.\nScroll down for video\nThe latest release of the Google Maps app includes a tool for Android (pictured) and iOS that means you never need lose your car again or return to find a parking ticket\nNEW FEATURES - Drop a pin where you park - Add notes, like floor and row - Take photos to remind you of the area - Set a countdown timer to the meter - Share your parking spot's location\nThe parking tool was previously available for testing as part of a raft of new tools in Google Maps v9.49 beta.\nBut it is how now gone public, with an update to the Android and iOS app available from today.\nTo access the parking tool, you simply click on the blue dot that marks your location.\nThis brings up a menu, which includes the option 'Save your parking' on Android or 'Set as parking location' on iOS.\nSelecting this option drops a pin into the map and brings up a list of other details which can be recorded.\nThis allows you to make a note of the row and level you parked in if using a multi-story, or you can add photos of memorable surroundings.\nYou can also share the location you parked in with others, which could be useful as a meeting point after shopping trips or if you are leaving the car for someone else to use.\nPerhaps the most useful feature, however, is a timer which will count down the remaining minutes until your parking ticket runs out.\nIt will also notify you when your time is running low.\nThis is not the first feature released for Google Maps which aims to take the hassle out of parking.\nTo access the parking tool, you simply click on the blue dot (pictured) that marks your location. This brings up a menu, which includes the option 'Save your parking' on Android or 'Set as parking location' on iOS\nThe new release lets you set a timer (left) which will count down the remaining minutes until your parking ticket runs out. Google Maps will then update this information on the next to where you are parked, as well as notifying you when your time is running low (right)\nThe feature uses historical parking data to calculate a parking difficult score that will be shown in Google Map's direction card – the options include 'Limited', 'Medium' and 'Easy'\nIn February, the Silicon Valley search giant launched a parking difficulty icon in Google Maps that gives users in the United States a heads-up when parking is limited, allowing them to plan their trip accordingly.\nThe feature uses historical parking data to calculate a parking difficult score that is shown in Google Map's direction card – the options include 'Limited', 'Medium' and 'Easy'.\nGoogle rolled out the feature on Android in 25 metro areas across the US.\nSpeaking at the time, a Google announcement said: 'To see how hard it might be to park where you're headed, just get directions to your destination and look for the parking difficulty icon in the directions card at the bottom of the screen,' Google explained in the announcement.\n'Parking difficulties range from limited to medium to easy and are based on historical parking data.'","url":"https://www.dailymail.co.uk/sciencetech/article-4447198/Google-Maps-update-end-parking-tickets-lost-cars.html"}
