{"authors":[],"date_download":"2018-10-30 01:21:41","date_modify":"2018-10-30 01:21:41","date_publish":"2018-06-27 12:52:49","description":null,"filename":"data/vaneerConsumption/GoogleMightBeAbleToFigureOutWhenYouDieWhyThisandOtherTechInnovationsMatter.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/6054732942_31205d8ac8_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862501.html","title":"Google Might Be Able To Figure Out When You Die. Why This and Other Tech Innovations Matter.","title_page":"Google Might Be Able To Figure Out When You Die. Why This and Other Tech Innovations Matter.The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Bloomberg just released a piece on how Google is attempting to use personal health data to determine longevity. Perhaps this will be a useful technology, knowing for how much longer a loved one may have to organize their final goodbyes. But perhaps it is also a utilitarian tool for determining if a life is worth saving or not. The more free beds in a hospital and the less elderly on Medicare, the more efficient use of our time and resources. At least that’s how the “culture of death” would portray the matter.\nSurely, many others have written about this culture of death and its implications, citing abortion and the increasing acceptance of euthanasia. However, the narrative twists in a new direction. There is an insidious, unseen force behind the culture of death and these new techy innovations. Specifically, that each one of these changes or leaps of “progress” brings us closer toward the end of the need for work and personal expression.\nRecently, the value of innovation is measured in how effective it is at cutting time, costs, and effort. Essentially, utilitarianism has run amok. Google was created as a one-click solution to manually sifting through stacks at the library. Self-driving cars will erase the need for the minimal amount of effort that is left for driving. People do not even need to talk to each other anymore: Alexa, Amazon’s newest electronic toy, is all the “human” interaction people need. Ease of use is not, however, the only purpose of these inventions.\nMany lives have been lifted out of poverty and the standard of living has shot up exponentially over the past couple centuries. But, lately, ease of use is certainly the trend that they all share. And that should be cause for alarm.\nSince when is something good based solely on how much time and effort it takes? In the Beginning, work was not meant as a punishment (Genesis 2:15). Only after the Fall did it become toilsome. Oftentimes, the most fulfilling and rewarding things in life come from those endeavors that are the most painstakingly long. There is something inherently human about personal involvement.\nWhen the computer completes everything for you, what is there left to be proud of? What else is there to claim as the product of human ingenuity, talents, passions? Men are here to discover purpose and to use their allotted talents in whichever walk of life they feel called toward. Humanity has that explicit obligation toward others, to make the path cleaner for their neighbors, to tidy up the evils and imperfections of this world. For, whatever else, excluding worship, is there to do? In the most abstract manner, “cleanliness is next to godliness” holds real meaning.","url":"https://spectator.org/google-might-be-able-to-figure-out-when-you-die-why-this-and-other-tech-innovations-matter/"}
