{"authors":["Daisy Dunne For Mailonline"],"date_download":"2018-10-23 03:37:18","date_modify":"2018-10-23 03:37:18","date_publish":"2017-03-16 14:38:28","description":"The company, based in Mountain View, California, is secretly working on a device that will be the largest of its Pixel smartphones, according to rumours that have not yet been confirmed.","filename":"data/vaneerConsumption/Googlerumouredtobeworkingonathirdlargesmartphone.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/03/20/1422513600000514-0-image-a-43_1488572698365.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4319668_Google-rumoured-working-large-smartphone_1540265838.html","title":"Google rumoured to be working on a third large smartphone","title_page":"Google rumoured to be working on a third large smartphone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Google is secretly working away on a third device that will be the largest of its Pixel smartphones, according to rumours.\nSources have revealed that the company is working on a large Pixel device with the codename 'taimen', which is a large species of salmon.\nThe company has a track record of referring to its upcoming models as aquatic animals, and it was recently reported that Google is using the codenames 'muskie' and 'walleye' for its second generation Pixel and Pixel XL.\nScroll down for video\nGoogle is secretly working away on a third device that will be the largest of its smartphones, according to rumours. Pictured is the first generation of Pixel handsets\nWHY DOES GOOGLE USE CODENAMES? Sources have revealed that the company is working on a large device with the codename 'taimen', which is a large species of salmon. The company has a track record of referring to its upcoming models as aquatic animals, and it was recently reported that Google is using the codenames 'muskie' and 'walleye' for its second generation Pixel and Pixel XL. The codenames are noteworthy as they offer clues about the characteristics of Google's devices, according to Droid Life. The Google Nexus 6, which features a sizeable six inch (15cm) display, was codenamed 'shamu' because of its large size in 2014. This has led rumour sites to believe that the 'taimen' will be the largest of the Pixel devices.\nThe codenames are noteworthy as they offer clues about the characteristics of Google's devices, according to Droid Life.\nThe Google Nexus 6, which features a sizeable six inch (15cm) display, was codenamed 'shamu' because of its large size in 2014.\nThis has led rumour sites to believe that the 'taimen' will be the largest of the Pixel devices.\nGoogle has yet to confirm that these rumours are correct.\nBut the head of hardware at Google did announce earlier this month that the firm is developing a second-generation Pixel for the 'premium smartphone market'.\nIt is believed that the 'Pixel 2' could launch this fall, which would put the handset in direct competition with Apple's iPhone 8.\nThe confirmation comes from Rick Osterloh during an interview with AndroidPT.\n'There is an annual rhythm in the industry,' Osterloh said in the interview.\n'So, you can count on us to follow it.\n'You can count on a successor this year, even if you don't hear a date from me now.'\nGoogle debuted the first smartphones in its Pixel line during a conference in October 2016, a Pixel and the 5.5-inch (14cm) Pixel XL.\nBoth phones are available in 32 GB, £529 ($649) for the Pixel, £626 ($769) for the XL, and 128 GB, £609 ($749) for the Pixel, £708 ($869) for the XL, – prices that surpass Apple's iPhone line.\nAlthough the Pixel 2 release would fall around the same time as the iPhone 8, Google is focusing on the upper price segment of the market.\nGoogle's second-generation phone (pictured is the original Pixel) would go head-to-head with Apple's launch of its highly anticipated iPhone 8\nOsterloh stated that 'Pixel stays premium' and the firm will 'leave lower price segments to other manufacturers'.\nThe firm launched the Pixel line around the same time as the iPhone 7 was revealed.\n'We believe the next big thing will be at the intersection of hardware and software,' Osterloh said in October. And he also took aim at Apple, saying the phone has 'no unsightly phone bump'.\nBrian Rakowski of Google said the phone was 'designed inside and out to be smart'.\nHe said the Pixel's new camera was better than the iPhone 7.\n'It's the best smartphone camera anyone has made,' he said.\nGOOGLE PIXEL SPECS The Pixel runs on a Snapdragon 821 2.15GHz processor. The handsets come in 32GB or 128GB models, with microSD card slots enabling an additional 256GB of storage. The first-generation Pixel is be powered by a Qualcomm Snapdragon 821 chip They have 12.3 and 8-megapixel cameras and a full HD AMOLED screen with Gorilla Glass protection. Fast charging gives 7 hours of use in 15 minutes Included is Google's AI assistant, Allo for messaging and Duo for video calls. Free online storage for pictures and video Is be available in US on Verizon and in an unlocked version from $649. The first-generation handset range includes two new phones, a Pixel and the 5.5-inch Pixel XL\nIf a fall release date is in order, Google's second-generation phone would go head-to-head with Apple's launch of its rumoured iPhone 7s and highly-anticipated iPhone 8 .\nApple's upcoming flagship is said to be packed with cutting-edge technology and have a sleek design.\nThe rumours, which have been surfacing since last year, suggest that the handset will have an OLED wraparound screen, biometric technology and even wireless charging.\nAnd although Google has its sights set on the premium market – the iPhone has been speculated to cost £811 ($1,000).","url":"https://www.dailymail.co.uk/sciencetech/article-4319668/Google-rumoured-working-large-smartphone.html"}
