{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-22 22:50:14","date_modify":"2018-10-22 22:50:14","date_publish":"2016-01-29 10:21:03","description":"The internet giant agreed a controversial £130million deal with the taxman after insisting its sales are completed in Ireland - allowing it to avoid 20 per cent corporation tax usually due in the UK","filename":"data/vaneerConsumption/GooglesthousandsofUKstaffarepaidanAVERAGEof160000.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/2816ECAC00000578-0-image-a-12_1454062792647.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422494_Google-s-thousands-UK-staff-paid-AVERAGE-160-000_1540248614.html","title":"Google's thousands of UK staff are paid an AVERAGE of £160,000","title_page":"Google's thousands of UK staff are paid an AVERAGE of £160,000 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Government minister admits that the firm should pay more in the future\nStaff working for Google in London are paid an average wage of £160,000, despite the firm insisting its UK operation is small-scale.\nThe internet giant agreed a controversial £130million deal with the taxman after insisting its sales are completed in Ireland - allowing it to avoid 20 per cent corporation tax usually due in the UK.\nBut it emerged today that the 2,300 staff based in its swanky London offices were paid a total of £562million over an 18-month period as well as receiving £148million in share based bonuses.\nPictured: One of Google's three central London offices. The company's 2,300 staff earn an average salary of £160,000, despite the firm claiming most of its business is done in Ireland\nThe huge wage pot was divided between more than 1,000 marketing staff, nearly 800 researchers and 450 managers.\nCritics say the figures throw further doubt on the company's claims that its tax bill in Britain is low because its operation here is small.\nMargaret Hodge, former chair of the public accounts committee, told the Guardian: 'This unmasks the reality of their business. [Google UK] is not a back office support office. These are clearly people who are paid a lot because they add value.'\nGoogle has five British offices that helped the tech giant make £6billion in profit over ten years, it emerged this week.\nThe company claims that all UK sales are 'closed' in Dublin, with its lower rate of tax, allowing the US business to legally avoid an estimated £200million a year in UK tax.\nThe £130million 10-year deal with HM Revenue and Customs on back taxes was hailed as a 'victory' by Mr Osborne when it was announced at the weekend, but immediately came under fire.\nPictures emerged this week of the trendy offices where its army of UK-based workers relax and make deals\nBriton Barney Jones, 37, who worked for the company between 2002 and 2006, said 'heads should roll' at HMRC for agreeing the 'sweetheart' deal after he handed them over 100,000 emails to the taxman he claims proved the tech giant does business in the UK.\nIt also was also reported today that the much-heralded 'Google tax' which the Chancellor said would be his weapon against multi-national companies, was not used against Google.\nThe 'diverted profit tax' (DPT) was designed to tackle firms who registered their British sales in other countries, such as Ireland.\nBut The Times reported today that the tax was not used in the securing the web giant's £130million tax bill, because officials decided the firm's offshore arrangements were legitimate.\nIt is feared the decision could allow the company and others to move millions of pounds offshore without having to pay tax on them.\nTransport Secretary Mr McLoughlin last night admitted the company's bill should be increased in the future.\nFormer chair of the public accounts committee Margaret Hodge said the figures expose the true scale of the company's UK operation. Transport Secretary Mr McLoughlin said: 'There is more for them to pay'\nHe said: 'The truth is it's a move in the right direction. There is more for them to pay and I want them to pay more in future.'\nAppearing on BBC1's Question Time, he said: 'Of course I would like to see Google make more payments to the country. I would like to see them employ more people in this country.\n'They do employ 3,000 people, top end jobs, they are doing a lot of investment in this country as well, which is actually good for the long-term economic future of the country.\n'But I believe in a low tax base, I believe in attracting companies here, but I believe when those companies are here they should pay their tax which is rightly collected.\n'But companies can and have found ways around paying taxation and we have made a lot of changes to the taxation system that actually will make them pay more over years to come.'\nSo now we know how much tax Google will be paying - but what about the UK's other massive multi-nationals?\nFACEBOOK: PAYING A TINY TAX BILL EVEN SMALLER THAN GOOGLE'S Facebook is one of the companies whose tax affairs have provoked the most anger. The social network handed over just £4,327 in company taxes last year - less than the average British worker. The company's 362 UK staff took home an average of £210,000 in pay and bonuses last year, according to its latest accounts. Facebook's British arm was able to slash its tax bill by reporting an accounting loss of £28.5million last year, having handed out £35.4million to its workers through a share bonus scheme. This scheme was worth more than £97,000 on average for each member of staff, the company accounts show. It was reported earlier this week that the company has vowed to 'defend any and all such claims' for back taxes from HMRC.\nAMAZON: SALES TAKEN THROUGH LUXEMBOURG ARM TO REDUCE TAX Amazon last year revealed that its UK business paid £11.9million in tax on £5.3billion worth of sales to British shoppers. The online retailing giant recorded sales up 14 per cent last year, according to Companies House filings. But the group's Amazon.co.uk subsidiary reported a profit of just £34.4million and thus incurred a tax bill of £11.9million. Amazon employs more than 7,700 people in the UK and its sales in the country account for 9.4 per cent of its global turnover. But sales in Britain are taken through the group's Luxembourg arm, called Amazon EU Sarl. The Luxembourg business is where sales from many countries in Europe are booked and are not taxed in the country where the shopper carried out the transaction.\nAPPLE: MARKET IS BOOMING FOR ITS PRODUCTS BUT BILL STILL LOW Electronics giant Apple paid only £11.8million, figures released last year show, despite raking in profits estimated at almost £2billion. Some tax experts said the bill was up to£400million short of possible taxes the firm could have paid. The public's insatiable appetite for its iPhones and iPads have made Apple the most valuable company in the world, with an estimated value of more than £500billion. But it funnels its vast sales though Ireland to whittle down its tax bills in the UK and other countries. Corporate accounts show Apple made £116billion of sales globally in the 12 months to September 2014.","url":"https://www.dailymail.co.uk/news/article-3422494/Google-s-thousands-UK-staff-paid-AVERAGE-160-000.html"}
