{"authors":["Merrit Kennedy","Joe Ruiz"],"date_download":"2018-10-22 23:07:23","date_modify":"2018-10-22 23:07:23","date_publish":"2016-08-20 00:00:00","description":"Researchers from the Nautilus exploration vessel came upon the bright purple creature with giant eyes. It may look like a cartoon character, but it's real. It's also pretty tough, a researcher says.","filename":"data/vaneerConsumption/GooglyEyedStubbySquidCapturesInternetsAttention.json","image_url":"https://media.npr.org/assets/img/2016/08/20/squid_wide-d46e626f4073ad9407005159e482187449a86b2c.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_08_20_490738084_googly-eyed-stubby-squid-captures-internets-attention_1540249643.html","title":"'Googly-Eyed' Stubby Squid Captures Internet's Attention","title_page":"'Googly-Eyed' Stubby Squid Captures Internet's Attention : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'Googly-Eyed' Stubby Squid Captures Internet's Attention\ntoggle caption EVNautilus via YouTube\nIt looks like it could be a cartoon character, but it's real. And this little squid is making waves on the internet.\nResearchers from the Nautilus exploration vessel were cruising along the deep sea floor off California's coast when they came upon the bright purple creature with giant, stuffed-animal-like eyes.\n\"Whoa!\" they exclaim in unison.\n\"It looks fake,\" one says. And those googly eyes? \"It looks like they just painted them on,\" another says, to peals of laughter.\nIn fact, the researchers can't contain their giggles as the look at the adorable creature. \"It's like some little kid dropped their toy,\" one comments. The stubby squid stays stoic, gazing straight ahead with its huge eyes throughout the entire 2.5 minute video. You can watch the squid's big moment here:\nEVNautilus YouTube\nWeekend Edition Saturday caught up with Samantha Wishnak, a science fellow on board the Nautilus. She says the little cephalopod has garnered a big reaction. \"I think it definitely captured the imagination of both our researchers on board and our hundreds of viewers who were watching when we discovered this guy.\"\nAnd that adorable wide-eyed expression? \"We probably encountered the squid at a time it wasn't expecting to see a 5,500 pound underwater robot moving towards it,\" says Wishnak. \"Scuba divers actually encounter these squid at scuba diving depths, and they say that when their dive lights turn on them, they get the similar kind of deer-in-the-headlights look.\"\nShe says this kind of stubby squid are tougher than they look – they're \"ambush predators you don't want to encounter if you're a shrimp.\" Wishnak thinks the squid was out hunting when the crew found it. Here's more:\n\"They're actually nocturnal hunters so they spend a lot of the day actually burrowed in the sea floor with just their eyes poking out. And then when they feel comfortable, when it's time to hunt, they'll actually start creeping along looking for their next meal.\"\nThey're also not always quite so purple, she says, because of a neat trick that involves activating a \"little sticky mucus jacket.\" That means \"pebbles, sand, whatever they're sort of burrowing in will stick to that jacket and give them a nice extra layer of camouflage,\" Wishnak says. Then, they lie in wait, \"and whenever a small fish or a shrimp crawls by it'll actually sort of turn off that mucus jacket and slide out of the sediment to lunge for their next meal.\"\nPretty fierce for a creature that resembles an adorable emoticon.\nCraving more deep-sea fun? Take a gander at this \"remarkable little octopod,\" found earlier this year near Hawaii.","url":"https://www.npr.org/sections/thetwo-way/2016/08/20/490738084/googly-eyed-stubby-squid-captures-internets-attention"}
