{"authors":["Daisy Dunne For Mailonline"],"date_download":"2018-10-23 04:05:07","date_modify":"2018-10-23 04:05:07","date_publish":"2017-04-26 15:42:19","description":"Spot is one of many lifelike robots being developed by Boston Dynamics, a branch of Google. The canine-like machine has started bringing parcels in Boston.","filename":"data/vaneerConsumption/GooglesrobotdogmakesitsfirstdeliveryinBoston.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA07D7800000578-0-image-a-90_1493220593888.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447996_Google-s-robot-dog-makes-delivery-Boston_1540267507.html","title":"Google's robot dog makes its first delivery in Boston","title_page":"Google's robot dog makes its first delivery in Boston | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Google's bizarre four-legged robot called Spot has started delivering parcels in Boston.\nThe canine-like machine can jump, climb stairs, get back up if it falls and even withstand a kick.\nIts inventors said Spot is '70 per cent of the way' through its trials and may one day be used to deliver parcels all over the world.\nScroll down for video\nGoogle's bizarre four-legged robot called Spot (pictured) has started delivering parcels in Boston\nSPOT CAN WITHSTAND KICKING A video showing Spot being kicked last year sparked an ethical debate. It was intended to show how stable the machine is, but viewers complained the 'dog'in the clip had been mistreated. The action was dubbed 'cruel', 'wrong' and has even raised concerns about robotic ethics. One Twitter user wrote: ''Kicking a dog, even a robot dog seems wrong.' Another said: 'Just wrong, kick a robot dog as practice: Google's dog robot looks too real for comfort when getting kicked.' But a more practical user wrote: ''Kicking a dog is wrong; it feels, breathes, and remembers. A robot is a piece of sheet metal.' Noel Sharkey from the University of Sheffield, UK, added: 'The only way it's unethical is if the robot could feel pain.'\nSpot is one of many lifelike robots being developed by Boston Dynamics, a branch of Google's parent company Alphabet.\nThough the robot was first unveiled in 2015 and has been tested by the US military, it is yet to be used for any real purpose by the company.\nBut at this week's TED2017 conference, Boston Dynamic's CEO said the robot has started delivering parcels to people's homes.\n'We've been taking our robot to employees' homes to see whether we could get in the various access ways,' said Marc Raibert, founder and chief executive of Boston Dynamics, at the event.\n'We're doing very well, about 70 per cent of the way.'\nIn 2015, Boston Dynamics released a video showcasing the robot's amazing abilities.\nIt shows the 160 lb (72kg) electrically powered and hydraulically actuated robot walking, trotting and even climbing steps.\nThe 160lb (72kg) electrically powered and hydraulically actuated robot can walk, trot and even climb steps as well as cope with being kicked\nA sensor on the robot's head helps it navigate over rough terrain - and to spot when humans, or another robo-dog, is nearby by, allowing it to follow its owner and run in formation.\nHowever, in the latest video it appears the dog is being completely controlled by a human operator.\nIn trials, Spot was shown to be able to walk and run over rugged terrain, following a soldier while carrying 400lbs (181kg) of their kit and weapons.","url":"https://www.dailymail.co.uk/sciencetech/article-4447996/Google-s-robot-dog-makes-delivery-Boston.html"}
