{"authors":["Belinda Grant Geary For Daily Mail Australia"],"date_download":"2018-10-22 21:49:42","date_modify":"2018-10-22 21:49:42","date_publish":"2016-01-28 08:52:37","description":"Google have worked with a team of talented linguists to hammer out the nuances of the Australian dialect to bring consumers an app that understands and sounds just like an Aussie.","filename":"data/vaneerConsumption/GoogleAppcannowunderstandAustralianslanglikearvoWooliesandBrissy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/08/30A7D52A00000578-0-image-a-33_1453970618384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420476_OK-Google-nearest-Maccas-Google-App-understand-Australian-slang-like-arvo-Woolies-Brissy-Maps-pronounce-local-place-names_1540244982.html","title":"Google App can now understand Australian slang like 'arvo, Woolies and Brissy'","title_page":"Google App can now understand Australian slang like 'arvo, Woolies and Brissy' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Google have worked with a team of talented linguists to hammer out the nuances of the Australian dialect to bring consumers an app that understands and sounds just like an Aussie.\nThe new 'true blue' Australian voice will reply to you in the Google app when you ask something like 'what is a drop bear' or when you are receiving directions in Google Maps to a uniquely Australian town like Mullumbimby.\nBut not only that, the upgraded app is capable of understanding native slang like 'Maccas', 'servo', 'arvo' and 'Woolies' - all of which would have been lost on the original American-style voice response service.\nScroll down for video\nGoogle have worked with a team of talented linguists to hammer out the nuances of the Australian dialect to bring consumers an app that understands and sounds just like an Aussie\nYou can now ask Google to send a message to a mate to ask if 'we are on for footy this arvo' or to query the weather conditions in 'Brissy', a common nickname for the Queensland capital of Brisbane.\nAside from slang, developers have been able to nail a range of tongue twisting locations - showing off the app's new abilities with a cover of Geoff Mack's Australian classic, 'I've Been Everywhere'.\nThe voice hasn't lost its robotic twang but it has somewhat adopted ours, perfectly pronouncing names like Grong Grong, Goondiwindi, Bouindarra and Maroochydore.\nThe fair dinkum upgrade, which was rolled out on Thursday, will now also be able to respond to a string of questions like such as: 'How far is Wagga Wagga? What's the weather like there? Will it be better tomorrow?'\nThe upgraded app is capable of understanding native slang like Maccas for McDonalds or arvo for afternoon\nGoogle App and Maps will also be able to comprehend the meaning of servo and Woolies\nThe app would have no problem deciphering the slang term Brissy, a common nickname for the Queensland capital of Brisbane (pictured)\nENGLISH VS AUSTRALIAN SLANG English Football Service Station McDonalds Woolworths Biscuit Chocolate Devastated Afternoon This afternoon Tuesday Salvation Army U-Turn From out west Tracksuit pants Sunglasses Australian Footy Servo Maccas Woolies Biccy Choccie Devo Arvo S'arvo Choosdee Salvos Uey Westie Trackie dacks Sunnies\nGoogle showed off the app's new abilities with a cover of Geoff Mack's Australian classic, 'I've Been Everywhere'\nWith worldwide mobile voice searches more than doubling in the last year, Google are confident the new upgrade will only increase usability for its Australian consumers\nWith worldwide mobile voice searches more than doubling in the last year, Google are confident the new upgrade will only increase usability for its Australian consumers.\n'Australians are more relaxed when they hear a familiar voice,' a Google spokesperson told Gizmodo.","url":"https://www.dailymail.co.uk/news/article-3420476/OK-Google-nearest-Maccas-Google-App-understand-Australian-slang-like-arvo-Woolies-Brissy-Maps-pronounce-local-place-names.html"}
