{"authors":["Associated Press"],"date_download":"2018-10-22 22:03:20","date_modify":"2018-10-22 22:03:20","date_publish":"2016-01-29 08:43:39","description":"The Silicon Valley rivals could trade places as early as Friday, given how rapidly the financial gap between them is narrowing.","filename":"data/vaneerConsumption/GoogleparentAlphabetmaysoontopApplesmarketvalue.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:d927b05c46274967bc52d548e33b5ae1-3bmscybNe842cce83474b52c5573-101_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422323_Google-parent-Alphabet-soon-Apples-market-value_1540245800.html","title":"Google parent Alphabet may soon top Apple's market value","title_page":"Google parent Alphabet may soon top Apple's market value | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As the digital advertising market booms and demand for smartphones wanes, Alphabet could soon dethrone Apple as the world's most valuable company.\nIf it happens, Alphabet will move to the head of the class just five months after Google reorganized itself under the holding company.\nThe Silicon Valley rivals could trade places as early as Friday, given how rapidly the financial gap between them is narrowing.\nAt the end of trading on Thursday, Apple's market value stood at $522 billion; Alphabet was worth $515 billion.\nFILE - This Thursday, Jan. 3, 2013, photo shows Google's headquarters in Mountain View, Calif. Alphabet Inc. is poised to move to head of the corporate class just five months after Google created its new holding company.\nCHANGING THE GUARD It's a potentially big shift for Apple, which has held bragging rights as the world's most valuable company for most of the past four-and-a-half years. (ExxonMobil seized the high ground for a brief time in 2013.) Alphabet would become the 12th company to rise to the most valuable spot, according to Standard & Poor's.\nThat's a dramatic swing from where things stood just 13 months ago.\nApple then boasted a market value of $643 billion, almost twice Google Inc.'s $361 billion.\nSince then, investors have soured on Apple Inc. The company has struggled to come up with another trend-setting product amid slumping sales of its most important device — the nearly 9-year-old iPhone, which accounts for roughly two-thirds of Apple's overall sales.\nApple has already acknowledged the iPhone will begin this year with its first quarterly sales decline since it debuted in 2007.\nThe slowdown helped push down Apple's stock price by 15 percent since the end of 2014.\nIn contrast, Google has maintained its leadership in the lucrative Internet search and ad market while building other popular products in video, mobile, web browsing, email and mapping.\nThat bundle of Google services brings in most of Alphabet's revenue, and is expected to deliver growth in the 15 percent to 20 percent range as marketers shift even more of their budgets to digital services.\nAlphabet also has impressed investors by reining in its spending.\nGoogle hired a Wall Street veteran, Ruth Porat, as its chief financial officer last May.\nIn addition to reversing a long expansion of Google's operating expenses, Porat also persuaded Alphabet's board to spend $5 billion buying back its own stock.\nThat move signaled a more shareholder-friendly approach to managing the company's cash hoard.\nInvestors also have applauded the creation of Alphabet, which is structured to provide more information about the cost of the company's experimental ventures into self-driving cars, Internet access services, health science and city management.\nAll of those factors have helped lift Alphabet's stock — previously Google's — by 41 percent since the end of 2014.\nIt's a potentially big shift for Apple, which has held bragging rights as the world's most valuable company for most of the past four-and-a-half years. (ExxonMobil seized the high ground for a brief time in 2013.)\n13 months ago. Apple boasted a market value of $643 billion, almost twice Google Inc.'s $361 billion.\nAlphabet would become the 12th company to rise to the most valuable spot, according to Standard & Poor's.\nBGP Financial analyst Colin Gillis believes the potential changing of the guard reflects a wider recognition that Alphabet is fostering a 'culture of innovation' while Apple has lost some of its magic since the October 2011 death of co-founder and former CEO Steve Jobs.\n'I no longer see a sense of urgency at Apple,' Gillis said.\nIf Alphabet doesn't surpass Apple's market value on Friday, it could do so early next week after it releases fourth-quarter earnings on Monday. Investors expect a big quarter after Google's closest competitor in digital ads, Facebook Inc., announced that its revenue soared 52 percent in the period.\nOf course, Apple isn't just rolling over. It's reportedly working on new products such as self-driving cars, virtual reality and Internet TV that could conceivably re-ignite its revenue growth — as could any resurgence in the iPhone itself.\nAlphabet has shown no signs of letting up on Google's grip in Internet search or its expansion into other markets.","url":"https://www.dailymail.co.uk/sciencetech/article-3422323/Google-parent-Alphabet-soon-Apples-market-value.html"}
