{"authors":[],"date_download":"2018-10-30 01:06:50","date_modify":"2018-10-30 01:06:50","date_publish":"2018-08-28 00:02:51","description":null,"filename":"data/vaneerConsumption/GOPDemocratsSwitchRoles20YearsAfterClintonImpeachment.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Bill_Clinton_and_Monica_Lewinsky_on_February_28_1997_A3e06420664168d9466c84c3e31ccc2f.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861610.html","title":"GOP, Democrats Switch Roles 20 Years After Clinton Impeachment","title_page":"GOP, Democrats Switch Roles 20 Years After Clinton ImpeachmentThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nLanny Davis became a TV news staple during President Bill Clinton’s second term as the White House lawyer who battled a Senate investigation into Clinton fundraising practices, with a focus on suspected Chinese attempts to influence the 1996 election.\nDavis left the White House only to rail against independent counsel Kenneth Starr as he homed in on Clinton’s false testimony about his relations with former White House intern Monica Lewinsky.\nTwenty years later, as President Donald Trump is under investigation by special counsel Robert Mueller, Davis is back — but on the side of prosecutors and partisan critics he once derided.\nThen as now, there’s indignation over a special counsel straying from his original mandate, surreptitiously recorded audiotapes of conversations and an old-school regard for men who lie about sex. The arguments are the same, but now Republicans are taking umbrage and Democrats are on the attack.\nHillary Clinton blamed a “vast right-wing conspiracy” for Starr’s pursuit of the Lewinsky story. Trump blames the “deep state” for Mueller’s probe into Russian interference in the 2016 election.\nThe Clinton White House constantly gnawed at Starr’s motives and reputation. On Twitter, Trump accuses Mueller’s team of engaging in a “witch hunt.”\n“It’s going to sound very much like the Clinton investigation all over again,” noted Saikrishna Prakash of the University of Virginia’s Miller Center.\nThis time, Davis is playing offense as the spokesman and attorney for Michael Cohen, Trump’s former personal attorney, who pleaded guilty last Tuesday to felony charges of tax fraud, bank fraud, and campaign finance violations. Those charges have nothing to do with Russian interference in the 2016 election.\nAs Davis tells it, Cohen was so troubled by Trump’s news conference with Russian President Vladimir Putin in Helsinki that he decided to offer up information on his former client. Through Davis, Cohen provided an audiotape of a conversation with Trump that Cohen secretly recorded about paying off two women who say they were Trump’s lovers. Likewise, Lewinsky friend Linda Tripp recorded private conversations that went public.\nDavis rejects the notion that Democrats who bashed Starr are the mirror image of Republicans who deride Mueller.\n“I’ve met Ken Starr and I’ve met Bob Mueller,” Davis told the Las Vegas Review-Journal. “And Ken Starr is no Bob Mueller.”\nDavis compared Mueller to “a silent submarine” that operates underwater and out of public view, while Starr made himself the public face of the Clinton saga and his staff leaked like sieves.\nAs for charges that Mueller has exceeded his mandate, Davis noted that U.S. District Judge T.S. Ellis, a special counsel critic, ruled that the prosecution of former Trump campaign chairman Paul Manafort was in keeping with Department of Justice instructions.\nStarr, on the other hand, won approval to pursue the Lewinsky angle from Clinton Attorney General Janet Reno.\nIf Mueller has learned from Starr’s missteps, Trump may have learned from Clinton. Trump attorney Rudy Giuliani has claimed that Mueller is trying to lay a “perjury trap” to ensnare a president who frequently offers different versions of the same event.\n“The arrogance of Bill Clinton that he could just waltz in and perjure himself,” observed California-based Republican strategist Sean Walsh. “Lesson learned there.”\nTwenty years ago, Democrats were arguing that everyone lies about sex; hence Clinton’s less-than-truthful statements under oath were not worthy of impeachment. Republicans, however, saw his actions as obstruction of justice, one of two successful charges in the House articles of impeachment that passed a floor vote.\nNow Republicans defend Trump’s payments of hush money to a porn actress and a former Playboy playmate as irrelevant, despite Cohen’s guilty plea on two counts of campaign finance violations relating to those transactions.\nFormer Federal Election Commissioner Bradley Smith argued that paying off one’s mistress is not a campaign matter.\nTop Democrats like House Minority Leader Nancy Pelosi have urged other Democrats not to use the word “impeachment” ahead of the November midterm elections, in which they hope to flip more than 24 seats and regain control of the House.\n“The last time they impeached a president, the president’s poll numbers went up,” Prakash observed.\nAfter the GOP House impeached Clinton, his Gallup poll approval rating hit its highest point, 73 percent. Democrats credited the strong economy under Clinton for his high approval.\nThat doesn’t mean the House won’t vote to impeach. Given the Democratic base’s fury at the GOP president, it’s hard to imagine a Democratic House not moving toward impeachment.\nBut conviction is another matter. After the GOP-controlled House voted to impeach Clinton in 1998, the Senate failed to convict and remove the president. Conviction requires a two-thirds vote, and the GOP Senate voted against convicting Clinton 55-45.\nContact Debra J. Saunders at dsaunders@reviewjournal.com or 202-662-7391. Follow @DebraJSaunders on Twitter.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/gop-democrats-switch-roles-20-years-after-clinton-impeachment/"}
