{"authors":["Marita Noon"],"date_download":"2018-10-30 19:18:53","date_modify":"2018-10-30 19:18:53","date_publish":"2015-12-29 18:17:05","description":"Last year, when Republicans gained a decisive edge in both houses of Congress, I made predictions as to the six energy-policy changes we could expect—as the two parties have very different views on energy issues. |","filename":"data/vaneerConsumption/GOPEnergyReportCard2015.json","image_url":"https://media.breitbart.com/media/2015/11/ap_ap-photo197-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_29__1540927133.html","title":"GOP Energy Report Card, 2015","title_page":"GOP Energy Report Card, 2015 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Last year, when Republicans gained a decisive edge in both houses of Congress, I made predictions as to the six energy-policy changes we could expect—as the two parties have very different views on energy issues.\nWe are now halfway through the “two years” in which I expected the changes to take place. Here’s where American energy policy now stands.\nKeystone Pipeline—B grade\nAs predicted, the GOP got right to work backing the Keystone pipeline. With strong bipartisan support, on February 11 Congress passed the bill approving construction. Though many Democrats crossed the aisle and voted with the Republicans, the Keystone XL Pipeline Approval Act fell a handful of votes short of making it veto-proof. As expected, two weeks later, President Obama vetoed the bill.\nI was optimistic that some late-night arm-twisting would bring the needed Democrats on board, but on March 4, the vote to override the veto failed.\nWhile the bill failed, my projection was accurate: understanding the impact the Keystone pipeline would have had on job creation and energy security, Republicans made the Keystone pipeline a high priority.\nOil Exports—A-grade\nThroughout the year, talk of lifting the decades-old oil export ban gained momentum. A bill to lift the ban was introduced in February. On September 17, the House Energy and Commerce Committee voted to send the legislation to the full House for final passage—which took place on October 9.\nAs with Keystone, the bill had bipartisan support, though many Democrats opposed it. Comments made in the House chambers before the vote reflected the partisan divide on energy issues. Opposing the bill, Democrats grandstanded saying it would put more money in the pockets of big oil. In contrast, Republicans understand that successful businesses hire people.\nThe White House threatened a veto.\nDespite passing another committee vote in early October, the Senate didn’t take up the bill. Lifting the ban, however, was included in the omnibus-spending package that Obama quickly signed on December 18.\nWith the ban now officially overturned, the spread between the global benchmark price, known as Brent, and the U.S. benchmark, known as WTI (for West Texas Intermediate), has virtually disappeared. Within a matter of days, the first shipment of U.S. crude will be heading overseas—to Switzerland.\nClimate Change—B Grade\nDays before the U.N. conference on climate change took place in Paris, the Senate held a hearing and passed resolutions designed to let the world know that Obama did not have the support of the U.S. Senate—which would be needed for any legally binding treaty. The New York Times reported: “proponents believe their defiance will have diplomatic repercussions.” In a statement following the vote, Senator James Inhofe (R-OK), Environment and Public Works Committee Chairman, said: “The message could not be more clear that Republicans and Democrats in both the U.S. Senate and U.S. House do not support the president’s climate agenda and the international community should take note.”\nThe plan was successful; the “international community” took note. It is believed that the Republican drumbeat, prompted the European Union to back off of its insistence that any carbon goals in the final agreement need to be legally binding. The agreement that was ultimately reached in Paris is, according to the New York Times, “essentially voluntary.”\nEnvironmental Protection Agency (EPA)—C grade\nIn the December 18 spending bill, the EPA didn’t get a budget increase while many other departments did. It is considered a “loser.” Funding levels for the EPA in 2016 are at a level lower than 2010, but on par with 2015.\nAdditionally, the agency has received several smack downs in 2015 from federal courts—including putting its onerous Waters of the U.S. Rule on hold. Obama’s Clean Power Plan, the focus of the Senate’s resolutions, is facing numerous lawsuits and may also be awarded a stay. This is surely an issue to watch in 2016.\nThe Endangered Species Act (ESA)—D grade\nOne of the big concerns for anyone in the West who earns a living from the land—ranching, farming, mining and mineral extraction—has been the potential listing of the greater sage grouse as an endangered species. While it did not get listed, and the omnibus deal blocks the U.S. Fish & Wildlife Service from putting it on the Endangered Species list, the Bureau of Land Management has enacted land use plans that that will likely have many of the same effects of listing under the Act. It is time for ESA reform.\nFederal Lands—D grade\nThis final issue saw little action in 2015, but with the anti-fossil fuel movement’s aggressive plans to keep resources in the ground, especially on federal lands, this one is ripe for attention from the GOP-controlled Congress.\nFor 2016, Congress will need to stay on top of Obama’s rules, regulations and executive orders aimed at burnishing his legacy on climate change. It should also rein in the EPA, reform the ESA and work to reduce the amount of land owned by the federal government.\nLet’s hope for more positive movement in 2016—including a new resident in the White House, who understands the important role energy plays in making America great.\nThe author of Energy Freedom, Marita Noon serves as the executive director for Energy Makes America Great Inc. and the companion educational organization, the Citizens’ Alliance for Responsible Energy (CARE). She hosts a weekly radio program: America’s Voice for Energy—which expands on the content of her weekly column. Follow her @EnergyRabbit.","url":"https://www.breitbart.com/politics/2015/12/29/gop-energy-report-card-2015/"}
