{"authors":[],"date_download":"2018-10-22 21:47:21","date_modify":"2018-10-22 21:47:21","date_publish":"2014-05-08 13:15:15","description":"Republicans creating a select committee to investigate Benghazi -- again -- is riskier than they might realize.","filename":"data/vaneerConsumption/GOPFocusonBenghaziandIRSCouldBeRiskyBusiness.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/428701/benghazi_attack-jpeg-06ab2_68280cc5b0ec77ba96e867fdb5bf7d00.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_gop-focus-benghazi-irs-could-be-risky-business-n100226_1540244841.html","title":"GOP Focus on Benghazi and IRS Could Be Risky Business","title_page":"GOP Focus on Benghazi and IRS Could Be Risky Business ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThree events that speak volumes\nWe’ve seen -- or will see -- three separate but related events in 24 hours that tell us a lot about the current state of politics in Washington. The first event, per NBC’s Frank Thorp’s reporting, was yesterday’s mostly party-line 231-187 vote to hold former IRS official Lois Lerner in contempt of Congress for refusing to testify in front of Darrell Issa’s House Oversight and Government Reform Committee. The second event is today’s expected vote around 5:00 pm ET to establish a select House committee to investigate the 2012 Benghazi attack, and that’s also expected to pass in a partisan vote. And the third event was the congressional testimony from health-insurance executives about the state of the health-care law. What they said surprised the Republicans in charge of the House Energy and Commerce Committee, the New York Times writes. These executives said the law hadn’t led to a government takeover of their industry; they declined to endorse the GOP predictions that premiums are going to spike next year; and they said about 80% of enrollees on the health-care exchanges have paid their premiums -- higher than a previous GOP report had stated. So why has the political conversation turned back to Benghazi and the IRS? You have to wonder if that testimony on the health-care law provides the pretty clear answer.\nRisky Business\nAs we’ve said before, Republicans creating a select committee to investigate Benghazi -- again -- is riskier than they might realize, especially with our recent NBC/WSJ poll showing that 47% of Americans want to focus LESS on world affairs. It also becomes risky when Republicans start fundraising off the committee. The National Republican Congressional Committee authored a blog post on Tuesday entitled: \"Here's What You Need To Know About Trey Gowdy & The House GOP's Select Committee on Benghazi.\" Then, at the bottom, the blog post allows viewers to enter their names and emails to \"stand with Congressman Gowdy.\" And then there's the line: \"Help fight liberals by donating today.\" This all comes as Gowdy said Wednesday on MSNBC's \"Morning Joe\" that Republicans shouldn't raise money off Benghazi. \"Yes, and I will cite myself as an example,\" he said on the program, per Politico. \"I have never sought to raise a single penny on the backs of four murdered Americans.\" One would assume that the House GOP leadership tries to put an end to this fundraising business once and for all. But it’s been surprising how they haven’t been on top of this -- given how much Democrats are looking to make the “it’s all politics” point.\nDemocrats divided on whether to participate on the Benghazi committee\nBut while this might be risky business for Republicans, Democrats have tied themselves into knots over whether to participate on the Benghazi committee. The Democratic argument AGAINST participating is that it’s a political stunt, and that showing up legitimizes it. The Dem argument FOR participating is that they can’t let the Republicans dominate the hearings, and that they must have a voice to push back against the GOP’s charges. Interestingly, House Minority Leader Nancy Pelosi -- by issuing demands to participate -- has backed Democrats into a corner to accept the “FOR” option if the GOP comes close to meeting those demands. Equally interesting is that Republicans, if they truly want Democratic buy-in, haven’t bent over backwards to at least accommodate some of those demands.\nHarry Reid: Don’t pick on Sheldon Adelson\nPerhaps the most striking exchange in an interview one of us had with Senate Majority Leader Harry Reid was his insistence that there’s a difference between the Koch Brothers and Sheldon Adelson. Talking about the Koch Brothers, whom he routinely criticizes on the Senate floor, Reid said: “Understand these are the two richest people in the world. And they are in it to make money. That's their whole goal here -- to add zeroes to their billions.” But then when the conversation turned to Adelson, who gave Republican groups nearly $100 million in 2012, the Senate majority leader said: “I know Sheldon Adelson. He's not in this for money. He's got money. He's in it because he has certain ideological views. Now, Sheldon Adelson’s social views are in keeping with the Democrats on choice, on all kinds of things. He just got a beef with organized labor a few years ago. And he previously was a Democrat.” Wow. Do remember this about Nevada politics: There is sometimes one-party rule in this state, and that party is run by the folks who own the Vegas casinos.\nReid not 100% ready for Hillary?\nAlso in the interview, Reid said he’s running for re-election in 2016. Yet as far as the Democratic presidential candidate he wants leading the ticket that year, Reid didn’t initially single out Hillary Clinton. “I think that it's pretty clear we have Democrats that are viable. And I think the Republicans, unless they change … they [can’t] elect a president.” When Reid was pressed on Hillary Clinton, he responded, “Everybody knows I love the Clintons. And I don't need to say more.” But then he appeared to endorse a vigorous Democratic presidential primary. “It'd be nice to just have people anointed and run off -- I'm being facetious, you know. “I believe that the primary that was-- with Obama and Clinton was an extremely healthy process. I think it was wonderful.” Folks, you have to watch the video of this exchange. The transcript doesn’t do it justice.\nReid remains confident about Democrats’ chances in November\nIn addition, Reid expressed confidence about the Democratic chances to retain control of the Senate in November. “In spite of the huge amount of money the Koch Brothers have spent starting last October, we're competitive virtually everywhere,” he said. “We're doing just fine. Now I understand the last six months, and that's what it is now, is gonna be difficult.” But he added, “We've been able to stay way above the water level.” One other thing about the interview with Reid: He said Democrats would be willing to negotiate to get a $10.10 minimum wage, but wouldn’t negotiate on moving it down from $10.10.\nGrimes up with her first TV ad\nFinally, Alison Grimes (D) is up with her first TV ad in Kentucky’s Senate race, and it’s about her bipartisan work in Kentucky to ensure that every military vote is counted in races. The campaign says it’s a significant, six-figure buy. And this just in: The RGA is up with its first TV ad for Ohio Gov. John Kasich.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/gop-focus-benghazi-irs-could-be-risky-business-n100226"}
