{"authors":[],"date_download":"2018-10-30 14:30:41","date_modify":"2018-10-30 14:30:41","date_publish":"2015-08-25 00:00:00","description":null,"filename":"data/vaneerConsumption/GOPfirststrikeonTrumpisaboutimmigrationnotthirdpartybids.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_gop_first_strike_on_trump_is_about_immigration_not_thirdparty_bids_1540909841.html","title":"GOP first strike on Trump is about immigration, not third-party bids","title_page":"GOP first strike on Trump is about immigration, not third-party bids","title_rss":"NULL","source_domain":"americanthinker.com","text":"Amid mounting concerns about Donald Trump’s candidacy from the GOP establishment, Republican leaders in at least two states have found a way to make life a lot harder for him.\nThe GOP bureaucracy has launched its first attack on Donald Trump. The state parties of Virginia and North Carolina are considering requiring candidates who want to be on the presidential primary ballots to pledge that they will support the GOP nominee:\nThe Virginia and North Carolina parties are in discussions about implementing a new requirement for candidates to qualify for their primary ballots: that they pledge to support the Republican presidential nominee – and not run as a third-party candidate – in the general election. The procedural moves are clearly aimed at Trump, who pointedly refused to rule out a third-party run during the first GOP debate.\nIt seems reasonable, doesn't it? After all, if you run in a Republican primary, shouldn't you expect to be supporting the Republican nominee? But wait.\nThey come amid Republican fears that the real estate mogul is gaining strength in the primary contest, and that his jeremiads against undocumented immigrants will alienate Hispanic voters. Despite coming under a hail of criticism in recent weeks, Trump has held steady atop state and national polls.\nNow we come to the real motivation. The slimeballs at Politico have to stick their own knives in, calling Trump's legitimate complaints about illegal aliens \"jeremiads,\" which means \"long, mournful complaint or lamentation; a list of woes.\"\nOh, what a complainer that Donald Trump is! What a whiner he is about illegal immigration! Do you see how the writers at Politico sneer at voters who care about citizenship and protecting the integrity of the nation?\nThe issue of immigration is what it is really about. The GOP feels threatened that Trump is pulling it to the right on immigration, and this is its first attempt to put a roadblock in his way.\nUnfortunately, as an attorney, I can tell you that Trump may have little legal recourse. As long as state parties don't discriminate against someone based on race, religion, age, or veteran's status (or, coming soon, men who dress as women), there is little Trump can do legally. But politically he can say that the Republicans are trying to lock him out and are actually pushing him into a third-party bid by their actions. His popularity may force them to abandon these plans.\nHere's what I find curious, though: technically, as I've said, state parties can require nominees to agree to any pledge. But they very rarely do. If state parties were going to do this, why not require nominees to pledge to end birthright citizenship? Why not require them to pledge to build a physical wall at the border, or to vote to limit the Supreme Court's jurisdiction to decide immigration matters?\nIn practice, state parties never require any kind of pledges. This pledge is aimed at one thing: stopping Donald Trump, and stopping the move toward expelling illegal aliens and controlling our borders.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/08/gop_first_strike_on_trump_is_about_immigration_not_thirdparty_bids.html"}
