{"authors":["Associated Press"],"date_download":"2018-10-22 23:42:46","date_modify":"2018-10-22 23:42:46","date_publish":"2017-03-16 07:49:41","description":"WASHINGTON (AP) - The House Republican health care plan backed by President Donald Trump provides billions of dollars in tax cuts for wealthy families and...","filename":"data/vaneerConsumption/GOPhealthplanTaxcutsforrichhitsolderpeoplehard.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-228839-1489673714-251_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319144_GOP-health-plan-Tax-cuts-rich-hits-older-people-hard_1540251766.html","title":"GOP health plan: Tax cuts for rich; hits older people hard","title_page":"GOP health plan: Tax cuts for rich; hits older people hard | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - The House Republican health care plan backed by President Donald Trump provides billions of dollars in tax cuts for wealthy families and insurance companies, but it hits older Americans hard with higher insurance premiums and smaller tax credits.\nIn all, the bill provides $883 billion in tax relief by repealing almost all of the taxes enacted under President Barack Obama's Affordable Care Act, according to estimates by the nonpartisan Joint Committee on Taxation, the official tax scorekeeper for Congress.\nThe vast majority of those taxes targeted the wealthy.\nHouse Speaker Paul Ryan of Wis. speaks at a news conference following a GOP party conference at the Capitol, Wednesday, March 15, 2017, in Washington. (AP Photo/Andrew Harnik)\nFor example, the biggest tax cut in the GOP plan would eliminate a 3.8 percent tax on investment income for high-income individuals and families. Eliminating the tax would save these taxpayers $158 billion over the next decade.\nAbout 90 percent of the benefit from repealing the tax would go to the top 1 percent of earners, who make $700,000 or more, according to the nonpartisan Tax Policy Center.\nAnother big tax cut would repeal an extra 0.9 percent Medicare tax on wages above $200,000 for individuals and $250,000 for married couples. Repealing the tax would save higher income families $117 billion over the next decade.\nThe bill also repeals a tax on health insurers, saving them $145 billion over the next decade.\nRepublicans are eager to highlight the tax cuts as a campaign promise kept.\n\"Our fiscally responsible reforms will lower premiums over the long term and deliver much-need relief from Obamacare's crushing taxes and mandates,\" said Rep. Kevin Brady, R-Texas, chairman of the tax-writing House Ways and Means Committee.\nHouse Speaker Paul Ryan, R-Wis., said, the legislation \"will provide massive tax relief, dramatically reduce the deficit, and make the most fundamental entitlement reform in more than a generation.\"\nTwo House committees have already passed their sections of the bill. The House Budget Committee is taking up the bill Thursday.\nGOP leaders have said they plan to have the full House vote on the bill next week, but House Speaker Paul Ryan, R-Wis., wouldn't commit to the timetable when asked about it Wednesday evening.\nDemocrats complain that the bill robs from the poor to give to the rich.\n\"They have no idea how to explain stealing $600 billion from working families' health care to give more tax breaks to the richest people in our country,\" said House Minority Leader Nancy Pelosi, D-Calif.\nSen. Ron Wyden, D-Ore., called the bill \"a payday worth hundreds of billions of dollars for the wealthiest and special interests.\"\nOlder people who are not yet eligible for Medicare stand to be the biggest losers under the GOP plan - unless they have higher incomes.\nOlder Americans get hit two ways. The GOP plan would shrink the tax credits they use to help buy insurance and it would increase their premiums because the bill allows insurers to charge more as people age and become more susceptible to health problems.\nWealthier households would benefit under the GOP plan in part because the tax credits are available to people with higher incomes. Under the GOP plan, full credits are available to individuals making as much as much as $75,000 and married couples making as much as $150,000.\nThe Obama law aimed to help low- to moderate-income families.\nThe Congressional Budget Office laid out several examples of how people at different ages and incomes would benefit from the GOP plan and current law. The estimates are for 2026, after the bill would be fully phased in.\n___\nA 40-year-old making $26,500\nCURRENT LAW\n-Annual premium: $6,500.\n-Tax credit: $4,800.\n-Cost to the individual: $1,700.\n___\nGOP PLAN\n-Annual premium: $6,050.\n-Tax credit: $3,650.\n-Cost to the individual: $2,400.\n___\nA 64-year-old making $26,500\nCURRENT LAW\n-Premium: $15,300.\n-Tax credit: $13,600.\n-Cost to the individual: $1,700.\n___\nGOP PLAN\n-Premium: $19,500.\n-Tax credit: $4,900.\n-Cost to individual: $14,600.\n___\nA 40-year-old making $68,200\nCURRENT LAW\n-Premium: $6,500\n-Tax credit: 0.\n-Cost to the individual: $6,500.\n___\nGOP PLAN\n-Premium: $6,050.\n-Tax credit: $3,650.\n-Cost to the individual: $2,400.\n___\nA 64-year-old making $68,200.\nCURRENT LAW\n-Premium: $15,300.\n-Tax credit: 0.\n-Cost to the individual: $15,300.\n___\nGOP PLAN\n-Premium: $19,500.\n-Tax credit: $4,900.\n-Cost to the individual: $14,600.\n___\nFollow Stephen Ohlemacher on Twitter at: http://twitter.com/stephenatap","url":"https://www.dailymail.co.uk/wires/ap/article-4319144/GOP-health-plan-Tax-cuts-rich-hits-older-people-hard.html"}
