{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:55:38","date_modify":"2018-10-30 20:55:38","date_publish":"2016-09-01 07:42:18","description":"A House leader promised Republicans controlling the chamber will pass legislation addressing Obama's $400 million Iran payment.","filename":"data/vaneerConsumption/GOPLeadersPromiseLegislationon400MPaymenttoIran.json","image_url":"https://media.breitbart.com/media/2015/10/kevin-mccarthy-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_01__1540932938.html","title":"GOP Leaders Promise Legislation on $400M Payment to Iran","title_page":"GOP Leaders Promise Legislation on $400M Payment to Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — A House leader promised Wednesday that Republicans controlling the chamber will pass legislation addressing the Obama administration’s $400 million payment to Iran in January, made immediately after four US prisoners were released.\nMajority Leader Kevin McCarthy (pictured) also promised in a memo that the House will revisit a stalled $1.1 billion measure to combat the Zika virus and enact stopgap spending legislation to prevent a government shutdown in October.\nThe California Republican did not give details on the Iran legislation. Republicans have announced they will hold hearings on the payment — for undelivered arms to the shah of Iran — which was made on the same day of the prisoner release.\n“The committee is working on legislation that would prevent another ransom payment from happening,” said House Foreign Affairs Committee Chairman Ed Royce, R-California, in a statement. “No more hidden cash payments to this state sponsor of terrorism.”\nThe administration says it was simply maintaining leverage and says GOP charges of “ransom” are unfounded. The cash payment, which includes $1.3 billion in interest, came as part of the loosening of relations in the wake of last year’s pact aimed at keeping Iran from manufacturing nuclear weapons. The administration says the release of prisoners was negotiated on a separate track, but that the delivery of the money was withheld until the prisoners were set free.\nCongress returns next week for an abbreviated session before lawmakers return home for the fall campaign.\nThe stopgap funding measure is the only must-do legislation. Such measures used to be routine, but a battle over Zika funding and divisions among House Republicans over the duration of the measure could make the funding bill more challenging to process.\nIn June, Republicans agreed among themselves on a $1.1 billion measure to fight the Zika virus, which is linked to grave birth defects and has begun spreading through mosquito bites in sections of Miami. Democrats have blocked the measure, largely over a provision aimed at preventing Planned Parenthood’s Puerto Rico affiliate from receiving grants to fight the virus there.","url":"https://www.breitbart.com/middle-east/2016/09/01/gop-leaders-promise-legislation-400m-payment-iran/"}
