{"authors":[],"date_download":"2018-10-22 22:52:43","date_modify":"2018-10-22 22:52:43","date_publish":"2014-06-11 00:04:45","description":"In a stunning upset, Rep. Eric Cantor, the second-highest ranking Republican in the House, lost his primary challenge to a tea party-backed candidate.","filename":"data/vaneerConsumption/GOPLeaderEricCantorFallstoTeaPartyChallenger.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/501276/140611-eric-cantor-house-250a_198ab75fc91dec4d80db711f2dd0de5e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_gop-leader-eric-cantor-falls-tea-party-challenger-n127946_1540248763.html","title":"GOP Leader Eric Cantor Falls to Tea Party Challenger","title_page":"GOP Leader Eric Cantor Falls to Tea Party Challenger","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn a stunning upset, Virginia Rep. Eric Cantor, the second-highest ranking Republican in the House, lost his primary challenge to a tea party-backed candidate Tuesday, according to the Associated Press.\nEconomics professor Dave Brat defeated Cantor to become the GOP nominee for Virginia’s 7th congressional district.\nCantor, who serves as the House majority leader, heavily outspent Brat and was widely expected to survive the challenge from the right.\nSign up for breaking news alerts from NBC News\nBrat painted the seven-term congressman as a Washington insider who has become too liberal to represent the Richmond-area district. He accused Cantor of supporting immigration reform that would give “amnesty” to those living in the United State illegally.\nCantor became the highest-ranking member of the House to be defeated since then-Speaker Thomas Foley lost his re-election contest in 1994.\nIn brief remarks to supporters Tuesday night, Cantor said serving Congress \"has been one of the highest honors of my life.\"\n\"I know there’s a lot of long faces here tonight, and it’s disappointing, sure,\" Cantor said. \"But I believe in this country, I believe there’s an opportunity around the next corner for all us.\"\nBrat’s victory illustrates the enduring power of conservative activists who think Republicans in Washington are ineffective and are determined to unseat them.\nBrat’s attacks on Cantor for his past remarks that the GOP needed to reach a deal with President Obama on the issue, will likely stall any chance of a broader immigration bill passing in Congress, as other Republicans will worry about being defeated in primaries like Cantor.\nAnd Cantor’s loss will start jockeying in the House of Representatives among members who want to replace him in the party’s leadership and position themselves to become Speaker if John Boehner retires.","url":"https://www.nbcnews.com/politics/elections/gop-leader-eric-cantor-falls-tea-party-challenger-n127946"}
