{"authors":["Caroline May"],"date_download":"2018-10-30 22:15:18","date_modify":"2018-10-30 22:15:18","date_publish":"2015-10-07 14:29:25","description":"Sanctuary jurisdictions have been under fire in the months following Steinle’s murder.","filename":"data/vaneerConsumption/GOPLeadersHighlightBrutalIllegalAlienCriminalsShieldedbySanctuaryPolicies.json","image_url":"https://media.breitbart.com/media/2015/07/kathryn-steinle.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_07__1540937718.html","title":"GOP Leaders Highlight Brutal Illegal Alien Criminals Shielded by Sanctuary Policies","title_page":"GOP Leaders Highlight Brutal Illegal Alien Criminals Shielded by Sanctuary Policies | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the nearly 100 days since Kathryn Steinle was gunned down, allegedly by an illegal immigrant, other criminal immigrants released by sanctuary jurisdictions have gone on to commit murder, rape, and child abuse, two Republican leaders say.\nSenate Judiciary Committee Chairman Chuck Grassley (R-IA) and House Judiciary Committee Chairman Bob Goodlatte (R-VA) argue that while DHS Sec. Jeh Johnson has said it is “not acceptable to have no policy of cooperation with immigration enforcement” the Obama administration has failed to take substantive action compelling such sanctuary jurisdictions to comply with federal immigration authorities.\nSanctuary jurisdictions have been under fire in the months following Steinle’s murder. The alleged triggerman in the Steinle case — an illegal immigrant with multiple felony convictions, who had been deported from the U.S. at least five times — was back on the streets largely due to San Francisco’s sanctuary policy of ignoring immigration detainers.\nAccording to Grassley and Goodlatte, if last year’s averages are a guide, it is likely that 3,000 more federal immigration detainers have been ignored since Steinle’s murder.\nIn a letter to Johnson this week, the pair call on DHS to take more action on the issue, provide an update to the progress the agency has made on detainer compliance, and reconsider the new Priority Enforcement Program, which they say allows more criminal immigrants to remain on the streets.\n“It is time to make it clear to sanctuary jurisdictions that people in the country illegally do not deserve safe harbor. For every day that passes, the potential for another tragedy only increases,” they write.\nIn highlighting the dangers of sanctuary policies, Grassley and Goodlatte recall three horrific crimes that have taken place since Steinle’s murder:\nOn July 24, 2015, Marilyn Pharis was brutally raped, tortured, and murdered in her home in Santa Maria, California, by an illegal immigrant who was released from custody because the county sheriff does not honor detainers. On July 27, 2015, an illegal immigrant was arrested and accused of killing 60-year-old Margaret Kostelnik in Ravenna Road, Ohio. Before murdering Ms. Kostelnik, the man allegedly attempted to rape a 14-year-old girl and shoot a woman in a nearby park. The suspect was also previously in the custody of law enforcement but released because your Department refused to issue a detainer and take custody of the suspect. On July 30, a two-year old girl was brutally beaten by an illegal immigrant in San Luis Obisbo County, California. He was released from local custody despite a U.S. Immigration and Customs Enforcement (ICE) detainer and extensive criminal history.\n“These are just a few examples that highlight the need for changes to sanctuary policies,” they write, noting that Francisco Javier Chavez, the alleged perpetrator in the beating of the aforementioned two-year old, remains at large.\nIn addition to requesting details about the agency’s progress on sanctuary jurisdictions the Goodlatte and Grassley also are seeing more information about Chavez.","url":"https://www.breitbart.com/politics/2015/10/07/gop-leaders-highlight-brutal-illegal-alien-criminals-shielded-sanctuary-policies/"}
