{"authors":[],"date_download":"2018-10-22 20:34:38","date_modify":"2018-10-22 20:34:38","date_publish":"2014-06-02 02:58:52","description":"By the time Sgt. Bowe Bergdahl landed in Germany, Republican lawmakers in Washington were excoriating the deal that secured his freedom.","filename":"data/vaneerConsumption/GOPLawmakersBlastDealThatFreedBoweBergdahlfromTaliban.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_29/480706/140602-bowe-bergdahl-5a_e20985afeeb9871b9348fa6c867e3fee.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_gop-lawmakers-blast-deal-freed-bowe-bergdahl-taliban-n119991_1540240478.html","title":"GOP Lawmakers Blast Deal That Freed Bowe Bergdahl from Taliban","title_page":"GOP Lawmakers Blast Deal That Freed Bowe Bergdahl from Taliban","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt couldn't have been a more emotional day for Sgt. Bowe Bergdahl, the prisoner of war held captive for five years by the Taliban. After being retrieved early Saturday evening and placed safely on a helicopter, a dazed Bergdahl scrawled “SF” on a paper plate — a coded question about whether he was being rescued by U.S. Special Forces.\nWhen a soldier said yes, Bergdahl, 28, wept.\nYet by the time Bergdahl landed in Germany on Sunday morning, where he was to receive medical attention, Republican lawmakers in Washington were excoriating the deal that secured his freedom — a deal that released five senior Taliban detainees from Guantanamo Bay and prompted a rare statement from the reclusive Taliban leader Mullah Omar, who described the men as “important commanders of jihad” and declared the swap a “great victory.”\nSen. John McCain of Arizona described the detainees as the “hardened” terrorists, the kind of militants who, upon release, are likely to return to the fight.\nThey “have the blood of Americans and countless Afghans on their hands,” he said in a statement.\nThat assertion was backed up by secret Pentagon documents obtained by WikiLeaks, which describe the five as “high risk” and a “likely threat to the U.S.”\nThe documents recommended “continued detention.”\nUnder the terms of the deal, the detainees will remain under the control of the government of Qatar for one year. Leaders there helped negotiate the swap, which earned the praise of Mullah Omar, who thanked them for their “tireless efforts.”\nTo Sen. Ted Cruz of Texas, the deal represented a grim precedent, a policy shift that could place soldiers still in the field in grave danger.\n\"Have we just put a price on other U.S. soldiers?\" Cruz told ABC. \"What does this tell terrorists, that if you capture a U.S. soldier, you can trade that soldier for five terrorists?\"\nSenior House Republican Mike Rogers echoed Cruz. \"I have little confidence in the security assurances regarding the movement and activities of the now released Taliban leaders and I have even less confidence in this Administration's willingness to ensure they are enforced,\" Rogers said in a statement.\nOther lawmakers charged that the Obama Administration broke the law when it did not provide the 30-day notice to Congress required when releasing detainees.\nIn an interview with Luke Russert on MSNBC's \"Daily Rundown\" on Monday, House Armed Services Committee Chairman Rep. Buck McKeon, R-Calif., said that he plans to hold hearings on the circumstances surrounding the deal.\n\"We will be holding hearings. I'm sorry that this is being portrayed as a Republican issue, I think Democrats also voted for this law, it was important for our national security, it's important for our responsibility of oversight of the administration and our national security.\n\"This is not a partisan issue, it's just a matter of the law and breaking the law, and not informing the Congress according to the law,\" McKeon said.\nSenior Obama Administration officials defended the deal.\n\"We didn't negotiate with terrorists,” Secretary of Defense Chuck Hagel told “Meet the Press.” “Sgt. Bergdahl is a prisoner of war, that’s a normal process in getting your prisoners back.”\nHagel also said the soldier’s health was “deteriorating.”\n“This was essentially an operation to save the life of Sgt. Bergdahl,” Hagel said.\nHagel added that he would \"stand by\" the decision. \"We found an opportunity,\" he said. \"We took that opportunity.\"\nThe polarized politics of Bergdahl’s release seemed to have little effect on his hometown in Idaho, which was preparing for his return, or his parents, Bob and Jani, who have remained persistent advocates for their son’s release.\nWhen the Bergdahls held a news conference Sunday afternoon, they had not yet spoken to Bowe. An emotional Jani read a letter to her son, saying, \"I love you Bowe, I'm so very proud of you, and of course all of your very large family would like me to tell you that they love you also.”\nShe added, “\"Freedom is yours, I will see you soon my beloved son, I love you Bowe.\"","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/gop-lawmakers-blast-deal-freed-bowe-bergdahl-taliban-n119991"}
