{"authors":[],"date_download":"2018-10-22 22:26:42","date_modify":"2018-10-22 22:26:42","date_publish":"2014-06-09 23:41:07","description":"A meeting between Obama administration officials and members of the House on Monday did little to tamper Republican criticisms of prisoner swap.","filename":"data/vaneerConsumption/GOPMoreCriticalofWhiteHouseAfterBergdahlBriefing.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/486076/140604-bergdahl-cover-645a_d1b0da41ae47c6b99f77b1f5fe061f90.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_gop-more-critical-white-house-after-bergdahl-briefing-n126881_1540247202.html","title":"GOP More Critical of White House After Bergdahl Briefing","title_page":"GOP More Critical of White House After Bergdahl Briefing","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA meeting between Obama administration officials and members of the House on Monday did little to temper Republican criticisms over why Congress was not informed ahead of the prisoner exchange that led to Army Sgt. Bowe Bergdahl's release.\nRepublicans in the House said White House officials informed them that as many as many as 90 members of the administration knew of the deal before it happened, yet no members of Congress were informed.\n\"I'm concerned with the administration telling about 80 or 90 people within the administration and not one member of Congress about this,\" said Republican Rep. Buck McKeon, chair of the Armed Services Committee. \"That to me is not following the law, it's not good practice.\"\nTony Blinken, a deputy national security adviser, and ambassador James Dobbins were among the administration officials who briefed members.\nDemocrats and Republicans alike have said the Bergdahl deal, which resulted in the release of five Taliban detainees, blindsided them. Democratic Sen. Dianne Feinstein last week said the White House apologized to her and other senators for not informing them in advance.\nHouse members leaving the closed door briefing said it was not clear who in the administration knew.\nMcKeon added that Congress will investigate the circumstances that led to Bergdahl's release, beginning Wednesday when Secretary of Defense Chuck Hagel appears before a House committee. The issue has quickly become the latest partisan fight on Capitol Hill.\nRep. Jan Schakowsky, D-Ill., said she has been \"disgusted\" by the debate surrounding Bergdahl's release.\n\"There is a demonization of this administration for doing what is in the tradition and the Constitution, of the United States of America,\" she said after the briefing.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/gop-more-critical-white-house-after-bergdahl-briefing-n126881"}
