{"authors":["The Associated Press"],"date_download":"2018-10-30 18:45:38","date_modify":"2018-10-30 18:45:38","date_publish":"2015-06-27 03:31:00","description":"DENVER — Republican presidential candidate Mike Huckabee told conservatives Saturday that the Supreme Court tried to \"unwrite the laws of nature and the laws of nature's God\" when it legalized gay marriage across the nation.","filename":"data/vaneerConsumption/GOPpresidentialhopefulsderidegaymarriageruling.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_jun_27_gop-presid_ca1319d7ede9b83e63ef9b376f3fb2ad__page=1_1540925138.html","title":"GOP presidential hopefuls deride gay marriage ruling","title_page":"GOP presidential hopefuls deride gay marriage ruling ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"DENVER — Republican presidential candidate Mike Huckabee told conservatives Saturday that the Supreme Court tried to \"unwrite the laws of nature and the laws of nature's God\" when it legalized gay marriage across the nation.\nThe former Arkansas governor suggested that people in the United States flout the ruling, as President Abraham Lincoln did in the wake of the justices' 1857 decision that blacks could not be citizens. Huckabee also pointed out that President Barack Obama opposed gay marriage until 2012.\n\"He was either lying in 2008, or he's lying now, or God has rewritten the Bible and only Barack Obama has gotten the new edition,\" Huckabee told the crowd at the Western Conservative Summit.\nHuckabee was among the GOP presidential hopefuls at the gathering, which followed a week in which the high court also upheld Obama's signature health care law. The Republicans offered few suggestions on what to do about the gay marriage ruling, highlighting the party's challenges on social issues ahead of the 2016 elections.\nJoining Huckabee at the conference was Republican hopefl Carly Fiorina, who said she supports civil unions. She said opponents of the ruling should now focus efforts on religious freedom in public accommodations, such as cases of bakers facing penalties for refusing to serve gay couples.\nFormer Texas Gov. Rick Perry derided the ruling but didn't suggest a next step.\n\"These decisions need to be made in the states,\" said Perry, who noted that his states' rights plank extends even to Colorado legalizing recreational marijuana in defiance of federal drug law.\n\"I defend the right of Colorado to be wrong on that issue,\" Perry said. The crowd chuckled.\nScheduled to conclude the gathering Saturday was Wisconsin Gov. Scott Walker, who has called for a constitutional amendment to undo the marriage ruling.\nOn Friday, former Pennsylvania Sen. Rick Santorum said the gay marriage ruling was \"based on a lie\" that gay-marriage opponents are motivated by discrimination.\n\"We have a Supreme Court that says the only reason that you could possibly oppose changing marriage laws in America is because you hate people who want to marry people of the same sex. That is not true,\" Santorum said.","url":"https://www.arkansasonline.com/news/2015/jun/27/gop-presidential-hopefuls-deride-gay-marriage-ruli/?page=1"}
