{"authors":["Pam Key"],"date_download":"2018-10-30 21:29:23","date_modify":"2018-10-30 21:29:23","date_publish":"2016-12-13 22:22:15","description":"Tuesday on AM 970's the \"The Joe Piscopo Show,\" while discussing President-elect Donald Trump saying intelligence briefings are too repetitive and | Video","filename":"data/vaneerConsumption/GOPRepPeterKingTrumpNegotiatingByTakingtheFirstShotatCIA.json","image_url":"https://media.breitbart.com/media/2016/12/king.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_12_13__1540934963.html","title":"GOP Rep Peter King: Trump Negotiating By 'Taking the First Shot' at CIA","title_page":"GOP Rep Peter King: Trump Negotiating By 'Taking the First Shot' at CIA | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on AM 970’s the “The Joe Piscopo Show,” while discussing President-elect Donald Trump saying intelligence briefings are too repetitive and questioning the CIA assessments of Russian hacking, Rep. Peter King (R-NY) said, “I think he is taking the first shot to let them know he is not going to just be led around by them and they better give him good stuff to work with.”\nKing said, “I understand in a way what he is doing. There can be an arrogance in the intelligence community of the CIA. And you have acutely had in the past — including under President Bush with Iraq and people in the CIA actually working against him, putting out misleading reports and certain elements. So I think its good he’s sending out a signal. I wouldn’t carry on a feud because you do need these people to an extent. They need you more then you need them.”\n“And I think it’s important he sends a signal he’s not going to be beholden to them,” he continued. “I think again — you know Donald Trump better than I do — I’ve gotten to know him through the campaign. But everything with him is a negotiation. Everything with him is taking the first shot and then negotiating from there. I think he is taking the first shot to let them know he is not going to just be led around by them and they better give him good stuff to work with.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2016/12/13/gop-rep-peter-king-trump-negotiating-by-taking-the-first-shot-at-cia/"}
