{"authors":["Ian Hanchett"],"date_download":"2018-10-30 19:17:48","date_modify":"2018-10-30 19:17:48","date_publish":"2017-03-06 17:42:39","description":"On Monday's broadcast of the Fox News Channel's \"Fox & Friends,\" House Oversight & Government Reform Committee Chairman Representative Jason | Video","filename":"data/vaneerConsumption/GOPRepChaffetzWereGoingtoLookHardAtTrumpWiretappingClaimsThisStuffDoesHappen.json","image_url":"https://media.breitbart.com/media/2017/03/Chaffetz-36-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_03_06__1540927068.html","title":"GOP Rep Chaffetz: 'We're Going to Look Hard At' Trump Wiretapping Claims, 'This Stuff Does Happen'","title_page":"GOP Rep Chaffetz: 'We're Going to Look Hard At' Trump Wiretapping Claims, 'This Stuff Does Happen' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday’s broadcast of the Fox News Channel’s “Fox & Friends,” House Oversight & Government Reform Committee Chairman Representative Jason Chaffetz (R-UT) stated that the House is “going to look hard at” President Trump’s wiretapping claims and cited James Rosen, the IRS, and the targeting Chaffetz faced by the Secret Service as evidence that “this stuff does happen, and it’s not necessarily done the legal, lawful way.”\nChaffetz said, “[W]e’re going to look hard at this. Devin Nunes (R-CA), and the House Intelligence Committee will take the lead on this. We’ll play a role [as] the Oversight Committee, but I’m going to go into it eyes wide open. We’ve had experience. The Obama administration’s been notorious on this type of stuff. And we’re going to look hard at it.”\nHe added, “[L]et’s remember what they did with James Rosen. Let’s remember that the IRS did target Americans based on their political beliefs. You know, my own personal case, I had more than 40 Secret Service agents illegally tap into my records and dive into my background, and that’s according to the inspector general. So, this stuff does happen, and it’s not necessarily done the legal, lawful way. And so, yeah, we’re going to take a look at it.”\nChaffetz further stated that a paper trail of any wiretapping should be “fairly evident.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2017/03/06/gop-rep-chaffetz-were-going-to-look-hard-at-trump-wiretapping-claims-this-stuff-does-happen/"}
