{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:53:32","date_modify":"2018-10-30 19:53:32","date_publish":"2016-02-18 18:28:14","description":"Representative Randy Weber (R-TX) has introduced legislation allowing concealed carry in schools where teachers and staff have been forced to sit |","filename":"data/vaneerConsumption/GOPRepIntroducesBillOpeningGunFreeSchoolsForConcealedCarry.json","image_url":"https://media.breitbart.com/media/2015/02/gun-free-zone-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_18__1540929212.html","title":"GOP Rep Introduces Bill Opening 'Gun-Free' Schools For Concealed Carry","title_page":"GOP Rep Introduces Bill Opening 'Gun-Free' Schools For Concealed Carry | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Representative Randy Weber (R-TX) has introduced legislation allowing concealed carry in schools where teachers and staff have been forced to sit defenseless in gun-free zones heretofore.\nAccording to The Hill, Weber’s bill would change the status quo so individuals who are “not prohibited from carrying a concealed gun, along with qualified law enforcement officers, could possess concealed firearms in what have traditionally been gun-free school zones.”\nTo date, gun-free school zones have only been gun free for law-abiding citizens. For example, the gun-free policies at Columbine High School were ignored by Eric Harris and Dylan Klebold, who shot and killed 13 defenseless persons on April 20, 1999. Similar gun-free policies were ignored by Adam Lanza–who killed 20 children and six unarmed faculty and staff at Sandy Hook Elementary on December 14, 2012–and by Karl Halverson Pierson, who killed one before taking his own life at Arapahoe High School on December 13, 2013.\nWeber introduced his legislation to empower teachers and staff to defend themselves and their students should such an attack occur again. He said, “It is time for Congress to act in a way that will keep our children safe, and I believe that my legislation will help us do just that.”\nAllowing teachers and staff to arm themselves for self-defense has been a popular push among the candidates vying for the Republican presidential nomination. Donald Trump, Ted Cruz, and Ben Carson have all voiced strong support for allowing teachers to be armed for self-defense.\nIn September Breitbart News reported Trump describing concealed carry as “a right, not a privilege” and Carson has said repeatedly that students and teachers should not just have to stand there while someone shoots at them.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/02/18/gop-rep-introduces-bill-for-national-concealed-carry-in-schools/"}
