{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:32:25","date_modify":"2018-10-30 18:32:25","date_publish":"2018-08-17 13:42:23","description":"On Friday's broadcast of CNN's \"New Day,\" Representative Scott Taylor (R-VA) stated that while former CIA Director John Brennan's behavior has \"skirted | Video","filename":"data/vaneerConsumption/GOPRepTaylorBrennanSkirtedtheLineTakingAwayHisClearanceBadPrecedent.json","image_url":"https://media.breitbart.com/media/2018/08/Taylor-817-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_08_17__1540924345.html","title":"GOP Rep Taylor: Brennan 'Skirted the Line,' Taking Away His Clearance 'Bad Precedent'","title_page":"GOP Rep Taylor: Brennan 'Skirted the Line,' Taking Away His Clearance 'Bad Precedent' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Friday’s broadcast of CNN’s “New Day,” Representative Scott Taylor (R-VA) stated that while former CIA Director John Brennan’s behavior has “skirted the line,” removing his security clearance is “a bad precedent.”\nTaylor said, “I think that, more to what Senator Burr (R-NC) said, with Brennan, if you knew something while you were in, you should have given it to the special counsel. If you knew something afterwards, you should have given it to the special counsel, as opposed to the New York Times or other areas, Twitter, whatever. So, I think that he has skirted the line, if you will. At the same time, I think that while the president has the ability to obviously — and the control and the authority to revoke clearances. I think this was a bad precedent, I really do. I think that, you know, it doesn’t silence critics. It amplifies their voices, if you will. And so, I do think that, again, while he has the ability to do so, I’m concerned about doing it. Because I — while we might not like Brennan, and we might not like what he’s saying, that doesn’t mean that you should be able to take his clearance away. I mean, you can, he has the ability to do so, but I think it’s a bad precedent.”\nTaylor added that the move obviously sends the message to people with security clearances that they shouldn’t speak their mind.\n(h/t Mediaite)\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2018/08/17/gop-rep-taylor-brennan-skirted-the-line-taking-away-his-clearance-bad-precedent/"}
