{"authors":["Associated Press"],"date_download":"2018-10-22 21:37:23","date_modify":"2018-10-22 21:37:23","date_publish":"2016-01-29 07:20:35","description":"DES MOINES, Iowa (AP) — Absent Donald Trump, the Republican presidential candidates strained to take advantage of a rare opportunity to step out of the front...","filename":"data/vaneerConsumption/GOPrivalsmockTrumptrytomakethemostofhisabsence.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:8ff258ba0a504b5788f53ba68e6c94c5-4PuZeKVXE7cd9005b2c87664e891-254_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420513_Trump-looks-grab-attention-GOP-rivals-debate_1540244243.html","title":"GOP rivals mock Trump, try to make the most of his absence","title_page":"GOP rivals mock Trump, try to make the most of his absence | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GOP rivals mock Trump, try to make the most of his absence\nDES MOINES, Iowa (AP) — Absent Donald Trump, the Republican presidential candidates strained to take advantage of a rare opportunity to step out of the front-runner's shadow in Thursday night's debate — a staid, policy-heavy contest that offered a glimpse of what the GOP contest might have been without the unpredictable businessman.\nStill, the candidates couldn't resist mocking Trump, who boycotted the final debate before Iowa kicks off voting in the 2016 campaign on Monday.\n\"I'm a maniac and everyone on this stage is stupid, fat and ugly,\" said Texas Sen. Ted Cruz, who is competing with Trump for the lead in Iowa. Cruz then thanked his fellow candidates for showing Iowa voters respect by showing up.\nRepublican presidential candidate Sen. Ted Cruz, R-Texas, answers a question as Sen. Marco Rubio, R-Fla., looks on during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nFormer Florida Gov. Jeb Bush, a frequent target of Trump, said with a wry smile, \"I kind of miss Donald Trump; he was a teddy bear to me.\"\nNever one to go quietly, Trump held a competing rally elsewhere in Des Moines, an event he said raised $6 million for military veterans.\n\"When you're treated badly, you have to stick up for your rights,\" Trump said in explaining he was skipping the debate because he felt Fox News had dealt with him unfairly. Broadening his point, he said, \"We have to stick up for ourselves as people and we have to stick up for our country if we're being mistreated.\"\nTrump's absence put the spotlight on Cruz, as well as on Florida Sen. Marco Rubio, who needs a strong showing in Iowa in order to stay in the top tier of candidates.\nThe two senators were confronted with video clips suggesting they had changed their positions on immigration, one of the most contentious issues among Republicans. While each insisted the other had flip-flopped, both denied they had switched their own views allowing some people in the U.S. illegally to stay.\nCruz accused Rubio of making a \"politically advantageous\" decision to support a 2013 Senate bill that included a pathway to citizenship, while the Florida senator said his rival was \"willing to say or do anything to get votes.\"\n\"This is the lie that Ted's campaign is built on,\" Rubio said. \"That he's the most conservative guy.\"\nIn a rare standout debate moment for Bush, the former Florida governor sharply sided with Cruz in accusing Rubio of having \"cut and run\" on the Senate immigration bill.\n\"He cut and ran because it wasn't popular with conservatives,\" said Bush.\nCruz was put on the spot over his opposition to ethanol subsidies that support Iowa's powerful corn industry — a position that has long been considered politically untenable for presidential candidates in the state. The Texas senator cast his position as an effort to keep the government from picking economic winners and losers.\nWith their White House hopes on the line, the candidates worked hard to present themselves as best prepared to be commander in chief and take on terror threats.\nRubio struck an aggressive posture, pledging that as president he would go after terrorists \"wherever they are. And if we capture them alive, they are going to Guantanamo.\" Rubio also stood by his previous calls for shutting down mosques in the U.S if there were indications that the Muslim religious centers were being used to radicalize terrorists.\nKentucky Sen. Rand Paul — back on the main debate stage after being downgraded to an undercard event because of low poll numbers earlier this month — warned against closing down mosques. A proponent of a more isolationist foreign policy, Paul also raised concerns about the U.S. getting involved militarily in Syria, where the Islamic State group has a stronghold.\nThe candidates focused some of their most pointed attacks on Democratic front-runner Hillary Clinton.\n\"She is not qualified to be president of the United States,\" New Jersey Gov. Chris Christie said.\nChristie is part of a crowded field of more mainstream candidates who have struggled to break through in an election year where Trump, and increasingly Cruz, have tapped into voter anger with the political system. Party leaders have grown increasingly anxious for some of the more traditional candidates to step aside to allow one to rise up and challenge for the nomination.\nAsked whether the crowded establishment lane was putting Trump in position to win, Bush said, \"We're just starting out. The first vote hasn't been counted. Why don't we let the process work?\"\nBush also defended the flurry of critical advertisements his well-funded super PAC has launched against Rubio and other rivals.\n\"It's called politics,\" Bush said. \"That's the way it is. I'm running hard.\"\nBush and Christie, along with Ohio Gov. John Kasich, are looking beyond Iowa and hoping New Hampshire's Feb. 9 primary jumpstarts their campaigns. In an election where a lengthy political resume has been a liability, Kasich defended government's ability to tackle big problems.\n\"We serve you,\" Kasich said of government officials and voters. \"You don't serve us. We listen to you and then we act.\"\nCruz proudly claimed he was \"not the candidate of career politicians in Washington.\" Retired neurosurgeon Ben Carson, who has a small but loyal base in Iowa, said that even though he hasn't been in government, he's made plenty of life-and-death decisions as a doctor.\n\"I don't think you need to be a politician to tell the truth,\" he said.\nTrump pulled out this week, citing unfair treatment from host Fox News. He's feuded with the network for months, particularly anchor and debate moderator Megyn Kelly.\nWhile Fox covered the debate, other cable channels aired portions of his rally at Drake University, likely pulling away at least some TV viewers.\nTrump was joined by fellow candidates Mike Huckabee and Rick Santorum, who spoke briefly at the rally after appearing in an early undercard debate for low-polling candidates. Huckabee told the audience that he, Santorum and Trump are political competitors but \"tonight we are colleagues\" in supporting veterans.\n___\nAP writer Kathleen Ronayne contributed to this report.\n___\nFollow Julie Pace at http://twitter.com/jpaceDC\nTed Cruz and Marco Rubio talk after a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidates Donald Trump, center, and Mike Huckabee, left, applaud while listening to Rick Santorum during a campaign event on the campus of Drake University Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Jae C. Hong)\nRepublican presidential candidate Sen. Ted Cruz, R-Texas, left, answers a question as Sen. Marco Rubio, R-Fla., center, listens and former Florida Gov. Jeb Bush, right, looks on during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nMarco Rubio and Jeb Bush laugh together after a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate New Jersey Gov. Chris Christie answers a question as retired neurosurgeon Ben Carson listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nBen Carson, right, talks to Chris Christie during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate former Florida Gov. Jeb Bush answers a question as Ohio Gov. John Kasich listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)","url":"https://www.dailymail.co.uk/wires/ap/article-3420513/Trump-looks-grab-attention-GOP-rivals-debate.html"}
