{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:08:22","date_modify":"2018-10-30 18:08:22","date_publish":"2015-01-16 11:00:33","description":"San Diego Mayor Kevin Faulconer gave his first “State of the City” address Wednesday night, touting his accomplishments since being elected to the |","filename":"data/vaneerConsumption/GOPsSoleBigCityMayorLaudsFirstYearinStateoftheCity.json","image_url":"https://media.breitbart.com/media/2015/01/Faulconer-AP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_16__1540922902.html","title":"GOP’s Sole 'Big-City' Mayor Lauds First Year in 'State of the City'","title_page":"GOP’s Sole 'Big-City' Mayor Lauds First Year in 'State of the City' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"San Diego Mayor Kevin Faulconer gave his first “State of the City” address Wednesday night, touting his accomplishments since being elected to the position last February, and laying out his vision for the year ahead–including plans for a new Chargers football stadium in an effort to keep the team in town.\n“The financial reforms and accountability we have championed are allowing for community revitalization and economic growth,” declared Faulconer in the 43-minute address at Balboa Theatre, as ABC 10 recounted.\nHoning in on plans to capitalize on financial progress, spurring economic growth in specific areas, and combatting poverty, the Mayor lauded San Diego as the home of opportunity for hourly workers, entrepreneurs and motivated parents.\nGiven various troubles afflicting the San Diego Police Department as of late, Mayor Faulconer lauded the efforts of the law enforcement division as moving toward a model of community involvement and accountability.\n“We have currently 600 patrol officers wearing new body cameras, making us the largest city in the nation with this many cameras in use,” Faulconer said according to Team 10.\nTurning to fears over losing the Chargers football team to another city, Faulconer spoke of long-discussed Chargers stadium plans, “This is my commitment: for the first time, this year, we will have a real plan to consider for a new stadium,” according to Team 10. The Mayor set fall as the time when plans would be unveiled, promoting the option of expanding the downtown convention center citing a benefit to local businesses.\nA potential funding measure could end up on the 2016 ballot–along with the highly anticipated presidential vote and Faulconer’s first shot at a general election win.\nFaulconer also said he would seek approval for a road improvement plan to address 1,000 miles of San Diego streets, Team 10 reported.\nFaulconer won election as mayor of America’s eighth largest city over Democrat David Alvarez in a special election last years to replace Democrat Bob Filner. Filner left office after a growing number of sexual harassment allegations.\nMayor Faulconer will address the Republican National Committee winter meeting in Coronado this week in a session shared with Texas Governor Rick Perry.\nPhoto: File/AP\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/01/16/gops-sole-big-city-mayor-lauds-first-year-in-state-of-the-city/"}
