{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:18:23","date_modify":"2018-10-30 19:18:23","date_publish":"2018-07-17 08:23:09","description":"Bob Hugin, the GOP nominee for the U.S. Senate in New Jersey, launched a blistering attack on Sen. Bob Menendez (D-NJ) Monday.","filename":"data/vaneerConsumption/GOPsHuginAttacksMenendezasPollShowsNJSenateRaceaStatisticalTie.json","image_url":"https://media.breitbart.com/media/2018/07/Collage-Hugin-Menendez-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_17__1540927103.html","title":"GOP's Hugin Attacks Menendez as Poll Shows NJ Senate Race a Statistical Tie","title_page":"GOP's Hugin Attacks Menendez as Poll Shows NJ Senate Race a Statistical Tie | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Bob Hugin, the GOP nominee for the U.S. Senate in New Jersey, launched a blistering attack on Sen. Bob Menendez (D-NJ) Monday as a new poll shows the race is now a statistical tie.\nThe Gravis Marketing Poll, provided exclusively to Breitbart News on Monday, showed that Menendez leads Hugin by just two points, 43 percent to 41 percent, which is within the poll’s 4.1 percent margin of error\nIn 2012, Menendez easily defeated his Republican opponent by 18 points.\nBut November’s election comes on the heels of a public corruption trial of Menendez which the Department of Justice dropped in January after an earlier mistrial, and Hugin is driving home the theme with New Jersey voters that perhaps justice may be better served at the ballot box than in the courtroom.\nOn Monday, Hugin attacked Menendez with both barrels on Twitter.\nHe first noted that Menendez’s “colleagues on the bipartisan Senate Ethics Committee agree he violated federal law & abused his power to help his ‘best friend’ Melgen, a convicted felon serving 17 yrs in jail for scamming millions from Medicare.”\n.@SenatorMenendez’s colleagues on the bipartisan Senate Ethics Committee agree he violated federal law & abused his power to help his ‘best friend’ Melgen, a convicted felon serving 17 yrs in jail for scamming millions from Medicare. Time for him to go. https://t.co/bKn1EW9BQ0 — Bob Hugin (@BobHugin) July 16, 2018\nHe then criticized Menendez for comparing President Trump’s meeting with Vladimir Putin to Pearl Harbor.\nSenator, you are a disgrace. Comparing this to the thousands of brave men and women who lost their lives at Pearl Harbor? Pathetic. https://t.co/NBbWKD0LDG — Bob Hugin (@BobHugin) July 17, 2018\nHugin was not done yet.\nNext, he blasted Menendez for “violating federal law and abusing his office to help his felon best friend.”\nNew Jersey won’t be fooled by corrupt Bob Menendez’s desperate propaganda. He has zero credibility to talk about patients after violating federal law and abusing his office to help his felon “best friend” Melgen who stole millions from Medicare by blinding patients. #NJSen https://t.co/TM9fpnWWN8 — Bob Hugin (@BobHugin) July 17, 2018\nHugin hit Menendez again, this time tweeting that “Bob Menendez abused his office to help a rich Florida donor who scammed seniors and blinded patients so he could scam millions from Medicare.” .\nInstead of putting the people of New Jersey first, Bob Menendez abused his office to help a rich Florida donor who scammed seniors and blinded patients so he could scam millions from Medicare. New Jersey deserves better and change is coming in November. #NJSen https://t.co/N0S9cA6CjA — Bob Hugin (@BobHugin) July 17, 2018\nFinally, Hugin hit Menendez once more on the findings of the Senate Ethics Committee, calling the beleagured Democrat senator’s actions “a digrace to the people of New Jersey.”\nBob Menendez was found guilty by the bipartisan Senate Ethics Committee for violating federal law, abusing his office, and taking over $1 million in illegal gifts that he must pay back. His actions are a disgrace to the people of New Jersey. #NJSen https://t.co/2hgTDSXpAz — Bob Hugin (@BobHugin) July 17, 2018\nWith another three and a half months until election day, Menendez can look forward to more unceasing attacks from Hugin that focus on the details of his public corruption trial.\nNew Jersey has not elected a Republican to the U.S. Senate in more than four decades. Unless Menendez can find a way to fight back, that may change come November.","url":"https://www.breitbart.com/politics/2018/07/17/gops-hugin-attacks-menendez-as-poll-shows-nj-senate-race-a-statistical-tie/"}
