{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:18","date_modify":"2018-10-30 19:52:18","date_publish":"2015-10-03 19:48:55","description":"Did CNN Cut Off GOP Strategist's Mic Because She Opposed Gun Control?","filename":"data/vaneerConsumption/GOPStrategistsMicFadesasSheCountersGunControl.json","image_url":"https://media.breitbart.com/media/2015/10/Lisa-Booth-CNN.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_03__1540929138.html","title":"GOP Strategist's Mic Fades as She Counters Gun Control","title_page":"CNN: GOP Strategist's Mic Fades as She Counters Gun Control","title_rss":"NULL","source_domain":"breitbart.com","text":"During an October 3 appearance on CNN, Republican strategist Lisa Boothe’s mic appeared to have been cut while she was in the midst of explaining why gun control is not the answer to situations like the shooting at Umpqua Community College (UCC).\nBoothe was countering Democrat strategist Maira Cardona when the volume for her voice fell to such a low level that she was basically reduced to talking in the background while Cardona had free rein to call for expanded background checks and other gun control measures that would have done nothing to prevent the UCC attack.\nCardona began her statements for gun control by pushing the expansion of background checks on the federal level. She mistakenly claimed, “We don’t have a uniformed way to figure out who is buying these guns, how are they getting them, why are they getting them–if they shouldn’t have them–given their criminal records or perhaps given the fact that they are mentally ill.” Contrary to these claims stands the fact that the U.S. has had background checks at the federal level since 1998, and these checks are mandated in every state and represent a “uniformed way” to ascertain who is trying to buy a gun and when.\nMoreover, the Los Angeles Times reported that the Umpqua Community College gunman bought his guns “legally”–which further renders Cardona’s line of argument moot.\nLisa Boothe seized on the real problem, which is not a lack of gun control but the continued existence of gun free zones and the Democrats’ refusal to repair our broken mental health system.\nBooth said, “Maria is perpetuating the same intellectually dishonest conversation that Democrats are wanting to have to push their anti-gun agenda in America. The reality is the commonality we continue to see with these shootings is a mental health issue [and] 92 percent of these shootings are happening in gun free zones, as was the case in Oregon.”\nAs Boothe talked, Cardona was allowed to begin talking over her in an attempt to pull the discussion back to a pro-gun control position. But Boothe continued making her point, asking what expanding background checks that criminals are already passing will do and pointing out other fallacies in the Democrats’ gun control push. As Boothe talked, her voice began to fade until it was just loud enough to be the background noise behind Cardona’s calls for more gun control.\nBreitbart News emailed CNN to ask if they brought Boothe’s volume down on purpose, due to her opposition to gun control. No response had been received from CNN at the time this article was posted.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/03/cnn-gop-strategists-mic-fades-as-she-counters-gun-control/"}
