{"authors":[],"date_download":"2018-10-30 21:09:55","date_modify":"2018-10-30 21:09:55","date_publish":"2018-09-16 23:43:56","description":"While standing behind federal appeals court judge Brett Kavanaugh, President Donald Trump's nominee for the U.S. Supreme Court, some Republican Senators said Sunday that they were open to the idea of hearing from Christine Blasey Ford, who has accused Kavanaugh of sexual misconduct during a party wh...","filename":"data/vaneerConsumption/GOPSenatorsdefendKavanaughbutopentohearingfromaccuser.json","image_url":"https://cmgajcjamiedupree.files.wordpress.com/2018/09/kavanaugh40.jpg?w=145","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/jamiedupree.blog.ajc.com/2018_09_16__1540933795.html","title":"GOP Senators defend Kavanaugh, but open to hearing from accuser","title_page":"GOP Senators defend Kavanaugh, but open to hearing from accuser | Jamie Dupree - AJC","title_rss":"NULL","source_domain":"ajc.com","text":"View Caption Hide Caption\nWhile standing behind federal appeals court judge Brett Kavanaugh, President Donald Trump’s nominee for the U.S. Supreme Court, some Republican Senators said Sunday that they were open to the idea of hearing from Christine Blasey Ford, who has accused Kavanaugh of sexual misconduct during a party when they were teenagers in the 1980’s.\nSen. Lindsey Graham (R-SC), a member of the Senate Judiciary Committee, said he “would gladly listen” to Ford, as some Democrats called for a Thursday vote of that panel on Kavanaugh’s nomination to be delayed.\n“If the committee is to hear from Ms. Ford it should be done immediately so the process can continue as scheduled,” Graham said.\nAnother member of the committee, Sen. Jeff Flake (R-AZ), staked out an even more definitive stance, telling reporters that he would not support holding a vote on the Kavanaugh nomination, ‘until we hear more.’\nThere are 11 Republicans on the Senate Judiciary Committee and 10 Democrats. A call for a delay by Jeff Flake, a member of the panel, is a big deal. https://t.co/LH7WrCTDop — Laura Litvan (@LauraLitvan) September 16, 2018\nFord’s accusation first surfaced last week as an anonymous story, but she put her name to the details on Sunday, telling the Washington Post that Kavanaugh tried to remove her bathing suit during a drunken encounter at a party of teenagers outside of Washington, D.C.\nKavanaugh has sternly denied the accusation.\n“I categorically and unequivocally deny this allegation,” Kavanaugh said in a statement issued late last week to news organizations, when the story first arose. “I did not do this back in high school or at any time.”\nThis is exactly why we can’t rush nominations. How can we vote on Kavanaugh when disturbing, credible allegations of sexual assault have been made? Even Republican Senators Jeff Flake & Bob Corker want to delay the vote. I agree. #DelayTheVote. https://t.co/0f1Pme7UWU — Senator Bob Menendez (@SenatorMenendez) September 17, 2018\nDemocrats said the turn of events should delay action on Kavanaugh’s nomination.\n“At a bare minimum, this week’s scheduled committee vote on Judge Kavanaugh’s lifetime appointment to the Supreme Court must be postponed until this matter is fully and thoroughly investigated,” said Sen. Cory Booker (D-NJ).\n“We cannot meet our constitutional responsibility of advice and consent without a fair and careful review of the serious and credible allegations made by Dr. Ford,” said Sen. Dick Durbin (R-IL).\nOn their own, Democrats are powerless to stop the nomination – making the statement by Sen. Flake all the more important as to Kavanaugh’s future.\nBut the he-said-she-said nature of the allegations – and their sudden appearance – left other Republicans wondering if this was a Political Hail Mary.\nAs of now, it hasn’t changed the approach of key GOP Senators like Sen. Susan Collins (R-ME) – but could change the thinking of Sen. Lisa Murkowski (R-AK).\nNew: GOP Sen. Lisa Murkowski, one of the key undecideds on Brett Kavanaugh’s confirmation, told CNN’s @stevebruskCNN tonight committee “might have to consider” delaying vote. — Jim Sciutto (@jimsciutto) September 17, 2018\n“It’s disturbing that these uncorroborated allegations from more than 35 years ago, during high school, would surface on the eve of a committee vote after Democrats sat on them since July,” said a spokesman for Sen. Charles Grassley (R-IA), the chairman of the Senate Judiciary Committee.\n“It raises a lot of questions about Democrats’ tactics and motives,” the spokesman, Taylor Foy, added.\nGrassley’s office told the Associated Press that it was possible committee members might have a bipartisan call with Ford, though nothing final had been announced as of Sunday evening.\nThe last minute nature of these charges has some similarities to the firestorm that erupted over the nomination of Justice Clarence Thomas in 1991.\nAs with Kavanaugh, Thomas’s testimony was completed before Hill made public accusations of sexual harassment against Thomas.\nThe Senate Judiciary Committee reconvened to hear those allegations, as Hill and Thomas told their stories. Thomas was ultimately approved on a narrow 52-48 vote in the full Senate.","url":"http://jamiedupree.blog.ajc.com/2018/09/16/gop-senators-defend-kavanaugh-but-open-to-hearing-from-accuser/"}
