{"authors":[],"date_download":"2018-10-30 14:31:10","date_modify":"2018-10-30 14:31:10","date_publish":"2015-07-23 00:00:00","description":null,"filename":"data/vaneerConsumption/GOPworkinghardonphonybilltodefundsanctuarycities.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_gop_working_hard_on_phony_bill_to_defund_sanctuary_cities_1540909870.html","title":"GOP working hard on phony bill to defund sanctuary cities","title_page":"GOP working hard on phony bill to defund sanctuary cities","title_rss":"NULL","source_domain":"americanthinker.com","text":"GOP working hard on phony bill to defund sanctuary cities\nHouse Speaker John Boehner has just come out of the closet. He's a thespian. He can't be anything else, because he strives to be one of the greatest actors of all time. He currently is starring in a play on the House floor where he is appearing to pass a bill that would cut off funding for sanctuary cities. The only problem with that is that the House is now powerless to do so. The House can certainly pass such a bill, but the Senate can ignore it, and even if the Senate passed it as well, Obama could veto it without consequence.\nThe problem is that this spending restriction is a standalone piece of legislation. It's not attached to the budget. If it were attached to the budget, Obama would have a more difficult time fighting it, because to veto it would be to veto the budget. But the House gave up that mechanism when they passed a budget fully funding all of Obama's priorities, including Obamacare and his illegal amnesty. Once that was passed, the Congress had no other powers until the next budget or the next vote on the debt ceiling. And since those are real pieces of legislation that must pass, you can be sure the Republicans won't attach amendments to them about sanctuary cities or anything else Obama might object to. The House will take up a bill this week blocking funding for so-called \"sanctuary cities\" that resist turning over immigrants to federal authorities. The move follows the shooting death of a woman in San Francisco this month, allegedly by an immigrant with a criminal record and without legal status. You see? They want to look like they're doing something, but the something they are doing won't change a thing, and they know it. On the subject of sanctuary cities, when Republican states try to police illegal aliens, the Obama administration sues them for stepping on federal responsibilities. But when Democratic cities ignore the laws and welcome illegals with free schooling, medical care, housing, and welfare, Obama is nowhere to be found (except the golf course). This article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/gop_working_hard_on_phony_bill_to_defund_sanctuary_cities.html"}
