{"authors":["Press Association"],"date_download":"2018-10-23 01:08:13","date_modify":"2018-10-23 01:08:13","date_publish":"2016-01-28 15:22:52","description":"Britain has its first player into an Australian Open singles final after Gordon Reid won a marathon three-setter against Argentina's Gustavo Fernandez in the...","filename":"data/vaneerConsumption/Gordonreidsecuresplaceinaustralianopenwheelchairsinglesfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-b3e75e12-3a63-48f4-9d69-fe146fb7943d-2vdWmEltwXfba0ce28e632a1e83f-666_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421010_Gordon-Reid-secures-place-Australian-Open-wheelchair-singles-final_1540256893.html","title":"Gordon reid secures place in australian open wheelchair singles final","title_page":"Gordon reid secures place in australian open wheelchair singles final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gordon Reid secures place in Australian Open wheelchair singles final\nBritain has its first player into an Australian Open singles final after Gordon Reid won a marathon three-setter against Argentina's Gustavo Fernandez in the wheelchair event.\nReid has never reached the final of a grand slam wheelchair singles before and he was made to work hard for it as he beat Fernandez 6-3 6-7 (6/8) 9-7 in an epic contest lasting three hours and 13 minutes.\nThe 24-year-old, who is also playing the wheelchair doubles in Melbourne, will now face Belgian left-hander Joachim Gerard in Saturday's final.\nGordon Reid has made it to the final of the men's singles in the Australian Open wheelchair competition\n\"It means a lot - I really couldn't be much happier,\" Reid said.\n\"That was one of the toughest matches of my life, going to 9-7 in the third against a guy who missed absolutely nothing.\n\"I'm really happy with how I pulled out my best tennis when it mattered. It's my first final at a grand slam but I'll just try to enjoy it and perform well.\"\nReid contracted transverse myelitis - a disease affecting the spinal chord - when he 13 years old but he was already a keen tennis player and was determined to continue competing.\nThe Glaswegian enjoyed a stunning quarter-final win over top seed Shingo Kunieda, who had not lost a match in eight years at the Australian Open, surrendering the title only once in 2012 when he did not compete.\nAndy Murray offered his praise for the victory after his win over David Ferrer on Wednesday while Judy Murray was in the stands watching as Reid pulled off the remarkable upset.\n\"It's a real honour to have guys like Andy and Jamie talk about me, to mention me in such a nice way,\" Reid said.\n\"Jamie's in his final (of the men's doubles) too and hopefully Andy will make it a treble.\"\nReid looked on course for a more comfortable win over Fernandez when he took the opening set 6-3 but the South American tightened up in the second, edging the tie-break to force a decider.\nNeither player relented but Reid continued to be the aggressor and his courage was finally rewarded in the 16th game when he converted the last of three match points.\n\"I'm not stressing out too much about the outcome of matches,\" Reid said.","url":"https://www.dailymail.co.uk/wires/pa/article-3421010/Gordon-Reid-secures-place-Australian-Open-wheelchair-singles-final.html"}
