{"authors":["John Hayward"],"date_download":"2018-10-30 19:33:10","date_modify":"2018-10-30 19:33:10","date_publish":"2017-03-31 15:06:35","description":"On Friday’s Breitbart News Daily, presidential adviser Dr. Sebastian Gorka talked about Asia policy with SiriusXM host Alex Marlow.","filename":"data/vaneerConsumption/GorkaBeijingsTerritorialExpansioninSouthChinaSeaCannotbeAllowedtoStand.json","image_url":"https://media.breitbart.com/media/2016/02/AP_318270544630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2017_03_31__1540927990.html","title":"Gorka: Beijing’s ‘Territorial Expansion’ in South China Sea ‘Cannot be Allowed to Stand’","title_page":"Gorka: Beijing’s ‘Territorial Expansion’ in South China Sea ‘Cannot be Allowed to Stand’","title_rss":"NULL","source_domain":"breitbart.com","text":"On Friday’s Breitbart News Daily, presidential adviser Dr. Sebastian Gorka talked about Asia policy with SiriusXM host Alex Marlow, taking an especially firm stand against China’s effort to claim dominion over the entire South China Sea.\nMarlow noted the uptick in both provocative behavior and bellicose language from North Korea over the past few months.\nGorka said the Trump administration would stick to its “plans and principles” on North Korea, and would not be spooked into “giving the playbook away” by Pyongyang’s belligerent rhetoric.\n“It is of great concern what North Korea is doing, especially with regard to its recent weapons testing,” he said. “It’s a very different nation from all the other nations of the world. It will be treated in that special sui generis way. If you allow us to just play our cards close to our chests, Alex, that’s how strategy should be done in these instances.”\nIn the South China Sea, Gorka said the “smokescreen” over China’s actions was slowly dissipating.\n“Originally, China said that it was going to build these artificial atolls for search-and-rescue purposes – a very anodyne, very charitable concept,” he noted. “They’re very dangerous shipping lanes, and we really need to be able assist anybody who gets into trouble.”\n“But that’s fallen by the wayside, and we know these are not there for some kind of multilateral charitable purpose,” he continued. “They’re there as military installations.”\nHe scoffed at China’s recent claim that there are no artificial islands under construction in the South China Sea, noting they can be clearly seen in satellite imagery from Google Earth.\n“That is a territorial expansion. That is something that really cannot be allowed to stand. As such, we’re going to work with our partners and with the various individuals who are interested in seeing freedom of movement in the area. China will have to act in ways that comport with freedom of movement on the international waterways,” Gorka declared.\nDr. Sebastian Gorka is a deputy assistant to President Donald Trump, former National Security editor for Breitbart News, and author of books such as Defeating Jihad: The Winnable War.\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/radio/2017/03/31/gorka-beijings-territorial-expansion-in-south-china-sea-cannot-be-allowed-to-stand/"}
