{"authors":["Associated Press"],"date_download":"2018-10-23 00:05:19","date_modify":"2018-10-23 00:05:19","date_publish":"2017-03-16 08:59:15","description":"Despite strong endorsements from some gun rights advocates, Supreme Court nominee Neil Gorsuch has a slim appeals court record on the subject - a record that...","filename":"data/vaneerConsumption/GorsuchviewonscopeofSecondAmendmentajudicialmystery.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227491-1489655407-363_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319324_Gorsuch-view-scope-Second-Amendment-judicial-mystery_1540253119.html","title":"Gorsuch view on scope of Second Amendment a judicial mystery","title_page":"Gorsuch view on scope of Second Amendment a judicial mystery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Despite strong endorsements from some gun rights advocates, Supreme Court nominee Neil Gorsuch has a slim appeals court record on the subject - a record that leaves his views a mystery on how far constitutional firearms rights extend.\nThe National Rifle Association notes favorably a 2012 case in which Gorsuch wrote for the 10th U.S. Circuit Court of Appeals that \"the Supreme Court has held the Second Amendment protects an individual's right to own firearms and may not be infringed lightly.\"\nTaken with his conservative leanings, originalist views on interpreting the Constitution and comparisons to the late Justice Antonin Scalia, that leads many gun owners to believe Gorsuch would protect their interests.\nFILE - In this Feb. 2, 2107 file photo, Supreme Court Justice nominee Neil Gorsuch, right, escorted by former New Hampshire Sen. Kelly Ayotte walks on Capitol Hill in Washington. Despite strong endorsements from some gun rights advocates, Supreme Court nominee Neil Gorsuch has a sparse appeals court record on gun policy, one that leaves his view on how far the Second Amendment extends a judicial mystery. (AP Photo/J. Scott Applewhite, File)\n\"He has an impressive record that demonstrates his support for the Second Amendment,\" Chris W. Cox, executive director of the NRA's Institute for Legislative Action, said in a statement endorsing the nominee.\nHowever, Gorsuch has not ruled on major Second Amendment cases.\n\"We don't know, for instance, if he believes people have a right to carry guns in public. We don't know what he thinks about restrictions on assault weapons or high-capacity magazines,\" said Adam Winkler, a law professor at the University of California, Los Angeles, and author of \"Gunfight: The Battle Over the Right to Bear Arms in America.\"\n\"Those are the big issues that are likely to come before the Supreme Court with regards to the Second Amendment,\" Winkler said. \"And on those issues Gorsuch is a Second Amendment mystery.\"\nThe case cited by the NRA involved a man who appealed his conviction of being a felon in possession of a gun, saying he didn't know he was considered a felon due to a misunderstanding over his deferred prosecution in a previous robbery case.\nAlthough he had signed documents indicating he would be considered guilty of a felony, the state judge told him, among other things, \"If I accept your plea today, hopefully you will leave this courtroom not convicted of a felony and instead granted the privilege of a deferred judgment, which means you will be supervised by the Department of Probation for a period of two years.\"\nMiguel Games-Perez was arrested less than a year later with a pistol that had an obliterated serial number.\nGorsuch was on a three-judge panel that found the government had only to prove that Games-Perez knew he had a gun, not that he knew he was prohibited from having one.\nGorsuch said the panel was bound by precedent.\n\"Our duty to follow precedent sometimes requires us to make mistakes. Unfortunately, this is that sort of case,\" Gorsuch wrote.\nGames-Perez later asked the full appeals court to hear the case, a request that was denied in a 6-4 decision. Gorsuch dissented, saying the full court could reconsider its precedent. He wrote that due to the \"repeated misstatements from the court itself, Mr. Games-Perez surely has a triable claim he didn't know his state court deferred judgment amounted to a felony conviction.\"\nSome groups favoring more stringent gun laws refer to the same case when arguing that Gorsuch is unfit for the Supreme Court.\n\"Judge Gorsuch's views are so outside the mainstream that he has gone out of his way to side with felons over public safety,\" Peter Ambler, executive director of Americans for Responsible Solutions, said in a statement opposing Gorsuch's nomination.\nAnd not all gun rights advocates are enthusiastic to endorse Gorsuch - because of another case.\nLarry Pratt, executive director emeritus of Gun Owners of America, said the case that gave him pause involved a police officer in New Mexico disarming Daniel Rodriguez, a convenience store employee who had a pistol tucked into his waistband. The man turned out to be a convicted felon, but Pratt said the officer had no way of knowing that at the time because the man wasn't accused of a crime and the officer didn't question him beforehand.\nGorsuch sided with the appeals panel to uphold the man's conviction.\nUltimately, Pratt said, Gorsuch's judicial philosophy and overall record helped earn an endorsement.\n\"We're going to support him with this caveat of our concern because of the Rodriguez case. And part of it's a practical matter that if Gorsuch were to be turned down, it's not likely, politically, that the next one would be any better,\" Pratt said.\nJ. Adam Skaggs, litigation director for the Law Center to Prevent Gun Violence, Americans for Responsible Solutions Foundation, said in a telephone interview that Gorsuch has \"a very thin paper trail, but the few cases where he has ruled on gun issues raise a lot of questions.\"\nIn a 2010 case, Skaggs said Gorsuch relied on procedural grounds in rejecting the appeal of a man charged with possessing a gun after being convicted of domestic violence rather than \"conceding the point that convicted domestic abusers don't enjoy the same Second Amendment rights as law abiding citizens.\"\n\"Instead, he went out of his way to resolve the case on a complicated procedural ground,\" Skaggs said.\nStill, Winkler, the law professor, said it's difficult to know how Gorsuch would rule in the most important Second Amendment cases because his track record is so limited.\n\"He's only decided a few cases with Second Amendment overtones and none of them are the major decisions on the important issues of the day,\" Winkler said. \"Nothing in his path tells use what he understands the scope of the Second Amendment to be.\"\n___\nFind AP's reporting on Neil Gorsuch here: http://apne.ws/2mfXk4V\n___\nThe AP National Investigative Team can be reached at investigate@ap.org","url":"https://www.dailymail.co.uk/wires/ap/article-4319324/Gorsuch-view-scope-Second-Amendment-judicial-mystery.html"}
