{"authors":[],"date_download":"2018-10-22 21:00:56","date_modify":"2018-10-22 21:00:56","date_publish":"2014-05-05 15:26:32","description":"Researchers point to a pile-on of unusual and suspicious features that amounts to \"us having won the lottery.\"","filename":"data/vaneerConsumption/GospelofJesussWifeLooksMoreandMoreLikeaFake.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/420651/140505-gospel-coptic-jesus-wife-12p_67647eb6ebb6741c7fde182f74278a6c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_gospel-jesuss-wife-looks-more-more-fake-n97281_1540242056.html","title":"'Gospel of Jesus's Wife' Looks More and More Like a Fake","title_page":"'Gospel of Jesus's Wife' Looks More and More Like a Fake","title_rss":"NULL","source_domain":"nbcnews.com","text":"A Live Science investigation published last week revealed that Laukamp was co-owner of ACMB-American Corporation for Milling and Boreworks in Venice, Florida. The man listed as representative of Laukamp's estate in Sarasota County, Florida, Rene Ernest, said that Laukamp didn't own this papyrus, didn't collect antiquities, didn't have an interest in old things and was living in West Berlin in 1963 — as such, Laukamp couldn't have reached Potsdam across the Berlin Wall to purchase this papyrus. Laukamp died in 2002.\nAxel Herzsprung, who was another co-owner of ACMB-American Corporation for Milling and Boreworks, also said Laukamp didn't own this papyrus and didn't collect antiquities.\nAdditionally, since the investigation was published, Live Science has been in contact with an agency in Berlin that issues permits for the exportation of antiquities. Representatives of that agency said they could find no record that a papyrus like this had been exported from their office. It's possible that the Gospel of Jesus's Wife papyrus was exported from elsewhere in Germany or from the European Union.\nMore evidence appears\nJust recently, Christian Askeland, a research associate with the Institut für Septuaginta-und biblische Textforschung in Wuppertal Germany, revealed new information that casts further doubt on the papyrus' authenticity. His work is set to be published in the journal Tyndale Bulletin and is currently posted on a blog.\nAskeland analyzed a second papyrus that, according to documents published in the Harvard Theological Review, was also purchased by the anonymous owner from Laukamp. It was presented to Harvard as a papyrus believed to be genuine.\nThis second papyrus, which has writing on two sides, includes text from the Gospel of John — and is a fake, writes Askeland, its lines being copied from a papyrus published in 1924. In addition, the researcher notes this papyrus has similar handwriting and ink to the Gospel of Jesus's Wife, making it likely that the Jesus's wife papyrus is also fake. [Proof of Jesus Christ? 7 Pieces of Evidence Debated]\nThis second papyrus, which was carbon dated to between the seventh and ninth centuries A.D., is very similar to a Gospel of John papyrus, written and published by Egyptologist Sir Herbert Thompson in 1924, Askeland noted. In fact, the line breaks (the places where the text begins) are identical to those from Thompson's text. This is illustrated in an image of one side of the papyrus alongside Thompson’s 1924 text posted by Mark Goodacre of Duke University on his blog and republished on Live Science.\n\"Seventeen of 17 line breaks are the same. This defies coincidence,\" writes Askeland.\nThe John fragment is written in a dialect of Coptic called Lycopolitan, which had died out by the seventh century A.D., which would seem to confirm the fragment's inauthenticity, Askeland said.\nTests carried out by James Yardley and Alexis Hagadorn of Columbia University found that the ink from the Gospel of Jesus's Wife and the John fragment are similar but not quite the same. The handwriting style, however, from the John fragment is similar to that of the Gospel of Jesus's Wife, Askeland noted.\nGiven the similar handwriting and ink, and the identical owner, Askeland, and a large number of other scholars who have written online about Askeland's finds, argue that the Gospel of Jesus's Wife is likely also fake.\nLive Science contacted two Egyptologists who have examined the Gospel of Jesus's Wife firsthand to get their opinions. Malcolm Choat, of Macquarie University, who published an analysis of the writing of the Gospel of Jesus's Wife recently in Harvard Theological Review, says that he needs time to investigate Askeland's findings before he can comment. Similarly, Roger Bagnall, the director of the Institute for the Study of the Ancient World at New York University (the Gospel of Jesus's Wife was examined there at one point) said that he needs time to analyze Askeland's findings and those of other scholars before he can comment.\nHans-Ulrich Laukamp – Superman?\nIf Laukamp did own both the Gospel of Jesus's Wife and the John papyrus, as the documents from the anonymous owner indicate, then this makes him an even more interesting and daring man.\nHe would have had to cross the Berlin Wall in 1963, at the height of the Cold War, to obtain the Jesus' wife papyrus from Potsdam (and if caught, he would have to explain to East German police that the Jesus' wife papyrus was just an ancient manuscript and not a coded message). He also would, at some point, have obtained a fake Coptic papyrus of the Gospel of John that had very similar handwriting and ink to the Jesus' wife papyrus.\nHe then would have hidden his collecting habits from Ernest (his estate representative in Sarasota County, Florida) and Axel Herzsprung, his closest business partner.\nThe two Egyptologists who can verify any part of this story, Gerhard Fecht and Peter Munro, died in 2006 and 2009, respectively. Additionally, Laukamp didn't have any children and doesn't appear to have any relatives still alive. And if the papyrus was exported from Berlin at some point, antiquities officials there have no record of it.\nCan you win the lottery twice?\nBiblical scholars have made numerous comments arguing that the Gospel of Jesus's Wife is a fake. [See Photos of the Gospel of Judas]\n\"If the Gospel of Jesus's Wife fragment is genuine, this already involves a pile-on of unusual and suspicious features that amounts to us having won the lottery,\" writes James Davila, a professor at the University of St. Andrews, on his blog. \"Now another manuscript from the same cache written in the same hand again presents us with another pile-on of similarly suspicious features. At what point do we stop claiming another lottery win and just accept that the whole thing is a forgery?\"\nLeo Depuydt, of Brown University, sent an email to several journalists and scholars saying that King should retract her findings. \"When is this papyrological pantomime, this Keystone Coptic, this academic farce, this philological burlesque finally going to stop?\" asked Depuydt in the email.\nHarvard silent\nKing has remained silent on the new evidence. Calls made by Live Science to Harvard Divinity School's media relations office were not returned. Calls made directly to King's phone were also not returned. The reasons for the silence are unclear; there are unconfirmed reports that divisions have emerged within the Harvard Divinity faculty over the authenticity of the papyrus.\nA spokesperson for the Smithsonian Channel said that they are still planning to premiere their documentary on the Gospel of Jesus's Wife on Monday evening.\nFollow Live Science Twitter, Facebook & Google+. Original article on Live Science.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/science-news/gospel-jesuss-wife-looks-more-more-fake-n97281"}
