{"authors":[],"date_download":"2018-10-23 01:16:40","date_modify":"2018-10-23 01:16:40","date_publish":"2017-03-16 11:08:14","description":"China insisted on Thursday that its proposal for de-escalating tensions on the Korean peninsula was the \"only feasible plan\" and challenged the United States...","filename":"data/vaneerConsumption/GotanybetterideasChinaasksonNorthKorea.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-227913-1489662496-845_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319696_Got-better-ideas-China-asks-North-Korea_1540257400.html","title":"'Got any better ideas?' China asks on North Korea","title_page":"'Got any better ideas?' China asks on North Korea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China has called for North Korea to suspend its nuclear and missile activities in exchange for the US and South Korea halting military exercises\nChina insisted on Thursday that its proposal for de-escalating tensions on the Korean peninsula was the \"only feasible plan\" and challenged the United States to come up with something better.\nChinese Foreign Minister Wang Yi called last week for North Korea to suspend its nuclear and missile activities in exchange for the US and South Korea halting military exercises to avert a dangerous confrontation.\nBut Washington has rebuffed Beijing's proposal and on Thursday US Secretary of State Rex Tillerson signalled a harder American line, saying in Tokyo that diplomatic efforts to rein in North Korea over the past 20 years had failed.\n\"Under the current circumstances, we believe that (China's proposal) is the only correct, rational, feasible plan so far,\" Chinese foreign ministry spokeswoman Hua Chunying said.\n\"If the US or another country has a better plan, a better proposal, they can bring it out.\n\"As long as the proposal is conducive to reducing the current tensions, and to bringing the relevant parties back to dialogue and negotiation in order to resolve the Korean nuclear issue, we will have an open and constructive attitude.\"\nHua spoke in Beijing at almost the same time that Tillerson made his comments in Tokyo, so it was not clear whether her statement was a direct response to the US secretary of state.\nIn Japan at the start of an Asian tour that will also take him to Seoul and Beijing, Tillerson said \"a new approach\" was required in dealing with Pyongyang and that China needed to play its part in bringing its unpredictable neighbour under control.\nChina is perhaps the only country with significant leverage over North Korea, which has ignored several rounds of UN-backed sanctions targeting its banned weapons programme.\nIt has recently set regional alarm bells ringing anew with a nuclear test last September and missile launches more recently, all of which it is banned from doing by UN resolutions.","url":"https://www.dailymail.co.uk/wires/afp/article-4319696/Got-better-ideas-China-asks-North-Korea.html"}
