{"authors":["Patti Neighmond"],"date_download":"2018-10-23 05:39:06","date_modify":"2018-10-23 05:39:06","date_publish":"2017-02-20 00:00:00","description":"New guidelines encourage doctors to tell patients to try non-drug therapies for acute lower back pain first.","filename":"data/vaneerConsumption/GotBackPainTryYogaOrMassageBeforeReachingForThePills.json","image_url":"https://media.npr.org/assets/img/2017/02/18/yoga-back-pain_wide-7ebe92e21e19f8c4bec1b40f8cd99a6c40594882.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2017_02_20_515675259_got-back-pain-try-yoga-or-massage-before-reaching-for-the-pills_1540273146.html","title":"Got Back Pain? Try Yoga Or Massage Before Reaching For The Pills","title_page":"Drugs Should Be A Last Resort to Treat Acute Lower Back Pain : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Got Back Pain? Try Yoga Or Massage Before Reaching For The Pills\nEnlarge this image Hero Images/Getty Images Hero Images/Getty Images\nMost of us suffer back pain at some point in our lives. In fact, it's one of the most common reasons people go to the doctor. Many of us also probably reach for medication. Now, new guidelines from the American College of Physicians say try exercise, yoga, or massage first.\nThat's a pretty big change for both doctors and patients, but a welcome one, some doctors say.\nTo come up with the recommendations, researchers analyzed more than 150 studies looking at what works and what doesn't when it comes to lower back pain.\nThe type of acute pain we're talking about is your \"garden variety back pain you might get after shoveling a little too much or over-exercising,\" says ACP president Dr. Nitin Damle — not the kind of pain that radiates down your leg and causes numbness, or the type which results from a major accident.\nIn contrast to other types of pain, Damle says acute back pain usually goes away on its own. \"The body will adjust, the inflammation will go down,\" he says. It may take a few days or even a week, but eventually you'll be back to normal.\nSo why risk side effects of medication, he says, if you don't have to? Side effects can include gastritis, stomach upset and a rise in blood pressure.\nInstead, the new guidelines suggest techniques to speed up the healing process, including heat wraps, massage, acupuncture and spinal manipulation which can \"relax the muscles, joints, and tendons so people can be relieved of their low back pain sooner, rather than later.\"\nOther options that can help include exercise, \"mind-body\" therapies like yoga, tai chi, mindfulness-based stress reduction and guided relaxation techniques.\nFor patients with chronic pain who just aren't responding to these non-drug therapies, the guidelines recommend medication to reduce inflammation such as ibuprofen and naproxen, which are nonsteroidal anti-inflammatory drugs (NSAIDs).\nAcetaminophen doesn't reduce pain or inflammation and is no longer recommended for back pain, according to a review published in Annals of Internal Medicine on Tuesday. In certain cases, muscle relaxants might help short term.\nIf that fails, and pain persists, the next option could include medications for nerve pain or narcotics for pain. \"Only in rare circumstances should opioids be given,\" Damle says, \"and then only at the lowest dose possible and for the shortest period of time.\"\nPrimary care doctor Steven Atlas, an associate professor at Harvard Medical School who practices at Massachusetts General Hospital, wrote an editorial accompanying the guidelines. He describes them as a needed change. \"We are moving away from simple fixes like a pill to a more complex view that involves a lot of lifestyle changes,\" he says.\nAtlas says this is a big cultural shift. In order to make non-drug treatments more commonplace, he suggests doctors expand their referral systems and that health insurance companies consider covering these costs.\nThe guidelines were published online Feb. 13 in the Annals of Internal Medicine.","url":"https://www.npr.org/sections/health-shots/2017/02/20/515675259/got-back-pain-try-yoga-or-massage-before-reaching-for-the-pills"}
