{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 02:01:48","date_modify":"2018-10-23 02:01:48","date_publish":"2017-03-10 10:44:36","description":"Game Of Thrones show bosses have made the revelation of the launch date via social media, in an elaborate live video stunt.","filename":"data/vaneerConsumption/GOTfanswatchicemelttodiscoverseason7launchdate.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22317400000578-0-image-a-4_1489142744789.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300654_Game-Thrones-fans-watch-block-ice-melt-hour_1540260109.html","title":"GOT fans watch ice melt to discover season 7 launch date","title_page":"GOT fans watch ice melt to discover season 7 launch date | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fans of fantasy epic Game Of Thrones have had to wait longer than usual for the launch of the latest season, thanks to HBO's decision to push the premiere date back to the Summer, rather than the Spring.\nAnd until now, they didn't know the precise date of the show's return either.\nBut show bosses have now made the revelation via social media, in an elaborate live video stunt.\nScroll down for video\nA teaser of ice and fire: Game Of Thrones fans spend over an hour watching a block of ice melt to discover the launch date of the 'brutal, bloody and wintry' seventh season\nFans watched for more than an hour in anticipation as a huge block of ice in a room lit with torches melted away to reveal the date they had been waiting for.\nThe UK premiere date was revealed to be July 17; and the video then continued with teaser clips of the upcoming series, complete with a fresh wave of battles, dragons and creepy creatures.\nIn the new trailer, returning character Jon Snow says: 'There is only one war that matters. The Great War. And it is here.'\nAfter being pushed back from its usual April launch, this will mark the show’s penultimate series.\nThe big reveal: Fans watched for more than an hour in anticipation as a huge block of ice in a room lit with torches melted away to reveal the date they had been waiting for\nIt will be available from 2am on Sky Atlantic on July 17 and online streaming service Now TV, followed by a repeat at 9pm the same day.\nThe sixth season culminated in Daenerys setting sail for the Seven Kingdoms, Snow dubbed King of the North, Cersei seizing the Iron Throne and the Night King amassing forces.\nAccording to broadcasters, the coming series promises a 'brutal, bloody and wintry return to Westeros' snd star of the show Kit Harington has teased some details on the upcoming season.\nThe 30-year-old actor, who plays Jon Snow, talked to ABC News on Thursday and offered up several tantalizing teasers as well as some interesting analysis.\nWhat a tease: It seems Kit Harington is suggesting things are only going to get crazier in the upcoming season of Game of Thrones\n'[Season 7 has] so much more ambition,' began the U.K. native, it's going to be 'much grander.'\nHe went on to explain why fans are going to get a particularly wild ride in the upcoming season.\n'There are less episodes this year, so they spent more money on those episodes. So, the whole scale of it is up,' he said, referring to the fact that there are only seven episodes planned for the new run, down from 10 in seasons past.\nThe Seventh Son star also revealed he believes the show needs to go out 'with a bang' when it ends after season eight.\nRepeat? His Jon Snow character has already died and come back to life once\n'That has to happen at the end of Thrones, this season and next season. It has to go into places TV hasn't been.'\nAfter the more general discussion, he also got into how the fans' perception of the show is extremely important.\n'I'm such a big cynic, I film a scene and [think] it's gonna be a terrible scene,' he admitted, before adding 'Then when everyone loves it, I'm happy.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300654/Game-Thrones-fans-watch-block-ice-melt-hour.html"}
