{"authors":["Allison Aubrey"],"date_download":"2018-10-22 23:10:04","date_modify":"2018-10-22 23:10:04","date_publish":"2018-08-20 00:00:00","description":"Americans forfeited about 200 million days of paid vacation leave last year. And many U.S. workers now take shorter, partial-week vacations. But even a mini-break can be good for your health.","filename":"data/vaneerConsumption/GotVacationEnvyEvenAShortGetawayCanBoostWellBeingShots.json","image_url":"https://media.npr.org/assets/img/2018/08/17/npr_vacation_wide-633d97de99d1438476ebdae3a56bb247e36638c6.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2018_08_20_639551037_vacation-days-piling-up-heres-how-to-get-the-most-out-of-a-short-vacation_1540249804.html","title":"Got Vacation Envy? Even A Short Getaway Can Boost Well-Being : Shots","title_page":"Got Vacation Envy? Even A Short Getaway Can Boost Well-Being : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Vacation Days Piling Up? Here's How To Get The Most Out Of A Short Vacation\nEnlarge this image toggle caption Kristen Uroda for NPR Kristen Uroda for NPR\nAs a nation, we could do a better job at taking time off.\nAbout half of full-time workers recently surveyed by the U.S. Travel Association didn't take all the paid vacation days they earned last year.\nMore than 700 million vacation days went unused, and we forfeited about 200 million of those days — when vacation benefits didn't roll over. On average, American workers took almost six fewer vacation days than we earned.\nIf you're among this group, you could be missing out on some of the benefits of leisure time.\nIt may seem obvious that vacation makes us feel good, but its health benefits are, in fact, measurable. For instance, one study finds engaging in more frequent enjoyable leisure activities, including vacation, is linked to improvements in mood, sleep and blood pressure, and it can help buffer \"the negative psychological impact of stress.\"\nThere's also research to suggest regular vacationers may get a longevity boost. One line of evidence comes from a study of men who were at high risk of heart disease. Men who regularly took an annual vacation had a reduced risk of death during the study period.\nFor decades, the vacation trend line was steady. From 1978 to 2000, Americans averaged 20.3 days of vacation per year, including paid holidays. But, during this century, there's been a steady decline. In 2014, Americans took about 16 days a year. Now, it has bounced back up to about 17 days a year.\n\"We're doing a little better,\" says Katie Denis of the U.S. Travel Association's Project: Time Off.\nAnother change: Americans are now more likely to take less than a full week when they do go on vacation.\n\"The partial week [vacation] is gaining in popularity,\" says Denis.\nThe good news is that even short vacations can help reduce stress, at least according to small studies.\n\"Some of the benefit of a short vacation depends on what you actually do when you're away,\" says Susan Krauss Whitbourne, a professor emerita of psychology at the University of Massachusetts Amherst. She writes about the emotional benefits of vacation.\nSo, if you're vacation-deprived this summer, it may not be too late. Consider a short trip. Here are some tips for getting the most out of your getaway, from people who study — or practice — the art of vacation.\nPlan in advance\n\"When you have a short amount of time, you've got to be on top of your game in planning activities,\" says Whitbourne. Check out restaurants, sights and events in advance, and have a road map for your trip. Agree on activities with your travel mates, and book tickets and reservations. Otherwise you may waste precious time in debating each day's activity.\nTalk to the people you love\nIf you plan a getaway with your partner, focus on deepening your ties. In one small study published in Stress & Health, researchers kept tabs on a bunch of vacationers who took a four- to five-day trip with their partner. The results showed people felt more relaxed and had more positive feelings when they engaged in conversations and in fun activities with their partners.\nDetach from work\nThe line between work and leisure time is blurred by our constant use of technology. The Stress & Health study found that people who kept working during vacation were more likely to feel down when they got back.\nBart Lorang, CEO of technology company Full Contact, is so convinced of the value of vacation, he offers a $7,500 incentive to employees to take one. The only catch? They must go completely off the grid.\n\"They can immerse themselves completely in a new experience without feeling tethered to anything work-related,\" Lorang says. \"Most employees come back feeling refreshed and recharged, ready to jump back into their responsibilities with a fresh perspective.\"\nUnplug, like, really unplug\nDespite best intentions, technology makes it incredibly easy to peek at what's happening at work. Vacation pros don't let that happen.\n\"I delete all business apps, email account apps, social apps and news apps from my phone and tablet,\" says Lorang. He says when he goes on vacation, \"I load up on e-books and music, and sometimes I'll even hand over my device to my wife to avoid checking anything prior to leaving.\"\nTo force herself to truly unplug, Jenny Radesky, a pediatrician at the University of Michigan, has used this out-of-office reply: \"I am away from the office and my children have made me promise that I won't check e-mail.\"\n\"People replied and said they loved it!\" Radesky says.\nTry something out of the ordinary\nThink of vacation as a growth opportunity. A few days of margaritas on the beach may be fun, but \"vegging on the beach doesn't have the same kind of psychological impact as exposing yourself to some new activities,\" says Whitbourne. Whether it's sightseeing, learning a new skill or some other adventure, find new ways to explore your interests.\nGet the whole family on board\nSetting expectations and ground rules for a trip can help prevent squabbling. Radesky says agreeing to limit the use of mobile devices can help.\n\"Checking e-mail, news, social media can generate stress responses in us that we could certainly take a break from while on vacation,\" she says.\nBut she says on her family vacations, she doesn't insist on a technology black-out because tech can bring families together, too. For instance, she says, on her summer vacation: \"My kids and their cousins took funny slow-motion videos on my phone for a half an hour and laughed their heads off.\" While the kids were having fun with the videos, this gave her time to have a good conversation with her mom and sister.\nBlock your calendar early\nMost people aren't great about planning, but try this: Before this summer is over, block out time on your calendar for a vacation in summer 2019.\n\"If you block the calendar, you give yourself an opportunity to take vacation,\" says Denis of the U.S. Travel Association's Project: Time Off. This simple act sets the planning process in motion.\nSurvey research shows that managers want to approve vacation, so you may be more likely to get approval if you act early. Also, you'll have more time to dream about your vacation. And anticipation is part of the fun.\nIt might even be good for your career. A survey from the U.S. Travel Association finds people who take most or all of their vacation time are slightly more likely to get promotions and raises compared to people who take less vacation time.\nOne interpretation: Vacations help prevent burnout, and workers return from a break feeling more creative and productive.","url":"https://www.npr.org/sections/health-shots/2018/08/20/639551037/vacation-days-piling-up-heres-how-to-get-the-most-out-of-a-short-vacation"}
