{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:51:17","date_modify":"2018-10-30 22:51:17","date_publish":"2016-12-22 00:40:14","description":"“I made the worst mistake of my life.” “I had a drug and alcohol problem.” “I was just a kid with low self esteem and felt hopeless.” Those are the words","filename":"data/vaneerConsumption/GovBrownforgivesmorefelonsinpast6yearsthanwerepardonedinprevious30.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/ChristmasPardonsPhoto-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939877.html","title":"Gov. Brown forgives more felons in past 6 years than were pardoned in previous 30","title_page":"Gov. Brown forgives more felons in past 6 years than were pardoned in previous 30 | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"“I made the worst mistake of my life.”\n“I had a drug and alcohol problem.”\n“I was just a kid with low self esteem and felt hopeless.”\nThose are the words people convicted of felonies in California wrote to Gov. Jerry Brown in recent years, asking him to pardon their crimes. Their clemency applications describe bad decisions and reckless adolescences, lives of poverty and addiction. Drug deals. Accidental shootings. Drunken driving.\nBut they also show transformation through hard work, self-reliance and a devotion to living clean. Steady jobs. Responsible parenting. Sobriety.\nThey’re the kind of letters Brown has likely been reviewing in recent weeks as he prepares for his Christmastime tradition of granting pardons to felons who have served their sentences and stayed crime-free for at least a decade. The fourth-term Democratic governor has pardoned more felons than any governor in recent state history, bringing back a custom that faded during the tough-on-crime politics of the 1990s.\nWith the 112 pardons his office announced the day before this Christmas Eve, Brown has granted more than 850 pardons since 2011, many for drug crimes—a stark contrast to his recent predecessors. Between 1991 and 2010, three California governors granted a total of just 28 pardons.\nBrown’s pattern resembles those of earlier governors from both political parties; his father Pat Brown, a Democrat, and Republican Ronald Reagan each granted a few hundred pardons.\nPardons by California governors\nThe younger Brown’s swing back in favor of mercy reflects a larger trend, also evident in Illinois, Michigan and at the federal level, said P.S. Ruckman Jr., a political scientist who edits the Pardon Power blog. He pointed out that President Barack Obama has commuted more sentences for people convicted of federal crimes than any president since Woodrow Wilson nearly a century ago.\n“The social landscape is definitely changing,” Ruckman said. “There is kind of a sea change going on, with respect to attitudes about clemency and the pardon power.”\nEven Assemblywoman Melissa Melendez—a conservative Republican from Lake Elsinore who has been critical of Brown’s progressive approach to criminal justice—isn’t complaining. “I’ve looked at who he is pardoning,” she said, “and I can’t find one particular case that jars my anger.\n“They’ve already done their time. It’s not lessening their punishment and they had to prove to the court that they are upstanding citizens and have stayed out of trouble. So I don’t view that aspect of his role as governor as being soft on crime.”\nIn California, a pardon does not erase a criminal record but restores rights people lose when convicted of a felony, such as the ability to get certain professional licenses, serve on a jury or own a gun. (A pardon is different from a commutation, which reduces a prison sentence.)\nBrown, who keeps a large Bible on the coffee table of his office, usually announces pardons at Christmas and Easter. It’s a reflection of his Jesuit training as well as a political custom that dates back at least to the 19th century. In 1868, President Andrew Johnson granted a Christmas Day pardon to everyone who could have committed treason by rebelling during the Civil War. Christmastime amnesty became more common in the late 1800s and early 1900s, Ruckman said, when prison wardens would make lists of inmates who should be freed on the holiday.\nThe large number of pardons for Brown, who declined to comment for this story, follows an earlier spike in incarceration, which eventually led to more felons who could ask for a pardon. But his actions also are consistent with his liberal stance on other criminal justice matters. Most recently, he backed Proposition 57 to give more nonviolent offenders a shot at parole.\nVoters approved it in November, two years after they passed Prop. 47, which converted some felonies to misdemeanors. Passage of both measures demonstrates voters’ leniency toward people convicted of drug crimes, also a common theme in Brown’s pardons.\nLast year on Christmas Eve, Brown pardoned actor Robert Downey Jr. for narcotics crimes he committed in the 1990s—a move that was criticized by some because Downey had donated money to Brown’s re-election campaign and a charter school he founded. This year, Downey and his wife gave $70,000 to Brown’s campaign for Prop. 57.\nBut celebrities and political donors are not the norm among the criminals Brown has pardoned. Most are regular people who say in their applications to Brown that a pardon will allow them to get a better job, go hunting or volunteer in a school.\n“I would like to be able to get a passport,” wrote Kerry Cassidy, who did a year in prison for manufacturing drugs and was pardoned in 2013.\n“I want to be able to vote again,” wrote Alan Michael Sanders, who was pardoned in 2012 and served eight months in prison for possession of cocaine for sale. Though California state law allows felons who are not in prison to vote, Sanders needed the pardon to be able to vote in the state where he now lives.\nIt’s an example of the “collateral consequences” of a felony record that ripple through society, said Gabriel J. Chin, a law professor at UC Davis. If felons can’t rent an apartment or obtain professional licenses, he said, it makes it harder for them to support themselves and stay away from crime.\n“Obviously if somebody has been convicted of real estate fraud then maybe they shouldn’t be allowed to be a real estate agent. But should they not be allowed to have a license as a barber or a taxi driver? That’s very different,” Chin said.\n“Is America the land of second chances, or if somebody does something when they are…19 or 20, are they still going to be under this shadow when they’re 80?”\nCorrection: This story was updated on Dec. 28 to correct the description of Proposition 47.","url":"https://calmatters.org/articles/gov-brown-forgives-more-felons-in-past-6-years-than-were-pardoned-in-previous-30/"}
