{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:23","date_modify":"2018-10-30 22:13:23","date_publish":"2016-09-28 12:01:42","description":"Governor Jerry Brown (D) vetoed a bill that would have allowed California sheriffs to raise the price of obtaining a concealed carry permit.","filename":"data/vaneerConsumption/GovBrownVetoesBillThatWouldRaisePriceofConcealedCarryPermit.json","image_url":"https://media.breitbart.com/media/2016/05/concealed-carry-class-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_28__1540937603.html","title":"Gov. Brown Vetoes Bill That Would Raise Price of Concealed Carry Permit","title_page":"Gov. Brown Vetoes Bill That Would Raise Price of Concealed Carry Permit","title_rss":"NULL","source_domain":"breitbart.com","text":"On September 26, Governor Jerry Brown vetoed a bill that would have allowed California sheriffs to raise the price of obtaining a concealed carry permit.\nCurrent law prohibits sheriffs from charging more than $100. The vetoed bill would have removed that limit.\nAccording to the Sacramento Bee, Assembly Bill 450 was put forward following a June report that Sacramento County Sheriff Scott Jones, a Republican, was issuing a large number of licenses. AB 450 was sponsored by Assemblyman Kevin McCarty (D-Sacramento), who said he wanted to “limit the number of licenses” because Sheriff Jones was passing them out like “candy on Halloween.”\nBrown vetoed the bill, claiming complaints about one county do not justify new rules for the whole state. Brown said, “This bill was spurred by a local dispute in one county. I am unaware of a larger problem that merits a statewide change at this time.”\nBut Brown did sign another gun control bill Monday, one that requires “gun owners and law enforcement officers” to lock up their guns if they leave them in a car. Senate Bill 869 “requires that anyone leaving a handgun in a vehicle lock it in the trunk or a locked container out of plain sight, or face a $1,000 fine.”\nThe Orange County Register notes that SB 869 was pushed as a response to the July 2015 shooting death of Kate Steinle, who was shot and killed by an illegal alien in the sanctuary city of San Francisco. Lawmakers responded to her death not by ending the city’s sanctuary status, but by requiring law-abiding citizens and law-enforcement officials to lock up their guns.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/09/28/governor-brown-vetoes-bill-that-would-raise-price-concealed-carry-permit/"}
