{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:28:56","date_modify":"2018-10-30 21:28:56","date_publish":"2014-11-07 14:55:00","description":"Gov. Bobby Jindal (R) has joined legislators in Louisiana in a lawsuit that alleges the state’s education officials did not comply with state law when |","filename":"data/vaneerConsumption/GovBobbyJindalJoinsLouisianaLawmakersinCommonCoreLawsuit.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Governors/Republicans/Bobby-jindal-scolding-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_11_07__1540934936.html","title":"Gov. Bobby Jindal Joins Louisiana Lawmakers in Common Core Lawsuit","title_page":"Gov. Bobby Jindal Joins Louisiana Lawmakers in Common Core Lawsuit | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Gov. Bobby Jindal (R) has joined legislators in Louisiana in a lawsuit that alleges the state’s education officials did not comply with state law when they began implementing the Common Core standards.\nAccording to a press statement released by Jindal’s office, he is joining a lawsuit that will require the Louisiana Department of Education and the state’s Board of Elementary and Secondary Education (BESE) to comply with the Louisiana Administrative Procedures Act (APA).\n“Under the law, the standards should have been advertised to the public to give parents and community members an opportunity to see the standards and comment on them as state standards were promulgated in previous years,” the press release states. “However, the APA was ignored and the standards were not advertised.”\nAs Breitbart News reported in August, the 17 legislators who filed the lawsuit had their request for a temporary block to implementation of the Common Core standards rejected by a state district judge.\n“We have always supported the goal of this suit, which is requiring that the Louisiana Department of Education and BESE follow the law,” said Jindal, according to the press release. “The Louisiana Department of Education and the Board of Elementary and Secondary Education should have followed proper administrative procedure before attempting to implement these one size fits all federal standards, and we believe the court will come to that conclusion in upcoming hearings.”\n“There is growing dissatisfaction with Common Core and we will continue to support every effort to halt the federalization of curriculum in Louisiana schools,” Jindal added. “Education is best left to local control – which is why we will continue fighting to get Common Core out of Louisiana.”\n“We are very pleased to have the Governor join our efforts,” state Rep. Brett Geymann (R) told Breitbart News. Geymann is a plaintiff in the lawmakers’ lawsuit and a leader among those legislators who are opposed to the Common Core standards.\n“Parents were denied the democratic process on something so important as the education of their children,” he added. “With the help of the administration, we are very confident the people will win because it is clear the Department of Education violated the law.”","url":"https://www.breitbart.com/politics/2014/11/07/Gov-Bobby-Jindal-Joins-Louisiana-Lawmakers-in-Common-Core-Lawsuit/"}
