{"authors":["Ken Klukowski"],"date_download":"2018-10-30 21:41:37","date_modify":"2018-10-30 21:41:37","date_publish":"2018-08-28 14:37:46","description":"Arizona Gov. Doug Ducey will appoint a successor to Sen. John McCain in the Senate, and five candidates are reportedly on his short list.","filename":"data/vaneerConsumption/GovDougDuceyMullingOverSuccessortoSenJohnMcCain.json","image_url":"https://media.breitbart.com/media/2018/08/John-McCain-profile-looking-up-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_28__1540935697.html","title":"Gov. Doug Ducey Mulling Over Successor to Sen. John McCain","title_page":"Gov. Doug Ducey Mulling Over Successor to Sen. John McCain","title_rss":"NULL","source_domain":"breitbart.com","text":"Arizona Gov. Doug Ducey will soon appoint a successor to fill the Senate seat of the late iconic Sen. John McCain and reportedly has five candidates on his short list, some of whom would be safer than others where important issues like the Kavanaugh Supreme Court confirmation and various major national priorities are concerned.\nDucey is a moderately conservative first-term Republican who is currently in a re-election battle, with some polls showing him under 50 percent approval but facing a Democrat opponent who has staked out far-left positions such as opposing border enforcement, which provides Ducey a viable path to a second term.\nMcCain was re-elected in 2016 to another six-year term in the Senate, one-third of which is now past. The Seventeenth Amendment to the Constitution empowers each state to pass legislation to determine how to fill the remainder of a U.S. Senate term if one of the state’s two Senate seats opens up mid-term.\nUnder Arizona law, the governor appoints senators when there are vacancies, and an appointment made in September 2018 will last two years until the November 2020 election, at which point, that senator could run for the final two years of McCain’s original six-year term.\nDucey’s choice of whom to appoint could become the single-largest issue in the gubernatorial campaign, as early voting for the general election in Arizona begins roughly 30 days from when the governor is expected to announce McCain’s replacement. (The governor is expected to make the appointment during the first week of September, after McCain is laid to rest at the U.S. Naval Academy in Annapolis, Maryland.)\nAccording to sources in Arizona, Ducey is looking for someone who can hit the ground running in the Senate, then successfully run in 2020 to hold the Senate seat and consider running in 2022 for a full six-year term.\nWhile various names are being floated in the media, these sources say Ducey is looking at five individuals:\nCindy McCain, the widow of the late senator. She has 100 percent name recognition in the Grand Canyon State. However, her views on issues are considered more Democrat than Republican, including immigration, abortion, the LGBT agenda, the Second Amendment, and a host of fiscal and economic issues as well.\nConservatives insist naming her to the seat would cause Ducey’s support to collapse among his base and cost him re-election, as Republicans could not assume they would have her vote even for Brett Kavanaugh’s Supreme Court nomination or other judicial appointments.\nEileen Klein. The former chief of staff to former Gov. Jan Brewer — who was a moderate Republican — Klein is a relative newcomer to the political scene and has never held elected office. She lacks both gravitas and conservative bona fides, causing one leading Arizona conservative, who spoke with Breitbart News off the record because of his proximity to the governor, to say, “I’ve never gotten the vibe from her that she’s one of us.” This makes her a politically risky choice for Ducey, as the new senator would have to weigh in quickly on a host of hot-button issues, where rejecting conservative positions would immediately imperil the governor’s prospects.\nThe remaining three short-listers have all served in Congress previously.\nFormer Rep. John Shadegg. An eight-term congressman, Shadegg boasts an essentially perfect conservative record on all three major policy areas: economic, social, and national security. Age 68, he currently works as an attorney in Phoenix, Arizona, and has considered a Senate run in the past.\nFormer Rep. Matt Salmon. A five-term congressman, Salmon has, like Shadegg, similar conservative credentials from his time in office, including an A+ rating from the National Rifle Association and a 100 percent pro-life rating. Age 60, he is currently a vice president at Arizona State University and has also contemplated running for the Senate.\nFormer Sen. Jon Kyl. A three-term senator, Kyl is well-respected in D.C. and in the national GOP and is currently shepherding Judge Kavanaugh’s nomination through the Senate. But at age 76 and having already retired once from the Senate, Kyl would likely be a caretaker of the seat for the next two years but would not be expected to run in 2020 or beyond.\nAny of those three lawmakers are considered very safe choices for the Senate and would energize Ducey’s base.\nTwo other women mentioned by various sources as possible dark-horse candidates are GOP donor Barbara Barrett and economic developer Karrin Robson, but Arizona experts opine that both of them lack the stature to meet Ducey’s criteria and also question how effective they would be in the Senate, never having operated in national politics at a high level.\nThere are reportedly two other Republican state lawmakers who would normally be considered: former Arizona House Speaker Kirk Adams and current Arizona House Speaker J.D. Mesnard, both conservatives.\nHowever, Adams is currently Ducey’s chief of staff, so strategists say it could be politically problematic for Ducey to install him in the Senate during the gubernatorial campaign.\nAs for Mesnard, he is an evangelical Christian and a darling of Arizona conservatives. But at age 38, they believe his time is not now and, instead, look at him as a future statewide leader in Arizona.\nThe U.S. Senate could not be more closely divided right now at 50-49. Ducey faces the defining decision of his governorship, and with the implications for the nation, all eyes will be on Phoenix next week.\nKen Klukowski is senior legal editor for Breitbart News. Follow him on Twitter @kenklukowski.","url":"https://www.breitbart.com/politics/2018/08/28/john-mccain-gov-ducey-mulling-successor/"}
