{"authors":[],"date_download":"2018-10-30 00:53:25","date_modify":"2018-10-30 00:53:25","date_publish":"2014-11-17 09:00:00","description":null,"filename":"data/vaneerConsumption/GovernorsUnderSeige.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/themes/amspec-v1/_img/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860805.html","title":"Governors Under Seige","title_page":"Governors Under SeigeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The math looks good. Very good. One can presume that when the American people head to the polls this November, the GOP will hold the House and perhaps strengthen its majority there. The Senate is a tantalizing six seats from Republican control, and Republicans have twelve prospects. In three red states—Montana, South Dakota, and West Virginia—strong, experienced, Republican candidates are running ahead of second and third-string Democrats. In another four states that voted for Romney—Louisiana, Arkansas, North Carolina, and Alaska—first-tier Republicans are challenging incumbents who vote in lockstep with Obama. And in another five states—Iowa, Colorado, Oregon, Michigan, and New Hampshire—particularly strong Republican candidates could upset seemingly stronger opponents.\nRepublicans now have majorities in both chambers of the legislature in twenty-eight states, while Democrats fully control only seventeen. Come November, Republicans have a good shot at seizing control of the West Virginia House, the New Hampshire House, the Iowa Senate, and the Oregon House and Senate. There are no likely pickups for the Dems in state legislative bodies.\nAll that good news aside, forward-thinking conservatives would be well advised to consider how their opponents see the chessboard. Nationwide resources are flowing into two unlikely governors’ races in Kansas and Wisconsin.\nWhy those two states? Kansas has an overwhelmingly Republican state legislature. In Wisconsin, Democrats organized recall elections for a host of state-level Republicans, including Governor Scott Walker, but the effort failed for the most part. Democrats trying to tackle Wisconsin looks, from the national level, like Sisyphus taking one more crack at rolling the rock uphill.\nBut the left is evil, not stupid. There is a big difference. Democrats are wisely targeting the two most dangerous Republicans running for office in 2014. Kansas Governor Sam Brownback has passed legislation that will phase out the state income tax. The tax rates were 6.45 percent, 6.25 percent, and 3.5 percent before his two tax cuts. They stand to phase down to 3.9 percent and 2.3 percent by 2018. After that point, every year that state tax revenues increase by more than 2 percent, income tax rates will be automatically ratcheted down until they reach zero. After that, the corporate tax rate similarly phases to zero.\nZero. No more income tax. No other votes are needed. Just time and a post-Obama rate of normal economic growth. Kansas once had the second highest income tax among its four neighboring states. Soon it will match the rate in Texas and Florida: zero.\nKansas is the model for a dozen other states flirting with phasing out their income taxes. Tying future rate reductions to incoming revenue from growth is the perfect strategy. No huge tax cuts are called for in any given year. Democrats had always seen revenue from growth to be their own personal piggy bank. Now growth is the taxpayer’s friend. Already North Carolina is heading in this direction. The top tax rate has been reduced from 7.75 percent to 5.8 percent. As in Kansas, the rates will continue to fall automatically to 3 percent as revenues increase over time. Next year Phil Berger, president pro tem of the state senate, plans to pass a law putting North Carolina on the road to zero personal and zero corporate income taxes. South Dakota, Nebraska, Arizona, Oklahoma, and Louisiana have all shown signs of wanting to head this way, too.\nHence the attacks on Governor Brownback. His opponents know that it will work, and they fear that governors in other states will adopt the same tactic. State Senator Laura Kelly has claimed that Kansas will be short $1 billion over the next four years. But real projections suggest that the state need only reduce spending or even reallocate existing tax dollars by a total of $315 million over the next few years: an easy fix. (One often done by previous Democratic administrations, we might add.) But Kelly and her allies in the lefty media are not bound by actuarial reality.\nIf Brownback were defeated it would slow the drive to add a dozen states to the march toward zero income taxes. This would reduce the pressure on Illinois, California, and New York to reform their own spending so as to compete with low or no-income tax states.\nScott Walker has long had a target stapled to his back for the same reason. His decision to reform public sector unions hurts progressives where it counts (which is to say, in the pocket book) and frees up state and local officials to spend money more efficiently.\nStates control the unionization rules for all non-federal public sector employees. The National Labor Relations Board—whose members at this point have all been appointed by Obama—writes the rules for private sector unions. When Walker signed Wisconsin’s Act 10 in 2011, he presented a template to the twenty-four states that Republicans control. Act 10 abolished tenure for teachers. It made union membership voluntary and forbade mandatory withholding of union dues from workers’ paychecks. Now, if the union wants its $1,000 from a teacher earning $50,000 in wages (the standard 2 percent of salary), it must ask for it. Workers can say, “No, thank you.” Unions cannot negotiate on pensions or benefits or workplace rules: just wages. And wages can only be negotiated up to the rate of inflation. Anything higher must be approved by a referendum of the people in the affected town, city, or school district.\nEvery year each union must “recertify”—meaning its members must vote to continue the union. If a majority of the union’s members (not a majority of the votes) do not cast “yes” ballots, then the union disappears. This is a significant hurdle, since most unions today are filled with people who never once voted to put a union in place.\nIt is estimated that over 100,000 public-sector workers in Wisconsin have chosen to leave a union. Union dues have fallen by millions of dollars. If this were to happen in twenty-four red states, organized labor and its friends in the Democratic Party would lose billions of dollars. Half of all union members work in the public sector. Meanwhile, many in private sector unions work in industries Tom Steyer and Barack Obama wish to destroy—or at leave move offshore.\nAlready things are picking up. Louisiana, Florida, Idaho, and Indiana have abolished tenure for public school teachers. Michigan and Alabama have banned the withholding of union dues. But in Pennsylvania and Florida, GOP majorities in the House and Senate have balked at following suit. Some are terrified of union bosses; others feel beholden to them.\nWhen Walker and his legislature are re-elected this fall, now for the third time, it will be a powerful signal that it is safe to go the full monty against the abuse of government workers at the hands of unions. In Wisconsin, even liberal Democratic mayors have all taken advantage of their newfound flexibility under Act 10 and reformed their own governments.\nWins in Kansas and Wisconsin will clear the way for further victories in dozens of states and cities liberated from union control.\nSo the Democrats are very smart to be fighting. If they win, they buy precious time, perhaps allowing the courts to change the rules. To lose in November is their doom.","url":"https://spectator.org/61021_governors-under-seige/"}
