{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:34:39","date_modify":"2018-10-30 19:34:39","date_publish":"2015-06-30 23:46:29","description":"Governor Jerry Brown signed SB 277 into law on Tuesday despite every effort on the part of thousands to halt a legislative push making California one of the three most restrictive states on childhood vaccines in the United States.","filename":"data/vaneerConsumption/GovernorJerryBrownSignsSB277MakingCAOneofStrictestChildVaccineStates.json","image_url":"https://media.breitbart.com/media/2015/03/vaccinating-young-girl-AP-Photo-Toby-Talbot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_30__1540928079.html","title":"Governor Jerry Brown Signs SB 277 Making CA One of Strictest Child Vaccine States","title_page":"Governor Jerry Brown Signs SB 277 Making CA One of Strictest Child Vaccine States | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Governor Jerry Brown signed SB 277 into law on Tuesday despite every effort on the part of thousands to halt a legislative push making California one of the three most restrictive states on childhood vaccines in the United States.\nSB 277 eliminates the choice of parents to opt a child out of one or more doses of vaccine as a condition of enrollment in either public or private school in the state.\nHeavy opposition steadily grew as the bill faced heated debate in the State Senate, stalling for a short time in the Senate Education Committee. After amendment allowing the bill to bypass a potentially troublesome Appropriations hearing, the bill passed on the Senate floor 25-11.\nDemocrats were particularly divided in the ranks that make up a hefty majority in both the State Assembly and Senate.\nBusses of concerned parents, their children, and other bill opponents rode into Sacramento for the Assembly Health Committee hearing. It was the only public hearing in the Assembly. A sea of red flowed through Assembly halls with opponents numbering at least in the many hundreds, each waiting to voice their opposition to legislators. In an uncharacteristic vote in the bill’s journey, Republicans and Democrats voted down party lines, Democrats pushing the bill forward.\nSB 277 passed the Assembly 46-31 with legislators all over the map; Democrats and Republicans fell on both sides of the aisle. However, the Democrat controlled Assembly passed the bill, pushing it back to the Senate due to a slight amendment.\nThe Senate again passed the bill, but with a different vote count than prior passage. The final Senate vote Monday, June 29, was 24-14. Previously it had been 25-11.\nGovernor Jerry Brown signed the bill Tuesday morning despite calls for him to veto. Brown said, “The science is clear that vaccines dramatically protect children against a number of infectious and dangerous diseases. While it’s true that no medical intervention is without risk, the evidence shows that immunization powerfully benefits and protects the community.”\nMuch of the argument from opponents has related to parental rights. Many opponents have voiced their belief in vaccinating and that they do vaccinate their own children; however, they have held concern over the government making medical decisions for their children on condition of school enrollment. Others choose not to vaccinate, and some cite vaccine injury as their reasoning.\nOpponents of the bill have called for recalls of some legislators involved in pushing passage of SB 277. Strong efforts were also made to petition Brown to veto the legislation, garnering over 80,000 signatures as of Tuesday. The petition also calls for a veto of SB 792 and AB 1117.\nA seperate Change.org petition to veto had over 8,500 signatures as of Tuesday. Another Change.org petition had over 380 signatures.\nBill opponent and Golden Globe winning actress Jenna Elfman tweeted upon passage of SB 277:\n#SB277 Here’s a tiny dose of what I have to say about it. It’d be appreciated if u sign the petition in the article. https://t.co/33PYRmhzMJ — JENNA ELFMAN (@JennaElfman) June 28, 2015\nBreitbart News interviewed Elfman at an SB 277 opposition and parents’ rights rally outside the 2015 California Democratic Party Convention in Anaheim, California. She remarked that she vaccinates her children, but believes strongly in a parents’ right to make health decisions for their own children.\nA crop of vaccine legislation has flowed through the California legislature following a measles outbreak that began at Disneyland in Anaheim, California last December. Debate has circled around whether a bill such as SB 277 would have had any effect on the outbreak’s spread.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/06/30/governor-jerry-brown-signs-sb-277-making-ca-one-of-strictest-child-vaccine-states/"}
