{"authors":["Jim Zarroli"],"date_download":"2018-10-22 21:33:45","date_modify":"2018-10-22 21:33:45","date_publish":"2016-12-13 00:00:00","description":"Turning over Trump's business empire to his grown children to run wouldn't resolve the conflicts of his interest his presidency faces, U.S. officials say.","filename":"data/vaneerConsumption/GovernmentEthicsOfficeSaysTrumpShouldDivestHimselfOfHisBusinesses.json","image_url":"https://media.npr.org/assets/img/2016/12/13/ap_16344094213629_wide-e3864834ebe8777fd128f2e422976c8367f3ee71.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_12_13_505476925_government-ethics-office-says-trump-should-divest-himself-of-his-businesses_1540244025.html","title":"Government Ethics Office Says Trump Should Divest Himself Of His Businesses","title_page":"Government Ethics Office Says Trump Should Divest Himself Of His Businesses : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Government Ethics Office Says Trump Should Divest Himself Of His Businesses\nEnlarge this image toggle caption Charlie Neibergall/AP Charlie Neibergall/AP\nPresident-elect Donald Trump should divest himself of his vast business interests in order to avoid conflicts of interest while in the White House, according to a letter from the U.S. Office of Government Ethics.\nMoreover, transferring ownership of his businesses to his grown children wouldn't go far enough to address the conflicts, the letter said.\n\"Transferring operational control of a company to one's children would not constitute the establishment of a qualified blind trust, nor would it eliminate conflicts of interest\" under federal statutes governing conflicts of interest, said the letter, written by OGE Director Walter M. Shaub, Jr.\nThe letter was written in response to questions from Democratic Sen. Tom Carper of Delaware, ranking member of the Senate Homeland Security and Governmental Affairs Committee, who wrote:\n\"The full extent of his financial interests remains unclear, in part because he was the first presidential candidate in modern history to decline to release his tax returns to the American public. These unique circumstances raise important questions about how the Administration of President-elect Trump will avoid conflicts of interest and ensure integrity of executive branch programs and operation.\"\nWith his vast network of licensing deals, golf courses and commercial real estate, Trump and his family stand to profit from his presidency to an unprecedented degree. Virtually any decision Trump makes could affect part of his domestic or international business empire.\nA federal statute bars executive branch employees, including cabinet officials, from participating in any decision that would affect their financial interests or those of their family and business partners.\nShaub noted that the statute does not apply to the president and vice president, as Trump himself has pointed out.\n\"Nevertheless, it has been the consistent policy of the executive branch that a President should conduct himself 'as if' he were bound by this financial conflict of interest law,\" Shaub wrote. He added:\n\"Given the unique circumstances of the Presidency, OGE's view is that a President should comply with this law by divesting conflicting assets, establishing a qualified blind trust, or both.\"\nShaub noted that his office has no power to force Trump to divest, but said \"every President in modern times has adopted OGE's recommended\napproach.\"\nTrump was supposed to hold a press conference this Thursday promising to explain how he would address the conflicts, but cancelled it this week. Instead he said an announcement would come on the subject in January.\nDuring the campaign, Trump said he would turn over business operations to three of his grown children and promised to have nothing to do with his companies. He repeated that promise this weekend.\nBut lawyers who specialize in government ethics say that wouldn't begin to resolve the conflicts Trump's presidency poses.\nThe OGE has already made its voice heard on the issue of Trump's businesses. It released an unusual series of tweets earlier this month encouraging Trump to divest.\nHere is the full letter written in response to Carper:","url":"https://www.npr.org/2016/12/13/505476925/government-ethics-office-says-trump-should-divest-himself-of-his-businesses"}
