{"authors":["Associated Press"],"date_download":"2018-10-22 20:17:41","date_modify":"2018-10-22 20:17:41","date_publish":"2016-01-29 01:03:15","description":"SACRAMENTO, Calif. (AP) — Gov. Jerry Brown is betting that the pendulum has swung from the days when Californians fed up with high crime rates approved the n...","filename":"data/vaneerConsumption/GovernorhopesCalifornianstoughviewsoncrimehaveeased.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421831_Governor-hopes-Californians-tough-views-crime-eased_1540239461.html","title":"Governor hopes Californians' tough views on crime have eased","title_page":"Governor hopes Californians' tough views on crime have eased | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Governor hopes Californians' tough views on crime have eased\nSACRAMENTO, Calif. (AP) — Gov. Jerry Brown is betting that the pendulum has swung from the days when Californians fed up with high crime rates approved the nation's harshest three strikes law and other get-tough measures.\nThe Democratic governor announced this week that he will ask voters to reverse a 2000 ballot measure that let prosecutors send juveniles as young as 14 directly to adult court. In addition, the proposed measure would further soften the 1994 three strikes law and weaken victims' rights laws approved by voters as recently as 2008.\nMore recently, voters have been willing to ease criminal penalties. They reduced penalties for some drug and property crimes in 2014 and in 2012 required that a third conviction that can send a criminal to prison for life must be a violent or serious felony.\nBrown's proposal is in line with what voters have approved in recent years, said Lizzie Buchen, an advocate with the reform group Californians United for a Responsible Budget, who thinks Brown's proposals don't go far enough.\n\"This is something that's happening around the nation, reducing our incarcerated population,\" she said.\nBrown has $24 million in campaign funds he can spend this year. Pollsters said Brown also could benefit from several trends in public opinion as he promotes the plan to reduce sentences and cut the prison population to comply with a federal court order.\nA Public Policy Institute of California poll released Wednesday found a 7 percentage-point drop in the past year in Californians who perceive violence and street crime as a problem in their communities.\nAnd following a year of nationwide protests drawing attention to police treatment of minorities and the high-profile shootings of several unarmed black men, the percentage of Californians who think the justice system is biased against blacks and other minorities increased 6 percentage points, the poll found.\n\"Californians seem to be in a frame of mind of reforming the criminal justice system,\" said PPIC President and CEO Mark Baldassare.\nBrown may also benefit from the public's interest in reducing prison spending, said Field Poll Director Mark DiCamillo.\nOn the other hand, \"there is this fear and apprehension that I think still exists,\" DiCamillo said. \"The public does fear that releasing people early will result in more crime.\"\nMichael Rushford, president of the conservative Criminal Justice Legal Foundation, expects their fear will climb this year, driven by rising crime rates, even as Brown rallies support ahead of the November election.\nMore criminals already are on the streets because of Proposition 47, the sentence-softening measure approved by voters two years ago, and Brown's realignment of the state prison system that sends lower-level offenders to crowded county jails, said Rushford, who opposes Brown's proposal.\nThe initiative Brown will take to voters would let nonviolent offenders request parole earlier and would increase credits for time served for inmates who complete rehabilitation programs behind bars.\nThat could negate the state's longstanding policy of longer sentence \"enhancements\" for things such as prior crimes or using a gun, among many others.\n\"The whole idea behind these previous, earlier laws was to identify and separate out habitual felons,\" Rushford said. \"We're talking about serious criminals with serious priors that no one in their right mind would let out.\"\nHe predicted the policy change is unlikely to save money long-term if violence increases and offenders return to prison for more serious crimes.\nBrown is backing an amended initiative that focused on young offenders when it was introduced last month by a coalition of reform groups including Vote Safe.\nVote Safe Director Lenore Anderson, who led the successful drive to pass Proposition 47 two years ago, believes voters want reforms that will stop the cycle of crime.\n\"Voters have spoken very loud and clear that they want to stop wasting billions of dollars on ineffective policies,\" she said.\nSenate President Pro Tem Kevin de Leon, D-Los Angeles, said Brown is wise to collect the more than 585,000 signatures he needs to qualify an initiative instead of seeking the two-thirds vote needed in the Legislature to put the measure on the ballot.","url":"https://www.dailymail.co.uk/wires/ap/article-3421831/Governor-hopes-Californians-tough-views-crime-eased.html"}
