{"authors":["Damian Thompson For The Daily Mail"],"date_download":"2018-10-22 20:25:24","date_modify":"2018-10-22 20:25:24","date_publish":"2016-01-29 01:31:04","description":"UK teenagers are troubled enough without ideological prodding from academics who wish to ‘deconstruct' the natural assumption they are male or female, writes DAMIAN THOMPSON.","filename":"data/vaneerConsumption/Governmentsurveyasking13yearoldstopickfrom25genders.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/02E11FD60000044D-0-image-a-7_1454031030605.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3422060_Gender-madness-Trans-girl-Demi-boy-Inter-sex-Government-survey-asking-13-year-old-s-pick-25-genders-absurd-dangerous_1540239924.html","title":"Government survey asking 13-year-old's to pick from 25 genders","title_page":"Government survey asking 13-year-old's to pick from 25 genders | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Try to imagine a world populated by teenagers who are neither boys nor girls but have three genders at once: they are male, female and androgynous, making them ‘tri-gender’.\nOther young people are known as ‘demi-boys’ and ‘demi-girls’. Some drift between genders in a variety of ways. Some are ‘bi-gender’; still more are ‘trans-girls’ and ‘trans-boys’, while yet another tribe identify themselves as ‘gender fluid’.\nThis sounds like the stuff of science fiction. In fact, every term I’ve just used comes from a questionnaire that the British Government planned to submit to children aged 13 to 18 as part of a research project sponsored by the Department of Education via the £2.9 million-a-year office of the Children’s Commissioner for England.\nA new questionnaire that the British Government planned to submit to children aged 13 to 18 as part of a research project sponsored by the Department of Education gives them the option of 25 genders\nUntil this week, you could find the questionnaire by visiting the website of the taxpayer-funded Commissioner, Anne Longfield OBE.\nA former charity boss, Longfield was appointed by Nicky Morgan, whom David Cameron made Education Secretary when, before the election, he moved Michael Gove from the post in order to placate the teachers’ unions.\nThe choice struck me at the time as an exercise in gender box-ticking. Morgan is a politician of immense self-belief but limited talents. But, no doubt about it, she is a woman.\nIt is inconceivable that Gove — now Justice Secretary and Lord Chancellor — would have allowed the Government to pay for a ‘research project’ that asks children to choose between 22 gender identities (25 if you count ‘not sure’, ‘rather not say’ and ‘others, please state’).\nOn Wednesday, the questionnaire — which also asks children whether they feel safe using single-sex toilets and would prefer unisex ones — mysteriously disappeared from the Children’s Commissioner’s website after the Daily Mail asked her about it.\nA spokesman said it was a draft, that the Commissioner had not cleared it and that a new version will be prepared with some of the questions withdrawn.\nToo late. Some schools have already received the questionnaire, and details of the planned research project have been published by the feminist academics from Brighton, Lancaster and Cardiff universities who have been working on it with University College London’s Institute of Education since May last year.\nNearly every sentence of the documents in which those academics stress the importance of this research is clogged with the jargon of hardline feminists and their allies in the ‘trans’ lobby.\nThat’s no surprise, given the CVs of the Leftie professors-cum-activists behind the scheme.\nOne of them, Jessica Ringrose, who is Professor of Sociology of Gender and Education at UCL, says that she teaches ‘in the areas of social justice, gender, sexuality and feminist qualitative research’.\nRingrose is the co-author of articles entitled ‘Boobs and Barbie: Feminist posthuman perspectives on gender, bodies and practice’; ‘Sexting, Ratings and (Mis)Recognition: Teen Boys Performing Classed and Racialised Masculinities in Digitally Networked Publics’; and ‘Posthuman performativity, gender and school bullying: Exploring the material-discursive intra-actions of skirts, hair, sluts, and poofs’.\nThe phrase ‘beyond parody’ comes to mind.\nOptions include ‘demi-boys’ and ‘demi-girls, ‘bi-gender’, ‘trans-girls’ and ‘trans-boys', or ‘gender fluid'. Model Ruby Rose considers herself gender fluid, while author Jack Monroe (pictured) came out as transgender\nRingrose would say that, as a journalist, I’m unqualified to judge her work. But, like her, I have a PhD in sociology and have sat through many boring right-on rants at academic conferences. Even by their standards, this is loopy feminist drivel.\nWhat’s truly depressing is that the questionnaire devised by Ringrose and colleagues was commissioned by a Conservative government.\nThere could be no clearer demonstration of the way education has been infiltrated by a new generation of feminists.\nOld-style feminists could be dreary and humourless. But, with the benefit of hindsight, we can see that they had a point about the unthinking sexism of the Sixties and Seventies. Ambitious young women at the time must have felt they were trapped in a Carry On film. Many male employers judged them by their looks or the size of their ‘knockers’, and successful women were often accused of flirting or sleeping their way to the top.\nAlso, the best of the older feminists were women of towering intellect who could wipe the floor with their opponents. The name of Dr Germaine Greer immediately springs to mind.\nThat’s the same Dr Greer who, today, finds herself disinvited from university debates — not by reactionaries but by Left- wing activists.\nWhy? Because the new ideology is utterly fixated on the minutiae of ‘gender politics’. And she holds the ‘wrong’ views on the subject that obsesses them most: the status of ‘trans’ people.\n'Germaine Greer today finds herself disinvited from university debates — not by reactionaries but by Left- wing activists because she holds the ‘wrong’ views on the subject that obsesses them most: the status of ‘trans’ people'\nThe word ‘trans’ is used as an umbrella term for people we used to refer to as transvestites (men who dress as women, and vice- versa) and transsexuals (who have had a sex-change operation).\nGreer insists that men who have been surgically changed to become women are not female at all but ‘mutilated men’. Personally, I think she makes her argument in a needlessly offensive manner.\nI used to say the same sort of thing myself — until I met a couple of women who had been born as men.\nOne of them is a musician in New York, with whom I had a delightful supper. Only afterwards did a fellow guest tell me that she’d ‘had the op’, as he put it. I was astonished.\nI consider these two people — the other a very fine poet and literary critic — as women. I refer to them as ‘she’ without even thinking about it.\nBut the fact remains that, in the U.S., only 0.3 per cent of the population refer to themselves as ‘transgender’. There’s no reliable figure for Britain. However, we’re certainly talking about a minuscule section of the population.\nWhy, then, has the concept of gender fluidity come to loom so large that the Government wants to grill teenagers about it?\nEssentially, this is a hysteria imported from the U.S. The Puritan strain in U.S. history — English Puritans, in despair at corruption in the Church of England, migrated there in the 17th century — has left the country with a propensity for doctrinaire witch-hunts.\nU.S. activists fought — and won — admirable battles for the rights of women, blacks and gay people.In the process, however, a huge industry grew up around minority rights. American universities are grossly overstaffed with ‘diversity’ officers who encourage professors and students to denounce anyone who uses ‘insensitive language’ to describe an oppressed group.\nThe same is increasingly true of British campuses, which love to copy the latest American politically correct fad.\nDon’t get me wrong: the tiny transgender minority is still vulnerable to horrible bullying and violence. But most of these crimes occur far away from well-funded campuses.\nTrans people gain nothing from the spectacle of middle-class students accusing each other with pointed fingers in the manner of a witchfinder-general or Senator Joseph McCarthy hunting out Communists in 1950s America, simply for not using the ‘appropriate’ words.\nThese ‘crimes’ are terribly easy to commit. The PC lexicon of approved terms for gender identity is long, complex and always changing.\nRight now, liberal orthodoxy demands that the 99.7 per cent of people who are happy with the sex they were born with — irrespective of whether they’re straight or gay — should call themselves ‘cis-gendered’ or ‘cis’.\nThis is derived from the Latin word meaning ‘on this side of’. It’s the opposite of ‘trans’, meaning ‘on the other side of’.\nThe prefix ‘cis’ has spread like a virus from universities to millions of ‘enlightened’ individuals via social media. Twitter loves it.\nThe tiny transgender minority is still vulnerable to horrible bullying and violence, writes Damian Thompson\nAlso in the PC phrasebook are terms such as ‘bi-gender’, ‘pan-gender’ and ‘graysexual’ — this last meaning ‘someone who is neither sexual nor asexual but somewhere in the middle’.\nThe result is a kaleidoscope of possible sexual identities. So long as you stick to the currently approved jargon, the possibilities are limitless.\nYou can choose to belong to several of these groups simultaneously. Significantly, the Government-backed questionnaire encourages respondents to tick more than one box.\nThe temptation is to dismiss such an exercise as the ultimate pointless luxury for pampered young people who have nothing more serious to worry about, and for whom such things as war, famine and civil breakdown are inconceivable.\nYet the youngsters on whom the Government tried to force this questionnaire are being fed a dangerous fiction.\nWith all due respect to trans- gender people — and they deserve as much respect as anyone — the fact remains that human gender is rarely ‘fluid’, however you define fluidity.\nTeenagers are troubled enough without ideological prodding from academics who wish to ‘deconstruct’ (to use one of their favourite words) their natural assumption that they are male or female.\nAnne Longfield is supposed to protect children from all sorts of problems, including emotional confusion. Instead, her office was planning to increase that confusion — and arguably cause distress in the minds of vulnerable adolescents — at our expense.","url":"https://www.dailymail.co.uk/debate/article-3422060/Gender-madness-Trans-girl-Demi-boy-Inter-sex-Government-survey-asking-13-year-old-s-pick-25-genders-absurd-dangerous.html"}
