{"authors":[],"date_download":"2018-10-30 14:20:38","date_modify":"2018-10-30 14:20:38","date_publish":"2016-03-23 00:00:00","description":null,"filename":"data/vaneerConsumption/Governmentexemptsitselffromtheruleseveryoneelsemustfollow.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_03_government_exempts_itself_from_the_rules_everyone_else_must_follow_comments_1540909238.html","title":"Government exempts itself from the rules everyone else must follow","title_page":"Blog: Government exempts itself from the rules everyone else must follow","title_rss":"NULL","source_domain":"americanthinker.com","text":"Politicians and Bureaucrats routinely either exempt themselves from laws they require others to follow or just ignore laws that exist. A couple recent examples are that there was a major EPA spill in Colorado where no one was held to account and hundreds of sanctuary cities just ignoring immigration laws while corporations are required to follow the laws. I believe one law that Congress exempted government entities from following has greatly harmed 100% of us: In 1974 Congress passed a very sensible law, (ERISA) The Employee Retirement Income Security Act, but it exempts government plans from the law’s requirements. The law essentially requires employers with defined benefit pension plans to properly fund the plans, to disclose the liability and to use reasonable rates of returns to calculate the proper amount that needs to currently be deposited. The result of the double standard is that for the last 40 years Trillions of unfunded, unreported liabilities have built... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/03/government_exempts_itself_from_the_rules_everyone_else_must_follow_comments.html"}
nt benefits for retirees where the proper amount wasn’t funded. The way these pension funds work dwarfs anything that Bernie Madoff may have done. Politicians’ solution for the under-funding is almost exclusively to raise taxes further jeopardizing growth in the private sector. Average annual rate of return assumption by public funds is 7.62%. Meanwhile the average actual rate of return the past decade has been 4.5%. How can anyone project that that they will earn an average of 7.62% continually when the current and projected economics growth rate is around 2%, inflation is around 2% and the ten year bond yield is around 2%? We will also have periodic recessions and periodic bear markets. The reason that politicians project higher rates of returns is so they don’t have to make high deposits. They can act like they balance their annual budget and push the problem down the road. It is very understandable that so many are disgusted with both political parties when politicians and government agencies treat themselves so much better than the common man.","url":"https://www.americanthinker.com/blog/2016/03/government_exempts_itself_from_the_rules_everyone_else_must_follow.html"}
