{"authors":["Will Martin"],"date_download":"2018-10-30 22:34:34","date_modify":"2018-10-30 22:34:34","date_publish":"2018-07-31 00:00:00","description":"According to a report from The Times on Tuesday, UK officials told Brussels that \"thousands\" of European investment funds will be under threat if the EU insists on a hardline approach to the City.","filename":"data/vaneerConsumption/GovernmentwarnsthatpunitiveapproachtoCityofLondonduringBrexitwillhurtEU.json","image_url":"https://amp.businessinsider.com/images/5af43f42fe3eea17008b45ec-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_punitive-brexit-approach-to-city-of-london-will-hurt-eu-2018-7_1540938874.html","title":"Government warns that punitive approach to City of London during Brexit will hurt EU","title_page":"    Government warns that punitive approach to City of London during Brexit will hurt EU - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The City of London. Shutterstock/Zoltan Gabor\nLONDON — British Brexit negotiators have issued a stern warning to their EU counterparts over the damage that could be done if the EU takes an overly punitive approach to the City of London.\nAccording to a report from The Times on Tuesday, UK officials told Brussels that \"thousands\" of European investment funds will be under threat if the EU insists on a hardline approach to the City, something favoured by the EU's French contingent, which sees Brexit as a way to strengthen Paris as a financial centre.\nUK firms currently sell thousands of investment funds to clients in EU countries, while EU firms sell their funds to UK customers under financial passporting rules. Luxembourg is a particular hub for such business.\nUnder the EU's current stance, UK companies would lose the ability to sell funds into the EU. This has led British negotiators to argue that the reverse would also be true: EU firms would be unable to sell into the UK. The Times reports that the strategy was \"designed to highlight the damage that could be caused if Britain fails to get a special deal for the City.\"\n\"This was not intended as a threat. Rather, we wanted to set out what both sides could lose if we don't get a good deal, and it was received in that spirit,\" a source within the government told the newspaper.\nThe report comes after the EU's hardline chief negotiator Michel Barnier appeared to soften his stance on the future relationship last week. Barnier had previously been in opposition to Prime Minister Theresa May's \"advanced equivalence\" plan, as he believed it threatened the bloc's \"decision-making autonomy.\"\nUnder the government's proposed new relationship Britain would sign up to a system of so-called \"equivalence.\" The government said it will seek to improve on existing requirements for equivalence of rules between the EU and outside countries. Barnier and other officials believed that this would mean the UK would be able to control how much access it had to EU financial markets\nHowever, after British officials clarified that this was not part of the plan and that power to grant access to those markets would remain in the hands of Brussels, Barnier is believed to have climbed down from that position, according to a Financial Times report.\n\"Last week we held positive discussions with the European Commission on our proposal for a pragmatic new arrangement for financial services after we leave the EU,\" a Treasury spokesman cited by the Times said, adding that negotiators found \"common ground in recognising both the EU's and Britain's desire to have control over their own decision-making.\nThey also recognised \"the need for bilateral dialogue and cooperation to reflect the deeply integrated nature of UK and EU financial markets,\" the spokesman added.\nSEE ALSO:","url":"https://www.businessinsider.com/punitive-brexit-approach-to-city-of-london-will-hurt-eu-2018-7"}
