{"authors":["Lana Shadwick"],"date_download":"2018-10-30 18:04:11","date_modify":"2018-10-30 18:04:11","date_publish":"2017-02-17 19:04:02","description":"The governors of Texas and eight other states have taken aim at California's restriction on concealed carry permit holders and urge that their citizens \"should not be forced to check their gun rights at the [California] border.\"","filename":"data/vaneerConsumption/GovernorsTakeAimatCaliforniasCheckYourGunRightsattheBorderPolicy.json","image_url":"https://media.breitbart.com/media/2017/01/campus-carry-university-concealed-carry-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_02_17__1540922651.html","title":"Governors Take Aim at California's 'Check Your Gun Rights at the Border' Policy","title_page":"Governors Take Aim at California's 'Check Your Gun Rights at the Border' Policy","title_rss":"NULL","source_domain":"breitbart.com","text":"The governors of Texas and eight other states have taken aim at California’s restriction on concealed carry permit holders and urge that their citizens “should not be forced to check their gun rights at the [California] border.”\nCalifornia is referred to by gun rights advocates as a “may issue” state. This means that the state can arbitrarily pick and choose who they will issue a permit to based on need and not simply qualifications. Other states are referred to as “shall issue” states — meaning the state must issue the permit if you meet the licensing requirements. A California state legislator introduced a bill in the State Assembly to change the law to “shall issue,” Guns Magazine’s Chris Eger reported.\nThe State wants to force Californians who desire to carry a gun “to prove to the sheriff’s satisfaction ‘good cause’ for exercising his or her constitutional rights,’ and prove they are of “good moral character.” Good cause may not be shown by a “concern for one’s personal safety alone,” a “unique risk of harm” must exist.\nThe fight in the U.S. Supreme Court is over Californians, and those traveling in California, being able to exercise their right to carry a concealed handgun. California says it can limit Second Amendment rights on the ground of “public safety.” The governors of the nine states, led by Texas, have filed a friend of the court brief in the nation’s highest court where the gun rights case is pending.\nThe case, styled Edward Peruta, Michelle Laxson, James Dodd, Leslie Buncher, Dr., Mark Cleary, California Rifle and Pistol Association v. the County of San Diego, will determine not only whether Californians have the right to carry a concealed weapon, but whether a concealed carry permit holder traveling from another state will have the right to carry in the Golden State.\nTexas Governor Greg Abbott and the coalition of governors state:\nThe question presented is whether the State of California can single out one group of disfavored citizens—namely, gun owners—and impose unique burdens on their fundamental rights. If this were a case about speech, the right to counsel, or any of the myriad rights protected by the Fourteenth Amendment, every federal court in this country would reject California’s arguments out of hand. Indeed, no other group of private citizens has to prove—to the satisfaction of a government official vested with unreviewable and boundless discretion—that they really need to exercise their fundamental constitutional freedoms.\nThe states of Arizona, Arkansas, Iowa, Kansas, Kentucky, Maine, South Carolina, and South Dakota have joined Texas in the fight against the constitutional overreach by the state of California.\nThe governors urge in the brief that “California is wrong on the law,” and “California is wrong on the facts.”\nAs it relates to the effect on the states filing the brief they write:\nFirst, citizens in the Amici Governors’ States should not be forced to choose between exercising their constitutional rights to bear arms and exercising their constitutional rights to travel to California. This Court has said that the ‘constitutional right to travel from one State to another is firmly embedded in our jurisprudence.’\nMoreover, they argue “California bases its incapacious view of the right to bear arms on purported ‘public safety’ concerns. But data from the Amici Governors’ States proves that California’s worries are unfounded. It is by now indisputable that concealed handgun license (‘CHL’) holders are disproportionately less likely to commit crimes. Therefore, California’s ‘public safety’ concerns should be rejected as pretextual.”\nStates cannot treat the Second Amendment differently from other Constitutional rights, and statistics in California (and as we shall see, Texas) show that licensing law-abiding citizens to carry concealed handguns poses no threat to the safety of the public.\nThe conclusion in the brief urges that the U.S. Constitution exists to protect citizens from a rouge government that would take rights away from law-abiding citizens.\nThe brief concludes:\nIt might be true that statewide elected officials in California have strong political incentives to infringe ‘the right of the people to keep and bear Arms.’ But the Constitution never was intended to disappear where policymakers in Sacramento find it inconvenient, nor was it intended to protect only those rights that enjoy popular support or universal acceptance.\nTexas Governor Greg Abbott filed an amicus brief in the case in April 2015 making these arguments when the case was still at the U.S. Court of Appeals for the Ninth Circuit. Abbott said at the time of the filing of the brief, “The Second Amendment does not create second-class rights and states cannot choose which Constitutional rights their citizens can exercise. The right of citizens to keep and bear arms should never be weakened or eliminated for political expediency, and the judgment of the district court should be wholly reversed.”\nAlthough California is trying to undermine the U.S. Consitution’s protection of Second Amendment rights on the ground of “public safety,” statistics from the Texas Department of Public Safety over the last ten years also reveal that “CHL [Concealed Handgun License] holders are more than 10 times less likely to commit a crime in Texas as compared to the general population.” “[E]ven for crimes that often or always involve guns—such as aggravated assault with a deadly weapon, or deadly conduct involving discharge of a firearm—the crime rate for CHL holders is dramatically smaller than for the general population.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nAmicus Brief Filed by Texas and 8 Governors in Peruta v. San Diego County by lanashadwick on Scribd","url":"https://www.breitbart.com/border/2017/02/17/texas-3/"}
