{"authors":["William Bigelow"],"date_download":"2018-10-30 21:41:03","date_modify":"2018-10-30 21:41:03","date_publish":"2014-12-25 20:02:07","description":"California Governor Jerry Brown had a slight hitch issuing his traditional Christmas Eve pardons this year: he had to rescind one of the 105 pardons only hours after he issued it.","filename":"data/vaneerConsumption/GovJerryBrownRescindsOneofHis105ChristmasEvePardons.json","image_url":"https://media.breitbart.com/media/2014/11/jerry_brown_ap_629_1160x629.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_12_25__1540935663.html","title":"Gov. Jerry Brown Rescinds One of His 105 Christmas Eve Pardons","title_page":"Gov. Jerry Brown Rescinds One of His 105 Christmas Eve Pardons | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California Governor Jerry Brown had a slight hitch issuing his traditional Christmas Eve pardons this year: he had to rescind one of the 105 pardons only hours after he issued it.\nBrown had pardoned Glen Williams Carnes, 37, after the Orange County Superior Court stated in its August 2013 certificate of rehabilitation,“He has lived an honest and upright life, exhibited good moral character and conducted himself as a law-abiding citizen.” Carnes had been convicted in 1998 of possession for sale of a controlled substance and sentenced to three years’ probation.\nA report from the Los Angeles Times triggered Brown’s withdrawal of Carnes’ pardon. The report stated that federal regulators had disciplined Carnes in 2013 because he had conducted a business deal unbeknownst to regulators. Carnes had previously signed a consent settlement with the Financial Industry Regulatory Authority acknowledging he would not invest financially.\nBrown’s spokesman, Evan Westrup, told the Times, “This information was not disclosed by the applicant. Without the certificate of rehabilitation, this individual would not have been considered for a pardon. This particular pardon has not yet been attested by the Secretary of State and it has subsequently been withdrawn.”\nCarnes denied any wrongdoing, according to the Associated Press (AP) , which said he claimed he did not know his clemency application needed to include information regarding the regulatory settlement. He told the Times Wednesday night he intended to contact Brown’s office “first thing on Friday morning as tomorrow is Christmas, to refute your allegations.”\nThe AP interviewed Carnes after Brown’s decision. He and his family had been celebrating his imminent pardon, and when he heard what Brown had done, he was shocked. He said, “Oh my God. You’ve got to be kidding me,” adding that his lawyers had advised him that the sanction against him did not need to be disclosed because it did not involve a conviction. He concluded, “I cannot believe this is happening, I’ve waited 20 years for this. This is wrong.”","url":"https://www.breitbart.com/local/2014/12/25/gov-jerry-brown-rescinds-one-of-his-105-christmas-eve-pardons/"}
