{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:49:46","date_modify":"2018-10-30 21:49:46","date_publish":"2016-01-28 20:08:20","description":"Just over a month after Virginia Attorney General Mark Herring (D) caused a public outcry by announcing the end of concealed carry reciprocity with 25 |","filename":"data/vaneerConsumption/GovMcAuliffeReversesCourseRestoringConcealedCarryReciprocitywith25States.json","image_url":"https://media.breitbart.com/media/2016/01/concealed-carry-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_28__1540936186.html","title":"Gov. McAuliffe Reverses Course: Restoring Concealed Carry Reciprocity with 25 States","title_page":"Gov. McAuliffe Reverses Course: Restoring Concealed Carry Reciprocity with 25 States | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Just over a month after Virginia Attorney General Mark Herring (D) caused a public outcry by announcing the end of concealed carry reciprocity with 25 states, Governor Terry McAuliffe (D) is reversing that decision by restoring reciprocity with the states.\nThe Washington Post reports McAuliffe will announce the continued reciprocity on Friday.\nWhen Herring announced he was severing the reciprocity agreements with the 25 states, the WAPO pointed out that Virginians with concealed carry permits would be hurt because some of those states refuse to recognize the carry permits from other states unless there is mutual recognition. In other words, a state like Florida will not recognize Virginia’s concealed carry permit unless Virginia also recognizes Florida’s.\nSo had Herring’s decision been allowed to stand, Florida, Louisiana, North Dakota, Pennsylvania, South Carolina, and Wyoming would have all refused to recognize Virginia’s concealed permits in their states.\nWith McAuliffe reversing course, this fracture in agreements will be averted.\nMcAuliffe was able to get the Republican-controlled State Assembly to make some minor concessions to get the concealed reciprocity issue reversed. One of the concessions means Virginia State Police will be present at all gun shows to run background checks on a volunteer basis for private sellers.\nAnother of the concessions means a Virginian who loses his or her carry permit due to an infraction will not be allowed to use a license from a neighboring state to get around the Virginia suspension. There is also a new enforcement mechanism against the ability of persons with restraining orders to carry guns.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/01/28/terry-mcauliffe-reverses-course/"}
