{"authors":["Breitbart News"],"date_download":"2018-10-30 18:21:44","date_modify":"2018-10-30 18:21:44","date_publish":"2014-08-22 02:07:34","description":"Gov. Nixon taking National Guard out of Ferguson\"","filename":"data/vaneerConsumption/GovNixontakingNationalGuardoutofFerguson.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/08/21/8f58813dafc45c205d0f6a70670051b0jpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_08_21__1540923704.html","title":"Gov. Nixon taking National Guard out of Ferguson","title_page":"Gov. Nixon taking National Guard out of Ferguson | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"FERGUSON, Mo. (AP) — Gov. Jay Nixon on Thursday ordered the Missouri National Guard to begin withdrawing from Ferguson, where nightly scenes of unrest have erupted since a white police officer fatally shot an unarmed black 18-year-old nearly two weeks ago.\nSince the guard’s arrival Monday, flare-ups in the small section of town that had been the center of nightly unrest have begun to subside. The quietest night was overnight Wednesday and Thursday, when police arrested only a handful of people in the protest zone.\n“As we continue to see improvement, I have ordered the Missouri National Guard to begin a systematic process of withdrawing from the City of Ferguson,” the governor said in a statement.\nDemonstrations began after Aug. 9 shooting of Michel Brown, and authorities have arrested at least 163 people in the protest area. Data provided Thursday by St. Louis County showed that while the majority of those arrested are Missourians, just seven live in Ferguson, a St. Louis suburb. The vast majority, 128 people, were cited for failure to disperse. Twenty-one face burglary-related charges.\nMeanwhile Thursday, St. Louis County prosecutor Bob McCulloch reiterated he has no intentions of removing himself from the case, and he urged Nixon to once and for all decide if he will act on calls for McCulloch’s ouster.\nSome question McCulloch’s ability to be unbiased since his father, mother and other relatives worked for St. Louis police. His father was killed while responding to a call involving a black suspect.\nNixon said this week he is not asking McCulloch to recuse himself. But a McCulloch aide, Ed Magee, said the governor ‘didn’t take an actual position one way or the other.”\nMcCulloch called for a more definitive decision. He said in a statement that Nixon must “end this distraction” or risk delay in resolution of the investigation.\nA Nixon spokesman did not immediately return a message seeking comment.\nMissouri State Highway Patrol Capt. Ron Johnson, in charge of securing Ferguson, said just six people were arrested at protests Wednesday night, compared to 47 the previous night, providing hope among law enforcement leaders that tensions may be beginning to ease.\nA grand jury on Wednesday began considering evidence to determine whether the officer who shot Brown, Darren Wilson, should be charged. Magee said there was no timeline for the process, but it could take weeks.\nAnother fatal police-involved shooting happened this week in St. Louis, about five miles from the site where Brown was killed. St. Louis police released video showing officers killing a knife-wielding man. The video shows the man saying, “Kill me now” as he moved toward two officers. The officers fired six shots each, killing 25-year-old Kajieme Powell.\nThe St. Louis shooting briefly spurred a gathering of about 150 people who chanted, “Hands up, don’t shoot,” a chant that has become common among protesters in Ferguson.\nSt. Louis Police Chief Sam Dotson said he wanted to move quickly to make public as much information as possible. By Wednesday he had provided media with cellphone video of the shooting, the 911 call, dispatch tapes and surveillance video from a nearby store.\n“I think the lessons learned from Ferguson were so crystal clear,” Dotson said.\n___\nAssociated Press writer Nigel Duara in Ferguson contributed to this report. Salter reported from St. Louis.","url":"https://www.breitbart.com/politics/2014/08/21/gov-nixon-taking-national-guard-out-of-ferguson/"}
