{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:27:53","date_modify":"2018-10-30 21:27:53","date_publish":"2015-04-27 18:42:40","description":"Craig Robinson, founder and editor of TheIowaRepublican.com, calls Walker the “clear frontrunner” following the weekend Faith and Freedom Coalition event in that state, which hosts the country's first caucuses. |","filename":"data/vaneerConsumption/GovScottWalkerIsClearFrontrunnerinIowaExpertWrites.json","image_url":"https://media.breitbart.com/media/2015/04/Scott-Walker-Upward-Gaze-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_27__1540934873.html","title":"Gov. Scott Walker Is 'Clear Frontrunner' in Iowa, Expert Writes","title_page":"Gov. Scott Walker Is 'Clear Frontrunner' in Iowa, Expert Writes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wisconsin Gov. Scott Walker appears to have an early edge in Iowa.\nCraig Robinson, founder and editor of TheIowaRepublican.com, calls Walker the “clear frontrunner” following the weekend Faith and Freedom Coalition event in that state, which hosts the country’s first caucuses.\nA number of the potential GOP presidential candidates attended the summit and addressed an audience of Iowa voters.\nSen. Marco Rubio delivered “one of the best-delivered speeches of the night,” Robinson writes. The political observer added that Sen. Rand Paul and Carly Fiorina got people talking. Fiorina “is going to be a surprise on caucus night if she keeps it up,” Robinson adds.\nRobinson was impressed by Paul’s grasp of the importance of social issues to Iowa voters. He reported: “If one thing was made abundantly clear by the reception Paul received on Saturday night, it’s that he can make a play for the support of evangelical and socially conservative voters in a way that his father never could.”\nAccording to Robinson’s analysis, former Texas Gov. Rick Perry appeared “comfortable as an underdog for the 2016 race,” and Gov. Bobby Jindal had a well received speech that got people “talking about him after the event.”\nRobinson reported that he noticed Iowans appear proud of former Sen. Rick Santorum since he “won the 2012 caucuses,” but Robinson added, “I don’t think you grow support by reminding people that you were right all the time.”\nFormer Gov. Mike Huckabee produced interesting reactions from the voters, according to Robinson. “While Santorum has earned the respect of Iowa caucus-goers, they still really like Huckabee,” Robinson said. “The polls bear this out, too. While Santorum finds himself back in the low single digits, Huckabee routinely polls near the top in Iowa”\nEven though Huckabee is doing well in the polls, it is Sen. Ted Cruz that Robinson believes “excites Iowa conservatives” like no other candidate “has over the past couple of years.”\nClosing his analysis, Robinson detailed Walker’s speech saying he is definitely the frontrunner among Iowa voters.\n“He draws a tremendous amount of interest amongst caucus-goers, and the only question is whether his campaign will harvest all of that interest into support,” Robinson said.","url":"https://www.breitbart.com/politics/2015/04/27/gov-scott-walker-is-clear-frontrunner-in-iowa-expert-writes/"}
