{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:49:48","date_modify":"2018-10-30 21:49:48","date_publish":"2015-08-26 15:53:53","description":"Gov. McAuliffe Admits Not Knowing How Gunman Acquired Firearm, Calls For Gun Control Anyway.","filename":"data/vaneerConsumption/GovTerryMcAuliffeAdmitsNotKnowingHowGunmanAcquiredFirearmCallsForMoreGunControl.json","image_url":"https://media.breitbart.com/media/2015/01/Terry-McAuliffe-state-of-commonwealth-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_26__1540936188.html","title":"Gov. Terry McAuliffe Admits Not Knowing How Gunman Acquired Firearm, Calls For More Gun Control","title_page":"Gov. Terry McAuliffe Admits Not Knowing How Gunman Acquired Firearm, Calls For More Gun Control","title_rss":"NULL","source_domain":"breitbart.com","text":"Just hours after a gunman shot and killed WDBJ-TV’s Allison Parker and Adam Ward just off camera during a live interview, Governor Terry McAuliffe admitted not knowing anything about how the gunman got his gun, yet the Governor stressed that more gun controls–specifically background checks–are needed.\nSpeaking on Fox News while a police chase of the gunman was underway, McAuliffe called for background check legislation.\nMcAuliffe said:\nTwice I have brought legislation before the general assembly. Twice I have asked that we have background checks. Twice now they have rejected background checks.” He said there are “individuals in this country who should not be allowed to own a firearm and it’s just tragic that this kind of legislation cannot be passed and signed into law.\nAn unnamed reporter then asked, “Do you know that [the gunman] is not a permit holder? Do you know that he has a criminal background?”\nMcAuliffe responded by saying, “I don’t. At this stage I don’t.”\nBut McAuliffe does know that he wants more gun control and he told reporters he was shocked that Virginia General Assembly passed a bill allowing law-abiding citizens to carry loaded shotguns in their car for self-defense during the last legislation session. He stressed that he vetoed that bill and is “trying to bring common sense ideas” to the forefront.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/08/26/gov-terry-mcauliffe-admits-not-knowing-how-gunman-acquired-firearm-calls-for-more-gun-control/"}
