{"authors":["Breitbart London"],"date_download":"2018-10-30 18:36:53","date_modify":"2018-10-30 18:36:53","date_publish":"2018-07-09 14:03:30","description":"WARSAW (AFP) - Poland won't bow to EU pressure by dropping controversial judicial reforms, the leader of the governing nationalist party said on Monday, | London / Europe","filename":"data/vaneerConsumption/GovtPolandWontBeBrokenbyEUBowtoPressuretoDropReforms.json","image_url":"https://media.breitbart.com/media/2018/07/wi/ap/02/decfe0_poland-holocaust-law-81857-mateusz-morawiecki-polish-prime-minister-mateusz-e1531142660357.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_09__1540924613.html","title":"Govt: Poland 'Won't Be Broken' by EU, Bow to Pressure to Drop Reforms","title_page":"Govt: Poland 'Won't Be Broken' by EU, Bow to Pressure to Drop Reforms | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WARSAW (AFP) – Poland won’t bow to EU pressure by dropping controversial judicial reforms, the leader of the governing nationalist party said on Monday, insisting they were “crucial”.\nAsked whether legal action by Brussels will drive Warsaw to abandon the reforms, Jaroslaw Kaczynski, who heads the eurosceptic Law and Justice (PiS) party, vowed that Poland “won’t be broken”.\nHis remarks after a week in which thousands of Poles took to the streets to denounce the reforms which have forced dozens of senior judges to retire early.\nSpeaking to pro-government weekly Sieci, Kaczynski said the move was “crucial” for dismantling the vestiges of communism within the judicial system.\nBut the EU sees the reforms as threatening judicial independence and the rule of law and has launched legal action against Warsaw that could end up in the European Court of Justice (ECJ), the bloc’s top tribunal.\nIn December, Brussels triggered Article Seven proceedings against Poland over “systemic threats” to the rule of law posed by judicial and other reforms, which could eventually see Warsaw’s EU voting rights suspended.\nKaczynski’s remarks come amid turmoil over the forced early retirement of Supreme Court judges under PiS legislation that lowers their retirement age from 70 to 65.\nThe measure, which came into effect last week, affects 27 of the court’s 73 judges, among them Chief Justice Malgorzata Gersdorf, who is 65.\nRejecting the law as breaching her constitutionally guaranteed six-year term that ends in 2020, Gersdorf has refused to go, winning widespread backing from her fellow Supreme Court judges, Europe’s top judicial authorities and rights groups.\n– ‘Too old to be a judge’ –\nBut the PiS leader said her defiance was illegal.\n“It’s a six-year term but if someone goes into retirement during that period, they can’t be both a pensioner and the chief justice,” said Kaczynski, who is widely regarded as Poland’s de facto decision-maker despite only being an MP.\nLate Sunday, Rolling Stones legendary frontman Mick Jagger also spoke out after anti-communist freedom icon Lech Walesa urged the band support Poles “defending freedom” by protesting a law critics say undermines democracy.\n“I’m too old to be a judge, but I’m young enough to sing,” the 74-year-old singer told concertgoers in Warsaw, speaking in Polish.\n“You know we came to Poland a long time ago in 1967,” he said in English, referring to the Stones’ first gig in Poland, becoming one of the first Western bands to perform behind the Iron Curtain.\n“I hope you get to hang onto everything you’ve learned since then,” he added.","url":"https://www.breitbart.com/europe/2018/07/09/govt-poland-wont-be-broken-by-eu-bow-to-pressure-to-drop-reforms/"}
