{"authors":["Jeff Poor"],"date_download":"2018-10-30 21:45:14","date_modify":"2018-10-30 21:45:14","date_publish":"2015-08-12 15:57:15","description":"Gowdy: Hillary 'Wanted to Control Access to the Public Record,' 'She Almost Got Away with It'","filename":"data/vaneerConsumption/GowdyHillaryWantedtoControlAccesstothePublicRecordSheAlmostGotAwaywithIt.json","image_url":"https://media.breitbart.com/media/2015/08/Gowdy812.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_12__1540935914.html","title":"Gowdy: Hillary 'Wanted to Control Access to the Public Record,' 'She Almost Got Away with It'","title_page":"Gowdy: Hillary 'Wanted to Control Access to the Public Record,' 'She Almost Got Away with It' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday’s broadcast of Fox News Channel’s “America’s Newsroom,” Rep. Trey Gowdy (R-SC) weighed in on the recent reports that the Federal Bureau of Investigations was investigating former Secretary of State Hillary Clinton, a candidate for the 2016 Democratic presidential nomination, for her use of an unauthorized email server during her tenure as the nation’s top diplomat.\nGowdy, the chairman of the House Select Committee on Benghazi, declined to discuss particulars of the FBI investigation with the exception of what on that may have pertained to the 2012 attack on the U.S. consulate in Benghazi.\nHe did, however, scoff at the Clinton campaign’s insistence of cooperation and transparency as investigation unfolds.\n“It’s hard not to laugh when I hear that,” Gowdy said. “I know he’s in the business to say absurd things. But if that really was his intent and her intent, why did they set up this unique unprecedented email arrangement? Why did she keep the emails for 20 months after she left the Department of State? She kept the emails. She didn’t turn them over then. Why did she delete emails after 20 months? Did she all of a sudden after 20 months conclude this is too burdensome for me to keep a bunch of emails on my server, so let me not only delete them, but wipe the server clean?”\n“If she were interested in cooperation, she would not have done of the things she has done today,” he added. “This was not about cooperation. And frankly Bill, it’s not about convenience. It’s about control. She wanted to control access to the public record. And she almost got away with it, but she didn’t.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/politics/2015/08/12/gowdy-hillary-wanted-to-control-access-to-the-public-record-she-almost-got-away-with-it/"}
