{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-22 23:35:23","date_modify":"2018-10-22 23:35:23","date_publish":"2016-01-29 11:44:17","description":"Grace Turner-Williams was born with craniosynostosis - a condition which causes the skull plates to fuse together in the womb. The toddler, from Wales, had an eight hour operation.","filename":"data/vaneerConsumption/GraceTurnerWilliamsbornwithcraniosynostosishasherskullcrackedopen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1F86400000578-0-image-a-52_1454068278558.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3422555_Heartwarming-pictures-toddler-skull-cracked-open-pieced-prevent-blindness-brain-damage_1540251323.html","title":"Grace Turner-Williams born with craniosynostosis has her skull cracked open","title_page":"Grace Turner-Williams born with craniosynostosis has her skull cracked open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A toddler born with a rare defect has made an incredible recovery after surgeons were forced to break open her skull and piece it back together.\nGrace Turner-Williams was born with craniosynostosis - a condition which causes the skull plates to fuse together in the womb.\nIt caused Grace's head to grow long and narrow and could have led to blindness, seizures and brain damage if left untreated.\nThe brave two-year-old underwent an eight hour operation to break and reshape her deformed skull to give her brain room to grow.\nGrace as born with craniosynostosis - a condition which causes the skull plates to fuse together in the womb and caused her head to become long and narrow\nThe eight hour operation involved breaking her skull in several place to allow room for her brain to expand. It left her with severe swelling which meant she could not open her eyes\nIt caused severe swelling which left her unable to open her eyes for days after surgery.\nGrace, from Llangollen, North-East Wales, has now made a full recovery and proud parents, Rosanna Turner, 23, and Nikki Williams, 24, can't wait for her to start nursery later this year.\n'Family had commented on the shape of her head but as first time parents we presumed it was normal,' said Miss Turner.\n'Grace's operation was the most terrifying time of our lives, but she still came out smiling, she's such a brave little girl.\n'We were devastated when doctors confirmed she had cranio and would need such complex surgery but we knew it was the right thing to do to give her the best chance in life.\n'Grace's skull wasn't expanding the way her brain wanted it too, instead it grew particularly long and narrow.\n'I kept asking myself if we were making the right decision, I was terrified in case something happened to her or if she came out or surgery looking like a completely different baby.'\nThe teaching assistant said Grace initially looked fine when she came out of theatre.\nBut then her face started to swell - a side effect of the surgery - until she was almost unrecognisable.\nShe has now recovered and back to full health with her parents excited at the prospect of her starting nursery\nThe condition developed when Grace was in the womb (left) and nobody did not show when she was born (right)\nAs Grace got older, members of the family started to notice her head shape was unlike other babies\n'I just burst into to tears that she had come through and nothing major had gone wrong,' she said.\n'When her face started to swell she dealt with the situation much better than we did she was very calm and just made sure she had hold of our fingers the whole time knowing we were there.\n'She was soon back to her old self laughing and playing and wanting to be walking around it was so nice when we were able to take her out of the ward and spend family time.'\nUnlike other newborn babies who have gaps in their skulls allowing room for the brain to grow, Grace's skull had fused together.\nBut the condition wasn't picked up until Grace was eight-months-old when her grandmother, Linda Turner, 56, noticed the soft spot on her head had closed.\nParents Rosanna Turner, 23, and Nikki Williams, 24, can't wait for Grace to start nursery later this year after she made a full recovery (pictured)\nGrace had a major operation which involved breaking her skull and caused severe swelling to her head\nBrave Grace was left with a big bandage spanning across her skull following the surgery at Alder Hey Children's Hospital\nMiss Turner mentioned it to the health visitor who referred her to hospital for tests.\nThey were initially told it was a bone condition before a second opinion suggested it was craniosynostosis.\nWHAT IS CRANIOSYNOSTSIS? Craniosynostosis is the premature fusion of the skull before birth or shortly after, either in one place or in multiple places. Normally when a child is born the skull is made of individual plates. If the plates have prematurely fused, the brain will grow but may make the skull shape different. The child could have brain damage or pressure on the brain if left untreated. For children with single suture Craniosynostosis, the child usually receives surgery at around a year old. If the child has a syndrome they will receive treatment at various times up to their teenage years. Gill Ruff from craniofacial support group Headlines\nShe was referred to Alder Hey Children's Hospital where Grace was diagnosed straight away.\n'We wanted her to have the operation as there was a possibility that her brain would be crushed by her skull or she could end up with learning difficulties.\n'Thankfully everything went well and Grace has hit all her milestones, she's such a happy little girl.'\nMiss Turner and Mr Williams, a life guard, said they only noticed Grace had looked different after she recovered.\nThey started to look through old pictures and wonder how they didn't notice the condition sooner.\n'Looking back now the shape of Grace's head was different to our friend's babies, we just couldn't see it at the time,' Miss Turner said.\nFamily and friends did the Great Manchester Run on Grace's second birthday to raise awareness of the condition.\nThey want other parents and health professionals to be able to spot the tell-tale signs.\n'Grace was put through tests which were not needed and we are deeply saddened that this was not picked up sooner.\n'Grace's operation time could of been halved and far less complicated if she was younger, the whole process would've been less stressful and less time consuming.'","url":"https://www.dailymail.co.uk/health/article-3422555/Heartwarming-pictures-toddler-skull-cracked-open-pieced-prevent-blindness-brain-damage.html"}
