{"authors":[],"date_download":"2018-10-22 20:52:37","date_modify":"2018-10-22 20:52:37","date_publish":"2014-06-03 14:33:00","description":"Grace Garcia, who dedicated herself to increasing the role of women in Democratic politics is remembered after her untimely death.","filename":"data/vaneerConsumption/GraceGarciaRememberedAsFierceWarriorForWomen.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484516/140603-grace-garcia-1209_beef71770fb3068daad9e1d588da04b2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_grace-garcia-remembered-fierce-warrior-women-n121246_1540241557.html","title":"Grace Garcia Remembered As \"Fierce Warrior For Women\"","title_page":"Grace Garcia Remembered As \"Fierce Warrior For Women\" ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Grace Garcia, a San Antonio native whose career included working for President Bill Clinton and later Secretary of State Hillary Rodham Clinton, was killed in a car crash on Monday. Her death is being mourned by many, including Texas state senator and Democratic candidate for lieutenant governor Leticia Van de Putte.\n“To me, it was an honor to call her my sister, she was like family,\" said Van de Putte in a statement. \"She was at the decision table convincing me to run for lieutenant governor,\" added Van de Putte, who had gone to high school with Garcia. \"She was a fierce warrior for Texas women and equality. Texas has lost a giant.\"\nGarcia was currently the executive director of Annie's List, a group which works to elect pro-choice Democratic women to office.\n“She was a Texas Democrat in every sense of the word,\" said Texas Democratic Party chairman Gilberto Hinojosa. \"We know the best way to honor her legacy is to work towards getting more Democrats elected across Texas - so we plan to do just that,\" he said.","url":"https://www.nbcnews.com/news/latino/grace-garcia-remembered-fierce-warrior-women-n121246"}
