{"authors":[],"date_download":"2018-10-22 22:31:56","date_modify":"2018-10-22 22:31:56","date_publish":"2014-06-10 12:30:43","description":"The South Carolina senator is on a glide path to fend off conservative challengers.","filename":"data/vaneerConsumption/GrahamsStrategytoHoldOffTeaPartyBeingMe.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/498766/us_senate_graham-jpeg-0e3a3_7b65c47bcaf9bc310e2dadab8ebd30e0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_grahams-strategy-hold-tea-party-being-me-n127186_1540247516.html","title":"Graham's Strategy to Hold Off Tea Party: 'Being Me'","title_page":"Graham's Strategy to Hold Off Tea Party: 'Being Me'","title_rss":"NULL","source_domain":"nbcnews.com","text":"“He isn’t going to have to apologize (to conservatives) for anything he’s done,” said David Woodard, a Clemson University political professor who helped conduct a recent poll that showed Graham winning 49 percent of likely Republican voters.\nThe poll showed Graham’s challengers, who include two lawyers, two businesspersons and a pastor, all far behind. State Sen. Lee Bright was at 9 percent, the highest of Graham’s opponents, while a third of the GOP electorate was undecided.\nGraham spent Monday campaigning in five cities in the state, eager to avoid the runoff, finishing by attending a picnic in this small town (population 8,000) where the 58-year-old lives.\nAs he went table-by table, hugging longtime supporters while telling kids he greeted “sorry about Social Security” with a wry smile, Graham was also doing a little bragging.\nOne of his supporters asked the senator about Saturday’s debate between the GOP Senate candidates.\nGraham replied confidently, “I didn’t back off from being me.”\nIn the primary’s first and only debate, Graham’s opponents had blasted his moderate stands, with businessman Richard Cash repeatedly invoking the phrase “Grahamnesty.”\nThe senator didn’t back down. Asked his view of the Tea Party, Graham argued the GOP had “given away” four Senate seats in the last two election cycles by nominating strong conservative candidates, some championed by the Tea Party, who couldn’t win their general elections. He defended his votes for Obama’s Supreme Court nominees, saying “how do we get all of our judges and they never get theirs?” Immigration, Graham said, “is not a problem that is going to get fixed by yelling about it.”\nThat confrontational tone was not an accident: Graham is trying to frame his success here as a broader message to the Republican Party.\n“What is conservatism? Is Ronald Reagan’s form of conservatism, 80 percent agreement’s a good thing, is that okay or do you have to be 100 percent all the time? I got a feeling tomorrow we’re going to hear a loud, ‘keep it up Lindsey. It’s okay to solve a problem, we know you’re a conservative,'” he told reporters here.\n“I think it’s a referendum on the kind of conservatism I bring to the table,” he added.\nIn truth, Graham’s likely victory is not simply about voters here embracing his breaks from conservative orthodoxy. Graham has employed his own Tea-Party style rhetoric at times, invoking the specter of impeachment in the wake of President Obama’s release of prisoners from Guantanamo Bay to help get Bowe Bergdahl released. He has raised more than $12 million for his reelection, a sum larger than all of his opponents combined.\nIf the people send me back, they know exactly what they’re going to get.\nMuch of that money has went to television commercials that emphasize Graham’s conservative credentials on issues outside of immigration, such as his opposition to Obamacare and strong rhetoric condemning the administration for its handling of the aftermath of the attack on a U.S. diplomatic post in Benghazi, Libya.\nIn part because of his strong fundraising, popular GOP House members in South Carolina opted against running against him.\n“It certainly helped that none of the congressmen ran, that’s for sure,” said Katon Dawson, a former state party chair here who is running a super PAC that is backing Graham.\nInstead, a group of conservative but lightly-regarded challengers emerged, none strong enough to force the others to drop out and consolidate the opposition to Graham or get the backing of conservative outside groups like the Club for Growth to invest heavily in this race. Even if Graham is forced into a runoff, it’s unlikely Tea Party groups will pump in dollars here, since the much more winnable Mississippi runoff is also on June 22.","url":"https://www.nbcnews.com/politics/elections/grahams-strategy-hold-tea-party-being-me-n127186"}
