{"authors":["Graham Poll For The Daily Mail"],"date_download":"2018-10-23 01:29:30","date_modify":"2018-10-23 01:29:30","date_publish":"2016-01-28 15:52:43","description":"GRAHAM POLL: Assistant referees made major errors in both Capital One Cup semi-finals this week - the offside Stoke City goal at Liverpool and Raheem Sterling's cross which was clearly out of pla.","filename":"data/vaneerConsumption/GrahamPollsaysassistantrefereesbeingofferedfulltimestatusnextseasonisgreat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30A46ED400000578-0-image-a-9_1453996359960.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421221_Assistant-referees-offered-time-status-season-great-way-ensure-bad-decisions-eradicated-invest-technology_1540258170.html","title":"Graham Poll says assistant referees being offered full-time status next season is great","title_page":"Graham Poll says assistant referees being offered full-time status next season is great | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Assistant referees made major errors in both Capital One Cup semi-finals this week - the offside Stoke City goal at Liverpool and Raheem Sterling's cross which was clearly out of play - and the news they are being offered professional, full-time status next season is welcome.\nHowever, there is no guarantee that such errors will not continue at top-level football matches.\nPart of the document 'Managing the changes to match officials' details the opportunity being offered to the assistant referees we see regularly in the Premier League and in top domestic cup matches every week.\nRaheem Sterling crossed for Manchester City's second goal but the ball looked to have gone over the line\nTelevision replays showed the ball had clearly crossed the line before it was played back into the box\nCity's Belgian substitute playmaker Kevin De Bruyne dispatched Sterling's cutback into the Everton goal\nIn essence they are being offered a similar, but less valuable deal to their senior colleagues, the referees, who went professional back in 2001.\nIn return for commitment to full availability for matches and training programmes they will be offered a basic salary of £30,000 to £35,000 depending on experience.\nWhen match fees are added they should earn an average of £50,000 per annum.\nConsidering the sacrifices they have had to make in their commercial lives this is long overdue and the remuneration is hardly generous when you consider the importance of the decisions and the amount of money they affect.\nInteresting to read that Wayne Rooney's weekly salary of £260,000 would have covered the annual wage bill at Manchester United in 1969 and he will earn the assistant referees' new annual wage in just over five days next season.\nStoke City forward Marko Arnautovic was not ruled offside after receiving the ball from Bojan Krkic\nThis change though, however welcome and justified, will not eradicate the type of errors seen at Anfield and the Etihad Stadium.\nIt might reduce the number of offside goals like the one missed by Lee Betts on Tuesday.\nBut given how difficult Scott Ledger's decision - on whether the ball was out of play before it was crossed by Sterling - was on Wednesday, however much assistant referees are paid, the only way to ensure these decisions are correct is to invest in technology - something all match officials will embrace.","url":"https://www.dailymail.co.uk/sport/football/article-3421221/Assistant-referees-offered-time-status-season-great-way-ensure-bad-decisions-eradicated-invest-technology.html"}
