{"authors":[],"date_download":"2018-10-22 22:31:53","date_modify":"2018-10-22 22:31:53","date_publish":"2014-06-10 13:09:59","description":"“I think it’s a referendum on the kind of conservatism I bring to the table,\" says S.C. incumbent","filename":"data/vaneerConsumption/GrahamPoisedforARemarkablePoliticalFeat.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/498906/lindsay2_4437a54f9204a891a24611a26cebdd2e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_graham-poised-remarkable-political-feat-n127231_1540247513.html","title":"Graham Poised for A Remarkable Political Feat","title_page":"Graham Poised for A Remarkable Political Feat","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLindsey Graham on the verge of a remarkable political feat\nFive additional states hold their primaries today, and there’s one major storyline we’re following: Does Sen. Lindsey Graham (R-SC) cross the 50% threshold he needs to avoid a runoff two weeks from now? A Clemson poll released last week showed him getting extremely close -- at 49%. If Graham pulls it off, it would mark one of the more remarkable accomplishments we’ve seen from a politician this year. After all, Graham is a co-author of the “Gang of Eight” immigration bill at a time when much of the GOP is increasingly opposed to comprehensive immigration reform; he voted for both of President Obama’s Supreme Court picks; local GOP groups have censured him; and South Carolina’s Republican electorate is one of the most conservative in the country (just ask Mitt Romney). So it’s very easy to see how the Tea Party could topple him on ideological grounds alone. And it still could: If Graham is forced into a runoff, all bets are off. But if he does surge past 50% -- and the smart money is on that outcome -- it would be quite the accomplishment.\nGraham: The race is a referendum on conservatism\nIndeed, Graham views his primary as a referendum on conservatism. “What is conservatism? Is Ronald Reagan’s form of conservatism, 80% agreement’s a good thing, is that OK?” he asked reporters yesterday, per NBC’s Perry Bacon. “Or do you have to be 100% all the time? I got a feeling tomorrow we’re going to hear a loud, ‘Keep it up Lindsey. It’s OK to solve a problem, we know you’re a conservative.’” More from Graham: “I think it’s a referendum on the kind of conservatism I bring to the table.”\nFour reasons why Graham could avoid a runoff\nFour reasons could explain Graham passing 50%. First, he’s facing a crowded field with no heavyweights taking him on. Graham is competing against six primary opponents, including state Sen. Lee Bright, Citadel grad Nancy Mace, and former congressional candidate Richard Cash. “It certainly helped that none of the congressman ran, that’s for sure,” former South Carolina GOP Chair Katon Dawson told NBC’s Bacon. Second, the conservative/Tea Party groups stayed out of the contest and didn’t coalesce around one alternative. (Though that’s the danger if he’s forced into a runoff; six opponents gets reduced to one.) Third, Graham went hard to the right on a couple of issues -- on Obamacare and Benghazi -- to brandish his conservative credentials. And fourth, he’s significantly outspent his primary opponents, $8.5 million to $1.8 million COMBINED for the six other candidates. But do keep this in mind: John Cornyn couldn’t break 60% in Texas running against an even weaker crowd of challengers than Graham faces. And South Carolina’s electorate is more conservative. Nothing is a given for Graham today.\nA tale of two congressional districts in Virginia\nAnother state to watch that’s holding primary races today is Virginia, and there are two congressional contests in particular that we’re following: 1) the Democratic primary in the race to replace retiring Rep. Jim Moran (D-VA) in Northern Virginia, and 2) House Majority Leader Eric Cantor’s GOP primary against Tea Partier Dave Brat in the Richmond suburbs. You don’t have to drive very far from the nation’s capital to see the power of gerrymandering and self-sorting playing out in these two contests. In Northern Virginia, it’s a race to the left, with the candidates arguing who would be the stronger progressive and supporter of President Obama’s agenda. In the Richmond ‘burbs, it’s a race to the right to see who’s stronger against “amnesty” and “illegal aliens.” If a swing state like Virginia produces ideologically driven candidates for Congress then don’t expect things to change anytime soon on Capitol Hill.\nToday’s other primary states\nAlso holding primaries today are Maine, Nevada, and North Dakota. And while those states don’t have competitive primaries on our radar screen, they will host some races to watch for the general election -- think Maine’s gubernatorial race, as well as Maine’s open congressional seat.\nAnd don’t forget about Tim Scott’s own primary in South Carolina\nA final point about today’s primaries from NBC’s Perry Bacon: Who would have guessed a few years ago that Tim Scott, an African-American man, would be by far the most popular Republican senator in South Carolina? As it turns out, Scott has little opposition in his own Senate primary. Indeed, the question isn’t if he will run ahead of Graham -- it’s by how much. \"People are willing to vote for him who are not willing to vote for Lindsey Graham in the Republican primary,\" said Dave Woodard, a Clemson political science professor who conducts the Palmetto Poll said of Scott.\nHillary-palooza gets underway\nWell, Hillary Clinton’s new book, “Hard Choices,” is officially out today -- and so are numerous quotes from her after speaking to a variety of news outlets, including from NBC News. Some of the highlights:\nOn the advice today’s Hillary Clinton would give First Lady Hillary Clinton of the 1990s: “I would say that what I have learned and really incorporated since-- to take criticism seriously, but not personally, not to be-- so-- anxious and worried about everything that everybody says and try to figure out how to incorporate that into your thinking,” she told NBC News.\nOn critics who say she didn't score a signature achievement as secretary of state: \"I helped restore American leadership around the world,\" she told USA Today. \"We're living in a period when it's going to be less possible to have the big peace treaties because that's not the way wars end any longer.”\nOn the Bergdahl prisoner swap: \"Any time you let somebody out of Gitmo and in this case have a prisoner swap, it's going to have political blowback,\" Clinton added to USA Today.\nOn Barbara Bush's comments that more than just a couple of families (the Bushes and Clintons) should be running for the White House. \"I don't see it as a problem,\" Clinton said, per USA Today. \"We have a very open, competitive political system, as I know firsthand, and it's really up to voters to decide.\"\nOn her working relationship with President Obama on foreign policy: \"On practically everything, the president and I agreed. Syria was an exception. As I say in the book, there are reasons why I thought it was wise to support the moderates as they were trying to demonstrate for greater freedom against [Syrian President Bashar] Assad. But it's the president's call. I'm an absolute believer that the buck does stop, as Harry Truman said, on the president's desk,\" she told NPR.\nOn the lesson of Benghazi: \"We have to keep learning. What can we do to protect Americans, particularly from my perspective, our diplomats and development experts? They don't go armed into these places that are dangerous. They don't have a military contingent to back them up. They are there representing the United States. And some would say, 'We shouldn't be in dangerous places.' Well, there are so many dangerous places in the world right now that that would eliminate a lot of the important work that America needs to be doing,\" she added to NPR.\nHillary on her family’s finances after leaving the White House : “It was not easy”\nThere was another quote from Clinton -- defending the high-dollar speaking fees that she and her husband have earned -- that has raised eyebrows. \"We came out of the White House not only dead broke, but in debt,\" Clinton told ABC. \"We had no money when we got there, and we struggled to, you know, piece together the resources for mortgages, for houses, for Chelsea's education. You know, it was not easy.\" The reason why that quote is problematic is that “not easy” for the Clintons is luxury compared with most Americans’ finances. Yes, the Clintons -- after leaving the White House in 2001 -- might have struggled and felt cash-poor relative to their wealthier friends. But relative to most Americans? And this touches at a potential problem for her if she does decide to run for the presidency: being in touch with most Americans and their concerns.\nHillary hits the road\nBy the way, here are some of the more notable scheduling event on Hillary’s book tour:\nGoes to the Barnes & Noble in New York City (June 10)\nAttends Chicago Ideas Festival – interviewed by Rahm Emanuel (June 11)\nSpeaks at the World Resource Institute’s Courage to Lead luncheon in New York (June 12)\nSells books in Philly and DC (June 13)\nSells books in Pentagon City, VA (June 14)\nHolds a conversation on her book in Toronto, Canada and sells books at a Harvard book store in Cambridge, MA (June 16)\nHeads to the West Coast for book-selling events in Seattle and Edmonton, Alberta (June 18)\nGoes to Los Angeles (June 19)\nHolds a conversation in Austin, TX (June 20)\nHits Kansas City, MO (June 22)\nAttends the Clinton Global Initiative conference in Denver, CO (June 24)\nSells books in San Francisco (June 25)\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/graham-poised-remarkable-political-feat-n127231"}
