{"authors":[],"date_download":"2018-10-30 19:54:47","date_modify":"2018-10-30 19:54:47","date_publish":"2018-06-18 18:45:47","description":"Long before police found 78-year-old Millicent Williams’ body, she complained to DeKalb County officials that her grandson was mentally ill. Now, the Army vet may not stand trial in her alleged murder because of increasingly “psychotic behavior” since his arrest last summer, court filings show.","filename":"data/vaneerConsumption/GrandsonmaybejudgedincompetentfortrialinDeKalbwomansdeath.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/07/31/Images/newsEngin.19436867_072917-missing-grandma.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_grandson-psychot_1b1e29820cdf36f0259f958a6bbe1f34__1540929287.html","title":"Grandson may be judged incompetent for trial in DeKalb woman’s death","title_page":"Grandson may be judged incompetent for trial in DeKalb woman’s death","title_rss":"NULL","source_domain":"ajc.com","text":"Long before police found 78-year-old Millicent Williams’ body, she complained to DeKalb County officials that her grandson was mentally ill.\nNow, he may not stand trial in her alleged murder because of increasingly “psychotic behavior” and “delusional thoughts” since his arrest last summer, court filings show. The district attorney’s office agreed to let Gregory Williams, a 37-year-old Army veteran, be transferred from the county jail to a mental hospital for testing after a psychiatrist said he is incompetent to stand trial.\nDr. Matthew Norman wrote in a June 4 report that the defendant, who is charged with murder, has delusions and his “thoughts and psychotic behaviors (have) deteriorated as his trial has approached.”\nREAD: DeKalb Bloods gang members get long sentences for executing 2 women\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nREAD: ‘A murderer I am not’: Woman tells judge she was abused before killing\nThe trial is scheduled for July 16, though it may now be pushed back or, if the suspect is judged incompetent, cancelled.\nMillicent Williams disappeared late last July.\nHer grandson was soon found at a Kroger with her car, which had blood in the trunk, DeKalb police have said. Her home off Flakes Mill Road also had blood in it, enough that detectives believed she must’ve been dead even though they wouldn’t find her body off I-20 for several more weeks.\nGregory Williams is accused of forcing his way into her bedroom and attacking her with a “Rambo-style” knife, police said after his arrest.\nCourt and police records suggest a troubled relationship between grandmother and grandson. She said he suffered from PTSD after service in the Army and refused to take his medicine.\nThough his grandmother believed he’d served in Iraq, Gregory Williams was never deployed, the Army said.\nDaryl Queen, who is representing the suspect, said early in the case he was looking into his client’s mental state.\n“It is a sad and tragic set of events,” Queen said last year. “As has been previously reported by the family, Mr. Williams has a long history of mental illness, therefore we are addressing those issues at this time.”\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/grandson-psychotic-behavior-may-stop-trial-dekalb-woman-death/RjMuegZdewSe93Gk4BqBtJ/"}
