{"authors":[],"date_download":"2018-10-30 20:25:52","date_modify":"2018-10-30 20:25:52","date_publish":"2015-11-22 14:29:11","description":"The best Covington police can tell, the couple stole a car in Virginia and began their crime spree there.","filename":"data/vaneerConsumption/GrandsonofwomankilledatCovingtonWalMartSuspectsare.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/11/22/Videos/4626976948001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_grandson-wo_93e6c1d8123f9e3d1779c7e4288a790a__1540931152.html","title":"Grandson of woman killed at Covington Wal-Mart: Suspects are...","title_page":"Grandson of woman killed at Covington Wal-Mart: Suspects are...","title_rss":"NULL","source_domain":"ajc.com","text":"The best Covington police can tell, the couple stole a car in Virginia and began their crime spree there.\nThey made their way down I-95, targeting elderly women in Wal-Mart parking lots for violent purse snatchings along the way — North Carolina, Tennessee, South Carolina, Florida. Then they made their way to Georgia, I-20, Covington and Marsha Johnson.\nJohnson, 65, resisted Monday night in the parking lot of the Wal-Mart on Industrial Boulevard. Her assailants ran her over multiple times, killing her, and hit the road again.\nBut after days of intensive media coverage and a region-wide manhunt, the alleged crime binge finally ended Saturday afternoon. Suspects Brandon Shawn Smith, 27, and Stephanie Marie Rodriguez, 37, were arrested in Manchester, Tenn.\n“We’re ecstatic about what’s happened in this case,” Covington police Capt. Craig Treadwell said in a Sunday morning press conference.\nTreadwell said Smith and Rodriguez have been tied to “at least 10” purse snatchings and robberies across the Southeast, crimes dating back several weeks. After Johnson’s death, a discarded credit card led police to believe the duo may be in Tennessee, and detectives were there by Tuesday morning.\nA resident of Manchester saw a news story about the suspects before calling in a tip to the local police department Saturday, Treadwell said, and Smith and Rodriguez were arrested without incident during a traffic stop.\nThey were in the same damaged Honda Accord stolen in Virginia and captured on surveillance video in Covington, Treadwell said.\nThey’ve been charged with felony murder in connection with Johnson’s death and are awaiting extradition to Georgia. Police asked media members not to publish new booking photos of the suspects before investigations in other jurisdictions — and their related photo lineups — are completed.\nTreadwell said Smith and Rodriguez were speaking with detectives Sunday morning. A lot of questions about their alleged crime spree remained unanswered, but Treadwell said it was “the way they made their living.”\nCain Johnson chose stronger words to describe the people accused of killing his grandmother.\n“They’re pathetic,” he told Channel 2 Action News. “Going around robbing older women for maybe just a few bucks that they have left. They’re cowards.”","url":"https://www.ajc.com/news/crime--law/grandson-woman-killed-covington-wal-mart-suspects-are-cowards/RVcPu4WNUFQtQDXMahPDrI/"}
