{"authors":["Mary Kekatos For Dailymail.Com"],"date_download":"2018-10-23 05:24:40","date_modify":"2018-10-23 05:24:40","date_publish":"2017-03-16 16:18:53","description":"A new study, from a group of New York doctors, has found that grandmothers who interact with their grandchildren can lead to a quicker autism diagnosis - even before parents suspect what's wrong.","filename":"data/vaneerConsumption/GrandmothersspotautisminchildrenfirstsayNYdoctors.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E549FBB00000578-0-image-a-22_1489673524555.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4320306_Grandmothers-usually-spot-autism-children-first_1540272280.html","title":"Grandmothers spot autism in children first say NY doctors","title_page":"Grandmothers spot autism in children first say NY doctors | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Parents may think they know their children better than anyone, but a new study warns they may overlook tell-tale signs of autism.\nIn fact, grandmothers tend to be the family members that first identify the signs of autism spectrum disorder (ASD), scientists have found.\nThe research reveals that kids who frequently interact with their grandparents can reduce their age of diagnosis by up to five months.\nResearchers stress that this accelerated detection can lead to a quicker enrollment in treatments and therapies.\nAutistic children who interact with their grandmothers have a quicker diagnosis than kids who don't, a new study says\nThe study, conducted by a group of New York doctors, held an online survey with almost 500 parents of children with autism. In addition, follow-up surveys of almost 200 'friends and family' who were referred by parents, were carried out.\nParents reported that family members were integral catalysts in diagnosing their children with ASD.\nA quarter - 25 percent - of parents reported that others suspected their child might have a serious condition before they themselves did.\nAnd close to 50 percent of friends and family reported that they suspected that a child had a serious condition before they knew the concerns of the parents.\nMaternal grandmothers and teachers were those most likely to do so.\n'Many parents avoid seeking help to find a diagnosis for their child, even though they sense something might be wrong,' Dr Nachum Sicherman, a professor of business at Columbia Business School, told Futurity.\n'They often ignore signs of a larger problem and look the other way, making the role of close family members and friends vital to accelerating diagnosis and helping a child's condition.'\nHaving frequent interaction with a grandmother reduced the age of ASD diagnosis by about five months and, with a grandfather, the age was reduced by almost four months.\nPREGNANT WOMEN WITH HERPES ARE MORE LIKELY TO HAVE AUTISTIC CHILDREN Pregnant women with herpes are twice as likely to have autistic children, a study warned in February. Scientists said women who have a flare-up, or are infected with genital herpes early in their pregnancy, have twice the risk of giving birth to a child later diagnosed with autism. Past studies have assumed that children have been directly infected, but such infections are typically deadly. But Norwegian researchers found that a mother's immune response to either getting an infection or a flare-up causes neurodevelopmental problems in the unborn child.\nThe researchers found that family structure in general also played a big role in the age of diagnosis.\nFamilies that had just one child were diagnosed with ASD between six and eight months sooner.\nBut being the youngest child - and interacting with older siblings - reduced diagnosis age by almost 10 months, compared to children with only younger siblings.\nThe team said this could be because older children can serve as a reference point to see whether or not younger siblings are hitting developmental milestones on time.\n'We asked multiple friends and family members about the factors that may contribute to age of diagnosis of autism,' said Dr Joseph Buxbaum, a neuroscientist at the Icahn School of Medicine at Mount Sinai in New York.\n'We were troubled that about half of the friends and family who were concerned about a child were reluctant to share their concerns.\n'Importantly, frequent interaction with a grandparent, and particularly a grandmother, was associated with earlier diagnosis.'\nThe authors say that these findings suggest there are opportunities to achieve an earlier diagnosis by tapping into wisdom from friends and family.\nPast research has shown that speeding up the age of diagnosis can have long-term effects on a child's behavior and improve overall treatment, IQ and social behavior.","url":"https://www.dailymail.co.uk/health/article-4320306/Grandmothers-usually-spot-autism-children-first.html"}
