{"authors":["April Glover For Daily Mail Australia"],"date_download":"2018-10-23 00:05:50","date_modify":"2018-10-23 00:05:50","date_publish":"2017-03-10 05:46:20","description":"WARNING GRAPHIC IMAGES: Bill Andrews, 72, contracted a flesh-eating bacteria after he was in the Murray River with a sore on his leg - and worries about people swimming in the 'infected' river.","filename":"data/vaneerConsumption/GrandfatherattackedbyflesheatingbugfromMurrayRiver.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E202C8500000578-0-image-a-30_1489123809674.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299914_Grandfather-attacked-flesh-eating-bug-Murray-River_1540253150.html","title":"Grandfather attacked by flesh-eating bug from Murray River","title_page":"Grandfather attacked by flesh-eating bug from Murray River | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A grandfather contracted a flesh-eating algal bacteria while cleaning his boat and needed three skin grafts to save his leg from the agonising condition.\nBill Andrews, 72, was cleaning his boat in the river at Murray Bridge in South Australia with his grandson after a fishing trip when the flesh-eating bug seeped into a small cut on his leg.\nThree days later Mr Andrews woke up in 'excruciating' pain on his lower left leg and before collapsing to the floor.\nHe was then taken to Murray Bridge Hospital where doctors noticed his ankle had ballooned to twice its size and his skin was burning hot.\nBill Andrews, 72, was knee-deep in the Murray River when the flesh-eating bacteria got into an open sore\nAfter several days doctors saw his leg was not getting any better and he was rushed to Royal Adelaide Hospital where doctors identified the bug as shewanella - a form of marine bacteria.\nMr Andrews needed three skin grafts taken from the same leg - and he said doctors feared they would need to amputate as the bug was eating his flesh from 'the outside in'.\n'The pain was excruciating, it was like a saw was cutting off my leg and my foot had swelled so much doctors couldn't even wrap their hands around it,' Mr Andrews told Daily Mail Australia.\n'The doctors said the bacteria had gotten into my leg from a tiny scratch that I didn't even realise I had, I was only knee-deep in the water.'\nGraphic images shared by Mr Andrews shows the extent of the flesh-eating bacteria's effect on his leg, but the retired grandfather said after antibiotics it 'didn't really hurt as much'.\nThe grandfather said he is doing well after the operation which saved his leg from amputation - but he said he needed to learn to walk again\nMr Andrews said: 'The worst part was waiting for the surgery when the doctors would fast me all day and then tell me that night they had to wait another say.'\nThis went on for five days until local news media reported on the flesh-eating bacteria attacking Mr Andrews' leg and they bumped him onto a priority list.\n'My daughter is the CEO of Occupational Health and Safety here at the Lion's Brewery here in South Australia so she was making some calls to administration about how I needed the operation now,' Mr Andrews said.\nSpeaking to Daily Mail Australia about his recovery, Mr Andrews says he is healing well but effectively had to 'learn to walk again' and only just started putting his foot flat on the ground.\nThe flesh-eating algal bacteria - known as shewanella - attacked his leg from the outside in\nPeter Jolly form Sunnyside, SA also contracted a similar fleshing-eating bug - called necrotising fasciitis - however he does not know where he contracted it from.\nMr Jolly told Daily Mail Australia he bumped his leg at work before it became infected and the bug 'ate most of it'.\n'I'm pretty lucky to still have my leg, it's a quick reacting bug so I had to get a poly-foam skin graft and I'm getting more soon,' he said.\n'Doctors aren't sure if I got the virus from the Murray River or not.'\nMr Andrews lives close to the Murray River where he was cleaning his boat with his grandson - and says he is worried about the thousands that will be in the river on the long weekend\nAs Mr Andrews heals at his Murray Bridge home, he said he is worried about the thousands of people who will be exposed to the river this long weekend for the Adelaide Cup.\nHe said: 'We want to know how the South Australian government will stop people from getting infected in the river this weekend, especially kids.'\nSouth Australia Health Minister Jack Snelling told the public that there is 'no reason' for people to fear risking infection by swimming in the Murray River, but warned anyone with cuts or abrasions should cover up before entering the water.\n'If there's no infection in the water, then why tell people to cover up their cuts?' asked Mr Andrews.","url":"https://www.dailymail.co.uk/news/article-4299914/Grandfather-attacked-flesh-eating-bug-Murray-River.html"}
