{"authors":["Ashleigh Davis","Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 21:22:09","date_modify":"2018-10-22 21:22:09","date_publish":"2017-03-16 01:13:10","description":"A seven-year-old boy, who died after being hit by a truck while playing with his younger brother near a roadhouse in a small town in Western Australia's mid west, has been identified.","filename":"data/vaneerConsumption/GrandfatherofWAboyhitbytrucktriedtorevivehim.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4FF86E00000578-0-image-a-11_1489626559755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318388_Grandfather-WA-boy-hit-truck-tried-revive-him_1540243329.html","title":"Grandfather of WA boy hit by truck tried to revive him","title_page":"Grandfather of WA boy hit by truck tried to revive him | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The grandfather of a seven-year-old boy, who died on Tuesday after being hit by a truck in Western Australia, desperately tried to revive him at the scene.\nMichael Clarke was playing with his four-year-old brother Daniel outside their house, next door to a roadhouse.\nThe pair were on Midlands Road in Mingenew, 380km north of Perth, about 7.30pm when the incident took place, reported 7 News.\nMichael Clarke, 7, (right) was hit by a truck and killed on Tuesday night while playing with his brother Daniel, 4, (left) near a roadhouse. His grandfather Mick McCarthy (centre) tried to revive Michael at the scene but he died later in hospital\nMick McCarthy, the boys' grandfather and guardian who is a former paramedic, tried to save Michael's life before he was taken to Dongara Hospital with critical injuries.\nBut Michael was pronounced dead shortly after arriving in hospital.\nWA Police said the seven-year-old was hit at the intersection of Midlands Road and William Street and the driver did not stop at the time.\nMr McCarthy told The West Australian the two boys had run over to look at the truck when it was parked outside the roadhouse.\nThe incident took place on Tuesday night about 7.30pm outside a roadhouse (pictured) on the corner of Midlands Road and William Street in Mingenew, a town 380km north of Perth\nMr McCarthy said the two boys, who lived close to the roadhouse, had run out to look at the truck when it was parked. Police said it was possible the driver, who did not stop, was unaware he had hit the child\nHe said: 'The world has lost a beautiful human being.'\nPolice reportedly spoke to the driver on Wednesday and are not treating the incident as a hit-and-run, as it is possible the driver was not aware he had hit the boy.\nActing shire president Martin Whitely told 7 News the whole community was really affected by the death.\nMingenew residents are pictured comforting each other in the wake of the incident. Acting shire president Martin Whitely said the whole community was really affected by the death\nPolice (pictured near the scene) said they had spoken with the driver and it was not being treated as a hit-and-run incident at this stage\n'Our thoughts go out to the family and everyone in the community,' Mr White said.\nA local church displayed the message: 'We are praying for the family and our town'.\nMajor Crash officers would like to speak to anyone who saw the crash or any large truck in the area of the roadhouse prior to the incident.\nAnyone with any information is asked to call Crime Stoppers on 1800 333 000.","url":"https://www.dailymail.co.uk/news/article-4318388/Grandfather-WA-boy-hit-truck-tried-revive-him.html"}
