{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 03:17:24","date_modify":"2018-10-23 03:17:24","date_publish":"2016-01-11 15:57:42","description":"Four grannies who've never tried Fireball before taste it in a cute new clip. Two say they still like to drink on occasion with one recalling a party she had for the 'Spanish yachting team' back in the day.","filename":"data/vaneerConsumption/GrandmothersthrowbackshotsofFireballwhiskyforthefirsttimeinvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/08/22/2FEDEB3900000578-0-image-a-37_1452293061406.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3391045_That-warm-belly-Grandmothers-throw-shots-Fireball-whisky-time-admitting-don-t-drink-entertaining-video_1540264644.html","title":"Grandmothers throw back shots of Fireball whisky for the first time in video","title_page":"Grandmothers throw back shots of Fireball whisky for the first time in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Grandma might be old and frail these days, but there was a time that she was young and spry - and might have been able to drink you under the table.\nIn a funny new video by Obsev, four adorable grannies get up to their old habits, doing shots as they try Fireball for the first time.\nThough they each admit that they no longer drink like they used to, the taste test seems to have made them all fans of the popular cinnamon-flavored whisky - and perhaps gave them something to bond with their grandkids over.\nApprehensive: While some of the grandmas say they don't really drink at all anymore, one of the women (pictured right) admits to enjoying a nice glass of wine every day\nBack to her old ways: One of the grandmothers (pictured left) says she 'used to drink a lot', adding that her preferred spirit was always vodka\n'I will admit, I probably have something to drink every day, 'cause I like a glass of wine,' admits a blonde woman in a pink top who added that she favors a nice zinfandel.\n'But harder drinks, it's usually in a party mood, going out to dinner. It's part of my life, for sure.'\nA woman sitting next to her, who says she prefers Malbec, used to get spirited for spirits, too.\n'I love parties,' she says, before offering up a flashback that might make her grandkids blush. 'Been to a lot of exciting parties.\n'During the Olympics I had the entire Spanish yachting team to a big party in the backyard. That was very fun. Spaniards, you know.'\nThe camera then cuts to another pair of grannies, one of whom has a pair of reading glasses hanging around her neck.\nTasty: Fireball is a cinnamon-flavored whisky renowned for its slightly spicy aftertaste, which can make it feel as though your throat is burning when you drink it\nUh-oh: The grandmas all examine the bottle, growing a bit nervous about what the liqueur will taste like\nLightweights: When it's time to get pouring, they each only take about half a shot - with one grandma (right) saying even that's too much\n'I don't drink that much. I used to drink a lot,' she says, adding that her go-to was once a vodka martini. 'I guess sometimes holidays and stuff, a little drink here or there. But not excessive drinking.'\nThe woman next to her, in an orange sweater, says she doesn't drink anymore but did when she was younger. Back then, she liked scotch and water.\nNearing the moment of truth, the producers pull out a full bottle of Fireball, a whisky-based liqueur that's 33 per cent alcohol.\nEach of the pairs of women examine the bottle. One woman pulls the reading glasses of her neck to read it, and seems excited about the cinnamon flavor.\nParty girls: This grandma duo seems a bit more adventurous, with one (left) saying she once threw a party for the entire Spanish Olympic yachting team\nCheers! After sniffing it, the woman on the left says it has a 'distinct smell' and 'maybe it's the balls'\n'Tastes like heaven, burns like hell,' she reads. 'What happens next is up to you.'\nHer friend agrees that she likes cinnamon, but adds that she doesn't 'know about the \"burn like hell\" part'.\nEach of the ladies pour only about half a shot, seeming nervous to imbibe too much.\n'I don't smell anything too strong,' says the woman in the pink top as she sniffs the drink. Her friend disagrees, though, saying it has a distinct smell and adding with unintentional humor: 'Maybe it's the balls.'\nFinally, it's time to taste, with the woman in reading glass courageously tipping her shot glass back.\nThe brave one: The woman on the left doesn't hesitate to try her shot, taking just a sip\nIt burns! At first, she makes a face showing that it tastes good - before feeling the burning in her throat and starting to cough\n'Not bad,' she says after a small sip, going in for another before coughing.\n'It is hot,' she adds . 'Very fiery. It kind of tastes like a medicine-type-thing. Like a cinnamon hot medicine going down.'\nAfter trying it herself, the grandma in pink says: 'Oooh... my god. That'll warm your belly, that's for sure. Actually, it taste very nice.'\nHer friend reacts more strongly, crossing her eyes and saying it burns.\nThe woman in the orange sweater hesitates the longest, though when she finally takes a small sip, she says: 'It's actually good.'\nShe likes it! The grandma on the right makes an 'ooh' sound after taking her sip - and eventually goes back for more\nWhat a champ: This granny downs her shot like a pro before telling her companion that she should 'go out and dance now'\n'I could get to like this,' says the grandma in pink before clinking glasses with her friend and taking another sip. Her friend, clearly past the delicate sipping point, downs the rest of her shot glass with a gulp.\n'I don't think I could do that big gulp,' the grandma in pink says after seeing this. 'I'd have to take dainty little sips.'\nPerhaps feeling the full shot she downed, her friend says: 'I think we have to go out and dance now' before realizing she doesn't have a date.\n'Neither do I,' the pink-topped grandma reassures her.","url":"https://www.dailymail.co.uk/femail/article-3391045/That-warm-belly-Grandmothers-throw-shots-Fireball-whisky-time-admitting-don-t-drink-entertaining-video.html"}
