{"authors":["Press Association"],"date_download":"2018-10-23 04:05:14","date_modify":"2018-10-23 04:05:14","date_publish":"2017-04-26 15:44:09","description":"England and Wales Cricket Board chairman Graves made his bold pledge after the eight-team tournament was given the go-ahead.","filename":"data/vaneerConsumption/GraveshailsneweraafterT20competitionoverwhelminglyapproved.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465857-1493217853-679_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448130_Graves-hails-new-era-T20-competition-overwhelmingly-approved_1540267514.html","title":"Graves hails `new era´ after T20 competition overwhelmingly approved","title_page":"Graves hails `new era´ after T20 competition overwhelmingly approved | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Colin Graves believes English cricket’s new city-based Twenty20 competition will rival the Indian Premier League and Australia’s Big Bash.\nEngland and Wales Cricket Board chairman Graves made his bold pledge after the eight-team tournament was given the go-ahead by ECB members to start in 2020.\nDespite public opposition from Essex and Middlesex, the new tournament - which will complement English cricket’s existing domestic competitions, including the NatWest T20 Blast – was approved by a margin of 38 votes to three.\nAmendments to Articles of Association approved. A new T20 competition involving eight teams to be introduced in 2020https://t.co/bVrkla9HcB pic.twitter.com/jb27fBQGOF — England and Wales Cricket Board (@ECB_cricket) April 26, 2017\n“We are delighted that such an overwhelming majority of our members have voted to support the change to the ECB’s Articles (of Association),” Graves said.\n“In doing so, they have paved the way for an exciting new era for cricket in England and Wales.\n“We can now move on with building an exciting new competition for a new audience to complement our existing competitions – NatWest T20 Blast, Royal London One-Day Cup, the Specsavers County Championship and Kia Super League – plus the international formats, each with its own clear role to play.\n“Our clear ambition is that this new competition will sit alongside the IPL and Big Bash League as one of the world’s major cricket tournaments.”\n(Steven Paston/PA)\nThe new competition was agreed following a ballot involving all 18 first-class counties, the MCC, Minor Counties Cricket Association and 21 recreational boards.\nEach club will receive a £1.3million annual share of the tournament’s revenue in its first four years.\nAs well as the opposition of Essex and Middlesex, Kent abstained in the vote amid concerns about the impact on counties without Test-status grounds.\nBut Graves said: “Over the past year our members have seen the clear evidence outlining why an additional new T20 competition is the right way for cricket to reach new audiences, create new fans and drive the future of the game.\n“I passionately believe that the game has chosen the right path. Each of our members will benefit and, critically, so will the whole game.\n“The benefits it will bring can deliver a sustainable future for all 18 first-class counties and an exciting future for the game in England and Wales.”\nEssex chairman John Faragher insisted the county would now give their full support to the ECB despite having expressed opposition to the new T20 tournament, comparing it to the government’s Brexit negotiations following last summer’s Euro referendum.\n“We all have a duty to support and follow the ECB, that’s our role and that’s my job as chairman,” Faragher told Press Association Sport.\n“I did expect more support (in opposing the plans), I thought one or two might vote against it because I think a lot of people don’t believe it’s right for the game.\n“We stuck to our principles and what we believe is right for the game, but we will now do our utmost to make sure it’s a success.\nEngland captain Joe Root hopes the format would help capture a new audience (Tim Goode/PA)\n“It’s no different to Brexit in that sense.\n“We have a responsibility to the game and we will 100 per cent support it.”\nEngland Test captain Joe Root feels the streamlined city-based tournament is more about engaging with a new audience than aiding the development of English T20 players.\n“We might have a little bit of catching up to do, but in terms of producing international players I don’t think it has hampered us at all.” Root said.\n“We have had guys go out to those domestic tournaments (IPL, Big Bash) and be successful, and we have competed in T20 World Cups and got to the final last time round and won it once before.\n“I think more than anything it is about engaging with an audience and getting more people into sport, whether it is the other formats or whether it is a more family-orientated vibe then brilliant.\n“But I would like to think it would not detract from the other formats as well.”","url":"https://www.dailymail.co.uk/wires/pa/article-4448130/Graves-hails-new-era-T20-competition-overwhelmingly-approved.html"}
