{"authors":["Stephen Glover For The Daily Mail"],"date_download":"2018-10-22 21:46:38","date_modify":"2018-10-22 21:46:38","date_publish":"2017-03-16 02:00:57","description":"The latest blow comes from the Labour-controlled borough of Merton in South London. It intends to charge drivers of diesels £150 a year more than the standard £65 for a residents' parking permit.","filename":"data/vaneerConsumption/Greatdieseldebacleorhowdriversarepayingtheprice.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/14B7E445000005DC-0-image-a-105_1489629647699.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-4318590_Great-diesel-debacle-drivers-paying-price_1540244798.html","title":"Great diesel debacle (or how drivers are paying the price)","title_page":"Great diesel debacle (or how drivers are paying the price) | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hardly a week goes by without a local council somewhere in Britain introducing swingeing penalties on diesel cars\nHardly a week goes by without a local council somewhere in Britain introducing swingeing penalties on diesel cars, which are known to cause high levels of pollution.\nThe latest blow against blameless owners comes from the Labour-controlled borough of Merton in South London. It intends to charge drivers of diesels £150 a year more than the standard £65 for a residents' parking permit.\nThis follows an announcement by Tory-run Westminster City Council that in parts of the borough the hapless motorist with a diesel will have to pay an extra 50 per cent to park.\nIt's not just parking which is becoming more exorbitant. If you drive a diesel car built before 2005 — when they were even more polluting than they are now — from October 23, you will have to pay £21.50 a day to drive in central London, which is £10 more than for the owners of newer, cleaner cars.\nMeanwhile, in Liverpool, the council is drawing up plans for a 'clean air zone' which will impose restrictions on where diesel vehicles can be driven. People with such cars will effectively be banned from the city.\nWe can be certain that this is only the beginning of a growing campaign which will turn the screw on millions of hard-pressed people. If they had behaved selfishly or recklessly or done anything wicked, they would deserve to be punished. But they haven't, and they don't.\nVery far from it. Motorists have been encouraged by various government-inspired incentives to buy diesel cars. Almost unbelievably, they are still being lured with cheaper road tax — even as councils are queuing up to clobber them.\nIn fact, in proselytising on behalf of diesels, the authorities have shown less good sense and decency than the most unreliable and slippery second-hand car salesman you could imagine.\nBack in the early Nineties, diesels were a niche product driven by one in 20 motorists. Then came the 1997 Kyoto agreement on climate change, which obliged developed countries to cut carbon emissions by 8 per cent over 15 years in an effort to slow global warming.\nDiesel cars emit about 15 per cent less carbon dioxide than equivalent petrol models. So the European Union and the Labour government did everything in their power to entice us to buy them.\nIn 2001, Chancellor Gordon Brown lowered Vehicle Excise Duty for diesels. He also reduced the duty on diesel to encourage motorists to switch from petrol. Both measures achieved their aim.\nThe idea spread by ministers was that those who plumped for diesel were being greener. They were being environmentally conscious and socially responsible and doing the right thing for the planet.\nBut of course they weren't. Diesels spew out vastly more nitrogen oxide and nitrogen dioxide than petrol cars, both of which gases can be damaging.\nIn 2001, Chancellor Gordon Brown (pictured here) lowered Vehicle Excise Duty for diesels\nAnd they produce at least 22 times more particulates — the minute toxic particles that penetrate lungs, brains and hearts.\nWhat is so shocking about this shameful tale is that even as the Government was doing its utmost to make us to buy diesels, there was plenty of evidence that they caused much more harmful pollution than petrol cars.\nA report, published as long ago as 1993 by the Department of the Environment, was fully aware of the potentially lethal effects. The European Respiratory Journal published a review of various studies in 2001 which had linked diesel emissions to lung problems in humans and animals.\nA couple of years ago, an unidentified former senior civil servant let the cat out of the bag to The Guardian newspaper. He said that 20 years ago the choice was 'between killing people today rather than saving lives tomorrow'.\nIn other words, in order to reduce the alleged long-term damage of global warming, ministers advocated diesel engines in the knowledge they might kill people. Experts differ, but some put the annual death toll as high as 7,000.\nIf there was ever a need for an inquiry, there should be one into the scandal of how government and civil servants promoted diesel cars when they were fully aware of their dangerous characteristics. There never will be one, of course.\nIsn't it nonetheless pretty mind-boggling — given the disgraceful role of the authorities in this saga — that the State in the form of local councils should now be punishing people whose only sin is to have done what the man in Whitehall told them to?\nChris Grayling, (pictured) the Secretary of State for Transport, is reportedly considering a scrappage scheme for diesel cars such as has been piloted in France\nAnd it seems to me no less amazing that, while motorists are being increasingly penalised with extra charges, the Government is still responsible for the proliferation of diesels by reducing Vehicle Excise Duty on cars that emit lower carbon dioxide.\nHow I bless my good fortune that when I was contemplating buying a diesel car a couple of years ago — partly because I was attracted by the much lower rate of duty — I was overruled by my wife.\nBut many people have not been so lucky. About half the cars bought last year were diesels. There are now nearly 12 million of them in this country. It's true that newer models produce fewer damaging particulates, but they are still emitting many times the official limit for polluting nitrogen oxides.\nCar manufacturers such as Volkswagen have, of course, colluded in the grand deception perpetrated by government by falsifying their data — pretending that their diesel emissions were far lower than they are.\nNo, the truth is that the powers-that-be are quite simply guilty of a breach of promise. They induced millions of us to buy one type of car over another without disclosing the truth. Drivers are now discovering that there is a heavy cost to taking official guidance.\nIt's utterly unfair. And unless the Government recognises this fact, and admits that very bad advice was given, the disenchantment many people feel for their politicians — the sense they can't be trusted — will continue to grow.\nChris Grayling, the Secretary of State for Transport, is reportedly considering a scrappage scheme for diesel cars such as has been piloted in France. There, drivers receive about £3,500 for handing in an old diesel and buying a new, cleaner vehicle.\nIt's a good idea, and if adopted here could go some way towards soothing people who rightly believe they have been hard done by. The trouble is that in France, and presumably in Mr Grayling's plan, the deal only applies to older vehicles.\nYet even people who have just bought diesels are being caught by the discriminatory measures introduced by councils. Indeed, the writing is probably on the wall for all diesel cars unless someone can find a way of minimising their polluting effects.\nThe sooner Mr Grayling reduces incentives for buying them, the better it will be. It is literally crazy that while some councils are planning to ban any diesel car, the Government should be still encouraging drivers to buy them by offering lower Vehicle Excise Duty.\nWhy not tell the truth? There has been a monumental cock-up. The supposed dangers of climate change led ministers to disregard the perils of diesel pollution on our streets. And millions of drivers are being made to pay a very high price for their incompetence and dishonesty.","url":"https://www.dailymail.co.uk/debate/article-4318590/Great-diesel-debacle-drivers-paying-price.html"}
