{"authors":["Eleanor Crooks Press Association Sport Tennis Correspondent"],"date_download":"2018-10-23 02:47:46","date_modify":"2018-10-23 02:47:46","date_publish":"2017-03-10 12:04:49","description":"Great Britain's Fed Cup team, captained by Anne Keothavong, will head to the Black Sea city of Constanta to take on Romania's team in next month's World Group II play-off.","filename":"data/vaneerConsumption/GreatBritainsFedCuphandedtoughawaytriptoRomania.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/04608574000003E8-0-image-a-58_1489147303129.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-4300852_Great-Britain-s-Fed-Cup-handed-tough-away-trip-Romania_1540262866.html","title":"Great Britain's Fed Cup handed tough away trip to Romania","title_page":"Great Britain's Fed Cup handed tough away trip to Romania | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Great Britain's Fed Cup team will head to the Black Sea city of Constanta to take on Romania in next month's World Group II play-off.\nThe home city of Romanian number one Simona Halep will host the tie on outdoor clay at the Tenis Club IDU on April 22-23.\nBritain are looking to return to the elite level of the competition for the first time since 1993 but will go into the tie as heavy underdogs.\nGreat Britain's Fed Cup team, captained by Anne Keothavong (centre) pose in Tallinn, Estonia\nCaptain Anne Keothavong, in her first season in the role, will hope to be able to call on Johanna Konta but the world number 11 is not at her best on clay.\nFourth-ranked Halep, who has already said she will play in the tie, is a former French Open finalist while Romania have four other players in the top 100.\nJohanna Konta (right) talks to Heather Watson (left) during a Fed Cup playoff match last month\nBritish number two Heather Watson is currently ranked 108 but has a very good record in Fed Cup with 25 wins and only seven losses.\nWatson was unbeaten in last month's Europe/Africa Zone group, when Britain won four matches, including a nail-biting play-off against Croatia, to set up the Romania clash.\nSimona Halep is Romania's number one and is currently fourth in the WTA Tennis Rankings\nIt is the third time Britain have reached the World Group II play-offs in the last six years, with the team then captained by Judy Murray losing to Sweden and Argentina in 2012 and 2013 respectively.","url":"https://www.dailymail.co.uk/sport/tennis/article-4300852/Great-Britain-s-Fed-Cup-handed-tough-away-trip-Romania.html"}
