{"authors":["Daisy Dunne For Mailonline","Press Association"],"date_download":"2018-10-23 04:07:10","date_modify":"2018-10-23 04:07:10","date_publish":"2017-03-10 14:13:06","description":"Experts from The Great Barrier Reef Marine Park Authority, from Queensland, Australia, discovered that there has been shocking levels of bleaching in the central part of the coral habitat.","filename":"data/vaneerConsumption/GreatBarrierReefagainishitbymasscoralbleaching.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23913500000578-0-image-a-15_1489161444710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4301426_Mass-coral-bleaching-hits-Great-Barrier-Reef-again_1540267630.html","title":"Great Barrier Reef again is hit by mass coral bleaching","title_page":"Great Barrier Reef again is hit by mass coral bleaching | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scientists in Australia have revealed unprecedented damage to the Great Barrier Reef, warning 'we are entering uncharted territory'.\nSurveys have shown the coral reef is entering its second year of year bleaching for the first time.\nBleaching happens when algae that lives in the coral is expelled due to stress caused by extreme changes in temperatures, turning the coral white and putting it at risk of dying.\nScroll down for video\nThe Great Barrier Reef has been struck by a deadly blast of coral bleaching, causing turning coral to turn a translucent white colour (pictured)\nWHY DOES CORAL BLEACHING HAPPEN? Corals have a symbiotic relationship with a tiny marine algae called 'zooxanthellae' that live inside and nourish them. When sea surface temperatures rise, corals expel the colourful algae. The loss of the algae causes them to bleach and turn white. While mildly bleached corals can recover if the temperature drops and the algae return, severely bleached corals die.\nThe first aerial survey of 2017 has found shocking levels of bleaching in the central part of the reef, the Great Barrier Reef Marine Park Authority said.\nMarine Park Authority director of reef recovery Dr David Wachenfeld said: 'Mass bleaching is occurring on the Great Barrier Reef for the second consecutive year.\n'How this event unfolds will depend very much on local weather conditions over the next few weeks.'\nHe said not all bleached coral would die, and last year revealed bleaching and mortality could be highly variable across the vast marine park, a World Heritage Site which covers an area larger than Italy.\nThe Great Barrier Reef is the world's largest collection of coral reefs, with 400 types of coral, 1,500 species of fish and 4,000 mollusc species, and is the habitat of wildlife such as the dugong – sea cow – and the large green turtle.\nBleaching happens when algae that lives in the coral is expelled due to stress caused by extreme and sustained changes in sea temperatures\nConditions on the reef are part of a global coral bleaching event over the past two years, as a result of unusually warm ocean temperatures due to climate change and a strong El Nino weather phenomenon which pushes temperatures up further.\nDr Neal Cantin, from the Australian Institute of Marine Science (AIMS), said the recurrence of widespread coral bleaching in back-to-back summers indicated there was not enough time since 2016's extreme heat event for the corals to fully recover.\n'We are seeing a decrease in the stress tolerance of these corals,' he said. 'This is the first time the Great Barrier Reef has not had a few years between bleaching events to recover.\nMap showing the extent of coral bleaching along The Great Barrier Reef off the coast of Queensland, Australia\nWhen algae is expelled, coral turns white and is put at risk of dying if conditions do not return to normal\nScientists said the disaster provides 'the starkest evidence that climate change is already wreaking havoc on the ocean'\n'Many coral species appear to be more susceptible to bleaching after more than 12 months of sustained above-average ocean temperatures.\n'We are now entering uncharted territory.'\nJohn Tanzer, from WWF International, said: 'What is unfolding before our very eyes is the starkest evidence that climate change is already wreaking havoc on the ocean.\n'Coral reefs are a beloved natural wonder but less appreciated is that they also directly support the jobs, livelihoods and food supplies of many millions of people. What will happen to these people as large areas of coral die?'\n‹ Slide me › Coral bleaching has seen healthy corals (left) on the Reef slowly turn a white, fluorescent colour (right)\nThe Great Barrier Reef is the habitat of threatened wildlife such as the dugong – a rare sea cow – and the large green turtle\nHe called for a major lift in action to bring down carbon emissions, and scaled efforts to reduce local pressures on reefs so they have the best chance of withstanding climate change.\nBrett Monroe Garner, a conservation photographer and marine biologist documenting the bleaching with Greenpeace, said: 'I've been photographing this area of the reef for several years now and what we're seeing is unprecedented.\n'Just a few months ago, these corals were full of colour and life. Now, everywhere you look is white. The corals aren't getting the chance to bounce back from last year's bleaching event. If this is the new normal, we're in trouble.'","url":"https://www.dailymail.co.uk/sciencetech/article-4301426/Mass-coral-bleaching-hits-Great-Barrier-Reef-again.html"}
