{"authors":["John Hayward"],"date_download":"2018-10-30 20:49:11","date_modify":"2018-10-30 20:49:11","date_publish":"2015-02-01 14:49:47","description":"European finance ministers worried that Greece's new far-left government would renege on the terms of previous bailout packages, while demanding even more debt to finance wild new spending programs, were given fresh reason for concern when the new Greek finance minister announced his government would not negotiate bailout terms with the European Union or International Monetary Fund. |","filename":"data/vaneerConsumption/GreeceRefusestoNegotiateBailoutwithEUIMF.json","image_url":"https://media.breitbart.com/media/2015/01/Tsipris_Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_01__1540932551.html","title":"Greece Refuses to Negotiate Bailout with EU, IMF","title_page":"Greece Refuses to Negotiate Bailout with EU, IMF | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"European finance ministers worried that Greece’s new far-left government would renege on the terms of previous bailout packages, while demanding even more debt to finance wild new spending programs, were given fresh reason for concern when the new Greek finance minister announced his government would not negotiate bailout terms with the European Union or International Monetary Fund.\nInstead, as the BBC reports, finance minister Yanis Varoufakis wants to bypass those international financial bodies and speak directly with individual European leaders, in an effort to dump at least half of Greece’s accumulated debt.\nThis idea was not warmly received by Eurozone financial head Jeroen Dijsselbloem, who spoke of the EU and Greece’s “mutual interest in the further recovery of the Greek economy inside the Eurozone” and, according to the BBC, “warned Athens against acting unilaterally in its efforts to renegotiate its bailout.”\nGerman Finance Minister Wolfgang Schaeuble was more blunt and less diplomatic about saying what he thinks the new Greek government is up to: “There’s no arguing with us about this and, what’s more, we are difficult to blackmail.”\nReuters reports that France and Italy do not seem receptive to Greece’s debt write-off plans either, although they are in favor of relaxing the “austerity” provisions of the bailout package, which restrained Greek government spending. The French are said to be open to debt relief measures such as renegotiating interest rates, but not forgiving a huge portion of Greek debt outright.\nGreece’s new socialist Prime Minister Alexis Tsipras has “raced ahead with a series of anti-bailout moves including reinstating thousands of public servants laid off by the previous government as well as canceling privatizations,” according to Reuters. In fact, the heads of the state privatization agency were fired, even as an army of other public servants were re-hired with money Greece doesn’t have.\nWhere, exactly, does Tsipras plan to get the money for his spending spree, if the Europeans prove as resistant to blackmail as Germany vows? The Reuters article says the Tsipras government is making many promises about running a balanced budget, but their spending plans do not match up very well with the tax revenue Greece’s economy can provide. There’s another 7.2 billion euros of bailout money from the last agreement on the line, 10 billion euros in debt repayments are coming due this summer, and it is hard to imagine anyone would be eager to lend the Tsipras regime more money if he makes good on his threats.\nForeign investors will not be rushing to bring capital to Greece, either, especially if the socialists act on the ominous noises they have been making about the Skouries gold mine, a Canadian project that represents one of the biggest foreign investments in the country. Krista Muhr, vice president of Toronto’s Eldorado Gold Corporation, which owns 95 percent of the mine and was planning to plow another $200 million into the project this year, did her best to put on a happy face, as quoted by Reuters: “We have our permits, so we’re legally entitled to continue our operations and development projects there, so it’s business as usual at this point. I don’t think we would continue investing money into Greece if we weren’t confident.”\nHowever, the markets were looking much less confident after Panagiotis Lafazanis, the former Communist who ended up as the Greek energy minister – and is said to be even more radical than Tsipras – snarled that his government is “absolutely against” the gold mine, ostensibly for environmentalist reasons, and would “examine our next moves on it.” Eldorado stock promptly tumbled to a six-year low.\nThe optimistic read on these early moves by the new Syriza Party government is that Greece and European financial authorities are clearing their throats, flexing their muscles, and pushing just hard enough to learn if the other side is willing to push back. European ministers are mostly still talking about how much they look forward to working with Tsipras, but their smiles are beginning to look a bit strained, and the backstage talk grows more surly. Greece has hit the point where its debt is a weapon; as the old saying goes, if you owe the bank a bit of money, you have a problem, but if you owe the bank a lot of money, the bank has a problem. How much are the EU and private investors willing to pay, in order to keep Tsipras from doing something crazy with that mountain of I.O.U.s he’s sitting on? We might be about to find out.","url":"https://www.breitbart.com/national-security/2015/02/01/greece-refuses-to-negotiate-bailout-with-eu-imf/"}
