{"authors":["Associated Press"],"date_download":"2018-10-23 04:15:03","date_modify":"2018-10-23 04:15:03","date_publish":"2017-03-16 15:29:33","description":"ATHENS, Greece (AP) - Greece's unemployment rate is rising again, reaching 23.6 percent in the last quarter of 2016 - up one percentage point on the...","filename":"data/vaneerConsumption/GreekunemploymentupagaininOctDechits236percent.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229219-1489678180-787_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320722_Greek-unemployment-Oct-Dec-hits-23-6-percent_1540268103.html","title":"Greek unemployment up again in Oct-Dec, hits 23.6 percent","title_page":"Greek unemployment up again in Oct-Dec, hits 23.6 percent | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ATHENS, Greece (AP) - Greece's unemployment rate is rising again, reaching 23.6 percent in the last quarter of 2016 - up one percentage point on the quarter.\nGreece's statistical authority said Thursday that the number of jobless was 1.12 million in October-December, compared with 1.09 million in the third quarter of 2016.\nGreece's unemployment rate is the highest in the European Union and hit record levels during the country's seven-year financial crisis, reaching 27.8 percent in early 2014.\nVisually impaired demonstrators march through the streets of the Greek capital during an anti-austerity rally in Athens, Thursday, March 16, 2017. Hundreds of people with disabilities took to the streets to protest against government's austerity measures which affect their income and state subventions. (AP Photo/Yorgos Karahalis)\nThe economy has suffered amid long delays in the government's talks with international creditors on getting the latest batch of bailout loans. Economic output fell 1.2 percent on the quarter in October-December.\nThe statistical authority said 72 percent of Greece's jobless have been out of work for at least a year.\nA visually impaired woman assists her husband to button up his coat during an anti-austerity rally in Athens, Thursday, March 16, 2017. Hundreds of people with disabilities took to the streets to protest against government's austerity measures which affect their income and state subventions. (AP Photo/Yorgos Karahalis)","url":"https://www.dailymail.co.uk/wires/ap/article-4320722/Greek-unemployment-Oct-Dec-hits-23-6-percent.html"}
