{"authors":["Frances Martel"],"date_download":"2018-10-30 20:46:50","date_modify":"2018-10-30 20:46:50","date_publish":"2015-04-08 15:14:18","description":"The government of Greece's Radical Left Prime Minister Alexis Tsipras has been demanding Germany pay reparations to the nation for damage committed by the Nazis during World War II for months, but now they have officially calculated a fixed amount they would like back: 279 billion euros. |","filename":"data/vaneerConsumption/GreeceGermanyOwesAthens279BillionEurosinWWIIReparations.json","image_url":"https://media.breitbart.com/media/2015/04/world-war-II-monument-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_08__1540932410.html","title":"Greece: Germany Owes Athens 279 Billion Euros in WWII Reparations","title_page":"Greece: Germany Owes Athens 279 Billion Euros in WWII Reparations | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The government of Greece’s Radical Left Prime Minister Alexis Tsipras has been demanding Germany pay reparations to the nation for damage committed by the Nazis during World War II for months, but now they have officially calculated a fixed amount they would like back: 279 billion euros.\nThe sum, which amounts to around $300 billion, is the first such total announced, though Tsipras has mentioned reparations generally repeated during negotiations regarding Greece’s astronomical debt to the European Union. CNN notes that the reparations demand is slightly more than the total Greece owes the EU: 240 billion euros, the amount Greece borrowed in two bailout packages in 2010 and 2011. While the Greek government claims it calculated its reparations sum from a combination of damage incurred by the Nazi occupation during WWII and a large loan Greece was forced to make to Nazi Germany that was never repaid, it is worth noting that the sum would clear Greece’s debt with the EU and leave money to spare for investment in rebuilding the economically critical nation.\nThe CNN report on the new reparations sum notes that Germany has already paid Greece reparations for atrocities experienced while it was occupied by the Nazis: 115 million marks. The German government also paid individual Greeks who were considered extraordinary victims of Nazi Germany. CNN notes that Tsipras has rejected this reparations sum as covering all the damage Greece incurred during the occupation: “The 1960 agreement provided reparations only for the victims of Nazism in Greece, not for the damage inflicted on the country itself.”\nThe last time Tsipras raised the reparations issue, while on a visit to Berlin, the German government categorically rejected it. Now, with a sum in hand, the Germans appear even more committed to denying the claim. German Economy Minister and Deputy Chancellor Sigmar Gabriel called the demand “quite frankly, stupid,” adding that Greece’s debt to the European Union in 2015 “has absolutely nothing to do with the Second World War or the war reparations.”\nTsipras’ government has confirmed that it will be able to pay its first installment to the EU on Thursday, which until this week remained unclear. Reports began to circulate that Greece may have been preparing to use the upcoming Orthodox Easter holiday to exit the eurozone, replacing the euro with the traditional drachma (or Bitcoin!) over the long weekend. Should Greece prove able to repay its debts, at least piecemeal, there is no evidence that such ability will silence the Syriza government’s call for reparations.\nTsipras himself is currently in Moscow at the invitation of President Vladimir Putin. The Greek government has on multiple occasions claimed the visit was strictly one for trade reasons, not to request more loans to pay off the EU. Greek Finance Minister Yanis Varoufakis stated before Tsipras’ visit that Greece’s debt woes would be solved “within the European family,” with Tsipras himself saying in Moscow today that Greece “is not a beggar that turns to countries seeking a solution to the financial problem. The problem is European.”\nWhile the issue of reparations did not explicitly come up today, the Ta Nea report on Tsipras’ Moscow visit notes that the Greek Prime Minister took time to lay a wreath at Russia’s Tomb of the Unknown Soldier in Red Square. Calling it a “pleasure” to “pay tribute to millions of ordinary people who gave their lives for the great decisive victory of the peoples of Europe,” presumably against Nazi Germany and its allies, Tsipras claimed that Greece “in proportion to its population, took the heaviest toll” in World War II.","url":"https://www.breitbart.com/national-security/2015/04/08/greece-germany-owes-athens-279-billion-euros-in-wwii-reparations/"}
