{"authors":[],"date_download":"2018-10-30 21:58:01","date_modify":"2018-10-30 21:58:01","date_publish":"2015-12-09 09:52:57","description":"Greek police started removing hundreds of migrants stranded on the Greece Macedonia border and blocking rail traffic on Wednesday","filename":"data/vaneerConsumption/GreeceStartsRemovingStrandedMigrantsAtMacedoniaBorder.json","image_url":"https://media.breitbart.com/media/2015/11/AP_486606668061.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_09__1540936681.html","title":"Greece Starts Removing Stranded Migrants At Macedonia Border","title_page":"Greece Starts Removing Stranded Migrants At Macedonia Border","title_rss":"NULL","source_domain":"breitbart.com","text":"IDOMENI, Greece (Reuters) – Greek police started removing hundreds of migrants stranded on the Greece Macedonia border and blocking rail traffic on Wednesday, a police official and a Reuters eyewitness said.\nSome 1,200 people mostly from Pakistan, Morocco and Iran, were stuck near the northern Greek town of Idomeni, demanding to cross into Macedonia to reach northern Europe after non-EU Balkan states began filtering migrants by nationality.\nThe police official said the migrants would be taken to Athens on buses and will be accommodated in migration centres before being sent back to their home countries.\nHundreds of thousands of people streamed into Europe this year, mostly through Greece, but Balkan states began blocking passage last month to all but Syrians, Iraqis and Afghans, who are considered as refugees because they are fleeing war zones.\nClashes have flared in the last two weeks between police and stranded migrants blocking the Greek-Macedonian crossing for refugees and the railway line running between the two countries. A Moroccan man was electrocuted to death on the line last week.\nMacedonia has erected a metal fence to keep others out and plans to extend it to cover more than 40 km (25 miles) of the border.\nMore than 600,000 people have arrived in Greece this year by making the short but perilous journey by boat or rubber dinghy from Turkey to outlying islands. Thousands more have drowned.\nIn another such incident, Greek coastguard recovered the bodies of 11 people, including five children, after their wooden boat sank off the island of Farmakonisi in the early hours on Wednesday, a coastguard official said.\nSome 23 people were rescued, while 13 were still missing, the official added.","url":"https://www.breitbart.com/europe/2015/12/09/greece-starts-removing-stranded-migrants-at-macedonia-border/"}
