{"authors":[],"date_download":"2018-10-30 21:56:31","date_modify":"2018-10-30 21:56:31","date_publish":"2016-03-07 10:22:47","description":"Greek Prime Minister Alexis Tsipras on Sunday demanded the \"urgent\" relocation of thousands of refugees to other EU countries, as neighbouring Macedonia further tightened a border blockade trapping them in his country.","filename":"data/vaneerConsumption/GreeceSaysEUMigrantSharingIsAbsoluteEmergency.json","image_url":"https://media.breitbart.com/media/2016/03/Screen-Shot-2016-03-05-at-12.03.44.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_07__1540936591.html","title":"Greece Says EU Migrant Sharing Is 'Absolute Emergency'","title_page":"Greece Says EU Migrant Sharing Is 'Absolute Emergency' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(AFP) – Greek Prime Minister Alexis Tsipras on Sunday demanded the “urgent” relocation of thousands of refugees to other EU countries, as neighbouring Macedonia further tightened a border blockade trapping them in his country.\nHe made the call on the eve of a crucial EU-Turkey migration summit in Brussels on Monday.\n“The immediate start of a reliable procedure to relocate refugees from our country to other EU states is an absolute emergency,” Tsipras told leaders of his leftist Syriza party.\n“This is what we’ll pursue on Monday,” he added.\nGreece is at the heart of Europe’s greatest migration crisis since World War II after a series of border restrictions on the migrant trail from Austria to Macedonia caused a bottleneck on its soil.\nEU leaders will push Turkey at a summit in Brussels on Monday to agree to “large-scale” deportations of economic migrants from Greece, which is bracing for a fresh surge of migrant and refugee arrivals by the end of March.\nThe Greek government on Sunday said there were over 33,000 refugees and migrants in the country including over 6,000 on the islands facing Turkey.\nIt added that over 17,000 extra places would be created in relocation camps over the coming week.\nTsipras said the upheaval was due to “senseless interventions” and “contribution to imperialist conflict” by Western states — an apparent reference to the 2003 Iraq war and its repercussions.\nAnd he attacked other EU states and fellow Balkan countries who had failed to apply EU decisions on how to manage the problem.\n“We are the only country to has applied decisions and responsibilities jointly undertaken by countries on the Balkan route in October,” he said.\n“We will continue to give what little we have to…hunted and persecuted people who need it. But it is self-evident that a small country like Greece cannot shoulder all of Europe’s burden in this crisis,” Tsipras added.\nMacedonia further tightened its controls on Sunday, only allowing around 160 people through, a daily number that has gradually fallen during the week.\nOn Sunday, a Doctors Without Borders source at the border said Skopje was only allowing access to Syrians and Iraqis from areas directly affected by conflict. For example, Damascus and Baghdad were considered safe areas, the source said.\nA Greek police source said the practice had begun earlier this week.\nTsipras, who travels to Turkey for talks on Tuesday, said he would seek a re-evaluation of bilateral accords on the readmission of migrants not entitled to asylum.\n“It is necessary to immediately activate a new agreement to hasten and bolster the readmission procedure,” the Greek premier said, whilst stressing that the road should also be opened for direct acceptance of refugees in Turkey by EU states.","url":"https://www.breitbart.com/europe/2016/03/07/greece-says-eu-migrant-sharing-is-absolute-emergency/"}
