{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-22 23:29:11","date_modify":"2018-10-22 23:29:11","date_publish":"2016-01-29 11:19:57","description":"The opportunistic bird, seen in St Helens, Merseyside, appears to have got bored of trying to catch fish and instead turned its attention to the rodent","filename":"data/vaneerConsumption/GreedyherondrownsatwofootgiantRATandswallowsitwhole.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1C5F500000578-0-image-a-38_1454066391366.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422527_Moment-greedy-heron-drowns-two-foot-giant-RAT-swallows-whole_1540250951.html","title":"Greedy heron drowns a two-foot giant RAT and swallows it whole","title_page":"Greedy heron drowns a two-foot giant RAT and swallows it whole | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a heron drowns a two-foot long rat in a pond before swallowing the rodent whole.\nThe long-legged birds are commonly seen wading in Britain's rivers and lakes, patiently waiting to catch fish to eat.\nBut this opportunistic bird, spotted in St Helens, Merseyside, appears to have got bored of dealing with slippery fish and instead turned its attention to the unfortunate rat.\nPredator: A wildlife photographer looked on astonished after this hungry heron caught a rat in its long beak\nMouthful: After drowning the rodent under water, the wading bird then picked it up in its beak and ate it whole\nStomach-ache: The two-foot rat was hanging out the heron's mouth before it swallowed it in seconds\nFather-of-two Steve Jones, 59, photographed the heron narrowly missing out on a large fish when he was astonished to watch it decide to attack the rodent.\nHe said the bird grabbed the rat in its beak before holding it under water during a five-minute struggle.\nAfter eventually getting the rat positioned correctly in its beak, the heron then swallowed it in one go.\nMr Jones, a retired joiner, said: 'It was amazing to watch the heron get hold of this two foot long huge fish and try to swallow it whole. It was thrashing around everywhere trying to get away.\n'The heron tried the fish every which way round, trying to get it to go down its throat but it was just too big. It's one of the few things I have seen to defeat a heron this determined as the battle went on for a good five minutes.\n'But it wasn't finished as it was clearly still hungry. It suddenly found a huge rat that was near the side of the pond and took it in its beak to the edge of the water.'\nFish out of water: Herons are usually associated with quietly waiting in British rivers to catch fish\nOne that got away: The heron which ate the rat had earlier tried to catch a large fish in the St Helens pond\nTry again: But the slippery fish managed to get away from the bird and dived back into the water\nMr Jones added: 'The rat was a hell of a size, its body was at least 18 inches and then it had a huge tail on it too so it must have been two feet long in total but it was no match for this hungry heron.\n'The heron began holding it under water to drown it. It kept pulling the rat out every 30 seconds or so to check on it and when it moved it would dunk it back under.\n'It was quite a horrific process and lasted for a gruelling five minutes. The rat certainly put up a fight gasping for breath but it was only a matter of time.\n'Once it was dead the heron wasted no time flipping it round and swallowing it whole.\n'It is the most bizarre sight I have ever seen but herons shouldn't be underestimated - they are very intelligent and will eat a wide variety of things if necessary. They clearly have no problem eating rats - not matter what the size'\nUsual meal: The heron was tantalizingly close to catching the fish shortly before he turned on the rat\nDon't choke: The heron seemed willing to take on large prey, with the fish barely fitting in its mouth","url":"https://www.dailymail.co.uk/news/article-3422527/Moment-greedy-heron-drowns-two-foot-giant-RAT-swallows-whole.html"}
