{"authors":[],"date_download":"2018-10-30 14:34:02","date_modify":"2018-10-30 14:34:02","date_publish":"2015-06-13 00:00:00","description":null,"filename":"data/vaneerConsumption/GreeceAlessoninsocialistfailure.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_greece_a_lesson_in_socialist_failure_comments_1540910042.html","title":"Greece: A lesson in socialist failure","title_page":"Blog: Greece: A lesson in socialist failure","title_rss":"NULL","source_domain":"americanthinker.com","text":"Greece has become an object lesson in how not to run an economy. This week, the International Monetary Fund packed up and left its negotiations with far-left Greek prime minister Alexis Tsipras over his absolute intransigence on the issue of necessary fiscal reforms. \"There has been no progress in narrowing these differences,\" IMF spokesman Gerry Rice said Thursday. Basically, the IMF and the EU want some assurances that Greece will cut its spending from its current socialist-dream levels to a more rational basis before they grant the nation another $8.2 billion in loans. The first Greek problem is that a huge percentage of its able-bodied population is not working and simply collecting state pensions. It goes without saying that Greece’s economy is in recession, and its official unemployment rate is 26.6%, something the U.S., for example, hasn’t seen since the Great Depression. But fully four fifths of Greece’s budget goes to... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/06/greece_a_lesson_in_socialist_failure_comments.html"}
alone. The second problem is that Greek taxes are sky-high, killing incentives for hard work, enterprise, and industry. It seems likely that so few people are bothering to work because so much of their income is sacrificed to other people’s pensions and government wages. The IMF’s Rice pointed out that \"[t]he policy of increasing already-high rates on a low tax base again is not sustainable. It is critical to significantly broaden the tax base.\" Rice did not point out that the tax base is broadened only by more people working in the private sector, which itself can be accomplished only by lowering the tax rates. In a way, Prime Minister Tsipras is a symptom and not the cause of Greece’s cultural disease of hard socialism. He was thrust into office last January specifically on an anti-austerity pledge, and the voters kicked out his predecessor government for being too willing to compromise with the eurozone creditors and, indeed, the free market. But whatever the reason, if Greece defaults on its debt payments due by the end of the month, as it surely will do absent IMF and eurozone funding, it will take big step in the direction of Venezuela and the Third World. Cutting Greece out of the eurozone of trade and currency would make it an international lending pariah, a dead zone of credit, with only a partial ability to pay for its own government functions. There is, alas, as yet no sign that the Greek public would have it any other way. This week, Communist trade unionists occupied the Finance Ministry and tore down the EU flag while draping a banner that read: \"We have bled too much, we have paid, stop the new measures!\" EU Commission president Jean-Claude Juncker, French president Hollande, and German chancellor Angela Merkel have been in frenzied negotiations with Tsipras all week, without the slightest concessions to austerity being offered by the prime minister. Whether Europe will cave and continue to subsidize Greece’s failed experiment in socialist idealism or allow the nation to leave the eurozone and crash on its own misery is anyone’s guess. Christopher S. Carson, a lawyer, was formerly with the American Enterprise Institute.","url":"https://www.americanthinker.com/blog/2015/06/greece_a_lesson_in_socialist_failure.html"}
