{"authors":["John Hayward"],"date_download":"2018-10-30 20:48:19","date_modify":"2018-10-30 20:48:19","date_publish":"2015-08-20 04:04:13","description":"The first major deal Greece has to make involved selling operational control of 14 regional airports to a German company.","filename":"data/vaneerConsumption/GreecePrivatizes14AirportsbySellingRightstoGermany.json","image_url":"https://media.breitbart.com/media/2015/08/abandoned-airport-in-greece-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_19__1540932499.html","title":"Greece Privatizes 14 Airports by Selling Rights to Germany","title_page":"Greece Privatizes 14 Airports by Selling Rights to Germany","title_rss":"NULL","source_domain":"breitbart.com","text":"One of the terms of Greece’s bailout deal involves selling off government monopolies and privatizing their operations.\nThe first major deal involved selling operational control of 14 regional airports, including some of Greece’s most popular facilities, to a German company. Considering the amount of anti-German rhetoric dispensed by Greece’s political leadership, this probably won’t be easy for the increasingly tense Greek electorate to accept.\nThe Associated Press reports Greece’s airport concessions were sold for about $1.37 billion U.S. to Fraport AG, the company that manages Frankfurt’s airport. (More precisely, it’s a consortium of German companies led by Fraport AG.) The contract is good for the next 40 years.\nThis resulted in a very modest upgrade to Greece’s post-apocalyptic credit rating by Fitch International, on the theory that moving forward with privatization makes Greece ever so slightly less likely to default on its debt.\nThe Greek finance ministry also relaxed banking controls slightly, allowing Greek citizens to send small amounts of money abroad each month, with a higher allowance for the specific purpose of financing students who are enrolled in school overseas. Greeks are also now permitted to open new bank accounts, on the condition that they won’t be allowed to withdraw the money—they can only use the accounts for paying loans and tax debts. It is a mark of how difficult the situation has been for Greeks that these are the relaxed restrictions.\nPrime Minister Alexis Tsipras and his socialist Syriza party swept into power opposing “austerity” measures like privatization, but that was before Greece’s near-death experience with the European Union transformed Tsipras into the humbled harbinger of austerity. Conditions within Syriza are described as a “rebellion” against Tsipras by the AP, with the threat of early elections or a vote of no-confidence looming. Syriza members of parliament voted against Tsipras’s bailout deal, obliging him to seek support from opposition parties.\nEkathimerini quotes left-wing Greek politicians denouncing the airport sale as “surrendering public assets” for a “measly sum” as a “prize to German interests.” They also called it the “first fire sale under a Syriza government” and a “large present to Merkel and Schaeuble, clearly in return for their services in the formation of the new, deplorable memorandum”—a reference to Germany’s chancellor and finance minister, respectively.\nThere is also late word that the airport deal might actually fall apart… not because the Greek left found a way to block it, but because Fraport AG is growing nervous about Greek political and economic instability. The Tsiprias government has let it be known that if the German consortium wants to renegotiate the contract, it plans to offer some new conditions of its own.","url":"https://www.breitbart.com/national-security/2015/08/19/greece-privatizes-14-airports-by-selling-rights-to-german-companies/"}
