{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-22 23:52:40","date_modify":"2018-10-22 23:52:40","date_publish":"2016-01-29 12:31:09","description":"The footage of the deadly green mamba snake was taken by Julia Sundukova, at a snake museum in Tanzania, Africa. The skin is shed in on go and he process takes just five minutes.","filename":"data/vaneerConsumption/GreenmambashedsitsskinatasnakemuseuminTanzaniaAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B202FC00000578-0-image-a-38_1454068868988.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422600_Green-mamba-sheds-skin-snake-museum-Tanzania-Africa-captured-Julia-Sundukova_1540252360.html","title":"Green mamba sheds its skin at a snake museum in Tanzania, Africa","title_page":"Green mamba sheds its skin at a snake museum in Tanzania, Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Few have the chance to catch the breathtaking moment a snake sheds it's skin, but one woman was lucky to catch the whole thing\nThe incredible video shows the scaly green serpent slinking around a cage, leaving his tired old skin behind as he winds himself around a branch.\nThe footage of the deadly mamba snake was taken by Julia Sundukova, at a snake museum in Tanzania, Africa.\nJulia said: 'I was so excited. The guide told me that the shedding lasts about five minutes, so I tried to catch as much as I could.\n'I had to film through the glass, as the snake was pretty dangerous.\nNew lease of life: Few have the chance to catch the breathtaking moment a snake sheds it's skin, but one videographer was lucky to catch the whole thing The incredible video shows the scaly green serpent slinking around a cage, leaving his tired old skin behind as he winds himself around a branch\nWHAT IS A MAMBA SNAKE? Rare opportunity: The footage of the deadly mamba snake was taken by Julia Sundukova, at a snake museum in Tanzania, Africa. Julia said: 'I was so excited. The guide told me that the shedding lasts about five minutes, so I tried to catch as much as I could There are four kinds of mamba, one black and three green, and the deadly African snakes live in trees in the wild\nGreen mambas are the smallest of the four species and adults mostly range from 6 to 7 feet in length. Some have been known if grow to 8 to 8.5 feet.\nBlack mambas are Africa’s longest venomous snake, 8.2 feet in length on average but some can be 14 feet. They are also among the fastest snakes in the world, slithering at speeds of up to 12.5 miles per hour\nThey come from southern and eastern Africa and can live between 12 to 20 years\nMambas are found usually in tropical or wooded areas. Mambas are also very good tree climbers. They feed mostly on birds, rodents, frogs and lizards\nThey are solitary reptiles, except during mating. Males find females by following a scent trail\nMales will compete by doing ritual dance or having wrestling contest on the ground. The aim is to force the other male down. It can take up to several hours for this ritual to end\nLucky sight: 'Python shed their skin over a week, and it comes off piece by piece - but the mamba shed their skin in one go, and it only takes five minutes, so I was very lucky to see it.' Snake's have a transparent scale instead of an eyelid, and can't shut their eyes. This scale too is shed\n'It's much better to see it in nature, but who can observe a snake in nature that close up for so long and come out alive?\n'Python shed their skin over a week, and it comes off piece by piece - but the mamba shed their skin in one go, and it only takes five minutes, so I was very lucky to see it.'\nSnake's have a transparent scale instead of an eyelid, and can't shut their eyes. This scale too is shed.\nMambas are fast-moving, venomous snakes - there are four kinds of mamba, one black and three green, and the deadly African snakes live in trees in the wild.\nGreen mambas are the smallest of the four species and adults mostly range from 6 to 7 feet in length. Some have been known if grow to 8 to 8.5 feet.\nThey come from southern and eastern Africa and can live from 12 to 20 years.\nHumans can die in as little as 20 minutes following a bite from a mamba.\nEyes wide open:Snake's have a transparent scale instead of an eyelid, and can't shut their eyes. This scale too is shed. Mambas are fast-moving, venomous snakes - there are four kinds of mamba, one black and three green, and the deadly African snakes live in trees in the wild\nJust a little snake... Green mambas are the smallest of the four species and adults mostly range from 6 to 7 feet in length. Some have been known if grow to 8 to 8.5 feet. They come from southern and eastern Africa and can live from 12 to 20 years\nDeadly: Humans can die in as little as 20 minutes following a bite from a mamba. They are found usually in tropical or wooded areas. Mambas are also very good tree climbers. They feed mostly on birds, rodents, frogs and lizards","url":"https://www.dailymail.co.uk/news/article-3422600/Green-mamba-sheds-skin-snake-museum-Tanzania-Africa-captured-Julia-Sundukova.html"}
