{"authors":["Breitbart London"],"date_download":"2018-10-30 20:44:02","date_modify":"2018-10-30 20:44:02","date_publish":"2017-03-30 09:29:33","description":"ATHENS (AFP) - Greece is close to a long-delayed deal with its creditors after months of tough talks, a senior official has said. \"We are close to an | London / Europe","filename":"data/vaneerConsumption/GreeceClosetoDealWithCreditorsasSingleCurrencyCrisisRumblesOn.json","image_url":"https://media.breitbart.com/media/2017/01/EU-Flag.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_30__1540932242.html","title":"Greece Close to Deal With Creditors as Single Currency Crisis Rumbles On","title_page":"Greece Close to Deal With Creditors as Single Currency Crisis Rumbles On","title_rss":"NULL","source_domain":"breitbart.com","text":"ATHENS (AFP) – Greece is close to a long-delayed deal with its creditors after months of tough talks, a senior official has said.\n“We are close to an agreement in coming days,” Greek parliament chief Nikos Voutsis told a European Left meeting late on Wednesday.\n“All indications show that a deal is imminent,” he added, according to the state Athens News Agency.\nNegotiations between Athens and its eurozone and International Monetary Fund creditors have dragged for months owing to disagreements over debt relief and budget targets for the austerity-hit country.\nAmong the measures reportedly demanded by the creditors are new pension cuts and more restrictive rules to limit union strikes.\nThey are also pushing for the breakup of the state Public Power Corporation, Greece’s largest electricity provider.\nThe impasse has held up the latest installment of Greece’s 86-billion-euro ($91 billion) bailout, agreed in 2015, which it needs for debt repayments in July.\nThe last such deadlock over Greece, which followed the election of leftist Prime Minister Alexis Tsipras in early 2015, nearly saw Athens expelled from the euro.","url":"https://www.breitbart.com/europe/2017/03/30/greece-close-deal-eurozone-creditors/"}
