{"authors":["Associated Press"],"date_download":"2018-10-23 00:45:07","date_modify":"2018-10-23 00:45:07","date_publish":"2016-01-29 14:04:02","description":"ATHENS, Greece (AP) — Greek ferries were tied up in port for a third day Friday after seamen extended a two-day strike for a further 48 hours, while farmers ...","filename":"data/vaneerConsumption/Greekferriestiedupfor3rddayoverpensionreform.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:dc92eaefc6b54ecfbddf2e4082eaac13-4PuZeKVXE7cd9005b2c876ac3c61-272_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422694_Greek-ferries-tied-3rd-day-pension-reform_1540255507.html","title":"Greek ferries tied up for 3rd day over pension reform","title_page":"Greek ferries tied up for 3rd day over pension reform | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Greek ferries tied up for 3rd day over pension reform\nATHENS, Greece (AP) — Greek ferries were tied up in port for a third day Friday after seamen extended a two-day strike for a further 48 hours, while farmers continued temporary highway blockages to protest the left-led government's planned pension reforms.\nNo ferries were running between islands and the mainland, while farmers blocked a road near Athens' international airport for about an hour. They also announced the closure of Greece's northern border crossing with Bulgaria to trucks, saying only private cars and buses would be allowed to cross.\nFarmers have been blocking highways across the country for hours at a time to protest the reforms that are part of Greece's third international bailout.\nA man walks on a promenade in front of an immobilized ferry in the Athens' main port of Piraeus on Friday, Jan. 29, 2016. Greek seamen have extended an anti-austerity 48-hour strike for a further 48 hours, halting island ferry services, as bailout-reliant Greece is planning to drastically overhaul its troubled pension and social security system, among other reforms demanded by international creditors. (AP Photo/Petros Giannakouris)\nThe country's lenders are pressing Athens to overhaul its troubled pension system, hammered by high unemployment, an aging population and generous pre-crisis deals. But critics say the planned reforms will severely curtail income by drastically increasing pension contributions.\nThe planned reforms have been met with opposition from groups as disparate as seamen, lawyers, farmers, doctors, security service personnel, geologists, engineers, notaries public, fishermen and physiotherapists. A general strike is planned for Feb. 4.\nAn immobilized ferry is reflected in the sea as a small boat sails in the Athens' main port of Piraeus, Friday, Jan. 29, 2016. Greek seamen have extended an anti-austerity 48-hour strike for a further 48 hours, halting island ferry services, as bailout-reliant Greece is planning to drastically overhaul its troubled pension and social security system, among other reforms demanded by international creditors. (AP Photo/Petros Giannakouris)\nA worker paints a docked ferry in the Athens' main port of Piraeus on Friday, Jan. 29, 2016. Greek seamen have extended an anti-austerity 48-hour strike for a further 48 hours, halting island ferry services, as bailout-reliant Greece is planning to drastically overhaul its troubled pension and social security system, among other reforms demanded by international creditors. (AP Photo/Petros Giannakouris)\nProtesting farmers block a vital point, on a road that links the international airport with the southern and eastern suburbs of the Greek capital, in Koropi, near Athens, Friday, Jan. 29, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Thanassis Stavrakis)\nA protesting farmer sits on his tractor as an aircraft prepares to land during a blockage at a vital point, on a road that links the international airport with the southern and eastern suburbs of the Greek capital, in Koropi, near Athens, Friday, Jan. 29, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Thanassis Stavrakis)\nProtesting farmers block a vital point, on a road that links the international airport with the southern and eastern suburbs of the Greek capital, in Koropi, near Athens, FrIday, Jan. 29, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Thanassis Stavrakis)\nA protesting farmer sits inside his tractor as they block a vital point, on a road that links the international airport with the southern and eastern suburbs of the Greek capital, in Koropi, near Athens, Friday, Jan. 29, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Thanassis Stavrakis)","url":"https://www.dailymail.co.uk/wires/ap/article-3422694/Greek-ferries-tied-3rd-day-pension-reform.html"}
