{"authors":["Associated Press"],"date_download":"2018-10-22 20:57:38","date_modify":"2018-10-22 20:57:38","date_publish":"2016-01-29 05:09:46","description":"NEW YORK (AP) — Draymond Green and Klay Thompson were picked Thursday for the Western Conference team, giving the NBA champion Golden State Warriors three Al...","filename":"data/vaneerConsumption/GreenThompsonpickedgivingWarriors3NBAAllStars.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:702441cebb86404b9b8046c0826161fc-4PuZeKVXE7cd9005b2c876500d56-697_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421987_Green-Thompson-picked-giving-Warriors-3-NBA-All-Stars_1540241858.html","title":"Green, Thompson picked, giving Warriors 3 NBA All-Stars","title_page":"Green, Thompson picked, giving Warriors 3 NBA All-Stars | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Green, Thompson picked, giving Warriors 3 NBA All-Stars\nNEW YORK (AP) — Draymond Green and Klay Thompson were picked Thursday for the Western Conference team, giving the NBA champion Golden State Warriors three All-Stars for the first time in 40 years.\nSacramento's DeMarcus Cousins, Houston's James Harden, San Antonio's LaMarcus Aldridge, the Clippers' Chris Paul and New Orleans' Anthony Davis were also chosen for the West squad for the Feb. 14 game in Toronto.\nThe Raptors' DeMar DeRozan will represent the home team and is joined by fellow East reserves Chicago's Jimmy Butler, Detroit's Andre Drummond, Miami's Chris Bosh, Washington's John Wall, Atlanta's Paul Millsap and Boston's Isaiah Thomas.\nGolden State Warriors' Klay Thompson drives the ball against Dallas Mavericks' Wesley Matthews during the second half of an NBA basketball game Wednesday, Jan. 27, 2016, in Oakland, Calif. ADallas coach Rick Carlisle watches from the sideline. The Warriors won 127-107. (AP Photo/Ben Margot)\nThe reserves were selected by the head coaches in each conference, who had to vote for seven players: two guards, three frontcourt players and two additional players at any position. They were not allowed to vote for players from their own team.\nThe coaches made Green a first-time selection and picked Thompson for the second year in a row. With MVP Stephen Curry voted a starter by fans, the Warriors have three All-Stars for the first time since Rick Barry, Phil Smith and Jamaal Wilkes in 1976.\n\"It's definitely something I could've never imagined happening,\" Green said during an interview with TNT. \"It's been a lifelong dream of mine to one day see that happen, but I could never imagine it happening like this.\"\nAlong with Green, who leads the NBA with eight triple-doubles, Drummond and Thomas were selected by coaches for their first All-Star Game. Drummond tops the league in rebounding and double-doubles, while Thomas — the 60th and final pick in the 2011 draft — is among the NBA's top 12 in scoring and assists.\nOn the other end, Bosh will return to his original NBA city after being chosen for his 11th consecutive All-Star Game, trailing only the Lakers' Kobe Bryant (18), Cleveland's LeBron James and Miami's Dwyane Wade (both with 12) among active players. Paul is an All-Star for the ninth straight year.\nWest coaches passed on Damian Lillard, who is in the NBA's top seven in scoring and assists for a Portland team that is surprisingly in playoff position, but there appeared no obvious snubs in either conference.\nPreviously voted as starters by fans in the East were James, Wade, New York's Carmelo Anthony, Indiana's Paul George and Toronto's Kyle Lowry. DeRozan joins Lowry to comprise the first starting backcourt to play an All-Star Game in their home city since the Los Angeles Lakers' Jerry West and Gail Goodrich in 1972.\nDeRozan said it was a big moment because of how much pride he has in playing for the Raptors, who have won 10 straight games.\n\"And now to have the All-Star Game here and have two guys participating, it doesn't get much bigger than that,\" DeRozan said. \"It's definitely a blessing. I have to credit the coaching staff and my teammates for helping me and Kyle get to this point.\"\nAny players who have to withdraw because of injury would be replaced by NBA Commissioner Adam Silver.\nSan Antonio's Gregg Popovich will coach the West and Cleveland's Tyronn Lue leads the East. If a starter is injured, they would select the replacement in the lineup.\n___\nAP freelance writer Paul Attfield in Toronto contributed to this report.\nGolden State Warriors' Draymond Green (23) celebrates after scoring against the San Antonio Spurs during the second half of an NBA basketball game Monday, Jan. 25, 2016, in Oakland, Calif. The Warriors won 120-90. (AP Photo/Marcio Jose Sanchez)","url":"https://www.dailymail.co.uk/wires/ap/article-3421987/Green-Thompson-picked-giving-Warriors-3-NBA-All-Stars.html"}
