{"authors":["Reuters Reporter"],"date_download":"2018-10-22 23:03:17","date_modify":"2018-10-22 23:03:17","date_publish":"2016-01-11 04:26:50","description":"The Green Bay Packers and quarterback Aaron Rodgers overcame a sluggish start and rolled to a 35-18 victory over the Washington Redskins on Sunday","filename":"data/vaneerConsumption/GreenBayPackersdefeatWashingtonRedskinsinfinalwildcardclashtosetupplayofftieagainstArizonaCardinals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/300177D000000578-0-image-a-13_1452486154577.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_nfl_article-3393361_Green-Bay-Packers-defeat-Washington-Redskins-final-wild-card-clash-set-playoff-tie-against-Arizona-Cardinals_1540249397.html","title":"Green Bay Packers defeat Washington Redskins in final wild card clash to set up play-off tie against Arizona Cardinals","title_page":"Green Bay Packers defeat Washington Redskins in final wild card clash to set up play-off tie against Arizona Cardinals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Green Bay Packers and quarterback Aaron Rodgers overcame a sluggish start and rolled to a 35-18 victory over the Washington Redskins on Sunday to close out wild card weekend in the National Football League.\nThe victory set up a date for Green Bay on the road next weekend against the Arizona Cardinals, completing the match-ups for the Divisional round of the playoffs as all four road teams were opening-round winners for the first time.\nThe Seattle Seahawks, 10-9 winners on Sunday against the Minnesota Vikings, play NFC top-seeded Carolina Panthers, while AFC top seeds the Denver Broncos host the Pittsburgh Steelers and the New England Patriots entertain the Kansas City Chiefs.\nGreen Bay Packers tight end Richard Rodgers (centre left) celebrates with Aaron Rodgers in first half\nQuarterback Rodgers celebrates his side's wild card 35-18 win over the Washington Redskins\nQuarterback Kirk Cousins (centre) is sacked by inside linebacker Clay Matthews in the fourth quarter\nGreen Bay fell behind 11-0 early in the second quarter before Rodgers, who completed only one-of-eight passes for 11 yards in the opening quarter, got the Packers' attack in gear on an unseasonably warm, windy day in the US capital.\nFrom that point on, the Packers outscored the hosts 35-7.\n'We just needed a game like this to get our mojo back, to get our confidence going,' said Rodgers.\n'The playoffs brings it out in all of us. It's a one-and-done mentality. The focus goes up, the intensity goes up.'\nRodgers, who had struggled down the stretch of the regular season as Green Bay dropped their last two, found his touch and confidence and the Packers ran off 17 points to head into intermission leading 17-11.\nWashington, winners of four in a row to end the season, responded at the start of the second half, with quarterback Kirk Cousins scoring on a three-yard quarterback draw that put the Redskins back on top 18-17.\nBut Rodgers, mixing in an effective running game with James Starks and Eddie Lacey carrying the ball, directed Green Bay on a pair of touchdown drives, capping the second one with two-point pass conversion to put the Packers on top 32-18.\nRodgers (right) shares a joke with Washington Redskins cornerback Will Blackmon (left) after the game\nQuarterback Kirk Cousins of the Washington Redskins scores a third quarter touchdown\nGreen Bay added a field goal and the spirited defense, which registered six sacks, stopped Washington on fourth-down conversion attempts three times to clinch victory.\nWashington coach Jay Gruden said once Rodgers got it going, the Redskins were overmatched.\n'We couldn't get them off the field, and Aaron did what he did,' said Gruden. 'We just failed to make plays after they took the lead in the third quarter. After that it was a snowball effect.'\nRodgers, the league's reigning most valuable player, finished with a pair of touchdown passes, completed 21 of 36 passes for 210 yards and led the Packers to points on five successive drives for the first time this season.\nWashington Redskins head coach Jay Gruden put his side's defeat down to Rodgers' influence on the game\nTight end Alex Smith trudges off of the field at the FedExField after seeing his side fall to a defeat","url":"https://www.dailymail.co.uk/sport/nfl/article-3393361/Green-Bay-Packers-defeat-Washington-Redskins-final-wild-card-clash-set-playoff-tie-against-Arizona-Cardinals.html"}
