{"authors":["John Hayward"],"date_download":"2018-10-30 20:48:12","date_modify":"2018-10-30 20:48:12","date_publish":"2015-07-30 23:35:02","description":"Greek Prime Minister Alexis Tsipras floated the idea of calling for early elections in Greece","filename":"data/vaneerConsumption/GreekPMTsiprasConsidersEarlyElectionsStrugglesWithSyrizaPartyRevolt.json","image_url":"https://media.breitbart.com/media/2015/07/Tsipras-pout-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_30__1540932492.html","title":"Greek PM Tsipras Considers Early Elections, Struggles With Syriza Party Revolt","title_page":"Greek PM Tsipras Considers Early Elections, Struggles With Syriza Party Revolt | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday, Greek Prime Minister Alexis Tsipras floated the idea of calling for early elections in Greece to “bolster a parliamentary majority that has been strained by bailout reforms demanded by creditors,” as Reuters put it. Such is the chaos of end-state socialism in Greece that Tsipras really needs his own party to lose in those early elections. The Syriza party is coming unglued over the austerity components of Greece’s latest bailout package.\nAs the very next line of that Reuters story points out, Tsipras is relying on opposition support for the bailout reforms, because some three dozen of the 149 Syriza members of parliament refuse to back them. When Tsipras said, “I would be the last person to want elections, if I had the secured parliamentary majority to make it through to the end of the four-year term… but if I don’t have a parliamentary majority, we will be forced to go to elections,” he was rattling the electoral saber at his own team.\nReuters UK was more clear about the meaning of the Prime Minister’s threat:\nIn a clear warning to Syriza rebels, Tsipras said he could be forced to call early elections if he no longer had a parliamentary majority, and suggested an emergency party congress could be held in early September. At the same time, he is under pressure from Greece’s creditors to go beyond the two packages of so-called prior actions passed by parliament and include unpopular steps to curb early retirement and tax breaks for farmers, EU sources say.\nReuters notes that the European Union and International Monetary Fund might “demand additional reform measures to be legislated in August before releasing any further loans,” but Tsipras insists he won’t accept anything beyond the measures agreed upon a few weeks ago – austerity reforms that were already tighter than the proposals rejected by a majority of Greek voters in a recent referendum.\nAs troublesome as his own party colleagues have been, he might think Syriza reinforcements delivered by early elections would send a signal to the EU that Greece will not be getting any more “austere.” (It looks like they are about to post another budget deficit, despite hopes for a small surplus this year, so as always when dealing with spendthrift governments, “austerity” is a very relative term).\nSyriza held a meeting on Thursday to “thrash out its differences amid a mounting rebellion by far-left lawmakers who accuse the party of betraying its anti-austerity roots,” as Business Insider writes. In their analysis, Tsipras is now the conservative force using his personal popularity with voters to pull his party to the right, while its left flank talks about telling Greece’s creditors to shove their austerity demands and bailing out of the Euro.\nThe slightly less hardcore leftists seem to believe they can break the recent Brussels agreement with the EU and resume the old debt brinkmanship games, in search of a more generous deal. Among the biggest thorns in Tsipras’ side are his former finance and energy ministers, Yanis Varoufakis and Panagiotis Lafazanis. Varoufakis has taken to comparing Greece’s creditors to military conquerors, snarling that “today you don’t need tanks to beat someone, you’ve got your banks.” He said that to a German magazine.\nIt is all part of Tsipras’ amazing transformation from defiant socialist to herald of austerity, a makeover that didn’t come quickly or easily. He seems convinced the EU is not willing to play games with Greece any more, and he was badly rattled by his understanding of what would actually happen if his country defaults and withdraws from the Eurozone.","url":"https://www.breitbart.com/national-security/2015/07/30/greek-pm-tsipras-considers-early-elections-struggles-with-syriza-party-revolt/"}
