{"authors":["Associated Press"],"date_download":"2018-10-23 02:25:34","date_modify":"2018-10-23 02:25:34","date_publish":"2016-01-28 17:11:05","description":"ATHENS, Greece (AP) — Protests against the Greek leftwing government's planned pension reforms expanded Thursday, as farmers clashed with riot police in the ...","filename":"data/vaneerConsumption/Greekjournalistsjoinstrikesagainstpensionreforms.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:8ed46ddcb08c4b4ea797ffab74382cd4-2vdWmEltwXfba0ce28e632af5dea-932_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420584_Greek-journalists-join-strikes-against-pension-reforms_1540261534.html","title":"Greek journalists join strikes against pension reforms","title_page":"Greek journalists join strikes against pension reforms | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Greek journalists join strikes against pension reforms\nATHENS, Greece (AP) — Protests against the Greek leftwing government's planned pension reforms expanded Thursday, as farmers clashed with riot police in the city of Thessaloniki, a journalists' strike pulled news bulletins off air and island ferries remained tied up in port.\nPolice fired tear gas to disperse the protesting farmers, who had tried to break a police cordon. No injuries or arrests were reported.\nAbout 5,000 farmers took part in the protest, using 100 tractors to block access to an agricultural fair in the city center. Greece's agriculture minister had been due to inaugurate the fair but was forced to cancel.\nProtesting farmers scuffle with riot police officers during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers, protesting against the left-wing government¿s planned pension reforms, have clashed with riot police outside an agricultural fair in Thessaloniki. About 5,000 farmers took part in Thursday¿s protest, using 100 tractors to block access to the fair in the city center. (AP Photo/Giannis Papanikos)\nFarmers are also blocking key highways, angry at the prospect of severe income losses under planned pension and tax reforms. The government's plans have also upset a broad spectrum of professional groups, ranging from lawyers and fishermen to police and physiotherapists.\nGreece's eurozone bailout lenders are pressing Athens to overhaul its pension system, which has been hobbled by high unemployment, an aging population and generous deals in the years ahead of the financial crisis.\nThe 24-hour journalists' strike pulled news bulletins off air, while news websites were not being updated. Friday newspapers are not set to be printed.\nFerries were tied up in port for a second day due to a seamen's strike, while notary publics also walked off the job.\nUnions have called a general strike for Feb. 4.\nProtesting farmers scuffle with riot police officers during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers, protesting the left-wing government¿s planned pension reforms, have clashed with riot police outside an agricultural fair in Thessaloniki. About 5,000 farmers took part in Thursday¿s protest, using 100 tractors to block access to the fair in the city center. (AP Photo/Giannis Papanikos)\nA protesting farmer holds a flare during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Giannis Papanikos)\nA protesting farmer waves a Greek flag during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Giannis Papanikos)\nProtesting fishermen chat next to their docked fishing boats during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. A range of professions react and others are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Giannis Papanikos)\nProtesting farmers hold a coffin with the photograph of Greece's Prime Minister Alexis Tsipras, as other colleagues shout slogans during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Giannis Papanikos)\nProtesting farmers shout slogans during a rally in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Giannis Papanikos)\nA man walks sorrounded by parked tractors during a demonstration by farmers in the northern Greek city of Thessaloniki on Thursday, Jan. 28, 2016. Greek farmers continued highway blockades as a range of other professions are on strike to protest planned pension reforms that are part of the country's third international bailout requirements. (AP Photo/Giannis Papanikos)","url":"https://www.dailymail.co.uk/wires/ap/article-3420584/Greek-journalists-join-strikes-against-pension-reforms.html"}
