{"authors":["Frances Martel"],"date_download":"2018-10-30 20:42:02","date_modify":"2018-10-30 20:42:02","date_publish":"2015-06-12 18:59:53","description":"Individuals associated with a communist trade union demanded Prime Minister Alexis Tsipras not agree to any austerity reforms with the EU.","filename":"data/vaneerConsumption/GreekCommunistsStormFinanceMinistryProtestingEUProposals.json","image_url":"https://media.breitbart.com/media/2015/06/Greeks-protest-EU-proposals-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_12__1540932122.html","title":"Greek Communists Storm Finance Ministry Protesting EU Proposals","title_page":"Greek Communists Storm Finance Ministry Protesting EU Proposals | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Individuals associated with the All Workers Militant Front (PAME), a communist trade union, stormed the Greek Foreign Ministry on Thursday, demanding the far-left government of Prime Minister Alexis Tsipras not agree to any austerity reforms with the European Union, reforms demanded by both the EU and creditors to help Greece avoid a debt default.\nThe group occupied the Finance Ministry offices and hoisted a banner over the building, reading, “We’ve bled enough, we’ve paid enough! People take the matter into your hands! Put an end to the new measures and bailout programs.” The banner featured the images of both Tsipras and his predecessors, the center-right former PM Antonis Samaras and the Panhellenic Socialist Movement (PASOK, considered “center-left”) former PM George Papandreou, implying that the three had continued to behave the same way despite representing three very different parties. Media outlets covering the event universally consider PAME a communist-affiliated organizaton, not merely left wing. Communist Party of Greece (KKE) General Secretary Dimitris Koutsoubas joined the PAME protesters.\nThe group also called on subsequent protests to happen throughout all of Athens to urge Tsipras not to negotiate with the EU or IMF and impose any restrictions in government spending. Seven hundred different trade unions are reportedly aligned with PAME in organizing the protests. By Friday, reports indicated that 59 Greek cities experienced mass protests by the far left against the Coalition of the Radical Left (Syriza).\nThe incident is the latest in a string of protests targeting Syriza and its leaders by members of Greece’s far-far left (taking Syriza’s name to mean they are the far-left, respective to PASOK, the center-left). In March, anarchists stormed the offices of the Syriza party for nine hours, claiming that the party had not done enough to enact prison reform and demanding the release of notorious left-wing terrorists who belonged to the Conspiracy of the Fire Nuclei group. The next month, Greek Finance Minister Yanis Varoufakis and his parter were attacked by a mob of anarchists while leaving dinner at a restaurant. The group was reportedly “making threats, throwing objects at the couple and demanding they leave.”\nWhich is all to say that Syriza is facing much more active opposition from their left than from the right, though the increasingly small Greek right remains theoretically opposed to Syriza’s refusal to adopt austerity measures. According to polls cited by Iran’s state-run Press TV and conducted by Marc poll for Alpha TV, 53% of Syriza voters preferred that the party exit any negotiations with the EU and IMF entirely.\nInstead, Syriza has opted for keeping the talks open and warning Greeks that a “temporary” tax increase is on the way. “We must regrettably increase state revenue without new loans. … People must understand that these are temporary measures to help the recovery,” said Yiorgos Katrougalos, junior financial reform minister.\nDirect talks with the EU and creditors remain contentious. On Thursday, IMF negotiators walked out of talks entirely, citing frustrations with Greece’s obstinance in accepting any financial reforms. “There are still major differences between us in most key areas. There has been no progress in narrowing these differences ­recently. Thus we are well away from an agreement,” explained IMF spokesperson Gerry Rice. The other participants in the negotiations included German Chancellor Angela Merkel and French President Francois Hollande, who are expected to continue the discussions, despite the large negotiation gap between both sides. Following the IMF walkout, EU President Donald Tusk scolded Greek officials with a warning that “there’s no more time for gambling.”\nThe Greek government has, nonetheless, announced it had prepared a new negotiation plan, and Tsipras plans to stay in Brussels, where the talks are occurring. The new plan, described by the Financial Times as a “strident rejection” of everything the EU and IMF were demanding during the talks, may result in Greece fully defaulting.\nGreek newspaper Kathimerini details the demands Tsipras is expected to make Saturday. They include refusing to cut any wages and pensions of government workers but agreeing to “restructure public debt” and keep primary surpluses low. The EU is expected to respond with once again calling for Greece to cut wages and reduce spending.","url":"https://www.breitbart.com/national-security/2015/06/12/greek-communists-flood-finance-ministry-demanding-radical-left-reject-eu-proposals/"}
