{"authors":["Simon Kent"],"date_download":"2018-10-30 21:58:16","date_modify":"2018-10-30 21:58:16","date_publish":"2015-12-06 16:33:56","description":"The Greece-Macedonia border is holding back an increasing flood tide of stalled migrants as authorities try to stem the human flow.","filename":"data/vaneerConsumption/GreeceMacedoniaBorderBecomesBattlegroundAsMigrantsForciblyHalted.json","image_url":"https://media.breitbart.com/media/2015/11/GREECE-MACEDONIA-EUROPE-MIGRANTS-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_06__1540936696.html","title":"Greece-Macedonia Border Becomes Battleground As Migrants Forcibly Halted","title_page":"Greece-Macedonia Border Becomes Battleground As Migrants Forcibly Halted | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Greece-Macedonia border is holding back an increasing flood tide of stalled migrants as authorities on both sides of the frontier try to stem the human flow travelling overland through Greece.\nGreek authorities estimate almost 2,000 migrants have crossed into Macedonia from Greece, a bare 24-hours after the border closed down following violent clashes between migrants and riot police.\nMore than 3,000 people remain stuck on the Greek side of the border, as Macedonia and other Balkan countries refuse to let them pass. They say they are economic migrants seeking jobs and opportunity, not refugees fleeing war. Both countries cite a lack of funding and trained officials to assist in processing the chaos.\nThose refused entry to Macedonia threw stones on Friday at Greek riot police, who have been struggling to maintain order ever since.\nThe Daily Mail reports Greek authorities have provided free trains and buses to carry the economic migrants back to Athens, where they will be offered the chance to seek asylum in Greece. However nearly all those entering Greece from Turkey want to keep moving north to live in wealthy European countries such as Germany or Sweden.\nThe news comes as Greece’s European affairs minister accused the EU of not providing Greece with enough help as its battles the massive influx of refugees and other migrants this year.\nNikos Xydakis gave the example of staff from the European border agency Frontex, saying that Greece needed 750 but initially received only 350, increasing by a further 100 or so in recent days.\n“Since May Greece has persistently been asking for technical, technological and staffing help, and what it has received from Europe is far less than what was asked for,” Xydakis told Associated Press in an interview.\nThe government says it has also received fewer fingerprinting machines than it needs to identify and register people, and not enough help to patrol the Aegean Sea.\n“There is an inability of the member states and the European mechanisms to respond to the needs of this storm,” Xydakis said.\nHe insisted Greece is meeting its obligations and adhering to all agreements made on the issue, saying small delays were “completely explainable” by the sheer volume of arrivals.\nU.S. Secretary of State John Kerry was in Athens on Friday for talks on issues including the migrant crisis, and said the U.S. was giving $24 million to the U.N. refugee agency.","url":"https://www.breitbart.com/europe/2015/12/06/greece-macedonia-border-becomes-battleground-migrants-forcibly-halted/"}
