{"authors":[],"date_download":"2018-10-22 22:49:25","date_modify":"2018-10-22 22:49:25","date_publish":"2014-05-12 20:40:13","description":"Glenn Greenwald, a journalist who won a Pulitzer Prize for his reporting on the National Security Agency, tells NBC News how he first met Snowden.","filename":"data/vaneerConsumption/GreenwaldOverwhelmedWithShockUponMeetingEdwardSnowden.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/437416/x_30_nn_snowdenmeet_140512_cba5d271ad72ae37af69b1c75c2c4a84.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_nsa-snooping_greenwald-overwhelmed-shock-upon-meeting-edward-snowden-n103546_1540248565.html","title":"Greenwald 'Overwhelmed With Shock' Upon Meeting Edward Snowden","title_page":"Greenwald 'Overwhelmed With Shock' Upon Meeting Edward Snowden ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGlenn Greenwald says his new book, \"No Place to Hide: Edward Snowden, the NSA, and the U.S. Surveillance State\" is an attempt to present the entire story of his dealings with one of the most famous whistle-blowers of all time: Edward Snowden.\n\"There's been so much said about our reporting about Edward Snowden, about how these documents came to light, so much of which is not true,\" Greenwald told NBC News National Correspondent Kate Snow. \"And this is an opportunity to tell the actual story.\"\nLast summer, Greenwald began publishing reports based on documents leaked to him by the former NSA employee. The stories caused a public debate over the use and limits of government surveillance. Currently Greenwald writes for a digital magazine owned by “First Look Media.” NBC News has a collaboration agreement with that company.\nGreenwald described how the entire episode began with Snowden reaching out to Greenwald in an unsolicited email, using the alias \"Cincinnatus\" (a reference to a Roman warrior who defended the city against attack). Greenwald ignored those first email entreaties and almost missed the scoop of his career.\nWatch the video below to hear Greenwald's account of how he first met Snowden.","url":"https://www.nbcnews.com/storyline/nsa-snooping/greenwald-overwhelmed-shock-upon-meeting-edward-snowden-n103546"}
