{"authors":[],"date_download":"2018-10-21 02:52:30","date_modify":"2018-10-21 02:52:30","date_publish":"2018-09-12 13:27:11","description":"Miller will be joined by Post national security reporter Ellen Nakashima and national technology reporter Craig Timberg, offering a behind-the-scenes look at what two years of reporting uncovered","filename":"data/vaneerConsumption/GregMillertodiscussnewbookTheApprenticeatTheWashingtonPostOctober3.json","image_url":"https://www.washingtonpost.com/resizer/nQdf8YuIDYPVrDxmvpfmvHCLgI8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BP22T67LPI7NPEBG3C47NGHIIY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_12__1540090351.html","title":"Greg Miller to discuss new book “The Apprentice” at The Washington Post October 3","title_page":"Greg Miller to discuss new book “The Apprentice” at The Washington Post October 3 - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"On Wednesday, October 3, The Washington Post will host a discussion providing a\ncomprehensive look into the new book, “The Apprentice: Trump, Russia and The Subversion of\nAmerican Democracy,” authored by The Post’s two-time Pulitzer Prize-winning national security\nreporter Greg Miller, and featuring contributions from fellow Post reporters.\n“The Apprentice” focuses on the pre- and post-election accounts detailing Russian interference\nin the 2016 election. Miller, Washington Post national security reporter Ellen Nakashima and\nnational technology reporter Craig Timberg will give readers an in-depth look at the details\nsurrounding every step of the story beginning with Russian hackers probing the Democratic\nNational Committee’s computer network, and ending with the recent summit in Helsinki.\nThe book will be published October 2 by Custom House, an imprint of the William Morrow Group at HarperCollins Publishers, and will be available for purchase at the event.\nThis event is open to press and will be streamed on The Post’s site at wapo.st/gregmillerbook\nMedia who wish to cover must RSVP.\nEVENT DETAILS\nWednesday, October 3\nProgram: 9:00 AM – 10:00 AM (Doors open at 8:30 AM)\nBook signing: 10:00 AM – 11:00 AM\nThe Washington Post Live Center\n1301 K Street NW, Washington, DC 20071","url":"https://www.washingtonpost.com/pr/wp/2018/09/12/greg-miller-to-discuss-new-book-the-apprentice-at-the-washington-post-october-3/"}
