{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:05:31","date_modify":"2018-10-30 20:05:31","date_publish":"2015-10-20 12:40:10","description":"Earlier this morning, Chuck Reece of the online magazine\nThe Bitter Southerner...","filename":"data/vaneerConsumption/GregBestandpartnersrevealTiconderogaClubatKrogStreet.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/20/Images/WPIMAGE_cmgajcfoodandmore_4899.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_gr_58310596095ef9aea28cbb3390d1036b__1540929931.html","title":"Greg Best and partners reveal Ticonderoga Club at Krog Street","title_page":"Greg Best and partners reveal Ticonderoga Club at Krog Street","title_rss":"NULL","source_domain":"ajc.com","text":"Earlier this morning, Chuck Reece of the online magazine The Bitter Southerner got the scoop on the name of the new Krog Street Market bar/restaurant from Greg Best, Regan Smith, David Bies, Bart Sasso and Paul Calvert.\nDrum roll, please… It’s called Ticonderoga Club. And it's \"All Bells. No Whistles.\"\nSince plans were first announced by Best and Smith — well known as the former beverage and front of house team behind Holeman & Finch Public House — they were intent on keeping the name, concept and other details under wraps. And they were even successful in planting a few stories that turned out to be false.\nBut in early July they revealed the whole team, including Bies, who was chef de cuisine at Restaurant Eugene, Sasso who served as the creative director at Resurgens Hospitality Group, and Calvert who’s been involved in beverage programs at the Sound Table, Pura Vida and most recently Victory Brands and Paper Plane. And they let a few more details leak, too, including unveiling a website .\nNow, after a few private events at Ticonderoga Club last weekend, the wait is on for the soft opening or whatever tricks or treats the so-called \"Finchs Nest\" gang of five have planned next.\nStay tuned.","url":"https://www.ajc.com/blog/atlanta-restaurants/greg-best-and-partners-reveal-ticonderoga-club-krog-street/wWo0rDdAXwAsI1vVRzqwGJ/"}
