{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:06:54","date_modify":"2018-10-30 20:06:54","date_publish":"2015-07-03 10:26:29","description":"Still keeping the name, concept and other details under wraps, Greg Best and Regan Smith have a...","filename":"data/vaneerConsumption/GregBestandReganSmithannounceKSMrestaurantandbarpartners.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/03/Images/WPIMAGE_cmgajcfoodandmore_3775.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_gr_131208755d284909b02df0aa0f030522__1540930014.html","title":"Greg Best and Regan Smith announce KSM restaurant and bar partners","title_page":"Greg Best and Regan Smith announce KSM restaurant and bar partners","title_rss":"NULL","source_domain":"ajc.com","text":"Still keeping the name, concept and other details under wraps, Greg Best and Regan Smith have announced three new partners to complete the team for their much anticipated Krog Street Market restaurant and bar.\nHere's the press release we received, along with a mysterious \"You Will Pay\" graphic and news of a live website :\nGreg Best and Regan Smith have announced the complete partnership for their restaurant and bar in Krog Street Market. David Bies, Bart Sasso, and Paul Calvert will join them as partners. The team plans to open their business this fall.\nOf course, Best and Smith are well known as the former beverage and front of house team behind Holeman & Finch Public House. Bies was chef de cuisine at Restaurant Eugene and has worked at The Ritz Carlton, Buckhead and Flat Creek Lodge, among other places. Sasso has served as the creative director at Resurgens Hospitality Group and is the co-founder/creative director at Esperanza Atlanta. Paul Calvert has has been involved in beverage programs at the Sound Table, Pura Vida and most recently Victory Brands and Paper Plane.\nA \"wooden nickel\" coin that's been circulating around Atlanta seems to hold other clues in the Best, Smith, Bies, Sasso, and Calvert guerrilla marketing strategy, including, \"TC1766\" and \"That Which Satisfies The Soul Is Truth.\"","url":"https://www.ajc.com/blog/atlanta-restaurants/greg-best-and-regan-smith-announce-ksm-restaurant-and-bar-partners/AMtN2wOyISRUUkgCwD7OuM/"}
