{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 01:07:58","date_modify":"2018-10-23 01:07:58","date_publish":"2016-01-28 15:22:14","description":"Fun-loving cubs at the China Conservation and Research Centre for the Giant Panda could not get enough of the snowy conditions when they were allowed out to play earlier today.","filename":"data/vaneerConsumption/GrinandbearitGiantpandacubscantcontaintheirexcitementastheyenjoyafrolicinthesnowplayingeverythingfromfootballtoagameofhideandseek.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB3FEB00000578-0-image-a-92_1453994525103.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421103_Grin-bear-Giant-panda-cubs-t-contain-excitement-enjoy-frolic-snow-playing-football-game-hide-seek_1540256878.html","title":"Grin and bear it! Giant panda cubs can't contain their excitement as they enjoy a frolic in the snow - playing everything from football to a game of hide and seek","title_page":"Grin and bear it! Giant panda cubs can't contain their excitement as they enjoy a frolic in the snow - playing everything from football to a game of hide and seek | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Freezing winter weather has brought parts of China to a standstill this week, forcing families to lock themselves indoors as temperatures have plummeted to almost -50 degrees Celsius.\nBut as these delightful snaps prove, not everyone is suffering in the cold.\nFun-loving cubs at the China Conservation and Research Centre for the Giant Panda could not get enough of the snowy conditions when they were allowed out to play earlier today.\nThe stunning young animals were seen rolling, climbing and swinging as they frolicked in the white stuff in their play pen in Chengdu.\nOne even picked up a ball - before realising it was hardly the ideal day for a kick-about. It then took to playing hide and seek instead.\nThe giant panda is an extremely rare species, inhabiting mountain ranges in the Sichuan, Shaanxi and Gansu provinces of China.\nWith a population of less than 2000, the species is included on the endangered list by the Convention on International Trade in Endangered Species of Wild Fauna and Flora and is protected by China’s Wildlife Protective Law as the special-class protected animal.\nWith these fur coats, it's hardly likely they will fall victim to the cold, that's for sure!\nWinter wonderland: Fun-loving cubs at the China Conservation and Research Centre for the Giant Panda could not get enough of the snowy conditions when they were allowed out to play earlier today\nCool: The stunning young animals were seen rolling, climbing and swinging as they frolicked in the white stuff in their play pen in Chengdu\nSnow day: The baby pandas must have felt like they were back in their natural habitat, seeking out all sorts of fun adventures as they made the most of the winter conditions\nEndangered: The giant panda is an extremely rare species, inhabiting mountain ranges in the Sichuan, Shaanxi and Gansu provinces of China\nPeek-a-boo: This panda made his own fun, parking himself inside the middle of two old tyres and playing a game of hide and seek\nNow you see me, now you don't: The baby Giant Panda was having a superb time, ducking in and out of the tyres and covering himself in snow\nGame on: One of the bears even picked up a big brown ball - before realising it was hardly the ideal day for a kick-about\nOn my head: This panda is clearly loving his freedom. He was seen patting and heading his ball around a wooden log surface\nArctic adventure: When all of the ball play got too much, this little cub decided he would head for new heights, finding his feet holding onto a bamboo fence","url":"https://www.dailymail.co.uk/news/article-3421103/Grin-bear-Giant-panda-cubs-t-contain-excitement-enjoy-frolic-snow-playing-football-game-hide-seek.html"}
