{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:55:22","date_modify":"2018-10-30 22:55:22","date_publish":"2015-10-21 08:00:00","description":"Maywood, CA. -- A politician who will soon hold one of the most powerful positions in California was walking along the industrial banks of the Los Angeles","filename":"data/vaneerConsumption/Grippingpowerforthelongterm.json","image_url":"https://calmatters.org/wp-content/uploads/rendonatdesk.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940122.html","title":"Gripping power for the long term?","title_page":"Gripping power for the long term? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Maywood, CA. — A politician who will soon hold one of the most powerful positions in California was walking along the industrial banks of the Los Angeles River last week when an artist smoking a cigarette stopped him to lodge a few complaints.\nThe area has graffiti but no murals, Robert Cortes said. Too few trees and too many dope dealers.\n“You’ve got a lot of work to do, bro,” Cortes said to Assemblyman Anthony Rendon, who will take over next year as speaker of the California Assembly.\nWhen he does, the stage is set for Rendon to become a leader unlike any California has seen in 20 years. Changes to legislative term limits approved by voters three years ago have now taken hold, creating the potential for a period of stability unseen since Willie Brown – the self-proclaimed “ayatollah of the Assembly” – left the speaker’s office in 1995. In the 20 years before that, California had just two assembly speakers. In the 20 years since, there have been 11.\nRendon, a Democrat from the Los Angeles city of Lakewood, will take over in 2016 with the possibility of holding office for nine more years. He’ll lead a house with increasing seniority, as the new term limit rules allow lawmakers to hold their positions for 12 years. That’s twice as long as they could stay in the Assembly under the old system.\nAnd Rendon, 47, will be working across the aisle with a new Republican leader – Assemblyman Chad Mayes of Yucca Valley – who will take the helm next year with the possibility of staying in office for 11 more years.\n“Philosophically, we are probably in two different places,” said Mayes, 38. “But personality-wise, I think we’re both cordial and we will get along well.”\nLonger terms and steady leadership could have a calming affect on the Capitol, allowing lawmakers to settle into the responsibility of their positions rather than plotting their next political move. The changes may help lawmakers build expertise in areas of government – like education, water policy or health care – that are now overseen by a constantly rotating cast.\nLegislative term limits in California Until 1996: No term limits. Lawmakers could serve as long as their constituents kept electing them. 1996 to 2012: Legislators could serve up to 6 years in the Assembly (three terms) and 8 years in the Senate (two terms), with a lifetime limit of 14 years in the Legislature. Voters approved this plan in 1990 when they passed Proposition 140. Since 2012: Legislators can serve up to 12 years total and can stay in one house the whole time. Voters approved this change in 2012, when they passed Proposition 28.\nRendon, who has a PhD in political science, used his own experience chairing the Assembly’s water, parks and wildlife committee to illustrate the potential shift. He took control of the committee the first year he was elected to office and negotiated a $7.5 billion water bond while learning policy on the fly.\n“If I had stayed in that committee chairmanship for ten years, I could probably tell a lobbyist when I thought they were full of (crap),” he said, using a word that rhymes with sit.\n“I could probably tell a water district official that they were not being honest with me.”\nIn the coming years, Rendon said, he and his colleagues will “have the ability to do that.”\nOf course, there are no guarantees they’ll succeed.\nRendon faces numerous challenges, including some ambitious colleagues who want a shot at being speaker too. His caucus could pass the baton to someone else at any time. And Rendon is taking over a Democratic caucus that is divided over some key California issues, including technology and the environment.\nThe grandson of Mexican immigrants, Rendon’s political background is solidly liberal – including stints leading the California League of Conservation Voters and Plaza de la Raza Child Development Services. He’s been a robust fundraiser, receiving 29 percent of his campaign cash from organized labor.\nYet he landed the speakership with significant support from a bloc of business-friendly Democrats who break with progressive Democrats on environmental issues to cast votes that are sympathetic to the oil industry. Satisfying both bands within his party will be tough.\n“Are we worried about him? I’m not,” said Kathryn Phillips, a lobbyist for the Sierra Club, which gave Rendon top scores for his voting record. “He is very smart, and educated about the environment.”\nIt remains to be seen whether legislators with more time in the same office can make a difference on so many issues that have stymied the Capitol. The state has a health care system for the poor that is about to go broke. Tuition has skyrocketed at public universities. A volatile tax structure subjects government to chaotic booms and busts.\n“The issue that has suffered the most due to term limits is public education,” said former Assembly Speaker Fabian Núñez, who held the post for four years.\n“Figuring out how to best address the inequities in our education system – the achievement gap – will be fundamental. The Assembly will now have the opportunity to think this through and identify the solutions.”\nAnd yet it’s possible that longer terms will wind up making politicians feel more connected to interest groups in Sacramento than voters back at home.\n“Politics in Sacramento can be remote and abstract,” Rendon said during an interview along the gritty riverbank in his district, where just a trickle of water flowed down a channel lined with warehouses, graffiti and folks seeking shelter under noisy overpasses.\nThen he waved toward the frustrated constituent who had stopped him earlier.\n“You have to come here and talk to those guys,” Rendon said. “Otherwise you can kind of… forget why you’re there and what you’re supposed to be doing.”","url":"https://calmatters.org/articles/gripping-power-for-the-long-term/"}
