{"authors":[],"date_download":"2018-10-30 01:23:58","date_modify":"2018-10-30 01:23:58","date_publish":"2016-10-21 00:05:33","description":null,"filename":"data/vaneerConsumption/GrossOutinPortland.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/1024px-Portland_Union_Station_with_mounted_patrol_officer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862638.html","title":"Gross Out in Portland","title_page":"Gross Out in PortlandThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"If you had to choose one story that shows why American workers are not wild about unions these days, public or private, look to Portland, Oregon. Voters statewide are set to decide on a ballot initiative there in November that could do more to kill jobs than most category 4 hurricanes.\nTargeted at big businesses, Measure 97 would impose a new 2.5 percent tax on companies that gross over $25 million a year. The trick is, the tax would not be on net profits but on gross revenues after the $25 million mark. In other words, companies are not taxed on how much money they actually make after expenses but on how much money comes through the door.\nFor high-volume, low-margin business, the tax could be crippling. Emily Powell, owner of Portland’s beloved Powell’s Books, has a hard time sleeping some nights because of the measure. “I say this without trying to be dramatic. I don’t know how we are going to pay this bill,” she said in an interview.\nThough certain businesses such as Powell’s Books would bear the “legal incidence of the tax,” all Oregonians will pay more for goods, services, and even utilities, according to the nonpartisan Tax Foundation. Its number-crunchers estimate that the cost per every man, woman, and child in the state would be about $600 a year, for a total annual tax hike of about $3 billion.\nYou can’t squeeze that much money out of a state the size of Oregon without also killing or stopping the creation an awful lot of private sector jobs. Tom Potiowsky, the former state economist, calls it a hidden “sales tax on steroids,” which is a big deal in part because Oregon attracts all kinds of business from nearby Washington and California by not having a sales tax.\nMeasure 97 is being sold as a way to fund education, but there is nothing in its text that would keep the Legislature from using the money for any old thing that it prefers. Our Oregon, the group behind the measure, is union-funded. It believes the measure would greatly benefit public employee unions in the state by boosting salaries and creating new taxpayer-funded jobs.\nNow, you might think that private sector unions would be a little bit wary of such a large, potentially job-killing tax. But then again, maybe not. In August, a reporter for the Weekly Standard asked the union representative for Powell’s Books, whose otherwise impeccably progressive owner has publicly worried about how the company is going to keep the lights on, what they plan to do about it.\nRather than worry about jobs, the rep argued in an email that the Oregon “tax code is broken and Corporations (including Powell’s) pay nowhere near their fair share in the maintenance of society.” Granted, some workers might have “concern over ramifications and the potential actions that Powell’s may take to maintain profit margins should the measure pass.” However, the workers had other, more important fish to fry.\nWhat the membership of this “democratic union” is concerned with “and has recently taken a position on,” the rep explained, “is the civil rights and social justice issue of Black Lives Matter and the severe racial injustice that pervades our society.” The union was “currently taking steps to show our support [for Black Lives Matter] in both words and action.” As for words and actions to maybe save the bookstore workers’ jobs, not so much.\nSteve Buckstein, an analyst for the Portland-based Cascade Policy Institute, points out that even a union-funded study failed to show that Measure 97 was a good idea. “A Portland State University report, actually paid for by the measure’s public employee union proponents, looked ahead ten years and still found no positive economic effects showing up,” he explains.\nAt roughly $3 billion a year, Buckstein reckons that’s a $30 billion gamble that public sector unions might love but that ordinary Oregonians would be foolish to make.\nJeremy Lott is an adjunct scholar with the Mackinac Center for Public Policy in Midland, Michigan.","url":"https://spectator.org/gross-out-in-portland/"}
