{"authors":["John Moritz"],"date_download":"2018-10-30 19:34:05","date_modify":"2018-10-30 19:34:05","date_publish":"2016-06-02 12:27:00","description":"A letter sent from the mayor of Beebe to constituents praising a gospel music group set to perform at the city's Fourth of July event was criticized by the American Humanist Association for promoting Christianity.","filename":"data/vaneerConsumption/GroupcriticizesArkansasmayorsletteronJulyFourtheventsaysitpromotesChristianity.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jun_02__1540928045.html","title":"Group criticizes Arkansas mayor's letter on July Fourth event, says it promotes Christianity","title_page":"Group criticizes Arkansas mayor's letter on July Fourth event, says it promotes Christianity ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A letter sent from the mayor of Beebe to constituents praising a gospel music group set to perform at the city's Fourth of July event was criticized by the American Humanist Association for promoting Christianity.\nReached for comment about the complaint Thursday, Beebe Mayor Mike Robertson said he's \"not stressing about it whatsoever.\"\n\"We chose gospel music this year, and that's what it's going to be,\" Roberston said, noting that the city has hired country, soul and rock groups to perform at the celebration in past years.\nIn a letter the mayor sent describing the event's activities — which also include water slides, face painting and ice cream — Robertson wrote that the goal of The Bowling Family musicians is \"to usher in the presence of god and to celebrate the Christian message.\"\nThe letter prompted a complaint from a Beebe resident, according to the Humanist Association, which advocates for secularism and \"goodness without god.\" A spokesman for the Washington, D.C.-based group said it was aware of several concerned Beebe residents.\n\"Not all citizens of Beebe are Christian, and it is simply inappropriate to use taxpayer resources on an event ... unquestionably intended to promote Christianity,\" said Humanist Association legal director David Niose in a letter to sent to Robertson on Thursday.\nThe letter also includes a Freedom of Information Act request for all correspondence between the mayor and The Bowling Family.\nRobertson said he planned on taking no action other than complying with the information request.","url":"https://www.arkansasonline.com/news/2016/jun/02/secular-group-complains-beebe-mayors-letter-promot/"}
