{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:05:51","date_modify":"2018-10-22 22:05:51","date_publish":"2017-04-26 03:42:59","description":"The group sponsoring Ann Coulter's speech at Berkeley in California has pulled its support of the event, blaming the college for not providing security to control 'unrestrained leftist agitators'.","filename":"data/vaneerConsumption/GroupbackingAnnCoultersBerkeleyspeechpullssupport.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9B9FAF00000578-0-image-a-58_1493174422485.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446180_Group-backing-Ann-Coulter-s-Berkeley-speech-pulls-support_1540245951.html","title":"Group backing Ann Coulter's Berkeley speech pulls support","title_page":"Group backing Ann Coulter's Berkeley speech pulls support | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The sponsors behind Ann Coulter's controversial speech at UC Berkeley on Thursday has backed away from the appearance, blaming 'leftist agitators'.\nThe Young America's Foundation, a conservative group backing Coulter's speech as part of a national lecture tour, announced it was pulling out of the event at the California university.\n'When Young America’s Foundation confirmed Ann Coulter would speak at UC-Berkeley as part of YAF’s nationwide campus lecture program on April 27, we assumed UC Berkeley would take all steps necessary to ensure the safety of students attending the educational event,' the group's statement read.\n'In the meantime we discovered that the University of California Police Department at Berkeley has an official \"stand-down\" policy for any situation that develops on campus as long as the situation doesn’t involve the imminent loss of life, allowing the leftist thugs who have terrorized Berkeley’s campus to do so without consequence.'\nThe statement then went on to list a series of requirements it deemed necessary for the event, including a room for 'hundreds' of people, the ability to publicize Coulter's speech, a central location on campus, and security on hand to deal with 'masked disruptors'.\nThe sponsors behind Ann Coulter's controversial speech at UC Berkeley on Thursday has backed away from the appearance, blaming 'leftist agitators'. Coulter is pictured in Washington DC in 2011\nBut the statement blasts Berkeley for what it deemed a shameful decision not to meet the demands.\n'Berkeley made it impossible to hold a lecture due to the lack of assurances for protections from foreseeable violence from unrestrained leftist agitators,' the statement read.\n'Berkeley should be ashamed for creating this hostile atmosphere.\n'Ms. Coulter may still choose to speak in some form on campus, but Young America’s Foundation will not jeopardize the safety of its staff or students.'\nAnd it appears as though Coulter will appear Thursday, with UC Berkeley spokesman Dan Mogulof telling NBC Bay Area: 'All we know is that Coulter is saying she will come to campus and appear in Sproul Plaza in the early afternoon. We have nothing beyond that at the moment.'\nThe announcement came after California law enforcement sources told Fox News there is a '99 per cent chance' of violence at the college - if Coulter's speech goes ahead.\nThe Young America's Foundation, a conservative group backing Coulter's speech as part of a national lecture tour, announced it was pulling out of the event at the university. Pictured is a sign about Coulter's speech on campus\nBerkeley made it impossible to hold a lecture due to the lack of assurances for protections from foreseeable violence from unrestrained leftist agitators,' the Young America's Foundation said in a statement\nRetired Los Angeles Sheriff’s Department commander Charles Heal also said groups of the far-right and far-left potentially traveling to the campus and using the campus as a battleground is sparking further fears.\n'We’ve been told they’re going to come no matter whether Ann Coulter comes or not, and the next riot is not a standalone in isolation but a natural consequence of the lackluster approach of the past,' Heal told the network.\nEarlier this week, two conservative groups filed a lawsuit against the college that claimed the school is violating their right to free speech by canceling the conservative pundit's speaking event on campus this week.\nThe lawsuit marks the latest twist in a high-profile debate over whether Coulter will be allowed to speak Thursday at UC Berkeley, which has been known for decades as a bastion of free speech and tolerance and the birthplace of the 1960s Free Speech Movement.\nA legal team led by Harmeet Dhillon, a San Francisco attorney who is also a prominent California Republican, filed the case on behalf of the Berkeley College Republicans, who invited Coulter, and the Young America's Foundation, which is helping to organize and finance the event.\n'Berkeley is well known as a place where ideas used to be welcome. At least on the conservative side. At least until this recent election,' Dhillon told a news conference after filing the lawsuit at the US District Court in San Francisco.\nThe youth conservative group tweeted about its reasons for withdrawing its sponsorship of Coulter's speech\nCoulter's planned speech sparked widespread controversy at the university, which has been the site of protests in recent months\n'The university is required to give equal access to speakers of different viewpoints.'\nThe lawsuit says that Berkeley is trying 'to restrict and stifle the speech of conservative students whose voices fall beyond the campus political orthodoxy.'\nDhillon is a committeewoman to the Republican National Convention for California and former vice chairwoman of the California Republican Party.\nThe YAF is going ahead with its part of the lawsuit, despite announcing it was no longer backing the appearance.\nCampus Republicans invited Coulter to speak at Berkeley this Thursday, but Berkeley officials informed the group last week that the event was being called off for security concerns.\nThe university then backtracked and offered an alternate date, but Coulter has insisted that she plans to still come Thursday.\nIt remains unclear where she would hold the event, and no details have been publicized.\nA legal team led by Harmeet Dhillon (right), a San Francisco attorney who is also a prominent California Republican, earlier this week filed the case on behalf of the Berkeley College Republicans who claim their free speech is being interfered with by the school\nThe Student Union building at the University of California Berkeley is pictured. Coulter is still expected to appear at the campus this Thursday\nCoulter is not a plaintiff on the lawsuit. But she voiced support for it on Twitter, posting Monday that the lawsuit 'demands appropriate & safe venue for my speech THIS THURSDAY.'\nThe university's attempt to call off the event came after a series of violent clashes this year on campus and in downtown Berkeley between far-right and far-left protesters.\nThe lawsuit demands unstated damages and compensation for attorney fees, a trial by jury and an injunction against Berkeley officials from 'restricting the exercise of political expression on the UC Berkeley campus.'\nIt names four university officials as defendants, including University of California President Janet Napolitano and Berkeley Chancellor Nicholas B. Dirks, and three police officials, including university police chief Margo Bennett.\nThe University of California president's office issued a statement saying it welcomes speakers of all political viewpoints and 'is committed to providing a forum to enable Ann Coulter to speak on the Berkeley campus.'\n'The campus seeks to ensure that all members of the Berkeley and larger community - including Ms. Coulter herself - remain safe during such an event.'","url":"https://www.dailymail.co.uk/news/article-4446180/Group-backing-Ann-Coulter-s-Berkeley-speech-pulls-support.html"}
