{"authors":[],"date_download":"2018-10-30 18:52:58","date_modify":"2018-10-30 18:52:58","date_publish":"2017-02-23 19:20:00","description":"Schools likely to follow their own guidelines after Trump transgender ruling","filename":"data/vaneerConsumption/GrouptoprotestWhiteHouseruling.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_school_c04adb7b76422a417820adcb725e2a84__1540925578.html","title":"Group to protest White House ruling","title_page":"Group to protest White House ruling","title_rss":"NULL","source_domain":"ajc.com","text":"State and local education officials said Thursday the Trump administration’s decision to restrict transgender students from using their preferred restrooms and locker rooms will have little impact on their current guidelines.\nGeorgia Education Department officials referred The Atlanta Journal-Constitution to part of a letter state Superintendent Richard Woods sent to district superintendents in May when the Obama administration announced a directive to public schools that they allow transgender students to use the restrooms and locker rooms that best fit their gender identity. The letter recommended superintendents use what works best in their districts concerning the controversial directive.\n“The doctrine of ‘local control’ is deeply rooted in our constitution and laws here in Georgia, and I am confident that you, as the superintendent of your district, along with your board of education and with counsel and support from your local board attorney, will continue to appropriately address concerns surrounding this complex and sensitive matter,” Woods wrote.\nWoods was opposed to the Obama administration’s order, saying there are “safety and privacy concerns associated with allowing students of different genders to use the same bathroom and locker rooms.”\nMany lesbian, gay, transgender and bisexual organizations have decried the decision. One group planned a protest of the Trump administration’s decision Thursday afternoon outside the U.S. Education Department’s Atlanta office.\nSome school districts, such as Fulton County, said Thursday they allow a school to appropriately respond to specific requests from transgender students. Atlanta school officials said in a statement Thursday they would work with transgender students and families on a plan to ensure they feel safe and supported.\nThe White House released a letter late Wednesday reversing the Obama administration’s directive, saying it was enacted without a “formal public process” and the guidelines aren’t consistent with federal discrimination rules.\nGeorgia was one of several states that sued the Obama administration over the directive. Georgia Attorney General’s office spokeswoman Katelyn McCreary said Thursday the office is reviewing the new guidelines and the impact it may have on the lawsuit.","url":"https://www.ajc.com/news/local-education/schools-likely-follow-their-own-guidelines-after-trump-transgender-ruling/eI72vJRCLbiYdWar8vtcNI/"}
