{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:54:17","date_modify":"2018-10-30 17:54:17","date_publish":"2016-03-11 20:50:03","description":"The new Islamic State (ISIS/ISIL) leader in Libya issued a statement this week, asserting that the group continues to grow \"stronger every day.\"","filename":"data/vaneerConsumption/GroupGrowsStrongerEveryDay.json","image_url":"https://media.breitbart.com/media/2014/12/isis1_Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_11__1540922057.html","title":"Group Grows 'Stronger Every Day'","title_page":"Islamic State Leader in Libya: Group Grows 'Stronger Every Day'","title_rss":"NULL","source_domain":"breitbart.com","text":"The new Islamic State (ISIS/ISIL) leader in Libya issued a statement this week, asserting that the group continues to grow “stronger every day.”\nAbdul Qadr al-Najdi, “the emir tasked with administering the Libyan provinces,” said he wants the northern African country “to be made the ‘vanguard of the Caliphate,'” and nearby countries will not “be able to defend themselves” from the Islamic State.\n“You are protecting yourself from the detonators with shields of bamboo, and from the flood with a ring of wood,” he declared in an interview.\nHis comments came after the United Nations Security Council issued a statement confirming that the Islamic State has expanded in Libya.\n“The rise of ISIL in Libya is likely to increase the level of international and regional interference, which could provoke further polarization, if not coordinated,” explained UN experts. “In anticipation, ISIL has been spreading a nationalistic narrative, portraying itself as the most important bulwark against foreign intervention.”\nThe experts said foreign fighters remain attracted to Libya, even though the United States has carried airstrikes against them. Fighters come from Sudan, Tunisia, and Turkey.\nThe U.S. believes Libya houses 6,000 Islamic State fighters. The UN experts put the number between 2,000-3,000.\nBanking employees have told the UN the Islamic State cannot use the backup of Libya’s banking system in Sirte because fighting damaged it.\n“Consequently, control over Sirte does not give ISIL access to State finances or to the wider SWIFT system,” continued the experts. “It is, however, likely that the site continues to hold all Libyan historic banking data, which could prove useful to anyone seeking to mask fraudulent transactions.”\nReuters described SWIFT as the “member-owned cooperative that banks use for account transfer requests and other secure messages.”\nThe U.S. struck a possible Islamic State training camp in Libya last month, killing 40 people. Officials believe they killed Noureddin Chouchane, a Tunisian-born man known as a “leading ISIS facilitator.”\nLibyan intelligence officials said senior Islamic State commanders moved into Libya in the beginning of February while more foreign fighters arrived in Sirte.\n“The majority [of IS fighters in Sirte] are foreigners, around 70%. Most of them are Tunisians, followed by Egyptians, Sudanese and a few Algerians,” said Ismail Shukri, head of intelligence in Misrata. “Add to that the Iraqis and the Syrians. Most of the Iraqis come from Saddam Hussein’s disbanded army.”\nLibyan military commander Mahmoud Gazwan confirmed the Islamic State growth in the country.\n“They’re getting stronger because no one is fighting them,” he told Reuters.\nOther commanders have said that “Western weapons and air strikes will make a vital difference” in any battles against the Islamic State. But Western officials insisted they need a “united Libyan government to request more aid.”\nTwo Libyan officials reported French special forces fight alongside them against the Islamic State. These 15 special forces “carried out four military operations against IS and other militant groups in Benghazi.”","url":"https://www.breitbart.com/national-security/2016/03/11/islamic-state-leader-in-libya-group-grows-stronger-every-day/"}
