{"authors":[],"date_download":"2018-10-22 22:06:27","date_modify":"2018-10-22 22:06:27","date_publish":"2014-06-06 22:08:57","description":"A spike in cases of Ebola virus in Sierra Leone is threatening to overwhelm efforts to fight it.","filename":"data/vaneerConsumption/GrowingEbolaOutbreakThreatenstoOverwhelmVolunteers.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/493456/140606-ebola-augustine-goba-jsw-456p_d1820b4dd32b5baf4586cc32b4f5e490.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ebola-virus-outbreak_growing-ebola-outbreak-threatens-overwhelm-volunteers-n124961_1540245987.html","title":"Growing Ebola Outbreak Threatens to Overwhelm Volunteers","title_page":"Growing Ebola Outbreak Threatens to Overwhelm Volunteers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Kenema Hospital is treating 11 patients with Ebola, all being kept in isolation. Six more have died. With each worker needing a complete change of gown, mask, gloves, goggle and other protective gear with each visit, that means supplies go fast.\nAt least 35 lab-confirmed Ebola cases have been traced to a traditional healer whose grieving patients apparently handled her body at her funeral and became infected themselves, Garry says.\nThe healer had treated patients just over the border in neighboring Guinea. This cross-border outbreak is worrying health officials because it's spreading in an area where people cross from one country into another casually, passing through large cities on their travels.\nEbola is one of the deadliest viruses known. It kills quickly, taking anywhere between 50 percent and 90 percent of victims, depending on the strain.\nThe good news is it doesn’t spread terribly easily — it requires direct contact with bodily fluids. But caregivers and health care workers can become infected while caring for patients, and funeral rituals such as washing a body can expose more people.\n“Community resistance is hindering the identification and follow-up of contacts.\"\nAnd if people don’t know they’ve been exposed, they can travel sometimes long distances to spreads the virus to others when they themselves become ill. WHO says experts are trying to track down 30 people now.\n“Community resistance is hindering the identification and follow-up of contacts,” WHO says.\n“They are just scattering,” Garry confirmed. “It’s very hard to track them down.” Garry's working with local and international experts to identify cases, distribute protective gear, train workers and test samples.\n\"Unfortunately, these numbers will rise dramatically as cases from the Koindu and Daru regions are tallied. Reports from the field for villages surrounding Koindu and Daru are grim.\"\nThe outbreak started in Guinea earlier this year, the first time Ebola had been seen in West Africa. WHO says at least 21 people died and 48 new cases of suspected Ebola were recorded in Guinea between May 29 and June 3, taking Guinea’s total to 344.\nWith more than 215 deaths so far, the West African outbreak is one of the worst on record.\nEbola first arose in Zaire, now the Democratic Republic of Congo, in 1976. In that outbreak, 318 people were sickened and 280 died, with a mortality rate of 88 percent. The biggest outbreak affected 425 people in Uganda in 2000, killing 224 of them.\nEducation is the key to fighting it. Garry says many people in affected regions don’t understand it’s a virus and often don’t believe advisories about how it’s spread. His team is educating health care workers so they can protect themselves and teach others.","url":"https://www.nbcnews.com/storyline/ebola-virus-outbreak/growing-ebola-outbreak-threatens-overwhelm-volunteers-n124961"}
