{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 20:38:46","date_modify":"2018-10-22 20:38:46","date_publish":"2016-01-29 02:39:22","description":"In an Entertainment Weekly exclusive clip the actor, who played Ben Seaver from 1985 to 1992 throughout all seven seasons of Growing Pains, discussed how he started drinking at just four","filename":"data/vaneerConsumption/GrowingPainsJeremyMillerdiscussesalcoholismwithOprahWinfrey.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30ADF4B500000578-0-image-a-78_1454023634845.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421922_Growing-Pains-child-star-Jeremy-Miller-discusses-alcoholism-Oprah-started-drinking-aged-four_1540240726.html","title":"Growing Pains' Jeremy Miller discusses alcoholism with Oprah Winfrey","title_page":"Growing Pains' Jeremy Miller discusses alcoholism with Oprah Winfrey | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Miller suffered from growing pains of a different kind as a child.\nThe 39-year-old former child star opened up to Oprah about his alcoholism on her Where Are They Now? docuseries.\nIn an OWN clip the actor, who played Ben Seaver from 1985 to 1992 throughout all seven seasons of Growing Pains, discussed how he started drinking at just four years of age.\nScroll down for video\nGrowing pains: Child star Jeremy Miller (pictured February 2015) has opened up to Oprah about his alcoholism on her Where Are They Now? docuseries\n'My grandparents used to throw a lot of parties, and I would run around after the parties and finish all the empty beers,' he said. 'So that was my first experience.'\nHe revealed he didn't start seriously drinking until he was 12. 'The first time I ever got hammered was 12-years-old,' he recalled.\n'So there was always something there. Whether it was genetic component, mental, whatever you want to call it, there was something there; I never had that off switch.'\nIn the clip, Miller recalls the very day he realised he was an alcoholic, when he woke up one morning and discovered he had to have a drink.\nChild star: The 39-year-old, who played Ben Seaver from 1985 to 1992 throughout all seven seasons of Growing Pains, discussed how he started drinking at just four years old\n'There were times when I was so filled with self loathing and self hatred, and then combine that with the alcohol and the lack of judgement that provides... it's a very good thing that I never owned a gun, because I don't know what would have happened,' he continued. 'And that's scary.'\nHe said he his lowest point came when he started waking up from blackouts, completely unable to tell where he had been or what he had been doing.\n'I think rock bottom for me was waking up, after having being completely blacked out, not having a clue what I did,' he said. 'And my fiancee sitting on the end of the bed, yet again, p***ed. And not knowing what she could say.\nRed carpet: Jeremy, pictured with his wife Joanie in Hollywood in November 2014, said the first time he 'got 'hammered' was at 12\nTV family: In growing pains, Miller played the son of psychiatrist Dr Jason Seaver, portrayed by Alan Thicke\n'She could have told me I got in the car and killed four people last night, I would have had no clue,' he admitted. 'That was my rock bottom.'\nIn Growing Pains, Miller played the son of psychiatrist Dr Jason Seaver, portrayed by Alan Thicke.\nIn the final season, Leonardo DiCaprio became a cast regular, playing a homeless student taken in by the Seaver family.\nOprah: Where Are They Now? airs on Saturday on OWN.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421922/Growing-Pains-child-star-Jeremy-Miller-discusses-alcoholism-Oprah-started-drinking-aged-four.html"}
