{"authors":["Bobbie Whiteman For Dailymail.Com"],"date_download":"2018-10-23 05:42:28","date_modify":"2018-10-23 05:42:28","date_publish":"2016-01-29 21:32:22","description":"The actor unleashed a storm of angry comments on social media disagreeing with the deeply religious former child star's opinion - including a tweet from his sitcom sister that sparked rumours of a spat.","filename":"data/vaneerConsumption/GrowingPainsvetTraceyGoldclearsupfeudwithcostarKirkCameronabouthis2012antigaymarriagecomments.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E75900000578-0-image-a-52_1454096756762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423376_Growing-Pains-vet-Tracey-Gold-clears-feud-star-Kirk-Cameron-2012-anti-gay-marriage-comments_1540273348.html","title":"Growing Pains vet Tracey Gold clears up 'feud' with co-star Kirk Cameron about his 2012 anti-gay marriage comments","title_page":"Growing Pains vet Tracey Gold clears up 'feud' with co-star Kirk Cameron about his 2012 anti-gay marriage comments | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's been three years since he told Piers Morgan on CNN that same sex marriage was 'detrimental, and ultimately destructive to so many of the foundations of civilization.'\nKirk Cameron's views unleashed a storm of angry comments on social media disagreeing with the deeply religious former child star's opinion.\nTracey, who played his younger sister Carol on Growing Pains from 1985 to 1992, was among them, sparking talk of a feud.\nScroll down for video\nBefore his anti-gay marriage comment: Growing Pains co-stars Kirk Cameron and Tracey Gold at an event at The Museum of Television & Radio in Beverly Hills in 2006. The actress has spoken about that difficult time in an interview wtih Oprah, Where Are They Now\nNow the 46-year-old actress has spoken about that time in her life in an interview with Oprah, Where Are They Now? that will air on OWN on Saturday.\nShe said: 'All that stuff came out about what he had said and I was just bombarded on Twitter: What d'ya think? What d'ya think? What d'ya think? What d'ya think?'\n'I felt like my silence at that moment was not beneficial.\n'I just wanted to make my own peace and say what I felt and what my own belief was, which was love and marriage for all.'\nStorm clouds coming: Kirk, with Tracey and Leonardo DiCaprio in the sitcom in 1991, caused outrage when he told Piers Morgan that same sex marriage was 'destructive to many of the foundations of civilization' in 2012\nThey were engulfed in more controversy when the 'feud' headlines began to appear so she reached out to Kirk privately.\n'It kind of escalated, and I finally [decided], you know, I'm going to call Kirk and just let him know that I was asked, I just voiced my opinion,' Tracey said.\nA difference of opinion, however passionate, doesn't automatically lead to a breakdown in a relationship, she added.\n'It doesn't mean that I hate him or we're in a fight or a feud,' she said. 'Just like family, we just disagree.' The actress added: 'He totally got it.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423376/Growing-Pains-vet-Tracey-Gold-clears-feud-star-Kirk-Cameron-2012-anti-gay-marriage-comments.html"}
