{"authors":["John Hayward"],"date_download":"2018-10-30 19:13:04","date_modify":"2018-10-30 19:13:04","date_publish":"2016-09-30 18:07:06","description":"More specifically, the Obama operatives were able to strip Judicial Watch of its “media” status, and charge it higher fees for FOIA requests. | Politics","filename":"data/vaneerConsumption/GSAReportConcludesObamaPoliticalOperativesInterferedWithFOIARequests.json","image_url":"https://media.breitbart.com/media/2016/06/obama-angry-associated-press-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_30__1540926784.html","title":"GSA Report Concludes Obama Political Operatives Interfered With FOIA Requests","title_page":"GSA Report Concludes Obama Political Operatives Interfered With FOIA Requests | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A letter from the Inspector General of the General Services Administration is making the rounds (see the Washington Times report) that reveals Obama political operatives abused official power to thwart several Freedom of Information Act requests, and target watchdog group Judicial Watch.\nMore specifically, the Obama operatives were able to strip Judicial Watch of its “media” status, and charge it higher fees for open records requests:\nThe GSA botched several high-profile open records requests, delaying them for months while political appointees got involved, Inspector General Carol F. Ochoa said. The findings were released while the administration was facing charges of slow-walking open records requests for Hillary Clinton’s emails, as well as other requests. In the case of Judicial Watch, the order to strip it of media status came from political operatives with long ties to Democratic causes — and even from the White House. The inspector general said the decision came at the behest of Gregory Mecher, a former Democratic campaign fundraiser who at the time was liaison to the White House. He is married to Jen Psaki, a longtime spokeswoman with the Obama administration and its election campaigns. Ms. Ochoa said stripping Judicial Watch of media status violated several agency policies and things got worse when the GSA denied an appeal by the group. The same person who ruled on the initial request also ruled on the appeal, “contrary to GSA procedures,” the inspector general said.\nLuckily for President Obama and his minions, laws and regulations no longer have any meaning to those in power, so they faced no consequences worse than waiving some fees and forking over a $750 settlement (not $750 million; just $750) after Judicial Watch filed a lawsuit.\nThe Washington Times tells the story of how Judicial Watch was stripped of its media classification:\nThe group was trying to get a look at a goofy video produced by the agency’s New York office on company time and using company resources. The GSA at the time was facing fierce criticism from Capitol Hill for having wasted money on lavish conferences with questionable team-building activities such as the video. Judicial Watch asked to be treated similar to a member of the media, which would mean an exemption from fees. Two weeks earlier, Judicial Watch was approved for the media exemption. But ahead of the GSA request, Mr. Mecher, the political appointee with ties to the White House, requested that Judicial Watch’s status be re-examined, investigators said. Elliot Mincberg, a lawyer with deep Democratic ties who was on loan to the GSA at the time, issued a determination rejecting Judicial Watch as a media requester. Ms. Ochoa said the justification for that was weak — a page from a Justice Department guide that predated the current law governing the definition of media. Mr. Mincberg “did not conduct any independent legal research” about the 2007 law, and that “shows a lack of due diligence,” Ms. Ochoa concluded. The GSA then failed to follow its own procedures in its denial letter — despite internal misgivings — and again in mishandling the appeal, Ms. Ochoa wrote. “Why are White House liaisons involved in our FOIA request?” said Mr. Fitton, the Judicial Watch president.\n“It’s outrageous but not surprising. Welcome to our world. This is what we put up with all the time from the agencies,” Fitton sighed to the Washington Times.\nAs with the IRS scandal, try to imagine this was a Republican administration sending drones to harass a liberal group, especially a highly effective liberal group. The president of that group would not be left to quietly bemoan his misfortune in a single interview. There would be a four-alarm fire at every news organization in the country.\nThe Inspector General report concluded that, generally speaking, the GSA was actually better than many other agencies at handling FOIA requests. Other departments often complain the burden of complying with FOIA is excessive – a debatable assertion given the wealth of the federal government, the staggering number of people it employs, and the power of modern information technology.\nBut even if we concede the point, it stands as a rebuke of mega-government, not a defense. If the government is so big that transparency is impractical, then either it needs to be smaller, or politicians must be more honest with the public about how much transparency we can expect.\nIncidentally, that “lawyer with deep Democratic ties who was on loan to the GSA at the time,” Elliott Mincberg, wound up at the Department of Housing and Urban Development, where he was cited for obstructing an investigation into the deputy secretary by “withholding information from investigators, appearing to coach witnesses and, during one interview, threatening to bring charges against the investigators themselves.”","url":"https://www.breitbart.com/politics/2016/09/30/gsa-report-concludes-obama-political-operatives-interfered-foia-requests/"}
