{"authors":[],"date_download":"2018-10-30 19:41:14","date_modify":"2018-10-30 19:41:14","date_publish":"2018-08-22 20:45:30","description":"The 22-year-old accused in the death of a Georgia State University student at a gas station was indicted last week in DeKalb Couny.Roden Meadows faces malice and felony murder charges in a Citgo gas station shooting that killed 24-year-old Jason Williams on May 15, the indictment says.","filename":"data/vaneerConsumption/GSUstudentsallegedkillerindictedonmurdercharges.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/DeKalb_County_Wsbtv/2018/05/22/Images/754624925_MurderSuspect_1527022418725_11757202_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gsu-student-alle_eebb531c748ae4cba33b7ff2552a662c__1540928474.html","title":"GSU student’s alleged killer indicted on murder charges","title_page":"GSU student’s alleged killer indicted on murder charges","title_rss":"NULL","source_domain":"ajc.com","text":"The 22-year-old accused of gunning down a Georgia State University student and leaving his body in a gas station parking lot was indicted last week in DeKalb County.\nRoden Meadows faces malice and felony murder charges in a Citgo gas station shooting that killed 24-year-old Jason Williams on May 15, the indictment says. The station is off I-20 in the Columbia Drive area.\n“Surveillance video showed the victim and suspect together at the Citgo gas station,” DeKalb police spokeswoman Shiera Campbell said after the shooting. “An altercation occurred inside of a vehicle where the victim was shot, exited the vehicle and collapsed in the parking lot.”\nREAD: DeKalb relative: 11 kids found in New Mexico desert raid need help\nREAD: Man wants bond after allegedly killing woman over a watch in DeKalb\nREAD: Kroger customer dares man to shoot him. Now he’s dead, DeKalb cops say\nAccording to police, Meadows and Williams drove to the station and went inside, but once they returned to the car, Meadows fired shots at Williams.\nNo motive has been released.\nWilliams had a job orientation the day of the shooting, but was also reported missing at some point during the day by his mother.\nWilliams was a sophomore majoring in business administration at Georgia State’s Clarkston campus, GSU said.\nMeadows, who’s in the county jail, has been denied bond but asked for reconsideration the day before the indictment, court record show. No court date is set.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/gsu-student-alleged-killer-indicted-murder-charges/rpQ1tVG2mTe6Os8Il5KuRL/"}
