{"authors":[],"date_download":"2018-10-23 04:46:20","date_modify":"2018-10-23 04:46:20","date_publish":"2016-01-11 17:47:09","description":"Muhammed Abd Al Rahman Awn Al-Shamrani was held without trial and suspected of being an Al-Qaeda member who 'possibly' worked as Osama bin Laden's bodyguard.","filename":"data/vaneerConsumption/GuantanamoBaydetaineerepatriatedtoSaudiArabiaafter14years.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-700g8-3WAQP5SaQH704788ebcf7e1756da-975_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394057_Guantanamo-Bay-detainee-repatriated-Saudi-Arabia-Pentagon_1540269980.html","title":"Guantanamo Bay detainee repatriated to Saudi Arabia after 14 years","title_page":"Guantanamo Bay detainee repatriated to Saudi Arabia after 14 years  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Guantanamo Bay inmate has been repatriated to Saudi Arabia after being held for 14 years without trial, the Pentagon announced Monday.\nMuhammed Abd Al Rahman Awn Al-Shamrani was admitted to the prison camp in 2002 on suspicion of being an Al-Qaeda member who 'possibly' worked as Osama bin Laden's bodyguard, according to his leaked prisoner file.\nAl-Shamrani, 40, will participate in Saudi Arabia's reintegration and rehabilitation program, which includes support from family members.\nMuhammed Abd Al Rahman Awn Al-Shamrani was admitted to the camp in 2002 on suspicion of being an Al-Qaeda member who 'possibly' worked as Osama bin Laden's bodyguard, according to his leaked prisoner file\n'The United States is grateful to the government of the Kingdom of Saudi Arabia for its willingness to support ongoing US efforts to close the Guantanamo Bay detention facility,' the Pentagon said in a statement.\nPentagon spokesman Commander Gary Ross said Al-Shamrani had arrived in Saudi Arabia earlier Monday.\nOf the 103 remaining inmates, 44 have been approved for transfer, and the Pentagon is trying to find countries to take them as it struggles to honor President Barack Obama's 2009 order to close the prison.\nMany are from Yemen and cannot go back, given its collapse into civil war.\nUS Defense Secretary Ashton Carter in December signed off on 17 of the 44 to be transferred as soon as this month, and three were released last week: two to Ghana and one to Kuwait.\nOfficials say additional releases is expected soon.\nEven if all 44 are released, the remaining inmates are expected to stay in indefinite detention.\nAl-Shamrani had on previous occasions been deemed a potential ongoing threat to the United States.\n'If released without rehabilitation, close supervision, and means to successfully reintegrate into his society as a law-abiding citizen, it is assessed detainee would immediately seek out prior associates and reengage in hostilities and extremist support activities at home and abroad,' his October 2008 prisoner file states.\nIn July last year, his lawyer Martha Rayner told a military hearing that Al-Shamrani's family had pledged to give him broad support.\n'They will provide him with a home, support in establishing employment and beginning a family of his own,' she wrote.\nPentagon spokesman Captain Jeff Davis said the military was confident measures were in place to stop Al-Shamrani re-joining Al-Qaeda.\n'Re-engagement is one of the things we look at very carefully to ensure we are mitigating the risk of that,' Davis said.","url":"https://www.dailymail.co.uk/news/article-3394057/Guantanamo-Bay-detainee-repatriated-Saudi-Arabia-Pentagon.html"}
