{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:03:31","date_modify":"2018-10-30 20:03:31","date_publish":"2016-10-04 17:10:57","description":"A Guatemalan who admitted he drank a small bottle of whiskey, 12 beers, and used cocaine three times during the 18 hours before he failed to stop for a red light, has been arrested in Phoenix for killing a six-year-old child.","filename":"data/vaneerConsumption/GuatemalanAllegedlyKills6YearOldAfterBoozeandCokeBinge.json","image_url":"https://media.breitbart.com/media/2016/10/godinez-godinez.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_10_04__1540929811.html","title":"Guatemalan Allegedly Kills 6-Year-Old After Booze and Coke Binge","title_page":"Guatemalan Allegedly Kills 6-Year-Old After Booze and Coke Binge","title_rss":"NULL","source_domain":"breitbart.com","text":"A Guatemalan who admitted he drank a small bottle of whiskey, 12 beers, and used cocaine three times during the 18 hours before he failed to stop for a red light, has been arrested in Phoenix for killing a six-year-old child.\nThree children were in the bed of the truck and were thrown from the vehicle when he hit it at 10:30 a.m. on Sunday morning. Two adults were in the truck with the children and a two-year-old child was sitting on the lap of an adult passenger in the front seat.\nAccording to the report by CBS5 in Phoenix, six-year-old Tyrik Jenkins was killed when a Dodge pickup truck driven by 19-year-old German Valdemar Godinez-Godinez hit a Ford Ranger that was making a left turn. The boy was ejected from the bed of the truck and was taken to an area hospital where he later died.\nThe CBS affiliate reported that he is a citizen of Guatemala and considered a flight risk because he has family there. He was reported to have run a red light and allegedly told authorities that he did not see the red traffic light because the visor in his truck was down.\nGodinez-Godinez was booked for driving under the influence (DUI) and faces one count of manslaughter and five counts of endangerment, according to the report. The judge set a $250,000 cash bond.\nOfficials with the Maricopa County Jail confirmed to Breitbart Texas that Immigration and Customs Enforcement (ICE) has placed an immigration detainer on the suspect.\nA court date has been set for the Guatemalan for October 15.\nBreitbart Texas continues to report about the crimes committed in Texas and other areas by those who are not citizens, are illegal aliens, or illegal aliens that have committed other crimes.\nIn mid-May, Breitbart Texas reported that a previously deported illegal alien killed a teenage girl and critically injured her prom date. Edin Palacios blamed police from who he was fleeing at the time. Palacios, a Guatemalan, was observed driving drunk in the early morning hours of May 14th. When officers attempted to stop the pickup truck after it ran over a curb while making a U-turn, the driver pulled over and took off after the police officer got out of his car, Breitbart Texas reported.\nIn April, a Nebraska judge set a $2 million bond for a fugitive illegal alien charged in a hit-and-run DUI homicide case. The DUI is allegedly the fourth for the illegal alien ordered deported in 2012. Orline Carrasco-Zelaya (a.k.a Edwin Elvir-Palma), was charged with felony counts of vehicular homicide, leaving the scene of a personal injury accident resulting in a death, and an aggravated DUI for his third offense. The 27-year-old Honduran native is listed as a fugitive illegal alien after being ordered deported in 2012, reported Breitbart Texas and KMTV CBS3.\nIn June, a 29-year-old female was placed on an immigration hold in California after she was charged in connection with the death of a 69-year-old man who was struck by her car and hurled through her windshield. Breitbart News reported that she faced felony charges of gross vehicular manslaughter, driving under the influence, hit and run, and a misdemeanor count of driving without a license. The man was hit at 6 a.m. when he was walking on the sidewalk. Esteysi Sanchez Izazaga drove about a mile with the man still in her window. He was hit so hard his leg “detached from his body and flew through the back window, landing on the truck of the car.” She said she fell asleep and woke-up when shattered glass from her windshield hit her in the face.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nThis article has been updated to reflect additional information.","url":"https://www.breitbart.com/border/2016/10/04/guatemalan-allegedly-kills-6-year-old-booze-coke-binge/"}
