{"authors":["Kelly Mclaughlin For Dailymail.Com"],"date_download":"2018-10-22 20:50:07","date_modify":"2018-10-22 20:50:07","date_publish":"2016-01-28 04:07:38","description":"Peter Omar Garcia-Romero and Jose Guadencio Lantan-Vela were arrested after they were found driving around Queens on Tuesday with 100 pounds of heroin in their pickup truck.","filename":"data/vaneerConsumption/Guatemalandrugdealersbustedwith14MinheroininNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/06/30A71A4100000578-0-image-a-2_1453961009252.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420342_Guatemalan-drug-dealers-busted-14M-heroin-circling-snowy-New-York-streets-MONSTER-TRUCK-parking_1540241407.html","title":"Guatemalan 'drug dealers' busted with $14M in heroin in New York","title_page":"Guatemalan 'drug dealers' busted with $14M in heroin in New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two alleged drug dealers from Guatemala were arrested in New York on Tuesday after authorities found 100 pounds of heroin worth $14million in their pickup trucks.\nPeter Omar Garcia-Romero and Jose Guadencio Lantan-Vela were busted as they circled snow-covered blocks of Queens looking for parking spots in two separate trucks - a silver pickup and a blue 'monster truck' with massive tires.\nThe vehicles were first spotted at about 8pm, driving slowly and circling the blocks several times. Both vehicles had North Carolina plates and one was unregistered, officials said.\nAt 8.45pm, officials approached the vehicles, identified themselves, and eventually took the men into custody after discovering the heroin.\nTwo alleged drug dealers from Guatemala were arrested in Queens, New York, after 100 pounds of heroin was found in one of their two pickup trucks\nThe men were pulled over in Elmhurst after circling the snowy streets looking for a parking spot for more than an hour. A trained sniffer dog found heroin packed inside an old drive shaft and axle casings that were laying the bed of the silver truck\nThe area in Elmhurst was under surveillance by agents from the US Drug Enforcement Division, the NYPD and State Police at the time 'as part of an ongoing investigation into heroin distribution organizations operating in the Northeast region of the United States' a statement from the organizations said.\nThe men gave inconsistent statements, said Erin Mulvey, spokeswoman for the New York Division of the DEA, according to the New York Post.\n'It was a monster pickup truck driving around the streets of queens looking for a place to park in the snow, so it really stood out,' Mulvey said. 'The two trucks kept going around and around in the same area.'\nA Port Authority trained search dog found the 100 pounds of heroin hidden inside an old drive shaft and axle casings that were laying the bed of the silver truck, officials told the Post.\nThe men were arrested and the trucks were taken to DEA's Manhattan headquarters and a New York State Search Warrant was obtained for each truck after the incident. The men face charges of conspiracy and criminal possession of a controlled substance\nThe heroin had been packaged in squares to fit in the drive shaft and round shapes to fit inside the axle casings.\nThe vehicles were taken to DEA's Manhattan headquarters and a New York State Search Warrant was obtained for each truck, according to ABC 7.\nThe heroin is believed to have an estimated black market of $14million, officials said.\n'It's one of the biggest heroin seizes ever in the City of New York,' DEA Special Agent in Charge James Hunt said, CBS New York reported.","url":"https://www.dailymail.co.uk/news/article-3420342/Guatemalan-drug-dealers-busted-14M-heroin-circling-snowy-New-York-streets-MONSTER-TRUCK-parking.html"}
