{"authors":[],"date_download":"2018-10-22 21:47:43","date_modify":"2018-10-22 21:47:43","date_publish":"2014-06-06 15:21:44","description":"A Romanian court sentenced email hacker \"Guccifer\" to four years in jail Friday. His victims include the family of former U.S. President George W. Bush.","filename":"data/vaneerConsumption/GucciferHackerWhoLeakedBushPaintingsIsSentencedtoJail.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/133071/130122-guccifer-hmed-6p_a78b85ae574f5ed9ea042a4d26b8484a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_guccifer-hacker-who-leaked-bush-paintings-sentenced-jail-n124556_1540244863.html","title":"'Guccifer' Hacker Who Leaked Bush Paintings Is Sentenced to Jail","title_page":"'Guccifer' Hacker Who Leaked Bush Paintings Is Sentenced to Jail","title_rss":"NULL","source_domain":"nbcnews.com","text":"Guccifer shot to fame in 2013 after he hacked into the Bush family emails and posted artwork by the former president, including self-portraits in the bathtub. The same year, the hacker distributed emotional emails sent to former U.S. secretary of state Colin Powell from European Parliament member Corina Cretu, a Romanian, prompting Powell to deny that they had an affair.\nGuccifer also broke into a private Yahoo email account of Romania's secret service chief George Maior, which his agency said had been used before for academic correspondence.\n\"The aggrieved parties Corina Cretu and George Cristian Maior did not turn into civil claimants ... The defendant is obliged to pay 11,000 lei ($3,400)in legal fees to the state,\" the Bucharest court said on its website.\nIt did not publish any details on his actions and said the sentence could be appealed.\nAn official at the Romanian general prosecutor's office, who has knowledge of the case but who did not want to be named, told Reuters the office had no knowledge of any extradition request for Guccifer from the United States.\nNo mention of the hacker's activities in the United States was made in court, the official added.\nGuccifer claimed a wide range of victims and provided documents to support those claims to a U.S. website, The Smoking Gun.\n- Reuters","url":"https://www.nbcnews.com/news/world/guccifer-hacker-who-leaked-bush-paintings-sentenced-jail-n124556"}
