{"authors":["Clemence Michallon For Mailonline"],"date_download":"2018-10-23 04:24:24","date_modify":"2018-10-23 04:24:24","date_publish":"2016-01-11 17:25:43","description":"Tanya Foster, 24, and Scott Lucas, 27 (pictured), of Guildford, Surrey said injuries happened while playing. Their relatives organised an intervention and realised how badly the child was hurt.","filename":"data/vaneerConsumption/Guilfordcouplearejailedforcausinginjuriestobabyincludingblackeyes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300CF33700000578-0-image-a-108_1452532851027.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394232_Guilford-couple-jailed-causing-injuries-baby-including-black-eyes-slap-marks-face-burns-bottom_1540268664.html","title":"Guilford couple are jailed for causing injuries to baby including black eyes","title_page":"Guilford couple are jailed for causing injuries to baby including black eyes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lucas is a recovering heroin addict and the abuse started when they moved in together\nA couple who caused 21 injuries to a 21-month-old baby who was left with black eyes, adult hand marks on her face and burn marks on her bottom were jailed today.\nRelatives of Tanya Foster, 24, and Scott Lucas, 27, of Guildford, Surrey, told the police they were concerned over the pair's actions towards the baby between December 2013 and January 2014.\nBruises and knocks to the face and body of the baby were first dismissed as injuries caused by other children during play fights.\nBut the family organised an intervention and discovered the extent of the child's injuries while her nappy was being changed.\nScott Lucas, 27 (left), and Tanya Foster, 24 (right), were jailed for causing 21 injuries to a 21-month-old baby who was left with black eyes, adult hand marks on her face and burn marks on her bottom\nPaediatric doctors and plastic surgeons later agreed that the injuries inflicted could only have been by the hands of an adult and not other children.\nThey confirmed the assaults could not have occurred through accidental incidents.\nFinger grip marks and signs of historic black eyes were discovered on the baby, who was taken to the hospital. There, the full catalogue of injuries was revealed.\nThe young child also had two burn marks on her bottom, injuries which 27-year-old Lucas told police were carpet burns caused while playing indoors.\nJudge Christopher Critchlow dismissed his story and sent both Lucas and Foster to jail for their roles in causing or failing to prevent the injuries.\nThe couple both admitted one count of causing or allowing serious injury to a child between December 2013 and January 2014.\nFoster had finished an abusive relationship with one man before commencing a romantic relationship with Lucas, a recovering heroin addict, and the abuse began just weeks after the pair moved in together, the court heard.\nBrian Stork, prosecuting, said: 'There were significant amounts of injuries and we submit that some are serious in their own and the cumulative effect of the injuries are serious indeed.\n'This was not accidental, the injuries were inflicted unlawfully.\n'Given how visible some were and the pain and distress caused to the child, it is inconceivable that the other adult did not know what was going on. They knew and they didn't prevent it or even try to stop it.\n'It does not matter that one or the other night have inflicted it. They are both responsible for the suffering that child went through.'\nJudge Critchlow, sitting at Guildford Crown Court, added: 'There were 21 areas of harm on the body of that baby. She had been slapped across the face and the injuries are all visible on photos taken at the time. Anyone can see how these injuries were caused.\n'You will both be sentenced as perpetrators of the crime against this poor little defenceless child.\n'Any decent human being looking at those photographs and realising how the baby suffered in pain and distress, will feel anger that she could have suffered in this way and no-one protected her.\n'With any luck she will not suffer any psychological damage or will not even remember it because of her age.'\nLucas was sentenced to three years imprisonment and Foster to 15 months in custody.\nFoster, dressed in a dark blue jacket with her long dark hair swept into a high pony tail, wept as she was taken from the dock to prison, while family members shouted in disbelief at the sentences delivered.","url":"https://www.dailymail.co.uk/news/article-3394232/Guilford-couple-jailed-causing-injuries-baby-including-black-eyes-slap-marks-face-burns-bottom.html"}
