{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:19:43","date_modify":"2018-10-30 21:19:43","date_publish":"2016-05-02 12:09:50","description":"A Texas high school senior, who spent over two months in jail accused of a making a terroristic threat on campus, described his harrowing ordeal with zero tolerance policies as \"guilty before proven innocent.\" Last week, a grand jury determined there was insufficient evidence to indict him on the felony charge. | Border / Cartel Chronicles","filename":"data/vaneerConsumption/GuiltyBeforeProvenInnocentSaysTexasStudentonZeroToleranceOrdeal.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-463571000.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_05_02__1540934383.html","title":"'Guilty Before Proven Innocent,' Says Texas Student on Zero Tolerance Ordeal","title_page":"'Guilty Before Proven Innocent,' Says Texas Student on Zero Tolerance Ordeal","title_rss":"NULL","source_domain":"breitbart.com","text":"A Texas high school senior, who spent over two months in jail accused of a making a terroristic threat on campus, described his harrowing ordeal with zero tolerance policies as “guilty before proven innocent.” Last week, a grand jury determined there was insufficient evidence to indict him on the felony charge.\n“I feel I was guilty before proven innocent,” Thomas Cade Martin, 19, told Houston’s KTRK 13 (ABC) about how he was treated once Magnolia West High School administrators accused him of making a terroristic threat, expelled him, and then, Montgomery County constables arrested him on Feb. 11, all because of a cell phone video someone else shot of him speaking to other students about terrorism.\nMartin remained in the county jail since his arrest. KTRK 13 reported Martin’s family could not afford his bail, although, on Feb. 13, the online Montgomery County Police Reporter noted the county held Martin without bond.\nThroughout, the teen maintained he never intended to harm anyone, asserted the comments were taken “way out of context,” and called the incident a “big, huge misunderstanding.” He said: “I was just trying to explain myself and give a scenario to the students to just show that it is possible that something like that could happen in the small town of Magnolia.”\nLast week, a Montgomery County grand jury decided to “no bill” the district attorney’s indictment because jurors did not find the terroristic threat charge substantially supported by evidence.\nThe social media posted footage in question captured part of a broader conversation in which Martin, who was in the high school’s junior ROTC program, said he spoke to other students on the topic of potential school violence. He indicated he only offered up a scenario. Students are heard laughing during parts of the video, the Houston ABC affiliate reported.\nMontgomery County Constables Precinct 5 serves as security for Magnolia public schools and, according to the Police Reporter article, the county’s district attorney’s office accepted the terroristic threat charge following officers’ rapid response probe headed by the precinct’s David Hill, described as having “no sleep as he and his men and outside investigators worked to identify and interview the individual highlighted in the tape.” Hill brought the Montgomery County Special Crime Unit and the Montgomery County Fire Marshal’s office into the investigation.\nThe online publication rehashed 1999’s tragic shootings in Littleton, Colorado, that left 13 dead on the Columbine High School campus. It noted that Jefferson County Sheriff had “indicators” to act a year before on the two student shooters but did not, a mistake the article suggests the constables did not want to make. “Since that time every simple threat is taken seriously. Even if that threat is nothing more than a hoax or something to put fear in another,” said Hill.\nBreitbart Texas reports on the school-to-prison pipeline, the direct result of zero tolerance in public schools. These harsh policies often derail youngster’s futures by placing them in early contact with the criminal justice system. However, these policies actually took hold five years before Columbine, under the Improving America’s Schools Act of 1994, when the U.S. Congress required all 50 states to adopt a law that guaranteed one-year expulsions for students who brought a firearm to school — in exchange for federal funding.\nThe law was part of the Clinton administration’s Goals 2000, which later emerged as part of Democratic U.S. Sen. Ted Kennedy’s brainchild, the No Child Left Behind Act, later signed into law by former Pres. George W. Bush.\nUSA Today reported that many state legislatures expanded the definition of a weapon based on the 1994 federal law, limiting the discretion of school administrators. Texas public school administrators have broad discretionary leeway and the education code gives school districts the authority to refer students to law enforcement based on discretionary offenses deemed “disruptive.” As Breitbart Texas reported, the problem with this is that “disruptive” is a vague and relative term in politically correct, compliance-seeking times.\nIn Texas, student code of conduct handbooks define behavioral infractions and punishments, written in accordance with the state’s 1995 Safe Schools Act and Chapter 37 of Texas Education Code. It addresses threats, hoaxes, assaults, plus perceived and discretionary threats and often triggers action by the juvenile/criminal justice system moving youths onto the school-to-prison pipeline. Not only is it littered with harsh blanket consequences over words and actions, even when harmless, the pipeline creates a paper trail that can derail a youth’s future college and career prospects.\nBack on Feb. 12, the Magnolia Independent School District and the Montgomery County Precinct 5 Constable’s Office had a lot to say to the media about Martin’s arrest. Hill’s office shared it uncovered information that justified filing the felony criminal mischief charge against the teen, according to The Tomball Potpourri. Hill said: “It is sad when one of our own students takes such action that affect the rest of his life.”\nMagnolia ISD administrators issued a detailed statement advising of ramped up security measures over the “threatening manner of the video,” KPRC 2 (CBS) reported.\nSince the jury no-billed the indictment, the school district clammed up, only telling KTRK 13: “Magnolia ISD is prohibited by federal law to discuss discipline. The action taken by the District was consistent and fair with Magnolia ISD’s board policy, student code of conduct and the Texas Education Code.”\nMartin, who wants to be a Navy Seal, wished Magnolia ISD handled the situation differently. “They should have most certainly look in it more thoroughly before they just decided to up and expel me and change my life,” he said. “I would love to have an apology. I feel like I deserve an apology. It’s not because it’s a pride thing. It’s because it would be the right thing to do.”\nThe self-described patriot and believer in the American way of life, plans to move to Wisconsin and finish high school, which the senior did not complete because of his expulsion and jail time.\nAlthough Martin said it is good to be home, his mother, Terra Joelle Bridges said: “His entire life is different because his name has now been associated with such a terrible thing as a terroristic threat.”\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2016/05/02/hold-texas-student-no-billed-grand-jury-describes-school-zero-tolerance-policies-guilty-proven-innocent/"}
