{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-22 23:23:59","date_modify":"2018-10-22 23:23:59","date_publish":"2016-01-29 11:08:46","description":"A video has emerged online of 4,000 people in China feasting on the largest serving of spit-roasted lamb in the world. The meat was cooked on January 23 in Jianyang, Sichuan Province.","filename":"data/vaneerConsumption/GuinnessWorldRecordsetas196wholelambsspitroastedsimultaneously.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B1354500000578-0-image-a-2_1454062372613.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3422496_Un-baa-lievable-Incredible-moment-196-lambs-spit-roasted-simultaneously-record-breaking-feast_1540250639.html","title":"Guinness World Record set as 196 whole lambs spit-roasted simultaneously","title_page":"Guinness World Record set as 196 whole lambs spit-roasted simultaneously | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A video has emerged online of 4,000 people in China feasting on the largest serving of spit-roasted lamb in the world.\nOn January 23, 196 juicy lambs were simultaneously cooked in Jianyang, Sichuan Province, setting a new Guinness World Record, reports the People's Daily Online.\nThe event was organised by 'VIP Shop,' an e-commerce company from Jianyang. It provided over 550lbs worth of meat to hungry locals.\nFeast: 196 lambs spit-roasted simultaneously in China, setting new Guinness World Record on January 23\nTasty: The lambs were well seasoned with herbs and spices including Sichuan pepper and coriander\nDespite the cold weather, the people who attended the event waited for three hours, sitting at huge tables until the lamb was cooked.\nThey ate the lamb after official authentication of the new record from Guinness World Records adjudicator Lisa Hoffman. She made the announcement on a stage and the crowd indulged.\nThe record was set for 'the most lambs spit-roasted simultaneously,' 196 in total.\nThe 90-second video shows whole lambs spit-roasting on a huge handmade coal barbecue.\nThousands of people can be seen wrapped up warm, sitting at their tables waiting anxiously.\nThe announcement is made for the world record, then whole lambs are placed on the tables and the feast begins.\nEveryone involved looks extremely happy as they tear off the meat from the lambs and enjoy their free meal.\nThe spit-roasted lambs, weighing a total of 551lbs, were seasoned with all kinds of herbs and spices, including Sichuan pepper and coriander.\nWorld Record: The cooking process could not begin before all of the lambs were placed on the rotisserie\nJuicy: Each that that was cooked had to be spit-roasted whole on the rotisseries at the start of the signal\nStripped: Whole lambs were placed on the table, and the hungry crowd ate every last piece to the bone\nOfficial: The lamb was eaten after authentication from Guinness World Records judge Lisa Hoffman (centre)\nAccording to Guinness World Records, it was a new category so this is the first record of its kind.\nThere were key rules that had to be followed in order to set the record successfully.\nThese include, roasting each lamb whole, the cooking process must not begin before the lambs are placed on the rotisserie, and the rotisseries may be manual or mechanical in operation.\nMeat feast: An e-commerce company from Jianyang provided over 550lbs worth of meat to hungry locals\nExcitement: When the locals of Jianyang finally indulged they were extremely happy with the lamb feast\nPatient: Thousands of people waited for three hours for the spit-roasted lambs to cook in freezing conditions\nAt the sound of a loud start signal, cooking must begin on all lambs simultaneously.\nAny lambs not receiving heat within two minutes of this start time must be discounted from the total.\nIt is not required that the lambs be cooked on a single continuous spit, but all cooking must take place within a single defined venue.\nAnd finally, at the end of the cooking process, all lambs must be completely edible and safe to eat. For example, they can't be burnt or undercooked.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3422496/Un-baa-lievable-Incredible-moment-196-lambs-spit-roasted-simultaneously-record-breaking-feast.html"}
