{"authors":[],"date_download":"2018-10-22 20:27:08","date_modify":"2018-10-22 20:27:08","date_publish":"2016-09-08 00:00:00","description":"Known for the avant-garde sound he brings to Wilco, Cline turns to ballads and jazz standards on his new album. He describes it as a \"mood-music record\" that isn't \"cheesy.\"","filename":"data/vaneerConsumption/GuitaristNelsClineOnLoversAnAlbum25YearsInTheMaking.json","image_url":"https://media.npr.org/assets/img/2016/09/08/nelscline_5_bynathanwest_wide-da08c9a842e699b58a1ade916947083e9205653e.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_09_08_493086166_guitarist-nels-cline-on-lovers-an-album-25-years-in-the-making_1540240028.html","title":"Guitarist Nels Cline On 'Lovers,' An Album 25 Years In The Making","title_page":"Guitarist Nels Cline On 'Lovers,' An Album 25 Years In The Making : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Guitarist Nels Cline On 'Lovers,' An Album 25 Years In The Making\nEnlarge this image toggle caption Nathan West /Blue Note Records Nathan West /Blue Note Records\nNels Cline is unabashed about his love for sound. \"I get a kind of fundamental, if not moronic, pleasure from sound as soon as it starts,\" he tells Fresh Air's Terry Gross. \"Even in sound checks, once we start playing, I'm in the zone. I'm happy, because I like playing.\"\nAs a guitarist in Wilco, Cline is known for his sonic explorations with feedback, distortion and unfettered improvisation. His new album, Lovers, is a collection of lushly arranged versions of American popular songs, covers and originals.\nCline says the new record — which he describes as a \"mood-music record\" that isn't \"cheesy\" — is something he's been pondering and dreaming about for more than 25 years. \"It's an attempt to show feelings, update and be more thorough [about] the idea of romance, sexuality, intimacy and how that relates to songs,\" he says.\nInterview Highlights\nOn the influence of jazz guitarist Jim Hall\nI have to say that Jim Hall is a huge inspiration and a touchstone for much of this record for me. And Jim and I were sort of getting to know each other not long before he passed away. And while I was making this record there were certain pieces that I really couldn't wait to play for him, but he passed away in the last day of tracking, in his sleep, in his apartment, a block from where I've been living in Manhattan.\nJim was a genius and he was also really a master of understatement, and I think maybe in this case my deep love of him is not merely aesthetic and musical, but also there's that kind of love of the other, you know? Because yes, I have a million notes buzzing in my head, and when you hear \"Lady Gabor\" on the Lovers record you hear me doing live looping and all these kinds of things that I enjoy doing that are, I guess, a part of my style. I do aspire to growing up someday to being more like Jim.\nYouTube\nOn joining Wilco in 2004\nJeff [Tweedy] was, unbeknownst to me, going through some real problems with prescription painkiller addiction. So right when I joined, we were going to go on tour, he went into a hospital and basically got clean. The tour was canceled and people were really worried that I had hitched my wagon to some sort of dysfunctional vehicle, but in reality, it was quite the opposite. I had total faith in Jeff, and my faith was well placed. We soldiered on, he's been completely cool — he even quit smoking many, many years ago — and 12 years have gone by of solid music-making with the same six dudes. It's really, really been amazing.\nOn figuring out how he fit into Wilco musically\nThe Wilco songbook kind of brought out my 14-year-old aesthetic self, the rock-'n'-roll obsessive that was listening ardently to Buffalo Springfield and The Byrds and The Beatles and Rolling Stones, that music that I grew up with, and interestingly, I think trying to channel either my initial idol Jimi Hendrix or trying to fake some Clarence White, or you know what I mean, some great Glen Campbell stuff or something. And then Jeff has to tell me sometimes, \"You're being too reverent to this material,\" and sometimes I think he wants me to destroy the song, as he did on a song like \"Dawned On Me,\" where I think I was trying to come up with some little jingle-jangly thing, and while I was messing around I was strangulating my '60s guitar with an amp that was basically — I blew up the amp doing this — and he said, \"That's the sound that should be in the solo section!\"\nSo that would not have been my first impulse, and I think that people think it is — that my whole raison d'être was to bring some sort of chaotic sound design to Wilco's ensemble sound — but it wasn't. I really enjoy addressing this more classicist aspect of popular music, whether it's country, folk or rock 'n' roll, and just trying to make the song sound like the song should sound.\nOn being an identical \"mirror\" twin\nFrom what I understand, it's a type of twin where the egg separates at a very, very late stage in development, and he's right-handed, I'm left-handed. We're opposite personalities to a great extent. His hair parts naturally on an opposite side from mine. We're called mirror twins because if you come up behind me and I'm looking at myself in the mirror, I look like my brother and vice-versa.\nOn how he differentiated himself from his brother growing up\nWe liked all the same music for the most part, but there were certain bands that were my bands and there were other bands that were his bands. Even though we listened to everything at the same time together. For example, Frank Zappa, The Mothers of Invention, that was an obsession of my brother's. Well, he was always going to be the Zappa guy, or he was always going to be the Jethro Tull guy. He tormented me with Black Sabbath at the time.\nAnd rarely did we switch over. So for example, like he loved the Grateful Dead when they were psychedelic, and then when Workingman's Dead came out I loved that and I became the Grateful Dead listener. That was a rare event. The same thing happened with Joni Mitchell, where I was listening to Joni Mitchell and then when she started playing the Hejira-era stuff with Jaco Pastorius and whatnot, he became obsessed with that music, and I said, \"Hey man, it's a great record, but go for it. You can have the Joni records now.\"","url":"https://www.npr.org/2016/09/08/493086166/guitarist-nels-cline-on-lovers-an-album-25-years-in-the-making"}
