{"authors":[],"date_download":"2018-10-30 14:30:35","date_modify":"2018-10-30 14:30:35","date_publish":"2018-09-17 00:00:00","description":"Eight council members have co-sponsored legislation seeking an independent review of the Gulch funding proposal.","filename":"data/vaneerConsumption/GulchdealpausedasAtlantaCityCouncilseeksanswers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/17/Videos/4485245.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_a_df244b88cb25cd46c3003928487bf1fd__1540909835.html","title":"Gulch deal paused as Atlanta City Council seeks answers","title_page":"Gulch deal paused as Atlanta City Council seeks answers","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta City Council hit the pause button this week on Mayor Keisha Lance Bottoms’ push for up to $1.75 billion in public financing to redevelop the Gulch.\nThe move shook many City Hall observers. The council seldom asserted itself in the prior eight years under former Mayor Kasim Reed, and for some, the legislative branch’s new-found backbone is a welcomed change. But others worry the council’s emerging independence could bog down City Hall — at exactly the wrong time.\nEight council members, a majority of the district and citywide seats, have co-sponsored legislation seeking an independent review of the Gulch funding proposal to examine the public costs and benefits of the deal. Such an audit, if approved by council, could slow down the process by weeks or months.\nEither way, negotiations between the city and a developer that wants to build an up to $5 billion mini-city downtown will soon enter a new, potentially unpredictable, phase.\nCritics of the Gulch deal say the council must put the proposal to the strictest scrutiny and be prepared to walk away, while supporters say delays could scuttle a viable effort to revitalize downtown.\nBottoms appears up for a fight with City Council. She suggested in an interview there’s likely little flexibility in negotiations with developer CIM Group.\nAnd any delay, Bottoms said, would be “a deal breaker” for a Fortune 500 company that’s looking to relocate its headquarters in Atlanta, depending on what happens with the Gulch. She wouldn’t name the company.\nAsked if the developer is open to make changes to the proposal, Bottoms said, “This is the deal that’s been negotiated.”\nThe Atlanta Journal-Constitution has previously reported that Norfolk Southern is the Fortune 500 company that owns key pieces of the development site, and the railroad giant is also scouting Atlanta — in particular, Midtown — for a new headquarters location.\nNorfolk Southern wants to sell its Gulch land as precondition for relocating from Virginia, Gov. Nathan Deal said Tuesday, urging council support.\nUnder Reed, the council often acted more like a rubber stamp than a check on public financing of marquee projects, such as Mercedes-Benz Stadium, political observers said. But with seven new members entering office in January, the council demanded more time to process an up to $5 billion development deal that could reshape downtown.\nMichael Leo Owens, an Emory University political science professor, said the city needs council to serve as a check on the executive. Greater transparency in the deal is worthwhile for Bottoms, too, he said.\nDevelopers stand to make “crazy money” off the deal, Owens said, and it’s appropriate to have a thorough vetting.\nAngst in the city is real. Residents of intown neighborhoods are fearful of gentrification and being priced out by development.\n“They’re committed to not being run over by progress,” he said. “They want to share the progress.”\nBut there’s also risk for the council.\n“If the council is going to do this independent thing, it has to be good at what it’s doing,” he said.\nBottoms ran as Reed’s chosen successor, but most of the new council members did not rely on Bottoms’ coattails to win their seats. Some campaigned at least in part on changing the culture of City Hall.\n“Some of them believe they’ve come in with a mandate from their constituents,” said Williams Boone, a political science professor at Clark Atlanta University.\nCity Councilwoman Natalyn Archibong speaks during a council work session related to plans to redevelop downtown’s Gulch. The up to $5 billion project, which could include $2 billion in public financing, will require Mayor Keisha Lance Bottoms to convince the council that the skyline-altering project is worth the public investment.. BOB ANDRES /BANDRES@AJC.COM (The Atlanta Journal-Constitution)\nSearch for answers\nAt Monday’s council meeting, a parade of residents assailed the project, deriding the deal as a giveaway to developers.\nBottoms and CIM have pitched the project as one that will pay for itself, using future expected sales and property taxes to finance vital infrastructure needed to make the site feasible.\nCritics like Julian Bene, a former board member of Invest Atlanta, the city’s development agency, said they are wrong.\nThe deal will hit the city’s budget because businesses that might have located in other areas of the city and contributed their full taxes to the general fund are likely to locate or expand in the Gulch where the tax dollars will stay there.\nThat means a heavier tax burden for everyone else, he said.\nThe council has not determined what an acceptable deal looks like.\nBottoms touts the public benefits.\nCIM wants to build a mix of office towers, apartments, retail and hotels between the Five Points MARTA station and Mercedes-Benz Stadium.\nIt has made commitments for at least 200 units of affordable housing, a $28 million donation to a housing trust fund and other concessions.\n“To say it’s not enough, that’s not accurate,” she said.\nRELATED CONTENT: GULCH PROJECT\nBottoms scheduled a Wednesday public hearing at City Hall to answer residents’ questions.\nCouncilman Amir Farokhi, who represents Old Fourth Ward, said no one wants talks to linger for months.\n“I think we want to get some sharper answers in the coming weeks and hopefully come to an agreement — or not — and move forward,” he said.\nSeparately, Amazon has scouted the Gulch and CIM’s proposal for its second headquarters.\nBut if council approves tax incentives, the project will go forward either way, even if Amazon doesn’t bite, though likely on a smaller scale, the developers have said. No tenants have been announced.\nCrisscrossed by freight and MARTA rail lines, the Gulch sits 40 feet below street level. CIM said a $500 million platform, funded by the future tax revenue, is needed to facilitate redevelopment.\nA.J. Robinson, CEO of Central Atlanta Progress, a downtown business coalition, said he’s optimistic an agreement with CIM will emerge.\nThe property and sales tax dollars needed for the infrastructure only exist with if the project is built, Robinson said.\n“The deal structure has been misunderstood as a public handout to the development team. It’s not — the city doesn’t have the public funds to do that,” he said.\nAtlanta City Councilman Amir Farokhi speaks during a council work session related to plans to redevelop downtown’s Gulch. The up to $5 billion project, which could include $2 billion in public financing, will require Mayor Keisha Lance Bottoms to convince the council that the skyline-altering project is worth the public investment. BOB ANDRES /BANDRES@AJC.COM (The Atlanta Journal-Constitution)\n‘Public fatigue’\nCouncilman Andre Dickens, who holds a citywide seat, said the deal has room for improvement.\nHe said the administration needs a formal community benefits agreement. Right now, under the proposal, there are minority hiring goals. But those need to be iron-clad requirements, he said.\nWith the city facing an affordable housing crunch, there should be a requirement for more units at a lower price.\nCouncil members also want to know all investors, contractors, lawyers and lobbyists tied to the deal — to eliminate the risk of conflicts of interest.\nCouncil President Felicia Moore said that, given the cloud of a federal corruption investigation at City Hall, and the project’s origins under the Reed administration, the deal warrants more scrutiny.\nBefore taking office as president, Moore represented District 9 for 20 years. She was often one of the few dissenters on council during the Reed administration.\nShe said Reed often had the votes he needed before legislation was ever filed, and votes sailed through without much council input.\n“I think half the council being new and not sort of indoctrinated in the way things used to be certainly is a motivating factor, and has helped get some veteran members to come on line,” she said.\nFive of the eight co-sponsors of the audit legislation are freshmen members.\nFarokhi said affordable housing is one of his top concerns. He also wants assurances that space for future commuter rail is preserved.\nRoads on the 40-acre site would be built in part with public money and owned by CIM. Farokhi said the public needs to know what that means for public access.\nFor instance, he said, would protesters be arrested for walking on the development’s streets?\n“The size of the deal requires us to be prudent and thoughtful,” he said. “Most folks want to see something happen at the Gulch, but there’s public fatigue of public financing of mega-deals.”\nHoward Shook, a city councilman who represents Buckhead, said he wants development in the Gulch, but he called the CIM proposal “too rich for my blood.”\nHe said he isn’t sure CIM will be very flexible. The company spent a lot time and effort negotiating with the city, state and Norfolk Southern.\n“I think they walk before a couple more council votes get rounded up,” Shook said. “Which is ironic because you might have more council members who think the longer this goes the more valuable my vote is.”\nHe was also critical of the call for an audit.\n“I don’t need a consultant to tell me how to vote,” Shook said.","url":"https://www.ajc.com/news/local-govt--politics/atlanta-city-council-asserts-itself-gulch-talks-enter-new-phase/z9uDGmFXtadYsdoj0PUNnM/"}
