{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:35:07","date_modify":"2018-10-30 20:35:07","date_publish":"2016-07-08 17:59:49","description":"During a Friday press conference following Thursday's Dallas shootings, Attorney General Loretta Lynch suggested gun control is the answer.","filename":"data/vaneerConsumption/GunControlPartofAnswertoDallasAttack.json","image_url":"https://media.breitbart.com/media/2016/07/Dallas-police-barricade-sniper-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_08__1540931707.html","title":"Gun Control Part of Answer to Dallas Attack","title_page":"AG Lynch: Gun Control Part of Answer to Dallas Attack","title_rss":"NULL","source_domain":"breitbart.com","text":"During a Friday press conference, Attorney General Loretta Lynch expressed condolences over the July 7 attack on Dallas police officers and suggested it is time to re-examine “the ease with which wrongdoers can get their hands on deadly weapons.”\nLynch’s press conference aired on CNN, where she spoke of the attack on Dallas police officer, then referenced two recent high-profile officer-involved shootings of black men: one in Baton Rouge and one in Falcon Heights, Minnesota.\nLynch said:\nThe peaceful protest that was planned in Dallas last night was organized in response to the tragic deaths of Alton Sterling in Louisiana and Philando Castile in Minnesota. We have opened a civil rights investigation in Louisiana, and we are providing assistance to local authorities in Minnesota, who are leading the investigation there.\nLynch referenced again the “devastating loss” of the five deceased Dallas police officers, saying, “Americans … are feeling a sense of helplessness, of uncertainty, and fear.” She said the feelings “are understandable and justified,” but she stressed that the answer is “never violence.”\nShe then outlined a few aspects of what she believes to be the proper answer, which she presented as “action” that includes “working to build trust between communities and law enforcement,” in addition to gun control. Lynch stated, “We must take a hard look at the ease with which wrongdoers can get their hands on deadly weapons and the frequency with which they use them.”\nBreitbart News previously reported that President Obama took a similar tack when addressing the ambush attack on Dallas police. He said there was “no possible justification” for the attack, then quickly signaled that a gun control push will be forthcoming.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/07/08/attorney-general-lynch-gun-control-part-answer-dallas-attack/"}
