{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:51:25","date_modify":"2018-10-30 19:51:25","date_publish":"2015-10-14 18:54:00","description":"In the push for gun control, the left pits law-abiding citizens against citizens with mental illness, leaving out citizens who are evil.","filename":"data/vaneerConsumption/GunControlCannotFixEvil.json","image_url":"https://media.breitbart.com/media/2015/10/chris-harper-mercer-vester-flanagan.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540929085.html","title":"Gun Control Cannot Fix Evil","title_page":"Gun Control Cannot Fix Evil | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the push for gun control undertaken in the wake of the heinous attack on Umpqua Community College, the left has presented the usual dichotomy to the American people–one that pits law-abiding citizens against citizens with mental illness. Lost in this dichotomy is a third and very important category–namely, citizens who are evil or are driven by evil intent.\nGun controllers prefer to limit the options to group A (law-abiding) or group B (mentally ill) because that allows them to paint nearly every gunman as someone suffering from mental illness, which, in turn, allows them to push for expanded background checks to stop mentally ill people from getting their hands on guns. The problem with this is that it also stops many law-abiding citizens from getting their hands on guns for self-defense due to the burdensome procedure of purchasing a gun under an expanded background check system.\nAnd while all this effort is expended to be sure guns stay out of the hands of the mentally ill, the most dangerous group–group C (evil)–have no qualms about lying on a background check to acquire their gun or acting calm to fit in until the day they decide to cut loose and unleash wrath on those around them as a result of unchecked hatred.\nPeople do not have to be mentally ill to commit such heinous acts; they simply have to be evil or driven by evil intent. And gun control will never stop people like this–people who are lucid and obedient to the letter of the law yet simultaneously raging within and plotting the moment they may wreak havoc.\nConsider the number of mass shooters and alleged mass shooters who were able to hide their intentions and pass a background check for a gun they then used to murder innocents. The list is daunting:\nChris Harper Mercer (Roseburg, Oregon), Vester Lee Flangan (Virgina), John Russell Houser (Lafayette), Muhammad Youssef Abdulazeez (Chattanooga), Dylann Roof (Charleston), Elton Simpson and Nadir Soofi (Garland), Jared and Amanda Miller (Las Vegas), Elliot Rodger (Santa Barabara), Ivan Lopez (Fort Hood 2014), Darion Marcus Aguilar (Maryland mall), Karl Halverson Pierson (Arapahoe High School), Paul Ciancia (LAX), Andrew John Engeldinger (Minneapolis), Aaron Alexis (DC Navy Yard), Tennis Melvin Maynard (West Virginia), Wade Michael Page (Sikh Temple), James Holmes (Aurora theater), Jared Loughner (Tucson), Nidal Hasan (Fort Hood 2009), Jiverly Wong (Binghamton), Seung-Hui Cho (Virginia Tech), Naveed Haq (Seattle), and Mark Barton (Atlanta).\nDid some of these attackers suffer from mental illness? Perhaps. But to what degree might that illness–where present–have been mixed with evil or in how many of them was evil the driving force all along? By using mental illness as a scapegoat for the actions of many of these individuals, we fail to face the truth–which is that evil cannot be removed from the heart of man by a new law. Rather, it can be constrained via an armed citizenry able to render an immediate and forceful response to anyone who allows the evil in their heart to break into full rage against their fellow man.\nBecause of this, the pursuit of more gun control in the name of mental illness is a losing cause. It will not stop mass shootings, and it will only lead to a day where gun control proponents assure us that they just need one more law or one more statute to keep us safe, and once that new law fails to restrain evil, they will tell us they need yet one more. And so the gradual loss of freedom takes place.\nHonest gun control advocates know this, even though they might not realize they do.\nCalifornia provides a perfect example. Following the May 2014 attacks in which three people were shot and killed and three others were stabbed to death by Elliot Rodger, CA legislators successfully passed Gun Violence Restraining Orders (GVROs). The ubiquitous point of the orders was to give families a way to seek intervention when a family member who displayed mental illness was thought to be a danger to himself or to others. By securing GVROs, families of such individuals would set in motion a process of having the guns of the mentally ill person confiscated for a period of time, giving a reprieve to those around him and giving the individual time to seek treatment.\nBut just months after Governor Brown signed GVROs into law, UCLA law professor Adam Winkler–a rare criticizer of the gun control movement–told the National Journal that GVROs will “not … make a huge dent in our gun violence statistics.” And he explained that the failure of GVROs will be due to the fact “that it is very rare to know in advance when someone is going to be dangerous with a firearm.” A case in point would be Sandy Hook gunman Adam Lanza, whose mother never detected the evil he was capable of committing and, therefore, never would have sought a GVRO to keep guns away from him.\nWhen a heinous attack like the one at Umpqua Community College takes place, our choices ought not be constrained between the dichotomy of law-abiding citizens vs. the mentally ill. Rather, we should also consider the evil that exists and that can drive one man to do great harm to those around him.\nSeen in this light, the remedy to an attack like the one in Oregon is not more gun control laws, but a re-examination of policies that force decent, law-abiding citizens to sit in classrooms unarmed while unaware that the person next to them is about to boil over with hatred. Such policies force the innocent to live at the mercy of the evil.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/14/gun-control-cannot-fix-evil/"}
