{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:50:05","date_modify":"2018-10-30 22:50:05","date_publish":"2015-12-01 08:00:00","description":"This week’s shooting in San Bernardino comes as a debate over gun control that has divided Democrats in the state Capitol could head to the voters of","filename":"data/vaneerConsumption/GuncontrolinabluestateItsmorecomplicatedthanyoudthink.json","image_url":"https://calmatters.org/wp-content/uploads/guns.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939805.html","title":"Gun control in a blue state: It’s more complicated than you’d think","title_page":"Gun control in a blue state: It’s more complicated than you’d think | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"This week’s shooting in San Bernardino comes as a debate over gun control that has divided Democrats in the state Capitol could head to the voters of California next year.\nNearly three years ago, after a man killed 26 women and children at the Sandy Hook Elementary School in Connecticut, Democrats in the state Legislature announced a sweeping plan to regulate firearms. It seemed likely to pass in a state that already had some of the nation’s toughest gun restrictions and a strong Democratic majority in the statehouse.\nIn the end, however, just two of the eight proposals were signed into law and 13 Assembly Democrats helped Republicans defeat some of the measures.\n“Democrats are not all on the same page about anything,” said Sen. Loni Hancock (D-Berkeley), who carried a failed bill to ban possession of large-capacity magazines.\nNow, Lt. Gov. Gavin Newsom is working to qualify an initiative on next year’s ballot that includes some of the policies that were rejected in Sacramento. His ballot measure would, among other provisions, require background checks for ammunition purchases and prohibit Californians from possessing gun magazines that hold more than 10 rounds. Both of those policies failed in the Assembly.\n“We’re not doing this in response to San Bernardino. It was the right thing to do before then, it is certainly is the right thing to do today,” Newsom, a Democrat, said in an interview Thursday.\n“I don’t know what more evidence people need.”\nCalifornia already has gun-control laws stronger than many other states, including universal background checks and a ban on many assault weapons. The Law Center to Prevent Gun Violence, a group that supports gun restrictions, gave California an A- last year for the strength of its gun laws.\nYet even in a state as blue as California, Democrats in the Capitol can defy expectations when it comes to guns. Though many gun-control bills have broad support, some have been vetoed by Democratic Gov. Jerry Brown. Others fall flat in a Legislature where some Democrats — particularly those from inland California — are sensitive to gun owners and their grassroots lobbying campaigns.\nNewsom, who plans to run for governor in 2018, has said the initiative is necessary to fight the gun lobby’s effectiveness in the state Capitol. But some Democrats say the opposition in their party to some gun laws is both a political concern as well as a reflection of their constituents’ values.\nGun ownership “is part of the cultural fabric of rural California and a practical matter when you live in parts of the state where the nearest police officer on a Friday night is 38 miles away,” said Richie Ross, a political consultant who has run Democratic campaigns in the Central Valley for decades.\nHis clients include Democratic Assembly members Adam Gray (D-Merced), Henry Perea (D-Fresno) and Rudy Salas (D-Bakersfield), all of whom rejected the ammunition and magazine bills.\nAssemblywoman Susan Eggman (D-Stockton) did not support those bills because they would have “burdened law-abiding gun owners without improving public safety or preventing criminals from getting guns,” said her spokesman Christian Burkin. He added that she has voted in favor of other gun-control bills, including one that prohibits purchasing large-capacity magazines.\nSome of the Democrats who rejected the ammunition and magazine bills held politically competitive seats and faced difficult re-election challenges. Assembly members Steve Fox (D-Palmdale) and Sharon Quirk-Silva (D-Fullerton) voted against the bills and still lost to Republicans last year.\nBrown twice vetoed another provision included in Newsom’s measure: a requirement that gun owners report lost or stolen firearms to law enforcement. “I continue to believe that responsible people report the loss or theft of a firearm and irresponsible people do not,” Brown wrote in a 2013 veto message.\nNewsom has framed his ballot measure as an opportunity for voters to get around the gun lobby’s influence in Sacramento. The initiative is expected to begin collecting signatures early next year to qualify for the 2016 ballot.\nYet compared to most of the powerful interests working to sway policy in Sacramento, gun-rights groups spend relatively little on lobbying and campaign donations, with most of their money going to Republicans.\nOver the last 15 years, major pro-gun groups have given at least $440,000 to state-level campaigns in California, according to a search of the Secretary of State’s campaign finance database. The Altria cigarette company spent about 100 times as much during the same time period.\nAmong the 13 Democrats who helped defeat the bills now incorporated in Newsom’s measure, Assemblyman Jim Frazier (D-Oakley) is the only one who reported contributions from pro-gun groups.\n“The gun community in California is a universe of $25 to $35 donors. … We’re talking dozens and dozens of small contributions,” said Sam Paredes, lobbyist for the Gun Owners of California.\nInstead of large contributions, gun groups rely on grassroots lobbying to win battles in the Legislature.\nIn the debate over the ammunition regulation bill, one assemblyman held up a poster-sized photograph of 33,000 emails he said he received against the bill. Democrat Fox said he received nine emails in support and 670 emails “specifically from my district, against this.”\nThat kind of lobbying presents a challenge for gun-control advocates, said Amanda Wilcox, of the Brady Campaign to Prevent Gun Violence: “I’m sure these moderate Democrats get a lot of phone calls and that is probably a big reason why it’s difficult to get their votes sometimes.”","url":"https://calmatters.org/articles/gun-control-in-a-blue-state-its-more-complicated-than-youd-think/"}
