{"authors":[],"date_download":"2018-10-30 14:14:32","date_modify":"2018-10-30 14:14:32","date_publish":"2018-07-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Guncontrolshakesalotofleftisthypocrisyoutofthewoodwork.json","image_url":"https://www.americanthinker.com/images/bucket/2018-07/208043.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_07_gun_control_shakes_a_lot_of_leftist_hypocrisy_out_of_the_woodwork_1540908872.html","title":"Gun control shakes a lot of leftist hypocrisy out of the woodwork","title_page":"Gun control shakes a lot of leftist hypocrisy out of the woodwork","title_rss":"NULL","source_domain":"americanthinker.com","text":"His latest opinion piece, here , says one death is too many when it involves guns, so I have some easy questions for him.\nLeonard Pitts, Jr. is a Miami Herald columnist who writes a lot of left-wing nonsense. In his latest column, he's managed to outdo himself.\nIs one death too many when a person is killed by an illegal alien? Why aren't these murders covered much by the media? Is it because they just don't fit the agenda? Why is it that when someone dies because of a gun, Pitts and other journalists say we need more strict gun laws on everyone? But when illegal aliens cause deaths and commit other crimes, they don't say we need more strict immigration laws?\nGang members illegally cross borders and commit many crimes, including rape and murder, yet somehow Pitts and others don't want to tighten up the border to make citizens safer. Why?\nOpioids kill around 42,000 Americans each year, and a significant amount of these drugs comes across the border illegally, but when Trump wants to tighten up the border, writers like Pitts and other Democrats fight him endlessly. Don't they care about those deaths?\nI don't recall as much coverage of the opioid crisis during Obama's eight years or as much focus on alleviating the problem even though it has been obvious for years that it is a major crisis. Why do you think there was less focus by journalists on the problem while Obama was president?\nDo sanctuary cities and states that refuse to enforce immigration laws and cooperate with ICE make citizens in those cities safer?\nChicago has strict gun laws, and Houston, with similar demographics, has lenient gun laws, yet Houston has less gun crime. Doesn't that indicate that something other than guns is the greater cause of the problem? (Like maybe gangs?)\nDid the Promise program in schools allow dangerous students to go unreported in order to make the schools look safer?\nThere are many cases each year where guns save lives, so why don't journalists give more coverage of those lives saved? Isn't saving one life worthwhile? Doesn't it fit the agenda?\nHitler took away the guns from the people. Did that make the people, especially the Jews, safer, or did it leave millions of them to be sitting ducks, unable to defend themselves, to be slaughtered?\nWould America be free if only the British government had the guns and other weapons at the time of the revolution, or would we have been resigned to living under a king?\nThere have been tyrants throughout history, including recent history, who have controlled the weapons and killed millions of people. Don't the people deserve the right to defend themselves as our founding fathers recognized with the Second Amendment?\nHere is a novel suggestion as to how to make the streets safer for the people: keep the career criminals and gangs locked up. Protect the public from mentally ill, dangerous people. That also helps protect the mentally ill and dangerous people themselves.\nIt makes me sick when I see a career criminal, especially a dangerous one, commit a murder or other serious crime. It also makes me sick when I see a known mentally ill and dangerous person not be blocked from buying a gun because the government or someone else does not do his job. Why are so many fighting to reduce sentences of dangerous criminals?\nMaybe we should lock up judges and politicians who let dangerous criminals, including illegal aliens, roam the streets to harm the public when they commit additional crimes instead of always threatening all gun-owners when almost all obey the laws and use their guns safely.","url":"https://www.americanthinker.com/blog/2018/07/gun_control_shakes_a_lot_of_leftist_hypocrisy_out_of_the_woodwork.html"}
