{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:54:17","date_modify":"2018-10-30 20:54:17","date_publish":"2014-11-06 14:55:00","description":"On November 5—the day after a gun control initiative funded by one-percenters passed in Washington state—Initiative 594 (I-594) organizers made clear they |","filename":"data/vaneerConsumption/GunControlBallotOrganizersHopetoBringMoreLawstoWashingtonStateLegislature.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2013/Guns/CT%20Gun%20Rally%20AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_11_06__1540932857.html","title":"Gun Control Ballot Organizers Hope to Bring More Laws to Washington State Legislature","title_page":"Gun Control Ballot Organizers Hope to Bring More Laws to Washington State Legislature | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On November 5—the day after a gun control initiative funded by one-percenters passed in Washington state—Initiative 594 (I-594) organizers made clear they want even more gun control in and may take a similar initiative-approach to gun control in other parts of the country.\nAccording to Seattle PI, I-594 chair Sandy Brown said her group will follow up their November 4 victory with a push for broader gun control in the Washington state legislature. These measures could include “criminal penalties” that could be brought against gun owners whose guns are discovered by children.\nI-594 supporters also said the end-around they did to the state legislature via the ballot initiative is a model for other states to follow. They see opportunity because “about half of America’s states allow citizens—or well-financed interests—to bring initiatives and referendums to the ballot.”\nBreitbart News previously reported that I-594 institutes universal background checks in Washington state, thereby outlawing private gun sales and requiring the compilation of a gun ownership registry. But it overlooks the fact that background checks have never been a hindrance to criminals.\nProof of this is seen in the examples of Santa Barbara gunman Elliot Rodger, 2014 Fort Hood gunman Ivan Lopez, Maryland mall gunman Darion Marcus Aguilar, LAX gunman Paul Ciancia, DC Navy Yard gunman Aaron Alexis, Aurora theater gunman James Holmes, Tucson gunman Jared Loughner, and 2009 Fort Hood gunman Nidal Hasan, among others. Each of these went through background checks to acquire their firearms.\nSo the truth about I-594 is that it will not stop crime, but it will provide an avenue, through gun control proponents, to make it even harder for law-abiding citizens to exercise their Second Amendment rights.\nFollow AWR Hawkins on Twitter @AWRHawkins Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2014/11/06/washington-state-gun-control-proponents-even-more-gun-control-on-the-way/"}
