{"authors":[],"date_download":"2018-10-22 22:29:12","date_modify":"2018-10-22 22:29:12","date_publish":"2014-06-10 08:38:03","description":"The Taliban claimed responsibility for Tuesday's attack, which forced Jinnah International Airport - Pakistan's busiest - to suspend flights.","filename":"data/vaneerConsumption/GunmenAttackPakistaniAirportAcademyinKarachi.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/498496/140610-karachi-530a_afbfe6663dc82f0aaff9a87b0691bb85.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_gunmen-attack-pakistani-airport-academy-karachi-n127101_1540247352.html","title":"Gunmen Attack Pakistani Airport Academy in Karachi","title_page":"Gunmen Attack Pakistani Airport Academy in Karachi","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nISLAMABAD - Gunmen attacked an airport security training facility in Karachi on Tuesday, two days after militants brandishing machine guns and a rocket launcher stormed the city's main airport and set off an hours-long battle that left some 36 people dead.\nThe military downplayed the incident, saying it was in control of the facility hours after three or four gunmen fired on the installation, which is attached to the airport.\n\"Nothing is going on. It was nothing. No serious attack. Just a hit and run,\" Karachi's highest ranked security official, Maj. Gen. Rizwan Akhtar, told NBC News. \"The airport is 100 percent secure.\"\nThe Taliban claimed responsibility for Tuesday's attack, which forced Jinnah International Airport -- Pakistan's busiest -- to suspend flights for the second time in two days.\n\"We proudly claim responsibility for the second attack on ASF today in Karachi. It is revenge for the killing of Hakimullah Mehsud and our attacks will continue throughout the country,\" Taliban spokesman Shahidullah Shahid said, referring to the leader of the Pakistani Taliban who was killed by a U.S. drone strike in November 2013.\nEarlier, images of security guards rushing to the scene splayed across Pakistani television, creating a jarring sense of deja vu.\n\"The ASF academy is under attack. There is gunfire. The extent of the damage is not clear,\" Reuters quoted a senior official at the Federal Investigation Agency as saying on Tuesday.\nTuesday's assault came as airport authorities found seven bodies in a burned building at the Karachi international airport, bringing the death toll from that attack to 36 - including the 10 attackers.\nOvernight, Pakistani fighter jets pounded suspected militant hideouts overnight in a remote mountainous valley on the border with Afghanistan. Unnamed Pakistani officials told NBC News the airstrikes had killed 20 militants.\n\"On confirmed intelligence information about militant hideouts and their presence there, fighter jets fired missiles and destroyed nine of their sanctuaries on early Tuesday morning,\" a senior military official said.\nIt was unclear if the latest air strikes had signaled the start of a broader offensive in the North Waziristan region where the al-Qaeda-linked Taliban are based, or indeed if they had been carried out in retaliation for the airport attack.\n- Wajahat S. Khan and Mushtaq Yusufzai","url":"https://www.nbcnews.com/news/world/gunmen-attack-pakistani-airport-academy-karachi-n127101"}
