{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:40","date_modify":"2018-10-30 19:55:40","date_publish":"2015-04-10 20:50:21","description":"On April 10, Bloomberg.com ran a column full of quotes suggesting NRA members at the Nashville convention are nervous and even fearful over a possible Hillary Clinton presidential run and then juxtaposed this so-called fear with a presentation of Clinton's views that omitted her belief that gun owners \"terrorize a majority of people.\" |","filename":"data/vaneerConsumption/GunOwnersTerrorizeMostPeople.json","image_url":"https://media.breitbart.com/media/2015/04/Hillary-Clinton-very-closeup-AP-PhotoRichard-Drew.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_04_10__1540929340.html","title":"Gun Owners Terrorize Most People","title_page":"Bloomberg Ignores Hillary: Gun Owners Terrorize Most People","title_rss":"NULL","source_domain":"breitbart.com","text":"On April 10, Bloomberg.com ran a column full of quotes suggesting NRA members at the Nashville convention are nervous and even fearful over a possible Hillary Clinton presidential run and then juxtaposed this so-called fear with a presentation of Clinton’s views that omitted her belief that gun owners “terrorize a majority of people.”\nIn other words, they presented Clinton as moderate in her gun control stance, therefore casting the NRA opposition to her as extreme.\nHere is how Bloomberg.com did it. First, they quoted several NRA members who said they were apprehensive about a Clinton run or that they “fear” what she would do against gun rights. One member even expressed worries that Clinton sees gun owners as “almost enemies of the state.”\nBloomberg.com’s response is to reject these silly misconceptions about Clinton by explaining that her real views are much more moderate than those expressed by NRA members. In fact, Clinton actually “supports the right of people to own guns, she just thinks the gun culture has gotten ‘way out of balance.'”\nSee how benign it all appears? There is no need for concern. Unless, of course, you read beyond the Bloomberg.com piece and dig into Hillary’s statements over the last year. If you do that, it is a whole new ballgame.\nIn fact, if you dig a little you may find a Breitbart News report on a June 17 town hall speech in which Clinton claimed gun owners “terrorize a majority of people.” In that same speech she equated semiautomatic guns with “automatic weapon(s)” and intimated that they ought to be banned.\nShe also reminded her listeners of her continued support for more gun control via expanded background checks:\nMy view is, yes we need to thrash this out in the political realm. But the vast majority of Americans–even law-abiding gun owners–want background checks that work, information that is shared immediately, and an awareness that we’re going to have to do a better job protecting the vast majority of our citizens–including our children–from that very, very small group that is unfortunately prone to violence, and now with automatic weapons, can wreak so much more violence.\nNow, juxtapose these things with the fact that some NRA members were apprehensive or even fearful of what Clinton might do with White House power, and it’s not really the NRA members who sound extreme; rather, the extreme position is held by Clinton and those who are providing cover for her.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/the-media/2015/04/10/bloomberg-com-ignores-hillarys-belief-that-gun-owners-terrorize-a-majority-of-people/"}
