{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:11:21","date_modify":"2018-10-30 22:11:21","date_publish":"2015-09-27 18:02:39","description":"Gun Rights Policy Conference: The 'People's Conference For Gun Rights'","filename":"data/vaneerConsumption/GunRightsPolicyConferenceAPeoplesConferenceForGunRights.json","image_url":"https://media.breitbart.com/media/2015/09/gun-rights-conference-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_09_27__1540937481.html","title":"Gun Rights Policy Conference: 'A People's Conference For Gun Rights'","title_page":"Gun Rights Policy Conference: 'A People's Conference For Gun Rights' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On September 25-27, the Second Amendment Foundation (SAF) sponsored their 30th Annual Gun Rights Policy Conference which surveyed the state of gun rights in America, including glimpses at areas in which gun rights are secure and areas in which they are under threat.\nThe conference featured gun rights attorneys, legislators, authors, media personalities, and others describing what they see as they survey the terrain from their respective positions.\nOn September 26, Breitbart News sat down with SAF Founder and Senior Vice President Alan Gottlieb to discuss the conference. He pointed out that when he first started the annual meeting 30 years ago, the big problem was that gun rights groups were not talking to each other. Gottlieb said, “National groups weren’t talking and there really weren’t that many local groups to begin with.” So his first goal in launching the conference was to get national groups to sit down and start a dialogue. And he says that as this happened the attendance of grassroots groups increased and he began to look at how to get those groups to sit down and talk to each other as well.\nGottlieb observed, “What it really boils down to is a people’s conference for gun rights. And while SAF funds it and organizes it, the goal is to get everyone included and try to give them a chance to network socially. We review our past year–review what we have accomplished–and then discuss where we need to go.”\nThe Gun Rights Policy Conference features 60 to 70 speakers in a day and a half, which Gottlieb admits “is an awful lot of movement,” but it provides a chance to consider almost every way in which a threat to the Second Amendment may emerge. Gottlieb said, “We want to preempt what our opponents are doing. We want to act early and try to set the agenda rather than let our opponents set the agenda for us.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/09/27/gun-rights-policy-conference-peoples-conference-gun-rights/"}
