{"authors":["Tamar Hallerman"],"date_download":"2018-10-30 21:03:57","date_modify":"2018-10-30 21:03:57","date_publish":"2016-06-20 08:39:54","description":"This has long been a predictable cycle: Gun store owners report that firearms sales in Georgia are u...","filename":"data/vaneerConsumption/GunsalesinGeorgiaspikeafterOrlandoshootings.json","image_url":"https://politics.myajc.com/rf/image_large/Pub/p6/Politics-MyAJC/2015/06/15/Images/WPIMAGE_cmgajcpolitics_12194.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_gun-sales-geo_5882180f608d5f8d8daa505570f1e9d6__1540933437.html","title":"Gun sales in Georgia spike after Orlando shootings","title_page":"Gun sales in Georgia spike after Orlando shootings","title_rss":"NULL","source_domain":"ajc.com","text":"This has long been a predictable cycle: Gun store owners report that firearms sales in Georgia are up sharply after last week's mass shooting at a gay nightclub in Orlando as federal lawmakers debate new restrictions.\nBut this latest spike comes with a twist, as retailers report many of their new customers are LGBT buyers arming themselves.\nFrom WSB-TV's Steve Gehlbach:\nMetro Atlanta gun stores say AR-15s, the same gun used in the Orlando terror attack, are flying off the shelves. A national group called Pink Pistols, geared toward gun advocacy for the LGBT community says its membership is jumping by the day. Atlanta's chapter is organizing a meeting next week after the membership more than tripled. Adventure Outdoors in Smyrna brings out AR-15s on a car, restocking by the dozen. The gun retailer reports selling 15 AR-15s an hour, when their norm is about four or five a day.\nIt's anecdotal evidence that matches what other gun store owners elsewhere are reporting.\nRead more here.\n***\nNewton County Republican Jason Pye formally resigned from his county's GOP committee, saying he could not support presumptive nominee Donald Trump because \"his views on most issues contradict my personal views on the role of government and the free market.\"\nPye is the spokesman for the tea party group FreedomWorks and an influential voice in the Georgia conservative movement. Here's a snippet of Pye's resignation letter, which you can find here:\nSimply put, I will not cast my ballot for him.\n***\nVoters still need to approve a constitutional amendment that would overhaul the state's judicial watchdog agency and make secret its efforts to weed out bad judges. But the State Bar of Georgia, a staunch critic of the makeover, is treating it like a done deal.\nThomas Worthy, the State Bar's top lobbyist, said the lobbying team is focused on reversing some of the secrecy measures next year rather than fighting it at the ballot box in November.\nFrom the Daily Report:\nEven though the amendment strips the bar of its power to appoint three of the seven members of the current JQC, Worthy told members that the bar will not try to persuade voters to reject it, suggesting it would cost at least $5 million to fund an opposition campaign. Instead of fighting the amendment, Worthy said the bar plans to try to solidify its ties to the legislative branch in hopes that it may be able to influence changes in the accompanying law.\n\"We as an organization need to determine the best position of strength from which to fight, and I think the best position of strength from which to fight is to maintain the relationships and maintain the position of strength we have within the General Assembly,\" Worthy said.\nGov. Nathan Deal wasn't the only state GOP leader to duck a public appearance with Donald Trump during his fundraising tour last week:\n***\nA Georgia Southern University professor who live-tweeted a Donald Trump rally last week ended up going viral.\nJared Yates Sexton's recounting of Trump's rally in Greensboro, North Carolina got droves of attention, including this writeup in The Week.\nHere's a sample of his tweets:\n***\nState Sen. Mike Crane is getting a little help from some of his friends in the legislature this week as he looks to raise cash for his bid to succeed the retiring Lynn Westmoreland in Congress this fall.\nState Sens. Josh McKoon and Marty Harbin and Rep.-elect Josh Bonner are billed as special guests for a fundraising dinner on Thursday in Fayetteville. The price of admission? Two hundred per person. Two thousand gets you a table for 10 and two tickets to the pre-party.\nMcKoon and Harbin stood with Crane when he announced his bid for the Third District seat back in January. They're among the few of Crane's Gold Dome colleagues to publicly endorse him so far.\nCrane is locked in a tight runoff with dentist and former West Point mayor Drew Ferguson for the west Georgia seat. The winner of the GOP contest on July 26 is expected to cruise to victory in November. All five of the other Republicans who did not make the runoff for the seat have backed Ferguson.","url":"https://politics.myajc.com/blog/politics/gun-sales-georgia-spike-after-orlando-shootings/6HnnMksRjLEtNFM4N1PlKK/"}
