{"authors":["Tom Wyke For Mailonline"],"date_download":"2018-10-23 01:06:37","date_modify":"2018-10-23 01:06:37","date_publish":"2016-01-11 11:32:48","description":"Licensed gun owners can now bring their firearms into ten state psychiatric hospitals in Texas following a change in gun laws.","filename":"data/vaneerConsumption/GunsnowallowedinTexaspsychiatrichospitalsafterchangeinlaws.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007CC1400000578-0-image-a-26_1452511557390.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393709_What-possibly-wrong-Guns-allowed-Texas-psychiatric-hospitals-change-laws_1540256797.html","title":"Guns now allowed in Texas psychiatric hospitals after change in laws","title_page":"Guns now allowed in Texas psychiatric hospitals after change in laws | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Licensed gun owners can now bring their firearms into ten state psychiatric hospitals in Texas following a change in gun laws.\nFirearms had previously been banned inside psychiatric hospitals but now the new laws means that people with a license can enter the facilities.\nThe new law came into effect on New Year's Day 2016 and requires that the ten hospitals take down their 'no guns' signs.\nFirearms had previously been banned inside psychiatric hospitals but now the new laws means anyone with a license can enter the facilities\nLicensed gun owners will now be able to keep their weapons in a holster, positioned outside of their clothing when visiting the ten hospitals.\nDespite the changes in law, hospital officials have been quick to dis-encourage weapons holders from bringing their firearms due to patients being treated for serious psychiatric issues.\n'While licensed visitors are legally permitted to carry on our hospital campuses, our patients are being actively treated for psychiatric conditions, and generally it's best not to expose them to weapons of any kind,' Carrie Williams, spokeswoman for the Department of State Health Services, told the American-Statesman.\nLicensed gun owners can now bring their firearms into ten state psychiatric hospitals in Texas following a change in gun laws\nBeth Mitchell, who is part of Disability Rights Texas, an advocacy group for people with mental illness said the new laws 'makes no sense.'","url":"https://www.dailymail.co.uk/news/article-3393709/What-possibly-wrong-Guns-allowed-Texas-psychiatric-hospitals-change-laws.html"}
