{"authors":["Laura Wagner"],"date_download":"2018-10-22 23:07:46","date_modify":"2018-10-22 23:07:46","date_publish":"2017-01-03 00:00:00","description":"The U.S. \"has the highest rate of gun-related deaths among industrialized countries, with more than 30,000 fatalities annually,\" the study says. Yet funding for gun violence research is limited.","filename":"data/vaneerConsumption/GunViolenceShouldBeTreatedAsAPublicHealthCrisisStudySays.json","image_url":"https://media.npr.org/assets/img/2017/01/03/ap_16218710857804_wide-4e9bf47ad7fcb76732a7f852eeea84848ddfbf4c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_03_508037642_study-says-gun-violence-should-be-treated-as-a-public-health-crisis_1540249666.html","title":"Gun Violence Should Be Treated As A Public Health Crisis, Study Says","title_page":"Gun Violence Should Be Treated As A Public Health Crisis, Study Says  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Gun Violence Should Be Treated As A Public Health Crisis, Study Says\nEnlarge this image toggle caption M. Spencer Green/AP M. Spencer Green/AP\nEvery year in the U.S., more than 30,000 people die from things related to guns.\nThat puts guns ahead of HIV, Parkinson's disease, malnutrition, hypertension, intestinal infection, peptic ulcer, anemia, viral hepatitis, biliary tract disease, atherosclerosis and fires. Yet, the funding for research on gun violence lags far behind other leading causes of death, according to a study published Tuesday in the Journal of the American Medical Association.\nResearchers evaluated the leading causes of death in the U.S. and plotted them against the funding and publication of research dedicated to to them.\nEnlarge this image toggle caption Journal of the American Medical Association Journal of the American Medical Association\nThe researchers wrote:\n\"Gun violence had 1.6% of the funding predicted ($1.4 billion predicted, $22 million observed) and had 4.5% of the volume of publications predicted (38,897 predicted, 1738 observed) from the regression analyses. Gun violence killed about as many individuals as sepsis. However, funding for gun violence research was about 0.7% of that for sepsis and publication volume about 4%. In relation to mortality rates, gun violence research was the least-researched cause of death and the second-least funded cause of death after falls.\"\nNPR's Cheryl Corley reports that in a different study published Tuesday by JAMA Internal Medicine, researchers studied gun violence in Chicago over an eight-year period to explain how it can spread like an infectious disease.\" She said medical advocates have long argued that gun violence is a public health crisis, and that the researchers say their study helps prove this point.\nCheryl says that:\n\"Yale University sociologist Andrew Papachristos said researchers treated the idea of gun violence literally and created a network from more than 100,000 individuals at risk of getting shot. \" 'These gunshot victims — they're in very small social networks. They tend to cluster together in these networks. And really what our study shows is that gun violence cascades over time,' Papachristos said.\"\nPapachristos said the study in JAMA Internal Medicine helps show there must be a more coordinated approach to drive gun violence down, one that treats it as a public health epidemic and not just a policing problem.\nThe research published in JAMA offers an explanation for the lack of funding: A 1996 congressional appropriations bill that banned funding from the Centers for Disease Control and Prevention to be used to \"advocate or promote gun control.\" The authors of the study note that \"similar restrictions were subsequently extended to other agencies (including the National Institutes of Health), and although the legislation does not ban gun-related research outright, it has been described as casting a pall over the research community.\"\nResearch, though, has proved an effective tool in driving down mortality rates from other leading causes of death.\nDavid Stark, one of the JAMA study's leaders and medical director of the Institute for Next Generation Healthcare at the Icahn School of Medicine at Mount Sinai, told The Washington Post that gun-related deaths can be reasonably compared to motor vehicle deaths. According to the newspaper, he said:","url":"https://www.npr.org/sections/thetwo-way/2017/01/03/508037642/study-says-gun-violence-should-be-treated-as-a-public-health-crisis"}
