{"authors":["Caitlin Gallagher"],"date_download":"2018-10-31 01:40:28","date_modify":"2018-10-31 01:40:28","date_publish":"2018-08-28 02:05:44","description":"Mike's employment status with Gus Fring is about to go up a level on Better Call Saul. Spoilers for \"Talk\" follow. Gus is angry with Mike for not informing him that Nacho planned to take out Hector Salamanca. But instead of killing Mike, Gus wants…","filename":"data/vaneerConsumption/GusWantsMikeForAJobOnBetterCallSaulWhichIsBadNewsForSomebodySomewhere.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/3dda6020-28ce-49c0-95e2-02c44f2ff503-bcs_404_nw_0302_0855-rt.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_gus-wants-mike-for-a-job-on-better-call-saul-which-is-bad-news-for-somebody-somewhere-10242143_1540950028.html","title":"Gus Wants Mike For A Job On ‘Better Call Saul,’ Which Is Bad News For Somebody Somewhere","title_page":"Gus Wants Mike For A Job On ‘Better Call Saul,’ Which Is Bad News For Somebody Somewhere","title_rss":"NULL","source_domain":"bustle.com","text":"Mike's employment status with Gus Fring is about to go up a level on Better Call Saul. Spoilers for \"Talk\" follow. Gus is angry with Mike for not informing him that Nacho planned to take out Hector Salamanca. But instead of killing Mike, Gus wants Mike to do a job on Better Call Saul. In Season 3, Mike made a deal with Gus to launder his illegal earnings using the front of him being a security consultant for Madrigal Electromotive. So far in Season 4, Mike hasn't been thrilled with this 20-week arrangement and as \"Talk\" shows, he's becoming increasingly more disgruntled. However, Gus is the frustrated one at the end of Monday's episode since he had specifically told Mike that he didn't want Hector dead. Yet even though Gus is slightly displeased with Mike, he's hiring him for another project, further solidifying this Breaking Bad alliance.\nAs Lydia Rodarte-Quayle told Mike back in \"Breathe,\" Mike currently has Gus' respect. \"I'd wanna keep that if I were you,\" she said. However, Mike knows that he's already done something to irk the owner of Los Pollos Hermanos since he assisted Nacho is switching out Hector's pills. Mike had cautioned Nacho not to go through with this plan, but he certainly could be considered an accessory to the crime. Gus may not know just how involved Mike was in Hector's downfall, but either way, he's frustrated with Mike. But that doesn't stop him from recognizing that Mike is clearly skilled in his line of work.\nNicole Wilder/AMC/Sony Pictures Television\nGus threatens Mike, but Mike goes into this meeting with all the confidence of a person who has already seen Breaking Bad. He knows if Gus wanted him dead, he would already be dead. So he growls at Gus, \"Why don't you stop running a game on me and just tell me about the job?\"\nThe nature of the job isn't stated in the episode. But one thing is for sure: Gus doesn't want Mike to kill Hector. Mike came under the employment of Gus in Season 3 because of his own vendetta against Hector since he had threatened Mike's family. Gus intervened, as he references in \"Talk,\" specifically stating that he didn't want Hector dead. \"It's not in my interest for Hector Salamanca to die at this time,\" Gus told Mike in the third episode of Season 3, \"Sunk Costs.\"\namc on YouTube\nThis mirrors what Gus said about Walt to Hector himself. In the third episode of Breaking Bad Season 3, the Cousins had intended to kill Walt because he was partially responsible for Tuco's death. But Gus told them that they couldn't kill Walt yet since he was doing business with him. \"When our business is done, he will no longer be of any concern to me. Until then, I need him alive,\" Gus said. Hector responds by angrily ringing his bell.\nLike with Walt, Gus isn't keeping Hector alive because of any warm feelings toward him. Instead, it's to exact an elaborate revenge plan. Gus told Mike in Season 3 how \"a bullet to the head would've been far too humane\" as a death for Hector. And in Season 4's \"Breathe,\" Gus said, \"I decide what he deserves, no one else.\" So it's very likely he's hiring Mike to do something sinister to the Salamancas.\nAnother option is that Gus wants Mike to help him find a local drug supplier. Mike acted as the go-between for Gus and Walt, so he could be starting to get more involved with Gus' suppliers. Walt and Jesse won't enter the picture for some time — after all, Jimmy's law license is still suspended and he hasn't evolved into Saul yet — but there could be another drug producer with whom Mike helps Gus.\nNo matter what job Gus has in mind, it might lead Jimmy to come into the fold with the Mexican drug cartel. Because Mike and Saul's careers are extremely intertwined by the time they are introduced in Breaking Bad. And while Mike doesn't want to steal Hummels for Jimmy, he could need some of Jimmy's contacts to help him in whatever task Gus has him performing next.","url":"https://www.bustle.com/p/gus-wants-mike-for-a-job-on-better-call-saul-which-is-bad-news-for-somebody-somewhere-10242143"}
