{"authors":["Press Association Reporter"],"date_download":"2018-10-23 03:16:31","date_modify":"2018-10-23 03:16:31","date_publish":"2017-03-10 12:44:42","description":"Defeats to Ireland and England either side of a win over Scotland put France second bottom of the Six Nations standings heading into the fourth round of matches, with only Italy beneath them.","filename":"data/vaneerConsumption/GuyNovesinsistsFrancecantlookdownonItaly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3CD6A23B00000578-0-image-a-62_1489149862877.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4301076_Guy-Noves-insists-France-t-look-Italy_1540264591.html","title":"Guy Noves insists France can't 'look down' on Italy","title_page":"Guy Noves insists France can't 'look down' on Italy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"France coach Guy Noves has warned his players they are in no position to act high and mighty against Italy in Rome on Saturday.\nDefeats to Ireland and England either side of a win over Scotland put France second bottom of the Six Nations standings heading into the fourth round of matches, with only the winless Italians beneath them.\nThey have Italy first and then Wales left to play, and a slip-up at the Stadio Olimpico would be another sporting embarrassment for France, following Paris Saint-Germain's capitulation against Barcelona.\nFrance face Italy in the Six Nations on Saturday afternoon at the Stadio Olimpico\nNoves said the surprising Champions League football result was a 'life lesson' and added that 'failure is part of the game', but he is determined his players should not trip up similarly, and so is directing them to show professionalism as they chase their second win of the championship.\n'We don't have the means to boast, to be a bit like England: to play Italy and look down on them,' Noves said.\n'Our results don't let us do that. Therefore I hope that the players are well aware that Italy have got this match marked down. That's normal, especially after their performance in England.\n'Nothing is written in advance and it will be a very tough match like the others.'\nNoves, speaking in his pre-match press conference, outlined why he has handed a debut to young Brive flanker Fabien Sanconnie.\nFrance coach Guy Noves believes the match against Italy in Rome will be 'very tough'\nBack-rower Sanconnie, 22, replaces Bernard Le Roux in one of four alterations to the starting line-up that lost to Ireland. Le Roux is named on the bench.\nCharles Ollivon's unavailability due to a sprained ankle left Sanconnie as the outstanding option if Noves decided on a change.\n'We needed someone of the same profile,' said Noves.\n'We've talked about him for a while. There's no good or bad time to throw him in. But we know he'll bring the enthusiasm of youth.'\nNoves said Le Roux would have the chance during the match, as a replacement, to make up for a disappointing match against Ireland.\nFrance sit second bottom of the Six Nations standings, while winless Italy are last\nItaly flanker Simone Favaro remains confident the Azzurri are moving in the right direction as a team.\nThey gave England a scare at Twickenham last time out, when they led at half-time before Eddie Jones' side eventually ran out convincing winners.\nWith former Harlequins boss Conor O'Shea now in charge, Favaro, who plays his club rugby for Glasgow, believes results can turn around.\n'It's much easier to start from victories than defeats, that's natural,' he said on federugby.it.\n'The path that we have taken, we know it's long. Once we've found the right structure I don't see why we shouldn't become successful: we have done in so many sports in Italy, and we will do in rugby.'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4301076/Guy-Noves-insists-France-t-look-Italy.html"}
