{"authors":["Charlotte Foster For Daily Mail Australia"],"date_download":"2018-10-23 04:34:17","date_modify":"2018-10-23 04:34:17","date_publish":"2017-03-10 14:48:04","description":"He's known for starring in some of Hollywood's biggest films. Now Australian actor Guy Pearce, 49, has been seen in New York promoting his new movie Brimstone.","filename":"data/vaneerConsumption/GuyPearcestepsoutinNYtopromotehisfilmBrimstone.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2327C900000578-0-image-a-146_1489155836310.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301450_Guy-Pearce-steps-promote-film-Brimstone_1540269257.html","title":"Guy Pearce steps out in NY to promote his film Brimstone","title_page":"Guy Pearce steps out in NY to promote his film Brimstone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's known for starring in some of Hollywood's biggest films.\nNow Australian actor Guy Pearce, 49, has been spotted in New York promoting his new movie Brimstone.\nThe Aussie heartthrob was seen outside the AOL Build studios after filming interviews about the new flick.\nScroll down for video\nBack in black! Australian actor Guy Pearce, 49, has been spotted in New York promoting his new movie Brimstone\nThe star wore a loose-fitting black sweater with a high neck and three-quarter length sleeves.\nHe paired the casual top with blue denim jeans and slung a suit jacket over his left arm.\nHe also wore lace up brown shoes and carried a black bag with him, as well as wearing round glasses.\nMatch-making movie: Guy met Carice Van Houten, the mother of his son Monte, during filming for the Western thriller\nThe Australian actor took time out of his busy filming schedule to promote the movie which will be released in Australia next month.\nIt follows the story of a young wife, played by Dakota Fanning, who must rise up against the new reverend when he threatens to take everything she loves away from her.\nPearce plays the intimidating religious figure in the picture.\nFamiliar faces: Also starring are Game of Thrones actors Kit Harrington (right) and his now-partner Carice Van Houten\nAlso starring are Game of Thrones actors Kit Harrington and his now-partner Carice Van Houten.\nDuring filming for the movie, Guy famously fell in love with the brunette beauty, with the two welcoming a baby boy last year.\n'A cute little package arrived and told us his name's Monte Pearce. We think we're gonna keep him. Placenta smoothie anyone?' Guy tweeted.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301450/Guy-Pearce-steps-promote-film-Brimstone.html"}
