{"authors":["Greg Styles","Simone Amelia For Daily Mail Australia"],"date_download":"2018-10-23 01:38:25","date_modify":"2018-10-23 01:38:25","date_publish":"2017-03-10 09:58:58","description":"Guy Sebastian appears to have passed his passion for singing and dancing on to his son Hudson. The recording artist captured the five-year-old showing off some funky dance moves on Friday.","filename":"data/vaneerConsumption/GuySebastianssonHudsondancesinCUTEInstagramvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21C06900000578-0-image-a-14_1489135732293.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300330_Guy-Sebastian-s-Hudson-dance-moves-camping-trip-dad_1540258705.html","title":"Guy Sebastian's son Hudson dances in CUTE Instagram video","title_page":"Guy Sebastian's son Hudson dances in CUTE Instagram video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Guy Sebastian appears to have passed his passion for singing and dancing on to his son Hudson.\nThe recording artist captured the five-year-old showing off some funky dance moves, taking to Instagram to share a video of his son's antics on Friday.\nHaving celebrated Hudson's fifth birthday last week, the youngster was in high spirits ahead of a camping trip with his dad.\nLike father, like son: Guy Sebastian (L) appears to have passed his passion for singing and dancing on to his son Hudson (R)\nGuy captioned the post: 'Camping time with the little man.'\nA fashionably-dressed Hudson, who is sporting tracksuit bottoms, a t-shirt and a beanie, is seen enthusiastically dancing before Guy joins in towards the end of the video.\nThe youngster's father has been showing off his own dance moves in his new Mind On You music video.\nGuy, who plays four different characters, appeared to especially enjoy portraying a woman, confidently telling The Daily Telegraph: 'I am sort of hot, to be honest' in a recent interview.\nDance the day away: The recording artist captured the five-year-old showing off some funky dance moves, taking to Instagram to share a video of his son's antics on Friday\nIn the mood to move: Having celebrated Hudson's fifth birthday last week, the youngster was in high spirits ahead of a camping trip with his dad\nDay job: The youngster's dad has been showing off his own dance moves in his new Mind On You music video\nTransformation: Guy's wife of eight years, Jules Sebastian, posted a photo to her Instagram account on Wednesday of her husband on set, calling it the 'weirdest day of my life'\nThe pop-star's wife of eight years, Jules Sebastian, posted a photo to her Instagram account on Wednesday of her husband on set, calling it the 'weirdest day of my life.'\nThe singer posed with a seductive look on his face and his hand on his hip dressed in a tight shirt, white belt, black skirt and stockings and women's patent leather flats.\nHe wore a black wig that was curled in waves to frame his face and had a full face of makeup, including a bright red lip.\nA casually-dressed Jules stood next to her husband with her hands covering her face in overstated shock.\nSelf-assured: The 35-year-old appeared to especially enjoy portraying a woman for his new video, confidently saying 'I am sort of hot, to be honest' in a recent interview\nLady-like: He wore a black wig that was curled in waves to frame his face and had a full face of makeup, including a bright red lip\n'When your husband's boobs and eyebrows are better than yours,' she captioned the image, taken at the Manhattan Superbowl 10-pin bowling venue in Sydney.\nShe added the hashtags: '#internationalwomensday' and '#weirdestdayofmylife.'\nMind On You is the new single from Guy's Part 1 EP, released in December last year.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300330/Guy-Sebastian-s-Hudson-dance-moves-camping-trip-dad.html"}
