{"authors":["Karishma Sarkari For Daily Mail Australia"],"date_download":"2018-10-22 22:03:02","date_modify":"2018-10-22 22:03:02","date_publish":"2016-01-28 09:51:03","description":"Guy Sebastian enjoyed a break from touring life as he soaked up the sun with family on the Gold Coast on Wednesday.","filename":"data/vaneerConsumption/GuySebastianisjoinedbylookalikebrotherChrisontheGoldCoast.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A83C2F00000578-0-image-a-4_1453974582617.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420495_Guy-Sebastian-joined-lookalike-brother-Chris-Gold-Coast_1540245782.html","title":"Guy Sebastian is joined by lookalike brother Chris on the Gold Coast","title_page":"Guy Sebastian is joined by lookalike brother Chris on the Gold Coast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Guy Sebastian enjoyed a break from touring life as he soaked up the sun with family on the Gold Coast on Wednesday.\nThe 34-year-old was firmly in dad-mode as he carried older son Hudson, while wife Jules walked beside him, pushing young Archie in a pram as they made their way down a suburban Queensland street.\nThe couple also met up with The X-Factor Australia judge's lookalike younger brother Chris Sebastian, 27, as they went out for a round of Mini Golf.\nScroll down for video\nSeeing double: Guy Sebastian was joined by younger brother Chris as they went out for a round of Mini Golf.\nThe brothers, who are both singers and both currently on tour, were dressed a-like for the outing, wearing sleeveless tops, showing off their tattoos down their arms, caps and a distinct 5 O'Clock shadow.\nFormer The Voice Australia contestant, Chris, donned a red cap with a grey marl singlet paired with ripped black jeans.\nGuy sported a camouflage cap, with a dark grey top that read 'It was all a dream' across the front, mismatched floral boardshorts.\nLook-a-likes: The X-Factor Australia judge and The Voice Australia contestant were both dressed in sleeveless tops, showing off their tattoos\nFunny story? Jules Sebastian appeared to get a good laugh out of a story told by a friend as she pushed young Archie in the pram\nHitting the road! Guy and Chris both took a break from their tour schedules to enjoy the quality family time\nMeanwhile his stylist wife Jules flaunted her trim pins in thigh-skimming denim shorts and a black t-shirt, matching sandals and carrying an over-sized beige handbag, which doubled as a baby bag no doubt.\nThe tiny tots were decked out for the hot summer day with caps as well.\nBoth boys also sported white T-shirts, with Hudson, 3, pairing the printed T-shirt with graphic-print black and white shorts and matching high-top shoes.\nWhile Archer kicked back in grey tights and sneakers.\nAnother two people joined in on the family affair, with the group seeming to be long-time friends and enjoying a catch-up.\nGroup catch up: The family were joined by another two people for the day out and catch up\nIn uncle mode: Chris carried young Hudson as they walked along\nTime for a break! After the round of putt putt the group seemed to take a break for a snack\nSweet treats! The family fun day appeared to end with some tasty treats\nFinger licking good! Guy seemed to savour his sweet treat after the round of mini golf\nThe long goodbye: The group were spotted straggling outside the venue as they continued to chat before parting ways\nGoing their separate ways: The couple and their kids then headed off from the others on their own\nAs they walked along a woman in a white cami with striped trousers appeared to be recounting a story that had Jules in fits of giggles.\nWhile Chris jumped into uncle mode, carrying Hudson around as they made their way into the child-friendly venue.\nHe later posted a photo of the three-year-old laughing with a golf club in hand, hash-tagging the shot affectionately: 'That face'.\nAfter finishing their round of putt putt, they appeared to dig into some sweet treats, that left guy licking his thumb.\nHooters dinner! Jules flew up to the Gold Coast with the boys on Tuesday to visit Guy and the family dined at Hooters for their first night together in the coastal city, with the singer tagging a family selfie there\nOff for a big adventure! The mother-of-two took the boys to visit daddy on Tuesday\nAs the group left the venue, they straggled outside having a chat before going their separate ways.\nJules flew up to the Gold Coast with the boys on Tuesday to visit Guy, as he makes his way around the country on his You Me Ours tour.\nThe young family appeared to have dined at Hooters for their first night together in the coastal city, with Guy tagging a family selfie there.\nSpecial guest: Guy posted a shot from backstage of his You Me Ours Tour with his special guest at at Jupiter's Casino - Sweden's Eurovision winner Måns Zelmerlöw\nThe former Eurovision performer also welcomed a guest to the stage at Jupiter's Casino - Sweden's Eurovision winner Måns Zelmerlöw.\nMeanwhile, the 2003 Australian Idol winner promoted his brother's latest album via Instagram, telling his fans: 'My little bro @chrisebastian is on stage right now in Taree tearing up these tunes.'\n'I'm a proud big brother. Sings his butt off,' he added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420495/Guy-Sebastian-joined-lookalike-brother-Chris-Gold-Coast.html"}
