{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 01:33:41","date_modify":"2018-10-23 01:33:41","date_publish":"2017-03-10 09:55:33","description":"Guy Verhofstadt said he believed the UK's departure from the Brussels club was a 'tragedy' and a 'catastrophe' for both sides.","filename":"data/vaneerConsumption/GuyVerhofstadtLetBritonskeepEUbenefitspostBrexit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/045A182D000003E8-0-image-a-5_1489139585187.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300458_Let-Britons-benefits-EU-Brexit-says-MEP_1540258421.html","title":"Guy Verhofstadt: Let Britons keep EU benefits post-Brexit","title_page":"Guy Verhofstadt: Let Britons keep EU benefits post-Brexit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British citizens should be able to 'opt in' to the benefits of EU membership including freedom of movement across the continent, the European Parliament's chief negotiator has said.\nGuy Verhofstadt said he believed the UK's departure from the Brussels club was a 'tragedy' and a 'catastrophe' for both sides.\nThe MEP said he had received more than a thousand letters from Britons wanting to maintain their individual rights - and would be pushing hard for such an arrangement in the looming divorce talks.\nMEP Guy Verhofstadt said he believed the UK's departure from the Brussels club was a 'tragedy' and a 'catastrophe' for both sides\nBut he also warned that the EU would be driving a hard bargain and stressed that the European parliament could veto a deal that was too generous to the UK.\nThe intervention comes just days before Theresa May could potentially trigger Article 50 and launch the formal Brexit process.\nIn Brussels last night, Mrs May played down the prospect of the UK paying a huge divorce bill - estimated as high as 60 billion euros - as we leave.\nThe EU's chief negotiator Michel Barnier has indicated that he wants an agreement on funding the EU's outstanding liabilities before talks on future trade terms.\nSpeaking on BBC Radio 4's Today programme this morning, Mr Verhofstadt said: 'All British citizens today have also EU citizenship. That means a number of things: the possibility to participate in the European elections, the freedom of travel without problem inside the union...\n'We need to have an arrangement in which this arrangement can continue for those citizens who on an individual basis are requesting it.'\nHe claimed to have received more than a thousand letters from UK citizens who do not want to lose their relationship with 'European civilisation'.\nMr Verhofstadt previously said the EU needs to be 'open and generous' to individual UK citizens and said politicians were considering how to allow them to maintain their ties to the continent.\nHe said the withdrawal negotiations would be 'very complicated', and he was critical of the failure of the Remain campaign to make clear the uncertainties of Brexit during the referendum campaign.\n'My feeling is, why is this only emerging now that there are all these difficulties?' he said.\n'It would have been better maybe if all these difficulties emerged already at the moment of the referendum. I think the Remain campaign was only about economics and not about anything else.'\nBritain's departure was 'a crisis for the European Union', he said.\n'That Britain goes out of the European Union is, in my opinion, a tragedy, a disaster, a catastrophe.\nTheresa May, pictured at a Brussels summit last night, could trigger Article 50 to launch the formal Brexit process as early as next week\n'But it gives us also a responsibility to look for a new partnership between the UK and the European Union.'\nMr Verhofstadt said the European Parliament would vote on its 'red lines' for the Brexit negotiations shortly after Article 50 is triggered. They could include the requirement for single market members to respect the 'four freedoms' of movement of people, goods, services and capital.\n'It will reiterate the necessity that a single market is linked to the four freedoms, the necessity that the customs union is linked to competence concerning trade agreements,' he said.\n'It will clearly indicate also that it is not possible to have better treatment outside the European Union than inside.'\nThe first task of the negotiations will be to clarify the position of EU citizens living in the UK and Britons resident on the Continent, before moving on to discussing the size of the exit bill to be paid by Britain on withdrawal, he said.\nMr Verhofstadt said he expected it to be 'possible to find agreement' on the bill despite the 'enormous gap' between the 60 billion euro figure being discussed in Brussels and the suggestions of ministers like Boris Johnson that the UK should pay nothing.\nBut he cautioned against assumptions that a final settlement will simply split the difference between the two sides' initial positions.\nThe PM played down the prospects of the UK paying a big EU divorce bill at a press conference in Brussels last night\n'I don't know if it will be in the middle,' he said. 'There are objective facts in all this. You can find them in the budget of the European Union, controlled by the Court of Auditors.'\nMr Verhofstadt said the withdrawal agreement needs to be completed by November or December 2017, in order to allow for a transition period to negotiate details of the future UK-EU relationship.\n'Let's not be naive, it will not take two years,' he said. 'It will take two years plus the whole period of the transition to sort out this new partnership between the UK and EU.'\nMr Verhofstadt warned that the European Parliament could veto any deal struck between the EU and the UK.\n'We vote No - that is possible,' he told Today. 'It has happened in a number of other cases that a big international multilateral agreement was voted down by the European Parliament after it was concluded.\n'The fact that in the Treaty it is stated we have to say Yes or No doesn't mean that automatically we vote Yes.'","url":"https://www.dailymail.co.uk/news/article-4300458/Let-Britons-benefits-EU-Brexit-says-MEP.html"}
