{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:02:30","date_modify":"2018-10-22 20:02:30","date_publish":"2016-01-29 00:05:38","description":"The 46-year-old was back to her rocker chic self when she stepped out in Los Angeles on Thursday after boasting over the weekend about her brand new horse.","filename":"data/vaneerConsumption/GwenStefanistepsoutinwedgetrainersasshegetsbacktoLAlife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE183700000578-0-image-a-4_1454026535430.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421887_Gwen-Stefani-steps-wedge-trainers-gets-LA-life-boasting-new-horse_1540238550.html","title":"Gwen Stefani steps out in wedge trainers as she gets back to LA life","title_page":"Gwen Stefani steps out in wedge trainers as she gets back to LA life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been enjoying Southern attire more lately since she began dating her Oklahoma native beau.\nBut Gwen Stefani was back to her rocker chic self when she stepped out in Los Angeles on Thursday.\nThe 46-year-old had kicked off her cowgirl boots after revealing on Sunday that she'd been given a horse.\nSee Gwen Stefani updates as she gets back to LA life after boasting about new horse\nOn the go! Gwen Stefani, 46, was spotted out and about in Los Angeles on Thursday\n'My new bunny #bestpresentever hi Halo,' the hit-maker captioned a close-up snap of the horse.\nMeanwhile, on Thursday, the No Doubt frontwoman looked every bit the rocker in an all black ensemble complete with edgy leather jacket which included zippers adorned throughout.\nHer silky platinum blonde locks were left down and pulled to one side over her shoulder, which she pinned back.\nShe wore white sneakers wedges with several black graphics emblazoned on the shoes including images of eyes with long lashes.\nRock star style! The pop singer donned skintight black jeans which showed off her slim pins and wore a vintage tee which revealed just a touch of midriff\n'Look at my fancy fringe!' Gwen shared a snap of the new horse she was given on Sunday, sparking speculation the mustang was actually a gift from her boyfriend Blake Shelton\nLove at first snap: Stefani, who put her own spin on a cowboy boot, cosied up to her beau Blake as she snapped a selfie at the University of Phoenix Stadium in Glendale, Arizona in December 2015\nThe Voice judge kept shaded behind tortoise shell sunglasses and added a pop of colour to the monochrome ensemble with her signature red lip.\nStefani carried a large black leather boho handbag and wore several dainty rings and bracelets for some added sparkle to her wardrobe.\nThe Hollaback Girl hit-maker has been enjoying a budding romance with her Voice co-judge, Blake Shelton, 39, for a few months.\nSince the lovebirds have been dating Gwen has been spotted more often in camo gear and overalls than her typical studded heels and couture pieces.\nFashionable frontwoman! The No Doubt singer looked every bit the rocker in an all black ensemble complete with edgy leather jacket which included zippers adorned throughout\nEye see you! The Voice judge wore white sneakers wedges with several black graphics emblazoned on the shoes including images of eyes with long lashes\nAlthough the pair have been inseparable, the Boys 'Round Here hit-maker doesn't appear to be ready to start a family quite yet with the mother-of-three.\n'I think it's awfully early to be talking about that, don't you?' Shelton replied when he was asked by ET earlier this month.\nBut while they may not be talking babies together, there could be a duet coming up in the near future between the lovebirds.\n'I'm not saying that I've written a song with Gwen but I'm not saying I didn't,' he told Entertainment Tonight.\nLovebirds: The blonde beauty has been enjoying a budding romance with her Voice co-judge, Blake Shelton, 39, for a few months","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421887/Gwen-Stefani-steps-wedge-trainers-gets-LA-life-boasting-new-horse.html"}
