{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:57:53","date_modify":"2018-10-22 21:57:53","date_publish":"2017-04-26 03:23:44","description":"The 47-year-old singer grew tearful as her contestant Troy Ramey was booted off The Voice on Tuesday after singing for survival.","filename":"data/vaneerConsumption/GwenStefanitearfullysaysbyetoTroyRameyonTheVoice.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BBEBA00000578-0-image-a-60_1493172875352.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446104_Gwen-Stefani-tearfully-says-bye-Troy-Ramey-Voice_1540245473.html","title":"Gwen Stefani tearfully says bye to Troy Ramey on The Voice","title_page":"Gwen Stefani tearfully says bye to Troy Ramey on The Voice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gwen Stefani grew tearful as her contestant Troy Ramey was booted off The Voice on Tuesday after singing for survival.\nTroy, 32, from New York City, had been left in the bottom two with Mark Isaiah, 19, from Adam Levine's team.\nBoth artists were forced to 'sing for survival' while the audience voted to instantly save their favorite.\nScroll down for video\nGetting emotional: Gwen Stefani grew tearful as her singer Troy Ramey was eliminated Tuesday on The Voice\nTroy performed Dobie Gray's Drift Away as his swan song.\n'I think you have such a classic sounding voice,' said Blake Shelton, who also noted that Troy is 'freaking hilarious' on social media.\n'So natural and intuitive,' said Gwen, 47, who also praised his humorous personality.\n'I can't believe that you picked me. You're so gifted, so talented…you're a true artist…thank you for choosing me,' she sniffed, wiping her eyes.\nSwan song: Troy was forced to sing for survival after landing in the bottom two\nFunny guy: Blake Shelton revealed that Troy also is funny on social media\nLast pitch: Gwen pleaded with viewers to save Troy who performed Dobie Gray's Drift Away as his swan song\nTeam Adam's Mark Isaiah, from Pennsylvania, chose When I Was Your Man by Bruno Mars.\n'You're so young, you're on a mission and you're getting better every day,' said Adam, 38.\n'It would really be a shame to see you go before everyone knows your full potential, I'm willing to put myself on the line to make sure everyone gets to see all the things that you can do,' added the Maroon 5 frontman.\nBottom two: Troy and Mark Isaiah landed in the bottom two and were forced to sing for survival\nGetting better: Adam Levine praised Mark for getting better and urged viewers to keep him\n'Thank you so much for bringing me this far and believing in me,' Troy told Gwen before he left.\n'You've been such an awesome coach, so cool, you're like a brother….I'm really glad that you see the potential in me,' Mark told Adam.\n'You're a really good human being,' responded Adam, who rejoiced when Mark was saved.\nLoving it: The Maroon 5 frontman rejoiced when Mark was instantly saved\nMoving on: Mark performed the Bruno Mars song When I Was Your Man and advanced to the Top 11\nThe rest of the top 11 were saved earlier during the one-hour show.\nThe first to advance was Gwen's 14-year-old protégée Brennley Brown, followed by Adam's bearded guitarist Jesse Larson, 34, and Team Blake's country lass Lauren Duski, 25.\nHost Carson Daly announced the launch of the Christina Grimmie Foundation to commemorate the former contestant on The Voice who was fatally shot last June while signing autographs after a concert in Florida.\nNew foundation: Carson Daly announced the Christina Grimmie Foundation named after a former contestant shot to death last year after a concert in Florida\nFan favorite: Christina was a member of Adam's team in season six and finished in third place\nThe charity will aid those affected by gun violence.\n'I loved her so much, I miss her, it's unfair that she's not here,' said Adam who dedicated a rendition of Hey Jude to her memory.\nThe Grimmie family were in the audience.\nGun violence: Adam said the foundation would help those affected by gun violence\nTeam tribute: Christina was honored by Adam and his team who sang Hey Jude in her memory\n'Christina, we feel your spirit here at The Voice every single day and we love and miss you dearly,' said Carson.\nThe next artists to be saved were Alicia Keys's vocal powerhouse Vanessa Ferguson, 31, and Team Blake's 15-year-old California singer Aliyah Moulden.\nCalifornian rapper G-Eazy, 27, showed up to perform his upbeat hit Good Life from the blockbuster movie The Fate Of The Furious.\nUpbeat hit: G-Eazy performed his upbeat song Good Life from The Fate Of The Furious\nHands up: Munchie and G-Eazy got the crowd going\nNext to be transported to the next round was Adam's Lilli Passero, 23, from Nebraska, and Alicia's Tennessee soul singer Chris Blue, 26.\nBlake then took the stage with his team to sing John Lennon's 1971 track Crippled Inside.\nThe winner of The Voice's Snapchat competition was also announced - Ignatious Carmouche, 22, from Lafayette, Louisiana.\nTeam performance: Blake Shelton took the stage with Aliyah Moulden, Lauren Duski and TSoul\nMoving forward: Lilli Passero advanced after overcoming illness to perform live Monday\nComing soon: Ignatious Carmouche won the show's Snapchat competition and will compete in the Blind Auditions next season\nCountry star: Blake Shelton advanced with his team intact\nFull strength: Alicia Keys also goes into the next round with all of her singers\n'I've been singing since I was four-years-old,' said the contestant, who will compete in the Blind Auditions next season.\nThe next contestant to be sent into the top 11 was Gwen's 29-year-old Georgian Hunter Plake.\nHe was followed by TSoul, 29, from team Blake and Alicia's Texan singer Stephanie Rice, 27.\nSeason 12 of The Voice continues next week on NBC.\nNext round: Stephanie Rice also advanced to the next round","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446104/Gwen-Stefani-tearfully-says-bye-Troy-Ramey-Voice.html"}
