{"authors":[],"date_download":"2018-10-30 18:19:48","date_modify":"2018-10-30 18:19:48","date_publish":"2017-03-01 19:22:00","description":"87 Gwinnett schools beat the odds on the College and Career Ready Performance Index last year.","filename":"data/vaneerConsumption/GwinnettleadsGeorgiainBeattheOddsschools.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/22/Images/College%20Board-AP%20Duluth%20HS.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_gwinne_466a60bb3fc2e0d2ee8a8faee7e14499__1540923588.html","title":"Gwinnett leads Georgia in Beat the Odds schools","title_page":"CCRPI: Gwinnett leads GA in schools that beat projected scores","title_rss":"NULL","source_domain":"ajc.com","text":"With 87, Gwinnett leads the state in the number of schools that beat their state-predicted score on the College and Career Ready Performance Index last year, data released by the Georgia Department of Education shows.\nThe department uses CCRPI to rate schools and school districts on a 100-point scale using a variety of performance indicators. It also conducts “Beating the Odds” analyses to predict a score range for each school, taking into account school size, student mobility, demographics and other factors.\nStatewide, more than 1,000 schools beat their state projected score. About 70 percent of these schools have poverty rates of at least 25 percent.\n“We view these schools as major success stories,” said State School Superintendent Richard Woods. “In fact, it’s difficult to fully express the magnitude of what they’ve achieved. Statistically, a high rate of poverty presents multiple barriers to achievement, but these schools are beating the odds and doing excellent work on behalf of Georgia students.”\nGwinnett County Public Schools had 36 schools that beat their projected score for the fifth consecutive year, which is also the most in the state.\nThe average score for a Gwinnett school that beat its projected score was 79.9, which is 7 points above the state average.\nClick here to see which Gwinnett schools beat the odds.","url":"https://www.ajc.com/news/local-education/gwinnett-leads-georgia-beat-the-odds-schools/sMFnS76nVwirMzzTNXmJdK/"}
