{"authors":[],"date_download":"2018-10-30 18:34:55","date_modify":"2018-10-30 18:34:55","date_publish":"2017-02-13 20:29:00","description":"In DJ Khaled’s hit “I Got the Keys,” Jay Z raps a verse including the words: “You ain’t seen nothin’ like this. I should probably copyright this.”","filename":"data/vaneerConsumption/GwinnettmanclaimsDJKhaledstolebeatforhitwithJayZFuture.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/CmgOldContent/2016/09/28/Images/photos.medleyphoto.11556033.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-man-cla_cea2a6c6da0b283ca907015d18a8495e__1540924495.html","title":"Gwinnett man claims DJ Khaled stole beat for hit with Jay Z, Future","title_page":"Gwinnett man claims DJ Khaled stole beat for hit with Jay Z, Future","title_rss":"NULL","source_domain":"ajc.com","text":"In DJ Khaled’s hit “I Got the Keys,” Jay Z raps a verse including the words: “You ain’t seen nothin’ like this. I should probably copyright this.”\nOddly, it’s DJ Khaled who needed the copyright, according to a producer who claims the DJ stole part of the song after a meeting at a DeKalb County club.\nChris Hill, of Gwinnett, claims in a federal suit that DJ Khaled, whose given name is Khaled Mohamed Khaled, obtained a copy of Hill’s work in 2008. Hill passed a CD of the copy written “Chris Hill Beats (Gangsta Boogie Vol 2)” to an associate of the DJ at the now-shuttered ESSO club in East Atlanta, the suit says.\nThe music was “substantially similar” to the intro on DJ Khaled’s 2016 hit “I Got the Keys,” featuring Jay Z and Future, Hill claims.\nThe song was the lead track on “Major Key,” DJ Khaled’s first Billboard No. 1 album, which was nominated Best Rap Album at the 2017 Grammys. He lost out to Chance the Rapper in the Sunday night ceremony.\nQuickly after the award show, DJ Khaled, Jay Z and Beyonce released a new song.\nJay Z and Future aren’t named in the suit, filed last week in U.S. District Court, against DJ Khaled. \"I Got the Keys”’s three producers Southside (Joshua Luellen), Jake One (Jacob Dutton) and G Koop (Rob Mandell) are.\nSony Music, DJ Khaled’s label, and its subsidiary Epic are also defendants.\nAsked for comment on the allegations, a Sony spokeswoman told The Atlanta Journal-Constitution: “We do not comment on pending litigation.”\nHill claims he’s suffered mass loss of revenue from the internationally popular song. He’s asking for $150,000 and other damages, as well as a “recall of all copies of the Infringing Work.”","url":"https://www.ajc.com/news/local/gwinnett-man-claims-khaled-stole-beat-for-hit-with-jay-future/q3a6GS56Y5ySUlFzpljmNI/"}
