{"authors":[],"date_download":"2018-10-30 20:38:01","date_modify":"2018-10-30 20:38:01","date_publish":"2015-06-29 20:29:03","description":"Four days after having both feet and one hand amputated — and with a long, painful recovery only beginning — Cindy Martinez is able to laugh and smile and still put her faith in God.","filename":"data/vaneerConsumption/Gwinnettwomanwithflesheatingbacteriaafighterafter.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/29/Images/photos.medleyphoto.7530594.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-woman-w_a629b964144e01e46895d71aa6201f0e__1540931881.html","title":"Gwinnett woman with flesh-eating bacteria ‘a fighter’ after...","title_page":"Gwinnett woman with flesh-eating bacteria ‘a fighter’ after...","title_rss":"NULL","source_domain":"ajc.com","text":"Four days after having both feet and one hand amputated — and with a long, painful recovery only beginning — Cindy Martinez is able to laugh and smile and still put her faith in God.\nTrue to form, her husband says.\n“It’s why I married her,” David Martinez, a Gwinnett County police officer, said Monday. “She’s a fighter. She’s not a person to get knocked down and stay down. She’s gonna get up.\n“She’s remarkable.”\nCindy Martinez has been hospitalized since Memorial Day, when David took her to Gwinnett Medical Center and the pair of former Marines learned the source of her mysterious illness — a flesh-eating bacteria called necrotizing fasciitis.\nCindy had been in stable condition for at least two weeks, but dead flesh and tissue, as well as the risk for secondary infections, necessitated Thursday’s amputations of her feet and right hand.\nDavid Martinez, speaking to the media, said his wife is in “a lot of pain” but staying positive. She is recovering at an unidentified hospital and could be transferred to a rehab facility in as little as two weeks.\nThe road to a new normal — prosthetics included — will begin then. The couple’s 5-year-old son and 2-year-old daughter will have to be fully apprised of their mother’s new condition.\n“Things are gonna be a bit different,” David Martinez said. “But I believe that things are gonna be better. We’re becoming closer as a family, our faith in God is stronger, and people have already come up to me telling me that my wife and I are already inspiring them.”\nA new website, HowILived.com, has been launched for the public to track Cindy’s progress, make donations and keep tabs on special fundraising events.\nDavid Martinez also announced that a fundraiser — which will include raffles, food trucks and live music — will be held July 18 at Dacula’s Hebron Baptist Church. The Your Pie restaurant at 1250 Scenic Highway in Snellville is also helping support the Martinezes by contributing 10 percent of all sales made on each Monday in July.\nAs of Monday, a GoFundMe page set up for the Martinez family had raised more than $76,000 toward medical bills and inevitable home renovations.\nIt remains unclear how Cindy Martinez contracted the bacteria that has forever changed her family’s life. It will likely stay that way, too — but that’s OK, her husband said.\n“The question (that a lot of people ask) is , ‘Why does this happen to good people?’” David Martinez said. “And that’s not necessarily the question I believe you should ask. I believe you should say, ‘Well, this has happened, what are you doing with your life now?’”","url":"https://www.ajc.com/news/local/gwinnett-woman-with-flesh-eating-bacteria-fighter-after-amputations/DGiUiypm2Yi9c101CUEIYI/"}
