{"authors":[],"date_download":"2018-10-30 14:32:46","date_modify":"2018-10-30 14:32:46","date_publish":"2016-10-07 15:18:00","description":"Every school year, inclement weather situations arise that force Gwinnett County officials to weigh the possibility of closures.","filename":"data/vaneerConsumption/GwinnettschoolclosingsHowisthedecisionmade.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/29/Images/122512%20ev%20gwinnett%20schools%20JC1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-school-closings-how-the-decision-made__1540909966.html","title":"Gwinnett school closings: How is the decision made?","title_page":"Gwinnett school closings: How is the decision made?","title_rss":"NULL","source_domain":"ajc.com","text":"Every school year, bad weather forces Gwinnett County officials to weigh the possibility of school closures.\nBut how do they make the decision? And who makes it? And how will you know?\nWhy do they close? According to the Gwinnett County Public Schools website, schools may be closed \"in the event of hazardous weather or other emergencies which present threats to the safety of students, staff or school property.\"\nWho makes the decision? The Gwinnett County schools superintendent makes the decision based on information from public safety officials, the Georgia Emergency Management Agency, county officials and the Georgia Department of Transportation and recommendations from his staff.\nWhen inclement weather is an issue, members of the school system's facilities and operations team \"head out as early as 3:30 or 4 a.m. to drive roads around the county and assess road conditions,\" the school system website said. Transportation staff makes sure buses are operable, and facilities are checked to ensure power and other utilities are working.\nWhen do they make the decision? As a rule, the decision is made by 6 a.m. Historically, Gwinnett County schools tend not to make such a decision until the morning of the possible cancellation.\n\"It is more likely for school to be cancelled in the early morning — due to dangerous road conditions that formed overnight — than for school to let out early because bad weather is moving in,\" according to the GCPS website.\nHow will I know? When a decision is made, the school system \"immediately notifies all major radio and television stations in metro Atlanta,\" according to its website. Channel 2 Action News maintains a running list of school closings around metro Atlanta. And WSB radio at 750 on the AM dial also broadcasts list of closings and delays.\nAnnouncements are also posted on the school system's website and its official Facebook and Twitter pages. On Twitter, search for @GwinnettSchools. Also check for specifics about particular schools on school websites or Twitter accounts.\n[Body Text]\n[Body Text]","url":"https://www.ajc.com/news/local/gwinnett-school-closings-how-the-decision-made/rL6crIJT1MAnRqaG9ssVLJ/"}
