{"authors":[],"date_download":"2018-10-30 20:14:43","date_modify":"2018-10-30 20:14:43","date_publish":"2016-03-30 22:00:23","description":"A Gwinnett County woman is facing 23 charges, including DUI, after she led police on a chase in her luxury car — even after blowing out her tires, according to Channel 2 Action News.","filename":"data/vaneerConsumption/GwinnettwomandrivingBMWslammedcurbsblewtiresonpolice.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/30/Images/photos.medleyphoto.9217279.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_gwinnett-wo_4cebf4b604d90ba5e7b37e71d1ea4e45__1540930483.html","title":"Gwinnett woman driving BMW slammed curbs, blew tires on police...","title_page":"Gwinnett woman driving BMW slammed curbs, blew tires on police...","title_rss":"NULL","source_domain":"ajc.com","text":"A Gwinnett County woman is facing 23 charges, including DUI, after she led police on a chase in her luxury car — even after blowing out her tires, according to Channel 2 Action News.\nPolice attempted to pull over Ahmaru Avegnon-Blake, 36, of Lawrenceville, shortly after 2 a.m. Wednesday at the intersection of Breckenridge Boulevard at Centerview Drive, Michele Pihera, a spokeswoman for Gwinnett police, said in an email. She had a flat tire.\nInstead of stopping, Avegnon-Blake slammed into several curbs, causing two tires to blow out, as she barreled through Gwinnett County in her 7 Series BMW, Pihera said. She zigzagged through Pleasant Hill Road over I-85 and nearly hit another vehicle in the diverging diamond interchange.\nAvegnon-Blake sped down Venture Parkway, Steve Reynolds Boulevard and then onto Satellite Boulevard.\nIn order to end the chase, officers performed a PIT maneuver—a controlled crash intended to cause a vehicle to spin out or stop—at Satellite Boulevard at West Liddell Road.\nThe maneuver caused the BMW to spin out leaving skid marks in the road.\nOfficers told Channel 2 Action News that Avegnon-Blake nearly hit several drivers and tried to run them over as they arrested her.\nShe was arrested and booked on drunken driving charges, eluding police and other traffic offenses, according to Channel 2. Police said they obtained a blood sample from Avegnon-Blake to determine her blood alcohol level, but the results had not yet been determined Wednesday, according to the station.\nA woman who was at the bar with Avegnon-Blake told Channel 2 that she appeared fine and Avegnon-Blake was not slurring her words.\n“It didn’t seem like she was drunk,” the friend told Channel 2. “She just seemed a little upset and she was irate because of something she had gone through at a different bar.”\nAvegnon-Blake’s former neighbor, Joshua Levi, told the television station that Avegnon-Blake was not a bad person.\n“I don’t know about something like that,” Levi said. “I’m in shock she’s in jail for something like that.”\nLevi said Avegnon-Blake liked to have a drink every once and awhile, but he never expected she’d be accused of leading police on a chase, according to Channel 2.","url":"https://www.ajc.com/news/crime--law/gwinnett-woman-driving-bmw-slammed-curbs-blew-tires-police-chase/lV8qg2ZyrusDmReuPWDSKJ/"}
