{"authors":[],"date_download":"2018-10-30 21:27:39","date_modify":"2018-10-30 21:27:39","date_publish":"2018-08-16 11:58:00","description":"Gwinnett County Animal Welfare and Enforcement on Aug.","filename":"data/vaneerConsumption/GwinnettanimalshelterjoinsCleartheSheltersprogram.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/16/Images/newsEngin.22793956_Gwinnett-Animal-Shelter2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-animal-_3503e9b46f32ec0bf996a08ff5dca430__1540934859.html","title":"Gwinnett animal shelter joins Clear the Shelters program","title_page":"Gwinnett animal shelter joins Clear the Shelters program","title_rss":"NULL","source_domain":"ajc.com","text":"Gwinnett County Animal Welfare and Enforcement on Aug. 18 will participate in the fourth annual Clear the Shelters initiative with an Adoption Jamboree. Clear the Shelters is a national effort involving hundreds of shelters that offer free pet adoptions to help empty shelters and provide homes for dogs, cats and other animals.\n“We’re not at capacity, but we don’t want to be at capacity,” said Animal Welfare and Enforcement Manager Alan Davis. “This will help ensure we have adequate space should we have a surge in pickups or have a hording case, which could happen at any time.”\nDogs and cats adopted from the shelter are spayed or neutered, vaccinated, and micro-chipped. Adoption fees will be waived at the event.\nThe Adoption Jamboree will feature a DJ, face-painting, Kona ice, popcorn and giveaways for pets 11 a.m. to 5 p.m. Aug. 18 at the animal shelter, 884 Winder Highway in Lawrenceville.\nDogs typically cost $90 to adopt, and cats typically cost $30.\nThe shelter is extending its hours on Thursdays from 6 p.m. to 8 p.m. into the fall and offering Free Fridays through Aug. 31. Ice cream socials will be held on the last Thursday of each month through October.","url":"https://www.ajc.com/news/local/gwinnett-animal-shelter-joins-clear-the-shelters-program/725nKzvdoTkbK6tp2CxKTL/"}
