{"authors":[],"date_download":"2018-10-30 20:36:24","date_modify":"2018-10-30 20:36:24","date_publish":"2015-10-14 14:27:37","description":"Cindy Martinez, the Gwinnett County mother who lost her limbs to a flesh-eating bacteria, is being given a wheelchair-accessible van by a local auto dealership and a van customizing company.","filename":"data/vaneerConsumption/Gwinnettwomanwhosurvivedflesheatingbacteriatoget.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/29/Images/photos.medleyphoto.7530589.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-woman-w_cfa1f52a51427fdd5e200a40bde14a13__1540931784.html","title":"Gwinnett woman who survived flesh-eating bacteria to get...","title_page":"Gwinnett woman who survived flesh-eating bacteria to get...","title_rss":"NULL","source_domain":"ajc.com","text":"Cindy Martinez, the Gwinnett County mother who lost her limbs to a flesh-eating bacteria, is being given a wheelchair-accessible van by a local auto dealership and a van customizing company.\nNalley Automotive Group and AMS Vans donated and modified a 2013 Chrysler Town and Country Touring van which will be presented to Martinez, a former Marine, on Oct. 24 during a celebration of veterans at AMS in Tucker.\n“Cindy’s recovery has been long and hard,” Nalley vice president of dealership operations Dan Clara said in a statement. “But her courage and determination is a true testament for all who have been following her on this journey.”\nMartinez was taken in May to Gwinnett Medical Center with an unknown ailment. She and her husband, David, also a former Marine, now a Gwinnett County police officer, learned she had contracted necrotizing fasciitis, a life-threatening infection caused by flesh-eating bacteria.\nOn June 25, Martinez had both feet and her right hand amputated. About a month later, more surgeries extended her leg amputations to just below the knees and her right arm amputation to above the elbow; fingers were removed on her left hand.\nBy August, she was in Atlanta’s Shepherd Center, where she spent six hours a day learning how to walk and navigate with her lost limbs. She was released in September. At home, modifications were made to help her get around, but she needed a vehicle to meet her transportation needs.\nAMS designed and installed a side-entry conversion to the minivan. It has a non-slip powered ramp, lowered floor and wheelchair tie-downs that will provide a safe ride.\n“We provide transportation for hundreds of people in wheelchairs across the nation,” AMS Vans CEO Kip Crum said. “And we definitely want to help Cindy who is right here in our hometown.”\nDavid Martinez said “the love and support has been outstanding.\n“To see my fellow neighbors rally together during our time of need is just amazing. We are so grateful and blessed.”","url":"https://www.ajc.com/news/local/gwinnett-woman-who-survived-flesh-eating-bacteria-get-custom-van/Lw4aDTkxuPI18VgjrfXkqM/"}
