{"authors":[],"date_download":"2018-10-30 20:38:39","date_modify":"2018-10-30 20:38:39","date_publish":"2015-09-23 22:42:58","description":"Cindy Martinez strode across the tiled floor in a conference room at the Shepherd Center on Wednesday, prosthetic legs — emblazoned with the Marine Corps seal — tucked into pristine black-and-white New Balance sneakers.","filename":"data/vaneerConsumption/Gwinnettwomanwhosurvivedflesheatingbacteriaheadinghome.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/23/Images/photos.medleyphoto.8190181.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-woman-w_d099e4b259b436ab33fcea51301aa62a__1540931919.html","title":"Gwinnett woman who survived flesh-eating bacteria heading home...","title_page":"Gwinnett woman who survived flesh-eating bacteria heading home...","title_rss":"NULL","source_domain":"ajc.com","text":"Cindy Martinez strode across the tiled floor in a conference room at the Shepherd Center on Wednesday, prosthetic legs — emblazoned with the Marine Corps seal — tucked into pristine black-and-white New Balance sneakers. If there was timidity in her walk, it was likely due as much to the cluster of reporters awaiting her as it was to the newness of moving upright on her own.\nHer husband, David, softly brought to her attention a rogue strip of carpet, and they navigated it together before reaching the podium.\nTheir important announcement: She’ll be going home soon.\n“I’m feeling great,” Martinez said. “I don’t feel sick anymore. I feel back to normal, like I was before all this started.”\nIt’s been nearly four months since Memorial Day, when day Cindy Martinez — a mother of two and former Marine — was taken to Gwinnett Medical Center with an unknown ailment. In the days that followed, she and her husband — a former Marine, and a current Gwinnett County police officer — learned that she had somehow contracted necrotizing fasciitis, a life-threatening infection caused by flesh-eating bacteria.\nOn June 25, Martinez had both feet and her right hand amputated. About a month later, more surgeries extended her leg amputations to just below the knees and her right arm amputation to above the elbow; fingers were removed on her left hand.\nBy August, she was in Atlanta’s Shepherd Center, where she spent six hours a day learning how to walk and navigate with her lost limbs.\n“When she first got here, she was very shy, very apprehensive,” Dr. Anna Elmers, one of the Shepherd Center’s staff psychiatrists, said Wednesday. “But over the past several weeks she’s made the progress that would normally take several months for someone else to make.”\nThe initial renovations to the Martinez’s’ house in Dacula are still being completed, and other preparations, including rehab, will continue for the foreseeable future — but going home is priority No. 1. Martinez surprised her 5-year-old son at school last week and got to “just do regular things that mothers do with their kids.”\nShe said she’s looking forward to doing more of the same once she’s released sometime in the coming days.\n“I’m extremely proud of Cindy,” David Martinez said. “Everything she’s done. We’ve been through a lot together.”","url":"https://www.ajc.com/news/local/gwinnett-woman-who-survived-flesh-eating-bacteria-heading-home-soon/Y1jyDeyWNEP2rcUeMCReCM/"}
