{"authors":[],"date_download":"2018-10-30 20:11:48","date_modify":"2018-10-30 20:11:48","date_publish":"2017-04-07 15:29:00","description":"Police found the defendant just across the Gwinnett County line, where he'd gotten stuck on railroad tracks.","filename":"data/vaneerConsumption/GwinnettmansentencedforDUIhitandrunthatkilledDeKalbman.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/07/Images/GIRISH%20KANPARIA1_324x203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_gwinnett-man-sen_6377372a338101a146a3c7a2196a99f5__1540930308.html","title":"Gwinnett man sentenced for DUI hit-and-run that killed DeKalb man","title_page":"Gwinnett man sentenced for DUI hit-and-run that killed DeKalb man","title_rss":"NULL","source_domain":"ajc.com","text":"The victim lay near the bleak intersection of Pleasantdale and Best Friend roads in DeKalb County, blood escaping, flesh missing. A pick-up truck approached. The people inside were strangers, who saw that 40-year-old Steve McLean needed help.\nBut they saw too late. The truck accidentally drove over his leg.\nAbout the same time McLean was dying in an ambulance, police just over the Gwinnett County line found Girish Kanparia’s Honda CRV. It was stuck on the railroad tracks off Buford Highway.\nThe Honda had a dented hood, smeared with blood and flesh, and a shattered windshield, police reported. The driver appeared drunk.\nTwo and a half years later, Kanparia, who had moved from Gwinnett to Alabama after the wreck, is headed to prison. He pleaded guilty this week to vehicular homicide, DUI and hit and run McLean’s Dec. 28, 2014, death, the DeKalb County District Attorney’s Office confirmed in a statement detailing the case.\nJudge Courtney L. Johnson sentenced him to 15 years. The first six are to be in prison.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram\n﻿In DUI related news...","url":"https://www.ajc.com/news/local/gwinnett-man-sentenced-for-dui-hit-and-run-that-killed-man-dekalb/Zbp8KbZVd3EusRVJV4sjqJ/"}
