{"authors":[],"date_download":"2018-10-30 19:55:49","date_modify":"2018-10-30 19:55:49","date_publish":"2014-11-21 21:48:44","description":"A Gwinnett teenager had reported “hearing voices” in the months before he stabbed his father to death, a detective testified Friday.","filename":"data/vaneerConsumption/Gwinnettdetectivesonwhokilledfatherheardvoices.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/11/21/Videos/3904134247001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_gwinnett-detective-son-who-killed-father-heard-voices__1540929349.html","title":"Gwinnett detective: son who killed father “heard voices”","title_page":"Gwinnett detective: son who killed father “heard voices”","title_rss":"NULL","source_domain":"ajc.com","text":"A Gwinnett teenager had reported “hearing voices” in the months before he stabbed his father to death, a detective testified Friday.\nDavid Trent Walker’s mother said her 19-year-old son had gone on a medication this year after he had reported hearing voices inside his head, said Gwinnett Det. Mario Boyd. The mother also reported her son didn’t have a troubled relationship with his father before the killing, Boyd said.\nBoyd described a case loaded against Walker who didn’t attempt to flee the scene but appeared to try and conceal evidence after the stabbing of 46-year-old David Wayne Walker. He did not give a statement to police.\nHe is being held in the Gwinnett jail without bond and his case was sent on to superior court after the hearing.\nThe first arriving officer found “Trent Walker covered in blood,” Boyd said. Witnesses said Walker had tossed “something” into a storm drain after the stabbing, Boyd said.\nInside the drain, investigators found a steak knife handle and then found a blade in the yard. Blood was on both parts and they matched a knife set found inside the Walker house, Boyd said.\nSeven people witnessed the killing of the father in front of their home on Country Wood Drive in the Hamilton Mills subdivision, Boyd said. The father had two large stab wounds in his back and one in his neck, Boyd said.\nThe witnesses gave a consistent description of Trent Walker attacking his father from behind and hitting him until he went to his knees and then again until he was prostrate on the ground, Boyd said.\nAnother woman, who didn’t witness the killing, called 911 when she drove by the home and saw Trent Walker chasing his father, Boyd said. A neighbor who made the first 911 call described how Walker repeatedly struck his father until he was on the ground, the detective said.\n“She said Trent Walker went inside (the house) briefly and came outside with a bottle of water and began drinking it while David Walker was lying in the street,” Boyd said.\nBoyd said he never got the younger Walker’s version of events because he declined to talk and requested a lawyer instead of submitting to an interview at the police station.\nGwinnett police reported earlier that Trent Walker was arrested when officers found him standing over his father in the Hoschton neighborhood.","url":"https://www.ajc.com/news/gwinnett-detective-son-who-killed-father-heard-voices/kalDAyZg6MiNVvzqX86drO/"}
