{"authors":[],"date_download":"2018-10-30 14:14:25","date_modify":"2018-10-30 14:14:25","date_publish":"2016-01-20 00:22:12","description":"Gwinnett County on Tuesday rejected a request that it provide Spanish-language ballots for this year’s elections, setting up a possible showdown in federal court.","filename":"data/vaneerConsumption/GwinnettrejectscallforSpanishballots.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_g_d3f1f7a646c40f08cd724064bc7e8efc__1540908865.html","title":"Gwinnett rejects call for Spanish ballots","title_page":"Gwinnett rejects call for Spanish ballots","title_rss":"NULL","source_domain":"ajc.com","text":"Gwinnett County on Tuesday rejected a request that it provide Spanish-language ballots for this year’s elections, setting up a possible showdown in federal court.\nTwo Latino rights groups requested the ballots, citing a provision of the federal Voting Rights Act. But the Gwinnett Board of Registrations and Elections voted 4-1 against the request.\nChair Alice O’Lenick said the county doesn’t have enough information to determine on its own whether it should provide bilingual ballots and voting materials. She said the board must wait for direction from the state or federal officials or a court.\n“If a judge says do this, we’ll do it,” she said.\nJerry Gonzalez, executive director of the Georgia Association of Latino Elected Officials (GALEO), said his group will pursue the matter in court.\n“We wanted to avoid litigation,” Gonzalez said after the vote. “The vote sends a clear signal that Gwinnett County doesn’t embrace diversity and doesn’t respect the Voting Rights Act.”\nIn October, GALEO and New York-based LatinoJustice asked Gwinnett and Hall counties to provide the bilingual voting materials. The groups cited a provision of the federal Voting Rights Act that requires governments to make Spanish-language ballots available to those Puerto Ricans who have difficulty reading English.\nPuerto Ricans are American citizens, but Spanish is the dominant language spoken on the island. The law is designed to ensure they can vote without difficulty if they move to the mainland United States.\nAccording to U.S. Census Bureau estimates, there are more than 13,000 people of Puerto Rican descent in Gwinnett and 900 in Hall. The federal law does not specify a minimum number of affected Puerto Ricans that would trigger the provision.\nHall County already has rejected the request to provide bilingual voting materials. On Tuesday, Stephen Day, vice chairman of the Gwinnett elections board, cast the dissenting vote and said he believed Gwinnett should comply with the request.\nOne reason: The federal government may soon require Gwinnett to provide Spanish voting materials under another provision of the Voting Rights Act. Section 203 of the act requires jurisdictions to provide bilingual ballot access if more than 5 percent or 10,000 citizens of voting age are members of a single language minority and have difficulty speaking English.\nGwinnett is home to an estimated 171,000 Latinos, or one out of every five residents, according to the U.S. Census Bureau. Day said Gwinnett may be forced to provide the ballots when the Census Bureau releases its latest list of jurisdictions affected by Section 203 in December.\nBut other board members were not persuaded.\n“I don’t think we’re in violation of federal law,” said board member John Mangano.","url":"https://www.ajc.com/news/local-govt--politics/gwinnett-rejects-call-for-spanish-ballots/5WqvUFwDnbbxWa9Mcxl1fK/"}
