{"authors":[],"date_download":"2018-10-30 20:14:30","date_modify":"2018-10-30 20:14:30","date_publish":"2016-03-08 18:59:19","description":"A Tucker man who allegedly pointed a gun at a 10-year-old child — one of seven people Gwinnett police say the suspect held up during two weekend armed robberies — has been arrested.","filename":"data/vaneerConsumption/Gwinnettpolicearrestmanaccusedofpointinggunatchild6.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/08/Images/photos.medleyphoto.8943578.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_gwinnett-po_9cc0e98b0f130ea1b1b0b0ebb87aadd8__1540930470.html","title":"Gwinnett police arrest man accused of pointing gun at child, 6...","title_page":"Gwinnett police arrest man accused of pointing gun at child, 6...","title_rss":"NULL","source_domain":"ajc.com","text":"A Tucker man who allegedly pointed a gun at a 10-year-old child — one of seven people Gwinnett police say the suspect held up during two weekend armed robberies — has been arrested.\nShortly before midnight Saturday, 19-year-old Ali Eduardo Pazos-Gonzalez allegedly approached a group of four people in the 6100 block of Live Oak Parkway, pointed a gun at them and demanded all their property, Gwinnett police Cpl. Michele Pihera said. As the suspect drove away with their cellphones, IDs, credit cards and debit cards, the victims were able to get the vehicle’s description and license plate number, police said.\nA short time later, a 911 caller said Pazos-Gonzalez pointed a gun at her, her friend and the 10-year-old child as they were in the parking lot of the Rockbridge Court Apartments on Rockbridge Road, Pihera said.\nOfficers who responded to the first incident ran the vehicle license plate number. On the way to the address where the vehicle was registered, a victim from the Rockbridge Court Apartments robbery called police again and said she saw Pazos-Gonzalez and the vehicle at the Legacy Commons apartments in the 6200 block of South Norcross Tucker Road.\nWhen officers arrived at Legacy Commons, they found the vehicle and Pazos-Gonzalez, who was “not fully compliant after he was given commands to exit his vehicle,” Pihera said.\nOfficers deployed their Tasers and arrested Pazos-Gonzalez, Pihera said.\nHe was booked into Gwinnett County Jail on charges that included two counts of aggravated assault and one count of armed robbery.","url":"https://www.ajc.com/news/crime--law/gwinnett-police-arrest-man-accused-pointing-gun-child-others/3PBRznxtH6wUhtyWOrVFdN/"}
