{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:52:19","date_modify":"2018-10-22 20:52:19","date_publish":"2016-01-28 04:49:01","description":"The 43-year-old actress arrived at LAX airport on Thursday after a romantic getaway with her 44-year-old boyfriend where she wore the latest chic couture but skipped the heels and went for comfort","filename":"data/vaneerConsumption/GwynethPaltrowarriveshomeafterParisgetawaywithBradFalchuk.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A6707A00000578-0-image-a-57_1453951096848.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420323_Gwyneth-Paltrow-ditches-heels-goes-comfort-arrives-home-romantic-Paris-getaway-beau-Brad-Falchuk_1540241539.html","title":"Gwyneth Paltrow arrives home after Paris getaway with Brad Falchuk","title_page":"Gwyneth Paltrow arrives home after Paris getaway with Brad Falchuk | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She wore the latest chic couture during her romantic getaway in Paris.\nBut Gwyneth Paltrow ditched the heels and went for comfort as she arrived at LAX airport on Wednesday.\nThe 43-year-old actress wore wide-legged denim jeans, a cosy blue sweater and basic white tee for her flight back to Los Angeles.\nScroll down for video\nCasual chic: Gwyneth Paltrow, 43, ditched the heels and went for comfort as she arrived at LAX airport on Wednesday\nThe Iron Man starlet accessorized her ensemble with white sneakers and carried a royal blue designer handbag.\nPaltrow's boyfriend Brad Falchuk, 44, followed closely behind the starlet as he hauled most of the luggage.\nGoing for comfort: The Iron Man actress wore wide-legged denim jeans, a cosy blue sweater and basic white tee for her flight back to Los Angeles\nGwyneth and her TV producer-writer beau have been enjoying the sites of the city of love on their break.\nThe couple enjoyed a whirlwind trip to Paris to also take in the latest fashions at the Haute Couture shows.\nBut before anything, the lovebirds made sure to wine and dine on some of the famed French cuisine in the capital.\nUndercover: The Oscar winner tried to keep concealed behind dark shades and let her signature blonde locks falls across her face in an attempt to remain disguised\nLugging the luggage: Paltrow's boyfriend Brad Falchuk, 44, followed closely behind the starlet as he hauled most of the luggage\nThe pair were seen going for a dinner date at Dome in Montparnasse, located in the 14th arrondissement on Sunday evening.\nOn Monday the Oscar Award-winning actress posted a snap of herself and her man taking photos from the roof of the Pompidou Centre art gallery.\nShe captioned it: 'The view from the top of the #centrepompidou is at least as stunning as the art contained within its walls. What a glorious place. #parisjetaime.'\nRomantic rendevouz: Gwyneth and her TV producer-writer beau have been enjoying the sites of the city of love on their break","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420323/Gwyneth-Paltrow-ditches-heels-goes-comfort-arrives-home-romantic-Paris-getaway-beau-Brad-Falchuk.html"}
