{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:51","date_modify":"2018-10-30 19:08:51","date_publish":"2017-04-18 05:40:30","description":"Four federal agencies will put many U.S. visa worker programs, including the white-collar H-1B program, through a “full legal analysis,” a White House official told reporters Monday night. | Politics","filename":"data/vaneerConsumption/H1BDonaldTrumpOrdersLegalReviewofOutsourcingVisaPrograms.json","image_url":"https://media.breitbart.com/media/2017/04/AP_16155743318762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_04_17__1540926531.html","title":"H-1B: Donald Trump Orders Legal Review of Outsourcing Visa Programs","title_page":"H-1B: Donald Trump Orders Legal Review of Outsourcing Visa Programs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Four federal agencies will put many U.S. visa worker programs, including the H-1B white-collar outsourcing program, through a “full legal analysis,” a White House official told reporters Monday night.\nThe review may wreck several of the many programs which keep a population of perhaps 1.8 million foreign temporary workers in a huge variety of U.S. jobs, even as 4 million young Americans enter the workforce each year.\nThose visa programs are now in jeopardy because critics — including attorney John Miano — say the programs lack a firm legal foundation amid a variety of firmly established laws which bar discrimination against U.S. workers.\nMoreover, many of the cheap-labor guest-worker programs have been quietly extended and enlarged by prior administrations, ensuring that many may be sharply rolled back if the regulatory extensions are vulnerable to lawsuits, even if the programs are not eliminated.\nFor example, critics have long argued that there is no legal foundation for President Barck Obama’s decision to provide work permits to several hundred thousand spouses of H-1B white-collar workers, and there is no legal foundation to President George W. Bush’s decision to provide multi-year work permits to foreign students. In 2016, the universities used that student program, dubbed the Optional Practical Training program, to give work permits to at least 147,000 foreign college students and to persuade many other foreign students to enroll in American universities.\nIn addition, the federal government has repeatedly expanded the H-1B program, and even allows non-profit groups to bring in an unlimited number of foreign students. In 2015, for example, non-profit employers — including many universities and affiliated hospitals — employed roughly 100,000 foreign white-collar workers. Several states are also using that regulation to create non-profits which bring in cheap college graduates for use by employers in Massachusetts and other states.\nThe multi-program, multi-agency review is being ordered by an Executive Order that President Donald Trump will sign in Wisconsin on Tuesday. The agencies involved are departments of justice, labor, homeland security and state. Much of the focus is on the H-1B program and its regulatory expansions.\nAccording to a report by Politico:\n[A White House] official criticized the H-1B system for awarding visas randomly, without taking into account an applicant’s skill or salary level. “The result of that is that workers are often brought in at well below market rates,” the official said. The official emphasized that while each department will need a “full legal analysis” to determine what changes can be made to existing programs, the administration believes there are steps that can be taken both administratively and legislatively. Some potential changes to the H-1B program included weighting the lottery to give an advantage to applicants who hold higher education degrees, for example, or to increase the application fee. “If you change that current system that awards visas randomly, without regard or skill or wage, to a skill-based awarding, it makes it extremely difficult to use the visa to replace or undercut American workers, because you’re not bringing in workers at beneath the market wage,” the official said. “So it’s a very elegant way of solving systemic problems in the H-1B guest worker visa.”\nAccording to TheHill.com,\nOne senior administration official described “abuse” of the program as any company that “brings in a worker not because you need their skill or talent, but for the purpose of undercutting the American worker” by seeking out cheap foreign labor. The executive order is not expected to address the number of [H-1B] visas that are given out annually. Rather, it is intended to raise the qualifying criteria for applicants so that only top earners with specific skill sets are considered. An administration official claimed that the “lion’s share” of the visas are presently used for “entry-level positions.” “We’ve never had a systematic review like this,” the official said. “These steps are broadly supported by American workers would bring these programs into compliance with their original intent. H1-B was intended to be a skilled worker program but most those using it are paid less than American workers in their field.”\nThe annual inflow of foreign contract workers is huge, adding up to roughly 1 million short-term or long-term workers, either in white-collar or blue-collar jobs. The imported contract workers are not immigrants, not citizens, nor green card holders, but are temporary workers slated to return home after several years. Generally, employers do not have to interview Americans before hiring foreigners for the U.S.-based jobs.\nMany of the contract workers stay for several or more years, ensuring the resident population of white-collar and blue-collar contract workers is much larger than the annual inflow and may reach a resident population of 1.8 million. The left-wing Economic Policy Institute pegs the resident population at 1.4 million.\nMany blue-collar workers stay for just one season, filling jobs as landscapers or beach workers, waiters and foresters, fish processors and farm workers. These blue-collar temp programs get a lot of criticism, partly because some employers cheat their foreign workers, but they are supported by many local politicians who are trying to help donors and influential business leaders. This seasonal inflow has sharply reduced the number of Americans teenagers working during the summer.\nMost of the white-collar workers stay for several or more years, ensuring the resident population of white-collar contract workers is must larger than the annual inflow. For example, the annual inflow of H-1B white-collar guest-workers is roughly 110,000, but the resident population is almost one million, according to a recent estimate by Goldman Sachs. The federal government releases little data on the many different guest-worker programs, but the available evidence says the national population of white-collar contract workers is up to 1.5 million. That population is roughly twice the population of 800,000 Americans who graduate from college with skilled degrees each year.\nSeveral sites, including here and here, show numbers of H-1B outsourcing visas requested by companies and non-profits. The sites also show where the requested workers will work, their job titles and their supposed wages. For example, the sites show the number of visas for foreign pharmacists sought by CVS and other companies and the number of visas for architects and industrial designers sought by so-called “job shop” firms which outsource their imported workers to other U.S. companies.\nThe inflow of contract workers forces down wages paid to Americans and to immigrants, partly because the inflow reduces wage pressure on blue-collar and white-collar employers. Moreover, many of the contract workers rationally and decently will take jobs are low wages because their employers can promise to eventually reward them with the massively valuable deferred bonus of a green card and then U.S. citizenship. Each year, companies request and receive 140,000 green cards for their white-collar employees and their families, further boosting the supply of professionals in the white-collar labor market.\nEmployers say they need the foreign workers because they can’t hire enough Americans for blue-collar jobs, even at wages of $12 per hour or higher.\nBut critics — and much evidence — say the programs are rife with corruption, including fake resumes, fraudulent visa applications, under-the-table payments, workplace and hiring discrimination against Americans, as well as false claims by lobbyists and corporates that too few Americans want to work at companies such as Goldman Sachs or Facebook or in the New York fashion industry.\nA 2016 report by the National Academies of Science showed that cheap-labor gues-workers programs, plus the must large inflow of legal immigrants, annually transfers roughly $500 billion from American employees over to investors and employers.\nMany politicians — including House Speaker Paul Ryan — have felt growing pressure from voters, and have reduced their support for the wage-cutting programs since 2016. Other politicians, including GOP Sen. Tom Tillis, have stepped up their support for the labor outsourcing programs along business groups that prefer cheaper labor. For example, GOP House members have recently included a provision in the April 28 appropriations bill that would allow companies to get tens of thousands of additional H-2B visas to bring in more blue-collar workers at salaries rise in a growing economy.\nCandidate Donald Trump picked up the flag for Americans in 2016, and his criticism of theH-1B program helped him gain voters from the college-graduate demographic. “I will end forever the use of the H-1B as a cheap labor program, and institute an absolute requirement to hire American workers first for every visa and immigration program,” said a Trump statement in 2016. “No exceptions.” In his inauguration speech, Trump declared his national economic policy is: “Buy American, Hire American.”\nFollow Neil Munro on Twitter @NeilMunroDC or email the author at NMunro@Breitbart.com","url":"https://www.breitbart.com/politics/2017/04/17/h-1b-donald-trump-orders-legal-review-outsourcing-visa-programs/"}
