{"authors":[],"date_download":"2018-10-30 00:53:48","date_modify":"2018-10-30 00:53:48","date_publish":"2015-10-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HabitatExchangeABadIdea.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_10_habitat_exchange_a_bad_idea_1540860828.html","title":"Habitat Exchange: A Bad Idea","title_page":"Habitat Exchange: A Bad Idea","title_rss":"NULL","source_domain":"americanthinker.com","text":"If this sounds a bit like mafia protection money, maybe that’s because it is. Developers who are targeted with the threat of expensive permitting delays are given an offer they can’t refuse. Liberals in government aligned with environmental groups are willing to give them a free pass as long as they pay up.\nThe idea of habitat exchange has been gaining ground at the state and federal level. Already several western states have implemented small-scale exchanges through which businesses, energy companies, government entities, and developers purchase credits to set aside habitat for endangered species. Once this habitat has been purchased, development is then allowed to proceed without the threat of regulatory delay.\nHabitat exchange has the potential to be something big – much bigger than anything Al Capone could think up. It has the potential to affect nearly all development in the U.S. This is because endangered and threatened species, those now designated and those yet to be, are spread across nearly every county and every state. Once the principle of paying to offset even hypothetical environmental impact has been established, developers everywhere will be forced to pay. This of course is just what environmentalists want – more and more land permanently set aside and less available for future development.\nHabitat exchange is portrayed as being a win-win arrangement for business and the environment. Developers seeking to construct home sites on greater sage grouse habitat, for example, would be forced to purchase credits to pay landowners elsewhere to set aside habitat for the species. Developers could then proceed, protected habitat would be increased, and everyone’s happy – everyone except the consumer, who purchases a home with the added cost of the credit built in.\nThe same added cost applies to all other products or services produced on land occupied by or supporting an endangered species of any sort. Eventually, that would involve nearly everything produced in the U.S. There are already 1,261 endangered species in North America, with another 250 on the waiting list in the U.S. and thousands of others yet to be assessed. Carried to its logical end, habitat exchange would increase the price of every form of development, from oil and gas drilling all the way down to construction of schools and hospitals.\nNew infrastructure would be especially costly, since roads, pipelines, and transmission lines pass through various habitats and would require the purchase of multiple habitat exchange credits. The increased cost of new infrastructure would be passed on to taxpayers, just as the increased cost of goods and services would be passed on to consumers.\nIt is not just new construction that is affected. Federal law makes it illegal to “harass, harm, pursue, hunt, shoot, wound, kill, trap, capture, or collect” listed species. That sweeping definition already criminalizes acts like trimming your hedges at the wrong time of year (something specifically prohibited in certain European countries) and removing plants that might support an endangered or threatened species. This means that the maintenance of older homes, yards, businesses, and water features, and the use of common chemicals of all sorts, is regulated insofar as such activities affect endangered species. Washing your car might get you into trouble with Fish and Wildlife or the EPA if your suds pose a threat to endangered plants or animals.\nWorse yet if your cat happens to snatch a golden-cheeked warbler. As the German magazine Spiegel points out, domestic cats are one of the greatest threats to birds of all kinds, including endangered species. In response to the “cat plague,” environmentalists worldwide are calling for cats to go. The 110 million cats in the U.S. kill an estimated 1.4 to 3.7 billion birds each year in the U.S., to say nothing of billions of small ground animals. Among these are surely many endangered species.\nWhat’s to stop habitat exchange from applying to pets – and, for that matter, to human inhabitants? In exchange for the right to own a killer feline, one should be willing to purchase credits setting aside habitat for the birds your cat might kill. And to offset the environmental damage of your own eating and breathing, you should have to pay up as well.\nThese are not hypothetical issues. Carbon tax bills, such as that introduced by Sen. Sheldon Whitehouse, are just the beginning. Pope Francis has entered the fray with an injunction in his recent encyclical Laudato si’ to “replace without delay” all carbon fuels. Proposals for a “procreation tax” to offset the environmental impact of human births have garnered attention in many countries, including Australia. All of these false solutions are based on the same mistaken logic: the idea that human beings (and their pets) are inherently destructive, and that their activities must be curbed and restricted by law.\nThe cost of habitat exchange must be counted not just in dollars, but in a loss of freedom and a reduced standard of living. Habitat exchange raises the cost of new development – and of maintenance of existing structures and infrastructure. Greater cost means less development, which translates into fewer jobs and a lower standard of living – all of this to make a few mule deer comfortable. That is not a trade-off most people want.\nIn a recent op-ed, the head of the Environmental Defense Fund stated that with habitat exchange, “everyone wins.” Is that really true? By forcing businesses and government, even the U.S. military, to pay for credits before proceeding with lawful activities, habitat exchange would raise the cost of all goods and services. It’s just another example of environmentalists ignoring the cost the regulation they seek to impose.\nNo one wishes to see species extinction take place, and non-profit efforts to purchase habitat are a laudable effort. But with habitat exchange, ordinary consumers and taxpayers are forced to contribute whether they wish to or not.\nThe effort to preserve endangered species cannot be allowed to slow economic development. To do so would place the United States at a competitive disadvantage to other countries and would eventually undermine our national security. The protection of habitat for endangered species is a worthy goal, but it should not come at the expense of liberty and economic opportunity for Homo sapiens.\nJeffrey Folks is the author of many books and articles on American culture including Heartland of the Imagination (2011).","url":"https://www.americanthinker.com/articles/2015/10/habitat_exchange_a_bad_idea.html"}
