{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 01:16:33","date_modify":"2018-10-23 01:16:33","date_publish":"2017-03-16 11:05:48","description":"A cyber attack on the website of travel trade organisation Abta may have affected around 43,000 individuals, the company said today. Pictured is CEO Mark Tanzer.","filename":"data/vaneerConsumption/HackerstargettraveltradeorganisationAbtaswebsite.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/0C84A183000005DC-0-image-a-84_1489664050030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319690_Hackers-target-travel-trade-organisation-Abta-s-website_1540257393.html","title":"Hackers target travel trade organisation Abta's website","title_page":"Hackers target travel trade organisation Abta's website  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mark Tanzer, CEO of Abta, said: 'I would personally like to apologise'\nA cyber attack on the website of travel trade organisation Abta may have affected around 43,000 individuals, the company said today.\nThe breach is said to have taken place at the end of last month, with information on 43,000 holidaymakers and 650 Abta members accessed by the hackers.\nAround 1,000 files of personal identity data were taken and email addresses and passwords of registered customers and members were also stolen.\nThe passwords were encrypted - hackers will only see a jumble of characters - which means there is a low risk of fraud.\nA smaller number of the data was from people who has submitted documents for complaints, since 11 January 2017.\nAbta has urged customers to change their passwords as a precaution. The firm has alerted the police and the Information Commissioner about the incident.\nMark Tanzer, CEO of Abta, said: 'I would personally like to apologise for the anxiety and concern that this incident may cause to any customer of Abta or Abta member who may be affected.\n'It is extremely disappointing that our web server, managed for Abta through a third party web developer and hosting company, was compromised, and we are taking every step we can to help those affected.\n'I will personally be working with the team to look at what we can learn from this situation.'\n'We are today contacting these people and providing them with information and guidance to help keep them safe from identity theft or online fraud.\n'We have also alerted the relevant authorities, including the Information Commissioner and the police.'\nAbta is the UK's largest travel association, representing travel agents and tour operators that sell £32billion of holidays and other travel arrangements each year.\nA cyber attack on the website of travel trade organisation Abta may have affected around 43,000 individuals\nAbta is the UK's largest travel association, representing travel agents and tour operators that sell £32billion of holidays and other travel arrangements each year\nKevin Cunningham, president and founder of identity governance firm SailPoint: 'Being exposed as unprepared and ill-equipped to minimise the damage associated with a breach is a fear of any organisation.\nWHAT TO DO IF YOU THINK YOUR ACCOUNT WAS HACKED It’s important that you act quickly.\nChange any passwords which might be affected, especially those which you use elsewhere on the web.\nNew passwords should contain a strong alphanumeric code, including numbers, hashtags and punctuation.\nIt’s also advisable to opt for Two-Factor Authentication whenever possible. This means that, even with your email and password, hackers cannot gain access to a website without first having access to your mobile phone. Source: Owl Detect\n'Today's organisations house vastly more sensitive data, and so everyone from the executive level down needs to ensure there is a collaborative effort from internal staff to protect that sensitive information and ultimately, the health and longevity of the company.\n'In today's world, it's a matter of when, not if, a data breach will happen. So the most important factors are prevention, education, and rapid response.\n'When a breach does happen, it's important to quickly find out how and why it occurred, assess the damage and required response, and put IT controls in place to address future attacks.\n'This is where identity and access management solutions can help, because they can address the immediate pain while also identifying – and mitigating – other areas of exposure.'\nMatthias Maier, security evangelist at Splunk, praised Abta for being prepared.\nHe added: 'It looks like Abta has done its homework and ensured that the third party-provider that hosts its website has been able to remediate the vulnerability and identify what has happened quickly.\n'As a result, Abta has been able to alert affected customers and the relevant authorities in a timely fashion with a view to mitigating its impact.\n'As we see the number of cyber attacks and breaches grow, having the capability to understand the scale of a breach by analysing all machine generated data from web applications will be key, as will having proper processes and crisis plans in place to respond effectively.'","url":"https://www.dailymail.co.uk/news/article-4319690/Hackers-target-travel-trade-organisation-Abta-s-website.html"}
