{"authors":[],"date_download":"2018-10-30 21:12:55","date_modify":"2018-10-30 21:12:55","date_publish":"2016-08-14 10:24:47","description":"\"Guccifer 2.0\" has claimed responsibility for the hack of the Democratic Congressional Campaign Committee.","filename":"data/vaneerConsumption/Hackerreleasespersonalinformationofnearly200Democrats.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_hacker-releas_a30c89dc25321805816e8d01704932aa__1540933975.html","title":"Hacker releases personal information of nearly 200 Democrats","title_page":"Hacker releases personal information of nearly 200 Democrats","title_rss":"NULL","source_domain":"ajc.com","text":"Personal information of nearly 200 congressional Democrats was leaked Friday, including cellphone numbers, email addresses and more.\n>> Watch the video from Newsy\nThe hacker \"Guccifer 2.0\" has claimed responsibility and is believed by some U.S. intelligence officials to be tied to Russian intelligence services.\nThis leak isn't as embarrassing as the Democratic National Committee documents WikiLeaks released last month. Former DNC chairwoman Debbie Wasserman Schultz stepped down after that one.\nStill, it seems like the hacker wants to taunt Democrats and is claiming to be behind other similar hacks.\nThe first line of a recent blog post by \"Guccifer 2.0\" reads: \"It's time for new revelations now. All of you may have heard about the DCCC hack. As you see I wasn't wasting my time! It was even easier than the case of the DNC breach.\"\nThe hack of the DCCC — or Democratic Congressional Campaign Committee — refers to what happened last month during the Democratic National Convention.\nExperts can't currently verify the identity of Guccifer 2.0, but the name is a reference to a Romanian hacker known as Guccifer who hacked politicians including George W. Bush and George H.W. Bush.\n>> Read more trending stories\nJust this week, U.S. officials said that the Democratic National Committee hack was broader than previously realized.\nAnd WikiLeaks founder Julian Assange confirmed that his organization isn't out of material on Hillary Clinton.\n\"We have more material related to the Hillary Clinton campaign. That is correct to say that,\" Assange told CNN's Anderson Cooper.\nAuthorities still aren't sure of the motive for these hacks.","url":"https://www.ajc.com/news/national/hacker-releases-personal-information-nearly-200-democrats/8aGVgTa8xGEFUyY3xOFYTM/"}
