{"authors":[],"date_download":"2018-10-22 20:49:27","date_modify":"2018-10-22 20:49:27","date_publish":"2014-06-03 03:29:00","description":"Victims an American Indian tribe in Washington state, a police department in Massachusetts and a restaurant operator in Florida.","filename":"data/vaneerConsumption/HackingSchemeThatStoleMillionsBustedbyUS.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_hacking-scheme-stole-millions-busted-u-s-n120946_1540241367.html","title":"Hacking Scheme That Stole Millions Busted by U.S.","title_page":"Hacking Scheme That Stole Millions Busted by U.S.","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAssociated Press\nWASHINGTON — A band of hackers implanted viruses on hundreds of thousands of computers around the world, secretly seized customer bank information and stole more than $100 million from businesses and consumers, the Justice Department said Monday in announcing charges against the Russian man accused of masterminding the effort.\nIn unveiling the criminal case, federal authorities said they disrupted Europe-based cyber threats that were sophisticated, lucrative and global.\nIn one scheme, the criminals infected computers with malicious software that captured bank account numbers and passwords, then used that information to secretly divert millions of dollars from victims' bank accounts to themselves. In another, they locked hacking victims out of their own computers, secretly encrypted personal files on the machines and returned control to the users only when ransom payments of several hundred dollars were made.\n\"The criminals effectively held for ransom every private email, business plan, child's science project or family photograph — every single important and personal file stored on the victim's computer,\" Leslie Caldwell, the head of the Justice Department's criminal division, said at a news conference.\nThe FBI called the alleged ringleader, Evgeniy Bogachev, 30, one of the most prolific cyber criminals in the world.\nHe has not been arrested, but Deputy Attorney General James Cole said U.S. authorities were in contact with Russia to try to bring him into custody.\nOfficials say the case is another stark reminder of the evolving cybercrime threat, although it's unrelated to the recently unsealed cyber-espionage indictment of five Chinese military hackers accused of stealing trade secrets from U.S. firms.\nThe group is accused in the development of both \"Gameover Zeus\" — a network of infected computers that intercepted customer bank account numbers and passwords that victims typed in — and \"Cryptolocker,\" malicious software that hijacked victims' computers and demanded ransom payments. Computer users who refuse the ransom demands generally lose their files for good.\nThe victims of the different schemes included an American Indian tribe in Washington state, an insurance company and a firm that runs assisted living centers in Pennsylvania, a police department in Massachusetts, a pest control company in North Carolina and a restaurant operator in Florida.","url":"https://www.nbcnews.com/news/crime-courts/hacking-scheme-stole-millions-busted-u-s-n120946"}
