{"authors":["Joey Millar For Mailonline"],"date_download":"2018-10-22 22:02:28","date_modify":"2018-10-22 22:02:28","date_publish":"2016-01-28 09:45:46","description":"CCTV images show two men wanted in connection with the incident in Lower Clapton Road joking around in a shop. Police are urging any other victims or witnesses to come forward","filename":"data/vaneerConsumption/Hackneypolicehunttwomenaftersixchildrensexuallyassaulted.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A93A4500000578-0-image-a-2_1453976315023.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420580_Police-hunt-two-men-Hackney-four-boys-aged-13-two-schoolgirls-sexually-assaulted_1540245748.html","title":"Hackney police hunt two men after six children sexually assaulted","title_page":"Hackney police hunt two men after six children sexually assaulted | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police today released CCTV images of two men they would like to speak to in connection with the sexual assault of six schoolchildren in Hackney.\nFour boys, all aged 13, were targeted by two men as they walked to school on July 8 last year. Detectives were later informed by a witness that the same men had previously sexually assaulted two schoolgirls in the same area.\nPolice said the boys were approached by two men in Lower Clapton Road at the junction with Atherden Road, Hackney, as they walked to school along a footpath at around 8am.\nPolice would like to speak to two men (pictured) after four boys, all aged 13, were sexually assaulted as they walked to school on July 8 last year\nThe shocking incident occurred at around 8am in the junction of Lower Clapton Road and Atherden Road\nThey were sexually assaulted but managed to escape and make their way to their school, where they explained what happened and called the police.\nFollowing the attack, a witness provided detectives with information relating to a separate offence involving two school girls.\nThis sexual assault, which took place close to where the first incident occurred, is believed to have been carried out by the same two men. Police are now appealing for any further victims or witnesses to come forward.\nIn the footage released by officers, two men wanted in connection with the incident are shown laughing as they buy a drink from a shop\nPolice are appealing for any further victims or witnesses to come forward following the two incidents\nOne of the men (pictured) wanted by police was white, aged in his 20s and blonde\nIn the footage released by officers, two men are shown laughing together and joking around as they buy a drink from a shop.\nPolice described one of the men they would like to speak to in relation to the incident as white, aged in his 20s, clean shaven, of medium build and having short, light brown hair.\nHe was wearing a black hooded jacket, black tracksuit trousers with light blue stripes and dark trainers.\nThe other man was also described by police as white, aged in his 20s and of medium build.\nHe had short blonde hair and was wearing a white shirt and blue jeans.","url":"https://www.dailymail.co.uk/news/article-3420580/Police-hunt-two-men-Hackney-four-boys-aged-13-two-schoolgirls-sexually-assaulted.html"}
