{"authors":[],"date_download":"2018-10-30 01:05:51","date_modify":"2018-10-30 01:05:51","date_publish":"2018-07-11 17:23:03","description":null,"filename":"data/vaneerConsumption/HadesinHaitiPillagingPortauPrince.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Notfallpädagogik.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861551.html","title":"Hades in Haiti: Pillaging Port-au-Prince","title_page":"Hades in Haiti: Pillaging Port-au-PrinceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"This past weekend, the Haitian government, headed by Prime Minister Jack Guy Lafontant, announced price spikes on oil products. The economic shock has rocked Haiti, inciting the worst riots since the coup d’état of the early 1990s. Haiti, the most impoverished country in the Western Hemisphere, continues to be the victim of government planning and financial recklessness.\nIn a not-so-sly political move, Lafontant upped oil prices during the Belgium v. Brazil world cup game Friday. Haiti’s team lost and so did the Haitians. Oil rose some 38% , Diesel 47% , and 51% on kerosene. For the average Haitian, who lives on about three dollars a day, there’s reason aplenty to riot.\nHow did the island nation get here? Haiti was once a member of the now flailing PetroCaribe which supplied Venezuelan oil on the cheap. Akin to Russia’s weaponization of natural gas in Eastern Europe, PetroCaribe was Venezuela’s vehicle for resource nationalism. Over the last few years, however, PetroCaribe has been the victim of falling oil prices and US sanctions. Those sanctions make it impossible for Haiti to purchase Venezuelan oil.\nSince the sanctions, Haiti has been subsidizing the retail oil market. But in an agreement with the International Monetary Fund (IMF) this past February, these subsidies would be axed so as to “focus on critical public investment in infrastructure, health, education and social services.”\nGood to see a Western power calling the shots in Haiti, even if it is with Benjamins and not Chinooks.\nYet let us not move too quickly. It was smart to take advantage of the low prices when they could, but Haiti is now paying the price for cheap oil. As international events have turned out, Haiti cannot continue to subsidize its citizens and it ought not too. The regime has to pay its bills and let the market correct the price spikes. This is not meant to downplay the tragedy, but rather acknowledge the best path forward.\nIn wake of the riots, Lafontant was forced to reverse his decision. It has mattered little, however, as Port-au-Prince is still in flames and the regime’s reputation is as drinkable as the water.","url":"https://spectator.org/hades-in-haiti-pillaging-port-au-prince/"}
