{"authors":[],"date_download":"2018-10-22 20:28:32","date_modify":"2018-10-22 20:28:32","date_publish":"2014-06-01 10:29:15","description":"The operation to move quickly was \"essentially to save [Bergdahl's] life,\" Defense Secretary Chuck Hagel said.","filename":"data/vaneerConsumption/HagelCongressKeptinDarkonSwapBecauseBergdahlsLifeinDanger.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/479866/bergdahljune1-v2_21e8dfc8a771a2c5172d9526787cbd24.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_hagel-congress-kept-dark-swap-because-bergdahls-life-danger-n119551_1540240112.html","title":"Hagel: Congress Kept in Dark on Swap Because Bergdahl's Life in Danger","title_page":"Hagel: Congress Kept in Dark on Swap Because Bergdahl's Life in Danger","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCongress was not told earlier about the operation to free Sgt. Bowe Bergdahl in exchange for five Taliban detainees because officials believed the soldier's life was in danger, Defense Secretary Chuck Hagel said Sunday.\nIntelligence gathered suggested that Bergdahl's \"health was deteriorating,\" he told NBC's \"Meet the Press\" on Sunday in an interview from Bagram Air Force Base in Afghanistan.\n\"This was essentially an operation to save the life of Sgt. Bergdahl,\" Hagel added.\nHe said that the process that led to Bergdahl's release could be a precursor to an agreement about the Taliban's future role in Afghanistan.\n\"We hope it will present an opening,\" he said.\nBergdahl arrived at Landstuhl Regional Medical Center in Germany at 9 a.m. ET Sunday.\nThe Pentagon did not give Congress the required 30-day notice for the release of detainees to the dismay of some lawmakers.\n\"The release of five mid- to high-level of Taliban is shocking to me,\" Rep. Adam Kinzinger, R-Ill., told \"Meet the Press.\"\n\"I’m very disappointed.\"\n\"We couldn't afford any leaks anywhere, for obvious reasons\"\nBergdahl, 28, was turned over by the Taliban in eastern Afghanistan to U.S. Special Forces Saturday evening in exchange for five prisoners described by the Taliban as “leaders” who were held at the Guantanamo Bay, Cuba, detention center.\nOn Saturday, President Barack Obama appeared with Bergdahl's parents, and said he was \"never forgotten\" as he was held prisoner by the Taliban.\nOnly a handful of people knew about Saturday's extraction, Hagel told reporters traveling with him.\n\"We couldn't afford any leaks anywhere, for obvious reasons,\" he said.\n\"We found an opportunity. We took that opportunity,\" Hagel said later on Meet the Press. \"I’ll stand by that decision.\"\nThe Taliban handed Bergdahl over to special operations forces in eastern Afghanistan, and later in the day the detainees were flown from the Guantanamo detention center to Qatar.\nHagel said the special operations forces conducting the mission took every precaution, using intelligence gathering, surveillance, well-positioned security assets and a lot of helicopters to ensure that things did not go wrong.\n\"No shots were fired. There was no violence,\" said Hagel. \"It went as well as we not only expected and planned, but I think as well as it could have ...The timing was right. The pieces came together.\"\nHagel did not respond to questions on whether he believed Bergdahl was trying to desert the Army or go absent without leave when he walked away from his unit in Afghanistan five years ago.\n\"This is a guy who probably went through hell the last five years and let's focus on getting him well and getting him back with his family,\" Hagel said.\nHe said that Bergdahl walked to the \"extraction helicopter\" under his own steam and added that he was not surprised by reports that the sergeant was having difficulty speaking English.\n\"He’s been held by the Taliban — we don’t know under what circumstances — for five years. As far as we know, he was not held with any other Americans,\" he said.\nWhite House National Security Adviser Susan Rice said President Obama exercised his constitutional authority in green-lighting the swap — and it should not have been a shock to Congress.\n\"They were well aware that this idea and this prospect was one that the administration was seriously considering,\" Rice said on ABC's \"This Week.\"\nHagel also said that his time in Vietnam and the fact that he knew people like Sen. John McCain of Arizona who was a prisoner of war, gives him a personal connection to such an exchange.\nNevertheless, McCain himself said there were important questions regarding the release in exchange for five Taliban militants.\n“These particular individuals are hardened terrorists who have the blood of Americans and countless Afghans on their hands,” Sen. John McCain said in a statement, while acknowledging the joy Bergdahl’s family was surely feeling.\n“I am eager to learn what precise steps are being taken to ensure that these vicious and violent Taliban extremists never return to the fight against the United States and our partners or engage in any activities that can threaten the prospects for peace and security in Afghanistan,” added McCain.\nIndeed, the detainees could resume their previous roles as Taliban commanders, terrorism analyst Evan Kohlmann said.\n\"Looking at the profiles of these individuals, I think there’s a valid reason for concern about what lies in the near future,” he added.\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/hagel-congress-kept-dark-swap-because-bergdahls-life-danger-n119551"}
