{"authors":[],"date_download":"2018-10-22 22:34:46","date_modify":"2018-10-22 22:34:46","date_publish":"2014-05-11 19:08:50","description":"The defense secretary did not say whether the policy should be overturned. Gays and lesbians have been allowed to serve openly since 2010.","filename":"data/vaneerConsumption/HagelSaysMilitaryBanonTransgenderServiceShouldBeReviewed.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/414341/140501-chuck-hagel-1548_2e1b092cf1ecc86a0f0cadf3b35c4cd3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_hagel-says-military-ban-transgender-service-should-be-reviewed-n102581_1540247686.html","title":"Hagel Says Military Ban on Transgender Service Should Be Reviewed","title_page":"Hagel Says Military Ban on Transgender Service Should Be Reviewed","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe prohibition on transgender individuals serving in the U.S. military \"continually should be reviewed,\" Defense Secretary Chuck Hagel said Sunday.\nHagel did not indicate whether he believes the policy should be overturned.\nHowever, he said: \"every qualified American who wants to serve our country should have an opportunity if they fit the qualifications and can do it.\"\nA transgender individual is someone who has acquired the physical characteristics of the opposite sex or presents themselves in a way that does not correspond with their sex at birth.\nA panel convened by a think tank at San Francisco State University recently estimated that about 15,450 transgender personnel serve in the military and in the National Guard and Reserve.\nIn 2010, Congress passed legislation allowing gays and lesbians to serve openly.\nHagel said the issue of transgender serving in the military is more complicated. He said \"these issues require medical attention\" that at times cannot be provided in austere locations.\nThe National Center for Transgender Equality said it welcomed Hagel's comments, which were made on ABC's \"This Week.\"\n— Associated Press","url":"https://www.nbcnews.com/news/us-news/hagel-says-military-ban-transgender-service-should-be-reviewed-n102581"}
