{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:07:13","date_modify":"2018-10-22 22:07:13","date_publish":"2017-03-10 00:19:50","description":"The daughter of Stephen Baldwin paired her black jacket - which may have been fresh from the store given her RTA shopping bag - with a cropped white hooded sweatshirt.","filename":"data/vaneerConsumption/HaileyBaldwinrocksabikerchiclookinRTAjacket.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EBCDA00000578-0-image-a-8_1489100796792.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299270_Hailey-Baldwin-rocks-biker-chic-look-RTA-jacket_1540246033.html","title":"Hailey Baldwin rocks a biker chic look in RTA jacket","title_page":"Hailey Baldwin rocks a biker chic look in RTA jacket | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been rocking the runway as of late, modeling the latest fashion from top designers around the world.\nAnd Hailey Baldwin proved she's no different off the ramp as she was spotted on Thursday looking casual chic in an edgy RTA leather jacket.\nThe 20-year-old model headed into her car in the West Hollywood neighborhood of Los Angeles after leaving a friend's house.\nRocking it! Hailey Baldwin stepped out on Thursday with a casual and chic ensemble as she was spotted leaving a friend's house in the West Hollywood neighborhood of Los Angeles\nThe daughter of Stephen Baldwin paired her black jacket - which may have been fresh from the store given her RTA shopping bag - with a cropped white hooded sweatshirt.\nFlashing her toned tummy, she wore dark fitted leggings and casual flats as her hair was tied up in a high messy ponytail.\nGoing out make-up free, Hailey accessorized with a long cross pendant necklace as she sipped on a green drink.\nMake-up free and marvelous! The 20-year-old model stepped out make-up free as she headed into her car\nNew purchase? The IMG model was seen with an RTA bag as she wore a leather jacket from the trendy retail store\nThe dressed-down appearance sure makes sense as the blonde beauty spent the past week in the City Of Lights wearing high-fashion pieces for Paris Fashion Week.\nAccompanied by her close model friends - Kendall Jenner and Gigi Hadid - Hailey took center stage during the Elie Saab autumn/winter 2017 event on Saturday.\nMeanwhile, the American fashion star was announced as L'Oréal Professionel's new global ambassador.\nChic: The daughter of Stephen Baldwin paired her jacket with tights and a cropped hooded sweatshirt for the warm spring day\nThe IMG model has been announced as the new muse for the beauty brand's SS17 and AW17 campaigns.\nShe will also be the face of their 2017 PRO FIBER hair care treatment campaign.\nHailey has admitted she feels 'super happy' to have joined forces with the highly recognized company.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299270/Hailey-Baldwin-rocks-biker-chic-look-RTA-jacket.html"}
