{"authors":["Abrose For Mailonline"],"date_download":"2018-10-23 03:14:07","date_modify":"2018-10-23 03:14:07","date_publish":"2017-04-26 14:37:49","description":"The daughter of actor Stephen Baldwin, 50, flaunted her stunning gym-honed physique as she simply captioned the video 'mood'.","filename":"data/vaneerConsumption/HaileyBaldwinflauntsabsplayingtennisinherunderwear.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F9B6800000578-0-image-a-164_1493209106240.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447146_Hailey-Baldwin-flaunts-abs-playing-tennis-underwear_1540264447.html","title":"Hailey Baldwin flaunts abs playing tennis in her underwear","title_page":"Hailey Baldwin flaunts abs playing tennis in her underwear | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hailey Baldwin posted a rather cheeky video of herself winning a tennis match while wearing just her underwear on social media on Wednesday.\nThe daughter of actor Stephen Baldwin, 50, flaunted her stunning gym-honed physique as she simply captioned the video 'mood'.\nThe video, evidently shot on a warm Los Angeles evening, shows Hailey jesting with her friends as she tells the person shooting the video 'I won!'\nScroll down for video\nBaby got back(hand)! Hailey Baldwin, 20, posted a cheeky video of her playing tennis in just her underwear in Los Angeles, California on Wednesday\nWinning at life: The daughter of actor Stephen Baldwin, 50, flaunted her stunning gym-honed physique as she simply captioned the video 'mood'\nHer stylish monochrome Calvin Klein underwear, which first became popular in the 1990's, allowed her to display her toned, tanned pins and rock-hard abs.\nThe model appeared to be having fun as she joked with her pals, and looked fresh as she tied her flaxen locks off of her make-up free face.\nShe then swings her racket and whoops loudly with joy.\nHard work pays off: Her stylish monochrome Calvin Klein underwear, which first became popular in the 1990's, allowed her to display her toned, tanned pins and rock-hard abs\nSwing low! The model appeared to be having fun as she joked with her pals, and looked fresh as she tied her flaxen locks off of her make-up free face\nThe Cali girl is taking some much needed recovery time after a hectic week.\nOn Tuesday, she was seen running errands in a teeny mini dress that put her best assets on display.\nThe sweet striped Bardot shoulder dress displayed her lithe limbs, which glowed with a sun-kissed tan.\nTennis ace! She then swings her racket and whoops loudly with joy\nOrdinary girl: The sweet video shows Hailey's down-to-earth side\nHailey just preserved her modesty when her dress threatened to ride up in the wind in a Marilyn Monroe moment.\nShe kept comfortable in a pair of trendy white sneakers, and wore minimal make up and gold hoop earrings.\nWith her shoulder-length blonde bob blow-dried poker-straight, Hailey clutched her phone in her hand as she prepared for a busy day of running errands.\nLegs eleven! Hailey showed off her lithe pins in a cute striped Bardot shoulder dress as she clambered out of her Mercedes on Tuesday\nBusy bee: With her shoulder-length blonde bob blow-dried poker-straight, Hailey clutched her phone in her hand as she prepared for a busy day of running errands\nHailey has previously dated Canadian crooner Justin Bieber, 23, and romance appears to be on the cards for her and model/vlogger/actor Cameron Dallas, 22.\nThe pair first met on the set of a Carolina Herrera photo shoot in February, and they have been spotted together on numerous occasions ever since.\nWearing a pair of unusual green tracksuit bottoms with slits in them, Hailey dined with Cameron on Monday night.\nRumoured romance: Wearing a pair of unusual green tracksuit bottoms with slits in them, Hailey dined with model Cameron Dallas, 22, on Monday\nThe beauty appeared to be taking a much-needed R&R period after last weekend, where she danced away at Coachella festival in Indio, California.\nShe flaunted her phenomenal physique in a series of edgy outfits with plenty of crop tops to ensure that her toned abs were on display.\nThe desert festival has become something of a celebrity hotspot, with famous faces ranging from Victoria's Secret models to Brooklyn Beckham making an appearance.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447146/Hailey-Baldwin-flaunts-abs-playing-tennis-underwear.html"}
