{"authors":["Linda Tripp"],"date_download":"2018-10-30 19:14:19","date_modify":"2018-10-30 19:14:19","date_publish":"2016-11-29 14:03:49","description":"Arguably at no time since the aftermath of the Civil War has there ever been a time when unity in America was more critical. In a unique position to","filename":"data/vaneerConsumption/HailToTheThief.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-621519116.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_29__1540926859.html","title":"Hail To The Thief","title_page":"Hillary Clinton: Hail To The Thief","title_rss":"NULL","source_domain":"breitbart.com","text":"Arguably at no time since the aftermath of the Civil War has there ever been a time when unity in America was more critical. In a unique position to facilitate that unity, Hillary Rodham Clinton decided instead to champion divisiveness by actively questioning the outcome of the election. For those who intimately know and understand the Clinton Playbook, this is business as usual. There are never any real surprises with Hillary. For the President-elect who has been remarkably magnanimous concerning his erstwhile opponent, this divisive tactic will make his enormous job all the more difficult. And that is precisely the point.\nThe Hillary many of us know emerged by not emerging on election night. To the dismay of her supporters not only in Manhattan’s cavernous Javitz Center but across the entire country, she was a no show. Her loyal supporters had anticipated a victory, a blow out. All the networks, the print press, the pundits had virtually assured them of this. Yes, the grand fireworks display over the Hudson River had been inexplicably cancelled, but sunshine and lollipops would reign supreme anyway. Her victory was a foregone conclusion.\nAs election night became early morning, and as their friends at the networks were forced (in abject horror) to call the election in favor of her opponent, her supporters faced not jubilant victory but unthinkable yet indisputable defeat. They faced it alone. As they waited in vain for their candidate to appear, classic HRC is what they got.\n(Linda Tripp)\nForegoing a gracious and necessary personal appearance, she threw the wily John Podesta out on the stage. Best known for his emails, this odd choice of stand-in appeared pale, in visible shock and much like a marionette whose tangled strings had a mind of their own. His bizarre appearance left more questions than answers and his shaken performance seemed to suck all the oxygen out of the room. Clinton’s supporters were left with not only morose defeat but also a sense of abandonment as they wandered aimlessly out of the victory hall. As Donald Trump faced the enormity of his win, he gave a heartfelt, humble and gracious victory speech, one which in its inclusiveness was clearly meant to begin our national healing. Hillary’s voters across the country finally went to bed, monumentally let down by all of it. Their mistake was in believing she actually cared about all of them.\nAll this occurred due to a fundamental Hillary truth: It is first, last and always all about her. Period. It was never about her supporters in the hall or voters across the country. They are routinely forgotten once the votes are tallied and she resurrects their importance only if and when the next election approaches. They have always been nothing more than a means to an end. They are not living, breathing, feeling individuals.\nBy many reports, on election night this strong glass ceiling breaker was too busy crying inconsolably and pitching a less than presidential fit to give a fig about anyone else. Too distraught to appear, in the end this supposedly strong candidate who proudly touted the gender card became little more than a weak and tired cliché. At the risk of dating myself, she became less “I Am Woman, Hear Me Roar” and more “It’s My Party and I’ll Cry If I Want To,” and exposed once and for all the real woman behind the mask.\nAlways a bridesmaid, never a bride about sums it up when one looks at this election and that of 2008. Hillary was the odds-on favorite to win both times. In 2008 she couldn’t even clinch the nomination. She considered it stolen. In 2016, her opponent snatched victory from the jaws of defeat and in one fell swoop crushed a coronation. She was resoundingly defeated by an unlikely candidate who never served even one day of his 69 years in government service. It appears she is not quite ready to give up that crown.\nHer concession speech the day after the election began her attempt at rebuilding what was fast becoming her tattered legacy.\nWhen she finally appeared, she didn’t congratulate the President-elect, she didn’t throw her support behind him. Instead, she stated the obvious fact that “he will be our next president” and opined that we needed to give him a chance. After checking that requisite box for any losing candidate, she promptly fell back on her tired refrain of “women and girls” and glass ceilings, offering them hope for the future. While aspirational in its resonance, just about all women not named Hillary Clinton have long since known this artificial glass ceiling had been thoroughly and completely shattered years before.\nCountless Presidents and Prime Ministers, world leaders all, have been and are women. Some going back decades. For the sake of argument, we won’t even consider the female surgeons, pilots, astronauts, CEOs, elected officials and diplomats to name just a few both here and around the world who years later are still picking shards of glass out of their hairdos. Women have long since arrived at the pinnacle of power, they are just named something other than Hillary Rodham Clinton. Apparently they don’t count.\nToday we see a machination that many who know Hillary knew to expect. If one wonders if the less than impactful Jill Stein had a little “help” in her quest to challenge the election, wonder no more. That the Clinton campaign has joined forces to ensure “fairness” tells the whole story. Everyone questioned whether or not Donald Trump would accept the outcome of the election. With the pervasive corruption attributed to his opponent on so many fronts, he was wise to question a potentially rigged system.\nBut it was a question that if asked of one, should have been asked of the other. In an election cycle that was from all accounts preordained, no one bothered to ask Hillary. It might have been a good idea to run that one by her. On her plane following the debate, she opined on this subject as it pertained to her opponent. She characterized him dismissively in a denigrating way and blathered on about our democratic process, but failed to include herself in this equation. Now we know her answer. As many of us have always known, the rules always apply to everyone else but absolutely never apply to Hillary. We understood she would be the very last one to accept defeat, graciously or otherwise.\nThe fact is, Hillary Clinton still cannot comprehend or accept what she believes is an inconceivable outcome of the election. She never will. Her likeness was supposed to grace our currency decades in the future. That was the plan. Instead of leaving the national stage with grace and dignity, she is hanging on by her fingernails. This time she is using the inconsequential Jill Stein to do her public dirty work.\nLoath to exit the international arena, she will use every trick in the book in what will be a futile attempt to change the outcome of the election. She will not publicly participate, she will leave that to her now defunct campaign, ensuring her minions do it for her. Those minions have their marching orders, and in Hillary’s world, there is not a minion alive who would question her direct order. Not while there is a chance they could change the election and retake the White House.\nSo as the President-elect conducts a well-disciplined transition and prepares to lead the nation in a matter of weeks, the country will simply have to endure Hillary’s behind-the-scenes temper tantrum. With strains of “Hail to the Chief” echoing silently in her mind, all else pales for Hillary. Unity be damned. She’s going for it. Not for the good of the country. Never for the good of the country. It is for personal achievement, for personal gain, for personal riches. And that’s the gal I know.","url":"https://www.breitbart.com/politics/2016/11/29/hillary-clinton-hail-thief/"}
