{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:43:13","date_modify":"2018-10-31 01:43:13","date_publish":"2018-09-14 16:00:47","description":"Hailey Baldwin is young, in love, and not concerned about what anyone thinks about that. According to ELLE, Baldwin discussed her upcoming wedding to Bieber recently. And despite any concerns about her age, she's more than ready to get married.…","filename":"data/vaneerConsumption/HaileyBaldwinsAgeIsntAConcernInHerUpcomingMarriageToJustinBieber.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/5dc1550b-3622-46ab-826c-44576f6e911b-getty-1027960548.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_hailey-baldwins-age-isnt-a-concern-in-her-upcoming-marriage-to-justin-bieber-11917713_1540950193.html","title":"Hailey Baldwin's Age Isn't A Concern In Her Upcoming Marriage To Justin Bieber","title_page":"Hailey Baldwin's Age Isn't A Concern In Her Upcoming Marriage To Justin Bieber","title_rss":"NULL","source_domain":"bustle.com","text":"Hailey Baldwin is young, in love, and not concerned about what anyone thinks about that. According to ELLE, Baldwin discussed her upcoming wedding to Bieber recently. And despite any concerns about her age, she's more than ready to get married. Considering the fact that the young couple reportedly obtained a marriage license recently, per TMZ, are her comments yet another sign that a Baldwin/Bieber wedding is on the horizon?\nAccording to The Cut, Baldwin acknowledged she's on the younger side. However, she also said that getting married young is common among her family members. “My sister was 24 when she got married, and my parents also got married when they were young, too. I see no reason to wait. When you know it’s right, it’s right,” the model explained.\nBaldwin told The Cut that she even asked her parents' advice on getting married so young. Based on their response, it sounds as though they're going to welcome Bieber into the family with open arms. She said,\n\"I said to them [my parents], ‘You’d stop me if you didn’t think this was the right decision, right?' And they didn’t. I think they love him more than me!\"\nSo not only is Baldwin ready to tie the knot, it seems like her family is more than ready for her to do so as well.\nAs previously mentioned, Baldwin's comments come on the heels of a very interesting TMZ report. According to the publication, the model and her fiancé were spotted at a courthouse in NYC that issues marriage licenses on Sept. 13. That doesn't mean that the two are married yet, necessarily. As the Office of the City Clerk of NYC stated, couples must wait 24 hours to get married after obtaining a marriage license. So if they did actually obtain one, they wouldn't be able to say \"I do\" until Sept. 14. (Bustle previously reached out to reps for Baldwin and Bieber, but didn't receive an immediate response.)\nAlthough, since Baldwin said that she was ready to get hitched, maybe they decided to tie the knot sooner rather than later. Their Sept. 13 courthouse visit could have come after they already got a marriage license. As TMZ reported, a source claimed that Baldwin and Bieber met with a judge during their visit, which implies that they could have gotten married already. However, the publication also could not confirm that information. Until the husband and wife-to-be confirm any marriage news for themselves, one can only speculate about whether they exchanged vows or not. But given how open they've been with fans about their engagement, they'd likely announce the news soon, if so.\nPrior to TMZ's report and the new comments to The Cut, Baldwin and Bieber were reportedly going to get married sometime in 2019. A source told TMZ in early August that the couple was planning to tie the knot sometime next year. However, in light of this recent courthouse news, it's possible they decided to push their timeline up a little bit.\nAfter all, according to Baldwin herself, she's definitely ready to exchange vows. And to make the marriage move all the more exciting, she even has her parents' enthusiastic blessing to boot.","url":"https://www.bustle.com/p/hailey-baldwins-age-isnt-a-concern-in-her-upcoming-marriage-to-justin-bieber-11917713"}
