{"authors":["Nkayla Afshariyan For Daily Mail Australia"],"date_download":"2018-10-22 23:19:39","date_modify":"2018-10-22 23:19:39","date_publish":"2017-03-16 06:14:29","description":"Shazly Rasheed, 41,\nis the owner of Shazly Experience Hair and Wellness in New Zealand. The salon recycles everything possible, including her clients' cut hair.","filename":"data/vaneerConsumption/HairdresserwhorecycleseverythingincludingyourHAIR.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FEC4C00000578-0-image-a-13_1489625626433.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318046_Hairdresser-recycles-including-HAIR_1540250379.html","title":"Hairdresser who recycles everything including your HAIR","title_page":"Hairdresser who recycles everything including your HAIR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Have you ever wondered what happens to all the hair you get cut off when you go to the hairdressers?\nIf you ask nicely at one New Zealand salon, they'll give it back to you to take home!\nShazly Rasheed, 41, is the owner of Shazly Experience Hair and Wellness in Lower Hutt, the first purpose-built environmentally sustainable hair salon in the Wellington region.\nThe salon recycles everything possible, including your cut hair, which clients can take home for compost if they wish to.\nOwner of Shazly Experience Hair and Wellness, Shazly Rasheed, wanted to reduce her impact on the environment so she built a sustainable hair salon in New Zealand\nIn order to reduce their environmental footprint, the salon even recycles the cut hair off clients and gives the hair back for compost\nWHY IS HAIR GOOD FOR COMPOSTING? Human hair is a good source of nitrogen and studies have shown that clippings discarded from barbershops and hair salons can be a nutrient source for plants when combined with other compost materials.\nShazly said she didn't know that hair could be recycled until one of her clients told her.\n'A lot of my clients are gardeners by trade or like to garden as a hobby, so they told me about hair making a great compost,' she told Daily Mail Australia.\n'It's also a really good water retainer!'\n'I knew you could recycle plastic and cardboard, but I had to research that you could actually recycle hair.'\nThe mother-of-two is originally from the Maldives and has seen the effects of global warming first hand, watching small islands become flooded from the rising sea levels.\n'My son has allergies so that has also been part of the reason I want to be conscious of the products I use and my effect on the planet,' Shazly said.\nThe salon features energy efficient lighting to help reduce power demands\nThe salon has three recycling bins for plastic, used foils and hair, and also give away their old magazines to local medical centres once the salon gets new ones.\nShazly's salon is also green indoors, boasting plenty of beautiful live plants that give the salon a 'natural' feeling.\nThe salon was built within the redeveloped old Central Post Office in Lower Hutt, in New Zealand's North Island.\n'We were given a great opportunity to build a new salon from scratch in the old Post Office,' she said.\n'It was an empty shell so I had control over all the designs and what I wanted.'\nIt took nine months for the new salon to be built while Shazly researched how sustainable she could go.\nThe salon has plenty of greenery indoors to give the place a more 'natural' feeling\nThe purpose-built salon is well insulated and will host wellness talks run by Shazly\n'It is well insulated and has energy-efficient LED lighting to reduce power demands, water-saving devices have been installed, and a zero-waste policy,' she said.\nThe research Shazly put in for her salon stretched as far as buying new organic, vegan-friendly hair products that her staff trialed.\nShazly said her clients are really interested in her in her salon and how they're helping the environment.\nThe salon also aims to give back to the community by having staff nominate a person in the community who is deserving of a day of pampering.\n'If everyone does a little bit for the environment everyday, we can help slow climate change,' she said.","url":"https://www.dailymail.co.uk/femail/article-4318046/Hairdresser-recycles-including-HAIR.html"}
