{"authors":["Virginia Hale"],"date_download":"2018-10-30 19:04:01","date_modify":"2018-10-30 19:04:01","date_publish":"2016-12-17 16:34:54","description":"A fifth of Swedes have no confidence in the mainstream media, and half the country now gets most of their news from alternative sources.","filename":"data/vaneerConsumption/HalfofSwedesAvoidMainstreamMediaGetMostofTheirNewsfromAlternativeSites.json","image_url":"https://media.breitbart.com/media/2016/12/Medusa_1_November_2015_01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_12_17__1540926241.html","title":"Half of Swedes Avoid Mainstream Media, Get Most of Their News from Alternative Sites","title_page":"Half of Swedes Avoid Mainstream Media, Get Most of Their News from Alternative Sites | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A fifth of Swedes have no confidence in the mainstream media, and half the country now gets their news primarily from alternative sources, a new study has found.\nThe results of the study, for which a representative sample of 4,000 people were interviewed, make “grim reading” for Sweden’s media establishment, the news and marketing industry magazine Resumé notes.\nResearchers at the Stockholm School of Economics and market researcher company NEPA said the country is becoming increasingly divided with regards to where people get their news.\nHalf of those surveyed get their news primarily from sources other than the established media, and people in this group “are also very active in sharing content with others online via social media”. Twenty-one per cent of Swedes said they distrust the mainstream media altogether.\nLocal media reports that the gender distribution between the different groups is fairly evenly split, and that confidence in the establishment media is lowest in people between the ages of 35 and 54.\nThe study, which forms the beginning of a new research project, is funded by Sweden’s seven major media companies in the hope of understanding how they can attract news consumers who currently reject the mainstream media.\n“It shows that there is a group that’s very vocal in social media, and that sets the tone there. And there is a risk that we equate public opinion with what’s shared a lot and heard a lot,” Peter Wolodarski, editor of one of Sweden’s biggest newspapers, Dagens Nyheter, said of the survey results.\nUnder new plans unveiled by the government in November, current press subsidies — which are also available to alternative media outlets — will be abolished from 2018. With the media report grants set to replace subsidies, an “industry committee” consisting of mainstream media figures will be given the right to determine which competitors are granted taxpayers’ cash.\nFormer media commissioner Anette Novak said: “The government will not spend public money on media that do not line up on the values underlying the freedom of expression.”\nFria Tider commented that the new rules “serve to strengthen the regime-faithful” established media “against challengers in the so-called alternative media”.\nLast month, Sweden’s culture minister, Alice Bah Kuhnke, told Facebook that they must censor so-called “fake news” voluntarily or else face “compulsory measures” by the government.","url":"https://www.breitbart.com/europe/2016/12/17/half-swedes-avoid-msm-news/"}
