{"authors":["Ashleigh Davis For Daily Mail Australia"],"date_download":"2018-10-22 22:12:42","date_modify":"2018-10-22 22:12:42","date_publish":"2017-04-26 03:59:01","description":"A half-time song that references nuclear war played on Anzac Day in a match between Essendon and Collingwood has caused controversy with commentators labelling it a 'strange decision'.","filename":"data/vaneerConsumption/HalftimesonginAnzacDayAFLmatchcausescontrovery.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BBD5F00000578-0-image-a-22_1493172653909.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446076_Half-time-song-Anzac-Day-AFL-match-causes-controvery_1540246362.html","title":"Half time song in Anzac Day AFL match causes controvery","title_page":"Half time song in Anzac Day AFL match causes controvery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Commentators have questioned a song played at half time during the Anzac Day match between Collingwood and Essendon at the MCG, that references nuclear war.\nThe song Two Tribes by 80s British band Frankie Goes to Hollywood was played before the second half of the AFL game in Melbourne on Tuesday.\nThe song, whose title comes from the line 'when two great warrior tribes go to war', from the film Mad Max 2, played as the players walked onto the field, reported 3AW.\nCommentators have questioned a song played at half time during the Anzac Day match between Collingwood and Essendon at the MCG, that references nuclear war\n3AW sports commentator Bruce Eva said it 'didn't sit comfortably' with him.\nFellow commentator Dwayne Russell said he thought it was a 'strange' decision.\n'There's an argument about the war analogies with footy, I noticed that those actually within the service said they were OK last night, which was part of the pre-game, but a strange choice of song Frankie Goes To Hollywood Two tribes to me on Anzac Day.\n'Probably could be a little more respectful than that,' Mr Russell said.\nThe song Two Tribes by 80s British band Frankie Goes to Hollywood (pictured is the band) was played before the second half of the match in Melbourne on Tuesday\n3AW sports commentators Dwayne Russell (left) and Bruce Eva (right) questioned if the song was an appropriate choice to play on Anzac Day\nEssendon defeated Collingwood by 18 points in front of a crowd of 87,685 people.\nWhile both teams had dominant patches in the first three quarters, Essenson took a nine-point lead in the final term.\nThey then went on to kick three unanswered goals in the first nine minutes to take a 26-point lead, leading the game strongly until the end.\nDaily Mail Australia contacted the Melbourne Cricket Ground, the Australian Football League and Essendon Football Club for a comment.\nWhile Bruce Eva said it 'didn't sit comfortably' with him, Dwayne Russell described it as a 'strange' decision. Pictured are crowds outside the MCG before the match on Tuesday","url":"https://www.dailymail.co.uk/news/article-4446076/Half-time-song-Anzac-Day-AFL-match-causes-controvery.html"}
