{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:06:31","date_modify":"2018-10-30 22:06:31","date_publish":"2016-11-15 15:45:21","description":"Nearly half of the boys in the UK’s Young Offenders Institutions (YOIs) are from an ethnic minority group, new data has revealed.","filename":"data/vaneerConsumption/HalfofBoysinYouthJailsBlackorEthnicMinority.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-53460365.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_15__1540937191.html","title":"Half of Boys in Youth Jails Black or Ethnic Minority","title_page":"Half of Boys in Youth Jails Black or Ethnic Minority","title_rss":"NULL","source_domain":"breitbart.com","text":"Nearly half of the boys in the UK’s Young Offenders Institutions (YOIs) are from an ethnic minority group, data has revealed.\nThe survey was contained in a new report, out on Tuesday, which found that 47 per cent of boys imprisoned in YOIs in the year between 2015 and 2016 were identified as black or minority ethnic – a level not seen since 2001.\nIn the UK, a young offender is a criminal aged between 14 to 17 years old.\nMore than a third (37 per cent) had been through the care system, a fifth (22 per cent) were Muslim, 19 per cent had a disability, and seven per cent were of a Gypsy, Romany, or Traveller background.\nSuch groups “continued to be disproportionately over-represented” in YOIs when compared with the wider population, the report explains.\nIn secure training centres, a different type of custodial facility for children, the proportion identified as being from a black or minority ethnic background was 41 per cent, the survey also found.\nColin Allars, Chief Executive of the Youth Justice Board (YJB), which commissioned the report, said in a statement:\n“Parts of this report are uncomfortable to read – trends around safety are concerning. We will use these findings to support our work with providers of custodial services to address the issues children and young people are telling us about.\n“The YJB has a role in ensuring young people are looked after whilst in custody, and to do that effectively we must listen to their views.\n“We commission this independent survey because its findings are important in ensuring that the voices of children and young people in custody are heard and because it helps us to monitor the services provided to them.”\nChief inspector of prisons Peter Clarke told the Press Association: “Over the past decade the number of children in custody has fallen by some 66%, but the perceptions of those that remain leave us with some worrying and difficult issues to consider.\n“There are some particularly troubling findings in the areas of disproportionate over-representation (in terms of the characteristics of the children now being held in custody), safety, victimisation, respect and training.\n“I hope these findings are taken seriously by those charged with developing and improving policy.”\nA Ministry of Justice spokesman said: “These findings are concerning. The welfare of young people in custody is extremely important and the Justice Secretary has been very clear that we need to do more to improve safety and help offenders turn their lives around.\n“We will be setting out our plans to reform the way we manage young offenders in the coming weeks.”","url":"https://www.breitbart.com/europe/2016/11/15/half-boys-youth-jails-black-ethnic-minority/"}
