{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:33","date_modify":"2018-10-30 18:48:33","date_publish":"2015-06-22 03:00:46","description":"Despite a torrential downpour, about 500,000 people gathered Saturday in Rome under the banner of “Family Day,” protesting the LGBT agenda.","filename":"data/vaneerConsumption/HalfMillionGatherinRomeforMassiveProFamilyProtest.json","image_url":"https://media.breitbart.com/media/2015/06/Rome-Gay-Protest.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_21__1540925313.html","title":"Half Million Gather in Rome for Massive Pro-Family Protest","title_page":"Half Million Gather in Rome for Massive Pro-Family Protest | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Despite a torrential downpour, an estimated 500,000 people gathered Saturday in Rome under the banner of “Family Day,” protesting gender ideology and LGBT programs in schools and reaffirming the nature of marriage as the lifelong union of one man and one woman.\nThe piazza in front of the Cathedral of Saint John Lateran overflowed with participants of all ages from all over Italy, from Lombardy to Sicily. Estimates ranged from 400,000 to one million participants, making this the largest pro-family gathering in Italy’s history.\nRemarkably, some one hundred members of the Italian Parliament also showed up, beyond all expectation of the organizers of the gathering. There was, however, no special seating for politicians or celebrities to “underscore the non-partisan and a-political nature of the event.”\n“With this event we are asking respect and protection for the family founded on marriage and reaffirming the central role of parents,” said neurosurgeon Massimo Gandolfini, the spokesman of the movement “Defend our children!”\n“We forcefully reject the attempt to infiltrate educational projects into our schools aimed at deconstructing the sexual identity of children,” he said.\nThe grassroots event received little prior media attention, but after its overwhelming success, it occupied the front pages of all the Italian dailies on Sunday.\nAmong the protesters were many Catholics, as could have been expected, including the presence of priests and nuns. Archbishop Vincenzo Paglia, the president of the Vatican’s Pontifical Council on the Family, gave a special benediction for the event.\nBut in the crowd, as well, were many members of other faiths, and on the stage in Piazza San Giovanni, representatives of different religions took turns rallying the multitude, including delegates from the Evangelical Alliance and the head imam of the Mosque of Centocelle in Rome. The Chief Rabbi of Rome was not present but sent a message of encouragement that was read aloud at the event. A letter of support was also read from Agapo, an association of parents and friends of homosexuals.\nEarly last week, families in Italy’s northern region of Trieste complained of a taxpayer-funded elementary school program that included cross-dressing children so as to help them overcome so-called “gender stereotypes.” Parents also protested aggressive sex education programs for kindergarten students involving mutually touching.\nAnd later in the week, others in the city of Aprilia in central Italy joined their voices of protest, lamenting the LGBT agenda that was being forcibly introduced into high school curriculums against parents’s wishes. The programs included a film on “homophobic bullying,” mandatory attendance at a theatrical performance of two transsexuals, and asking the students whether they were absolutely certain that their parents were heterosexual.\nAlfredo Mantovano, a magistrate and former Undersecretary of the Interior, led the crowds in shouting a loud “no” to adoption by homosexual couples. “Hurting the family means hurting Italy and for some time the family has been under attack,” he said.\n“Be careful of the laws,” warned former Parliamentarian Mario Adinolfi, adding that a current bill to legalize civil unions would grant “substantial legitimacy to wombs for rent.” Gender ideology would like to convince you “that male and female roles are interchangeable,” he said.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/national-security/2015/06/21/half-million-gather-in-rome-for-massive-pro-family-protest/"}
