{"authors":["John Benny"],"date_download":"2018-10-30 23:05:08","date_modify":"2018-10-30 23:05:08","date_publish":"2018-07-23 00:00:00","description":"Halliburton's North America revenue spiked 34% versus a year ago as US producers put more oil rigs to work.","filename":"data/vaneerConsumption/Halliburtonsrevenuespikes.json","image_url":"https://amp.businessinsider.com/images/5b55c51877bc2827008b4599-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_halliburton-earnings-revenue-spikes-2018-7_1540940708.html","title":"Halliburton's revenue spikes","title_page":"    Halliburton earnings: Revenue spikes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Halliburton CEO Jeff Miller Reuters/Daniel Kramer\n(Reuters) - Oilfield services provider Halliburton Co's quarterly revenue rose 24 percent to beat analysts' estimates on Monday as higher oil prices encouraged U.S. oil and gas producers to put more rigs to work.\nU.S. rig count, an early indicator of future output, stood at 858 in the week to July 20, according to a Baker Hughes report, up from 764 a year earlier, as energy companies ramp up production in anticipation of higher prices in 2018.\nMargins in U.S. onshore operations are closing in on what the company achieved during the previous peak in 2014, Halliburton Chief Executive Jeff Miller said in a statement.\nHalliburton's North America revenue rose 38.4 percent to $3.83 billion, while revenue from its international business increased 6 percent to $2.31 billion.\nThe company's total revenue rose to $6.15 billion from $4.96 billion.\nNet profit attributable to Halliburton rose to $511 million, or 58 cents per share, in the second quarter ended June 30, from $28 million, or 3 cents per share, a year earlier.\nThe company took a charge of $262 million in the year-ago quarter.\nExcluding one-time items, the company earned 58 cents per share, in line with Wall Street estimate, according to Thomson Reuters I/B/E/S.\n(Reporting by John Benny in Bengaluru; Editing by Maju Samuel)","url":"https://www.businessinsider.com/halliburton-earnings-revenue-spikes-2018-7"}
