{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:20:56","date_modify":"2018-10-30 21:20:56","date_publish":"2016-05-04 19:57:09","description":"TEL AVIV - In provoking the Israel Defense Forces along the Israel-Gaza border, Hamas seems to be testing Israel’s military and political response to the possibility of another outbreak in the south | Israel / Middle East","filename":"data/vaneerConsumption/HamasTestingIsraelsPreparednessforWarShowingDesperationwithProvocativeCrossBorderAttacks.json","image_url":"https://media.breitbart.com/media/2016/03/wi/afp_28d2d7207c3899aa74fab4637b154edfcd91ed01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_04__1540934456.html","title":"Hamas Testing Israel’s Preparedness for War, Showing Desperation with Provocative Cross-Border Attacks","title_page":"Hamas Testing Israel’s Preparedness for War, Showing Desperation with Provocative Cross-Border Attacks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – In provoking the Israel Defense Forces along the Israel-Gaza border, Hamas seems to be testing Israel’s military and political response to the possibility of another major outbreak of war in the south.\nGaza’s Islamist rulers are also clearly sending a message to Egypt and Palestinian Authority President Mahmoud Abbas that Hamas must be part of any future accommodation regarding border security along the coastal enclave. The Egyptians have been mediating reconciliation talks between Fatah and Hamas with Palestinian Authority President Mahmoud Abbas’ Fatah Party eyeing a security presence along the Gaza-Egypt border. Abbas is due in Egypt next week for consultations.\nOver the last 24 hours, Hamas militants fired at least six times at IDF forces searching for terror tunnels along the Israel-Gaza border. The Israel Air Force retaliated by firing at Hamas targets in Gaza on Wednesday.\nHamas’s escalation seems to be further aimed at signalling that it is willing to take risks to prevent the IDF from destroying the terror tunnels, which are critical to Hamas’s battle-plans and regional power.\nHamas is also increasingly desperate as its economy is on the brink of collapse, and it may be using the violence to send a message to Israel and the international community that the Islamist group is willing to draw Israel into conflict if Hamas’s financial needs are not met. Renewed hostilities would also help to redirect Palestinian anger away from Hamas’s own failing government and toward the Jewish state.\nOn Wednesday, Haaretz reported on the escalation:\nThe shootings from Gaza are directed toward Israeli operations to locate tunnels near the border fence. No Israeli casualties were reported. Defense sources assess that the shootings have been perpetrated by Hamas with the aim of deterring Israel from searching for more tunnels. The IDF declared the border area a closed military zone on Wednesday, barring access from Saad Junction and the Kibbutz Nahal Oz to anyone but residents.\nThe clashes come about two weeks after the IDF announced the discovery of a Hamas terror tunnel that snaked into Israeli territory. The fact that Hamas risked digging such a terror tunnel into Israel shows that Gaza’s Islamist leaders are preparing for the possibility of war with the Jewish state.\nAs I explained at the time:\nHamas has recently been weakened by successful Egyptian military actions to take out smuggling tunnels along the Egypt-Gaza border. It has not yet fully recovered from the massive damage inflicted by the IDF on the Islamic group’s militant infrastructure during the 2014 Israel-Gaza War. Hamas most likely does not want a war with Israel in the near future, fearing an Israeli military campaign can threaten its rule in Gaza. However, there is a paranoid wing within the Hamas leadership that believes Israel will launch a confrontation in Gaza at some point to further minimize Hamas’s political and militant positions. And so Hamas seems to be prepping all fronts for a war that could break out tomorrow, next week, next month, or next year.\nAs part of this readiness campaign, it seems Hamas not only took the daring move to dig a tunnel into Israel, but continues its brazenness by launching cross-border attacks.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2016/05/04/hamas-testing-israels-preparedness-war-provocative-cross-border-attacks/"}
