{"authors":["Ali Waked"],"date_download":"2018-10-30 20:59:19","date_modify":"2018-10-30 20:59:19","date_publish":"2017-02-15 23:03:42","description":"Elements in Hamas' political leadership have expressed concern that the election of a hardline militant as leader of the Islamic movement may","filename":"data/vaneerConsumption/HamasFearMilitantTakeoverAfterTopCommandersVictory.json","image_url":"https://media.breitbart.com/media/2017/02/Yehiyeh-Sinwar.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_15__1540933159.html","title":"Hamas Fear Militant Takeover After Top Commander's Victory","title_page":"Hamas Fear Militant Takeover After Top Commander's Victory","title_rss":"NULL","source_domain":"breitbart.com","text":"Elements in Hamas’ political leadership have expressed concern that the election of a hardline militant as leader of the Islamic movement may jeopardize its recent diplomatic efforts to thaw relations with Egypt and could precipitate a more extremist approach toward the region.\nYehiyeh Sanwar, co-founder of Hamas’ military wing, has been announced as the winner of an internal vote for the party leadership. He was jailed by Israel on terrorism charges in 1988 and released in 2011 in a prisoner exchange deal, after which he returned to leadership positions among Gaza’s so-called military wing, making his way to the top.\nUntil his election, Sanwar served as the diplomatic leadership’s liaison officer to the “military wing,” which refers to Hamas’s Izz ad-Din al-Qassam Brigades, which oversees Hamas’s terrorist operations.\nA top Hamas official told Breitbart Jerusalem that several Hamas strongmen were eliminated in the first round. Among them were former Foreign Minister Mahmoud al-Zahar, Deputy Speaker of Parliament Mahmoud Bahar, as well as Rawhi Mushtaha, Yehyeh Moussaa, Salem Salama and others.\nTo assuage the blow to the civilian leadership, Al-Zahar and Bahar were admitted to the diplomatic council, Hamas’ highest legislative body, as unelected members.\nSanwar’s rivals within Hamas fear he would prioritize the so-called military wing’s agenda, the official said, sharing sentiments expressed by other Hamas members considered closer to the political wing of the movement.\n“The military wing seeks first and foremost to bolster Hamas’ military power, which may entail closer relations with Iran, the wing’s chief sponsor, and the Islamic State in Sinai, which facilitates the passage of the funding,” he said, speaking in Arabic. “It may undermine Hamas’ tremendous efforts made lately to sidle up to several countries in the region, chiefly Egypt. Renewing ties with IS means delivering a death blow to the thaw with Egypt, and going back into the Iranian orbit would spell the end of Hamas’ support from Turkey and Qatar, as well as potential support from Saudi Arabia.”\nAlso, he said, “Sanwar spent 23 years in Israeli jail. He is very committed to his old comrades, like his friend Hassan Salameh. His defining experience as a prisoner may encourage him to play up demands for future prisoner swaps with Israel, and perhaps opt for other attempts to kidnap Israelis, which will entail an Israeli retaliation that will be devastating for the Strip.”\nHowever, he said, Sanwar may surprise many as a leader. “Many believe that once in a leadership position he will be aware of the complexity of the situation, and will not restrict his focus to the military wing and the prisoners, but also pay attention to people’s daily needs. We may end up with a pragmatic Sanwar.”","url":"https://www.breitbart.com/middle-east/2017/02/15/elements-hamas-fear-militant-takeover-top-commanders-leadership-victory/"}
