{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:32:52","date_modify":"2018-10-30 19:32:52","date_publish":"2017-05-01 14:56:43","description":"TEL AVIV - Gaza-based terror group Hamas on Sunday thanked North Korea for its support of the group's war against the \"Zionist entity.\"","filename":"data/vaneerConsumption/HamasThanksNorthKoreaforSupportingPalestiniansStruggleAgainstIsrael.json","image_url":"https://media.breitbart.com/media/2016/01/GettyImages-463501196.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_05_01__1540927972.html","title":"Hamas Thanks North Korea for Supporting 'Palestinians' Struggle' Against Israel","title_page":"Hamas Thanks North Korea for Supporting 'Palestinians' Struggle' Against Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Gaza-based terror group Hamas on Sunday thanked North Korea for its support of the group’s war against the “Zionist entity,” saying that Israel was “the leader of evil and terrorism in the world.”\n“Hamas appreciates North Korea statement in which it supported the Palestinians’ struggle and rejected the continuation of occupation,” the terror group’s spokesman Sami Abu Zuhri wrote on his Twitter page.\n“Hamas (rejects) Israeli abuse of North Korea and confirms that Israel is the leader of evil and terrorism in the world.”\nAbu Zuhri’s remarks followed North Korea’s condemnation of Israel as the “only illegal possessor of nukes in the Middle East under the patronage of the U.S,” according to a statement released by the country’s Foreign Ministry.\nThe harsh reproof was the result of Defense Minister Avigdor Liberman’s words last week calling the North Korean leadership “crazy.”\n“Kim Jong-un is an ally of Assad. From North Korea, through Iran, to Syria and Hezbollah,” Liberman told Walla news site, noting that North Korea’s only aim was “undermining global stability,” and adding that the country’s leadership was “a crazy and radical group.”\nHe added that the country’s recent nuclear tests were “crossing a red line” and its nuclear weapons program posed an even bigger global threat than Iran.\n“We’re just ahead of a new era of accurate missiles and unconventional weapons in the hands of irrational people,” Liberman said.\nPyongyang said Liberman’s “rash and malicious” comments were a “cynical ploy” to divert attention from the occupation “of the Arab territories” and “crimes against humanity.”\n“Our consistent message is to mercilessly punish those who offend the dignity of our leadership,” the statement said, before continuing with a veiled threat, “We warn Israel to think twice about the implications of its defamation campaign against us.”\nSome Israeli ministers slammed Liberman for his comments, saying the defense minister was dragging Israel into another conflict.\nAccording to Israel Radio, top cabinet members who asked to remain anonymous said Liberman would do well to focus his energy on national security and not open his mouth so much.\n“We have nothing to do with North Korea, so why jump up?” one minister reportedly said according to a translation from the Times of Israel. “Don’t we have enough enemies?”\nMK Shelly Yachimovich of the Zionist Union remarked on Twitter: “We have enough enemies. Let’s focus on them.”","url":"https://www.breitbart.com/middle-east/2017/05/01/hamas-thanks-n-korea-for-its-support-of-palestinian-cause-against-evil-occupation-israel/"}
