{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:08:06","date_modify":"2018-10-30 21:08:06","date_publish":"2017-03-27 12:17:13","description":"Hamas shut the border crossing between the Gaza Strip and Israel following the assassination of one of its senior commanders, Mazan Fukha.","filename":"data/vaneerConsumption/HamasClosesGazaBorderAfterAssassinationofSeniorCommander.json","image_url":"https://media.breitbart.com/media/2016/10/gaza-border-fence.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_27__1540933686.html","title":"Hamas Closes Gaza Border After Assassination of Senior Commander","title_page":"Hamas Closes Gaza Border After Assassination of Senior Commander","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Hamas shut down the border crossing between the Gaza Strip and Israel on Sunday following the assassination of one of its senior commanders, Mazan Fukha.\n“The closure is being implemented as part of the steps taken by Hamas security forces as a result of the crime of the assassination of Mazan Fukha,” the spokesman for the Interior Ministry said in a post on his official Facebook page.\nThe border closure was part of an attempt to stop Fukha’s assassins from leaving the Strip. Hamas also closed the Rafah border crossing with Egypt and banned local fisherman from going out to sea.\nHebrew-language news site nrg quoted Hamas spokesman Fauzi Barhoum saying that the Mossad was responsible for Fukha’s death, warning that the Gaza-based terror group will seek vengeance.\n“The response will be shocking and will hit the heart of Tel Aviv,” Barhoum said.\nAccording to Ynet news site, new Hamas leader Yahya Sinwar could have ordered the killing due to suspicion that Fukha was collaborating with Israel. To date, Sinwar has assassinated more than ten suspected collaborators.\nMeanwhile, the IDF instructed farmers in southern Israel not to approach the security fence along the Gaza border, nrg said.\n“This is just a precautionary measure,” an anonymous defense source told nrg. “We are always keeping our fingers on the pulse; we’re not closing our eyes to anything.”\nFukha, a commander in Hamas’ military wing, the Izz ad-Din al-Qassam Brigades, was shot and killed outside his Gaza City home on Friday night. He served nine years of a life sentence in an Israeli prison for planning a 2002 suicide bombing that left nine dead and 39 others injured before being released as part of the 2011 prisoner exchange deal for IDF soldier Gilad Shalit.\nA spokesman for the Izz ad-Din al-Qassam Brigades reiterated Hamas’ bloodlust, saying, “the enemy will pay a price for this crime that is equal in size to the assassination of our martyr leader. He who plays with fire will be burned by it.”","url":"https://www.breitbart.com/middle-east/2017/03/27/hamas-closes-gaza-border-after-assassination-of-senior-commander/"}
