{"authors":["Jerome Hudson"],"date_download":"2018-10-30 20:27:28","date_modify":"2018-10-30 20:27:28","date_publish":"2016-11-21 23:36:08","description":"Social media users blasted actor Brandon Victor Dixon, who lectured Vice President-elect Mike Pence from the stage Friday night.","filename":"data/vaneerConsumption/HamiltonStarUnderFireforRacistSexistTweets.json","image_url":"https://media.breitbart.com/media/2016/11/BrandonVictorDixonTweets.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_11_21__1540931248.html","title":"'Hamilton' Star Under Fire for 'Racist,' 'Sexist' Tweets","title_page":"'Hamilton' Star Under Fire for 'Racist,' 'Sexist' Tweets","title_rss":"NULL","source_domain":"breitbart.com","text":"Hamilton actor Brandon Victor Dixon, who lectured Vice President-elect Mike Pence Friday from the Broadway stage about fears of bigotry under a Trump presidency, is under intense fire for sexually suggestive tweets some social media users have called racist and sexist.\nIn a March 2012 tweet, Dixon wrote, “St. Patty’s day weekend is like Christmas for black dudes who like white chicks. Happy holidays boys.”\nSt. Patty's day weekend is like Christmas for black dudes who like white chicks. Happy holidays boys. @reesewaters#seasonsgreetings — Brandon Victor Dixon (@BrandonVDixon) March 17, 2012\nIn June 2013, Dixon responded to a Twitter user’s tweet about how professional football players used to simply play on Sundays, have casual sex, and get paid.\n@TAMIKASLAWRENCE the problem is ho's aren't what they used to be. If ho game would step up, cats wouldn't get distracted. — Brandon Victor Dixon (@BrandonVDixon) June 27, 2013\nDixon referred to a woman as a “ho,” often considered a degrading term.\nIn July 2013, Dixon retweeted a user’s sexually-charged tweet in an apparent reference to Florida teenager Trayvon Martin, who was shot and killed by George Zimmerman in 2012.\n“@jleefilm: 4 every racist comment I get about Trayvon Im going 2 turn 1 white married suburban housewife & mother n2 a jump off” The. Best. — Brandon Victor Dixon (@BrandonVDixon) July 18, 2013\nThe phrase “jump off,” is a euphemism for a casual sex partner.\nAfter Dixon’s tweets resurfaced, some social media users saw them as a glorification of sexual assault and racism against white people.\n@Ahurastan @BrandonVDixon @TAMIKASLAWRENCE this guy has 2go . No more putting on makeup and playing dress up. You racist, misogynistic fuck — Ennead (@MrDickTrickle) November 20, 2016\n@BrandonVDixon @Cernovich @TAMIKASLAWRENCE This is highly offensive to women! When do I get to lecture you in front of a trapped audience? — Kathy💕🇺🇸 (@Kathrynjeansays) November 20, 2016\n@BrandonVDixon @TAMIKASLAWRENCE Wow…real classy. Especially the tweet advocating the rape of drunk white women being x-mas for black men. — Deplorable Wiggleman (@harleytime1) November 20, 2016\n@BrandonVDixon @TAMIKASLAWRENCE say goodbye to your illustrious Broadway career. — Ali DiSti 🇺🇸 (@alidisti) November 20, 2016\nDixon lectured Pence Friday from the Broadway stage, saying he and the Hamilton cast were “alarmed and anxious” about the incoming Trump administration.\n“We, sir, are the diverse America who are alarmed and anxious that your new administration will not protect us, our planet, our children, our parents, or defend us and uphold our inalienable rights,” Dixon said as the audience cheered.\nSocial media users are now calling Dixon a hypocrite for demanding civility and tolerance from Pence and Trump, after using demeaning and misogynistic language to describe women.\n@BrandonVDixon @TAMIKASLAWRENCE This is the guy that was lecturing our VP elected Pence?? WOW! Go check yourself in the mirror FRAUD! — M. Ramirez🇺🇸 (@Hopes119) November 21, 2016\n@HamiltonMusical supports @BrandonVDixon a misogynist who refers to woman as ho's and easy targets. #betheplaystheraceandvictimcard — Shawn (@ShawnSolo_) November 20, 2016\n@BrandonVDixon @TAMIKASLAWRENCE trashy tweet from a trashy guy, yet you self righteously lecture VP elect Pence.. — William Pierce (@whitebeauty88) November 21, 2016\n@BrandonVDixon @HamiltonMusical Looks like your \"star\" is just another fraud and con artist. So much for respect for others. Fire him — Beau Craig (@beau_craig) November 20, 2016\n@BrandonVDixon @TAMIKASLAWRENCE this guy is a peace of shit who calls woman HO's and he brags about that. Typical — The Ronin™ (@LCMee24) November 21, 2016\n@BrandonVDixon << isnt this the great #boycottHamilton spokesman for equality and diversity? @jleefilm — Sandraن We Are Media (@SandraTXAS) November 21, 2016\n@BrandonVDixon @jleefilm you are a piece of trash — Bill Jones (@Rigel860) November 21, 2016\n@BrandonVDixon @jleefilm you have no right to lecture a great man. You are a racist sexist hypocrite.#hamilton pic.twitter.com/ezCwE2L33D — PEPE SILVA (@Uncle_d_bags) November 21, 2016\n@BrandonVDixon @jleefilm how is this comment the best?Comments like this r what perpetuates violence,creates fear & thus racism exists. Smh — Pookie (@godssunflowr73) November 21, 2016\n@BrandonVDixon @jleefilm 4 every retweet this racist,misogynist predatory statement gets,1 step closer to losing jobhttps://t.co/36XOmnKKD1 — Tony Shea (@Sheasy64) November 21, 2016\nPresident-elect Trump demanded an apology from the cast and the popular Broadway show.\n“The Theater must always be a safe and special place.The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!” Trump tweeted Saturday.\nDixon appeared on CBS This Morning on Monday and said “There’s nothing to apologize for.”\nFollow Jerome Hudson on Twitter: @JeromeEHudson","url":"https://www.breitbart.com/entertainment/2016/11/21/hamilton-star-lectured-pence-fire-racist-sexist-tweets/"}
