{"authors":["Jerome Hudson"],"date_download":"2018-10-30 20:27:10","date_modify":"2018-10-30 20:27:10","date_publish":"2016-11-21 20:42:22","description":"Brandon Victor Dixon said Monday that there was \"nothing to apologize for\" after he lectured Pence from the Broadway stage this weekend.","filename":"data/vaneerConsumption/HamiltonActorRefusestoApologizeforLecturingMikePence.json","image_url":"https://media.breitbart.com/media/2016/11/BrandonVictorDixon1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_11_21__1540931230.html","title":"'Hamilton' Actor Refuses to Apologize for Lecturing Mike Pence","title_page":"'Hamilton' Actor Refuses to Apologize for Lecturing Mike Pence","title_rss":"NULL","source_domain":"breitbart.com","text":"Hamilton actor Brandon Victor Dixon says he does not plan to apologize to Vice President-elect Mike Pence for lecturing him from the Broadway stage on Friday night.\n“There’s nothing to apologize for,” Dixon said during a Monday appearance on CBS This Morning.\n“The producers, the creators, and the cast, we recognize that Hamilton is an inherently American story told by the definition of an American community; we are men and women of different colors, creeds, and orientations,” Dixon said. “The resonant nature of the show throughout the world, throughout the global community, demands that we make statements when there are important issues facing us as a community, so we wanted to stand up and spread a message of love and of unity.”\nPence was booed upon entering the Richard Rodgers Theater in New York City, where the popular Broadway musical is performed.\nToward the end of the show, as Pence was exiting the theater, Dixon demanded that Pence listen to his lecture about how a “diverse America” is “alarmed and anxious” about the incoming Trump administration.\n“We, sir, are the diverse America who are alarmed and anxious that your new administration will not protect us, our planet, our children, our parents, or defend us and uphold our inalienable rights,” Dixon said.\nPresident-elect Donald Trump criticized the cast of the show and demanded an apology on Twitter over the weekend.\n“The Theater must always be a safe and special place.The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!” Trump tweeted Saturday.\nHowever, Pence said he wasn’t offended by the stunt and reportedly said the boos and cheers he received is “what freedom sounds like.”\nSocial media users were less forgiving, as #BoycottHamilton became a top trend on social media over the weekend.\nNevertheless, Dixon said the cast of Hamilton had extended an invitation to Trump and Pence to meet and have a conversation.\n“Art is meant to bring people together,” Dixon said, adding: “Vice President-elect Mike Pence, please, come have a conversation with us.”\nFollow Jerome Hudson on Twitter: @JeromeEHudson","url":"https://www.breitbart.com/entertainment/2016/11/21/hamilton-actor-refuses-apologize-harassing-mike-pence/"}
