{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 23:31:05","date_modify":"2018-10-22 23:31:05","date_publish":"2017-03-16 07:06:38","description":"Hamish Blakes squeezes into a tight latex cat suit","filename":"data/vaneerConsumption/HamishBlakesqueezesintoatightlatexcatsuit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E521CF100000578-0-image-a-29_1489643373924.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318766_Hamish-Blake-squeezes-tight-latex-cat-suit_1540251065.html","title":"Hamish Blake squeezes into a tight latex cat suit","title_page":"Hamish Blake squeezes into a tight latex cat suit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As one of Australia's most popular comedians, he's made a career out of his sense of humour.\nAnd Hamish Blake was once again in fine form on Wednesday.\nThe 35-year-old radio star squeezed into a very tight latex catsuit to play iconic female superhero Catwoman, posting the hilarious results on Instagram.\nScroll down for video\nClaws out! Radio star and comedian Hamish Blake squeezed into a very tight latex catsuit to play iconic female superhero Catwoman, posting the hilarious results on Instagram\nIn the funny snap, the father of one holds his hands out into claws and poses in front of a white screen.\n'Super secret photo shoot today with this babe,' Hamish began his post.\n'Because the project is so classified, I have had to obscure their identity. I can't wait to tell you who it is though, they were so down to earth (unexpected) and we actually had tons in common. #honoured #DOmeetyourheroes,' he added.\nFamily: Hamish and wife Zoe Foster Blake (pictured in February), share one young son, Sonny, two\nHamish and wife Zoe Foster Blake, share one young son, Sonny, two.\nThe pair are expecting another child, with Zoe sharing an equally funny Instagram post to announce their happy news in early February.\nAfter singer Beyonce made headlines for posing in her bra and undies in front of a flower wall to announce she's expecting twins, Zoe did her own take on the shot.\nBaby joy: The pair are expecting another child, with Zoe sharing an equally funny Instagram post to announce their happy news in early February\nInspiration: After singer Beyonce made headlines for posing in her bra and undies in front of a flower wall to announce she's expecting twins, Zoe did her own take on the shot\n'When @beyonce and I fell pregnant at the exact same time, we were so happy,' she wrote in her post.\n'We made a best friend pact to announce the news with high-concept, oversaturated (sic) floral imagery and mismatched lingerie on the SECOND of February.'\nShe added: 'But not only did my \"best friend\" announce her pregnancy on the FIRST of February, she added an extra baby to make sure HER announcement was more special. Unfortunately, as you can see, news of her betrayal came through mid-photo shoot, but you get the gist.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318766/Hamish-Blake-squeezes-tight-latex-cat-suit.html"}
