{"authors":["Press Association"],"date_download":"2018-10-22 23:36:54","date_modify":"2018-10-22 23:36:54","date_publish":"2017-03-16 07:33:09","description":"Labour have warned the Chancellor he is now facing a £2 billion \"black hole\" in his Budget.","filename":"data/vaneerConsumption/HammondNationalInsuranceUturnnecessarytomaintainvoterstrust.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-227105-1489649595-631_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319110_Hammond-National-Insurance-U-turn-necessary-maintain-voters-trust_1540251414.html","title":"Hammond: National Insurance U-turn necessary to maintain voters´ trust","title_page":"Hammond: National Insurance U-turn necessary to maintain voters´ trust | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The humiliating U-turn over the National Insurance hike was necessary to maintain voters’ trust, Philip Hammond said as he sought to protect his position.\nThe Chancellor was forced into an extraordinary about-turn after coming under pressure from Tory backbenchers and business groups to drop the hike in contributions from the self-employed, just a week after it formed one of the main measures in his first Budget.\nThe move provoked uproar in the Commons, with Labour warning that he was now facing a £2 billion “black hole” in his Budget plans.\nThe Tories are in chaos as their Budget lies in tatters. They've U-turned on a £2bn tax rise, leaving a black hole in their plans. RT ↓ pic.twitter.com/DrA4gN3eVc — The Labour Party (@UKLabour) March 15, 2017\nHowever among Conservative MPs there was relief ministers had abandoned a measure which they believed not only breached a manifesto pledge but would also hit traditional Tory supporters.\nMr Hammond acknowledged the concern about the manifesto promise in an article for the Sun, which had campaigned against what it dubbed the “strivers’ tax”.\n“Trust matters in politics. And this Conservative Government sets great store in the faith and trust of the British people,” he said.\nHe insisted the measure was consistent with the tax pledges made in the 2015 election manifesto, and the legislation which followed only referred to the main rate of National Insurance for employees.\nBut he added: “For the Prime Minister and me, it’s not enough simply to meet to stay within the letter of our tax lock law. It’s important that we meet the spirit of our commitment as well.”\nNews that the policy had been abandoned came in a letter to Conservative MPs released just 20 minutes before Theresa May’s weekly appearance at the Commons Despatch Box for Prime Minister’s Questions.\nPhilip Hammond's letter to Conservative MPs\nThe Prime Minister’s official spokesman said Mrs May and Mr Hammond had agreed the move at a meeting earlier in the morning.\nThe Chancellor said he would fully fund the cost of reversing the rise – which would have raised £2 billion over four years – in the autumn Budget.\nShadow chancellor John McDonnell said the Government was in “chaos” and called on Mr Hammond to apologise.\nThe Tories have been forced to U-turn over their broken promise – and now the Tory Budget lies in tatters. Here’s @johnmcdonnellMP ↓ pic.twitter.com/Zh9inLAtlw — The Labour Party (@UKLabour) March 15, 2017\nEarlier, at PMQs, the SNP’s Westminster leader Angus Robertson said Mrs May had been forced into a “screeching embarrassing U-turn”.\nThe Chancellor, who sat alongside Mrs May in the Commons, had argued that the increase in Class 4 NICs had been necessary to address the growing unfairness in the National Insurance system in the treatment of employees and the self-employed.\nChancellor Philip Hammond and Prime Minister Theresa May listen to Shadow Chancellor John McDonnell speaking in the House of Commons\nIn his letter, he said he would still go ahead with the abolition of Class 2 NICs for the self-employed from April 2018, which his predecessor George Osborne announced.\nHowever, he said that a planned consultation - due to be carried out over the summer - looking at the different parental benefit entitlements enjoyed by employees and the self- employed would be widened to look at other areas of different treatment.\nIt will be carried out alongside the review by RSA chief executive Matthew Taylor, a former adviser to Tony Blair, of the implications of different ways of working for employment rights.","url":"https://www.dailymail.co.uk/wires/pa/article-4319110/Hammond-National-Insurance-U-turn-necessary-maintain-voters-trust.html"}
