{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-23 05:36:15","date_modify":"2018-10-23 05:36:15","date_publish":"2017-04-26 17:00:54","description":"Simon Shaw, pictured, received a 12 month sentence at Winchester Crown Court after he admitted engaging in sexual activity with a girl under 16 in Andover, Hampshire.","filename":"data/vaneerConsumption/Hampshirepaedophileteacherjailedforsexwithapupil.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/17/3FA0B58C00000578-0-image-a-7_1493222446976.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448272_Paedophile-teacher-42-jailed-sex-pupil_1540272975.html","title":"Hampshire paedophile teacher jailed for sex with a pupil","title_page":"Hampshire paedophile teacher jailed for sex with a pupil | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Simon Shaw, pictured, was jailed for 12 months after he admitted engaging in sexual activity with a child\nA disgraced teacher who 'took away the innocence' of a young girl he groomed for sex has been jailed for a year.\nSimon Shaw, 42, will also be forced to sign the sex offenders' register for 10 years, but the family of his victim has branded the sentence 'disgusting' and said Shaw 'ruined her life'.\nJudge Keith Cutler handed down a 12 month jail sentence at Winchester Crown Court, Hampshire, after Shaw - who was a teacher at Andover Education Centre in Andover - admitted engaging in sexual activity with a child.\nSpeaking after the hearing, the victim's mother, said: 'I think the sentence is disgusting. One year does not reflect what an awful time our family has had; it's been a nightmare.\n'My daughter has had a very difficult time dealing with what happened to her. She genuinely thought he loved her.\n'He took her innocence away from her and he gets one year for that. We are disappointed with the sentence and we are going to try to move on with our lives, but how do you recover from that?\n'She was vulnerable. You think your child is going to be safe and she wasn't, she was groomed. He ruined her life.'\nAndover Education Centre works in partnership with secondary schools in the area to provide education for pupils who are not in mainstream schooling.\nShaw was a teacher at the Andover Education Centre in Hampshire, pictured, at the time of the offences. He was also given a restraining order to keep him away from the young girl\nShaw, of Chute, Wiltshire, was also given a restraining order forcing him to stay away from the victim, who was under 16 and cannot be named for legal reasons, and her family.\nDetective Constable Timothy McSpadden, of Hampshire Constabulary, said: 'Shaw embarked on an inappropriate relationship with a child.\n'These offences are taken extremely seriously and this is reflected in the fact that Shaw has now received a custodial sentence.'","url":"https://www.dailymail.co.uk/news/article-4448272/Paedophile-teacher-42-jailed-sex-pupil.html"}
