{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 22:52:40","date_modify":"2018-10-22 22:52:40","date_publish":"2017-03-10 01:34:11","description":"Claire Hovey, 32, from Winchester, Hampshire, and boyfriend Chris Edwards (pictured together), also 32, have been live-in carers for his mother, who has Parkinson's, since May.","filename":"data/vaneerConsumption/HampshirewomanpenshardhittingblogtoPhilipHammond.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F6E6200000578-0-image-a-12_1489112780421.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299660_Woman-pens-hard-hitting-blog-Philip-Hammond_1540248760.html","title":"Hampshire woman pens hard-hitting blog to Philip Hammond","title_page":"Hampshire woman pens hard-hitting blog to Philip Hammond | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Claire Hovey, 32, (pictured with her boyfriend Chris Edwards) has written a blog post addressed to Chancellor Philip Hammond\nA self-employed copywriter has urged Chancellor Philip Hammond to 'see sense and reconsider' his controversial increase in National Insurance contributions.\nClaire Hovey, 32, from Winchester, Hampshire, and boyfriend Chris Edwards, also 32, have been live-in carers for his mother, who has Parkinson's, since May.\nIn a blog post addressed to Mr Hammond, she wrote that his controversial announcement in Wednesday's Budget 'risks her livelihood'.\nShe wrote: 'I am both a carer and a company director and, to be clear, you are demanding that on top of the 20 per cent corporation tax I gladly pay to HMRC… my existing 9 per cent NI contributions, 7.5 per cent dividend tax (rising to 32.5 per cent if, God forbid, I do well) plus the costs of covering student loan repayments, a pension, holiday, sick pay and parental leave, I need to find a further 2 per cent to 'level the playing field' with employees, while you continue to allow the existence of zero-hours contracts, tax breaks and tax avoidance for major companies to keep Britain 'attractive' amid the Brexit I voted against.\n'You are only ensuring that my business cannot grow, you are risking my livelihood and you are making it harder to provide for my own needs later in life.\n'And you do this while grossly underestimating the care crisis and failing to address the buckling NHS at all.'\nShe added: 'We're both 32 now but we've put off getting married and having children because the pressure of providing the level of care needed for advanced Parkinson's plus staying in work is too much.\nIn a blog post addressed to Mr Hammond, she wrote that his controversial announcement in Wednesday's Budget 'risks her livelihood'\n'We juggled remote working between us but it's really affected our health, so the last five months I reduced down to three days. Chris works crazy hours to pay for some care support ourselves.'\nHer comments came as Mr Hammond was left stunned after an extraordinary Tory rebellion saw MPs publicly vowing to secure a U-turn on his increase to National Insurance for the self-employed.\nMP after MP went on the attack over the issue, which many saw as an assault on Conservative values.\nOne warned that it risked alienating core Conservative voters, another said it sent 'the wrong message', while another vowed simply that the rise 'cannot be allowed to proceed.'\nShe wrote to Philip Hammond: 'You do this while grossly underestimating the care crisis and failing to address the buckling NHS at all'\nThe revolt – unprecedented within 24 hours of a Budget – left Downing Street in shock, and provided the backdrop to chaotic recriminations that tested relations between Number 10 and the Treasury.\nAnne-Marie Trevelyan, the Tory MP for Berwick-upon-Tweed, was among the first to take to the airwaves, saying: 'It goes against every principle of Conservative understanding of business.\n'We understand that taking risks is what stimulates growth. It impacts people who are putting themselves at risk, their houses on the line, to create new growth.\n'It's the wrong way round and sends a very poor message.'\nEven Government loyalists such as Dominic Raab admitted that he 'struggled' with the tax rise.","url":"https://www.dailymail.co.uk/news/article-4299660/Woman-pens-hard-hitting-blog-Philip-Hammond.html"}
