{"authors":["Thomas Colson"],"date_download":"2018-10-30 20:43:30","date_modify":"2018-10-30 20:43:30","date_publish":"2016-12-28 00:00:00","description":"74,000 homes were bought by Londoners outside the capital in 2016 — 11,000 more than in 2015.","filename":"data/vaneerConsumption/HamptonsLondonersfleeingcapitalatthefastestrateinadecade.json","image_url":"https://amp.businessinsider.com/images/586384dfdd08951a208b4bab-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_house-prices-london-hamptons-fleeing-capital-2016-12_1540932210.html","title":"Hamptons: Londoners fleeing capital at the fastest rate in a decade","title_page":"    Hamptons: Londoners fleeing capital at the fastest rate in a decade - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Houses in Notting Hill, London Flickr / CC 3.0 LONDON — Housebuyers in the capital are fleeing at the fastest rate for 10 years, according to new research by estate agents Hamptons.\nDuring the last 12 months, 77,500 Londoners bought houses outside the city, 22% more than in 2015, but below the 2007 peak.\nThat is partly explained by the fact that house prices in London continue to rise significantly faster than wages, meaning that first-time buyers are forced to look further afield to get onto the property ladder.\nAnother chunk of buyers leaving the capital are existing homeowners in London who are selling up and cashing in on the fact that house prices have soared in London faster than anywhere else in the country. Londoners buying outside of the capital in 2016 were able to afford to spend 20% more on a home than the average buyer — up from 10% the previous year.\nExpectations for house price growth in London are waning. A Times survey of leading economists released on Wednesday found that most believe London house prices will stall next year, amid slowing growth and higher inflation. Hamptons head of research Johnny Morris said that the trend for leaving \"reflects the temptation to cash in on record house prices in the city and move further afield to get more for their money.\"\nMany of those leaving were not going far — 80% moved to areas in the south of England, where property is more affordable but still within a commutable distance of central London.\nLondoners continue to snap up many homes in traditionally popular commuter areas, including Sevenoaks in Kent and Bath in Somerset, where the proportion of London housebuyers in 2016 was 51% and 54% respectively.\nHowever, young housebuyers are also looking to less traditional areas as affordability in established commuter towns is stretched.\nThe proportion of London buyers in Broxbourne in Hertfordshire and Thurrock in Essex — both affordable areas within a commutable distance of London — was 57% and 59% respectively.\nMorris told the Telegraph: \"A move out of London has generally had more to do with changing priorities as people get older and start forming families than the housing market.\n\"It is likely 2016 will be a peak for London leavers. While, overall, the year saw growth in Londoners buying outside of the capital, in recent months the pace has been slowing. A slower housing market in 2017 will likely mean that we see less Londoners buying outside of the capital than in 2016.\"","url":"https://www.businessinsider.com/house-prices-london-hamptons-fleeing-capital-2016-12"}
