{"authors":["Phoebe Weston For Mailonline"],"date_download":"2018-10-23 00:21:22","date_modify":"2018-10-23 00:21:22","date_publish":"2017-04-26 09:55:03","description":"Amsterdam-based start-up, Seatswing, is seeking funding through Kickstarter to develop a hands-free £36 ($46) toilet seat that could mean you never have to lift up a toilet lid again.","filename":"data/vaneerConsumption/HandsfreetoiletseatcontrolledusingaBUTTON.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D89BD00000578-0-image-a-3_1493196839192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4446764_Hands-free-toilet-seat-controlled-using-BUTTON_1540254082.html","title":"Hands-free toilet seat controlled using a BUTTON","title_page":"Hands-free toilet seat controlled using a BUTTON | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An ingenious hands-free toilet seat could mean you never have to put down a dirty toilet lid again.\nThe 'Seatswing' allows men and women to press a button with their knee to both lift the seat and drop it again.\nThe inventors say this method is much more hygienic and it could end the timeless argument between couples about putting the seat down.\nScroll down for video\nAn Amsterdam-based start-up called Seatswing has developed a hands-free toilet seat that allows men and women to press a button with their knee to both lift the seat and drop the lid\nHANDS-FREE TOILET The 'Seatswing' allows men and women to press a button with their knee to both lift the seat and drop it again. Inventors say this method is much more hygienic and it could end the timeless argument between couples about putting the seat down. The seat uses springs and a clicking mechanism that is similar to the foot pedal operated bins. Inspiration for the product comes from the fact that there are microscopic human faeces on the top of every toilet - which we touch every day.\n'Seatswing will solve the endless toilet discussions couples have about putting the seat down - all men forget to put it down now and then', said Maarten Stokman, Founder and Creator of the Seatswing who is based in Amsterdam.\nDevelopers are currently seeking funding through Kickstarter to fund the development of the first batch of the product.\nDescribing the gadget online they say: 'The Seatswing invention will make it possible for people to never have to touch the toilet seat again.\n'The result is an easier and more hygienic visit to the restroom for both men and women.'\nIt 'looks like a normal toilet except for the extra push button on the front', the say.\nThe seat uses springs and a clicking mechanism that is similar to the foot pedal operated bins.\nThe inspiration for the product comes from the fact that there are microscopic human faeces on the top of every toilet - which we touch every day.\nThe seat uses springs and a clicking mechanism that is similar to the foot pedal operated bins. The inspiration for the product comes from the fact that there are microscopic human faeces on the top of every toilet - which we touch every day\nThe average toilet seat carries around 200 bacteria per square inch.\nThe Seatswing is currently on sale for €42 - approximately £36 ($46) - and the Kickstarter has received just over a quarter of its €20,000 ($26,000) target.\nThe Seatswing is made of Duroplast which is considered strong and lightweight.\nThe inventors say this method is much more hygienic and it could end the timeless argument between couples about putting the seat down\nIt also has an antibacterial layer which kills bacteria and viruses on the surface of the seat.\nIf developers hit the goal of €30,000 ($38,000) they say they will bring out different colours.\nThey are planning to ship the product in May 2017 and it will be available globally.","url":"https://www.dailymail.co.uk/sciencetech/article-4446764/Hands-free-toilet-seat-controlled-using-BUTTON.html"}
