{"authors":["April Glover For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 23:13:29","date_modify":"2018-10-22 23:13:29","date_publish":"2017-03-16 06:05:11","description":"A NSW machine operator who was killed by a crane in 2013 died because his co-worker had a 'hand cramp' and let go of the machine, leading to his violent death, an inquest has found.","filename":"data/vaneerConsumption/HandcrampledtoNSWworkersviolentdeathbycrane.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E52184700000578-0-image-a-29_1489644292939.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318912_Hand-cramp-led-NSW-worker-s-violent-death-crane_1540250009.html","title":"Hand cramp led to NSW worker's violent death by crane","title_page":"Hand cramp led to NSW worker's violent death by crane | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A machine operator who was killed after he was hit by a heavy crane died because his colleague got a cramp in his hand and lost control of the device, an inquest found.\nBrandoli Pou, 29, was struck in the chest by a magnetic lifter attached to an overhead crane operated by Mariousz Cyrta who was 'suddenly affiliated by a cramp'.\nPou was hit by the crane while working at the Southern Steel Group's plant in Milperra and died at Liverpool Hospital on November 4, 2013.\nPou was fatally struck by the crane at the Southern Steel Group's plant in Milperre (pictured)\nAt the NSW Coroner's Court on Thursday, Deputy State Coroner Elizabeth Ryan said: 'The young man died in violent circumstances, as a result of the way in which Mr Cyrta operated the machinery which fatally struck him.'\nShe said it was clear Mr Cyrta continued to operate the device after the onset of his cramp and said it is to be inferred that once the cramp struck, he removed his attention from the movement of the magnetic lifter.\n'Having carefully considered the evidence, in my view an open question remains as to why Mr Cyrta allowed the crane to continue operating in the way that he did for such an extended period of time,' Ms Ryan said.\nAt least 10 seconds elapsed from the presumed time the cramp started until the crane came to a stop, travelling a significant distance and dragging a heavy metal object at a height 'which seriously imperilled the safety of everyone in its travel path'.\nThe inquest found machine operator Mariousz Cyrta had a 'hand cramp' when Pou was killed\nIn a statement Mr Cyrta, an experienced and adequately trained crane operator with no track record of safety breaches, said: 'I did not see the magnet when I heard the bang as I was fixing my fingers.'\nMs Ryan said no defects where found in the operation of the machinery and no changes in the design could have prevented Mr Pou's death.\nShe also made a number of safety recommendations including that if an operator becomes unfit while working, the crane must be stopped and the matter reported.\nMs Ryan said safety considerations were 'paramount if lives are not to be lost'.","url":"https://www.dailymail.co.uk/news/article-4318912/Hand-cramp-led-NSW-worker-s-violent-death-crane.html"}
