{"authors":["Bo Emerson"],"date_download":"2018-10-30 18:01:49","date_modify":"2018-10-30 18:01:49","date_publish":"2016-04-15 06:30:42","description":"Wood carvers carve more than wood.\nThey carve ideas, emotions, stories.","filename":"data/vaneerConsumption/HankAaronwhittledinwoodseeitattheHigh.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p7/MyAJC/2016/04/14/Images/WPIMAGE_cmgajcartsculture_5628.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_arts-culture_hank-aaron-whittled-wood-see-the-high__1540922509.html","title":"Hank Aaron whittled in wood; see it at the High","title_page":"Hank Aaron whittled in wood; see it at the High","title_rss":"NULL","source_domain":"ajc.com","text":"+ × In 1974, Elijah Pierce, a self-taught artist from Mississippi, created this painted, carved portrait of Henry Aaron and his wife Billye ... read more\nWood carvers carve more than wood.\nThey carve ideas, emotions, stories. They also occasionally carve their own work-tables. The curves in Leroy Almon’s table speak of a fruitful career, chipping, chiseling and whittling scenes from the Bible and tableaux of modern life.\nThat table -- and Almon's work -- are part of the High Museum’s folk and self-taught art collection . Some of Almon’s work will also be part of a new show of carved art, “A Cut Above: Wood Sculpture from the Gordon W. Bailey Collection,” to open at the High May 14, and to run through Oct. 30.\nThe show will feature artworks donated to the High by Los Angeles collector Gordon W. Bailey, who, since 2010, has given the museum more than 80 pieces from self-taught artists, many of them from the Southeast.\nAlmon, a native of Tallapoosa, Ga., was a shoe salesman and worked in a Coca-Cola bottling plant in Columbus, Ohio for many years. In Columbus he also spent time at the barber shop of Elijah Pierce, himself a noted carver, and Almon learned the skill from the older man.\nPierce is also represented in the “Cut Above” show, which will include a carved wood portrait of Henry and Billye Aaron, created by Pierce in 1974 to honor Aaron’s 715th home run.\nBailey's relationship with the High bloomed in 1999, when the museum put on a show of works by Gullah painter Sam Doyle, from Saint Helena, S.C. The High sought guidance from Bailey, who is an expert on Doyle's work. Later, Bailey began giving artwork to the High, including one piece by Thornton Dial Jr., son of the late Thornton Dial Sr.\n\"I think that is linked to our really unique stewardship of work by Southern self-taught artists,\" said Katherine Jentleson, curator of folk and self-taught art at the High.\nFor information about the show, go here.","url":"https://www.myajc.com/blog/arts-culture/hank-aaron-whittled-wood-see-the-high/lCf8eHDNJCfKPsNEhjfViO/"}
