{"authors":["James Delingpole"],"date_download":"2018-10-30 21:11:31","date_modify":"2018-10-30 21:11:31","date_publish":"2014-06-23 22:49:04","description":"Hank Paulson, the former US Treasury Secretary who helped transform the 2008 crash from a temporary crisis into a long-running, still-unresolved disaster, |","filename":"data/vaneerConsumption/HankPaulsonAsWrongaboutClimateChangeashewasaboutTheCrash.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/06/23/henry%20paulson.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_06_23__1540933891.html","title":"Hank Paulson: As Wrong about Climate Change as he was about The Crash","title_page":"Hank Paulson: As Wrong about Climate Change as he was about The Crash | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hank Paulson, the former US Treasury Secretary who helped transform the 2008 crash from a temporary crisis into a long-running, still-unresolved disaster, has now turned his expertise to the subject of climate change.\nIn a lengthy editorial for the New York Times, he declares:\nI was secretary of the Treasury when the credit bubble burst, so I think it’s fair to say that I know a little bit about risk, assessing outcomes and problem-solving. Looking back at the dark days of the financial crisis in 2008, it is easy to see the similarities between the financial crisis and the climate challenge we now face.\nThis is a bit like the Captain of the Titanic returning from his watery grave to tell us: “Trust me. I have experience of managing disasters. That’s why I’m just the man you want to appoint as the next head of the Federal Reserve.” Except not quite as ridiculous as Paulson’s claim, obviously.\nHere, in more detail, is what is wrong with Paulson’s piece.\n“We must not lose sight of the profound economic risks of doing nothing.”\nThere’s a desperate logical fallacy, here, Hank – and you, of all people, ought to be able to see it. You talk about the “economic risks of doing nothing.” But what if the economic risks of doing something are even greater? C’mon, Hank. You should know. You were the guy who used trillions of tax dollars to bail out the zombie banks, with effects we are still ruining to this day. Still, your old pals at Goldman Sachs must love you very much.\n“The solution can be a fundamentally conservative one that will empower the marketplace to find the most efficient response. We can do this by putting a price on emissions of carbon dioxide — a carbon tax. Few in the United States now pay to emit this potent greenhouse gas into the atmosphere we all share. Putting a price on emissions will create incentives to develop new, cleaner energy technologies.”\nThis position you outline: it is not a conservative one. Conservatives do not believe in higher taxes; conservatives do not believe that governments can pick winners or, as you weasellishly put it, “empower the marketplace”. Maybe it’s time you and you had a serious chat about this with David L Brooks in the New York Times canteen. If you both joined the Democrats together, they might give you a two for the price of one deal.\n“It’s true that the United States can’t solve this problem alone.”\nIndeed. The word you’re looking for is “China.” And guess what? They’re building a new coal-fired power plant every five days. That’s how much they care about your plans to stop global warming.\n“Looking back at the dark days of the financial crisis in 2008, it is easy to see the similarities between the financial crisis and the climate challenge we now face.”\nYes,they’re both classic examples of Enron economics: a gigantic Ponzi scheme in which rent-seeking corporations, faux experts, and low-down shysters exploit government regulation and incompetence to fleece everyone else.\n“Our experts (financial experts then, climate scientists now) try to understand what they see and to model possible futures.”\nSo let me get this right: you’re using the example of all those useless “experts” who failed to predict the 2008 crash as a justification for trusting the widely discredited models of “climate scientists”? Good luck with that.\n“To protect New York City from rising seas and storm surges is expected to cost at least $20 billion initially, and eventually far more.”\nAnd your ingenious solution is to stymie the US economy with a carbon tax in the hope that this will effect a marginal reduction in the otherwise harmless trace gas CO2 which will somehow stop climate doing what climate has been doing, quite naturally, for the last 4.5 billion years of the world’s existence? Come this way, my friend. You’re an economist you say? Then I think you might just be interested in this rather magnificent bridge I have for sale.\n“Now the ice is melting so rapidly that virtually ice-free Arctic summers could be here in the next decade or two.”\nWho does your research for you? Michael Mann? This statement is just flat out untrue. The volume of Arctic sea ice is expanding massively.\n“Even worse, in May, two separate studies discovered that one of the biggest thresholds has already been reached. The West Antarctic ice sheet has begun to melt, a process that scientists estimate may take centuries but that could eventually raise sea levels by as much as 14 feet.”\nOh, Lord. We dealt with this liberal meme a couple of weeks ago at Breitbart London. Do you not read Breitbart London? What kind of a Republican are you? Not the kind many Republicans would like in the Republican party, I’d suggest. Anyway, here’s what we said. (Simple answer: it’s not climate change that is causing the West Antarctic ice sheet to collapse. It’s that there’s a ruddy great volcano underneath).\n“With that experience indelibly affecting my perspective, viewing climate change in terms of risk assessment and risk management makes clear to me that taking a cautiously conservative stance — that is, waiting for more information before acting — is actually taking a very radical risk.”\nWhere did you go to school, Hank? The Saul Alinsky Academy of Belial Sophistry? You’re actually trying to argue here that acting impetuously from a position of ignorance is somehow preferable to acting proportionately to a recognised threat as and when it is properly understood. Sorry: total logic fail.\n“I’m a businessman, not a climatologist”\nNo shit, Sherlock!\n“But I’ve spent a considerable amount of time with climate scientists and economists who have devoted their careers to this issue. There is virtually no debate among them that the planet is warming and that the burning of fossil fuels is largely responsible.”\nDon’t tell me. The climate scientists were called James Hansen, Michael Mann and Phil Jones and the economists were called Paul Krugman and Lord Stern, right?\n“I’ve joined with the former mayor of New York City, Michael R. Bloomberg, and the retired hedge fund manager Tom Steyer…”\nGreat. A trio of One Percenters united in a noble green crusade against liberty, small government, low taxes, cheap energy prices and scientific evidence. You must feel so proud\n“Some members of my political party worry that pricing carbon is a “big government” intervention. In fact, it will reduce the role of government…”\nRead those two statements again, Hank. Then ask yourself: “Do I really hold my readership in such contempt that I expect them to swallow a line as specious as that?”\n“In the same way, just as we shouldn’t leave our children or grandchildren with mountains of national debt and unsustainable entitlement programs, we shouldn’t leave them with the economic and environmental costs of climate change.”\nHeard of QE? Solyndra?","url":"https://www.breitbart.com/europe/2014/06/23/hank-paulson-as-wrong-about-climate-change-as-he-was-about-the-crash/"}
