{"authors":["Rodney Ho"],"date_download":"2018-10-30 19:33:45","date_modify":"2018-10-30 19:33:45","date_publish":"2018-07-31 19:43:00","description":"Originally posted Tuesday, July 31, 2018 by RODNEY HO/rho@ajc.","filename":"data/vaneerConsumption/HankKlibanoffsBuriedTruthspod.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/31/Images/Hank%20Klibanoff%20David%20Arasoain%20Buried%20Truths%202.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_radiotvtalk_exclusive-_6a89d83a087d1c5d005cf2f11c553ad4__1540928025.html","title":"Hank Klibanoff’s ‘Buried Truths’ pod","title_page":"Exclusive: Hank Klibanoff’s ‘Buried Truths’ pod","title_rss":"NULL","source_domain":"ajc.com","text":"Originally posted Tuesday, July 31, 2018 by RODNEY HO/rho@ajc.com on his AJC Radio & TV Talk blog\nHank Klibanoff’s WABE podcast “Buried Truths” focused on a long-forgotten crime case from the civil rights era will be back for a second season in 2019.\nReleased in March, the six-part podcast has done reasonably well, drawing 650,000 downloads in its first four months. Even after four months on air, it is receiving 1,500 new downloads daily. WABE said 82 percent of listeners are outside of Georgia.\n“We will always focus on this market, but the podcast has national appeal,” said WABE CEO Wonya Lucas in an interview. “There are a lot of parallels to the world today.”\nThe first season explored the efforts of three black farmers in South Georgia county in the late 1940s to vote in the face of white supremacists trying to stop them. In the end, it cost one of those farmers his life.\nKlibanoff, a former Atlanta Journal-Constitution managing editor, is a Pulitzer-Prize winning author of a book about journalism during the civil rights era called “The Race Beat: The Press, the Civil Rights Struggle, and the Awakening of a Nation.” He teaches a class at Emory University where his students help him research civil rights-era cold cases.\n“Buried Truths” has received near universal praise from listeners. On its Facebook page, it received five out of five stars from almost all the reviewers.\n“This is the most inspirational podcast I've ever had the pleasure of blessing my ears with,” wrote Tiffany Clark. “I fell in love with it the first time I heard it. I love it. It feels good to hear someone take the side of the Black man. Thanks Mr. Hank! You have my utmost respect.”\nHe said he’s been happy by the relative “paucity of negative response” considering the podcast was centered around the often divisive issue of race. Friends told him it may have been because he tackled the case fairly without stridency or politicization.\nKlibanoff, a long-time print scribe, said it’s been gratifying to successfully work in a new medium as a “guy who likes to write long sentences and paragraphs. I have been whipped into shape!”\nHe isn’t ready to identify the season two case just yet but he said it will be another decades-old murder. “It will resonate with enormous contemporary clarity,” he teased.\nKlibanoff hopes to have season two of “Buried Truths” ready for the first quarter of 2019.\nRead more here from my preview of season one of “Buried Truths” I wrote in March.","url":"https://www.ajc.com/blog/radiotvtalk/exclusive-hank-klibanoff-buried-truths-podcast-for-wabe-gets-second-season/104SYZtnPyIWr99IKBAtcK/"}
