{"authors":["Corey Charlton For Mailonline","Jaya Narain For The Daily Mail"],"date_download":"2018-10-23 01:07:24","date_modify":"2018-10-23 01:07:24","date_publish":"2016-01-11 11:40:28","description":"In a scathing attack on Thailand and its officials, Laura Witheridge said the country was aesthetically beautiful but inherently dangerous, and that many of its officials are corrupt and heartless.","filename":"data/vaneerConsumption/HannahWitheridgessisterattacksThailandsreputation.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300B267900000578-0-image-a-5_1452536138686.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393779_Sister-murdered-British-backpacker-Hannah-Witheridge-reveals-court-officials-told-parents-just-make-one-raped-killed-Koh-Tao_1540256844.html","title":"Hannah Witheridge's sister attacks Thailand's reputation","title_page":"Hannah Witheridge's sister attacks Thailand's reputation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The sister of British backpacker Hannah Witheridge has warned people not to travel to Thailand claiming Westerners are hated in the country.\nLaura Witheridge said it is far from the beautiful country people talk of as she launched a scathing attack on the country saying many Thais had no regard for human life and treated people like dirt.\nShe also claimed senior Thai officials callously told her parents to go home and ‘just make another one’ after their daughter was raped and killed while on holiday.\nLaura Witheridge (pictured centre) with her sister Hannah (right), who was raped and murdered on the picturesque Thai holiday island of Koh Tao, and their mother Susan (left)\nA police diver searches for evidence in the Koh Tao water near where Ms Witheridge and Mr Miller's bodies were found. Laura Witheridge has warned the country is beautiful aesthetically but remains dangerous\nIn the lengthy Facebook post, Hannah's sister said callous Thai court officials told her grieving parents to 'just go home and make another one'\nIn December Burmese migrant workers Zaw Lin and Win Zaw Tun were sentenced to death for the killing of Ms Witheridge, 23, and David Miller, 24.\nThe British pair were found beaten to death on a beach on Koh Tao in December 2014, while Ms Witheridge, from Norfolk, had been raped.\nThe condemnation of Thailand, on Miss Witheridge’s Facebook page, comes just days after another Briton was found dead on Koh Tao.\nLuke Miller, 26, a bricklayer from the Isle of Man, was found dead in a swimming last week prompting his distraught mother, Sara Cotton, to issue her own warning.\nShe said: ‘This has ripped my heart out... Luke was living the dream out there. I personally didn't want him to go though.\n‘If I knew then what I know now about that island, he wouldn't have gone. I would've hidden his passport. I don't think parents should let their kids go out there to this island.’\nIn a Facebook post shared widely, Laura Witheridge labelled Thai officials 'corrupt' and claimed Thailand was not the beautiful and safe travel destination many believed to it to be.\nAmong the questions court officials put to her family during the trial were: 'Why are you here?' and 'why do you care?'\nLuke Miller (pictured with Nichola Gissing , left, and friend Luke Gissing, rigth), 26, a bricklayer from the Isle of Man, was found dead in a swimming last week prompting his mother, Sara Cotton, to issue her own warning.\nShockingly, other individuals told the grieving family: 'She is dead already; why are you so bothered? Just go home and make another one' and 'why are you making such a fuss, she will be back in 30 days as something else, she may have better luck next time.'\nThis, Laura claimed, was evidence of their 'little regard for human life'.\nShe wrote: 'Since Hannah was taken from us, I am continually asked whether I will warn the world about the dangers of Thailand.\n'Countless times, I have logged in to Facebook and seen statuses made by people who know both Hannah and I, who have gone out [to Thailand] anyway.\n'They think it wont happen to them. Well, guess what? Neither did we. No one is immune.'\n'Many Thai’s hate Westerners and they have little to no regard for human life. I don’t say this lightly, or without reason. Let me share a few facts with you about this \"beautiful\" place you speak of.\n'Many of the Thai people have no regard for human life. My evidence for this statement: firstly, some quotes of the things said to my bereaved, heart broken family by the judges and court officials at the trial of the two Burmese migrants.'\nShe went on to reveal that she had received death threats 'from Thai people' since her sister's death and they had 'defaced photographs of me saying that the killers had only done \"half the job\".'\nBritish backpackers Hannah Witheridge was killed alongside David Miller on a beach on the tropical island in December 2014\nBurmese migrant workers Zaw Lin and Win Zaw Htun (pictured) were sentenced to death for the crime, despite protestations about how the Thai police and courts handled their prosecution\nThe trial of Zaw and Win Zaw was plagued by the defence's accusations of torture and police ineptitude.\nPolice rushed to solve the crime, under intense pressure to limit negative publicity to the tourism industry.\nThey were criticized for not properly securing the crime scene and conducting more than 200 random DNA tests.\nThey also released names and pictures of suspects who turned out to be innocent, mishandled crucial DNA evidence from the victims and allegedly tortured their prime suspects.\nIn the wake of the trial, the Witheridge family released a statement that did not address the controversy surrounding the evidence against the two Burmese workers.\nHowever, Laura admitted in her Facebook post that she believed the police investigation had been 'bungled' and said she missed her sister 'desperately'.\n'What if I told you that I am now frightened of my own shadow? That I am constantly looking over my shoulder? That I am exhausted, but frightened to sleep because of the nightmares?\n'I miss my sister desperately. My heart is heavy and my mind is tired.'","url":"https://www.dailymail.co.uk/news/article-3393779/Sister-murdered-British-backpacker-Hannah-Witheridge-reveals-court-officials-told-parents-just-make-one-raped-killed-Koh-Tao.html"}
