{"authors":["Jeff Poor"],"date_download":"2018-10-30 19:17:51","date_modify":"2018-10-30 19:17:51","date_publish":"2017-04-04 20:16:48","description":"Tuesday on his nationally syndicated radio program, conservative talker and Fox News Channel host Sean Hannity responded to reports that he may have also | Video","filename":"data/vaneerConsumption/HannityNoKnowledgeIfSurveilledThreatensLawsuitAgainstObamaBenRhodesSusanRiceIfTrue.json","image_url":"https://media.breitbart.com/media/2017/03/Hannity310.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_04_04__1540927071.html","title":"Hannity: ‘No Knowledge’ If Surveilled — Threatens Lawsuit Against Obama, Ben Rhodes, Susan Rice If True","title_page":"Hannity: 'No Knowledge' If Surveilled --- Threatens Lawsuit Against Obama, Ben Rhodes, Susan Rice If True | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on his nationally syndicated radio program, conservative talker and Fox News Channel host Sean Hannity responded to reports that he may have also been spied on by the Obama administration.\nHannity said he would not be shocked if the reports were true, but claimed to have “no knowledge” of it.\nThank u all for heads up. I have zero knowledge of any surveillance vs me or unmasking of me by The Obama administration. Nothing shocks me! — Sean Hannity (@seanhannity) April 4, 2017\n“I have zero knowledge of any surveillance against me, any unmasking against me by the Obama administration,” Hannity said. “But considering that’s the same Obama administration that used the IRS to go after conservative groups, nothing shocks me. But do I have any personal knowledge of it? No, I don’t. Am I worried about it? No. But I will sue the living pants off of anybody who did it — I promise you that. And I will stop at nothing. And I have the means to attack this for years. And I’ll do it. And I’ll do it on behalf of every American’s right to privacy and to be able to make a confidential phone call or send a text or an email to their friends and loved ones. Good grief. And if I want to talk to somebody in the Trump administration, I ought to have the privacy that is afforded every American. And the fact that Gen. Flynn had his whole life turned upside down because of illegal unmasking and intelligence leaking — that’s why this is so important. You’re next, you understand?”\nLater in the segment, Hannity doubled down on not having any answers but said he would take legal action against former Obama administration officials, including President Barack Obama himself.\n“I don’t know the answer,” Hannity reiterated. “Everyone is still writing me like a thousand times. I don’t know if it’s true or not. How would I possibly know if surveillance took place on me or unmasking of me? I don’t know. I have no idea. So, everyone that is trying to look out for me — I am not worried at all.”\n“As a matter of fact, I’ll be very rich if in fact it happened,” he added. “And I’ll sue Obama himself, Ben Rhodes, Susan Rice — I’ll sue them all by name in a civil action.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2017/04/04/hannity-no-knowledge-if-surveilled-threatens-lawsuit-against-obama-ben-rhodes-susan-rice-if-true/"}
