{"authors":["Associated Press","Will Martin"],"date_download":"2018-10-30 20:40:50","date_modify":"2018-10-30 20:40:50","date_publish":"2016-12-28 00:00:00","description":"Germany's central bank says former president Hans Tietmeyer, who was at the helm of the Bundesbank when the euro was introduced, has died","filename":"data/vaneerConsumption/HansTietmeyeroneofthearchitectsoftheeurohasdiedat85.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_hans-tietmeyer-has-died-at-85-2016-12_1540932050.html","title":"Hans Tietmeyer, one of the architects of the euro, has died at 85","title_page":"    Hans Tietmeyer, one of the architects of the euro, has died at 85 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Ralph Orlowski Germany's central bank says former president Hans Tietmeyer, who was at the helm of the Bundesbank when the euro was introduced, has died. He was 85.\nThe Bundesbank said that Tietmeyer died on Tuesday. It didn't give any further details Wednesday in announcing his death.\n\"Hans Tietmeyer was an outstanding president, who always acted with a clear and firm hand that followed the goal of monetary stability,\" the Bundesbank's current president Jens Weidmann said in a statement. \"Our condolences and sympathy go out to his family and next of kin.\"\nTietmeyer headed the Bundesbank from October 1993 until August 1999, his term expiring a few months after the common European currency made its debut on financial markets.\nTietmeyer said in comments posted on the Bundesbank's website earlier this year that a \"transfer union\" in Europe would be \"very dangerous.\"\nTietmeyer said that a degree of \"togetherness of policies is necessary in order to make a currency union sustainable, and this unfortunately has not happened in Europe to the degree that it should have happened.\"","url":"https://www.businessinsider.com/hans-tietmeyer-has-died-at-85-2016-12"}
