{"authors":["Lisa Siva"],"date_download":"2018-10-30 22:33:39","date_modify":"2018-10-30 22:33:39","date_publish":"2014-08-15 12:00:03","description":"Forget Jennifer Lawrence. If Julia Child isn’t already your spirit animal, you should fix that, stat. (Preferably with a stick of butter and a cheese soufflé.) Ever roasted a chicken? Made an omelet? You probably have the mother of French cooking to…","filename":"data/vaneerConsumption/HappyBirthdayJuliaChildHereare9RecipestoHonortheFirstLadyofFrenchCooking.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/29c6771c-6ec9-4cd7-9331-dfffced5a726.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34788-happy-birthday-julia-child-here-are-9-recipes-to-honor-the-first-lady-of-french-cooking_1540938819.html","title":"Happy Birthday, Julia Child! Here are 9 Recipes to Honor the First Lady of French Cooking","title_page":"Happy Birthday, Julia Child! Here are 9 Recipes to Honor the First Lady of French Cooking","title_rss":"NULL","source_domain":"bustle.com","text":"Forget Jennifer Lawrence. If Julia Child isn’t already your spirit animal, you should fix that, stat. (Preferably with a stick of butter and a cheese soufflé.) Ever roasted a chicken? Made an omelet? You probably have the mother of French cooking to thank — but Julia didn’t just teach us to bake perfect croissants. Apart from a chef, she was also a fearless writer, a top secret government researcher, and — above all — a woman who loved to eat. Since she would have turned 102 today, there's only one way to celebrate: with a feast.\nRaise your hand if you’ve ever done a Julia Child impression while in the kitchen. Good. You’re going to need it. We dusted off our copies of Mastering the Art of French Cooking to bring you the canonical recipes, from vichyssoise to boeuf bourguignon — all of which are best served with the requisite “Bon appétit!” Whether this is your hundredth soufflé or your first, Julia has your back. Let’s do her proud.\nImage: My Darling Lemon Thyme","url":"https://www.bustle.com/articles/34788-happy-birthday-julia-child-here-are-9-recipes-to-honor-the-first-lady-of-french-cooking"}
