{"authors":["Lianna Brinded"],"date_download":"2018-10-30 22:05:55","date_modify":"2018-10-30 22:05:55","date_publish":"2016-12-15 00:00:00","description":"The combined value of goods and services trade in 2030 could drop by 3% to $48.8 trillion from a current projection of $50 trillion.","filename":"data/vaneerConsumption/HardBrexitandTrumpsprotectionismwoulderadicate12trillionfromglobaltrade.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_hsbc-services-trade-report-donald-trump-brexit-article-50-2016-12_1540937155.html","title":"'Hard Brexit' and Trump's protectionism would eradicate $1.2 trillion from global trade","title_page":"    HSBC 'Unlocking the Growth Potential of Services Trade' report: Services, trade, Trump, Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A giant sinkhole. REUTERS/Daniel LeClair If Britain ends up having a \"hard Brexit\" — leaving the European Union without access to the Single Market — and President-Elect Donald Trump implements his protectionist trade plans, the combination could kill $1.2 trillion of global trade value.\nThat's according to HSBC in its new report entitled \"Unlocking the Growth Potential of Services Trade.\"\n\"If new tariff and non-tariff barriers are implemented due to US trade policy changes mooted by President-elect Donald Trump and a so-called 'hard Brexit' in the UK, the combined value of goods and services trade in 2030 could drop by 3% to USD48.8trn from a current projection of USD50trn,\" the report says.\nAt the beginning of December, Trump said the US should view trade \"almost as a war\" and vowed to implement protectionist policies.\nHe said that his administration would renegotiate trade deals and \"defeat the enemy on jobs. And we have to look at it almost as a war, because that's what's happened to us.\"\n\"That's what's happened to our workers.\"\nBritain has yet to start the two-year Brexit negotiation period because it has not triggered Article 50. That period is set to start in March.\nAlthough the nation voted by a slim majority to leave the EU, there is very little detail on what is going to happen to the UK in a few years time. Prime Minister Theresa May said she will not give a \"running commentary\" on how negotiations are going, but she has made it clear in various speeches that her government is prioritising immigration restrictions. That would imply a \"hard Brexit\" because the EU's official rules are that it will not allow the UK to curb immigration and keep membership of the single market at the same time.\nSo if there is a \"hard Brexit,\" combined with Trump implementing his anti-globalist trade policies, this could shave off nearly $2 trillion to global trade value.","url":"https://www.businessinsider.com/hsbc-services-trade-report-donald-trump-brexit-article-50-2016-12"}
