{"authors":["Will Martin"],"date_download":"2018-10-30 20:38:46","date_modify":"2018-10-30 20:38:46","date_publish":"2016-12-29 00:00:00","description":"Now this is a story all about how the pound got twist-turned upside down.","filename":"data/vaneerConsumption/HargreavesLansdown2017sterlingforecasts.json","image_url":"https://amp.businessinsider.com/images/583ea6dddd0895b1198b4645-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_sterling-pound-brexit-hargreaves-lansdown-2017-2016-12_1540931926.html","title":"Hargreaves Lansdown 2017 sterling forecasts","title_page":"    Hargreaves Lansdown 2017 sterling forecasts - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The pound is bizarre right now. DC Comics A new survey from FTSE 100-listed financial services firm Hargreaves Lansdown sheds light on just how much Brexit has flipped Britain's currency on its head.\nHargreaves Lansdown asked a collection of \"leading economists, strategists and fund managers from companies such as Allianz Global Investors, Columbia Threadneedle, Henderson Global Investors and Saxo Bank\" not just what they expect the pound to do in 2017, but also what will influence the currency's movements over the coming 12 months.\nThe most common answer: Brexit.\nAsked to score the importance of a variety of economic and political factors that traditionally influence currency movements out of five, two stood out. They were \"developments in Brexit negotiations\" and the \"activation of Article 50.\" Both of these factors rated above four in Hargreaves Lansdown's survey, while no other issue scored higher than a 3.5. Simply put, leaving the EU will be the biggest driver of movements in the pound next year.\nHere's the chart:\nHargreaves Lansdown\nThe survey is indicative of a fundamental shift in attitudes towards the pound. Pre-Brexit vote, sterling was a classic cyclical currency, fluctuating on stuff like the state of the UK's deficit, employment data, and other regular economic releases, but now, politics is king.\nWe've already seen that in key political events since the vote, like in early November when the pound gained more than 1% in a day after the High Court ruled that the British government cannot begin the formal process to leave the European Union without first having a vote in parliament.\nSterling did the opposite in October when Brexit secretary David Davis made a speech in front of parliament, which suggested at a hardline Brexit stance from the government. It then recovered sharply after Davis stopped speaking, having eventually confirmed that there would be some parliamentary involvement in the Brexit decision.\nThe way that sterling is now moving, and is expected to move, mirrors the sort of thing that might be seen in an emerging market, rather than an economic powerhouse like the UK.\nIn GDP terms, Britain is the fifth biggest economy on the planet and has been established as a global powerhouse for centuries. But now, as analysts from both Citi and Morgan Stanley argued in October, Britain is beginning to behave like an EM.\nHargreaves Lansdown's findings mirror research from currency analysts at banking behemoth HSBC. Just over a week after Donald Trump's shock election victory, a note circulated by an unnamed group of HSBC staff said:\n\"The election of Donald Trump as the next US president cements our belief that financial markets, and in particular FX markets, are now being driven firmly by political developments.\"The political force is now dominant. We have been heading this way for a while, and we highlight below where political forces have already been having a much stronger impact on currency movements. For many currencies, particularly EM, a bullish or bearish view has come down to your take on the political outlook.\"\n\"The political force is now dominant. We have been heading this way for a while, and we highlight below where political forces have already been having a much stronger impact on currency movements. For many currencies, particularly EM, a bullish or bearish view has come down to your take on the political outlook.\"\nHSBC particularly focused its spotlight on the UK, with the analysts writing:\n\"The UK was perhaps the clearest example of political drivers taking over. GBP had been a cyclically driven currency, with interest rate differentials dominating cable's movements. But from the start of 2016, the UK's referendum on EU membership started to dominate the market. This political event shone a bright light on the UK's structural imbalances.\"","url":"https://www.businessinsider.com/sterling-pound-brexit-hargreaves-lansdown-2017-2016-12"}
