{"authors":[],"date_download":"2018-10-30 21:13:20","date_modify":"2018-10-30 21:13:20","date_publish":"2015-06-29 20:48:06","description":"These are the words of Randi Harper, an activist who runs a charity set up to prevent online abuse. Yes, you read that correctly.","filename":"data/vaneerConsumption/HarpingOnTheHypocrisyandLiesofTwittersMostNotoriousAntiAbuseActivistRandiHarperPart1.json","image_url":"https://media.breitbart.com/media/2015/06/unnamed4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_06_29__1540934000.html","title":"Harping On: The Hypocrisy and Lies of Twitter's Most Notorious 'Anti-Abuse' Activist, Randi Harper, Part 1","title_page":"Harping On: The Hypocrisy and Lies of Twitter's Most Notorious 'Anti-Abuse' Activist, Randi Harper, Part 1 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“Set yourself on fire.”\n“You’ve made your bed, now get fucked in it.”\n“Fuck your feelings.”\nTo most, these will sound like the words of an online troll, or at the very least someone with what in the 1990s we used to call “anger management issues.” And that’s probably an accurate assessment.\nYet these are not occasional, one-off outbursts, but rather part of a pattern of behaviour from perhaps the most darkly fascinating person currently causing grief on social media. They are the words of Randi Harper, an activist who runs a charity set up to prevent online abuse. Yes, you read that correctly.\nThis is the story, in three parts, of how Harper rose to prominence, how she has gotten away with such outrageous behaviour for so long while maintaining friendships with influential media commentators, activists, and journalists, and how she treats those who disagree with her far-left, hardline feminist politics.\nIt is the product of dozens of interviews with friends, former colleagues, and objects of Harper’s vindictive social media crusades. Almost all of them refused to speak on the record for fear of reprisals from Harper and her band of social media supporters.\nThe fact that so few people are willing to speak out about this new wave of progressive trolls perhaps tells its own story.\nOur interviews reveal a deeply troubled, hateful, and damaged human being in desperate need of help. They also expose just how tolerant to hatefulness the authoritarian left-wing establishment in America has become, provided the abuser in question has the right sort of opinions.\n“Randi Harper is probably the person doing the most harm to the cause of feminism on the internet today,” a well-known progressive journalist confided last week, on condition of anonymity. “Ordinarily we could dismiss her as a mess. But she has become a damaging force.”\nHarper herself apparently believes she has something to hide: shortly after being notified that this story would appear, she swapped the names of her two Twitter accounts, @freebsdgirl (on which the majority of her hateful invective had been published) and @randileeharper. She has since made the @freebsdgirl private so that only users she has approved can see her past tweets.\n***\nRandi Harper first caught the internet’s attention during the GamerGate controversy, which many figures on the American progressive Left have used to raise their media profiles. She attracted a number of supporters for her attacks on video game fans.\nIndeed, she and her supporters have formed a kind of digital mob, which she now uses to relentlessly attack anyone who challenges her, seemingly irrespective of who they are or what they have said. That they have publicly contradicted her appears to be enough.\nSince her ascendance to minor notoriety, Harper has become known for her abusive tactics and for misrepresentations of her critics. Her trail of victims includes diversity activists, technologists, data scientists, bloggers, gamers, and ordinary social media users.\nThis report will examine widely publicised and deeply disturbing claims about Harper’s private life that shed light on what led her to lash out at the world in such vicious and remorseless fashion.\nDespite claiming to oppose online abuse, Harper the cyber-bully and internet troll, together with her mob-like army of followers, has been involved in numerous campaigns of abuse against multiple targets in the past year.\nIn this, the first of three parts, we examine a snapshot of Harper’s online wars by illuminating four distressing stories of innocent victims left professionally damaged, scared, or simply infuriated by her abominable behaviour.\nRoberto Rosario\nRoberto Rosario is a 29-year veteran of software development and former head of Puerto Rico’s chapter of the International Games Development Association (IGDA). His crime, in Randi Harper’s eyes, was following the wrong people on Twitter.\nHarper’s claim to fame is a Perl script called the “GGautoblocker”, which she says is a tool to automatically block “internet harassers” and “misogynists” on Twitter. But peer-reviewed research commissioned by the feminist organisation Women, Action and Media found that just 0.66 per cent (65) of the 9,844 Twitter accounts on the list can be classified as “harassers.”\nThe reason for this appalling ratio — 9,779 innocent people lumped on a list with “harassers” — is that Harper’s list functions on the principle of guilt by association. If you follow the wrong people, you are automatically added to the list, regardless of what you, personally, have done.\nIt is an extraordinarily blunt tool, to put things mildly.\nMoreover, the “wrong people,” in Harper’s view, are not harassers or misogynists, but bloggers, journalists, and academics with whom she disagrees. The present author is on the list. Lawyer and lifestyle blogger Mike Cernovich is on the list. At one point, Hollywood star Adam Baldwin and feminist academic Christina Hoff Sommers were on the list. Follow any of these people, and the GGautoblocker will tag you as a misogynist and a harasser.\nThis is what happened to Roberto Rosario, one the most prominent figures in Puerto Rico’s tech community. Describing Harper’s list as “the most idiotic algorithm I’ve seen,” Rosario pointed out that preemptively accusing people of harassment and misogyny on the basis of their associations was “nonsense.” He is surely right.\nHarper made no effort to clear Rosario’s name, stating instead that if Roberto “didn’t want to be labelled a creep, he shouldn’t attack women’s credibility,” and refused to remove his name from the list.\nWhat followed was a relentless campaign of abuse against the software developer. Since criticising Harper, Rosario says he has been “harassed and threatened on the web daily” because of people who “didn’t know him and assumed he was a misogynist,” thanks to his inclusion on Harper’s list.\nNeedless to say, far from being a misogynist, Rosario is a sponsor of IncludeGirls, a group that aims to improve gender representation in tech. Such details didn’t matter to Harper or his other abusers.\nA nadir was reached when Rosario was targeted by an anonymous Reddit user who identified himself as a supporter of Harper’s autoblocker. The Redditor posted private pictures of Rosario’s family as well as his home address online. The user said Rosario was a “PIECE OF TRASH” and promised to release “tons more” if he continued to speak out against Harper’s autoblocker.\nRosario’s career was also targeted, and he states he was even blacklisted from speaking at certain events. He was eventually cowed into silence, and no longer issues public comment on Harper’s blocklist or related issues.\nThroughout these happenings, Harper, the “online abuse prevention activist,” did nothing to assist Rosario. His name remains on her blocklist.\nChris von Csefalvay\nChris von Csefalvay is a data scientist living in Oxford. He is a fellow of both the Royal Society of Arts and the Royal Statistical Society, with degrees from the Universities of Oxford and Cardiff. He is currently chief data scientist to a FTSE 100 company. He was recently diagnosed with multiple sclerosis (MS), a highly debilitating disease.\nCsefalvay first became a target of Harper after he published a network analysis indicating that GamerGate, a movement Harper is implacably opposed to, did not fit the characteristics of an “online hate campaign.”\nDuring a Twitter exchange with Csefalvay, Harper accused the data scientist of employing a “dismissive tone.” Csefalvay clarified his position, stating that dismisiveness was not his intention and that “the more people interested in [the topic of gamergate], the better.”\nHarper did not accept his apology. Accusing Csefalvay of being a “fake data scientist,” she urged her followers to explain to him why he “isn’t just a sexist tool, but an entire sexist home depot.” Naturally, she also added him to her autoblocker.\nSpeaking to Breitbart in a rare on-the-record comment, Csefalvay emphasised the seriousness of these claims: “To a profound degree, this was a damaging and offensive slur attacking my professional reputation, and the only reason I have not sued her for defamation and slander actionable per se is that she is too poor to make a judgement worthwhile.”\nCsefalvay says Harper is an “obsessive” and that she continues to keep tabs on his tweets despite the fact that he wants nothing more to do with her.\n“She likes hitting the vulnerable points of people,” says Csefalvay. “Her most recent attacks on me were on the day I was diagnosed with multiple sclerosis.”\nHarper would continue to call out Csefalvay for several months, as a campaign of abuse against the data scientist escalated. “Once [Harper] got involved, things got particularly vile”, said Csefalvay, speaking to gaming blogger Stephanie Greene. “That’s when it got into the realm of of very graphic and very shockingly violent threats.”\nIn January, Csefalvay announced he was retiring from the online debate, after anonymous death and rape threats were made against his wife. Thus another target of Randi Harper’s was silenced.\nClaire Schumann\nAside from a few archived tweets and a barely-used Twitter account, you won’t find many traces of Claire Schumann on the internet. She largely disappeared from social media after becoming a target of Randi Harper, deleting all her posts and effectively disappearing from the internet.\nLike Harper, Schumann was an opponent of the GamerGate movement, and spent “months” in polite conversation with Brianna Wu, another opponent of the movement. Wu described her as “very polite.”\nBut Schumann began having second thoughts, opting to conduct an “Ask me Anything” session on GamerGate and anti-GamerGate communities on Reddit, in order to find common ground.\nThis attracted the attention of Harper, who accused Schumann of being a “gamergate sockpuppet” playing “psychological games.” Although she didn’t have to, Schumann apologised, and said she would stop commenting on the controversy.\nThis wasn’t enough for Harper. “You’ve made your Gamergate bed, now get fucked in it,” Harper wrote. Schumann ended up being driven to tears by the blue-haired anti-abuse activist.\nVivek Wadhwa\nEntrepreneur and academic Vivek Wadhwa has one of the most impressive reputations in Silicon Valley. After founding a successful technology company in the 1990s, he moved into academia, and is now one of the leading voices on innovation, advising Russian and Malaysian governments on the topic. He was named among the top 30 most influential people in tech by TIME magazine in 2013.\nFor a long time, Wadhwa was also one of the leading advocates for diversity in technology. But he recently made the decision to end his advocacy on the issue, labelling the debate “toxic.” He made his decision after he was targeted by an online harassment campaign — one which Randi Harper was intimately involved with.\nWadhwa’s tireless advocacy for women and minorities in tech wasn’t enough for some feminists. In February, the blogger Amelia Greenhall kicked off a campaign against him with a blog post accusing him of hogging the limelight and employing a condescending tone. (No, really.)\nThe blog post also criticised Wadhwa for making “gaffes” at conferences, despite acknowledging that English was not his first language.\nThe blog post cited Randi Harper, who just a few days earlier had accused Wadhwa of being a “profiteering pseudo-ally,” before going on a long rant explaining her theory of how Wadhwa’s commitment to diversity was insincere.\nNaturally, the anti-abuse activist also descended to the level of personal abuse. “Fuck everything about this guy,” she added. When someone tried to stick up for Wadhwa, her response was, “Go set yourself on fire.”\nIt didn’t end there. Wadhwa’s Wikipedia and Amazon pages were targeted by a mob of his opponents, eager to ruin his reputation. Both websites are consulted regularly by members of the public and the press and, rightly or wrongly, what’s written there is taken seriously.\nHarper herself breached Amazon’s terms by using its customer review system to launch a personal attack on Wadhwa on a page for one of his books, despite admitting that she had never read it.\nAfter nearly a month of online abuse and attacks in the media, Wadhwa had had enough. In an article for VentureBeat, he wrote that fringe groups and personal agendas had made the debate on diversity in tech toxic and that he was stepping out.\nHarper would eventually receive a comeuppance of sorts, after a group that monitors Amazon review trolling outed her as a bully. They later received support from world-famous author Anne Rice, an incident which we covered here at Breitbart.\n(Absurdly, Harper called 73-year-old Rice a “harasser,” too.)\nAmazon eventually took action, removing Harper’s bogus review. But Wadhwa did not return.\n***\nRandi Harper’s activities follow a clear pattern. First she assumes someone to have ill intentions, even if they clarify or apologise to her. (Sometimes, especially if they do.)\nThen she engages in what author Jon Ronson calls public shaming — calling people out on social media, making wild and unsubstantiated accusations, urging her followers to attack them. She will often engage in abuse herself, frequently telling her critics to “go die in a fire.”\nShe maintains throughout that she is an anti-abuse activist.\nSocial media isn’t for the thin-skinned, and the panic over trolls and online harassment often appears absurd. At the end of the day, much of what is labelled as “harassment” or “abuse” are just mean words on the internet. Sympathy can be limited for people who endlessly underscore their victimhood.\nBut readers have even less patience for double standards. Randi Harper has convinced thousands of people that she genuinely opposes online abuse, yet her track record reveals her to be one of the worst abusers on Twitter. It’s like putting David Duke in charge of the NAACP. How long can the pretense be maintained?\nIn Part Two, we delve deeply into Randi Harper’s background. We examine how she arrived at her current methods of attack and critically explore the many gruesome personal allegations made against her. We also reveal a shocking truth about her “work” at the FreeBSD project, the open source software project on which Harper’s reputation as a programmer rests. Finally, we ask the question: how did she get away with it for so long?","url":"https://www.breitbart.com/the-media/2015/06/29/harping-on-the-hypocrisy-and-lies-of-twitters-most-notorious-anti-abuse-activist-randi-harper-part-1/"}
