{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-23 03:33:39","date_modify":"2018-10-23 03:33:39","date_publish":"2016-01-29 18:28:03","description":"Max Nolan, 17, achieved the brilliant shot at Tharptown High School, Alabama. Nolan's girlfriend Ashlyn Vandiver, 16, recorded it. The team went on to beat Hatton High School.","filename":"data/vaneerConsumption/harptownHighSchoolAlabamastudentMaxNolanscoresabasketwithhishead.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4C99200000578-0-image-a-8_1454092034658.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423167_At-basketball-match-Tharptown-High-School-Alabama-Max-Nolan-scores-basket-head_1540265619.html","title":"harptown High School, Alabama student Max Nolan scores a basket with his head","title_page":"harptown High School, Alabama student Max Nolan scores a basket with his head | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nearly his 18th birthday and his header shot wins the game - things are going well for this American basketball player.\nAn amazing video has emerged from high school in Alabama of teenage boy scoring a basket with his head.\nThe footage, filmed at Tharptown High School, Alabama last Monday, shows the game between Tharptown (in white) and Hatton High School (in blue).\nWill it, won't it: An amazing video has emerged from high school in Alabama of teenage boy scoring a basket with his head\nGame: The footage, filmed at Tharptown High School, Alabama last Monday, shows the game between Tharptown (in white) and Hatton High School (in blue)\nMax Nolan, 17, can be seen nodding the ball into the basket in an amazing fourth quarter score.\nThe ball is thrown in his direction from another player and seems to graze the tips of Nolan's fingers before hitting his head and bouncing off towards the net.\nDespite the accidental nature of the shot, the ball lands perfectly in the hoop and is greeted with ecstatic cheers from his team and those watching.\nNolan's proud girlfriend Ashlyn Vandiver, 16, recorded the amazing moment.\nShe posted it on Twitter and wrote online: 'Max Nolan made a perfect basket in the 4th quarter off of his head.\n'It completely changed the momentum and his team won the game.'\n'It was also close to Max's 18th birthday so it was a great present,' she continued.\nSet: Max Nolan, 17, can be seen nodding the ball into the basket in an amazing fourth quarter score. The ball is thrown in his direction from another player\nMatch: Despite the accidental nature of the shot, the ball lands perfectly in the hoop and is greeted with ecstatic cheers from his team and those watching. Nolan's girlfriend Ashlyn Vandiver, 16, recorded it","url":"https://www.dailymail.co.uk/news/article-3423167/At-basketball-match-Tharptown-High-School-Alabama-Max-Nolan-scores-basket-head.html"}
