{"authors":["Lia Beck"],"date_download":"2018-10-30 22:43:09","date_modify":"2018-10-30 22:43:09","date_publish":"2014-08-14 20:33:37","description":"Harry Styles saying \"will you marry me\" is probably the dream of countless tweens and teens (and some adults...) around the world, and one lucky girl got to hear those very words because she was fearless with her choice of outfit to a One Direction…","filename":"data/vaneerConsumption/HarryStylesProposestoFanBecauseHerChoiceofConcertWearIsAskingforItVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/39a1547e-83bb-4c96-bdef-dadfa903505d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35844-harry-styles-proposes-to-fan-because-her-choice-of-concert-wear-is-asking-for-it_1540939389.html","title":"Harry Styles Proposes to Fan Because Her Choice of Concert Wear Is Asking for It - VIDEO","title_page":"Harry Styles Proposes to Fan Because Her Choice of Concert Wear Is Asking for It — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Harry Styles saying \"will you marry me\" is probably the dream of countless tweens and teens (and some adults...) around the world, and one lucky girl got to hear those very words because she was fearless with her choice of outfit to a One Direction concert in Philadelphia on Wednesday evening. Harry Styles proposed to fan named Priya Thakker while onstage because she wore a wedding dress to the show. A wedding dress. Did you get that? I said, A WEDDING DRESS. This is insanity. Brilliant, brilliant insanity. If your end goal is getting Harry Styles' attention — and if you're at a One Direction concert, that's likely your end goal — then this is hands down the best way to go about it.\nThakker showed up to the concert decked out in a full-length wedding gown complete with a veil and bouquet, and drew attention right away. Other fans started tweeting pictures of her, I assume, because since she was wearing a wedding dress, she was obviously a threat. If you showed up to this concert in jorts and a t-shirt and then saw a girl in a wedding dress, you'd be like, \"Oh shit! I shoulda upped my game.\" And you'd be right.\nIn a video taken during the concert, Styles can be heard saying, \"Priya, will you marry me?\" And THE CROWD GOES WILD. Either these fans thought that Styles actually proposed to a girlfriend that they somehow never heard of even though his entire life is documented in the press, or they were just really supportive of their fellow Directioner, or they didn't have time to think about either of these options because \"Harry Styles just said 'will you marry me' and he totally must have said Priya on accident because that's not my nameeee. Ahhhhhh!!!!! YES, HARRY! A thousand times yes!\"\nOf course, Styles was kidding. He added after the proposal, \"There's been a plot twist!\" As for how he knew Priya's name, before the fauxprosal he asked if there was really someone there in a wedding dress. That's how popular she was!\nThakker is, of course, very excited about what happened to her. Under a photo of her in the wedding dress, her Twitter bio reads, \"I wore a wedding dress to a 1D concert and Harry proposed to me thats all.\"\nThakker really did well with this one. This is like if you now try to claim that you're having a virgin birth — it's been done, girl. No one can go to a One Direction concert in a wedding dress now and expect that the same thing will happen to them. It's time for 1D fans to get creative with some new ideas. Go on, y'all. Stare at those posters of Harry Styles in your lockers and come up with somethin' good.","url":"https://www.bustle.com/articles/35844-harry-styles-proposes-to-fan-because-her-choice-of-concert-wear-is-asking-for-it"}
