{"authors":[],"date_download":"2018-10-22 21:47:33","date_modify":"2018-10-22 21:47:33","date_publish":"2014-06-06 14:47:08","description":"Chester Nez, the last of the original Navajo Nation Code Talkers, died this week at 93. NBC News' Harry Smith spent time with the oldest member of that heroic group and recalls his visit.","filename":"data/vaneerConsumption/HarrySmithMyVisitWithaNavajoCodeTalker.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/492231/140606-code-talker-mn-1045_75075d5607c8832c46067548c9977089.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_veterans_harry-smith-my-visit-navajo-code-talker-n124516_1540244853.html","title":"Harry Smith: My Visit With a Navajo Code Talker","title_page":"Harry Smith: My Visit With a Navajo Code Talker","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nChester Nez, the last of the original Navajo Nation Code Talkers who served in World War II, died this week at 93. NBC News' Harry Smith spent time with the oldest member of that heroic group and recalls his visit.\nCarl Gorman was already on in years when I went to visit him in Window Rock, Arizona, in the late '90s.\nGorman's son was a wildly popular Native American artist whose work seemed to hang on every wall in the Southwest back then. But Carl was the one whose story I had come to hear.\nThe older Gorman had been one of the original Navajo code talkers. When the unit was formed, Gorman learned that he was too old to join. So he lied about his age.\nI was struck then and am awed still that Gorman and the other Navajos were so excited by the opportunity to serve. For to have grown up Indian in America in the mid-20th century was to have been caught in a culture that was reviled.\nGorman and his fellow code talkers told me stories of growing up Navajo. Many were sent to what were called Indian schools. The schools were run by white religious groups whose goal was to turn the boys into \"real Americans.\" Which meant squeezing every bit of Navajo out them. They told of beatings and other punishments they received if they were caught speaking their native language. Carl said he was sometimes chained to pipes in the schools basement to teach him a lesson. I was incredulous.\nYet Gorman shrugged his shoulders. It's what they did, he said. And he chuckled when we talked about the irony of growing up with a language so hated it was never to be spoken, only to learn that it was crucial to the war effort.\nBecoming code talkers brought a kind of justice to these men. They were Navajo and neither beatings nor bias could take that from them. And because they held fast to their identity, many lives were saved.\nThese men were a proud bunch. Proud of what they did. Proud to have served. Proud to be Navajo. And especially proud to have been Marines.\nOld Marines don't die, Carl said, they just go to hell and regroup.\nCarl Gorman died at age 90 in 1998, a proud U.S. Marine — or, in the code the Japanese never cracked, Washindon be Akalh B-kosi-lai.","url":"https://www.nbcnews.com/news/veterans/harry-smith-my-visit-navajo-code-talker-n124516"}
