{"authors":["E. Ce Miller"],"date_download":"2018-10-31 01:39:52","date_modify":"2018-10-31 01:39:52","date_publish":"2018-09-01 00:02:52","description":"“Your mother died to save you,” Headmaster Dumbledore explains to an intrepid, first year Harry Potter, in Harry Potter and the Sorcerer’s Stone. \"If there is one thing Voldemort cannot understand, it is love. He didn’t realize that love as powerful…","filename":"data/vaneerConsumption/HarryPotterIsFilledWithDynamicMothersButTheresOneThatHasImpactedMyOwnMotherhoodExperienceMoreThanAnyOther.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/30/f63543bc-71a6-46ea-b74c-7cb2b1efdd1c-molly.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_harry-potter-is-filled-with-dynamic-mothers-but-theres-one-that-has-impacted-my-own-motherhood-experience-more-than-any-other-9768278_1540949992.html","title":"Harry Potter Is Filled With Dynamic Mothers - But There's One That Has Impacted My Own Motherhood Experience More Than Any Other","title_page":"Harry Potter Is Filled With Dynamic Mothers — But There's One That Has Impacted My Own Motherhood Experience More Than Any Other","title_rss":"NULL","source_domain":"bustle.com","text":"“Your mother died to save you,” Headmaster Dumbledore explains to an intrepid, first year Harry Potter, in Harry Potter and the Sorcerer’s Stone. \"If there is one thing Voldemort cannot understand, it is love. He didn’t realize that love as powerful as your mother’s for you leaves its own mark.\"\nIt is then that readers learn — in the very first book of the Harry Potter series, which celebrates the 20th anniversary of its U.S. debut this fall — that what makes 11-year-old Harry so special is not any particular ability he has to defeat the Dark Lord of the Wizarding World, but rather the magic left behind by the self-sacrificial love of his mother. “Not a scar, no visible sign… to have been loved so deeply, even though the person who loved us is gone, will give us some protection forever,\" Dumbledore says.\nAs a first-time mother to a months-old daughter, I’ve started to pay attention to the portrayals of mothers in literature a tad differently than in my pre-partum days. The goddess myth and “Mommie Dearest”s, the Suzy Homemakers and wicked stepmothers, free-range moms and helicopter moms — mother figures whose archetypes existed before we had campy names to describe them. Many moms, I imagine, relate to and despair of these tropes to varying degrees.\n\"It is then that readers learn — in the very first book of the Harry Potter series... that what makes 11-year-old Harry so special is not any particular ability he has to defeat the Dark Lord of the Wizarding World, but rather the magic left behind by the self-sacrificial love of his mother.\"\nBut the story of Harry Potter is a fantasy, and so the mothers we find there are fantasies as well. Molly Weasley is arguably the most familiar magical momma of the Wizarding World — frazzle-haired and soft in all the hug-able places, she knits monogrammed sweaters, keeps tabs on her ample brood, and always has room for one more at the table. What keeps her at arm’s length of the goddess myth is her bemused impatience with her sons’ antics, the organized chaos with which she arranges her life, and her ability to charge into battle without a moment’s hesitation. Also, I’d venture a guess that the Weasleys have eaten sugary cereal for dinner a time or two.\nNarcissa Malfoy couldn’t be more different from Mom Weasley. A follower of Lord Voldemort, a classist and blood purist, she’s not one you’d run to for a snuggle or a steaming mug of butterbeer when in need. She’s the wicked mum of the bunch. Nonetheless, she too risks her safety and well-being in order to protect her son, Draco, during the Battle of Hogwarts.\nLily Potter is the idealized mom with a legacy that is wholly self-sacrificing and nearly impossible to live up to. In her early twenties when she died to save the life of infant Harry, she didn’t have the opportunity to actually make any of the mistakes that all moms inevitably do. As a mommy martyr — one whom her son dreamed of knowing his entire young life — she’s the standard against which all the other Wizarding mums are measured.\nBut there’s another mom whose presence is critical to the Harry Potter series — and she’s the Harry Potter mom who, while perhaps easily overlooked by readers at first, is the one I, as a new mom myself, find the most relatable, the most compelling, the most inspiring: J.K. Rowling.\nAs a single mother who has shared her story of struggling to find a sustainable income post-baby, facing stigma for being an unwed mother, and using the support of government benefits while writing her bestselling novel, J.K. Rowling is the real mom-hero of Harry Potter. While I’m not a single mother myself, I was raised by one, and I have a partner whose career frequently takes him away from home for weeks and months at a time, leaving me to manage practically all of the childcare on my own. As a new mother, I know what it feels like to steal a precious five, maybe ten minutes of writing in between all the constant tasks involved in caring for a tiny human. I identify with the struggle to balance twin desires: offering my daughter the best care possible, while pursuing my insatiable need to put words on to pages, every single day.\nAs a single mother who has shared her story of struggling to find a sustainable income post-baby, facing stigma for being an unwed mother, and using the support of government benefits while writing her bestselling novel, J.K. Rowling is the real mom-hero of Harry Potter.\nDo I revere the self-sacrificing mothers Rowling filled her bestselling novels with? Sure. But I will never be them. (I mean, fine, if Voldemort threatens my baby he’s definitely toast. But baring that wholly unlikely event, the martyrdom particular to motherhood isn’t a call I feel it in my heart to answer.)\nI’m not sure why Rowling chose to fill her series with mothers who so quickly forego their own lives for their children’s. (Even Petunia Dursley put Dudley at the center of her world.) Perhaps the maternal expectations of the Wizarding World aren’t so different from our own. But what I do believe is that my daughter will benefit from a mother who, rather than relinquishing her life, lives her life — and makes art, and puts good words out into the world that mean something to someone. That, as a mother, is what a writer like J.K. Rowling means to me.","url":"https://www.bustle.com/p/harry-potter-is-filled-with-dynamic-mothers-but-theres-one-that-has-impacted-my-own-motherhood-experience-more-than-any-other-9768278"}
