{"authors":["Laurie Whitwell For Mailonline"],"date_download":"2018-10-23 03:54:06","date_modify":"2018-10-23 03:54:06","date_publish":"2016-01-29 19:26:05","description":"LAURIE WHITWELL - EXCLUSIVE: George Moncur is more aware than anybody of Harry Kane’s potential for reacting badly should Colchester United inflict an FA Cup shock.","filename":"data/vaneerConsumption/HarryKanemaycontrolhisemotionsonthepitchbuthehasadifferentsideonthegolfcoursesaysclosefriendGeorgeMoncurasTottenhampreparetofaceColchester.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B561E200000578-0-image-a-19_1454102873432.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423338_Harry-Kane-control-emotions-pitch-different-golf-course-says-close-friend-George-Moncur-Tottenham-prepare-face-Colchester_1540266846.html","title":"Harry Kane may control his emotions on the pitch but he has a different side on the golf course, says close friend George Moncur as Tottenham prepare to face Colchester","title_page":"Harry Kane may control his emotions on the pitch but he has a different side on the golf course, says close friend George Moncur as Tottenham prepare to face Colchester  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"George Moncur is more aware than anybody of Harry Kane’s potential for reacting badly should Colchester United inflict an FA Cup shock on Tottenham Hotspur.\nThe pair of footballers operating at different levels of the football ladder are good friends, and regularly golf together. Kane comes across as a player in control of his emotions, but one particular occasion out on the course paints a different picture.\n‘I remember this one matchplay game, we were in a team against my brother and his mate,’ Moncur tells Sportsmail. ‘We were four up with four to play, cruising. All we needed was to draw a hole. Me and Harry were cracking up on the 15th tee, laughing.\nHarry Kane has been in terrific goalscoring form for Tottenham despite his slow start\nColchester midfielder George Moncur (left) is hoping to face his friend in the FA Cup fourth round\nKane is known to be a keen-golfer and posted a picture of Instagram when he played at Albany\n‘My brother and his mate have gone birdie, birdie, par, so now we’re only one up with one to play. We’re feeling it. Next thing they throw another birdie out and it’s gone to a play-off hole. We’re properly nervous now.\n‘They hit one down the middle, I went in the bunker, then they chipped in for the win. Me and Harry have lost our heads.\n‘We normally played for lunch or something but Harry just got in his car and drove home, he was fuming. I snapped my driver in half. We were raging, didn’t say a word to them. He has a different side on the golf course!’\nMoncur is aiming to draw out that same fury in Kane when Spurs visit Essex, their friendship spawned from playing at Spurs together aged nine, and then from 16 as their families lived close by.\nThe pair have been friends for years and regularly golf together or go on holiday (pictured in Dubai)\nIt's likely to Mauricio Pochettino will rest his prized asset when they travel to Essex on Saturday\nThe England striker may not feature against the side bottom of League One but Moncur knows Mauricio Pochettino will still field a team full of talent.\n‘Anything is possible on the pitch and whatever team they put out will be strong,’ says Moncur. ‘It’s just about us playing well as a team and doing our individual stuff that might cause an upset, not worrying about too much what they have to offer. If we all pull together we can get something out of it.’\nColchester are on a difficult run, only winning three games since October 24 – all in the FA Cup – leaving them seven points from safety in the third tier. Wealdstone, Altrincham, and Charlton have been beaten in welcome respite from league football.\nMoncur is a key player for Colchester and played vital role in helping them avoid the drop last season\nMoncur scored in the win over Charlton, his tenth goal of the season from midfield in his most productive campaign to date.\n‘My target is 15 to 17 goals,’ he says. ‘You always want to try and get to your targets. If I aim quite high I’ll hopefully get rewarded in the end.’\nMoncur, who was at West Ham United until November 2014, has attracted attention from higher divisions, and a good performance in front of the television cameras may harden interest.\n‘I want to play at the highest level possible. Whether that’s in two years or five years,’ he says. ‘I have high ambitions for myself. I know I have the technique and ability to play at that level it’s just a case of showing it week in week out.’\nMoncur started his career at West Ham before dropping down the divisions to sign for Colchester\nMoncur has been on the other end of an FA Cup upset, part of the West Ham team beaten 5-0 by Nottingham Forest when Sam Allardyce fielded a youthful side in a new formation that exposed those making debuts.\n‘Sam is a good manager but he’s not really renowned for playing youngsters,’ says Moncur. ‘We were quite shocked when he put us all in. Sometimes it pays off, unfortunately that day it didn’t pay off at all.\n‘You have to take the positives from everything. It wasn’t a good day for me personally and for the team. But I am believer in God and that everything happens for a reason. That made me a better person and player.’\nThe talented midfielder has clubs watching his progress and Moncur wants to play at the highest level\nHe is emerging from the shadow of dad John, who became a hero at West Ham, playing more than 200 games between 1994 and 2003. Last season he scored a dramatic winning goal against Preston on the final day to save Colchester from relegation, and his displays this campaign speak of increasing maturity.\nBut Moncur Sr will still find areas to improve. ‘He’s my worst critic,’ says Moncur. ‘Even when I’ve scored goals in games he has had something negative to say, which I actually like. I am the sort of character who if everyone was telling me good things I would relax a bit more.\n‘He just wants me to be the best I can each game. He’s really quite harsh with me. But I prefer that than being patted on the back because I know I can always improve and he is pushing me on to do more and more each game.’\nDoing it against Spurs will catch the eye. And possible send his mate Harry over the edge.","url":"https://www.dailymail.co.uk/sport/football/article-3423338/Harry-Kane-control-emotions-pitch-different-golf-course-says-close-friend-George-Moncur-Tottenham-prepare-face-Colchester.html"}
