{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:22:30","date_modify":"2018-10-30 19:22:30","date_publish":"2015-03-11 15:09:43","description":"Breitbart News asked Peter M. Koski, the Department of Justice attorney leading the investigation into Sen. Robert Menendez, how Sen. Harry Reid’s conduct differs from Menendez’s and why Reid himself is not under federal investigation on similar charges of corruption. We have not received a response. |","filename":"data/vaneerConsumption/HarryReidSetUpSebeliusMeetingwithMenendez2MonthsAfterDoctorWhoOverbilledMedicareGaveSuperPAC300k.json","image_url":"https://media.breitbart.com/media/2015/03/Reid-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_11__1540927350.html","title":"Harry Reid Set Up Sebelius Meeting with Menendez 2 Months After Doctor Who Overbilled Medicare Gave SuperPAC $300k","title_page":"Harry Reid Set Up Sebelius Meeting with Menendez 2 Months After Doctor Who Overbilled Medicare Gave SuperPAC $300k | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Even before he’s officially indicted on federal corruption charges, the case against Senator Robert Menendez seems to be expanding to involve another powerful senator.\nThe New Jersey Democrat met with Centers for Medicare and Medicaid Services (CMS) Director Marilyn Tavenner on June 7, 2012 in an apparent attempt to persuade her that his close friend and major donor, Dr. Salomon Melgen, did not owe the federal government $9 million for Medicare overbilling.\nIt was a pure New Jersey-style political power play on Menendez’s part, since the CMS had carefully documented Melgen’s egregious violation of clear and widely understood billing practices.\nTavenner was unpersuaded by Menendez’s pitch. He reportedly left the meeting frustrated he had not been able to deliver a solution to his friend’s problems with the government.\nMenendez decided to turn up the political pressure by speaking to Tavenner’s boss, Secretary of Health and Human Services (HHS) Kathleen Sebelius.\nThe very next day — June 8, 2012 — Melgen (through Vitreo-Retinal Consultants, the company HHS said overbilled the federal government by $9 million) contributed $300,000 to the Senate Majority PAC, a super PAC closely aligned with Senator Harry Reid (D-NV). Reid was the Majority Leader then and is currently the Minority Leader. Founded in 2011, the super PAC is co-chaired by two former top staffers from Reid’s office.\nIronically, the funds for this generous contribution may well have come from the $9 million CMS says the federal government overpaid Melgen because of his overbilling. CMS has asked for Melgen to repay that money, but Melgen apparently has other uses for it and is fighting desperately to hang on to it.\nShortly thereafter, Menendez began pressuring Reid to go over Tavenner’s head and set up a meeting with Sebelius where he could again make the case that his friend really didn’t owe the federal government that $9 million CMS said he had overbilled.\nThe lobbying of Reid by Menendez and his friend Melgen soon became very personal.\nReid’s subsequent use of his power as the Senate Majority Leader to advance Melgen’s private business interests raises obvious red flags that federal prosecutors have apparently ignored so far.\nBreitbart News asked Peter M. Koski, the Department of Justice attorney leading the investigation into Menendez, which is widely reported to soon result in a grand jury returning a bill of indictment on corruption charges, how Reid’s conduct differs from Menendez’s and why Reid himself is not under federal investigation on similar charges of corruption. We have not received a response.\nAs Politico reported in 2013, Melgen’s private jet flew from Florida to Reagan National Airport in Washington, D.C. on June 17, 2012, presumably carrying Melgen. The next day, on June 18, Melgen’s private jet flew Reid from Reagan National Airport in Washington, D.C. to Boston and back. It is unclear if Melgen accompanied Reid on that flight, but if he did, the two would have had plenty of time to discuss Melgen’s Medicare overbilling problems, his potential future political donations to Reid’s Senate Majority Super PAC, and what Reid might be willing to do to advance his business interests.\nFederal Election Commission records show that the Senate Majority PAC reimbursed Vitreo-Retinal Consultants $4,160 for “travel” on July 10, 2012, three weeks after the flight.\nSenator Reid’s spokesperson later confirmed to Politico that the reimbursement was for Reid’s travel on Melgen’s private plane to Boston on June 18.\nThe trip apparently strengthened the developing political and business relationship between Melgen and Reid.\nOn June 28, 2012, Melgen’s Vitreo-Retinal Consultants contributed an additional $100,000 to Reid’s Super Majority PAC.\nThe next week, on July 2, 2012, Menendez spoke on the phone with CMS’s Tavenner, but made no progress in ending Melgen’s $9 million overbilling problem.\nOver the next several weeks, Menendez succeeded in persuading Reid to convince Secretary Sebelius to meet with him in person. Reid seems to have summoned Sebelius to Capitol Hill for a meeting with Menendez that he would host in his Senate Majority Leader’s offices.\nReid briefed Sebelius that the purpose of the meeting was to address “billing issues with Dr. Melgen,” as she told Politico on Monday.\nBut Politico reported that “Sebelius said she was ‘concerned that I knew enough about the investigation’ into Menendez’s actions that she ‘didn’t want to open the door to any inappropriate discussion’ during their meeting.”\nWorried that the meeting might place her in legal jeopardy, Sebelius told Politico she consulted with HHS’s counsel’s office prior to the meeting.\nAccording to Politico, “HHS attorneys assured her that she could meet with Menendez, and she said she told the senator the dispute was being handled by an outside administrative review board.” Breitbart News asked HHS General Counsel William B. Schultz, who was acting general counsel in 2012, to confirm Sebelius’s account but has not received a response.\nAs an added precaution, Sebelius decided to bring Jonathan Blum, deputy administrator of CMS, to the meeting. An expert on the billing policies and procedures required by law to be filed in Medicare reimbursements, Blum’s role was to firmly reiterate the CMS case against Melgen.\nThe meeting between Reid, Menendez, Sebelius, and Blum took place on August 2, 2012.\nAt the meeting, Sebelius says Menendez pushed for HHS to drop $9 million overbilling claim against Melgen’s Vitreo-Retinal Consultants. Blum laid out the details to Menendez, who once again protested the conclusions. Reid, for the most part, Sebelius told Politico, was quiet, his role having been primarily to facilitate the meeting.\nThrough a spokesperson, Menendez denied discussing anything but legislative matters in the August 2 meeting with Sebelius and Reid.\nIn a carefully parsed phrase, Menendez’s spokesperson Tricia Enright said “the senator did not mention Melgen during their meeting.”\nIt was the same language Menendez’s attorneys used to describe the meeting in a brief they presented to the Court of Appeals for the Third Circuit where they argued that one of Menendez’s aides who arranged the August 2 meeting, Michael Barnard, should not be compelled to answer 50 questions posed by the grand jury investigating Menendez.\nThe attorneys claimed that as a legislative aide working only on legislative matters, Barnard could not be compelled to answer questions about the meeting because he legitimately invoked the speech or debate clause of the Constitution.\nNeither Enright nor Menendez’s attorneys offered any comment on whether the name of Melgen’s company, Vitreo-Retinal Consultants, was mentioned by Menendez or anyone else at the meeting.\nThere is no indication that either Reid or Menendez disclosed to Sebelius that the company that overbilled Medicare $9 million (completely controlled by Melgen) had recently donated $400,000 to Reid’s SuperPAC.\nBreitbart News posed that question to Secretary Sebelius but has not received a response.\nBreitbart News also posed the same question to Senator Menendez and Senator Reid but received no response.\nBreitbart News also posed the question to former deputy administrator Blum, who now serves as executive vice president of medical affairs at CareFirst Blue Cross Blue Shield, and received no response.\nBreitbart News also asked Blum to weigh in on the dispute between Sebelius and Menendez on whether or not Melgen’s $9 million Medicare overbilling problem was discussed.\nOn October 16, 2012, Melgen’s Vitreo-Retinal Consultants donated another $300,000 to Reid’s Super Majority PAC, bringing the company’s total contributions in 2012 to $700,000.\nIn November 2012, Menendez was easily re-elected to another six year term in the Senate, defeating his Republican rival by a 58 percent to 39 percent margin.\nIn January 2013, the FBI raided the offices Vitreo-Retinal Consultants in Florida, presumably to obtain evidence to be used by the Department of Justice in its ongoing investigation of Menendez and Melgen.\nIn the spring of 2014 the FBI interviewed Reid and Sebelius about the August 2, 2012 meeting with Menendez. Neither have been called before the grand jury that will reportedly return a bill of indictment against Menendez on corruption charges within the next few weeks.\nIt is unclear whether former CMS deputy administrator Blum was interviewed by the FBI or was called to testify before the grand jury.\nIf, as is expected, the grand jury shortly returns a bill of indictment against Senator Menendez on corruption charges, the question on the minds of many critics who say the Department of Justice is highly politicized will be this:\nGiven the known facts of the relationship between Dr.Salomon Melgen, his company Vitreo-Retinal Consultants, Senator Menendez, Senator Reid, and the Senate Majority PAC, why has the Department of Justice not initiated an investigation into possible corruption charges against Senator Reid as well?","url":"https://www.breitbart.com/politics/2015/03/11/harry-reid-set-up-sebelius-meeting-with-menendez-2-months-after-doctor-who-overbilled-medicare-gave-superpac-300k/"}
