{"authors":["Kelly Schremph"],"date_download":"2018-10-31 01:46:22","date_modify":"2018-10-31 01:46:22","date_publish":"2018-09-11 16:44:34","description":"Bachelor in Paradise may be handing out some of its final roses of the season this week, but pretty soon there will be yet another reality television series that begins dominating our time and attention on Monday nights. Dancing With the Stars is…","filename":"data/vaneerConsumption/HarryPotterStarEvannaLynchJoinsDancingWithTheStarsLunaLovegoodWouldTotallyApprove.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/11/84fc9228-f770-437d-92a1-9a55a96d98c2-getty-649451036.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_harry-potter-star-evanna-lynch-joins-dancing-with-the-stars-luna-lovegood-would-totally-approve-11868409_1540950382.html","title":"'Harry Potter' Star Evanna Lynch Joins 'Dancing With The Stars' & Luna Lovegood Would Totally Approve","title_page":"'Harry Potter' Star Evanna Lynch Joins 'Dancing With The Stars' & Luna Lovegood Would Totally Approve","title_rss":"NULL","source_domain":"bustle.com","text":"Bachelor in Paradise may be handing out some of its final roses of the season this week, but pretty soon there will be yet another reality television series that begins dominating our time and attention on Monday nights. Dancing With the Stars is gearing up for its twenty-seventh season, and while the entire cast has yet to be announced, some details about the ensemble have started to trickle out. One recent piece of information is that Harry Potter star Evanna Lynch has joined DWTS, as reported by Us Weekly.\nFor those of you who need a minute to recognize the name, Lynch played the iconic (and highly lovable) character of Luna Lovegood in the final four films of the Harry Potter franchise — Harry Potter and the Order of Phoenix, Harry Potter and the Half-Blood Prince and Harry Potter and the Deathly Hallows Part 1 and Part 2. Though she always had a unique and sometimes quirky view of the world, Luna was consistently loyal to Harry and became a full-fledge member of Dumbledore's Army (also known as the DA) during Voldemort's rise to power. She was also known for having confidence in who she was and refusing to apologize for her eccentric personality — an admirable quality that made her easily beloved by fans worldwide. So having the actress who portrayed her be part of the latest Dancing With the Stars cast is nothing short of exciting.\nBut, of course, Lynch isn't the only star who is rumored to be gracing the ballroom floor this fall in an attempt to win the highly coveted Mirrorball trophy. Us Weekly previously reported that Nancy McKeon, Mary Lou Retton, Bobby Bones, Alexis Ren, John Schneider, DeMarcus Ware, Danelle Umstead, and Juan Pablo Di Pace would also be joining the dancing line-up for Season 27. Meanwhile, ABC revealed on Good Morning America this Tuesday, as per Entertainment Tonight, that Disney star Milo Manheim will be paired up with Dancing With the Stars pro Witney Carson for the upcoming season.\nSuffice it to say, Lynch may have some pretty stiff competition on her hands. (Something tells me these dances are going to prove to be a lot more complex than anything she may have picked up during the Yule Ball.) Either way, it's certainly going to be fun to see where Lynch will fall in the dancing spectrum. Luna would undoubtedly just have a good time and not worry about the judges, or cameras, or what anyone else thinks, for that matter. Lynch, on the other hand, may prove to be a bit more competitive. Regardless, this is one season you aren't going to want to miss.\nThe full cast list will be announced on Good Morning America this Wednesday, Sept. 12 to help give fans an even better idea of what the competition will really look like. But if Luna were an actual human person and not a fictional creation, she would definitely approve of Lynch's decision to take part in it all. Let's hope she's able to stick around all the way until the finale.","url":"https://www.bustle.com/p/harry-potter-star-evanna-lynch-joins-dancing-with-the-stars-luna-lovegood-would-totally-approve-11868409"}
