{"authors":[],"date_download":"2018-10-30 01:07:49","date_modify":"2018-10-30 01:07:49","date_publish":"2018-07-11 21:13:51","description":null,"filename":"data/vaneerConsumption/HarryPotterandtheReasontoReadAnotherBook.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/voldemort-prequel-promo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861669.html","title":"Harry Potter and the Reason to Read Another Book","title_page":"Harry Potter and the Reason to Read Another BookThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Harry Potter series is the defining work of literature for many Millennials. It has no doubt had an impact, and despite being a children’s series, it is something that many people have carried a love of into adulthood. But, there is a difference between loving a children’s series and using it as the basis for your moral and political arguments as an adult. Books for children intentionally create situations with good-vs.-evil-cut-and-dried morality, but that is not the way that real life is.\nThis was taken to a whole new level in an article put out yesterday by Grist, wherein, Supreme Court Nominee Brett Kavanaugh was called “The Lord Voldemort of the environment”. The person delivering this ad hominem was ironically named Bill Snape, and is senior counsel at The Center for Biodiversity as well as a senior fellow at American University. Not only did the article make this comparison, it also assigned each supreme court justice a Harry Potter character. Instead of focusing on describing the justices in substantive terms, it sunk to assigning them each to a character, not suprisingly characterizing the more liberal justices as heroic and the more conservative ones as villainous. Although clickable, this is not exactly high-quality journalism. It leaves much to be desired in the way of actual informative content or statements on particular policy that don’t rely on Harry Potter for their substance.\nLooking at any politician or movement with whom you disagree as though they are “death eaters” hellbent on the destruction of life as you know it will not allow a nuanced view of political reality. What it will do, though, is make every difference of policy opinion appear as an existential threat. This isn’t healthy, it isn’t productive, and it is not how reasonable adults who have read actual philosophical, political and historical texts should carry out their discourse with one another. Harry Potter is used to explain or comment on many present political realities, but instead of going back to a series of books that was read in childhood, what if we looked to scholarly sources to underpin our arguments?\nHarry Potter has been referenced in issues from Brexit, to authoritarianism in government, to elections. Getting children thinking about things is not the same as providing a well-developed explanation with historical evidence. Children’s fiction can touch on what is real, but it is not the purpose of fiction to provide the sort of depth in these issues that a real substantive argument requires.\nMany adult works of fiction are political allegories, and in no way should their validity be decried, or impact minimized. George Orwell’s Animal Farm and Aldous Huxley’s Brave New World, for example, have had broad impacts and caused wide discussion of important questions. But even these more nuanced books for adults aren’t capable of being standalone sources; they require broader context and information. They cannot be one’s only source.\nOne must go further than fiction to make good points for the real world. The issues about which Harry Potter analogies are made often deserve comment. But, that discussion should hinge on better sources.\nIf you want to make an argument about the law, it’s extent, and purpose, try Frederic Bastiat’s The Law, or Beccaria’s Crimes and Punishments. If you’re looking to explain how malice and underhandedness operate in politics, read Machiavelli’s The Prince, instead of referring to every political figure you fear or dislike as Voldemort. Or, if you prefer the historical to the political angle, read up on the Borgias in 15th century Spain. If you fear authoritarian government and want to better understand democracy, read Hannah Arendt’s The Origin of Totalitarianism or Alexis de Tocqueville’s Democracy in America.\nBut, really the point isn’t which specific texts you turn to. What is really of importance is that instead of holding up flimsy, infantile straw men from our youth, we should build up real arguments. Ones with meat that hold up to the test of political reality. It’s great that the Harry Potter books got kids thinking about big issues, but the generation that grew up with those books aren’t kids anymore, and continuing to rely on them in making political points loses credibility. If young people want to be taken seriously, they need to be serious. Young people have ideas worth sharing, and when they don’t raise our arguments and analogies to the standards of which they are capable, they do themselves a great disservice. Go to primary and historical sources, build arguments that hold up, and then use them to persuade your audience.","url":"https://spectator.org/harry-potter-and-the-reason-to-read-another-book/"}
