{"authors":["Press Association"],"date_download":"2018-10-23 00:38:05","date_modify":"2018-10-23 00:38:05","date_publish":"2016-01-29 13:44:49","description":"Prince Harry has helped rescue a wheelchair-bound woman taking part in the Invictus Games trials. When a gust of wind blew Anna Pollock's finely-balanced rac...","filename":"data/vaneerConsumption/Harryleapstotherescueforinvictusgamestrialist.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-323a9c59-7b91-444e-ac3d-c82af4616549-3bmscybNe842cce83474b563510f-57_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422750_Harry-leaps-rescue-Invictus-Games-trialist_1540255085.html","title":"Harry leaps to the rescue for invictus games trialist","title_page":"Harry leaps to the rescue for invictus games trialist | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Harry leaps to the rescue for Invictus Games trialist\nPrince Harry has helped rescue a wheelchair-bound woman taking part in the Invictus Games trials.\nWhen a gust of wind blew Anna Pollock's finely-balanced racing chair over, Harry was one of the first to go to her aid.\nThe prince had been cheering on athletes competing for places on the UK team which will travel to the Invictus Games being staged in Florida in May.\nPrince Harry attends the UK team trials for the 2016 Invictus Games\nMs Pollock, 33, an RAF medic from Middlesbrough, had posed for a picture with Harry moments before her mishap on a wet and windy running track at the University of Bath Sports Training Village in Bath.\nShe said: \"I wanted a picture and I thought, if I don't do it now I'm never will, so I went to get a picture (with Harry). Afterwards I was putting my gloves on when the wind took me over.\"\nThe athlete, who is hoping to represent the UK in a range of events from the 100m up to the 1500m, said: \"Harry said to me 'what did you do that for?' and I said 'are you sure you had nothing to do with it?'\"\nThe competitors have been training hard for the three-day trials which could earn them selection for the Games - a Paralympic-style championship.\nHarry has been the driving force behind the Games, first staged in the UK in 2014 to great acclaim from the competitors and spectators.\nIt aims to challenge wounded, sick or injured service personnel, and those who have left the armed forces, to strive for sporting excellence.\nThe prince launched the latest Games during a visit to the US last year when he got the backing of president Barack Obama.\nDuring a White House meeting, the American leader said the sporting event was \"an initiative that is bringing together wounded warriors from around the world under the leadership of Prince Harry and others, to make sure we see not simply the sacrifices they've made, but also the incredible contributions, strength and courage they continue to display\".\nThe trials are being run by Help for Heroes with support from the Ministry of Defence and The Royal British Legion.\nThe men and women taking part will compete across 10 sports for one of the 100 places available on the UK team.\nToday marks 100 days to go until the start of the Invictus Games, which will be held from May 8 to 12.\nThe trials were held at University of Bath Sports Training Village\nThis year's games will be held in Orlando\nAnna Pollock slips out of her racing chair during the UK team trials\nPrince Harry helps Anna Pollock after she fell over during the Invictus trials\nAnna is hoping to make the team to compete in Florida later in the year\nHarry also spoke to the team hopefuls before they took to the track\nHarry has been the driving force behind the Games, first staged in the UK in 2014\nHarry posed for photos with the competitiors\nCompetitors will also take part in field events","url":"https://www.dailymail.co.uk/wires/pa/article-3422750/Harry-leaps-rescue-Invictus-Games-trialist.html"}
