{"authors":["Brian Marjoribanks For The Scottish Daily Mail"],"date_download":"2018-10-22 21:21:01","date_modify":"2018-10-22 21:21:01","date_publish":"2017-03-16 00:59:04","description":"Paul Hartley's prayers were answered with the arrival of Brendan Rodgers; an appointment that ushered some badly needed sunlight into a national game on the verge of collapse","filename":"data/vaneerConsumption/HartleynotplanningonholdingtitlepartyforCeltic.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4D1A5600000578-0-image-a-54_1489625892522.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4318514_Hartley-not-planning-holding-title-party-Celtic_1540243261.html","title":"Hartley not planning on holding title party for Celtic","title_page":"Hartley not planning on holding title party for Celtic | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In the eyes of Paul Hartley, Scottish football was struggling and screaming out for a sprinkling of stardust.\nThe Dundee manager's prayers were duly answered last summer with the arrival of Brendan Rodgers at Celtic; an appointment that ushered some badly needed sunlight into a national game on the verge of collapsing into a black hole of negativity.\nSince the spectacular collapse of Rangers in 2012, thrilling title races have been replaced by a bitter cocktail of in-fighting and self-flagellation at the declining standards at club and international level.\nPaul Hartley was presented with the Premiership Manager of the Month on Wednesday\nSo for Celtic to successfully hire a manager who just two years previously had been within a Steven Gerrard slip of winning the English Premier League with Liverpool was a huge and timely fillip for the Scottish Premiership and its ailing reputation.\nA look at the current league table shows Celtic are now light years ahead of their rivals; with the lack of a domestic defeat all season underlining the impact Rodgers has had at Parkhead.\nAnd should Aberdeen lose to Hearts on Saturday, the 44-year-old's side would be a victory at Dundee 24 hours later away from the earliest Scottish top flight title since Rangers on March 16, 1929.\nShould that happen, it would beat by one week the most recent record, set by Neil Lennon's Celtic as they crossed the line on March 26, 2014 with a 5-1 win at Partick Thistle.\nJust because no rival boss has been able to get Rodgers' number on the park this season, though, does not mean the situation is the same off the field.\nUpon arriving, the Northern Irishman did not let his star billing prevent him from generously opening lines of communication with his rival Premiership bosses.\nBrendan Rodgers' side could win the title this weekend with the right results\nYet for all Hartley's deep professional admiration for Rodgers, he will be trying his best to ensure the first league title victory of the Celtic manager' s career does not come on his Dens Park turf on Sunday.\n'Brendan Rodgers has done an outstanding job for Celtic,' said Hartley. 'He's an excellent manager and anybody that meets him and talks about him knows he has got something about him.\n'I think he's been an excellent addition to Scottish football and he's been something that we needed. There had been a lot of negativity surrounding the game, not just domestically but around the national team too.\n'But bringing Brendan Rodgers in and the quality of football that he has brought to Celtic has been good to watch. To go through the season domestically unbeaten so far is a fantastic achievement.\n'Have I been surprised by his smooth integration into Scottish football? No, he' s an outstanding manager but he's also someone who has got a lot of time for other managers.\n'The first time he came into my office earlier this season he gave me his number straight away. We've had a chat and a couple of text messages since. He's somebody you can pick the phone up and talk to.\nCeltic players celebrate their goal during the 1-1 draw with Rangers on Sunday\n'That tells you the type of person that he is. He's got time for everybody and any time I've been in his company, he's been excellent.\n'You always want to pit your wits against the top managers and there is no doubt that Brendan Rodgers is one of the top managers in Britain.\n'It would be nice to be the first team to beat them this weekend, but it will be difficult. It wouldn't matter to me if Celtic were not going for the title on Sunday. It would still be an important game for us.\n'Of course, it might have that little added edge to the game if results go their way on Saturday and they come here on Sunday.\n'But Celtic winning the title is not what we want on our patch. We need the points as much as Celtic and we also want to put on a show.' Former Hearts, Celtic and Scotland midfielder Hartley has also been pleased by the calibre of signings Rodgers has lured to Scotland.\nYet while £30million rated Moussa Dembele and Scott Sinclair have stolen most of the limelight, the home-grown Scott Brown has been no less influential.\nOnce the man Hartley loved to hate, the 40-year-old has long been a fan of the Parkhead captain.\n'I think Scott Brown has matured as a footballer,' said Hartley, who was yesterday named Ladbrokes Premiership manager of the month for February after beating Rangers at Dens Park in the league for the first time since 1992 and recording a thumping 5-1 victory at Motherwell.\nDundee manager Hartley does not plan on holding a title party for the Hoops this weekend\n'He is having an outstanding season and he looks injury-free, strong, and fit.\n'When I played against him we had good battles but I didn't really like him! 'He was annoying. He would slag you, be cheeky, kick you, everything – but he was an outstanding prospect and when he is on your team you really appreciate him.\n'We are actually good pals now. He is a real gentleman off the pitch. I can phone him up and ask him for anything…' Hartley himself knows what it is like to be a Celtic player clinching the title in the City of Discovery.\nHe was one of the chief architects of the unlikely 2008 triumph sealed with a 1-0 last day win at Dundee United, with Brown a second half substitute.\n'We had to win all seven of our last games to win the title and doing it on the final day will always live with me,' he recalled.\n'It's different circumstances now with Celtic so far ahead but they will be trying to get the championship sewn up as soon as possible.\n'They are an excellent team with outstanding players. The points gap is massive because of the quality they possess.\n'It's difficult for the rest of Scottish football but all we can do is try and perform the best that we can. And we have been competitive against Celtic this season.\n'There's still a chance for us to finish top six but making sure we are safe has always been our first priority.\n'I think for top six we need to win three out of the five games before the split. That's easier said than done but we'll certainly have a go.'","url":"https://www.dailymail.co.uk/sport/football/article-4318514/Hartley-not-planning-holding-title-party-Celtic.html"}
