{"authors":["Christine Distasio"],"date_download":"2018-10-30 22:29:08","date_modify":"2018-10-30 22:29:08","date_publish":"2014-08-15 15:11:50","description":"What was up with that Hart of Dixie Season 3 finale? After spending half of Season 3 building up Jaime King's Lemon Breelans as a new, improved, sexually liberated, independent woman, the series drummed up her old love triangle and it was the worst.…","filename":"data/vaneerConsumption/HartofDixieCastingSpoilersHintThatLemonGeorgeWillBeSplitUpByaNewGuy.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6ddf5e2d-204e-4c5d-b760-df75ac324120.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35397-hart-of-dixie-casting-spoilers-hint-that-lemon-george-will-be-split-up-by-a_1540938548.html","title":"'Hart of Dixie' Casting Spoilers Hint That Lemon & George Will Be Split Up By a New Guy","title_page":"'Hart of Dixie' Casting Spoilers Hint That Lemon & George Will Be Split Up By a New Guy","title_rss":"NULL","source_domain":"bustle.com","text":"What was up with that Hart of Dixie Season 3 finale? After spending half of Season 3 building up Jaime King's Lemon Breelans as a new, improved, sexually liberated, independent woman, the series drummed up her old love triangle and it was the worst. We still don't know when Hart of Dixie Season 4 will premiere and all fans are wondering about Zoe Hart's Season 4 pregnancy, but there's another important question: Will Lemon be dating George or Lavon in Season 4? Hopefully, the answer is neither — because a Hart of Dixie Season 4 casting spoiler revealed that there's a new doctor in Bluebell and he's definitely going to be dating Lemon. And I don't want to hear anything else about it, ya'll.\nYes, another Bustle writer speculated that the introduction of Ian Anthony Dale as Dr. Henry Dalton might mean trouble in Zade paradise. But we've all learned the hard way that Zoe Hart does not do well with other doctors (remember that disastrous date with the dentist last season?) and, well, she just declared her undying love for Wade. I can't see that changing between the Season 3 finale and the Season 4 premiere — love is love, people.\nSo, there's only one other explanation for Henry joining us in Bluebell: he's coming home with Lemon Breeland. And there are plenty of signs that he could be the one the keep her away from self-destructing with her former fiancé George Tucker and her former lover Mayor Lavon Hayes. Over the past few seasons, Dixie has introduced new men solely for the purpose of giving Lemon romantic conquests. Season 3 left off with Lemon going on a singles cruise (I know, that sounds depressing), but if we know Lemon — and I'd say we do by now — she's going to make the best of that. And, well, Henry seems like a pretty great guy.\nWhy am I so sure they're going to be together? Listen up:\nHe's A Well-Connected Southern Gentleman\nIf Lemon doesn't meet Henry on the \"S.S. Depression,\" she's definitely going to meet him through her tough-as-nails grandmother Bettie is going to set them up. Spoiler site CarterMatt caught a spoiler on Maree Cheatham's Twitter that she'd be reprising her role as Bettie Breeland on Season 4 of Dixie. According to her tweet, Cheatham will appear in the first two Hart of Dixie episodes in the upcoming season and if anyone has a rolodex of eligible Southern gentlemen, it's Grandma Bettie.\nIt's possible that, upon arriving empty-handed from her cruise, Grandma Bettie will set Lemon up with Henry, who just arrived back from a trip with Doctor's Without Borders.\nHe's Too Career-Oriented For Dating\nAnother possibility is that Henry's family is just as fed up as Grandma Bettie that their son hasn't settled down yet. So, again like Bettie, they booked him a spot on the same singles cruise as Lemon. When we left off with Lemon in Season 3, she seemed to be making the best of the cruise, chatting it up with some eligible bachelor on deck. So, there's no reason for us not to believe that she gave Henry a shot, even if she deigned to get on the boat in the first place. Maybe they commiserated about their families' insane interest in their love lives or the struggles of being Southern royalty.\nShe's Got A Thing For Guys Who Travel\nRemember Lemon's whirlwind romance with Peter? Robert Buckley's recurring character was a traveling photojournalist that wooed Lemon with tales of his travels around the world. So, it's definitely not counting against Henry that he's traveled around the world and helped people while he did it. What's not to love about that?\nHe'll Get Her Humor\nLemon can be kind of abrasive, but I can't deny she's mastered her self-depreciating humor over the past three seasons. And apparently, a major part of Henry's character, according to TVLine, is that Henry \"impresses with his lovely self-depreciating humor.\" Which is important, considering she really hasn't been able to get that with any of the guys she's dated recently — Carter Covington was a total square, Enrique had that language barrier thing going on, and Meatball was, well, Meatball. Lemon needs a smart guy (check) with a similar sense of humor (check) who will get her when she makes a sophisticated joke at her own expense and Henry is totally that guy.\nImages: Eddy Chen/The CW (2); The CW (Screengrab); Wifflegif (2)","url":"https://www.bustle.com/articles/35397-hart-of-dixie-casting-spoilers-hint-that-lemon-george-will-be-split-up-by-a"}
