{"authors":[],"date_download":"2018-10-22 22:55:20","date_modify":"2018-10-22 22:55:20","date_publish":"2014-05-12 23:58:53","description":"There’s no sympathy for the Devil in Harvard Yard.","filename":"data/vaneerConsumption/HarvardGroupGivesUponSatanicBlackMassAfterProtests.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437711/140512-110909-harvard-biz-hg-1957_ba4818452791229b7b298f80908f375c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_harvard-group-gives-satanic-black-mass-after-protests-n103736_1540248920.html","title":"Harvard Group Gives Up on Satanic 'Black Mass' After Protests","title_page":"Harvard Group Gives Up on Satanic 'Black Mass' After Protests","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThere’s no sympathy for the Devil in Harvard Yard.\nA Satanic ritual that was set to take place at the Ivy League university has been moved to an undisclosed location off-campus after the event caused an uproar.\nThe event, labelled a “Black Mass,” was being hosted by the cultural club at the Harvard Extension School.\nAfter protests about the demonic demonstration, which was scheduled for 8 p.m. Monday, the group looked for an another location, including the local bar “The Middle East,” but all negotiations fell through, the club said.\n“The Harvard Extension Cultural Studies Club regrets to announce that The Middle East will not be hosting this event,” read a statement from the club to NBC News. “Given that no other location has been willing to intercede, we will no longer be sponsoring this Black Mass.\n“The Satanic Temple has informed us that they will stage their own Black Mass ceremony at an undisclosed private location to reaffirm their respect for the Satanic faith and to demonstrate that the most powerful response to offensive speech is to shame those who marginalize others by letting their own words and actions speak for themselves.”\nSeveral groups both on campus and off had cried foul when they got word of the Satanic ritual’s planning.\nAmong them, were the Harvard Chaplains, a varied group of spiritual leaders at the school. In a statement they said “though the students have not released details of the performance they intend to stage, a “Black Mass” by its very nature typically involves the mockery and ridicule of the Christian sacrament of Holy Communion.”\nUniversity President Drew Faust had said she had planned to “attend a Eucharistic Holy Hour and Benediction at St. Paul's Church on our campus on Monday evening in order to join others in reaffirming our respect for the Catholic faith at Harvard and to demonstrate that the most powerful response to offensive speech is not censorship, but reasoned discourse and robust dissent.”","url":"https://www.nbcnews.com/news/us-news/harvard-group-gives-satanic-black-mass-after-protests-n103736"}
