{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 20:35:39","date_modify":"2018-10-30 20:35:39","date_publish":"2018-10-30 17:28:27","description":"On day 11 of the Harvard Asian-American discrimination trial, a group of students defended \"race-conscious\" admissions practices.","filename":"data/vaneerConsumption/HarvardAsianDiscriminationTrialStudentsClaimRaceBlindAdmissionsIsanActofErasure.json","image_url":"https://media.breitbart.com/media/2018/08/wi/afp/30/e579cc_students-play-football-snowstorm-on-campus-harvard-university-in-2015-e1540920502958.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_10_30_harvard-asi_1d7dab6ea69f1c01403847f6e3094998__1540931739.html","title":"Harvard Asian Discrimination Trial: Students Claim 'Race-Blind Admissions Is an Act of Erasure'","title_page":"Harvard Asian Discrimination Trial: Students Claim 'Race-Blind Admissions Is an Act of Erasure' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On day 11 of the Harvard Asian-American discrimination trial, a group of students defended “race-conscious” admissions practices.\nA group of Harvard students took the stand in a Boston courthouse on Monday to defend the university’s “race-conscious” admissions practice. Harvard senior Thang Diep, who was mentioned earlier in the trial by Harvard Admissions Dean William Fitzsimmons, told the court that he is at Harvard as result of affirmative action policies.\n“I wrote about my Vietnamese identity on my application because it was just a big part of myself,” Diep said. “I was tired of erasing my identity for so long… so I brought the power back in my college essay.”\n“I personally benefited from affirmative action,” Diep added. “It allows my immigration history to be taken into account, my own experiences taken into account.”\nSarah F. Cole, a black Harvard student, told the court that her application would have been incomplete if she was not able to mention her race. Cole, who grew up in a blue-collar family, claims a “race-neutral” admissions process would erase her identity.\n“Race-blind admissions is an act of erasure,” Cole said. “To not see my race is to not see me.”\nHarvard alumnus Margaret M. Chin, who graduated in 1984, said that she was intimidated by all of the rich white students in her Harvard class. “I never had met so many rich, white people in my life,” Chin said. “I was intimidated, especially in the classroom.” Chin said that she found her home on campus by joining an Asian-American student organization.\nMadison A. Trice, another black student, said that her love for Harvard is rooted in the school’s diverse community. “I think that my love for Harvard is entirely or mostly rooted in the people I encounter,” Trice said. “It would be a shame if that diversity is lost because it means the world to me.”\nThe trial is set to conclude at the end of this week. Stay tuned to Breitbart News for more updates.","url":"https://www.breitbart.com/tech/2018/10/30/harvard-asian-discrimination-trial-day-11-students-defend-affirmative-action/amp/"}
