{"authors":["Will Martin"],"date_download":"2018-10-30 22:33:59","date_modify":"2018-10-30 22:33:59","date_publish":"2016-12-13 00:00:00","description":"The Harvard Business Review published its list of top performing CEOs worldwide, but we decided to take a look at ones doing best on European soil.","filename":"data/vaneerConsumption/HarvardBusinessReviewBestperformingEuropeanCEOs.json","image_url":"https://amp.businessinsider.com/images/584fbdf5dd089544528b4a12-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_harvard-business-review-best-ceos-in-europe-2016-12_1540938839.html","title":"Harvard Business Review: Best performing European CEOs","title_page":"    Harvard Business Review: Best performing European CEOs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Heineken CEO Jean Francois van Boxmeer, and Reuters/Tomas Bravo The Harvard Business Review launched its annual ranking of the world's best-performing CEOs in November, listing the company bosses that are doing the best for their companies globally.\nThe ranking is created by looking at three key financial variables: the change in market capitalisation a CEO has overseen, the country-adjusted total shareholder return, and the industry-adjusted total shareholder return.\nHBR also measured what it calls ESG, or the environmental, social, and governance score. Some examples factored into ESG would include how much hazardous waste a company produces (environmental) and company diversity (social).\nThese four variables are then combined to give a score that helps identify how well a company is performing, and as a result how the CEO is doing.\nIn 2015's ranking, American CEOs dominated the list, but this year it is European companies who come out on top, with 18 of the top 25 bosses heading up European companies, and just one US boss in the top 10.\nCheck out all the Europe-based CEOs in the Harvard Business Review's top 25, below:","url":"https://www.businessinsider.com/harvard-business-review-best-ceos-in-europe-2016-12"}
