{"authors":[],"date_download":"2018-10-30 01:21:11","date_modify":"2018-10-30 01:21:11","date_publish":"2018-09-07 00:05:49","description":"If there was ever any question why Harvard University officials adamantly opposed the Trump administration’s rescinding of Obama-era guidelines for race-based admissions decisions, the answer is now clear.","filename":"data/vaneerConsumption/HarvardCaseCouldEndAffirmativeDiscrimination.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Harvard_college_-_annenberg_hall.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862471.html","title":"Harvard Case Could End Affirmative Discrimination","title_page":"Harvard Case Could End Affirmative DiscriminationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"If there was ever any question why Harvard University officials adamantly opposed the Trump administration’s rescinding of Obama-era guidelines for race-based admissions decisions, the answer is now clear.\nStudents for Fair Admission v. Harvard — set to go to trial October 15 in federal district court in Boston — could expose how affirmative action has morphed into a preferential scheme that sets one minority group against others. Even worse (and more ironic), modern affirmative action policies such as those being implemented at Harvard grossly violate the very civil rights they were meant to protect in the first place.\nThankfully, the Department of Justice (DOJ) is siding with students and parents who allege Harvard has instituted by stealth a racial-balancing scheme that deliberately limits admissions of highly qualified Asian students in a way that’s similar to the strategies used by Ivy League institutions in the early 20th century to exclude Jews.\nIn its official “Statement of Interest,” the DOJ pegged Harvard’s use of dubious personality ratings in its admissions policy as evidence it is skirting considerations of individual merit in an attempt to construct a predetermined mixture of racial/ethnic groups. That point goes to the heart of the plaintiffs’ complaint against Harvard.\nIn discovery, Students for Fair Admissions (SFFA) disclosed a memo indicating that in 2013 Harvard discovered (in an internal, never-released probe) that if admission officials judged applicants solely on their academic prowess, Asian students would have constituted 43 percent of the freshman class. Instead, they represented only 18.6 percent.\nSFFA presented an expert analysis alleging that Harvard is using the subjective “holistic” approach to admissions to deliberately score Asians lower on such qualities as “likeability,” “helpfulness,” “kindness,” and being “widely respected.” Meanwhile, Asian applicants clearly had the highest GPAs and test scores. In short, there was no way to reject their applications except to gratuitously insult them en masse.\nPresident Donald Trump’s decision to reverse the Obama directives on affirmative action has caused liberal elites to become hysterical. In fact, one might deduce the Trump administration was scuttling the body of case law and precedent supporting race as a factor in admissions and employment decisions. However, rather than acting via imperial edict, team Trump gave credit to the U.S. Supreme Court for its body of work on this issue while looking to it for further clarification.\nSecretary of Education Betsy DeVos explained the essence of the revised guidance for schools and colleges: “The Supreme Court has determined what affirmative action policies are constitutional, and the court’s written decisions are the best guide for navigating this complex issue. Schools should continue to offer equal opportunities for all students while abiding by the law.”\nSadly, Harvard University was among the liberal bastions of enlightenment wanting something far different than “equal opportunities.” Harvard elites viewed the heightened race-consciousness advocated by Obama sycophants as an opportunity to implement de facto racial quotas.\nAlthough some critics regard retiring Justice Anthony Kennedy as the swing vote that preserved affirmative action well beyond its usefulness, a string of cases effectively decided by Kennedy held that racial and ethnic classifications should undergo “strict scrutiny” and generally be disfavored. Moreover, Kennedy advocated that such policies should be used strictly as a plus factor in admissions.\nIn most cases, the intent of this process was to buttress diversity by increasing the numbers of black and Hispanic students. However, the Court majority has consistently held that case-by-case considerations must not become outright racial set-asides. In Grutterv. Bollinger, Justice Sandra Day O’Connor said it should be a “requirement” that affirmative action have a “termination point.”\nBy contrast, Roger Clegg of the Center for Equal Opportunity noted that the Obama guidelines ignored the Supreme Court’s limits and pushed for more race-based favoritism. “The whole tone of the new guidance,” Clegg said, “is to offer encouragement, legal help, and ‘technical assistance’ to schools that want to engage in racial and ethnic discrimination.”\nIt is possible that in a few years, Students for Fair Admissions v. Harvard could become the first challenge to affirmative action’s perverse setting of one minority group against others to come before a Supreme Court on which swing-vote Anthony Kennedy no longer sits.\nWhatever the composition of the High Court, the time has come to end group quotas and preferences in favor of each individual being judged on his or her merit.\nRobert Holland (holland@heartland.org) is a senior fellow for education policy at The Heartland Institute.","url":"https://spectator.org/harvard-case-could-end-affirmative-discrimination/"}
