{"authors":["Richard Shears For Mailonline"],"date_download":"2018-10-23 04:49:32","date_modify":"2018-10-23 04:49:32","date_publish":"2016-01-29 20:37:40","description":"'Body in a suitcase' killer Heather Mack, 20, from Chicago, has been seen cosying up to a new man in the notorious Kerobokan Prison, where she is serving ten years for her mother’s murder.","filename":"data/vaneerConsumption/HasbodyinasuitcasekillerHeatherMackdumpedtheboyfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B4E01200000578-0-image-a-2_1454099555148.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422890_Has-body-suitcase-killer-Heather-Mack-dumped-boyfriend-murdered-mother-Love-triangle-Mack-seen-getting-close-man-Bali-jail_1540270172.html","title":"Has 'body in a suitcase' killer Heather Mack dumped the boyfriend?","title_page":"Has 'body in a suitcase' killer Heather Mack dumped the boyfriend? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Body in a suitcase' killer Heather Mack has reportedly dumped the man who helped her kill her mother after meeting a new boyfriend in the notorious Bali prison where she is locked up.\nMack is said to have been seen spotted cosying up to her new boyfriend after love blossomed during art classes at Kerobokan Prison - away from the watchful eyes of Tommy Schaefer, the father of her daughter, Stella, and her accomplice in the murder of Sheila von Wiese-Mack.\nIt is said that the relationship was allowed to develop because Schaefer, who is serving an 18 year sentence, refused to attend.\nDefiant: Mack, from Chicago, Illinois, who murdered her mother Sheila von Wiese-Mack, 62, and stuffed her body in a suitcase, flips the bird at a camera during an open day at the prison where she is serving 10 years\nLaughing: Mack, pictured with her boyfriend and accomplice Tommy Schaefer, has been seen cosying up to a new man in the notorious Kerobokan Prison, having apparently met him at an art class\nPictures from inside the prison where the 20-year-old is living with her baby daughter appear to verify the claim, showing Mack getting close to the man, putting her arm around his shoulder.\nHis exact identity and he has done to be locked up remains unclear.\nMack, 20, and her 'official' boyfriend Schaefer, 21, were both found guilty of beating her 62-year-old socialite mother to death before stuffing her body in a suitcase.\nShe is now serving 10 years behind bars for her part in her mother’s murder.\nThis 'new' relationship comes amid reports she is growing increasingly fed up of Schaefer - who is said to be keen to get his hands on the money her mother left Mack in her will, so he can purchase medication to calm him down.\nA source who regularly sees the couple during prison open days revealed to MailOnline: ‘We don’t know what his actual problem is, but it’s common knowledge that Heather has been under pressure to arrange for money to be sent to him so he can purchase the medication.\n'There is talk that the money might be for methadone.'\nThe source added: ‘She remains devoted to Tommy, of course, because they were in the murder together and he is, after all, the father of her little girl.\n‘But Tommy has his problems these days and Heather’s attention seems to have been focused on another inmate.\n‘Their friendship grew when they met at an arts centre in the prison, when male and female prisoners are allowed to mix. Tommy doesn’t go, so Heather takes time to cement the friendship with the male inmate.’\nKiller looks: Mack, 20, and Schaefer, 21, still appear to be on good terms, and were pictured mingling with other inmates - but her reported new boyfriend was also there, and she was seen with her arm around him\nBut there was little evidence of tension between the couple at the prison's most recent open day.\nThe two were spotted chatting away at the special ceremony, during which many of the jail’s prisoners stood in a large group to confirm that they were ‘peaceful and loving people’.\nThe ceremony followed a deadly riot in mid-December when two warring gangs fought, resulting in three deaths and many injuries.\nMurdered: Mack and her boyfriend killed Sheila von Wiese-Mack (pictured) in Bali in August 2014\nMack and Schaefer were among the peace group, but the importance of the occasion appeared to be lost on them.\nThey appeared more interested in showing the world their contempt, raising a finger to the camera.\nSchaefer tried to hide his face from the camera, while still rudely gesturing and sucking through a straw on a small water container.\nTheir personal show of indifference to the solemn ceremony being conducted in front of them continued until it was time for them to return to their cells.\nHowever, Mack found time to utter a few words of hatred for the Federal Bureau of Investigation, which has claimed that she and her Schaefer, along with a relative of Schaefer’s, had discussed murdering her mother.\nAsked how she was coping in prison, Mack retorted: ‘FBI - bull-s***.’\nIt was a catch-cry she had uttered before and which is understood to be an indication of the argument the pair will lodge in a final appeal, claiming that the authority had presented false evidence to Bali prosecutors.\nBut the evidence that the pair had murdered Mack’s mother in Bali’s upmarket St Regis Hotel in August 2014 was overwhelming.\nJudges agreed that Schaefer, who had a personality clash with Mrs Mack, had battered her to death before he and Miss Mack stuffed the body into a suitcase and loaded it into a taxi waiting at the hotel.\nBaby mama: Mack gave birth to Stella nine months ago and the baby lives in her cell - but she will have to make a decision about whether to keep Stella in Bali or send her to the US, as she cannot keep living in the jail\nLocked up: Mack smiles in a photograph from inside the prison, holding up baby Stella to the camera\nLovestory over? Mack has reportedly dumped Schaefer, father of her baby daughter Stella, for another inmate\nThe couple made their escape out through the rear of the hotel before the taxi driver, having waited a long time for them to emerge, drove to a police station where the suitcase, leaking blood, was opened and the folded-up body of Mrs Mack was found.","url":"https://www.dailymail.co.uk/news/article-3422890/Has-body-suitcase-killer-Heather-Mack-dumped-boyfriend-murdered-mother-Love-triangle-Mack-seen-getting-close-man-Bali-jail.html"}
