{"authors":[],"date_download":"2018-10-30 14:31:13","date_modify":"2018-10-30 14:31:13","date_publish":"2015-07-11 00:00:00","description":null,"filename":"data/vaneerConsumption/HasEllenPaocastratedthefeministmovement.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_has_ellen_pao_castrated_the_feminist_movement_1540909873.html","title":"Has Ellen Pao castrated the feminist movement?","title_page":"Has Ellen Pao castrated the feminist movement?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Has Ellen Pao castrated the feminist movement?\nEllen Pao has dealt a decided blow to the feminist movement, in an unintentionally self-inflicted way. Pao, a former senior employee of the venture capital firm Kleiner Perkins, sued, claiming gender discrimination after she (like most other employees) was passed over for partnership. She lost her lawsuit, in part because the trial revealed she had actually benefited from favoritism and that despite her busy work schedule, she still found the time to have an adulterous relationship with another married partner. After losing the case, instead of being disgraced, she was held up as a feminist icon. You could not turn to the homepage of the Washington Post or the Huffington Post for weeks without seeing her confused, owlish-looking face with thick glasses making wise pronouncements on issues of the day, including the belief that women aren't strong enough to negotiate their own salaries.\nAnd now Pao has just been forced out as the CEO of the popular message board website Reddit. Chairman Pao, as she is sometimes called, got into trouble when she fired a popular female employee without explanation. So the feminist icon was forced out because she mistreated another woman. So what has Pao done for the feminist cause? 1) She has let the nation know that many so-called \"gender discrimination\" lawsuits are actually without merit, and are just tools used by some women to extort money from their former employers. 2) She was held up as a business leader who could succeed, if not for gender discrimination, and now she has been shown to be a complete failure. 3) She has been exposed as a hypocrite, a symbol of oppressed women who herself oppresses women. 4) She has made employers think twice about hiring women because of the fear that some of them might turn out to be litigious extortionists like her. With feminist heroes like these, do you think they need enemies? This article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/has_ellen_pao_castrated_the_feminist_movement.html"}
