{"authors":[],"date_download":"2018-10-22 22:22:50","date_modify":"2018-10-22 22:22:50","date_publish":"2014-05-08 21:18:06","description":"Can #BringBackOurGirls help in the fight against Boko Haram in Nigeria, or is it just causing distraction?","filename":"data/vaneerConsumption/HashtagWarsWhosBehindtheNigeriaBringBackOurGirlsMovement.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_21/427626/140507-flotus-nigeria-girls-jms-1805_16ec102fa8fc185b2e0f643f50897b64.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_social-media_hashtag-wars-whos-behind-nigeria-bringbackourgirls-movement-n100771_1540246970.html","title":"Hashtag Wars: Who's Behind the Nigeria #BringBackOurGirls Movement?","title_page":"Hashtag Wars: Who's Behind the Nigeria #BringBackOurGirls Movement?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCan #BringBackOurGirls help in the fight against Boko Haram in Nigeria, or is it just causing distraction?\nThe ongoing nightmare of nearly 300 girls kidnapped in Nigeria by militants from the group Boko Haram is now an international concern and the social media campaign #BringBackOurGirls, is receiving much of the credit. Now, on Twitter, a Los Angeles filmmaker is being accused of taking that credit after she appeared on national news to discuss her #BringBackOurGirls Facebook campaign.\nIn TV appearances, director Ramaa Mosley was credited by hosts with creating the #BringBackOurGirls hashtags, and she’s accused by dozens of Twitter users of attempting to benefit monetarily from the viral campaign. The anger has extended even to Mosley’s Wikipedia page, where a section titled #BringBackOurGirls was added to her profile on the open-edit encyclopedia Thursday.\nShared hundreds of thousands of times on Twitter, #BringBackOurGirls has been adopted by humanitarian organizations such as Amnesty International and UNICEF in their own campaigns to bring attention to Nigeria’s ongoing human rights crisis. On Thursday, Michelle Obama shared her photo holding a #BringBackOurGirls sign in a tweet signed “mo” to indicate she typed it personally. It’s been retweeted more than 49,000 times.\n\"It's important to honor the voices of Nigerian women and credit this local, grassroots movement.\"\nSo does it matter who launched a hashtag if it brings attention to these high school students, ages 15 to 18, still missing after they were abducted by armed terrorists from their boarding school on April 15?\nYes, says Kimberly C. Ellis, an Africana scholar and author of an upcoming book about activism and culture on Twitter titled “The Bombastic Brilliance of Black Twitter.” Ellis, who does performance art under the name Dr. Goddess, has written and spoken extensively about how the persistence of Black Twitter -- a name given to an extremely active base of tweeters around African-American issues -- made Trayvon Martin national news.\n\"It's important to honor the voices of Nigerian women and credit this local, grassroots movement,\" Ellis told NBC News.\nTwitter is a community of call and response, Ellis says. \"It's not about the individual.\"\nThanks to the prevalence of social media tracking tools, the provenance of #BringBackOurGirls is easily tracked to its first use on April 23, by Ibrahim Abdullahi, a corporate lawyer in Abuja, Nigeria.\nHe, however, credits the phrase to Obiageli Ezekwesili, a former vice president of the World Bank for the Africa region and a senior advisor on Africa Economic Development Policy for the Open Society Foundations, who said those four words in a TV appearance.\n\"We could’ve been holding our multicultural thing in unity, instead we’re having this side conversation from the main goal that we all want to bring back our girls.\"\n\"I never claimed to have originated hashtag #BringBackOurGirls,\" Mosley told NBC News. \"I didn't even know how hashtags worked. I heard the voices of Onbiageli Ezekwesili, and Ibrahim Abdullahi, and I knew that in Nigeria that the story was being told but it wasn't being told in the United States and Europe.\"\nMosley says she launched the #BringBackOurGirls Facebook page, which now has more than 98,000 members, to \"echo what they were saying.\" She added that she is in no way benefiting monetarily from her activism.\nEllis notes that Mosley has never claimed credit for the #BringBackOurGirls hashtag, but would have served the cause better had she corrected the TV hosts who did give her credit, both during interviews and on Twitter. Eventually Mosley credited Ezekwesili via her Twitter account, but it was after the critical tweets began.\n\"There's an African proverb about lion historians,\" Ellis said, explaining that until lions get historians, the only stories are only told from the hunter's point of view. Those updating Mosley's Wikipedia profile, and repeatedly calling her out on Twitter, are correcting the record, according to Ellis.\nMosley “essentially stole an African woman’s voice, a Nigerian woman’s voice, who started the phrase and started the movement,\" Ellis said. While she calls the anger at Mosley \"righteous,\" she agrees it's also a distraction. \"We could’ve been holding our multicultural hands in unity, instead we’re having this side conversation from the main goal that we all want to bring back our girls.\"\nSince this has begun, Mosley says her focus is on the #BringBackOurGirls Facebook page, and she does not have time for the criticism. She now understands that hashtags \"are a callout, an SOS,\" and one of the biggest lessons she's learned about social media came from Ezekwesili, with whom she's been in touch. \"She thanked me for the work that I’m doing.\"\n\"She reminded me to really make sure to thank the Nigerian people.\"\nUpdate: Friday on Twitter, Ezekwesili called out Girls Rising, the organization with which Mosley is associated, for requesting donations in connection to the #BringBackOurGirls social movement.","url":"https://www.nbcnews.com/tech/social-media/hashtag-wars-whos-behind-nigeria-bringbackourgirls-movement-n100771"}
