{"authors":[],"date_download":"2018-10-30 01:09:51","date_modify":"2018-10-30 01:09:51","date_publish":"2016-11-22 03:17:55","description":null,"filename":"data/vaneerConsumption/HasPutinFinishedOfftheInternationalCriminalCourt.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/Vladimir_Putin_2016-03-14_02.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861791.html","title":"Has Putin Finished Off the International Criminal Court?","title_page":"Has Putin Finished Off the International Criminal Court?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The contemporaneous conflicts in the Levant and Ukraine have transformed the Mediterranean and Black Seas into vast bleeding bowls, their basins awash with the unstaunched effluence of prolonged internecine strife. All too common are the epiphenomena of mass graves and camps for the internally displaced, demolished city blocks and depopulated wastelands, ravaged heritage sites and looted antiquities. Resultant waves of forced refugee movements, diplomatic disputes, economic sanctions, and external interventions have all served to rouse international indignation to a veritable fever pitch. Though the scale of destruction in Donbass admittedly pales in comparison with the macabre spectacle that is the battle for Aleppo, the simultaneous protraction of these two civil wars has undoubtedly produced a genuine international crisis. The United States, the Russian Federation, and their respective allies have been inexorably drawn into engagements featuring an array of moderate and extremist proxies, while international organizations have struggled to gain any traction whatsoever in their attempts to address these seemingly insoluble Eurasian stalemates.\nAmidst all of this discord in the concert of nations, with the sullen roar of artillery and the deafening bursts of barrel bombs a near-constant presence, it may be difficult to hear the faint raising and ceasing of a certain passing bell in peal, but one can increasingly make out its ringing. It is a death knell that sounds for yet another casualty of these ongoing struggles, this time the International Criminal Court, an institution which can only be described as mortally stricken as a consequence of our present troubles. Conceived in 1998 with the adoption of the Rome Statute of the International Criminal Court, which then entered into force a mere four years later, the ICC was described by Kofi Annan as a “a gift of hope for future generations,” but it had hardly attained an age of legal majority before it stumbled into a collective international debacle from which it cannot hope to emerge intact.\nIt was on November 14, 2016 that the ICC issued a routine report on its preliminary examination activities in various theaters, including far-flung hotspots like Burundi, the Gabonese Republic, Guinea, Nigeria, Palestine, Iraq, and Colombia. Buried within the report’s inquiries into “Phase 2 (Subject Matter Jurisdiction)” issues, however, was a section that briefly addressed the conflicts in eastern Ukraine and the Crimea. After outlining the ample evidence of extrajudicial killings, unlawful detentions, mistreatment of ethnic minorities, and a host of other war crimes and crimes against humanity taking place in the two Ukrainian regions, the Court tentatively ventured one step further. There would need to be an assessment of “whether the information available indicates that Russian authorities have provided support to the armed groups in the form of equipment, financing and personnel, and also whether they have generally directed or helped in planning actions of the armed groups in a manner that indicates they exercised genuine control over them.” Should this prove to be the case, it would mean that there is a “direct military engagement between Russian armed forces and Ukrainian government forces that would suggest the existence of an international armed conflict in the context of armed hostilities in eastern Ukraine from 14 July 2014 at the latest, in parallel to the non-international armed conflict.”\nSuch a finding would have profound consequences. It would naturally preclude any role for Russia as a “peacemaker” within the Minsk negotiation framework, but more importantly it would open up avenues for “identifying potential cases within the jurisdiction of the Court,” a cause for significant concern for the Russian Federation, which signed on to the ICC’s founding treaty, the Rome Statute, back in 2000. Although Moscow never ratified the treaty, it would be bound under the Vienna Convention on the Law of Treaties to refrain from “acts which would defeat the object and purpose” of any treaty to which it is a signatory. That being the case, any such obligations would be rendered moot should an affected state clearly convey that it does not intend to become a fully-fledged party to said treaty. So, as one might expect, a mere two days after the controversial ICC report President Vladimir Putin opted to sign an official decree “On the intention not to become a party to the Rome Statute of the International Criminal Court.” Thus did Russia join the United States, Israel, and Sudan as withdrawing signatories from the treaty and its obligations, and the Russian Foreign Ministry did not stop there, instead launching a further salvo aimed at the wholesale delegitimization of the institution as a whole.\nIn its withdrawal statement, the Russian Foreign Ministry bluntly characterized the ICC’s work as “ineffective and one-sided” while observing — entirely accurately — that “during the 14 years of the Court’s work it passed only four sentences having spent over a billion dollars.” Of course Moscow’s conclusion that the ICC has “failed to meet the expectations to become a truly independent, authoritative international tribunal” does not rest solely on matters of bureaucratic efficiency and fiscal responsibility. Still rankling was the ICC’s January 27, 2016 decision to open a proprio motu investigation into allegations of war crimes and crimes against humanity perpetrated during the 2008 Russo-Georgian conflict in South Ossetia, especially given that, as the Russian Foreign Ministry complained, “eventual investigation of actions and orders of Georgian officials was left to the discretion of the Georgian justice and remains outside of the focus of the ICC Prosecutor’s office attention,” a “development [that] speaks for itself.” Thus, the Kremlin concluded, “we can hardly trust the ICC in such a situation.” Nor, evidently, can it trust the ICC to stay out of the Ukrainian conflict. And then there is Russian role in the Syrian quagmire. Samantha Power, United States Ambassador to the United Nations, has publicly maintained that “what Russia is sponsoring and doing is not counterterrorism; it is barbarism,” a view widely held in the West, and it is only a matter of time before investigations into alleged atrocities in that combat theater begin to proliferate. Hence the eminently sensible — at least from the Kremlin’s perspective — decision to promulgate the aforementioned withdrawal decree. A direct consequence of the ICC’s involvement in the Black Sea and Levantine conflicts taking place over the last eight years or so, the Russian abjuration figures to be a body blow from which the institution may never truly recover.\nWere this Russian action undertaken in isolation, the news might not have been so disheartening to the ICC and its supporters, but it comes at a particularly fraught time, when members of the African Union have been making a similar push to withdraw their countries from ICC jurisdiction. Before its investigation into gross human rights abuses in Georgia, the ICC had, despite being ratified by 124 nations on every continent, only managed to pursue nine investigations related to Kenya, Ivory Coast, Libya, Sudan, Democratic Republic of Congo, Central African Republic (twice), Uganda, and Mali. “Elsewhere in the world, many things happen, many flagrant violations of human rights, but nobody cares,” Chadian President Idriss Déby remarked earlier this year, implying that the African continent has been disproportionately, and unfairly, targeted by borderline neocolonial inquiries. South Africa, Burundi, and Gambia have followed through on their threats to take their leave from the statute, while Uganda, Namibia, Kenya, and others are on the cusp. The Philippines’ President Rodrigo Duterte naturally chimed in: “They withdrew their membership. I might follow. Why? It’s us small countries that get beaten up.” The Kremlin could not help alluding to these developments in its own statement, noting that “the démarche of the African Union which has decided to develop measures on a coordinated withdrawal of African States from the Rome Statute is understandable.”\nWith the ICC shedding member states, its prospects are looking increasingly dim. As previously mentioned, the United States and Israel have already checked out of the arrangement, regardless of their initial signatory status. China, India, Pakistan, Turkey, Malaysia, and Indonesia, along with thirty-six other nations, never signed on in the first place. Without Russian participation, and with a coterie of African nations on their way out the door, the Court has little representation at the top of the geopolitical league table, so to speak, and increasingly poor relations with that part of the tiers monde on which it has heretofore lavished the vast majority of its time and efforts. As the Court’s role in punishing human rights crimes is not based on universal jurisdiction, but rather on state ratification, its increasingly diminished ambit is essentially fatal to its stated goal of “establish[ing] an independent permanent International Criminal Court in relationship with the United Nations system, with jurisdiction over the most serious crimes of concern to the international community as a whole,” as the 1998 Rome Statute has it. Indeed, as Bruce Broomhall put it in his 2003 monograph International Justice and the International Criminal Court: Between Sovereignty and the Rule of Law, “the ultimate (not necessarily near-term) support of the United States, and with it that of the Security Council, is probably an essential condition of the ICC’s ultimate success as a core and not a peripheral part of the system for regulating international life.” With permanent Security Council members United States, Russia, and China each now eschewing any meaningful involvement with the institution, “peripheral” would be a generous description of the ICC’s current prospects.\nThe fundamental failings of the ICC are apparent enough, particularly in light of Russia’s prompt withdrawal in the face of the most preliminary of investigations into enormities committed in the course of its interventions abroad and in the “near-abroad.” It does not take an international legal scholar to recognize, as Donald Jackson has, the “reality that the nation-states that now seem to be the most likely violators of the Rome Statute may also be the most unlikely ‘ratifiers,’” whether that means rogue regimes with gruesome human rights records, or nations like the United States, Israel, Turkey, or now Russia, which all adopt vigorous foreign policy postures likely to lead to complaints (ill-founded or otherwise). At the same time, as Bruce Broomhall quite rightly observed, “the ICC will be the most effective where the State on the territory or by the national of which the crime was (allegedly) committed is itself willing to enforce the requests of the Court. Such States are likely to be the most willing where prior regimes, ‘rogue’ or disfavoured elements of the government, scapegoats, or non-State actors are under investigation.” Yet those are precisely the scenarios in which the Court is the least necessary, and where national tribunals, truth-and-reconciliation or gacaca-style proceedings, regional human rights courts, or international ad hoc tribunals are more appropriate means to achieve post-conflict justice. The ICC has been pitched as an international mechanism for encouraging a culture of accountability, but it is something of an all-or-nothing affair, and the sheer number of defectors has made for a rather uninteresting game of prisoner’s dilemma.\nDuring crises like the ones unfolding in Syria and Ukraine, international law is all too often afforded talismanic qualities, and ICC prosecutors are eager to play the role of “vindicators of mankind,” a term coined by the 18th century jurist Cesare Beccaria. Yet it is clear that international legal institutions are never so strong as during periods of relative international repose, and never so weak as when they are most sorely needed. Despite the global consensus on the obligation to end impunity for grievous human rights crimes, a consensus hard-earned by dint of the genocidal bloodbaths of the last century, there is more evidence for the unraveling than for the strengthening of international legal instruments and institutions. Sixteen years ago, in the early days of the debate over the ICC and the exercise of universal jurisdiction, J. Patrick Kelly concluded that “international legal theory is in disarray,” with customary international law in particular unable to “function as a legitimate source of substantive legal norms in a decentralized world of nations without a broad base of shared values.” The situation can hardly be said to be any better now.\nAs a matter of fact, it was ever thus. International legal principles are inherently unstable phenomena, particularly as they emerge from the classroom or courtroom and enter into the halls of power. While the law of nations is easily defined — the Italian jurist Arrigo Cavaglieri’s formulation of a “system of promises between co-ordinated and juridically equal subjects” is as good as any — it was as early as 1832 that the English legal theorist John Austin, in his masterful treatise The Province of Jurisprudence Determined, realized that\nthe law obtaining between nations is not positive law: for every positive law is set by a given sovereign to a person or persons in a state of subject to its author. As I have already intimated, the law obtaining between nations is law (improperly so called) set by general opinion. The duties which it imposes are enforced by moral sanctions: by fear on the part of nations, or by fear on the part of sovereigns, of provoking general hostility, and incurring its probable evils, in case they shall violate maxims generally received and respected.\nOr, as Frédéric Mégret put it, international law is “remarkably plastic and adaptable,” a “supple system of regulations designed to make the most of any epoch’s priorities,” and therefore basically a set of norms likely to be upheld in the best of times and uprooted in the worst, and subject to shifting fashions and evolving (or devolving) notions of morality. The American statesman Dean Acheson, writing at the time of the Cuban missile crisis, famously insisted that “much of what is called international law is a body of ethical distillation, and one must take care not to confuse this distillation with law.” A century earlier, within the context of another Russo-Western confrontation over foreign intervention (this time involving the Kingdom of the Two Sicilies of all places), the British Foreign Secretary John Russell perhaps put it best of all: “where a Treaty is confirmed by national feeling and opinion, it is easily upheld and maintained; but, where it has no such sanction, it is like a decayed tree, that only waits for a gust of wind to be overthrown.” Machtpolitik invariably prevail in such circumstances, albeit typically while cast as action in the service of a moral imperative. The ICC is currently paying the price for this eternal state of affairs.\nOne must admit that, looking at the track record of the Court, it is difficult to find much fault in any of its individual holdings, rare as they are, and it has even produced welcome legal innovations like the recent conviction of Ahmad al-Faqi al-Mahdi for his role in the militant group Ansar Dine’s wanton destruction of religious and historical structures during the 2012 occupation of Timbuktu. Nevertheless, without the participation of the United States — still the sole guarantor of international peace and stability — and without the involvement of global powers like Russia, India, or China, or regional powers like Israel, Turkey, or Indonesia, the ICC is destined to fall short of its utopian goals of truly global justice for human rights crimes. While the institution, in a rump form, can last indefinitely as a limited mechanism for those still enamored with the exercise of soft power, its irrelevance is on full display. Ultimately, the ICC’s greatest successes have come where they are least needed — one suspects, for example, that Mali could easily have convicted al-Mahdi — while it fails conspicuously whenever it attempts to pursue its broader mandate with any amount of aggressiveness.\nIn light of Russia’s withdrawal, Human Rights Watch’s Elizabeth Evenson lamented that “the ICC withdrawals risk becoming a bargaining chip by countries looking to make the world safer for abusive dictators,” while adding that “opting out or crippling the ICC’s ability to try sitting officials will only curtail justice for victims of the worst crimes.” The sheer naïveté of an international institution counting on sitting officials to allow themselves to be subjected to criminal prosecution, all the while declining to avail themselves of the obvious and risk-free option of withdrawal, has been the Court’s congenital weakness ab ovo. That inherent deficiency is increasingly manifesting itself as the institution charts its perilous course between the international politico-legal Scylla and Charybdis of sovereignty and utopianism. Buffeted by the prevailing winds of raison d’état, pragmatism, and populism, the ICC finds its barely seaworthy, and time will tell in precisely what condition it emerges from the ongoing crisis.\nThe Rome Statute was predicated on the moving notion that “all peoples are united by common bonds, their cultures pieced together in a shared heritage, and [are] concerned that this delicate mosaic may be shattered at any time.” Yet that process of shattering is precisely what is happening in our rancorous era, and not only is the ICC proving powerless to forestall such an eventuality, it is by all appearances becoming a victim in its own right. Though we cannot lose sight of the untold havoc being wrought in places like the so-called Donetsk and Luhansk People’s Republics, or in Aleppo and Latakia, neither can we ignore the damage that has been done to the ICC as a consequence of its own well-meaning but ill-timed interventions. It will be left to the states, alliances, and organizations that outlast the institution’s slide into irrelevancy to pursue and implement their own international legal bodies of ethical distillation as best they can, and hopefully with more tangible results.","url":"https://spectator.org/has-putin-finished-off-the-international-criminal-court/"}
