{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:31:51","date_modify":"2018-10-30 19:31:51","date_publish":"2016-05-02 00:00:00","description":"Keon Hatcher has apparently re-injured the same foot he broke last year.","filename":"data/vaneerConsumption/Hatchersaysfootrequiredsurgery.json","image_url":"https://media.arkansasonline.com/img/photos/2016/05/02/HOGS_FB_PRACTICE_020_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_may_03__1540927911.html","title":"Hatcher says foot required surgery","title_page":"Hatcher says foot required surgery","title_rss":"NULL","source_domain":"arkansasonline.com","text":" Keon Hatcher has apparently re-injured the same foot he broke last year.\nThe fifth-year senior wide receiver posted a picture of his left foot in a boot on Snapchat, a social media application, Sunday evening. He also posted a video in which he said, \"So, I had surgery on my foot,\" but did not elaborate.\nMultiple sources confirmed to WholeHogSports that Hatcher required surgery.\nArkansas receiver Keon Hatcher shows his foot in a boot during a Snapchat video in which he says he recently required surgery.\nIt's unclear why Hatcher required the surgery or whether he will miss any practice or playing time because of the surgery. Repeated attempts to contact Arkansas coach Bret Bielema through a team spokesperson were unsuccessful Monday and Tuesday, but he is expected to address the injury Thursday during a news conference to recap spring practice.\nIt is the same foot Hatcher broke during the Toledo game last season. Hatcher required season-ending surgery to repair the injury last September.\nHatcher was granted a medical redshirt in 2015 and returned to Arkansas. He participated fully in spring practice and caught three passes for 48 yards in the Red-White Game. He is expected to play a large role in the Razorbacks' offense next season.\nThe Razorbacks have had several players sidelined with foot injuries in the past year. Former running back Jonathan Williams missed his entire senior season with a broken foot and wide receiver Cody Hollister sat out eight games with a broken foot. Earlier this spring, running back Kody Walker was sidelined with a broken foot, but he is expected to recover in time for fall practice.","url":"https://www.arkansasonline.com/news/2016/may/03/hatcher-says-foot-required-surgery/"}
