{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-23 03:32:35","date_modify":"2018-10-23 03:32:35","date_publish":"2016-01-28 19:03:26","description":"Researchers from New York University Langone found that mice exposed to to higher levels of a chemical exhibited autism symptoms, but blocking the chemical reverted the changes.","filename":"data/vaneerConsumption/Havescientistsfoundacureforautism.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACD1BB00000578-0-image-a-58_1454006118335.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421329_Have-scientists-cure-autism-Blocking-specific-cells-pregnancy-help-prevent-disorder-developing_1540265555.html","title":"Have scientists found a cure for autism?","title_page":"Have scientists found a cure for autism? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In a major breakthrough in the treatment of autism, researchers believe they have discovered cells that play a role in how the disorder develops in the brains of babies.\nBy blocking cells that produce a chemical called IL-17a in pregnant mice, the scientists were able to restore normal brain structure in the brains of the pups.\nNot only does the discovery go some way to confirm viral infections during pregnancy can play a role in how autism develops, the findings take a step towards treatment or even a cure for the disorder.\nIn a major breakthrough into the treatment of autism (stock image of autism patient), researchers believe they have discovered cells that play a role in how the disorder develops. By blocking cells that produce a chemical called IL-17a in pregnant mice, the scientists were able to restore normal brain structure in the offspring\nAutism Spectrum Disorder (ASD) can cause a wide range of symptoms, which are often grouped into two main categories.\nThese include difficulty understanding and being aware of other people's emotions and feelings and problems taking part in, or starting, conversations.\nWHAT IS AUTISM SPECTRUM DISORDER? Autism Spectrum Disorder (ASD) can cause a wide range of symptoms, which are often grouped into two main categories. Firstly, problems with social interaction and communication. This includes difficulty understanding and being aware of other people's emotions and feelings and/or problems taking part in, or starting, conversations. Patterns of thought are another key area, namely restricted and repetitive patterns of thought or physical movement, such as hand tapping or twisting, and becoming upset if these set routines are disrupted. It's estimated about 1 in every 100 people in the UK has ASD. More boys are diagnosed with it than girls. There's no 'cure for ASD, but a range of educational and behavioural support programmes can help people with the condition. Source: NHS Choices\nPatterns of thought are another key area, namely restricted and repetitive patterns of thought or physical movement, such as hand tapping or twisting, and becoming upset if these set routines are disrupted.\nThe new study centred on T lymphocytes, which are immune cells that react to infections by creating 'a cellular army' that attacks the invading microbes.\nA subset of T cells, Th17 cells, release interleukin 17 (IL-17) - a signalling protein that boosts how a body responds to, and fends off infections.\nHowever, when the levels of this protein are too high, or off target, they can lead to autoimmune diseases such as asthma and inflammatory bowel disease.\nThe newly published study found that activation of Th17 cells and the production of IL-17a do play a role in creating behavioural abnormalities in embryos.\nSeveral previous studies on humans have found a link between mothers catching a viral infection during pregnancy and the risk of their child developing ASD.\nUntil now, though, the mechanisms behind this were unknown.\nTo test this theory, the research team from New York University Langone injected mice with an acid that mimics a viral infection.\nThis then caused the pregnant mice's immune system to produce IL-17a.\nThe study centred on T lymphocytes, immune cells that react to infections. A stock image of a T cell is shown. A subset of T cells, Th17 cells, release IL-17 - a signalling protein that boosts how a body fends off infections. However, high levels of this protein have been linked to the development of autism symptoms\nResearchers injected mice (stock image) with an acid that mimics a viral infection. This caused the pregnant mice's immune system to produce the chemical called IL-17a. Mice exposed to higher IL-17a levels in the womb exhibited autism-like symptoms when they were born but blocking the chemical reverted the changes\nIS THIS A CURE FOR AUTISM? Previous studies on humans have found a link between mothers catching a viral infection during pregnancy and the risk of their child developing ASD. Researchers injected mice with an acid that mimics a viral infection. This caused the pregnant mice's immune system to produce a chemical called IL-17a. Mice exposed to higher IL-17a levels in the womb exhibited autism-like symptoms when they were born but blocking the chemical reverted the changes. Mice exposed to this kind of immune response were also more likely to bury marbles found in their cages one after the other in a compulsive, repetitive behaviour. Yet, by blocking the action of Th17 cells completely restored normal structure and function to the brains of the study offspring. Dr Littman and his colleagues have filed a patent on their methods. However, they were keen to stress it may be many years before a treatment could potentially be developed using the technique.\nMice exposed to higher IL-17a levels in the womb exhibited autism-like symptoms when they were born.\nFor example, they had trouble telling the difference between another live mouse and a toy.\nThey interacted with both equally, whereas normal mice spent more time socially interacting with live mice.\nMouse pups are known to cry to their mothers, but recordings also revealed that offspring exposed to IL-17a made abnormal calls.\nMice exposed to this kind of immune response were additionally more likely to bury marbles found in their cages one after the other in a compulsive, repetitive behaviour.\nYet, blocking the action of Th17 cells completely restored normal structure and function to the brains of the study offspring.\nThis was regardless of whether the changes were achieved by treatment with antibodies or by shutting down the IL-17a gene.\n'To our knowledge, this is the first study to identify a specific population of immune cells that may have a direct role in causing behaviors linked to autism,' said immunologist study author Dan Littman at NYU Langone.\n'With these study results, Th17 cells, as well as specific proteins they produce, become candidate therapeutic targets as part of future efforts to prevent autism.'\nDr Littman and his colleagues have filed a patent on their methods.\nHowever, they were keen to stress it may be many years before a treatment could be developed using the technique.","url":"https://www.dailymail.co.uk/sciencetech/article-3421329/Have-scientists-cure-autism-Blocking-specific-cells-pregnancy-help-prevent-disorder-developing.html"}
