{"authors":["Aoife Hanna"],"date_download":"2018-10-31 01:46:50","date_modify":"2018-10-31 01:46:50","date_publish":"2018-09-06 15:39:15","description":"Relationships are hard work, there is no denying that. But imagine if the general public were looking at your every up and down moment, at every difficult period you share? Well, that's the every day reality for celebrities. And at the moment, no…","filename":"data/vaneerConsumption/HaveCarolineFlackAndrewBradyBrokenUpAgainHerEngagementRingsBackOff.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/af4a817f-634b-4a2c-a5eb-32b77df0f546-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_have-caroline-flack-andrew-brady-broken-up-again-her-engagement-rings-back-off-11772245_1540950410.html","title":"Have Caroline Flack & Andrew Brady Broken Up Again? Her Engagement Ring's Back Off","title_page":"Have Caroline Flack & Andrew Brady Broken Up Again? Her Engagement Ring's Back Off","title_rss":"NULL","source_domain":"bustle.com","text":"Relationships are hard work, there is no denying that. But imagine if the general public were looking at your every up and down moment, at every difficult period you share? Well, that's the every day reality for celebrities. And at the moment, no one knows that better than Caroline Flack. You see, there are a lot of people right now asking have Caroline Flack and Andrew Brady broken up again? Why? Simply because she was spotted without her engagement ring after appearing to hint that her and Brady's wedding was back on following their break-up.\nIn photographs shared yesterday by The Sun, the Love Island presenter was spotted outside her home in the afternoon, wearing her engagement ring for the first time in weeks. Quite a positive sign re their potential upcoming nuptials, right?\nWell, perhaps not. You see, just a few hours later at the GQ Man Of The Year Awards, Flack was spotted not wearing it. Could this mean the engagement was temporarily back on before being called off again?\nI have my doubt. You see, if Flack had just called off her engagement, she certainly seemed to be in high spirits when she arrived at the awards ceremony. The Love Island presenter looked very glam in a sparkly zebra print dress and appeared to enjoy the evening. In fact, she even took to Instagram to share a couple of photos of herself, and captioned the post: \"Happy.\"\nDoesn't exactly sound like someone going through a break-up, does it? So, I reached out to Flack and Brady's reps for clarification, however, they are yet to get back to me.\nIn case you're not up to speed with the whole Flack and Brady situation, allow me to fill you. The couple first met earlier this year after he took part in Celebrity Big Brother. Flack revealed in a piece she wrote for Cosmopolitan magazine that she started following him on Instagram after taking a fancy to him while he was on the show — and apparently, the rest was history. She wrote:\n\"You followed me back with the simple, emotionless line: 'Thanks for the support.' (I now know, of course, it took you hours to come up with that!). It made me laugh so I gave you my number. A few days later, we met.\"\nFor their first date, Brady took Caroline out to eat at a restaurant. Clearly, they hit it off as they announced their engagement just three months later in April. Opening up about their relationship (in happier, more stable times), Flack added:\n\"People talk about meeting someone and feeling as though you've known them your whole life. That's what it felt like when I met you. I'll never forget seeing you walk into the restaurant — tall, with a smile 10 miles wide, not just for me but for everyone there. Talking to you was effortless. There were no first-date nerves — just two people laughing and getting to know each other until the early hours. It was how all first dates should be.\"\nSadly though, the relationship didn't exactly have the smoothest path. Three months after confirming they were planning to get married, the couple announced that they had broken up. Flack said in a statement: \"I'm sad to announce that Andrew and I have decided to part ways. Unfortunately it was not to be. I wish him all the best. At least there's a Villa waiting for me. It's back to the ol' grafting.\"\nNeither Flack or Brady elaborated any further on why they decided to split exactly. However, there were claims that he had been unfaithful during the relationship. However, Brady denied the allegations. The pair faced even more stress when it was revealed that Brady met with producers of Celebs Go Dating the day after they had broken up.\nBut what's the deal now? Are they back on or not? Well they have been pictured leaving and entering her home, and according to The Sun, they were recently on a make or break holiday together in Saint Lucia. However, given that neither have confirmed or denied the rumours, fans can not know for sure.\nWhat we can all be sure of though is that the couple clearly do want a bit of privacy right now. Both Flack and Brady have been pretty open about their relationship in the past, and I'm sure that when they are ready, they will speak about it again. However, right now, they're obviously not ready, and so we should respect that. Whatever is going with these two, I personally just hope that it works out for the best and that they are both happy, whether that's together or apart.","url":"https://www.bustle.com/p/have-caroline-flack-andrew-brady-broken-up-again-her-engagement-rings-back-off-11772245"}
