{"authors":["Associated Press"],"date_download":"2018-10-22 20:08:08","date_modify":"2018-10-22 20:08:08","date_publish":"2016-01-29 00:32:07","description":"HONOLULU (AP) — Lawmakers in Hawaii want to make an exception to the state's gambling ban by legalizing fantasy sports contests. Hawaii is one of two states,...","filename":"data/vaneerConsumption/Hawaiibillswouldlegalizefantasysportssiteslottery.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421629_Hawaii-bill-legalize-fantasy-sports-contests_1540238888.html","title":"Hawaii bills would legalize fantasy sports sites, lottery","title_page":"Hawaii bills would legalize fantasy sports sites, lottery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hawaii bills would legalize fantasy sports sites, lottery\nHONOLULU (AP) — Lawmakers in Hawaii want to make an exception to the state's gambling ban by legalizing fantasy sports contests.\nHawaii is one of two states, along with Utah, with no legal gambling. The Aloha State has some of the strictest anti-gambling laws in the country, Hawaii Attorney General Doug Chin said.\nThat means popular fantasy sports sites like FanDuel and DraftKings are illegal under current state laws, Chin said this week.\nBut state legislators have introduced a bill in both the House and Senate that would legalize online fantasy sports contests in light of Hawaii's growing appetite for legalizing gambling.\nThe bill would require fantasy sports contest operators who offer cash prizes to register with the state and be subject to a yearly independent audit. The sites would be off-limits to minors, and rules would be established against insider gambling.\nThe sites would also have to pay a $25,000 registration fee, which should be required annually, said Democratic Rep. John Mizuno, who co-introduced the bill.\n\"We're all realists here; people gamble everywhere,\" Mizuno said. \"So if we can regulate it properly and benefit from it — get some of the proceeds to help our most needy — then at the end of the day it's a win-win.\"\nThis year, lawmakers in both houses have introduced several bills that would legalize some form of gambling, including a measure that would start a state lottery to benefit the homeless.\n\"The Powerball created a lot of interest, and the timing was impeccable — it happened right before the start of the legislative session,\" said Mizuno. \"Everything collided to have the perfect opportunity to bring this issue up.\"\nFor a state that has historically opposed legalized gambling, lawmakers say Hawaii residents are changing their attitudes. Polls from 2012 show a majority of Hawaii voters support a state lottery and off-shore gambling on ships.\nBut opponents to legalized gambling in the state say a lottery could disproportionately affect Hawaii's low-income communities and put some people at risk for developing gambling addictions.\n\"It puts state government into the gambling business, and we believe the state government should respect the citizens, not exploit them,\" said Dianne Kay, president of the Hawaii Coalition Against Legalized Gambling. \"We'd like to keep Hawaii like a tropical paradise rather than a gambling destination.\"\nMizuno said state gambling earnings could be used to help fund education or reduce homelessness. He would also want a portion of money the state collects to go toward fighting gambling addiction.\nThe proposed law to start a lottery could be controversial, he said, but he expects the public to be more accepting of the law to regulate fantasy sports sites.\nOn fantasy sports sites, a player picks out a fantasy team and earns points on how well the athletes perform, similar to the casual, legal games people play with friends and family. But the websites can offer a much larger payout, and can involve hundreds of players and wagers up to $1,000.\nNationwide, nearly 60 million Americans play fantasy sports. Several states including Pennsylvania and California are working on laws to regulate the industries. Two states — Nevada and New York — have banned the fantasy sport sites, labeling them as illegal gambling.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421629/Hawaii-bill-legalize-fantasy-sports-contests.html"}
