{"authors":["Associated Press","Dailymail.Com Reporter"],"date_download":"2018-10-22 20:38:05","date_modify":"2018-10-22 20:38:05","date_publish":"2016-01-29 02:31:18","description":"The Kauai County Fire Department said Thursday officials didn't see the shark. However, lifeguards saw the male visitor had cuts on both of his hands. They were not life threatening.","filename":"data/vaneerConsumption/HawaiibayclosedafterasharkbitesmanfromMinnesotapaddlingtoshore.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEF87700000578-0-image-a-23_1454042327530.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422076_Lifeguards-close-bay-shark-bite-man-cuts-hands_1540240685.html","title":"Hawaii bay closed after a shark bites man from Minnesota paddling to shore","title_page":"Hawaii bay closed after a shark bites man from Minnesota paddling to shore | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lifeguards have closed a Hawaii bay to swimming after a shark bit a visitor from Minnesota.\nThe Kauai County Fire Department said Thursday officials didn't see the shark.\nHowever, lifeguards saw the male visitor had cuts on both of his hands.\nThe cuts he suffered were not life-threatening.\nLifeguards have closed a bay to swimming after a shark bit a visitor from Minnesota. The Kauai County Fire Department said Thursday officials didn't see the shark\nThe incident occurred at about 2pm, KHON reported.\nThe shark bit the man while he was paddling to shore near the Hanalei Pier on Kauai island.\nThe visitor from Minnesota was on his way back from surfing.\nAccording to KHON, the man drove himself so he could receive medical care.\nLifeguards posted 'No Swimming' and 'Shark Sighted' signs along the beach at Hanalei Bay.\nLifeguards are also telling telling people to stay out of the water.\nLifeguards will reassess the water Friday morning to determine if it is safe for swimming.","url":"https://www.dailymail.co.uk/news/article-3422076/Lifeguards-close-bay-shark-bite-man-cuts-hands.html"}
