{"authors":["Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 04:16:05","date_modify":"2018-10-23 04:16:05","date_publish":"2017-03-10 14:27:31","description":"John Sullivan sent an email to co-workers at Campbell High School on Wednesday saying that if students are in the U.S illegally, 'I won't teach them'.","filename":"data/vaneerConsumption/Hawaiiteachersayshewontteachillegalimmigrants.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E23558E00000578-0-image-a-30_1489156040407.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301230_Hawaii-teacher-says-won-t-teach-illegal-immigrants_1540268165.html","title":"Hawaii teacher says he won't teach illegal immigrants","title_page":"Hawaii teacher says he won't teach illegal immigrants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Hawaii social studies teacher is under fire for saying he won't teach illegal immigrants.\nThe comments stemmed from an email that was sent out to staff at Campbell High School in Ewa Beach, Oahu on Wednesday.\nThe email was from a counselor and relayed national statistics about parents who have been keeping their kids at home for fears of deportation.\nCol. John Joseph Sullivan replied to the email, saying: 'This is another attack on the President over deportation. Their parents need to apply for immigration like everyone else. If they are here in the U.S. illegally, I won't teach them.'\nScroll down for video\nCampbell High School teacher John Sullivan (pictured) is under fire for a comment he made about illegal immigrants in an email this week\nSullivan sent this email out to staff at the school on Wednesday, saying 'if they are here in the U.S. illegally, I won't teach them'\nSchool administrators and the Department of Education were quick to condemn the email, since it violated rules on discrimination and use of department email.\n'I just reminded him again that we don't discriminate against any individuals,' Campbell High School principal Jon Henry Lee said. 'We're going to service all students that are registered in our school.'\nIn an interview with Hawaii News Now, Sullivan defended himself, saying his email had been misconstrued.\n'My comment in the email refers to (the email's title) if students is (sic) kept home, teachers cannot teach them,' he said.\nAccording to his Facebook, he has worked at the high school since 2001.\nSullivan was scheduled to meet with Principal Lee on Wednesday. A Department of Education spokesman said that Sullivan would be penalized, but did not specify how.\nThe school quickly condemned the email and a Department of Education spokesman said that 'appropriate action' would be taken against Sullivan\n'I cant speak on what appropriate action will be taken against this teacher, but rest assured appropriate action will be taken,' DOE Director of Communications, Donalyn Dela Cruz, said.\nShe added: 'It's very clear in our code of conduct that we do not discriminate on national origin as well as all the other aspects of where you're from. Who you are. Sexual orientation, religion and the list goes on and on.\n'What it comes down to is that we do not discriminate against anyone. We are the public school system and we service all children.'\nThe State of Hawaii is currently locked in a legal battle with the Trump administration over the new travel ban. It was the first to file a lawsuit against the new executive order, and a judge in the state will hear arguments next week, on March 15.","url":"https://www.dailymail.co.uk/news/article-4301230/Hawaii-teacher-says-won-t-teach-illegal-immigrants.html"}
