{"authors":["Daisy Dunne For Mailonline"],"date_download":"2018-10-23 03:30:21","date_modify":"2018-10-23 03:30:21","date_publish":"2017-03-10 12:59:18","description":"A photographer caught cool blue molten lava spewing out of Kilauea, on Hilo island in Hawaii, on Wednesday. The colour was created when light from the sunset refracted off of the lava's surface.","filename":"data/vaneerConsumption/HawaiiKilaueavolcanospewsoutbluelava.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22836300000578-0-image-a-27_1489149232220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4301092_Hawaii-Kilauea-volcano-spews-blue-lava_1540265421.html","title":"Hawaii Kilauea volcano spews out blue lava","title_page":"Hawaii Kilauea volcano spews out blue lava | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Molten lava spewing out from Hawaii's Kilauea volcano was captured turning a shade of blue by one lucky cameraman.\nThe usually fiery red volcanic flow turned to blue thanks to a natural phenomenon known to locals as 'blue hour'.\nBlue lava was created when light from the sunset refracted off of the molten lava's surface, creating a stunning optical illusion.\nWHY WAS IT BLUE? The usually fiery red volcanic flow was changed to blue thanks to a natural phenomenon known to locals as 'blue hour'. Lava the colour of the ocean was created when light from the sunset refracted off of the molten lava's surface, creating a stunning optical illusion. Blue hour is an phenomenon that occurs at early dawn and late at dusk dusk, when skies turn shades of electric blue and lavender.\nThe cool blue lava can be seen slowly rolling out of one of the volcano's chutes before hardening to form uneven rocks on the island's surface.\nBlue hour is an phenomenon that occurs at early dawn and late at dusk dusk, when skies turn shades of electric blue and lavender.\nThe mesmerising footage was captured by Hawaiian photographer Warren Fintz, who managed to catch the natural phenomenon at dusk on Wednesday.\nOn his website, he said: 'Ever since I was a child, I’ve been greatly fascinated with photography.\n'Specifically rare and unique situations occurring at the right time and place.\n'The elements of our beautiful planet are awesome and my greatest passion is to capture them as they happen, living the moment.'\nMolten lava spewing out from Hawaii's Kilauea volcano was captured turning a cool shade of blue by one lucky photographer\nThe cool blue lava can be seen slowly rolling out of one of the volcano's chutes before hardening to form uneven rocks on the island's surface\nThe lava was seen flowing out of the island's Kilauea volcano, which formed anywhere from 300,000-600,000 years ago.\nKilauea has been active ever since its birth, according to the US Geological Survey.\nIt erupts from three main areas, the summit and two rift zones, and most of these events are 'relatively gentle.' But, not always.\nThe volcanic flow gave the appearance of a burning sea as it rolled out from Kilauea, Hawaii's most active volcano, at sunset on Wednesday\n'Every few decades to centuries, however, powerful explosions spread ejecta across the landscape,' according to the USGS's Hawaiian Volcano Observatory.\n'Such explosions can be lethal, as the one in 1790 that killed scores of people in a war party near the summit of Kilauea.'\nIn January, a portion of cliff collapsed at the Kilauea volcano's Komokuna ocean entry, sending a remarkable lava firehose shooting into the air.\nThe usually fiery red volcanic flow was changed to blue thanks to a natural phenomenon known to Hawaiian locals as 'blue hour'\nLava the colour of the sea was created when light from the sunset refracted off of the molten lava's surface, creating a stunning optical illusion\nStunning images emerged of the phenomenon, taken by a brave photograph standing just metres from the lava.\nA steady stream of lava can be seen gushing from a hole in the side of the cliff, striking up bursts of debris as it collides with the water.\nThe incredible photos were taken on the 28 January by Jon Cornforth, a Hawaiian photographer, using a Sony A7R2 camera.\nBlue hour is an phenomenon that occurs at early dawn and late at dusk dusk, when skies turn shades of electric blue and lavender\nThe lava was seen flowing out of the island's Kilauea volcano, which formed anywhere from 300,000 to 600,000 years ago. Kilauea has been erupting ever since its birth, according to scientists\nKILAUEA VOLCANO The Kilauea volcano in Hawaii formed 300,000-600,000 years ago. And, it has been active ever since, according to the US Geological Survey. It erupts from three main areas, the summit and two rift zones, and most of these events are 'relatively gentle.' 'Every few decades to centuries, however, powerful explosions spread ejecta across the landscape,' according to the USGS's Hawaiian Volcano Observatory. 'Such explosions can be lethal, as the one in 1790 that killed scores of people in a war party near the summit of Kilauea.'\nThe series of images capture the natural phenomena in eye-wateringly close detail.\nWhile the lava flow stopped momentarily after a portion of cliff collapsed, the hose re-emerged on the 4 February.\n'Killer show this afternoon for our 3:30pm 2/4/17 Lava Boat Tour,' Kalapana Cultural-Tours wrote on Facebook.\n'Light variable winds made lava viewing pretty epic from the southern vantage point. Guests were surprised to see the lava fire hose still active.'\nJust before the dramatic collapse, the firehose was 'no longer visible,' according to the USGS's Hawaiian Volcano Observatory.\nBut a video from Kalapana Cultural Tours revealed it persisted.\nStunning footage captured in the early morning shows the bright stream pouring into the ocean once again.\n'Southwest winds made viewing from the south perfect,' the group wrote on Facebook.\nIt's thought that the Kilauea volcano in Hawaii formed anywhere from 300,000-600,000 years ago. It can be found on the south side of the Big Island\nStunning new images have emerged of the phenomenon, taken by a Jon Cornforth, a Hawaiian photograph, while standing just metres from the lava\nThe incredible photos were taken at the end of January by Jon Cornforth, a Hawaiian photographer, using a Sony A7R2 camera\n'Pele is still pouring into the Pacific Ocean. Fire hose lava entry is still visible.'\nThe video ends with what appears to be a large explosion.\nWhen the molten lava hits the cool seawater, it reacts and causes explosions that can throw large chunks of hot rock and debris inland, where tourists hike in to see the lava, and seaward, where tour boats cruise the shoreline.\nThe gases released from the reaction are also dangerous to breathe, and shards of volcanic glass can be thrown into the air when the hot lava meets the cool seawater.\nA section of sea cliff above the massive 'firehose' lava flow on Hawaii's Kilauea Volcano collapsed and splashed into the ocean as tourists and geologists watched.\nA large crack in the section of cliff above the gushing molten lava stream gave way as scientists stood just yards away.","url":"https://www.dailymail.co.uk/sciencetech/article-4301092/Hawaii-Kilauea-volcano-spews-blue-lava.html"}
