{"authors":["Michael Cunningham"],"date_download":"2018-10-30 19:24:58","date_modify":"2018-10-30 19:24:58","date_publish":"2018-07-16 16:37:00","description":"The Hawks executed a trade last week in which they acquired point guard Jeremy Lin from&nb...","filename":"data/vaneerConsumption/HawksaddhighcharacterJeremyLincontinuetoseektr.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/13/Images/lin1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-hawks_hawks-ad_0df4f84195b1fe341544720daafad83b__1540927498.html","title":"Hawks add ‘high-character’ Jeremy Lin, continue to seek tr","title_page":"Hawks add ‘high-character’ Jeremy Lin, continue to seek tr","title_rss":"NULL","source_domain":"ajc.com","text":"The Hawks executed a trade last week in which they acquired point guard Jeremy Lin from the Nets. As part of the deal the Hawks also received a second-round draft pick in 2025 and the chance to get a better second-round pick in 2020, but Lin is the centerpiece.\nLin has played 37 games over the past two seasons and will count about $14 million against the Hawks’ salary cap next year. Lin is far removed from his “Linsanity” days. If healthy, he’s probably a slight improvement over incumbent Hawks starter Dennis Schroder, but not so much that the deal makes sense on its face (even setting aside the fact the Hawks aren’t yet in win mode).\nSo why did the Hawks trade for Lin?\n“We had the opportunity to add a veteran point guard to the locker room,” Hawks general manager Travis Schlenk said. “We’ve said all along that it takes high-character, good guys to help a young team grow. Jeremy fits the bill. We had two point guards on the roster, and we needed a third.”\nThe third point guard is Trae Young, the No. 5 overall pick in the draft last week. There is no scenario in which Young, if healthy, isn’t playing major minutes as part of coach Lloyd Pierce’s rotation in 2018-19. And if Lin is the veteran mentor for Young, that means Schroder isn’t.\nSchlenk wouldn’t comment on what Lin’s acquisition means for Schroder’s status with the team. But it’s obvious the Hawks want to move on from Schroder, their first-round draft pick in 2013, because otherwise Lin’s deal makes even less sense. Schroder will make $15.5 million next season and no team wants to use $29 million of cap space on point guards, especially not the rebuilding Hawks.\nThe Hawks have been trying to trade Schroder for weeks, but haven’t found much of a market for him, according to a person with knowledge of the discussions. Schroder’s poor 3-point shooting and atrocious defense last season hurt his trade value but not as much as his legal troubles, according to people with knowledge of how other teams view Schroder.\nBrookhaven Police arrested Schroder and three other men on misdemeanor battery charges in September. According to court records, the case was transferred to the DeKalb County District Attorney’s office in March with the recommendation that it be prosecuted as felony aggravated battery. The DeKalb DA has not made an announcement on any charges.\nTwo people with knowledge of the case said Schroder and his lawyer discussed a settlement with the alleged victim on at least two separate occasions. Internally, Hawks officials have expressed confidence that Schroder won’t end up in jail. But other teams apparently aren’t so sure and thus are reluctant to give up much in a trade for Schroder.\nSchlenk likely will have a hard time finding a good deal for Schroder so long as his legal case is pending. Schlenk probably further decreased his leverage by acquiring Lin because now trade partners know that Schlenk must shed Schroder before the start of the season. Schlenk eventually may have to make a lopsided trade just to get rid of Schroder, like he did with Dwight Howard in summer 2017.\nWith Schroder’s eventual departure in the works, Schlenk decided to acquire Lin as his replacement. I’m guessing Schlenk didn’t believe he could get a point guard back when and if he trades Schroder and he also apparently didn’t like the cheaper point guards available on the free-agent market.\nIt’s less clear why Schlenk didn’t make the same deal with the Nuggets as Brooklyn. The Nets acquired a top-12 protected 2019 draft pick from the Nuggets for the favor of taking on veteran big men Kenneth Faried and Darrell Arthur. A person familiar with trade discussions said the Hawks could have made a similar deal with the Nuggets.\nIf Schlenk had done so, it wouldn’t have netted him a replacement for Schroder. But I think that’s a problem that could be solved later if the haul included a valuable first-round draft pick. The Hawks already could have as many as three first-round picks in 2019 and apparently had a chance to add a possible fourth.\nIn any event, Schlenk decided to acquire a veteran point guard now and he believes Lin is a good fit for the Hawks. After drafting Young, the Hawks said all the right things publicly about Schroder playing alongside the rookie, but what else could they say? Adding Lin is the latest indication that, no matter what the Hawks say, Schroder’s days as their point guard are nearing an end.","url":"https://www.ajc.com/blog/atlanta-hawks/hawks-add-high-character-jeremy-lin-continue-seek-trades-for-dennis-schroder/z3obP48bsM2cAmA4U52FkO/"}
