{"authors":[],"date_download":"2018-10-30 19:24:44","date_modify":"2018-10-30 19:24:44","date_publish":"2018-06-28 18:29:00","description":"The Hawks will have roughly $20 million in space under the salary cap when the NBA free-agency perio...","filename":"data/vaneerConsumption/HawkstoplaywaitinggameinNBAfreeagentmarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/28/Images/051518%20hawks%20coach%20CC25.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_hawks-pla_6874146eaf3294a347a84694e95df739__1540927484.html","title":"Hawks to play ‘waiting game’ in NBA free agent market","title_page":"Hawks to play ‘waiting game’ in NBA free agent market","title_rss":"NULL","source_domain":"ajc.com","text":"The Hawks will have roughly $20 million in space under the salary cap when the NBA free-agency period officially begins Sunday, but don’t look for them to seek out the top players on the market.\nInstead, Travis Schlenk’s second summer as Hawks general manager likely will look much like his first.\nThe Hawks will prioritize using the cap space to trade for expensive and unwanted players in exchange for draft picks and young players. Then, after the market has settled, the Hawks sign a free agent or two for depth on their young roster.\n“We are not going to be quick out of the gate looking to sign guys,” Schlenk said. “We will see what the market dictates. We’ve got 12 guys under contract, so three open spots. We will play the waiting game and see how market plays out.”\nThe Hawks have 12 players with guaranteed contracts for 2018-19 and three others with non-guaranteed deals: Antonius Cleveland, Isaiah Taylor and Jaylen Morris. That gives Schlenk the flexibility to use up to six spots to shape the roster.\nLast summer Schlenk added experience to a young roster by signing free agents Dwayne Dedmon, Mike Muscala, Luke Babbitt and Ersan Ilyasova. However, there’s less of a need to do the same this year because Dedmon and Muscala exercised their contract options for 2018-19. The Hawks also have fewer minutes to offer veterans next season because they added three players in the first round of last week’s draft: Trae Young, Kevin Huerter and Omari Spellman.\nIn addition to those three rookies, the Hawks’ roster includes four players entering their second NBA season: Cleveland, Morris, John Collins and Tyler Dorsey. Three other players are entering their third season in the league: Taylor, Taurean Prince and DeAndre’ Bembry.","url":"https://www.ajc.com/sports/basketball/hawks-play-waiting-game-nba-free-agent-market/rOZP9VzZGpUp178JUzVbDK/"}
