{"authors":[],"date_download":"2018-10-30 19:24:37","date_modify":"2018-10-30 19:24:37","date_publish":"2018-06-27 19:47:00","description":"The Hawks will not extend qualifying offers to forward Damion Lee or guards Malcolm Delaney and Josh...","filename":"data/vaneerConsumption/HawksallowDelaneyMagetteandLeetobecomeunrestrictedfreeagent.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/27/Images/100917%20hawks%20photos%20CC18.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_hawks-dec_c35e1f6ec38eeed39ed0de16c2ab3d7e__1540927477.html","title":"Hawks allow Delaney, Magette and Lee to become unrestricted free agent","title_page":"Hawks allow Delaney, Magette and Lee to become unrestricted free agent","title_rss":"NULL","source_domain":"ajc.com","text":"The Hawks will not extend qualifying offers to forward Damion Lee or guards Malcolm Delaney and Josh Magette, according to a person with knowledge of the team’s decisions. As a result, all three players will become unrestricted free agents.\nBy extending a qualifying offer, the Hawks could retain the right to match any offer sheets those players singed as restricted free agents. The players are eligible to re-sign with the Hawks as unrestricted free agents.\nDelaney, 29, played 54 games at both guard positions for the Hawks last season with averages of 18.8 minutes, 6.3 points and three assists. Delaney signed with the Hawks as a free agent in 2016 after playing overseas.\nMagette, 28, made his NBA debut with the Hawks this season after signing a two-way contract that divided his time between the NBA and the G League affiliate in Erie. Magette played 18 games as a reserve point guard for the Hawks with averages of 12 minutes and 3.2 assists. Magette is now scheduled to go to Las Vegas Summer League with the Warriors.\nLee made his NBA debut in March after signing a 10-day contract with the Hawks. Lee subsequently signed two more contracts with the Hawks to finish out the season. He played in 15 games with averages of 26.9 minutes, 10.7 points, 4.7 rebounds, 1.9 assists and 1.3 steals.\nOnce their three recent draft picks sign, the Hawks will have 12 players with fully guaranteed contracts for next season and three players with non-guaranteed deals. They will have up to $20 million in salary-cap space available to sign free agents.","url":"https://www.ajc.com/sports/basketball/hawks-decline-qualifying-offers-three-players/9dKybdO5oh202QLOl2ZesL/"}
