{"authors":[],"date_download":"2018-10-30 19:22:14","date_modify":"2018-10-30 19:22:14","date_publish":"2018-06-19 19:53:00","description":"The Hawks essentially are on the clock in the next step of the organization’s rebuild.","filename":"data/vaneerConsumption/HawkshaveeightchoiceswithNo3draftpick.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/19/Images/GettyImages-906543166.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_hawks-have-eight-choices__1540927334.html","title":"Hawks have eight choices with No. 3 draft pick","title_page":"Hawks have eight choices with  No. 3 draft pick","title_rss":"NULL","source_domain":"ajc.com","text":"The Hawks essentially are on the clock in the next step of the organization’s rebuild.\nThe franchise has four selections in Thursday’s NBA draft, including the third overall pick. The decision on whom to take with the lottery pick could change the fortunes of the franchise – for the good or bad. The last time the Hawks had the No. 3 pick was 2007, when they selected Al Horford and immediately began a run of 10 consecutive playoff berths. That was snapped this season when the team elected to undergo major roster changes.\nHawks general manager Travis Schlenk, the architect of the rebuild, has previously stated there are about eight players the team might choose that high in the first round. That number was likely reduced to three or four following the draft lottery when the draft selection order was finalized. The Hawks also have picks Nos. 19 and 30 in the first round and 34 in the second round.\nAssistant general manager Jeff Peterson recently spoke with The Atlanta Journal-Constitution about the eight players widely considered the top prospects in this draft. Here is what he said about each.\nDeandre Ayton\n“Just from a physical and athletic standpoint, he’s pretty unique. There is no doubt that he will be able to translate to an NBA game from that standpoint. He’s pretty mobile, agile. Someone that big, that size that can move the way he does is pretty impressive. This year he showed the ability to make shots. Of course, he can still improve in that area, but it’s not like he’s a non-shooter.”\nMarvin Bagley III\n“One thing you get immediately with him is his motor, his willingness to play hard every possession. You go watch him in practice, in a game, in a workout and he’s going hard. Coaches will very, very much appreciate that they won’t have to coach his effort. As fans, you will really appreciate that he is going to go hard every possession. Regardless of who he’s going up against, he’s trying to take the head off.”\nMo Bamba\n“He blocks shots. He rebounds. He protects the rim. Even some games you watch, he may end up with only one or two blocks, but he changed six, seven, eight shots. Guards get in there and they don’t want to try because he’s standing there, which is valuable. He has shown the ability to make shots. He needs to get a little bit more consistent in that area if he wants to be known as a shooter, which I think he does.”\nWendell Carter Jr.\n“I think he’s one of those guys who may not be as explosive, but he’s an efficient athlete. You watch some guys in the league and they get from point A to point B with a few amount of steps, and that’s Wendell. He just knows how to use his body. He’s done a fantastic job with his body. His strength and conditioning are fantastic. I think he will continue to get better athletically.”\nLuka Doncic\n“The NBA is moving more toward ball movement, player movement and (Doncic) really thrives in that area. It’s his vision, his willingness to make passes, his unselfishness. His size allows him to see over guys and find guys in different angles. He’s a decent shooter. The thing with him is, he’s not afraid to take big shots and he makes big shots. He has a ton of confidence to be able to do what he’s doing at that age at that level in that league is pretty impressive.”\nJaren Jackson Jr.\n“With him it’s pretty neat because he’s not only capable of scoring on the interior, but he can also step outside and shoot the basketball. He shot at a very high clip this year (38-for-96 on 3-pointers, 39.6 percent). He’s confident in his shot. He’s an unbelievable rim protector. Very good on the defensive end. Just instincts and plays hard and doesn’t give up. He blocks shots, challenges shots.”\nMichael Porter Jr.\n“He’s got good instincts. Scores off the dribble. Catch-and-shoot. He’s got range. Scores on the block, in the mid-post area, gets to the free-throw line. He scores in transition — he has long strides. Offensive rebounds. He’s able to find a way. Some of it, I’m sure, comes from being naturally gifted but a lot of it is he worked for that stuff. Just being younger and playing a lot, and getting those instincts and timing. Can’t take away anything from his work ethic in trying to perfect his craft.”\nTrae Young\n“I think his ability to make plays for his teammates — really good passer, really good vision — can really be an asset for any team. When you get guys who can find teammates and distribute the ball like he can and typically is pretty accurate, that’s valuable. He obviously can make shots. His range is very impressive.”","url":"https://www.ajc.com/sports/basketball/hawks-have-eight-choices/pNRfj9TsPzV2G1xz6GkatO/"}
