{"authors":["Associated Press"],"date_download":"2018-10-22 21:12:39","date_modify":"2018-10-22 21:12:39","date_publish":"2017-04-26 01:15:26","description":"Paul Millsap has accused the Washington Wizards of bringing mixed martial arts to the court.Jimmy Butler has had it up to here with Boston's Marcus Smart.As...","filename":"data/vaneerConsumption/HawksWizardsBullsCelticsheadedtotestyGame5s.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/01/wire-462453-1493166026-231_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4445978_Hawks-Wizards-Bulls-Celtics-headed-testy-Game-5s_1540242759.html","title":"Hawks-Wizards, Bulls-Celtics headed to testy Game 5s","title_page":"Hawks-Wizards, Bulls-Celtics headed to testy Game 5s | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paul Millsap has accused the Washington Wizards of bringing mixed martial arts to the court.\nJimmy Butler has had it up to here with Boston's Marcus Smart.\nAs the series between the Hawks and Wizards and Celtics and Bulls each enter pivotal Game 5s on Wednesday night, the tension and pressure is surfacing all over the place.\nChicago Bulls' Jimmy Butler (21) is pressured by Boston Celtics' Marcus Smart during the second half in Game 4 of an NBA basketball first-round playoff series in Chicago, Sunday, April 23, 2017. The Celtics won 104-95. (AP Photo/Charles Rex Arbogast)\nThe latest dustup came after Boston won its second straight game in Chicago to even that series at 2-2, with Butler essentially accusing Smart, the rugged Celtics guard, of being a fake tough guy.\n\"We're not going to sit here and get in each other's faces,\" Butler said after the game. \"He's not about that life.\"\nSmart tried to keep the focus on the game when asked about Butler's comments on Tuesday, but it was clear he took exception to the characterization even if he didn't want to get into a war of words with the Bulls star.\n\"I can show you better than I can tell you. Last time I checked if you gonna say somebody ain't about that life you should know, right?\" Smart said. \"We're gonna keep this Chicago Bulls vs. Boston Celtics. Not Marcus vs. Jimmy.\"\nThe Hawks were in danger of getting bullied out of the first round quickly after the Wizards, adopting the Death Row D.C. moniker that embodied the notorious hip hop label, got physical to win Games 1 and 2. But the Hawks responded in Atlanta to even the series, with Millsap delivering 29 points, 14 rebounds and five assists in Game 3.\n\"We've got home court for a reason,\" Wizards guard John Wall said after the Game 4 loss. \"It's an opportunity for us to go home, take care of what we need to do and come back here on Friday.\"\nHere is what to know heading into Wednesday night:\n___\nHawks at Wizards, Series tied 2-2. Game 5, 6 p.m., NBATV\nNEED TO KNOW: After looking lethargic to fall behind 2-0 in the series, the Hawks came alive back home in Atlanta. Dwight Howard helped lead the way in Game 4 with 16 points and 15 rebounds, looking more like the athletic paint prowler he was earlier in his career. Now the series shifts back to Washington, where the Wizards flexed their way through the first two games. The Wizards won 30 games at home during the regular season, the second-most in the Eastern Conference.\nKEEP AN EYE ON: The Hawks role players. They were the difference in Atlanta, and the Wizards couldn't match their depth. Jose Calderon had 10 points and five assists, Taurean Prince had 11 points and seven rebounds and Kent Bazemore had 16 points and seven assists, giving the Hawks a dizzying balance that had the Wizards scrambling on defense. Role players tend to play better at home, so their ability to sustain those efforts in Washington will be crucial.\nINJURY UPDATE: None.\nPRESSURE IS ON: Markieff Morris. The Wizards forward has been vocal in this series, calling Millsap a \"crybaby\" at one point. But after scoring 21 points in the Game 1 victory, he has scored just 21 points in the next three games combined. He went 7 for 24 from the field in Atlanta, and the Wizards need him to make some shots to take some of the attention away from Wall and Bradley Beal.\n___\nBulls at Celtics, Series tied 2-2. Game 5, 8:30 p.m., TNT\nNEED TO KNOW: After being thoroughly outplayed in Games 1 and 2, the Celtics have started to resemble the team that outfought Cleveland down the stretch for the East's No. 1 seed. The two biggest reasons have been the broken right thumb of the Bulls' Rajon Rondo suffered in Game 2 and the decision by Boston coach Brad Stevens to go smaller since then by sitting starter Amir Johnson in favor of energetic scorer Gerald Green. The move has worked out with Green scoring eight points in Game 3, and posting 18 points and seven rebounds in Game 4. The Bulls will now try to get a similar boost with Chicago coach Fred Hoiberg saying he will start Isaiah Canaan at point guard in place of Jerian Grant.\nKEEP AN EYE ON: Isaiah Thomas. The Celtics star has played with a heavy heart after the sudden death of his sister, but he was so effective in Game 4 that Hoiberg accused him of carrying the ball. \"Out of everything I do on the court, he wants to bring that up,\" Thomas said. \"I mean, it is what it is. I'm just gonna continue to dribble the ball the way I know how.\"\nINJURY UPDATE: Rondo did some shooting before practice on Tuesday and did not have a cast on his right hand. He's out for Game 5, but Hoiberg at least left open the possibility of him returning before the end of the series.\nPRESSURE IS ON: The Bulls. While Rondo's loss was a big blow, Chicago must do a better job of sharing the ball than it has the last two games. The Bulls' assists have dropped from 22 and 28 in Games 1 and 2 with Rondo to just 14 and 19 in Games 3 and 4 without him.\n___\nAP Sports Writer Kyle Hightower in Boston contributed to this report.\nAtlanta Hawks Dwight Howard dunks over Washington Wizards Marcin Gortat and Bradley Beal in an NBA playoff basketball game , in Atlanta on Monday, April 24, 2017. Atlanta won 111-101 to even the best-of seven series at 2-2. (Curtis Compton/Atlanta Journal-Constitution via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4445978/Hawks-Wizards-Bulls-Celtics-headed-testy-Game-5s.html"}
