{"authors":[],"date_download":"2018-10-30 21:20:10","date_modify":"2018-10-30 21:20:10","date_publish":"2017-01-31 18:47:04","description":"The Hawks announced that their NBA Development League team will play in Erie, Pa.","filename":"data/vaneerConsumption/HawksannouncedealtobeginDLeagueoperationsinErie.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/31/Images/newsEngin.17474199_Drive-BayHawks-Basketball.J.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_hawks-ann_4b7e64c27c5c2f52c974677c8bfa6746__1540934410.html","title":"Hawks announce deal to begin D-League operations in Erie","title_page":"Atlanta Hawks to run D-League team in Erie, Pa. for two years","title_rss":"NULL","source_domain":"ajc.com","text":"The Hawks announced that their NBA Development League team will play in Erie, Pa., for two seasons before it is permanently relocated to College Park. The Hawks will partner with the Erie BayHawks current management team, led by Owen McCormick and Matt Bresee, for the 2017-18 and 2018-19 seasons as the 24th D-League franchise. The team will move to College Park for the 2019-20 season in a new arena.\nThe Atlanta Journal-Constitution reported that the Hawks were in the final stages of the early entry into the D-League earlier this month.\nThe Erie BayHawks franchise was acquired by the Magic last month to relocate to Lakeland, Fla. where it would be renamed and rebranded.\n“Since becoming owners of the Atlanta Hawks, securing a D-League team has been one of our group’s top priorities — along with the implementation of a large-scale renovation and upgrade to Philips Arena and construction of a new, world-class practice facility, which were previously announced,” Hawks principal owner Tony Ressler said in a statement.\n“This opportunity to start two years sooner is even better news for both Erie and Atlanta and we are excited to get a head start on Coach (Mike Budenholzer) and (general manager) Wes Wilcox’s efforts to develop players as they work to build a championship-caliber team. We would like to thank the BayHawks’ management team for working with our Club and the City of College Park, as it constructs a new facility, as well as the NBA D-League for assisting us in our efforts.”\nMembers of current Hawks management have a previous relationship with the BayHawks. Wilcox helped create and run the BayHawks while he worked for the Cavaliers. The BayHawks were a multi-affiliated franchise at their start. John Treloar, the current Hawks director of player personnel, served as the coach of the BayHawks for the first two seasons. Wilcox helped run the BayHawks for a third season before the Cavaliers bought the D-League franchise in Canton. Wilcox served as that franchise’s first general manager until he joined the Hawks as assistant general manager in 2012.","url":"https://www.ajc.com/sports/basketball/hawks-announce-deal-begin-league-operations-erie/QMHzBZyDnJMdFP9KFrOWLM/"}
