{"authors":[],"date_download":"2018-10-30 19:24:19","date_modify":"2018-10-30 19:24:19","date_publish":"2018-06-25 17:15:00","description":"Trae Young comes to the Hawks with the expectation that he will develop into a star NBA point guard.","filename":"data/vaneerConsumption/HawkscoachsaysDennisSchroderonboardtoberolemodelrsqu.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/25/Images/hawks_2018_draft_picks.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_hawks-coa_7513802a062ee811cfe13d5702b51a90__1540927459.html","title":"Hawks coach says Dennis Schroder on board to be ‘role model&rsqu","title_page":"Hawks coach says Dennis Schroder on board to be ‘role model&rsqu","title_rss":"NULL","source_domain":"ajc.com","text":"Trae Young comes to the Hawks with the expectation that he will develop into a star NBA point guard. The Hawks already have an established point guard, Dennis Schroder, and the incumbent expressed a desire for a trade even before the team acquired Young in the draft last week.\nManaging that dynamic will be one of first-year coach Lloyd Pierce’s tasks. He said that after talking with Schroder following the draft he believes the veteran will help the incoming rookie adjust to the NBA.\n“I think Dennis will be a tremendous role model,” Pierce said Monday. “We’ve talked already about him and Trae not only coexisting, but him being a leader for Trae and helping him on the court. Dennis has had a lot of success in the league and he’s a guy that still has a lot of growing to go, and Trae is just trying to follow in those footsteps.”\n» More: Trae Young on leading as a rookie\nIn a news conference last month in his native Germany, Schroder seemed to express a desire for a trade and mentioned Indiana and Milwaukee as preferred destinations. The Hawks are willing to trade Schroder for the right price but, so far, the market for him has been tepid and there is no internal urgency to get a deal done, according to a person familiar with the team’s plans.\nSoon after the Hawks acquired Young in a draft-night trade, general manager Travis Schlenk said Young and Schroder can play together in a small lineup. With veteran leader Kent Bazemore as the incumbent starter at shooting guard, the most likely scenario is for Young to play off the bench alongside Schroder for a few minutes before taking over the point when Schroder takes a seat.\n» Also: Kevin Huerter will miss summer league with injury\n“It’s understandable when you come into the league you want to jump right in right away,” Pierce said. “When you have to go through a little of the growing pains, whether it’s minutes or playing behind a guy or maybe it’s just not having the amount of success you initially thought — that’s what young guys do. There’s the impatience and the wanting to be better quicker. We talk about not skipping steps.”\nSchroder hasn’t commented publicly since the news conference in Germany. Earlier this month Schroder joined some of his Hawks teammates for informal workouts at the team’s practice facility. Schroder currently is playing for the German national team in FIBA European qualifying.\nPierce said he’s confident Schroder will work well with Young when he returns.\n“Talking to Dennis, he’s excited,” Pierce said. “He was excited about who were going to end up with in the draft and he was excited about where we are headed. I talked to him about playing with Trae and with the other guys. He’s back in Germany with his national team but he’s also excited about the guys that we have.”\n» Watch: Omari Spellman on conditioning plan","url":"https://www.ajc.com/sports/basketball/hawks-coach-pierce-says-dennis-schroder-board-role-model-for-trae-young/BHOedbSox2boJbNbKbd6nL/"}
