{"authors":[],"date_download":"2018-10-30 21:48:34","date_modify":"2018-10-30 21:48:34","date_publish":"2016-12-21 18:46:00","description":"There were 50 of them, from the Decatur YMCA, crowded into the back of the Northlake Mall department store for a Christmas surprise Tuesday afternoon.","filename":"data/vaneerConsumption/HawksDwightHowardsurpriseskidswithChristmasshoppinginDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/21/Images/dwight-howard-ymca-jcpenney6.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_hawks-dwight-how_02cdfff97b80af5bc9cdcca1cec0346f__1540936114.html","title":"Hawks' Dwight Howard surprises kids with Christmas shopping in DeKalb","title_page":"Hawks' Dwight Howard surprises kids with Christmas shopping in DeKalb","title_rss":"NULL","source_domain":"ajc.com","text":"The JCPenney rep turned hype man was doing his best to get the kids excited. There were 50 of them, from the Decatur YMCA, crowded into the back of the Northlake Mall department store for a Christmas surprise Tuesday afternoon.\nThe children played along politely. When the man requested noise, they made it.\nThen: the surprise.\nFrom the back offices of the Customer Services Department, Atlanta Hawks center Dwight Howard appeared, wearing a sly smile and towering over the kids with his 6-foot-11 frame.\nThe children roared and clapped wildly.\nSome just dropped their mouths open and looked up at Howard in amazement. Could it really be him?\nHoward came to the store to help the children each spend a $100 gift card for Christmas.\nDwight Howard and JCPenney team up to bring some holiday joy to 50 local YMCA kids in Atlanta.\nHoward’s mere presence seemed to be something of a gift.\n“You’re my favorite basketball player,” one boy blurted.\n“How tall are you?” asked a girl.\n“Why’d you leave Houston?” one brave boy asked the former Rocket.\nHoward laughed and said he wanted to come home.\nHoward is an Atlanta native who used to be a kid at the Y himself.\n“All you guys are my little brothers and sisters,” he said.\nHe encouraged them to think not just of themselves while burning through the Christmas cash.\n“Always remember giving is better than receiving,” he said.\nSo 16-year-old Zyreia Larry eyed a jean jacket for her grandmother.\nSamya Henderson, 11, thought about what her mom would like this year.\nThe kids were also encouraged to get something for themselves. Howard hammed a bit while helping girls pick out shoes.\nHe kidded them that they were hard to shop for.\nAtlanta Hawks center Dwight Howard and his foundation D12 partner with JCPenney at Northlake Mall to surprise 50 kids from Decatur YMCA in DeKalb. (Courtney Martinez/CoxInc.com)\nZemetrick Larry, 14, is literally hard to shop for. He’s 6-foot-3 and is naturally under served by the inventory of most department stores.\nHoward asked Larry’s mom for their contact info. Maybe they could find the boy something for Zemetrick.\n“This is really great,” beaming mother Shawntae Thorton said.\nAtlanta Hawks center Dwight Howard helps Zemetrick Larry shop at the Northlake Mall JCPenney. Larry, 14, stands at 6-foot-3, while Howard is 6-foot-11.(Courtney Martinez/CoxInc.com)\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram\nVIDEO: Dwight Howard's mannequin challenge\nRELATED: Evander Holyfield visits the Boys and Girls Club","url":"https://www.ajc.com/news/local/hawks-dwight-howard-surprises-kids-with-christmas-shopping-spree/dGxetNmG8TpFcmDSXJzXQM/"}
