{"authors":["Associated Press"],"date_download":"2018-10-23 00:47:39","date_modify":"2018-10-23 00:47:39","date_publish":"2017-03-16 10:19:38","description":"ADDIS ABABA, Ethiopia (AP) - Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, ending his...","filename":"data/vaneerConsumption/HayatousreignendsasAfricansoccerheadandFIFAVP.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/18/wire-230081-1489689259-147_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319552_Zanzibar-admitted-member-African-soccer-body_1540255659.html","title":"Hayatou's reign ends as African soccer head and FIFA VP","title_page":"Hayatou's reign ends as African soccer head and FIFA VP | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ADDIS ABABA, Ethiopia (AP) - Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, ending his tenure as FIFA senior vice president.\nHayatou's 34-20 loss to Ahmad in a vote by the Confederation of African Football's member countries delivered a seismic shakeup for soccer on the continent, which Hayatou had led since 1988.\nThe 70-year-old from Cameroon left the congress room briefly without commenting when the result was announced, led away by the arm by one of his aides. He returned to conduct other business.\nIssa Hayatou, right, speaks to FIFA President Gianni Infantino, left, at the opening of the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nNew CAF president Ahmad, who is from Madagascar and goes by one name, was held aloft by officials. He then hugged people around him.\n\"This is sweet victory,\" said Ahmad, the president of his country's soccer federation. \"When you work hard for years and months and you succeed, that is great.\"\nAs the result became apparent, Phillip Chiyangwa, Ahmad's campaign manager, shouted, \"We won!\"\n\"This was coming. He (Hayatou) knew it was coming,\" said Chiyangwa, the president of the Council of Southern African Football Associations whose fierce criticism of Hayatou in the lead-up to the vote highlighted a nasty campaign.\nAhmad's victory also has implications for FIFA politics.\nFIFA President Gianni Infantino invited speculation he was backing Ahmad, and turned on his senior vice president when he appeared last month at a party hosted by Ahmad's flamboyant campaign manager.\nHayatou was never an ally of Infantino, judging by his support for one of Infantino's opponents in the FIFA presidential election last year. Ahmad's victory could give the FIFA president another friend on his council. Ahmad becomes a FIFA VP in Hayatou's place as head of the African confederation.\nInfantino was at the election in Ethiopia.\n\"It is annoying that a FIFA president influenced this election for his own interest,\" said Hayatou supporter Opes Manuel Nascimento, the head of the Guinea-Bissau federation.\nHayatou, a member of FIFA's top brass since 1990, appeared to be the latest of the old guard removed by a desire for change sweeping through soccer since FIFA's corruption scandal two years ago.\n\"We are very happy that African football has now been liberated,\" Rwanda association president Vincent Nzamwita said.\nWhile there were signs that Hayatou's grip on power was loosening as he sought an eighth term, his defeat was still stunning.\nHayatou stood in as acting FIFA president in the wake of the 2015 scandal, reigned supreme over CAF for three decades, and had been challenged only twice before for re-election. Both those times he won by a landslide and hadn't faced a challenger in more than a decade.\n\"This is a change which came after too long,\" Swaziland soccer official Mahlaba Mamba said. \"From 1988 to 2017 ... that's too long.\"\nHayatou was finally beaten by a man who promised to modernize CAF and make it more transparent. Ahmad's priority was to set up a new code of ethics for CAF, he said.\nHis focus on ethics came at a time when Hayatou and CAF secretary general Hicham el Amrani have been recommended for criminal prosecution in Egypt over a $1 billion marketing and television rights deal. They are accused of breaching anti-monopoly regulations.\nCAF denies any wrongdoing, but a defeated Hayatou may be heading to court.\nAhmad also made enticing pledges to voters, offering more money to countries from CAF's central coffers and business class travel for officials heading to meetings.\nHe said he was \"open to dialogue\" regarding moving the African Cup of Nations to every four years and not every two as it is currently. That would move it in line with other major soccer tournaments.\nAlthough Ahmad gives African soccer a potential new start, he has been linked to the old FIFA regime.\nEmail correspondence between Ahmad and an aide to disgraced former FIFA presidential candidate Mohamed bin Hammam of Qatar was published by British newspaper The Sunday Times in 2014.\nThe emails from 2010 detail Ahmad reminding Bin Hammam that he promised money to help Ahmad's re-election campaign to lead the Madagascar federation. The Bin Hammam aide who Ahmad was emailing, Najeeb Chirakal, was banned for life by the FIFA ethics committee in January for involvement in unethical payments made to soccer officials.\nAside from Hayatou, there was little change in Africa's other places on the FIFA Council: Tarek Bouchamaoui (Tunisia), Almamy Camara (Guinea), Lydia Nsekera (Burundi), Kwesi Nyantakyi (Ghana) and Constant Omari (Congo) retained their seats. Egypt's Hany Abo Rida withdrew from a contest against Bouchamaoui but could still be re-elected to the FIFA Council with one more African place to be decided in an election at a later date.\nAlso, Zanzibar, a semi-autonomous archipelago of islands off the east coast of Africa, was admitted as a full member of CAF. A region of Tanzania but with its own government, Zanzibar will be able to play in CAF's national team competitions and could pursue membership of FIFA.\n___\nAP Sports Writer Graham Dunbar in Geneva and Associated Press writer Andrew Jackson Oryada in Addis Ababa, Ethiopia, contributed to this report.\nIssa Hayatou attends the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nNew president of the African soccer confederation Ahmad of Madagascar, center, is congratulated at the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nIssa Hayatou, right, speaks to FIFA President Gianni Infantino, left, at the opening of the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nNew president of the African soccer confederation Ahmad of Madagascar, speaks at a press conference after being chosen at the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nNew president of the African soccer confederation Ahmad of Madagascar, speaks at a press conference after being chosen at the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nNew president of the African soccer confederation Ahmad of Madagascar, attends the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the African continent. (AP Photo)\nIssa Hayatou, right, speaks as FIFA President Gianni Infantino, left, listens, at the opening of the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nNew president of the African soccer confederation Ahmad of Madagascar, speaks at the general assembly of the Confederation of African Football (CAF) in Addis Ababa, Ethiopia, Thursday, March 16, 2017. Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. (AP Photo)\nFILE - This is a Thursday, Jan. 5, 2017 file photo of Confederation of African Football President Issa Hayatou as he stands during the African Player of the Year CAF Awards in Abuja, Nigeria. Issa Hayatou on Thursday March 16, 2017 was voted out as president of the African soccer confederation after 29 years and will be replaced by Ahmad of Madagascar. Hayatou will also lose his position as a FIFA vice president and his place on the body's ruling council. (AP Photo/Segun Ogunfeyitimi, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4319552/Zanzibar-admitted-member-African-soccer-body.html"}
