{"authors":["Associated Press"],"date_download":"2018-10-22 23:07:14","date_modify":"2018-10-22 23:07:14","date_publish":"2017-04-26 06:40:26","description":"LOS ANGELES (AP) - Gordon Hayward scored 27 points, Utah controlled the paint, and the Jazz beat the Los Angeles Clippers 96-92 on Tuesday night to take a...","filename":"data/vaneerConsumption/Haywardscores27JazzbeatClippers9692totake32lead.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/06/wire-463479-1493185229-829_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446412_Hayward-scores-27-Jazz-beat-Clippers-96-92-3-2-lead_1540249634.html","title":"Hayward scores 27, Jazz beat Clippers 96-92 to take 3-2 lead","title_page":"Hayward scores 27, Jazz beat Clippers 96-92 to take 3-2 lead | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LOS ANGELES (AP) - Gordon Hayward scored 27 points, Utah controlled the paint, and the Jazz beat the Los Angeles Clippers 96-92 on Tuesday night to take a 3-2 lead in their first-round NBA playoff series.\nHayward returned after missing most of Utah's win in Game 4 due to food poisoning.\nChris Paul's 3-pointer drew the Clippers within two with 5 seconds left. After George Hill hit two free throws, Paul struggled getting the ball under control near the sideline and couldn't do anything as time expired.\nLos Angeles Clippers guard JJ Redick, center, tries to pass as Utah Jazz center Rudy Gobert, left, and forward Joe Ingles defend during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Los Angeles. (AP Photo/Mark J. Terrill)\nThe Jazz made five 3-pointers in the fourth quarter, including three by Rodney Hood, who finished with 16 points.\nPaul led the Clippers with 28 points and J.J. Redick added 26 with injured star Blake Griffin watching from the bench, his right foot encased in a black walking boot.\nThe Jazz can clinch the series with a victory in Game 6 on Friday night in Salt Lake City.\nUtah Jazz guard Rodney Hood, right, shoots as Los Angeles Clippers center DeAndre Jordan defends during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Los Angeles. (AP Photo/Mark J. Terrill)\nLos Angeles Clippers guard Chris Paul, left, drives past Utah Jazz guard George Hill during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Los Angeles. (AP Photo/Mark J. Terrill)\nLos Angeles Clippers center DeAndre Jordan looks for a shot as Utah Jazz center Rudy Gobert defends during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Los Angeles. (AP Photo/Mark J. Terrill)","url":"https://www.dailymail.co.uk/wires/ap/article-4446412/Hayward-scores-27-Jazz-beat-Clippers-96-92-3-2-lead.html"}
