{"authors":["Ian Laybourn","Press Association"],"date_download":"2018-10-23 02:09:17","date_modify":"2018-10-23 02:09:17","date_publish":"2016-01-28 16:54:01","description":"The proposals include two replacement stands in the rugby stadium and will increase the capacity and improve facilities of the cricket ground. The new South Stand will include seats for the first time.","filename":"data/vaneerConsumption/Headingleysetforforrevampaheadof2019CricketWorldCupasplansareunveiled.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC606200000578-0-image-a-78_1453999975380.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3421295_Headingley-set-revamp-ahead-2019-Cricket-World-Cup-plans-unveiled_1540260557.html","title":"Headingley set for for revamp ahead of 2019 Cricket World Cup as plans are unveiled","title_page":"Headingley set for for revamp ahead of 2019 Cricket World Cup as plans are unveiled | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leeds have unveiled plans to redevelop Headingley with the aim of retaining its status as a Test match ground ahead of the 2019 World Cup and a regular venue for major rugby league fixtures.\nThe proposals, to be aired at a series of public meetings in February, include two replacement stands in the rugby stadium and will increase the capacity and improve facilities of the cricket ground.\nThe new South Stand will include seats for the first time while increasing the standing capacity.\nThe plans involve redeveloping the main cricket stand in a bid to retain the ground's status as a Test venue\nAn artists' impression shows what the new south stand at the rugby pitch will look like\nLeeds intend to secure public and private funding while the Rhinos will provide the majority of the remaining investment through the proposed sale of two sites for housing development in Weetwood and Tingley.\nLeeds chief executive Gary Hetherington said: 'We have been working behind the scenes with Yorkshire County Cricket Club and Leeds City Council for many years and now the vision of a completely redeveloped Headingley is a reality.\n'For rugby fans, we will be providing significantly more comfort with much better seating, yet retaining the uniqueness and character of our home.\n'Our overall capacity will not increase but that has never been our aim. We have a 90-year-old main stand and a south stand that was condemned six years ago and is in constant need of repair.\nHeadingley Stadium in Leeds features a cricket ground and rugby stadium\nThe plans will see two replacement stands in the rugby ground where Leeds Rhinos play\n'It will present a major construction challenge and inevitably cause some disruption for all teams during that period. Our stadium capacity will reduce to just over 13,000 for a period during the 2017 season but we are determined to ensure all our ticketed members are guaranteed access to all games.","url":"https://www.dailymail.co.uk/sport/cricket/article-3421295/Headingley-set-revamp-ahead-2019-Cricket-World-Cup-plans-unveiled.html"}
