{"authors":["Sarah Harris For The Daily Mail"],"date_download":"2018-10-23 02:38:16","date_modify":"2018-10-23 02:38:16","date_publish":"2016-01-29 17:14:06","description":"Sir Michael Wilshaw said young people can easily have their heads turned and lose sight of what really matters while around the world Christians are being persecuted for their faith.","filename":"data/vaneerConsumption/HeadofOfstedSirMichaelWilshawwarnsChristianstostandupfortheirfaith.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/064151C200000514-0-image-a-220_1454086358826.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423168_Head-Ofsted-Sir-Michael-Wilshaw-warns-Christians-stand-stop-rise-secular-materialistic-Britain_1540262296.html","title":"Head of Ofsted Sir Michael Wilshaw warns Christians to stand up for their faith","title_page":"Head of Ofsted Sir Michael Wilshaw warns Christians to stand up for their faith | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It has never been more important for Christians to stand up for their faith, the head of Ofsted warned today.\nSir Michael Wilshaw said society is becoming increasingly 'secular and materialistic', with 'seemingly ever greater intolerance of other people's beliefs'.\nYoung people can easily 'have their heads turned and lose sight of what really matters' while in other parts of the world, such as the Middle East, Christians are suffering 'brutal persecution' simply for 'what they believe', he argued.\nBut schools can help to instil good morals and values such as tolerance and compassion, the Ofsted chief suggested.\nHead of Ofsted Sir Michael Wilshaw, pictured talking to students at St Pauls Way Trust School in East London, said it has never been more important for Christians to stand up for their faith\nSir Michael was brought up in a Roman Catholic household in south London in the 1950s and was headteacher of St Bonaventure's Catholic Comprehensive School in Forest Gate, East London, before becoming executive principal of Mossbourne Community Academy in nearby Hackney.\nAddressing the Catholic Association of Teachers, Schools and Colleges' annual conference today (Friday), Sir Michael said: 'I was always stimulated by teaching young people, especially those who came from disadvantaged backgrounds.\n'I saw it as my duty, both as a teacher and a Christian, to do the best for them and to get the best out of them.\n'For me, this was about more than just making sure that they did as well as they could in their exams – important though that was.\n'It was about instilling in them the values they could hold onto and live by for the rest of their lives.'\nSir Michael was brought up in a Roman Catholic household in South London and was headteacher at St Bonaventure's Catholic Comprehensive School in Forest Gate, East London\n'I HAVE AN EVANGELICAL ZEAL TO DO CHRIST'S WORK ON EARTH' Sir Michael Wilshaw devout faith is known to drive everything he does. Brought up in a Roman Catholic household in South London, Sir Michael has kept hold of his faith throughout his life, once revealing to journalist Peter Wilby that he had ‘an evangelical zeal to do Christ’s work on Earth’. For him, that work was changing the lives of children. Last year, he was named the second most influential Catholic in the country, by journal The Tablet. He was only beaten to the top spot by Bank of England chief Mark Carney.\nSir Michael went on: 'It doesn't need me to tell you that we are living in an increasingly secular and materialistic society where young people can so easily have their heads turned and lose sight of what really matters.\n'At the same time, we are also living through an era marked by seemingly ever greater intolerance of other people's beliefs, views and ways of living.\n'Therefore, it has never been more important for Christians to stand up for their faith and for the Gospel values of love, compassion and tolerance.\n'Not just because of what's happening in this country, but in the context of what is happening in the Middle East and other parts of the world, where Christians are suffering brutal persecution for what they believe.'\nThe chief schools inspector said it is important for Catholic school leaders to inform pupils about other religions, even if their first role is to promote and celebrate their own faith.\nSir Michael, pictured with Rhys Lockyer (left) and King Akingbulu (right) during a visit to Windrush Nursery in Woolwich, said schools must help instil good morals, tolerance and respect\nHe added: 'When I led a Catholic school in the heart of an overwhelmingly Muslim area of East London, I always made sure my pupils understood and respected the fact that others followed different customs and subscribed to a different set of beliefs.\n'We didn't go into any great detail about other world religions, but I saw it as my obligation to teach pupils about the synergies between the great faiths and that all people are equal in the eyes of God.\n'It is so important that, as Catholic leaders, we adopt this approach. All of us understand that erecting barriers and pushing others away breeds suspicion, insularity and division. This is certainly what we saw in a number of schools in Birmingham.'\nOfsted is now actively inspecting how well schools are promoting values such as tolerance and respect, a move that came in the wake of the alleged Trojan Horse plot by hardline Islamists to take over some schools in Birmingham.\nErecting barriers and pushing others away breeds insularity and division, which happened in a number of schools in Birmingham, according to the Ofsted chief\nA number of secular and faith schools have been failed by the watchdog for failing to promote these values and narrowing the curriculum, Sir Michael said.\n'It is perfectly legitimate for individuals and faith groups to hold firm to a particular set of values and beliefs, which may run counter to existing social norms,' he added.\n'What is not legitimate is to use these beliefs to condone or even encourage intolerance and discrimination.'","url":"https://www.dailymail.co.uk/news/article-3423168/Head-Ofsted-Sir-Michael-Wilshaw-warns-Christians-stand-stop-rise-secular-materialistic-Britain.html"}
