{"authors":[],"date_download":"2018-10-22 21:44:24","date_modify":"2018-10-22 21:44:24","date_publish":"2014-05-08 05:18:09","description":"Kim Han-sik was detained Thursday ahead of his possible formal arrest on allegations that he was aware that the ferry exceeded its cargo limit.","filename":"data/vaneerConsumption/HeadofCompanyThatOwnedSouthKoreanSunkenFerryDetained.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/428121/140508-ferry-arkin-0148_1426c718da45263a3b577d96f69b50d6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_south-korea-ferry-disaster_head-company-owned-south-korean-sunken-ferry-detained-n100006_1540244664.html","title":"Head of Company That Owned South Korean Sunken Ferry Detained","title_page":"Head of Company That Owned South Korean Sunken Ferry Detained","title_rss":"NULL","source_domain":"nbcnews.com","text":"Yang said prosecutors are investigating Kim's actions before deciding if they will request a court to issue a warrant to formally arrest him. All 15 surviving crew members involved in the ferry's navigation have been arrested, accused of negligence and failing to protect passengers.\nMore than three weeks after the sinking, 269 bodies have been retrieved but 35 others are still listed as missing. South Korea's prime minister said Wednesday that officials must try to complete the search for the missing by Saturday as tidal currents were forecast be weak until then. But no progress has been reported as divers have failed to recover additional bodies since Wednesday afternoon due to high waves and strong winds, government task force spokesman Ko Myung-seok said.\nSearches have been hampered by strong currents, bad weather and floating debris inside the ship. A civilian diver fell unconscious while searching and died on Tuesday, the first fatality among divers mobilized since the sinking.\nThe lengthy, difficult underwater search for bodies off South Korea's southern coast has deepened the anguish of families of missing people, who have been camping out at a nearby port waiting for the news of their loved ones. Many South Koreans have been highly critical of the government's handling of the rescue effort, and the regulatory failures that may have allowed the disaster to happen.\nOn Wednesday, the government announced it miscounted the number of survivors, the latest in a series of missteps it has made that have eroded the nation's confidence in its leaders. Coast guard chief Kim Suk-kyoon said 172 people survived the sinking of the ferry Sewol — not 174, as the government had been saying since April 18.\nKim said one of the survivors was accidentally listed twice, and he blamed the other mistake on an inaccurate report by a passenger. Kim said there are two more missing passengers than authorities previously knew about. Both are Chinese nationals.\nThat change raises the number of people feared dead to 304. More than 80 percent of them are students from a single high school near Seoul who were on a trip to southern Jeju Island.\nThere is evidence not only that the ship was overloaded with cargo, but that the agency responsible for ensuring passenger safety has incorrect information about how much the ship could safely carry.\n—The Associated Press","url":"https://www.nbcnews.com/storyline/south-korea-ferry-disaster/head-company-owned-south-korean-sunken-ferry-detained-n100006"}
