{"authors":[],"date_download":"2018-10-22 21:35:19","date_modify":"2018-10-22 21:35:19","date_publish":"2014-06-04 21:39:31","description":"At least 17 people in 10 states are sick with salmonella tied to organic sprouted chia seed powder, health officials said.","filename":"data/vaneerConsumption/HealthFoodSproutedChiaSeedPowderSickens17.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_health-food-sprouted-chia-seed-powder-sickens-17-n122866_1540244119.html","title":"Health Food? Sprouted Chia Seed Powder Sickens 17","title_page":"Health Food? Sprouted Chia Seed Powder Sickens 17","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSome consumers hoping to get a health boost from organic sprouted chia powder got food poisoning instead, according to health officials who’ve linked 17 salmonella infections in 10 U.S. states to the product.\nAt least a dozen people have been sickened by the Salmonella Newport strain and another five have been ill with Salmonella Hartford, both tied to the chia powder. Two people have been hospitalized, according to a report from the Centers for Disease Control and Prevention.\nProponents of sprouted chia seed powder say it’s a good source of protein, antioxidants and dietary fiber, as well as a natural way to curb appetite.\nThe U.S. food poisoning cases have been tied to an outbreak strain detected in Canada, CDC officials said. Health officials in both countries and several states have cooperated in the investigation, which points to the powder made from ground dried chia seeds as the culprit.\nOn May 28, Navitas Naturals, a Novato, California, firm, recalled several products, including sprouted chia powder, smoothie mix and Williams-Sonoma Omega 3 Smoothie Mixer with specific best-by dates because of potential salmonella contamination.\nOn May 30, firms Advantage Health Matters and Back 2 the Garden also recalled products that contain sprouted chia seed powder because of potential salmonella contamination.\n“CDC recommends that consumers do not eat any of the recalled products containing organic sprouted chia powder,” the agency said in a report.","url":"https://www.nbcnews.com/health/health-news/health-food-sprouted-chia-seed-powder-sickens-17-n122866"}
