{"authors":["Anneta Konstantinides For Daily Mail Australia"],"date_download":"2018-10-22 22:06:35","date_modify":"2018-10-22 22:06:35","date_publish":"2017-03-16 02:46:00","description":"Only those intolerant to gluten should avoid it entirely, according to experts. While Australian nutritionist Lyndi Cohen says carbs are important as they can 'help to keep your mood stable'","filename":"data/vaneerConsumption/Healthyhabitsthatcouldbecausingyoutogainweight.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4FDF9F00000578-0-image-a-24_1489627974465.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318384_Healthy-habits-causing-gain-weight_1540245995.html","title":"'Healthy' habits that could be causing you to gain weight","title_page":"'Healthy' habits that could be causing you to gain weight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From bread and pasta to sweets and red meat, for decades we have been trying to find the 'dangerous' foods in our meals that we need to delete.\nNow diets free of gluten, fat or carbohydrates have become the norm, but dietitians are increasingly warning the public that it has been misinformed.\nFollowing these strict guidelines could be stripping your fridge of important nutrients that curb your appetite, help your mood and, yes, keep you looking good.\nThe war against gluten has been waged with increasing intensity thanks to diets spruiked by the likes of Gwyneth Paltrow and Gisele Bündchen.\nJuicing may be all the rage in Hollywood, but this Instagram-friendly fad could actually be causing you to intake more sugar and calories in your diet as you try to shed kilos\nBut dietitians and nutritionists have long claimed that the only people who should be completely cutting out the protein found in wheat are those with an intolerance.\nStudies, including a recent one by Harvard University, have shown that diets that include a normal amount of gluten were linked to a lower risk of Type 2 diabetes.\nWhole grains with gluten are also high in vitamins and minerals also linked to helping decrease the rick of heart disease and certain types of cancer.\nPlus, a number of manufactured gluten-free foods may have added sugar and fats as compensation that strip them of added health benefits, according to Body+Soul.\nCarbs have long been seen as the devil when it comes to weight loss, but there's nothing healthy about cutting out these energy boosters.\nThe key is to pick good carbs, like brown rice and oats, that will help you feel fuller longer, curbing your appetite in the long run.\nNumerous studies have shown that people who avoid carbs tend to try and find that energy elsewhere, inevitably consuming unhealthier quick-fix options high in sugar.\nA number of manufactured gluten-free foods may have added sugar and fats as compensation that strip them of any added health benefits\nCarbs got a much needed boost, at least when it came to people's attitudes, thanks to a recent studying that proved the benefits of eating pasta.\nThe study, naturally conducted in Italy, found that a consumption of pasta was actually associated with a decrease in body mass index.\nIt summarised, after examining more than 23,000 people, that people who enjoyed pasta were less likely to experience both general and abdominal obseity as well.\nAnd though few would deny the joy that comes from a big bowl of spaghetti or pizza pie, science has also proven that carbs can help your mood.\nResearch has linked carbohydrates to the production of serotonin, a natural mood stabiliser linked to low levels of depression.\nDietitians and nutritionists have long claimed that the only people who should be completely cutting out gluten from their diets are those with an intolerance, such as Coeliac disease\nAustralian nutritionist Lyndi Cohen makes sure to incorporate carbs into her own diet to help cope with the clinical anxiety she was diagnosed with in 2010.\n'Lots of vegetables and legumes [will provide] slow burning carbohydrates, which help to keep your mood and hormones more stable,' she told Daily Mail Australia.\nReady for some more good news? Fat is also a key component of a well-balanced diet, as long as it's the good kind.\nThose frozen meals and packaged snacks advertised to be 'low in fat' are packed with hidden sugars to help boost missing flavour.\nCarbs have long been seen as the devil when it comes to weight loss, but there's nothing healthy about cutting out these energy boosters\nThe key is to pick good carbs, like brown rice (pictured) and oats, that will help you feel fuller longer, curbing your appetite in the long run\nInstead it's better off to eat foods that have healthy sources of fat that will keep you feeling satisfied, whether that be avocado on your toast or Greek yoghurt.\nThen there is the myth that sometimes eliminating food completely, albeit temporarily, is the best way to get lean quick.\nJuicing is yet another diet craze we have Hollywood to thank, but don't be fooled by the pretty pictures of plastic containers in bright greens and yellows.\nMost of these juices, especially those heavy with fruit, are packed with sugar that won't leave you feeling full for very long at all.\nThey also lack the nutrients that will help keep your body working at its highest potential.\nIf you don't want to let go of juices completely, though, have no fear. Just keep them simple, add yoghurt for protein, and trying to stick to vegetables for less sugar.","url":"https://www.dailymail.co.uk/femail/article-4318384/Healthy-habits-causing-gain-weight.html"}
