{"authors":[],"date_download":"2018-10-30 01:18:10","date_modify":"2018-10-30 01:18:10","date_publish":"2018-09-11 00:05:22","description":"Ronald Reagan and Jack Kemp railed against income tax rates crushing the American dream four decades ago. Today, Americans devote almost exactly the same percentage of the economy to healthcare as the federal government received in taxes 40 years ago.","filename":"data/vaneerConsumption/HealthcareDevoursSameGDPPortionThatTaxesDidBeforeReaganCutThem.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/C13539-3a.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862290.html","title":"Healthcare Devours Same GDP Portion That Taxes Did Before Reagan Cut Them","title_page":"Healthcare Devours Same GDP Portion That Taxes Did Before Reagan Cut ThemThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Ronald Reagan and Jack Kemp railed against income tax rates crushing the American dream four decades ago. Today, Americans devote almost exactly the same percentage of the economy to healthcare as the federal government received in taxes 40 years ago.\nConservatives outraged over Big Government devouring nearly a fifth of the gross domestic product (GDP) strangely do not appear troubled, at least not troubled enough to draw up and rally around a plan as Reagan and Kemp did, by Big Medicine feasting on the same share of American economy. Whether Uncle Sam or Doctor Jekyll takes its cut, the results — a smaller cut for the rest of us — remains the same.\nLiberals, devising imaginative plans for free college tuition and the government guaranteeing jobs for all, do not grasp that even less ambitious undertakings remain dead on arrival until we find a way to deflate the expanding balloon that is healthcare spending.\nHealthcare expenses increased from less than 6 percent of gross domestic product in 1966 to almost 12 percent in 1988 to more than 18 percent today. What heights does that number reach 30 years from now? What depths do those high costs drag America down to?\nThe stakes of tabling healthcare action, whether by business or government, involve trillions of dollars — the difference between a stalled economy and a booming one, out-of-control deficits or manageable ones, and personal bankruptcy and getting-by. The 4.1 percent GDP growth experienced in the latest quarter, robust by 21st century standards but fairly pedestrian by the standards of the 20th century, would have undoubtedly reached a much higher number if the U.S. healthcare expenses mirrored those for similar nations.\nAs it stands, we spend more on healthcare than every country save three spends on everything. Our government allocates more to healthcare than Mexicans spend on the whole lot.\nWhen the president entered the world, Americans spent one in twenty dollars on healthcare. Americans will contribute more than one in five dollars, according to the Centers for Medicare and Medicaid Services, by the time he leaves office, should he win a second term.\nThe explosion in expenses corresponds to the federal government’s deepening commitments in healthcare through the implementation of Medicare and Medicaid after their 1965 passage. In other words, the more the government helped, the more Americans needed the government to help.\nThis remains true after George W. Bush prescription drug plan and the succeeding administration’s Obamacare. The cause of medical inflation remains more complex — our median age rose by about a decade since the mid-1960s and our scales now read 25 pounds higher — than a simplistic, single-bullet, cause-and-effect. But the fact that individuals pay more in absolute terms for healthcare even as they pay far, far less percentagewise vis-à-vis institutions indicates the folly of shifting the burden to third-party payers.\nPrior to Medicare and Medicaid, individuals carried more than three-fifths of medical expenses. Now they shoulder less than three-tenths of the costs, with business and government combining for about two thirds. Despite carrying a smaller share of the overall burden, individuals bear higher costs in inflation-adjusted dollar amounts today than they did then. This set of facts leads some to call for greater government involvement and some for smaller role for government, which helps explain why a problem universally acknowledged spawns solutions that do not win approval by even a plurality of Americans.\nThe problem is not a new one. A 1991 article in Health Affairs pointed out that business, which expended about one percent of GDP in healthcare expenses in the mid-1960s, spent more than four percent of GDP in healthcare costs by the late 1980s. “Government spent 14.8 percent of its revenues on health in 1989, up from 5 percent in 1965,” the article explained. Now governments devote about a third of revenues to healthcare. This trendline disturbs, but the costs, because Americans pay them indirectly through lost salary and higher taxes, come as something akin to income-tax withholding. We do not miss the money that never made it into our pocket.\nThe authors of the Health Affairs piece noted the significance: “It is important to note, however, that in the long run, individuals bear all the burden for health care — through increased taxes, increased prices for goods and services, decreased net income and dividends, and smaller wage increases (to offset the accelerating cost of employer-sponsored health insurance premiums).”\nBack then, expending 11.6 percent of GDP toward healthcare appeared alarming to the authors. In 2018, that share strikes as idyllic.\nTimes change — not always for the better.\nHunt Lawrence is a New York-based investor. Daniel Flynn is the author of six books.","url":"https://spectator.org/healthcare-devours-same-gdp-portion-that-taxes-did-before-reagan-cut-them/"}
