{"authors":["Associated Press"],"date_download":"2018-10-22 23:54:26","date_modify":"2018-10-22 23:54:26","date_publish":"2017-03-16 08:14:20","description":"WASHINGTON (AP) - Short of votes for their health care bill, Republican congressional leaders turned to President Donald Trump on Thursday to wrangle support...","filename":"data/vaneerConsumption/HealthbillshortofvotesGOPleaderslooktoTrump.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/02/wire-231817-1489718366-84_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319212_House-GOP-health-bill-facing-fresh-House-committee-test_1540252466.html","title":"Health bill short of votes, GOP leaders look to Trump","title_page":"Health bill short of votes, GOP leaders look to Trump | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Short of votes for their health care bill, Republican congressional leaders turned to President Donald Trump on Thursday to wrangle support for the divisive legislation they hope to push through Congress before Easter.\nBut Trump sounded more like he was at the start of a negotiation than ready to close the deal. And combined with opposition from Republicans of all stripes, the president's flexible stance suggested final passage of the bill could be delayed, potentially exposing the legislation to the same kind of extended public backlash that undermined former President Barack Obama's Affordable Care Act from the start.\n\"It's very preliminary,\" the president said of the House GOP bill in a Fox News Channel interview Wednesday, when questioned about reports the legislation would help Democratic voters more than those who elected him. \"A lot of things aren't consistent. But these are going to be negotiated. ... We will take care of our people or I'm not signing it, OK, just so you understand.\"\nHouse Budget Committee Chair Diane Black, R-Tenn., right, joined at left by Rep. Todd Rokita, R-Ind., and panel staff member Jim Bates, center, works on the Republican health care bill, on Capitol Hill in Washington, Thursday, March, 16, 2017. (AP Photo/J. Scott Applewhite)\nThe House Budget Committee narrowly voted Thursday to advance the troubled Republican health bill, with defections by three GOP conservatives underscoring the obstacles party leaders face in maneuvering to avoid a stinging setback to their showpiece legislation after seven years of promises to repeal and replace \"Obamacare.\"\nIn another warning signal, four GOP governors wrote congressional leaders saying the beleaguered bill would not work for their states.\nGovs. John Kasich of Ohio, Rick Snyder of Michigan, Brian Sandoval of Nevada, and Asa Hutchinson of Arkansas said the legislation \"provides almost no new flexibility for states,\" fails to ensure enough resources to protect vulnerable residents and shifts significant new costs to states.\nA copy of the letter was provided to The Associated Press.\nMeanwhile, Sen. Susan Collins, R-Maine, told the Portland Press Herald, \"This is not a bill I could support in its current form.\" Collins joins Kentucky's Rand Paul and Utah's Mike Lee in opposing the legislation, while other Republicans, including Tom Cotton of Arkansas and Ted Cruz of Texas, have expressed deep misgivings. Collins' opposition leaves the bill short of the support it needs in the Senate unless it changes, since GOP leaders can only lose two votes.\nThe House GOP bill repeals elements of the Obama law, including the \"individual mandate\" that penalizes people who don't have insurance. It sets up a new system of tax credits that is less generous, particularly to older Americans. It eliminates some of Obamacare's requirements for services health plans need to cover, and it sunsets an expansion of Medicaid over several years, an element causing great consternation with moderate-leaning Republicans but one that conservatives want to move up faster.\nThe bill also cuts a slew of taxes, mostly to the benefit of the rich. Conservatives say it doesn't go far enough in repealing the Obama-era law in full, and an analysis by the nonpartisan Congressional Budget Office found 24 million people would lose their health insurance over a decade though the bill would also reduce the deficit.\nRepublicans in the Budget Committee pushed nonbinding proposals to phase out the Medicaid expansion more rapidly, help low-income people more with tax credits and require able-bodied Medicaid recipients to meet work requirements. The provisions seemed a window into votes that leaders think may be needed to win support from conservatives.\n\"Anyone not willing to work, let him not eat,\" asserted Rep. Jodey Arrington, R-Texas, in support of the Medicaid work requirement, saying he was citing scripture.\nHouse conservatives say they are negotiating some changes directly with the White House, cutting out House GOP leaders, while rebellious GOP senators were stoking the opposition.\nNevertheless, House Speaker Paul Ryan tried to strike an optimistic tone as he addressed reporters Thursday for his weekly press briefing.\n\"We feel like we're making great strides and great progress on getting a bill that can pass,\" Ryan said.\nBut Ryan did not commit to a timetable for passage, and his acknowledgment that the bill needs changes to pass was itself a change. Last week, Ryan was pledging action next week by the House Rules Committee - the precursor to a floor vote - and confidently predicting the bill would have the votes to pass.\nInstead, Ryan spent part of his news conference disputing suggestions that he and Trump are at odds over the health bill, rumblings that originate with Ryan's very reluctant support for Trump during the presidential campaign.\n\"There is no intrigue, palace intrigue, divisions between the principals ... there really is no schism whatsoever,\" Ryan insisted. \"I'm excited at the fact that we have a president who likes closing deals.\"\nBut some conservatives, having ousted the last House speaker, were beginning to grumble openly about Ryan's leadership. \"Maybe Paul Ryan needs to take a couple of lessons from Nancy Pelosi and learn what it means to have a majority. Having a majority does not mean playing defense,\" said Rep. Raul Labrador, R-Idaho, referring to the House Democratic leader who was speaker when Obamacare passed.\nBy many accounts Trump has been closely involved in negotiations on the health bill, including calling Budget Committee members ahead of Thursday's vote, but he is seen as focused on delivering his \"repeal and replace\" promise and flexible on the fine print.\nFailing to pass a bill while his party controls both the House and Senate would be a devastating blow to his party and the premise of his presidency - that he was a dealmaker the country needed.\n___\nAssociated Press writers Ken Thomas, Richard Lardner, Kevin Freking and Ricardo Alonso-Zaldivar contributed.\nRep. Dave Brat, R-Va., center, a member of the House Freedom Caucus leaves the House Budget Committee hearing on Capitol Hill in Washington, Thursday, March, 16, 2017, during the committee's health markup. (AP Photo/J. Scott Applewhite)\nRep. Sheila Jackson Lee, D-Texas, and the House Budget Committee works on the Republican health care bill, on Capitol Hill in Washington, Thursday, March, 16, 2017. (AP Photo/J. Scott Applewhite)\nRep. Sheila Jackson Lee, D-Texas, opposes the Republican health care bill during work by the House Budget Committee, on Capitol Hill in Washington, Thursday, March, 16, 2017. (AP Photo/J. Scott Applewhite)","url":"https://www.dailymail.co.uk/wires/ap/article-4319212/House-GOP-health-bill-facing-fresh-House-committee-test.html"}
