{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:31:30","date_modify":"2018-10-30 22:31:30","date_publish":"2014-08-15 13:34:26","description":"You may already be aware of a bunch of the health benefits of drinking coffee; just in case you’re not, though, here’s all of ‘em in one handy video, courtesy of BuzzFeed. Coffee enthusiasts, rejoice — here’s your reason to pour yourself another cup…","filename":"data/vaneerConsumption/HealthBenefitsofDrinkingCoffeeAllTheReasonsYourFavoriteBeverageIsGoodForYou.json","image_url":"https://imgix.bustle.com/uploads/image/2018/2/27/6166b19f-dff0-40db-92ad-27107e65624c-fotolia_69832554_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35902-health-benefits-of-drinking-coffee-all-the-reasons-your-favorite-beverage-is-good-for-you_1540938690.html","title":"Health Benefits of Drinking Coffee: All The Reasons Your Favorite Beverage Is Good For You","title_page":"Health Benefits of Drinking Coffee: All The Reasons Your Favorite Beverage Is Good For You","title_rss":"NULL","source_domain":"bustle.com","text":"You may already be aware of a bunch of the health benefits of drinking coffee; just in case you’re not, though, here’s all of ‘em in one handy video, courtesy of BuzzFeed. Coffee enthusiasts, rejoice — here’s your reason to pour yourself another cup of joe!\nOK, so to be fair, the video doesn’t feature every single thing we know about why coffee is good for you; it does, however, contain an awful lot of them. For example, did you know that people who drink two to three cups a day live longer, have less of a chance of developing type 2 diabetes, and experience fewer symptoms of Parkinson’s disease? Or that it’s most Americans’ primary source of antioxidants by a huge margin? Other facts I would add include how terrific it is for circulation, memory enhancement, and pain reduction. Seriously, you guys. Why bother with Tylenol when you could drink a cup of the good stuff instead?\nOf course, not all types of coffee or methods of consumption are created equal; as the video suggest, for example, I would avoid coffee enemas, which doctors have said can kill you (and why would you waste perfectly good coffee by sticking it up your arse?). Also, stay away from bad coffee. Life is too short to drink awful java.\nWatch the whole thing here:\nBuzzFeedBlue on YouTube\nOh, and guess what? We’ve also got a boatload of reasons for why you should eat more chocolate. So you know what? Treat yourself today. A little nibble of dark chocolate with a cup of your favorite coffee to go along with it is just what the doctor ordered. Literally.\nBuzzFeedBlue on YouTube\nImage: arthurhidden/Fotolia","url":"https://www.bustle.com/articles/35902-health-benefits-of-drinking-coffee-all-the-reasons-your-favorite-beverage-is-good-for-you"}
