{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:15:42","date_modify":"2018-10-30 20:15:42","date_publish":"2015-04-15 19:34:18","description":"“Cosmo is anti-God, anti-Christian, anti-marriage, and promotes a deviant lifestyle centered on sex,” she says. “It promotes promiscuity - with its risks of getting STDs, being raped or murdered, and its promise of emotional and psychological damage, including suicide,\" the granddaughter of the founder of the Hearst Corporation says. |","filename":"data/vaneerConsumption/HearstGranddaughterLaunchesCosmoHarmsMinorsCampaignAgainstCorporationsBestSellingYoungWomensMagazine.json","image_url":"https://media.breitbart.com/media/2014/11/Cosmopolitan-Magazine-US-July-2014-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_15__1540930542.html","title":"Hearst Granddaughter Launches ‘Cosmo Harms Minors’ Campaign Against Corporation’s Best-Selling Young Women’s Magazine","title_page":"Hearst Granddaughter Launches ‘Cosmo Harms Minors’ Campaign Against Corporation’s Best-Selling Young Women’s Magazine | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The granddaughter of William Randolph Hearst, of the multi-national media empire Hearst Corporation, and the National Center on Sexual Exploitation (NCOSE) are launching a campaign that demands Cosmopolitan Magazine be displayed behind blinders or in an opaque wrapper and not sold to minors.\nVictoria Hearst, who is also the founder and president of Praise Him Ministries in Montrose, Colorado, and Dawn Hawkins, executive director of NCOSE, will be joined by child, adolescent and adult psychiatrist and author Dr. Miriam Grossman on Wednesday, April 22 at the National Press Club in Washington, D.C. to launch their new campaign titled “Cosmo Harms Minors.”\n“Cosmopolitan Magazine is a porn magazine, glamorizing things like public, anal, group, or violent sex in nearly all of their issues,” says a statement on NCOSE’s website. “We are asking that Cosmo be sold to adults only and have the cover wrapped like all other porn magazines in retail shops.”\n“In recent years, Cosmopolitan Magazine has blatantly started to target young girls to expand their audience and increase profits,” the press release adds. “This staple of the supermarket checkout line has steadily declined from a somewhat inspirational women’s magazine to a verbally, and many times visually, pornographic ‘how-to’ sex guide encouraging readers to engage in violent and dangerous sexual acts in every issue.”\n“Cosmo is leading the way in further desensitizing young women and girls to accept and participate in the pornified and sexually violent culture around them,” the coalition adds. “The ‘Cosmo Harms Minors’ campaign seeks to inform, expose and equip communities to take action and protect minors.”\nIn a telephone interview with Breitbart News, Victoria Hearst said she has tried for years to talk to family members on the board of directors of the Hearst Corporation about the fact that Cosmo is harmful to young people, but to no avail.\n“Minors shouldn’t be able to buy Cosmo, it’s adult content and minors shouldn’t be exposed to it,” Hearst said. “Apparently, my family members in authority in the Hearst Corporation don’t care about corrupting and harming children. They only care about money.”\nOn its website, the Hearst Corporation states, “Cosmopolitan is the best-selling young women’s magazine in the U.S., a bible for fun, fearless females that reaches more than 18 million readers a month.”\nBut Victoria Hearst pushes back. “Cosmo is anti-God, anti-Christian, anti-marriage, and promotes a deviant lifestyle centered on sex,” she says. “It promotes promiscuity – with its risks of getting STDs, being raped or murdered, and its promise of emotional and psychological damage, including suicide.”\nHearst states her campaign has no intention of limiting the First Amendment rights of the Hearst Corporation, but warns most states have “harm to minors” laws that should prevent the display of such blatant sexual content at the checkouts of stores where children can readily be exposed to it.\n“If they want to put sexually explicit materials and words on the covers of Cosmo, and if they want to fill their magazine with photos of sexual positions and articles about how to enjoy anal sex, knock themselves out,” Hearst said, “but have it where other adult material like Playboy and Penthouse is sold – not where children and adolescents can be exposed to it.”\n“Every single Hearst family member gets the corporation’s magazines, so they all can see what I’m talking about,” she added. “What is their excuse for not protecting kids from this exposure to harmful material?”\nJoanna Coles, editor-in-chief of Cosmopolitan Magazine, and the media office of the Hearst Corporation did not immediately return calls and emails from Breitbart News requesting comment.","url":"https://www.breitbart.com/politics/2015/04/15/hearst-granddaughter-launches-cosmo-harms-minors-campaign-against-corporations-best-selling-young-womens-magazine/"}
