{"authors":[],"date_download":"2018-10-30 20:27:21","date_modify":"2018-10-30 20:27:21","date_publish":"2015-10-19 17:08:25","description":"The drum major at west Georgia’s Heard County High School died Sunday night, nearly a week after suffering a serious brain injury in a wreck.","filename":"data/vaneerConsumption/HeardCountydrummajordiesfromwreckinjuries.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional_heard-_fb5661c9b2dc9f62230bdc883cd91a78__1540931241.html","title":"Heard County drum major dies from wreck injuries","title_page":"Heard County drum major dies from wreck injuries","title_rss":"NULL","source_domain":"ajc.com","text":"The drum major at west Georgia’s Heard County High School died Sunday night, nearly a week after suffering a serious brain injury in a wreck.\nThe family of Lillian Evelyn Scott posted on social media that the 17-year-old girl died about 8:30 p.m. at Columbus Regional Hospital. Georgia State Patrol Trooper B. Harman said Scott was taken off life support.\nKnown to family and friends as Lilly, the teen was seriously injured last Monday morning when she turned in front of another vehicle on U.S. 27 at Pea Ridge Road, about a mile south of the high school in Franklin, the Heard Citizen newspaper reported.\nFranklin is about 60 miles southwest of Atlanta.\nAs drum major of the school’s marching band, Scott led the Heard County Marching Braves onto the field for performances. The band dedicated Saturday’s show at the Golden River Marching Festival in Tallapoosa to Scott.\nThe teen was the second Georgia high school student in as many days to die from injuries sustained in a wreck.\nEarly Saturday, Seth Daniel Stapleton, a 17-year-old football player at Morgan County High School, was killed when the pickup truck he was driving ran off a Morgan County road.","url":"https://www.ajc.com/news/state--regional/heard-county-drum-major-dies-from-wreck-injuries/BAAYLIhx5KSIrE5wjwvDAK/"}
