{"authors":[],"date_download":"2018-10-22 20:50:31","date_modify":"2018-10-22 20:50:31","date_publish":"2016-01-29 04:05:45","description":"A 650-year-old urban walled village in Hong Kong -- the last of its kind -- will be destroyed to make way for development in what critics say is another nail...","filename":"data/vaneerConsumption/HeartbreakashistoricHongKongvillagedemolished.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6v3-2vdWmEltwXfba0ce28e632fef837-823_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422146_Heartbreak-historic-Hong-Kong-village-demolished_1540241431.html","title":"Heartbreak as historic Hong Kong village demolished","title_page":"Heartbreak as historic Hong Kong village demolished | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Heartbreak as historic Hong Kong village demolished\nA 650-year-old urban walled village in Hong Kong -- the last of its kind -- will be destroyed to make way for development in what critics say is another nail in the coffin for the city's cultural heritage.\nOn a chilly morning, around 20 remaining residents of Nga Tsin Wai, an ancient settlement in the heart of bustling Kowloon, despondently packed their belongings before the wrecking ball arrives in the coming days.\nThere were once dozens of such villages scattered across what became the urban centre of the city -- they were built by Chinese clans centuries ago, complete with moats and watchtowers to guard against intruders.\nWhile many walled villages still remain intact on Hong Kong's rural outskirts, Nga Tsin Wai is the only one left in the heart of the city ©Philippe Lopez (AFP)\nWhile many walled villages still remain intact on the city's rural outskirts, Nga Tsin Wai is the only one left in the heart of Hong Kong.\nThe village was built in 1354 and the original walls and battlements have disappeared, leaving a collection of around 50 ramshackle houses, shops and a temple, hemmed in by concrete tower blocks that have grown up around it.\nAuthorities argue the village is in poor condition and should make way for better quality housing units in an overcrowded city -- 750 new flats will be built on the site.\nHeartbroken residents say it is the only place they call home.\n\"The village has a long history and we have been here for a long time. But we have been given no choice but to leave,\" one resident, Kwok Yue-ka, told AFP.\nKwok, a 52-year-old barber, held out until the eviction deadline, unhappy with the government's compensation package. Authorities warned he must leave or risk jail.\nKwok said he received HK$200,000 ($25,665) in compensation and would be moved to temporary housing.\n\"I have treated this as my only home. I have lived here for 20 years. Now the future is uncertain. I feel frustrated,\" he said.\n- History swept away -\nThe destruction of historic buildings, old communities and street markets across Hong Kong has drawn widespread criticism in recent years.\nThe last decade has seen the demolition of the landmark Queen's Pier, built during the British colonial era, swept away for a bypass and harbourfront development.\nAn entire street in the Wan Chai neighbourhood -- known as \"wedding card street\" for the abundance of shops selling traditional Chinese wedding invites -- was demolished to make way for residential development and luxury stores.\nThe government is under pressure to find space for 400,000 new housing units in the next 10 years to remedy the shortage of affordable homes as property prices have skyrocketed.\nBut while there is a pressing need for more accommodation, district councillor Paul Zimmerman, an advocate of sustainable urban planning, said Hongkongers were beginning to question the sacrifices made.\n\"How do you balance the (economic) gains and the impact on individuals? How do you maintain these areas without destroying the local culture?\" asks Zimmerman.\n\"We have to take a more careful approach.\"\n- 'Losing tradition' -\nThe Urban Renewal Authority, overseeing the redevelopment of Nga Tsin Wai walled village, described it as \"decrepit\" and said only a small number of villagers would be affected.\n\"The living conditions are poor due to the lack of proper maintenance and sanitation facilities,\" a spokeswoman told AFP.\nShe said current residents did not have the legal right to live there because the land is owned by the government, adding that some elements would be preserved, including the village temple.\nBut campaigners say it is not just about bricks and mortar as the social fabric and way of life of the village disappears.\n\"Culture is cultivated by people who live there. Without the people the area is dead even if the buildings are splendid,\" Ho Chi-fung of Grassroots Housing Rights Alliance, a concern group for the housing needs of underprivileged Hong Kong residents, told AFP.\nResidents have gradually moved away from the village over the past 20 years and empty houses have been knocked down, but a small community remained, including a Chinese medicine pharmacy, barber shops and handcraft sellers.\n\"We are losing a tradition... It will only become a money-making project,\" said a knife-maker, surnamed Fan, who recently moved out, ahead of the demolition.\nAnother resident in her 40s, surnamed Han, who works as an office clerk, said her family memories would disappear with the final demolition.\nHer father ran a home accessories shop in the village in the 1980s, and the family of 10 lived above it.\n\"A lot will be missed,\" she said.\n\"The house may be small, but I grew up here.\"\nNga Tsin Wai village, an ancient settlement in the heart of bustling Kowloon, will be demolished as part of a city re-urbanisation plan in Hong Kong ©Philippe Lopez (AFP)\nVillager Kwok Yue-ka holds an official notice from the Hong Kong Lands Department asking him to leave his home at Nga Tsin Wai village, which is to be demolished as part of a city re-urbanisation plan ©Philippe Lopez (AFP)\nNga Tsin Wai village was built in 1354 and the original walls and battlements have disappeared, leaving a collection of around 50 ramshackle houses, shops and a temple ©Philippe Lopez (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3422146/Heartbreak-historic-Hong-Kong-village-demolished.html"}
