{"authors":[],"date_download":"2018-10-22 21:35:50","date_modify":"2018-10-22 21:35:50","date_publish":"2014-06-05 20:15:41","description":"Security researchers have uncovered new bugs in the Web encryption software that caused the pernicious Heartbleed Internet threat.","filename":"data/vaneerConsumption/HeartbleedRevisitedMoreBugsFoundinWebEncryptionSoftware.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490681/140605-tech-cybersecurity-heartbleed_a56003ac15439e1d4d083a91ec89338b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_heartbleed-revisited-more-bugs-found-web-encryption-software-n123901_1540244150.html","title":"'Heartbleed' Revisited? More Bugs Found in Web Encryption Software","title_page":"'Heartbleed' Revisited? More Bugs Found in Web Encryption Software","title_rss":"NULL","source_domain":"nbcnews.com","text":"Experts said that websites and technology firms that use OpenSSL technology should install the update on their systems as quickly as possible. Still, they said that could take several days or weeks because companies need to first test systems to make sure they are compatible with the update.\n\"They are going to have to patch. This will take some time,\" said Lee Weiner, senior vice president with cybersecurity software maker Rapid7.\nOpenSSL technology is used on about two-thirds of all websites, including ones run by Amazon, Facebook, Google and Yahoo. It is also incorporated into thousands of technology products from companies, including Cisco Systems, Hewlett-Packard, IBM, Intel and Oracle.\nThe widespread Heartbleed bug surfaced in April when it was disclosed that the flaw potentially exposed users of those websites and technologies to attack by hackers who could steal large quantities of data without leaving a trace. That prompted fear that attackers may have compromised large numbers of networks without their knowledge.\nSecurity experts said on Thursday that the newly discovered bugs are more difficult to exploit than Heartbleed, making those vulnerabilities less of a threat.\nStill, until users of the technology update their systems, \"there is a window of opportunity\" for sophisticated hackers to launch attacks and exploit the newly uncovered vulnerabilities, said Tal Klein, vice president of strategy with cloud security firm Adallom.\n— Reuters","url":"https://www.nbcnews.com/tech/security/heartbleed-revisited-more-bugs-found-web-encryption-software-n123901"}
