{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 02:56:56","date_modify":"2018-10-21 02:56:56","date_publish":"2018-07-11 10:00:41","description":"Reuters photographer Erik De Castro documents the devastation of fires in Manila's slums.","filename":"data/vaneerConsumption/HeartbreakingimagesoftheaftermathofdevastatingfiresinManilasovercrowdedslums.json","image_url":"https://www.washingtonpost.com/resizer/5BZDOZc3OhmYp0hoxDM-iGqwq7c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SEPALUPQTMZMJC27B6QIPHSW4A.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_11__1540090616.html","title":"Heartbreaking images of the aftermath of devastating fires in Manila’s overcrowded slums","title_page":"Heartbreaking images of the aftermath of devastating fires in Manila’s overcrowded slums - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\nA resident throws water on his house as a fire spreads. (Erik De Castro/Reuters)\nA man cries after his house was gutted by a fire. (Erik De Castro/Reuters)\nManila, the Philippines’ capital, is the most densely populated city in the world. Over the years, its population has swelled as people have arrived from the countryside seeking a better life, but most end up not being able to find much work and remain in poverty. Because of this, many end up in the city’s overcrowded and blighted slums, where dangers such as exposed wiring are commonplace. The slums are prone to fires that can be calamitous.\nAccording to Reuters, there have been 2,200 fires in Manila this year, and most have ignited in the city’s slums. With no real building or fire codes to speak of, the slums are tinderboxes waiting for disaster to strike. Many homes are built of plywood and exposed electrical wires are everywhere. According to Reuters, the fires are mainly caused by faulty electrical connections, unattended stoves and discarded cigarette butts.\nThe city’s firefighters face all kinds of obstacles to getting the fires out. Firetrucks have to be piloted through narrow streets choked with cars and food carts. And because of the makeshift manner in which the slums are built, the fires can spread quickly, wreaking havoc on people’s homes and often leaving them with very little once the fires have been extinguished. People gather whatever is left and rebuild, but the dwellings they remake are just as flammable as before.\nReuters photographer Erik De Castro recently spent some time in the slums, documenting how people, including firefighters, deal with disaster when it hits. Here’s what he saw.\nSmoke lingers over destroyed houses during a fire. (Erik De Castro/Reuters)\nFirefighters carry a victim to an ambulance. (Erik De Castro/Reuters)\nElectric wires are seen as a boy plays on the rooftop of Vitas Tenement, a government-housing building. (Erik De Castro/Reuters)\nPeople attend a wake for their six relatives whose remains were placed inside two caskets. The relatives died in a fire at a dilapidated building. (Erik De Castro/Reuters)\nHouses burn during a fire. (Erik De Castro/Reuters)\nFirefighters wait for water during a fire at a shopping center at the University of the Philippines campus. (Erik De Castro/Reuters)\nA framed image of Jesus and the Virgin Mary are seen on a wall inside a house gutted by a fire. (Erik De Castro/Reuters)\nWorkers carry office equipment from a burning shopping center at the University of the Philippines. (Erik De Castro/Reuters)\nA man carries a statue of an infant Jesus during a fire. (Erik De Castro/Reuters)\nA man pours water on his body during a fire. (Erik De Castro/Reuters)\nVitas Tenement, a government-housing building, is in front of a new residential condominium building. (Erik De Castro/Reuters)\nA woman walks in an alley next to her house, which was destroyed by a fire. (Erik De Castro/Reuters)\nA firefighter gives a hand signal as a shopping center burns at the University of the Philippines. (Erik De Castro/Reuters)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\n‘I photograph life, not death, because death cannot be seen’\nLooking at the war in Syria through a Syrian photographer’s eyes\nInside the U.S.’s ‘National Radio Quiet Zone,’ where there’s no WiFi or cellphone service","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/11/heartbreaking-images-of-the-aftermath-of-devastating-fires-in-manilas-overcrowded-slums/"}
