{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 01:34:46","date_modify":"2018-10-23 01:34:46","date_publish":"2016-01-11 12:39:37","description":"Fiona Winchester was reading today's 8.30am headlines for Heart FM Radio when she wrongly said that the Prime Minister had passed away.","filename":"data/vaneerConsumption/HeartFMnewsreaderannouncesDavidCameronhasdiedinsteadofDavidBowie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3000269E00000578-0-image-a-47_1452515876626.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393806_Moment-Heart-FM-newsreader-accidentally-announces-David-Cameron-died-instead-David-Bowie_1540258486.html","title":"Heart FM newsreader announces David Cameron has died instead of David Bowie","title_page":"Heart FM newsreader announces David Cameron has died instead of David Bowie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a newsreader accidentally announced David Cameron's death live on air - instead of David Bowie.\nFiona Winchester was reading today's 8.30am headlines for Heart FM Radio when she wrongly said that the Prime Minister had passed away.\nShe started the broadcast by saying: 'David Cameron has died,' before quickly realising her mistake. Bowie's death, which came after a secret 18-month battle with cancer, was announced this morning.\nA news reader accidentally announced today that David Cameron (left) had died instead of David Bowie (right)\nThe Prime Minister had already paid tribute to the singer, writing: 'I grew up listening to and watching the pop genius David Bowie. He was a master of re-invention, who kept getting it right. A huge loss'\nDespite Miss Winchester's swift correction, several listeners commented on the mistake.\nOne Twitter user wrote: 'Very smooth from the radio news lady \"David Cameron died, David Bowie, I mean David Bowie\"'.\nAnother added: 'Lassie on Heart FM just read out the news and said 'David Cameron has died' instead of Bowie.'\nOne wrote: 'Heart radio just said david cameron died instead of Bowie - awkward (sic).'\nFiona Winchester was reading today's 8.30am headlines for Heart FM Radio when she wrongly said that the Prime Minister had passed away. She had earlier tweeted about the singer's death (shown above)\nThe Prime Minister had already paid tribute to the singer, writing: 'I grew up listening to and watching the pop genius David Bowie. He was a master of re-invention, who kept getting it right. A huge loss.'\nAnnouncing Bowie's death today, a spokesman said: ‘David Bowie died peacefully today surrounded by his family after a courageous 18 month battle with cancer.\n'While many of you will share in this loss, we ask that you respect the family’s privacy during their time of grief.’","url":"https://www.dailymail.co.uk/news/article-3393806/Moment-Heart-FM-newsreader-accidentally-announces-David-Cameron-died-instead-David-Bowie.html"}
