{"authors":[],"date_download":"2018-10-22 21:07:59","date_modify":"2018-10-22 21:07:59","date_publish":"2014-06-04 01:03:58","description":"A new smartphone app that aims to turn bystanders into heart attack heroes saved the life of a 57-year-old truck driver from Portland, Oregon.","filename":"data/vaneerConsumption/HeartAttackRescueTheresanAppforThat.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/485501/140603-heart-attack-app-cover_81ea86ecbfbf0d3dc63ddba9845dd0e4.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_heart-attack-rescue-theres-app-n121911_1540242479.html","title":"Heart Attack Rescue? There's an App for That","title_page":"Heart Attack Rescue? There's an App for That","title_rss":"NULL","source_domain":"nbcnews.com","text":"Created on a shoestring budget by Richard Price, a former San Ramon, California, fire chief who didn’t want to miss an emergency call, PulsePoint has gained slow traction since 2009, rolling out to 911 dispatch centers that now cover some 600 U.S. cities.\n“We’ve found that people are very willing to put their hand up and say, ‘I’ll help,’” said Price. More than 140,000 people have signed up for PulsePoint so far and more than 7,300 have responded to nearly 2,300 alerts.\nEvery year in the U.S. there are about 360,000 out-of-hospital cardiac arrests, or about 1,000 a day. Experts who research the problem say PulsePoint may be one way to boost the ranks of those who can perform bystander CPR, which doubles or triples the chances of surviving.\n“It’s a great use of technology to enlist the aid of people who are willing and able to help save lives from cardiac arrest,” said Dr. Michael Sayre, an emergency medicine doctor with the University of Washington in Seattle and an leader in resuscitation medicine.\nIn Basse’s case, he was saved by Brawner, who happened to be working out at the same gym. Brawner’s fire district signed up for PulsePoint about a year ago.\nBut even he wasn’t expecting the alert that showed up on his phone as he walked on the treadmill, telling him that someone needed CPR, or cardiopulmonary resuscitation, right away. He saw a map, an icon of where he was, an icon showing the closet AED or automated external defibrillator — and an icon showing a victim. He quickly ran down two flights of stairs.\n“I saw a security guard standing in the parking structure and it just didn’t look right to me,” Brawner said. “That’s where Drew Basse was. He was literally sitting in his car, unconscious, not breathing, no pulse.”\nIn fact, Brawner thought he looked like a “fresh code,” firefighter slang for someone who is already dead.","url":"https://www.nbcnews.com/health/health-news/heart-attack-rescue-theres-app-n121911"}
