{"authors":["Lyndsey Mckenna"],"date_download":"2018-10-23 01:56:16","date_modify":"2018-10-23 01:56:16","date_publish":"2018-06-19 00:00:00","description":"Banks requested the song after The Mountain Goats released Beat The Champ, a wrestling-themed album, in 2015. Now, songwriter John Darnielle has delivered.","filename":"data/vaneerConsumption/HearTheMountainGoatsOdeToWWEsLegitBossSashaBanks.json","image_url":"https://media.npr.org/assets/img/2018/06/19/gettyimages-643865842_wide-9bd67767471781163f5ad8538f7c5dc5893ba2ca.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2018_06_19_621316746_hear-the-mountain-goats-ode-to-wwes-legit-boss-sasha-banks_1540259776.html","title":"Hear The Mountain Goats' Ode To WWE's 'Legit Boss,' Sasha Banks","title_page":"Hear The Mountain Goats' Ode To WWE's 'Legit Boss,' Sasha Banks : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Hear The Mountain Goats' Ode To WWE's 'Legit Boss,' Sasha Banks\nEnlarge this image toggle caption Lukas Schulze/Bongarts/Getty Images Lukas Schulze/Bongarts/Getty Images\nIf you've written off women's wrestling, you're missing out. Once cringeworthy and blatantly misogynistic, the oft-maligned melodramatic art form is having a moment in pop culture, from Netflix's GLOW to Palehound's squared circle-set video for \"Flowing Over.\" Even on sports entertainment's highest stage, World Wrestling Entertainment is actively course-correcting, with women taking top billing on its flagship program, Monday Night Raw, and at pay-per-view events.\nOne of music's most prominent wrestling aficionados, The Mountain Goats' John Darnielle, has already covered the ins and outs of wrestling, from heel turns and the territorial circuit, on his 2015 record Beat the Champ, an album's-length ode to sports entertainment of yesteryear. Upon that album's release, WWE superstar Sasha Banks — then a performer in the company's developmental organization, NXT — tweeted, \"Where's my song @mountain_goats?\" Darnielle responded, vowing to write \"Song for Sasha Banks\" before the end of the band's 2015 Regional Heat tour. He finally delivered on his promise — albeit belatedly — yesterday.\nOn \"Song for Sasha Banks,\" Darnielle treats Banks' backstory with the dignity and reverence befitting her pioneering performances: Banks competed in the WWE's first women's Iron Man and Hell in a Cell matches, and has held both the NXT women's championship and the WWE Raw women's championship. Her matches against Bayley at NXT TakeOver: Brooklyn and NXT TakeOver: Respect demonstrate enough narrative and athletic prowess to turn any viewer, this author included, into a devotee.\n\"We here in the @mountain_goats acknowledge @SashaBanksWWE as the Boss,\" Darnielle said on Twitter, a nod to Banks' confident, cocky \"legit boss\" gimmick. The lyrics pay homage to Banks' journey: from her itinerant childhood spent moving between California, Minnesota and Massachusetts, to her early career in independent wrestling, to her success on the main roster.\nThis isn't the first notable musical moment in Banks' wrestling career. Back in 2016, ahead of a triple-threat match at WrestleMania 32, Banks entered the ring as her cousin Snoop Dogg performed her entrance song, \"Sky's the Limit.\"","url":"https://www.npr.org/sections/allsongs/2018/06/19/621316746/hear-the-mountain-goats-ode-to-wwes-legit-boss-sasha-banks"}
