{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 00:10:12","date_modify":"2018-10-23 00:10:12","date_publish":"2017-04-26 09:27:09","description":"Travellers paid up to £150 a week for parking workers to leave their motors in a secure space while they jetted off from Heathrow Airport over the Easter weekend - but returned to find them covered in fines.","filename":"data/vaneerConsumption/HeathrowAirporttravellersarehitwith120offines.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D9CFE00000578-0-image-a-61_1493196222867.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446680_Heathrow-Airport-travellers-hit-120-fines_1540253412.html","title":"Heathrow Airport travellers are hit with £120 of fines","title_page":"Heathrow Airport travellers are hit with £120 of fines | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of holidaymakers have been hit with £33,000 of fines after paying for secure Heathrow parking with a firm who dumped their cars in council pay and display spaces instead.\nThe victims all paid meet-and-greet companies up to £150 to look after their vehicles while they went away over Easter weekend.\nBut instead many were put in two public pay and display car parks 15 minutes from Heathrow Airport where wardens issued up to five £60 tickets per car, rising to £120 if not paid within a month.\nUnsuspecting victims claim they were met at their Heathrow terminal by meet and greet firms who had removed the tickets from the windscreens and failed to tell them about their tickets.\nConnect Parking, one of the companies involved, claims that the tickets were all issued when their valet drivers left them there while popping out for lunch.\nHundreds of holidaymakers were hit with £33,000 worth of parking fines after valeting firms moved their cars to council pay-and-display spaces near Heathrow Airport. Pictured, cars slapped with parking fines\nTravellers paid up to £150 a week for parking workers to leave their motors in a secure space while they jetted off from Heathrow Airport over the Easter weekend\nDavid and Julia O'Neill, from Lichfield, found their car had been hit with a parking ticket after they returned from a two-week Vietnam holiday.\nMrs O'Neill said they were 'horrified to find out our car had been parked here' having been told it would be left in 'a secure car park'.\n'I wouldn't leave my car here in the daytime, let alone the night. I can't believe it was left here in this unsecured car park for up to two weeks.\n'It says in the paperwork it was to be kept in a secure compound. I could have parked here myself and left here and caught the bus.\n'We'll just wait and see now if the council get in touch about our parking ticket,' she said.\nLocal resident Sarah Harvey photographed the fine-covered cars, noticed many contained tickets with the owners' name and flight details and then took to Facebook to warn 'people are being ripped off'.\nShe told MailOnline: 'I was shocked and disgusted that people were being ripped off by the parking firm.\n'I feel sorry for the people that had been issued tickets without their knowledge and want people to be aware of the scam that was obviously happening.'\nMs Harvey said when she went to the car park, she saw a council member there and two traffic wardens who had 'plastered tickets all over the cars'.\nWhen she asked the council worker what had happened, she claims he said that the cars belonged to people attending an Indian wedding.\nHorrified drivers returned to find that they had been hit with £60 of fines - a penalty which rises to £120 if not paid within a month. In total, 275 cars were left council car parks and issued with parking tickets\nA shocked resident shared photos of rows of cars with fines attached to the windscreens at one of the public car parks. She said people were being 'ripped off by airport parking'\nMs Harvey replied that 'No one would leave there cars in this car park for too long as it's not safe'.\nAnother nearby shopkeeper told the BBC: 'The private car parks are overflowing so what they have done is park their cars over here and gone. The wardens have been giving tickets every single day'.\nHillingdon Council's trading standards team are now investigating the parking firms accused of ripping off their customers.\nBut they have said all the ticketed drivers who want their fines quashed must appeal the tickets via the normal process or pay up.\nThe vehicles were ticketed in Fairfield Road car park in Yiewsley, and Brandville Road car park in West Drayton - 15 minutes from Heathrow Airport.\nCompanies offering meet and greet services are meant to meet customers at the airport and take their cars to a secure parking facility, returning it when the owner gets back.\nDavid and Julia O'Neill (pictured), from Lichfield, spent more than £100 for their car to be left in a secure space\nThey were 'horrified' to find their motor in a council car park and hit with a £60 fine when they returned from a two-week trip to Vietnam\nSome of the cars at Yiewsley car park had tickets inside that read 'Terminal 2'\nSarah Harvey visited the Yiewsley car park and shared photos of Mercedes, BMWs and 4x4s with as many as five £60 fixed penalty notices attached to windscreens.\n'I looked inside a few cars and saw some tickets on the seat that clearly say Terminal 2,' she wrote. 'It looks like people are being ripped off by the airport parking.'\nThe penalties were given out over four days at the two car parks run by Hillingdon council.\nOne woman said she was 'horrified' to find her motor was left in a council car park after she spent more than £100 for it to be left in a secure space.\nMany cars also had Heathrow 'short stay' parking vouchers inside them - which is where meet and greet companies pick up their customers' cars.\nOne company, Connect Parking, in Colnbrook, Berkshire, admitted they had some put some vehicles in the car parks in Yiewsley and West Drayton, The Sun reported.\nHillingdon Council and Heathrow Airport have begun an investigation into the fines\nThe vehicles were left at a council car park on Brandville in West Drayton - 15 minutes from Heathrow Airport\nThe rest of the cars were moved to Fairfield Road car park in Yiewsley - where they were hit with fines\nManager Tahir Zaman said: 'Only five of the cars belonged to us. What happened was the drivers left the cars, went for lunch and then got the tickets. The company contacted the council to pay the tickets.'\nHillingdon Council and Heathrow Airport have begun an investigation.\nA council spokesman said: 'We are aware of reports that some vehicles were parked in the car parks by a Heathrow parking company and not the vehicle owners.\n'This is a matter we're taking very seriously. Our trading standards team has launched an investigation and will be contacting the people who have received the parking tickets.\n'Everyone who receives a parking ticket has the right to appeal and we will be dealing with each ticket on a case-by-case basis.'\nA Heathrow spokesperson said the airport was working with 'police and the local community to investigate this matter further'.","url":"https://www.dailymail.co.uk/news/article-4446680/Heathrow-Airport-travellers-hit-120-fines.html"}
