{"authors":["Brenton Garen At Dailymail.Com"],"date_download":"2018-10-22 20:24:51","date_modify":"2018-10-22 20:24:51","date_publish":"2016-01-28 01:11:35","description":"The 46-year-old discussed the very public row on the red carpet at the Fifty Shades Of Black premiere in Los Angeles on Tuesday.","filename":"data/vaneerConsumption/HeatherMcDonaldjokesaboutherfeudwithChelseaHandler.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/22/30A4B6B700000578-0-image-a-88_1453932679435.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420002_Heather-McDonald-jokes-feud-Chelsea-Handler-admits-nervous-upset_1540239891.html","title":"Heather McDonald jokes about her feud with Chelsea Handler","title_page":"Heather McDonald jokes about her feud with Chelsea Handler | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Heather McDonald is seeing the funny side of her public feud with Chelsea Handler.\nThe comedienne joked on Tuesday that she had 'lost five pounds', adding to ET: 'That was the good news - that's why I can fit in this dress right now.'\nHowever the 46-year-old also said on the red carpet of Fifty Shades Of Black in Los Angeles that she has been 'nervous and upset', and that the feud has been 'very surreal'.\nScroll down for video\nBlack carpet: Comedienne Heather McDonald joked at the Fifty Shades of Black premiere in Los Angeles on Tuesday that she’d loss five pounds since her feud with Chelsea Handler began 10 days earlier\nShe described the amount of attention her recent 'lived in fear' comments had received as 'shocking,' referring to a podcast interview where she talked about working for Handler on the now defunct E! Network show Chelsea Lately.\n‘It was one sentence taken out of an hour interview,’ McDonald said, who worked on the show from 2007 to 2014.\nOn the podcast, she had said: ‘I lived in fear, 100 percent lived in fear, I enjoyed my time there, I was happy, but something could happen and my heart would be beating and I'd be like 'is this it?''\nShe continued: 'Somehow I managed to keep surviving'.\nFormer colleagues: McDonald and Handler have been at odds with each other since a promo for podcast went public on January; they're seen here in February 2013\nMcDonald also revealed that she had no idea that Chelsea Lately was coming to an end.\nAfter those remarks, Handler went on Howard Stern's Sirius XM radio show and claimed McDonald had been ‘trading stories' about her personal life in exchange for having her photos run in the magazine, according to ET.\n‘That just never happened,’ Heather said of the claims.\nBold claims: Handler went on Howard Stern's Sirius XM radio show and claimed McDonald had been ‘trading stories to Us Weekly’; she's seen here on January 23\n‘It was a devastating accusation to try to defend after [she was] on Howard Stern,’ McDonald said. ‘I didn't really have the platform, and I didn't want people to think I was pursuing publicity.\n'So, I just had to say, \"Hey, I didn't do it. This is not true.\"'\nMcDonald said she recorded the hour-long podcast on December 10. The episode was released January 19.\n'That just never happened': McDonald said Handler accusation's about her on Howard Stern's radio show was devastating; they're seen here in August 2011\nShe also admitted that she never expected to be the subject of a celebrity feud, and alluded to bad karma being in play.\nAs a writer on Chelsea Lately, she said they'd often do topics that were just one sentence out of a four-page article\n‘We did it too as long as you say ‘if this is true’ or ‘allegedly this happened,'' she said.\nHandler claimed McDonald leaked stories about her personal life;she's seen here on January 22\nWhen ET asked if she had reached out to Chelsea, she said: ‘No. I think it will be OK.’\nWith Amy Schumer being accused of stealing jokes in recent weeks, McDonald continued to joke around, saying it felt like The Real Housewives of Standup.\n‘What is going on?’ she said. ‘You don’t need to pick sides. Everybody’s funny. Enjoy female comedy. It was very weird. I’m glad the week is over.’","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420002/Heather-McDonald-jokes-feud-Chelsea-Handler-admits-nervous-upset.html"}
