{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:22:44","date_modify":"2018-10-30 21:22:44","date_publish":"2015-04-03 15:08:16","description":"A heated debate erupted over a proposed bill that would decriminalize truancy for minors in Texas. The Senate Committee on Criminal Justice hearing room |","filename":"data/vaneerConsumption/HeatedDebateOverTruancyLawsatTexasStateCapitol.json","image_url":"https://media.breitbart.com/media/2015/04/John-Whitmire-MIKE-STONE-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_04_03__1540934564.html","title":"Heated Debate Over Truancy Laws at Texas State Capitol","title_page":"Heated Debate Over Truancy Laws at Texas State Capitol","title_rss":"NULL","source_domain":"breitbart.com","text":"A heated debate erupted over a proposed bill that would decriminalize truancy for minors in Texas. The Senate Committee on Criminal Justice hearing room was standing room only as legislators prepared to hear public testimony on the matter.\nSenate Bill 106 authored by Sen. John Whitmire (D- Houston), chairman of the Criminal Justice Committee, would demote the longstanding practice of truancy down to a civil offense and impose graduated fines for parents of those minors who fail to attend school. According to Fox 7 Austin, the Senate committee voted to send the bill onto the full Senate.\nIn 2014, nearly 100,000 Class C Misdemeanors were doled out by school officials or full service campus police departments that are considered independent Texas police agencies. Often, they are dispatched by towns or larger municipalities. They are public sector employees and are compensated, in part, through taxpayer dollars.\nThe previous year, there were 115,000 tickets issued for truancy in Texas. During the 83rd Legislative session, also in 2013, lawmakers made it much more difficult to “ticket” frivolous kid and teen behaviors; however, truancy and other classes of misdemeanors still remain as crimes.\nFox 7 also reported that during the many hours of impassioned debate, even legislators bucked heads. Sen. Brandon Creighton (R-Conroe) went after Whitmire, accusing him of deliberately scheduling the hearing to “exclude the biggest opponents to decriminalizing truancy”– the public schools and the Justices of the Peace. State of Texas Assessments of Academic Readiness (STAAR) testing, the mandatory annual high-stakes testing was underway. Creighton insisted that this prevented many public school representatives from attending.\nJudge Wayne Mack, Justice of the Peace of Montgomery County, opposed the bill. He told Fox 7, “I don’t know one school district that is in favor of this bill.”\nHe is likely correct. Breitbart Texas reported on the Atlantic Monthly’s expose of the cottage industry in criminalizing youth behaviors through Texas truancy courts. The article pointed to a money-making machine that from 2005 to 2009 saw truancy cases filed by public schools explode from 85,000 to 120,000. It banked just over $2 million in FY 2009 and nearly $1.8 million in FY 2011.\nMack wanted truancy to stay on the books as it is. He claimed, “This bill basically equates truancy to a parking ticket. It negates the justice court system’s ability to enforce truancy and keeping kids in our schools.”\nDespite Mack’s claim, truancy is a little more damaging than a parking ticket.\nDerek Cohen, policy analyst for the Center for Effective Justice at the non-partisan, non-profit Texas Public Policy Foundation (TPPF) testified on behalf of SB 106. He told Breitbart Texas, “Currently, skipping school is considered tantamount to public intoxication, driving with an open container, disorderly conduct, and theft.”\nBreitbart Texas also reported that once Failure To Attend School (FTAS) charges are filed they can have lasting repercussions in creating a criminal paper trail that, if not sealed and later expunged, can wreak havoc on college and job applications. There are also fines up to $500 that, if not paid, can transform into arrests when a youth turns 17 years-old.\nThe US Department of Justice just stepped in to investigate the practices of the Dallas County Truancy Court and Juvenile District Courts as a result of several advocacy groups filing a complaint in 2013. Texas Appleseed was one them.\nLike TPPF, Texas Appleseed has been in the forefront of the truancy decriminalization movement. Breitbart Texas spoke to Texas Appleseed staff attorney Morgan Craven about the feds stepping into probe what she called “much-needed change in the way Texas handles truancy.”\nShe said that Dallas County was identified in the complaint because it is one of two municipalities that has specialized truancy courts that exclusively hear FTAS and Parent Contributing to Nonattendance cases. Fort Bend County is the other. She called the criminalization of children for truancy “rampant” in the Dallas area and added that the practice is facilitated by the Dallas truancy court system.\n“The Dallas courts prosecute the highest number of children in the state for FTAS, despite the fact that Dallas County does not have the largest student population,” Craven stated. She added that Harris County has the largest student population.\n“We attribute this high filing rate to the electronic filing system that is used by the school districts that funnel children into the Dallas courts. The process of sending kids to court has essentially been automated—when a certain number of unexcused absences is reached, the filing system refers a child to court,” Craven noted.\nShe also told Breitbart Texas that there are many students who are sent to court because of an “error or some other miscommunication with the school that could have been easily resolved without criminal charges.”\nCraven emphasized that that while the criminal court process is harmful to all children, those of them with disabilities and students and families with limited English proficiency are most vulnerable.\nSB 106 is one of almost two dozen bills filed in the Senate and House this legislative session that aim to reform and/or decriminalize truancy in some way. Texas Appleseed would like to see a truancy reform bill addresse decriminalization plus intervention and prevention measures at the school level.\n“SB 106 contains language that addresses these two elements in a meaningful way and we hope to continue to be part of the conversation as it makes its way through the legislative process,” Craven said.\nCohen added that the reason he testified favorably for SB 106 was “because it echoes the concerns and intent of many of the filed and substituted bills in both chambers – that children who only skip school are not deserving of an adult criminal record.”\nHe added, “That ‘hammer’ the pro-criminalization crowd is so fond of invoking would be better-served dealing with real criminals and not wayward children.”\nDisclosure: Chuck DeVore, Texas Public Policy Foundation Vice President of Policy, is a Breitbart Texas contributor.\nFollow Merrill Hope, a member of the original Breitbart Texas team, on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/04/03/heated-debate-over-truancy-laws-at-texas-state-capitol/"}
