{"authors":[],"date_download":"2018-10-22 20:52:09","date_modify":"2018-10-22 20:52:09","date_publish":"2014-05-02 17:01:28","description":"California could get the worst of it and has already seen more wildfires than normal –- in Northern California it’s nearly three times above normal.","filename":"data/vaneerConsumption/HeatandDroughtFuelUnseasonableStarttoCaliforniaWildfires.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/418671/140503-wildfire-calif-2303_76a6a0cec04471c4e3de68a291495e00.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_western-wildfires_heat-drought-fuel-unseasonable-start-california-wildfires-n95771_1540241529.html","title":"Heat and Drought Fuel 'Unseasonable' Start to California Wildfires","title_page":"Heat and Drought Fuel 'Unseasonable' Start to California Wildfires","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNo one has to tell Shawn Judson that California’s wildfire season started early this year: as superintendent of the school district closest to the wildfire near Rancho Cucamonga, he had to oversee the evacuation of 2,700 students on April 30.\nBeing up against brushy foothills, the Southern California community of Etiwanda is used to fires –- in fact, some of its schools have had to close over the past three decades due to a handful of nearby blazes.\nWhat’s different, Judson told NBC News, is that those earlier fires “were in the fall, like September or October.”\nEtiwanda could be the poster child for drought-parched California and other parts of the West, where fire experts expect May to look more like a typical June: hot, with very dry brush and trees –- a mix for a potentially explosive summer wildfire season.\nCalifornia could get the worst of it and has already seen more wildfires than normal –- in Northern California it’s nearly three times above normal.\n\"Over the last several months we have seen an unseasonable number of wildfires across Northern California.\"\n“Over the last several months we have seen an unseasonable number of wildfires across Northern California,” Doug Wenham, a fire chief for the state’s firefighting agency, said in announcing that nearly 100 more firefighters would be hired this season.\nSome 900 wildfires burned 2,400 acres from January 1 to April 5 in Northern California, the agency reported –- when typically that period sees 340 wildfires burning 1,000 acres.\nCalifornia’s drought has meant a low mountain snowpack, exposing brush and dead trees -- the fuel for fires -- to drier conditions sooner than normal.\nIn Northern California, “most dead fuels are near record dry levels for this time of year, more similar to mid-June conditions,” the National Interagency Fire Center said in its latest forecast, issued on Thursday. “Snowpack is at less than ten percent of normal and most areas below 8,000 feet are now snow free.”\nParts of California did get some rain relief in April, but don’t expect it to help much. “That precipitation largely won’t help their fire season due to the dryness of the past year or so,” fire center analyst Jeremy Sullens told NBC News.\n“Given anticipated warmer and drier-than-normal conditions,” the center said in its forecast, “fuels should reach critical levels in the lower elevations by mid-May, eventually expanding to all areas by mid-June.”\nLightning could be a complicating factor for Northern California. “Given the extremely dry state of fuels and low snowpack, upper elevations will be very prone to lightning starts by mid-June, which is four to six weeks earlier than normal,” the fire center stated.\nAcross the West, May looks pretty dismal, according to the forecast:\n“Above normal fire potential” in much of California, southern Arizona, southwestern New Mexico and southern Alaska.\n“Warmer-than-normal conditions’ for most of the West, including Alaska.\nLess rainfall “from the Alaska Panhandle to northern California.”\nIn Alaska, “dry fuels will allow ignitions in the populated corridors of the state in the next couple of weeks.”\nBy June, the “above normal” fire potential expands to include northern California, Nevada and much of Oregon –- and stays that way through August, the Fire Center forecasts.\nFor Judson and the Etiwanda School District, living next to wildfire country means always being ready to evacuate -- even if that’s four months earlier than expected.\n“Any time there’s a little puff of smoke in the sky,” he said, “we communicate with our local officials to see what the status of the fire is.”\n\"Given anticipated warmer and drier-than-normal conditions, fuels should reach critical levels in the lower elevations by mid-May, eventually expanding to all areas by mid-June.\"\nThe latest Etiwanda-area fire was reported at 8 a.m. local time on Wednesday and by 8:45 schools were being evacuated. “The kids did a great job, the staff did a great job,” Judson said.\nJudson himself stayed at his office even though his home was in the mandatory evacuation zone. His wife, a teacher, and their two children were all in school, so a neighbor evacuated the family dog.\nWhipped by high winds, the fire burned 2,190 acres before firefighters got a break from lower temperatures and lighter winds. No buildings were lost and most of the fire is now contained, allowing the evacuation zone to be lifted on Thursday and schools to reopen on Friday.\nFor Judson, it was the second time he’s had to evacuate home -- the first was a 2003 fire. But he feels pretty secure in his neighborhood, which is now buffered from the foothills by newer homes that replaced the brush that had been there.\nBut, he added, “we’re always concerned when it becomes so dry and the winds are so strong.”","url":"https://www.nbcnews.com/storyline/western-wildfires/heat-drought-fuel-unseasonable-start-california-wildfires-n95771"}
