{"authors":["Press Association"],"date_download":"2018-10-22 21:25:45","date_modify":"2018-10-22 21:25:45","date_publish":"2016-01-29 06:47:20","description":"Shuttle pods used at Heathrow Airport will be adapted to become the first driverless vehicles to be tested on London roads. The pods, which resemble small au...","filename":"data/vaneerConsumption/Heathrowshuttlepodstakeoffforlondondriverlessvehicletest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-00740ba6-2dd1-4753-a86c-cd08f298b345-3bmscybNe842cce83474b5189494-2_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422230_Heathrow-shuttle-pods-London-driverless-vehicle-test_1540243545.html","title":"Heathrow shuttle pods take off for london driverless vehicle test","title_page":"Heathrow shuttle pods take off for london driverless vehicle test | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Heathrow shuttle pods take off for London driverless vehicle test\nShuttle pods used at Heathrow Airport will be adapted to become the first driverless vehicles to be tested on London roads.\nThe pods, which resemble small automated train carriages, are currently being used at Heathrow Terminal 5 and will be developed to work without dedicated tracks, the UK's Transport Research Laboratory (TRL) said.\nThe vehicles will then be used in trials of driverless cars in Greenwich this summer as part of the Gateway project led by TRL.\nThe Heathrow shuttles will become the first driverless vehicles to be tested on London's roads\nA consortium of British firms, including Westfield Sportscars, Heathrow Enterprises and Oxbotica, will work together to make the pods into \"fully driverless shuttles\" in one of three pilots in the area.\nThe trial aims to assess the public's willingness to use autonomous vehicles in built-up areas, TRL said.\nProfessor Nick Reed, academy director at TRL and technical director for Gateway, said: \"The addition of three prominent and respected British organisations to the Gateway consortium further strengthens the UK's position as a leader in autonomous technologies.\n\"Each company brings a great deal of experience to the project which will prove valuable in helping us to understand how the public and industry will adapt to the use of automated vehicles in the UK Smart Mobility Living Lab test environment in Greenwich.\n\"If the trials prove successful, we expect these iconic vehicles to become a familiar sight in many cities around the world.\"\nThe UltraPods have been operating at Terminal 5 for nearly five years, carrying 1.5 million passengers and completed three million kilometres.\nKit car manufacturer Westfield Sportcars will be responsible for design and testing, with Heathrow Enterprises looking after software engineering and Oxford University robotics lab spin-off Oxbotica will provide mapping and sensors to ensure safety.\nJulian Turner, CEO of Westfield Sportscars said: \"We're really pleased to be a part of the Gateway consortium and are looking forward to bringing our innovative, lightweight, technology to a well-known and tried and tested platform.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3422230/Heathrow-shuttle-pods-London-driverless-vehicle-test.html"}
