{"authors":[],"date_download":"2018-10-22 22:55:34","date_modify":"2018-10-22 22:55:34","date_publish":"2014-05-13 08:23:01","description":"Forecasters said it is possible that San Antonio could get as much rain in one day as they have had for the whole year so far.","filename":"data/vaneerConsumption/HeavyRainsLashTexasTriggeringFloodWarningsinLoneStarState.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/438031/140513-texas-flood-warning-430a_f72ee36c46de56faa8d0b01a4a22520b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_heavy-rains-lash-texas-triggering-flood-warnings-lone-star-state-n103906_1540248934.html","title":"Heavy Rains Lash Texas, Triggering Flood Warnings in Lone Star State","title_page":"Heavy Rains Lash Texas, Triggering Flood Warnings in Lone Star State","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTexas is bracing for two more days of wet and wild weather — perhaps as much rain for San Antonio and Austin as they have received all year.\nOn Monday, strong storms battered the state, pelting some places with hail the size of golf balls. Power was knocked out for more than 50,000 homes and businesses in North Texas, and hundreds of flights were scrapped or delayed at Dallas-Fort Worth.\nForecasters said that Austin, San Antonio and the suburbs of Houston were all at risk of flash floods on Tuesday. The threat is part of a storm system expected to drench a swath of the country from Texas to New York and Florida by Wednesday night.\nFlood alerts were in place outside Dallas and from Houston to Corpus Christi. Almost all of Arkansas was also under flood alert.\nIn San Antonio, only 2.6 inches of rain has fallen all year. That figure could more than double by the end of Wednesday.\nThe Ohio and Tennessee Valleys could also get hit by severe thunderstorms on Wednesday, including damaging wind, hail and perhaps tornadoes, The Weather Channel reported.\n— Henry Austin","url":"https://www.nbcnews.com/news/weather/heavy-rains-lash-texas-triggering-flood-warnings-lone-star-state-n103906"}
