{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:58:23","date_modify":"2018-10-30 20:58:23","date_publish":"2016-12-23 00:00:00","description":"Bridgewater Associates has hired the scientist behind IBM Watson to build an AI programme that can take management decisions, including hiring and firing.","filename":"data/vaneerConsumption/HedgefundBridgewaterAssociatesbuildingAItoautomatework.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_hedge-fund-bridgewater-associates-building-ai-to-automate-work-2016-12_1540933103.html","title":"Hedge fund Bridgewater Associates building AI to automate work","title_page":"    Hedge fund Bridgewater Associates building AI to automate work - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Larry Busacca/Getty Bridgewater Associates, the world's largest hedge fund, is building an artificial intelligence engine to automate the management of the company, according to a report in the Wall Street Journal.\nRay Dalio, Bridgewater's founder, wants the AI system to handle everything from the day-to-day management of investments down to organising staff's days and even hiring and firing, according to the report.\nBridgewater, which has $160 billion (£130 billion) under management, already has algorithms that inform the strategy of its \"Pure Alpha\" fund, measuring hundreds of economic data points. But the new AI system, referred to as the \"Book of the Future\" by Dalio and the Principles Operating System officially, would apply data science principles to management, picking up on internal data points such as personality tests and internal polls in meetings. Bridgewater has a number of internal apps employees can use for things like grading colleagues.\nThe project is being run by David Ferrucci, according to the Journal. Ferrucci was one of the leading developers on IBM's Watson project, one of the most advanced AI systems in the world that is better at detecting cancer in patients than human doctors.\nDalio hopes that the Principles Operating System will make three-quarters of management decisions within five years. One employee told the Journal that the project is \"like trying to make Ray's brain into a computer.\" Dalio runs Bridgewater according to what he called the \"Principles,\" a set of rules that employees have to follow.\nDalio told Business Insider during a recent interview:\n\"Imagine what it would be like to have a GPS-like device that converts high-quality decision-making principles into formulas. It then processes data representing what is happening in the world and spits out recommended decisions. This is how our economic and investment thinking works. We are now doing the same things for management.\"\nArtificial intelligence has become one of the hottest areas of technology in the last few years, led by cutting edge development projects such as Google's DeepMind.\nMeanwhile, the barriers to entry for the kind of algorithmic trading that informs the \"Pure Alpha\" fund have come down (although there of course remains a premium on the unique trading strategy.) There have been a slew of so-called \"robo advisors\" popping up across the world. These online investment companies let people put their money into often automated trading strategies, such as the one offered by startup Scalable Capital.\nScalable, developed by former Goldman Sachs, Barclays, and McKinsey staff, is built around an investment algorithm that forecasts risks and then automatically optimises people's portfolios on the fly to limit losses.","url":"https://www.businessinsider.com/hedge-fund-bridgewater-associates-building-ai-to-automate-work-2016-12"}
