{"authors":["Sarah Fitzmaurice For Daily Mail Australia"],"date_download":"2018-10-22 20:21:36","date_modify":"2018-10-22 20:21:36","date_publish":"2016-01-28 01:00:47","description":"Catching a glimpse of supermodel Heidi Klum in the flesh would be a treat for any fan.","filename":"data/vaneerConsumption/HeidiKlumhandsouticecreamtopromotenewIntimateslingerierange.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A5F14B00000578-0-image-a-36_1453942711262.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420227_Heidi-Klum-dons-figure-hugging-dress-hand-ice-cream-promote-new-lingerie-range_1540239696.html","title":"Heidi Klum hands out ice cream to promote new Intimates lingerie range","title_page":"Heidi Klum hands out ice cream to promote new Intimates lingerie range  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Catching a glimpse of supermodel Heidi Klum in the flesh would be a treat for any fan.\nBut at a promotional event for the 42-year-old's latest lingerie range in Sydney the beauty made sure the experience was extra sweet.\nOn Thursday Heidi was seen handing out ice cream to her admirers from a truck covered in branding for her Heidi Klum Intimates range and retailer David Jones.\nScroll down for video\nShe's so (n)ice! Heidi Klum was seen handing out ice cream in Sydney on Thursday at a fan event\nEver the modelling professional, Heidi used her props to her advantage and was seen holding an ice cream cone up to her mouth pretending to lick it.\nThe mother-of-four used the opportunity to show off her fabulous figure in a super tight navy dress.\nBut while Heidi covered up she was joined by scantily-clad models dressed in lingerie from her new range.\nLeggy lady: The mother-of-four showed off her flawless figure in a tight navy dress with a thigh high split at the event\nSweet treats: Not only did fans get to meet Heidi but they also enjoyed a special dessert too\nTaking to Instagram to document the event, Heidi uploaded a picture of the ice cream truck to the social networking page on Thursday.\nAlong with the image she wrote: 'Had a blast handing out @heidiklumintimates lingerie cones today at @davidjonesstore ! Thank you to everyone who came out! #heidixdjs #heidiklumintimates #heidiklumman\nIn addition to her underwear range, the mother-of-four recently revealed she would be expanding her line to include swimwear.\nAlways a pro: The supermodel was seen posing using the ice cream cones as accessories\nIn demand: Fans queued up to spend a few moments with Heidi as she promoted her underwear range\nThe new line - consisting of cover ups and swimwear - is set to role out in the Southern Hemisphere in July and in the Northern Hemisphere in October.\nThe range will be in collaboration with New Zealand-based label Bendon, who also produce swimwear for luxury brands such as Stella McCartney.\n'Most of my career has been spent rolling around on beaches around the world, and I still love it,' she told WWD earlier this month.\nShe also revealed the designs would be simple saying: 'I'm not a huge fan of strange tan lines.\n'There are so many complicated swim shapes out there but I don't want ten straps on my back.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420227/Heidi-Klum-dons-figure-hugging-dress-hand-ice-cream-promote-new-lingerie-range.html"}
