{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 02:03:55","date_modify":"2018-10-23 02:03:55","date_publish":"2016-01-29 16:17:40","description":"The 42-year-old lingerie model was spotted making a stylish return to the Big Apple on Thursday after a busy trip to Australia, where she was promoting Heidi Klum Intimates and HK Man.","filename":"data/vaneerConsumption/HeidiKlumchatswitholdergentlemanwhilelandinginNYCaftertripDownUnder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3038100000578-0-image-a-7_1454080420009.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422899_Heidi-Klum-wears-enormous-scarf-chats-older-gentleman-landing-NYC-trip-Under_1540260235.html","title":"Heidi Klum chats with older gentleman while landing in NYC after trip Down Under","title_page":"Heidi Klum chats with older gentleman while landing in NYC after trip Down Under | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was bundled up with a very large grey scarf that hid her chin and plenty of camo.\nBut makeup-free Heidi Klum was still hard to miss as she landed in New York on Thursday.\nThe 42-year-old looked radiant as she strolled through LaGuardia Airport with an older gentleman.\nScroll down for video\nSo fly! Heidi Klum was fresh faced when she return to New York following a promotional tour through Australia on Thursday\nNo doubt the pair were in a great mood, as they smiled brightly at each other while briskly making their way through the transport hub.\nHeidi was at her casual cool best as she wore her bright blonde hair down atop a black leather jacket and long grey scarf.\nMaking comfort a top priority for her long flight from Australia, Heidi teamed the edgy jacket with a soft pair of camouflage print sweats.\nShe had a matching tote slung over her elbow and topped off the look with a pair of glossy and cool black trainers.\nHigh spirits: The model and the employee exchanged smiles\nEarlier that same day, Heidi raved about her trip to Australia, where she was busy promoting Heidi Klum Intimates and HK Man.\nThe star expressed her gratitude for the visit on Instagram, posting a snap of herself kicking up her feet in the airplane.\n'Thank you Australia for your warm welcome! Had the best time...until next time,' the image was captioned.\nStaying up-to-date! The 42-year-old took phone break just before heading out into the city\nIn addition to her underwear range, the mother-of-four revealed she would be expanding her line to include swimwear.\nThe collection - consisting of cover ups and swimwear - is set to role out in the Southern Hemisphere in July and in the Northern Hemisphere in October.\nThe range will be in collaboration with New Zealand-based label Bendon, who also produce swimwear for luxury brands such as Stella McCartney.\n'Had the best time': The star expressed her gratitude for the visit on Instagram, captioning a snap of herself kicking up her feet in her airplane on Thursday as 'Thank you Australia for your warm welcome! Had the best time...until next time'\n'Most of my career has been spent rolling around on beaches around the world, and I still love it,' she told WWD earlier this month.\nSpeaking to Daily Mail Australia, she revealed that her favourite style from the upcoming line is a triangle, 'leopard-inspired' red and white embellished number.\n'I'm the guinea pig, I try literally every piece on,' she said.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422899/Heidi-Klum-wears-enormous-scarf-chats-older-gentleman-landing-NYC-trip-Under.html"}
