{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:47:58","date_modify":"2018-10-31 01:47:58","date_publish":"2018-09-11 15:14:25","description":"As much fun as it is to obsess over celebrity couples, it's even more interesting to think about what could have been, and now, there's a major missed opportunity that should be on your radar. During an appearance on The Ellen DeGeneres Show on…","filename":"data/vaneerConsumption/HeidiKlumIgnoredDrakesTextAskingHerOutButEverythingWorkedOutForTheBest.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/ad4c770d-bd71-48d2-8cd7-8b880df9d659-screen-shot-2018-09-11-at-112646-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_heidi-klum-ignored-drakes-text-asking-her-out-but-everything-worked-out-for-the-best-11868781_1540950478.html","title":"Heidi Klum Ignored Drake's Text Asking Her Out, But Everything Worked Out For The Best","title_page":"Heidi Klum Ignored Drake's Text Asking Her Out, But Everything Worked Out For The Best","title_rss":"NULL","source_domain":"bustle.com","text":"As much fun as it is to obsess over celebrity couples, it's even more interesting to think about what could have been, and now, there's a major missed opportunity that should be on your radar. During an appearance on The Ellen DeGeneres Show on Tuesday, Heidi Klum said she ignored a text from Drake right around the time she met boyfriend Tom Kaulitz, but don't worry — it sounds like everything worked out in the end.\nDuring their interview (which you can check out here), Klum and DeGeneres talked about how they played \"Would You Rather\" the last time she visited the show, and DeGeneres totally took credit for helping Klum put it out in the universe that she was looking for someone special. But during that game with DeGeneres, the then-single Klum chose Drake in every category... which is pretty ironic, because then she revealed that he was actually someone she could have pursued in real life, if only she'd answered his text.\nYes, this is a true story. Apparently Klum got a text from Drake asking her out and promptly did not respond to him, because at that point she'd already met Kaulitz and knew that she didn't need to entertain the idea of dating anyone else.\n\"You snooze, you lose, you know what I mean?\" Klum told DeGeneres. \"He was basically, like, a week too late, yeah.\"\nIt makes sense that Klum wouldn't want to have that awkward conversation and let someone down easy, but it's hard to imagine getting a text from Drake and not responding. Plus, it's kind of a bummer (for Drake, at least), because it sounds like he went through a lot of effort to find Klum's number, being that neither of them knew each other. She said that he was able to get her digits from someone who knew her, but by then, the window of opportunity had passed.\n\"I was like, 'oh my gosh, this is so weird,' but then I never texted him back because I found the love of my life,\" Klum said.\nTheEllenShow on YouTube\nMany fans would probably say that if you're with someone and he's not Drake, he's not the love of your life. But for Klum, she just wasn't interested, and apparently, this was the best way she could think of to make herself clear. That didn't stop DeGeneres from pointing out that she should probably say sorry to Drake for blowing him off, though, at which point Klum looked directly into the camera to issue her formal apology.\n\"Drake, I'm sorry I didn't text you back,\" she said. \"But yeah, you're cool. I still love your music. I'll probably come to the concerts very soon.\"\nImagine if Klum had texted Drake back, and they were dating right now — how wild would that be? But sadly, it just wasn't meant to be, and it seems like it's for the best, because she's so happy with Kaulitz right now, and Drake doesn't appear any worse for the wear. It might not have been the happy ending we could have gotten in an alternate universe, but it's a happy ending all the same.","url":"https://www.bustle.com/p/heidi-klum-ignored-drakes-text-asking-her-out-but-everything-worked-out-for-the-best-11868781"}
