{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 01:29:15","date_modify":"2018-10-23 01:29:15","date_publish":"2016-01-28 15:47:03","description":"The blonde beauty - who hails from Germany - promoted her HK Man range at David Jones in Sydney, and stunned in a black lace dress","filename":"data/vaneerConsumption/HeidiKlumjoinsshirtlessmalemodelstopromotehermensunderwearcollection.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB0A5000000578-0-image-a-9_1453992134616.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421070_Heidi-Klum-joins-troupe-shirtless-male-models-promote-men-s-underwear-collection_1540258155.html","title":"Heidi Klum joins shirtless male models to promote her men's underwear collection","title_page":"Heidi Klum joins shirtless male models to promote her men's underwear collection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has an enviable career as a leading supermodel and businesswoman.\nBut it was just another day at the office for Heidi Klum on Thursday when she made a store appearance surrounded by hunky and shirtless male models.\nThe 42-year old beauty - who hails from Germany - promoted her HK Man range at David Jones in Sydney, and stunned in a black lace dress.\nScroll down for video\nHot to trot! Heidi Klum on Thursday promoted her HK Man collection at David Jones in Sydney, and stunned in a black lace dress\nThe leggy star showed off her thin frame in her outfit, that featured spaghetti straps and a thigh split with a lace panel.\nLace was also featured at the back of the dress and just over her bust.\nShe accessorised her look with black buckled heels and a multi-layered necklace and a ring.\nHeidi - who has modeled for the likes of Victoria's Secret - kept her locks out and over her shoulders.\nDoing her thing: The German star is seen here with hunky male models who showed off her men's range\nNot an inch to pinch: The leggy star showed off her thin frame in her outfit, that featured spaghetti straps and a thigh split with a lace panel\nBeautiful: Looking fresh, Heidi's make-up was kept simple to show off her model good looks\nHer shorter layers were kept out around her face and part of her hair was swept up to make a half up and half down hairstyle.\nLooking fresh, Heidi's make-up was kept simple to show off her model good looks.\nShe had a light skim of foundation on and touches of blush, and completed the look with a glossy pink lip and a bronze eye.\nHeidi appeared to be in high spirits for the day and was beaming widely as she appeared in front of crowds at the department store.\nAustralian star and TV presenter Tom Williams was the MC at the appearance, and he graced the stage with Heidi.\nShe doesn't need it! She had a light skim of foundation on and touches of blush, and completed the look with a glossy pink lip and a bronze eye\nEnjoying herself: Heidi appeared to be in high spirits for the day and was beaming widely as she appeared in front of crowds at the department store\nChit chat: She engaged in light conversation with the male models\nCreative: The men had words written over their chests, including 'support' and 'style'\nPerks of the job: There was plenty of eye candy at the event\nFamiliar face: Australian star and TV presenter Tom Williams was the MC at the appearance, and he graced the stage with Heidi\nOn the day, the first 20 customers in store received a signed Heidi Klum Intimate gift pack for men and had the opportunity to get their photo taken with Heidi.\nShe also has a line for women, Heidi Klum Intimates, that she has been busy promoting while in Australia.\nThe model was later seen handing out ice cream to fans from a truck covered in branding for Heidi Klum Intimates and David Jones.\nShe recently revealed she'll be expanding her collections to include swimwear.\nHeidi - who has appeared on shows including Project Runway and Germany's Next Top Model - has been promoting her collections in both Sydney and Melbourne recently.\nWhat a career: Heidi is well known for working with lingerie brand Victoria's Secret\nReady to go: The stunner caught the eye as she made her way across the store\nThat's a treat! On the day, the first 20 customers in store received a signed Heidi Klum Intimate gift pack for men and had the opportunity to get their photo taken with Heidi\nBusiness savvy: She also has a line for women, Heidi Klum Intimates, that she has been busy promoting while in Australia\nRun off her feet! Also on Thursday in Sydney, she handed out ice cream to fans from a truck covered in branding for Heidi Klum Intimates and David Jones\nHitting the road: Heidi - who has appeared on shows including Project Runway and Germany's Next Top Model - has been promoting her collections in both Sydney and Melbourne recently","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421070/Heidi-Klum-joins-troupe-shirtless-male-models-promote-men-s-underwear-collection.html"}
