{"authors":["Andrea Magrath For Daily Mail Australia"],"date_download":"2018-10-22 20:44:30","date_modify":"2018-10-22 20:44:30","date_publish":"2016-01-28 03:26:06","description":"The supermodel appeared at David Jones department store in Sydney to promote her new Heidi Klum Intimates collection.","filename":"data/vaneerConsumption/HeidiKlumdonsasheerdressasshepromotesherIntimateslingeriecollection.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6CE2D00000578-0-image-a-49_1453956553924.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420247_Heidi-Klum-slips-daring-sheer-dress-promotes-new-lingerie-collection_1540241070.html","title":"Heidi Klum dons a sheer dress as she promotes her Intimates lingerie collection","title_page":"Heidi Klum dons a sheer dress as she promotes her Intimates lingerie collection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With February 14 just around the corner, Heidi Klum has shared her formula for the sexiest Valentine's Day.\nWith eight years under her belt as a Victoria's Secret Angel, before launching her own eponymous lingerie label two years ago, Heidi knows what she is talking about when it comes to upping the sex factor.\n'My favourite is the red Corps Perdu set,' the model revealed at a breakfast to promote the new Heidi Klum Intimates collection at David Jones department store in Sydney.\nScroll down for video\nRacy in lace: Heidi Klum looked sensational in a daring dress that revealed a lot of leg at an event to promote her Heidi Klum Intimates and HK Man collections at David Jones department store in Sydney\n'Valentine's Day is coming up very soon, and Corps Perdu is one of my favourite bras - which is great for someone special.\n'I think more skin is better - I don't like too much coverage,' she said of the sensual plunging style.\nThe supermodel wore a figure-hugging navy dress to the event, before changing into a more daring lacy number that revealed a lot of leg to present her men's collection in-store with a group of male models.\nQuick change: The supermodel slipped into the slinky number (left) after earlier appearing in a figure hugging navy dress and colourful shoes for the women's collection event\n'Great for someone special': Heidi revealed that her personal favourite style from her collection with Bendon, and her pick for Valentine's Day, is the Corps Perdu set\nThe stunning 42-year-old Project Runway star hinted at what her own Valentine's Day plans, telling press she had done a watercolour painting to give to her boyfriend as a present.\nKlum has been dating New York art dealer Vito Schnabel for almost two years.\nHeidi has been in Australia promoting her second collection for underwear brand Bendon, and has revealed that she will this year expand to swimwear.\nSpeaking to Daily Mail Australia, she revealed that her favourite style from the upcoming line is a triangle, 'leopard-inspired' red and white embellished number.\nRomantic: The Project Runway star revealed that she has painted her art dealer boyfriend Vito Schnabel (pictured with Klum in September) a watercolour for Valentine's Day\nMen's collection: Heidi appeared on stage at the upmarket department store to promote her HK Men range\n'I'm the guinea pig, I try literally every piece on,' she said.\nOf her lingerie line, Heidi said she was veering away from the eye-popping push-up style brands liker her former employer Victoria's Secret are known for.\n'In 2016 I think the more natural shape is more in fashion, than having the boobs so hoisted [up]. I think we are seeing more of a natural shape now.'\nGuest list: Kate Waterhouse (left) and Ksenija Lukich (right) attend the Heidi Klum Intimate breakfast","url":"https://www.dailymail.co.uk/femail/article-3420247/Heidi-Klum-slips-daring-sheer-dress-promotes-new-lingerie-collection.html"}
