{"authors":["Mia De Graaf For Dailymail.Com"],"date_download":"2018-10-22 21:16:42","date_modify":"2018-10-22 21:16:42","date_publish":"2016-01-28 07:14:02","description":"Eva Schloss, now aged 86, met Anne in Amsterdam where both their families took refuge after fleeing from Nazi Germany. After the war, Eva's mother Fritzi married Anne's father Otto Frank.","filename":"data/vaneerConsumption/HeisanotherHitlerAnneFranksstepsisterwhosurvivedAuschwitzcomparesDonaldTrumptoNazidictator.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A7711D00000578-0-image-a-2_1453966024101.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420430_He-Hitler-Anne-Frank-s-stepsister-survived-Auschwitz-compares-Donald-Trump-Nazi-dictator_1540243002.html","title":"'He is another Hitler': Anne Frank's stepsister who survived Auschwitz compares Donald Trump to Nazi dictator","title_page":"'He is another Hitler': Anne Frank's stepsister who survived Auschwitz compares Donald Trump to Nazi dictator   | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Anne Frank's stepsister who survived Auschwitz has compared Donald Trump to Adolf Hitler.\nEva Schloss, now aged 86, met Anne in Amsterdam where both their families took refuge after fleeing from Nazi Germany. After the war, Eva's mother Fritzi married Anne's father Otto Frank.\nNow, in an interview to mark International Holocaust Remembrance Day, Schloss has reflected on the traumatic period - and she sees little difference between Hitler's rhetoric and that of aspiring president Donald Trump.\n'If Donald Trump become[s] the next president of the US it would be a complete disaster. I think he is acting like another Hitler by inciting racism,' Schloss told Newsweek.\nAnne Frank's stepsister who survived Auschwitz has compared Donald Trump to Adolf Hitler\nAnne Frank was 15 when she died at the Bergen-Belsen concentration camp in March 1945.\nSchloss, the co-founder of Anne Frank Trust UK, was detained at the same time and sent to Auschwitz. She survived and now lives in London.\nShe also takes aim at America for resisting calls to take more refugees from Syria - comparing the migrant crisis to her own experience during the Holocaust.\nTrump has been vocal about his beliefs that America should place a ban on Muslims entering the country, and vows he would implement such a ban if he were to be elected president.\nHe also vows to build a wall along the Mexican border. In his bid to promote this idea, he released a campaign video using footage of a war zone in Morocco.\nPointing to America, Schloss says: 'If countries as big as the U.S. and Canada would take in more people, then we would get much closer to a solution.'\nEva Schloss, now aged 86, met Anne in Amsterdam where both their families took refuge after fleeing from Nazi Germany. After the war, Eva's mother Fritzi married Anne's father Otto Frank\nShe adds: 'The situation today is worse than it was under Hitler because at that time all the Allies—the U.S., Russia and Britain—worked together to combat the terrible threat of Nazisim. If we don't work together, the world will never be able to resolve the threats it faces today.'\nHer words come as Trump heads for the crucial Iowa caucus, which could make or break his run for the Republican nomination.\nThe controversial real estate mogul has come under fire for his comments about immigrants, his vows to ban Muslims from entering the United States, and to build a wall on the Mexican border 'that Mexico will pay for'.","url":"https://www.dailymail.co.uk/news/article-3420430/He-Hitler-Anne-Frank-s-stepsister-survived-Auschwitz-compares-Donald-Trump-Nazi-dictator.html"}
