{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-22 20:20:42","date_modify":"2018-10-22 20:20:42","date_publish":"2016-01-29 01:11:18","description":"She never looks anything less than glamorous when she steps out. And Helen Mirren even managed to cut a striking figure after an 11-hour flight, looking a picture of sartorial elegance at LAX airport.","filename":"data/vaneerConsumption/HelenMirrencutsaglamorousfigureinafittedblacksuitasshejetsintoLAX.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE2D4E00000578-0-image-a-101_1454028011323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421984_Helen-Mirren-cuts-glamorous-figure-fitted-black-suit-jets-LAX_1540239642.html","title":"Helen Mirren cuts a glamorous figure in a fitted black suit as she jets into LAX","title_page":"Helen Mirren cuts a glamorous figure in a fitted black suit as she jets into LAX | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She never looks anything less than glamorous when she steps out.\nAnd Helen Mirren even managed to cut a striking figure after an 11-hour flight, looking a picture of sartorial elegance as she made her way through LAX airport on Thursday.\nDonning a fitted black suit for the journey, the 70-year-old seemed in good spirits as she headed to Los Angeles ahead of the Screen Actors Guild Awards on Saturday.\nScroll down for video\nJet set style! Helen Mirren even managed to cut a striking figure after an 11-hour flight, looking a picture of sartorial elegance as she made her way through LAX airport on Thursday\nThe veteran actress - who is nominated for three gongs on the night - put a sultry spin on her ensemble, revealing a hint of lace in a risqué black top.\nAdding a touch of glamour to the chic outfit, she donned a grey faux fur stole over one shoulder, whilst a small boxy handbag lay draped over the other side.\nSlipping her feet into a pair of two-tone quilted ballet pumps, the Oscar-winning actress looked effortlessly stylish.\nGood vibes: Donning a fitted black suit for the journey, the 70-year-old seemed in good spirits as she headed to Los Angeles ahead of the Screen Actors Guild Awards on Saturday\nStyling her silver locks in a chic side parting, Helen revealed her youthful complexion, which sported minimal make-up.\nRadiating with a healthy glow, she added a subtle slick of rosy gloss to her pout.\nShe finished off the ensemble with a pair of oversized sunglasses.\nStylish: The veteran actress - who is nominated for three gongs at the SAGs- put a sultry spin on her ensemble, revealing a hint of lace in a risqué black top\nThe star seemed in good spirits ahead of the SAG awards - where she has been nominated for Best Actress in Woman in Gold - a biographical account of Jewish World War II survivor Maria Altmann, who fought the Austrian government over pieces of stolen artwork.\nHelen is also nominated for Best Supporting Actress and as Ensemble Cast Member for Trumbo, which tells the story of the Hollywood screenwriter Dalton Trumbo.\nMeanwhile, the star recently revealed that she had no regrets in life, despite acknowledging that she's made some errors in judgement.\nSilver vixen: Adding a touch of glamour to the chic outfit, she donned a grey faux fur stole over one shoulder, whilst a small boxy handbag lay draped over the other side\nSpeaking to the Daily Mail she admitted: 'That’s not to say I haven’t made many, many mistakes along the way. It’s been an endless litany of mistakes and mis-steps.\n‘I’ve turned down acting jobs I should have said “Yes” to, accepted ones I should have said “No” to, had relationships with people I shouldn’t have had a relationship with and got drunk at times when I should have remained sober.'\nBut she concluded: 'Despite all the wrong turns, somehow I’ve been led stumbling to the point where I am right now, which is the place I most want to be in my life.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421984/Helen-Mirren-cuts-glamorous-figure-fitted-black-suit-jets-LAX.html"}
