{"authors":["Baz Bamigboye For The Daily Mail"],"date_download":"2018-10-22 20:28:50","date_modify":"2018-10-22 20:28:50","date_publish":"2016-01-29 01:49:44","description":"BAZ BAMIGBOYE: The award-winning actress will return to the National Theatre in June to play Terence Rattigan’s tortured heroine Hester Collyer in his 1952 drama The Deep Blue Sea.","filename":"data/vaneerConsumption/HelenMcCrorydivesinatthedeependasalovecheatwritesBAZBAMIGBOYE.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AA5F9A00000578-0-image-a-72_1454032032099.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422086_BAZ-BAMIGBOYE-Helen-McRory-dives-deep-end-love-cheat_1540240130.html","title":"Helen McCrory dives in at the deep end as a love cheat, writes BAZ BAMIGBOYE","title_page":"Helen McCrory dives in at the deep end as a love cheat, writes BAZ BAMIGBOYE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Helen McCrory will return to the National Theatre in June to play Terence Rattigan’s tortured heroine Hester Collyer in his 1952 drama The Deep Blue Sea\nHelen McCrory is about to jump into the Deep without a lifebelt.\nThe award-winning actress will return to the National Theatre in June to play Terence Rattigan’s tortured heroine Hester Collyer in his 1952 drama The Deep Blue Sea.\n‘I’ve literally just said, Yes!’ Helen told me yesterday.\nShe said she’s very taken by the role of Hester, wife of Sir William Collyer, a High Court judge, who cheats on her husband by moving into an undesirable flat with Freddie, a former RAF pilot left psychologically damaged by the war.\nHelen said Hester’s ‘just drowning in it, from the beginning, but whether it’s from ecstasy or misery I don’t know... it’s what happens to you when you’re overwhelmed by love.\n‘I think Hester’s very funny, very bright — and what’s so interesting about her and Freddie is that she understands completely what she’s doing, but she’s unable to stop herself.\n‘She has this addiction for him she knows is wrong,’ the actress told me as we discussed the production.\nIt reunites her with Carrie Cracknell, who directed her powerful Medea at the National two years ago.\nHelen said she felt sympathy for the cuckolded husband, too. ‘I imagine she’s come through the war with him.’\nBut she felt a strong aversion to Freddie. ‘He’s so destructive. He’s horrible, I think. He has the cruelty of youth — young people are very cruel,’ she told me.\n‘You understand, as you get older, that kindness and consideration go a long way in a relationship — and he has neither of those, yet.’\nThankfully, Helen’s own husband, the actor Damian Lewis, was downstairs greeting callers at the front door while we chatted on the phone about the lustful sex that drives Hester into Freddie’s arms.\nShe’s eager to discover who will play the two men in Hester’s life and whether Sir William will be the same age as, or older than, Hester. ‘It might add another layer if they’re the same age,’ she suggested.\nHester is one of the major modern classic parts. I saw Penelope Wilton perform it at the Almeida; Blythe Danner doing it in New York and Rachel Weisz in Terence Davies’s visually arresting film.\nHelen is looking forward to being back at the NT, where she made her professional London debut in Trelawney Of The Wells. The play will run at the Lyttelton in June.\nIn April, she can also be seen in the third series of the BBC’s Peaky Blinders and has filmed new episodes of Penny Dreadful for Sky Atlantic and Neal Street Productions.\nALL THIS ROMPING? IT'S SO EXHAUSTING!\nDominic Cooper didn’t know whether to be flattered or insulted when he was first approached about portraying the louche second Earl of Rochester ten years ago.\n‘They said: “You simply must play this part!” ’ Cooper recalled.\n‘Whenever someone says that to me, I wonder what they’re insinuating,’ the dashing actor said, straight-faced, before bursting into laughter.\nCooper, who was in the original company of The History Boys at the National Theatre (he reprised his role of Dakin on Broadway and later on the big screen), read up on John Wilmot, Earl of Rochester, over the years and enjoyed the tales of his bawdy antics.\nDominic Cooper didn’t know whether to be flattered or insulted when he was first approached about portraying the louche second Earl of Rochester ten years ago\nNow, he’s ready to portray him in Stephen Jeffreys’ play The Libertine, which will run at the Theatre Royal, Bath, for two weeks from August 31. It will move to the Theatre Royal, Haymarket from September 22 for ten weeks.\nBy that time, Cooper may well be worn out. He smiled and said that after he did the photographic session for the play — with three actresses in his arms — he felt ‘exhausted’.\n‘I like Wilmot’s outlook on life,’ he said. ‘He decided that the country had been through enough repression, so he was going to have a good time. He hit the bottle and was constantly rollicking around. As a consequence, he became ill very quickly. But I believe he enjoyed the sensation of trying everything.’\nCooper lamented the fact that he hasn’t been on stage since he appeared with Helen Mirren in Phedre at the National Theatre back in 2009.\nHe has been shooting movies and TV dramas (he can be seen now in the second season of Agent Carter, on Fox UK, as playboy inventor Howard Stark opposite Hayley Atwell).\nThis weekend he goes to New Mexico to work on a new series, Preacher, playing a minister who returns to his rather corrupt, dysfunctional Texas town.\nTrace a line from Jessica Chastain’s spaceship commander Melissa Lewis in The Martian to Sigourney Weaver’s Ripley in Alien, and it’s clear that movies with formidable women are director Ridley Scott’s (pictured) forte\nWHY RIDLEY LOVES STRONG WOMEN\nTrace a line from Jessica Chastain’s spaceship commander Melissa Lewis in The Martian to Sigourney Weaver’s Ripley in Alien, and it’s clear that movies with formidable women are director Ridley Scott’s forte.\nScott laughed and said he has been surrounded by strong females all his life. ‘I think my mum was a typical strong woman; she brought up three boys and ruled the roost.\n‘I’ve been married to strong women; and three out of the four people I work closely with are women,’ the film-maker (left) said from Sydney, where he’s doing pre-production work on Alien: Covenant, which will star Michael Fassbender.\nI asked if Noomi Rapace, who was in his film Prometheus (from which Covenant follows), would be working with him in Australia and he said no. ‘We’re still casting the main roles,’ he said.\nHe’s already got most of the film drawn in his own very detailed storyboards that enable him to visualise every shot before shooting actually begins.\nScott, who studied at art school, said every planned camera shot, from every angle, is included.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422086/BAZ-BAMIGBOYE-Helen-McRory-dives-deep-end-love-cheat.html"}
