{"authors":["Associated Press"],"date_download":"2018-10-23 01:22:57","date_modify":"2018-10-23 01:22:57","date_publish":"2017-03-10 09:24:11","description":"ISTANBUL (AP) - A helicopter crashed on a highway on Istanbul's outskirts Friday after apparently hitting a television tower in dense fog, reports said. All...","filename":"data/vaneerConsumption/HelicoptercrashesonoutskirtsofIstanbul7killed.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/18/wire-197591-1489172055-614_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300514_Helicopter-crashes-outskirts-Istanbul-5-killed_1540257777.html","title":"Helicopter crashes on outskirts of Istanbul; 7 killed","title_page":"Helicopter crashes on outskirts of Istanbul; 7 killed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISTANBUL (AP) - A helicopter crashed on a highway on Istanbul's outskirts Friday after apparently hitting a television tower in dense fog, reports said. All seven people on board were killed, the city's mayor said.\nThe Sikorsky S-76 was carrying an executive of the Eczacibasi group of companies, four of his Russian guests and two pilots.\nGov. Vasip Sahin said that the helicopter crashed in Istanbul's Buyukcekmece district after taking off from Ataturk Airport, adding that the cause of the crash was under investigation.\nDebris is strewn over the roadway as forensic officers work on the site after a helicopter crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said.(IHA via AP)\nAuthorities initially recovered five bodies from the crash site, but Mayor Kadir Topbas later said that all seven on board were killed.\nThick black smoke could be seen billowing from the crash site in video shown on Turkish network DHA. Burning debris was scattered across a large stretch of the highway.\nVideo from a security camera of a gas station showed the helicopter plunging behind a hill, followed by a ball of fire rising to the sky that quickly turned into black smoke.\nVideo from a helicopter showed rows of rescue vehicles at the crash site and traffic piling up as vehicles were diverted off the highway to other roads.\nThe DHA news agency said the helicopter's rotor blade hit a vehicle, smashing its windscreen and causing its roof to sink in. Its driver escaped unhurt but in shock, the agency said.\nWitness Fikret Karatekin, a taxi driver, told CNN-Turk television by telephone that the helicopter slammed into the tower before crashing on the highway.\n\"It hit the tower and crashed by spinning,\" he said.\nAuthorities, however, didn't rule out a technical fault as the cause of the crash.\nThe tower, which is no longer used for transmitting television signals but has a restaurant at the top, didn't appear to be damaged.\nEczacibasi is one of Turkey's top conglomerates that is involved in pharmaceuticals and building products. Bulent Eczacibasi, who heads the company, told reporters near the scene that the Russians on board the helicopter were clients who had been invited to visit a ceramics fair. They were being transported to visit the company's factory near the town of Bozuyuk, some 200 kilometers (120 miles) south of Istanbul.\nThe Turkish national who was killed headed the company's operations in Russia, he said.\nFirefighters work on the site shortly after a helicopter with seven people inside was crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. (Cem Bakrc/Depo Photos via AP)\nFirefighters work on the site shortly after a helicopter with seven people inside was crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said. (IHA via AP)\nFirefighters work on the site shortly after a helicopter with seven people inside was crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said. (IHA via AP)\nFirefighters work on the site after a helicopter crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said. (AP Photo/Emrah Gurel)\nForensic officers work on the site after a helicopter crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said. (AP Photo/Emrah Gurel)\nPeople walk next to the remains after a helicopter crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said.(AP Photo/Emrah Gurel)\nA forensic officer works on the site after a helicopter crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said.(AP Photo/Emrah Gurel)\nFirefighters and forensic officers work on the remains of a helicopter that crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said. (DHA-Depo Photos via AP)\nMedics carry a dead body to an ambulance at the site after a helicopter crashed in Istanbul's Buyukcekmece district, Friday, March 10, 2017. A helicopter crashed on a highway in the outskirts of Istanbul on Friday, after apparently hitting a television tower in dense fog, reports said. At least five people were killed, the governor said. (AP Photo/Cavit Ozgul)","url":"https://www.dailymail.co.uk/wires/ap/article-4300514/Helicopter-crashes-outskirts-Istanbul-5-killed.html"}
