{"authors":[],"date_download":"2018-10-22 21:54:25","date_modify":"2018-10-22 21:54:25","date_publish":"2014-06-06 21:59:11","description":"For the first time, NASA has used a new type of laser transmitter to beam high-definition video down to Earth from the International Space Station.","filename":"data/vaneerConsumption/HelloWorldHDTVSentViaLaserBeamFromSpace.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/493616/140606-opals_0e002935d0301e81ee990154e2fe8be0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_hello-world-hdtv-sent-laser-beam-space-n124956_1540245265.html","title":"'Hello World': HDTV Sent Via Laser Beam ... From Space!","title_page":"'Hello World': HDTV Sent Via Laser Beam ... From Space!","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFor the first time, NASA has used a new type of laser transmitter to beam high-definition video down to Earth from the International Space Station.\nThursday's high-def \"Hello World\" message was sent via the Optical Payload for Lasercomm Science, or OPALS, which was delivered to the station in April during a SpaceX resupply mission. The OPALS experiment is aimed at demonstrating laser communication systems that can dramatically outpace the radio-based method currently used for deep-space data transfer.\n\"It's like upgrading from dial-up to DSL,\" Bogdan Oaida, OPALS project systems engineer at NASA's Jet Propulsion Laboratory, explained during a preview of the test.\nPart of the challenge for OPALS was to lock onto its target at Table Mountain Observatory in Wrightwood, California. First, the observatory aimed a laser beacon at the space station, and that helped OPALS get a fix on the signal receiver as the station sped past at 17,500 mph.\nThe entire transmission lasted 148 seconds, and reached a maximum transmission rate of 50 megabits per second. NASA says OPALS transmitted each copy of its 175-megabit \"Hello World\" video message in just 3.5 seconds — a feat that would have taken more than 10 minutes using traditional data downlink methods.\nThe technique isn't such a big deal for data transfer between Earth and the space station, which is served by a constellation of telecom satellites in low-Earth orbit. But laser transmitters could revolutionize communication with interplanetary probes, which currently depend on relatively low-bandwidth radio links with NASA's Deep Space Network.\n\"Using the space station to investigate ways we can improve communication rates with spacecraft beyond low-Earth orbit is another example of how the orbital complex serves as a stepping stone to human deep-space exploration,\" Sam Scimemi, director of the space station division at NASA Headquarters, said in a news release.","url":"https://www.nbcnews.com/science/space/hello-world-hdtv-sent-laser-beam-space-n124956"}
