{"authors":[],"date_download":"2018-10-22 23:16:04","date_modify":"2018-10-22 23:16:04","date_publish":"2014-08-27 00:00:00","description":"The company Vital Decisions hires social workers to help people make end-of-life plans in advance, over the phone. But the counselors are paid by insurers. Critics see a conflict of interest.","filename":"data/vaneerConsumption/HelloMayIHelpYouPlanYourFinalMonths.json","image_url":"https://media.npr.org/assets/img/2014/08/19/counselor-1_wide-9eda6cc84b5b4e2041c734f1642ff1b940b1f8c1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=339861118_1540250164.html","title":"Hello, May I Help You Plan Your Final Months?","title_page":"Hello, May I Help You Plan Your Final Months? : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nIt is especially hard to talk about death when someone in your family is near the end of life. It's difficult to discuss their care. But, talking it through can improve the quality of life for patients and their families.\nElana Gordon reports on how one company has made a business of starting those conversations.\nARIANA NOTO: My name is Ariana. I am a health care counselor.\nELANA GORDON, BYLINE: Here's the kind of conversation that Ariana Noto has every day from her cubicle in New Jersey.\nNOTO: It's up to you if you want to tell me how you've been. I hope I can help you in some way.\nUNIDENTIFIED MAN: I have a brain tumor - a malignant brain tumor. I've been fighting it for over a year now.\nGORDON: It's the recording of a real client on the other line, speaking from his home and replayed with his permission.\nUNIDENTIFIED MAN: The meds just made me dizzy and you know, I can't - you know, when I'm that dizzy, I can't drive, this and that - I'm just trapped inside the house and I'm going nuts.\nNOTO: Jeez, that's a lot. I'm so sorry to hear that.\nGORDON: Noto and the man have never met or talked before. She is one of several dozen counselors at a company called Vital Decisions. The company works through insurance companies to identify beneficiaries with advanced illnesses. After sending a letter, Noto and other counselors essentially cold call them and offer what they describe as non-directed, end-of-life counseling.\nThis initial 15 minute call between Noto and the man gets personal very quickly, as they discuss his treatments.\nNOTO: But you can control, like you said, how much treatment you want to do and how you want your symptoms to be managed as it does get worse. So...\nUNIDENTIFIED MAN: But, I can't talk that way with my son in the room.\nNOTO: ...Oh, OK, because he says, Dad, keep going. I want you to - don't give up.\nGORDON: It's this disconnect between the father, the son and the doctor, that CEO Mitchell Daitz says is an example of why his company is so important in health care right now. Daitz describes what typically happens to people as their medical options narrow.\nMITCHELL DAITZ: When you're faced with a set of choices, that none of which represent a really good choice, you become ambivalent. So you don't choose and you're along for the ride and that's when the trouble starts.\nGORDON: He says talking it through puts patients in the driver's seat. Daitz says the idea wasn't popular at first. The company is 6 years old and was initially competing with rumors of death panels.\nDAITZ: No one ever accused me of having good timing. (Laughter) 2010 was what we referred to as the dark period.\nGORDON: Daitz says insurers and people are more open now. Last year counselors handled 12,000 cases all across the country, including some for Philadelphia's largest insurer.\nHis company is part of a wave of initiatives aimed at starting and continuing these tough conversations. Some states have even started paying for them. Daitz says when these conversations do happen, there's another byproduct; reduced costs. That's because research is finding that when patients fully understand aggressive care, many prefer less of it. By his own rough estimate, the company's services have resulted in about $10,000 less in health care spending per patient.\nDAITZ: $100 million savings to the health care delivery system for just the patients we worked with in 2014.\nGORDON: Some are wary of the company's approach. Dr. Lauris Kaldjian, Professor of Bioethics at the University of Iowa, worries about the social worker, patient and family never actually meeting.\nLAURIS KALDJIAN: Because if you don't have enough knowledge about what's actually going on with a patient, it would actually be irresponsible to pretend to have a discussion that depends upon such knowledge.\nGORDON: End-of-life decisions are hard to keep totally neutral, he says. So that's why he'd want full transparency from insurers and the company, to guard against bias. Others in the medical field welcome the concept. Dr. Bob Arnold is with the University of Pittsburgh Medical Center.\nBOB ARNOLD: I know that there are a number of very good companies out there trying to do this and so this is better than what patients have currently been getting.\nGORDON: Arnold says it's unfortunate that doctors often have trouble discussing these important topics. More training would help. Daitz, with Vital Decisions, says he looks forward to the day when these conversations are taking place and his company is no longer needed.\nFor NPR News, I'm Elana Gordon in Philadelphia.\nINSKEEP: That story is part of a partnership with NPR News, WHYY and Kaiser Health News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=339861118"}
