{"authors":[],"date_download":"2018-10-22 21:29:23","date_modify":"2018-10-22 21:29:23","date_publish":"2014-05-07 14:35:31","description":"A full-length movie about Ernest Hemingway,with a Hollywood director and actors, was recently filmed in Cuba. It's the first since 1959.","filename":"data/vaneerConsumption/HemingwayMovieARareHollywoodMomentinCuba.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/426266/140507-hemingway-papa-havana-1055_5e810da0a4503091e26ac1862b0ededa.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_hemingway-movie-rare-hollywood-moment-cuba-n99241_1540243763.html","title":"Hemingway Movie: A Rare Hollywood Moment in Cuba","title_page":" Hemingway Movie: A Rare Hollywood Moment in Cuba ","title_rss":"NULL","source_domain":"nbcnews.com","text":"In Cuba, a joint Canadian-Cuban-American production recently wrapped up filming \"Papa,\" a biopic about the budding friendship between acclaimed American writer Ernest Hemingway and a reporter in Cuba during the 1950s.\nHemingway, famous for many books including \"The Old Man and the Sea,\" which he wrote in Cuba, lived in the island from 1939 to 1960 and is a beloved figure there.\n\"It was an absolute passion to actually make it in Cuba where everything that is in the script happened,\" said the movie's director, Bob Yari. Shooting began in March with the island's governmental film institute known as ICAIC providing location support, period costumes and local actors.\n\"Papa\" came to Cuba under a U.S. Treasury Department license exempting it from most embargo restrictions. The film's makers said there was a cap on how much they could spend, but would not say how much or release overall budget figures.\nProducers say it is the first full-length film with a Hollywood director and actors shot in Cuba since the 1959 revolution.\nAs a documentary, the film accessed Havana's most iconic locales, including the former Government Palace, now a museum celebrating Castro's revolution, the majestic Grand Theater and even Hemingway's former estate, Finca Vigia, which is closed to tourists.\n--The Associated Press","url":"https://www.nbcnews.com/news/latino/hemingway-movie-rare-hollywood-moment-cuba-n99241"}
