{"authors":["Associated Press"],"date_download":"2018-10-22 23:24:22","date_modify":"2018-10-22 23:24:22","date_publish":"2017-04-26 07:20:26","description":"PITTSBURGH (AP) - Kyle Hendricks rediscovered his 2016 form, limiting the Pittsburgh Pirates to four hits over six innings to outduel Gerrit Cole and lead...","filename":"data/vaneerConsumption/HendricksliftsCubsTurnerhitscycle.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/07/wire-463605-1493187630-611_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446492_Hendricks-lifts-Cubs-Turner-hits-cycle_1540250662.html","title":"Hendricks lifts Cubs, Turner hits cycle","title_page":"Hendricks lifts Cubs, Turner hits cycle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PITTSBURGH (AP) - Kyle Hendricks rediscovered his 2016 form, limiting the Pittsburgh Pirates to four hits over six innings to outduel Gerrit Cole and lead the Chicago Cubs to a 1-0 win in Major League Baseball on Tuesday night.\nHendricks (2-1) struck out two and walked three, and Wade Davis worked a perfect ninth for his fifth save as the Cubs won for the sixth time in seven games.\nAddison Russell doubled in the second off Cole (1-3) and scored when second baseman Alen Hanson airmailed first base on a Jason Heyward grounder, the Pirates' major league-high 20th error this season. Pittsburgh has lost six of eight.\nChicago Cubs starting pitcher Kyle Hendricks delivers during the first inning of the team's baseball game against the Pittsburgh Pirates in Pittsburgh, Tuesday, April 25, 2017. (AP Photo/Gene J. Puskar)\nNATIONALS 15, ROCKIES 12\nDENVER (AP) - Trea Turner hit for the third cycle in Nationals history and drove in a career-high seven runs, helping Washington to a win over Colorado on a frigid night.\nTurner - with a red ski mask covering his face - had a single in the first, a two-run double in the second, a two-run homer in the sixth and a bases-loaded triple in the seventh. It was the first cycle by the Nationals since Cristian Guzman on Aug. 28, 2008.\nTurner's seven RBIs are tied for second-most in a single game in Nationals history. Daniel Murphy also had a big night, tying a career best by driving in five runs.\nEnny Romero (2-1) earned the win by pitching 1 1/3 scoreless innings a night after taking the loss.\nGerman Marquez (0-1) was roughed up in his first start of the season\nASTROS 4, INDIANS 2\nCLEVELAND (AP) - Dallas Keuchel (4-0) pitched a six-hitter, allowing home runs to Austin Jackson in the third and Michael Brantley in the ninth that raised his ERA to 1.22.\nJosh Reddick gave Houston a 3-1 lead with a two-run single in the fifth. Josh Tomlin (1-3), then took a home run away from Jason Kipnis with a leaping catch at the center-field fence in the bottom half.\nHouston is 10-2 since April 11 and leads the AL West at 14-6.\nAstros second baseman Jose Altuve and outfielder Teoscar Hernandez collided in right while chasing Yan Gomes' eighth-inning popup, which dropped for a single. Altuve banged up his left shoulder and Hernandez bruised his left leg.\nRAYS 2, ORIOLES 0\nBALTIMORE (AP) - Austin Pruitt combined with four relievers on a two-hitter in his first big league start. Pruitt allowed one hit in three innings, Danny Farquhar got two outs, Jumbo Diaz went 1 1/3 innings, Chase Whitley (1-0) contributed three perfect innings and Alex Colome finished for his fifth save.\nJonathan Schoop had a second-inning double and Chris Davis a fourth-inning infield single.\nWade Miley (1-1) gave up four hits and six walks in seven innings. Tim Beckham hit an RBI single and Derek Norris added a run-scoring fly ball in the fourth, when Miley walked three.\nTIGERS 19, MARINERS 9\nDETROIT (AP) - James McCann, Justin Upton and Alex Avila homered for Detroit - and that was before the Tigers added nine runs in the fifth inning en route to this rout of the Seattle Mariners.\nFelix Hernandez (2-2) allowed four runs in two innings in his shortest outing since 2015, and Seattle's next two pitchers fared even worse. Detroit finished with 24 hits, 19 of which came in the first five innings. That was despite injuries that kept Miguel Cabrera, J.D. Martinez and Jose Iglesias out of the lineup.\nJordan Zimmermann (2-1) allowed five runs in six innings. Jean Segura, Danny Valencia and Nelson Cruz hit solo homers for Seattle, but that wasn't nearly enough to keep up with Detroit's offensive onslaught.\nMikie Mahtook added another home run for the Tigers in the eighth. Ian Kinsler had four hits and four runs before being lifted for a pinch hitter in the seventh.\nDODGERS 2, GIANTS 1\nSAN FRANCISCO (AP) - Clayton Kershaw struck out seven over seven innings in another impressive performance in San Francisco's home ballpark as Los Angeles ended a four-game losing streak against its rival.\nKershaw (4-1) allowed six hits and one run, walking one as he improved to 11-4 in 19 outings and 18 starts in San Francisco's waterfront ballpark.\nThe Dodgers, who were on the other end of a 2-1 result a night earlier, also ended a six-game skid at AT&T Park to avoid matching the franchise's longest winless stretch in San Francisco from April 21-Sept. 28, 2015.\nLefty Ty Blach (0-1) allowed two runs and four hits in five innings making his first start in place of injured Madison Bumgarner. The ace southpaw bruised his ribs and sprained the AC joint in his pitching shoulder in a dirt bike accident last Thursday during a day off in Colorado.\nANGELS 2, ATHLETICS 1, 11 INNINGS\nANAHEIM, California (AP) - Kole Calhoun ripped a two-out single in the 11th inning to score Danny Espinosa and send Los Angeles to a victory over Oakland.\nJesse Hahn pitched eight innings for Oakland and JC Ramirez went seven for Los Angeles as the game remained scoreless until Josh Phegley and Mike Trout hit solo homers in the 10th.\nRyan Madson (0-2) allowed singles to Espinosa and Calhoun in the 11th after Brooks Pounders (1-0) pitched a scoreless inning for the win.\nBLUE JAYS 6, CARDINALS 5, 11 INNINGS\nST. LOUIS (AP) - Chris Coghlan made an acrobatic, run-scoring leap over All-Star catcher Yadier Molina, and Marcus Stroman came across with the go-ahead run after pinch hitting in the 11th inning and doubling for his first major league hit in Toronto's win over St. Louis.\nWith the score 2-2, Coghlan walked in the seventh and sped around the bases on Kevin Pillar's triple in the right-field corner, which hit high off the fence over Stephen Piscotty and bounced back toward the infield.\nPiscotty's throw to the plate was slightly up the third-base line, and Molina leaned down to pick up the ball after its third hop. As Molina reached for the ball, the 31-year-old Coghan hurled himself over the catcher, somersaulted and landed on the plate with his helmet and left hand.\nJason Grilli (1-2) struck out the side in the 10th for Toronto and Ryan Tepera pitched the 11th for his first save.\nStroman scored on a throwing error by shortstop Aledmys Diaz. Miguel Socolovich (0-1) took the loss.\nBREWERS 9, REDS 1\nMILWAUKEE (AP) - Eric Thames hit his major league-leading 11th home run - his eighth against Cincinnati this season - as the Milwaukee Brewers cruised to victory over the Reds.\nIn his first season with the Brewers, Thames capped a five-run sixth with a two-run drive off reliever Robert Stephenson.\nZach Davies (2-2) allowed six hits in five scoreless innings, lowering his ERA from 8.24 to 6.57. He stranded a pair of runners in three innings.\nOliver Drake pitched a hitless sixth and Tommy Milone allowed two hits over three innings, including Adam Duvall's eighth-inning homer, for his second big league save, his first since August 2015.\nScott Feldman (1-2) gave up four runs, five hits and five walks in five innings.\nDIAMONDBACKS 9, PADRES 3\nPHOENIX (AP) - Paul Goldschmidt drove in three runs to match a team record with his fourth straight multi-RBI game and Patrick Corbin struck out nine in seven innings as Arizona rolled over San Diego.\nThe Diamondbacks jumped on Clayton Richard (2-3) early and kept hitting to match the 2008 team for the franchise's best home start at 10-2.\nCorbin (2-3) allowed two runs and eight hits, including a solo homer by Jabari Blash in the seventh inning.\nTWINS 8, RANGERS 1\nARLINGTON, Texas (AP) - Ervin Santana delivered his fourth straight outstanding start, Miguel Sano sparked a seven-run fifth inning with a leadoff homer and Minnesota pounded Texas.\nSantana (4-0) allowed a run, four hits and one walk with six strikeouts in seven innings.\nBoth homers came off Andrew Cashner (0-2), who labored through his four-plus innings. He matched a career high with six walks, allowed five hits, had a wild pitch and threw 92 pitches.\nWHITE SOX 10, ROYALS 5\nCHICAGO (AP) - Todd Frazier drove in three runs, Leury Garcia had three hits and Chicago got its second straight one-sided win over Kansas City.\nKansas City is 0-6 on a seven-game trip, its longest skid since losing eight consecutive games last June. Last in the AL Central at 7-13, the Royals are off to their worst 20-game start since opening 6-14 in 2012, when they finished 72-90.\nFrazier's sacrifice fly tied the score in the third inning, and Chicago took a 4-2 lead in the fourth against Danny Duffy (2-1) when Omar Narvaez and Garcia hit consecutive doubles, and Tim Anderson followed with an RBI single.\nDan Jennings (2-0) retired all five batters he faced to win in relief.\nPittsburgh Pirates starting pitcher Gerrit Cole delivers during the seventh inning of the team's baseball game against the Chicago Cubs in Pittsburgh, Tuesday, April 25, 2017. The Cubs won 1-0. (AP Photo/Gene J. Puskar)\nChicago Cubs shortstop Addison Russell, left, applies the tag on Pittsburgh Pirates' Josh Harrison, who was caught attempting to steal second during the third inning of a baseball game in Pittsburgh, Tuesday, April 25, 2017. The Cubs won 1-0. (AP Photo/Gene J. Puskar)\nChicago Cubs relief pitcher Koji Uehara celebrates in the dugout after pitching the seventh inning of the team's baseball game against the Pittsburgh Pirates in Pittsburgh, Tuesday, April 25, 2017. The Cubs won 1-0. (AP Photo/Gene J. Puskar)\nWashington Nationals' Trea Turner watches his three-run triple Colorado Rockies relief pitcher Scott Oberg during the seventh inning of a baseball game Tuesday, April 25, 2017, in Denver. Washington won 15-12. (AP Photo/David Zalubowski)\nWashington Nationals third base coach Bob Henley, left, congratulates Trea Turner, who circles the bases after hitting a two-run home run off Colorado Rockies relief pitcher Jordan Lyles during the sixth inning of a baseball game Tuesday, April 25, 2017, in Denver. Washington won 15-12. (AP Photo/David Zalubowski)\nHouston Astros starting pitcher Dallas Keuchel (60) is congratulated by catcher Brian McCann (16) after the Astros defeated the Cleveland Indians 4-2 in a baseball game, Tuesday, April 25, 2017, in Cleveland. (AP Photo/Tony Dejak)\nHouston Astros' Josh Reddick reaches for a ball hit by Cleveland Indians' Jason Kipnis in the fifth inning of a baseball game, Tuesday, April 25, 2017, in Cleveland. Kipnis was out on the play. (AP Photo/Tony Dejak)\nHouston Astros' Norichika Aoki watches his ball after hitting a one-run double off Cleveland Indians starting pitcher Josh Tomlin in the fifth inning of a baseball game, Tuesday, April 25, 2017, in Cleveland. Yuli Gurriel scored on the play. (AP Photo/Tony Dejak)\nTampa Bay Rays' Derek Norris hits a sacrifice fly during the fourth inning of the team's baseball game against the Baltimore Orioles in Baltimore, Tuesday, April 25, 2017. Logan Morrison scored on the play. (AP Photo/Patrick Semansky)","url":"https://www.dailymail.co.uk/wires/ap/article-4446492/Hendricks-lifts-Cubs-Turner-hits-cycle.html"}
