{"authors":[],"date_download":"2018-10-30 20:37:50","date_modify":"2018-10-30 20:37:50","date_publish":"2014-08-28 00:42:24","description":"A Henry County sheriff’s deputy was arrested in DeKalb County and stands accused of attempting to arrange a sexual encounter with a 14-year-old.","filename":"data/vaneerConsumption/Henrysheriffscaptainarrestedforarrangingtryst.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/08/28/Images/photos.medleyphoto.5988679.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_police-henry-sheriff-c_aca0caf4934c63510fa4cb1bccf083d8__1540931870.html","title":"Henry sheriff’s captain arrested for arranging tryst...","title_page":"Police: Henry sheriff’s captain arrested for arranging tryst...","title_rss":"NULL","source_domain":"ajc.com","text":"A Henry County sheriff’s deputy was arrested in DeKalb County and stands accused of attempting to arrange a sexual encounter with a 14-year-old.\nCapt. David McCart of the Henry County Sheriff’s Office was arrested Tuesday after a two-month investigation, according to Channel 2 Action News.\nDeKalb investigators told Channel 2 that McCart met the boy online through social media. The two allegedly talked about different sexual activities and agreed to meet, according to the television report.\n“We were doing a cross-country operation with the FBI and during that time we came into contact with an individual later identified as Captain McCart,” DeKalb County police Sgt. Torrey Kennedy told Channel 2. “Mr. McCart was on a social media website chatting with who he believed was an underage child. During that chat, they had a sexual, explicit conversation in which they agreed to meet for sex.”\nThe conversation moved to texting as McCart allegedly planned to meet the child. Once they agreed on a time and place, McCart showed up at the mall, where he was met by police, according to the report.\nThe investigation into McCart’s activities continues, as police determine whether he had contact with other children.","url":"https://www.ajc.com/news/police-henry-sheriff-captain-arrested-for-arranging-tryst-with-child/LNn03qGdMxEeh4ZgrsnX5O/"}
