{"authors":[],"date_download":"2018-10-30 20:14:50","date_modify":"2018-10-30 20:14:50","date_publish":"2016-03-18 01:48:54","description":"A former bodybuilder says he is suing a group of cops for forcing him to become a snitch. Former bodybuilder Jonathan Hom told Channel 2 Action News on Thursday that he is suing officers attached to a Henry County drug squad for forcing him to work as a drug informant.","filename":"data/vaneerConsumption/HenryCountymansuesdrugsquadcopshesaysforcedhimto.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_henry-county-man_8616c72a159dd450874f9d1dae9dc11a__1540930490.html","title":"Henry County man sues drug squad cops he says forced him to...","title_page":"Henry County man sues drug squad cops he says forced him to...","title_rss":"NULL","source_domain":"ajc.com","text":"A former bodybuilder says he is suing a group of cops for forcing him to become a snitch.\nFormer bodybuilder Jonathan Hom told Channel 2 Action News on Thursday that he is suing officers attached to a Henry County drug squad for forcing him to work as a drug informant.\nTen years ago, Hom said he served 60 days in jail with 10 years on probation for charges related to steroid abuse.\nHom alleges that after he was released, he was strong-armed by the members of the Flint Circuit Drug Task Force into signing an agreement to be a drug informant, according to Channel 2.\nHom told the news station that officers searched his home in March 2014 and found Adderall, Valium and Ambien.\n“They told me I had two options: you can go to jail tonight, or you can work for us,” Hom told the station, even though he had prescriptions. “They have the power to do what they want.”\nHom, his attorney, Lee Sexton, and former Superior Court judge Michael Clark, have filed a federal lawsuit against four officers.\n“I don’t want to be harassed anymore,” Hom said.\nThe lawsuit alleges the drug task force officers pressured Hom and his eight-month pregnant wife until he said “Yes,” and never informed his probation officer they were trying to send him back into the drug world as an informant.\nHowever, acting as an informant while on probation has stringent requirements, such as notifying Hom’s probation officer, gaining permission from the probation officer’s supervisor and a judge, said Michael Nail, commissioner of the Department of Community Supervision.\nNail said none of the requirements have been met.\nThe commander over the Flint Circuit Drug Task Force said three of the officers named in the suit are good officers with no previous complaints that he knows of.","url":"https://www.ajc.com/news/local/henry-county-man-sues-drug-squad-cops-says-forced-him-snitch/VX5if0kYGSsfTe8YKOiXlL/"}
