{"authors":[],"date_download":"2018-10-30 01:21:27","date_modify":"2018-10-30 01:21:27","date_publish":"2015-10-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HenryKissingerIsnuclearcatastropheinevitable.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_10_henry_kissinger_is_nuclear_catastrophe_inevitable_1540862487.html","title":"Henry Kissinger: Is nuclear catastrophe inevitable?","title_page":"Henry Kissinger: Is nuclear catastrophe inevitable?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Today that article is being carefully analyzed all over the world.\nHenry Kissinger, who is still (to my mind) the wisest foreign policy analyst in the land, just wrote a Wall Street Journal piece called \"A path out of Middle East Collapse.\"\nKissinger’s most crucial point: \"If nuclear weapons become established (in the Middle East), a catastrophic outcome is nearly inevitable.\"\nWell, Obama and Europe have just handed the nuclear key to Iran, and Saudi Arabia is shopping for its own. Pakistan is selling. Are we in \"inevitable catastrophe\" territory yet?\nOur delusional liberals have been whistling past that graveyard to protect Obama. But the next president won't have that option. Putin just said that \"some American politicians have mush for brains,\" and that isn't just braggadocio.\nDr. K starts with the disastrous collapse of the power balance in the Middle East. And because he writes in long, thought-provoking sentences, it's worth focusing on some of his high points.\n1. \"With Russia in Syria, a geopolitical structure that has lasted four decades is in shambles.\"\n2. Four Arab states have ceased to function: Libya, Syria, Iraq, and Yemen. All are at risk of being taken over by ISIS, which aims to become a global caliphate governed under shariah law.\n3. The U.S. and the West need a coherent strategy. We don't have one now.\n4. Treating Iran as a normal power is wishful thinking. It could happen over time. But today, Iran \"is taking on an Armageddon dimension.\"\nIsrael is in the maelstrom, but so is the rest of the world, which is why Russia is making an unprecedented military intervention in Syria. Putin is protecting Russia first of all.\n5. \"So long as ISIS survives and remains in control of a geographically defined territory, it will compound Middle East tensions... The destruction of ISIS is more urgent than the overthrow of Bashar Assad.\"\n6. \"The US has already acquiesced in a Russian military role.\" (Vladimir Putin has suggested a new Russo-Western alliance, on the World War II model.)\nGiven the general failure of political will in the West, combined with Putin's strategic clarity, a practical alliance could work.\nDr. Kissinger didn’t say it, but Putin has been watching jihadist forces on his southern border come closer and closer to nuclear weapons. Putin rose to the top by fighting jihadist Chechens, in Russia's usual merciless fashion. Today, thousands of Chechens have joined ISIS in Iraq and Syria, and may go back to fight in Russia and China.\nImagine thousands of suicidal fanatics on our southern border, and you get the picture as seen from Moscow.\nBottom line: To avoid the \"catastrophe\" of a hot nuclear arms race in the Middle East, a practical alliance of the West with Russia might save the world.","url":"https://www.americanthinker.com/blog/2015/10/henry_kissinger_is_nuclear_catastrophe_inevitable.html"}
