{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-22 23:46:03","date_modify":"2018-10-22 23:46:03","date_publish":"2016-01-28 13:03:10","description":"Henri Leconte yelled at a number of spectators when they tried to leave the Rod Laver Arena in Melbourne and even forced a linesman to play in his place when he got a call wrong.","filename":"data/vaneerConsumption/HenriLecontemakesinappropriatejokesoncourtattheAustralianOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB045600000578-0-image-a-29_1453992880149.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420909_Henri-Leconte-entertains-crowd-Australian-Open_1540251963.html","title":"Henri Leconte makes inappropriate jokes on court at the Australian Open","title_page":"Henri Leconte makes inappropriate jokes on court at the Australian Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is known as one of the biggest clowns in the history of tennis.\nAnd Henri Leconte did not disappoint in his Australian Open exhibition match as he had the crowd - and his opponents - in stitches with his inappropriate jokes and strange animal noises.\nThe Frenchman, 52, yelled at a number of spectators when they tried to leave the Rod Laver Arena in Melbourne and even forced a linesman to play in his place when he got a call wrong.\nWhile making fun of his doubles opponent Todd Woodbridge's serve, he screamed 'concentrate' before baaing like a lamb to put him off.\nHenri Leconte had the crowd - and his opponents - in stitches with his inappropriate jokes and strange animal noises in his Australian Open exhibition doubles match\nThe tennis legend forced a linesman (pictured) to play in his place when he got a call wrong\nThe tennis legend, who reached the French Open singles final in 1988, was then heard yelling 'I have no underwear', much to the delight of the crowd.\nHe later called out two women who were trying to quietly sneak out of his mixed Fast4 match with Arantxa Sánchez Vicario against Woodbridge and Kim Clijsters.\n'Darling where are you going? Not finished yet', he cried, much to the delight of the other spectators.\nThe women promptly returned to their seats, laughing along with the commentator's antics.\nThe crowd later erupted when Leconte encouraged a linesman to take his place on the court and handed over his racquet.\nHe was heard telling the reluctant linesman to 'watch the ball' after he missed his first return against Woodbridge.\nHe later called out two women who were trying to quietly sneak out of his mixed Fast4 match\nThe tennis legend was heard yelling 'I have no underwear', much to the delight of the crowd\nLeconte had both the crowd and his opponents - including Kim Clijsters (pictured) - in stitches\nBut Leconte then looked noticeably impressed when the left-handed linesman hit a few good shots and the tennis champion gave him a high-five him after the rally.\nHis antics prompted a hilarious response on social media, with hundreds saying he was the highlight of the tournament.\nVictoria Zhou ‏said: 'HAHAHA only Henri Leconte would force a linesman to play tennis in his place #legendsdoubles.'\nApurv Nagpal ‏tweeted: '#HenriLeconte just made the linesman, who got a call wrong, play in his place ! #AusOpen.'\nThe crowd later erupted when he encouraged a linesman to take his place on the court and handed over his racquet\nLeconte then looked noticeably impressed when the left-handed linesman hit a few good shots and the tennis champion gave him a high-five him after the rally\nWhile making fun of his doubles opponent Todd Woodbridge's serve (pictured), he screamed 'concentrate' before baaing like a lamb to put him off\nMichael KoziolVerified said: 'Henri Leconte is forcing a linesman to play tennis for him, this is too good.'\nLeconte also delighted the crowd with his impressions of Rafael Nadal and Maria Sharapova during the match which he went on to lose in two sets.\nJake Bozinovski ‏tweeted: 'Maria Sharapova is going to love you tonight Henri Leconte! #AusOpen #7Tennis'\nAnuradha Santhanam said: 'Henri Leconte's @MariaSharapova impression is the most accurate one I've seen in the last decade. #AusOpen'","url":"https://www.dailymail.co.uk/news/article-3420909/Henri-Leconte-entertains-crowd-Australian-Open.html"}
