{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:45:08","date_modify":"2018-10-30 18:45:08","date_publish":"2015-07-08 17:12:25","description":"In a partnership with STX Entertainment, The Jim Henson Company is currently developing an adult-themed black comedy puppet film, of which the plot will center on a bizarre murder mystery. |","filename":"data/vaneerConsumption/HensonCompanyDevelopingRRatedPuppetMurderMovie.json","image_url":"https://media.breitbart.com/media/2015/07/muppets-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_08__1540925108.html","title":"Henson Company Developing R-Rated Puppet Murder Movie","title_page":"Henson Company Developing R-Rated Puppet Murder Movie | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a partnership with STX Entertainment, The Jim Henson Company is currently developing an adult-themed black comedy puppet film, of which the plot will center on a bizarre murder mystery.\nAccording to the Hollywood Reporter, Brian Henson, the son of late puppeteer Jim Henson, first began work on the script for an R-rated puppet project inspired by the work of his father in 2008, but after running into casting problems while working with Lionsgate in 2010, the project was shelved.\nOriginally titled The Happytime Murders, the now untitled project is moving forward again, and will take place in “a world where humans and puppets coexist, with the puppets viewed as second-class citizens.”\nTHR reports the story will follow the puppet cast of a fictional 1980s children’s TV show, (The Happytime Gang) as cast members are murdered off one at a time. To find the killer, a disgraced alcoholic former LAPD detective puppet, now working a private detective, is forced to work with his former human partner.\nProject creators reportedly envision the story to carry a tone of Avenue Q meets L.A. Confidential.\nBrian Henson will direct the film, which was written by Todd Berger & Dee Robertson, and has now been revised by Erich and Jon Hoeber\nHenson told Deadline Tuesday the project will “take puppets to a place where we have never gone before on the big screen.”\nHe also thanked STX for showing the “daring confidence to get behind this project.”","url":"https://www.breitbart.com/entertainment/2015/07/08/henson-company-developing-r-rated-puppet-murder-movie/"}
