{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 20:49:11","date_modify":"2018-10-30 20:49:11","date_publish":"2016-12-27 00:00:00","description":"The most common cause of flight delays probably isn't what you'd expect.","filename":"data/vaneerConsumption/Herearethe3mostcommonreasonswhyyourflightisdelayed.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_why-your-flight-delayed-2016-12_1540932551.html","title":"Here are the 3 most common reasons why your flight is delayed","title_page":"    The main reasons for delayed flights according to the US government - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"AP There are few things as irritating as a delayed flight. No one wants his or her travels plans thrown into complete disarray. But unfortunately, this happens quite often.\nAccording to the U.S Bureau of Transportation Statistics, more than 1 million flights were delayed between June 2015 and June 2016. This translates to nearly 64 million minutes worth of delays.\nOuch.\nBut a closer look at the BTS data shows that the three main causes for delay are backups within the US aviation system, weather, and airline related issues.\n(A flight is considered delayed if it's more than 15 minutes later than scheduled. )\nAccording to the BTS, about 50% of all tardy flights between June of 2015 and June 2016 are attributed to circumstances within the airline's control such as aircraft maintenance, crew scheduling, refueling etc. This includes the nearly 210,000 flights there were delayed during this period due to late arriving inbound flights caused by airline-related issues.\nBureau of Transportation Statistics At the same time, 30% of the delays can be blamed directly on weather. According to the BTS, this includes roughly half of the flights delayed due to the US aviation system, as well as 33% of delays due to late arriving inbound aircraft.\nFinally, about 15% of the delays are caused by broad issues within the US aviation network. According to the BTS, this means problems with air traffic control, airport operations, and heavy traffic volume.\nAs bad as delayed flights may be, they don't happen as often as one would expect once you consider America's aging aviation infrastructure coupled with surging demand for air travel and unpredictable weather. Even with these issues, 81.5% of flights did arrive on time. That's up from the 79.7% on-time arrival rate in 2003-2004, when the BTS first began publishing this data.","url":"https://www.businessinsider.com/why-your-flight-delayed-2016-12"}
