{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 23:45:49","date_modify":"2018-10-30 23:45:49","date_publish":"2018-07-17 00:00:00","description":"San Francisco's housing market is now commonly referred to as being in a \"crisis.\" The San Francisco Planning Commission examines the situation in a new 88-page report.","filename":"data/vaneerConsumption/HereshowSanFranciscoshousingmarkettookaturntowardcrisis.json","image_url":"https://amp.businessinsider.com/images/5b4ce1c85ea10819008b4b73-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_san-francisco-housing-market-is-now-commonly-seen-as-being-in-crisis-2018-7_1540943149.html","title":"Here's how San Francisco's housing market took a turn toward crisis","title_page":"    San Francisco housing market is now commonly seen as being in crisis - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"People stop to look at San Francisco's famed Painted Ladies victorian houses on February 18, 2014 in San Francisco, California. According to a report by mortgage resource site HSH.com, an annual salary of $115,510 is needed to purchase a house in San Francisco where the median home price is $682,410. The report included 25 of the nations largest metropolitan cities with Cleveland, Ohio being the cheapest with a needed salary of $19,435 to purchase a home. Justin Sullivan/Getty\nIt's called \"Housing Crisis\" for a reason.\nWhen we discuss the insane San Francisco housing market, it's usually in terms of median asking rents ($4,680 a month for a 2-bedroom), the median single-family house price ($1.7 million), the median condo price ($1.2 million), or the Case-Shiller Home Price Index's 11% year-over-year surge. As different as the data may be, all of the data agrees: San Francisco is a horrendously expensive place to live. But beneath the summary data hides the complexity of a housing market that is now commonly called the \"San Francisco Housing Crisis.\"\nSo for the first time, and to get a better grip on the issues, the SF Planning Commission has prepared a \"Housing Needs and Trends Report,\" or HNTR (12-page executive summary; 88-page full report). The report \"represents more than a year's worth of effort by both Planning staff and consultants to gather and analyze data,\" it says. So here are some Key findings:\nSan Francisco is a city of renters:\n65% of the homes are renter occupied; only 35% of the homes are owner occupied.\nOver 60% of all rental units are in \"rent controlled\" buildings. In SF, rent control only applies to older multi-family buildings. It does not apply to buildings completed after June 13, 1979, and it does not apply to condos and single-family homes that are rented out. In other words, none of the newer housing stock is rent-controlled. Rent control in SF means that when the unit comes on the market, it is rented out at market rent, but annual rent increases from that point on are limited based on a measure of inflation.\nEven rent-controlled units are becoming less affordable: of the 160,000 rent-controlled units in 2015, about 100,000 units were rented at rates that would be affordable to households earning less than 80% of the Area Median Income (AMI), down from 140,000 in 1990.\nA household of two that earns less than 80% of AMI, according to the Mayor's Office of Housing and Community Development, currently makes $75,750 or less a year.\nThe Planning Commission's report pointed out:\nUnits rented in the previous 2 years, show the erosion of affordability of the city's rent-controlled stock. Whereas in 1990 a substantial majority of all recently rented rent-controlled units were rented at rates affordable to lower income households, by 2015, only 10,000 such available units were affordable to those households.\n9% of households live in about 33,000 affordable housing units, where rents and sale prices are set so that they're deemed to be affordable at low and moderate-income levels by SF standards.\nSan Francisco's growing density:\nBuildings with more than 5 units account for 52% of the city's housing units but occupy only 19% of its land area.\nSingle-family homes account for 27% of the housing units but occupy 62% of its land area.\nAnd home price increases have far outrun inflation (CPI):\nWolf Street\nNot lack of supply, but lack of affordable supply:\nIn 2017, thanks to the construction boom, new construction created about 4,500 new housing units; in 2016, new construction created over 5,000 new housing units; this is way more than double the historical average since 1990 of 1,900 units per year. Practically of them were multi-family buildings.\nBut of those units built since 1990, 28% are deemed to have been \"affordable to low and moderate-income households.\"\nCost has an impact on who lives in San Francisco\nHigh costs attract high-income households; lower-income households are leaving:\nThe number of households earning more than 120% of AMI (for a household of 2 = $113,650) tripled since 1990. And of them, 82% are now high-income households earning 200% or more of AMI (for a household of 2 = $189,400).\nThe number of \"low and moderate-income\" households earning less than 120% of AMI (for household of 2 = less than $113,650) dropped more in San Francisco than in the region. \"This change may be due to households increasing their earnings or it may be because more of these households have left the city, or a combination of both.\"\nThe number of workers who work and live in SF has reached an all-time high of nearly 500,000.\nThe majority of the increase in workers in SF has been driven by workers earning more than $100,000 per year - individual workers, not households. \"However, workers\" - not households - \"earning less than $75,000 continue to be the majority of workers in San Francisco.\"\nBut with two of those $75,000-a-year earners into one households, the household makes $150,000.\nThe number of high-income workers earning 200% or more of AMI has surged by 240% since 1990 with over half of that increase coming since 2000. At the same time, workers earning less than 120% of AMI - an individual worker making less than $99,500 - are leaving. In the chart below, note the increase of workers making 30% of AMI ($24,850). Would that be students? (Click to enlarge).\nWolf Street\nThe report finds that \"housing cost burden has increased for renters and owners of all income groups, but very low-income households [less than 50% of AMI, or less than $47,350 for a household of 2] experienced large increases in severe cost burden since 1990. Above-moderate income households now face rent burden, which they did not in 1990.\"\nHouseholds earning less than 50% of AMI ($47,350 for a household of 2) face a situation where housing costs consume 50% or more of income.\nThe way people make do in SF is by living together:\n\"San Francisco exceeded the region in the rate of growth for couple households (without children or other family members) and roommate households,\" the report said. \"These households are also more likely to be higher income as they are able to combine incomes from multiple working household members.\"\nThis is why San Francisco is a place where people with relatively high incomes can feel squeezed. Earning less than 120% of AMI for an individual worker, thus earning less than $91,200 a year.","url":"https://www.businessinsider.com/san-francisco-housing-market-is-now-commonly-seen-as-being-in-crisis-2018-7"}
