{"authors":[],"date_download":"2018-10-30 14:32:54","date_modify":"2018-10-30 14:32:54","date_publish":"2016-08-12 14:22:47","description":"It's easy to get caught up in the decadent menus Pinterest as to offer, especially when every gooey, cheesy, or chocolatey recipe has a...","filename":"data/vaneerConsumption/HerearesomeofthemostpinnedsaladrecipesonPinterest.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AccessAtlanta/2016/06/27/Images/photos.medleyphoto.10293469.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_health_these-are_b643d2bee81b5a03dd9ad00a2c26d917__1540909974.html","title":"Here are some of the most pinned salad recipes on Pinterest","title_page":"Here are some of the most pinned salad recipes on Pinterest","title_rss":"NULL","source_domain":"ajc.com","text":"It's easy to get caught up in the decadent menus Pinterest as to offer, especially when every gooey, cheesy, or chocolatey recipe has a drool-inducing photo to lure pinners in. But the virtual bulletin board has an enticing variety of salad receipes that have enough flavor to feel just as indulgent. Here are three of the top pinned salad recipes on Pinterest.\n>>RELATED: The questions you were too afraid to ask about healthy eating\nStrawberry Avocado Spinach Salad with Chicken\nVia foodiecrush.com\n\"The best foods are made from muscle memory,\" starts off Heidi Larsen, the mastermind behind bright food blog Foodie Crush. She says this spinach salad is a go-to lunch that she makes so often she almost assembles the dish robotically, and with creamy avocado, sweet strawberries, filling chicken and nutrient-rich spinach, it's easy to see why this well-rounded dish has made its way into the regular rotation (and been pinned over 100,000 times in the process).\nAsparagus, Tomato and Feta Salad with Balsamic Vinaigrette\nVia Cooking Classy\nCheese is a crowd-pleasing addition to any salad, and while some recipes go overboard on this calorie-heavy topping, pairing it with fresh tomatoes and asparagus keeps this spring salad light but not boring. The author praises this recipe for its short ingredient list and contrasting textures in every bite. Pinterest seems to agree — more than 113,000 pins later, this recipe still has legs.\nGarlicky Kale Salad with Crispy Chickpeas\nVia Minimalist Baker\nIf the title alone in this flavorful salad, pinned more that 100,000 times, doesn't at least garner a second look, it's time to expand your vegetable repertoire. It's base, kale, may be known for its bitterness, but few spices mask that divisive taste better than garlic. This blog holds many hearty recipes for vegetarian and vegan diets, but this dressing recipe will liven up just about any salad. Leftovers are sure to be snap, too: since kale has a tough consistency, dressed salads hold up in the fridge longer than those made of romaine or iceberg.","url":"https://www.ajc.com/lifestyles/health/these-are-some-the-most-pinned-salad-recipes-pinterest/3P1Kk6NErRuo4LQZrMXWCJ/"}
