{"authors":[],"date_download":"2018-10-30 18:56:54","date_modify":"2018-10-30 18:56:54","date_publish":"2016-07-20 21:00:10","description":"Have you ever wondered how much film and TV extras are paid? Here's the scoop:","filename":"data/vaneerConsumption/HereshowmuchfilmandTVextrasarepaidinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/31/Images/photos.medleyphoto.9236992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_get-the-scoop-what-film-and-extras-get-paid-atlanta__1540925814.html","title":"Here's how much film and TV extras are paid in Atlanta","title_page":"Here's how much film and TV extras are paid in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta TV and film industry continues to boom, which means there can be lots of opportunities to claim a spot as an extra. But have you ever wondered how much background actors are paid? Here's the scoop:\n>>8 ways to increase your chances of amking money as a film extra in Georgia\nWhat's a typical pay rate for extras in the Atlanta market?\n\"Rates vary a lot more than they did three or four years ago,\" said Jamie Lynn Catrett, owner/casting director of Catrett & Associates Casting. \"We are currently working on one show that pays $64 for eight hours and one that pays $130 for eight hours. Stand-ins normally make a standard $140 for 10 hours. It's really based on what producers have in the budget and how much they can pay.\"\nWhat's an average number of hours an extra will work?\n\"Usually 10 to 12,\" according to Cheryl Louden-Kubin, CSA, of Atlanta Casting, LLC. \"If they only have the location for one day, they stay until they've finished. Extras will get overtime, unless you're on a flat fee – which you should know up front.\"\nFor example, if you're being paid $64 for an eight-hour day, that's $8 per hour. If the day goes beyond eight hours you'll be paid time and a half, or $12 for every hour past eight. On a 12-hour day, you'd bring in $112 before taxes.\n\"Realize we work extremely long days, so you have to be completely free for an entire day and possibly night,\" Catrett added. \"You can't leave the set after we've started because of continuity, so make sure you're in it for the long haul on the days that you work. If you leave a set early without being wrapped, they'll call the casting company and ask that we not bring you back for their project.\"\nDoes it pay more to work as a extra for film or TV?\nCatrett and Louden-Kubin agreed that you'll be paid about the same whether it's a TV or film project.\n\"Commercials and promos actually pay backgrounds the most,\" Catrett said. \"Commercials are often picked by the casting director, producer, director, and client, so it's a much harder process to get onto a commercial or promo.\"","url":"https://www.ajc.com/business/get-the-scoop-what-film-and-extras-get-paid-atlanta/j2z6afOcul0AeXRNeKb3KM/"}
