{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:16:18","date_modify":"2018-10-30 22:16:18","date_publish":"2016-12-14 00:00:00","description":null,"filename":"data/vaneerConsumption/Hereshowfintechisupendingthreekeyrelationships.json","image_url":"https://amp.businessinsider.com/images/577d6c1d88e4a778008b6472-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_heres-how-fintech-is-upending-three-key-relationships-2016-12_1540937778.html","title":"Here's how fintech is upending three key relationships","title_page":"    Here's how fintech is upending three key relationships - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII When it comes to digital disruption, financial services are lagging behind compared to media, advertising, telecommunications, and leisure.\nThis is primarily due to increasingly complex regulations, particularly in the U.S., that have prevented fintechs from flourishing.\nAnd yet, certain fintech sectors, such as mobile payments, have skyrocketed in recent years. At the same time, global fintech investment took off to reach $33.7 billion in 2015.\nBut what does the future of fintech look like?\nFor the past seven years, IGNITION, Business Insider's flagship conference, has collected the best minds in media and technology to share what they see as the future. Through unscripted interviews, cutting-edge demos, and insights from industry pioneers, attendees learn what key trends to be aware of and what they need to do to stay ahead.\nAt this year's IGNITION, John Heggestuen, director of research for BI Intelligence, Business Insider's premium research service, presented How Fintech Is Upending 3 Key Relationships, which describes how new financial technology is disrupting relationships with consumers, regulators, and legacy players.\nTo get your copy of this FREE slide deck, simply click here.","url":"https://www.businessinsider.com/heres-how-fintech-is-upending-three-key-relationships-2016-12"}
