{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:00:43","date_modify":"2018-10-30 21:00:43","date_publish":"2016-12-22 00:00:00","description":"We all know Visa, MasterCard, and Amex, but as the credit card network industry gets more globalized, do you know who the key industry players are around the world?","filename":"data/vaneerConsumption/Herearethecreditcardnetworksyouneedtoknow.json","image_url":"https://amp.businessinsider.com/images/57d1851309d2931b008b69df-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_list-credit-card-networks-2016-11_1540933243.html","title":"Here are the credit card networks you need to know","title_page":"    List of Credit Card Networks (Market Share & Key Industry Players) - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"American Express and MasterCard credit cards are shown in Washington Thomson Reuters When it comes to credit card networks, almost everyone knows Visa, MasterCard, and American Express.\nBut the list of credit card networks extends well beyond those three heavyweights, as there are dozens of other companies around the world that each have a piece of the pie.\nBelow, we've outlined each of these companies, identified their credit card network market share, and explained what each brings to the table.\nVisa: Visa remains the king of the mountain in the card network industry. The company had 2.452 billion debit and credit cards in circulation in the 12-month period ended September 30, 2015 and processed $7.354 trillion in total volume.\nVisa remains the king of the mountain in the card network industry. The company had 2.452 billion debit and credit cards in circulation in the 12-month period ended September 30, 2015 and processed $7.354 trillion in total volume. MasterCard: MasterCard is no slouch, as it has secured the No. 2 spot among card networks. In the nine-month period ended September 30, 2016, MasterCard had issued 1.631 billion cards in its credit, debit, and charge program and had processed $3.591 trillion in gross dollar volume.\nMasterCard is no slouch, as it has secured the No. 2 spot among card networks. In the nine-month period ended September 30, 2016, MasterCard had issued 1.631 billion cards in its credit, debit, and charge program and had processed $3.591 trillion in gross dollar volume. American Express: American Express remains a force among its peer card networks even though it doesn't have the sheer numbers of Visa or MasterCard. The company had issued 117.8 million cards and processed $1.04 trillion in card billed business in 2015.\nAmerican Express remains a force among its peer card networks even though it doesn't have the sheer numbers of Visa or MasterCard. The company had issued 117.8 million cards and processed $1.04 trillion in card billed business in 2015. Discover: Discover remains in fourth place behind Visa, MasterCard, and Amex. The company processed $312.4 million in total network transaction volume in 2015 across 5.923 million transactions.\nDiscover remains in fourth place behind Visa, MasterCard, and Amex. The company processed $312.4 million in total network transaction volume in 2015 across 5.923 million transactions. UnionPay: UnionPay is the only interbank network in China that connects all of the ATMs of all banking companies throughout the world's most populous nation. Merchants in more than 141 countries accept UnionPay cards, which makes it the third largest payment network by value of transactions processed, behind only Visa and MasterCard.\nUnionPay is the only interbank network in China that connects all of the ATMs of all banking companies throughout the world's most populous nation. Merchants in more than 141 countries accept UnionPay cards, which makes it the third largest payment network by value of transactions processed, behind only Visa and MasterCard. JCB: Japan Credit Bureau operates primarily in Asia, but\nJapan Credit Bureau operates primarily in Asia, but Maestro: This international debit card service was founded in 1992, and MasterCard owns it. Approximately 15 million points of sale accept Maestro.\nThis international debit card service was founded in 1992, and MasterCard owns it. Approximately 15 million points of sale accept Maestro. Interlink: Interlink is the electronic funds transfer division of Visa and it operates primarily within the U.S. But unlike a standard Visa check card purchase, and Interlink purchase uses a PIN and can provide cash back from the merchant.\nInterlink is the electronic funds transfer division of Visa and it operates primarily within the U.S. But unlike a standard Visa check card purchase, and Interlink purchase uses a PIN and can provide cash back from the merchant. STAR: STAR was one of the first networks to focus on PIN debit, and First Data bought the company in 2003. The company prides itself on its innovation, such as the first processing of an envelope-less deposit at an ATM and the first real-time direct electronic check debit.\nSTAR was one of the first networks to focus on PIN debit, and First Data bought the company in 2003. The company prides itself on its innovation, such as the first processing of an envelope-less deposit at an ATM and the first real-time direct electronic check debit. SHAZAM: Shazam is a U.S. interbank network that operates primarily in the Midwest. The not=for-profit company provides electronic funds transfers to hundreds of financial institutions.\nShazam is a U.S. interbank network that operates primarily in the Midwest. The not=for-profit company provides electronic funds transfers to hundreds of financial institutions. NYCE: The New York Currency Exchange is an interbank network that now serves as the primary network for more than 300,000 ATMs and 89 million users in the U.S. and Canada.\nThe New York Currency Exchange is an interbank network that now serves as the primary network for more than 300,000 ATMs and 89 million users in the U.S. and Canada. Accel: The Accel interbank network links more than 400,000 ATMs throughout all 50 states, along with a few U.S. Air Force bases around the globe.\nThe Accel interbank network links more than 400,000 ATMs throughout all 50 states, along with a few U.S. Air Force bases around the globe. Plus: Plus covers all of Visa's credit, debit, and prepaid cards, along with a plethora of other ATM cards from other issuing banks. The network claims more than one million ATMs in more than 170 countries.\nPlus covers all of Visa's credit, debit, and prepaid cards, along with a plethora of other ATM cards from other issuing banks. The network claims more than one million ATMs in more than 170 countries. Interac: Interac is the primary Canadian debit card system and flourishes there because other traditional providers, such as Visa and MasterCard, hardly provide cards in the nation. As of 2010, Interac claimed 80 member organizations, 59,000 ATMs, and 450,000 merchants.\nInterac is the primary Canadian debit card system and flourishes there because other traditional providers, such as Visa and MasterCard, hardly provide cards in the nation. As of 2010, Interac claimed 80 member organizations, 59,000 ATMs, and 450,000 merchants. Visa ReadyLink: This service allows Visa cardholders to quickly add cash to their prepaid accounts. Retailers such as Safeway and 7-Eleven make ReadyLink available to customers.\nThis service allows Visa cardholders to quickly add cash to their prepaid accounts. Retailers such as Safeway and 7-Eleven make ReadyLink available to customers. Pulse: Discover owns Pulse, which operates an interbank network for more than 4,400 financial institutions and 380,000 ATMs in the U.S.","url":"https://www.businessinsider.com/list-credit-card-networks-2016-11"}
