{"authors":["Abc News","More Azure"],"date_download":"2018-10-30 00:53:00","date_modify":"2018-10-30 00:53:00","date_publish":"2018-10-28 13:55:37","description":"Before you begin your week have a look back at the top stories of the weekend.","filename":"data/vaneerConsumption/Heresthenewsyoumissedthisweekend.json","image_url":"https://s.abcnews.com/images/US/synagogue-8-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_news-missed-weekend_story_id=58809187_1540860780.html","title":"Here's the news you missed this weekend","title_page":"Here's the news you missed this weekend - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"A man allegedly stormed into a synagogue in Pittsburgh during a baby-naming service and opened fire, killing 11 people and injuring several others.\nABC News exclusively obtained surveillance video showing the man suspected of mailing explosive devices to Democrats, high-profile figures and CNN hours before he was arrested.\nThe third-largest Powerball jackpot in the game's history was won by ticket holders in Iowa and New York.\nOne Kansas Democrat is looking to turn the state blue in the upcoming midterm elections.\nAnd finally, a replica of the Titanic is scheduled to set sail in 2022.\nBefore you begin your week, have a look back at some of the top stories of the weekend.\nAndrew Caballero-Reynolds/AFP/Getty Images\nPittsburgh synagogue alleged mass shooter told SWAT officers he wanted 'all Jews to die': Officials\nRobert Gregory Bowers, the suspect in the shooting at the Tree of Life Synagogue, is believed to have acted alone when he allegedly opened fire Saturday morning during Shabbat services.\nEleven people are dead, including three women and eight men, and six others are injured.\nThe victims range in ages from 54 to 97, and no children were injured. In a shootout with SWAT officers, Bowers, 46, allegedly screamed that he wanted \"all Jews to die.\"\nUltra Gentlemens Club\nEXCLUSIVE: Surveillance video shows alleged mail bomber reading newspapers at strip club night before arrest\nNew video surveillance shows that mail bombing suspect Cesar Sayoc spent time at the Ultra Gentlemen's Club in West Palm Beach the day before he was arrested.\nSayoc has been arrested for allegedly sending at least 14 suspected explosive devices through the mail to prominent Democrats, including former President Barack Obama and former Secretary of State Hillary Clinton.\nSayoc was charged with five federal crimes, including the illegal mailing of explosives and assaulting current and former federal officers. He faces up to 48 years in prison if convicted.\nGoogle Maps\nWinners in New York, Iowa claim $687.8 million Powerball jackpot, third-largest in game history\nThe Powerball jackpot of $687.8 million will go to lucky ticket holders in Iowa and New York. The winning numbers were 8-12-13-19-27.\nThere were also winners in Texas and Florida, who took home smaller prizes.\nThe Powerball jackpot comes a few days after the Mega Millions drawing, a $1.5 billion prize won by a single ticket holder in South Carolina.\nCharlie Riedel/AP\nKansas Democrats seek to shed state’s ‘red rectangle’ reputation\nSharice Davids is running for Congress in Kansas' 3rd Congressional District. She is a Native American lesbian woman, Cornell Law School graduate, and a former professional mixed martial artist.\nKansas has two competitive congressional races for this year's midterm elections. \"I think that we're resetting expectations this year about who runs for office, about who we support as candidates,\" Davids said.\nTitanic II/Facebook\nTitanic II luxury vessel to set sail in 2022\nA replica of the Titanic that set sail -- and sunk -- in 1912, the Titanic II is scheduled to set sail in 2020.\nThe brain-child of Australian business Magnate Clive Palmer, the Titanic II will follow the path of its namesake, and also circumnavigate the globe.\nThe ship was recreated to honor the 100-year anniversary of the catastrophe that claimed 1,500 lives.","url":"https://abcnews.go.com/US/news-missed-weekend/story?id=58809187"}
