{"authors":["Jerome Hudson"],"date_download":"2018-10-30 19:51:53","date_modify":"2018-10-30 19:51:53","date_publish":"2016-12-02 21:09:36","description":"Thanks to Breitbart News' #DumpKelloggs petition, over 380,000 Americans have vowed to boycott Kellogg’s after the cereal company's decision to pull its advertising.","filename":"data/vaneerConsumption/HereAretheProductsYoullNeverNeedinYourShoppingCartAgain.json","image_url":"https://media.breitbart.com/media/2016/12/DumpKelloggs-Infograph.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_02__1540929113.html","title":"Here Are the Products You'll Never Need in Your Shopping Cart Again","title_page":"#DumpKelloggs: Here Are the Products You'll Never Need in Your Shopping Cart Again","title_rss":"NULL","source_domain":"breitbart.com","text":"Thanks to Breitbart News’ #DumpKelloggs petition, over 380,000 Americans, many of whom voted for President-elect Donald Trump, have vowed to boycott Kellogg’s after the cereal company’s decision to pull its advertising.\nAfter left-wing advocacy groups launched a social media campaign to coerce companies away from advertising on Breitbart, Kellogg’s publicly announced they would comply with their demands — and made the vague claim that Breitbart and its tens of millions of readers “aren’t aligned with” the cereal maker’s “values as a company.”\nIndeed, our research has shown Kellogg’s values would not “align” with most Americans. Their namesake nonprofit organization W.K. Kellogg Foundation has deep financial ties to far-left billionaire George Soros and has donated nearly a million dollars to anti-police group Black Lives Matter.\nUnderstandably, more than 370,000 individuals have vowed that when they buy groceries, they won’t hand their hard-earned dollars over to a company at ease with placating radical left-wing agitators just because they’re making a little noise.\nKellogg’s manufactures myriad products under several brand names, from Pringles to Eggo waffles, as well as Special K and Frosted Flakes cereals and many more.\nAs more Americans joined the #DumpKelloggs campaign, it’s worth listing all the Kelloggs brands you won’t find in Trump voters’ shopping carts.\nKellogg’s Frosted Flakes®\nKellogg’s® Nutri-Grain®\nPop-Tarts®\nRice Krispies®\nCheez-It\nKashi\nEggo®\nFrosted Mini-Wheats®\nCocoa Krispies\nMorningstar Farms\nFamous Amos\nKellogg’s Corn Flakes®\nKellogg’s Honey Smacks® cereal\nCorn Pops®\nMother’s Cookies\nKeebler Company\nSmart Start®\nFroot Loops™\nKellogg’s Raisin Bran®\nLow Fat Granola\nFruit Flavored Snacks\nApple Jacks®\nCracklin’ Oat Bran®\nMueslix®\nSmart Start®\nSmorz\nKellogg’s Raisin Bran®\nKrave\nCrispix®\nAll-Bran®\nApple Jacks®\nCrunchmania\nSign the #DumpKelloggs boycott petition here.\nFollow Jerome Hudson on Twitter @jeromeehudson","url":"https://www.breitbart.com/politics/2016/12/02/dumpkelloggs-here-are-the-products-youll-never-need-in-your-shopping-cart-again/"}
