{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:40:11","date_modify":"2018-10-30 21:40:11","date_publish":"2016-12-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HereshowWalmartandGreenDotcouldincentivizeprepaiduse.json","image_url":"https://amp.businessinsider.com/images/5857f539ca7f0c1e058b6652-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_heres-how-walmart-and-green-dot-could-incentivize-prepaid-use-2016-12_1540935611.html","title":"Here's how Walmart and Green Dot could incentivize prepaid use","title_page":"    Here's how Walmart and Green Dot could incentivize prepaid use - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nNew gamification features are coming to Walmart MoneyCard, the retailer's prepaid card issued by Green Dot.\nThe program, called Prize Savings, is an effort to encourage holders to keep more money in savings.\nThe firms believe there's a \"savings crisis\" in the US, which reportedly prompted the launch of the program, but it could also indirectly increase engagement with Walmart MoneyCard, which ultimately helps both the retailer and the issuer.\nThe program uses cash prizes to incentivize savings. The program enters MoneyCard customers into a monthly sweepstakes for saving funds. Users can use the MoneyCard app or website to transfer money from their card balance into the MoneyCard Vault, a free savings feature. For every dollar they enter into their Vault, they receive one entry in a sweepstakes, which draws 500 winners for cash prizes per month.\nIndirectly, the program incentivizes users to engage more with their prepaid card, which could indirectly encourage usage.\nThe program pushes users to engage with their MoneyCards more often. Thus far, the program is working. Prize Savings soft-launched in August, and since then has seen a 35% increase in the average Vault savings balance. To transfer, customers are forced to log into their MoneyCard online — something they might not do otherwise — which could help them discover other available features, like reload or transfer options — that they might use down the line. In addition, the cash prizes are distributed directly into users' MoneyCard accounts, which means customers are forced to engage with and use their cards in order to redeem their winnings.\nThis could help users better form habits around the card, which could increase usage of the MoneyCard product. Customers are beginning to use their prepaid card accounts much more like traditional bank accounts than ever before, a move that Prize Savings encourages. That could ultimately improve engagement with MoneyCard, which might ultimately benefit both Walmart and Green Dot in the form of fees. In addition, Green Dot has been looking for ways to improve digital engagement with its offerings, and it's plausible it could apply a similar model if Prize Savings continues to be effective.","url":"https://www.businessinsider.com/heres-how-walmart-and-green-dot-could-incentivize-prepaid-use-2016-12"}
