{"authors":["Mark Fleming","First American Financial Corporation"],"date_download":"2018-10-30 22:46:44","date_modify":"2018-10-30 22:46:44","date_publish":"2018-07-30 00:00:00","description":"As household income rises and the mortgage rate falls, house-buying power increases. Looking at home affordability through this lens, several cities in the US are ahead of the rest. Overall affordability declined year-over-year, but is up nearly 24% since 2011.","filename":"data/vaneerConsumption/HerearethecitieswiththemosthomebuyingpowerintheUS.json","image_url":"https://amp.businessinsider.com/images/5b5f52fb1982d837008b47b4-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_here-are-the-cities-with-the-most-home-buying-power-in-the-us-2018-7_1540939604.html","title":"Here are the cities with the most home-buying power in the US","title_page":"    Here are the cities with the most home-buying power in the US - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Richard Cavalleri/Shutterstock\nThe three key drivers of the Real House Price Index (RHPI) are household income levels, the 30-year, fixed mortgage rate, and the unadjusted house price index. Changes to household income levels and the 30-year, fixed mortgage rate are considered together as consumer house-buying power. When household income rises and/or the mortgage rate falls, consumer house-buying power increases.\nThe Bad News: Affordability Declined Year-Over-Year\nIn May 2018, all three of the RHPI components increased compared with the year before. The 30-year, fixed mortgage rate increased by 0.6 percent, and the unadjusted house price index increased by 7.3 percent. Household income, which contributes positively to housing affordability, also increased 3.2 percent since May 2017. The result when you factor in all three influences - an 11.4 percent increase in the Real House Price Index nationally and an increase in the RHPI in all markets compared with a year ago.\nThe Good News: Consumer House-Buying Power is Up 23.6 percent since 2011\nUnadjusted house prices are 0.8 percent above the housing market peak in 2006, and have been increasing since the end of 2011, nearly a seven-year run. However, consumer house-buying power has also increased by 55 percent since the housing boom peak in 2006 - that's 69 times the increase in unadjusted house prices. House-buying power, how much one can buy based on household income and the 30-year, fixed-rate mortgage rate, has benefited from a declining rate environment, and slow, but steady household income growth. Nationally, since the start of the nearly seven-year run of increasing unadjusted house prices in 2011, house-buying power has increased 23.6 percent.\nTop Five Cities for House-Buying Power\nBut real estate is local and house-buying power differs between cities. Using a city's annual median household income, assuming that a household spends one-third of their income on a mortgage, and considering the current 30-year, fixed-rate mortgage rate, the five cities with the greatest consumer house-buying power in May 2018 are:\nSan Jose, CA: $660,884 Washington, DC: $633,093 San Francisco, CA: $583,496 Boston, MA: $509,520 Seattle, WA: $486,574\nHouse-Buying Power Outpaces Unadjusted House Price Growth\nUnsurprisingly, the top five cities coincide with the five cities with the highest household income - make more (money) to buy more (house). These cities also boast higher than national average household income growth - 4.9 percent from May 2017 to May 2018. Since the housing market peak in 2006, household income has increased, on average, 44.5 percent for these cities and the 30-year, fixed-rate mortgage rate has fallen from 6.3 percent to 4.6 percent. As a result, average house-buying power across these five cities has increased 74.7 percent since the housing market peak, considerably outpacing the 22.5 percent growth in unadjusted house prices. If house prices rise, but house-buying power rises further, are homes less affordable?\nWhen house prices are adjusted for consumer house-buying power, the \"real\" level of house prices becomes more apparent. Nationally, real, consumer house-buying power-adjusted house prices (RHPI) today remain 36.9 percent below their peak, and 11.0 percent below their level in the year 2000. Across the five markets with the highest house-buying power, real, consumer house-buying power-adjusted house prices (RHPI) today remain 31.3 percent below the housing market peak, but are 8.2 percent above their level in the year 2000. Why are house prices in these coastal markets so much higher than the national level? Because home buyers have the income to afford them.","url":"https://www.businessinsider.com/here-are-the-cities-with-the-most-home-buying-power-in-the-us-2018-7"}
