{"authors":["Benjamin Zhang"],"date_download":"2018-10-31 00:28:33","date_modify":"2018-10-31 00:28:33","date_publish":"2014-09-02 00:00:00","description":"The American household saved 12% of its monthly income in the 1970s, but can only manage to save 5% today.","filename":"data/vaneerConsumption/HeresWhyAmericansAreBadAtSavingMoney.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_financial-advisor-insights-september-2-2014-2014-9_1540945713.html","title":"Here's Why Americans Are Bad At Saving Money","title_page":"    Financial Advisor Insights, September 2, 2014 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bradipo/Flickr FA Insights is a daily newsletter from Business Insider that delivers the top news and commentary for financial advisors.\nWhy Americans Are So Bad At Saving Money(The Atlantic)\nIn 1970s, the average American household saved 12% of its income while households today save only 5%. According to The Atlantic's Derek Thompson, Americans are bad at saving due to reasons tied to math, psychology, and economics. Mathematically, many Americans simply don't make enough money to have anything leftover to save, says Thompson. In fact, the bottom 40% of population save less than 1% of their monthly income.\nHowever, the psychology of saving is a struggle even for those who aren't struggling financially. Thompson argues that the reason for this is because spending money is satisfying immediately while saving money is satisfying at a much later time. Thompson also cites the even widening wealth gap as a contributing cause for the low savings rate. \"The wealth gap encourages some low income family to spend more on status items like jewelry and nice shoes instead of saving,\" says Thompson.\nChina's State-Owned Enterprises May Finally Be A Viable Investment(AllianceBernstein)\nThe two traditional routes to investing in China have been through either expensive high growth stocks or risky contrarian plays. However, Alliance Bernstein's Stuart Rae, chief investment officer of Asia Pacific and John Lin, portfolio manager, write that there is now a third option that wasn't available before, state-owned enterprises (SOE).\n\"It may not promise the dazzling returns some hope to achieve from China's growth stocks, but it may be a less risky proposition than those contrarian plays.\" The new investment opportunity is \"a result of the government's plan to improve the profitability of SOEs,\" writes Rae and Lin. \"The plan includes a range of measures, such as better incentives for management, corporate restructuring, spin-offs and mergers—any of which can create opportunities for investors.\"\nHere's How To Use Market Forecasts To Your Advantage(Daily Reckoning)\nThe all-knowing market forecast is a tool investors often turn to for important insights. However, Greg Geunthner, managing editor of the Rude Awakening and Jonas Elmerraji, editor at Penny Stock Fortunes and STORM Signals, say that the information from market forecasts is best used in very specific ways.\n\"I have a love-hate relationship with forecasts and predictions,\" says Elmerraji. \"Good traders don't try to predict when an important price move is going to happen - we just react when it does. But forecasts can be very useful for figuring out context in trading. They help us gauge our risk/reward, and they're useful for the rest of your non-trading portfolio, too.\"\nYour Bond Portfolio Should Resemble A Barbeque Grill(BlackRock Blog)\nMatt Tucker, head of fixed income strategy at BlackRock's iShares believes your bond portfolio should resemble the mix of meats found on your Labor Day weekend barbeque grill. \"Preparing the perfect meal requires an optimal balance of nutrients, just like building a portfolio requires the right savory combination of investments,\" writes Tucker.\n\"The most basic protein, chicken, is a fixture of any barbecue menu. The same can be said for Treasuries in a bond portfolio,\" says Tucker. While, investment grade bonds are \"like a prime, choice or a select cut of beef.\" Tucker adds, \"the decadent offering of barbecued ribs at a weekend party is similar to that of high yield fixed income investments. By taking on greater risk of spilling sauce on your shirt you have the experience of a true summertime staple, and with high yield fixed income investments you are positioned for potentially higher income.\" Finally, he equates the exotic flavors of a kebab to the riskier emerging markets fixed income bond.\nIs P/E Ratio The Correct Valuation Tool To Use Today?(Advisor Perspectives)\nOver the years a variety of valuation tools have been used. \"A standard way to investigate market valuation is to study the historic Price-to-Earnings (P/E) ratio using reported earnings for the trailing twelve months (TTM),\" writes Advisor Perspective's Doug Short. However, \"proponents of this approach ignore forward estimates because they are often based on wishful thinking, erroneous assumptions, and analyst bias.\"\nShort proposes that a more accurate measure is the P/E 10 which \"divides the price by a multi-year average of earnings a using 10-year average of \"real\" (inflation-adjusted) earnings as the denominator.\" Short cites research from legendary economists Benjamin Graham and David Dodd's 1934 book \"Security Analysis\" as the basis for his argument. In the book, Graham and Dodd blamed \"illogical P/E ratios as the cause of temporary and sometimes extreme fluctuations in the business cycle.\"","url":"https://www.businessinsider.com/financial-advisor-insights-september-2-2014-2014-9"}
