{"authors":["Abc News"],"date_download":"2018-10-30 00:55:25","date_modify":"2018-10-30 00:55:25","date_publish":"2018-10-28 21:24:17","description":"Jessica Mulroney breaks down how to create a wardrobe with just six essentials.","filename":"data/vaneerConsumption/Herearethe6fashionpiecestoaddtoyourwardrobethisfall.json","image_url":"https://s.abcnews.com/images/GMA/fashion1-abc-ml-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Style_fashion-pieces-add-wardrobe-fall_story_id=58815833_1540860925.html","title":"Here are the 6 fashion pieces to add to your wardrobe this fall","title_page":"Here are the 6 fashion pieces to add to your wardrobe this fall - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Forget a closet overflowing with sweaters, jeans and coats.\nAll you need for your fall wardrobe are a capsule collection of six essential items, according to “Good Morning America” fashion contributor Jessica Mulroney.\nABC\nMulroney joined “GMA” Monday to show how to mix and match the items for different occasions.\nHere are her six key pieces, and full looks, for the fall.\n(MORE: 5 tips to get the best Black Friday deals)\n(MORE: Style for every body: Why a statement coat works for all body types)\n6 items for a fall capsule collection\nRed blazer available at Aritzia.com for $195.\nBlack pants available at Aritzia.com for $128.\nVegan leather leggings available at Aritzia.com for $135.\nWhite shirt available at Aritzia.com for $98.\nRobe coat available at Aritzia.com for $228.\nOversized turtleneck sweater available at Aritzia.com for $148.\nLook 1: Red blazer, black pants, white shirt and printed heels\nABC\nThis is a great look for the office according to Mulroney. The bright red hue is very on-trend for fall, and having the blazer in a bold color will help you work it into your wardrobe more efficiently, she added.\nShe recommends mixing and matching it in different ways, but you can't go wrong with classic black pants and a white shirt and printed heels, like these by Aldo.\nLook 2: Black pants, robe coat, black turtleneck and combat boots\nABC\nYou can take the classic black pants and work it into a fun and casual weekend look by pairing it with a robe coat, another on-trend piece this season.\nMulroney recommends cuffing the pant legs a little to make it look more casual, and pairing it with a black turtleneck, another on-trend piece for the fall. Then you can feel fashionable but still comfortable for a weekend of shopping or brunching with friends.\nLook 3: Robe coat and floral-patterned wrap dress\nABC\nTake your look from day to night by pairing the robe coat with a brightly patterned dress and ankle boots. The robe coat instantly becomes like a sexy trench coat, perfect for a date.\nMulroney recommends shopping for colors that work with what you already have in your closet.\nLook 4: Floral-patterned wrap dress, oversized sweater, heeled combat boots\nIf you're hoping for a look for a more casual night out, Mulroney recommends taking the same floral-patterned dress and and dressing it down a bit by pairing it with an oversized sweater and heeled combat boots. This is a great look for a casual night out with the girls.\nLook 5: Oversized sweater, vegan leather leggings and a black mule heel\nABC\nLeather is a huge trend for fall but can be costly, so a great alternative is vegan leather such as these leggings that can be worn day and night. Pairing them with an oversized sweater and heels can look fun and sexy, without showing too much skin.\nLook 6: Vegan leather leggings, black turtleneck, red blazer and leopard heels\nABC\nThis final look brings the capsule full circle by pairing that red blazer from the first look and elevating it with the vegan leather leggings and leopard heels. This is a perfect way to look both understated and cool or if you need an outfit that you can take straight from work to a social event afterwards, according to Mulroney.","url":"https://abcnews.go.com/GMA/Style/fashion-pieces-add-wardrobe-fall/story?id=58815833"}
