{"authors":["Matthew Frankel","The Motley Fool"],"date_download":"2018-10-31 00:09:11","date_modify":"2018-10-31 00:09:11","date_publish":"2016-12-02 00:00:00","description":"December is a good time to get rid of any investments in your portfolio that aren't worthwhile.","filename":"data/vaneerConsumption/Hereshowyoucouldboostyourtaxrefundbeforetheyearends.json","image_url":"https://amp.businessinsider.com/images/58423af7ba6eb606688b6647-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_boost-tax-refund-before-end-of-year-2016-12_1540944551.html","title":"Here's how you could boost your tax refund before the year ends","title_page":"    Here's how you could boost your tax refund before the year ends - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders work on the floor of the New York Stock Exchange October 13, 2008. REUTERS/Shannon Stapleton\nIf you're sitting on any losing investments, December is a good time to take a step back and decide whether you still want them in your portfolio.\nThanks to a strategy known as tax-loss harvesting, you could use those losses to help lower your tax bill, and then put that capital to use on more promising investments.\nHere's how it works and what you need to know.\nWhat is tax-loss harvesting?\nNobody is right 100% of the time when it comes to investing. Fortunately, the government is willing to effectively subsidize your losing investments by allowing you to offset your capital gains taxes.\nTax-loss harvesting, also known as tax-loss selling, refers to the practice of strategically selling losing investments in order to offset your other income. If you have capital gains from other investments, you can use your losses to offset some or all of them, thereby reducing the amount of capital gains taxes you'll owe.\nIf you don't have any capital gains or your losses are greater than your gains, you can use investment losses to offset up to $3,000 of your other income. If your net losses exceed $3,000, you can carry the rest forward to next year.\nTo be perfectly clear, I'm not saying that you should sell your stocks simply because their share prices have fallen. If your reasons for buying the stock in the first place still apply, by all means keep it. Rather, I'm saying that if something fundamental has changed with the company or you've been on the fence about getting rid of it, now may be a good time to move on and put that capital to work elsewhere.\nTwo important rules\nOne important rule to keep in mind is known as the \"wash sale\" rule. This rule says that in order to use an investment loss on your taxes, you cannot buy a \"substantially identical\" investment within 30 days. Obviously, this means that you can't sell your Chipotle Mexican Grill stock at a loss and repurchase the same stock, just to claim a loss.\nLess obviously, if you sell one S&P 500 index fund and buy a different one, that could also trigger the wash sale rule and make your losses unusable on your taxes.\nAP Photo/Sue Ogrocki\nAnother important rule is that your losses must be applied to the same type of income first, before being used to offset any other type of gains or income. For example, if you sold an investment you held for over a year at a loss, you must use that loss to offset any long-term capital gains you may have, before it can be used to offset short-term gains or ordinary income.\nHow much money could tax-loss harvesting save you?\nIt depends what your marginal tax rate is and what type of income you're using the loss to offset. Here's an article that can tell you your marginal tax rate (tax bracket), and here are the long- and short-term capital gains tax rates for 2016.\nAs an example, let's say that you bought a stock for $5,000 and sold your shares for $4,000, and that you held the shares for less than a year. If you're in the 25% tax bracket, this could translate to a $250 savings on your 2016 taxes. How much money could selling your losing investments put back in your pocket?\nThe tax-loss harvesting deadline for the 2016 tax year\nTechnically, you have until midnight on New Year's Eve to take advantage of tax-loss harvesting, but in practice, you can typically only buy and sell investments when the stock market is open. In 2016, New Year's Eve falls on a Saturday, so the last chance to sell investments for tax-loss purposes is Dec. 30, 2016 at the close of the trading day.","url":"https://www.businessinsider.com/boost-tax-refund-before-end-of-year-2016-12"}
