{"authors":["Matthew Debord"],"date_download":"2018-10-31 00:09:22","date_modify":"2018-10-31 00:09:22","date_publish":"2016-12-03 00:00:00","description":"Each sip of this Martini should deliver a range of flavors.","filename":"data/vaneerConsumption/HeresagreatallinoneMartinirecipefortheholidays.json","image_url":"https://amp.businessinsider.com/images/5457fea269bedd8c6859ce5e-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_perfect-all-in-one-martini-recipie-2016-12_1540944562.html","title":"Here's a great all-in-one Martini recipe for the holidays","title_page":"    Here's a great all-in-one Martini recipe for the holidays - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Flickr The Martini is the undisputed king of cocktails. Mixology fads come and go, but the Martini is forever.\nThere's never a bad time for a good Martini, and with the holidays upon us, it's the perfect opportunity for me to showcase my perfect method for mixing the legendary drink.\nWhy perfect? Because over more than a decade of making Martinis, I've resolved every major debate about the cocktail. And the holidays are no time to mired in debates about booze.\nHere we go.\nA true Martini is made with gin, but a lot of people, myself included, don't care for the flowery, botanical side of the libation. But for my recipe, you'll need some gin. I like Beefeater.\nYou'll also need some vodka. A true Martini is not made with vodka, but stick with me. A favorite vodka for me is Finlandia, but I also like Tito's, an American take on the spirit (if you simply can't abide vodka that isn't Russian, then simply use Stolichnaya and don't think about it too much). The idea here is to \"cut\" the gin with vodka and lessen the gin-ness of the drink.\nVermouth is next. There's always been a crazy obsession with the \"dry\" Martini, which is all about reducing the amount of dry vermouth added to the cocktail. Some folks simply coat the inside of the Martini glass with vermouth, then dump it out. It's been said that some whisper \"vermouth\" over the finished drink. My favorite is the recommendation that you place the vermouth bottle on a window ledge and allow sunlight to pass through the bottle and shine onto the mixed drink. Anyway, Noilly Pratt is the brand I prefer, and I like to use a decent amount of it.\nNext up: a lemon and several medium-sized, green pitted olives, with olive brine.\nFinally, a cocktail shaker and a lot of ice. And some stemmed Martini glasses large enough to hold about 6 ounces.\nLet's get mixing.\nDEBORD'S PERFECT MARTINI\n1. Either place the glasses in the freezer to chill or fill them with ice. You're going to want everything very, very cold, including your gin, vodka, and vermouth (keep the vodka in the freezer and the gin and vermouth in the fridge).\n2. Use a cocktail measure to get your proportions right. You're aiming for a 2:2:1 ratio of gin:vodka:vermouth.\n3. Fill the shaker with ice cubes (only ice cubes, not crushed ice). I like to use a metal shaker, for reasons that will become obvious in a second.\n4. Add 2 ounces of gin, 2 ounces of vodka, and 1 ounce of vermouth. Then add a half an ounce of olive brine. Yes, this Martini will be slightly \"dirty.\"\n5. Allow the ingredients to meld with the ice for a few minutes. Gently rotate the shaker and listen to the soothing clatter of the ice. Anticipation builds.\n6. Cut a twist from the lemon (after you're washed it). Run it around the rim of the glass. Use a fresh twist for each glass, if you're making more than one Martini.\n7. NOW COMES THE MOST IMPORTANT PART. Shake the shaker until it's so cold you can barely hold it. Your hands should actually hurt a bit. That's right, this Martini entails some pain. If you really want to push it, wrap the shaker in a towel and go at it until the cold gets through the towel. In any case, keep a towel handy to enable you to hold the shaker when you pour the cocktail. YOU CANNOT STIR THIS MARTINI! You'll see why in step 8. And don't worry about \"bruising\" the cocktail. You need to shake the crap out of it. You want to make a slightly unholy, disturbing shaker noise.\n8. Allow the cocktail to rest for a few seconds before straining. Then pour it into the glass, with circular motion. You should have a bit of clearance at the rim of the glass, in this \"up\" version. However, you should also have a thin, almost imperceptible sheen of ice of the surface of the drink. This connects my Martini ever-so-subtly with a rocks version, the advantage of which is that as you sip, the ice \"waters\" the mixture, helping the ingredients to continuing blending. A hint of green \"louche\" should be in the glass, as well, a result of the olive brine.\n9. Add a single olive. Keep two extra olives in a dish on the side.\n10. Drink. After a few sips, eat the first olive, which will now be Martini flavored. Add another. Repeat until the drink is finished.\nEach sip of this Martini should deliver a range of flavors, but also the overall impression of conjoining. You'll get a hint of lemon from the rim, a touch salt from the brine, a suggestion of texture from the ice, and then — because you were so committed to the shaking — a smooth delivery of the gin-vodka-vermouth mix. You also get a bit of nutrition from the olives.\nThis will also be the coldest Martini you have ever drunk. And it will remain cold. Cold is in fact a flavor in my Martini.\nAs a plus, you will be drinking a drink that's resolved all the timeworn Martini debates. There's gin, there's vodka, there's just enough vermouth to hold it all together, it's super cold, there's a reference to the lemon twist and the inclusion of olives. This Martini is a 5-ounce summary of all the Martinis that have come before it. It's history in a glass.\nAnd if you want to skip the olive brine, be my guest. But the olives are a must.\nObviously, if you want to make two Martinis, simply double the measures, but retain the ratio.\nYou're going to like this Martini. I would go so far as to promise that you will.","url":"https://www.businessinsider.com/perfect-all-in-one-martini-recipie-2016-12"}
