{"authors":["Matthew Debord","Benjamin Zhang"],"date_download":"2018-10-30 22:39:51","date_modify":"2018-10-30 22:39:51","date_publish":"2016-12-12 00:00:00","description":"Our assessments were based on a full year of testing dozens of cars, trucks, and SUVs.","filename":"data/vaneerConsumption/Herearethe5runnersupforBusinessInsiders2016CaroftheYear.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_runners-up-business-insiders-2016-car-of-the-year-2016-12_1540939191.html","title":"Here are the 5 runners-up for Business Insider's 2016 Car of the Year","title_page":"    Here are the 5 runners-up for Business Insider's 2016 Car of the Year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Ferrari 488 GTB was a 2016 runner up. Hollis Johnson\nIt's time! Business Insider's Transportation team will announce our 2016 Car of the Year on Tuesday, with the big winner selected from our list of 15 finalists.\nThis is the third year that we've named a Car of the Year. Previous winners were the Corvette Stingray in 2014 and the Volvo XC90 in 2015. With each installment of Car of the Year, we've expanded our lineup and deepened our process of choosing finalists, runners-up, and the winner.\nThese five vehicles are the 2016 runners-up. We were incredibly impressed by all of them.\nOur assessments were based on a full year of testing dozens of cars, trucks, and SUVs. Senior Correspondent Matt DeBord, Transportation Reporter Benjamin Zhang, and Evening News Editor and West Coast car nut Bryan Logan then discussed the merits of the finalists over multiple weeks, with a knock-down, drag-out debate once the field of 15 finalists was narrowed to six.\nTransportation Reporter Danielle Muoio and Senior Transportation Editor Cadie Thompson also contributed their thoughts on the cars we've experienced over the past year.\nOur talented photographer, Hollis Johnson, and videographer, Justin Gmoser, also kicked in their opinions, as they visually captured these striking automobiles in all their glistening glory over the course of the year.\nIn truth, this year's debate was a bit less bare-knuckled than last year's, when we spent several days in heated conversation before we chose the Volvo XC90.\nWe don't have extensively scientific criteria for selecting what we feel were the best cars of 2016 — we currently lack the testing facilities for anything like that. But we do consider each finalist in terms of three important questions: Was the vehicle compelling to drive? Did it stand apart from the competition? And did it involve a strong business case for the automaker that created it?\nSo here they are — the runners-up for Business Insider's 2016 Car of the Year.\nPhotos by Hollis Johnson.\nGraphic by Skye Gould.","url":"https://www.businessinsider.com/runners-up-business-insiders-2016-car-of-the-year-2016-12"}
