{"authors":["Richard Turnill","The Blackrock Blog"],"date_download":"2018-10-30 22:59:30","date_modify":"2018-10-30 22:59:30","date_publish":"2018-07-24 00:00:00","description":"The Chinese yuan has weakened to its lowest levels in more than a year. It has triggered fears that a sharp devaluation could roil markets like in 2015. But China's economy and global conditions are different than back then.","filename":"data/vaneerConsumption/HereswhymarketsshouldntfreakoutaboutChinascurrencyjustyet.json","image_url":"https://amp.businessinsider.com/images/5b576e80730ff221008b461b-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_heres-why-markets-shouldnt-freak-out-about-chinas-currency-just-yet-2018-7_1540940370.html","title":"Here's why markets shouldn't freak out about China's currency just yet","title_page":"    Here's why markets shouldn't freak out about China's currency just yet - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Chinese yuan has been weakening-triggering fears of a sharp devaluation that could roil global markets. Should markets be worried? We see scope for the yuan to moderately depreciate through the rest of the year in response to slower growth, financial deleveraging and escalating trade tensions. The Chinese authorities are likely to rely on monetary and fiscal policy tools, rather than the currency, to manage any growth slowdown in the second half, in our view.\nBlackRock Blog\nThe yuan has slid 4% so far this year, with the fall accelerating since mid-June when U.S. President Donald Trump announced a 25% tariff on $50 billion of Chinese imports. See the blue line in the chart above. Yet we do not see China resorting to a 2015-style devaluation to cushion the blow (The yuan fell 2.75% over two days in August that year). Back then, a lack of market confidence in China's policy framework contributed to capital flight (see the green bars), spooking global markets. Today, China has stricter capital controls in place-and improved coordination between policymakers. We believe this should give the government confidence to allow the yuan to gradually slide lower.\nSlow and steady\nThe recent tumble in the yuan and China's stock market has stoked fear: A 2015-style rapid depreciation could spark big capital outflows and another rout in global markets. Yet we expect the Chinese authorities to let the yuan gradually depreciate in a controlled manner through the year end. A moderately weaker yuan may lend a hand to Beijing in its balancing act: seeking to keep the economy humming, while cracking down on financial leverage and cushioning the impact from escalating trade actions. It could boost exports, mitigating blows from reduced domestic investment as a result of the deleveraging campaign. Other factors are weighing on the yuan. U.S. dollar strength is one. Diverging monetary policies in China (easing) and the U.S. (tightening) are another.\nThe policy, regulatory and growth dynamics in China today are different from 2015. Authorities have become more coordinated in their approach to fiscal, monetary and FX policies; China's economy is in a better place-and so is the global economy. Beijing has policy tools at its disposal to prop up the economy, with potential for more monetary easing and fiscal spending in the second half. The People's Bank of China's (PBoC) recent move to boost market liquidity is one such example. We also take comfort in the PBoC governor's pledge not to use the currency as a weapon in potential trade wars. A sharp yuan depreciation would undermine Beijing's deleveraging effort, by driving capital flight and further tightening domestic financial conditions, in our view. It could also fuel inflation and dampen foreign investors' growing interest in China's domestic stock and bond markets.\nBottom line\nWe see moderate yuan depreciation ahead, but are aware of rising risk from trade actions. (See our BlackRock geopolitical risk dashboard for more). We like selected opportunities in emerging market (EM) Asia equities, including China, as we think these risks are largely priced in and have resulted in attractive valuations. We see the gradual addition of China A-shares to global equity indexes as opportunities for global investors to gain exposure to China's consumer market. We are neutral on rates and credit in China.\nInvesting involves risks, including possible loss of principal.\nThis material is not intended to be relied upon as a forecast, research or investment advice, and is not a recommendation, offer or solicitation to buy or sell any securities or to adopt any investment strategy. The opinions expressed are as of July 2018 and may change as subsequent conditions vary. The information and opinions contained in this post are derived from proprietary and nonproprietary sources deemed by BlackRock to be reliable, are not necessarily all-inclusive and are not guaranteed as to accuracy. As such, no warranty of accuracy or reliability is given and no responsibility arising in any other way for errors and omissions (including responsibility to any person by reason of negligence) is accepted by BlackRock, its officers, employees or agents. This post may contain \"forward-looking\" information that is not purely historical in nature. Such information may include, among other things, projections and forecasts. There is no guarantee that any forecasts made will come to pass. Reliance upon information in this post is at the sole discretion of the reader. Past performance is no guarantee of future results. Index performance is shown for illustrative purposes only. You cannot invest directly in an index.","url":"https://www.businessinsider.com/heres-why-markets-shouldnt-freak-out-about-chinas-currency-just-yet-2018-7"}
