{"authors":["Janna Herron","The Fiscal Times"],"date_download":"2018-10-30 22:01:18","date_modify":"2018-10-30 22:01:18","date_publish":"2016-12-14 00:00:00","description":"The hike is part of the Fed’s strategy to gradually raise rates without jolting the economy.","filename":"data/vaneerConsumption/HereshowtheFedsinterestratehikecouldaffectyourloansandcreditcarddebt.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_feds-interest-rate-hike-loans-credit-card-debt-2016-12_1540936878.html","title":"Here's how the Fed's interest rate hike could affect your loans and credit card debt","title_page":"    Here's how the Fed's interest rate hike could affect your loans and credit card debt - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Federal Reserve Chairman Yellen delivers the semi-annual testimony on the \"Federal Reserve's Supervision and Regulation of the Financial System\" before the House Financial Services Committee in Washington Thomson Reuters\nTwelve months after raising a key benchmark rate for the first time in 10 years, the Federal Reserve finally increased the rate again on Wednesday, making consumer and business loans slightly more expensive.\nThe central bank voted to increase the federal funds rate — the rate banks charge each other for overnight loans — by a quarter percentage point to between 0.5 percent and 0.75 percent.\nThe move marks the Fed's second increase since reducing the rate to zero in December 2008 in an effort to prop up the struggling economy.\nThe hike is part of the Fed's strategy to gradually raise rates without jolting the economy. The Fed signaled that it expects to see three interest rate hikes in 2017.\nEven slight increases will be felt immediately by consumers who have loans with variable interest rates tied to federal funds rate. If you're one of those, here's how you can limit the pain from higher rates:\nHomeowners\nInterest rates on adjustable-rate mortgages are tied to the prime rate or LIBOR, both of which closely track the federal funds rate. So any increase in that rate will immediately raise the interest rate on an ARM. Homeowners with an ARM should consider refinancing into a fixed-rate mortgage.\nHomebuyers\nThe rate on the 30-year fixed mortgage, the most common home loan for purchases, tracks the yield on the 10-year Treasury note. That yield typically moves in the same direction as the fed funds rate, but not in lockstep. In general, the yield — and subsequently the 30-year rate — have been on the rise since Trump's election, and will probably continue to move higher. So if you're close to buying a home, it may make sense to lock your mortgage rate. If you're not ready to pull the trigger on a purchase soon, work on improving your credit score, another factor that determines your mortgage rate.\nHome equity borrowers\nIf you have a home equity line of credit, or HELOC, a fed rate hike will definitely hit you in the wallet. Most HELOCs follow the prime rate, which is tied to the fed funds rate, so an increase will raise your HELOC rate within 30 days. To limit the damage, request that your lender fix the interest rate on the amount you borrowed already from the HELOC. Any rate increase would apply only to future borrowing.\nFlickr / Federal Reserve\nThose with home equity loans aren't affected by a rate hike, because those rates typically are fixed. But if you're in the market for a new equity loan, rates will rise gradually and track any increase in the 10-year Treasury yield.\nCredit card holders\nCredit card interest rates are typically variable and often tied to the prime rate, which follows the fed rate. That means a Fed rate hike will almost immediately increase your credit card interest rates. The good news is that the new, higher rate only affects to purchases you make after the increase. Any previous balances are subject to the old rate. Overall, credit card holders can avoid paying any interest by simply paying off their entire balance each month.\nStudent loan borrowers\nMany private student loans, as well as federal ones issued since 2013, have variable rates; a substantial proportion of those rates are tied to the prime rate or 10-year Treasury yield.\nThose tied to the prime rate will react quickly to a Fed rate hike, while those that track the 10-year Treasury yield will see more gradual increases. In either case, your monthly payment will rise.\nIf you have an income-repayment repayment plan, your monthly payment won't increase, but a larger portion of your payment will go to paying interest rather than principal. Student borrowers with private loans can shop around for consolidation opportunities at lower rates. Otherwise, budget more each month for your loans.","url":"https://www.businessinsider.com/feds-interest-rate-hike-loans-credit-card-debt-2016-12"}
