{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:40:57","date_modify":"2018-10-30 20:40:57","date_publish":"2016-12-28 00:00:00","description":null,"filename":"data/vaneerConsumption/Hereswhybitcoinboomedin2016.json","image_url":"https://amp.businessinsider.com/images/5863ded3ee14b6c7148b5634-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_heres-why-bitcoin-boomed-in-2016-2016-12_1540932057.html","title":"Here's why bitcoin boomed in 2016","title_page":"    Here's why bitcoin boomed in 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nLast Friday, the price of bitcoin hit $903, its highest level since November 2013 when it reached $979, according to the CoinDeskindex.\nThe digital currency plateaued between November 2013 and January 2015, but it's been rising steadily since then.\nAccording to Bitcoin, the cryptocurrency saw an annual gain of 54% in 2016, outperforming all fiat currencies, most of which stumbled this year.\nThere are several reasons why the digital currency has been performing so well:\nIt's seen as a safe asset. Bitcoin surged by 4% overnight after Trump's victory in the US presidential election, while the Dow Jones, Nasdaq, and all major European indices dropped dramatically. Bitcoin is an alternative asset, like precious metals and art, and as such, it doesn't correlate with the stock market, which makes it an attractive diversifier. It is also a decentralized currency and not tied to any single country's policy decisions, which is a great advantage in times of political and economic uncertainty.\nA spate of new bitcoin products has reassured investors. A number of players recently entered the market with bitcoin-based offerings geared at mainstream investors — for example, the Winklevoss brothers' bitcoin ETF and investment solutions from blockchain hedge fund Polychain. Such products are helping to reinforce bitcoin's image as a reliable investment. In addition, bitcoin and blockchain platform Lisk announced new transparency measures last Wednesday.\nIt's been getting more coverage and exposure. In November, the CEO of Blockchain, a successful London-based bitcoin wallet, said the company was on track to have its busiest month to date; and Circle, a US-based bitcoin money transfer app, made the news due to major changes to its business model. Such media exposure will likely help the still poorly understood asset enter the public consciousness.","url":"https://www.businessinsider.com/heres-why-bitcoin-boomed-in-2016-2016-12"}
