{"authors":["Najja Parker"],"date_download":"2018-10-30 18:09:33","date_modify":"2018-10-30 18:09:33","date_publish":"2018-10-30 16:35:42","description":"While celebrities have reportedly boycotted the Super Bowl to support Colin Kaepernick, Jermaine Dupri thinks there is another way to stand behind the ex-NFL player.","filename":"data/vaneerConsumption/HereswhyJermaineDuprithinkscelebsshouldnotboycottSuperBowl.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p4/AJC/2013/02/21/Videos/2179355293001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_here-why-jermaine_6b23880848192b729d17a3e015339b06__1540922973.html","title":"Here’s why Jermaine Dupri thinks celebs should not boycott Super Bowl","title_page":"Here’s why Jermaine Dupri thinks celebs should not boycott Super Bowl","title_rss":"NULL","source_domain":"ajc.com","text":"While celebrities have reportedly boycotted the Super Bowl to support Colin Kaepernick, Jermaine Dupri thinks there is another way to stand behind the ex-NFL player and his cause.\n» RELATED: Super Bowl 53: Jermaine Dupri will helm music for Super Bowl Live\nDuring a recent interview with TMZ Sports, the Atlanta producer discussed Rihanna and Jay-Z’s decision to turn down the halftime show this year to back Kaepernick and other athletes who’ve taken a knee during the National Anthem as a symbol of protest against racial injustice in America.\nHowever, Dupri thinks boycotts are ineffective.\n“Boycotts and marches don’t seem like they work to me, I’m sorry. I think they should send a message while they’re onstage. Take advantage of your platform,” he said. “Taking advantage of your platform is to not do the Super Bowl as well ... The more people speak on it, the more they talk about it, then the more it's something people feel like they have to address.”\nHe also chatted about his role as the music producer for Super Bowl Live, the week of free fan events preceding the Feb. 3 game at Mercedes-Benz Stadium in Atlanta.\n“Me being the unofficial mayor of this city but caring about how people view my city forever and ever,” he continued. “I feel like it’s my job to at least make sure that the ‘Welcome to Atlanta’ experience is the best that you’ve ever had for those who still come and support Super Bowl weekend.”\n» RELATED: Super Bowl LIII is 100 days away: What we know so far","url":"https://www.ajc.com/blog/buzz/here-why-jermaine-dupri-thinks-bad-idea-for-celebs-boycott-the-super-bowl/L2tWqhKOvafOVK30yMWXvL/"}
