{"authors":[],"date_download":"2018-10-22 22:16:37","date_modify":"2018-10-22 22:16:37","date_publish":"2014-05-09 17:05:42","description":"\"We can't afford to wait\" to implement new technologies to combat climate change, he says.","filename":"data/vaneerConsumption/HereComestheSunObamaToutsSolarinCalifornia.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/432341/newark_airport_solar_panels-jpeg-05398_d97e1196be04fabc7892d7cf319877dc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_white-house_here-comes-sun-obama-touts-solar-california-n101566_1540246597.html","title":"Here Comes the Sun: Obama Touts Solar in California","title_page":"Here Comes the Sun: Obama Touts Solar in California","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama touted new efforts to promote solar energy Friday, saying that \"we can't afford to wait\" to implement new technologies to combat climate change.\n“Today, no matter where you live or where you do business, solar is getting cheaper and it’s getting easier to use than before,” Obama said during a visit to a Wal-Mart store in Mountain View, Calif.\nThe event comes the same week that the administration issued a report warning that climate change is already affecting Americans because of extreme weather and environmental damage.\nAs some Republican opponents argue that a focus on environmental overhaul would cost valuable American jobs, Obama sought to make the case that better energy policies that adapt to \"the reality of climate change\" also won't break the bank.\n“More companies like Walmart are realizing that wasting less energy isn’t just good for the planet,” he said. “It’s good for business.”\nIn additional to further energy efficiency upgrades to federal buildings, the White House is announcing new private and public sector commitments designed to reduce pollution and increase energy efficiency.","url":"https://www.nbcnews.com/politics/white-house/here-comes-sun-obama-touts-solar-california-n101566"}
