{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:35:18","date_modify":"2018-10-30 23:35:18","date_publish":"2016-12-06 00:00:00","description":null,"filename":"data/vaneerConsumption/HereswhyendingcobrandswillhurtforeigncardnetworksinChina.json","image_url":"https://amp.businessinsider.com/images/5846dc12e02ba734008b7a92-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_heres-why-ending-co-brands-will-hurt-foreign-card-networks-in-china-2016-12_1540942518.html","title":"Here's why ending co-brands will hurt foreign card networks in China","title_page":"    Here's why ending co-brands will hurt foreign card networks in China - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nChinese banks will reportedly stop issuing co-branded cards between foreign card networks, like Visa and MasterCard, and the state-affiliated UnionPay, according to reports from the Financial Times.\nThe news comes following a People's Bank of China notice to stop renewing these cards when they expire. Such a move could deal a major blow to foreign card networks because these co-brand partnerships were one of the easiest ways for them to access the massive Chinese card payment ecosystem.\nThe move could have a material impact on foreign companies. For context, when a customer receives a co-branded card, UnionPay generally processes domestic payments in China, while the foreign network processes dollar-based payments abroad.\nIt's possible that they could lose customers. In the past 14 years, Chinese banks have issued 240 million co-branded cards, according to the Financial Times. Once existing cards expire, customers will reportedly be issued two cards — one UnionPay, for domestic use, and one foreign-branded, for international purposes. That could allow for the retention of some customers, but it's extremely likely these firms' user bases will decline.\nThe bigger impact could be on transaction volume. Chinese tourists in the US are expected to spend $40 billion in 2017, a figure that's growing. It's likely that the foreign card networks have captured a good portion of that share through these co-brands. But UnionPay has been drastically expanding its reach abroad, which could make it easier for customers to continue using their UnionPay cards abroad, ultimately rendering the foreign-issued card somewhat obsolete.","url":"https://www.businessinsider.com/heres-why-ending-co-brands-will-hurt-foreign-card-networks-in-china-2016-12"}
