{"authors":[],"date_download":"2018-10-30 20:01:42","date_modify":"2018-10-30 20:01:42","date_publish":"2017-03-13 16:51:00","description":"Do you love the thrill of roller coasters and the sweet taste of cotton candy? A job at Atlanta's Six Flags Over Georgia may be the perfect gig for you.","filename":"data/vaneerConsumption/HereshowtogetajobatSixFlagsoverGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/31/Images/skyWord.355020-skyword-six-flags-jobs-by-anna.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_meet-th_84c56057c6ebf48d93145481c900b16f__1540929702.html","title":"Here's how to get a job at Six Flags over Georgia","title_page":"Here's how to get a job at Six Flags over Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Do you love the thrill of roller coasters and the sweet taste of cotton candy? Then a job at Atlanta's Six Flags Over Georgia may be the perfect gig for you. Here are some tips from the park's human resources group that could help you land an offer.\n»RELATED: AJC Top workplaces in Atlanta 2017\nThese are the current openings\nSix Flags Atlanta Properties will hire approximately 3,000 employees by the end of 2016. The park has scores of openings all year long that span Six Flags Over Georgia, Hurricane Harbor and Six Flags White Water. From employment center supervisor to parking services and security, the organization is constantly looking for fresh faces. This month, Six Flags Over Georgia will begin hiring for Fright Fest, an attraction that will run from Sept. 24-Oct. 31. The park encourages all applicants to apply early and those who are deemed qualified will be contacted by park management for an on-site interview.\n»RELATED: Are you tough enough to become an Atlanta firefighter?\nHere's how to qualify\nAll applicants must be at least 16 years of age and apply online.\nFor seasonal team members, previous amusement park experience is not necessary, because on-the-job training is available for all positions throughout the year.\nHow to nail the interview\nSix Flags team members interact with guests every day, whether it be on one of the park's exciting rides or a culinary food location or retail shop. With that in mind, employees are expected to always be friendly and enthusiastic. The park's human resources group stresses that lacking a smile is a no-go. First impressions mean everything, so the staff monitors potential employees from the first moment they walk through the doors for an interview. Recruiters will be keeping an eye out especially for those who wear big smiles and dress professionally throughout the entire evaluation process.","url":"https://www.ajc.com/business/employment/meet-this-requirement-you-want-work-six-flags/vS4dInPFmh8oGRU4PhEnZI/"}
