{"authors":["John Nolte"],"date_download":"2018-10-30 21:46:25","date_modify":"2018-10-30 21:46:25","date_publish":"2015-01-15 18:15:59","description":"Here are the 5 crucial facts Vox chose to ignore when it declared the Oscars racist: \"12 Years a Slave\" was the Best Picture front-runner when it won last |","filename":"data/vaneerConsumption/HereAre5FactsVoxIgnoredWhenItDeclaredtheOscarsRacist.json","image_url":"https://media.breitbart.com/media/2015/01/12-years-a-slave1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_01_15__1540935985.html","title":"Here Are 5 Facts Vox Ignored When It Declared the Oscars Racist","title_page":"Here Are 5 Facts Vox Ignored When It Declared the Oscars Racist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Here are the 5 crucial facts Vox chose to ignore when it declared the Oscars racist:\n“12 Years a Slave” was the Best Picture front-runner when it won last year “12 Years a Slave” was up against some very tough competition 10 black actors have been nominated in the last 5 years, 3 won 7 films focusing on race and racism have been nominated for Best Picture in the last 5 years “Selma” just isn’t a very good movie\nThe Vox headline screams: “Selma was snubbed because the average Oscar voter is a 63-year-old white man.” Buried deep in Vox’s dishonest race-baiting, though, is a fairly pertinent fact that completely undermines the headline: Just 11 months ago, this very same old, white Academy awarded “12 Years a Slave” a Best Picture Oscar.\nVox also writes the following about “12 Years a Slave” as though it somehow supports its racism theory:\nSure, 12 Years a Slave won last year, but that was after a bruising campaign that saw it barely eke out a win over the finish line.\nHuh?\nWhut?\nThe competition last year was fierce: “American Hustle,” “Dallas Buyers Club,” “Gravity,” “Captain Phillips,” “The Wolf of Wall Street,” were also nominated.\n“12 Years a Slave” could have justifiably lost to any one of those films.\nThe big question, though, is how does Vox know “12 Years” “barely” won? The Academy doesn’t release ballot counts. The closest we can come to knowing that is what the Oscar experts told us before Oscar night, and as The Washington Examiner’s Sonny Bunch makes clear, 22 of 29 of those experts called it for “12 Years a Slave.”\nThat’s not barely eking out a win or dumb luck, that’s a landslide — a consensus.\nVox gets dumber:\nAs I said in my piece about how it still helps to be a movie about a white man if you want to win an Oscar, the Academy is old, white, and male. It’s made efforts to diversify, sure, but a 2012 survey conducted by the Los Angeles Times found it was still 94 percent white and 77 percent male. The average age of an Academy member is 63. (Need further proof? Every acting nominee this year is white.)\nYes, every acting nominee this year is white. Yet, in order to justify its dishonest headline, Vox chooses not to tell its readers about priors years, or even last year when Chiwetel Ejofor, Barkhad Abdi, and Lupita Nyong’o were all nominated. Nyong’o won.\nOn top of those three, in just the last 5 years, Morgan Freeman, Denzel Washington, Quvenzhané Wallis, Gabourey Sidibe, Viola Davis, Octavia Spencer (won), and Mo’Nique (won) have all been nominated. That’s a total of 10 nominees and 3 wins over 5 years.\nThe math: 4 actor categories with five slots each equals 20 slots per year. Over 5 years that equals 100 possible nominations. Black actors have won 10% of those. That’s pretty much in line with the American population ratio which blacks make up 13.1% of.\nAlong with “Selma” and “12 Years a Slave, ” 7 films that focus on racism and racial themes have been nominated for Best Picture: “Lincoln,” “Django Unchained,” “The Help,” “Precious,” and “The Blind Side.”\nI’m not in the habit of defending Hollywood. If you want to declare that the left-wing Academy racist, fine. Maybe a case can be made. In fact, I’d love to see that case made. But make the case using facts, not by hiding facts.\nNobody wants to come out and say this but “Selma’s” real problem is that it just isn’t a very good movie. The film does many things right and then fails miserably at making the audience feel anything, especially at the end. Given the subject matter, “Selma” should soar and offer the audience some sort of emotional release. It doesn’t. And that’s a huge failure of the screenplay and the director.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/01/15/here-are-5-facts-vox-ignored-when-it-declared-the-oscars-racist/"}
