{"authors":[],"date_download":"2018-10-22 22:20:51","date_modify":"2018-10-22 22:20:51","date_publish":"2014-06-09 19:17:04","description":"Two University of Utah researchers propose that the face of human ancestors evolved in a way that would limit injuries from punches.","filename":"data/vaneerConsumption/HeresthePunchlineAncientFistfightsMayHaveShapedHumanFace.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/497406/140609-human-face-fights-1510_12db0904bc127fafe60fccb16caaac0c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_heres-punchline-ancient-fistfights-may-have-shaped-human-face-n126586_1540246851.html","title":"Here's the Punchline: Ancient Fistfights May Have Shaped Human Face","title_page":"Here's the Punchline: Ancient Fistfights May Have Shaped Human Face","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Studies of injuries resulting from fights show that when modern humans fight, the face is the primary target,\" biologist David Carrier said. \"The bones of the face that suffer the highest rates of fracture from fights are the bones that show the greatest increase in robusticity during the evolution of early bipedal apes, the australopiths.\"\nThese are also the bones that show the greatest difference between women and men in early human ancestors and modern humans, Carrier added.\nIn both apes and humans, males are much more violent than females, and most male violence is directed at other males, Carrier said. The violence underpinning the need for a more robust facial structure may have involved fist fights over females, resources and other disputes.\nAustralopithecus was a lineage that preceded our genus, Homo, and it emerged more than 4 million years ago in Africa. Australopithecus was bipedal, smaller than modern people and possessed a combination of ape and human characteristics.\n\"Comparing great apes such as chimps and gorillas to australopiths, what changed in the face was a reduction in the length of the jaws, a great increase in the robustness and strength of the jaws, molar teeth and jaw muscles, a substantial increase in the size and strength of the cheek bones, and an increase in the part of the face that surrounds the eyes,\" Carrier said.\nThe proportions of the hand that allowed for the formation of a fist and the great increases in the robustness of the face occurred early in our lineage, 4 million to 5 million years ago, at about the same time as the bipedal posture appeared, Carrier added.\nCarrier said anthropologists have thought the new facial traits in the first bipedal apes were the result of a diet that included very hard objects, and the biomechanics of eating such food can explain many of these features. But he said recent analyses of wear patterns in teeth suggest most of these creatures did not eat hard objects.\nThe study by Carrier and Michael Morgan, a University of Utah physician, builds on their previous research highlighting the role they contend violence played in driving human evolution.\n— Reuters","url":"https://www.nbcnews.com/science/science-news/heres-punchline-ancient-fistfights-may-have-shaped-human-face-n126586"}
