{"authors":["Associated Press"],"date_download":"2018-10-22 23:35:39","date_modify":"2018-10-22 23:35:39","date_publish":"2017-04-26 08:05:22","description":"SAN FRANCISCO (AP) - President Donald Trump is lashing out at a judge's ruling blocking his attempt to strip funds from \"sanctuary cities\" that don't...","filename":"data/vaneerConsumption/HereswhatcouldbenextforTrumpssanctuarycitiesorder.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/02/wire-469161-1493258170-492_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446550_Judge-cites-Trumps-comment-sanctuary-city-ruling_1540251339.html","title":"Here's what could be next for Trump's sanctuary cities order","title_page":"Here's what could be next for Trump's sanctuary cities order | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SAN FRANCISCO (AP) - President Donald Trump is lashing out at a judge's ruling blocking his attempt to strip funds from \"sanctuary cities\" that don't cooperate with U.S. immigration authorities, calling it \"ridiculous\" and vowing to go to the U.S. Supreme Court.\nIt was the third Trump executive order on immigration to be thwarted by the federal courts.\nHere is a look at Tuesday's ruling and what lies ahead:\nCity Attorney Dennis Herrera talks about a federal judge's order blocking any attempt by the Trump administration to withhold money from \"sanctuary cities \"during a news conference at City Hall Tuesday, April 25, 2017, in San Francisco. (AP Photo/Eric Risberg)\n___\nWHAT DID THE FEDERAL JUDGE SAY ABOUT THE SANCTUARY CITIES ORDER?\nU.S. District Judge William Orrick in San Francisco said the president has no authority to attach new conditions of his own to spending that was approved by Congress.\nThe judge further ruled that Trump's order threatened a wide swath of funding - not the relatively small amount the Justice Department claimed - and that the government cannot cut off funding if there is no clear connection between the money and the policy at issue.\nAttorney General Jeff Sessions said late Wednesday the president was well within his power to issue the executive order and the DOJ would continue to fight the cases in court. It was not clear, however, whether he planned to appeal Orrick's ruling.\nWHAT COULD TRUMP DO NEXT?\nTrump could appeal to the 9th U.S. Circuit Court of Appeals. But that was the court that blocked the president's first travel ban against seven Muslim countries. Eighteen of the 25 active judges on the court were appointed by Democrats. Trump has said he wants to go to the U.S. Supreme Court, which would have the final say if it decided to take up the case.\nTrump could also revise his executive order to explicitly tie it to the three relatively modest Justice Department and Homeland Security grants that the administration argued were at stake.\nOrrick said his ruling does not affect the administration's ability to enforce existing conditions on federal grants.\nWHAT ELSE COULD THE ADMINISTRATION DO?\nTrump could push Congress to pass a law giving him clear authority to revoke certain funding, said Margo Schlanger, a University of Michigan law professor and former head of civil rights at Homeland Security during the Obama administration.\nBut Schlanger said whatever action is taken may not survive court scrutiny if it's seen as unduly coercive.\n\"Suppose you said you can't have any money at all unless you participate fully in immigration arrests,\" she said. \"That would be so big it would be coercive.\"\nAdditionally, for the law to survive, there must be a connection between the money at stake and the immigration policy the president is seeking to enforce, Schlanger said.\nIt is not clear how close that link has to be, but Trump presumably would not be allowed to withdraw funding for, say, highway construction to force a city to stop protecting immigrants from deportation.\nWHAT OTHER CHALLENGES LIE AHEAD FOR THE SANCTUARY CITIES ORDER?\nOrrick ruled on two cases brought by the city of San Francisco and California's Santa Clara County. Seattle and two cities in Massachusetts, Lawrence and Chelsea, have also sued.\nWHAT WAS THE OBAMA ADMINISTRATION'S STAND ON FUNDING FOR SANCTUARY CITIES?\nLast year, the Justice Department notified recipients of criminal justice grants that they must obey a federal law that says local governments cannot forbid their employees from cooperating with U.S. immigration authorities.\nRecipients were reminded that that they could face penalties, such as the loss of grants, for not complying.\nAn inspector general's memo from last year said authorities were unaware of any legal action taken by the Obama administration to compel states or local governments to cooperate.\n___\nTucker reported from Washington.\nCity Attorney Dennis Herrera, at podium, with his staff beside him, talks about a federal judge's order blocking any attempt by the Trump administration to withhold money from \"sanctuary cities\" during a news conference at City Hall Tuesday, April 25, 2017, in San Francisco. A federal judge on Tuesday said the president has no authority to attach new conditions to federal spending. U.S. District Judge William Orrick issued the preliminary injunction in two lawsuits, one brought by the city of San Francisco, the other by Santa Clara County, against an executive order targeting communities that protect immigrants from deportation. (AP Photo/Eric Risberg)","url":"https://www.dailymail.co.uk/wires/ap/article-4446550/Judge-cites-Trumps-comment-sanctuary-city-ruling.html"}
