{"authors":[],"date_download":"2018-10-30 21:10:33","date_modify":"2018-10-30 21:10:33","date_publish":"2018-08-31 16:01:00","description":"Pianos For Peace will launch its annual outdoor festival and community arts program with a public un...","filename":"data/vaneerConsumption/Hereswhy50colorfulpianosarebeingsetuparoundAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/09/Videos/4434205.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_here-why-colorfu_52578780567e813f967313f84b647340__1540933833.html","title":"Here’s why 50 colorful pianos are being set up around Atlanta","title_page":"Here’s why 50 colorful pianos are being set up around Atlanta&nb","title_rss":"NULL","source_domain":"ajc.com","text":"Pianos For Peace will launch its annual outdoor festival and community arts program with a public unveiling of 50 painted pianos beginning Saturday (Sept. 1). The festival will continue through Sept. 22.\nYou can see, play and enjoy the pianos while on display in public parks and high-traffic locations throughout metro Atlanta.\nThe collection of donated pianos has been hand-painted by local volunteer artists in collaboration with Fulton County Arts and Culture as well as students and art teachers at Atlanta Public Schools. After the three-week festival, the colorful pianos will be donated to local schools, nursing homes, healthcare facilities, community centers and other organizations in need.\nMORE: Things to do Aug. 31-Sept.2: House in the Park, Brian McKnight and tour Oakland Cemetery\nPianos For Peace’s outdoor festival starts soon. CONTRIBUTED\nThe 50 Pianos for Peace locations include the following strategic partners: Center for Civil and Human Rights, the King Center, Piedmont Park, Rialto Center for the Arts, Hartsfield-Jackson Atlanta International Airport, five along the Beltline, and 10 MARTA stations. A full list of the 50 locations is at PianosForPeace.org\nPianos for Peace Festival file photo. CONTRIBUTED (The Atlanta Journal-Constitution)\nMalek Jandali, founder and CEO of Pianos For Peace, says the goal of the festival is to use music to unite. An Atlanta based classical composer, pianist and a peace activist who wants to use what he calls the “soft power” of art to make the arts accessible to all and bring unity to our community “We welcome everyone to our symphony for peace. Together, we’re building peace through music and education.”\nJandali went onto say, “as an Atlanta local charity, we transform lives and impact communities through our year-round art programs. It’s about beauty, truth and preserving our common shared American and human values.”\nMORE: 5 wine tours a lot closer to home than Napa","url":"https://www.ajc.com/lifestyles/here-why-colorful-pianos-are-being-set-around-atlanta/OoIbTEXBb9Byga9xwxEVfO/"}
