{"authors":["Local"],"date_download":"2018-10-30 19:40:39","date_modify":"2018-10-30 19:40:39","date_publish":"2018-08-30 11:45:00","description":"If you’re a sports fan in Georgia, the next five days, from Thursday through Labor Day, will b...","filename":"data/vaneerConsumption/Heresaguideto5busydaysinGeorgiasports.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Local_Wsbtv/2018/08/30/Images/823742501_4471533.vpx_12788055_ver1.0_640_360.jpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_here-guide-busy-days-georgia-sports__1540928439.html","title":"Here's a guide to 5 busy days in Georgia sports","title_page":"Here's a guide to 5 busy days in Georgia sports","title_rss":"NULL","source_domain":"ajc.com","text":"If you’re a sports fan in Georgia, the next five days, from Thursday through Labor Day, will be action-packed.\nThe Braves continue a compelling homestand. College football teams open their seasons. The Falcons play an exhibition game under an open roof. Atlanta United goes on the road. The Dream’s playoff series continues.\nTo help you keep track of the overload, here’s a guide to the games:\n> Falcons vs. Miami Dolphins (exhibition), 7 p.m. Thursday, Mercedes-Benz Stadium, CW69: This is the Falcons’ last practice game before starting the season for real one week later at defending Super Bowl champion Philadelphia. The Falcons plan to play their exhibition finale with the stadium’s eight-piece retractable roof in the open position, just the second time for a Falcons game. The roof is scheduled to be opened one hour before kickoff.\n> Georgia State vs. Kennesaw State, 7 p.m. Thursday, Georgia State Stadium, ESPN+: Kennesaw State, which reached the FCS quarterfinals in just the program’s third season last year, will travel 25 miles to the former Turner Field for its first-ever game against an FBS opponent. Georgia State begins its ninth year of football.\n> Braves vs. Chicago Cubs, 7:35 p.m. Thursday, SunTrust Park, FSSE: The Cubs, with the best record in the National League, come to SunTrust Park for a rare one-game stop, a makeup of a May rainout.\n> Atlanta Dream vs. Washington Mystics, 8 p.m. Friday, ESPN News, and TBD, Sunday, ESPN2, Charles E. Smith Center (Washington): The best-of-five WNBA semifinal series moves from Atlanta, tied at one game apiece, with the Dream looking to build on the momentum of a Game 2 victory.\n> Braves vs. Pittsburgh, 7:35 p.m. Friday, 7:10 p.m. Saturday and 5:05 p.m. Sunday, SunTrust Park, all on FSSO: It’s a rematch of last week’s low-scoring series in Pittsburgh, which the Braves swept from the recently reeling Pirates.\n> Georgia Tech vs. Alcorn State, 12:30 p.m. Saturday, Bobby Dodd Stadium, FSSO: Tech has played Alcorn State, an FCS team, once previously -- that in the 2015 season opener. The Yellow Jackets won 69-6, one of just three Tech wins that season.\n> Auburn vs. Washington in Chick-fil-A Kickoff game, 3:30 p.m. Saturday, Mercedes-Benz Stadium, ABC: This rare SEC-Pac 12 matchup is the biggest game of college football’s opening week in terms of preseason rankings -- Washington No. 6 and Auburn No. 9. Auburn returns to the stadium where it lost twice to end last season. The roof will be closed, honoring a commitment made to Washington when it agreed to play in the game.\n> Georgia vs. Austin Peay, 3:30 p.m. Saturday, Sanford Stadium, ESPN: The Bulldogs open against an FCS opponent for the first time since 2008. Austin Peay snapped a 29-game losing streak last September and rallied to an 8-4 record for the season.\n> North Carolina Central vs. Prairie View A&M in MEAC/SWAC Challenge, noon Sunday, Georgia State Stadium, ESPN2: This event, matching teams from the Mid-Eastern Athletic Conference and Southwestern Athletic Conference, has been played annually since 2005 and comes to Atlanta for the first time. It also is scheduled to be played at Georgia State Stadium in 2019 and 2020.\n> Atlanta United vs. D.C. United, Audi Field (Washington), 7:30 p.m. Sunday, FS1: With eight regular-season matches remaining, Atlanta United has the best record in Major League Soccer (16-4-6) and the most prolific single-season goal-scorer in league history (Josef Martinez). This is the second of four consecutive road matches for Atlanta United.\n> Braves vs. Boston, 1:05 p.m. Monday, SunTrust Park, FSSE: The Red Sox, who have won the most games and scored the most runs in MLB, arrive at SunTrust Park on Labor Day for the start of a three-game series that continues through Wednesday. These will be the Braves’ last games of the year against an American League team -- unless, that is, they reach the World Series.","url":"https://www.ajc.com/news/local/here-guide-busy-days-georgia-sports/Hyk4uISDN2pH2BNeUMXeBN/"}
