{"authors":["Associated Press"],"date_download":"2018-10-23 04:59:00","date_modify":"2018-10-23 04:59:00","date_publish":"2017-03-10 15:04:09","description":"LOS ANGELES (AP) - Luxury brand Hermes headed to downtown Los Angeles on Thursday for a hipster party complete with an outdoor runway show, interactive...","filename":"data/vaneerConsumption/HermesgoeshipsteratdowntownLosAngelesfashionevent.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/19/wire-197843-1489175358-947_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301554_Hermes-goes-hipster-downtown-Los-Angles-fashion-event_1540270740.html","title":"Hermes goes hipster at downtown Los Angeles fashion event","title_page":"Hermes goes hipster at downtown Los Angeles fashion event | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LOS ANGELES (AP) - Luxury brand Hermes headed to downtown Los Angeles on Thursday for a hipster party complete with an outdoor runway show, interactive displays, food trucks and an indie concert.\nThe Paris-based fashion house joins a growing number of brands staging flashy California shows outside of the traditional fashion weeks held in New York, Paris or Milan.\n\"Why come to LA?\" mused Robert Chavez, the president and CEO of Hermes North America. \"We have a significant business here on the West Coast. Los Angeles is really the center of that business. ... And it was time for us to come downtown. We love the concept of being casual, chic, cool, innovative and surprising.\"\nHermes presents the \"Dwtwn Men Runway Show\" on Thursday, March 9, 2017, in Los Angeles. (Photo by Willy Sanjuan/Invision/AP)\nHermes decked out a block of empty warehouses to showcase their spring-summer menswear collection, which had previously shown in Paris.\nThe laid-back line, perfect for a day at the beach, included comfy T-shirts, shorts and light jackets in neutral colors with occasional pops of neon yellow.\n\"You're going to see really some beautiful, fresh, spring colors,\" Chavez said before the show. \"You're going to see an easiness and casualness that is really going to epitomize the lifestyle of Southern California, California in general. But just a very relaxed, fresh and young approach to Hermes clothing,\"\nCozy V-neck pullovers, leather jackets and plush shirts were paired strappy sandals and messenger bags.\nBut even the beach bum has to go to class eventually. So designer Veronique Nichanian provided plenty of prep in matching blue shorts and polo shirts, and a button-down sweater with bright yellow diamonds - a playful take on argyle.\nThe show ended with the Beatles' classic \"All You Need is Love\" blaring as tie-dyed tops in navy, purple, and of course highlighter yellow, made their way down the runway.\nAlong with snacks from Airstream food-trucks, guests were encouraged to touch fabrics displayed on walls and listen to records of past runway show music - the album sleeves decorated with printed designs from Hermes' signature silk scarves.\nLong Beach indie band Cold War Kids performed for the crowd.\n_____\nOnline: http://usa.hermes.com/man/dwntwnmen.html\n_____\nFollow Nicole Evatt on Twitter at https://twitter.com/NicoleEvatt\nHermes presents the \"Dwtwn Men Runway Show\" on Thursday, March 9, 2017, in Los Angeles. (Photo by Willy Sanjuan/Invision/AP)\nHermes presents the \"Dwtwn Men Runway Show\" on Thursday, March 9, 2017, in Los Angeles. (Photo by Willy Sanjuan/Invision/AP)\nHermes presents the \"Dwtwn Men Runway Show\" on Thursday, March 9, 2017, in Los Angeles. (Photo by Willy Sanjuan/Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4301554/Hermes-goes-hipster-downtown-Los-Angles-fashion-event.html"}
