{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:55:10","date_modify":"2018-10-30 21:55:10","date_publish":"2016-12-16 00:00:00","description":"Alistair Crane sold his last business, Grapple, for close to £40 million and then ran the US business of tech business Monitise.","filename":"data/vaneerConsumption/HeroandformerGrappleCEOAlistairCraneonSiliconValleyvsLondon.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_hero-and-former-grapple-ceo-alistair-crane-on-silicon-valley-vs-london-2016-12_1540936510.html","title":"Hero and former Grapple CEO Alistair Crane on Silicon Valley vs. London","title_page":"    Hero and former Grapple CEO Alistair Crane on Silicon Valley vs. London - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Adam Levene, left, and Alistair Crane, Hero. Hero LONDON — Can London still survive — thrive even — as a global tech hub after Brexit? The scene in Britain's capital city has always played second fiddle to Silicon Valley globally and risks being eclipsed by Berlin in the years ahead.\nBut Alistair Crane, who is building his second tech business here, believes London still has an edge.\n\"From an investor perspective, Brexit isn't a major consideration for them,\" he says.\n\"What the UK government has done really well and what Brexit hasn't impacted is the encouragement and relief the UK government has for seed investors. I think that makes the UK an attractive destination for anyone to bring their money.\"\nCrane spoke to Business Insider recently at the offices of his new venture, Hero, in Fitzrovia, the West End of London. Crane previously built mobile apps business Grapple, which made products for top clients such as BSkyB, Procter & Gamble and Whitbread. The business, which Crane cofounded in 2009, was sold to London payment technology company Monitise in 2013 for close to £40 million.\nThe deal took Crane out to San Francisco where Crane ran Monitise's US business but he has been lured back to London to take the role of CEO at new retail technology startup Hero, founded by an early employee at Grapple.\nWhy not move the business out to the Valley?\n\"Number one, the centre for retail excellence is London,\" Crane says. \"It doesn't mean there aren't enormous retail scenes in the US — there are — but in my opinion, they're following not leading.\nPeople in London aren't cheap but they're really good, reliable, it's a great employment scene\n\"In addition to that, I think it's worth mentioning the talent pool in the UK. I think it's got to a bit of a silly stage the US from an employment perspective. The reason why you read about people raising millions and millions of pounds in their seed round is because they have to for office space and salary. Thanks very much WeWork and your $300,000 developer.\n\"People in London aren't cheap but they're really good, reliable, it's a great employment scene, and Adam and I had already built a business in the space so had a lot of the contacts and could get the best people from the start.\"\nAdam is Adam Levene, the founder of Hero. The startup aims to build a sort of WhatsApp for shopping, connecting shop assistants with online shoppers.\n\"On a Wednesday afternoon at 4 p.m. if you go into any store you'll see the same thing — lots of idle store associates not doing very much,\" says Levene. \"But they all have one of these [a smartphone] in their pockets and they've all got these customers shopping on their websites and nobody's putting the two together. From a productivity point, it's a really easy sell.\n\"If you're an online shopper and you can't make it to that Bond Street store, the associate can pull out their phone, flick on live video and suddenly as a shopper you're sitting on the website and you're stepping into the store.\"\nThe Hero product. Hero As well as live video and chat features, Hero aims to tap into the current zeitgeist for \"chatbots\"— artificially intelligent chat interfaces that can use computers to answer simple questions like: what time does the shop close? Here again, Levene thinks London has an advantage over Silicon Valley.\n\"Seeing the talent within engineering, especially in data science, that's happening in London — if you think about fintech and where AI is going next, the talent is here. The AI hub of the world will be here in London. It's not going to be on the West Coast, it's going to be London.\"\nLevene founded Hero in 2015 and has been developing and testing the product since. He and Crane are now taking it to market to try and commercialise the idea and conducting trials with the likes of online furniture retailer Made.com, which has four showrooms around the UK, and glasses retailer Cubitts.\n\"We're talking to a bunch of different retailers because we don't know where this will best resonate first and we're not presuming to go and tell the market,\" says Crane. \"All we know is that we have the most value to retailers and businesses that really value customer experience.\"\nLevene adds: \"The big macro-trend with any retailer or brand is it's all about experience. Everyone's doing everything online and if your store only exists to be transactional then it's a huge cost, because people are transacting digitally. Your store is all about the experience, the look and feel.\"\nHe highlights Virgin Money, which refers to its branches as \"lounges\" and offers free coffee. Hero hopes to bring that kind of experience and brand sensibility to people who can't make it to the stores.\n\"WhatsApp, Facebook Messenger, still the humble SMS,\" Levene says. \"There's about 80 billion of theses messages sent every day across the world. Very few of those messages are between people and companies. That for me was the original opportunity.\"","url":"https://www.businessinsider.com/hero-and-former-grapple-ceo-alistair-crane-on-silicon-valley-vs-london-2016-12"}
