{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 05:52:56","date_modify":"2018-10-23 05:52:56","date_publish":"2017-03-10 15:26:24","description":"Herbert Horatio Kitchener (pictured), who grew up in Crowborough, East Sussex, won several medals for his brave exploits fighting Nazi Germany as it tried to invade Norway in 1940.","filename":"data/vaneerConsumption/HeroicsoflastRAFpilottobattleNazisinabiplane.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E2312EF00000578-0-image-a-43_1489158527967.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301482_Heroics-RAF-pilot-battle-Nazis-biplane_1540273976.html","title":"Heroics of last RAF pilot to battle Nazis in a biplane","title_page":"Heroics of last RAF pilot to battle Nazis in a biplane | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The unsung heroics of one of the last RAF pilots to go into battle against the Luftwaffe in a biplane have come to light, after his medals sold for £22,000.\nHerbert Horatio Kitchener took part in a top secret mission to help the Norwegians in their last ditch effort to repel a German invasion in April 1940.\nSome 18 Gloster Gladiator biplanes landed near a frozen lake at Aandelsnes in Norway only to find a massive lack of facilities, fuel and ammunition.\nThe planes were destroyed in a German bombardment, but not before the British took down 14 enemy aircraft using a combination of a machine gun on the ground and feint air attacks.\nHerbert Horatio Kitchener was one of the last RAF pilots to go into battle against the Luftwaffe in a biplane\nThe auctioned items include the personal photographs of Kitchener, such as this one with his wife Margaret\nKitchener (shown left) completed several missions in Norway which saw him awarded several medals, including the Norwegian Cross (shown right) - the equivalent of the Victoria Cross\nWing Commander Kitchener and the men of 263 Squadron were equipped with another 18 Gladiator biplanes to support the Battle of Narvik, further north.\nOver a period of days Kitchener and his fellow pilots engaged in furious dog-fights and claimed 50 victories in all.\nKitchener shot down two German bombers and two Stuka dive-bombers and helped provide air cover for the evacuation of Narvik.\nTen of the 18 biplanes returned to the aircraft carrier HMS Glorious, which was later attacked and sunk with a great loss of life hours later.\nKitchener's medals, his flying goggles and hat, photographs and official letters and log books, were sold by his family through Duke's Auctioneers in Dorchester, Dorset\nKitchener (shown right), originally from Crowborough, East Sussex, joined the RAF Volunteer Reserve in 1937 at the age of 23 and quickly advanced through the ranks\nThe collection of items includes press clippings on the heroic feats of Kitchener (pictured)\nKitchener was not among them as he had earlier been assigned an aircraft with which he flew back to Britain.\nBIPLANES DURING THE WORLD WARS An aircraft with two main wings stacked above the other, biplanes became the first powered, controlled aeroplane to fly in 1903. As a result, they saw significant use during the First World War, and were favoured by pilots as their lightness and stiffness made them the ideal toll during dog fights with the enemy. However, by the 1930s biplanes had started to reach their performance limit and were slowly replaced throughout Europe by monoplanes. By the start of the Second World War, several air forces still had biplane combat aircraft in frontline use, such as the Royal Air Force's Gloster Gladiator. But their use faded throughout the war, with more purpose-built aircraft, such as the Submarine Spitfire, becoming favoured among British pilots.\nHe was later awarded the Distinguished Flying Medal for his bravery in Norway and the Norwegian Cross - the equivalent of the Victoria Cross - for helping the country in its time of need.\nThe day before he had been due at Buckingham Palace to receive his decorations in March 1941, he was tasked with intercepting a German Junkers 88 bomber off the Cornish coast.\nHis Westland Whirlwind fighter was badly damaged and he was forced to make a crash landing.\nHe suffered a fractured skull and broken arm in the process.\nKitchener's medals, his flying goggles and hat, photographs and official letters and log books, were sold by his family through Duke's Auctioneers in Dorchester, Dorset.\nKitchener, from Crowborough, East Sussex, joined the RAF Volunteer Reserve in 1937 at the age of 23.\nHe left the RAF in 1945 and worked in local government in Kent.\nHe died in 2010 aged 95.\nMedals won by Kitchener include (top row) The Distinguished Flying Medal, the Air Efficiency Award, the Air Crew Europe Star, (bottom row) the 1939-45 War Medal and the 1939-45 Star","url":"https://www.dailymail.co.uk/news/article-4301482/Heroics-RAF-pilot-battle-Nazis-biplane.html"}
