{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 01:36:23","date_modify":"2018-10-23 01:36:23","date_publish":"2016-01-29 15:38:56","description":"Heroin addict Charni, 23, horrified Jeremy Kyle when she told him she 'couldn't be f****d' to tackle the heroin addiction that's made her turn to prostitution and give up her three children.","filename":"data/vaneerConsumption/HeroinaddictmumisoneofJeremyKylesworsteverguests.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B40D7600000578-0-image-a-54_1454083107128.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422825_Heroin-addict-mum-branded-one-Jeremy-Kyle-s-horrendous-guests_1540258583.html","title":"Heroin addict mum is one of Jeremy Kyle's 'worst ever guests'","title_page":"Heroin addict mum is one of Jeremy Kyle's 'worst ever guests' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who admitting selling her body to fund her heroin addiction and giving up her three children has been dubbed one of the worst Jeremy Kyle guests ever.\nCharni, 25, appeared on the show with her mother Kim, who takes care of two of her children. A third child who Charni said 'was dead to her' had been adopted.\nShe enraged the presenter in an angry exchanged in which she declared she 'couldn't be f*****' with the effort of giving up drugs.\nScroll down for video\nCharni, 25, was branded one the show's most horrendous ever guests after admitting she sells her body to fund her heroin addiction and have given up her three children\nThe horrified host told Charni she was one of 'the most disgusting people' he'd ever met\nJeremy was already unimpressed by Charni who he described as 'one of the most disgusting' people he'd ever met.\n'What I've read about you would any person with a brain cell recoil in horror,' he said.\nReferring to her children, he continued: 'A nine-year-old and a seven-year-old and you're too busy taking heroin. You selfish mare, you don't deserve to be a mother.'\nHowever, Charni was initially unwilling to accept his criticisms and got into a heated argument with Jeremy.\nThe pair got into a heated argument with Charni telling Jeremy that she didn't bother with her children because she didn't want them to see her like this\n'If that's what you think, you don't know that I want help,' she screamed at him.\n'I don't want to see them kids because I don't want them to see me like this.'\n'Then why don't you get help?' Jeremy asked.\n'It's hard, I can't do it,' she hit back.\nIn an expletive-littered rant Charni told the host: 'I don't care. I tell myself the truth every day. I know what I'm doing every day. Do you think I love walking around to score every day?'\nIn the segment entitled 'Save my daughter: She sells her body on the streets', Charni's mother Kim explained that her daughter had attacked her and stolen from her.\nCharni's mother Kim explained that she was looking after her two grandchildren, while a third child had been adopted\nA tearful Charni couldn't handle the pressure of being put on the spot by Jeremy and her mother and declared that she 'couldn't be f****d' to tackle her addiction\n'It's like she's been dug up out of a grave,' she told Jeremy. 'She's disgusting. I've had people come with guns.'\nThe show filmed on the streets prior to the show and the clip showed her swaying and disorientated Charni was seen arranging to meet a punter for sex.\n'Basically I get up in the morning have a hot drink, phone my dealer or if I've not got the money I'll phone up a different party and go to see a different gentleman,' she explained.\n'From prostitution I earn from £50 to £200 a day. Most I'd probably do is six. That's the furthest I'll go.'\nSlurring her words, she insisted: 'I'm not high, not at all. I'm fine.'\nFollowing the clip, a disgusted Jeremy said: 'It's one of the most horrendous things I've ever seen in 10 years of doing this show.'\nThe addict was filmed arranging to meet a punter for sex to pay for heroin. She explained she earned up to £200 a day from prostitution\nKim begged her daughter: 'Wake up while you still can.'\nBut being put on the spot by her mother and Jeremy was too much for Charni who stormed off, saying: 'I can't be f****d'.\n'Get out of my building and do one you waste of space,' the horrified presenter replied.\nHowever, he managed to get her back on stage again to hear a recorded message from her son and daughter.\n'Mummy we really, really love you lots,' her son said. 'For your sake please get well. You can come to our birthday parties. You can come out for dinner with us. You can celebrate Christmas with us.'\nLaying into Charni, Jeremy admitted he was fed up of people begging to go to rehab and then wasting the opportunity\nThe show's counsellor Graham and Jeremy disagreed over whether Charni would be able to complete rehab\nAfterwards, Jeremy said: 'I nearly cried when your kids spoke there and I'm supposed to be awful.'\nIf the message wasn't enough of a shock for Charni, the show's resident doctor Arun Ghosh revealed that she would be dead in less than a year unless she got clean.\nCounsellor Graham Stanier was in favour of sending her straight to rehab, but Jeremy wasn't convinced it would do any good.\n'We are going to disagree because I don't believe for one minute she's going to get off drugs,' he admitted. 'I don't think she has any desire to change her life.'\nHe explained that he'd been put off by the fact that a week earlier a guest who had begged and begged to be sent to rehab only stayed for 24 hours.\n'I believe you'll be a 24 hour person,' he told Charni.","url":"https://www.dailymail.co.uk/femail/article-3422825/Heroin-addict-mum-branded-one-Jeremy-Kyle-s-horrendous-guests.html"}
