{"authors":[],"date_download":"2018-10-22 20:45:57","date_modify":"2018-10-22 20:45:57","date_publish":"2014-05-03 15:35:28","description":"John Servati held up a retaining wall so that his girlfriend could escape, but dies from injuries he sustained when the wall fell on him on Monday.","filename":"data/vaneerConsumption/HeroAlabamaSwimmerJohnServatiKilledinStormsHonoredatFuneral.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/407831/140429-tornado-victim-servati-john_71f1f73418a4bcb2d3ce5cb48f36e2b7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_deadly-tornado-outbreak_hero-alabama-swimmer-john-servati-killed-storms-honored-funeral-n96296_1540241157.html","title":"Hero Alabama Swimmer John Servati, Killed in Storms, Honored at Funeral","title_page":"Hero Alabama Swimmer John Servati, Killed in Storms, Honored at Funeral","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe 21-year-old college swimmer who died a hero Monday in the vicious storms and tornado that swept through Alabama was remembered in funeral services Saturday afternoon.\nJohn Servati is credited with saving his girlfriend's life by holding up a retaining wall — long enough for her to escape while the storm thrashed his house, according to NBC affiliate WSFA.\nThe retaining wall collapsed on Servati, and he later died from his injuries at a Tuscaloosa hospital, according to the University of Alabama, where the junior was studying business.\n\"He saved my life and I shouldn't be here. I mean, he's my hero,\" Servati's girlfriend, Lauren Swann, told WSFA.\nServati's funeral was scheduled for 2 p.m. (3 p.m. ET) at Calvary Baptist Church in Tupelo, Miss., where he attended high school, according to an online obituary from W.E. Pegues Funeral Home.\nMembers of the University of Alabama swimming and diving team acted as honorary pallbearers, the obituary said.\n\"John Servati was an extraordinary young man of great character and warmth who had a tremendously giving spirit,\" said Dennis Pursley, head coach of the University of Alabama swim team.","url":"https://www.nbcnews.com/storyline/deadly-tornado-outbreak/hero-alabama-swimmer-john-servati-killed-storms-honored-funeral-n96296"}
