{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 01:03:55","date_modify":"2018-10-23 01:03:55","date_publish":"2017-04-26 11:06:02","description":"Michelin starred chef Heston Blumenthal and his now ex-wife Zanna have divorced after 28 years of marriage - but six years after they split up.","filename":"data/vaneerConsumption/HestonBlumenthalisgranteddivorcefromwifeof28years.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/25/21/3F99614C00000578-0-image-a-57_1493150421920.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447058_Heston-Blumenthal-granted-divorce-wife-28-years_1540256635.html","title":"Heston Blumenthal is granted divorce from wife of 28 years","title_page":"Heston Blumenthal is granted divorce from wife of 28 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Star chef Heston Blumenthal's 28 year marriage to his estranged wife was ended in just 90 seconds today.\nDistrict Judge Anne Hudd granted her a 'quickie' undefended decree nisi at the Central Family Court six years after the couple split.\nZanna Blumenthal's petition appeared first in a list of 14 cases today and Mrs Blumenthal , 52, was granted a decree nisi on the grounds that the marriage had irretrievably broken down.\nAfter he split from his wife in 2011 the 50-year-old chef moved out of their Buckinghamshire home, and for a time dated glamourous American cookery book author Suzanne Pirret, who says her favourite things are 'food and sex.'\nAll over: Michelin starred chef Heston Blumenthal's 28 year marriage to his estranged wife Zanna (pictured together) was ended in just 90 seconds today\nNew love: After splitting from his wife in 2011, the star chef moved out of the family home in Buckinghamshire and began dating food writer Suzanne Pirret (pictured together)\nThe paperwork stated that Zanna Blumenthal had sufficiently proved the contents of her petition and was 'entitled to a decree of divorce, the marriage having irretrievably broken down, the facts found proved being two years' separation with consent'.\nThe date of separation was given as the beginning of August 2011 with the couple having decided that the marriage was at an end two months earlier.\nSince then, Zanna Blumenthal has lived in Marlow, Buckinghamshire, while her husband's address was given as Barnes, south west London.\nMr Blumenthal said in the papers that 'we have reached an agreement in financial proceedings which is in full and final satisfaction of all claims for legal costs including of this divorce suit'.\nThe couple have three children, Jack , 24. Jessie, 21, and Joy,19 . They met as teenagers when he was a credit controller and she was a nurse, and married in 1989.\nThey built up a business together and turned the 450 year old Fat Duck in Bray, Berkshire into one of the world's leading restaurants.\nHe also owns Dinner a critically acclaimed restaurant in the Mandarin Oriental Hotel in Knightsbridge, West London.\nIt is believed that the couple who have remained friends wanted to sort out financial matters before getting divorced.\nShe once described him as her soul mate and he said she was the reason for his success as they built up a multimillion pound restaurant business.\nIn an interview before they split Mrs. Blumenthal said: 'It sounds corny, but I knew from the outset that I'd found my soul mate. There was a deep connection between us and even though we were just teenagers, we knew we had found something special.\n'We had very little money, but for my birthday, he took me for dinner at the best restaurant in London at the time, La Tante Claire.\n'It was the first time I'd experienced fine dining and it blew me away, so food became our shared passion.'\nBlumenthal has most recently been spotted with French real estate broker Stephanie Gouveia\nIn the same interview he said: ' Zanna is the reason for my success because she has supported me every step of the way,' he said in the same interview. She's sacrificed so much and has never complained.'\nThe couple split up in 2011, as Blumenthal went through a self-confessed crisis and began to question everything about his life\nNeither were present for the brief hearing.\nIn a recent interview with Event magazine he said he was driven by guilt at not having spent more time with his children growing up.\nHe said: 'I remember I had a back operation over Christmas when we were closed at The Fat Duck. I was on crutches, putting up decorations with my son Jack, and he said, 'This is the first time we've done this, Dad.' He was 13 or 14. For some reason I thought, 'Isn't that cute?'\n'But then it struck me, 'Oh my God, this really is not right.' I carried that regret for a while, along with other regrets.\nHowever Blumenthal said his relationship with his children was now better than it had ever been.\nIn an interview with Woman & Home, Zanna previously referred to her husband as her 'soul mate' but lamented that she 'pretty much became a single parent because Heston was in the restaurant all the time.'\nHowever in an interview last month Blumenthal said he and his wife had settled their differences.\nSpeaking to Event Magazine, he said: 'We've done it. It's only when it gets resolved that you realise the tension. I feel quite different now. I've been trying to free myself up.\n'It's a bit like when you're making a stew, you keep adding extra things in but it's still not quite right. In fact, some of the ingredients shouldn't be there in the first place.'","url":"https://www.dailymail.co.uk/news/article-4447058/Heston-Blumenthal-granted-divorce-wife-28-years.html"}
