{"authors":["Laurel Rosenhall"],"date_download":"2018-10-30 22:27:32","date_modify":"2018-10-30 22:27:32","date_publish":"2016-09-14 08:00:00","description":"California has more billionaires than any other state, and an abundance of direct democracy. Those two facts intersect during election season, when","filename":"data/vaneerConsumption/HeyBigSpendersThreemultimillionairesstakeaclaimonstatesballot.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/RichGuyTrio-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938452.html","title":"Hey Big Spenders: Three multimillionaires stake a claim on state's ballot","title_page":"Hey Big Spenders: Three multimillionaires stake a claim on state's ballot | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California has more billionaires than any other state, and an abundance of direct democracy. Those two facts intersect during election season, when spending by wealthy donors helps determine which initiatives make it on the ballot, and how many TV commercials and mailers campaigns can buy. Their donations carry the potential to influence state policy for years to come.\nHere’s a look at three high-rollers influencing California’s statewide ballot this November—and one who decided not to:\nTom Steyer\nThe San Francisco billionaire—who exited the hedge-fund world a few years ago to devote himself to Democratic politics and environmental causes—is now the biggest individual super-PAC donor in the nation. He’s put $38 million into a committee running ads against Republican presidential nominee Donald Trump and working to register new voters in battleground states.\nEven though blue California isn’t a swing state, Steyer is digging deep here too. He’s spent $1.6 million so far on a major drive to register new voters, trying to connect with the 7 million Californians who are eligible to vote but not registered. Largely young adults and people of color, Steyer called their lack of participation a “threat to democracy.”\nHe appears prominently in TV ads urging people to vote—fueling speculation that he plans to run for governor in two years. Steyer said he’ll make that call after the election. Until then, he’s concentrating on the upcoming ballot.\n“It is really important that California become more progressive,” he said.\nIn a state with a long list of liberal ballot measures, Steyer and his political organization, NextGen Climate, are boosting some of the most progressive causes. So far, he has given $1 million to Proposition 56, which would hike cigarette taxes by $2 a pack to fund the Medi-Cal health plan for the poor, and $50,000 to Prop. 67, which would ban plastic shopping bags. Steyer also recently endorsed Prop. 62 to repeal the death penalty; his aide said a financial contribution is forthcoming.\nHis NextGen group even gave $61,000 to a campaign opposing money in politics. Prop. 59 asks voters if they want elected officials to take steps to repeal Citizens United, the U.S. Supreme Court decision that allowed unions and corporations to spend unlimited sums on political campaigns.\nSteyer said he looks for ballot measures that represent contests between ordinary Californians and major corporations trying to preserve their bottom line. Though health care interests have donated roughly $17 million to support the tobacco tax, cigarette companies have poured almost $56 million into opposing it, while plastic bag manufacturers have given $6.1 million to defeat the bag ban.\nHe frames his support for repealing Citizens United in similar terms, saying the Supreme Court’s ruling created a “David and Goliath situation” in American politics. Even as the nation’s largest super-PAC donor, Steyer identifies more with David. He calls his own political spending “a counterweight to what we see as an overwhelming amount of money representing corporate interests.”\nCharles Munger, Jr.\nA physicist who lives in Palo Alto, Munger is California’s biggest Republican donor and the son of a corporate billionaire.\nIn addition to funding GOP candidates, Munger has a long history of supporting ballot measures that have gradually altered the state’s political landscape by chipping away at power held by Democrats and their allies in organized labor. He contributed to past measures that created a neutral body to re-draw legislative and congressional districts, and paved the way for the state’s open primary system.\nThis year, Munger has poured $7.9 million into Prop. 54. It goes after the Legislature’s practice of writing and passing some bills at the last minute, without giving the public much chance to weigh in. The measure would require that all bills be published at least 72 hours before a vote.\n“No one citizen benefits from transparency so much that they would take the Legislature on over this, but everyone will benefit considerably, so it’s worthwhile doing this as a form of philanthropy,” Munger said.\nProp. 54 is endorsed by several chambers of commerce and groups that promote open government. “Our democracy is stronger the more we have more people participating,” said supporter Helen Hutchison, president of the League of Women Voters of California, adding that the measure is not partisan.\nBut Munger is the sole financial donor to Prop. 54, prompting critics to say that the measure is not about philanthropy but about evening the political playing field for Republicans and their business allies. With Democrats holding a solid majority in the Legislature, last-minute maneuvers typically pass despite Republican objections.\nMunger says he’s “under no illusions” that his idea would face any less resistance if he were pushing a transparency measure in a Republican-dominated state. “Whoever thinks they control the government never really wants a transparent government if they have an agenda that would best be moved by keeping the public ignorant.”\nHe noted that in 2006, when Republicans controlled the U.S. Senate, a Democratic senator wrote a bill to require all legislation be in print for 72 hours before a vote. That senator? Barack Obama.\nSean Parker\nOne of California’s marquee tech moguls is dropping big money into two California ballot measures. Sean Parker, the billionaire founder of Napster and first president of Facebook, has contributed $400,000 to Prop. 63, a gun-control measure, and $3.8 million to support Prop. 64, which would legalize recreational marijuana.\nBoth initiatives are backed by Democratic Lt. Gov. Gavin Newsom, who was a guest at Parker’s 2013 wedding—a lavish Big Sur bash that infuriated environmentalists because it involved building a dance floor and other construction near an ancient redwood forest. Parker has given Newsom more than $56,000 for his 2018 run for governor.\nParker did not respond to an interview request. Prop. 64 spokesman Jason Kinney said in a statement that Parker supports making marijuana use legal for adults as “an important cause for social justice.”\nMarijuana investment groups estimate that legalization could spawn a $6.5 billion industry in California by 2020. But Parker, according to Kinney, “has no current or future interest in the marijuana industry.”\nMichael Bloomberg\nWhen Newsom announced last year that he was sponsoring a gun-control initiative, many believed he could rely on the generous financial support of Michael Bloomberg.\nThe billionaire former mayor of New York had established Everytown for Gun Safety to help underwrite candidates and ballot measures that advance gun control. Nor is Bloomberg any stranger to California politics, having spent $2.5 million on state races over the past decade, and $1.5 million this year alone to put more fizz in local campaigns to hike soda taxes in Oakland and San Francisco.\nYet Bloomberg and his Everytown for Gun Safety group have yet to kick in a dime to the Prop. 63 campaign. Stacey Radnor, a spokeswoman for Everytown, says it doesn’t intend to—instead, Everytown is supporting ballot measures in Nevada and Maine that would require background checks for gun purchases, a requirement already on the books in California.\nNot that the Prop. 63 campaign acknowledges feeling bereft. Said spokesman Dan Newman in an email: “no one expects 1 or 2 people to do everything.”","url":"https://calmatters.org/articles/hey-big-spenders-three-multimillionaires-stake-a-claim-on-your-state-ballot/"}
