{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:40:14","date_modify":"2018-10-30 19:40:14","date_publish":"2017-03-05 15:01:08","description":"Hezbollah will strike nine sensitive chemical and nuclear sites in Israel, according to a new propaganda video.","filename":"data/vaneerConsumption/HezbollahClipWarnsOfStrikesOnNineIsraeliNuclearSites.json","image_url":"https://media.breitbart.com/media/2017/02/hezbollah-fighters-iran-getty-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_05__1540928414.html","title":"Hezbollah Clip Warns Of Strikes On Nine Israeli Nuclear Sites","title_page":"Hezbollah Clip Warns Of Strikes On Nine Israeli Nuclear Sites","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Hezbollah will strike nine sensitive chemical and nuclear sites in Israel, according to a new propaganda video released by a news website affiliated with the Lebanon-based terror group.\nThe clip, published by the al-Ahed news website, comes after Hezbollah leader Hassan Nasrallah made numerous threats saying the Shiite group is targeting Israel’s nuclear reactor in the southern city of Dimona and an ammonia plant in the northern city of Haifa.\nIn the opening sequence, the video shows what appear to be Russian S-300 missiles being fired and striking the Dimona nuclear reactor to the sound of alarms, the Times of Israel reported.\nThe video goes on to list eight other sites around Israel, including the Nahal Sorek desalination plant, the Kishon chemical plant, nuclear weapons research sites, and sites allegedly belonging to the IDF as storage facilities for ballistic weapons.\nThe clip also includes other sensitive information such as satellite images of the locations, amount of employees, the number of buildings per site and a description of toxic materials on each site.\nIsrael’s military has said that the terror group has between 100,000 and 120,000 short- and medium-range missiles and rockets, as well as several hundred long-range missiles, with the medium-range missiles capable of reaching Tel Aviv.\nHowever, there has been no evidence to suggest that Hezbollah has S-300 missiles as shown in the video.\nIn February, Minister of Intelligence Yisrael Katz warned that “all of Lebanon will be struck” if Nasrallah goes through with his threat to strike Israel’s vital infrastructure sites.\nAlso last month, Israel reportedly targeted Hezbollah-bound weapons in a series of airstrikes in Syria.\nEarlier this week, a Haifa court ruled that an ammonia plant in Haifa must be emptied out within ten days, partially in response to an Israeli officials’ warning that a missile strike on the site could cause tens of thousands of fatalities.","url":"https://www.breitbart.com/middle-east/2017/03/05/watch-hezbollah-propaganda-clip-warns-of-strikes-on-nine-israeli-nuclear-chemical-sites/"}
