{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:40:22","date_modify":"2018-10-30 19:40:22","date_publish":"2017-02-17 08:30:17","description":"Hezbollah is stronger than ever before with \"game-changing\" weapons provided by Iran and an ongoing partnership with Hamas' military wing.","filename":"data/vaneerConsumption/HezbollahReceivedGameChangingWeaponsFromIran.json","image_url":"https://media.breitbart.com/media/2016/09/hezbollahh.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_17__1540928422.html","title":"Hezbollah Received 'Game-Changing' Weapons From Iran","title_page":"Reports: Hezbollah Received 'Game-Changing' Weapons From Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Lebanon-based terror group Hezbollah is stronger than ever before, with “game-changing” weapons provided by Iran and an ongoing partnership with Hamas’ military wing, Lebanese reports have claimed.\nThe group is also reported to have increased its military activity south of the Litani River on the Lebanon-Israel border, in violation of UN Security Council Resolution 1701.\nAn editorial published on January 24 in the pro-Hezbollah daily Al-Akhbar and translated by the Middle East Media Research Institute (MEMRI) declared the terror organization as more capable than ever before of facing Israel in a direct confrontation, a fact that “greatly worries” the Israeli enemy.\nIsrael’s “vigorous efforts” to thwart Hezbollah, which include the targeted killings of senior operatives, have had the adverse effect of strengthening the group, the paper’s board chairman Ibrahim Al-Amin wrote. The terror group’s leadership has introduced “harsh retaliatory measures, up to and including readiness to enter an all-out confrontation,” he said.\nHezbollah’s involvement in the Syrian civil war has allowed “a vast supply of advanced, state-of-the art weapons of various kinds, including weapons provided by Iran, to flow into Hezbollah’s depots,” the editorial said.\nThe Lebanese terror group’s role in the civil war has had the other major benefit of increasing its presence along Israel’s northern border.\n“Moreover, the enemy [Israel] sees that Hezbollah, whose activity was once confined to the front along the Lebanese border, is now present along the [entire] northern front of occupied Palestine [i.e., also along the Syrian border], and has more room to maneuver than it had before.”\nFinally, writes Al-Amin, Hezbollah’s “vast influence,” not only in Syria, but in Iraq and Yemen and “other parts of the Arab and Muslim world” provides a counterpoint to Israel’s alliance with certain Arab nations.\nThese new facts on the ground have “forced the enemy to avoid direct military action on Lebanese soil, including localized operations,” the article said.\nAl-Amin also claims that Israel’s own assessment that Hezbollah is capable of firing 1,500 missiles a day underestimates the organization’s capabilities. Moreover, Israel is very much mistaken when it makes claims of sectarian strife between Hamas as a Sunni group and Shi’ite Hezbollah, Al-Amin said.\nA separate report published in Lebanese daily Al-Mustaqbal, owned by Lebanese Prime Minister Sa’ad Al-Hariri, a prominent political rival of Hezbollah, indicates that Hezbollah is violating UN Security Council Resolution 1701 by operating south of the Litani River, an area that was under Israel’s control until its withdrawal from Lebanon in 2000.","url":"https://www.breitbart.com/middle-east/2017/02/17/lebanese-reports-hezbollah-received-game-changing-weapons-iran/"}
