{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:38:46","date_modify":"2018-10-30 19:38:46","date_publish":"2016-08-15 07:19:07","description":"TEL AVIV – Hezbollah chief Hassan Nasrallah admits that the terror group’s entire budget is funded by Iran, an Arab news report claimed.","filename":"data/vaneerConsumption/HezbollahHamasOfficialsConfirmIranFundsOurActivity.json","image_url":"https://media.breitbart.com/media/2016/08/Ali-Khamenei.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_15__1540928326.html","title":"Hezbollah, Hamas Officials Confirm: Iran Funds Our Activity","title_page":"Hezbollah, Hamas Officials Confirm: Iran Funds Our Activity","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Hezbollah chief Hassan Nasrallah admitted that the terror group’s entire budget is provided by Iran, an Arab news report claimed.\nThe report is one of many that have appeared recently in Arab media, citing statements from senior officials confirming that terror organizations including Hezbollah, Islamic Jihad, and Hamas are receiving the lion’s share of their funding from Iran, mainly from the office of Iranian Supreme Leader Ali Khamenei and Iran’s Revolutionary Guards Corps (IRGC).\nIn a June speech delivered by Nasrallah following the imposition of U.S. sanctions on the terror group, the secretary-general clarified:\n“Hezbollah’s budget – its salaries and expenditures, its food and drink, weapons and missiles – [all come from] Iran. Is that clear?” Nasrallah was quoted saying to Lebanon’s Al Ahed news, translated by the Middle East Media Research Institute (MEMRI).\n“As long as Iran has money we have money. Do you require greater transparency than that[?] The funds earmarked for us do not reach us through the banks. We receive them the same way we receive our missiles with which we threaten Israel.”\nAround the same time, the deputy head of Hamas’s political bureau, Moussa Abu Marzouq, admitted that Hamas receives most of its funds from the Islamic Republic.\n“The aid extended by Iran to the Palestinian resistance in provisions, training, and funds is not comparable [to any other aid], and most other countries cannot match it,” Abu Marzouq tweeted on June 15.\nFormer Lebanese minister and known supporter of Hezbollah Wiam Wahhab also tweeted, “Iran funded resistance in Palestine to restore Jerusalem, Al-Aqsa, and the Church of the Sepulcher.”\nMeanwhile, anti-Iranian press outlets, such as the London-based Saudi daily Al-Sharq Al-Awsat, also reported on Iran’s funding of terrorist organizations in Lebanon and Gaza.\nA report in the Saudi daily stated that Hezbollah’s funds came from the office of Iranian Supreme Leader Ali Khamenei, while its weapons are provided by the IRGC.\nCiting the director of the Umam Research and Documentation center in Lebanon, Luqman Salim, a Shi’ite known for his opposition to Hezbollah, the report said between 70% and 80% of Hezbollah’s funds come from Iran.\nAccording to Salim, Iran also invests about $400 million of the IRGC’s budget in the Islamic Radio and Television Union, a group of stations that includes Hamas and Hezbollah-run channels.\nThe daily also claimed that immediately after the 2006 Lebanon War, Iran increased its budget to Hezbollah by as much as $650 million.\nHowever, since Hezbollah intervened in the Syrian civil war, the budget was increased to an unlimited amount from a reported $850 million. According to the report, Iran views Hezbollah’s activities in Syria as part of its own war effort.\nIran also restored aid to Gaza-based Islamic Jihad after suspending its aid to the terror group following disagreements concerning the crisis in Yemen. Al-Sharq Al-Awsat reported that an Islamic Jihad delegation headed by the organization’s secretary-general Ramadan Shalah visited Iran in April 2016; during this visit, Tehran renewed its sponsorship of the organization after the latter accepted its terms.","url":"https://www.breitbart.com/middle-east/2016/08/15/hezbollah-hamas-officials-confirm-iran-funds-our-activity/"}
