{"authors":["Paul Bentley","Eleanor Harding","Sian Boyle For The Daily Mail"],"date_download":"2018-10-22 21:29:33","date_modify":"2018-10-22 21:29:33","date_publish":"2016-01-11 00:48:57","description":"HHUGS supports the family of Abdel-Majed Abdel Bary, an Islamic State fighter whose father Adel is a convicted terrorist linked to Osama Bin Laden.","filename":"data/vaneerConsumption/HHUGScharitysupportsISISfighterAbdelMajedAbdelBarysfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/20B9CB4600000578-0-image-a-72_1452473315922.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393170_Campaigning-campus-group-helps-families-killers_1540243773.html","title":"HHUGS charity supports ISIS fighter Abdel-Majed Abdel Bary's family","title_page":"HHUGS charity supports ISIS fighter Abdel-Majed Abdel Bary's family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A notorious group that funds terrorists’ families has been allowed to campaign for donations at a leading university, the Daily Mail can reveal.\nHHUGS supports the family of Abdel-Majed Abdel Bary, an Islamic State fighter whose father Adel is a convicted terrorist linked to Osama Bin Laden.\nBut in November it was permitted to campaign unopposed during a talk at the London School of Oriental and African Studies by Moazzam Begg, director of the CAGE group which described Jihadi John as ‘a beautiful young man’.\nIn December students at SOAS held a Christmas appeal for donations to HHUGS, calling it a ‘great cause’.\nAbdel-Majed Abdel Bary posing with an assault rifle. He is a British jihadist fighting in Syria\nHHUGS – Helping Households Under Great Stress – provides ‘practical support and advice’ to families of those arrested under UK anti-terror laws.\nThe group has published articles in support of terrorist Munir Farooqi, a former Taliban fighter given four life sentences in 2011 for trying to recruit jihadi fighters. It also once published an article on its website which claimed there was ‘no evidence’ for Bin Laden’s involvement in 9/11.\nThe group’s supporters include Sheikh Haitham al-Haddad – an imam who has described homosexuality as ‘a criminal act’ and defended the practice of female genital mutilation – and Lauren Booth, the Muslim sister-in-law of Tony Blair.\nShe was quoted in a HHUGS leaflet as saying: ‘Our brothers are routinely being taken from their homes, households are wrecked and they are held often without charge and when they are charged families are often left alone. HHUGS gives emotional and practical support to those left behind.’\nUndercover reporters from the Mail Investigations Unit found HHUGS running a stall at a lecture on November 2 at SOAS about ‘wrongly imprisoned’ Islamists, titled ‘Brothers Behind Bars’. A female member of the group in a niqab was giving out promotional cards, including one about Adel Abdel Bary. Forms requesting donations were also given to students.\nHHUGS has covered bills, tuition fees, food vouchers and even driving lessons for the Bary family, who live in a £1million home in Maida Vale, North-West London.\nThe card handed out at the SOAS event stated: ‘Adel Abdel Bary – Detained without charge since 1999.’\nHHUGS supports the family of Abdel-Majed Abdel Bary, an Islamic State fighter whose father Adel is a convicted terrorist linked to Osama Bin Laden\nIn fact in 2014 Bary, 55, admitted working for Al Qaeda and Egyptian Islamic Jihad after being extradited to the US from Britain. Last February he was sentenced to 25 years in a US jail for conspiring to kill Americans in the 1998 embassy bombings in Africa which left 224 dead.\nThe card handed to students also did not mention that Bary’s son Abdel-Majed Abdel Bary is a terrorist fighting for IS who has posed on social media with a severed head.\nHHUGS paid out £172,259 to ‘those living in financial hardship’ last year. The charity says no money goes to convicted terrorists or those involved in extremism, only to their dependants.\nA spokesman for HHUGS said it was an ‘oversight’ that it handed out the leaflet about Bary’s case at the SOAS event. ‘The postcard was produced in 2010 at a time when Mr Bary was detained without charge,’ he said. ‘The postcards should not have been utilised at the stall.’\nHe added: ‘We can confirm that HHUGS has never provided any support to Abdel-Majed Abdel Bary.’\nThe Bary family declined to comment. Lauren Booth did not respond to requests for comment. SOAS said: ‘These events were legal and no concerns were raised with us by police.’\nSOAS has previously said it takes its duty of care and legal obligation in relation to extremism ‘very seriously’.\nHowever, Rupert Sutton, director of Student Rights - a project run by the Henry Jackson Society think tank - said: ‘It is impossible to take SOAS' claims of a robust approach to this issue seriously when they have turned a blind eye to the student union funding a group like HHUGS, or given extremists an unchallenged platform to call for the release of convicted terrorists.","url":"https://www.dailymail.co.uk/news/article-3393170/Campaigning-campus-group-helps-families-killers.html"}
