{"authors":["John Mcgarry For The Scottish Daily Mail"],"date_download":"2018-10-22 20:20:55","date_modify":"2018-10-22 20:20:55","date_publish":"2016-01-29 01:14:31","description":"Whatever else Alan Stubbs can be accused of, hiding his light under a bushel is not one of them. n with a chance of winning a Treble? Check. Favourites to see off St Johnstone? Absolutely.","filename":"data/vaneerConsumption/HibsbossAlanStubbsishappytogopublicwithhisboldambitions.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AB92BA00000578-0-image-a-28_1454028872419.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422037_Hibs-boss-Alan-Stubbs-happy-public-bold-ambitions_1540239655.html","title":"Hibs boss Alan Stubbs is happy to go public with his bold ambitions","title_page":"Hibs boss Alan Stubbs is happy to go public with his bold ambitions  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Whatever else Alan Stubbs can be accused of, hiding his light under a bushel is not one of them.\nIn with a chance of winning a Treble? Check. Favourites to see off St Johnstone? Absolutely. Happy with the expectation a comparatively big budget brings? You’d better believe it.\nThose who would remind the Hibs boss that pride has an unfortunate habit of coming before a fall need not waste their breath.\nHibs manager Alan Stubbs is confident his side can see off St Johnstone on Saturday\nIn the Liverpudlian’s opinion, anyone seeking to succeed in football without an overwhelmingly positive mind-set is attempting to run with their legs tied together. If the price of stating lofty ambitions so publicly is the potential to be wiping the odd bit of egg from his chin, that’s not something likely to induce amnesia.\n‘We’re going into a gameagainst a team from a higher division,’ Stubbs said. ‘Do you want me to turn round and say: “It’s going to be difficult today, we’re underdogs, we’ve no chance of winning?”\n‘I think sometimes that’s what people want me to say. I’m not going to say it. I am what I am.’\nIf pinning a favourites badge on Hibs was part of Saints boss Tommy Wright’s plan to somehow spark a war of words, then it’s failed miserably.\nStubbs might well have dismissed his superior budget and pointed to the fact that Saints play in a higher league as being more relevant, yet he opted not to do so. The only label that concerns him is which of tomorrow’s sides will be called League Cup finalists by the close of play.\n‘I’m not going to turn round and say anything different,’ he added. ‘I can understand why Tommy said that but I don’t think there’s any relevance to it.\nStubbs says experience and luck will be the key factors in Saturday's semi-final clash\n‘They’ve won a Scottish Cup, they’ve qualified consistently for Europe and they’ve got a lot of experience in the team.\n‘On the day, it’s going to be about who turns up and plays best, with a little bit of luck along the way. I don’t think it’s whether they’re favourites or we’re favourites. When that whistle blows, it means nothing.’\nA Championship side maintaining a Premiership budget - as Hibs have done - is admirable in many ways but Stubbs needs no telling it comes with a responsibility to deliver success.\n‘I’m thankful I’m in the position where I’ve been allowed to spend. We feel as if we’ve brought in some really good additions and the team is going in the right direction from the one I inherited. Yes, my budget probably is bigger. I’m happy it’s bigger.\n‘It’s great. I want a team that wins things. I want my team to emulate me and what the club stands for. We want to be successful. So you have to speculate to accumulate. I’ve no problem with the expectation.’\nWhat would it reasonably be this season? Most Hibs fans would settle for promotion. Capturing the League Cup would be a considerable compensation. As for the Scottish? Perhaps best not to go there.\nAmbitous Hibs are still in with a shout of lifting three trophies in May\nYet Stubbs is on record as saying a clean sweep is possible. A positive mind-set is all very well but isn’t that coming close to promising the earth?\n‘It’s a fact isn’t it? We are in three competitions. Do you want me to say: “We don’t really want to win two of them?” If I said that, I’d be criticised.\n‘Ourselves and Celtic are the only teams that are realistically in three competitions. Is that me being too confident?\n‘We are in three competitions. Fantastic. Whether we can win them is going to be so difficult. We want to try and win them.’\nStubbs’ approahc is rooted in experience. Even if privately he probably wouldn’t wager bad money on HIbs lifting three trophies come May, he believes to suggest otherwise in public would make absolutely certain it wouldn’t happen.\n‘When you go into a game facing some of the players I’ve faced, you’d realise why I went in thinking I couldn’t win,’ he said. ‘Not for Celtic - when I was playing for Everton sometimes there were games when I thought it was going to be unbelievably difficult. But, of course, I was in the dressing room beforehand saying: “We can win this.”\n‘Reverse psychology is great, isn’t it? I honestly do believe we’ve got an optimistic chance of winning something.\n‘Players are fantastic at seeing the body language of managers and staff and they pick up on the least little thing that comes out of a manager’s mouth.","url":"https://www.dailymail.co.uk/sport/football/article-3422037/Hibs-boss-Alan-Stubbs-happy-public-bold-ambitions.html"}
