{"authors":["Shankar Vedantam","Maggie Penman","Max Nesterak"],"date_download":"2018-10-22 21:59:54","date_modify":"2018-10-22 21:59:54","date_publish":"2016-01-19 00:00:00","description":"Today is the perfect day to (re)start your resolution. Here's how.","filename":"data/vaneerConsumption/HiddenBrainNPR.json","image_url":"https://media.npr.org/assets/img/2016/01/15/5570923634_3c0ec0026e_o_wide-f024dc31b0602be5803a0a725b151effde7b24e4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_01_18_463220298_why-its-not-too-late-to-make-a-new-years-resolution_1540245594.html","title":"Hidden Brain : NPR","title_page":"Resolutions | Hidden Brain : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Why It's Not Too Late To Make A New Year's Resolution\nHidden Brain Resolutions Episode 17: Resolutions Listen · 23:38 23:38\nThis week we're talking about New Year's resolutions. A little late, aren't we? Nope. We're just in time.\nA good portion of you have likely already fallen off the proverbial wagon, and we thought, well, we could help you get back on. If you have stuck to your resolution so far, way to go! This episode is also for you.\nHere's some good news: our News Assistant Max Nesterak is 19 days without a cigarette and counting. We're using social science to help him stick with it. You'll hear from him this week as well as Daniel Pink who joins Shankar with resolution research for another round of Stopwatch Science. Here are the studies:\nWhen you're working towards a goal or in a stressful situation, you likely talk to yourself in the first person. You ask, \"Why do I feel this way?\" or \"Should I eat a third Krispy Kreme?\" In several experiments, researchers found when people used second or third person self-talk (e.g. \"Why does Dan feel this way?\") they reported feeling less anxious and actually performed better in challenging situations—in one case, giving a speech before a bunch of strangers with no time to prepare.\nQuitting smoking is hard. But it's not impossible. A group of economists found smokers do better when they placed themselves in a financial bind. They had a group of volunteers quitting smoking deposit money into a savings account. If, after 6 months, they passed a surprise nicotine test, the money was returned. If not, that money went to charity. This group was a bit more likely to stay smoke free than the group that did not ante up (You can use this strategy for lots of different goals with StickK, a web tool developed by one of this study's authors).\nOkay, the holidays are over. If you made a resolution to eat healthier or slim down, there should be more brussel sprouts and apples and carrots in your fridge. But are there also a lot of pudding cups and pizza rolls? Researchers at Cornell University tracked shopping habits leading up to, during, and after the holiday season. Predictably, they found sales of unhealthy foods went up during the holidays and sales of healthy foods went up after the holidays. But, sales of unhealthy foods never went down after the holidays—people just bought more food.\nIf you have a goal this year, you know what it is and if you're on track to reach it. But have you reflected on why you have it? Researchers studying West Point students found cadets with strong internal motivations (to serve their country, to be an army officer, etc.) fared better than those with instrumental motivations (to get a high-paying job, to go to school tuition-free, etc.).\nWish you heard this before New Year's? There's just something about that date isn't there? Well, as Shankar discusses with Audie Cornish in the episode, there are plenty of days coming up with plenty of symbolic power—the start of Aquarius, Monday, our producer Kara's birthday. Research shows we like \"fresh starts,\" and they do come more frequently than once a year.\nThe Hidden Brain Podcast is hosted by Shankar Vedantam and produced by Kara McGuirk-Alison and Maggie Penman. Max Nesterak is our News Assistant. Follow us on Twitter @hiddenbrain, @karamcguirk, @maggiepenman and @maxnesterak, and listen for Hidden Brain stories every week on your local public radio station.","url":"https://www.npr.org/2016/01/18/463220298/why-its-not-too-late-to-make-a-new-years-resolution"}
