{"authors":["Associated Press"],"date_download":"2018-10-23 04:56:08","date_modify":"2018-10-23 04:56:08","date_publish":"2017-04-26 16:30:59","description":"PORT MAHON, Del. (AP) - Federal officials say humpback whales have been dying in unusually large numbers along the Atlantic Coast.The News Journal reports...","filename":"data/vaneerConsumption/HighnumbersofhumpbackwhalesdyingoffAtlanticcoast.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467143-1493230883-540_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448338_High-numbers-humpback-whales-dying-Atlantic-coast_1540270568.html","title":"High numbers of humpback whales dying off Atlantic coast","title_page":"High numbers of humpback whales dying off Atlantic coast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PORT MAHON, Del. (AP) - Federal officials say humpback whales have been dying in unusually large numbers along the Atlantic Coast.\nThe News Journal reports (http://delonline.us/2ow4S5j) that the National Oceanic and Atmospheric Administration Marine Fisheries declared it an \"unusual mortality event,\" which is called when higher-than-normal numbers of marine mammals die for unknown reasons. An agency spokeswoman says details will be provided Thursday.\nMarine Education, Research and Rehabilitation Institute Executive Director Suzanne Thurman says a decomposing whale washed into shallow water in the Delaware Bay recently, but weather is hampering efforts to study it. Thurman says it apparently was a juvenile humpback. If confirmed, it would be the fourth stranded in Delaware waters in a year, an unusually high number.\nThis April 24, 2017 photo provided by MERR Institute, Inc. shows a dead whale at Port Mahon, Del. Federal officials said humpback whales have been dying in unusually large numbers along the Atlantic Coast. (Suzanne Thurman/MERR Institute, Inc. via AP)\nFour have stranded off Virginia and there was a stranding last fall off Long Island.\n___\nInformation from: The News Journal of Wilmington, Del., http://www.delawareonline.com","url":"https://www.dailymail.co.uk/wires/ap/article-4448338/High-numbers-humpback-whales-dying-Atlantic-coast.html"}
