{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 04:14:48","date_modify":"2018-10-23 04:14:48","date_publish":"2017-03-16 15:28:08","description":"The footage, taken inside a takeaway joint in Huddersfield, shows the angry woman lunging for the man when he taunts her about benefits during a late-night row.","filename":"data/vaneerConsumption/HighheeledclubberSMACKSmanandsparksburgerbarbrawl.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E5534CB00000578-0-image-a-76_1489677853505.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320698_High-heeled-clubber-SMACKS-man-sparks-burger-bar-brawl_1540268088.html","title":"High-heeled clubber SMACKS man and sparks burger bar brawl","title_page":"High-heeled clubber SMACKS man and sparks burger bar brawl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A brawl broke out in a burger bar after a high-heeled reveller slapped a man across the face when he taunted her for being a 'Jeremy Kyle reject'.\nThe footage, taken inside a takeaway joint in Huddersfield, shows an angry woman - who is wearing chunky platforms and a has a midriff on show - shouting furiously at a fellow customer, as his friend tries to protect him.\nBut when the man shouts 'you f****** Jeremy Kyle reject', the woman lunges towards him, slapping him around the face and shouting: 'I'm going to f*** you up'.\nThe clip, taken inside a takeaway joint in Huddersfield, shows an angry woman - who is wearing chunky platforms and a has a midriff on show - lunging at a fellow customer (left and right)\nAs she continues to shout 'what, what?', the man then asks her 'what, have you lost your benefits?'.\nShe then swings for him again and he returns the punch, causing her to fall out of the camera view.\nAnother female customer - who is wearing knee high boots and a mini skirt - then jumps in, dropping her clutch bag as she tries to punch the man.\nThe pair then end up wrestling on the floor as two more men get involved.\nAnother female customer - who is wearing knee high boots and a mini skirt - then jumps in, dropping her clutch bag as she tries to punch the man (left and right)\nFootage shows the five-strong group brawling on the floor (left and right), before they get up and go their separate ways\nFootage shows the five-strong group brawling on the floor, before they get up and go their separate ways.\nBut, seconds later, the drama picks up again as the first woman starts threatening the men again. At the end, the first woman is seen picking up her takeaway from the counter and walking out with it in her hand.\nThe footage - which has been watched more than 220,000 times - was posted on Facebook and was captioned as 'the funniest thing I've seen in all my life'.\nThe caption adds: '2:15am in Huddersfield for ya.'","url":"https://www.dailymail.co.uk/news/article-4320698/High-heeled-clubber-SMACKS-man-sparks-burger-bar-brawl.html"}
