{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:24:04","date_modify":"2018-10-30 19:24:04","date_publish":"2015-02-24 20:40:19","description":"German engineering company Siemens is assembling a 50-foot, life-size model of California's as-yet-unbuilt high-speed train on the steps of the state Capitol in Sacramento. |","filename":"data/vaneerConsumption/HighSpeedRailModelAssembledonStepsofCACapitol.json","image_url":"https://media.breitbart.com/media/2015/02/Bullet-Train-in-Sacramento-Facebook.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_02_24__1540927444.html","title":"High-Speed Rail Model Assembled on Steps of CA Capitol","title_page":"High-Speed Rail Model Assembled on Steps of CA Capitol | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"German engineering company Siemens is assembling a 50-foot, life-size model of California’s as-yet-unbuilt high-speed train on the steps of the state Capitol in Sacramento.\nThe model train will be open to the public on Wednesday and Thursday this week, according to local NBC affiliate KCRA.\nThe full-size train replica will reportedly include a snack bar, driver’s compartment, and passenger seats that curious Sacramento residents can climb into and check out for themselves.\n“We thought it would be a good idea to show people how high-speed rail will look in California,” Siemens’ U.S. director of high-speed rail, Armin Kick, told KCRA.\nSiemens is one of at least nine companies bidding for what is estimated to be a $1.87 billion state contract to build the trains. Other companies vying for the contract reportedly include Sun Group (China), Alstom Transportation (France), Ansaldo Bred (Italy), CSR Corporation (China), Hyundai Rotem (South Korea), Kawasaki Rail (Japan), Bombardier Transit (Canada), and Talgo (Spain).\nThe High-Speed Rail Authority (HSRA) has reportedly stipulated that the winner of the contract must manufacture the trains in the United States.\nKick told KCRA that if Siemens wins the contract, the company will build the trains in its downtown Sacramento light-rail vehicle manufacturing facility, bringing “a couple hundred jobs” to the area.\nPeople walking near the Capitol on Monday stopped and stared as the model train was assembled using cranes and rigs.\n“I thought it was amazing,” West Sacramento resident Amanda Delfin told KCRA. “I’m so excited that it’s here.”\nGordon Dunham, also of Sacramento, disagreed. “Can’t we spend our money on something more that we need?”\nThe initial budget for the complete high-speed rail project is estimated to be $68 billion, although the final figure is likely to be significantly larger.\nA late 2013 Los Angeles Times poll revealed that 52% of the state’s voters oppose the construction of California’s high-speed rail. Just 43% supported the project.","url":"https://www.breitbart.com/local/2015/02/24/high-speed-rail-model-assembled-on-steps-of-ca-capitol/"}
