{"authors":[],"date_download":"2018-10-22 20:54:32","date_modify":"2018-10-22 20:54:32","date_publish":"2014-05-04 18:27:54","description":"Dramatic new video shows the terrifying moment nine circus performers were injured as a high-wire act went awry.","filename":"data/vaneerConsumption/HighWireAcrobatsInjuredWhenRinglingBrosCircusActFalls.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/419306/1400504-circus-accident-jms-1553_edf9ead8e97247e9b41d278c3750989d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_circus-accident_high-wire-acrobats-injured-when-ringling-bros-circus-act-falls-n96736_1540241672.html","title":"High-Wire Acrobats Injured When Ringling Bros. Circus Act Falls","title_page":"High-Wire Acrobats Injured When Ringling Bros. Circus Act Falls ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA terrifying moment in a high-wire act in which nine circus performers were injured — two of them critically — was captured in a dramatic video.\nThe chaos unfurled at the 11 a.m. Ringling Brothers and Barnum and Bailey Circus' performance in Rhode Island on Sunday.\nAfter the announcer built dramatic tension, a curtain dropped and performers began a high-wire ballet act, hanging from their hair about 35 feet from the floor.\nSeconds later, the video obtained by NBC News shows, the platform dropped unexpectedly and the performers, who were working with no net, plunged to the floor.\nThe video may be disturbing for some to watch.\nScreams could be heard as other performers ran to help. Due to the severity of the injuries, ambulances were brought into the arena before the audience was ushered out, officials said.\nEight female \"hairialists\" fell and one dancer was injured on the floor below, according to a spokesman for circus, which was at the Dunkin' Donuts Center in Providence.\nThe cause is unknown, but fire, police and the Occupational Safety and Health Administration are investigating.\n\"Obviously something happened that shouldn't have happened,\" Providence Public Safety Commissioner Steven Pare said at an evening press conference.\nAccording to local NBC affiliate NECN, the fall happened right before intermission.\nAletha Wood, who recorded the video, was at the show with her 4-year-old daughter, 3-year-old son and her father.\n\"I initially did not realize that it was an accident — the crowd kinda gasped, as people often do when people are doing death-defying things in front of them,\" Wood told NBC News. \"Wasn't until eight to 10 seconds later (that people realized the tragedy) and then there was silence from 5,000 people.\"\nSydney Bragg, 14, of North Kingstown, said the collapse happened about 90 minutes into the show. She said the platform began to fall as it neared the rafters of the arena.\nAt first, she said, she thought it was part of the act. \"It just went crashing down,\" Sydney said. \"Everyone was freaking out. We heard this huge clatter and then we just heard the girls scream.\"\nShe said spotlights were on the performers at the time, but all the lights went out after the fall.\nWood, 34, said that clowns and other performers immediately came into the crowd to try to keep the mood light, while emergency service personnel attended to the injured.\nShe said her own daughter, who was aware of the dangerous conditions even before the fall, said later, \"that’s why you don’t do that at home.\"\nWood said one female performer was especially motionless for a long time while the paramedics worked, and worried parents in the crowd spelled words like \"d-e-a-d\" and \"k-i-l-l-ed\" so as not to spook their little kids.\nBut when the woman was finally lifted into the ambulance, she waved her hand, and the audience erupted.\n\"The crowd went wild — wild like when someone wins a sporting events,\" she said.\nFeld Entertainment, the parent company of Ringling Bros., canceled the 7 p.m. show and 10:30 a.m. Monday show and the arena said aerial acts for other shows would be grounds until investigators figure out what went wrong and how to fix it.\nLarry Lepore, general manager of the arena, said Ringling is very safety-conscious and that he had seen the unit that dropped being inspected.","url":"https://www.nbcnews.com/storyline/circus-accident/high-wire-acrobats-injured-when-ringling-bros-circus-act-falls-n96736"}
