{"authors":["Associated Press"],"date_download":"2018-10-23 00:04:14","date_modify":"2018-10-23 00:04:14","date_publish":"2017-03-16 08:49:15","description":"WASHINGTON (AP) - As a new president who has vowed to keep his campaign promises, Donald Trump knows he'll be judged on whether he can repeal the so-called...","filename":"data/vaneerConsumption/HighstakesforTrumponGOPhealthcarebill.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227463-1489654800-276_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319272_High-stakes-Trump-GOP-health-care-bill_1540253054.html","title":"High stakes for Trump on GOP health care bill","title_page":"High stakes for Trump on GOP health care bill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - As a new president who has vowed to keep his campaign promises, Donald Trump knows he'll be judged on whether he can repeal the so-called Obamacare law and replace it with something new.\nDealing with skepticism from conservatives and moderates alike, the White House is considering changes to the bill that might reassure conservatives, all in an effort to muscle through the GOP-backed health care plan in the House next week. Trump, who is not steeped in policy, has signaled that he's open to negotiation in his first attempt working with Congress.\n\"The House has put forward a plan to repeal and replace Obamacare, based on the principles I outlined in my joint address, but let me tell you we're going to arbitrate, we're going to all get together, we're going to get something done,\" Trump told a Wednesday night rally in Nashville, as supporters waved signs that read \"Promises Made, Promises Kept.\"\nPresident Donald Trump speaks at a rally Wednesday, March 15, 2017, in Nashville, Tenn. (AP Photo/Mark Humphrey)\nTrump is focused on delivering his \"repeal and replace\" promise and is likely to be flexible on the fine print dividing moderate and conservative Republicans in the policy fight, said a person familiar with the president's thinking, who spoke on condition of anonymity to share private discussions.\nSpeaking to reporters on Air Force One Wednesday night after the rally, Trump said he expected to get a health care bill through, adding: \"It's going to get all mixed up and we're going to come up with something. We always do.\"\nThe approach reflects a keen awareness within the White House of how much is riding on the effort. Trump made repealing and replacing his predecessor's health care law a core campaign promise, although he has acknowledged he was surprised at how complex the task would be. Failing to pass a bill while his party controls both the House and Senate would be a devastating blow to his party and the premise of his presidency - that he was a dealmaker the country needed.\nStill, Trump keeps stressing the legislation is far from finished, telling Fox News Wednesday that \"We will take care of our people or I'm not signing it, OK, just so you understand. This is very preliminary.\"\nThat approach also has made some allies nervous that the transactional president may be more committed to striking a deal, than passing the legislation as crafted by House Republican Speaker Paul Ryan. A bruising, independent analysis of the bill has underscored the political risks involved for some moderate Republicans. It's a risk they're unlikely to take without a commitment from the president.\nThe White House this week has sought to ease such concerns, launching a full-court press. Trump touted the bill at his rally, saying \"the House legislation does so much for you.\"\nTrump added: \"The bill that I will ultimately sign - and that will be a bill where everybody is going to get into the room and we're going to get it done - we'll get rid of Obamacare and make health care better for you and for your family.\"\nA senior administration official said Wednesday that the White House was actively working with members and leadership to push the House bill through. The official called Trump very committed, saying he frequently reminds Republican lawmakers that they all campaigned on repeal and replace.\nRepublican leaders' task of striking a balance on a bill that will appeal to both conservative and moderate Republicans is proving difficult. Republicans hold a 44-seat margin in the House with five vacancies, meaning that if every Democrat opposes the measure, as expected, the GOP could lose 21 votes and still pass the bill.\nThe findings by the nonpartisan Congressional Budget Office that 14 million people would lose health care coverage in the first year alone and 24 million in all by 2026 applied pressure to moderate Republicans wary of being accused in the 2018 mid-term elections of ripping away health insurance.\nAfter the CBO released its findings, House Republicans such as Reps. Ileana Ros-Lehtinen of Florida and Leonard Lance of New Jersey said they couldn't back the current House plan because it would leave too many people uninsured and they were worried it would not pass the Senate.\nBut if Republicans try to make improvements to help moderate members, that could alienate conservatives. The White House has been courting about 40 conservative House members who are part of the \"Freedom Caucus\" and have raised objections to the bill's use of tax credits - which they liken to another government entitlement - and the timing on curtailing the expansion of Medicaid to states.\nGOP Rep Mark Meadows of North Carolina, who chairs the conservative Freedom Caucus that is demanding changes to the bill, said that contrary to claims by GOP leaders that Trump helped craft their bill and fully supports it, the president is open to alterations.\n\"I think he is looking for amendments to be made to make it better,\" Meadows said, adding that he's been working directly with the administration, not with congressional leadership.\nMeadows and Sen. Ted Cruz, a Texas Republican, co-authored an opinion piece published online Wednesday in The Wall Street Journal, outlining steps to be taken to repeal the health law.\nRepublicans, however, do not expect wholesale changes to the bill before it reaches the House floor next week. \"I don't think there's enough room for him to cut and run from Ryan and do his own deal because the bill sits on a tight-rope,\" said former Rep. Thomas Reynolds of New York, a Republican lobbyist. \"There's not a lot of room. They may be able to make some adjustments, but it's more adjusting about how they cobble together\" enough votes to pass the bill.\n___\nAP Congressional Correspondent Erica Werner contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4319272/High-stakes-Trump-GOP-health-care-bill.html"}
