{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:42:42","date_modify":"2018-10-30 18:42:42","date_publish":"2015-03-12 17:50:07","description":"Child advocates are urging Mattel Inc. to cancel its planned release of \"Hello Barbie,\" the latest edition of the iconic brand, citing concerns over both the privacy and the possible exploitation of children.","filename":"data/vaneerConsumption/HighTechTalkingBarbieRecordsChildren.json","image_url":"https://media.breitbart.com/media/2015/03/hello-talking-barbie-Mark-Lennihan—AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_12__1540924962.html","title":"High-Tech Talking Barbie Records Children","title_page":"High-Tech Talking Barbie Records Children","title_rss":"NULL","source_domain":"breitbart.com","text":"Child advocates are urging Mattel Inc. to cancel its planned release of “Hello Barbie,” the latest edition of the iconic brand, citing concerns over both the privacy and the possible exploitation of children.\nIn an attempted revival of the iconic Barbie doll, Mattel is using voice-recognition software and Wi-Fi, which now allows the doll to “listen” and respond to children.\nA Mattel toy representative introduced the newest version of the iconic Barbie doll at a fair in New York by simply saying: “Welcome to New York, Barbie.”\nBarbie, responded: “I love New York! Don’t you? Tell me, what’s your favorite part about the city? The food, fashion or the sights?”\nWatch the demonstration:\nWhile Mattel insists “Hello Barbie” was only developed for girls who have always wanted to be able to talk to their favorite toy, Susan Linn of the Campaign for a Commercial-Free Childhood, says the doll is “creepy” and “dangerous.”\nExpected to arrive in stores this fall, Linn’s group is asking Mattel to stop all production and marketing of Hello Barbie.\n“Kids using ‘Hello Barbie’ aren’t only talking to a doll, they are talking directly to a toy conglomerate whose only interest in them is financial,” she said Wednesday.\nThe Center on Privacy and Technology at Georgetown University’s Angela Campbell also chimed in on the new release, stating: “If I had a young child, I would be very concerned that my child’s intimate conversations with her doll were being recorded and analyzed.”\nShe continued:\nIn Mattel’s demo, Barbie asks many questions that would elicit a great deal of information about a child, her interests and her family… This information could be of great value to advertisers and be used to market unfairly to children.\n“Mattel is committed to safety and security,” Stephanie Cota, Senior VP for global communications at the toy company said in the statement and insisted “Hello Barbie” is in compliance with government standards and has enacted safeguards to protect children’s data from access by “unauthorized users.”","url":"https://www.breitbart.com/entertainment/2015/03/12/child-advocates-to-mattel-stop-production-on-creepy-talking-barbie/"}
