{"authors":["Associated Press"],"date_download":"2018-10-23 01:10:08","date_modify":"2018-10-23 01:10:08","date_publish":"2017-04-26 11:20:32","description":"PURCHASE, N.Y. (AP) - Higher prices helped lift PepsiCo's sales in the first quarter, as the maker of Doritos, Gatorade and Quaker worked on transforming its...","filename":"data/vaneerConsumption/HigherpriceshelpsalesasPepsiCoworkstoadaptbrands.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465395-1493212553-703_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447136_PepsiCo-tops-Street-1Q-forecasts_1540257008.html","title":"Higher prices help sales as PepsiCo works to adapt brands","title_page":"Higher prices help sales as PepsiCo works to adapt brands | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PURCHASE, N.Y. (AP) - Higher prices helped lift PepsiCo's sales in the first quarter, as the maker of Doritos, Gatorade and Quaker worked on transforming its lineup of products to keep up with changing tastes.\nSales for the North America Beverages and Frito-Lay North America segment both climbed 2 percent in the quarter, as pricing offset a decline in volume. Like other major food and beverage companies including Coca-Cola and Oreo cookie maker Mondelez, PepsiCo has said it is working on adapting its stable of brands to better reflect the trend toward options that people feel are healthier.\n\"Snacks are simple pleasure in life. What we're doing is making our snacks more permissible,\" PepsiCo CEO Indra Nooyi said during a call with analysts. That includes by offering options with reduced fat or sodium, she said.\nFILE - In this July 9, 2015, file photo, Pepsi bottles are on display at a supermarket in Haverhill, Mass. PepsiCo Inc. reports earnings, Wednesday, April 26, 2017. (AP Photo/Elise Amendola, File)\nThe recent passage of soda taxes in a handful of U.S. cities underscores the pressure Coca-Cola and PepsiCo in particular may be feeling to change their offerings. Earlier this year, Pepsi said sales were down 40 percent in Philadelphia after the city passed a tax on sweetened drinks, including diet sodas made with artificial sweeteners.\nWhen asked about the potential effect of such measures on PepsiCo, Nooyi said the company is making products with less sugar and bolstering the rest of its product portfolio to help cushion any impact.\nEven as major U.S. packaged food companies face growth challenges in the crowded U.S. market, higher prices or new products that cost more can still help lift sales. On Tuesday, Coca-Cola said revenue rose 1 percent in North America for the first quarter, even though volume was flat. Both PepsiCo and Coca-Cola have also been slashing costs to improve their financial results.\nFor the period ended March 25, PepsiCo Inc. earned $1.32 billion, or 91 cents per share. A year earlier the food and beverage company earned $931 million, or 64 cents per share. Removing restructuring charges and one-time costs, earnings were 94 cents per share. That's better than the 91 cents per share that analysts surveyed by Zacks Investment Research expected.\nRevenue rose to $12.05 billion from $11.86 billion. Analysts predicted $11.97 billion in revenue.\nPepsiCo, based in Purchase, New York, still foresees full-year earnings of $5.09 per share, just below analyst projections for $5.14.\nShares fell slightly before the opening bell Wednesday.\n_____\nElements of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on PEP at https://www.zacks.com/ap/PEP\n_____\nKeywords: PepsiCo, Earnings Report, Priority Earnings","url":"https://www.dailymail.co.uk/wires/ap/article-4447136/PepsiCo-tops-Street-1Q-forecasts.html"}
