{"authors":[],"date_download":"2018-10-30 18:09:08","date_modify":"2018-10-30 18:09:08","date_publish":"2015-07-29 15:00:00","description":"After a nine-month search, evaluating candidates from across the country and overseas, the High Museum of Art has chosen Randall Suffolk, currently the director of the Philbrook Museum of Art in Tulsa, Okla.","filename":"data/vaneerConsumption/HighMuseumannouncesRandallSuffolkasnewdirector.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/29/Images/photos.medleyphoto.7787538.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_0f79c1dea5146394c7af8f401dc91cd4__1540922948.html","title":"High Museum announces Randall Suffolk as new director","title_page":"High Museum announces Randall Suffolk as new director","title_rss":"NULL","source_domain":"ajc.com","text":"After a nine-month search, evaluating candidates from across the country and overseas, the High Museum of Art has chosen Randall Suffolk, currently the director of the Philbrook Museum of Art in Tulsa, Okla., to serve as the Atlanta museum’s new director, the AJC has learned exclusively.\nSuffolk replaces Michael E. Shapiro, who for two decades led the High through enormous growth and dramatic change. Shapiro announced last October he would step down this summer. His last day at the High is Friday, July 31.\nSuffolk, 47, said he admired the High’s service to its region, and praised in particular the museum’s acquisitions, which have almost doubled under Shapiro’s leadership.\n“One of the reasons that I’m excited about coming there is that they have done a remarkably insightful job at building that permanent collection,” Suffolk said from his Tulsa office. “They’ve made fantastic decisions along the way.”\nMembers of the search committee were impressed with Suffolk’s efforts to connect Philbrook with the Tulsa community, and with such programming as last year’s staff-curated Monet exhibit.\n“We were looking for a director to build on Michael’s great success, and a lot of that boiled down to innovative programming and community engagement,” said Charles Abney, chairman of the High’s board of directors. “Rand really embodied those qualities.”\nSuffolk grew up outside Akron, Ohio, but moved with his family to Rome, Italy, when he was 15. “I’m not sure I’d be half the person I am today if my father had not given me that opportunity,” he said. Living in Rome for four years opened his eyes to art, culture and history, he said.\nSuffolk earned a master’s in art history at Bryn Mawr College (along with a master’s in higher education administration from Columbia University), and began his career at the Hyde Collection Art Museum in Glens Falls, N.Y.\nIn 2007, he came to the Philbrook. The Oklahoma landmark was once a private residence, a 72-room Italianate mansion built in 1927 by oil magnate Waite Phillips. (His brothers Lee and Frank founded Phillips Petroleum.) In 1938, Waite Phillips gave the mansion to the city of Tulsa.\nSurrounded by 23 acres of gardens, the Philbrook draws about 150,000 visitors annually, on a budget of about $8 million. The High, by contrast, has entertained as many as 400,000 visitors in a year, and operates on a $20 million budget. It is the leading art museum in the Southeast.\nAt the Philbrook, Suffolk boosted attendance by 63 percent and almost tripled participation in educational programs. “We’ve tried to reinvent our relationship with our community,” he said. Suffolk spearheaded the planning for Philbrook Downtown, a 30,000-square-foot satellite facility that opened in 2013.\nAbney said Suffolk’s abilities will translate well into his new job, despite the difference in scale.\nLouise Sams, chair of the search committee and former board chair, said, “Rand’s infectious enthusiasm and passion for the visual arts … make him an exemplary leader for the High.”\nSuffolk will begin his duties at the High on Nov. 2, though he and his wife have already come through town to do some house-hunting.\nPhilip Verre, the High’s chief operating officer, will serve as the interim director during the period between Shapiro’s last day and Suffolk’s arrival.\nAbney said Shapiro will be a hard act to follow. Under his leadership, the High completed the ambitious Renzo Piano-designed expansion, more than doubling the museum’s footprint. He fostered relationships with other museums that generated loans of marquee works of art (such as Vermeer’s “Girl With a Pearl Earring”) and prompted door-busting attendance.\nWhen Shapiro announced he was leaving, he mused about the possibility of working on a book of interviews with museum directors, to examine the path that leads to such a position. But, though not retiring, he said he had no other position in mind.\n“I don’t think that I’m necessarily done doing interesting things,” he said. “I just have no idea what they will happen to be.”","url":"https://www.ajc.com/entertainment/arts--theater/high-museum-announces-randall-suffolk-new-director/5U4gVWhE98e9wuboO3jTDP/"}
