{"authors":["Brittany Valadez For Dailymail.Com"],"date_download":"2018-10-23 04:35:18","date_modify":"2018-10-23 04:35:18","date_publish":"2016-01-11 17:42:49","description":"Sometimes, it's just all about the girls. And Hilary Swank proved that true when she attended the New York Knicks game with her boyfriend Ruben and fellow actress Mariska Hargitay.","filename":"data/vaneerConsumption/HilarySwankandRubenTorrestakeinNewYorkKnicksgamewithMariskaHargitay.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300A98F900000578-0-image-a-83_1452533745254.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394118_Kissing-court-Hilary-Swank-s-boyfriend-Ruben-Torres-showers-affection-New-York-Knicks-game-Mariska-Hargitay_1540269318.html","title":"Hilary Swank and Ruben Torres take in New York Knicks game with Mariska Hargitay","title_page":"Hilary Swank and Ruben Torres take in New York Knicks game with Mariska Hargitay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hilary Swank was showered with love on Sunday evening.\nWhile taking in a New York Knicks game, the 41-year-old actress was kissed by her boyfriend Ruben Torres.\nAwkwardly, next to them was Law & Order: SVU vet Mariska Hargitay, 51, who was with her son August Herman, aged nine. And, oddly, the two stars were wearing identical T-shirts.\nScroll down for video\nLove is in the air: HIlary Swank's boyfriend Ruben kissed her while they were at the NY Knicks game on Sunday\nTwins! On Sunday, it appears that Swank, 41, had quite an eventful evening with Mariska Hargitay, 51, at the New York Knicks game at Madison Square Garden\nBoth brunette beauties wore identical black-and-white striped shirts, and even snapped a picture of their ensemble.\nHilary paired her top with a pair of skinny trousers and comfortable shoes, sans accessories, except for a pair of earrings.\nThe actress kept true to her natural beauty looking, opting for minimal makeup.\nPlanned attire? Both brunette beauties wore identical black-and-white striped shirts, and even snapped a picture of their ensemble\nTeam spirit: The matching women showed their support for the Knicks as they fearlessly cheered them on\nBut first...The women even took time to take plenty of selfies\nMariska went for her signature glam smokey eye and pink lip.\nShe paired an army green jacket with her striped top and added a pair of skinny jeans for her look.\nThe Law & Order: SVU actress added a pair of white sneakers with a gold overlay\nJust about them: Their NBA outing clearly was a night just for the females\nSoul on fire: Throughout the night, the girls continued to have a ball among themselves\nFor the win: Mariska and Hilary proudly cheered on their home team, who beat the Milwaukee Bucks 100-88\nThroughout the night, the girls continued to have a ball among themselves.\nTheir male guests appeared to vie for their attention, but it clearly was a night just for the females.\nMariska and Hilary proudly cheered on their home team, who ultimately beat the Milwaukee Bucks 100-88.\nTheir time: Ultimately, the males joined in on the fun, when at one time, the ball appeared to cross their path\nHilary, who's reportedly been with her boyfriend since July, eventually made time for her man.\nThe males joined in on the fun, when at one time, the ball appeared to cross their path.\nThe group even snapped several selfies together, making for an eventful night.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394118/Kissing-court-Hilary-Swank-s-boyfriend-Ruben-Torres-showers-affection-New-York-Knicks-game-Mariska-Hargitay.html"}
