{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 00:16:28","date_modify":"2018-10-23 00:16:28","date_publish":"2017-03-16 09:23:40","description":"The clip shows three suspects attempting to break in to a property through a security gate in Orange Grove, Johannesburg, but when they are disturbed they freeze and run away.","filename":"data/vaneerConsumption/Hilariousmomenttrioofburglarsstopintheirtracks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E52A46F00000578-0-image-a-5_1489654074985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319250_Hilarious-moment-trio-burglars-stop-tracks_1540253788.html","title":"Hilarious moment trio of burglars stop in their tracks","title_page":"Hilarious moment trio of burglars stop in their tracks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A hilarious video has emerged of a trio of burglars being stopped in their tracks as a man filming them reveals his presence by theatrically clearing his throat.\nThe clip shows three suspects attempting to break in to a property through a security gate in Johannesburg, South Africa\nAs the three stern-faced men get to work on the lock, they freeze when they realise they are being filmed before nervously looking around and scarpering.\nScroll down for video\nThe moment the three men realise they have been caught in the act as they try to break in\nThe three men stare at the man who has just cleared his throat to let them know he is filming\nThe would-be burglars are stopped in their tracks by a man who clears his throat as he films\nOne man uses a newspaper to grab the gate avoiding leaving prints while another works on the lock\nA third man appears to be on lookout duty, but spends the whole time staring at the other two\nThe video was filmed on 8th Street in the suburb of Orange Grove.\nIt is thought the men were attempting to gain entry to rob the main house of the residential complex.\nOne man can be seen holding a newspaper between his hand and the metal gate, presumably to avoid leaving fingerprints, as he holds it steady for his accomplice to pick the lock.\nThe man is holding a crowbar, while a third man appears to be acting as a lookout.\nWhen the man coughs, they all stop what they are doing and stare at the camera before glancing at each other.\nSeconds later, they flee the scene.\nChairperson of the Norwood Community Policing Forum Wandile Yani told the North Eastern Tribune: 'It is clear that they have no respect for the law.\n'They have no respect for anyone, seeing that they can do this in the middle of the day.'\nBut Mr Yani was left frustrated by the lack of police response.\nHe added: 'All the police stations have a crime prevention unit.\n'Where were the police? Where was the police car? This is not crime prevention.'","url":"https://www.dailymail.co.uk/news/article-4319250/Hilarious-moment-trio-burglars-stop-tracks.html"}
