{"authors":[],"date_download":"2018-10-22 21:38:33","date_modify":"2018-10-22 21:38:33","date_publish":"2014-05-07 20:41:36","description":"\"It's criminal, it's an act of terrorism and it really merits the fullest response possible,\" she said.","filename":"data/vaneerConsumption/HillaryClintonKidnappingsinNigeriaAreAbominable.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/427436/140507-hillary-clinton-1649_e5199944e11a4ea3b7576fe36a7c4fbc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_hillary-clinton-kidnappings-nigeria-are-abominable-n99721_1540244313.html","title":"Hillary Clinton: Kidnappings in Nigeria Are 'Abominable'","title_page":"Hillary Clinton: Kidnappings in Nigeria Are 'Abominable'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNEW YORK -- Former Secretary of State Hillary Clinton on Wednesday called the kidnapping of 300 schoolgirls in Nigeria \"abominable\" and said the government of Nigeria must accept aid in the effort to bring them home.\n\"The seizure of these young women by this radical extremist group, Boko Haram, is abominable,\" Clinton said while speaking Wednesday at Philanthropy New York's 35th Annual Meeting at the Ford Foundation. \"It's criminal, it's an act of terrorism and it really merits the fullest response possible - first and foremost from the government of Nigeria.\"\nClinton said the Nigerian government has been \"somewhat derelict\" in protecting its citizens.\n\"The Nigerian government must accept help, particularly intelligence, surveillance and reconnaissance help,\" she added. \"Their troops have to be the ones who do what is necessary but they can do a better job if they accept the offers that are being made.\"\nClinton has previously weighed in on the issue on social media. On Sunday, she tweeted \"Access to education is a basic right & an unconscionable reason to target innocent girls. We must stand up to terrorism. #BringBackOurGirls\"\nA massive social media campaign via the Twitter hashtag #BringBackOurGirls has taken off globally in recent days and protests have been held all across the country.\nThe United States government announced Tuesday they are sending a team to Nigeria to help with finding the missing girls.\n\"We're going to do everything we can to provide assistance to them,\" President Barack Obama said Tuesday during an interview with NBC News, noting it is a “terrible situation.”\nThe Islamist group Boko Haram has claimed responsibility for the kidnappings.\nClinton was also asked about House Republicans efforts to form a committee to investigate the 2012 attack on a U.S. consulate in Benghazi that occurred while she headed the State Department.\n“Of course there are a lot of reasons why -- despite all of the hearings, all of the information that’s been provided -- some choose not to be satisfied and choose to continue to move forward,” she said. “That’s their choice and I do not believe there is any reason for it to continue in this way, but they get to call the shots in Congress.”","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/hillary-clinton-kidnappings-nigeria-are-abominable-n99721"}
