{"authors":[],"date_download":"2018-10-30 14:34:07","date_modify":"2018-10-30 14:34:07","date_publish":"2015-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/Hillarysfakeaccomplishments.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_hillarys_fake_accomplishments_comments_1540910047.html","title":"Hillary's fake accomplishments","title_page":"Blog: Hillary's fake accomplishments","title_rss":"NULL","source_domain":"americanthinker.com","text":"One of the things I see mentioned frequently as one of Hillary Clinton's \"accomplishments\" is the eight years that she spent in the White House from 1993 to 2001. There are references to how she \"served\" as first lady, as if this were an elected position. It's not. If the eight years that she lived in the White House is an accomplishment and qualifies her for the presidency, then what about all the other people that have spent years at the White House? Gary Walters has been the White House's chief usher for almost 30 years. Christine Limerick has been the executive housekeeper at the White House for 12 years. I am certain that both of them are excellent at their jobs and work very long, hard hours. But does the fact that they work in the White House automatically count as a qualification for president? If Deanna Favre (Brett's ex-wife) asserted that she was qualified to be the starting QB for the Green Bay... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/hillarys_fake_accomplishments_comments.html"}
rried she became familiar with the definition of a corner blitz, the nickel package, and man-to-man coverage, so she is now completely comfortable with all the other terminology involving the Packers offense, and that, therefore, she is qualified to play, would you be convinced? If a survey of Packers fans supported her, would you think she was right? I want to see one of the GOP candidates call out Hillary's and her supporters' claim that because her husband was president and she lived in the White House, she is qualified for the presidency. Carly Fiorina recently pointed out that Hillary's so-called accomplishment of racking up millions of frequent flier miles is not an accomplishment; it's an activity. Hillary's residential history is not an accomplishment; it was a fringe benefit provided by her husband.","url":"https://www.americanthinker.com/blog/2015/04/hillarys_fake_accomplishments.html"}
