{"authors":["John Sexton"],"date_download":"2018-10-30 21:46:45","date_modify":"2018-10-30 21:46:45","date_publish":"2015-08-21 07:30:57","description":"Emails found on Hillary Clinton's private server reveal instances in which she sent and received information which is \"born classified.\"","filename":"data/vaneerConsumption/HillaryClintonSentEmailsContainingInfoBornClassified.json","image_url":"https://media.breitbart.com/media/2015/08/LYNXNPEB7I0XI_L-e1440142242356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_21__1540936005.html","title":"Hillary Clinton Sent Emails Containing Info 'Born Classified'","title_page":"Hillary Clinton Sent Emails Containing Info 'Born Classified'","title_rss":"NULL","source_domain":"breitbart.com","text":"A review of emails found on Hillary Clinton’s private server has revealed dozens of instances in which she sent and received a type of information which is “born classified,” according to the government’s own rules.\nReuters looked at the classification markings which the State Department has added to emails already released from Clinton’s server and found markings which indicate they contain “foreign government information.” That’s a type of information relayed by a foreign government in confidence. Instances of foreign government information identified by Reuters include “privately shared comments by a prime minister, several foreign ministers and a foreign spy chief.”\nJ. William Leonard, a former director of the U.S. government’s Information Security Oversight Office, tells Reuters this type of information is “born classified.” He adds, “If a foreign minister just told the secretary of state something in confidence, by U.S. rules that is classified at the moment it’s in U.S. channels and U.S. possession.” Leonard tells Reuters any claim to the contrary by the State Department is “blowing smoke.”\nReuters identifies one instance which sounds very much like the situation Leonard describes. In an email dated 2009, the private secretary of British foreign minister David Miliband wrote that Miliband “very much wants the Secretary (only) to see this note.” The email was sent to Hillary’s aide Huma Abedin and then forwarded on to Hillary. The next five pages of the email–which contain the confidential message for Secretary Clinton–are completely redacted.\nAsked about the classification rules for foreign government information, a spokesman for the State Deparment first claimed Reuters was making “outlandish accusations.” Later, the same spokesman, in an email to Reuters, wrote, “We do not have the ability to go back and recreate all of the various factors that would have gone into the determinations.”\nHowever, the source of one of the redacted notes spoke anonymously to Reuters, saying a 2009 message (which one is not specifically identified) had in fact been shared in confidence. If so, then that email would have been deemed classified at the time it was generated according to the rules in place at the time.\nIn all, Reuters identified 17 instances in which Clinton herself sent emails containing confidential foreign government information and “scores” more in which she received it. Confidential is the lowest level of classified information. Higher levels include Secret and Top Secret.\nSeparately, the Inspector General for the Intelligence Community has identified 4 unreleased emails, two of which the IC has judged to contain Top Secret information. The State Department continues to contest this and is appealing the classification to the Director of National Intelligence.","url":"https://www.breitbart.com/politics/2015/08/21/reuters-hillary-clinton-sent-and-received-scores-of-emails-containing-information-born-classified/"}
