{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:18:17","date_modify":"2018-10-30 20:18:17","date_publish":"2015-10-14 18:26:49","description":"Hillary Clinton blamed Republicans Tuesday night for trying to “take down Planned Parenthood.”","filename":"data/vaneerConsumption/HillaryClintonsMoralityDefundingPlannedParenthoodIsBadSellingBabyBodyPartsIsGood.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-492553438.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540930697.html","title":"Hillary Clinton's Morality: Defunding Planned Parenthood Is Bad, Selling Baby Body Parts Is Good","title_page":"Hillary Clinton's Morality: Defunding Planned Parenthood Is Bad, Selling Baby Body Parts Is Good | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Having been exonerated by her fellow Democrats and the debate audience for all her misdeeds, 2016 contender Hillary Clinton is blaming Republicans for trying to “take down Planned Parenthood.”\nHillary has fought for women her whole life—and she’s just getting started. #ImWithHer #DemDebate pic.twitter.com/vr1z1APQxJ — Hillary Clinton (@HillaryClinton) October 14, 2015\nPerhaps knowing her supporters are likely those for whom government freebies – rather than moral character and integrity – are highly valued, Clinton – without even being asked about the Planned Parenthood baby body parts scandal – let everyone know she stands with the nation’s largest abortion provider, the organization that is under congressional investigation for apparently altering abortion procedures in order to salvage high-priced baby organs for sale. Clinton openly defended Planned Parenthood during the debate on Twitter:\nAttacks on Planned Parenthood are attacks on women’s health and rights. We can’t let them take us backwards. pic.twitter.com/AwABjhfCjg — Hillary Clinton (@HillaryClinton) October 14, 2015\nClearly declaring Republicans her “enemies,” Clinton said during the debate, “They don’t mind having big government to interfere with a woman’s right to choose and to try and take down Planned Parenthood. They’re fine with big government when it comes to that. I’m sick of it.”\nThe former Secretary of State is apparently not “sick” of an organization that claims to need federal taxpayer dollars when it made a profit last year according to its own annual report. Despite declines in provided services, Planned Parenthood reported more than $127 million in excess revenue, and over $1.4 billion in net assets.\nClinton also seems not “sick” of the destruction of human life when it can profit the abortion industry — one of her biggest supporters.\nIronically, her support for abortion came in the context of her impassioned demand that Big Government pay for maternity leave so that women can stay home with their babies. According to Clinton, taxpayers owe women everything — but their unborn babies are not worth any protection at all.\nAs the Christian Post reported, Southern Baptist Ethics & Religious Liberty Commission President Russell Moore took issue with Clinton’s comment, tweeting:\nSecretary Clinton, it isn’t big government” to stop the Govt from funding Planned Parenthood. — Russell Moore (@drmoore) October 14, 2015\n@drmoore Nor is it too much to expect the government to stop the killing of babies. — Tony Zeikle (@tonyzeikle) October 14, 2015\nMichael Spielman, founder and director of pro-life education site Abort73.com, tells Breitbart News the country has grown relatively indifferent to unborn children.\n“Our country is rightly outraged when children are victimized by gun violence but largely indifferent to the children who are being daily victimized by abortion violence,” he explains. “In most contexts, the level of outrage we feel in response to a given act of violence directly corresponds to the age of the victim and their ability to defend themselves.”\n“The more helpless the victim, the more heinous the assault, but somehow with regard to abortion, we’ve flipped this maxim entirely on its head,” Spielman continues. “Abortion targets the youngest and most helpless members of the human community. Instead of affording them more protection as their condition deserves, their utter dependence has instead become the rationale for their destruction.”","url":"https://www.breitbart.com/politics/2015/10/14/hillary-clintons-morality-defunding-planned-parenthood-bad-selling-baby-body-parts-good/"}
