{"authors":["Roger Stone","Robert Morrow"],"date_download":"2018-10-30 19:25:05","date_modify":"2018-10-30 19:25:05","date_publish":"2015-09-27 22:17:20","description":"Hillary Clinton is the woman who has been in an arguably sham marriage and a cynical political union with Bill Clinton for 41 years.","filename":"data/vaneerConsumption/HillaryClintononRapeYouHavetheRighttoRemainSilentBecauseAnythingYouSayCanandWillBeUsedAgainstYoubytheClintons.json","image_url":"https://media.breitbart.com/media/2015/09/CPgua4RWEAAoS_c.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_27__1540927505.html","title":"Hillary Clinton on Rape: You Have the Right to Remain Silent Because Anything You Say Can and Will Be Used Against You… by the Clintons","title_page":"Hillary Clinton on Rape: You Have the Right to Remain Silent Because Anything You Say Can and Will Be Used Against You… by the Clintons | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In our astounding book The Clintons’ War on Women, which will be published by Skyhorse on October 13th, we demonstrate how shamelessness is a condition that the Clintons have perfected to an art form.\nTake, for example, Hillary’s recent pledge, as reported by Ruby Cramer, to crack down on campus rape and her encouraging words to sexual assault survivors: “Don’t let anyone silence your voice. You have the right to be heard … to be believed. And we’re with you.” In fact, we argue, Hillary Clinton has enabled rape and denigrated sex victims.\nIronically, Bill Clinton’s first alleged rape was of a 19-year-old coed named Eileen Wellstone. We believe that he was not prosecuted because the State Department did not want a Rhodes Scholar charged with rape.\nHillary is the woman who has been in an arguably sham marriage and a cynical political union with Bill Clinton for 41 years. Hillary was the one who was hiring private detectives, such as Ivan Duda, since 1982 so that she could get the names and addresses of Bill’s girlfriends so that she could “get rid of all these bitches he’s seeing.”\nThis is the same woman who was allegedly fully aware of Bill’s 1978 alleged rape of campaign volunteer Juanita Broaddrick in real time. As we reveal in The Clintons’ War on Women, according to former Clinton insider Larry Nichols, Hillary came running into the Clinton HQ and said, “You won’t believe what the motherf___r [Bill] just did. He tried to rape some bitch!” That blockbuster quote is just one of many things in the book that the MSM has carefully tried to keep out of your eyesight.\nThe book is about Bill Clinton’s long history of allegedly raping and sexually assaulting women and Hillary’s long history of allegedly psychologically raping these women in the aftermath in order to silence them lest they interfere with the Clintons’ rise to power.\nBill Clinton supposedly did not just rape Juanita; he allegedly, according to Candice Jackson in Their Lives: The Women Targeted By The Clinton Machine, bit and nearly tore off her upper lip and raped her a second time as she lay frozen on the bed. Bill’s alleged words before he began again were, “My God, I can do it again.”\nHillary believes that rape and sexual assault victims have rights. That is the “right to remain silent,” especially if Bill has allegedly assaulted you, because anything you say “can and will be used against you” by Hillary and Bill Clinton. A few weeks after Bill had allegedly raped and bitten Juanita, Hillary encountered Juanita at a campaign event in the home of a Clinton supporter. Hillary, in cover-up mode, had only one concern, according to Jaunita: keeping Broaddrick quiet during Bill’s race for the governorship in 1978. Juanita described the scene in a 2000 open letter to Hillary:\nAs soon as you entered the room, you came directly to me and grabbed my hand. Do you remember how you thanked me, saying “we want to thank you for everything that you do for Bill.” At that point, I was pretty shaken and started to walk off. Remember how you kept a tight grip on my hand and drew closer to me? You repeated your statement, but this time with a coldness and look that I have seen many times on television in the last eight years. You said, “Everything you do for Bill.” You then released your grip and I said nothing and left the gathering.\nIn other words: keep quiet about what Bill did to you!\nBy 1992, according to Gail Sheehy in the book Hillary’s Choice, cuckold Hillary and Betsey Wright had a list of 26 women they were positive Bill had adulterous affairs with or who he had sexually assaulted. In the view of Hillary, these women were, at various times, “bitches,” “whores,” “sluts,” and, if they were a threat to talk, they were to be “destroyed.”\nYears later, when journalist Melanie Morgan was quizzing him about his role in the 1997 terror campaign to silence Clinton victim Kathleen Willey, private detective Jack Palladino’s alleged cocky answer (though he denies ever making the statement) was, “The only regret that I had about the whole thing was that Hillary did not pay me in a timely fashion… I saved Hillary Clinton’s ass. You’d think she’d be more grateful to me.”","url":"https://www.breitbart.com/politics/2015/09/27/hillary-clinton-on-rape-you-have-the-right-to-remain-silent-because-anything-you-say-can-and-will-be-used-against-you-by-the-clintons/"}
