{"authors":[],"date_download":"2018-10-30 01:21:03","date_modify":"2018-10-30 01:21:03","date_publish":"2016-09-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HillaryatBay.json","image_url":"https://www.americanthinker.com/images/bucket/2016-09/197073.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_09_hillary_at_bay_1540862463.html","title":"Hillary at Bay","title_page":"Hillary at Bay","title_rss":"NULL","source_domain":"americanthinker.com","text":"See also: Obama’s former doctor recommends neurological testing for Hillary Clinton The sicker Hillary Clinton looks on the campaign trail, the more the Media Left tells us to deny the evidence of our eyes. Mrs. Clinton has suffered two strokes near, if not inside, her brain; but strokes are seldom localized affairs, and behind the scenes her doctors must be telling her to stop any physically demanding campaign activities.\nWe are seeing a woman who should be checking into Walter Reed Hospital to take full-time rest and recovery under intensive medical care, but who has to be physically propped up at some public appearances.\nThe nation is looking at a practice that would not be permitted for a racehorse.\nDr. Drew Pinsky, MD, and a medical colleague have reported that Hillary's known prescriptions include Coumadin, a useful but out-of-date blood thinner, used to prevent strokes and cardiac events. It is impossible for the public to know, but she may be being treated by an older physician, who is more comfortable using Coumadin. Alternatively, she could have been on that drug for many years.\nDemocrat politicians are hardly the most likeable characters, but this comes too close to medically sanctioned torture, much more cruel than anything at Abu Ghraib.\nThe media-political establishment that has ruled America since the Watergate resignation of Richard Nixon is now in deadly crisis. This chaos can no longer be covered up, which is why all the pathetic media donkeys are loudly braying that everything is just hunky-dory, folks, don't pay no attention, ya' hear now?\nThe fact that \"50\" Bush-era intelligence types signed a statement against Donald Trump and therefore for Hillary's election, is unprecedented in my memory. The DC Permanents always pretend to be non-partisan, and this is the first public breach of that front that I can remember -- at least since FBI Assistant Director Mark Felt came out in public as Deep Throat, the big Watergate leaker.\nMark Felt leaked Watergate abuses, in close collusion with Ben Bradlee, former CIA operative, who was then Editor-in-Chief of the WaPo, and who sent Woodward and Bernstein on their phony journalistic mission. All they had to do for their next WaPo headline is to telephone the FBI's Mark Felt, who was happy to spill the beans, because Nixon passed him over as FBI Director. How petty and trivial that seems now.\nBut Watergate has defined forty years of American political power. Our radical swing to the Left since then, in academics, culture, and political power can be traced back to that crucial moment. It was unconscionable, to say the least.\nA Third World country would have called Watergate a coup d'etat, a Silent Coup, which it was. But for the current \"crise d'etat,\" the Watergate precedent is important, because that was the last time the real DC ruling structure was exposed to the public eye. Watergate was a corrupt and indeed criminal plot against a constitutionally elected US President, Richard M. Nixon, by the Permanent Government in DC, notably the FBI and former CIA members, in culpable collusion with the Democrats, who then appointed a young Hillary Clinton as a junior attorney on the House Judiciary Committee. (Where she immediately demanded that Richard Nixon's Constitutional rights should be suspended.) Today's crisis may be seen as poetic justice, that Hillary now looks to be hung on her own nasty petard. But this situation is much too serious to joke about.\nBecause Vladimir Putin, in his own words, has lived his life waiting for the moment when he could take revenge on America for the breakdown of the Soviet Empire circa 1990 -- which was mostly self-inflicted -- Putin is a reasonable suspect for massive hackings. But the world is full of suspects, not excluding our former allies, who have been terribly betrayed by Obama and Hillary. Angela Merkel may even now be giggling over the latest leak of Obama and Hillary's chats about Merkel's private conversations.\nThere are so many dangerous and irrational regimes around the world that there's no telling where that stuff is ending up. There is nothing to stop hackers from selling thousands of leaked emails, except out-bidding them. And why shouldn't the hackers sell them twice or three times? Nobody would know.\nWeb hacking has become the Oil Boom of the 21st century. Everybody is digging for e-gold. Keep an eye on that kid next door. He knows too much.\nMedia denial about Hillary's illness is a desperation tactic by the permanent DC establishment and its political and corporate allies. Trump must be hanging tough, because the foaming-at-the-mouth hatred for him coming from the usual suspects boggles the mind. I've never seen this much media-whipped hatred concentrated on a single Republican candidate. And please, please notice how many RINO's are hating on Donald Trump these days. The conservative intellectual establishment is jumping the shark, and it seems that they can't stop themselves from committing public suicide.\nMake no mistake, the US Iron Wheel of highly concentrated major media, hard-left think tanks like John Podesta's Center for American \"Progress,\" Silicon Valley ignoramuses like Apple and Google, and media colossi like Disney, combined with elderly billionaires with a yen for their long-lost youth, agitating against Wall Street and the One Percent. (See Gyorgyi Soros). All that is coming apart. Even Soros' computer system has now been hacked, and his personal documents can be found on the web.\nAny advanced nation with hacking capabilities can join in the chaos. The Gulf Oil sheikh-doms may live in the 7th century, but they can buy the best hackers in the world. As far as I know nothing on this scale has ever happened, including the large release of KGB files after the fall of the Soviet Empire. The implications boggle the mind. Nobody knows what will happen.\nHillary's political team, her husband Bill, her money backers (including the Saudi Jihad-supporting royals) are forcing her to risk her health to serve their thirst for power. They have paid their millions to the Clinton Foundations, and they want their quid pro quo.\nHillary's ability to make decisions seems to be seriously impaired, at least since the email fiasco, which demonstrated a degree of incompetence and plain ignorance that would shame any savvy college student.\nHer email setup was an open invitation to major hacks, which have now done immense damage to the Government, the DNC, and even to Gyorgyi Soros, the Hungarian Machiavellian personality who controls much of the core Democratic Party. Wikileaks is brimming over with leaks, but it isn't funny: The chickens have indeed come back to roost, but they are now a clear and present danger to national security. This is very dangerous.\nCrucial government servants are being exposed to blackmail by foreign regimes, including Jihadists, the Chinese, and various tinpot dictators who can buy into what must be a flourishing black market in American national security secrets. The Ship of State is badly holed under the water line, and Obama's team has shown absolutely no capacity to even grasp the emergency, much less to do anything about it.\nLooking back, Hillary's insistence on the Libyan invasion, a plain violation of international law, and her bizarre response to it, do not even show basic decency. After knocking off Gaddafi, who at least held the tribal alliances together, Hillary chortled, \"We came, we saw, he died.\"\nThe United States under Obama and Hillary stirred up Jihadist-Muslim Brotherhood and possibly Iran-sponsored rebellion against the internationally recognized sovereign regime of Muammar Gaddafi, leading to tens of thousands of needless killings and maimings of civilians and an ongoing civil war; Gaddafi himself was murdered by impalement.\nHillary's triumphalist line \"We came, we saw, he died\" is obscene even by Clinton standards. These are not the words of a mentally competent politician with decades of experience. Those are not the words of a carefully programmed politician of any stripe.\nEven Democrats must be afraid. The United States is in an unprecedented political crisis, and it is high time to stop whispering about it. We need to talk about Hillary's condition out in the open.","url":"https://www.americanthinker.com/articles/2016/09/hillary_at_bay.html"}
