{"authors":[],"date_download":"2018-10-22 21:08:01","date_modify":"2018-10-22 21:08:01","date_publish":"2014-06-04 12:42:17","description":"She tells the mag she wants to \"live in the moment\" but that \"I am concerned about what I see happening in the country and in the world.\"","filename":"data/vaneerConsumption/HillaryClintonTalksFamilyLewinskyinPeopleInterview.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_21/310806/140408-hillary_clinton_rafferty-1826_f772cafc5341c52f7b83b087b35014ed.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_hillary-clinton-talks-family-lewinsky-people-interview-n122161_1540242481.html","title":"Hillary Clinton Talks Family, Lewinsky in People Interview","title_page":"Hillary Clinton Talks Family, Lewinsky in People Interview","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAs her press blitz continues, Hillary Clinton says she wants to “live in the moment” - including enjoying her new role as a grandmother-to-be - as she weighs a run for the presidency in 2016.\nIn an interview in PEOPLE Magazine, the former secretary of state offers yet another statement that she has “a decision to make” about a run, even as her aggressive media strategy appears to point to efforts to put past controversies behind her in preparation for a campaign.\nIn the interview, part of a wide-ranging publicity schedule surrounding the release of her memoir, Hard Choices, Clinton also said that she’s “moved on” from the Monica Lewinsky scandal. And she declined to comment on reports that she called the famous White House intern “a narcissistic loony tune.”\n“I’m not going to comment on what did and didn’t happen,” she said, according to the New York Times.\nClinton also addressed questions about her health, saying that she has no lingering symptoms after a head injury.\n\"I did have a concussion and some effects in the aftermath of it, mostly dizziness, double vision,\" she said. \"Those all dissipated. Blood thinners are my continuing treatment for the blood clot.\"\nAnswering questions about her life after Foggy Bottom, the onetime first lady described her love of the Netflix show “House of Cards” and her bliss at being able to sleep in “to probably 8 o’clock.”\nClinton's daughter, Chelsea, announced this spring that she and her husband Marc are expecting their first child later this year, a life change that Hillary Clinton says is a factor in her decision about a 2016 campaign.\n“Part of what I've been thinking about, is everything I'm interested in and everything I enjoy doing – and with the extra added joy of 'I'm about to become a grandmother,' I want to live in the moment,” she said. “At the same time I am concerned about what I see happening in the country and in the world.\"","url":"https://www.nbcnews.com/politics/politics-news/hillary-clinton-talks-family-lewinsky-people-interview-n122161"}
