{"authors":["Scott Horsley"],"date_download":"2018-10-22 21:38:10","date_modify":"2018-10-22 21:38:10","date_publish":"2016-10-28 00:00:00","description":"Hillary Clinton's campaign fundraising outpaced Donald Trump's in the first three weeks of October. She enters the home stretch with nearly four times as much cash on hand.","filename":"data/vaneerConsumption/HillaryClintonOutraisesDonaldTrumpNPR.json","image_url":"https://media.npr.org/assets/img/2016/10/28/5645175542_a17e1768e2_o_wide-8df3d50fe13b7003cd0a3bdb54a6831244621ff6.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_10_28_499742952_with-days-to-go-clinton-leads-in-campaign-cash_1540244290.html","title":"Hillary Clinton Outraises Donald Trump : NPR","title_page":"Hillary Clinton Outraises Donald Trump : NPR","title_rss":"NULL","source_domain":"npr.org","text":"With Days To Go, Clinton Leads In Campaign Cash\nEnlarge this image Flickr user Frankieleon/Flickr Creative Commons Flickr user Frankieleon/Flickr Creative Commons\nHillary Clinton enters the homestretch of the presidential race with a sizable fundraising lead over Republican rival Donald Trump. Many GOP donors appear to have shifted their giving to down-ballot candidates for House and Senate. And Trump himself has contributed just over half the $100 million he pledged to help bankroll his own campaign.\nFinance reports filed Thursday show Clinton's campaign raised nearly twice as much money as Trump's in the first 19 days of October and had nearly four times as much cash on hand.\nTrump himself contributed just $31,000 during the period in the form of rent and other in-kind contributions. That's well below the $2 million he'd given in previous months. While Trump has repeatedly told supporters he's willing to pump $100 million into the campaign, his contributions so far total just over $56 million.\nCAMPAIGN CONTRIBUTIONS, OCT. 1-19\nTRUMP: $28.9 million\nCLINTON : $57.2 million\nJOINT FUNDRAISING W/ NATIONAL PARTY\nTRUMP: $61 million\nCLINTON: $101 million\nCASH ON HAND, OCT. 19\nTRUMP: $16 million\nCLINTON: $62 million\nTrump staffers downplayed their fundraising disadvantage in a conference call with reporters, saying the campaign is using the money it does have very efficiently. The campaign is also relying heavily on the Republican National Committee for get-out-the-vote efforts.\nRepublican donors are still opening their checkbooks for House and Senate candidates, even as they give less to the man at the top of the ticket. The Senate Leadership Fund, which works to elect GOP senators, announced Thursday that it raised $25 million in the last week.\nOn the Democratic side, Senate Majority PAC is also seeing a strong flow of donations this month: $19.3 million through October 19.","url":"https://www.npr.org/2016/10/28/499742952/with-days-to-go-clinton-leads-in-campaign-cash"}
