{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:41:56","date_modify":"2018-10-30 21:41:56","date_publish":"2015-08-25 23:14:28","description":"Democratic presidential candidate Hillary Clinton used a spam-filtering company linked to her own personal tax lawyer to monitor her emails.","filename":"data/vaneerConsumption/HillaryClintonUsedEmailMonitorLinkedtoPersonalLawyer.json","image_url":"https://media.breitbart.com/media/2014/11/hillary-clinton-shrug-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_25__1540935716.html","title":"Hillary Clinton Used Email-Monitor Linked to Personal Lawyer","title_page":"Hillary Clinton Used Email-Monitor Linked to Personal Lawyer","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic presidential candidate Hillary Clinton used a spam-filtering company linked to her own personal tax lawyer to monitor her emails, Breitbart News has learned.\nHer use of the company left her private email account, and with it her thousands of State Department emails, startlingly vulnerable to hacker theft. It also presents more evidence that the Colorado-based firms responsible for tracking Clinton’s private email data all revolved around the Clinton political machine.\nClinton used the spam filtering program MX Logic, created by a company based in the Greater Denver area. The company became known as McAfee SaaS after its purchase by the computer security giant McAfee. The MX Logic program actively reads the emails in the accounts it monitors and re-encrypts them in a process vulnerable to security breaches.\nRecords obtained by Breitbart News reveal that Hillary Clinton’s own lawyer’s firm represented the company and handled the patent for the program that Clinton used on her private email account.\nNew York tax attorney Howard Topaz became Bill and Hillary Clintons’ personal tax lawyer in 2004 and started filling out the couple’s tax returns. Topaz was a partner at Hogan & Hartson, which later merged to become known as Hogan Lovells, where Topaz continues to practice. The firm’s lawyers were major donors to Hillary Clinton’s first presidential campaign.\nHogan & Hartson handled the patent for MX Logic’s email-filtering program, which McAfee bought the small company for $140 million in 2009 in order to acquire. The MX Logic company’s application for a trademark for its SPAMTRAQ program was filed in 2004 on Hogan & Hartson stationery and signed by a Hogan & Hartson attorney. Hogan & Hartson has been responsible for MX Logic annual reports.\nThe email company’s Clinton links present more evidence that Clinton’s political and legal establishment was monitoring her private email use.\nBreitbart News revealed Tuesday in a bombshell report that Platte River Networks, the small Denver-based firm hired to store Clinton’s private email server, employs a top Clinton operative: David Goodfriend, a former Clinton administration official and close friend of Hillary Clinton campaign chairman John Podesta. Goodfriend, a major Washington cyber security lobbyist who has been defending Clinton during the email scandal, is inexplicably on the payroll of the small Denver public relations firm that runs communications for Platte River Networks.\nThe question remains: why was Clinton’s private email operation based in Denver, a city known for cyber security and government intelligence?\nClinton’s use of the MX Logic program, an open secret in some tech circles, is confirmed by a search for her address “clintonemail.com” on a domain name information directory. CBS News noted in passing in March that Clinton started using MX Logic in July 2013, which was still well over a year before Clinton deleted all of the State Department emails on her server after October 2014.\n“This system has serious security implications,” Internet security expert Marc Perkel blogged earlier this year. “Email to McAfee’s servers might be encrypted and email out of McAfee might be encrypted, but while it’s at McAfee any employee who has access to the filtering system can tap and read any email going to that domain.”\nReached by phone by Breitbart News Tuesday, MX Logic referred this reporter to the corporate line for McAfee, which did not return a request for comment. Howard Topaz did not return a request for comment.\nHere’s an explainer on Youtube showing how the MX Logic program works:","url":"https://www.breitbart.com/politics/2015/08/25/exclusive-hillary-used-email-monitoring-company-linked-to-her-personal-lawyer/"}
