{"authors":[],"date_download":"2018-10-30 14:19:53","date_modify":"2018-10-30 14:19:53","date_publish":"2016-10-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HillarysTruthMeetsAbsolutePower.json","image_url":"https://www.americanthinker.com/images/bucket/2016-10/197390.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_10_hillarys_truth_meets_emabsolute_powerem_comments_1540909193.html","title":"Hillary’s Truth Meets Absolute Power","title_page":"Blog: Hillary’s Truth Meets Absolute Power","title_rss":"NULL","source_domain":"americanthinker.com","text":"David Baldacci wrote his fine thriller Absolute Power in 1996. It was the ultimate page-turner. The 1997 film was a terrific slimmed-down adaptation of the book with an improved ending. It starred Clint Eastwood and he directed. Like the current series, House of Cards, one can still justifiably assume it was loosely based on the Clintons and all their sleazy, underhanded machinations during their two terms in the White House. Even all those years ago, Clinton sycophants, like Bill Press, were apoplectic that Gene Hackman agreed to play the role of a cheating, corrupt President; it was way too close to the truth. In their view no good Hollywood liberal should be a part of the revelation of who Bill Clinton really was. In the film, the President is a philanderer. He is also physically abusive. While he is cheating with the young wife of his mentor and most generous financial benefactor (his George Soros), she is... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/10/hillarys_truth_meets_emabsolute_powerem_comments.html"}
been an agent of her own death. She is not a sympathetic character for the brief time she is part of the story.\nThe President is the evil one; he is a narcissistic psychopath without a shred of moral character. He is a repulsive man. How on earth was he elected? Well, the American people elected Bill Clinton twice. They would not see what was true about him: that he and his wife were and are absolutely disordered personalities who care for nothing but gaining and retaining their own power and amassing more wealth. Neither of them cares one bit about the American people, the economy they have ruined, or the lives that their policies have destroyed. (That is a long list, beginning with the Community Reinvestment Act of 1971, strengthened by Clinton, which forced banks to give home loans to unqualified buyers, that led to the economic crisis of 2008.) The point of the book and film is that American voters are not always good judges of character. That is what Baldacci and Eastwood were hammering home. The bad ones do incalculable damage, micro and macro. One would think that after LBJ we would know better but we do not. We twice elected Clinton who was, by the time he ran for his second term, clearly a jerk in his personal life. Those who seek power and then abuse it, wielding it absolutely as if it is theirs alone, are tyrants, soft or hard. Neither type believes their nations' laws apply to them. Cuba, South and Central America, Africa and the former Soviet Union have long suffered the catastrophe of hard tyrants. Obama has been a soft tyrant. He has ignored the Constitution and we know Hillary is on the same page as he is regarding our founding document. They both hate it. Hillary made that clear in the last debate when asked about the Supreme Court. Her SCOTUS would not be about upholding the Constitution, it would be an activist court, chosen to impose her leftist agenda by fiat. Like Obama, Hillary has an absolutist sense of \"correct\" thinking that she means to impose on the rest of us. She must not become our President. If she does win the election, she will most likely be impeached within two years. Her crimes are that legion and absolute.","url":"https://www.americanthinker.com/blog/2016/10/hillarys_truth_meets_emabsolute_powerem.html"}
