{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:37:55","date_modify":"2018-10-30 19:37:55","date_publish":"2015-10-17 00:38:27","description":"Hollywood stars praised Jennifer Lawrence for speaking out against the gender wage gap. Friday, Hillary Clinton joined the conversation.","filename":"data/vaneerConsumption/HillaryClintonPraisesJenniferLawrenceforEqualPayComments.json","image_url":"https://media.breitbart.com/media/2015/10/hillary-clinton-jennifer-lawrence-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_16__1540928275.html","title":"Hillary Clinton Praises Jennifer Lawrence for Equal Pay Comments","title_page":"Hillary Clinton Praises Jennifer Lawrence for Equal Pay Comments | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hollywood stars, including Bradley Cooper and feminist activist Emma Watson, have praised Hollywood’s highest-paid leading lady this week for speaking out against the industry’s gender wage gap. Friday, Hillary Clinton joined the conversation.\nIn an essay published by Lena Dunham’s Lenny Letter on Oct. 13, Jennifer Lawrence described finding out through last year’s Sony hack how much less she was making than her male co-stars while working on 2013’s American Hustle.\n“When the Sony hack happened and I found out how much less I was being paid than the lucky people with dicks, I didn’t get mad at Sony. I got mad at myself,” wrote Lawrence.\nChristian Bale, Bradley Cooper, and even Jeremy Renner—a less-bankable star than the film’s other male talents—all earned more than J-Law, who was recently named Hollywood’s highest-paid actress.\n“I got mad at myself,” Lawrence wrote. “I failed as a negotiator because I gave up early.”\nOn Friday, Democratic presidential frontrunner Hillary Clinton praised the starlet for her candor.\nBrava, Jennifer. It's hard to speak up against inequity and risk being unpopular—but equal pay matters for us all. http://t.co/g29cRkq5ln — Hillary Clinton (@HillaryClinton) October 16, 2015\n“Brava, Jennifer,” wrote Clinton. “It’s hard to speak up against inequity and risk being unpopular—but equal pay matters for us all.”\nHillary has of course blasted her greatest enemies, Republicans, for opposing equal pay for women, despite the fact she allegedly paid female staffers less than their male counterparts during her time as a New York Senator.\nHillary’s campaign website describes her as “an unequivocal champion for equal pay,” which is a topic she’s been vocal about since her campaign launched earlier this year.\nClinton took to Twitter in early 2014 to tout her equal pay for women work.\n20 years ago, women made 72 cents on the dollar to men. Today it's still just 77 cents. More work to do. #EqualPay #NoCeilings — Hillary Clinton (@HillaryClinton) April 9, 2014\nMeanwhile, as a Senator, Clinton was allegedly paying women in her office 72 cents for every dollar being paid to men, according to a Feb. 2015 report by the Washington Free Beacon.","url":"https://www.breitbart.com/politics/2015/10/16/hillary-praises-jennifer-lawrence-for-equal-pay-comments/"}
