{"authors":[],"date_download":"2018-10-30 01:07:10","date_modify":"2018-10-30 01:07:10","date_publish":"2015-03-28 00:00:00","description":null,"filename":"data/vaneerConsumption/HillaryClintonEmptyskirtforpresident.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_hillary_clinton_empty_skirt_for_president_1540861630.html","title":"Hillary Clinton: Empty skirt for president","title_page":"Hillary Clinton: Empty skirt for president","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hillary Clinton: Empty skirt for president\nLike the self-obsessed, attention-grabbing character played by Gloria Swanson in 1950’s Sunset Boulevard, Mrs. Clinton is ready for her close-up: the White House or bust. To the cheers of gathered mainstream media journalists who are supposed to be objective, she teased, “Don’t you want to see a woman president of the United States of America?” I would greatly like a woman of substance and actual achievements to be president. Condoleezza Rice comes to mind. That is not Mrs. Clinton, whose resume is chock-full of fancy placeholder job titles and no appreciable accomplishments. Check the paper-thin record such as it is: this pattern holds true. For instance, as the carpetbagging junior senator from N.Y., she, like Mr. Obama, passed no major legislation. The next rung on the ladder was her failed turn as secretary of state; think of the disastrous consequences of the Russian “reset” and Benghazi. Regarding the latter, the American people still don’t know where she was for that 3 AM phone call. So beyond logging more travel miles than an American Airlines stewardess (no doubt to first-class exotic locales) – an activity, not technically an accomplishment – all that remains is the fact that the State Department lost 6 billion dollars during her tenure. Add to the mix a fatiguing number of Clintonian scandals of various stripes, and you don’t have a person fit to lead the free world.\nBeyond policy and issues upon which intelligent people can disagree, the presidency must be about character. Character is most readily measured by how one treats an underling who cannot speak out or defend him- or herself. Mrs. Clinton’s reputation of potty-mouthed disdain for Secret Service agents charged to protect her is too quietly known in certain circles. She was so annoyed by their necessary presence that Secret Service agents hid behind White House curtains in her icy wake. In true Nixonian fashion, with all of his post-Watergate likability and trustworthiness, Mrs. Clinton has every bit of his polarizing hubris wrapped in a shrill persona. If the Obama experiment has a teachable moment, it is that a responsible adult is required in the Oval Office. As past is prologue, the last thing America needs is the real-life dynasty soap opera guaranteed by another Clinton presidency.","url":"https://www.americanthinker.com/blog/2015/03/hillary_clinton_empty_skirt_for_president.html"}
