{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:26:34","date_modify":"2018-10-30 18:26:34","date_publish":"2016-03-08 15:27:41","description":"Democratic presidential candidate Hillary Clinton wants to differentiate herself from rival Bernie Sanders on a question about limiting abortion rights by asserting she favors a “late-pregnancy regulation” with ‘”exceptions for the life and health of the mother” – a “restriction” that is essentially meaningless. |","filename":"data/vaneerConsumption/HillaryClintonsLatePregnancyRegulationExceptingHealthofMotherIsMeaningless.json","image_url":"https://media.breitbart.com/media/2016/03/Hillary-CLinton-townhall-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_08__1540923994.html","title":"Hillary Clinton’s ‘Late Pregnancy Regulation’ Excepting ‘Health of Mother’ Is Meaningless","title_page":"Hillary Clinton’s ‘Late Pregnancy Regulation’ Excepting ‘Health of Mother’ Is Meaningless | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic presidential candidate Hillary Clinton wants to differentiate herself from rival Bernie Sanders on a question about limiting abortion rights by asserting she favors a “late-pregnancy regulation” with “exceptions for the life and health of the mother” – a “restriction” that is essentially meaningless.\nClinton and Sanders discussed their views of abortion during the Fox News Town Hall Monday night. Neither candidate would actually spit out the words: “I believe a woman should be able to abort her baby at any time during her pregnancy.”\n“I am very strongly pro-choice,” Sanders said. “That is a choice to be made between a woman, her physician and her family.”\nClinton observed that she is already on record as favoring a “late-pregnancy regulation that would have exceptions for the life and health of the mother.”\n“Under Roe v. Wade, it is appropriate to say in these circumstances” that abortion rights may be restricted, she said — “so long as there’s an exception for the life and health of the mother.”\nPresident of the pro-life Susan B. Anthony List Marjorie Dannenfelser, however, writes at National Review that the notion of a woman’s “health” exception to late-term abortion “is a loophole so big as to make the underlying restriction meaningless.”\nShe explains:\nIt applies to anyone who claims to feel “mental distress” at the thought of having a baby. And it’s hard to take seriously the idea that a woman who stood by as her husband vetoed a law to prohibit the gruesome practice of partial-birth abortion now opposes the very abortions the technique was designed to administer.\nClinton also said that she objects to the recent efforts in Congress to pass a federal law banning abortions after 20 weeks, legislation that reflects the scientific evidence that unborn babies of at least 20 weeks gestation – and likely even earlier – can feel the pain of the abortion procedure.\nA medical animation of a second trimester abortion can be seen in the video below – produced by Live Action and narrated by former abortionist Dr. Anthony Levatino:\nDuring the Democratic debate in Milwaukee last month, Clinton and Sanders “sort of” discussed abortion for the first time though not in the frank and totally affirming way abortion industry lobbying group NARAL had called for. Sanders said, “I am very proud … that I have a lifetime … a lifetime 100 percent pro-choice record,” he said, but then veered off into his position on paid leave and equal pay.\n“I was very proud to get the endorsement of Planned Parenthood Action Fund because I’ve been a leader on these issues, I’ve gone time and time again to take on the vested interests of those who would make women’s healthcare decisions the province of the government instead of women ourselves,” Clinton said, again couching the abortion procedure in the frequently used euphemism, “women’s healthcare.”\nIt’s not surprising that Planned Parenthood and NARAL are demanding their Democrat candidates come out in full-throated, unwavering support for abortion at any time during pregnancy. The abortion industry and the Democrat Party are in a fully co-dependent relationship, and both have much power and financial gain on the chopping block. The situation is especially dire since the recent video exposé of Planned Parenthood’s apparent practice of selling the body parts of aborted babies on the open market has drawn more scrutiny of the abortion business – as well as calls for the elimination of its taxpayer funding on both federal and state levels.\nHillary Clinton, the Washington Free Beacon reports, has “paid Planned Parenthood thousands of dollars using campaign funds.”\nFour separate payments from Clinton’s campaign were received by the nation’s top abortion business as “reimbursements for ‘staff time’” for get out the vote efforts against rival Sanders.\nAnd the feeling is apparently mutual. “Clinton received financial support from the organization, collecting more than $20,000 from executives and employees of the national organization and its regional affiliates— 20 times more money than the rest of the presidential field combined,” the report states.\nAdditionally, all six of the Democrats on the House’s select panel investigating the fetal tissue practices of Planned Parenthood received contributions to their campaigns from the abortion business.\nNevertheless, though Clinton, Sanders, and many other liberal Democrats and their media friends like to portray Republicans as “right-wing extremists” on the issue of abortion, recent trends suggest abortion-on-demand is not in keeping with the views of the general population in America.\nA recent Marist College Institute for Public Opinion poll found a full 81 percent of Americans favor some restrictions on abortion — including limiting the procedure after the first three months — and a continued ban on public funding of abortion.\nIn the survey of 1,700 Americans, even 66 percent of respondents who identify themselves as pro-choice say, “Abortion should be allowed, at most, in the first trimester, in cases of rape, incest or to save the life of the mother, or never permitted.”","url":"https://www.breitbart.com/politics/2016/03/08/hillary-clintons-late-pregnancy-regulation-excepting-health-of-mother-is-meaningless/"}
