{"authors":[],"date_download":"2018-10-22 22:46:25","date_modify":"2018-10-22 22:46:25","date_publish":"2014-05-12 18:34:03","description":"The maker of Hillshire Farm lunch meats, Jimmy Dean sausages and Ball Park franks says it will buy Pinnacle Foods in a $4.23 billion deal.","filename":"data/vaneerConsumption/HillshireLooksBeyondMeatwithBirdsEyeVlasicDuncanHines.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/436976/140512-hillshire-pinnacle-mms-1438_20e0db83a1d19db6e50abe30a7dab08f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_hillshire-looks-beyond-meat-birds-eye-vlasic-duncan-hines-n103421_1540248385.html","title":"Hillshire Looks Beyond Meat with Birds Eye, Vlasic, Duncan Hines","title_page":"Hillshire Looks Beyond Meat with Birds Eye, Vlasic, Duncan Hines","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Meats go with vegetables, sandwiches go with pickles,\" Hillshire CEO Sean Connolly said in explaining why the deal made sense during a conference call with analysts.\nIn a phone interview, Connolly noted that Americans are eating meat just as often, but less of it per meal. He said that actually benefits Hillshire because food products that incorporate different ingredients — such as its Jimmy Dean breakfast sandwiches — are more profitable than simpler items like lunchmeats or sausages.\n\"We've often said we like products that are more than just meat,\" Connolly said.\nLast month, Hillshire also said it was buying Van's Natural Foods, which makes gluten-free products including cereal, chips and snack bars.\nGiven its reduced reliance on meat, the new Hillshire is expected to have significantly higher profit margins. Rising prices for fresh meat have hurt margins and led the company to increase prices in stores.\nStill, some of Pinnacle's brands such as Hungry-Man are seen as having an outdated image at a time when many people are trying to move away from foods they feel are processed or unhealthy. On Tuesday, the frozen food industry even plans to launch its first TV ad defending the nutritional benefits of its products.\nWhen asked whether Hillshire plans to hold onto all of Pinnacle's products, Connolly said it was \"too early to tell,\" but noted Hillshire's record of focusing on its strongest brands. He added that Birds Eye, which has a more health-conscious image, was particularly attractive to Hillshire when evaluating the deal.\n-The Associated Press","url":"https://www.nbcnews.com/business/business-news/hillshire-looks-beyond-meat-birds-eye-vlasic-duncan-hines-n103421"}
