{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:18:22","date_modify":"2018-10-30 22:18:22","date_publish":"2016-08-30 12:37:55","description":"Hillary Clinton drew 46 percent support among likely voters to Trump’s 39 percent of 802 registered voters that Monmouth University Polling Institute surveyed from August 25-28. A Monmouth poll taken just after the Democratic Party convention registered 50 percent support for Clinton and 37 percent for Donald Trump, a spread of 13 percent. | Politics","filename":"data/vaneerConsumption/HillaryClintonLosesHalfOfLeadInNewMonmouthPoll.json","image_url":"https://media.breitbart.com/media/2016/08/trump-Akron-Evan-VucciAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_30__1540937902.html","title":"Hillary Clinton Loses Half Of Lead In New Monmouth Poll","title_page":"Hillary Clinton Loses Half Of Lead In New Monmouth Poll | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The latest Monmouth University poll shows Republican presidential nominee Donald Trump gaining on Democratic nominee Hillary Clinton. Her lead was cut in half, to seven percent, from one taken earlier in August.\nClinton drew 46 percent support among likely voters to Trump’s 39 percent of 802 registered voters that Monmouth University Polling Institute surveyed from August 25-28. A Monmouth poll taken just after the Democratic Party convention registered 50 percent support for Clinton and 37 percent for Trump, a spread of 13 percent.\n“The margin has narrowed since her post-convention bounce, but Clinton is holding onto an underlying advantage over Trump among key voting blocs,” said Patrick Murray, director of the independent Monmouth University Polling Institute.\nThe Associated Press reported last week:\nMore than half the people outside the government who met with Hillary Clinton while she was secretary of state gave money — either personally or through companies or groups — to the Clinton Foundation\nA majority 54 percent of voters surveyed in the Monmouth poll believe Clinton gave “special treatment to big donors of the Clinton Foundation when she was Secretary of State” compared to 26 percent that said she did “nothing out of the ordinary.”\n36 percent of voters considered it “not important” for a presidential candidate to release his or her tax returns. Another 31 percent considered it “somewhat important” and an equal 31 percent considered it “very important.”\nPublic calls have gone out for Trump to release years of personal tax returns not under audit. 52 percent of those surveyed thought there was something in his unreleased tax returns that he doesn’t want the public to know while 24 percent believe that they have been withheld due to being under audit. Six percent or respondents thought that Trump had already released his returns while 15 percent thought Clinton had not.\nBoth Clinton and Trump had unfavorability ratings in the 50 percent range — Trump 57 percent and Clinton 51. Analysis included in the Monmouth University Poll results stated that the level of voters “who cannot bring themselves to voice a favorable opinion of either major party nominee is unlike anything witnessed in past elections.”\nOnly 34 percent of respondents said they view Clinton favorably while just 26 percent had a favorable view of Trump. Combined results showed only two percent said they had a favorable view of both candidates and 35 percent didn’t view either favorably.\nPoll analysis relayed historical favorability statistics:\nPutting this in historical context, the number of voters in elections going back to 1984 who had a favorable opinion of both candidates was never lower than 5% – in fact registering as high as 19% in 2000. Conversely, the number of voters who did not have a favorable opinion of either nominee never rose higher than 9%, which is a fraction of what is being seen in the current election.\n“This is truly extraordinary. It seems like a significant number of voters are backing a presidential candidate about whom they cannot say anything positive,” said Murray, adding, “It is highly unlikely these voters truly have a neutral opinion of their chosen candidate. They simply may have wanted to avoid contradicting themselves by expressing a negative view of a candidate who will reluctantly get their vote.”\nLibertarian candidate Gary Johnson polled at seven percent of likely voters in the most recent Monmouth survey and Green Party candidate Jill Stein polled at two percent.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/08/30/hillary-clinton-loses-half-of-lead-in-new-monmouth-poll/"}
