{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:39:20","date_modify":"2018-10-30 21:39:20","date_publish":"2015-09-30 22:41:27","description":"Hillary Clinton's top State Department aide Cheryl Mills was the victim of a hack attempt while using private email. Mills briefed Clinton.","filename":"data/vaneerConsumption/HillaryClintonsTopAideWasVictimofHackAttempt.json","image_url":"https://media.breitbart.com/media/2015/03/hillary-clinton-sunglasses-blackberrry-Kevin-Lamarque-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_30__1540935560.html","title":"Hillary Clinton's Top Aide Was Victim of Hack Attempt","title_page":"Hillary Clinton's Top Aide Was Victim of Hack Attempt | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton’s top State Department aide Cheryl Mills was the victim of a hack attempt while using private email. Mills briefed Clinton on the situation.\nMills, who routinely exchanged sensitive emails with Clinton, was looped in on an email sent by State Department official Anne-Marie Slaughter to Clinton on June 3, 2011, according to newly released documents.\n“I’m sure you’ve thought of this, but it would be a great time for someone inside or outside to make a statement/ write an op-ed that points out that State’s technology is so antiquated that NO ONE uses a State-issued laptop and even high officials routinely end up using their home email accounts to be able to get their work done quickly and effectively,” Slaughter wrote. “Further cuts to State’s budget just makes matters much much worse. We actually need more funds to significantly upgrade our technology.”\n“I think this makes good sense,” Clinton replied from her private clintonemail.com account. “How should we follow up?”\nAt this point, Mills jumped into the conversation and admitted she was the target in an attempted hacking.\n“I think this is easier to do as a former employee rather than current,” she wrote. “Second and more significantly,- as someone who attempted to be hacked (yes I was one), I am not sure we want to telegraph how much folks do or don’t do off state mail b/c it may encourage others who are out there,” Mills warned.\nSlaughter eventually decided that they should “make the point more quietly to legislators through H (Clinton).”","url":"https://www.breitbart.com/politics/2015/09/30/hillary-clintons-top-aide-victim-hack-attempt/"}
