{"authors":[],"date_download":"2018-10-30 01:12:53","date_modify":"2018-10-30 01:12:53","date_publish":"2015-10-16 00:00:00","description":null,"filename":"data/vaneerConsumption/Hillaryhasmettheenemyanditisyou.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_10_hillary_has_met_the_enemy_and_it_is_you_1540861973.html","title":"Hillary has met the enemy, and it is you","title_page":"Hillary has met the enemy, and it is you","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hillary has met the enemy, and it is you\nThose women who usually vote Republican but are now perhaps considering voting for Hillary Rodham Clinton because of gender solidarity or Republican men who want a chance to participate in a first should remember that the warm feelings are not reciprocated. When asked by Anderson Cooper during the Democratic debate the other night, \"Which enemy that you made during your political career are you most proud of?,\" the other potential candidates rattled off the usual suspects in the Democratic pantheon of evil – various big businesses, organizations, or countries. Hillary did also, but she proudly topped it off with her biggest enemy – Republicans!\nWell, in addition to the NRA, the health insurance companies, the drug companies, the Iranians … probably the Republicans. Wild applause in the Democratic-packed CNN studio greeted her answer! So there you have it. Not white male Republicans, but all Republicans – of all genders, all colors, all ethnic groups, all sexual orientations, and all other subgroups of Republicans – are the enemy. Republicans, in other words about half of the country, are not merely the honorable opposition in a democracy, but the enemy! So gender solidarity and a presumed historical act be damned – you have been publicly and proudly labeled as the enemy by a female, no matter her other meaningless prattle about \"I know how to find common ground, and I know how to stand my ground.\" She will stand her ground over you because you, you evil Republican, are the enemy and must be ground into the common ground with other enemies. Ladies and gentlemen, remember that when you vote. You have been warned!","url":"https://www.americanthinker.com/blog/2015/10/hillary_has_met_the_enemy_and_it_is_you.html"}
