{"authors":["Pam Key"],"date_download":"2018-10-30 21:50:26","date_modify":"2018-10-30 21:50:26","date_publish":"2016-03-10 03:01:59","description":"Wednesday at the CNN Democratic presidential debate, candidate Hillary Clinton refused to answer if she would leave the race if an indictment is the |","filename":"data/vaneerConsumption/HillaryOnPossibleEmailIndictmentImNotEvenAnsweringThatQuestion.json","image_url":"https://media.breitbart.com/media/2016/03/hill4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_03_09__1540936226.html","title":"Hillary On Possible Email Indictment: 'I'm Not Even Answering That Question'","title_page":"Hillary On Possible Email Indictment: 'I'm Not Even Answering That Question' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wednesday at the CNN Democratic presidential debate, candidate Hillary Clinton refused to answer if she would leave the race if an indictment is the result of the FBI investigation into her use of a private email server during her tenure as secretary of state.\nPartial transcript as follows:\nCLINTON: “I’m going to give the same answer I’ve been giving for many months. It wasn’t the best choice. I made a mistake. It was not prohibited. It was not in any way disallowed. And as I have said and has now come out, my predecessors did the same thing. And many other people in the government. But here’s the cut to the chase facts. I did not send or receive any e-mails marked classified at the time. What you are talking about is retroactive classification. And the reason that happens is when somebody asks or when you are asked to make information public, I asked all my e-mails to be made public. Then all the rest of the government gets to weigh in. And some other parts of the government, we’re not exactly sure who, has concluded that some of the e-mails should be now retroactively classified. They’ve just said the same thing to former Secretary Colin Powell. They have said we’re going to retroactively classify e-mails you sent personally. Now I think he was right when he said this is an absurdity. And I think that what we have got here is a case of over-classification. I am not concerned about it. I am not worried about it, and no Democrat or American should be either.\nRAMOS: The questions were — Secretary Clinton — the questions were who gave you permission to operate? Was it President Obama?\nCLINTON: There was no permission to be asked. It had been done by my predecessors. It was permitted.\nRAMOS: If you get indicted, are you going to drop out?\nCLINTON: Oh, that’s not going to happen. I’m not even answering that question.","url":"https://www.breitbart.com/video/2016/03/09/hillary-not-even-going-answer-that-question/"}
on/"}
