{"authors":[],"date_download":"2018-10-22 20:49:37","date_modify":"2018-10-22 20:49:37","date_publish":"2014-06-03 08:27:26","description":"Hillary Clinton gave a cautious defense of the \"tough\" decision to swap captive U.S. soldier Bowe Bergdahl for five Guantanamo Bay detainees.","filename":"data/vaneerConsumption/HillaryClintonDefendsToughDecisiononBergdahlPrisonerSwap.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/483181/140603-hillary-clinton-5a_565acbebaf98bf91f495cacf5c93bfe1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_hillary-clinton-defends-tough-decision-bergdahl-prisoner-swap-n120996_1540241377.html","title":"Hillary Clinton Defends 'Tough' Decision on Bergdahl Prisoner Swap","title_page":"Hillary Clinton Defends 'Tough' Decision on Bergdahl Prisoner Swap","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHillary Clinton gave a cautious defense Monday night of the deal to swap a captive U.S. soldier for five Guantanamo Bay detainees, saying the Obama administration had faced a “tough” decision.\nThe former secretary of state and potential 2016 candidate said the agreement to secure the release of Sgt. Bowe Bergdahl was similar to many reached by America’s allies, but noted: “We have a long way to go before we really know how this is going to play out.\"\nClinton was responding to questions at a lecture evening in Broomfield near Denver, Colorado where she was talking about her new memoir, \"Hard Choices.\"\nLeading Republicans have criticized the exchange, saying the White House had capitulated to terrorists. The deal also renewed questions over the circumstances surrounding Bergdahl’s 2009 disappearance, with many in the military accusing him of deserting his post in Afghanistan before being captured by the Taliban.\n“This young man, whatever the circumstances, was an American citizen -- is an American citizen, was serving in our military,” Clinton said late Monday.\n“I don't believe in second guessing people who have to make these hard choices,” she said. “We do have a tradition - I ascribe to it, it's a tradition that's not only embedded in our military but in our country - and that is we try not to leave any of our soldiers on the field. We try to make sure that, insofar as possible … we bring them home.”\n“The idea that you really care for your own citizens, and particularly those in uniform, I think is a very noble one,” she added.\nClinton said it was important to use the opportunity to get as much information as possible from Bergdahl about his time in captivity, saying he could be a valuable intelligence asset and shed light on the Taliban's workings.\nShe also called on the Qatari government to honor its promise not to let the five Taliban prisoners out of Qatar, saying: “I certainly hope they follow through on the assurance that they provided.”\nThe last video of Bergdahl sent by his captors “showed him under tremendous physical and mental stress,” Clinton noted.\n“You don't want to give up anything, you don't want to see these five [Taliban] prisoners go back to combat … On the other hand, you also don't want an American citizen, if you can avoid it, especially a soldier, to die in captivity.”\n-Bill Hatfield and Alastair Jamieson\nNBC News’ Cynthia McFadden will interview Hillary Clinton about her new book, focusing on her accomplishments, her future plans and particularly what's been called the \"Hillary Effect,\" her record as a world diplomat. The conversation will air Tuesday, June 10th.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/hillary-clinton-defends-tough-decision-bergdahl-prisoner-swap-n120996"}
