{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:24:10","date_modify":"2018-10-30 20:24:10","date_publish":"2015-10-27 00:24:23","description":"On October 6, National NPR debunked Hillary Clinton's claim that gun manufacturers are \"totally free of liability for their behavior.\"","filename":"data/vaneerConsumption/HillaryClintonContinuesPushingGunControlTalkingPointDebunkedbyNPR.json","image_url":"https://media.breitbart.com/media/2015/10/hillary-clinton-iowa-jefferson-jackson-dinner-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_26__1540931050.html","title":"Hillary Clinton Continues Pushing Gun Control Talking Point Debunked by NPR","title_page":"Hillary Clinton Continues Pushing Gun Control Talking Point Debunked by NPR | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 6, National Public Radio (NPR) debunked Democratic presidential hopeful Hillary Clinton’s claim that gun manufacturers are “totally free of liability for their behavior.”\nNevertheless, the claim has worked its way into Clinton’s regular campaign speech, and she is telling supporters in the Midwest and Northeast that gun manufacturers enjoy “immunity.” She said it clearly during the October 13 Democratic debate and again on October 24, when she said she wants to repeal the law “that shields gun makers and sellers from accountability.”\nWhen Clinton says these things, she is referencing the 2005 Protection of Lawful Commerce in Arms Act (PLCAA), which does in fact shield manufacturers from lawsuits pertaining to the misuse of their products. For example, it shields manufacturers from suits that are filed after someone steals a gun and uses it to criminally harm or kill another individual.\nBut gun manufacturers are very much liable if they make a product that performs in a manner other than intended and causes harm to the user or bystander.\nNPR reported this by quoting Clinton from an October 5 New Hampshire town hall, saying, “So far as I know, the gun industry and gun sellers are the only business in America that is totally free of liability for their behavior. Nobody else is given that immunity. And that just illustrates the extremism that has taken over this debate.”\nNPR then asked, “Is Clinton right that the gun industry enjoys legal protections that other industries don’t?”\nThey answered their own question with, “Clinton is wrong that gun companies have zero liability for their goods.” NPR did point out that gun manufacturers do enjoy being protected from frivolous suits—suits brought by a shooting victim over the misuse of a gun—but that was the goal of the PLCAA, to keep trial lawyers from suing gun companies for compensation every time someone steals a gun then uses it to take innocent life.\nPretend we are talking about cars instead of guns. Now, if someone drinks too much or takes too many pills then steers a car off the road and into a crowded area of pedestrians, should the maker of the car be liable? No. What if someone robs a bank then steals a car in which to get away and ends up running over and killing a family of three on the sidewalk—should the maker of the vehicle be liable? No. In both cases, the vehicle was criminally misused.\nBut what if a cabinet maker walks into his garage and gets in his truck to go work Monday, only to explode into a million pieces when he turns the key due to a poorly placed wire that created sparks near a fuel line? In that scenario, the car company could end up paying tens of millions for the design flaw.\nThe PLCAA hedges in this framework for gun makers, making sure they will not be bankrupted by frivolous suits but leaving them very much open to suits for defective guns that cause harm.\nNPR explained this three weeks ago, yet Hillary keeps telling supporters that gun manufacturers enjoy “immunity” and that she is going to change that. She has made it crystal clear that she is going after gun manufacturers and gun sellers if elected.\nIf she were successful, it would mean gun makers would be liable for when they produce a faulty product and liable for when they make a great product that someone misuses. No business can survive in such a scenario.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/26/hillary-clinton-continues-pushing-gun-control-talking-point-debunked-npr/"}
