{"authors":[],"date_download":"2018-10-30 01:09:49","date_modify":"2018-10-30 01:09:49","date_publish":"2015-03-11 00:00:00","description":null,"filename":"data/vaneerConsumption/Hillarysemailsandourenemiessignalsintelligence.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_hillarys_emails_and_our_enemies_signals_intelligence_comments_1540861789.html","title":"Hillary's e-mails and our enemies' signals intelligence","title_page":"Blog: Hillary's e-mails and our enemies' signals intelligence","title_rss":"NULL","source_domain":"americanthinker.com","text":"Suppose a famous surgeon were being interviewed by, say, Charlie Rose about his career in the operating room. And in response to a question about how hard it must be to always be washing up, he were to say… “No problem on the washing up, Charlie. I don’t do that. Sterilization is overrated. It’s more convenient to skip it.” And Charlie says… “Doctor, you’re joking, right?” “No, no, Charlie. I’ve never talked about it much, but I use the same instruments for days at a time. I like to operate in my street clothes. I find that much more comfortable. Sterilizing doesn’t really have much meaning for me. It isn’t who I am. And I have a lot of things to do with my day. I can’t spend all my time scrubbing for operations. That isn’t the best thing for me. It's a matter of convenience.” What would the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/03/hillarys_emails_and_our_enemies_signals_intelligence_comments.html"}
 ciphers goes as far back to ancient times. And then, as electronic communications came in in the 20th century, there have been epic stories of where the fate of nations was decided by the breaking of codes. Famous episodes from World War II were the two times that Joseph Rochefort and his Station Hypo team in Hawaii broke into the Japanese Naval Code. Rochefort was able to tell Nimitz that the Japanese would be coming into the Coral Sea in May 1942. Nimitz sent his limited naval power down there and although the U.S. Navy lost the battle tactically, it won it strategically as it stopped the Japanese advance on Australia. With the second break into the Japanese code, Rochefort was able to tell Nimitz that the Japanese would hit Midway on the morning of June 4, 1942. With a much smaller fleet, Nimitz bushwhacked the Japanese at Midway, sinking their primary striking force, the Kido Butai, from which they never recovered. From signals intelligence. On the other side of the world, the British were able to stave off defeat by virtue have having broken the unbreakable German Enigma enciphering machine. That achievement provided their margin of survival in 1941 both in the air war and in the war at sea. From signals intelligence. And now, in the 21st century, when encoding and decoding is a science practiced by every major country in the world – our department for it being the NSA – we find, or we appear to be being told, that the secretary of state for Obama’s entire first term – 2009 to 2013 – conducted official business on a server housed in her private home in the suburbs of New York. It is still hard to grasp if this is the full story, but it does appear to be the case. Think about this for a second. Clinton’s and Obama’s e-mail conversations – those between the two highest policy-making officials in the U.S. government – were conducted in what the cryptographic community would call “in clear.” “In clear” means unencrypted. Or, even if some encryption were used, the security of that server was not up to the standards of state.gov. This when we have the most sophisticated encryption organization in the world, one of whose two functions is keeping our communications secure. And when our foes deploy sophisticated hackers able to penetrate some of the most well-defended servers of commercial and government organizations. What does this mean? Does it mean that the Muslim Brotherhood was aware of our views on their activities in overthrowing governments in the Middle East?\nDoes it mean that Hamas and the PLO knew what our view was of the Israelis?\nDoes it mean the Russians knew what we were prepared – and not prepared – to do if they became aggressive in the old Soviet space?\nDoes it mean that the mullahs in Iran knew our negotiating position on their getting the Bomb?\nDoes it mean that Mexican drug lords knew about Fast and Furious?\nDoes it mean that the Taliban in Afghanistan has known our political plans all along? As of now, we don’t know any of these things. But neither do Obama or Clinton. Given the payoff to penetrating the command communications of the opposition, there have been extraordinary activities to accomplish this thoughout history. Did this happen to Clinton’s communications? The only possible answer for now is that we don’t know. The issue goes well beyond what was convenient for Clinton. This talk about the difficulty of carrying around two machines is absurd. Since when has Clinton carried around any-thing? She has people who do that for her.","url":"https://www.americanthinker.com/blog/2015/03/hillarys_emails_and_our_enemies_signals_intelligence.html"}
