{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:41:53","date_modify":"2018-10-30 21:41:53","date_publish":"2015-09-01 12:12:37","description":"Hillary Clinton's secret email network crashed in 2010, and the email help-desk at the State Department dismissed the problem as unimportant because they didn't know that she used a private email address.","filename":"data/vaneerConsumption/HillarysEmailCrashedAgencyDidntKnowTheAccountWasHers.json","image_url":"https://media.breitbart.com/media/2015/08/Huma-Abedin-with-Hillary-Robyn-BeckAFPGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_01__1540935713.html","title":"Hillary's Email Crashed: Agency Didn't Know The Account Was Hers!","title_page":"Hillary's Email Crashed: Agency Didn't Know The Account Was Hers! | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton’s secret email network crashed in 2010, and the email help-desk at the State Department dismissed the problem as unimportant because they didn’t know that she used a private email address to run the nation’s foreign policy.\nClinton’s private email went down in February 2010, causing confusion for her and her top aide Huma Abedin, according to a new set of highly-redacted Clinton emails released by the State Department Monday night.\nClinton received a routine message from a State Department computer staffer who clearly didn’t know that HDR22@clintonemail.com was the Secretary’s email address The message had told Clinton that some of the HDR22 messages were being flagged with “fatal errors.”\nClinton forwarded the message to Abedin, asking what was going on.\n“Ur email must be back up!!,” Abedin said excitedly. “What happened is judith sent you an email. It bounced back. She called the email help desk at state (I guess assuming u had state email) and told them that. They had no idea it was YOU, just some random address so they emailed. Sorry about that. But regardless, means ur email must be back! R u getting other messages?”\n“I’ve gotten some messages from yesterday – how about you?” Clinton replied.\n“Nothing,” replied Abedin on her State Department account.\nIn another email from that same month, Clinton made sure to differentiate between Abedin’s State Department email account and her clintonemail.com account when figuring out how to reply to different people.\n“[Please] give her Huma’s State email” Clinton told aide Cheryl Mills, referring to a staffer for British official Catherine Ashton.\nThe new emails show Clinton and her advisers cleverly manipulating transparency guidelines.\n“Well, that is certainly worthy of being top secret,” Clinton told a staffer in February 2010, referring to a Tony Blair statement about an initiative to establish a two-state solution with regard to Israel and Palestine. An exchange between Clinton and Blair’s wife Cherie regarding a potential conversation with the Qatari royal family was marked “Confidential.”","url":"https://www.breitbart.com/politics/2015/09/01/hillarys-email-crashed-agency-didnt-know-the-account-was-hers/"}
