{"authors":["John Hayward"],"date_download":"2018-10-30 21:36:07","date_modify":"2018-10-30 21:36:07","date_publish":"2015-08-19 14:23:27","description":"Who the hell is advising Clinton on how to handle this scandal, and can Republicans buy him or her a drink?","filename":"data/vaneerConsumption/HillaryClintonTheSpintheCoverUpandtheCrime.json","image_url":"https://media.breitbart.com/media/2015/08/Clinton-Vegas-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_19__1540935367.html","title":"Hillary Clinton: The Spin, the Cover-Up, and the Crime","title_page":"Hillary Clinton: The Spin, the Cover-Up, and the Crime | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton rolled the dice in Las Vegas with a hilariously awful press conference, in which she once again pretended to be a doddering old granny who doesn’t know much about these newfangled “computer” contraptions all the kids are playing with.\nShe probably didn’t set out yesterday evening with the intention of writing a new punchline into the political joke book, but that’s what happened when she responded to a question about wiping her server by warbling, “What, like, with a cloth or something?”\nBonus cringe points for showing up in an outfit that looked uncomfortably like an orange prison jumpsuit, and making an incredibly clumsy attempt to look innocently surprised that produced one of the most unflattering photos ever snapped of a presidential candidate. Who the hell is advising Clinton on how to handle this scandal, and can Republicans buy him or her a drink?\nPresidential candidates usually take pains to avoid becoming punch lines. When you’re running for the highest office in the land, you don’t want to look like an out-of-touch boob who doesn’t understand the basics of the computer technology integral to modern American life.\n“Out of touch” media torpedoes have been launched against Republican candidates for far less than this. Remember when propagandist Andrew Rosenthal cooked up a phony story at the New York Times about the elder George Bush supposedly being astounded by the sight of a grocery-store scanner, and it became the go-to myth about how the old man didn’t understand middle-class life? It was obvious that story was a lie from Minute One, but it didn’t matter to the media one little bit – they ran with it like a rookie receiver going for his first touchdown.\nWell, now we’ve got Hillary Clinton explicitly claiming, in front of every news camera in the land, that she doesn’t understand what “wiping” a computer means. When can we expect that first story about how Hillary Clinton is an out-of-touch super-rich dilettante who doesn’t have a clue how the rest of us live our lives, New York Times?\nOf course everyone knows Clinton is lying, extravagantly and shamelessly. The wiping of her server is a fact of the case established by her own legal team long ago. The people who did the wiping – ironically enough, a company that kept its servers in a bathroom closet at the time – didn’t nuke the Secretary of State’s hard drives because they were lounging around the office on a slow day and decided it would be fun.\nThe notion that anyone would authorize the destruction of that data without Madame Secretary’s express permission is ludicrous… and it would actually reflect even worse on Clinton, if we indulged her and pretended to believe it. She ran a shop so loose and reckless that staffers felt free to destroy subpoenaed data that included classified and Top Secret documents, kept on the Secretary of State’s personal mail server – a system unprecedented in all of American history – and now she expects us to trust her with the presidency?\nAlso, Clinton repeatedly stated in her very first press conference on the email scandal – the one where she laughably claimed to have created her shadow server because she though it was inconvenient to carry two cell phones – that she had erased everything on her server, after deciding which emails she thought were “official” and should be handed over to the State Department, courts, and Congress. It was big news in March when House Benghazi Committee Chairman Trey Gowdy (R-SC) announced Clinton’s lawyers had informed him her server, which Gowdy wanted an independent tech team to examine, had been “wiped clean,” using those very words.\nHillary Clinton is pretending she can’t remember her own words of not six months ago, and asking us to believe she’s completely unaware of headline-news developments in her own story, despite having a huge retinue of personal assistants and campaign operatives to keep her updated on such news. And she thinks people will respond by judging her fit to hold the Oval Office?\nNo thanks, Mrs. Clinton, we’ve just barely survived eight years of a guy who claims to be ignorant about everything his mega-government does, until he sees it discussed on TV news the next day. We’re not going to downgrade even further to someone who claims she doesn’t even watch TV news.\nDoubtless what Clinton thinks she’s doing is positioning herself above the story, a haughty queen looking down from on high as grubby peasants squabble over matters long since discarded from her busy mind. That’s the last image Hillary Rodham Clinton should be projecting. It didn’t work when she tried to dump jokes about Snapchat being wonderful because it automatically deletes posts over the weekend, either. If we see items in the political papers soon about staff shakeups in the Clinton campaign, we’ll know which of her advisers came up with this ill-fated arrogance strategy.\nAfter her Las Vegas “Orange Is the New Black” disaster, Clinton doesn’t look haughty or arrogant – she looks like an absolute buffoon, and it’s going to achieve a deadly level of pop-culture penetration. Those photos of her, and the unforgettable jackass quality of her “wipe my server with a cloth” line, are just too rich. They’ll capture the attention of people who weren’t following the server story, or most other political news. Those who began paying attention when the game-changing words “Top Secret” were uttered will smell blood in the water. Even disengaged news consumers grasp that politicians don’t normally try to make themselves look stupid, especially when they’re slipping badly in both primary and general-election polls.\nAlso, Hillary’s spin strategy is intrinsically insulting to her own supporters – she’s treating them like easily-herded livestock who can make themselves believe the alleged Smartest Woman in the World, the former Secretary of State, doesn’t know how computers work, and isn’t entirely certain what “classified” or “Top Secret” mean. That’s going to alienate even some of her bedrock supporters… as their further-left friends invite them to Bernie Sanders rallies, assuring them Bernie won’t treat them like brain-dead props in Spin Theater.\nThere’s an old saying in politics about the cover-up being worse than the crime. In Clinton’s case, the spin might be even worse than the cover-up. What does it tell you about the severity of this email scandal that she’s willing to burn her last gasp at the presidency to ashes, for merely the flimsiest layer of protection? She’s still pushing the silly, carefully-parsed line about how the emails weren’t marked as classified or Top Secret, which doesn’t actually matter under federal law, and doesn’t reflect very well on her competence as Secretary of State… but it does continue the process of setting up one of her aides to take the fall.\nAt this point, that’s so important to Hillary Clinton that she’s willing to act like a clown in front of news cameras, and then storm away in a huff when her act did not instantly satisfy a media that really doesn’t want to ask her tough questions. It says a lot about the utter contempt she feels for Democrat voters that she thinks she can still run a viable presidential candidacy after making herself look this bad.","url":"https://www.breitbart.com/politics/2015/08/19/hillary-clinton-the-spin-the-cover-up-and-the-crime/"}
