{"authors":["Marita Noon"],"date_download":"2018-10-30 19:18:56","date_modify":"2018-10-30 19:18:56","date_publish":"2015-08-04 13:43:11","description":"The Clinton campaign’s newly announced “ambitious renewable energy plans” move far beyond Obama’s highly criticized efforts that have increased costs and jeopardized reliability. But they appease environmental activists and wealthy donors. |","filename":"data/vaneerConsumption/HillarysEnergyPlanAllAboutMoneyOutofYourPocket.json","image_url":"https://media.breitbart.com/media/2015/07/ap_hillary-rodham-clinton_ap-photo27-1024x613.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_04__1540927136.html","title":"Hillary’s Energy Plan All About Money-Out of Your Pocket","title_page":"Hillary’s Energy Plan All About Money—Out of Your Pocket | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Clinton campaign’s newly announced “ambitious renewable energy plans” move far beyond Obama’s highly criticized efforts that have increased costs and jeopardized reliability. But they appease environmental activists and wealthy donors.\nObama’s policies push a goal of producing 20 percent of the nation’s electricity from renewables by 2030; hers is 33 percent by 2027. We are at 7 percent today.\nAt a rally in Ames, IA, Clinton said: “I want more wind, more solar, more advanced biofuels, more energy efficiency.” She added: “And, I’ve got to tell you, people who argue against this are just not paying attention.”\nThe Clinton campaign isn’t paying attention—or, it pays attention to the demands of wealthy campaign donors.\nThe White House has received aggressive pushback and a Supreme Court’s smackdown over the administration’s policies designed to cut carbon dioxide by requiring renewables.\nA growing list of governors refuses to comply with Obama’s Clean Power Plan (CPP)—the cornerstone of his climate agenda—and Congress has pending legislation giving the governors the authority to “just say no” if such plans negatively affect electricity rates, reliability, or important economic sectors. Other efforts to restrain the CPP include reducing the budget of the Environmental Protection Agency (EPA), tasked with CPP implementation. The 2016 Interior Department and EPA spending bill developed by the Senate Appropriations Committee reduces EPA’s budget by $538 million from its 2015 level.\nClinton pledged, according to The Guardian, “to uphold the Obama administration’s heavily opposed restrictions on carbon emissions of power stations, which are expected to accelerate the rapid shut-down of coal plants across the country.” Don’t worry, though, if you are one of thousands of employees put out of work, or a retiree whose pension includes utilities or mining companies that have lost value, because of these policies, according to the New York Times (NYT): “Mrs. Clinton promised that in coming months she would unwrap additional climate policies, including aid to workers in coal-producing regions who suffer economic harm.”\nSo now, instead of having a good-paying job, those who used to work in the coal industry will become wards of the state. Those of us who still have jobs pay for the “aid” through our taxes.\nMeeting her 33 percent goal would require “further federal investment,” which would require “resuscitation of tax credits and some innovation and regulatory incentives”—all of which add up to more government spending of tax-payers dollars. The Guardian points out that the recent growth in solar installations has been “aided by the soon-to-expire solar investment tax credit,” which Clinton will have to “revive.” Leading climate alarmist James Hansen, formerly with NASA, surprisingly, announced: Clinton’s plan “is going to make energy more expensive.”\nDue to dire economic consequences, other countries have abandoned or, at least, dialed back on, CO2 reduction plans—but, perhaps, she isn’t paying attention.\nThe Guardian coverage of Clinton’s climate plan points out: “In Germany and the UK, the solar industry has come under political pressure for being too successful when subsidies were high and now suffers from accusations of being a ‘subsidy junky’” It also warns: “People in the U.S. may care less about climate change than they do about cost.”\nClinton’s “ambitious” plans will take money from your pocket through increased taxes and higher energy bills, but it will help her ambitions by putting money in her campaign and help her expansive political network—a fact to which voters need to pay attention.\nWhy isn’t Clinton paying attention to the backlash against renewable energy and the higher costs it imposes on consumers and industry?\nThe answer is clearly laid out in the NYT: “Mrs. Clinton’s strategists see climate change as a winning issue for 2016. They believe it is a cause she can advance to win over deep-pocketed donors”—specifically billionaire environmentalist Tom Steyer who held a fund raiser for her in May. He’s announced that “for candidates to receive his support in 2016, they must offer policies that would lead the nation to generate half its electricity from clean sources by 2030 and 100 percent by 2050.” When it says that Steyer influenced “the details of her proposal,” the NYT is, in essence, acknowledging that she is paying attention to her wealthy donors. Her press secretary tweeted: “Counting nuclear, as Steyer does, she exceeds his 50 percent goal.”\nIf you pay attention, you’ll realize that the priority of Clinton’s ambitious climate change plan is to further her ambitions by putting money in her pocket, while taking it from the average American. For once, I agree with James Hansen, who calls her plan “just plain silly.”\nThe author of Energy Freedom, Marita Noon serves as the executive director for Energy Makes America Great Inc. and the companion educational organization, the Citizens’ Alliance for Responsible Energy (CARE). She hosts a weekly radio program: America’s Voice for Energy—which expands on the content of her weekly column. Follow her @EnergyRabbit.","url":"https://www.breitbart.com/politics/2015/08/04/hillarys-energy-plan-all-about-money-out-of-your-pocket/"}
