{"authors":["John Hayward"],"date_download":"2018-10-30 20:19:47","date_modify":"2018-10-30 20:19:47","date_publish":"2015-12-22 14:28:32","description":"Despite what Hillary Clinton said, ISIS does not, in fact, use Donald Trump in its recruitment videos.","filename":"data/vaneerConsumption/HillaryClintonRefusestoApologizeForLyingAboutTrumpandISIS.json","image_url":"https://media.breitbart.com/media/2015/12/Hillary-debate-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_22__1540930787.html","title":"Hillary Clinton Refuses to Apologize For Lying About Trump and ISIS","title_page":"Hillary Clinton Refuses to Apologize For Lying About Trump and ISIS | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During the most recent Democrat debate – the one they held on the last Saturday before Christmas, so voters wouldn’t see it – Hillary Clinton falsely claimed the Islamic State is prominently featuring Donald Trump in its recruiting videos.\nHere are Clinton’s comments in full, from the CBS News transcript of the debate:\nYou know, I was a senator from New York after 9/11, and we spent countless hours trying to figure out how to protect the city and the state from perhaps additional attacks. One of the best things that was done, and George W. Bush did this and I give him credit, was to reach out to Muslim Americans and say, we’re in this together. You are not our adversary, you are our partner. And we also need to make sure that the really discriminatory messages that Trump is sending around the world don’t fall on receptive ears. He is becoming ISIS’s best recruiter. They are going to people showing videos of Donald Trump insulting Islam and Muslims in order to recruit more radical jihadists. So I want to explain why this is not in America’s interest to react with this kind of fear and respond to this sort of bigotry.\nThis lie proved so brazen that Clinton’s friends, donors, and former employees in the mainstream media felt obliged to fact-check it, a task that clearly made them uncomfortable. Clinton flacks looked shaken and sweaty as they appeared on news shows to spin her fabrication, often by attempting to trick viewers into forgetting she explicitly stated Trump is featured in ISIS recruitment videos, rather than just offering broad speculation that terrorists could use Trump’s proposal for a temporary ban on Muslim immigration as a tool for radicalizing Muslims.\nIt became comically obvious that not a single person working for Hillary Clinton expected to be called out on this fib by their media pals. They certainly didn’t expect Clinton’s latest video lie to become one of the only stories to emerge from the carefully-hidden Democrat debate – along with her bizarre late return from a bathroom break, and her straight-up insane assertion that Obama foreign policy has the Islamic State on the ropes. They thought any and all criticism of Donald Trump was acceptable, based in facts or not, because he’s become their favorite hate fetish.\n(Frankly, they should be counting their blessings that people are buzzing about the Trump lie more than her contention that we’ve got ISIS right where we want them. It was fun watching Clinton sycophants in the media try to spin her unseen Saturday night debate as a big win until the Sunday news cycle began, wasn’t it?)\nTrump demanded an apology from Hillary on Monday morning: “She should apologize. She lies about emails. She lies about Whitewater. she lies about everything. She will be a disaster as president of the United States.”\n“Hell no,” responded Clinton campaign spokesman Brian Fallon on Monday afternoon. “Hillary Clinton will not be apologizing to Donald Trump for correctly pointing out how his hateful rhetoric only helps ISIS recruit more terrorists.”\nTranslation: Don’t bug us with your piddly little facts, it’s a Greater Truth because Her Majesty says so.\nThis is more than just a minor gaffe on Clinton’s part – it’s a major insight into why she’s utterly unqualified to hold any important public office, much less the Oval Office, and it’s a symptom of the delusional incompetence that made her such a disaster as Secretary of State. The people of the United States can ill afford to grant the presidency to an ideologue who refuses to see our enemies for what they really are, instead viewing them through Coke-bottle lenses of fashionable dogma and political necessity.\nIt matters very much that ISIS does not, in fact, use Donald Trump in its recruitment videos.\nClinton’s assertion to the contrary isn’t just a convenient fantasy she spun for cheap partisan points, because she never dreamed her media admirers would call her on it. It shows that she doesn’t understand the Islamic State or Islamist terrorism at all. She has no idea what actually motivates them; she is willfully deaf and blind to what they’re actually telling their recruits, the same way Barack Obama is.\nIt’s possible that someone affiliated with ISIS might eventually mention Trump in an effort to play off feelings of Muslim alienation in Western societies, but it would quite literally be an afterthought, and frankly they’re more likely to do it because Hillary Clinton just teed it up for them.\nWhat they’re selling to recruits is a white-lightning brew of Islamic supremacy, territorial ambition (get the infidels out of the Middle East!), appeals to the barbarian desire for strength through conquest, and contempt for infidel culture. Contrary to Hillary Clinton’s equally blind assertion that it has nothing whatsoever to do with Islam, the ISIS message is all about Islam – which is why we need Muslims who reject that message to work hard at discrediting it.\nThe Islamic State’s recruiting efforts have been alarmingly successful, long before anyone was talking about Donald Trump as a serious presidential contender. The simplest evidence that Clinton is lying about Trump being their “top recruiter” is that ISIS was pulling in thousands of foreign fighters, and inspiring “lone wolf” jihadis, long before Trump said anything noteworthy about Islam, and long before he was viewed as anything but a long shot for the Republican presidential nomination.\nFrankly, you have to be a complete idiot to believe he could possibly be the most important figure in Islamic State propaganda. The timeline of the Islamic State’s rise to power argues decisively against it.\nThe Western politician who figures most prominently in ISIS propaganda is Barack Obama, because he’s the current president of the United States. If Trump wins in 2016, he’ll start showing up in their videos… and the same is true of Hillary Clinton.\nThe other notable thing about ISIS and Obama is that its rhetoric on the Crusades is very similar to his. They’re absolutely obsessed with the Crusades and “crusaders,” and can scarcely get through a page of their magazine Dabiq – which is named after a city in Syria where an apocalyptic final battle between crusaders and Muslims is prophesied to occur – without mentioning the subject.\nIt does matter that the President of the United States also thinks modern Christians are somehow accountable for the Crusades, and should refrain from getting on their “high horses” to criticize contemporary Islamist terrorism because of what happened in the Eleventh Century.\nIf ISIS cares at all about Trump’s call for a temporary moratorium on Muslim immigration, they have yet to express their indignation in any significant way. They wouldn’t view it as much of an obstacle, because they probably already have plenty of operatives on American soil – if they haven’t slipped an army past the incompetent Obama Administration, they’re not trying – and because they’re patient enough to wait for a prospective immigration pause to end. Also, to put it bluntly, the Islamic State is primarily interested in conquering the Middle East and precipitating that final showdown with the Crusaders. Slowly taking over the Western world through Muslim migration is more of an al-Qaeda thing.\nAnother thing about Clinton’s lie is that it betrays her eagerness to use terrorism as a club against domestic political opponents. Why should anyone in America be willing to let ISIS select our presidential candidates or set our policy agenda? If they start yelling that they hate a particular American leader, shouldn’t we take that as a point in his favor?\nClinton’s reasoning is arguably an endorsement of terrorism’s political objectives – she’s saying we should be intimidated by what makes the Islamic State angry, and avoid making political choices that antagonize them.\nOne of the most recent ISIS recruiting videos featured three American politicians prominently: Obama, George W. Bush, and Bill Clinton, who was cited as an example of the “fornicators” that have weakened infidel culture. Whatever one thinks about any of these three presidents, the opinion of the Islamic State shouldn’t count for much. If Hillary Clinton does value the political opinions of ISIS, she needs to have a long talk with her husband… and perhaps consider what ISIS will say, if the wife of the poster boy for infidel fornication gets his old job.\nStudying Islamist ideology to destroy it is vital, but trying to adapt ourselves to its psychoses is foolish and offensive. If Western politicians believe what they say about moderate Muslims, there is no reason to fear any of them becoming sympathetic to violent radicals because a politician proposes a temporary immigration ban. On the contrary, these moderates should be furious with ISIS, al-Qaeda, and the rest of the Islamist freak show for making it understandable that Western societies would consider restricting Muslim immigration.\nEven if one disagrees with such proposals, it surely is not difficult to understand that people are legitimately worried about terrorist operatives infiltrating civilized nations through their generous visa programs and refugee policies. The blame for that apprehension lies with the terrorists, and good people inconvenienced by their violent deeds. It is profoundly counterproductive for American politicians to encourage their Muslim constituents to resent Donald Trump, instead of focusing their rage and contempt on Islamists.\nLike everything else Hillary Clinton says and does, it’s exactly the opposite of what America needs right now. It is highly relevant that she either understands nothing about the enemy we face… or understands, but lies to conceal the truth, because she finds it politically unhelpful.","url":"https://www.breitbart.com/politics/2015/12/22/hillary-clinton-refuses-apologize-lying-trump-isis/"}
