{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 22:03:43","date_modify":"2018-10-30 22:03:43","date_publish":"2016-08-25 14:11:34","description":"Donald Trump said: \"Hillary Clinton is a bigot who sees people of color only as votes, not as human beings worthy of a better future.\"","filename":"data/vaneerConsumption/HillaryClintonisaBigotHereAre10Examples.json","image_url":"https://media.breitbart.com/media/2015/06/Screen-Shot-2015-06-22-at-10.58.39-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_25__1540937023.html","title":"Hillary Clinton is a Bigot. Here Are 10 Examples.","title_page":"Trump is Right: Hillary Clinton is a Bigot. Here Are 10 Examples.","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump called Hillary Clinton a “bigot” on Wednesday: “Hillary Clinton is a bigot who sees people of color only as votes, not as human beings worthy of a better future,” he said.\nThe mainstream media are reacting with shock, horror, and outrage. CNN, for example, could not come up with a substantive response to the accusation, so it played a video of a woman in the audience, interpreting her facial expression as criticism of Trump. To the brainwashed, it is easier to laugh at an inconvenient truth than to think about it.\nBut the charge is true. Hillary Clinton spent her early political years pandering clumsily to conservative white voters. In 2008, after attempting, belatedly and badly, to pander to black voters in the Democratic presidential primary, Clinton tried appealing to white voters once again. Clinton’s new attacks are just the latest iteration of her obsession with whiteness, which she courts when she thinks she is impressing conservatives, and trashes when she panders to liberals.\nHere are ten examples.\n1. Black “super-predators.” In the 1990s, the Clintons sold themselves as Democrats who would, unlike liberals, attack the Sister Souljahs of the world. Hence her attack on “super-predators,” a remark whose racial tinge Clinton now says she regrets.\n2. “Ah don’t feel no ways TAHRD.” In 2007, Clinton tried to foreclose the challenge of an Obama insurgency by appealing to the black community. The result was cringeworthy, and the outreach did not last longer than her lead in the primary polls.\n3. Attack on Dr. Martin Luther King, Jr. After Obama shocked Clinton in Iowa in 2008, she tried to undercut his appeal by talking down the civil rights icon in favor of Lyndon Johnson, the white politician who, she said, deserved the real credit.\n4. Confederate flag. As Obama inspired blacks, Clinton’s die-hard fans, the Arkansas Travelers, brought the battle flag — the racist symbol that supposedly motivated the Charleston massacre — to South Carolina, to move white voters on her behalf.\n5. “Slumlord.” Rather than merely attack Obama for his association with corrupt Chicago politicians, Clinton went after him in a debate for representing a “slumlord.” The remark, perceived by Obama supporters as racist, was booed by the audience.\n6. African Muslim photo. Desperate Clinton staff circulated a photograph of Obama wearing Muslim garb during a trip to Somalia. Their frustration also reflected the Clinton campaign’s explicit strategy to play up Obama’s “lack of American roots.”\n7. Doing shots. As part of a deliberate — but, as in Selma, farcical — racial appeal, Clinton went “full redneck,” doing shots in bars surrounded by bemused, middle-aged white men. The hope was to offset Obama’s clear advantage among black voters.\n8. “Hard-working … white Americans.” Fighting to the very end, Clinton cited her support from “working, hard-working Americans, white Americans” in talking up her chances of winning the general election — an explicit appeal to white voters.\n9. “Colored People’s Time.” Running for president again, Clinton participated in a bad racist joke designed to prove her cultural competence with blacks while still appealing to the perceived prejudices of those “hard-working … white Americans.”\n10. “White privilege.” Clinton made Black Lives Matter about white people, declaring — the day after the Dallas shootings — that whites needed to address their “privilege.” A radical remark, yet one that leaves America’s political fate in white hands.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2016/08/25/hillary-clinton-is-a-bigot/"}
