{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:30:05","date_modify":"2018-10-30 21:30:05","date_publish":"2016-05-17 20:46:48","description":"Hillary Clinton will join the cast members of the new all-female Ghostbusters remake on the Ellen DeGeneres Show later this month. | Entertainment","filename":"data/vaneerConsumption/HillaryClintontoJoinCastofAllFemaleGhostbustersonEllen.json","image_url":"https://media.breitbart.com/media/2015/12/GhostBusters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_05_17__1540935005.html","title":"Hillary Clinton to Join Cast of All-Female 'Ghostbusters' on 'Ellen'","title_page":"Hillary Clinton to Join Cast of All-Female 'Ghostbusters' on 'Ellen' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton will join the cast members of the new all-female Ghostbusters remake on the Ellen DeGeneres Show later this month.\nDeGeneres revealed the news in a tweet early Tuesday morning:\nThe entire cast of Ghostbusters is here next week and now @HillaryClinton is coming, too! Get your Woman Cards ready. — Ellen DeGeneres (@TheEllenShow) May 17, 2016\n“Get your Woman Cards ready,” the talk show host joked.\nThe new all-female Ghostbusters — starring Kristen Wiig, Melissa McCarthy, Leslie Jones and Kate McKinnon — is set to be released July 15.\nEarlier this month, the trailer earned the dubious distinction of being the most-disliked trailer in YouTube history. As of this post, the trailer has been “thumbs-downed” more than 797,000 times.\nThe film has received criticism over its all-female cast, as well as angry accusations that the sole black Ghostbuster in the film (played by SNL‘s Leslie Jones) represents a stereotype of black women.\nDirector Paul Feig responded to the criticism of his film earlier this month, telling the New York Daily News that “geek culture is home to some of the biggest a**holes I’ve ever met in my life.”\n“I don’t care what shape or size or color or anything they are,” Feig told the outlet. “I live or die on what things are funny and whether or not people will be entertained by them.”\nThe interview will reportedly be the first sit-down interview to feature the entire principal cast of the new film.\nHillary Clinton has visited sets of television shows in the recent past; in February, the Democrat presidential frontrunner visited the set of ABC drama Scandal and posed for a photo with star Kerry Washington. Late last year, Clinton visited the set of Comedy Central’s Broad City to tape a cameo appearance that aired in March.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/05/17/hillary-clinton-join-cast-female-ghostbusters-remake-ellen/"}
