{"authors":["Breitbart News"],"date_download":"2018-10-30 21:44:27","date_modify":"2018-10-30 21:44:27","date_publish":"2016-11-05 18:43:29","description":"A 2009 email chain that shows Hillary Clinton forwarding to her daughter material that the department classified last year.","filename":"data/vaneerConsumption/HillaryClintonSentChelseaEmailonMaterialThatWasLaterClassified.json","image_url":"https://media.breitbart.com/media/2016/11/hillary-chelsea-clinton-foundation-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_05__1540935867.html","title":"Hillary Clinton Sent Chelsea Email on Material That Was Later Classified","title_page":"Hillary Clinton Sent Chelsea Email on Material That Was Later Classified | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — The State Department on Friday released a 2009 email chain that shows then-Secretary of State Hillary Clinton forwarding to her daughter material that the department classified last year.\nAt issue is a December 2009 email that President Barack Obama’s trade adviser, Michael Froman, sent to senior White House and State Department staff members. After it made its way up to Clinton, she sent it to “Diane Reynolds,” an email pseudonym for Chelsea Clinton.\n“See below,” Clinton told her daughter. The entire email chain has been blacked out on confidential grounds, the lowest level of classification.\nThe chain was among the State Department’s last release of documents from Clinton’s private server before Tuesday’s presidential election.\nThe department classified portions of two other emails released Friday.\nThey concerned phone calls Clinton had planned in November 2010 with the United Arab Emirates’ crown prince and Afghan President Hamid Karzai. At the time, WikiLeaks’ release of hundreds of thousands of diplomatic cables was roiling U.S. relations with governments around the world.\nThe emails were written by Clinton’s deputy chief of staff, Huma Abedin. The department designated portions of each “confidential.” State Department spokesman Mark Toner said neither document was marked classified when it was sent.\nFriday’s release, four days before Election Day, included 74 emails totaling 285 pages. The FBI provided the emails to the State Department after uncovering them as part of its investigation of Clinton’s email practices.\nMany emails are near duplicates of documents the department released after receiving 55,000 pages from Clinton in 2014.\nSome reflect minor additions, such as Clinton asking an aide to print out the exchange on paper.","url":"https://www.breitbart.com/politics/2016/11/05/hillary-clinton-sent-chelsea-email-material-later-classified/"}
