{"authors":[],"date_download":"2018-10-30 14:31:19","date_modify":"2018-10-30 14:31:19","date_publish":"2015-07-01 00:00:00","description":null,"filename":"data/vaneerConsumption/Hillaryreassuresvotersshesfarfromfinishedincitinghatredandfear.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_hillary_reassures_voters_shes_far_from_finished_inciting_hatred_and_fear_1540909879.html","title":"Hillary reassures voters she's far from finished inciting hatred and fear","title_page":"Hillary reassures voters she's far from finished inciting hatred and fear","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hillary Clinton roused a crowd of several thousand Democrats in Northern Virginia on Friday night... She began soberly, saying that despite the week’s Supreme Court victories and the removal of Confederate flags from a number of public venues across the country, “fear and hatred are far from finished ...”\nIn Return of the Jedi, the Emperor tried to turn Luke Skywalker to evil, saying, \"Use your aggressive feelings, boy. Let the hate flow through you!\" Although she's much older-looking than the Emperor, Hillary Clinton talks in much the same way.\nShe really sounds like one of those B-movie villains, doesn't she?\nClinton applauded South Carolina Gov. Nikki Haley (R) for calling for the Confederate flag to be removed from the grounds of that state’s capitol. But Clinton added: “We also saw the opposite from too many, even including many of the Republican candidates for president, who seem determined to lead us right back into the past.”\nA past based on the rule of law; obeying the Constitution; requiring citizenship to vote; and letting the people, not Anthony Kennedy, determine what marriage is.\nShe also chided House Republicans for voting to restrict research on gun violence. “How can you watch massacre after massacre and take that vote?” she asked.\nWhat sort of research is needed? A massacre occurs because a bad man has a gun and good men are disarmed. If good men have guns, no more mass killings. Does Mrs. Clinton really need a double-blind experiment to find this out? (Maybe not, because she seems to be double-blinded).\nTo loud boos, she noted that “recently, a Republican candidate for president described immigrants as rapists, drug dealers and criminals.” Earlier in the day, Republican National Committee Chairman Reince Priebus called that comment, from mogul Donald Trump, “not helpful.”\nTrump didn't call immigrants rapists, drug dealers, and criminals. He called illegal aliens rapists, drug dealers, and criminals. Do you think Hillary is so steeped in a life of crime that she is unable to tell the difference?\nAs for Reince Priebus, I think his comment was “not helpful.” Is there any way we can trade him over to the Democrats?\nThere were more boos when Clinton recalled the effort by Virginia Republicans a few years ago to mandate ultrasounds for women seeking abortions. It was later discovered that the examinations would have had to be performed transvaginally for pregnancies in their early weeks, which is when most abortions are performed.\nI would think Democrats nowadays would approve anything with the word “trans” in it (except trans fat). They portray this as some sort of bodily invasion. If a woman gets an abortion, she also has to do it “transvaginally,” so the abortionist will have to go spelunking in any event.\n“We don’t need any more leaders who shame and blame women,” she said.\nDo you think Hillary plans to divorce her husband before her inauguration?\n“Across the board,” she concluded, “they are the party of the past.”\nWaterboarding saves lives.\nThe Patriot Center can hold 10,000 people, and Republicans mocked Clinton for its many empty seats Friday. Democrats countered that they were not expecting to fill the arena\nSo everyone was happy! Perfect.\nExit question: Do you think Hillary can channel enough negativity and fear to distract voters from her own criminality? If a vampire talked enough about global warming and equal pay for women, do you think he could be elected president, too?","url":"https://www.americanthinker.com/blog/2015/07/hillary_reassures_voters_shes_far_from_finished_inciting_hatred_and_fear.html"}
