{"authors":["John Sexton"],"date_download":"2018-10-30 21:45:10","date_modify":"2018-10-30 21:45:10","date_publish":"2015-10-09 21:24:53","description":"Claim: Clinton Camp Asked Computer Company to Cut Stored Emails","filename":"data/vaneerConsumption/HillaryClintonAidesAskedCompanytoCutStoredEmails.json","image_url":"https://media.breitbart.com/media/2015/07/ap_hilary-rodham-clinton_ap-photo1-e1438742540899.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_09__1540935910.html","title":"Hillary Clinton Aides Asked Company to Cut Stored Emails","title_page":"Hillary Clinton Aides Asked Company to Cut Stored Emails","title_rss":"NULL","source_domain":"breitbart.com","text":"An email sent by a subcontractor suggests that Hillary Clinton’s deputies repeatedly directed them to erase months-old backups of her State Department emails, just as federal officials began asking for the emails.\nThe email was described Tuesday, in a letter sent by Senator Ron Johnson, the chairman of the Homeland Security and Governmental Affairs committee.\nJohnson’s letter outlines the complicated arrangement between Hillary Clinton’s operating company, Clinton Executive Services Corp. and its computer-server subcontractor, Platte River Networks. The Platte River subcontractor used a email backup device operated by another firm, Datto.\nJohnson writes:\n“It also appears [Platte River Networks] employees were directed by [Clinton Executive Services Corp.] to reduce how much data would be stored in each backup. In August 2015, a PRN employee raised the prospect that the length of the backups was reduced at some point during PRN’s time managing the server. In an email to a colleague with the subject line “CESC Datto,” the PRN employee asked if it is possible to use Mimecast, PRN’s email archiving system, to find an old email from CESC directing PRN to reduce the length of Datto’s backups. He wrote:\nAny chance you found an old email with their directive to cut the backup back in Oct-Feb. I know they had you cut it once in Oct-Nov., then again to 30days [sic] in Feb-ish. If we had that email, we are golden. Would Mimecast have archived it by chance? Wondering how we can sneak an email in now after the fact asking them when they told us to cut the backups and have them confirm it for our records. Starting to think this whole thing really is covering up some shaddy shit…. I just think if we have it in writing that they told us to cut the backups, and that we can go public with our statement saying we have had backups since day one, then we were told to trim to 30days [sic], it would make us look a WHOLE LOT better.”\nA footnote to this email says it was dated August 19, 2015. The same footnote mentions another email dated a day earlier which is described as “PRN employee believes CESC direction to reduce the length of time backups were kept “was all phone comm[unication]s.” It’s not clear if these two emails were part of a chain or written by the same person.\nIn any case, the suggestion that Clinton’s CESC asked for a reduction in October to November of 2014 is interesting because that’s also when the State Department formally asked Hillary Clinton for copies of emails on her private server.\nThe agency letter to Clinton and other former Secretaries of State was dated October 28, 2014 (though State first expressed interest in Clinton’s emails months earlier.)\nDespite the internal emails suggesting that the duration which backup copies were stored was actually reduced, a spokesman for Platte River Networks says no such reduction ever took place.\nAndy Boian told McClatchy the backup was initially set to 30 days and was never changed. A call to Platte River Networks to clarify the situation was not returned in time to be included in this story.","url":"https://www.breitbart.com/politics/2015/10/09/claim-clinton-camp-asked-computer-company-cut-stored-emails/"}
