{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:33:59","date_modify":"2018-10-30 21:33:59","date_publish":"2016-04-08 13:41:47","description":"Hillary Clinton is mocking the notion that she could end up in handcuffs as a result of her decision to keep her secure emails while serving as Secretary of State on a private server. | Politics","filename":"data/vaneerConsumption/HillaryClintonMocksRepublicanFantasyThatShellBePutInHandcuffs.json","image_url":"https://media.breitbart.com/media/2016/04/Hillary-Getty-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_08__1540935239.html","title":"Hillary Clinton Mocks ‘Republican Fantasy’ That She’ll Be Put In Handcuffs","title_page":"Hillary Clinton Mocks ‘Republican Fantasy’ That She’ll Be Put In Handcuffs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton is mocking the notion that she could end up in handcuffs as a result of her decision to keep her secure emails while serving as Secretary of State on a private server.\nDuring an interview on the Today show, host Matt Lauer cited Republicans who were “clinging to the hope” that they would “get to see Hillary Clinton in handcuffs.”\n“Oh my goodness!” she laughed. “Matt, I know that they live in that world of fantasy and hope because they’ve got a mess on their hands on the Republican side.”\nShe simply laughed off the notion of suffering consequences for accusations of criminal behavior.\n“That is not going to happen. There is not even the remotest chance that it’s going to happen,” she said.\nShe dismissed an FBI investigation as a “security review” that had become politicized because she was involved with it.\n“I will tell you, sitting here in the Bronx, in this cafe, we’re moving forward,” she said to Lauer. “The Republican’s fondest wishes will not be fulfilled.”","url":"https://www.breitbart.com/politics/2016/04/08/hillary-clinton-mocks-republican-fantasy-shell-put-handcuffs/"}
