{"authors":["John Sexton"],"date_download":"2018-10-30 20:12:32","date_modify":"2018-10-30 20:12:32","date_publish":"2015-07-22 00:44:54","description":"Hillary Clinton has yet to speak up about videos which show Planned Parenthood executives discussing how they harvest fetal organs for money. That silence seems significant for a candidate who has often portrayed herself as less extreme on abortion than others in her party. In fact, Hillary has frequently used the phrase \"safe, legal and rare\" when talking about abortion policy. |","filename":"data/vaneerConsumption/HillaryClintonsAbortionExtremism.json","image_url":"https://media.breitbart.com/media/2015/01/hillary_clinton_Cliff-Owen_AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/faith_2015_07_21__1540930352.html","title":"Hillary Clinton's Abortion Extremism","title_page":"Hillary Clinton's Abortion Extremism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton has yet to speak up about videos which show Planned Parenthood executives discussing how they harvest fetal organs for money.\nThat silence seems significant for a candidate who has often portrayed herself as less extreme on abortion than others in her party. In fact, Hillary has frequently used the phrase “safe, legal and rare” when talking about abortion policy.\nBut Monday Hillary tweeted about Scott Walker signing an abortion ban at 20 weeks, calling the law “exterme and unacceptable.”\nGov. Walker signed dangerous abortion restrictions into law in WI – without exceptions for rape or incest. Extreme and unacceptable. -H — Hillary Clinton (@HillaryClinton) July 21, 2015\nHow extreme is the 20-week ban in reality? According to the Star Tribune, “89 of nearly 6,500 abortions performed in Wisconsin in 2013, or roughly 1 percent, occurred after the 20-week mark.” The actual figure is 1.3%. So Hillary is calling a law which would allow 98.7% of all abortions to proceed “extreme and unacceptable.” Obviously she is not interested in making abortion safe, legal and rare if she’s denouncing something which, at most, would be a 1.3% cut in the abortion rate. Not to mention that the cut would come exclusively from late term abortions that most Americans think should be illegal anyway.\nWhat Hillary’s tweet shows is that her self-portrayal as a moderate is window-dressing. In reality, she is unwilling to countenance any attempt to make abortion even slightly more rare. She also seems to have no objection to Planned Parenthood profiting from the harvesting of fetal organs. These are not middle-of-the-road positions in America. These are the positions of the far left.\nCarly Fiorina was asked about Wisconsin’s 20-week ban on CNN and did an excellent job highlighting the extremism of Hillary’s real position on the issue. “I would be delighted if, for once, the media would ask Hillary Clinton about the extremism of her position,” Fiorina told Jake Tapper. She described Hillary’s position as, “It’s not a life until it leaves the hospital.”\nThose aren’t Hillary’s words. They come from a 1996 discussion between Senator Santorum and Senator Boxer in which Boxer said “I think when you bring your baby home, when your baby is born … the baby belongs to your family and has all the rights.” Fiorina is suggesting Hillary’s real position is in line with her friend and ally Senator Boxer. And she may have a point. In 2003, NARAL gave both Boxer and Hillary a perfect 100% voting record.\nFiorina also contrasted the tone of the sting videos in which Planned Parenthood executives discuss “fetuses and tissues and specimens” with how most doctors would discuss an ultrasound saying, “If a woman was looking at that ultrasound at that same stage in her pregnancy the doctor would not be talking about fetuses or specimens or tissues, they would be saying ‘Look at your baby’s heartbeat’.”","url":"https://www.breitbart.com/faith/2015/07/21/hillary-clintons-abortion-extremism/"}
