{"authors":["Lee Stranahan"],"date_download":"2018-10-30 18:42:40","date_modify":"2018-10-30 18:42:40","date_publish":"2016-02-16 19:09:49","description":"The first White House Ramadan dinner, held in 1996 and hosted by Hillary Clinton, revealed the ignorance both Bill and Hillary Clinton had about Islam.","filename":"data/vaneerConsumption/HillaryClintonsHistoryHowHumaAbedinWentfromInterntoTopAdviser.json","image_url":"https://media.breitbart.com/media/2016/02/huma-abedin-hillary-clinton-decision-making-dunkin-donuts-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_16__1540924960.html","title":"Hillary Clinton's History: How Huma Abedin Went from Intern to Top Adviser","title_page":"Hillary Clinton's History: How Huma Abedin Went from Intern to Top Adviser | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In Part One of this series, we looked at the people and events behind the history-making first White House Ramadan dinner, held in 1996 and hosted by Hillary Clinton — an event that revealed the shocking ignorance both Bill and Hillary Clinton had about Islam, especially in the light of events such as 1993’s attack on the World Trade Center.\nAs we detailed in Part One, that “Eid Dinner” event was put together by an organization called the American Muslim Council that was founded and headed by a man named Abdurahman Alamoudi.\nAlamoudi, who is now serving a federal prison term for funding terrorism, was a political mover and shaker with ties to not just the Clinton White House, but later to the George W. Bush White House via Republican lobbyist Grover Norquist.\nIn 1996, Alamoudi was a key Muslim influencer with the Clinton administration. Aside from the Eid dinner, an organization Alamoudi ran was vetting Islamic Army chaplains for the U.S. military.\nAnother historically significant thing happened in 1996: A 20-year-old George Washington University student named Huma Abedin landed an almost impossible-to-get White House internship.\nAt that first Eid dinner, Hillary Clinton admitted to knowing almost nothing about Islam, telling the audience that she and President Bill Clinton learned most of what they knew about Islam from their daughter Chelsea, who had taken a sophomore high school class on the Middle East.\nIn the years to come, Hillary Clinton would go on to acknowledge another source of her understanding of Islam: Huma Abedin.\nHuma is now Hillary Clinton’s closest aide and the vice-chairwoman of her presidential campaign, but as Breitbart News has shown, efforts to vet or ask basic questions about Abedin have been shut down by the mainstream media.\nWith Hillary Clinton still the odds-on favorite to win the Democrat nomination for president and with Huma Abedin at the center of Hillary Clinton’s private email server scandal, Breitbart News is doing what the MSM refuses to do — provide as much detail on the secretive Huma Abedin, who is the closest aide to one of the most powerful women in the world.\nHuma Abedin and the Muslim Students Association\nThere are no details available about the process that led to Huma Abedin becoming a White House intern assigned to Hillary Clinton in 1996, nor are there any details about how Abedin was vetted for the job.\nWhat we do know is that, in 1996, Huma Abedin was the assistant editor of a publication called the Journal of Muslim Minority Affairs and that Huma was on the executive board of a group called the Muslim Students Association at George Washington University.\nBreitbart News has extensively documented the history of the Journal of Muslim Minority Affairs, its relationship to groups that funded terrorism, and the media’s coverup of Huma Abedin’s connection to it, but a short recap is in order.\nAs Vanity Fair reported this year in one of the first mainstream media accounts of the facts about Huma Abedin:\nWhen (Huma) Abedin was two years old, the family moved to Jidda, Saudi Arabia, where, with the backing of Abdullah Omar Nasseef, then the president of King Abdulaziz University, her father founded the Institute of Muslim Minority Affairs, a think tank, and became the first editor of its Journal of Muslim Minority Affairs, which stated its mission as “shedding light” on minority Muslim communities around the world in the hope of “securing the legitimate rights of these communities.”\nVanity continues about Abdullah Omar Naseef:\nIn his early years as the patron of the Abedins’ journal, Nasseef was the secretary-general of the Muslim World League, which Andrew McCarthy (…) claims “has long been the Muslim Brotherhood’s principal vehicle for the international propagation of Islamic supremacist ideology.”\nThis connection is important because the Muslim World League was also the benefactor of a group currently active on over 600 college campuses: the Muslim Students Association.\nThe Muslim Students Association was formed in 1963 by members of the Muslim Brotherhood.\nAs the New York Times described the group’s origins, it was heavily influenced by Saudi Arabia.\nOrganized in the 1960s by foreign students who wanted collective prayers where there were no mosques, the associations were basically little slices of Saudi Arabia. Women were banned. Only Muslim men who prayed, fasted and avoided alcohol and dating were welcomed. Meetings, even idle conversations, were in Arabic. Donations from Saudi Arabia largely financed the group, and its leaders pushed the kingdom’s puritan, Wahhabi strain of Islam. Prof. Hamid Algar of the University of California, Berkeley, said that in the 1960s and 1970s, chapters advocated theological and political positions derived from radical Islamist organizations and would brook no criticism of Saudi Arabia.\nIn was during this period in the early 1970s that Huma Abedin’s father Syed was connected to the MSA at Western Michigan University.\nA search of the WMU website shows papers published by Abedin in 1972 and credited to “Abedin, Syed Z | Kalamazoo, Mich. : Muslim Students Association, Western Michigan University 1972.”\nGiven Syed Abedin’s involvement during the “slices of Saudi Arabia” early years of the Muslim Students Association, it’s not shocking that, in 1979, Syed Abedin was picked to run the Institute of Muslim Minority in Saudi Arabia. According the Journal of Muslim Minority Affairs inaugural issue in 1979, Naseef was the Institute’s Chairman.\nHuma Abedin would spend the next 16 years growing up in Saudi Arabia. When Huma Abedin was sent to the United States for college, she became part of the MSA. A page from the group’s 1996 website at Archive.org lists her on the Executive Board as the Head of Social Committee.\nIt’s not surprising that Huma Abedin was part of the Muslim Students Association, but it should raise eyebrows, and it’s a valid subject for questions since the MSA has been breeding ground for known terrorists. As the Canary Mission website summarizes:\nAnwar al-Awlaki was president of the MSA at Colorado State University during the mid-1990s. An al-Qaeda cleric linked to numerous terror plots including 9/11 and the Fort Hood shootings, al-Awlaki was the first United States citizen to be targeted and killed in a United States drone strike. After his death, he was linked to the terrorists responsible for the Charlie Hebdo massacre, to whom al-Awlaki had repeatedly preached, calling for the killing of newspapers editor, Stéphane Charbonnier. Omar Shafik Hammami was president of MSA’s chapter at the University of South Alabama during the early 2000’s. In 2006, Hammami abandoned his young wife and child and left for Somalia where he became a militant leader in the terrorist organization al-Shabaab. Ramy Zamzam was a past president of the MSA’s Washington, D.C. council, before his conviction in in 2010 for attempting to lead a group dubbed the “D.C. 5” to join the Taliban in Pakistan.\nThere’s another important connection to the Muslim Students Association — remember that, in 1996, Abdurahman Alamoudi was wielding his influence at the Clinton White House.\nAlamoudi was also the president of the Muslim Students Association’s National group in the 1980s.\nIt’s worth noting that the year after Huma Abedin came into the Clinton White House as an intern, Republican Norquist co-founded a group called the Islamic Institute, funded by two $20,000 checks — one from former Muslim Students Association National President Abdurahman Alamoudi and another from one of the 1963 founders of the Muslim Students Association, Jamal Barzinji.\nBy the end of 1990s, there would be two powerful, unelected influencers on Islamic issues working behind the scenes at the presidential level — Huma Abedin working with the Democrats and Grover Norquist working with the Republicans.\nIt is also worth noting that, when questions about Huma Abedin were raised in 2012, one of the people who sprang to her defense was Grover Norquist.\nAs Politico reported at the time in an article titled, “Norquist: Bachmann claim ‘indefensible’“:\n“It’s completely indefensible, there’s nothing else to say,” Norquist said in an interview with POLITICO. Norquist joked that the one thing he and Anthony Weiner had in common was that they “both married beautiful women.”\nNorquist is married to a Palestinian woman whom he met through the Islamic Institute. Norquist’s sister Loraine is also married to a Palestinian activist, Majed Tomeh, who co-founded the Islamic Institute with Norquist.\nHuma’s Early Influence\nHowever she ended up in the White House, it’s clear from a search of records from the Clinton White House that Abedin quickly became a go-to resource on Islam for the future Secretary of State.\nAt the 1999 Ramadan dinner, Hillary said:\nThere are many people who have made today happen, but special thanks are due to Maureen Shea, Mona Mohib and Huma Abedin for putting together this event.\nMaureen Shea was associate director of the office of Public Liaison at the White House.\nHillary Clinton goes on to to cite one example of Huma Abedin’s influence:\nI must say that I have seen very personally the impact of Ramadan because of having Huma on my staff, and have had many occasions to talk with her about the particular meaning of Ramadan.\nLater in that 1999 speech, Hillary Clinton would go on to say how she believed that the “values that are embodied in Islam” including the yearning “to live in peace,” “strengthen the United States”:\nToday, we celebrate Eid with special foods and exchanging of gifts, and by honoring the remarkable contributions of Islam that have enabled millions and millions of Muslims around the world to endure and thrive through the ages and enrich us all… We also honor the universal values that are embodied in Islam — love of family and community; mutual respect; the power of education; and the deepest yearning of all: to live in peace. Values that can bring people of every faith and culture together, strengthen us as people, and, I would argue, strengthen the United States as a nation.\nOther documents from the Clinton era show how quickly Huma Abedin went from being a White House intern to becoming an important consultant on all things Islamic, including presidential speeches.\nAccording to an email sent by Maureen Shea in 1999, Huma Abedin was one of White House’s “resident Muslims” and gave notes on a speech by President Bill Clinton.\nAmong the notes are pronunciation suggestions on the word “Muslim” as well as a note to take out a reference to Iraq as “too political.”\nThe Shea Memo read in part:\nSubject: Comments on Video 01/11/99 09:33:24 AM Hope this is helpful – I have consulted with Huma and Mona, our two resident Muslims! First of all, can you get the President to pronounce Muslims not as Moslims but as Musslims! Paragraph one: As not all Arabs are Muslims, take out Arab and simply say; “On behalf of all Americans, Hillary and I would like to send our best wishes to Muslims both here and around the world as\nIf he could say “Eid Mubarak !EED-moo-bar-akl at the end which means “blessed Eid,” that would be great. Paragraph two : • end with “and by the fasting which is one of its five pillars.” Paragraph three: too political: Keep first line and take out the rest – the part on Iraq is especially out of place in a religious message.\nThe line that the “resident Muslims” wanted removed was: “I especially hope we will see the lives of the Iraqi people improve. They have suffered from a harsh dictatorship for too long.”\nThat was considered too political.\nBy 1999, internal White House memos would show that the “generic” Clinton take on Islam would be that “we have no issue with Islam, issue is those who distort religion, or nationalism, or ethnic feelings to suit their political interests.”\nThis, of course, would be the standard line from the Clinton administration to the George W. Bush administration to the Obama administration; despite the rise of al-Qaeda and then ISIS, despite attacks on the World Trade Center, London, and Paris, and despite the sharp spike in worldwide terrorism since the Arab Spring, the messaging from Washington is always “we have no issue with Islam.”\nA few days after terrorists toppled the World Trade Center in 2001, George W. Bush would stand in a Mosque in an event arranged by Grover Norquist and Khaled Saffouri, the man who had organized the first Eid dinner at the Clinton White House. Bush would tell the world, “Islam is peace.”\nEleven years later, Hillary Clinton would be Secretary of State, with Huma Abedin at her side. After terrorists from Ansar al-Sharia killed four Americans in Benghazi, Libya, President Obama would tell the United Nations that “the future must not belong to those who slander the prophet of Islam.”\nThe influence operation appears to have worked.","url":"https://www.breitbart.com/politics/2016/02/16/hillarys-history-how-huma-abedin-went-from-intern-to-top-adviser/"}
