{"authors":["John Hayward"],"date_download":"2018-10-30 20:50:17","date_modify":"2018-10-30 20:50:17","date_publish":"2015-04-13 19:40:26","description":"America needs bigger people, which means smaller government; more honesty, which means less political rhetoric; more property, which requires less collectivism; and more liberty, which demands less compulsion, not better-hidden compulsion. A greater burden of law and bigger political initiatives means more of us will be redefined as criminals and losers, and we can't afford that. |","filename":"data/vaneerConsumption/HillaryClintonChampionOfthePrivilegedPoliticalClass.json","image_url":"https://media.breitbart.com/media/2015/04/Hillary-in-washington.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_13__1540932617.html","title":"Hillary Clinton: Champion Of the Privileged Political Class","title_page":"Hillary Clinton: Champion Of the Privileged Political Class | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton’s campaign announcement to the press included an embarrassing typo, as it declared the candidate has “fought children and families all her career.” It was, of course, supposed to claim that she fought for children and families. Evidently not even her own campaign staff is Ready4Hillary.\nOff we go on another exhausting faux-populist left-wing campaign, in which an ancient socialist is trotted out and repackaged as a fresh and exciting candidate with tons of youth appeal, even though none of her ideas – to the extent Hillary Clinton even seems to have any – is less than six decades old, and nobody has been damaged more completely by Democrat economic policies than the young. The same media that routinely screams about “divisiveness” every time a Republican dares to mention a social issue will now fawn over Clinton as she aims to divide Americans into warring camps, declaring herself the “champion” of those who can’t get theirs unless Big Government takes it from someone else at gunpoint. The media will carefully refrain from mentioning that “inequality” has gotten rapidly worse under the most left-wing president in history, under just about any metric that could be used to define something as subjective as “inequality.”\nWatching one Democrat claim she can fix the “inequality” created by eight years of another is hilarious. The hard truth beneath all the gauzy campaign rhetoric is that government power tends to enrich those plugged into government. The ruling Party and its special friends make out like bandits, while everyone else is taught to make do with less. Obama’s tenure has offered an incredibly clear demonstration of this truth, for anyone who still has the capacity to see and learn.\nDemocrat rhetoric ignores this and postulates a theoretical battle between mythic caricatures of The Evil Rich, The Sainted Middle Class, and the Deserving Poor. We’re supposed to believe government power can balance the scales between these groups and chisel a more equitable society from the rough stone of free-market capitalism. It shouldn’t be necessary to study years of Obama’s cronies raking in fortunes while the little guy’s wages remain stagnant and the American workforce collapses, to understand why that mythology is false. It should require only a bit of careful, logical thought. Theft requires coercive force, and that’s all government is. Those who seek to make government richer and more powerful will always deliver wealth to their donors and supporters, but never the “fairness” they promise to the “middle class,” “working families,” or whatever euphemism they apply to the suckers who end up paying for everything.\nI recommend deep skepticism about these “I’ll fight for you!” promises from the political class, including those coming from Republicans. Ask the tough follow-up questions: Who will you be fighting, and what did they do wrong? Specifics, please – name the individuals and cite the crimes, or spare us these constant declarations of civil war.\nRemarkably, in the wake of the Indiana religious-freedom battle, it was necessary to remind liberals that government is force – some of them actually tried to deny it, having grown blind drunk on rhetoric about righteous government acting as the avatar of noble popular will, “another name for the things we all do together.” What puerile rubbish! What an infantile mind you must have, to see the State as your loving and benevolent mommy!\nThere are no 100-percent unanimous public initiatives. There is always dissent, and disobedience. Law is meaningless without compulsion to back it up. This reality is not altered by concealing the use of force from its subjects, as in the case of payroll withholding, which hides the sting of the tax burden from most Americans in the same manner a mosquito numbs the skin before drinking blood. The reality of compulsion also is undiminished when the laws enforced by the State have lovable names or noble purposes. If memory serves correctly, it was economist Walter Williams who pointed out in the 1990s that even something as high-minded as the Americans With Disabilities Act can ultimately end with armed agents of the government squaring off against determined resistance.\nThis is not an argument for anarchy, because anarchy is not a condition of minimal coercive force. It just changes the source of coercion, from duly appointed agents of an overweening government to warlords and street gangs. (This is another lesson that must be frequently repeated to those who harbor infantile fantasies equating anarchy with freedom.) Every form of theft, from home invasion burglary to corporate fraud, is an exercise of force. Deception is force, because it subverts free will, tricking the mark into making a choice he would not willingly have made. We could envision law as an equation, in which the use of legitimate government compulsion is balanced against the threat of illegitimate force, resulting in a net balance of liberty.\nThe trick for a successful society is to find the best possible balance of force against force, law against criminality, to allow maximum freedom for the law-abiding. It is certainly possible for us to be left less free by laws supposedly intended to make us more safe. As we seek this ideal balance, we should remember that those who profit from compulsive force – including almost everyone in the political class and unelected bureaucracy, by definition – always want more of it. They’ll never tire of telling us how life can be improved by giving them more power over it. They’re not always wrong, mind you, but it’s wise to be suspicious of them. Big promises can only be achieved with great force.\nAnd with great force comes great theft. Notice how hard the Left works to destroy the ideals of property ownership, including the intellectual property that comes with individuality. Collectivism is all about ignoring the intellectual and legal prerogatives of individuals and treating them as members of groups, classified as collectively guilty or virtuous at the convenience of politicians, who skim a huge amount of money off the top for their services as brokers of cosmic justice.\nThere’s never been a more absurdly obvious representative of the parasitic political class than Hillary Clinton – the woman who vows to champion the oppressed while pocketing $300,000 for giving a speech, who claimed to be “dead broke” after years of political life gave her only two mansions, the eternal “victim” carried aloft in a sedan chair by Beltway powerhouses and coastal media elites. She kicked off her campaign with a “listening to the people” road tour that will disguise her personal ambition as the collective will of the amorphous Sainted Middle Class. (Our Ruling Class naturally reserves the right to decide which of us have legitimate opinions about their activities, and which of us are selfish, hateful obstacles to progress who don’t really count.)\nWe don’t need another power- and money-hungry aristocrat with big ideas for fixing all the problems created by the last aristocrat, who also promised charter flights to Utopia at reasonable prices paid by other people. We don’t need another divisive harangue from a self-styled “champion” looking to “fight” some law-abiding Americans on behalf of others.\nOur sense of national goodwill and social harmony has been strained to the breaking point already. America needs bigger people, which means smaller government; more honesty, which means less political rhetoric; more property, which requires less collectivism; and more liberty, which demands less compulsion, not better-hidden compulsion. A greater burden of law and bigger political initiatives means more of us will be redefined as criminals and losers, and we can’t afford that.","url":"https://www.breitbart.com/politics/2015/04/13/hillary-clinton-champion-of-the-privileged-political-class/"}
