{"authors":["Ian Hanchett"],"date_download":"2018-10-30 19:56:52","date_modify":"2018-10-30 19:56:52","date_publish":"2015-10-24 02:51:18","description":"Hillary: VA Scandal Not 'As Widespread' As Made Out To Be, Republicans 'Want It To Fail'","filename":"data/vaneerConsumption/HillaryVAScandalNotAsWidespreadAsMadeOutToBeRepublicansWantItToFail.json","image_url":"https://media.breitbart.com/media/2015/10/Hillary-VA-1023-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_23__1540929412.html","title":"Hillary: VA Scandal Not 'As Widespread' As Made Out To Be, Republicans 'Want It To Fail'","title_page":"Hillary: VA Scandal Not 'As Widespread' As Made Out To Be, Republicans 'Want It To Fail' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic presidential candidate former Secretary of State Hillary Clinton argued the VA scandal is not “as widespread as it has been made out to be” and Republicans “want it to fail, so then we can argue for privatization” in an interview broadcast on Friday’s “Rachel Maddow Show” on MSNBC.\nHillary began by stating that she doesn’t understand why fixing the VA has been so difficult, and “I don’t understand why we have such a problem, because there have been a number of surveys of veterans, and, overall, veterans who do get treated are satisfied with their treatment.”\nShe continued, “Now, nobody would believe that from the coverage that you see, and the constant berating of the VA that comes from the Republicans, in part, in pursuit of this ideological agenda.”\nHillary conceded that there has been a real scandal, but “it’s not been as widespread as it has been made out to be. Now, I do think that some of the reforms that were adopted last year should be given a chance to work.”\nShe later added, “I think it goes deeper than that, because if you look at, not only VA healthcare, but the backlog on disability determinations, there’s something not working within the bureaucracy, and I have said I would like to literally appoint a SWAT team. I mean, bring in people ,and just tackle the disability, have an ongoing review of the care that is being given, do more to make sure that every VA hospital is delivering care to the highest standard of the community, because unfortunately some are doing a lot better job than others are. And I think that the current new leadership that president Obama did put in, seems to be trying to tackle a lot of this.”\nHillary concluded, “I just don’t know if they have enough help, and here’s a perfect example of the way that the Republicans try to have it both ways. They try to create a downward spiral, don’t fund it to the extent that it needs to be funded, because we want it to fail, so then we can argue for privatization. They still want to privatize Medicare. they still want to do away with Social Security, and these are fights we’ve been having for 70, 80 years now. so we cannot grow weary in the face of these ideological assaults on basic fundamental services, whether it’s the VA, Medicare, Social Security, but we have to be more creative about trying to fix the problems that are the legitimate concerns so that we can try to stymie the Republican assault.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/10/23/hillary-va-scandal-not-as-widespread-as-made-out-to-be-republicans-want-it-to-fail/"}
