{"authors":[],"date_download":"2018-10-22 22:35:26","date_modify":"2018-10-22 22:35:26","date_publish":"2014-06-10 15:59:18","description":"\"It is written for anybody who wants to think about and learn about what is happening in the world today,\" she says in New York City.","filename":"data/vaneerConsumption/HillaryClintonKicksOffNationwideBookTour.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/499506/clintonbbook_df0e162193a02f8002b2eb003e63b9fe.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_hillary-clinton_hillary-clinton-kicks-nationwide-book-tour-n127421_1540247726.html","title":"Hillary Clinton Kicks Off Nationwide Book Tour","title_page":"Hillary Clinton Kicks Off Nationwide Book Tour","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNEW YORK – Former Secretary of State Hillary Clinton officially kicked off her nationwide book tour Tuesday in New York City, further fueling speculation about a possible 2016 presidential run.\n“I am looking forward to not only meeting you, but also having the chance to hear from you as we go through the day,” she said just before taking her seat behind a desk to sign books.\nClinton received a campaign rally-like welcome inside the packed Barnes & Noble bookstore in Union Square as she arrived to sign copies of her just-released memoir -- “Hard Choices.”\nThe book details the four years Clinton spent serving as secretary of state in President Barack Obama’s administration, though it appears to have been carefully written so not to preclude her from any future political endeavors.\n“It is really about the hard choices everybody has to make in life and in particular the hard choices that I made or was part of making during the four years as Secretary of State. It is written for anybody who wants to think about and learn about what is happening in the world today,” said Clinton, who wore a hot pink pantsuit.\nEager attendees began lining up outside the store almost 24 hours in advance for the chance to meet the former first lady. Only the first 1,000 people could receive wristbands and purchase books.\nSean Brennan of Queens was first in line, staking out his position starting at 2:30pm Monday.\n“Anyone raked over the coals as much as she has and who still wants to come back and fight for our country is more than admirable,” Brennan said, noting that he wants to tell Clinton: “I know it's selfish but please, please give us eight more years.”\nReady for Hillary, a political action committee meant to help grow a grass-roots infrastructure for a 2016 Clinton bid, was onsite Tuesday, as well. “The Hillary Bus” was parked outside the bookstore in Manhattan, where activists passed out stickers to folks waiting in line.\nClinton would be the heavy Democratic favorite in 2016 if she does chooses to run for president again. A recent Washington Post/ABC News poll showed 66% of Democratic-leaning voters said they would vote for Clinton in a presidential primary.\nSony Lim of Brooklyn says Clinton would definitely have her vote.\n“She is an inspiration to all young women who are starting out in politics. I have seen her give up so much in her life for politics and for the good of the republic,” Lim said.\nWhile Clinton has been traveling the country doing paid speeches in recent months, this tour will put her on a much more rigorous – and campaign-like – schedule. She will visit at least 15 different cities over the next two weeks including Washington, Philadelphia, Seattle, Los Angeles, Kansas City and Austin. Plus, she is doing a host of television interviews to promote the book, including with NBC News.\nAnd while this book tour could be the precursor to another White House run, Clinton says she has yet to make up her mind.\n“The time for another hard choice will come soon enough,” she writes in the book.\nThe lack of a formal announcement hasn’t stopped Republicans from already preparing for another Clinton bid.\nOn Monday, the Republican National Committee unveiled a 47-page research memo entitled “Bad Choices” to give Republicans talking points to fire back at Clinton’s book.\nAnd the conservative group Emergency Committee for Israel aired a 30-second TV ad criticizing the former Secretary of State in select markets.\nIt may be a year and a half to go before the first nominating contests begin, and there are no declared candidates for president. But, like it or not, the 2016 campaign seems to already be underway.","url":"https://www.nbcnews.com/politics/hillary-clinton/hillary-clinton-kicks-nationwide-book-tour-n127421"}
