{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:28:20","date_modify":"2018-10-30 21:28:20","date_publish":"2015-10-22 15:30:49","description":"Hillary Clinton says she did not generally send or receive emails during the daytime during her tenure as Secretary of State.","filename":"data/vaneerConsumption/HillaryClintonIDidNotEmailDuringTheDay.json","image_url":"https://media.breitbart.com/media/2015/10/Hillary-Clinton-hands-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_22__1540934900.html","title":"Hillary Clinton: 'I Did Not Email During The Day'","title_page":"Hillary Clinton: 'I Did Not Email During The Day' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON – Hillary Clinton says she did not generally send or receive emails during the daytime during her tenure as Secretary of State, despite copious evidence to the contrary.\n“I did not email during the day except on rare occasions when I was able to,” Clinton said. Clinton spent a chunk of time at Thursday’s House Benghazi Committee hearing defending herself against the suggestion that she exposed classified information on email, saying that she did not conduct the business of the U.S. government on email.\nClinton said that she did agency business in classified briefings, including times when couriers brought her information that was “so top-secret it was brought into my office in briefcases” and had to be immediately returned to the courier.\nHowever, State Department email dumps show many instances of Clinton emailing during the day, with her top aides, with her personal friends, with her adviser Sidney Blumenthal, and with many others. In fact, Clinton sent an email the very morning of the Benghazi attack, trying to find a copy of a “Harvey [Weinstein] movie about Libya in which she appeared to talk about gender issues.","url":"https://www.breitbart.com/politics/2015/10/22/hillary-clinton-not-email-day/"}
