{"authors":[],"date_download":"2018-10-22 22:59:10","date_modify":"2018-10-22 22:59:10","date_publish":"2014-06-11 16:53:46","description":"Hillary Clinton said Wednesday that Eric Cantor's opponent David Brat \"basically ran against immigrants.\"","filename":"data/vaneerConsumption/HillaryClintonCantorOpponentRanAgainstImmigrants.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/502476/140611-hillary_clinton_cantor-1246_b389bd4261f2ead53ddd871648b90ba8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_hillary-clinton_hillary-clinton-cantor-opponent-ran-against-immigrants-n128556_1540249150.html","title":"Hillary Clinton: Cantor Opponent 'Ran Against Immigrants'","title_page":"Hillary Clinton: Cantor Opponent 'Ran Against Immigrants' ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCHICAGO -- After a top House Republican lost his seat to a Tea Party insurgent Tuesday night in a race dominated by the debate over immigration, Hillary Clinton decried “negative attitudes” towards immigrants in America and called for more “fact-based” public conversation about the issue.\n“We just saw this race in Virginia where Eric Cantor – the second ranking Republican in the House, was defeated by a candidate who basically ran against immigrants,” Clinton said about Cantor’s unexpected defeat by conservative David Brat.\nSign up for breaking news alerts from NBC News\nShe continued: “[Brat’s] argument was this: There are Americans out of work so why should we allow immigrants into our country to take those jobs. And I think that’s a fair, I think that’s a fair question. But the answer is not to throw out of work and deport the 11 million immigrants who are contributing already to our economy. The answer is to grow our economy to create more jobs.”\nThe former secretary of state spoke at a Chicago Ideas event with Mayor Rahm Emanuel on the second day of a cross-country book tour to promote her new memoir.\n“Chicago is at the real core of my family, who we are, where we come from,” the Windy City native told the nearly 1,500 attendees, who all received autograph copies of her book.\nThe mayor – a longtime aide and friend to the Clintons - did not pass up the opportunity to ask Clinton about one of her more controversial recent comments.\n“Hillary, dead broke? Really?” Emanuel pressed, referring to her recent remark to ABC’s Diane Sawyer that her family was “not only dead broke, but in debt” in 2001 after leaving the White House.\n“That may have not been the most artful way of saying that Bill and I have gone through a lot of different phases in our lives,” the former First Lady replied. “That was then, this is now. Obviously we are very fortunate. We have been given great opportunities.”\nThe Clintons and Emanuel have a long history together – more than 20 years, Clinton noted Wednesday – after Emanuel moved from Chicago to Little Rock to work on Bill Clinton’s first presidential campaign. She even wrote about the Chicago mayor in her book, calling him “a creative thinker” who is known for “his forceful personality and vivid language.”","url":"https://www.nbcnews.com/politics/hillary-clinton/hillary-clinton-cantor-opponent-ran-against-immigrants-n128556"}
