{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:29:08","date_modify":"2018-10-30 21:29:08","date_publish":"2015-04-26 22:26:00","description":"Research tracing back through the 2012 and 2008 primaries suggests the longest a candidate went without doing an interview with national press after a presidential bid announcement was roughly two days. Hillary Clinton has gone two weeks. And counting. |","filename":"data/vaneerConsumption/HillaryClintonSetsRecordLongestPresidentialCandidateToDodgeNationalPressInModernHistory.json","image_url":"https://media.breitbart.com/media/2015/04/hillary-clinton-diner-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_26__1540934948.html","title":"Hillary Clinton Sets Record, Longest Presidential Candidate To Dodge National Press In Modern History","title_page":"Hillary Clinton Sets Record, Longest Presidential Candidate To Dodge National Press In Modern History | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Secretary of State Hillary Clinton holds a dubious record: she’s gone longer than any presidential candidate in modern history without appearing on a national television news network or conducting a sit down interview with national media.\nClinton, the likely Democratic presidential nominee, announced she would run for president via a recorded two-minute video message on Twitter Sunday April 12th. Following the announcement, Clinton dashed off to Iowa in her “Scooby” van without giving any time to the national press, and very little time – if any – to local reporters.\nResearch tracing back through the 2012 and 2008 primaries suggests the longest a candidate went without doing an interview with national press after a presidential bid announcement was roughly two days.\nJoe Biden, John McCain, Ron Paul, Rudy Guliani, John Edwards and Mike Huckabee all conducted interviews with the media on the same day as their presidential bid announcements.\nBoth President Obama and Mitt Romney gave national interviews the day after they made their 2008 presidential bids official. Romney also did a sit down interview with Fox News’ Sean Hannity the evening of his 2012 announcement.\nObama announced his run for president on February 10, 2007 and addressed the media the very next day. He and his wife even did a sit down interview special just two days later, which aired on CBS.\nHillary Clinton went two days in the 2008 primaries before speaking to national media. She announced she would vie for the White House January 20, 2007 and did her first national interview on January 22, 2007.\nLooking at 2012, Newt Gingrich appeared on Fox News the same day as his announcement, and Rick Santorum appeared on ABC’s Good Morning America the morning of his announcement discussing his day’s event and criticisms of President Obama.\nThe Associated Press caught Texas Gov. Rick Perry on camera following his first campaign event answering reporter questions off the cuff.\nBuddy Roemer, Fred Karger and Jon Hunstman Jr. all spoke to national media the same day as their presidential bid for the Republican nomination in 2012.\nMichele Bachmann appeared on ABC’s Good Morning America the day after her announcement, and Herman Cain appeared on Fox News with Chris Wallace the day after he made his 2012 bid official.\nAnd tracking back 16 years to 1999, President George W. Bush made his presidential campaign official in Cedar Rapids, Iowa on June 12th, and by June 16th – just four days later – he was doing a sit down interview with CNN. Also in 1999, Democratic candidate Al Gore sat down for an ABC 20/20 interview with Diane Sawyer the night before he made his 2000 campaign announcement.\nIt has been more than two weeks since Clinton officially threw her hat in the ring, but she has only spoken with local reporters at roundtable events with voters and business owners.\nRNC Spokesman James Hewitt tells Breitbart News, “Hillary Clinton is sticking to small, staged events because she can’t give an honest answer to any tough questions regarding her secret email scandal or the troubling new revelations surrounding the foreign donations to the Clinton Foundation.”\nRep. Marsha Blackburn (R-TN) previously told Breitbart News Clinton’s team realizes it must manage her.\n“I think what they are going to do is very carefully manage her appearances,” explained Blackburn, adding that she believes the Democrats will “stage-manage” Clinton through this race.\nBreitbart News reached out to Clinton spokesman Nick Merrill on the matter, but has not received comment.","url":"https://www.breitbart.com/politics/2015/04/26/hillary-clinton-sets-record-longest-presidential-candidate-to-dodge-national-press-in-modern-history/"}
