{"authors":["Ben Shapiro"],"date_download":"2018-10-30 21:41:45","date_modify":"2018-10-30 21:41:45","date_publish":"2015-09-03 01:46:40","description":"Hillary Clinton's latest private server emails from her time as Sec. of State reveals her State Department’s long-standing anti-Israel bias.","filename":"data/vaneerConsumption/HillaryClintonEmailsShowRabidAntiIsraelCorrespondencewithSidneyBlumenthal.json","image_url":"https://media.breitbart.com/media/2015/09/hillary-clinton-sidney-blumethal-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_02__1540935705.html","title":"Hillary Clinton Emails Show Rabid Anti-Israel Correspondence with Sidney Blumenthal","title_page":"Hillary Clinton Emails Show Rabid Anti-Israel Correspondence with Sidney Blumenthal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The release of the latest tranche of Hillary Clinton emails from her private server while she was Secretary of State reveals her State Department’s long-standing anti-Israel bias.\nNot only does a wildly disproportionate amount of correspondence concern Israel, but much of it comes from rabidly anti-Israel smear artist Sidney Blumenthal, who routinely sent Hillary articles from left-leaning media criticizing Prime Minister Benjamin Netanyahu.\nOn May 17, 2010, Blumenthal wrote Hillary a direct email excoriating Israel for barring anti-Israel psychotic Noam Chomsky. Blumenthal wrote:\nHis political views may be ridiculous or objectionable, though he is the greatest linguistic scholar in the world, but barring him for his political opinions has created a needless PR disaster, not least for the US, as he is, after all, a US citizen, and a very prominent one internationally. It is unfortunate on every level. And the US should not be a passive onlooker. He is a US citizen barred for his political views, after. This story is splashed across the European press this morning. Not what anyone needs, yes, yes, like a hole in the head, and bone stupid, but the US effort to gain entry should be part of the story. This incident can be profitable if Israel understands it should not be doing this to US or European critics in the future. This is a downward slope, bad news for everyone involved.\nHillary’s response: “Pls print 3 copies.” The same day, Blumenthal sent Hillary a piece from the New York Review of Books critical of Israel. Blumenthal blasted “The hysterical tone of much of Israeli leadership and US Jewish community.” Hillary’s response: “Pls print 3 copies.”\nIn May 2010, after Israeli forces boarded a terrorist flotilla aimed at the Gaza Strip, Clinton’s email box filled with anti-Israel critiques from other members of the State Department, as well as media members like Daniel Kurtzer of The Washington Post. On May 31, Blumenthal and Clinton had an email exchange about an article concerning Netanyahu’s reaction to the Gaza flotilla—naturally, from left-wing Israeli outlet Ma’ariv. The article painted Netanyahu as wildly unflattering toward the United States, even though the prime minister strongly denied all allegations in the article. Clinton wrote to Blumenthal, “Are you up? Can I call?” That same day, Blumenthal sent his ridiculously anti-Israel observations:\nFirst observation: Bibi’s Entebbe in reverse. The father, Benzion Netanyahu, 100 years old, secretary to Jabotinsky, and denounced as too radical by Begin, adored his son Yoni, heroically killed at Entebbe. Benyamin has never measured up….The raid on the ship to Gaza resembles the raid on Entebbe, except that there are no hostages, no guns, it’s not in Africa, and it’s a Fiasco; otherwise, it’s Entebbe…whatever the outcome of such a raid, one of the inevitable ones would be the death of the peace process, such as it is, on the very eve of Bibi’s scheduled visit to Obama, which would have been, under any circumstance, in light of the raid, profoundly humiliating for the president. Or are the Israelis bone stupid? I don’t think so. Cheers, Sid.\nOn July 1, 2010, Blumenthal sent Clinton and aide Cheryl Mills an article from Ma’ariv, an Israeli newspaper, quoting unnamed sources saying Clinton was not “relevant” with regard to Middle East negotiations. He attributed such comments to Netanyahu’s office and added, “Do they honestly think that publicizing a quote like this, on record or off, works to their advantage.”\nBlumenthal is nearly as radical as his son, Max, who has compared the Israelis to the Nazis and called for the destruction of the state of Israel outright. And yes, Sidney sent Max’s work to Hillary.\nBen Shapiro is Senior Editor-At-Large of Breitbart News and The New York Times bestselling author, most recently, of the book, The People vs. Barack Obama: The Criminal Case Against The Obama Administration (Threshold Editions, June 10, 2014). Follow Ben Shapiro on Twitter @benshapiro.","url":"https://www.breitbart.com/politics/2015/09/02/hillary-clinton-emails-show-rabid-anti-israel-correspondence-with-sidney-blumenthal/"}
