{"authors":["Scott Horsley","Mara Liasson"],"date_download":"2018-10-22 21:15:38","date_modify":"2018-10-22 21:15:38","date_publish":"2016-07-26 00:00:00","description":"Hillary Clinton clinches the Democratic presidential nomination. She becomes the first female presidential candidate for a major U.S. political party.","filename":"data/vaneerConsumption/HillaryClintonMakesHistoryAsSheSecuresPresidentialNomination.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_07_26_487551886_hillary-clinton-makes-history-as-she-secures-presidential-nomination_1540242938.html","title":"Hillary Clinton Makes History As She Secures Presidential Nomination","title_page":"Hillary Clinton Makes History As She Secures Presidential Nomination : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Hillary Clinton Makes History As She Secures Presidential Nomination\nHillary Clinton clinches the Democratic presidential nomination. She becomes the first female presidential candidate for a major U.S. political party.\nAUDIE CORNISH, HOST:\nI'm Audie Cornish at the Democratic National Convention in Philadelphia where we are watching live as Democrats conduct their roll call. They're preparing to officially nominate Hillary Clinton as the nominee, which would mean we'd no longer have to say presumptive nominee. I'm joined at my side by NPR's Mara Liasson. Hey there, Mara.\nMARA LIASSON, BYLINE: Hi, Audie.\nCORNISH: Remind us this process exactly what's happening.\nLIASSON: Each state is delivering its delegates to either Bernie Sanders or Hillary Clinton. We're now at South Carolina. And according to our crack brain room who has calculated this, South Dakota should put her over the top. And I think South Dakota comes after South Carolina.\nCORNISH: And we can hear the delegation kind of making its pronouncement. We also have Scott Horsley on the floor. Scott, can you hear me?\nSCOTT HORSLEY, BYLINE: I can, Audie. How are you?\nCORNISH: What's the mood down there?\nHORSLEY: Well. There's this sort of breathless anticipation as we go state by state? We heard a moment ago from Rhode Island, the little state with a big heart and now South Carolina. Some of these vote totals have been very personal as people deliver them. We heard Larry Sanders, Bernie Sanders' brother, giving a vote for his brother from the overseas Americas. We heard Betsy Everling (ph), one of Hillary Clinton's childhood friends, delivering her votes and the delegates of Illinois for Hillary Clinton.\nSo it's been very interesting. There's not a lot of drama about what the final outcome will be, but there's a lot of drama about just what shape this nominating process will take.\nCORNISH: And right now we're about to hear from South Dakota. Let's listen to a little bit of that.\nUNIDENTIFIED MAN: ...Extend my hand to you from my heart with good feelings in our beautiful Lakota language.\nUNIDENTIFIED WOMAN #1: From the great state of South Dakota, land of Mount Rushmore, land that brought us George McGovern, who in 1972 - the first convention that practiced affirmative action and chased the - changed the face of the Democratic Party delegates forever. Half were women, and all minorities were represented. We proudly pass our 25 votes, 10 for the senator Bernie Sanders, who inspired us all, and 15 for the 45th president of the United States and the first one who will be called Madame President, Hillary Rodham Clinton.\n(CHEERING)\nCORNISH: Cheering from the crowd there as South Dakota has just named its delegates. And throughout the night we have been hearing each state saying that they're supporting the Sanders - those delegates speaking up for Sanders. Mara Liasson, that was an important opportunity for some of these delegates, right?\nLIASSON: This is an important opportunity. You know, one of the big stories we've been following all along, of course, is the disgruntlement of the Sanders supporters. And some of it has been fury, actually, and they don't want to give up. But this is the night they actually get to vote for Bernie Sanders.\nAnd there has been a lot of raucous demonstrations on the floor. We're not seeing it now. We heard that some Sanders supporters were claiming to walk out after the roll call was done. But we haven't seen that yet. And now we're at Tennessee, so we're getting through the alphabet here...\nCORNISH: We're on our way.\nLIASSON: ...Waiting to see if Bernie Sanders does what the Clinton campaign and the Bernie Sanders campaign were discussing among themselves, which is that after the roll call vote is over, he would stand up and ask that the convention give the nomination to Hillary Clinton by acclamation.\nCORNISH: And we're hearing actually from our numbers folks that at this moment, Hillary Clinton is over the top in terms of the numbers she needs to win the nomination. It is official. We're still hearing from states. Texas right now is about to talk about how it's spread out its 251 delegates.\nLIASSON: What's interesting about the...\nHORSLEY: One thing I can tell you, Audie, is that when the Clinton team was describing this process to reporters earlier today, they said it was very important that they get all the way through the roll call of the 50 states plus the overseas territories. So I think they're withholding any announcement about being over the top until they have let all those states and territories give their vote totals.\nThere's also a huge scrum of reporters and photographers gathered around the Vermont delegation eager to see if Bernie Sanders himself makes an appearance and does announce that acclamation, something akin to what Hillary Clinton did for Barack Obama eight years ago.\nCORNISH: So she's gone over, but you're saying the party doesn't necessarily - they want to have the process play out.\nLIASSON: They want to have the process play out because the process has been such a controversial issue at this convention. In 2008, Hillary Clinton said - stood up and said, we don't have to finish the roll call. Let's just make Obama the nominee by acclimation. This time they're going to - they don't want to have any question that every single vote was able to be cast.\nCORNISH: But let's pause for a minute, Mara. I mean this is a historic moment, is it not?\nLIASSON: It's a historic moment - the first female nominee of a major American political party. This is the penultimate glass ceiling to be broken. And it is a historic moment. You've heard a lot about that from many speakers tonight, particularly women. And it sometimes has gotten lost in the shuffle partially because so many women have been heads of state and government all around the world. British - Britain - Great Britain is on its second female prime minister - also because Hillary Clinton has been around so long.\nBut she has through her long career as the most prominent female politician in America made it seem normal, that there should and could be at some point a female American president.\nCORNISH: Though in terms of trying to make a point, it's not for lack of trying, right, Scott Horsley? When you look at the faces that these delegations have put forward, a lot of them were women senators.\nHORSLEY: And that's right. And what a lot of the women who've been reading off the vote totals have been highlighting - famous first women in their state. A lot of them have made a point of saying, we cast so and so many delegates for the first woman president of the United States. You just heard the announcement from South Carolina that it would be the first president to be called Madame President. And Vermont...\nLIASSON: Oh, Vermont passed.\nHORSLEY: Vermont just passed, so that's a clue that in fact they are going to cycle through the W States and then come back to Vermont for sort of the crowning capper on this roll call vote.\nCORNISH: But no sign of Bernie Sanders yet.\nHORSLEY: Well, not yet because I think if and when he enters this convention hall, there's going to be some kind of pandemonium, and they don't want to dwarf the roll call vote from Washington and Wyoming and the W's yet.\nCORNISH: I know it's hard for us all to see from our different vantage points here, but for the delegations where there were a lot of Bernie Sanders supporters - say Colorado or in Oklahoma - is everyone kind of sticking around in their seats. Like, what's the mood there?\nHORSLEY: Yeah, there's no sign of vacant seats that I can see here, and certainly the Vermont delegation was one of those delegations that was obviously heavily for their favorite son, Senator Bernie Sanders. Just a couple of hours ago, somebody passed out a whole bunch of handmade signs supporting Hillary Clinton to members of the Vermont delegation. And we'll see if those get held up - still lots and lots of Bernie signs as well to be sure but a lot of Hillary signs in the convention hall.\nCORNISH: In the meantime, Mara, can you talk about sort of what we're seeing in terms of response to how this convention is going, right? I mean, we talked about Trump getting a bump out of the Republican National Convention. I know we're only the second day in, but that first day was rough.\nLIASSON: The first day was rough. Democrats had come to Philadelphia hoping they could make a real contrast with the Republicans by showcasing how unified they were compared to the Republicans, who were very divided. So many Republican elected officials stayed away from Cleveland. There was the stunning non-endorsement by Ted Cruz, the runner up who said, vote your conscience. That didn't happen here. Bernie Sanders of course had already endorsed Hillary Clinton, and he gave a speech last night that was very full-throated in support of her.\nBut Bernie Sanders' delegates were just not ready to concede. And what inflamed them even more was the hacked emails from the DNC that revealed that just as the Sanders camp had been suspecting and claiming all through the primary, the DNC was biased in favor of Hillary Clinton.\nNow, that's not that unusual. Usually the party establishment is in favor of the front-runner, but in this case, it really inflamed the Bernie Sanders forces to the extent that Debbie Wasserman Schultz, the chairman of the party, had to step down. And that's why she's not providing over this convention now.\nCORNISH: And we've seen lots of high sort of Sanders figures.\nHORSLEY: Oh, and Sanders - Bernie Sanders has just walked into the convention hall. He's stepping up to the front of the Vermont delegation. And he just greeted the Governor Shumlin from Vermont. So he's getting in position as we work through the last few states here. I mentioned the W's. Of course we still have Virginia, which is giving its vote total right now - Virginia an important swing state in this election.\nCORNISH: And Vermont delegation - how excited do they look right now?\nHORSLEY: They're pretty excited. Although I have to say I'm not sure that everyone in the hall had eyes on Bernie Sanders. They did not...\nCORNISH: I feel like there would've been some reaction (inaudible).\nHORSLEY: They did not put his face up on the big jumbotron. So if you had a vantage point of the aisle, you could see him coming down. But he's now taken a seat, and he's - as I say, he's surrounded by a scrum of reporters, so I don't think a lot of the delegates are even aware that he's here. They will be when it comes back around to Vermont, which passed a moment ago. And presumably he'll be at the microphone making an announcement.\nCORNISH: And there have been lots of sort of Sanders proxies on the stage - right? - Scott, throughout the night tonight.\nHORSLEY: Absolutely. We - of course the nomination for Bernie Sanders was made by Hawaii Congresswoman Tulsi Gabbard. And then that nomination was seconded by a representative of the Electrical Workers Union. And they spoke about Sanders and the inspiration that he offered. And many of the state representatives, as they've been giving their vote totals, have talked about Bernie Sanders as the candidate who inspired us or the father of a new revolution.\nCORNISH: Also interesting because Gabbard was someone who mixed it up a lot with Debbie Wasserman Schultz. So to see her kind of return to the stage - to be at center stage was some obvious symbolism there.\nHORSLEY: A stage that (laughter) has been free of Debbie Wasserman Schultz. She was jettisoned on the eve of this convention.\nCORNISH: Mara, remind us of the context here, comparing it to, say, Hillary Clinton and Barack Obama.\nLIASSON: Well, the difference is that Hillary Clinton came in very, very close behind Barack Obama. Not many delegates separated her from Obama, but in this case, Bernie Sanders has about a - almost 1,900-and-something fewer delegates than Hillary Clinton and 3.7 million fewer votes.\nThat said, The Sanders forces have not wanted to concede. They are 46 percent of the delegates here. And Bernie Sanders continued to suggest, and the Sanders delegates believe that something could happen here that would switch the result, that maybe the superdelegates would all switch to him. Or somehow there could be a contested convention. That never was in the cards. And it's been a very hard, long, frustrating, difficult, emotional process for many of the Sanders delegates to accept that he's not going to be the nominee.\nNow, last time that unification process happened quicker and more seamlessly because Hillary Clinton herself made it happen. She made it clear to her supporters who some polls suggest were even much less inclined to vote to go with the nominee than Sanders supporters are today, but she made it clear that everyone should come together. Bernie Sanders has been trying, but he's had limited effect on his supporters.\nCORNISH: Scott Horsley, as you're around the floor, are they passing out some new set of signs, do you get any sense that they're gearing up for a big moment?\nHORSLEY: Well, what I can say is that many, many of the delegates are on their feet. Many of them are holding signs. I don't - they are still passing out signs - Hillary Clinton signs with the H and the arrow. It looks like those are being passed out throughout the arena here. And a lot of eyes are now focused on the Vermont delegation even as Wisconsin is announcing its vote totals. But folks are turning toward the Vermont delegation for what they expect will be a very important statement from Senator Sanders.\nCORNISH: And we mentioned Sanders is here. Do we know where Hillary Clinton herself is? I mean, how - what's this process traditionally?\nLIASSON: She's in Chappaqua.\nHORSLEY: She's watching this from her home in Chappaqua, N.Y. Of course her husband, Bill Clinton, is the headliner this evening. He'll be speaking a little bit later in prime time. And it's possible that we will see Hillary Clinton from - remotely just as we saw Donald Trump remotely during the Republican convention last week. But she was on the campaign trail yesterday. She's spending the night at her home in Chappaqua, N.Y., and then she'll be of course here formally accepting this nomination with her own speech on Thursday.\nCORNISH: Just to update people on where we are in this process, Wyoming is now speaking about its 18 delegates. We're waiting for the moment when the party officially declares - officially nominates Hillary Clinton for president. We'll no longer be saying presumptive nominee. And we are waiting for that roll call vote to finish. I was hoping to get a preview tonight, Mara, about some of those other speeches.\nLIASSON: Well, we're going to hear from Bill Clinton. He's the keynoter tonight. He's always given very effective speeches at Democratic conventions. He turned the tide for himself in 1992 with a very powerful speech. In 2012 he gave a speech laying out the argument for Barack Obama's re-election that many people thought he made a better argument than Obama had even made for himself. But tonight he has a tricky task because he has to talk about his own spouse.\nAnd we assume he will testify to her character and grit. We also expect he'll talk what she's like as a wife and mother. And the theme of tonight is, the fight of her life. And they have been divided out into several sections - kids and family, social justice, women, first responders, health care and foreign policy. That's a laundry list, not unlike Hillary Clinton's - oh, here we go - Vermont.\nCORNISH: Yes, we're at Vermont with its 26 delegates. Let's hear it.\nUNIDENTIFIED WOMAN #2: Senator Bernie Sanders...\nCORNISH: This is the roll call vote at the Democratic National Convention.\nUNIDENTIFIED WOMAN #2: (Unintelligible).\nCORNISH: Bernie Sanders - his face is (inaudible) for the crowd.\nUNIDENTIFIED WOMAN #2: ...Howard Dean, Peter Welch and our own Senator Leahy speak out against the modern-day McCarthy, Donald Trump. On behalf of the home state of Senator Bernie Sanders, who has changed the trajectory of this country in a way that will make the lives of working Americans better for generations to come...\n(CHEERING)\nCORNISH: Hear the excitement in the crowd - Bernie Sanders smiling, not standing, as the party prepares to officially nominate Hillary Clinton.\nUNIDENTIFIED WOMAN #2: Vermont casts our votes - 22 votes for our beloved Senator Sanders and for the next president Hillary Clinton, it is now my honor to present our Senator Bernie Sanders.\nCORNISH: (Inaudible) Bernie Sanders (inaudible) set to address the crowd. Again, we're listening to the roll call vote at the Democratic National Convention. You're listening to NPR.\n(CHEERING)\nUNIDENTIFIED CROWD: (Chanting) Bernie...\nCORNISH: Some chants of Bernie, Bernie in the crowd - plenty of those blue Bernie signs still in abundance.\nBERNIE SANDERS: Thank you. I move that the convention suspend the procedural rules. I move that all votes cast be delegates be reflected in the official record, and I move that Hillary Clinton be selected as the nominee for the Democratic Party for president of the United States.\nCORNISH: And Mara Liasson, we're hearing a roar in the crowd. Scott Horsley's down on the floor. We hope to hear from him. Again, he's (inaudible).\nLIASSON: This is the moment that the Clinton and Sanders camp had choreographed - Bernie Sanders moving to make Hillary Clinton the nominee. Last night when he took the stage, he got a four-minute standing ovation, and we don't know how long this demonstration will go on. But this is a huge show of support for Bernie Sanders. And I think Bernie Sanders has done - now he's walking out of the hall. It looks like...\nCORNISH: It looks like he's leaving.\nLIASSON: He's leaving.\nCORNISH: Scott Horsley, can you verify for us?\nHORSLEY: Bernie Sanders is walking back up the aisle away from the Vermont delegation. And the arena itself is a sea of Hillary Clinton signs.\nCORNISH: On the podium right now - Marcia Fudge. And so this is the part of the roll call process with Bernie Sanders making this motion where essentially the party can say, yes, we agree; this is our nominee - can barely hear over the (inaudible) here.\n(CHEERING)\nMARCIA FUDGE: ...In favor of the motion, say aye...\nCROWD: Aye.\nFUDGE: ...Oppose, no.\nCROWD: No.\nFUDGE: The ayes have it.\nCORNISH: All right. The ayes have it.\nLIASSON: There you go. And we've got some televised fireworks.\nCORNISH: Yeah, that's indoor (laughter) televised fireworks.\nLIASSON: That's it. Hillary Clinton is now the nominee of the Democratic Party and the first woman to...\nCORNISH: The first woman to...\nLIASSON: ...To be the nominee of a major American political party.\nHORSLEY: That hardest, highest glass ceiling she spoke about eight years ago with the 18 million cracks has now been shattered.\nLIASSON: And she only has one more glass ceiling to go. This was the penultimate one.\nCORNISH: But Mara, talk about how the party did try and lean hard on that message tonight to say, hey, this is a historic moment; try and enjoy it.\nLIASSON: I think they're being very careful. There are so many balancing acts that the Clinton campaign has to perform. One is not to be too heavy handed on the first woman thing. We saw how it backfired her - for her in New Hampshire where young women just were not that crazy about being lectured to by first-generation feminists who said they should vote for a woman.\nThey also have to balance how much are they going to talk up Hillary Clinton and talk down Donald Trump. That's a big balancing act. She has some pretty high negatives, and they'd like to turn those around to a certain extent. She's now seen as dishonest and untrustworthy by higher numbers of Americans than Donald Trump is. So they've got a lot of balancing acts.\nThey also have to figure out how are they going to deal with Barack Obama's legacy. You heard Michelle Obama talk about how great America was, then you heard Bernie Sanders and Elizabeth Warren last night talk about how the economy was terrible. So they've got a lot of balancing acts. The first woman president is just one of them.\nCORNISH: And Scott Horsley, can you talk about trying to project an image of unity in our last minute here?\nHORSLEY: I'm sorry. I lost you there for just a moment.\nHORSLEY: Oh, the Democrats trying to project some unity - are they getting there?\nHORSLEY: They are definitely getting there. And if you compare what we're seeing tonight to what we saw in the early hours of this convention last night and every time Hillary Clinton's name was mentioned, you'd hear a chorus of boos from the most hard-core Bernie Sanders supporters. And now you have members of the Vermont delegation who refer to Bernie Sanders as their beloved senator - they are waving the blue and green and purple Hillary Clinton signs.\nCORNISH: Well, Scott, thanks so much. Mara Liasson, thanks so much. You're listening to live coverage at the Democratic National Convention in Philadelphia. Democrats have officially named Hillary Clinton as their nominee for President. I'm Audie Cornish at the DNC in Philadelphia, and this is NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/07/26/487551886/hillary-clinton-makes-history-as-she-secures-presidential-nomination"}
