{"authors":["John Hayward"],"date_download":"2018-10-30 18:22:07","date_modify":"2018-10-30 18:22:07","date_publish":"2016-08-03 18:59:55","description":"Back in the 90s, during the Age of Lewinsky, many chin-stroking editorials were written about the death of shame and outrage. Defenders of Bill Clinton argued that society was somehow “evolving” past the point where stodgy old Bible-thumping moralists could project their values onto others by shaming them into compliance. Clinton’s bold rejection of conventional morality was presented as a watershed moment in America’s progress toward a supposedly shameless European ideal. | Politics","filename":"data/vaneerConsumption/HillaryClintonsCampaignIsaCryingShame.json","image_url":"https://media.breitbart.com/media/2016/05/Hillary-Mocks-Trump-Seth-Wenig-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_03__1540923727.html","title":"Hillary Clinton’s Campaign Is a Crying Shame","title_page":"Hillary Clinton’s Campaign Is a Crying Shame | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Back in the 90s, during the Age of Lewinsky, many chin-stroking editorials were written about the death of shame and outrage. Defenders of Bill Clinton argued that society was somehow “evolving” past the point where stodgy old Bible-thumping moralists could project their values onto others by shaming them into compliance. Clinton’s bold rejection of conventional morality was presented as a watershed moment in America’s progress toward a supposedly shameless European ideal.\nLeave it to Bill’s wife, Hillary, to bring shame back with a vengeance, by running a presidential campaign almost entirely fueled by stigma.\nAll this crowing about “shattering the glass ceiling,” for example, is meant as a slam at The Patriarchy. Every man in earshot is supposed to feel guilty about entertaining the thought of voting against The First Woman President. Way to keep women down and prop up the patriarchy, you male chauvinist pigs!\nIn reality, can anyone doubt that Hillary Clinton’s sex is a tremendous political asset? She’s not “overcoming” anything. She profits from her biology almost as much as she profits from being married to Bill. We are instructed to pretend she’s slaying the dragon of sexism by the same people who would currently be making savage sexist remarks about Carly Fiorina, had she won the Republican nomination.\nPolitical correctness is weaponized shame and politicized stigma. It portrays political rivals as dangerous and sinister outsiders that should be ignored, exiled, laughed at, sneered at, and shouted down, whatever the accuracy of their data, the coherence of their logic or the justice of their political preferences. Conservatives are primary targets — but so are the many nice, non-ideological Americans who won’t dare question Democratic Authority if they fear a nasty backlash from their liberal neighbors and co-workers.\nIt’s easier to control people if you can make them afraid to speak … and perhaps force them to accept, even a little, the notion that they have no right to speak. It’s easier to take their property when you can make them ashamed of owning it, as though their earnings were actually loot from a robbery.\nOf course, the rest of Clinton’s shame fuel is low-octane compared to what she’s pumping out of the Khan family. They’re a virtue-signaling flare gun for those eager to assert moral superiority over the security-minded.\nThe idea behind the Khans’ appearance at the Democratic National Convention was that Trump had no right to respond to them at all; he was supposed to hang his head in quiet shame while a Constitution that says absolutely nothing about his immigration proposals was waved in his face.\nThe Constitution itself has no value to liberals beyond its use as a scourge of shame against Republicans. When a power-hungry Democrat like Barack Obama rips the Constitution to shreds, liberals applaud him as a super-hero. When they want to browbeat a Republican, they pretend whatever they don’t like is forbidden by some invisible clause in a document none of them read for any purpose except figuring out how to subvert it. The point is that Democrats know Republicans are supposed to care about the Constitution, so it has power as a voodoo charm against them.\nShame has been a potent weapon in the hands of open-borders enthusiasts for decades. Rational discussion of immigration is impossible when people are taught that even discussing border security is tantamount to xenophobia. Whatever one thinks of Trump’s proposal for a temporary ban on Muslim immigration, understand that measures far less sweeping are also portrayed as shameful outbursts of nativism. Even the very notion of building an effective barrier on the southern border is supposed to be shameful, as if borders only retain a tiny shred of moral legitimacy when they are easily violated.\nDemocrats also know Republican voters really do care about the troops. That’s why Barack Obama, who spent a month dithering his way through political calculations after he learned veterans were languishing on secret VA death lists, and completely lost interest in the subject as soon as his poll numbers stabilized, suddenly reinvented himself as the best friend the American fighting man ever had. His sincerity is irrelevant; he knows Republican voters are sincere, and can therefore be shamed.\nTrump would have been better advised to focus his response precisely on what Khizr Khan said from the DNC stage, but as is his custom, he instantly made things personal. He could have been forceful, and even brash in the face of political correctness, without slipping in shots like his speculation that Mrs. Khan “wasn’t allowed to have anything to say.” Shame is a visceral response, and it’s important for a politician fighting his way out of a tight spot to avoid giving more people visceral reasons to dislike him.\nTrump was on his strongest ground in pointing out that the Khans chose to become political actors, and refusing to accept that he wasn’t allowed to respond to them at all. The nature of that response, however, was very important.\nClinton and her supporters, meanwhile, reject demands that she should feel any shame for calling the Benghazi families liars (or, in her most recent cringe-inducing comments on the matter, implying they are delusional.) The ludicrous defense that she gets a total pass because she didn’t use the word “liar,” instead making ritual noises of appreciation for the families’ losses before implying that they are lying about her post-Benghazi talk of video protests gone wrong, is a cynical effort to deflect shame.\nIn fact, the shame of Benghazi has somehow been judo-flipped onto the grieving families, who the media is not shy about denouncing as cretins on Clinton’s behalf. As Jim Geraghty at National Review points out:\nHey, remember when the first night of the Republican convention featured Patricia Smith, mother of Sean Smith who was slain in Benghazi? Remember how her speech was called a “cynical exploitation of grief”? Or the “unabashed exploitation of private people’s grief” or “the weaponization of grief”? Remember how she “ruined the evening“? How it was “a spectacle so offensive, it was hard to even comprehend”? How some liberal commentators said, “Mrs. Smith was really most interested in drinking blood rather than healing”? How her speech represented an “early dip into the gutter“? Remember how a GQ writer publicly expressed a desire to beat her to death?\nWith the DNC Media providing a hit squad like that, it’s not hard for Democrat politicians to keep their hands relatively clean.\nThe most grimly amusing criticism leveled at Trump is that he should have taken his beating in dignified silence, the way President George W. Bush did when confronted by the previous holder of the Left’s Absolute Moral Authority card, grieving war mother Cindy Sheehan. It’s amusing because many of the people currently holding up Dubya as the model of genteel statesmanship spent the Aughts calling him a fascist warmongering lunatic cowboy, Chimpy McHitlerburton, the mercenary pirate who raided Iraq to pillage its oil.\nBush critics didn’t give him any credit for weathering Sheehan’s tirades in silence – they took his silence as further evidence of his guilt and shame. In the extremely unlikely event Donald Trump had chosen not to respond to the Khans, the DNC Media line would be “Chastised Trump Unable to Respond After Stunning Denunciation By Gold Star Family.”\nOf course, it was easy for Democrats to predict that Trump would hit back, and give them more material to work with. They also had a much keener sense of the Republican Party’s general vulnerability to shame weapons. Trump was left calling for Party support that Democrats knew would never come, while the DNC Media flooded the zone with stories about Republicans wailing in despair, writing off the 2016 election as a lost cause, hoping that Trump will throw in the towel, and checking the RNC rules for taking the towel away from him.\nLet’s face it: the Democrats and their media are sharp political operators, and they knew a sizable number of Republicans – elected officials, opinion elites, and voters – have been looking for a way to bail out of the election. Mediaspace is currently bubbling with grave warnings that Republicans need to pull the rip cord soon, if they want to bail out of the flaming Trump wreckage – September will be too late! Act now, before the narrative has a chance to change! It’s hard to escape the suspicion that some GOP officials spent last weekend writing their Trump denunciations, to have them ready in case the media came calling bright and early on Monday morning.\nThe point of Barack Obama bizarrely delivering a homily to Constitutional limited government at the Democratic convention was to pack those Republican parachutes. Democrats are unparalleled masters at voter suppression. They knew the key to pushing an unpopular Hillary Clinton into the wreckage of Barack Obama’s Oval Office was to make it easier for Republican voters to stay home. They don’t have to trick limited-government Constitutionalists into voting for Clinton – they just have to make it more comfortable for them to stay in their easy chairs on Election Day. A whisper of “maybe she won’t be that bad” floating in Republican skulls might do the trick.\nShame is a force Democrats often deploy for voter suppression. One of the reasons Trump rose in the Republican primary was that a large contingent of voters were sick and tired of being shamed out of demanding a fair shake. They’ve been told they have no right to object when their pockets are picked by the welfare state, their jobs are sacrificed to global initiatives, and citizenship itself is rendered meaningless by insane immigration policies. Shame is what keeps them from fighting for their issues with passion, or finding leaders who will do so.\nThe loathing for the GOP Establishment that propelled Trump was pushback for decades of Republican poobahs treating their own base voters like they were something to be ashamed of. Trump rejected that mindset, more clearly, forcefully, and consistently than his competitors. Some of the others got the idea that base voters were angry at Republican elites, but Trump always seemed to have a better grip on why.\n20 years after Democrats ripped America’s shame circuitry out, to keep Bill Clinton in office, we’re more ashamed as a nation than ever. How much of our current discourse, everywhere from social media to college campuses, boils down to telling some people they should hang their heads in shame and shut up, because of social-justice “crimes” they didn’t commit? We don’t have debates any more, we have coronations, in which the left-winger on any given issue is placed on a pedestal and presented as unassailable authority.\nTrump is correct that conservatives need to stop playing that game, because the pedestal-making industry is a wholly owned subsidiary of the Democrat Party. It’s also a formidable industry that should not be underestimated.","url":"https://www.breitbart.com/politics/2016/08/03/hillary-clintons-campaign-crying-shame/"}
