{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:31:39","date_modify":"2018-10-30 21:31:39","date_publish":"2016-02-24 05:20:57","description":"Democratic presidential frontrunner Hillary Clinton visited the cast and crew of ABC’s political thriller Scandal while fundraising in Los Angeles on Monday.","filename":"data/vaneerConsumption/HillaryClintonVisitsSetofABCsPoliticalThrillerScandal.json","image_url":"https://media.breitbart.com/media/2016/02/kerry-washington-hillary-clinton-instagram.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_02_23__1540935099.html","title":"Hillary Clinton Visits Set of ABC's Political Thriller 'Scandal'","title_page":"Hillary Clinton Visits Set of ABC's Political Thriller 'Scandal' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic presidential frontrunner Hillary Clinton visited the cast and crew of ABC’s political thriller Scandal while fundraising in Los Angeles on Monday.\nAs The Daily Mail notes, Scandal is show centered on dirty politics in Washington and features a president who has an affair with a staffer and a first lady who decides to run for president.\nActress Kerry Washington, who plays Olivia Pope on the show, shared an image of Clinton mingling on set.\nA good friend came by set today. Proud to say… #imwithher A photo posted by Kerry Washington (@kerrywashington) on Feb 22, 2016 at 10:11pm PST\n“A good friend came by set today. Proud to say… #imwithher,” she wrote.\nThe actress also shared another photo she had taken with the former First Lady on Instagram. Washington simply captioned the image, “#imwithher.”\n#imwithher A photo posted by Kerry Washington (@kerrywashington) on Feb 22, 2016 at 10:27pm PST\nScandal co-star Tony Goldwyn, who plays U.S. President Fitzgerald Grant, was then photographed cutting up with Clinton and cast member Scott Foley.\nSo, this happened while I was directing tonight. No big deal. #imwithher A photo posted by Scott Foley (@scottkfoley) on Feb 22, 2016 at 8:40pm PST\nGoldwyn, who is a Clinton supporter, later thanked Clinton for visiting the set of the show.\nThe actor urged Democratic voters to support Clinton in Nevada ahead of last Saturday’s caucus.\nVariety reports Clinton will not take part in the show and was just on set for a visit. In December, she visited the set of Comedy Central’s Broad City and is expected to appear on an episode this season.\nMonday was Clinton’s seventh fundraising visit to Southern California since she announced her candidacy.","url":"https://www.breitbart.com/entertainment/2016/02/23/hillary-visits-set-abcs-political-thriller-scandal/"}
