{"authors":[],"date_download":"2018-10-30 00:56:11","date_modify":"2018-10-30 00:56:11","date_publish":"2016-10-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HillarysdisruptiveplanstofixObamacare.json","image_url":"https://www.americanthinker.com/images/bucket/2016-10/197384.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_10_hillarys_disruptive_plans_to_fix_obamacare_1540860971.html","title":"Hillary’s disruptive plans to ‘fix’ Obamacare","title_page":"Hillary’s disruptive plans to ‘fix’ Obamacare","title_rss":"NULL","source_domain":"americanthinker.com","text":"It remains to be seen if it is a game-changer, but the recently announced double- and triple-digit increases in Obamacare premiums, increases averaging 25%, which already had deductibles for many so high they might as well not have insurance, is a reminder to voters of what is at stake on November 8. In key battleground states, the announced premium increases are significant:\nIn other states, it is far worse. Trump has been quick to seize on this key and neglected issue that has taken a backseat to a media obsession on Donald Trump talking dirty in an Access Hollywood trailer and alleged incidents of groping women. It is an issue that may give the Democrats a November surprise:\nNewly announced double-digit premium hikes for those on the ObamaCare exchanges are handing Donald Trump a political weapon in key swing states where residents could be facing rate increases even higher than the national average. The administration announced Monday that premiums for a midlevel plan are set to rise an average of 25 percent in 2017 in the 39 states that use the federal HealthCare.gov. The rate hikes vary widely across different cities and states, but several battlegrounds could be facing increases that are considerably higher. According to administration figures, the average premium increase for a popular “silver” plan will rise 116 percent in Arizona; 40 percent in North Carolina; and 53 percent in Pennsylvania.\nThe premium hikes are a reminder of Hillary Clinton’s embrace of and doubling down on an imploding Obamacare, and her reminding us that HillaryCare, her 1993 proposed health care law developed in great secrecy, was its predecessor and inspiration. Trump has been quick to note Obama’s health care Titanic has hit the iceberg and is not going to reach New York.\nA doctor in the critical state of Arizona has told Townhall.com of the devastating effect of Obamacare’s incoming implosion, an effect that will be felt both economically and politically:\nIn a press call with the Independent Women's Voice on Wednesday, Dr. Eric Novack, an orthopedic surgeon in Arizona, offered a bleak review of the Affordable Care Act's impact on his state - particularly the newly announced premium hikes. \"Patients being decimated by increases,\" he said. Arizona has been hit especially hard by Obamacare's price tag. While the average 2017 premium hike will be 25 percent, for Arizona it is in the 50-75 percent range. In some markets, it is 100 percent. As a result, Arizonans are having to make \"huge life decisions\" based on whether they can afford both their rent and their high deductibles, Novack explained. Instead of saving and spending money for their children, parents now have to worry about spending that money on premiums. The price hike has an \"enormous ripple effect,\" he said. Novack then excoriated the Obama administration for continuing to make lofty promises they know to be untrue.\nIndeed, President Obama was awarded Politifact’s “Lie of the Year” for his promise that if you like your insurance plan and doctor, you can keep them. Hillary Clinton has doubled down on Obamacare, promising to keep it and fix it, saying in essence that if you like your Obamacare, you can keep your Obamacare. In fact, she even took credit for it in a primary debate with her outright Socialist rival, Sen. Bernie Sanders of Vermont:\nDemocratic presidential front-runner Hillary Clinton is out with a new defense of her healthcare record — rival Bernie Sanders may have helped write ObamaCare, but it was her idea first. \"It was called HillaryCare before it was called ObamaCare,” Clinton told a crowd of supporters at a country club in Vinton, Iowa. “I don't want to start over.\"\nMIT economist and Obamacare strategist Jonathan Gruber, who thought Obamacare would escape the scrutiny of a “stupid” electorate, had some interesting thoughts on HillaryCare, as reported in the Daily Caller:\nThe architect of Obamacare believed Hillary Clinton’s failed 1993 health care reform bill, known as “Hillarycare,” was “to the left of Obamacare” and would have been much more “disruptive.” MIT economist Jonathan Gruber, a Ted Kennedy-linked health care economist who became the key writer of the Democrats’ health care reform law when President Obama took office, had dim views on Hillarycare, records reveal…. She had a plan which was much more interventionist. The Clinton, that’s the irony of Bill Clinton criticizing Obama for taking away people’s health insurance. The Clinton health care plan was much to the left of Obamacare. It would have more radically changed our health care system. Obamacare is really, it’s a big intervention, but it is much to the right of anything that’s been tried before,” Gruber continued. “The original Hillarycare as proposed in the early 90s would, absolutely, would have been much more disruptive,” Gruber added.\nHillary won’t repeal and replace Obamacare with things like health savings accounts and competition across state lines, as Trump has pledged. Instead, she will transform Obamacare into HillaryCare 2.0, the first version of which decimated the Democrats in 1994 and gave control of the House to the GOP for the first time in 40 years. If she pursues this disastrous course, history may repeat itself, with Donald Trump swept into the White House.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine, and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/blog/2016/10/hillarys_disruptive_plans_to_fix_obamacare.html"}
