{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:28:31","date_modify":"2018-10-30 21:28:31","date_publish":"2015-11-05 18:44:27","description":"Hollywood has rolled out the red carpet for Democratic presidential candidate Hillary Clinton once again.","filename":"data/vaneerConsumption/HillaryClintonStuffsWarChestwithCaliforniaCash.json","image_url":"https://media.breitbart.com/media/2015/11/Christina-Aguilera-and-Hillary-Clinton-Paul-J.-Richards-AFP-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_05__1540934911.html","title":"Hillary Clinton Stuffs War Chest with California Cash","title_page":"Hillary Clinton Stuffs War Chest with California Cash | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hollywood has rolled out the red carpet for Democratic presidential candidate Hillary Clinton once again as she makes her fifth fundraising stint to the Golden State since officially declaring her candidacy this past spring.\nClinton is, so far, leading all presidential candidates in fundraising throughout California, with $13.3 million in contributions this year alone, as of the most recent reports..\nBefore heading down to Tinseltown, Clinton made a rare stop in Sacramento at the home of developer Angelo Tsakopoulos for a $2,700-per-person lunch fundraiser being hosted by his daughter Eleni Kounalakis, a former U.S. Ambassador to Hungary. According to the Sacramento Bee, the former Secretary of State then headed over to Silicon Valley for a fundraiser hosted by YouTube CEO Susan Wojcicki.\nOn Wednesday, pop diva Christina Aguilera and her producer fiancé, Matthew Rutler, reportedly hosted Clinton’s first L.A. fundraiser–which was described as a concert–at their Beverly Hills home where Aguilera reportedly performed with American music duo A Great Big World, best known for their Grammy-winning hit “Say Something.”\nAccording to TheWrap, the fundraiser raised $1 million for Clinton’s campaign. The hosts were reportedly asked to raise $10,000 for just four tickets and the event was completely sold out, with well over 400 people in attendance. Actress Katie Holmes and Muse frontman Matt Bellamy were also there. Deadline.com notes that past Clinton contributors Michael Kives and Darnell Strom of CAA were among the official hosts of the fundraiser.\nOn Thursday, Clinton was hosted for a sold out Conservation With Hillary breakfast at the Brentwood home of actor, director and producer Rob and his wife Michele Reiner, where tickets ranged between $500-$27,000 for a VIP reception with the presidential hopeful.\nAfter that, Clinton will head to the Hancock Park home of NBCUniversal executive Joe Watz and Cynthia Telles between noon and 2 p.m. for a fundraiser that will reportedly range from $1,000 for “friends” to $2,700 for “champions,” $27,000 for “co-hosts,” and $50,000 for the hosts of the event themselves.\nThe former secretary of state will also be taping an episode of Jimmy Kimmel Live! on Thursday afternoon that will be set for broadcast that same evening.\nClinton will wrap up her visit by attending a Friday fundraising bash being hosted by Kate Hudson and Zach Braff at the home of CAA’s Michael Kives. Saturday Night Live writer Michael O’Brien, and former White House speechwriter Jon Lovett are reportedly expected to be in attendance. TheWrap notes that tickets for the event will range between $250 to $1,000.\nClinton will likely be back in California again before Christmas.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/politics/2015/11/05/hillary-clinton-stuffs-war-chest-california-cash/"}
