{"authors":["Associated Press"],"date_download":"2018-10-22 23:51:55","date_modify":"2018-10-22 23:51:55","date_publish":"2016-01-29 12:21:03","description":"MELBOURNE, Australia (AP) — Martina Hingis and Sania Mirza have continued what Hingis calls their \"fairytale\" run as a doubles combination. Hingis and Mirza ...","filename":"data/vaneerConsumption/HingisMirzawinAustralianOpendoublestitle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:651b593d9744490ab69a382b25b5ea6a-3bmscybNe842cce83474b554291f-501_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422337_Hingis-Mirza-win-Australian-Open-doubles-title_1540252315.html","title":"Hingis, Mirza win Australian Open doubles title","title_page":"Hingis, Mirza win Australian Open doubles title | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hingis, Mirza win Australian Open doubles title\nMELBOURNE, Australia (AP) — Martina Hingis and Sania Mirza have continued what Hingis calls their \"fairytale\" run as a doubles combination.\nHingis and Mirza maintained their perfect record in Grand Slam doubles finals, beating the Czech pair of Andrea Hlavackova and Lucie Hradecka 7-6 (1), 6-3 at the Australian Open on Friday to extend their winning streak to 36 matches on the way to a third major title.\nHingis, a three-time singles champion at Melbourne Park, and Mirza dominated the first-set tiebreaker preceded by eight service breaks, four by each team.\nMartina Hingis, left, of Switzerland and Sania Mirza of India kiss their trophy after defeating Czech Republic¿s Andrea Hlavackova and Lucie Hradecka in the women's doubles final at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016. (AP Photo/Aaron Favila)\nThe winners added to their Wimbledon and U.S. Open titles last year and the pair also won at Brisbane and Sydney this month. They started playing together at Indian Wells in March of last year.\nHingis is now a four-time doubles champion at the Australian Open.\nMirza, who won the 2009 Australian mixed doubles title with fellow Indian player Mahesh Bhupathi, couldn't extend her run in mixed doubles this year, losing with her partner Ivan Dodig of Croatia 7-5, 7-6 (4) to Elena Vesnina and Bruno Soares. Vesnina and Soares will play American Coco Vandeweghe and Horia Tecau of Romania in Sunday's final.\nHlavackova and Hradecka are now 2-3 in Grand Slam doubles finals. They won major doubles titles at the 2011 French Open and 2013 U.S. Open.\nHingis's singles titles came in 1997, 1998 and 1999 when the tournament had only one stadium with a roof — Rod Laver Arena, where the doubles final was played Friday. It now has three.\n\"I feel like sometimes we struggle through the heat here in Australia, (but) we struggled through the rain,\" Hingis said at the trophy presentations under a closed roof because of day-long inclement weather \"But since I played that (singles) final you made three covered courts.\"\n\"Thank you to my partner, we've had an incredible year, we just keep going and going,\" Mirza said. \"She's an amazing champion, but I've gotten to know her as a person and it's a privilege to play with her.\"\nHingis appeared at a later media conference without Mirza, who was playing the mixed semifinal.\n\"I feel lonely without my partner,\" she said, smiling. \"Our fairytale continues. It's amazing since winning Wimbledon. After that we only lost two more matches. It keeps going.\"\nHingis said their decision to play only doubles helps.\n\"We're really focused, that's our strength, that we can practice together and we make each other better, even from the start when we played our first tournament in Indian Wells and Miami,\" Hingis said.\n\"There's not that many people who can match her in the forehand rallies and me on the backhand side and at the net. That's what we try to do every match.\"\nHer doubles successes haven't convinced her to make a return to singles, which she hasn't played in nearly 10 years. She came out of retirement to play doubles in 2013.\n\"I've had this question for the last year,\" the 35-year-old Hingis said. \"I always said no.\"\nMartina Hingis, left, of Switzerland and Sania Mirza of India celebrate after defeating Czech Republic¿s Andrea Hlavackova and Lucie Hradecka in the women's doubles final at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Aaron Favila)\nCzech Republic¿s Andrea Hlavackova, right, and Lucie Hradecka celebrate a point win over Martina Hingis of Switzerland and Sania Mirza of India during the women's doubles final at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rick Rycroft)","url":"https://www.dailymail.co.uk/wires/ap/article-3422337/Hingis-Mirza-win-Australian-Open-doubles-title.html"}
