{"authors":[],"date_download":"2018-10-22 22:10:14","date_modify":"2018-10-22 22:10:14","date_publish":"2016-01-29 08:51:29","description":"Martina Hingis and Sania Mirza added the Australian Open title Friday to their 2015 US Open and Wimbledon crowns as the rampantly successful pair maintained ...","filename":"data/vaneerConsumption/HingisMirzamakeitthreeGrandSlamtitlesinarow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h828-4PuZeKVXE7cd9005b2c87674c91a-698_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422351_Hingis-Mirza-make-three-Grand-Slam-titles-row_1540246214.html","title":"Hingis, Mirza make it three Grand Slam titles in a row","title_page":"Hingis, Mirza make it three Grand Slam titles in a row | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hingis, Mirza make it three Grand Slam titles in a row\nMartina Hingis and Sania Mirza added the Australian Open title Friday to their 2015 US Open and Wimbledon crowns as the rampantly successful pair maintained their dominance of women's doubles.\nThe Swiss veteran, 35, and her Indian partner, 29, were pushed hard by Czech duo Andrea Hlavackova and Lucie Hradecka but came through the battle 7-6 (7/1), 6-3 on Rod Laver Arena.\nIt stretched the top seeds' win streak to 36 matches, the third best in WTA history and the longest unbeaten run since Jana Novotna and Helen Sukova reached 44 in 1990.\nSwitzerland's Martina Hingis (L) and India's Sania Mirza celebrate with the trophy after their Australian Open women's doubles final victory against Czech Republic's Lucie Hradecka and Andrea Hlavackova, in Melbourne, on January 29, 2016 ©Peter Parks (AFP)\nThe longest win streak ever belongs to Martina Navratilova and Pam Shriver, who won an unprecedented 109 straight matches over a two-year period from 1983-1985.\n\"Thanks Sania, without you I wouldn't be here today,\" said Hingis. \"We've struggled through heat and rain this year and it's been a tough tournament.\"\nMirza added: \"We've had an incredible year and we just want to keep going. Martina is an amazing champion and it's a privilege for me to play with her.\"\nAfter a roller coaster opening set where breaks were traded, the top seeds were taken to a tiebreak but quickly got the upper hand and comfortably came out on top 7-1.\nThey got an early break in the second set and the seventh-seeded Hlavackova and Hradecka, playing together since 2008, never looked like getting back in it.\nThere was a chink of light when the Czech pair broke Hingis at 2-5 as she was serving for the championship, but they were then broken themselves as the accolades went to their opponents.\nHingis and Mirza have been hugely successful since teaming up last March at Indian Wells, and the now world number ones went on to reach 10 finals last season.\nThey opened their 2016 campaign by winning titles in Brisbane and Sydney, and now Melbourne.\nIt was the 12th career Grand Slam doubles title for Hingis, who has now won five Australian Opens (1997, 1998, 1999, 2002, 2016), two French Opens (1998, 2000), three at Wimbledon (1996, 1998, 2015) and two on the New York hardcourts in 1998 and 2015.\nMirza, married to former Pakistan captain Shoaib Malik, has won three, all with Hingis.","url":"https://www.dailymail.co.uk/wires/afp/article-3422351/Hingis-Mirza-make-three-Grand-Slam-titles-row.html"}
