{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:21:06","date_modify":"2018-10-30 21:21:06","date_publish":"2015-06-19 17:11:39","description":"Truancy will no longer be a criminal offense in the state of Texas, as Governor Greg Abbott signs the historic House Bill 2398.","filename":"data/vaneerConsumption/HISTORICTexasGovernorSignsBillthatDecriminalizesTruancy.json","image_url":"https://media.breitbart.com/media/2015/03/DSC_0664-1024x678.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_06_19__1540934466.html","title":"HISTORIC: Texas Governor Signs Bill that Decriminalizes Truancy","title_page":"HISTORIC: Texas Governor Signs Bill that Decriminalizes Truancy","title_rss":"NULL","source_domain":"breitbart.com","text":"The Failure to Attend School (FTAS), also known as “truancy,” will no longer be a criminal offense in the state of Texas. Governor Greg Abbott signed the historic House Bill 2398 into law on June 18, enacting comprehensive truancy reform. The landmark legislation will go into effect on September 1, according to the Governor’s office.\nIn a statement, Governor Abbott told Breitbart Texas, “Criminalizing unauthorized absences at school unnecessarily jeopardizes the futures of our students. The process of elevating our state’s education system to be number one in the nation begins in the classroom, and I signed House Bill 2398 to ensure Texas educators have the tools necessary to prevent truancy, encourage classroom attendance and focus on educating our children to ultimately set our students on a pathway toward success.”\nUntil now, Texas has prosecuted K-12 children and their parents for FTAS at more than double the rate of all 49 other states combined. Last year, nearly 100,000 Class C Misdemeanors for truancy were doled out to Texas K-12 students and their parents. In 2013, there were 115,000 citations, according to Class, Not Court.\nUnlawful absenteeism affects youngsters from all walks of life, often leaving a criminal paper trail that jeopardizes their futures.\nUpon learning the news that Abbott signed HB 2398, Derek Cohen, policy analyst for the Texas Public Policy Foundation’s (TPPF) Center for Effective Justice, told Breitbart Texas by email, “It was great to see that Governor Abbott signed HB 2398 into law, thereby completing the school discipline reforms started back in the 83rd legislature.”\nTPPF is an Austin-based nonpartisan conservative research organization. They have been instrumental in this two-session push towards truancy reform.\nCohen added, “This piece of bipartisan legislation will keep children from direct referral to the criminal justice system for playing hooky, to say nothing of those who miss school for legitimate reasons.”\nHe also told Breitbart Texas, “The oversight of well-meaning judges preserved in this legislation the tougher cases will still be formally processed, and under 2398 both the schools and the judiciary are equipped with more tools to address this complex problem without resorting to criminal punishment.”\nThe decriminalization of truancy received widespread report from most, Breitbart Texas has reported, although some of the greatest pushback to this reform originally came from the public schools and the Justices of the Peace who prosecute these youngsters and their families, which Breitbart Texas reported as well.\nTruancy laws in Texas have received criticism for their role as a cash cow. The state banked just over $2 million in FY 2009, and nearly $1.8 million in FY 2011. Dallas raked in $3 million in 2013.\nBreitbart Texas reported that the US Department of Justice stepped in to investigate the practices of the Dallas County Truancy Court and Juvenile District Courts as a result of several advocacy groups filing a complaint two years ago.\nTexas Appleseed, a nonprofit public interest justice center which has been in the forefront of the effort to decriminalize truancy, was one of the complainants.\nCurrently, the Texas Education Agency (TEA) is investigating a new complaint lodged by Texas Appleseed and two other non-profit advocacy groups, alleging that 13 school districts use truancy courts to force special needs students out of the public school system.\nTexas Appleseed staff attorney Morgan Craven spoke to Breitbart Texas about Abbott signing HB 2398. She said by email, “The passage of 2398 is incredibly important for Texas families. Kids should be supported in schools, not punished with fines and jail time.”\nCraven continued, ‘We are excited to be part of the implementation process, and look forward to seeing schools provide meaningful interventions when students miss school, resulting in a significant decrease in the use of court interventions.”\nIn May, Breitbart Texas reported on a class-action lawsuit that was filed against the Fort Bend County Truancy Court, purporting that their FTAS practices were illegal under Texas law. Fort Bend has been criticized for having some of the harshest truancy policies in the state.\nBreitbart Texas has been following the truancy debate as part of the school-to-prison pipeline, a system which refers to those zero tolerance school policies that lead to students being put into contact with the criminal justice system.\nHB 2398 will replace existing criminal prosecution with civil punishments. It also requires schools to take common-sense steps to address students’ truancy problems before referring students to court. Under this bill, they would look at the underlying issues behind truancy — such as homelessness, chronic illness, or unidentified special education needs.\nWhen efforts to remediate a truancy situation fail, a school could still refer a student to court, but it would be to a civil rather than a criminal court. Justice and municipal courts would continue to hear these truancy cases and could order students to counseling or tutoring, but would not be allowed to fine them, nor would students leave court with a criminal record.\nMuch earlier on in the truancy debate, Texas Supreme Court Nathan Hecht posed a question to the Judicial Council, the policy-making body for the state’s courts. He asked, “Playing hooky is bad, but is it criminal?”\nWith Abbott’s signing of HB 2398, the state of Texas finally said, “No.”\nFollow Merrill Hope, a member of the original Breitbart Texas team, on Twitter@OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/06/19/historic-texas-governor-signs-bill-that-decriminalizes-truancy/"}
