{"authors":["Breitbart Texas"],"date_download":"2018-10-30 20:42:35","date_modify":"2018-10-30 20:42:35","date_publish":"2015-12-27 15:09:30","description":"Winter Storm Goliath is already being called an historic blizzard as it begins its march into West Texas. Residents are bracing for the storm which is already dumping massive snowfalls in New Mexico.","filename":"data/vaneerConsumption/HistoricBlizzardGoliathMarchesintoTexas.json","image_url":"https://media.breitbart.com/media/2015/12/Blizzard-AP-Michael-Schumacher.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_12_27__1540932155.html","title":"Historic Blizzard ‘Goliath’ Marches into Texas","title_page":"Historic Blizzard ‘Goliath’ Marches into Texas","title_rss":"NULL","source_domain":"breitbart.com","text":"UPDATE – Monday 6:00 a.m.: The winter storm Goliath continues to march across Texas leaving behind closed highways and roadways, massive snow drifts and scattered power outages. Up to 16 inches of snow have been reported from Midland, Texas, eastern New Mexico, and up to the Texas panhandle. Drifts of up to six feet have been reported in various locations across the region.\nMidland reported as much as 10 inches of snow and a season total of 20 inches so far. Lubbock reported 10.3 inches of snow making it the worst snowstorm for that city since January, 1983.\nRoad closures include sections of Interstates 10, 20 and 40 along with large numbers of state and U.S. highways. The Texas Department of Transportation keeps a database of current roadway conditions on its website.\nA mixture of rain and snow is now making its way into the Dallas-Fort Worth metroplex where it will likely cause traffic problems for Monday morning commuters coming back to work after the Christmas Holiday.\nOriginal story follows below:\nWinter Storm Goliath is already being called a historic blizzard as it begins its march into West Texas. Residents are bracing for the storm which is already dumping massive snowfalls in New Mexico.\nSnow drifts of up to eight feet are already being reported in Curry County, New Mexico, home of Cannon Air Force Base, located on the Texas/New Mexico border. Winds of 40-50 miles per hour are expected to wreak havoc on travelers and residents as nearly a foot and a half of snow will continue to build drifts and down power lines.\nThe blizzard conditions have already closed much of Interstate 40 from Amarillo to Albuquerque, The Weather Channel reported. Snow is falling from El Paso and the Big Bend region of the Texas/Mexico border all the way to the tip of the panhandle and as far east as Weatherford, Texas. The Sun Bowl turned into the “Snow Bowl” as white-out conditions made play very difficult for the Miami Hurricanes who lost to the Washington State Cougars. SB Nation reported the snowfall was so heavy that camera operators had a hard time tracking the football during a kickoff.\nEarly on Sunday, Fox34 reported heavy snow in Muleshoe, Texas. The report also states that a frozen mix of snow and rain was causing slick conditions across Lubbock. Conditions are expected to worsen over the next several hours.\nHazardous conditions are expected to last for a few days. Blizzard warnings alone are forecasted by the National Weather Service well into Monday morning. Snowfall is expected to build throughout the day in the south plains area of the Texas panhandle. Northerly winds of 40-45 mph will be aided by gusts of up to 65 mph to build massive drifts and take down power lines. Ice build-up of up to a half inch is also expected to accumulate. Wind chill will make the freezing temperatures feel like as cold as -5 degrees.\nOfficials are encouraging everyone to cancel travel plans and take shelter. “Becoming stranded in these conditions will put you, your passengers, and rescue personnel at risk,” the National Weather Service stated. “Power outages will occur due to extended periods of strong winds and potentially damaging wind gusts. Rural residents should have a sufficient supply of food reserves as they could become isolated for several days. Have a means to keep warm without commercial utilities.”","url":"https://www.breitbart.com/border/2015/12/27/historic-blizzard-goliath-marches-texas/"}
