{"authors":[],"date_download":"2018-10-30 17:50:50","date_modify":"2018-10-30 17:50:50","date_publish":"2018-10-30 17:33:33","description":"Zero Mile Post, a significant Atlanta artifact has been moved to Atlanta History Center from its original downtown location","filename":"data/vaneerConsumption/HistoriclandmarkrelocatedtoAtlantaHistoryCenter.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23314106_GBA-building.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_historic-landmark-zero_1474a13cf7bba90f2b47cc1b185d60d7__1540921850.html","title":"Historic landmark relocated to Atlanta History Center","title_page":"Historic landmark relocated to Atlanta History Center","title_rss":"NULL","source_domain":"ajc.com","text":"After more than 250 years, one of Atlanta’s most important artifacts used to mark the city’s early boundaries will no longer call downtown home.\nZero Mile Post — an 800 pound piece of marble that measures 7 feet 5 inches — was installed in the 1850s to mark the southern terminus of the Western & Atlantic Railroad. For more than 20 years, it has been housed in a locked building under the Central Avenue viaduct. The building is scheduled to be demolished later this year to accommodate the rebuilding of the Central Avenue and Courtland Street bridges, a project approved by voters in 2015.\nOn Monday, the Atlanta History Center in Buckhead announced that Zero Mile Post, will be open for public viewing on Nov. 17 as part of the new exhibition, “Locomotion: Railroads and the Making of Atlanta.”\n“We are excited and honored to be able to steward this artifact and have people see it, understand it and have it interpreted. It is a great honor for the Atlanta History Center,” said Atlanta History Center President and CEO, Sheffield Hale.\nThe artifact remains under the ownership of the Georgia Building Authority, which has agreed to a five-year renewable license with the Atlanta History Center.\n“We gave Atlanta History Center a license and a license can be revoked at any time,” said Steve Stancil, State Property Officer serving as executive director. “Georgia Building Authority still owns it. The place it was at is in peril because of the rebuilding of the Central Avenue bridge.”\nZero Mile Post was installed after the state legislature commissioned the railroad to bring rail lines into Georgia from Chattanooga in the early 1840s. A new city cropped up and went through several name changes before Atlanta stuck and the city developed into a southeastern rail hub.\nIn the months leading up to GBA’s decision to relocate the marker from downtown, some local preservationist expressed concerns about moving such an important piece of Atlanta’s history to any location other than the place it was designed to mark.\n“The Atlanta Preservation Center has made its position known and has advocated for the preservation of the Zero Mile Post for several years,” said David Mitchell, Director of Operations. The Atlanta Preservation Center, along with other preservationists interviewed earlier this year by The Atlanta Journal-Constitution, said they hoped the marker would be kept in the location where it had been for more than 25o years. In May, the Atlanta City Council passed a resolution stating the Zero Mile Post should be remain in its historic site and be made accessible to the public.\nBut Stancil said the decision to move the marker is a win for everyone.\n“We just didn’t feel like if we tore the building down that was protecting it. There is no way that marker would have lasted any time. We felt like this was the best way to protect it and the best way for people to see it,” Stancil said.\nThe building authority had a surveyor mark the exact GPS coordinates of the marker. “Even if someone goes out and levels the place with a bulldozer, we will still know where the marker is,” Stancil said.\nA replica post that has long been on display at the Atlanta History Center will be placed at the site downtown where Zero Mile Post once stood along with an interpretive marker from Georgia Historical Society.\nZero Mile Post has not regularly been on view to the public since 1994 when a tourist rail line that used the building as a passenger depot went out of business. Anyone who wanted to enter the building and access the post had to request permission.\nIt took one day for the History Center to remove the marker from the concrete base where only 42-inches of it had been exposed above ground.\nThe Atlanta History Center initially considered displaying the marker in the same manner as it had been positioned in its original location, but decided it would be better displayed in its full scale. As part of the exhibition, Zero Mile Post will appear with the restored Texas locomotive, one of two remaining Western & Atlantic locomotives that would have arrived and departed from the very same mile post. Zero Mile Post and the locomotive will be visible, day and night, through the glass windows of the new Rollins Gallery facing West Paces Ferry Road.","url":"https://www.ajc.com/news/historic-landmark-zero-mile-post-relocated-atlanta-history-center/ERBYWVCyh34iRzd0kAuIcL/"}
