{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 01:22:28","date_modify":"2018-10-23 01:22:28","date_publish":"2017-03-16 11:18:29","description":"Nigel Ingram (pictured) was driving a van when he hit Sam Boulton, 26, a graphics teacher at Castle Rock High School in Coalville, Leicestershire - on the day of Mr Boulton's birthday last July.","filename":"data/vaneerConsumption/Hitandrundriver50walksfreeaftercyclistdies.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53915E00000578-0-image-a-55_1489662133629.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319618_Hit-run-driver-50-walks-free-cyclist-dies_1540257748.html","title":"Hit-and-run driver, 50, walks free after cyclist dies","title_page":"Hit-and-run driver, 50, walks free after cyclist dies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A hit-and-run driver who was almost three times the legal alcohol limit when he crashed into a cyclist who later died has walked free from court.\nNigel Ingram, 50, was driving a van when he smashed into Sam Boulton. He then drove off and bought some alcohol from a supermarket.\nMr Boulton suffered horrific head injuries in the crash on July 27 last year - the day of his 26th birthday.\nA court heard that Mr Boulton, a graphics teacher at Castle Rock High School in Coalville, Leicestershire, was hit when a taxi door opened and knocked him into the path of Ingram's van outside Leicester's train station.\nNigel Ingram (left), 50, of Leicester, was driving a van when he smashed into Sam Boulton (right). Ingram then drove off and bought some alcohol from a supermarket\nA court heard that Mr Boulton, a graphics teacher at Castle Rock High School in Coalville, Leicestershire, was hit when a taxi door opened and knocked him into the path of Ingram's van outside Leicester's train station. The scene of the tragedy, pictured\nIngram fled the scene but was later arrested and a breathalyser test showed he had 100 micrograms of alcohol per 100ml of breath - almost three times the legal limit of 35mcg.\nIngram, of Leicester, admitted failing to stop at the scene and driving while over the drink drive limit when he appeared at the city's magistrate's court on Wednesday.\nHe was handed a 26-week prison sentence, suspended for 12 months under the condition that he attends a 12-week alcohol treatment course.\nHe is also banned from driving for 28 months.\nThe court heard 'chronic alcoholic' Ingram had not drunk on the day of the crash but had the night before.\nProsecutor Zabin Cauhan said: 'Evidence shows he was over the limit at the time of the accident. Mr Ingram said he is a chronic alcoholic who drinks every day.\n'He said he only drank after the accident that day.\nEarlier this month, Mandy Chapple, 56, who opened the taxi door that hit Mr Boulton pleaded guilty to opening a vehicle door so at to injure or endanger another person\n'He said he only left the scene due to shock and panic, and not because he was over the drink drive limit.\n'He has accepted he was over the drink drive limit at the time of the accident - he did drink the previous day.'\nAfter the crash, Ingram drove off and bought alcohol from a supermarket before going home.\nHe called his wife and mother for advice, and both told him to call the police, who found him at his home at 4pm.\nEve Patterson, defending, said: 'His standard of driving that day did not lead to the accident, did not cause the accident and did not impact on it happening.\n'It is obviously a series of tragic circumstances.\n'Not only have a family lost someone important to them, Mr Ingram also has to live with the fact he was the driver of that vehicle, and that has had a deep and long-lasting impact on him.\n'It is also the case that since the accident, he has not driven and has sold the vehicle he used that day.\n'This is due to the anxiety related to July 27. He can't face the prospect of something like that happening again.'\nEarlier this month Mandy Chapple, 56, who opened the taxi door that hit Mr Boulton pleaded guilty to opening a vehicle door so at to injure or endanger another person.\nChapple, also of Leicestershire, was handed an £80 fine.\nMeanwhile taxi driver Farook Bhikhu, 50, of Leicestershire, has denied a charge of permitting the opening of a taxi door so as to injure or endanger a person.\nHe will face a trial at a later date.","url":"https://www.dailymail.co.uk/news/article-4319618/Hit-run-driver-50-walks-free-cyclist-dies.html"}
