{"authors":["Anneliese Cooper"],"date_download":"2018-10-30 23:04:48","date_modify":"2018-10-30 23:04:48","date_publish":"2014-08-14 11:30:04","description":"There is a reason that, for years, I only knew the chorus and second verse of Pink's \"There You Go,\" and that reason is HitClips. For those of you not of age in the glorious four-year window during which these products were marketed — 1999, 2000,…","filename":"data/vaneerConsumption/HitClipsMayHaveBeenTerribleToolsofCorporateEvilButManWereTheyFun.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/6/91f9ad79-9f35-42da-af54-7fe628019398-getty-97860355.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35177-hitclips-may-have-been-terrible-tools-of-corporate-evil-but-man-were-they-fun_1540940688.html","title":"HitClips May Have Been Terrible Tools of Corporate Evil - But, Man, Were They Fun","title_page":"HitClips May Have Been Terrible Tools of Corporate Evil — But, Man, Were They Fun","title_rss":"NULL","source_domain":"bustle.com","text":"There is a reason that, for years, I only knew the chorus and second verse of Pink's \"There You Go,\" and that reason is HitClips. For those of you not of age in the glorious four-year window during which these products were marketed — 1999, 2000, 2001 and 2002, thank you very much — HitClips were, much like they sounded, minute-long clips of hit songs, programmed into tiny keychain-bound chips, which you would then put into a special micro-walkman-type device and listen away. The all-too-brief list of artists featured on this inexplicable technology reads like a catalogue of your repressed pop memories: A*Teens, O-Town, Aaron Carter, Faith Hill. And of course, you had your pick of boy bands — the gentlemen of 'NSync, Boys of the Backstreet persuasion, even a brief cameo from the floppy-haired Hanson brothers — as well as a heaping helping of Ms. Britney Spears, who boasted the most prolific clippery by far with a whopping six sampled tracks.\nStill, the makers of HitClips clearly felt the need to garner even an iota of cred by injecting some GoldenOldies™ into the mix, churning out copies of The Kingsmen's \"Louie Louie,\" Otis Day and the Knights' \"Shout,\" and The Troggs' \"Wild Thing\" alongside all the hip modern acts. (James Brown's \"I Feel Good\" came later on Hit Clip Discs, but everyone knows those were for posers.) Despite their best efforts, however, history reveals that HitClips weren't so much \"music\" as they were highly coveted marketing tools.\nAs it turns out, HitClips were the brainchild of Tiger Electronics, the same company responsible for the Furby, who partnered with record labels to help create a \"buzz\" around some of their top youth-oriented acts (with a gadget that would in turn sell better because of said buzz, etc.). A telling 2002 article in Stereophile begins, \"Where Pogs and Pokemon once ruled, HitClips have taken over\" — I'll pause here to let you quell that nostalgia headrush — thus situating HitClips from the get-go squarely in the realm of \"toy.\"\nAnd I mean, it's true; for what purported to be a music-related device, they seemed to devote precious little care to the music itself, not even enough to feature a whole song. Plus, the sound quality was essentially nonexistent, mono and insanely compressed — or, in non-audiophile speak, \"shitty.\" But, I mean, you wouldn't complain about the bass mix on your Furby, right?\nOh, and did I mention they were marketed primarily by McDonalds?\nBritneyExperts on YouTube\nPlenty of people today get their jollies leaping upon various soapboxes to decry the commodification of the music industry, and while they're not wrong, I think we can all rest somewhat easier knowing it can't really get any more corporate than HitClips — that is, crappily manufactured pop as the toy next to your Happy Meal.\nAnd still, there's a way in which HitClips were kind of the perfect venue for this particular subset of artists. Okay, yes, it was a questionable choice to co-opt The Troggs, but for acts like Dream Street, you really weren't missing much hearing \"It Happens Everytime\" truncated and toned down. Even those willing to stand up for Britney's deep cuts — and believe me, I could talk your ear off about the fuck-yes feminist brilliance that is \"What U See (Is What U Get)\" — likely aren't going to sit around musing over the bespoke artistry that his her songwriting, its intricate and nuanced production value.\nUltimately, it's more honest this way — objective proof that the music is hardly the most important part of these mega-stars' appeal. Because really, if you're going to listen to to Soul Decision's \"Ooh, It's Kinda Crazy\" at all, why not do so on an impractical computer chip adorned with their picture?\nSoulDecisionVEVO on YouTube\nSo with that, I say we all make a mental note to scour our mothers' attics for our old HitClips players, then band together to compose an impassioned letter to Tiger suggesting that they bring this format back. I'm just sayin', Harry Styles' face would look damn good on a tiny keychain square.","url":"https://www.bustle.com/articles/35177-hitclips-may-have-been-terrible-tools-of-corporate-evil-but-man-were-they-fun"}
