{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 01:51:35","date_modify":"2018-10-23 01:51:35","date_publish":"2016-01-11 13:11:37","description":"Lin Homer will stand down as HM Revenue and Customs chief executive in April after four years in the role. Despite her scandal-hit time in Whitehall, she was made a Dame in the New Year's Honours list.","filename":"data/vaneerConsumption/HMRCchiefexecutiveLinHomertopocket2millionpensionafterquitting.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A678B00000578-0-image-a-103_1452517727908.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393906_HMRC-chief-executive-Lin-Homer-quits-job_1540259495.html","title":"HMRC chief executive Lin Homer to pocket £2million pension after quitting","title_page":"HMRC chief executive Lin Homer to pocket £2million pension after quitting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The head of the UK tax office who faced intense criticism from MPs while holding a string of top Whitehall roles is quitting.\nLin Homer will stand down as HM Revenue and Customs chief executive in April after four years in the role, the Government has announced.\nDespite her scandal-hit time in Whitehall, during which she presided over the UK Border Agency (UKBA) and the tax office, she was made a Dame in the New Year's Honours list.\nShe is now set to retire with a pension worth an estimated £2million after receiving a reported £85,000 contribution in her first year at HMRC.\nLin Homer (pictured left and, right, appearing before the Public Accounts Select Committee), a Whitehall mandarin criticised during her time in charge of UKBA and HMRC, is quitting her job, it was announced today\nMs Homer faced a scathing attack by MPs for her 'catastrophic leadership failure' when she was in charge of the UKBA.\nShe went on to become head of Britain's tax office, but was forced to defend the department after securing only one prosecution from a list of 6,800 UK-related secret Swiss bank accounts provided in 2010 by French authorities.\nDuring her time at the UKBA, more than 100,000 of the 400,000 asylum seekers found in the backlog were allowed to stay – in what MPs said amounted to an 'amnesty'.\nAround 400 of the 1,000 foreign criminals were also told they could remain in Britain and dozens remained untraced.\nThen, whilst she was in charge of HMRC, the tax office was rocked by a scandal over millions of miscalculated tax bills.\nLast summer, it emerged the taxman failed to answer 18million phone calls from the public last year – more than a quarter of those it received.\nIn September Miss Homer admitted half of taxpayers who called the HMRC helpline did not get through during busy periods.\nDespite this, it was reported earlier this month that her pension pot has swollen by around by £500,000 since she took over at HMRC in 2012.\nMs Homer (pictured with George Osborne) said that leaving this year 'seemed to be the right time to move on'\nAnnouncing she was stepping down today, Ms Homer said: 'After 10 years as a chief executive and permanent secretary in the Civil Service, the start of the next spending review period seemed to be a sensible time to move on.'\nAndrew Tyrie MP, Chairman of the Treasury Committee, said the government now needs to find a 'high quality replacement'.\nHe said: 'The taxpayer experience of HMRC is still well short of what they have the right to expect.'\nDespite the scandals affecting her time in the top roles, Chancellor George Osborne said today: 'Lin Homer has made a real contribution to public service modernisation and transformation.\nHe added: 'She has put the foundations in place that will see HMRC become one of the most digitally-advanced tax authorities in the world.'","url":"https://www.dailymail.co.uk/news/article-3393906/HMRC-chief-executive-Lin-Homer-quits-job.html"}
