{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 20:07:24","date_modify":"2018-10-30 20:07:24","date_publish":"2015-06-17 12:58:01","description":"The survivors, dead and relatives of the sinking of His Majesty's Troop Ship Lancastria in 1940 have finally been acknowledged. Standing in for the Prime |","filename":"data/vaneerConsumption/HMTLancastriaSinkingRecognisedinParliament75YearsAfterCoverUpofBritainsWorstMaritimeDisaster.json","image_url":"https://media.breitbart.com/media/2015/06/HMT-LANCASTRIA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_06_17__1540930044.html","title":"HMT Lancastria Sinking Recognised in Parliament, 75 Years After Cover-Up of Britain's Worst Maritime Disaster","title_page":"HMT Lancastria Sinking Recognised in Parliament, 75 Years After Cover-Up of Britain's Worst Maritime Disaster | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The survivors, dead and relatives of the sinking of His Majesty’s Troop Ship Lancastria in 1940 have finally been acknowledged.\nStanding in for the Prime Minister in Parliament, Chancellor George Osborne addressed the tragedy on Wednesday and said it is still not known exactly who died in the chaos of the Dunkirk evacuation and the ban by the government on it being discussed or reported afterwards, but the tragedy deserved to be recalled. The Chancellor called on Parliament to remember the dead. He said today:\n“It is the 75th anniversary of the sinking of the HMT Lancastria, the largest loss of British lives at sea in the history of this maritime nation. Some of the survivors are alive today and many of course mourn those who died.\n“It was kept secret at the time for reasons of wartime secrecy, and I think it is appropriate today in this house of commons to remember all those who died, those who survived, and those who mourn them”.\nThe ship, which turned over and quickly sank in 1940 while evacuating troops and civilians from Dunkirk after the German invasion. It went down with between 4,000 and 6,000 people, making it both the worst maritime disaster and bloodiest day for the British in the whole of the Second World War. The former Cunard liner had been requisitioned by the War Office, converting it to a troop ship at the start of the war when it became part of the flotilla evacuating Brits on the 17th of June 1940.\nLoaded with troops, embassy staff, and other civilian refugees, the Lancastria was ready to return to Britain – but was dive-bombed by German Stuka aircraft at 15:48, causing the ship to capsize, leak fuel oil, and sink.\nThe ship was originally designed to carry 1,300 paying passengers, and then uprated to 2,200 for wartime service. But so urgent was the evacuation that many thousands more clambered onboard – perhaps as many as 10,000, hoping to sail home. Of those on-board when the ship was bombed, only 2,447 survived.\nIn comparison, 1,523 passengers and crew perished when the RMS Titanic sank in 1912 – meaning there could have been three times as many dead on the Lancastria, if not more.\nThe enormous loss of life on top of Britain’s humiliating defeat in its attempt to defend France from Germany was considered too much for the state of public morale – and the sinking was immediately hushed up, with British newspapers banned from reporting events. Osborne’s comments represents a remarkable break of silence for the British government, which has not commemorated, or even given much recognition to the events since.","url":"https://www.breitbart.com/europe/2015/06/17/hmt-lancastria-sinking-recognised-in-parliament-75-years-after-cover-up-of-britains-worst-maritime-disaster/"}
