{"authors":["Sarah Griffiths For Mailonline"],"date_download":"2018-10-23 02:09:36","date_modify":"2018-10-23 02:09:36","date_publish":"2016-01-28 16:57:21","description":"The coins (pictured) date from second and third centuries AD, a time when the Romans regularly marched through Yeovil, on the Fosse Way – the main road between Exeter and Lincoln.","filename":"data/vaneerConsumption/Hoardof3000RomancoinsunearthedinYeovil.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC45DC00000578-0-image-a-66_1453998074671.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421222_Hoard-3-000-Roman-coins-unearthed-Rare-monies-buried-270AD-bear-image-various-emperors-elephant-hippo-worth-175-000_1540260576.html","title":"Hoard of 3,000 Roman coins unearthed in Yeovil","title_page":"Hoard of 3,000 Roman coins unearthed in Yeovil | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A hoard of almost 3,340 Roman coins unearthed by accident by a JCB driver on a building site in Yeovil could be worth as much as £175,000 ($251,000).\nThey date from second and third centuries AD, a time when the Romans regularly marched through the then-village, on the Fosse Way - the main road between Exeter and Lincoln.\nThe massive collection of silver coins include those with depictions of various emperors, as well as an elephant and even a hippopotamus.\nA hoard of 3,000 Roman coins unearthed by a JCB driver on a building site in Yeovil, may be worth £175,000. A number of the coins, thought to be buried in 270 AD. They include 164 silver denarii coins, four brass sestertii (four of which were worth one denarii) and the rest are radiates, much like modern pennies (selection shown)\nMark Copsey, 44, discovered the coins on March 20, 2013, when he was levelling a recreation ground for a hockey pitch and spotted something green in the soil.\nHe said: 'I was stripping subsoil to the rock and was on an eight by ten metres strip to clear the second-to-final strip when I looked behind me and noticed a green colour in the soil.\nTHE COINS IN THE HOARD The 3,339 coins were buried in around 270AD. They include 164 silver denarii coins, four brass sestertii (four of which were worth one denarii) and the rest are radiates, which were much like modern pennies and had a small value. Some of the coins carry the heads of empresses, and others emperors, including Philip I, born in Syria of a Syrian father, around 204AD. The denarii come from the reigns of Antoninus Pius (AD 138-61), Septimius Severus (AD 193-211), Caracalla (AD 198-217), Macrinus (AD 217-8), Elagabalus (AD 218-222), Severus Alexander (AD 222-35), Maximinus I (AD 235-8) and Gordian III (AD 238-44), The British Museum told MailOnline. The majority, 49, date from the time of Severus Alexander who is said to have relied on charm and bribery to keep peace while he was Roman Emperor. The four sestertii were minted under Roman Empress Faustina II (130-175AD), Lucilla (the second daughter of Roman Emperor Marcus Aurelius) and Commodus, Roman Emperor from 180 to 192 with Marcus Aurelius. The coin with the elephant on one side bears the bust of Philip I 'the Arab' on its reverse, who was the Roman Emperor between 244 and 249 AD. It was minted in Rome. The coin with a hippopotamus also shows Otacilia Severa, who was a Roman Empress and wide of Philip I, between 244 and 249 AD.\n'I stopped my machine and got out and investigated and discovered a broken pot with some sort of coins.'\nMr Copsey put them in a plastic carrier bag, before reporting the incredible find.\nThe 3,339 coins have now been cleaned and examined by The British Museum, which believes they were buried in around 270AD.\nThey include 164 silver denarii coins, four brass sestertii, four of which were worth one denarii.\nThe rest are radiates, which were much like modern pennies and had a small value.\nSome of the coins carry the heads of empresses, and others emperors, including Philip I, born in Syria of a Syrian father, around 204AD.\nThe denarii come from the reigns of Antoninus Pius (138-61AD), Septimius Severus (193-211AD), Caracalla (198-217AD), Macrinus (217-8AD), Elagabalus (218-222AD), Severus Alexander (222-35AD), Maximinus I (235-8AD) and Gordian III (238-44AD), The British Museum told MailOnline.\nThe majority of the denarii, 49, date from the time of Severus Alexander who is said to have relied on charm and bribery to keep peace while he was Roman Emperor.\nThe four sestertii were minted under Roman Empress Faustina II (130-175AD), Lucilla (the second daughter of Roman Emperor Marcus Aurelius) and Commodus, Roman Emperor from 180 to 192 in tandem with Marcus Aurelius.\nIn Roman currency, denarii - small silver coins first minted in around 211BC - were the most common coin in circulation and were worth 16 asses - small bronze coins or four sestertii in the second century BC, to which the coins are dated.\nDenarii were slowly debased in weight, with their silver content reduced over time.\nThe British Museum said some of the coins were made during a time of inflation and could in theory all have circulated at the same time in the third century BC.\nA report by the coroner who examined the coins said: 'Coins issued prior to the reign of the emperor Septimius Severus (193-211AD), whose major debasement of the silver coinage made earlier coins attractive to those wishing to remove them to take advantage of their higher silver content, are almost absent and this fits a known pattern for British hoards deposited as this time.'\nThe coins with the elephant on one side bears the bust of Philip I 'the Arab' on its reverse, who was the Roman Emperor between 244 and 249 AD. It was minted in Rome\nThe massive collection of silver coins include those with depictions of various emperors, as well as an elephant and a hippopotamus (pictured). The woman is Philip I's wife Otacilia Severa\nMark Copsey, 44, discovered the coins on March 20, 2013, when he was levelling Yeovil recreation ground (pictured) for a hockey pitch and spotted something green in the soil. The discovery at the site has triggered an investigation that revealed a small Roman settlement\nTHE ROMANS IN YEOVIL Yeovil may not spring to mind as a Roman town, but plenty of artefacts from the time have been found there. Yeovil was inhabited by British Celtic Durotriges before the Roman invasion, which initially had little effect on the area. However, The Fosse Way, linking Lincoln (Lindum Colonia) and Exeter (Isca Dumnoniorum) was built near what is now Yeovil, as well as an important subsiduary road Ilchester to Dorchester (Durnovaria) running through it. Near to this road was a garisson for troops, dubbed the 'Westland complex' which was discovered in 1916, Yeovil History reported. Roman coins have been found near the road, as well as fragments of mosaics and pots. In the 1950s a denarius of Severus Alexander was dug up in a garden at Rustywell almost on the Roman road from Ilchester to Dorchester, suggesting it was a busy route.\nAmong the hoard is also one coin bearing the likeness of Antoninus Pius (138-61AD) which is between 80 and 90 per cent silver, but those of Severus are less than half silver.\nBy the end of the third century AD, denarii only contained just a few per cent of silver, which was disguised by applied silver 'wash' to the surface.\nThe coins were removed from the site en-masse and British Museum experts revealed they were found fused together in rolls with remains of cloth and string preserved around them, suggesting they were deliberately and methodically stashed in antiquity.\nShards of pottery found nearby suggest the money was stored in a sizable greyware vessel.\nThe discovery at the site, under Yeovil Recreation Ground in Somerset, has triggered an archaeological investigation that revealed a small Roman settlement.\nMr Copsey described finding the coins as 'brilliant'.\nHe added; 'When I found the hoard I did everything I could to act correctly and do everything above board.\n'When I'm driving it's a health and safety rule to look behind me as well, that's how I spotted them.\n'The 'dozer took the top off the pot before I knew it was there, I'm afraid it'll do that every time.\n'I'm still working on archaeological digs with the 'dozers so hopefully I might find some more.'\nLorry driver Colin Parnell had also been on the site, some yards away and saw Mr Copsey stop his vehicle and examine the ground.\nThe coins date from second and third centuries AD, a time when the Romans regularly marched through Yeovil, on the Fosse Way – the main road between Exeter and Lincoln. The location of the find is shown\nThe coins were removed from the site en-masse and British Museum experts revealed they were found fused together in rolls (some shown) with remains of cloth and string preserved around them, suggesting they were deliberately and methodically stashed in antiquity\nHe argued it was a team find but coroner Tony Williams ruled at the hearing in Taunton in Somerset that Mr Copsey alone was the finder.\nMr Copsey (pictured) stands to reap half the value of the coins, with the rest going to the landowner\nHe declared the find to be treasure under the Treasure Act, meaning Mr Copsey will be entitled to half of the hoard's value.\nExperts believe the coins could be worth up to £175,000, meaning Mr Copsey could net around £87,000 ($125,000).\nCoin expert Chris Martin of CJ Martin (Coins) in London, a certified dealer under the British Numismatic Trade Association, told MailOnline: 'Early to mid-third century denarii are worth between £10-£100, radiates in silver are £10 - £50 and the sestertii described can be anything between £20 - £100.\n'These are very rough prices based on low to good conditions and do not take in account any rarities.'\nHowever, marketing manager Richard West, from Stanley Gibbons Coins who examined images of the coins with Paul Hill said the topmost coin carry an estimate of around £100, the middle around £30 and the bottom somewhere in the region of £20.\nThe South West Heritage Trust has said it would like to acquire the coins to display at the Museum of Somerset, which would also give the people of Yeovil an opportunity to see them.\nBut the British Museum told MailOnline an official valuation is needed first and this will likely come 'later this year'.\nThe coins will first be valued by an independent treasure valuation committee and then the recommendations will be given to Mr Copsey, the landowner, South Somerset District Council, and the Heritage Trust, who can contest the valuation.\nOnce the cost is agreed, the trust will have three months to raise the money to buy them.","url":"https://www.dailymail.co.uk/sciencetech/article-3421222/Hoard-3-000-Roman-coins-unearthed-Rare-monies-buried-270AD-bear-image-various-emperors-elephant-hippo-worth-175-000.html"}
