{"authors":["Seth Millstein"],"date_download":"2018-10-31 00:08:34","date_modify":"2018-10-31 00:08:34","date_publish":"2018-10-30 23:25:12","description":"It seems that a series of hoax allegations against Robert Mueller are unraveling, and Mueller's team has asked the FBI to investigate. Although the story is developing rapidly and it's not entirely clear yet exactly what happened, early reports…","filename":"data/vaneerConsumption/HoaxAllegationsAgainstRobertMuellerAreUnravelingAndNowTheFBIIsInvolved.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/30/9ef65a86-c99d-47e7-bd11-dbedf383bd1c-getty-175801070.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_hoax-allegations-against-robert-mueller-are-unraveling-now-the-fbi-is-involved-13041686_1540944514.html","title":"Hoax Allegations Against Robert Mueller Are Unraveling - And Now The FBI Is Involved","title_page":"Hoax Allegations Against Robert Mueller Are Unraveling — And Now The FBI Is Involved","title_rss":"NULL","source_domain":"bustle.com","text":"It seems that a series of hoax allegations against Robert Mueller are unraveling, and Mueller's team has asked the FBI to investigate. Although the story is developing rapidly and it's not entirely clear yet exactly what happened, early reports indicate that a Republican lobbyist and pro-Trump Twitter personality may allegedly have planned to pay women to falsely accuse Mueller of sexually harassing them.\n“When we learned last week of allegations that women were offered money to make false claims about the Special Counsel, we immediately referred the matter to the FBI for investigation,” Peter Carr, a spokesperson for the Special Counsel's office, told the Atlantic in an email on Tuesday.\nAccording to various reports, several journalists received an email in mid-October from somebody identifying herself as Lorraine Parsons, who said she'd been offered $20,000 to \"make accusations of sexual misconduct and workplace harassment against Robert Mueller.\" Parsons wrote that this offer was made to her by a man claiming to work for a firm called Surefire Intelligence, and that this firm had, in turn, been hired by a Republican lobbyist named Jack Burkman. Carr confirmed to the Atlantic that journalists had informed the Special Counsel's office about the allegations.\nSeveral news organizations were unable to corroborate Parsons' story, according to the Atlantic, or confirm her identity. However, a second woman named Jennifer Taub, who works as an associate professor at Vermont Law School, told the Atlantic that she received a similar offer from somebody claiming to work for Surefire Intelligence.\nSubsequent investigations revealed that Surefire Intelligence has close ties to Jacob Wohl, a 20-year-old Trump supporter with a sizable following on Twitter. Wohl's email address is listed in the website's domain records, as is the email of a firm he once led, and the firm's phone number redirects to the voicemail of Wohl's mother. The New Yorker's Jane Mayer discovered that a web profile for \"Matthew Cohen,\" supposedly the managing partner at Surefire Intelligence, uses a darkened picture of Wohl for its profile picture.\nBoth Burkman and Wohl deny being involved in any scheme to pay women to accuse Mueller of harassing them.\nWohl told the Daily Beast that he knows nothing about Surefire Intelligence; however, Burkman told Hill Reporter that Wohl is in charge of the firm. When NBC News asked Wohl why Surefire Intelligence's voicemail redirects to his mom's voicemail, he stopped responding to their questions.\nThe Daily Beast later reported that at least seven supposed employees of Surefire Intelligence used fake headshots (including one of Academy Award-winning actor Christoph Waltz) for their profile photos. In August, Medium published an \"exposé\" on Surefire Intelligence, ostensibly by a journalist named Matthew Goldman; however, BuzzFeed News reporter Chris Geidner reported that the picture of \"Goldman\" on Medium is actually an altered photo of a model named Oran Katan. By Tuesday afternoon, Medium had removed both the article and Goldman's profile page on the website.\nAs all of this was happening, both Wohl and Burkman were teasing the possibility of a bombshell report about Mueller. On Oct. 20th, Burkman said in Facebook video that he was \"getting very close\" to blowing the lid off of the \"sexual misadventures of Bob Mueller,\" while Wohl tweeted on Monday that \"several media sources tell me that a scandalous story about Mueller is breaking tomorrow.\"\nOn Tuesday, the Daily Beast and others reported on the alleged scheme to falsely accuse Mueller. Burkman stood by his story, however, tweeting later in the day on Tuesday that he'll present \"the first of Special Counsel Robert Mueller's sex assault victims\" at a press conference on Thursday.\nOne of the reporters who Parsons emailed was the Hill Reporter's Ed Krassenstein, a popular figure in liberal Twitter circles. Krassenstein says that after receiving the email, he immediately contacted the Special Counsel's office, which in turn referred the matter to the FBI.\nBoth Burkman and Wohl have made headlines in the past. In November 2017, Burkman announced that he would reveal claims of sexual harassment against a sitting member of Congress; however, the accuser didn't show up for the press conference he had planned, and he later apologized to the media. Wohl, meanwhile, was given a cease-and-desist order by the Arizona Securities Commission for allegedly violating the Securities Act. Wohl denies those allegations as well.","url":"https://www.bustle.com/p/hoax-allegations-against-robert-mueller-are-unraveling-now-the-fbi-is-involved-13041686"}
