{"authors":["Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-22 22:08:40","date_modify":"2018-10-22 22:08:40","date_publish":"2016-01-11 02:34:01","description":"The bodies of two men have been found on a motor cruiser docked at a marina in Hobart's Prince of Wales Bay in Tasmania on Monday morning.","filename":"data/vaneerConsumption/HobartsPrinceofWalesBaygasleakmayhavekilledtwomen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/03/3002680200000578-0-image-a-21_1452481390166.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393210_Two-men-dead-motor-cruiser-Hobart-s-Prince-Wales-Bay-killed-gas-leak_1540246120.html","title":"Hobart’s Prince of Wales Bay gas leak may have killed two men","title_page":"Hobart’s Prince of Wales Bay gas leak may have killed two men | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The bodies of two men have been found on board a motor cruiser moored at a jetty north of Hobart.\nThe men, aged 56 and 58, were found around 8am on Monday in Prince of Wales Bay, near the city's northern suburb of Derwent Park, on a boat which was docked at the Gepp Parade marina and neither man had any obvious physical injuries.\nAccording to police, the owner of the vessel left the boat at 12.30pm on Sunday at Wine Glass Bay after his seven-year-old daughter became ill and the men continued on.\nScroll down for video\nThe bodies of two men have been found on board a motor cruiser at Prince of Wales Bay (pictured) in Hobart's northern suburbs\nBoth bodies were stretchered off the vessel and onto a police boat for transport to shore\nThe 58 year old Newnham man and a 56 year old Mowbray man were found on the 10m cruiser vessel by the boat owner the next morning.\nTasmanian police told Daily Mail Australia they have ruled out foul play and are continuing to investigate the cause of death.\nOfficers are looking into whether a gas leak on the boat led to the pair to suffocate, The Mercury reported.\nThe families of the two men are currently being spoken to by police and it is understood the boat was moored at the Gepp Parade marina overnight.\nBoth bodies were stretchered off the vessel and onto a police boat for transport to shore.\nThe bodies were removed on stretchers via a police boat and transported to shore\nTasmanian police told Daily Mail Australia they have ruled out foul play and are continuing to investigate the cause of death","url":"https://www.dailymail.co.uk/news/article-3393210/Two-men-dead-motor-cruiser-Hobart-s-Prince-Wales-Bay-killed-gas-leak.html"}
