{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 05:24:17","date_modify":"2018-10-23 05:24:17","date_publish":"2017-03-16 16:16:40","description":"The 52-year-old Today show star took to Instagram on Wednesday to share an adorable photo of Joel, 58, playing on the floor with the one-month-old infant.","filename":"data/vaneerConsumption/HodaKotbsharesfirstpictureofboyfriendanddaughter.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E5588EB00000578-0-image-a-21_1489681200087.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320714_Hoda-Kotb-shares-picture-boyfriend-daughter_1540272257.html","title":"Hoda Kotb shares first picture of boyfriend and daughter","title_page":"Hoda Kotb shares first picture of boyfriend and daughter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hoda Kotb's longtime boyfriend Joel Schiffman is just as enamored with her adopted daughter Haley Joy as she is.\nThe 52-year-old Today show star took to Instagram on Wednesday to share an adorable photo of Joel, 58, playing on the floor with the one-month-old infant.\nHoda captioned the snapshot using two heart emoji, presumably to represent the two great loves of her life.\nAll smiles: Hoda Kotb took to Instagram on Wednesday to share a snapshot of her longtime boyfriend Joel Schiffman, 58, playing on the floor with her adopted daughter Haley Joy\nDoting mom: The first-time mother revealed last month that she had adopted Haley Joy, who was born on Valentine's Day\nThe heartwarming image sees Joel gazing at Haley with a smile on his face while he lies in front of her. Meanwhile, the newborn looks content on her play mat as she looks back at him.\nHoda has been with the financier for more than three years, and she recently opened up about his reaction to her wanting to adopt a child and his current role in her daughter's life.\n'One of the things in my life I’ve always wanted was to be a mom,' she told People. 'Sometimes in your life, things just don’t work out for whatever reason, so you say, \"Well, I wasn’t meant to have that.\" But it was really hard to come to terms with it.'\nHoda said she eventually mustered up the courage to tell Joel about her desire to have baby last year while she was making arrangements to move in with him.\nNext chapter: Although she left Joel's name off of the adoption papers, she recently said that 'Haley will call him Dad'\nSleepless nights: Hoda shared a photo of her and Joel getting in some much-needed caffeine last month\nHappy days: Hoda's Today show co-star Savannah Guthrie taught her how to swaddle the newborn during her visit last week\n'I was afraid to even say it out loud, because then it felt so real,' she recalled. 'I said, \"Think about it for a day or a week or whatever.\" And he said, \"I don’t need a day. Let’s get this journey going.\"\n'At that point I blubbered like a baby. It was like the dam burst.'\nHoda, who worked with a licensed adoption agency in New York, explained that she left Joel's name off of the paperwork to simplify the process, but she noted that 'Haley will call him Dad'\nThe first-time mom announced the news of her adopted daughter last month by calling into the Today show and sharing a photo of Haley Joy, who was born on Valentine's Day.\n'She is the love of my life,' Hoda told her co-workers, bringing both Kathie Lee Gifford and Jenna Bush Hager to tears.\nMeet and greet: Earlier this month, Haley met Today show star Matt Lauer for the first time\nBaby love: Jenna Bush Hager stopped by Hoda's apartment to visit Haley Joy at the beginning on March\nChecking out the child: Al Roker also visited Hoda to say hello to her new daughter\nUnsurprisingly, Hoda and Haley have received plenty of visitors while she has been away from the show, including her co-star Savannah Guthrie.\nSavannah just gave birth to her second child, a son named Charley, in December, and she was happy to share some tricks of the trade with Hoda.\nDuring her visit last weekend, Savannah taught Hoda how to swaddle baby Haley, and they happily posed for a picture together to commemorate the moment.\n'Aunt Savannah showed us how to swaddle !!! Happy Haley xoxo,' Hoda captioned the image, which sees her smiling pal holding the infant.\nHaley is one popular baby, and, so far, she has received visits from Matt Lauer, Al Roker, and Jenna Bush Hager.","url":"https://www.dailymail.co.uk/femail/article-4320714/Hoda-Kotb-shares-picture-boyfriend-daughter.html"}
