{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 02:31:53","date_modify":"2018-10-23 02:31:53","date_publish":"2016-01-28 17:21:34","description":"The Israeli socialite showed off her slim curves in not one, but two stunning two-pieces as she cavorted on the beaches of the luxurious Hideaway Beach Resort & Spa.","filename":"data/vaneerConsumption/HofitGolanshowsoffherslimcurvesintwoskimpybikinisintheMaldives.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC4FC700000578-0-image-a-204_1454001310463.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421248_Israeli-socialite-Hofit-Golan-shows-slim-curves-ample-assets-two-skimpy-bikinis-sizzles-Maldives_1540261913.html","title":"Hofit Golan shows off her slim curves in two skimpy bikinis in the Maldives","title_page":"Hofit Golan shows off her slim curves in two skimpy bikinis in the Maldives | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was seen drenching herself in the sunshine of St. Barts less than a month ago.\nAnd serial jet-setter Hofit Golan was back to her bikini-clad best as she basked in the heat of the Maldives with a female friend on Thursday.\nThe Israeli socialite showed off her slim curves in not one, but two stunning two-pieces as she cavorted on the beaches of the luxurious Hideaway Beach Resort & Spa.\nScroll down for video\nBeach babe: Incessant jet-setter Hofit Golan was back to her bikini-clad best as she basked in the heat of the Maldives with a female friend on Thursday\nThe TV presenter first sizzled in an aztec print bikini which featured racy lace-up detailing between the bust and somewhat risqué splits just inches away from her modesty.\nThe partly neon design was the perfect choice to draw attention to Hofit's ample assets and enviably toned torso as she tread the white sands.\nWhile the famed sun-seeker was seen dipping her toes in the crystal clear waters to cool off, she made sure not to get too carried away in a bid to maintain the preened nature of her sleek blonde tresses.\nSizzling! The Israeli socialite showed off her slim curves in not one, but two stunning two-pieces as she cavorted on the beaches of the luxurious Hideaway Beach Resort & Spa\nSending temperatures soaring! The TV presenter first sizzled in an aztec print bikini which featured racy lace-up detailing between the bust and somewhat risqué splits just inches away from her modesty\nPretty in pink: Seemingly keen to show off her extensive bikini collection, it wasn't long before Hofit altered the look with a vivid pink bikini with laser cut detailing\nTrue to form, the social media savvy star made sure she didn't compromise her glamorous image as she sported a fairly heavy make-up look despite the sticky tropical climate.\nReturning to her lavish beach hut later that evening, Hofit opted for a chic cover-up in the shape of a neon kimino which billowed around her feet, which had been slipped into coordinating skyscraper stilettos.\nBut, seemingly keen to show off her extensive bikini collection, it wasn't long before Hofit altered the look with a vivid pink bikini with laser cut detailing.\nThe model has wasted no time boasting to her 86,000 Instagram followers, having shared countless snaps from her idyllic getaway.\nStylish as always: Returning to her lavish beach hut later that evening, Hofit opted for a chic cover-up in the shape of a neon kimino\nGlam: While the famed sun-seeker was seen dipping her toes in the crystal clear waters to cool off, she made sure not to get too carried away in a bid to maintain the preened nature of her sleek blonde tresses\nThe brighter the better! Hofit's pink number was the perfect choice to show off her ample assets and enviably toned torso as she tread the white sands\nUnsurprisingly, the fashion blogger looks to be revelling in her trip as her days are filled with transitioning between her private infinity pool to the island's serene beaches.\nHofit is arguably most well-known for the celebrity company she keeps, though in a previous interview with MailOnline, the stunner was quick to point out that she can't abide many stars because of the egos they carry around, although her close gaggle of gal pals like Kelly and Lindsay can't get enough praise.\nShe said: 'I don't like to name drop. Friends are friends, even if they happen to be famous or royal.\n'But I like low maintenance people - people who have bad energy I walk away from as I don’t react well to egos.\n'Kelly Brook was in Cannes with me and she’s just a ball of laughs and fun. She's so easy going and low maintenance.' she dished.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421248/Israeli-socialite-Hofit-Golan-shows-slim-curves-ample-assets-two-skimpy-bikinis-sizzles-Maldives.html"}
