{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 02:38:04","date_modify":"2018-10-23 02:38:04","date_publish":"2016-01-29 17:11:49","description":"She is frequently seen on London's social circuit.\nBut Hofit Golan continues to defy the British winter by holidaying in the heat of the Maldives - as she proved with another enviable display on Friday.","filename":"data/vaneerConsumption/HofitGolanflauntsherimpressivebikinibodyassheholidaysintheMaldives.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B41A0F00000578-0-image-a-14_1454084670424.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423068_Hofit-Golan-flaunts-impressive-bikini-body-holidays-Maldives_1540262284.html","title":"Hofit Golan flaunts her impressive bikini body as she holidays in the Maldives","title_page":"Hofit Golan flaunts her impressive bikini body as she holidays in the Maldives | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is frequently seen on London's social circuit.\nBut Hofit Golan continues to defy the British winter by holidaying in the heat of the Maldives - as she proved with another enviable display on Friday.\nThe Israeli socialite showed off her slim curves in another stunning two-piece as she cavorted on the beaches of the luxurious Hideaway Beach Resort & Spa.\nScroll down for video\nLife's a beach! Hofit Golan continues to defy the British winter by holidaying in the heat of the Maldives - as she proved with another enviable display on Friday\nClearly enjoying her off-duty break, the TV presenter flaunted her shape - including a taut tummy and ample cleavage - as she splashed around on the shore.\nThe green and pink number was the perfect choice to draw attention to Hofit's assets as she tread the white sands.\nWhile the famed sun-seeker was seen dipping her toes in the crystal clear waters to cool off, she made sure not to get too carried away in a bid to maintain the preened nature of her sleek blonde tresses.\nGood times: Clearly enjoying her off-duty break, the TV presenter flaunted her shape - including a taut tummy and ample cleavage - as she splashed around on the shore\nDoing less is more! True to form, the social media star made sure she didn't break too much of a sweat by sitting back and relaxing in a secluded hammock, which was suspended from a palm tree\nStrutting her stuff: The Israeli socialite showed off her slim curves in another stunning two-piece as she cavorted on the beaches of the luxurious Hideaway Beach Resort & Spa\nTrue to form, the social media star made sure she didn't break too much of a sweat by sitting back and relaxing in a secluded hammock, which was suspended from a palm tree.\nAlso ensuring she didn't get sunburn, the blonde also wrapped up in a semi-sheer kaftan.\nKicking back as she rested her legs, she capped her ensemble with a pair of designer sunglasses.\nThe model has wasted no time boasting to her 86,000 Instagram followers, having shared countless snaps from her idyllic getaway.\nHofit is arguably most well-known for the celebrity company she keeps, though in a previous interview with MailOnline, the stunner was quick to point out that she can't abide many stars because of the egos they carry around, although her close gaggle of gal pals like Kelly and Lindsay can't get enough praise.\nCheeky! The model has wasted no time boasting to her 86,000 Instagram followers, having shared countless snaps from her idyllic getaway\nImage-conscious: While the famed sun-seeker was seen dipping her toes in the sea with a pal, she made sure not to get too carried away in a bid to maintain the preened nature of her sleek blonde tresses\nShe said: 'I don't like to name drop. Friends are friends, even if they happen to be famous or royal.\n'But I like low maintenance people - people who have bad energy I walk away from as I don’t react well to egos. Kelly Brook was in Cannes with me and she’s just a ball of laughs and fun.\n'She's so easy going and low maintenance,' she dished.\nTaking the plunge: Having sunbathed on the beach, Hofit cooled off with a dip in the hotel resort pool\nCutting a shapely figure: The social media star certainly wasn't feeling shy as she holidayed on the island\nToned: The blonde socialite has clearly been working hard to maintain her impressive beach body","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423068/Hofit-Golan-flaunts-impressive-bikini-body-holidays-Maldives.html"}
