{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:32:16","date_modify":"2018-10-30 19:32:16","date_publish":"2016-04-03 00:00:00","description":"Arkansas is fighting for its postseason life as it enters its final home weekend series of the season.","filename":"data/vaneerConsumption/HogsdesperateforHoover.json","image_url":"https://media.arkansasonline.com/img/photos/2016/04/03/Arkansas_Baseball_015_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_may_12__1540927936.html","title":"Hogs desperate for Hoover","title_page":"Hogs desperate for Hoover","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas coach Dave Van Horn talks with players during the eighth inning of a game against Missouri on Sunday, April 3, 2016, at Baum Stadium in Fayetteville. - Photo by Ben Goff\n Arkansas is fighting for its postseason life as it enters its final home weekend series of the season.\nThe Razorbacks (26-21, 7-17 SEC) have seven games remaining, beginning with a three-game series against Alabama that starts Friday at 6:35 p.m. After a midweek game against Missouri State, Arkansas ends the regular season next week with a series at No. 4 Mississippi State.\nThese are must-win series for the Razorbacks, who would be left out of the Southeastern Conference Tournament if the season ended today. Arkansas is in a three-way tie for last place with Missouri and Tennessee.\n“We know what we need to do,” Arkansas coach Dave Van Horn said. “We need to win the (Alabama) series in the worst way.\nDave Van Horn - Alabama Preview Arkansas head coach Dave Van Horn previews the Razorbacks' upcoming series against Alabama. (By Andrew Hutchinson)\n[View Full-Size]\n“You look back on this conference season, it’s been a rollercoaster, but it’s been one that if there’s been a way to give one away or not get one because we don’t make a play, it seems like it’s happened. It’s kind of snowballed a little bit.”\nArkansas, Missouri and Tennessee are all one game behind Auburn and Georgia in the conference standings. Only the top 12 teams in the conference qualify for the SEC Tournament that begins May 24 in Hoover, Alabama.\nThe Razorbacks are in danger of missing the SEC Tournament for the first time since missing an eight-team field in 2008, but the stakes are different this season.\nWhen the Razorbacks didn’t make it eight years ago, they snuck into the NCAA Tournament as a No. 3 seed. With a No. 85 RPI, though, an at-large berth isn't likely in 2016.\nInstead, Arkansas’ route to a 15th straight NCAA Tournament appearance will have to go through the SEC Tournament, which it has never won.\n“We have to get in the SEC Tournament,” Arkansas first baseman Clark Eagan said. “We’re not in it right now, so we have to win a few games and get on track. This is a big series to get a few wins.”\nDespite starting the season 15-3 with three quality wins at the Houston College Classic, Arkansas skidded in SEC play.\nThe Razorbacks have been swept by South Carolina, Ole Miss, Florida and LSU and have won only two series. The stretch included an eight-game conference losing streak, their longest in seven years.\nStill, the players remain confident that their season won’t end at Mississippi State next week.\n“I’d say we’re all a little surprised with the way the season has gone, but it’s never too late to turn it around,” Eagan said. “We’re just going to keep scrapping…and things are going to turn around.”","url":"https://www.arkansasonline.com/news/2016/may/12/hogs-desperate-hoover/"}
