{"authors":["Bob Holt"],"date_download":"2018-10-30 19:27:31","date_modify":"2018-10-30 19:27:31","date_publish":"2015-09-13 00:00:00","description":"Toledo's 16-12 victory over Arkansas Saturday in Little Rock -- which knocked the Razorbacks from No. 18 out of The Associated Press Top 25 poll -- to many fans may have seemed eerily similar to a loss to Louisiana-Monroe three years ago.","filename":"data/vaneerConsumption/Hogsdazedundeterredbyloss.json","image_url":"https://media.arkansasonline.com/img/photos/2015/09/13/UA_vs_TOLEDO_FB_JI_006_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_sep_14_hogs-dazed-undeterred-by-loss-20150914__page=1_1540927651.html","title":"Hogs dazed, undeterred by loss","title_page":"Hogs dazed, undeterred by loss","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas junior tight end Hunter Henry (left) and sophomore wide receiver Damon Mitchell leave the field on Saturday, Sept. 12, 2015, following the Razorbacks' 16-12 loss to Toledo at War Memorial Stadium in Little Rock. - Photo by Jason Ivester\nToledo's 16-12 victory over Arkansas Saturday in Little Rock -- which knocked the Razorbacks from No. 18 out of The Associated Press Top 25 poll -- to many fans may have seemed eerily similar to a loss to Louisiana-Monroe three years ago.\nArkansas was ranked No. 8 nationally when Sun Belt Conference member Louisiana-Monroe, a 30-point underdog, beat the Razorbacks 34-31 in overtime Sept. 8, 2012 on the same War Memorial Stadium field where 21-point underdog Toledo pulled its upset.\nThe loss to the Warhawks started the Razorbacks on a downward spiral in 2012 that ended with a 4-8 record and resulted in Coach Bret Bielema being hired from Wisconsin to replace interim Coach John L. Smith.\nThe 2015 Razorbacks (1-1) opened this season nationally ranked for the first time since the Louisiana-Monroe loss with the pieces seemingly in place for an SEC West title run in Bielema's third season.\nWhat now?\nDoes another shocking Little Rock loss in the second game -- this time to a team from the Mid-American Conference -- derail the Razorbacks' season?\nArkansas senior quarterback Brandon Allen came off the bench against Louisiana-Monroe as a redshirt freshman after starter Tyler Wilson sustained a concussion.\nAllen said after the Toledo game he didn't have flashbacks to Louisiana-Monroe.\n\"This team is different from that team,\" Allen said. \"This team's got a lot of leaders on it.\n\"This game won't turn into a spiral for the rest of the season. I won't let it. A lot of people on this team won't let it.\n\"We'll get ready to play next week and do what we can to win that game.\"\nArkansas' next game is Saturday at 6 p.m. in Fayetteville against a 2-0 Texas Tech team, which beat Texas-El Paso 69-20 while the Razorbacks were losing to Toledo.\nThat's the same UTEP team Arkansas beat 48-13 to open the season.\n\"Nobody's going to be more ready to play us than Texas Tech this coming Saturday,\" Bielema said.\nThe Razorbacks hit the road after playing Texas Tech, with games against Texas A&M in Arlington, Texas, and at Tennessee and Alabama.\n\"We're going to have all kinds of different people for all different reasons firing shots at us,\" Bielema said. \"We've got to dig ourselves into our fox hole.\n\"The only ones who can battle ourselves out of there is ourselves.\"\nAllen is among eight seniors on the Razorbacks' depth chart and one of six in the program for five seasons.\n\"I know this team,\" Allen said. \"We have our minds right. This isn't going to affect the rest of the season.\n\"There's no quit. This is one game. We've got 10 more. We'll be ready for Texas Tech.\"\nFifth-year senior safety Rohan Gaines said the Razorbacks are remaining positive.\n\"I've been down this road before being here for a long time, and I know it can go one of two ways,\" Gaines said. \"I feel like with the leaders that we have on this team, it can go up from here.\"\nCenter Mitch Smothers, another fifth-year senior, said the Razorbacks have to learn from the Toledo loss, but can't dwell on it.\n\"We're not going to let this game ruin our season,\" Smothers said. \"We're not going to let it carry over into next week.\n\"We've got to have the 1-0 mentality that Coach always talks about. We're going to come back and be better.\"\nThe Toledo game reminded Bielema of another loss one of his teams suffered against a MAC opponent 12 years ago.\nBielema was Kansas State's co-defensive coordinator when Marshall beat No. 6 Kansas State 27-20 Sept. 20, 2003.\nBielema brought up that Kansas State loss to the Razorbacks after the Toledo game.\n\"I told the team this, and I mean this with everything,\" Bielema said. \"It's not a conference loss. If there's a silver lining in any of it, that's there.\"\nThe 2003 Kansas State team recovered to finish 11-4 and win the Big 12 championship with a 35-7 victory over Oklahoma.\n\"That 1-0 mentality, everyone wants to talk about it when you're rolling, but it's really designed in rough times,\" Bielema said. \"It's designed for when you don't win and you've got to focus on that next opportunity.\"\nSports on 09/14/2015","url":"https://www.arkansasonline.com/news/2015/sep/14/hogs-dazed-undeterred-by-loss-20150914/?page=1"}
