{"authors":[],"date_download":"2018-10-23 01:06:18","date_modify":"2018-10-23 01:06:18","date_publish":"2017-03-10 08:43:10","description":"Trevor Hohns was named as the chairman of Australia's cricket selectors on Friday after steadying the ship as caretaker chief following a string of defeats...","filename":"data/vaneerConsumption/HohnsnamedasAustraliachiefcricketselector.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195089-1489138392-146_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300388_Hohns-named-Aussie-chief-cricket-selector_1540256778.html","title":"Hohns named as Australia chief cricket selector","title_page":"Hohns named as Australia chief cricket selector | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Trevor Hohns (L) speaking with Australia cricket captain Steve Smith (C) and chief coach Darren Lehmann\nTrevor Hohns was named as the chairman of Australia's cricket selectors on Friday after steadying the ship as caretaker chief following a string of defeats last year.\nHohns, who took over as caretaker chairman when Rod Marsh quit following an embarrassing home series defeat to South Africa, joins Greg Chappell, Mark Waugh and coach Darren Lehmann on the four-man panel.\nCricket Australia said the panel had also been restructured with Hohns, Chappell and Lehmann focusing on Test and one-day selection, with Waugh and Lehmann picking the Twenty20 squads.\n\"It's certainly exciting and going to be challenging going forward for us,\" Hohns, who is contracted until February, 2020, told the Cricket Australia website.\n\"I think it certainly makes sense to separate the T20 format of the game from the others because we are, in effect, trying to increase our performance in that format and also our ranking... so it does make sense to have a little bit of a split panel in that area.\"\nThe rejig follows a slump last year when Australia lost all three Tests in Sri Lanka and were thrashed twice at home by South Africa.","url":"https://www.dailymail.co.uk/wires/afp/article-4300388/Hohns-named-Aussie-chief-cricket-selector.html"}
