{"authors":[],"date_download":"2018-10-30 21:49:34","date_modify":"2018-10-30 21:49:34","date_publish":"2016-12-23 19:41:00","description":"The holiday hooligans are on the loose.","filename":"data/vaneerConsumption/HolidayhooligansgetboldermorebrazenasChristmasnears.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/23/Images/newsEngin.17241470_dekalb-burglar.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_holiday-hoo_43f7f99730cf2a43c08b9338bb5f8c90__1540936174.html","title":"Holiday hooligans get bolder, more brazen as Christmas nears","title_page":"Holiday hooligans get bolder, more brazen as Christmas nears","title_rss":"NULL","source_domain":"ajc.com","text":"The holiday hooligans are on the loose.\nIt’s the season of fulfilling children’s wishes, of family gatherings and overindulgence on sweet treats and shiny toys. But the magic of the season is wiped away in an instant when holiday criminals go to work. They steal packages from front porches, gifts from under Christmas trees, electronics and jewelry from major retailers. They even steal the Salvation Army’s kettles.\nIn Barrow County, two burglars used a top-down approach at a Target store located, fittingly, in the little town of Bethlehem.\n“They cut a hole in the roof at around 1:50 in the morning and dropped down into the restroom area,” Capt. Ryan Sears with the Barrow Sheriff’s Office said.\nOnce inside the store, the two went first to the ATM, which they broke into with a sledgehammer and crowbar, swiping a still-undetermined sum of cash, Sears said.\nIn Cobb County, a Salvation Army bell ringer needed a break and placed his red kettle inside store, behind the customer service counter. But when he went back to retrieve the kettle, it was gone.\n“They looked at surveillance video and found that someone had reached over and walked right out the door with it,” Salvation Army Capt. Chris Powell said.\nFor some holiday criminals, a simple cardboard box left outside is all that’s needed, except maybe a getaway car.\n“There is a Grinch going around the neighborhoods all over taking packages from peoples’ doorsteps,” Atlanta police officer Lukasz Sajdak said. “At this time we could not say if this is one particular person and would not call it a trend specific to our area as this seems to be going on all over.”","url":"https://www.ajc.com/news/crime--law/holiday-hooligans-get-bolder-more-brazen-christmas-nears/TRTjZRdWBaZr21OpCcEHMK/"}
