{"authors":["Jasmin Sahota For Mailonline"],"date_download":"2018-10-23 01:27:21","date_modify":"2018-10-23 01:27:21","date_publish":"2017-03-16 11:28:19","description":"The TV presenter, 36,shed her wholesome image as she flaunted her fabulous frame in a saucy Instagram snap on Wednesday afternoon.","filename":"data/vaneerConsumption/HollyWilloughbyparadespinsinCelebrityJuiceteaser.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E535D8B00000578-0-image-a-27_1489659144449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319584_Holly-Willoughby-parades-pins-tiny-dress-saucy-snap_1540258041.html","title":"Holly Willoughby parades pins in Celebrity Juice teaser","title_page":"Holly Willoughby parades pins in Celebrity Juice teaser | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's usually dressed to impress in demure ensembles across her many TV hosting gigs.\nBut Holly Willoughby shed her wholesome image as she flaunted her fabulous frame in a saucy Instagram snap on Wednesday afternoon.\nThe TV presenter, 36, gave an eyeful of her tanned and toned pins as she donned a figure-hugging black frock while posing up a storm for the camera.\nScroll down for video\n'Such naughtiness coming your way': Cheeky Holly Willoughby shed her wholesome image as she paraded her perfect pins while teasing cheeky Celebrity Juice scenes\nReady to film the latest series of Celebrity Juice, the mum-of-three posed with a hand on her hip as she teased the upcoming episodes will be full of 'naughtiness'.\nThe blonde beauty - nicknamed Holly Willoughbooby - opted for a tight black dress which hugged her perfectly proportioned curves in all the right areas.\nFeaturing a plunging neckline, the This Morning host teased a slight glimpse of her famous assets as she ensured her long and lithe legs were on full display.\nHolly added inches to her height thanks to a pair of strappy black stilettos, but kept her accessories simple with elegant stud earrings.\nClassy: The presenter's snap is a far cry from her usual demure outfits, often seen wearing pencil skirts and high neck blouses for her stint on This Morning\nIt's back! Holly, who has starred in Celebrity Juice since 2008, teased the latest series was full on 'naughtiness'\nShe captioned the snap: 'We are back!!! @celebjuiceofficial... such naughtiness coming your way soon!'\nThe Play To The Whistle presenter's snap is a far cry from her usual demure outfits, often seen wearing pencil skirts and high neck blouses for her stint on This Morning.\nHolly was recently left mortified after her long-term pal Jake Humphrey confessed the pair once 'shared a bed' in their twenties.\nAppearing on the latest episode of Play To The Whistle, the comedian outrageously joked that they slept together 15 years ago, leaving Holly in fit of laughter.\nExplaining the situation further, Holly said: 'Jake and I have actually known each other for a very long time.\nOld friends: Holly was recently left mortified after her long-term pal Jake Humphrey confessed the pair once 'shared a bed' in their twenties\n'In fact we first worked together in 2002 for Fame Academy on CBBC. I used to stay around your house because I hadn't even moved to London.\n'So I was living in Brighton and you had a lovely flat and I'd come up and stay with you.'\nHolly collected three awards during the annual TRIC awards earlier this week, where she dazzled the crowd in a monochrome midi-dress.\nShe took home trophies for Daytime Programme gong as host of This Morning, Satellite Digital Programme for her panelist part on Celebrity Juice and the Television Personality Award.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319584/Holly-Willoughby-parades-pins-tiny-dress-saucy-snap.html"}
