{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:53:20","date_modify":"2018-10-30 18:53:20","date_publish":"2016-04-20 15:58:48","description":"With the success of Uber — and the prevalence of people using the ride-sharing company to get around — it was only natural that Hollywood would get in on the action. | Entertainment","filename":"data/vaneerConsumption/HollywoodStudiosBuyCompetingComedyScriptsSetAroundUber.json","image_url":"https://media.breitbart.com/media/2016/04/Ferrell.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_04_20__1540925600.html","title":"$$$ Hollywood Studios Buy Competing Comedy Scripts Set Around Uber","title_page":"$$$ Hollywood Studios Buy Competing Comedy Scripts Set Around Uber | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With the success of Uber — and the prevalence of people using the ride-sharing company to get around — it was only natural that Hollywood would get in on the action.\nUnfortunately for Universal and Fox, both major studios unwittingly offered up loads of cash for comedy scripts about Uber drivers within the same 24-hour period, according to The Hollywood Reporter.\nThe industry site reports Fox paid “mid-six figures” for the comedy Stuber, which is set during one night in the life of an Uber driver who picks up “a grizzled cop working the most dangerous case of his career.”\nUnbeknownst to Fox, the Tripper Clancy authored script will be competing with a comedy that is attached to Will Ferrell, and was purchased by Universal for seven figures just a day before.\nThe Universal project, which is still unnamed, will star Ferrell as an Uber driver “stuck with a deranged escaped-convict passenger.”\nSources close to the deals told The Hollywood Reporter both film studios were unaware of the other’s Uber project at the time of bidding.\nUnited Talent Agency was behind the sale of both projects, which occurred earlier this month.\nTHR reports both Fox and Universal are feeling nervous about competing to get to the box office, but Fox may have a leg up, as Stuber’s script is completed and the project is seeking talent.\nFerrell’s Uber project, meanwhile, is still being written by Brendan O’Brien, who co-wrote Neighbors and its upcoming sequel, Neighbors 2: Sorority Rising.","url":"https://www.breitbart.com/entertainment/2016/04/20/hollywood-studios-rush-buying-competing-comedies-set-around-uber-drivers/"}
