{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-22 22:06:52","date_modify":"2018-10-22 22:06:52","date_publish":"2017-03-10 00:18:04","description":"Darcy's disappearance has started to irk Hollyoaks' Maxine beyond frustration.","filename":"data/vaneerConsumption/HollyoaksMaxineinvestigatesDarcysdisappearance.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/16/3E1A31B200000578-0-image-a-36_1489076036287.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4298000_Hollyoaks-Maxine-investigates-Darcy-s-disappearance_1540246012.html","title":"Hollyoaks' Maxine investigates Darcy's disappearance","title_page":"Hollyoaks' Maxine investigates Darcy's disappearance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Darcy's disappearance has started to irk Hollyoaks' Maxine beyond frustration.\nAnd over the course of the forthcoming week on the E4 soap her desperation to uncover the truth about Adam’s missing ex reaches it's peak.\nBut Maxine will get more than she bargained for in her hunt for the truth.\nScroll down for video\nAmateur sleuth: Maxine takes it upon herself to investigate Darcy's disappearance... and risks finding out more than she bargained for\nPlaying detective: Darcy's disappearance has started to irk Hollyoaks' Maxine beyond frustration\nDarcy has been presumed dead since she went missing from a cruise ship but is still a spectre that is hanging over Maxine and Adam’s blossoming relationship.\nAware that her fiancé is struggling to move on, Maxine is determined to get to the bottom of the unsolved case and follows a lead to a café where a girl called Rebecca allegedly has more information.\nBut it's a dead end, as Rebecca can’t help her; but back at home, Maxine figures out that Rebecca could be keeping important information back from her, and goes back to speak with her, this time taking Adam’s mum, Tracey.\nActress Nikki Sanderson (Maxine) has spoken about why Maxine is so motivated to find Darcy and why she’s worried that she might unearth more than she wanted.\nDesperate to know: But Maxine will get more than she bargained for in her hunt for the truth\nHunting for answers: And over the course of the forthcoming week on the E4 soap her desperation to uncover the truth about Adam’s missing ex reaches it's peak\nShe wants the truth: Darcy has been presumed dead since she went missing from a cruise ship but is still a spectre that is hanging over Maxine and Adam’s blossoming relationship\nDo you know where she is? Aware that her fiancé is struggling to move on, Maxine is determined to get to the bottom of the unsolved case and follows a lead to a café where a girl called Rebecca allegedly has more information\n'She wants closure for Adam, she wants that chapter to be well and truly done and finished,' she told Channel 4. 'And until they get closure on Darcy and what happened to her, there’s always a little bit of Darcy hanging in the background of Maxine and Adam’s relationship.\n'She's nervous about it but she’s more focused on getting rid of her than bringing her back.'\nElsewhere, Nick - who was caught by Holly with a sexy video of an ex-girlfriend on his phone - has asked her to shoot a video with him beneath the sheets.\nDead end? Maxine figures out that Rebecca could be keeping important information back from her, and goes back to speak with her, this time taking Adam’s mum, Tracey\nThe plot thickens: Maxine is so motivated to find Darcy and is worried that she might unearth more than she wanted\nGiven that Holly was uncomfortable with this, Nick decides to film them having sex at The Loft office, but without her consent.\nMeanwhile, Scott returns to the village to the news that John Paul has left and immediately plans a holiday to go and visit him.\nHowever, he makes a foolish error when he books business class flight tickets on James Nightingale’s credit card and the confirmation is sent to James.\nViewers can tune in to these episodes from tonight (Friday 10 March) on E4 at 7pm.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4298000/Hollyoaks-Maxine-investigates-Darcy-s-disappearance.html"}
