{"authors":["Associated Press"],"date_download":"2018-10-23 00:36:12","date_modify":"2018-10-23 00:36:12","date_publish":"2016-01-11 10:07:45","description":"BEVERLY HILLS, Calif. (AP) — Sean Penn was a hot topic at the Golden Globes, even though the actor didn't attend. His exploits in pulling off a clandestine i...","filename":"data/vaneerConsumption/HollywoodstunnedbySeanPennssecretvisitwithdruglord.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:2be7f9ccbf1045a5be45e5b4cc7c9948-56CX32zFKLb7123928b84cd2efb3-442_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393616_Hollywood-stunned-Sean-Penns-secret-visit-drug-lord_1540254972.html","title":"Hollywood stunned by Sean Penn's secret visit with drug lord","title_page":"Hollywood stunned by Sean Penn's secret visit with drug lord | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hollywood stunned by Sean Penn's secret visit with drug lord\nBEVERLY HILLS, Calif. (AP) — Sean Penn was a hot topic at the Golden Globes, even though the actor didn't attend. His exploits in pulling off a clandestine interview with a Mexican drug kingpin shocked Hollywood.\nHost Ricky Gervais didn't waste any time taking a poke at Penn with his first joke Sunday night. He kidded he wanted to get through his monologue and go into hiding — somewhere even Penn couldn't find him.\nPenn conducted an interview with Joaquin \"El Chapo\" Guzman for Rolling Stone magazine and wrote an essay. It was published late Saturday, a day after the drug lord's recapture in Mexico.\nIn this image released by NBC, Ricky Gervais hosts the 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, Calif., on Sunday, Jan. 10, 2016. (Paul Drinkwater/NBC via AP)\nMatt Damon, a Globe winner for actor in a comedy or musical, said backstage that Penn's adventure was nothing new.\n\"I know a lot of very serious actors and filmmakers who have been having meetings like this forever, and writers for that matter,\" he said, declining to name names. \"It's part of what we do to do our job really well.\"\nMexican authorities said Penn's contacts with Guzman helped them track the fugitive down — even if he slipped away from an initial raid on the hideout where the actor apparently met him in October.\nIn the article, Penn wrote of elaborate security precautions surrounding his visit.\nActor and fellow Santa Monica High School alum Rob Lowe joked about Penn's secret trip on the red carpet before the Globes.\n\"Santa Monica High alumni get things done. We get nominated for Golden Globes, we help apprehend international drug fugitives, because that's what we're taught at Santa Monica High,\" Lowe said.\nBrazilian actor Wagner Moura wasn't so sure it was a good idea for Penn to venture to the jungles of Mexico to meet with Guzman.\n\"Isn't that crazy?\" asked Moura, who portrays drug lord Pablo Escobar on the television series \"Narcos.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393616/Hollywood-stunned-Sean-Penns-secret-visit-drug-lord.html"}
