{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 01:47:25","date_modify":"2018-10-23 01:47:25","date_publish":"2016-01-29 15:54:14","description":"A Dutch squadron of six F-16 fighter jets is already\nstationed in the region, but was so far been limited to striking positions held by the extremists in Iraq.","filename":"data/vaneerConsumption/HollandannouncesitsjetswillbeginbombingISIStargetsinSyria.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B449AD00000578-0-image-a-57_1454086693141.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422954_Dutch-jets-bomb-Islamic-State-targets-Syria_1540259245.html","title":"Holland announces its jets will begin bombing ISIS targets in Syria","title_page":"Holland announces its jets will begin bombing ISIS targets in Syria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Holland has announced plans for its jets to start bombing ISIS targets in Syria as part of the US-led coalition.\nA Dutch squadron of six F-16 fighter jets is already stationed in the region, but was so far been limited to striking positions held by the extremists in Iraq.\nThe aircraft will now be active over Syria until July 1, targeting ISIS insurgent operations and training camps, Dutch Prime Minister Mark Rutte said.\nHolland has announced plans for its jets to start bombing ISIS targets in Syria as part of the US-led coalition. Two F-16 fighter jets from the Dutch Air Force land during a drill in Amsterdam this week\nISIS's bombing and shooting attacks on Paris that killed 130 people in November had already led France and Britain to step up their bombing campaigns in Syria and Iraq.\n'We have decided to heed the call of our allies for expansion of the operational area of our F-16s to the east of Syria to further weaken ISIS's supply lines and ability to advance,' Rutte said, using another of Islamic State's acronyms.\n'Only by taking away ISIS's safe havens in Iraq and Syria can we prevent more attacks.'\nThe Netherlands is also considering providing more military equipment and training to Iraqi soldiers battling the militants.\nIt will fund moderate, armed Syrian opposition groups and assist the reconstruction of schools and hospitals, the statement said.\nA Dutch squadron of six F-16 fighter jets is already stationed in the region, but was so far been limited to striking positions held by the extremists in Iraq\nThe aircraft will now be active over Syria until July 1, targeting ISIS insurgent operations and training camps, Dutch Prime Minister Mark Rutte (pictured) said\nDefence Minister Jeanine Hennis-Plasschaert said the decision means the coalition will 'make more progress' against ISIS.\nExtending the military operation became possible when the Dutch Labour Party, junior partner in the coalition government, said this week it was open to the idea, creating a parliamentary majority for it.\nForeign military interventions are especially sensitive in the Netherlands, which led a disastrous U.N. peacekeeping mission in Bosnia in 1995 during which 8,000 Muslim men and boys were massacred by Serb forces.","url":"https://www.dailymail.co.uk/news/article-3422954/Dutch-jets-bomb-Islamic-State-targets-Syria.html"}
