{"authors":[],"date_download":"2018-10-30 00:55:38","date_modify":"2018-10-30 00:55:38","date_publish":"2014-09-02 08:00:00","description":null,"filename":"data/vaneerConsumption/HollandesLastChance.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/09/396496974_f853505da8_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860938.html","title":"Hollande's Last Chance","title_page":"Hollande's Last ChanceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Maybe the third try will be a charm for President François Hollande. After doggedly attempting to apply socialist dogma for his first two disastrous years in office and bringing the French economy to its knees, he reshuffled his cabinet again this summer. It has dawned even on this Socialist Party apparatchik that governing by tax-and-spend while subjecting businesses to an incomprehensible thicket of hostile, hobbling regulations—the Labor Code now runs to over 3,000 pages—won’t work. That inventing a new levy here, tweaking an old one there, creating still another special handout, is ruining not only his term in office, but the country as well. His third stab at forming a viable administration, coming only 147 days after the second one, set a record for the shortest duration in Fifth Republic history and makes the Italian government look rock-stable by comparison. The sweat on the beleaguered presidential brow is now visible to all.\nThe auguries were bad from the start. The feckless Hollande has been jinxed ever since he was inauspiciously drenched by a downpour during his inaugural parade, after which his presidential plane was improbably struck by lightning a few hours later. Even his private life has been unlucky since accidentally becoming president thanks to the spectacular downfall of the party’s frontrunner, Dominique Strauss-Kahn. Only months after he set up a new official mistress in the Élysée Palace, a testy journalist whom the French found obnoxious, he was embarrassingly caught by photographers sneaking out for a bit of late-night tomcatting with a second-rate actress. The poor man visibly gained weight in office, becoming paunchy and pudgy, reportedly due to overeating as compensation for his troubles.\nHis obvious inadequacies produced the dismal situation that is today’s France: a president with a historically low approval rating of 17 percent, mocked as ineffectual by everyone from satirical TV shows to the janitor at my local gym; unemployment at an all-time high of 11 percent and rising; flatlining growth with 80 percent of the country expressing no confidence in his economic policies; France’s best and brightest fleeing to countries like the U.S. and Britain where success is applauded, not punished with a 75 percent tax rate. On top of it all, he is being nagged by the Eurocrats in Brussels, seconded by Europe’s de facto boss, German Chancellor Angela Merkel, to meet EU fiscal targets with an austerity program of reduced public spending and still higher taxes. As Le Monde editorialized, the cabinet reshuffle was “the last chance for the president to save his five-year term.”\nThe irony of France’s latest crisis is that it comes just as Hollande was trying for an urgent course correction by adopting a more center-right, business-friendly approach à la Tony Blair’s New Labour in Britain 20 years ago. This provoked open revolt by hard-left parliamentarians of his own Socialist Party. The rebellion was led by his economics minister, Arnaud Montebourg, a tousled, 51-year-old lawyer by trade. Montebourg has been staking out his turf for a run at the 2017 presidential election, presumably against Hollande himself, by claiming the socialist high ground of more redistribution of wealth to stimulate consumption and protectionist, anti-business industrial policy, along with the predictable end to deficit-cutting and austerity. As part of his schtick he rails against “the diktats of Brussels” and the disciplined fiscal policies of “Chancellor Angela Bismarck.” (To make his point, he quotes that American guru of social-democratic redistribution, Paul Krugman.) With Montebourg’s line being followed by some fifty socialist members of parliament known as les frondeurs, or rebels, Hollande saw his parliamentary base shredding and his tattered authority threatened.\nAfter purging his entire cabinet, he required its members, in the name of “coherence,” to pledge fealty to him individually before being reinstated. Montebourg and two others were excluded. In moves certain to further divide parliament and French public opinion, he thumbed his nose at socialist left-wingers by appointing a former Rothschild investment banker as economics minister, and further alienated the right by keeping the two most provocative ministers of his previous government: the aggressively feminist ideologue Najat Vallaud-Belkacem who, as minister of women’s rights, promoted homosexual marriage and gender studies and now as education minister can inculcate those causes as early as elementary school; and Christiane Taubira, the justice minister who rammed through a liberal penal reform that police and magistrates say will make it even harder to control France’s burgeoning crime wave.\nWhether Hollande’s divisive appointments were calculated or merely clumsy is imponderable, but what is certain is that France is now in the midst of a serious crise de régime. The crisis of confidence cuts through the heart of his parliamentary majority, which will make it difficult if not impossible to get his new center-right program through the National Assembly and Senate. Already opposition leaders, not least National Front leader Marine Le Pen, are clamoring for the lower house to be dissolved and new elections held. Prime Minister Manuel Valls, the pugnacious son of Spanish immigrants, now is all that stands between Hollande and disaster. In a desperate U-turn from Hollande’s campaign declaration that finance was his enemy, Valls has suddenly launched a neo-conservative charm offensive. “Entrepreneurs, France needs you,” he declares. “I love business.” He promises to hold a vote of confidence on the government’s program this month or next. “There can be no other way,” he threatens. “If the majority isn’t there, we would be finished.”\nThe latter is a distinct possibility. Change comes hard in France, and its Socialist Party is unlikely to renounce its moss-backed, nineteenth-century ideology overnight. As Le Figaro says, “The French Socialist Party remains the last of its kind in the world to believe that work is alienating, business profits are scandalous, growth can be bought with public money, and employment created with government jobs.” One big weekly magazine put it more succinctly. Splashed over a cover photo of a harassed-looking Hollande, glasses fogged with rain, were the bold-faced words, “Death Throes.”","url":"https://spectator.org/60335_hollandes-last-chance/"}
