{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:13:50","date_modify":"2018-10-30 19:13:50","date_publish":"2015-04-09 11:15:42","description":"Hollywood is Swinging Hard for Trans-Pacific Partnership","filename":"data/vaneerConsumption/HollywoodisSwingingHardforTransPacificPartnership.json","image_url":"https://media.breitbart.com/media/2015/04/Dodd-Obama-Jeremiah-Roth-Flickr-CC.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_09__1540926830.html","title":"Hollywood is Swinging Hard for Trans-Pacific Partnership","title_page":"Hollywood is Swinging Hard for Trans-Pacific Partnership","title_rss":"NULL","source_domain":"breitbart.com","text":"Hollywood moguls and the vast majority of leftist entertainers have joined forces in a last-ditch effort to bully wavering Democratic lawmakers into backing President Obama’s fast-track authority for the Trans-Pacific Partnership (TPP) as the centerpiece of what he calls his “pro-trade agenda.”\nTPP is so controversial that the Administration has refused to show anyone the document. But what it does do is “trade” the right for U.S. entertainment interests to gain lucrative enhanced-copyright protections with 12 nations, in exchange for the elimination of all tariffs that punish unfair business practices.\nTwo weeks ago, former Senator Christopher J. Dodd, who now heads the Motion Picture Association of America, wrote to his members to explain that TPP is a pro-trade measure that will be a “driver for a stronger middle class.” Dodd claims the still-secret TPP would not only end tariffs, but would also reduce non-tariff trade barriers against the “free movement” of intangible services, investments, public projects and intellectual property.\nThis week, Dodd followed up by enlisting six former Democratic National Committee chairs to urge Democrats to support handing Obama fast-track trade-promotion authority that would ban any amendments and limit Congress to only 90 days of review and 20 hours of debate before being required to make an up-or-down vote.\nWikileaks disclosed in October that the still secret Trans-Pacific Partnership is 77-pages long, contains 30,000 words and involves 40 percent of the world’s economy. But only five of the 29 chapters contain provisions that are directly related to trade. The other two dozen chapters amount to a “partnership” for corporate protectionism. They create sweeping new “rights” and escape hatches to protect multinational corporations from government accountability.\nDespite the secrecy from the public surrounding the TPP negotiations, Wikileaks described how executives of selective “cashed-up megacorps” that are dominating the wording of the trade deal are bestowing upon themselves extraordinarily favorable protections for digital rights, pharmaceuticals and patents.\n“If you read, write, publish, think, listen, dance, sing or invent; if you farm or consume food; if you’re ill now or might one day be ill, the TPP has you in its crosshairs,” according to WikiLeaks.\nEgregious TPP provisions drafted for the entertainment industry would extend international copyright “protections” beyond the current standard of the author’s “life-plus-50-years” to 120 years. The treaty also undermines the “formalities” of registering copyrights by granting “unpublished works” protections.\nWhen the World Trade Organization (WTO) treaty was passed in 1995 under fast-track, Congress was only allowed 90 days to review the bill’s 60 separate sections and tens of thousands of pages, before making an up-or-down vote after only 20 hours of debate and no right to introduce amendments. Despite being at least as complex as Obamacare, few members of Congress read the treaty or had the expertise to understand the breadth of its true intentions.","url":"https://www.breitbart.com/entertainment/2015/04/09/hollywood-swinging-hard-for-trans-pacific-partnership/"}
