{"authors":["Paul Miller"],"date_download":"2018-10-30 18:35:40","date_modify":"2018-10-30 18:35:40","date_publish":"2015-07-13 17:45:01","description":"When Irving Roth walked out of the Auschwitz concentration camp in April 1945, he was thankful that he would live to see his 16th birthday.","filename":"data/vaneerConsumption/HolocaustSurvivorComparesBDSTacticstoNaziPropaganda.json","image_url":"https://media.breitbart.com/media/2015/07/holo-survivor.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_13__1540924540.html","title":"Holocaust Survivor Compares BDS Tactics to Nazi Propaganda","title_page":"Holocaust Survivor Compares BDS Tactics to Nazi Propaganda","title_rss":"NULL","source_domain":"breitbart.com","text":"When Irving Roth walked out of the Auschwitz concentration camp in April 1945, having watched in horror as members of his family were marched into the gas chamber upon their arrival the previous year, he was thankful that he would live to see his sixteenth birthday.\nFor decades, Roth has shared his experiences for audiences of all ages and backgrounds so the world will never forget.\nOn Sunday morning his audience consisted of over 500 college students gathered in Washington, D.C. for the 10th annual Christians United For Israel (CUFI) Summit.\nWhile the conference doesn’t officially begin until Monday morning, students from across the country arrived a day early for special programming geared toward combating anti-Semitism on college campuses.\nAfter a morning religious service, Roth was introduced to the attendees by David Walker, National Campus Coordinator for CUFI. Walker, an African-American, referred to the 85-year old as his “Jewish grandfather.”\nAs Roth took the stage, he was met with thunderous applause. He began his speech with a brief history lesson about the struggles of the Jewish people, starting “back when God gave to Abraham that land [Israel].”\n“After heartbreak, after anti-Semitism, after the destruction of 6 million human beings, the Jewish State is born. The day Israel was born, six armies attacked Israel,” explained Roth. “Miraculously, my friends, the Jewish people managed to survive.”\nRoth continued, “Year after year, decade after decade, the people whose mantra is the destruction of the Jewish State and the Jewish people, have not managed to do it through war,” referring to the current campaign portraying Israel as an “apartheid state” and the surge in anti-Semitic activity on college campuses as “stage 3” of their efforts to destroy the Jewish State and the Jewish people.\nRoth occasionally employed sarcasm to mock the suggestion that Israel is an apartheid state, citing examples of the freedoms enjoyed by all Israeli citizens – regardless of religion or ethnicity. He took world critics to task for vilifying Israel for defending her citizenry during last year’s war with Hamas in Gaza. He ridiculed the United Nations who played dumb when rockets were found stored in their schools, pretending that no one knew where they had come from.\nHe quoted U.S. General and current Chairman of the Joint Chiefs of Staff Martin E. Dempsey, “The IDF [Israel Defense Forces] has taken extraordinary measures to try to limit civilian casualties.” But Israel’s humanitarian efforts do not matter, explained Roth, “because everything they do is ‘apartheid.’ ”\nThe students also received a history lesson on Palestinian leadership and why so many of their people live in “poverty.”\n“Remember this fellow who used to be their chief – Yasser Arafat – remember him? An engineer by profession, just like me, he never worked a day in his life, and he dies, leaving a billion dollars and a multi-million-dollar villa outside of Paris for his wife and family. Money allocated for a Palestinian economy, he pocketed.”\nRoth reached back in his past to explain the anti-Israel Boycott, Divestment and Sanctions (BDS) movement. “The people organizing BDS against Israel are out of their minds,” he said. “In fact, what they’ve done is straight out of the playbook of a fellow by the name of Joseph Goebbels. Remember him? The Minister of Propaganda for Nazi Germany. They are using the same identical materials.”\nRoth added, “This is what BDS is all about. They want the destruction of the Jewish people, they want the destruction of the Jewish State.”\nRoth received a standing ovation.\nI met up with him immediately after his presentation and asked him how long he had been speaking about BDS and his experiences. “From the very beginning,” he replied, “because I speak of the Holocaust which is really the same idea, the destruction of the Jews. The Nazis made up lies, the BDS movement repackaged it, and it continues. My purpose is for people to understand what is happening today, the reality of what was happening 70 to 80 years ago, and compare the two. They will see that it’s pretty much the same because it was a step-by-step process beginning with, ‘I don’t like you. And don’t go to my swimming pool and don’t go to my school,’ and eventually leading to murder.”\nRoth concluded, “I call those, sign posts along the road to Auschwitz. I’m saying today, I’m seeing the same sign posts along the road to the destruction of the Jewish people.”","url":"https://www.breitbart.com/national-security/2015/07/13/holocaust-survivor-compares-bds-tactics-to-nazi-propaganda/"}
