{"authors":["Daniel Martin Chief Political Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:26:49","date_modify":"2018-10-22 20:26:49","date_publish":"2016-01-28 01:18:02","description":"The Prime Minister gave details of the tribute, to be built in Victoria Tower Gardens next to the Palace of Westminster as he marked Holocaust Memorial Day (pictured, the Soviet War Memorial)","filename":"data/vaneerConsumption/HolocaustmemorialtobeerectedbesideParliamentbytheendof2017.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A1676600000578-0-image-a-13_1453943709507.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420242_50m-memorial-Holocaust-Monument-erected-Parliament-end-year-design-chosen-competition_1540240009.html","title":"Holocaust memorial to be erected beside Parliament by the end of 2017","title_page":"Holocaust memorial to be erected beside Parliament by the end of 2017 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A memorial to the victims of Nazi atrocities is to be erected beside Parliament, David Cameron has said.\nThe Prime Minister gave details of the scheme as he marked Holocaust Memorial Day at question time in the Commons.\nIt is to be put up in Victoria Tower Gardens, alongside the Thames next to the Palace of Westminster, and would 'show the importance Britain places on preserving the memory of the Holocaust', he told MPs.\nA memorial to the victims of Nazi atrocities is to be erected beside Parliament, David Cameron has said (pictured, Royal British Legion stand next to the Soviet War Memorial during a service to commemorate Holocaust Memorial Day)\nDowning Street said an international design competition will be launched in the coming weeks and the memorial built by the end of 2017.\n'It will stand beside Parliament as a permanent statement of our values as a nation and will be something for our children to visit for generations to come,' Mr Cameron said.\n'It is right that our whole country should stand together to remember the darkest hour of humanity.'\nThe national memorial was one of the recommendations of a report published on last year's 70th anniversary of the liberation of the concentration camp at Auschwitz-Birkenau.\nMr Cameron has promised £50million towards the monument, as well as the establishment beside it of a 'world-class' education and learning centre, details of which are still to be announced.\nChairman of the UK Holocaust Memorial Foundation, Sir Peter Bazalgette, said: 'The task of the Holocaust Memorial Foundation was to find a site that would allow a striking, prominent and iconic memorial to be built.\n'There is nowhere better to achieve this than beside Parliament.\nThe new memorial is to be put up in Victoria Tower Gardens, alongside the Thames next to the Palace of Westminster (pictured, a man lays a wreath during a Holocaust Memorial Day)\n'It will stand beside Parliament as a permanent statement of our values as a nation and will be something for our children to visit for generations to come,' Mr Cameron (pictured) said\n'I stood there with a Holocaust survivor earlier this week and I will never forget his reaction when I told him of our plans. It demonstrated how we are doing the right thing for Britain's Holocaust survivors in preserving the memory of humanity's darkest hour.\n'But just as importantly, we're doing the right thing for our country by creating a permanent reminder of the need to fight hatred and prejudice in all its forms.'\nChief Rabbi Ephraim Mirvis said the memorial would be 'warmly received' by the Jewish community.","url":"https://www.dailymail.co.uk/news/article-3420242/50m-memorial-Holocaust-Monument-erected-Parliament-end-year-design-chosen-competition.html"}
