{"authors":[],"date_download":"2018-10-22 21:19:17","date_modify":"2018-10-22 21:19:17","date_publish":"2014-05-06 20:40:13","description":"College senior Jeffrey Reppucci is making a difference by rebuilding communities with recreational spaces.","filename":"data/vaneerConsumption/HolyCrossSeniorHelpsRebuildHisCollegeTown.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/424471/x_30_nn_worchesterpreview-1_140506_f532bda749bbae5d4cd9e0d069d1671a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_holy-cross-senior-helps-rebuild-his-college-town-n98556_1540243157.html","title":"Holy Cross Senior Helps Rebuild His College Town","title_page":"Holy Cross Senior Helps Rebuild His College Town ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhen Jeffrey Reppucci, 23, was sent abroad to study in Russia during his sophomore year at College of Holy Cross in Worcester, Mass., he would have never predicted a project launched in a foreign land would end up making a difference in his own college town. Reppuci was visiting the small village of Suzdal, Russia, when he said he was struck by the poor conditions at a local school and the lack of recreational spaces for children to play. He said he had to find a way to help.\nReppucci returned to Massachusetts and recruited his friend, Derek Kump, 23, to start a nonprofit. They raised the money from friends, family and corporate sponsors, and Reppucci returned to Suzdal for a month to get to work. “We built a playground at the school… worked with the community, and it just was a completely life-changing experience for me, a pivotal moment,” said Reppucci.\nOnce back home, Reppucci decided his success in Suzdal could be used to help transform neighborhoods around Worcester -- and a project called Working for Worcester was born. The group brought together students of all ages at Holy Cross and other neighboring colleges to focus on recreational spaces stateside, building playgrounds, basketball courts and dance studios for youth in their community. This year, more than 700 college students from 10 schools participated.\n“The leadership team is pumped,” said Reppucci. “And the reason why we're pumped is because we have been able to recruit some wonderful freshmen, sophomores at Holy Cross, Clark, Assumption, other schools, who are not only here digging holes and want to be a part of the day, but who spent the last six months in this project with us in those late night meetings, crammed into the dorm rooms, really working through each step of this project.”\nWorking for Worcester is also going back overseas with its help. It’s launched a new empowerment and soccer program for girls at a local school in Tanzania. And Reppucci, now a senior, will visit the region at the end of the summer to start building the new field.\nRon Mott's report aired Tuesday, May 6 on NBC Nightly News with Brian Williams.","url":"https://www.nbcnews.com/nightly-news/holy-cross-senior-helps-rebuild-his-college-town-n98556"}
