{"authors":[],"date_download":"2018-10-22 22:06:51","date_modify":"2018-10-22 22:06:51","date_publish":"2014-06-08 14:53:11","description":"Israeli and Palestinian leaders held an unprecedented prayer meeting with Pope Francis Sunday, a gesture that could kick-start the peace process.","filename":"data/vaneerConsumption/HolyHistoryIsraeliPalestinianLeadersPrayatVatican.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/495621/140608-shimon-peres-mahmoud-abbas-pope-jms-2027_e6ab87f0b552d9c1565ab73a000d4766.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_holy-history-israeli-palestinian-leaders-pray-vatican-n125601_1540246011.html","title":"Holy History: Israeli, Palestinian Leaders Pray at Vatican","title_page":"Holy History: Israeli, Palestinian Leaders Pray at Vatican","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nVATICAN CITY — The Israeli and Palestinian presidents joined in an unprecedented prayer meeting with Pope Francis Sunday, a gesture the pontiff hopes will \"re-create a desire, a possibility\" of kick-starting the stalled Middle East peace process.\nIsraeli President Shimon Peres and Palestinian President Mahmoud Abbas accepted a surprise public invitation from Francis to come to “his home” to pray together during his recent visit to the region.\n“It is my hope that this meeting will mark the beginning of a new journey where we seek the things that unite, so as to overcome the things that divide,” Francis said Sunday. He thanked the presidents for accepting his invitation, and said that people of varied cultures and religions had been praying for a meeting of this nature.\nThe Vatican is keen to play down suggestions that Sunday’s event is political, but it is nonetheless a symbolic gesture that has the power to stir public opinion and put pressure on the Israeli and Palestinian authorities to find a way out of the stalemate.\nFrancis met with the two leaders privately after welcoming each of them with an embrace.\n“No one has the presumption to believe that, after this event, peace will break out in the Holy Land,” said Fr. Pierbattista Pizzaballa, the Vatican’s Custodian of the Holy Land. “The intent is “to make a strong gesture to reopen this road where everyone again feels the need for this peace and to have some impact on public opinion.”\nThe “invocation for peace” began in the Vatican gardens at 7 p.m. (1 p.m. ET) and featured Jewish, Christian and Muslim prayers, interspersed with short musical passages.\nThe venue was chosen because of the absence of the religious symbols that adorn other parts of the Vatican.\nThe three leaders delivered similar messages — each including a passage on creation, a request for forgiveness and a cry for peace.\n“Two peoples — Israelis and Palestinians — still are aching for peace,” Peres said. “We must put an end to the cries, to the violence, to the conflict. We all need peace. Peace between equals.\"\nThe Israeli president also expressed his gratitude to Francis for his “wisdom and modesty” in initiating the meeting.\nAbbas prayed, “I beseech you, oh Lord, to make prosperous and promising the future of our people, and freedom in our sovereign and independent state. Grant us, oh Lord, our region and its people security, safety and stability. Save our blessed city Jerusalem.\"\nAt the end of the ceremony, Francis, Peres and Abbas planted an olive tree — a symbol of peace.","url":"https://www.nbcnews.com/news/world/holy-history-israeli-palestinian-leaders-pray-vatican-n125601"}
