{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:34:48","date_modify":"2018-10-30 21:34:48","date_publish":"2016-06-22 06:59:51","description":"\"Guardians of the Galaxy 2\" has wrapped in Atlanta just as \"Spider-Man: Homecoming\" gets going.","filename":"data/vaneerConsumption/Homecomingnowfilmin.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/30/Images/WPIMAGE_cmgajcbuzz_6444.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_guardians-the-gal_c7f18e5ee3b3fa0464c84b132c20254e__1540935288.html","title":"Homecoming\" now filmin","title_page":"\"Guardians of the Galaxy 2\" wraps; \"Spider-Man: Homecoming\" now filmin","title_rss":"NULL","source_domain":"ajc.com","text":"\"Guardians of the Galaxy 2\" has wrapped in Atlanta just as \"Spider-Man: Homecoming\" gets going.\n\"Guardians\" director James Gunn heralded the handoff with this photo of himself at the Pinewood Studios facility in Fayetteville with the two Marvel stars: \"Spider-Man\" lead Tom Holland, left, and \"Guardians\" lead Chris Pratt.\n\"Many blessings today to the star of 'Spider-Man: Homecoming,' Tom Holland, and the film's director, Jon Watts, as they begin their shoot in Atlanta just as we are ending ours,\" Gunn posted. \"I don't think we could pass the Marvel baton to two nicer, better guys who care more about what they're doing.\"\nHe also posted a fond farewell to Atlanta:\n\"Thanks so much for all of your smiles and friendliness. You're just flat-out wonderful people to be around, and one of the true, great cosmopolitan cities.\n\"Thank you to the Zoo Atlanta , Georgia Aquarium, and Noah's Ark Animal Sanctuary: home of the BLT (the bear, lion and tiger trio who live there together) who were all kind enough to take me behind-the-scenes while I was here in town, and for all doing their best to care for animals, give people a chance to experience firsthand how wonderful animals are, and to help ensure the survival of entire species. I do very little outside of work while I'm making a film - thanks to all of you for helping me to make my downtime the best of times.\nThe other thing I do for fun is eat. And I would be remiss without mentioning what I consider Atlanta's finest attribute: the amazing food. Thanks especially to Poor Calvin's , whose staff was so warm and inviting it was like going home every Saturday night. Also thanks to the incredible The Optimist , the fabulous JCT Kitchen & Bar , Big Daddy's Kitchen , whose fried catfish is manna, and BoccaLupo , whose Italian is as good as anything in L.A.\"\nHe also shouted out Oxford Comics for keeping him apprised of comics updates and South Atlanta Veterinary Emergency & Specialty Center, which apparently cared for his furry friends during his time here.","url":"https://www.ajc.com/blog/buzz/guardians-the-galaxy-wraps-spider-man-homecoming-now-filming/4ES0bJRL23PhBQoEVsMFkN/"}
