{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 00:01:39","date_modify":"2018-10-23 00:01:39","date_publish":"2016-01-28 13:23:37","description":"The adorable dog went toe to toe with his four identical siblings at Dogs Trust in Kenilworth, Warwickshire, when they were looking for new homes - and he's the only one left.","filename":"data/vaneerConsumption/Homelesspuppyisoverlookedbecausehehasanextratoeononefoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA97E200000578-0-image-a-91_1453987457458.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420868_Paw-doggy-Homeless-puppy-overlooked-potential-owners-extra-toe-one-foot_1540252899.html","title":"Homeless puppy is overlooked because he has an extra toe on one foot","title_page":"Homeless puppy is overlooked because he has an extra toe on one foot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Homeless puppy Tony is being overlooked by potential new owners - because he's got an extra toe.\nThe adorable dog went into a rescue centre with his four identical siblings when they were looking for new homes - and he's the only one left.\nBut staff at Dogs Trust in Kenilworth, Warwickshire, want to assure any potential owners that his deformity does not affect the cute canine in any way.\nThey are appealing for a home for the adorable golden-coloured eight-week-old cross-breed - who has been given his name because it has the sound 'toe' in it.\nScroll down for video\nMan's best friend: Tony the golden-coloured eight-week-old cross-breed who is looking for a new home\nLeft alone: Tony's five siblings have all found new owners at Dogs Trust in Kenilworth, Warwickshire, but he remains - staff think it is because of his extra digit\nOverlooked: Jane Hirons from Dogs Trust said people dismiss canines with the 'slightest quirks' which is why Tony is yet to find a new home - and (pictured right) the extra toe\nWhilst his identical, bar the additional toe, siblings were reserved immediately to go to loving new homes, Tony is still waiting to find his new owners.\nHis toe doesn't affect his walk or cause him any discomfort.\nBut workers at the centre think he has been overlooked simply because of his extra digit.\nTony and his siblings all arrived at the rehoming centre at the same time as part of an unwanted litter.\nJane Hirons, Dogs Trust Kenilworth Supporter Relations Officer, explains: 'Puppies like this gorgeous litter normally find homes immediately, just as Tony's siblings have, so it's really surprising that he is still with us.\n'Sadly we find some people will overlook dogs with the slightest quirks so we hope a new owner will see beyond his quirky paws and offer him a happy home.\n'He is a fantastic, mischievous little character and we absolutely adore him so can't wait to see him find the loving home he deserves.\nDog for life: Danielle Scott, a canine carer with the Dogs Trust in Kenilworth, Warwickshire, with Tony\nCute dog: Puppy Tony has five toes on one paw - the condition is known as polydactyly, meaning 'many'\n'He may have lost out going toe to toe with his siblings to find a new home but we know the right home is out there for him.\n'After all, Anne Boleyn was rumoured to have six fingers and it didn't stop her becoming Queen of England.'\nA dog normally has four toes on the ground per foot, each with a claw.\nA higher vestigial toe, known as a dewclaw, is also normal on a foreleg.\nTony has five toes on the ground.","url":"https://www.dailymail.co.uk/news/article-3420868/Paw-doggy-Homeless-puppy-overlooked-potential-owners-extra-toe-one-foot.html"}
