{"authors":[],"date_download":"2018-10-30 18:07:52","date_modify":"2018-10-30 18:07:52","date_publish":"2018-09-11 21:57:00","description":"On the site where the Georgia Dome stood just 10 months ago, immediately north of Mercedes-Benz Stad...","filename":"data/vaneerConsumption/HomeDepotBackyardopensonGeorgiaDomesite.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/11/Images/HDPHOTO.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_home-depot-backyard-opens-georgia-dome-site__1540922872.html","title":"'Home Depot Backyard' opens on Georgia Dome site","title_page":"'Home Depot Backyard' opens on Georgia Dome site","title_rss":"NULL","source_domain":"ajc.com","text":"On the site where the Georgia Dome stood just 10 months ago, immediately north of Mercedes-Benz Stadium, a new 11-acre multi-purpose greenspace officially opened Tuesday.\nThe Home Depot Backyard will be used as a tailgating area for stadium events, starting with the Falcons’ 2018 home opener Sunday, and as a park on other days.\nIt was built atop 15 feet of crushed debris from the Georgia Dome, which was imploded late last year.\nNow the space includes expanses of lush natural grass, wide walkways, a playground and a pavilion.\nFalcons owner Arthur Blank, Home Depot CEO Craig Menear and Atlanta Mayor Keisha Lance Bottoms participated in a ceremony opening the space Tuesday.\n“The Home Depot Backyard is an incredibly beautiful space that will be used in so many great ways for community events, sponsored events and game-day activities,” Menear said. “Most importantly, the Home Depot Backyard is the backdrop for all that is taking place to revitalize Atlanta’s Westside.”\nPlayers from the Westside Flag Football League ran through an orange ribbon to signify the official opening.\n» Follow: AJC’s coverage of Super Bowl 53 in Atlanta","url":"https://www.ajc.com/sports/home-depot-backyard-opens-georgia-dome-site/S6GKHILsCpeT4QDLIrZvyJ/"}
