{"authors":[],"date_download":"2018-10-22 22:29:07","date_modify":"2018-10-22 22:29:07","date_publish":"2014-06-09 17:28:35","description":"The federal government wanted to ban insurers from sending doctors on costly \"house calls,\" but backed off after a lobbying blitz.","filename":"data/vaneerConsumption/HomeIsWhereTheMoneyIsforMedicareAdvantagePlans.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_home-where-money-medicare-advantage-plans-n126421_1540247347.html","title":"Home Is Where The Money Is for Medicare Advantage Plans","title_page":"Home Is Where The Money Is for Medicare Advantage Plans","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThis story was published by The Center for Public Integrity, a nonprofit, nonpartisan investigative news organization in Washington, D.C.\nSome of the senior citizens who called Arizona insurance agent Denise Early wondered why their Medicare Advantage health plans were eager to send a doctor to visit them at home.\nA few worried that the offer might be a scam. After all, they asked, how many doctors make house calls these days?\nMore than people might think. Home visits have risen sharply at many private Medicare health plans, which treat close to 16 million elderly and disabled people under contracts with the federal government.\nThe health plans tout the voluntary, free annual physicals as a major new benefit that can help selected members stay fit and in their homes as long as possible. While the doctors and nurses don’t offer any treatment during their visit, they report their exam findings to the patient’s primary care physician.\nYet there’s more to this spurt in home visits than the appearance of enhanced elder care. The house calls can be money makers for health plans when they help document medical problems -- from complications of diabetes to a history of heart trouble that’s flared up.\nHealth plans can profit because Medicare pays them higher rates for sicker patients using a billing formula known as a “risk score.”\nClick here to read a glossary of Medicare and Medicare Advantage terms.\nSo when a home visit unearths a medical condition, as it often does, health plans may be able to raise a person’s risk score and collect thousands of dollars in added Medicare revenue over a year -- even if they don’t incur any added expenses caring for that person. That’s been allowed under the billing rules.\nThe home visits are the most visible segment of a burgeoning medical information and data analysis industry that is thriving behind the scenes, in some cases backed by formidable venture capital and other investment groups, including Google Ventures.\nThe cottage industry is flourishing as federal officials struggle to prevent Medicare Advantage plans from overcharging the government by billions of dollars every year, a Center for Public Integrity investigation has found.\nMedicare made nearly $70 billion in “improper” payments to Medicare Advantage plans from 2008 through 2013, mostly overbillings based on inflated risk scores, according to government estimates.\nClick here to see how changes to a risk score can boost costs.\nFederal officials last year suggested that home visits might play a role. They said they were concerned that some health plans may be turning to home visits and other strategies that drive up risk scores -- and Medicare costs -- without offering patients more actual medical services or tangible health benefits.\nOfficials didn’t say in the draft regulation how much the home visits have added to Medicare’s cost through higher risk scores. But two investor-backed companies together made a total of nearly half-a-million senior home visits in 2013.\nIn April, though, officials bowed to industry pressure and backed off their earlier proposal to restrict these visits.\nOfficials at the Centers for Medicare and Medicaid Services (CMS) in Washington declined numerous requests for comment and declined to answer questions posed in writing.\nLimiting the house calls could have cut payments to Medicare Advantage plans by nearly $3 billion a year, according to a report prepared for the insurance industry’s trade association.\nHealth plans argue that home visits help them meet a patient’s total health care needs — and assure that the plans are paid fairly for taking on that responsibility.\nGet involved: have you received a home visit as part of a Medicare Advantage plan? Was the visit helpful to you?\nScott Weiner, a Virginia Medicare billing expert, said health plans that don’t bill aggressively “will lose out to competitors” that do. “It’s keeping up with the Joneses,” he said.\nThe accuracy of risk scores isn’t just a Medicare Advantage issue. The payment system also will be used in paying for health care for millions of Americans under the Affordable Care Act, which officials expect to contain costs.\nBehind the Curtain\nThe federal government pays Medicare Advantage plans a monthly fee for each patient to cover all their health-care needs, based largely on the risk scores. But the plans generally don’t tell patients how much, or how the sum is calculated -- and neither do federal officials.\nPatients only hear about how much they owe for monthly premiums. Some plans have no premium, but premiums are expected to average about $40 a month this year depending on the type of plan, according to the Kaiser Family Foundation.\nStill, those premiums are just a fraction of what Medicare pays health plans -- on average $9,900 per person a year, more for people in poor health, including those with multiple chronic diseases.\nThe billing process is extremely complicated. More than 70 health conditions, depending on their severity, may push up the risk scores, and thus the payments.\nClick here to see the Center for Public Integrity's Medicare Advantage explainer.\nTake depression as an example. Simply having feelings of sadness and hopelessness that limit activities doesn’t qualify. Yet if depression lingers for at least two weeks and is present with other symptoms it may be classified as “major depressive disorder.” That condition alone pays nearly $450 a month for a 75-year-old woman living in Miami-Dade County, Florida, according to the Coleman Consulting Group, based in neighboring Broward County.\nWhen it comes to benefits such as home visits, many patients are impressed their health plan took the trouble to look after them, supporters say.\n“Who wouldn’t want a physician to sit across from them for an hour asking what is ailing them free of charge? Where is the downside in that?’’ said Sy Zahedi, president and CEO of MedXm, in Santa Ana, California, which does home assessments.\n‘Paucity of Evidence’\nThe downside, federal officials have argued, is the paucity of evidence showing that home visits make people any healthier, improve their care, or do much beyond driving up Medicare’s costs.\nIn February 2013, Centers for Medicare and Medicaid Services officials proposed flagging diagnoses written up from a home visit with an eye toward refusing to pay for any that didn’t prompt follow-up medical attention from a doctor. Officials reasoned that if an ailment wasn’t serious enough to merit any treatment, then taxpayers shouldn’t foot the bill. Billing guidelines require health plans to treat any disease they diagnose.\nIn late February of this year, CMS officials said in a draft regulation that they had seen “little evidence” that medical care “is substantially changed or improved as a result” of the home visits.\nOfficials wrote “we are concerned that the apparent significant increase in the prevalence of these assessments … contributes to increased risk scores.”\nThe proposal to restrict home visits didn’t sit well with health plans.\nKaren Ignagni, president of the industry’s powerful trade group, America’s Health Insurance Plans, in a March 7, 2014 letter to CMS argued that the agency had shown no evidence that diagnoses made at home visits were “inappropriate.” “We strongly believe the proposal is misguided and should be withdrawn,” she wrote.\nCMS changed its mind with a final order issued in early April that said simply that the agency was not “finalizing this policy.” Officials said they would continue to “analyze data” and “may reconsider” their decision in the future.\nCMS officials have been trying to arrest the rise in risk scores for years.\nAgency data analyzed by The Center for Public Integrity show that scores spiraled upward from 2007 through 2009, yielding Medicare Advantage costs that totaled $12 billion more over those three years than traditional Medicare would have likely paid for the same patient population. In 2010, CMS stepped in and trimmed back the scores using a multiplier to adjust them downward, but the impact didn’t last. By 2011, these scores were up another 2 percent, which raised costs over traditional Medicare by more than $11 billion in just one year.\nA note on the Center's methodology\nHow much home visits contributed to that growth is not clear because the government limits public access to billing data.But risk scores at one plan, XLHealth Corp., based in Maryland, jumped by at least 20 percent between 2007 and the end of 2011, a time when its house calls program mushroomed, according to the Center’s analysis of CMS data.\nSuresh Ramakrishnan, who led the home visit expansion for three years as a senior vice president at XLHealth, said it helped bring in more than $600 million in revenue in 2013. He has since left the company.\n“It did raise revenues, but that was not the purpose,” Ramakrishnan said in an interview. “It was to take care of the members who were frail and ill and identify conditions that remain undiagnosed.”\nTerence Ohara, a spokesman for UnitedHealth Group, which owns the company, declined to address the financial impact of the visits. In an email, he said the house calls improve the “continuity and management of care and, in many cases, saves lives. In 2013 alone, our HouseCalls program made thousands of ‘urgent’ referrals so our members could receive immediate care from a physician or hospital.”\nThe debate over home visits has gotten little attention in Congress. But some members, mainly Democrats, have argued for years that CMS needs to make steeper cuts in risk scores to keep Medicare costs in check. Their views are buttressed by a range of government audits and studies, which have concluded that Medicare health plans can boost profits by coding higher and higher risk scores.\nWith nearly 16 million patients to track, CMS largely trusts health plans to make sure risk scores are accurate. But when the agency has checked, it has exposed errors -- mostly scores that were too high -- in nearly a third of patient files examined. Given the magnitude of program spending, even a small error rate can bleed millions of dollars from the federal treasury. Medicare expects to pay the health plans more than $150 billion this year.\nRead why Medicare Advantage matters to you\nAs a result, CMS officials are stepping up audits called Risk Adjustment Data Validation, or RADV, this year. They expect to recoup about $370 million in overpayments tied to inflated risk scores from prior years.\nThomas E. Hutchinson, a former CMS official who was involved in setting up the RADV audit process, said plans have relied on home visits at least partly to detail a patient’s health history should they be audited. “That’s how it got started,” he said.\nThe CMS decision to allow home visits to continue has played only a bit part in a howling political debate in Washington over cutting Medicare Advantage rates. Yet it could cost taxpayers billions of dollars.\nA report commissioned by America’s Health Insurance Plans predicted in February that limiting home visits would shave payments to Medicare Advantage plans by two percent over a year -- nearly $3 billion. The report defended the visits as a means to “address conditions that could otherwise be untreated or undiagnosed.”\nHumana, Inc., which has enrolled more than 2 million people in Medicare Advantage, alerted investors the CMS proposal to restrict home visits could “potentially result in additional significant funding declines,” according to a Feb. 24 Securities and Exchange Commission filing. The company heralded home visits as a “critical program.”\nSpokesman Tom Noland said Humana conducted health assessments for about 531,000 members in the first three months of this year. He said that federal officials “should be encouraging Medicare Advantage plans to do more of this type of work,” because in-home visits help create a “trusting and engaging relationship” with patients.\nUnitedHealth Group, which counts more than 3 million seniors in its Medicare Advantage plans, made more than 700,000 house calls last year. The giant insurer makes its pitch in this video.\nProponents of home visits don’t deny that they generate new revenue by raising risk scores. But they point to concrete benefits for patients.\nDr. Jack McCallum, a pioneer in the home health assessment field, said insurers typically can count on getting $2,000 to $4,000 more per person from Medicare in a year as a result. The plans pay about $300 for a physician or nurse practitioner to conduct the home exam, so it more than pays for itself, according to McCallum, a co-founder of CenseoHealth, who retired from the Dallas-based home visit company last year.\nMcCallum stressed that home visits should be structured to help patients and not “just to attract revenue.” While the doctors and other health professionals who visit don’t render any treatment, their observations and other exam findings are sent to the patient’s primary care physicians for possible follow-up care, he said.\nMost home exams take about an hour or more and can range from recording a patient’s blood pressure and full medical history to sorting through medicine chests. They also may help spot hazards in the home, such as a mislaid rug that might cause a fall, the industry says.\nAs a result, proponents say, health professionals can remedy dangerous conditions before they result in a trip to the emergency room, or days in the hospital.\nSome examples: dangerously high blood pressure, medical complications caused by improper mixing of prescription drugs, or home safety concerns related to dementia, said Brian Wise, chief executive officer of Advance Health in Chantilly, Virginia.\n“I know there is a lot of good happening. People who are in danger are getting medical or social services that can help save their lives,” said Wise, whose firm expects to do as many as 200,000 home visits this year.\nBut Wise acknowledged that only about four out of every thousand home visits uncovers maladies serious enough to require an immediate phone call to the patient’s primary care doctor, urgent care or emergency medical services.\nClick here to read the first part of the Center’s Medicare Advantage investigation\nOther experts are skeptical of the importance of home visits.\nDr. Reid Blackwelder, president of the American Academy of Family Physicians, said that in his experience the home visits often aren’t well coordinated with the patient’s doctor, and as a result, haven’t been of much help.\n“Unfortunately, they’re reporting back on things I already know. I don’t remember anything … that necessarily improved the care of my patient other than what I had already documented,” he said.\nEarly, the independent insurance agent in Tucson who blogs on Arizona Medicare issues, said from her vantage point, the verdict among seniors is mixed. She said some of her clients enjoy the attention. Others wonder, “Is this legitimate?” Some say they aren’t sick, and even though they don’t pay a dime, they’re annoyed and tell the health plan to “leave me alone.”\nMaking more money off Medicare “is the reason for the house calls,” she said. The visits also may discourage some patients from switching to competitors. “If you’re able to show you care about members, it’s less likely they will jump ship,” Zahedi of MedXM said.\nBright Future\nSome home assessment firms have turned to former government health officials and venture capitalists for support. And Wall Street investors see a bright future for the home assessment industry -- and other initiatives that help Medicare Advantage plans maximize billing.\nMatrix Medical Network, of Scottsdale, Arizona, forecasts revenues topping $1 billion in the next few years from home visits. The firm, which is backed by venture capital powerhouse Welsh, Carson, Anderson & Stowe, says it completed more than 348,000 Medicare Advantage in-home health assessments in 2013.\nMatrix and some other firms use telemarketers who set up home appointments reading from a script that stresses the health benefits.\nA Matrix news release says that home visits “can be transformed into information that benefits” patients. Matrix also audits medical charts to confirm a disease the health plan may have failed to report to Medicare for reimbursement. In a video it touts home visits as a way for seniors to lead a better life. Company officials declined to be interviewed.\nThomas A. Scully, who led CMS under President George W. Bush, serves on Matrix’s board and is a general partner in the investment firm backing it. He said the government’s concerns about billing are “somewhat legitimate.” But he said that Matrix “does a terrific job” making sure that findings from a home visit are “passed on to doctors and used to get better care” for patients.\nHealth Evolution Partners, an investment firm whose managing partner and CEO is former Bush health information technology czar Dr. David Brailer, has a stake in CenseoHealth, which does more than 100,000 annual home assessments. Brailer declined to discuss CenseoHealth’s operations for the record. Censeo also declined comment.\nMany firms that conduct home visits or analyze medical records aren’t shy about tossing out buzzwords such as “ROI,” short for return on investment, or touting other financial benefits in sales pitches to Medicare Advantage plans. Others plug their services as “revenue optimization.”\nPredilytics, a Burlington, Massachusetts, health information analytics firm, markets software to Medicare Advantage plans that helps identify the “highest opportunity” elderly people to visit at home. Doing so can boost Medicare payment rates by 25 percent, it says. On average that comes to $600 per member, per month, which would add up to $36 million in new Medicare payments for a health plan with 5,000 members. The company, which also markets software to help improve the quality of medical care, did not respond to requests for comment.\nOne investor in the firm is Google Ventures, which was described in a Wall Street Journal article as \"targeting\" medical software companies for investment. Google did not respond to requests for comment.\nMaria Gonzalez-Knavel, a Milwaukee health care attorney, said the rapid spread of electronic health records and billing software are also driving the industry.\n“It’s easier to data mine than in the past when everything was on paper. An increasing amount of records are electronic and more easily searchable,” she said.\nUpcoding\nBy all accounts, Medicare Advantage billing is highly complex and subject to interpretation — and that uncertainty supports many of the companies whose mission is to capture unseen Medicare dollars.\nSomething similar happened nearly two decades ago after Medicare created a coding system that paid doctors escalating fees based upon the amount of time they spent with a patient and the complexity of medical decisions they made.\nSoon, waves of billing consultants were teaching doctors how to work the new system. Most did so honestly, but others devised ways to overstate the complexity of medical services to gain higher fees, a scheme known as “upcoding.” Congress held a well-publicized hearing hoping to crack down on offenders.\nBut upcoding by doctors and hospitals remains a serious drain on Medicare in the era of electronic health records and billing software. Top federal officials in late 2012 warned doctors and hospitals to avoid using software programs to overbill.\nMedicare Advantage plans don’t bill for each service the way that doctors do. But officials have yet to determine if electronic health records and billing software can be used to inflate risk scores.\nClick here to see how risk scores can easily be inflated\nThe industry denies that it overcharges. The plans argue they are often underpaid and turn to data miners to make sure they don’t leave money on the table through missed diagnoses.\nAn often cited example is a person who has prescriptions for insulin, an obvious indicator of diabetes, but whose medical record doesn’t capture that diagnosis. Doctors also may fail to report a patient’s chronic medical condition every year as required for payment.\nLook Both Ways\nStill, there’s little evidence to support the notion that billing errors shortchange health plans.\nWhen these mistakes occur, Medicare most often pays too much, not too little. In 2013, officials estimated that Medicare made $11.8 billion in “improper” payments to health plans because of risk score errors. Nearly 80 percent -- or $9.3 billion -- was overcharges.\nOne possible reason is that CMS officials have done little to make sure health plans promptly alert the government when a patient’s health improves and Medicare’s payment should be reduced.\nColeman Consulting, the Florida billing experts, said doctors often document a diagnosis of cancer after it has been treated or is no longer active. Doing so improperly inflates a patient’s risk score and triggers an overpayment.\n“There are a lot of conditions that are coded incorrectly. Cancer is at the top of the list,” said M. Alexandra Johnson, of the consulting group. She said most cases are “done out of ignorance” rather than to defraud the government.\nThese disputes, like so many involving Medicare Advantage billing, rarely spill out into public view. One case that did was a 2009 Department of Justice lawsuit against the owners of America’s Health Choice Medical Plans Inc. in Vero Beach, Florida. The government accused the health plan of bilking Medicare out of millions of dollars by reporting “as many diagnosis codes as possible without regard to their truthfulness.”\nThe Justice Department said the plan’s risk score software added diagnoses, but wasn’t able to subtract erroneous ones.\nThe health plan denied the accusations. The case was settled in 2010 when the plan’s owners agreed to pay the government $22.6 million. The HMO is defunct.\nIn another case, a woman claimed in a 2011 federal lawsuit that she was fired from her job at Priority Health in Michigan after she refused an order from her supervisor to “only focus” on adding billing codes that would increase payments to the Medicare Advantage plan -- and ignore any “previously submitted codes that were false or wrong and had caused overpayment.”\nThe health plan denied the allegations. The case was settled confidentially with no admission of fault.\nIn a third case -- against SCAN, a major California health plan -- a whistleblower alleged that the company hired reviewers to comb medical files for overlooked medical conditions, but not for overpayments. The health plan paid $3.8 million in 2012 to settle the Medicare payment allegations and denied wrongdoing. A spokesman said SCAN “fully cooperated with regulators and the matter was resolved to the satisfaction of all parties.”\nCMS appears to be showing signs its tolerance for billing errors -- intentional or not -- is wearing thin. In draft regulations issued in January, the agency said it would begin requiring that Medicare Advantage plans conduct medical record reviews that detect any improper payment -- either too much or too little.\nData mining systems “cannot be designed only to identify diagnoses that would trigger additional payments,” the proposal states. The draft regulations also require the plans to return any overpayments they discover within 90 days -- or face penalties.\nOne specialist in the data mining field said the “stakes are much higher” for health plans that fail to remove unverified codes. “CMS is asking plans to take money off the table,” said Michael Curran, chief operating officer of Health Data Vision Inc. in Burbank, California.\nDollar Signs\nSome experts believe that Medicare’s difficulties taming risk scores don’t bode well for the Affordable Care Act. The ACA transfers funds from plans with lower risk patients to those with higher risk patients.\nStarting this year, people of all ages who buy coverage off state insurance exchanges will be scored by health status to decide the amount of money health plans will be paid for enrolling them.\nSome critics believe that federal officials haven’t learned much from their experiences with Medicare Advantage overpayments.\nA big concern: officials have announced that for the first two years of the “Obamacare” rollout, there won’t be any audits to make sure that risk scores are accurate.\nSome health policy experts already are speculating that the hands off policy may undermine the Affordable Care Act’s potential to cut costs.\nEdwin Park, of the Center on Budget and Policy Priorities, calls risk adjustment an “essential element” of the health reform law. He notes that insurance companies are lobbying hard to do their own assessments without any government oversight -- and worries that will result in massive overbilling.\nJohn Gorman, a prominent Medicare Advantage consultant, said under the Affordable Care Act health plans “will get a hall pass for the sake of making sure people get access” to health care.\nHe confided: “That’s not the best policy.”","url":"https://www.nbcnews.com/news/investigations/home-where-money-medicare-advantage-plans-n126421"}
