{"authors":["Press Association"],"date_download":"2018-10-22 21:31:41","date_modify":"2018-10-22 21:31:41","date_publish":"2016-01-29 06:49:03","description":"Elderly and disabled people are not being cared for in a dignified manner because visits by homecare workers are being limited to 15 minutes, it has been cla...","filename":"data/vaneerConsumption/Homecareworkersurveyrevealsabrokensystem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-d644df7d-59e5-4d1b-a957-251316f56cd3-4PuZeKVXE7cd9005b2c8765f3309-592_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422242_Homecare-worker-survey-reveals-broken-system_1540243901.html","title":"Homecare worker survey reveals 'a broken system'","title_page":"Homecare worker survey reveals 'a broken system' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Homecare worker survey reveals 'a broken system'\nElderly and disabled people are not being cared for in a dignified manner because visits by homecare workers are being limited to 15 minutes, it has been claimed.\nA survey of 1,100 members of Unison found that three out of four did not believe they had enough time to give sufficient care to elderly and disabled people they visited.\nThree out of five said 15 minute visits meant they often had to rush the care they could provide.\nMost of those polled said they did not have time to even talk to the people they were visiting\nMost of those polled said they did not have time to even talk to people they were visiting, these included stroke victims, those with mental health issues or Parkinson's disease.\nUnison general secretary Dave Prentis said: \"It is heartbreaking and distressing that many elderly and disabled people are not being cared for in a humane and dignified manner.\n\"Homecare workers have shared their harrowing stories with a strong sense of sadness, guilt, anger, and ultimately disgust, at a broken homecare system.\n\"Eye-watering cuts imposed by the government mean councils are still booking the shortest possible visits to care for vulnerable, frail and isolated elderly people.\n\"Homecare workers are often the only face some people see all day, and they are a lifeline.\n\"Only they can call for help and ensure that the housebound people they care for are fed, washed and well.\n\"Although the government is going to allow local authorities to raise council tax to fund social care, the crisis is so great that any extra cash will barely touch the sides.\n\"With the challenge of an ageing population living longer, care planning and adequate funding for social care should be a government priority and it clearly is not.\n\"Ministers should stop passing the social care buck to councils, and dig deep to find the cash from Treasury coffers to provide dignified care for the elderly.\n\"Rushed 15 minute homecare visits should have no place in a modern, caring society.\"\nA Department of Health spokeswoman said: \" Rushed visits are unacceptable - they are not fair on older people or the staff who care for them.\n\"These responses largely pre-date the NICE guidelines on home care that were published for the first time last year, so councils now have clear standards to follow and our tough inspection process is clamping down on poor care.","url":"https://www.dailymail.co.uk/wires/pa/article-3422242/Homecare-worker-survey-reveals-broken-system.html"}
