{"authors":["Victoria Cabales","Guest Commentary","Dan Morain","David Gorn"],"date_download":"2018-10-30 22:34:31","date_modify":"2018-10-30 22:34:31","date_publish":"2018-06-28 00:52:50","description":"As California struggles to confront a crisis of homelessness, these numbers help illuminate the depth and breadth of the problem.","filename":"data/vaneerConsumption/HomelessinCaliforniawhatthedatareveals.json","image_url":"https://calmatters.org/wp-content/uploads/Bartley16-e1530147609769.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938871.html","title":"Homeless in California-what the data reveals","title_page":"Homeless in California—what the data reveals | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California is struggling to confront its homelessness crisis: After big-city mayors up and down the state lobbied hard for more funding, state leaders agreed to spend an additional $600 million this month to help fight the problem.\nHere are some basic numbers to help understand one of the state’s most vexing issues.\nHow many Californians are homeless now, and how has that changed over time?\nWhile it’s tough to say precisely how many Californians are experiencing homelessness, the federal Housing and Urban Development Department estimates the number statewide at 130,000 on a given night. That’s 25 percent of the entire nation’s homeless population. Since 2016, California experienced a larger increase in homelessness than any other state.\n“Our state has more than 1.7 million low-income households spending more than half their income in housing costs,” said Ben Metcalf, the director of the state Department of Housing and Community Development. “When you’re paying that much for housing, with so little left over, even a minor shock can start a cycle of homelessness.”\nSource: Department of Housing and Urban Development.\nCalifornia has the highest percentage of unsheltered homeless individuals in the country, at slightly under 70 percent. This means that the vast majority of the state’s homeless population does not utilize temporary living arrangements provided by either charitable organizations or government programs. Rather, they have been found living on the streets, parks, or other places not meant for human habitation.\n“The lack of shelters is due to a lack of resources, and we don’t really have a plan to end homelessness,” said Christopher Martin, legislative advocate at Housing California. “We don’t have strong programs to end homelessness on the state level. We know the shelters are a part of the solution, but at the end of the day, we know that we need exits for the shelters.”\nSource: Department of Housing and Urban Development.\nWhere are California’s homeless?\nIn 2017, Los Angeles County had the highest population of homeless individuals in all of California at roughly 55,000, and was only second to New York for holding the largest population of homeless people in the nation. And while 95 percent of New York’s homeless population was sheltered, only 25 percent of those in Los Angeles were sheltered.\nSource: Department of Housing and Urban Development.\nOn the positive side, 2018 marked the first time in four years the homelessness count in Los Angeles actually dropped.\nMartin said that this decrease was driven by Los Angeles’s $40 million Flexible Housing Subsidy Pool, which provides rental subsidies to local residents experiencing homelessness.\nWho are the state’s homeless?\nClick on the inner circles to see more detail about California’s homeless population. A chronically homeless individual has been on the streets for a year or more or has a serious mental or physical illness.\nSource: Department of Housing and Urban Development.\nThe majority of California’s unsheltered homeless population is chronically homeless, meaning that they have been homeless for a year or more or have experienced at least four episodes of homelessness in the past three years. Chronically homeless individuals are marked by serious mental or physical illnesses.\nCalifornia comprises 12 percent of the nation’s population of homeless families with children. From 2016 to 2017, the state experienced one of the largest increases of homeless families in the nation, leaving 1,000 more families on the streets.\nOutside of homeless families, California also reported the largest number of unaccompanied homeless youth, which includes any individual under the age of 25 who does not live with a family member. Overall, 58 percent of the nation’s unsheltered homeless youth resides in California.\nThe state is also home to 29 percent of the nation’s homeless veterans, and two-thirds of them are unsheltered.\nWhat’s being done to address the problem?\nThe state budget has set aside nearly $5 billion for housing affordability and homelessness in 2018-19. More than $600 million were allotted to specific homelessness response programs, which include measures to establish permanent housing, provide support for mental health services, and assist homeless youth and victims of domestic violence.\nA breakdown of California’s new homeless spending\nSource: California Department of Finance","url":"https://calmatters.org/articles/homeless-in-california-what-the-data-reveals/"}
