{"authors":["Associated Press"],"date_download":"2018-10-23 00:08:01","date_modify":"2018-10-23 00:08:01","date_publish":"2016-01-28 13:39:55","description":"BERLIN (AP) — It's a change of heart that Iraqi immigrant Sekvan Agho never saw coming. Agho was among the wave of nearly 1.1 million asylum-seekers who came...","filename":"data/vaneerConsumption/HomesickandfedupIraqirefugeesinGermanyheadhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:427d8d71d14744d0bda35f798bee66eb-4vVdYopwYQ7f641721b07adcebda-248_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420964_Homesick-fed-Iraqi-refugees-Germany-head-home_1540253281.html","title":"Homesick and fed up: Iraqi refugees in Germany head home","title_page":"Homesick and fed up: Iraqi refugees in Germany head home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Homesick and fed up: Iraqi refugees in Germany head home\nBERLIN (AP) — It's a change of heart that Iraqi immigrant Sekvan Agho never saw coming.\nAgho was among the wave of nearly 1.1 million asylum-seekers who came to Germany last year seeking a new life, making his way from his native Iraq to Turkey, then across the seas to Greece before tramping north and eventually making it to Berlin. The thousand-mile journey is grueling — borders to cross, smugglers to pay, trains and buses to scramble for a seat on and miles in-between to trudge on foot in all sorts of weather.\nYet only three months later, the 26-year-old stood in line Wednesday at the German capital's Tegel Airport, his newly-issued, yellow one-time-use Iraqi passport in hand, getting ready to head home to Kurdistan on an Iraqi Airlines flight.\nIn this Jan. 26, 2016 photo Hussein Hotuman from Iraq, holds his travel documents at the 'Golf Reisen' (Gulf Travels) travel agency of Alaa Hadrous in Berlin, Germany. Homesick and tired of waiting for Germany¿s backlogged bureaucracy, a steady stream of Iraqis are heading home on their own. (AP Photo/Michael Sohn)\nAgho said Germans treated him well, but the country just wasn't what he expected. The daily drudgery and boredom as he waited for his asylum request to be processed also didn't help.\n\"I'm not saying that Germany is not nice. It is nice, but it's for European people,\" he told The Associated Press before getting on board his flight.\nAgho is one of a small but steady stream of asylum-seekers who are voluntarily returning home.\nAs Germany struggles to cope with the sheer number of would-be refugees who entered last year, the government has been encouraging people to return home on their own, and 37,220 did so last year. All but about 5,000 of those, however, were from Balkan nations with little hope that their asylum request would be granted.\nOthers have much stronger asylum cases due to conflict in their homelands. Nearly 122,000 Iraqis arrived in 2015 and only 724 went home. Similarly, 309 Afghans voluntarily went home, as did 148 Pakistanis, though only seven Somalis and 13 Syrians chose to return to their restive nations.\nIraqi Airlines spokeswoman Andesha Karim said about 40 of the 180 passengers on the weekly Wednesday flight from Berlin to the Iraqi city of Erbil were asylum-seekers who had decided to head home. She said the airline sees about the same numbers each week, and also on flights from Duesseldorf to Erbil and from Frankfurt to Baghdad.\nHameed Majeed, who sells tickets to the flights directly at the airport and also from his travel agency in Berlin, said asylum-seekers typically pick up temporary travel papers from the Iraqi Embassy, then head directly to the flight home.\n\"If they wait, then that means that they have to live another week in an asylum home and they have no patience,\" he said.\nMajeed said he hadn't heard of asylum-seekers returning home because they felt treated badly or feared attacks by the far-right, more that their expectations were so high that many grew quickly disillusioned as they found themselves dealing with backlogged bureaucracy with hundreds of thousands of others, put up in temporary housing and unable to work or go to school.\nGermany has been working to streamline those processes, although is still struggling to deal with the unexpectedly vast number of people who arrived last year.\n\"They came here with a big dream, and then go to an asylum home and see it's a gym with 300 people,\" Majeed said. \"They're disappointed.\"\nThat disappointment is keenly felt.\nHussein Hotuman, 27, lost his job as a tailor in Iraq after his company shut down and said he came to Germany hoping to start over. He had plans to go to school, work, and eventually start his own business. Yet only one month in, however, he decided to head home on the same flight as Agho.\n\"A lot of people I met have been here for more than a year and haven't had any opportunity,\" he said. \"I couldn't wait that long.\"\nAgho said his epic journey across the continent was worth it even though it didn't work out.\n\"It was my heart's desire to come to Europe. I've seen it, and that's it,\" he said, adding that he planned to go back to serving in the Kurdish government's Peshmerga militia forces when he returns.\nAgho said his parents had to wire him 370 euros ($404) to purchase his one-way ticket home as he'd been unable to earn any money while in Germany. Still he considered the money well spent.\n\"As soon as I'm back on Kurdish soil, I'll kiss the ground,\" he said.\n_____\nKerstin Sopke contributed to this story.\nIn this Jan. 26, 2016 photo Hussein Hotuman from Iraq, holds his travel documents at the 'Golf Reisen' (Gulf Travels) travel agency of Alaa Hadrous in Berlin, Germany.Homesick and tired of waiting for Germany¿s backlogged bureaucracy, a steady stream of Iraqis are heading home on their own. (AP Photo/Michael Sohn)\nIn this Jan. 27, 2016 picture the flight connection from Berlin to Baghdad and Erbil in Iraq are displayed on a destination board at Tegel airport in Berlin, Homesick and tired of waiting for Germany¿s backlogged bureaucracy, a steady stream of Iraqis are heading home on their own. (AP Photo/Markus Schreiber)\nIn this Jan. 27, 2016 picture a man waits in front of the check-in counter for the flight connection Baghdad and Erbil at the airport Tegel in Berlin. Homesick and tired of waiting for Germany¿s backlogged bureaucracy, a steady stream of Iraqis are heading home on their own. (AP Photo/Markus Schreiber)\nIn this Jan. 27, 2016 picture people line in front of the check-in counter for the flight connection Baghdad and Erbil at Tegel airport in Berlin. Homesick and tired of waiting for Germany¿s backlogged bureaucracy, a steady stream of Iraqis are heading home on their own. (AP Photo/Markus Schreiber)","url":"https://www.dailymail.co.uk/wires/ap/article-3420964/Homesick-fed-Iraqi-refugees-Germany-head-home.html"}
