{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 04:47:53","date_modify":"2018-10-23 04:47:53","date_publish":"2016-01-28 20:51:51","description":"Abe Hagenston, who has been homeless in Detroit for around seven years, said he came up with the idea of using a mobile card reader while trying to save money for new prescription glasses.","filename":"data/vaneerConsumption/HomelessmannicknamedHonestAbenowacceptscardpaymentsviaSquare.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD413200000578-0-image-a-24_1454014082129.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421601_Cash-credit-Homeless-man-nicknamed-Honest-Abe-accepts-card-payments-reader-attached-smartphone_1540270073.html","title":"Homeless man nicknamed 'Honest Abe' now accepts card payments via Square","title_page":"Homeless man nicknamed 'Honest Abe' now accepts card payments via Square | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Abe Hagenston, nicknamed 'Honest Abe', claims to have been living rough on the streets of Detroit for seven years under an 8 Mile overpass\nAnyone who has been to a large city will be familiar with being asked if they can 'spare some change' by homeless men on the streets.\nHowever, that call could become a thing of the past now that one rough sleeper in Detroit has started accepting card payments via a reader attached to his smartphone.\nAbe Hagenston, who calls himself 'Honest Abe', told CBS Detroit that he began accepting the payments while trying to save up cash for a new pair of prescription glasses.\nHagenston told reporters that he has been on the streets for seven years, and lives underneath the 8 Mile overpass where it crosses Interstate 75.\nWhile he would usually have spent the winter shoveling snow to make extra cash, Hagenston said this year's mild weather has left him with nothing to do.\nSo instead of going to work, Hagenston said he and several other vagrants from around the city have organized 'like a union'.\nNow they take it in turns to panhandle across certain zones of the city before splitting the money they make between themselves.\nAs part of the team's efforts to rake in more cash, 'Honest Abe' acquired a mobile card reader from tech company Square.\nHagenston also appears to have a Facebook page with a Myspace account linked to it that goes under the name of 'Honest Abe'.\nAccording to information on those profiles he graduated from LaBelle High School in Idaho in 1992 and studied at Edison State College in Florida.\nHe also claims 'consultant' as his occupation, but gives no details on whether he is still employed or what company he works for.\nDespite living on the streets Hagenston appears to have a Facebook page (left) where he describes himself as a 'consultant', and has tried to use technology to make money before (right)\nIn March last year Hagenston (pictured) founded the new-defunct Spanging.com where he offered to complete odd jobs such as window washing and yard cleaning in return for money\nAn image uploaded to the Facebook profile appears to show a young boy leaning on his chest, thought Hagenston's face is not visible.\nThis is also not the first time that Hagenston has attempted to use technology to make money, having previously founded website Spanging.com, according to another CBS story.\nThe site, named after a slang word for begging, was designed to attract offers of work from concerned passersby, with services on offer including yard work, painting, and window washing.\nSquare is a tech firm founded by former Twitter CEO Jack Dorsey and provides businesses with payment methods based around smartphone and tablet technology.\nThe smallest credit card readers, which plug into Apple or Android smartphones, are usually free to acquire with Square making its money by charging a 2.75 per cent fee on each transaction.\nThe owner of the reader is then paid all their earnings the following day by direct debit into a bank account.\nThe readers, which can be upgraded to include a contactless sensor or a tablet attached to a swivel-stand, were designed for start-up stores or businesses with no fixed location - such as market stands or food carts.\nAbe claims to be the first homeless person in America to make use of the technology.\nHe added: 'I take VISA, MasterCard, American Express. I’m the only homeless guy in America who can take a credit card. It’s all done safely and securely through Square.com.'","url":"https://www.dailymail.co.uk/news/article-3421601/Cash-credit-Homeless-man-nicknamed-Honest-Abe-accepts-card-payments-reader-attached-smartphone.html"}
