{"authors":["Myra Butterworth For Mailonline"],"date_download":"2018-10-23 01:06:28","date_modify":"2018-10-23 01:06:28","date_publish":"2017-03-10 08:45:12","description":"The biggest gap was in London's Haringey, where the average home rose in value by £91,000 more over two years than the median earner living there took home after tax.","filename":"data/vaneerConsumption/Homeownersearnmorefrompropertythanfromwork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/08/10/3E10E49F00000578-0-image-a-10_1488968156918.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-4290586_Homeowners-earn-property-work_1540256788.html","title":"Homeowners 'earn’ more from property than from work","title_page":"Homeowners 'earn’ more from property than from work  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Homeowners are 'earning' more from their properties than from turning up for work, new research suggests.\nThe average rise in house prices is outstripping post-tax earnings in a third of local authority districts, according to the report by Halifax, which highlights the gulf between wages and property inflation that is triggering a property crisis.\nThe biggest gap between house prices and earnings is in London's Haringey, where the average home rose in value by £91,000 more over two years than the median earner living there took home after tax.\nThe biggest gap between house prices and earnings is in the London borough of Haringey\nHarrow-on-the-Hill in north London has a house price growth to earnings difference of £77,791\nHaringey, in North London, covers an area that includes parts of Finsbury Park, Wood Green, and Tottenham - all areas not typically considered expensive, but which have seen house prices rise rapidly in recent years.\nThe huge gap there was down to house prices in the area rising by an average of £139,000 in the last two years, while median take-home earnings for those living there were £48,353 during the same period.\nThat is a difference of £91,450, or the equivalent of £3,810 per month, according to the report by Halifax.\nThe figures highlight how even in locations not traditionally considered upmarket, house prices are spiralling beyond the reach of the average family.\nThis is contributing to a property market increasingly divided into 'haves' and 'have nots', where those not yet on the property ladder - or who are on its lower rungs - face an almost impossible struggle to save the deposit needed to buy a home, or move to a bigger one.\nHaringey is followed by Harrow, also in north west London, with a house price growth to earnings difference of £77,791, while Waltham Forest, in East London, sits in fourth with a gap of £63,646.\nWaltham Forest is again an area that has not traditionally been expensive, but has seen prices rocket as first-time buyers and families have been pushed further out from the centre of London. Areas such as Walthamstow, which sits within the borough, have seen prices soar.\nOne area that has for many years been pricey also featured in the top three. The popular commuter city of St Albans, in Hertfordshire, which also includes the neighbouring town of Harpenden, had a price gap of £72,995.\nThis highlights how even wealthy areas have seen prices rise far above the wages of the people who live there.\nLondon boroughs dominate the top 10 list of local authorities where house prices outstripped earnings, with others featuring in it including Newham, with a gap of £63,583, Redbridge at £56,528, and Hounslow at £54,569.\nSt Albans in Hertfordshire has a price growth to earnings difference of £72,995\nHOUSE PRICES VS EARNINGS - TOP 10 IN THE LAST TWO YEARS Local Authority Region Two-year change in house prices £ Net median earnings over two years (2015-2016) £ Two-year difference in house prices v earnings £ Haringey London 139,803 48,353 91,450 Harrow London 128,841 51,050 77,791 St Albans East of England 131,645 58,651 72,995 Waltham Forest London 111,076 47,430 63,646 Newham London 107,302 43,719 63,583 Watford East of England 113,704 51,133 62,571 Slough South East 103,175 44,796 58,379 Redbridge London 109,866 53,337 56,528 Three Rivers East of England 106,135 49,985 56,151 Hounslow London 101,940 47,281 54,659 Source: Halifax, ONS\nHow house prices are running away from earnings\nAcross the UK as a whole, property price rises outstripped post-tax earnings in 31 per cent of local authorities, up from 28 per cent in 2015, the report revealed.\nYet, while this means that almost 70 per cent of areas at least saw post-tax wages match the rise in house prices, the property problems facing people living there remain substantial.\nEven in South Tyneside, in the North East, where median net earnings of £39,033 were higher than the £35,709 change in house prices, someone hoping to buy the average home would have had to save all but £3,324 of their post-tax earnings just to match the rise in the cost of the property.\nBut rapidly rising house prices are not just a problem for those who are not yet on the housing ladder, families hoping to trade up to a bigger home are also struggling as property values climb by far more than their wages.\nBridging this gap involves borrowing larger sums on a mortgage. But with wages rising at a slow pace, borrowers are reliant on record low interest rates enabling them to do so.\nMartin Ellis, housing economist at Halifax, said: 'Buoyancy in the housing market over the past two to five years has resulted in homes increasing in value by more than total take-home earnings for the average homeowner in many areas, though mostly in southern England.\n'While it's no longer unusual for houses to 'earn' more than the people living in them in some places, there are clearly local impacts.\n'Homeowners in these areas can build up large levels of equity quickly, but for potential buyers whose wages have failed to keep pace, the cost of buying a home has become more unaffordable during that time.'\nFigures released by rival mortgage lender Nationwide, last week showed house prices up 4.5 per cent in the year to February, while the latest ONS figures showed wages up by 2.6 per cent in the year to December 2016.","url":"https://www.dailymail.co.uk/property/article-4290586/Homeowners-earn-property-work.html"}
