{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-23 02:00:18","date_modify":"2018-10-23 02:00:18","date_publish":"2017-04-26 12:55:12","description":"Cleveland house, pictured was built 200 years ago and spent was the former home of the Kennet and Avon Canal Company where Isambard Kingdom Brunel worked before moving to the Great Western Railway company.","filename":"data/vaneerConsumption/HomewhereIsambardKingdomBrunelworkedupforsale.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F945100000578-0-image-a-37_1493208737987.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447460_Home-Isambard-Kingdom-Brunel-worked-sale_1540260018.html","title":"Home where Isambard Kingdom Brunel worked up for sale","title_page":"Home where Isambard Kingdom Brunel worked up for sale | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The historic former workplace of engineer Isambard Kingdom Brunel has been converted into a 'mini-palace' that is now on the market for £3.5million.\nCleveland House has mostly been used as offices in its 200-year history and was originally built to be the headquarters of the Kennet & Avon Canal Company.\nNow the Grade II listed property, in Bathwick, Bath, has been completely refurbished and turned back into a stunning five-bedroom home for sale with estate agents Carter Jonas.\nCleveland House, pictured, was the former workplace of renowned railway engineer Isambard Kingdom Brunel\nCleveland House was initially called Canal House and was the headquarters for Kennet and Avon Canal Company\nThe £3.5 million property has been extensively renovated and has been put up for sales as a 5-bed family home\nThe 200-year-old structure is a Grade II listed building but has been renovated ot the highest possible standards\nCleveland House was originally called Canal House and was built for the Duke of Cleveland but leased to the Kennet & Avon Canal Company as their headquarters.\nIt was designed by John Pinch the Elder - who was responsible for many of the Georgian buildings in Bath - and was built between 1817 and 1820.\nIt is believed Brunel worked there in the 1830s. In 1832 he was appointed to survey a route for the Great Western Railway from London to Bristol and the following year Brunel was made chief engineer of the company, which eventually took over the canal company in 1852.\nWhen the company left this property in 1864 it was then used as a house until it was requisitioned by the Government in 1939.\nAfter many years housing the Property Services Agency, it was most recently an office for a chartered accountants firm until the Trevor Osborne Property Group took on the task of turning it into a private home for the first time in almost 80 years.\nThe house has the 173-foot long Cleveland tunnel running underneath it and there's even a trapdoor to access the waterway\nIsambard Kingdom Brunel worked for the Kennet and Avon Canal company before the Great Western Railway\nThe house straddles the canal with the Cleveland tunnel running underneath it - a 173ft-long tunnel which still has a trap-door leading into the house.\nIt has been praised by British Listed Buildings as 'one of the most architecturally refined buildings connected with canals, remarkable for its visual, structural and functional relationship with the canal tunnel beneath'.\nAnd the Canal & River Trust said 'Cleveland House is one of the treasures of the Kennet & Avon Canal' and described it as one of the first purpose-built office blocks in Europe.\nThe house has a striking new kitchen/breakfast room with an Aga, solid oak cabinets and granite worktops, a formal dining room with an attractive fireplace, a study/library, a newly-built family room, two bedroom suites with opulent marble bathrooms, three further bedrooms, a media/film room and the original wine cellar.\nThe original boardroom, which is 30ft long and has a 20ft-high domed ceiling, has been converted into a stunning drawing room. It is decorated with newly commissioned landscape panels by Irish artist Michael Dillon and has a feature fireplace and original shutters on the windows with beautiful views over the canal and across to Sydney Gardens.\nThe house is well within the Bath Conservation area zone and was initially designed as a commercial building - not a home\nThe gardens are the only remaining 18th century pleasure gardens in the country and Jane Austen was among the guests who attended events there.\nA spokesman for Carter Jonas said: 'As one of the outstanding period property launches of this year, Cleveland House is a building of great architectural value and historic significance and a landmark in the legacy of renowned Georgian architect John Pinch the Elder.\n'As a freestanding building it is notable for being designed for a specific commercial tenant, yet essentially domestic in style.\n'The house is situated in a prime position within the Bath Conservation Area and the UNESCO World Heritage Site. It has undergone a complete refurbishment overseen by heritage experts, resulting in the creation of a truly exceptional Bath residence.\n'The highest quality restoration has ensured the retention and replacement of a wealth of period features, whilst skilfully incorporating the latest technology.\n'The original boardroom is now the stunning drawing room, a rare gem.'\nThe magnificent property is landmark in the legacy of renowned Georgian architect John Pinch the Elder","url":"https://www.dailymail.co.uk/news/article-4447460/Home-Isambard-Kingdom-Brunel-worked-sale.html"}
