{"authors":[],"date_download":"2018-10-22 22:28:51","date_modify":"2018-10-22 22:28:51","date_publish":"2014-06-10 04:14:40","description":"“You have options and you decide which one you want to take, and I took education because it takes you for the long run,” Rashema Melson said.","filename":"data/vaneerConsumption/HomelessValedictorianEarnsScholarshiptoGeorgetown.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/498276/140609-rashema-melson-jms-2134_70cd0c6eab49647fc8da2bb817a14206.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_homeless-valedictorian-earns-scholarship-georgetown-n127041_1540247331.html","title":"Homeless Valedictorian Earns Scholarship to Georgetown","title_page":"Homeless Valedictorian Earns Scholarship to Georgetown","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCWashington.com\nA D.C. high school student who spent her junior and senior years living in a homeless shelter did not let that hold her back from rising to the top of her class.\n“You have options and you decide which one you want to take, and I took education because it takes you for the long run,” 18-year-old Rashema Melson said. “It’s not just a temporary thing or won’t just last for five years. Education will take me far.”\nHer father was killed before her first birthday. The past two years she's been living at the D.C. General homeless shelter.\n“There’s no furniture … there’s no refrigerator,” she said. “It’s just a place to be content with until you get to where you want to be.”\nDespite the setback, Rashema is this year’s valedictorian at Anacostia High School and will head to Georgetown University on a full scholarship.\n“Her story and her resilience, just her character and personality traits will impact the lives of a lot of people because she’s always optimistic,” Anacostia Principal Ivan Roberts said.\nThe message in the commencement speech Rashema will deliver Wednesday is also her approach toward life.\n“Just to keep going no matter what and don’t let anything keep you down, because you will get put down but you have to get back up,” she said.\nShe advises other to take the hard route.\n“Don’t do the easy route and just settle for what you have,” Rashema said. “Never settle for less.”","url":"https://www.nbcnews.com/news/us-news/homeless-valedictorian-earns-scholarship-georgetown-n127041"}
