{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-22 22:18:16","date_modify":"2018-10-22 22:18:16","date_publish":"2016-01-28 10:14:44","description":"The owner from Portland, Oregon, left the note (pictured) in the 1990s Honda Civic and four days after it was stolen, she got a call from a passerby who had seen it left on the dash and dialed her number.","filename":"data/vaneerConsumption/Hondaownerofcarthatisconstantlygettingstolenleavessnarkynote.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A8457800000578-0-image-a-6_1453975515131.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420657_If-reading-probably-stealing-car-Owner-beat-Honda-constantly-getting-stolen-leaves-snarky-note-glove-box-asking-thief-leave-won-t-towed-worked_1540246696.html","title":"Honda owner of car that is 'constantly getting stolen' leaves 'snarky' note","title_page":"Honda owner of car that is 'constantly getting stolen' leaves 'snarky' note | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The owner of a car that is 'constantly getting stolen' got the vehicle back after leaving a hilarious note in the glovebox asking the thief to leave it somewhere it won't get towed.\nThe woman, from Portland, wrote the note two years ago after the black 1990s Honda Civic was first stolen, and it asked that the criminal put it on the dash when they abandon the vehicle.\nThis time around, the thief did as they were asked, and four days after the theft, she got a call from a passerby who saw the note and let her know where the vehicle was.\nScroll down for video\nThe owner of a car that is 'constantly getting stolen' got the vehicle back after leaving a hilarious note in the glovebox asking the thief to leave it somewhere it won't get towed\nAfter getting the car back, they posted the note on Reddit, with the caption: 'I left a snarky note in the glovebox of my Honda the last time it was stolen. Just recovered the car from the most recent theft. They read my letter and I think it worked; they ditched it in front of a house this time (YAY).'\nThe note said: 'If you're reading this, you are probably stealing my car. I'm a nice person and likely would have give you a ride but obviously we're past that.\n'I would love to afford a car that doesn't get stolen and burglarized all the time, but I'm broke and this is what I'm stuck with. So, you got me, again.\n'You're not going to get in trouble for stealing my car, as long as you don't f*** around and kill a pedestrian, you'll just leave this somewhere and go about your business. Nobody investigates this tomfoolery.\n'One quick favour, please to not leave my car somehwere it will get towed. If I have to deal with one more f****** impound lot holding my stolen s***** Honda for ransom, I am going to lose my mind. And my car, because I can't afford to keep bailing it out of car jail. If I had any money, I would just go and buy a goddamned car that wasn't constantly getting stolen in the first place.\n'Please just leave my old piece of s*** car in a neighbourhood or something. There's a note in this envelope, just stick it to the dash or under the wiper. A passerby will see it eventually and call me and then I can come and get the car. No cops, no questions asked; I'm not even mad at you.\n'It's win-win: I don't have to deal with police reports, insurance claims and tow trucks and you don't have to feel like a jerk for ruining the month of a nice person.'\nA black 1990s Honda Civic, similar to the one that went missing in Portland, Oregon, before the owner got it back after four days, thanks to the note\nAt the end, it adds: 'Thank you. Enjoy your ride.\n'PS, if you don't mind committing another misdemeanour tonight, feel free to go and throw a brick through the window of ******** Towing in Vancouver. They are literally the f****** worst. Thanks. Have a good night.'\nSome users questioned why the car was getting stolen so often but the woman who poster it, 'mfiasco', said that 1990s Hondas have a vulnerable locking system.\nIt's win-win: I don't have to deal with police reports, insurance claims and tow trucks and you don't have to feel like a jerk for ruining the month of a nice person\nShe wrote: 'Hondas are being stolen all over Portland. When I was picking mine up today there was a lady circling THAT block, looking for hers which was also stolen. It's a major problem over the last few years and it's getting worse.\nAnother user agreed, writing: 'I live in Portland. When I had a Honda, they stole it. They left it in Longview, where it was naturally towed. The towing really is the worst part. I'm a goddamned crime victim and I'm paying hundreds.\n'You just can't really believe it when it's happening. Oh. And the tow company was a block from where the thieves left the car! So 275 bucks for a 1 block haul.'\nThe user also said she has another car, a Sedan, so the theft wasn't too much of an inconvenience - and the hapless thief even left their jacket in the car.","url":"https://www.dailymail.co.uk/news/article-3420657/If-reading-probably-stealing-car-Owner-beat-Honda-constantly-getting-stolen-leaves-snarky-note-glove-box-asking-thief-leave-won-t-towed-worked.html"}
