{"authors":["Matthew Debord"],"date_download":"2018-10-30 21:39:40","date_modify":"2018-10-30 21:39:40","date_publish":"2016-12-19 00:00:00","description":"I immediately dubbed the new Ridgeline a \"Honda King Cab-amino.\"","filename":"data/vaneerConsumption/HondaRidgelinepickupREVIEW.json","image_url":"https://amp.businessinsider.com/images/58583b9ba1a45e46008b6d57-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_honda-ridgeline-pickup-review-2016-12_1540935580.html","title":"Honda Ridgeline pickup: REVIEW","title_page":"    Honda Ridgeline pickup: REVIEW - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A heckuva truck. Honda The United States of America is a pickup-truck nation.\nNo people on Earth adore their bed-in-the-back vehicles more than Americans, who will purchase something on the order 2.5 million pickups by the end of 2016.\nMany of these trucks will be built by the major players: Ford, Chevy, GMC, and Ram (part of Fiat Chrysler Automobiles).\nA few more will come from Toyota and Nissan.\nThen there's Honda.\nYes, Honda. The company that brings us the Odyssey minivan, the Civic sedan, and the CR-V crossover — as well as Business Insider's 2016 Car of the Year, the Acura NSX supercar — has been selling a pickup since 2005, when the first Ridgeline was introduced.\nThe Ridgeline has always been an offbeat pickup. It uses unibody construction, more akin to a car or crossover SUV than the industry-standard body-of-frame approach favored by the big truckmakers. Honda has typically marketed it to the youthful outdoors enthusiast, the person who wants to use his Ridgeline to haul around mountain bikes or whitewater kayaks, not someone who needs a serious work truck. Towing capacity has never been mega-high — it maxes out at around 5,000 lbs. — so you could pull a modest trailer, but forget about anything more hulking.\nSales have never been stunning, and they peaked in the first few years after the truck rolled out; my theory is that as the truck-and-SUV market recovered after the financial crisis, a lot of pickup buyers went for the full-size stuff and passed on the compact/mid-size Ridgeline, or decided to go for a crossover SUV instead.\nThe first-gen Ridgeline. NHTSA\nA new beginning\nHonda dropped the first-generation Ridgeline from the lineup in 2014, but the most unusual pickup on the market is back with a second-generation for the 2017 model year. The carmaker let us borrow a very well-equipped Ridgeline, priced at $41,370, and we tested it for a week in the suburbs of New Jersey, just as winter was getting chilly in the Northeast.\nThe car-like, unibody, front-wheel-drive platform has been retained, but our tester had all-wheel-drive. Pickups are typically based on rear-wheel-drive platforms, and why you notice right away about the Ridgeline is how much it doesn't drive like a truck. It drives exactly like a Honda car or crossover and was eerily reminiscent of my Odyssey minivan, from when I lived on the West Coast.\nThis is a good thing. You can whip the Ridgeline around like nobody's business. It's the easiest pickup I've ever driven by a long, long shot. In fact, in spirit this truck suggest to me a modern-day El Camino, the half-car, half-pickup that Chevy sold mainly from the early 1960s through the late 1980s, and that has achieved cultlike status.\nHalf car, half truck, all El Camino. Chevrolet\nCar lovers have been bugging General Motors to bring back the El Camino — and Ford, too, because that automaker had its own version, the Ranchero — to no avail. I always thought the pestering of Chevy was pointless precisely because the Ridgeline was around.\nThe first-generation had an unusual design that featured a short bed with relatively high side buttressing that appeared to join the front and back of the vehicle. It wasn't for everyone — or really anyone. With the second-gen Ridgeline, Honda has gone with a more proper pickup-truck bed, lengthened a bit. The front of the vehicle looks a lot like a Honda Pilot, as my colleague Ben Zhang immediately noted when he saw the truck.\nThe overall effect is a car-like/crossover-y prow mated to real honest-to-god pickup stern. Because there's only a four-door, crew-car option available, I immediately dubbed the new Ridgeline a \"Honda King Cab-amino.\"\nThis is the compact pickup truck you're looking for\nThe bed is now more conventionally truck-like. Honda\nI also loved the new Ridgeline absolutely to pieces. We haven't tested out very many mid-size/compact pickups at BI — our last victim was the excellent Chevy Colorado — but these are tremendously useful vehicles for life in the 'burbs. I took our test car to pick up a Christmas tree, for example. Last year, the tree wound up being tied to a roof. This year, the helpful chap at the sales lot simply heaved the tree into the roughly five-and-half-foot lined bed and we were good to go (the tree was a seven footer, but it fit neatly into the Ridgeline's bed diagonally).\nYou can always extend the bed, as well, simply by lowering the dual-action tailgate (it also opens to the side like long door) and tying stuff in place using the pickup's anchor points. The bed also had a concealed storage compartment in the floor that Honda calls a trunk, plus a power hookup and audio capability. You will be the envy of everybody in the parking lot at that next football game.\nHop back into the front and you're in a perfectly comfortable and — in the RTL-E trim level that I had — well-appointed Honda. The interior was all leather, with tri-zone climate control, heated seats, a heated steering wheel, and a perfectly good infotainment and audio system featuring an eight-inch touchscreen, eight speakers, Apple CarPlay or Android Auto capability, SiriusXM satellite radio, Bluetooth and AUX/USB connectivity, and a reasonably good hands-free voice interface.\nThe back seats are a bench design that can be folded to carry additional cargo, and although they aren't as luxurious as what you'll find in some full-size pickups these days, they get the job done. The rear window has the classic sliding window, but it operated remotely from the front.\nComfortable interior. Honda\nMay the Ridgeline be with you\nPerhaps the best thing about the new Ridgeline is Honda's 3.5-liter, 280-horsepower V6 engine under the hood. This is one of the world's great motors, perhaps the best V6 anywhere, and in Honda's case, the core of its technology. Mated to a six-speed automatic transmission, this engine is more or less perfect and provides 21 mpg in combined city/highway driving. The power is fluid, the motor never gives even the slightest indication of strain, and long highway cruises are as pleasant as jaunts around town.\nThe Ridgeline, however, isn't an inexpensive pickup. In fact, for the 41 grand out tester tipped the scales at, you can obtain a nicely optioned full-size Ford F-150. That said, Honda reliability and quality is legendary, so you're unlikely to have much to complain about, and safety for the Ridgeline is excellent — and enhanced on upper trim levels by a suite of driver-assist features, including collision mitigating braking, lane-keep assist, lane-departure warning, and adaptive cruise control. With the Ridgeline, you get what you pay for.\nNow for the obvious question: as good as the Ridgeline is, will the revamped design woo anyone away from the more \"accepted\" truck brands?\nI doubt it. The Ridgeline is still the pickup for the rest of us, and the new aesthetics aren't likely to convince hardcore Toyota Tacoma fans that they should look elsewhere.\nBut if you have an active lifestyle, like to engage in weekend home-improvement or gardening projects, or just love the idea of a Japanese-branded neo-El Camino that's built with pride in Alabama, the Ridegline makes a lot of sense.","url":"https://www.businessinsider.com/honda-ridgeline-pickup-review-2016-12"}
