{"authors":["Matthew Debord"],"date_download":"2018-10-30 23:59:01","date_modify":"2018-10-30 23:59:01","date_publish":"2016-12-05 00:00:00","description":"AI, robots, big data — these ideas are all the name the of the game now in the auto industry, as it continues to merge with the tech industry.","filename":"data/vaneerConsumption/HondaNeuVconceptcarcanfeelhumanemotions.json","image_url":"https://amp.businessinsider.com/images/58456dcfe02ba734008b76fe-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_honda-neuv-concept-car-can-feel-human-emotions-2016-12_1540943941.html","title":"Honda NeuV concept car can feel human emotions","title_page":"    Honda NeuV concept car can feel human emotions - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The NeuV. Honda For the 100-year-plus history of the automobile, cars have generated plenty of emotions.\nBut those feelings have occurred in humans. Honda is looking to change that dynamic, and is ready to showcase how at the Consumer Electronics Show in Las Vegas next month.\nIt's called the \"NeuV,\" and according to Honda it's \"a concept automated EV commuter vehicle equipped with artificial intelligence (AI) called 'emotion engine' that creates new possibilities for human interaction and new value for customers.\"\n\"Harnessing the power of artificial intelligence, robotics, and big data to transform the mobility experience, Honda today announced that 'Cooperative Mobility Ecosystem' will be the theme for its participation at the 2017 [CES],\" the automaker said in a statement.\nAI, robots, big data — these ideas are all the name the of the game now in the auto industry, as it continues to merge, sort of, with the tech industry.\nSilicon Valley and the citadels of automaking in Detroit, Japan, and Germany are now closer than they're ever been.\nThe concept car that Honda is bringing to CES is exhibit A.\nThe vehicle itself is about as emotionless as one could imagine: a techno-cube that borrows inspiration from the Google Car, currently the definitive podmobile.\nInspiration? Red Dot Design Awards for Design Concepts\nIn all seriousness, however, and emotion-generating aside (Honda might want to watch some old episodes of \"Star Trek: The Next Generation\" to see what happens with the android Mr. Data pops in his \"emotion chip\"), the design of the concept vehicle hints at a couple of trends we're likely to see become reality as commuter mobility is changed over the coming decades.\nThe NeuV is small, presumably lightweight, and obviously optimized for shuttling around cities, dealing with tight parking and heavy traffic. So-called \"city cars\" haven't' been very popular with consumers, but as technology enables more self-driving and fleet management, they're set for something of a comeback.\nThe NeuV is also a great example of what's happened to the \"dream cars\" of yesteryear — the concept vehicle that automakers created to stoke in the public charged emotions about driving.\nThe dreams are now much, much more cerebral, and the dream cars are vessels for futuristic thinking. They look, quite frankly, boring, but that's the point. It does make you wonder whether they'll ultimately wind up being bored by themselves.","url":"https://www.businessinsider.com/honda-neuv-concept-car-can-feel-human-emotions-2016-12"}
