{"authors":["Daniel Peters For Daily Mail Australia"],"date_download":"2018-10-22 21:15:46","date_modify":"2018-10-22 21:15:46","date_publish":"2016-01-28 07:05:23","description":"Honey Birdette, an Australian lingerie chain with stores all across Australia, has been found to have breached the advertising code of ethics for a raunchy Christmas campaign.","filename":"data/vaneerConsumption/HoneyBirdettelingeriechainforcedtoremoveChristmasadvertwithSanta.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A66FC700000578-0-image-a-2_1453954177766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420329_Honey-Birdette-lingerie-chain-forced-Christmas-advert-half-naked-lady-standing-gagged-Santa_1540242946.html","title":"Honey Birdette lingerie chain forced to remove Christmas advert with Santa","title_page":"Honey Birdette lingerie chain forced to remove Christmas advert with Santa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"On Thursday the ad watchdog ruled it to have breached the code of ethics\nThe Advertising Standard Bureau received a number of complaints over it\nA lingerie chain that used a half-naked woman standing over a bound and gagged Santa for a raunchy Christmas ad campaign has been found to have breached the advertising code of ethics.\nHoney Birdette, which sells lingerie and sex toys, was investigated by the Advertising Standards Bureau after complaints were made about the suggestive sexual violence content of its adverts.\nThe boutique chain has 44 stores across Australia - many of which are found in popular family shopping centres - and parents complained that the ads were on display for their children to see.\nIn a decision made public on Thursday, the ad watchdog ruled that one of the two adverts 'featuring a bound and gagged Santa' suggested a sexual scene that was inappropriate to a broader audience.\nScroll down for video\nA raunchy Christmas advertisement for an Australian lingerie chain was canned after it was found to have breached the code of ethics\nThe adverts, which aired through Christmas in stores and online, showed a scantily-clad woman standing over a bound and gagged Santa\nHoney Birdette, a boutique lingerie chain which has 44 stores across Australia, received a number of complaints on its Facebook page. Many were from parents concerned for their kids\nHoney Birdette ran two versions of the advertisement during Christmas - displayed in its stores, online and on radio.\nThe first version shows Santa lying flat on his back as a scantily-clad woman with her hands on her hips stands over him. The caption reads: 'knock Santa's socks off!'\nThe second version shows Santa tied up by the hands with rope and with a red gag over his mouth, as the same woman bends her knee into him, with the accompanying text: 'Silent night…'\n'The connection between Santa and sex is so wrong,' wrote one complainant. 'Santa is bound and gagged in a somewhat demeaning activity (bondage), which is displayed at my children's eye-level.'\n'The ad uses an easily recognisable childhood icon - Santa Claus - to draw attention to advertising for a sex shop which masquerades as a high end lingerie store,' wrote another.\nParents also took to Facebook to express their frustration that the 'sexualised' posters and window displays were in full view of their young children.\n'You guys should be ashamed. This image is in Rundle Mall for my nine year old daughter to see. A shop like yours should not be in a family shopping precinct,' an Adelaide woman wrote on Facebook.\n'Children everyday walk past your shop and see an extremely sexualised woman dominating Santa. Do you not believe that children have a right to be safe and protected from these images?,' another woman wrote.\nHoney Birdette responded to the advertising watchdog's decision by agreeing to remove some of their signage.\n'The signage at our Rundle Mall, Charlestown and Chermside stores have all been removed. All of the stores are receiving new signage today. The image will no longer be visible.'\nComplaints were made by to both the Advertising Standards Bureau and Honey Birdette's Facebook page\nHoney Birdette disagreed with claims that their advertisements objectified women, saying their products were made by women with the 'aim being to empower them - not depict them as a sexualised objects'\nNot the first time: A poster of this woman (on show in Honey Birdette stores), wearing a red corset and bra, skin-coloured tights and opaque nipple protectors was banned back in 2012\nOne objection Honey Birdette were unable to agree with was that their advertisements objectified women.\n'Is it so difficult to see that your santa ad is objectification of a woman rather than a positive expression of sexuality?,' one woman wrote on their official Facebook page.\n'A great sex life doesn't come wrapped in expensive lingerie or idiotic poses. That ad is not sexy it is messed up. Celebrate sexuality NOT the objectification of women.'\nThe lingerie retailer responded by saying their products were made by women for women, with their 'aim being to empower them not depict them as a sexualised objects.'\n'In order to market and advertise lingerie, we need to show a model wearing it, however we do this in a way that empowers women rather than demean or degrade them. The image in question actually shows a very confident and composed woman in control of her environment.'\nIt's not the first time the retailer has been the subject of public scrutiny for their controversial marketing schemes - in 2012 a poster of a lingerie model with her nipples covered by opaque pasties and headlined 'It's burlesque baby,' was banned.\nTwo other complaints regarding posters aired in 2013 and 2014 were also investigated by the Advertising Standards Bureau, but both were dismissed.\nIn 2012 a PR firm staged a fake protest in Sydney's Pitt Street Mall to advertise Honey Birdette. Models dressed in lingerie marched down the popular street holding placards reading: 'I heart HB', 'Spoil me rotten' and 'Happy wife = Happy life.'\nOne woman believed the Christmas campaign celebrated the objectification of women rather than sexuality","url":"https://www.dailymail.co.uk/news/article-3420329/Honey-Birdette-lingerie-chain-forced-Christmas-advert-half-naked-lady-standing-gagged-Santa.html"}
