{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:55:08","date_modify":"2018-10-30 20:55:08","date_publish":"2016-02-08 17:25:17","description":"A hard left, foreign-funded campaign group has blamed Polish immigrants for a rise in violent Neo Nazi activity in the UK last year.","filename":"data/vaneerConsumption/HopeNotHateTurnsOnImmigrantsInReportThatSlamsWhiteSupremacistPoles.json","image_url":"https://media.breitbart.com/media/2016/02/Screen-Shot-2016-02-08-at-15.42.05.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_08__1540932908.html","title":"Hope Not Hate Turns On Immigrants In Report That Slams White Supremacist Poles","title_page":"Hope Not Hate Turns On Immigrants In Report That Slams White Supremacist Poles | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A hard left, Wall Street-funded campaign group has blamed Polish immigrants for a rise in violent Neo Nazi activity in the UK last year. They also appeared to confuse PEGIDA walkers with Neo Nazis, and said that violence committed by “anti-fascists” was the highlight of 2015.\nHope Not Hate (HnH) made the claims in its annual ‘State of Hate’ report. The group recently branded a hijab-wearing Muslim woman campaigning against Sharia an “extremist”, and have worked hand in hand with Unite Against Fascism, whose marches were attended by hate preacher Anjem Choudary and the convicted terrorist murders of British solider Lee Rigby.\nIn the report, the authors write that although the influence of “far right” groups such as the BNP and EDL declined significantly last year, “the numbers of those involved in more militant and violent groups are growing”.\n“Britain’s far right continues to be isolated and in retreat. Splintered and fractured, it is leaderless and rudderless. However, because of all this, it is becoming more extreme and violent”, they say.\nThey point to groups such as regional “Infidel” fascist gangs like the North West Infidels (NWI), led by Blackburn-based Shane Calvert, who are pursuing a more confrontational agenda.\nSuch groups are increasingly allying themselves with a growing number of foreign-born Neo Nazis living in the UK. One of the most active groups is called Narodowe Odrodzenie Polski, meaning “the national rebirth of Poland”.\nThis assertion appears to have truth to it. About half of the attendees at a Neo Nazi rally outside Downing Street in July, reported by Breitbart London, were indeed Poles from Odrodzenie Polski.\nFurthermore, Polish Neo Nazis are currently planning a march in Manchester this month in support of a “British white country”, which they have called: “Fuck Islam & Isis”. Intelligence indicates that the North West Infidels are planning to join them.\nWhilst rightly condemning all forms of violence committed by the “far right”, HnH said that the “best” part of the year was when “anti fascists” used violence and intimidation against groups they campaign against. They write of “the humiliation and bruised faces from Liverpool” after Neo Nazis were left “scrambling to pull down the shutters of Liverpool Lime Street’s s left luggage office in a bid to save themselves from pursuing anti-fascists”.\nThey also say that the reason the BNP has died out but PEGIDA continues to grow, is because “Counter-Jihadism is, in the present circumstances, far more likely to have resonance than either the racial nationalism of [Nick] Griffin or the conspiratorial anti-Islam and anti-Zionist rhetoric of the Christian evangelical [Jim] Dawson”.\n“In terms of the Counter-Jihad movement, primarily a cultural rather than racial nationalist ideology, international cooperation is a central aspect of its plan of resistance”, they add.\n“However”, they add, “It would appear that [Tommy Robinson’s] stock is not as high as he thinks. If he really believes that he can build a respectable middle-class movement, like Pegida, in the UK, he is badly mistaken.\n“Not only is he badly damaged goods but the people who he has surrounded himself with in the Pegida leadership – Paul Weston and Anne Maria Waters – are both politically extreme and unlikely to attract any normal people.”","url":"https://www.breitbart.com/europe/2016/02/08/hope-not-hate-blames-polish-immigrants-for-more-neo-nazi-violence-get-confused-about-pegida/"}
