{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:30:51","date_modify":"2018-10-30 19:30:51","date_publish":"2016-03-14 20:24:40","description":"The Pacific El Niño is back with a vengeance — and with it, the hope that California can climb out of its devastating, four-year-long drought.","filename":"data/vaneerConsumption/HopeforEndtoDroughtasElNioFillsCaliforniaReservoirs.json","image_url":"https://media.breitbart.com/media/2016/03/Shasta-Dam-Rich-Pedroncelli-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_03_14__1540927851.html","title":"Hope for End to Drought as El Niño Fills California Reservoirs","title_page":"Hope for End to Drought as El Niño Fills California Reservoirs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Pacific El Niño is back with a vengeance — and with it, the hope that California can climb out of its devastating, four-year-long drought.\nAfter a relentlessly dry, hot February, powerful rainstorms in early March have dropped billions of gallons of water into California’s depleted reservoirs.\nLake Shasta, the state’s largest and most critical reservoir, has risen 28 feet in the last month and now sits at 77 percent capacity — and 101 percent of average for March — according to the San Jose Mercury News.\nMeanwhile, Lake Oroville, the state’s second-largest reservoir, was at 69 percent capacity — and 96 percent of its average for March — on Sunday, and the East Bay’s Pardee Reservoir hit 89 percent capacity, and 103 percent of average for March.\nThose figures are significant; in July 2014, ten of the state’s largest 12 reservoirs registered less than 50 percent full. At the time, Lake Shasta was at 36 percent capacity; just three months ago, in December, it was at 29 percent.\nLast week, operators opened the floodgates at Folsom Dam for the first time in four years so as to avoid overfilling the lake. In June, officials had ordered all boats out of Folsom Lake due to the rapidly shrinking water level.\nWhen taken together with the increasing snowpack levels in the Sierra Nevada mountains — which rose to 92 percent of normal on Monday after weeks of melting in the hot February sun — observers are hopeful that California could finally find a path out of the drought. As El Niño tapers off through spring and early summer, it could still produce enough snow in the Sierras so that runoff will continue to fill reservoirs through the dry months.\nStill, California is not out of it just yet. The state failed to meet Gov. Jerry Brown’s mandatory water conservation target for the first time in January, as the potential for savings on outdoor irrigation dried up in winter.\nThe state’s top water officials —the State Water Resources Control Board — will reportedly meet in mid-April to determine whether to extend water conservation rules through the summer. In December, the group suggested it would relax the rules for cities and towns that have significantly cut water use, or have invested in water recycling or desalination technology.","url":"https://www.breitbart.com/local/2016/03/14/hope-for-end-to-drought-as-el-nino-fills-california-reservoirs/"}
