{"authors":["David Gorn","Matt Levin","Dan Morain"],"date_download":"2018-10-30 22:37:16","date_modify":"2018-10-30 22:37:16","date_publish":"2018-08-02 22:04:13","description":"Diabetes afflicts millions of Californians, and thousands suffer amputations as a result. The state is launching a program to rein in the disease.","filename":"data/vaneerConsumption/HopingtosavelimbsandtoesCaliforniamovestocurtaildiabetes.json","image_url":"https://calmatters.org/wp-content/uploads/diabetes2-e1533165443300.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939036.html","title":"Hoping to save limbs and toes, California moves to curtail diabetes","title_page":"Hoping to save limbs and toes, California moves to curtail diabetes | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The word “amputation” threw a chill down Michael Rubenstein’s spine.\nThe 67-year-old diabetic from San Mateo still winces at the thought. “They told me I’d need to cut it off right about here,” he said, sawing his hand across his left shin.\nTwo months after that diagnosis, he’s on an exam table at the Center for Limb Preservation at UC San Francisco, his leg still whole, the threat of gangrene and amputation gone and his mood a lot less bleak and fearful. “Yeah, it turns out I didn’t need that,” he said.\nMany others are not so lucky. More than 12,000 Californians lost limbs or toes to diabetes in 2016, state data show. More than 2.5 million people in the state have been diagnosed with adult diabetes, or Type 2, and risk a similar fate if it goes unchecked. That’s especially true for low-income patients, who may lack regular preventive medical services. They’re 10 times as likely as their wealthier counterparts to lose a toe, foot or leg, according to one study .\nThat disparity is part of the impetus for a new diabetes prevention program for patients in Medi-Cal, the state’s version of the federal Medicaid health program for low-income residents. The rate of diabetes in California grew from 8.7% of the population in 2010 to 10.2% in 2016, while amputations increased by almost a third.\n“Most of those amputations are unnecessary,” said Alexander Reyzelman, co-director of the UCSF clinic that saved Rubenstein’s left leg with procedures to increase blood flow.\nThe state has set aside $5 million annually for five years to help Medi-Cal patients at risk for diabetes, a chronic condition that can lead to blindness, heart disease and stroke, among other ills. The money will fund a program, beginning in January, intended to improve their diets, lower their blood sugar and make them aware of such potentially dire consequences as amputation. Preventing or curtailing the progress of the disease could save taxpayers an estimated $45 million a year in treatment costs, according to the Davis-based nonprofit Public Health Advocates, which urged lawmakers to create the program.\nParticipants will have a year’s access to trained peer coaches, who’ll teach them to eat less sugar and fewer other carbohydrates and increase fiber with more fruit and vegetables. The coaches will also help foster other lifestyle changes, such as giving up smoking and exercising more. The regimen is based on a federal program that the Center for Disease Prevention and Control says can cut the risk of diabetes by more than half.\nThe effort is part of an overall state approach that goes beyond medication , aimed at producing a healthier population that requires less expensive public care. About a third of Californians receive their care through Medi-Cal.\nAbout 25,000 people a year are expected to join the program.\n“This gives us the opportunity to intervene before they become really sick,” said Flojaune Cofer, director of state policy and research at Public Health Advocates.\n“Once they have the disease, that’s when it gets expensive,” with added medications and significantly more tests, she said. “We think this model can be duplicated in many ways. It could be useful for asthma, it could be useful for hypertension.”\nPeople with diabetes can develop poor blood flow to their extremities and suffer nerve damage and lack of feeling, most often in their legs and feet. In some cases, the result is gangrene. In some of those instances, amputation may be the only way to save a life.\nThe increase in diabetes and the threat of amputation are “a silent, sinister crisis,” said David Armstrong, a podiatric surgeon teaching at the University of Southern California’s Keck School of Medicine. “The problem is getting bigger and bigger, and you can’t fight it by just chopping off a leg.”\nAmputation can cause as many health problems as it solves, according to Reyzelman: “When you lose a leg to amputation, 50 to 70% of patients will die within five years. You don’t want to lose a leg.”\nExperts say a multidisciplinary approach can bring patients back from the brink of amputation. Vascular surgeons, podiatrists and reconstructive microsurgeons have joined forces to treat diabetes at medical centers across the state, including those at UCSF, UCLA, UC San Diego, UC Davis and USC.\nThe hope is that more patients can walk away like Rubenstein: intact.\n“If I needed to get an amputation, I was willing to do that,” Rubenstein said. “But I certainly didn’t want that. Who would want that? Absolutely no one, that’s who.”\nThis is the third article in a series on state efforts to foster healthy living as a way to reduce chronic illness.","url":"https://calmatters.org/articles/california-diabetes-amputation-health/"}
