{"authors":["Lucia Peters"],"date_download":"2018-10-30 23:33:12","date_modify":"2018-10-30 23:33:12","date_publish":"2014-08-13 17:14:58","description":"You guys. Someone invented a motorcycle that runs on bacon. Let me repeat that: Someone invented a motorcycle that runs on bacon. At last! All our carnivorous dreams are coming true!\nCreated by Hormel Foods, the bacon bike (bacon cycle?…","filename":"data/vaneerConsumption/HormelsBaconFueledMotorcycleIstheStuffDreamsAreMadeOf.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/d33d9082-cb6d-4d7d-a335-4775d290c563-getty-620178296.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35632-hormels-bacon-fueled-motorcycle-is-the-stuff-dreams-are-made-of_1540942392.html","title":"Hormel's Bacon-Fueled Motorcycle Is the Stuff Dreams Are Made Of","title_page":"Hormel's Bacon-Fueled Motorcycle Is the Stuff Dreams Are Made Of","title_rss":"NULL","source_domain":"bustle.com","text":"You guys. Someone invented a motorcycle that runs on bacon. Let me repeat that: Someone invented a motorcycle that runs on bacon. At last! All our carnivorous dreams are coming true!\nCreated by Hormel Foods, the bacon bike (bacon cycle? Bacon-mobile?) will be featured prominently in an upcoming documentary called Driven by Bacon; according to Foodbeast, the doc will follow a bacon enthusiast as he or she road trips from Austin to San Diego, talking to all the other fellow bacon lovers s/he meets along the way. Weird? Maybe. I generally find that the weirder the documentary subject, the more interesting the finished film; then again, I’m also unusually interested in weird stuff, so do with that what you will.\nI’ll admit that initially I was a little torn about the idea of the bacon bike. Obviously a huge part of me thought that a bacon-powered motorcycle has the potential to be the greatest invention of our time; but on the other hand, another part of me couldn’t help but wonder why you waste a whole bunch of perfectly good bacon by shoving it in a motorcycle instead of eating it. Happily, though, my fears were unfounded; it turns out the bike doesn’t run on bacon itself, but rather on bacon grease.\nAccording to Scott Schraufnagel of BBDO Minneapolis, the ad agency who came up with the idea for the bike in the first place, the contraption runs on B-100 bio-diesel — which means there’s no hazardous waste from it, either. Schraufnagel also told KAALTV that takes about one pound of grease to make a gallon of fuel; that fuel costs about $3.50 a gallon; that it gets about 75 to 100 miles per gallon; and that it definitely smells like bacon when it runs. Sounds like a good deal, no? Then why the heck aren’t we using bacon-based bio-diesel to power everything these days?\nGood question — and unfortunately, there’s not a satisfactory answer right now. Modern Farmer noted that the LA Times reported on a Wisconsin company called Bio-Blend Fuels back in 2009; sadly, though, they closed in January 2014. But if, as the folks behind the bacon bike say, bio-diesel is such a great fuel source — “If there were a bio-diesel tanker spill in the ocean, the fuel would be safe and mouthwatering fish food,” they remarked to the Washington Times; furthermore, they added that the bacon bio-diesel “is nearly carbon-neutral, meaning it contributes almost zero emissions to global warming” — then maybe this fun little publicity stunt might actually pave the way for development in the bio-diesel field.\nIn the meantime, though, don’t forget about all the great uses for bacon grease you can find around your own home. This infographic should help. Anyone else have a terrible craving for a BLT right now?","url":"https://www.bustle.com/articles/35632-hormels-bacon-fueled-motorcycle-is-the-stuff-dreams-are-made-of"}
