{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:37:11","date_modify":"2018-10-30 21:37:11","date_publish":"2016-09-12 05:40:04","description":"The practice \"is a disgrace to those people who have served and currently serve our country,\" the model wrote on Instagram.","filename":"data/vaneerConsumption/HorrificthatNFLPlayersProtestedAnthemon911.json","image_url":"https://media.breitbart.com/media/2016/09/KateUpton1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_09_11__1540935431.html","title":"'Horrific' that NFL Players Protested Anthem on 9/11","title_page":"Kate Upton: 'Horrific' that NFL Players Protested Anthem on 9/11","title_rss":"NULL","source_domain":"breitbart.com","text":"Model-actress Kate Upton ripped into NFL players who demonstrated in protest during the National Anthem ahead of the league’s games on Sunday, the 15th anniversary of 9/11, calling the practice a “disgrace” on any regular day but “even more horrific” on the day Americans remember the terrorist attacks that killed thousands of people and destroyed the Twin Towers.\n“In my opinion, the national anthem is a symbolic song about our country. It represents honoring the many brave men and women who sacrifice and have sacrificed their lives each and every single day to protect our freedom,” the 24-year-old Sports Illustrated model wrote in a post to her Instagram account Sunday afternoon. “Sitting or kneeling down during the national anthem is a disgrace to those people who have served and currently serve our country. Sitting down during the national anthem on September 11th is even more horrific.”\nThe practice of demonstrating during the singing of the National Anthem first gained traction after San Francisco 49ers quarterback Colin Kaepernick refused to stand during the Anthem ahead of an NFL pre-season game in August.\nOther players have since protested during the National Anthem, including on the anniversary of 9/11 on Sunday, when players from the Seattle Seahawks, Kansas City Chiefs, New England Patriots and Miami Dolphins all demonstrated during the song in different ways.\n“Protest all you want and use social media all you want. However, during the nearly two minutes when that song is playing, I believe everyone should put their hands on their heart and be proud of our country for we are all truly blessed,” Upton continued in her post. “Recent history has shown that it is a place where anyone no matter what race or gender has the potential to become President of the United States. We live in the most special place in the world and should be thankful. After the song is over, I would encourage everyone to please use the podium they have, stand up for their beliefs, and make America a better place.”\nUpton’s post drew criticism on social media, including from journalists Soledad O’Brien and Roland S. Martin.\n“Maybe you can be proud to be an American and also protest those things that you think aren’t so great about America,” O’Brien challenged Upton on Twitter.\n“They have every right and SHOULD protest just not during those 2minutes on 9/11 [sic],” Upton replied.\n“So in your world, the protests should take place on 9.10 or 9.12, just not 9/11? You are contradicting yourself,” Martin wrote.\n“Sorry I wasn’t clear,” Upton wrote back. “Never during our national anthem. Especially on 9/11.”\nRead my Instagram post. They have every right and SHOULD protest just not during those 2minutes on 9/11 https://t.co/ecBMmUifnw — Kate Upton (@KateUpton) September 12, 2016\nSorry I wasn't clear. Never during our national anthem. Especially on 9/11 #NeverForget https://t.co/UEDIsqbXEr — Kate Upton (@KateUpton) September 12, 2016\nOf course, Upton isn’t the only public figure to condemn NFL players for kneeling or sitting during the National Anthem. NBA great Shaquille O’Neal, rapper Fat Joe, actor James Woods and Republican presidential candidate Donald Trump, to name just a few, have also similarly criticized the demonstrations.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/09/11/kate-upton-nfl-players-kneeling-anthem-911-horrific/"}
