{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-22 23:46:41","date_modify":"2018-10-22 23:46:41","date_publish":"2016-01-29 12:16:43","description":"The video was posted to Facebook by Larry Williams, who is believed to live in Florida, and shows a man attempting to pull a caterpillar from a small hole when he gets a terrifying surprise.","filename":"data/vaneerConsumption/Horrifyingmomentmantriestopullcaterpillarfromaholewithtweezers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B21F0400000578-0-image-a-29_1454069798966.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422639_Horrifying-moment-man-tries-pull-caterpillar-hole-tweezers-large-spider-chase-away-meal_1540252001.html","title":"Horrifying moment man tries to pull caterpillar from a hole with tweezers","title_page":"Horrifying moment man tries to pull caterpillar from a hole with tweezers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's unclear if spider was protecting meal or was using creature as bait\nSuddenly a large spider emerges from the hole and mounts an attack\nHe uses tweezers and appears to disturb the creature a little too much\nMan attempts to pull what looks like a dead caterpillar from small hole\nIf there is one thing most people dislike more than the presence of a creepy crawly, it is the additional presence of a huge spider.\nCaptured on camera is the horrifying moment a man was faced with exactly that when he unintentionally tried to steal an arthropod's dinner.\nIn the video, which was posted to Facebook by Larry Williams, who is believed to live in Florida, a man attempts to pull what looks like a dead caterpillar from a small hole.\nCurious: A man attempts to pull what looks like a dead caterpillar from a small hole using a pair of tweezers\nSurprise: The man tries to get a hold of the slippery creature when suddenly a spider emerges from the hole\nHe uses a pair of tweezers and tries to get a hold of the slippery creature when he appears to disturb it a little too much.\nSuddenly a huge spider emerges from the crack and dives at the tweezers - its unexpected appearance causes the man to back off.\nUnbelievably the spider appears to latch onto the metal before calming down after seeing off the potential threat.\nThe clip concludes with the huge creature waiting to ensure the area is secured before presumably returning to its hole.\nIt is unclear whether the spider was attacking the tweezers in a bid to ward off another creature attempting to steal its dinner.\nTerrifying: The man backs away from the hole as the huge spider dives at the metal tweezers\nHands off! Unbelievably the spider appears to latch onto the tweezers in order to see off the potential threat\nOr whether the arthropod had in fact placed the caterpillar as bait, in the hope of bagging itself an even bigger snack.\nEither way its unexpected appearance is sure to live long in the memory of the man with the tweezers.\nSince appearing online the video has been viewed a staggering eight million times, and has unsurprisingly gained a number of comments.\nOne Facebook user wrote: 'Well I'm not going to sleep tonight,' while another said: 'I should not have watched this.'","url":"https://www.dailymail.co.uk/news/article-3422639/Horrifying-moment-man-tries-pull-caterpillar-hole-tweezers-large-spider-chase-away-meal.html"}
