{"authors":[],"date_download":"2018-10-30 14:07:22","date_modify":"2018-10-30 14:07:22","date_publish":"2018-10-30 00:05:18","description":null,"filename":"data/vaneerConsumption/HorseSenseandNonsenseAbouttheMinimumWage.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/Walmart_Workers_Protest.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908442.html","title":"Horse Sense (and Nonsense) About the Minimum Wage","title_page":"Horse Sense (and Nonsense) About the Minimum WageThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Let’s say employers must pay a substantially higher wage for all unskilled labor. Would this requirement lift many people out of poverty? Still more, would it lead to greater general prosperity?\nEverything does come up roses — if you ignore costs and think only about the benefits. By the same faulty reasoning, however, you could take a cup of water out of one end of a pool and pour it into the other end, thinking you had raised the water level.\nWith that as a caveat, here are some of the rosy claims found on the website (raiseupmo.org) supporting Proposition B in the Nov. 6 elections in Missouri. If approved, Prop B would raise the minimum wage in Missouri in increments from $7.85 per hour today to $12 in 2023:\nEvery dollar increase in the minimum wage would result in $2,800 in new consumer spending per household over the following year;\nPassage of the minimum wage proposal would result in an increase of $1 billion dollars in buying power in Missouri;\nWhen wages are raised at the bottom, the money goes right back into our businesses and the larger community.\nTake the first bullet point. Well, yes, you arrive at a figure of $2,800 if you take one dollar and multiply it by 2,800 hours (40 hours per week over 52 weeks). You can dress that number up a bit by calling it “new consumer spending per household” — even though most minimum-wage earners are not heads of households. Where is the business owner going to find the money to pay an extra dollar per hour for entry level workers?\nIt can come out of the wages or compensation of other workers. It can come out of the pockets of consumers through higher prices. It can come out of profit — which will reduce future investment in the business. Or it can come at the direct expense of jobs — if businesses are induced to spend heavily on automation to avoid a spike in labor costs.\nYou can see the trade-offs in watching how big employers have tried to juggle those options in responding to calls for higher “living wages” for inexperienced and unskilled workers. Amazon made a splash in early October — winning applause from Bernie Sanders and President Trump — when it announced a $15 per hour internal minimum wage for all of its hourly workers.\nSoon after its big announcement, however, Amazon confirmed in response to queries that it is eliminating annual stock awards and bonuses for its hourly workers. In the past, Amazon gave warehouse workers a share of company stock for every year on the job, with an extra share at the end of five years. At the day-end price on Oct. 24, a share was worth $1,664. Reportedly, many hourly workers with two or more years of experience at Amazon are fuming that they are being short-changed to pay for higher wages for new hires.\nEarly this year, Walmart, the nation’s largest private employer, announced that it was raising its base wage from $10 per hour to $11. On the same day, it also announced that it is closing 63 Sam’s Club stores. Walmart — no longer the mighty job creation machine it used to be — has also invested heavily in e-commerce and in finding other ways to boost sales with minimal additions to physical stores and employment.\nIt is a simple fact: If firms cannot find profitable employment for unskilled workers bumped up to a higher pay grade for no good reason, they will employ fewer unskilled workers and look for new ways — through automation and other means — to do the same work at lower cost.\nThe good news is that there is a much better way to spread wealth and lift people out of poverty than the passage of minimum wage laws. It’s called the free market — with firms competing with one another to hire better workers, with workers competing with one another for higher wages, and with entry-level workers competing with more experienced and skilled personnel in being willing — and able — to work for a lower wage.\nThat last point is the big one for the purposes of this article. Minimum-wage laws are inherently anti-competitive. They protect unions and many entrenched businesses from the challenges of low-cost competition and new entrants to the marketplace.\nAndrew B. Wilson, a long-time contributor to The American Spectator, is the senior writer and resident fellow at the Show-Me Institute, a free-market think tank based in St. Louis, MO.","url":"https://spectator.org/horse-sense-and-nonsense-about-the-minimum-wage/"}
