{"authors":[],"date_download":"2018-10-30 18:13:45","date_modify":"2018-10-30 18:13:45","date_publish":"2016-04-29 00:00:00","description":"I just love a good horse race. The majesty, the money, the muddying and whinnying. Er, that should be the mudslinging and whining.","filename":"data/vaneerConsumption/Horseracewatchpartiessetthepaceforbenefits.json","image_url":"https://media.arkansasonline.com/img/photos/2016/04/29/resized_99261-1cvictor45pclr_93-21116_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_may_01__1540923225.html","title":"Horse race watch parties set the pace for benefits","title_page":"Horse race watch parties set the pace for benefits","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Victor Espinoza sits atop American Pharoah after last year’s Kentucky Derby, the first leg of the first Triple Crown in more than a generation (1977). Presbyterian Village development director Melissa Jenkins says the Derby has become a big watch event — and for her an opportunity to raise funds for a new digital wireless nurse call system at the Village. - Photo by AP / BRYNN ANDERSON\nI just love a good horse race. The majesty, the money, the muddying and whinnying. Er, that should be the mudslinging and whining.\nDylan Potts of the law firm Gill Ragon Owens in the winner’s circle at Methodist Family Health’s Southern Silks fundraiser last year. The third Southern Silks goes off May 7 at the Metroplex Event Center.\nWhy, I mean the presidential race, of course, but on Saturday there's an actual horse race, and it's a big 'un.\n\"My money's on Gun Runner because it's an anagram of my name,\" Nun Gruner says.\nLocally, there's yet another \"horse race\" in the early stages of nonprofit development -- the race for Kentucky Derby watch party fundraising scratch. To date it's a three-way race (at least, as far as we know) between Methodist Family Health, Presbyterian Village and the University of Arkansas for Medical Sciences.\nThe favorite, the Pharaoh, if you will, is the one that takes place on the 12th floor of the Jackson T. Stephens Spine & Neurosciences Institute. He's not a 3-year-old colt but a 13-year-old hold on the Derby watch party calendar -- the Julep Cup Jaunt goes off from 4 to 6:30 p.m. It's a fundraiser for the UAMS Neonatal Intensive Care Unit and a renovation to the Mom & Baby Postpartum Wing.\nThere'll be an auction and Derby-inspired eats, and a hat contest. The race -- the actual horse race -- will be broadcast inside the auditorium on a theater screen.\nTickets are $40. Go to giving.uams.edu and look under Upcoming Events, or call (501) 686-8200.\nTHE UPSTART WITH\nTHE TURN OF FOOT\nAlong the backstretch all eyes are on the Presbyterians, a people known for enterprise and courage and, in the face of new doubts, new traditions. Presbyterian Village hosts a midday (3 p.m.) party at Pleasant Valley Country Club that ends after the broadcast of the Kentucky Derby at 5:34 p.m.\nThis devotedly Protestant group of Christians abjures gambling, but development director Melissa Jenkins said there will be \"a race favorites game.\" Ooo, gambling! \"No. Absolutely not,\" Jenkins said. This is a game. A game for guests to pick their favorite horse. And win prizes.\nCash prizes?\n\"No. Absolutely not,\" Jenkins said.\nTickets are $50, and there'll be \"hot browns\" and pimento cheese sandwiches and juleps. The money raised is earmarked for a very specific upgrade -- a new wireless nurse call system to replace the analog, push-button one.\nDid you know the Village served 230 folks last year, and that the average age is 88? The average!\nVisit tinyurl.com/z6hps9m, or phone (501) 225-1615.\nTHE QUARTER POLE, METHODIST MUSTER\nNow dropped in at the quarter pole is the true 3-year-old, Methodist Family Health's Southern Silks.\nFirst run in 2014 under trainer Ann Rowell, the event returns to the Metroplex and starts at 6 p.m. That's right. This is not a watch party.\nThis just in -- this is a watch party. A real human horse race spectacle!\nHumans, dressed in jockey silks (kind of), hands choking their hobby horses, move around a \"track\" upon a roll of dice. Onlookers make $5 \"bets\" and, if their \"horse\" wins, are eligible for a raffle for prizes worth up to $1,000.\nThe chairman is Adam Smith, brand-new owner of home decor store White Goat in the Heights. \"I have a family member who went to Methodist Family Health, to one of the clinics, so I've seen firsthand what that involves, but [this fundraiser] has just made me more connected.\"\nFolks come in Derby attire. There's a hat contest. And food with a Derby theme, of course.\nMethodist Family spokesman Jane Dennis said last year the event raised about $90,000, and this year promises to be much bigger. There's a $10,000 match for a direct appeal at the event that will go directly to Camp Healing Hearts, a residential grief camp for children, teens and families coping with a death.\n\"It's a real festive event,\" Dennis says, of the fundraiser. \"People who've attended say they've never attended an event like this.\"\nFor more, Methodistfamily.org/events or (501) 906-4201.\nBACK TO THE PADDOCKS\nMeanwhile, my horse has raced his last. I finished just ahead of New High Profile Low and eight lengths back of Pulitzer Brides.\nThis is my last Up and Coming column, and last week as editor of this section. Adieu, my online readers in Toulousse! Adiau, in Esperanto!\nI leave dear readers in the capable hands of an as-yet-unnamed -- and unknown-to-me -- editor who will almost certainly surpass me in gentility and X chromosomes.\nNo, I did not get canned!\nNow, shall I part with a little secret? I've never -- wait for it ...\nI've never come up with a satisfactory set of guests at my fantasy dinner party. Would it be my childhood crush, Michelle Pfeiffer? My childhood idol Isiah Thomas? My adult idol, reclusive Bitcoin founder and possibly pseudonym Satoshi Nakamoto?\nThis is tough!\nCan't I ask myself what's always in my refrigerator (pickled okra), a smell that makes me nostalgic (leather), my secret fraternity (Occult Hand) and nickname (Carroll)?\nMy pet peeve about society (not Replying All to group emails), my trademark expression (\"Let's settle this outside\"), and what people always ask me at parties (\"Does that Press badge get you in anywhere?\").\nActually, it's the camera. No, really.\nOn a tenderer note, here's something I'm happy to divulge -- I love the High Profile cover subjects we've published over the last 3 1/2 years. If they're on the cover, they're big spirits. They live life with ardor and verve. Most of the profiles I've written were a struggle to contain, not fill in. I'm honored to have spent time with these folks.\nSo I'm proud to have shepherded this inspiring institution, which goes on, second star to the right and straight on till next Sunday morning.\nThis email address good through Thursday:\nbampezzan@arkansasonline.com\nHigh Profile on 05/01/2016","url":"https://www.arkansasonline.com/news/2016/may/01/horse-race-watch-parties-set-the-pace-f/"}
