{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 04:57:19","date_modify":"2018-10-23 04:57:19","date_publish":"2017-03-16 16:01:57","description":"Inspectors from the Care Quality Commission said staff at Oaklands Hospital in Salford, Greater Manchester, were putting patients at 'substantial risk of harm' by leaving surgery for up to 20 minutes.","filename":"data/vaneerConsumption/Hospitalbossessackedoveranaesthetistsleavingtheatre.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E553CA200000578-0-image-a-78_1489679492686.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320844_Hospital-bosses-sacked-anaesthetists-leaving-theatre_1540270639.html","title":"Hospital bosses sacked over anaesthetists leaving theatre","title_page":"Hospital bosses sacked over anaesthetists leaving theatre | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two private hospital managers have been sacked after inspectors found anaesthetists were 'routinely' leaving operating theatres to eat and watch TV.\nInspectors from the Care Quality Commission said staff at Oaklands Hospital in Salford, Greater Manchester, were putting patients at 'substantial risk of harm' by leaving surgery for up to 20 minutes at a time.\nIn a damning report published this week, the watchdog said staff would pop off to use the toilet, eat meals and even watch TV during that time, sometimes leaving neither an anaesthetist nor an assistant present during the operation.\nInspectors from the Care Quality Commission said staff at Oaklands Hospital in Salford, Greater Manchester (pictured), were putting patients at 'substantial risk of harm'\nThe watchdog said anaesthetists at the hospital (pictured) would pop off to use the toilet, eat meals and even watch TV during 20-minute breaks\nThey branded the facility 'inadequate' as they said patients faced an 'unacceptable level of risk'.\nThey also discovered most operating theatre staff were not trained to look after people who suffered a cardiac or respiratory arrest.\nThere was also a 'culture of fear' within operating theatres which meant staff did not challenge unsafe behaviour, they said.\nEllen Armistead, Deputy Chief Inspector of Hospitals for the CQC, said: 'We rated this hospital overall inadequate. We served warning notices against the provider and the registered manager.\n'This was because there was a failure to assess' the risks to health and safety of patients and to take action to mitigate such risks.'\nDuring the inspection, the CQC found that standard operating procedures which are designed to keep people safe were not always followed.\nMedicines and other substances were not always stored safely, while controlled drugs were not properly managed.\nThere were also substantial and frequent staff shortages, which resulted in an over-reliance on agency and bank staff at the facility, they said.\nIn a statement, operators Ramsay Health Care UK said it had acted 'immediately' following the inspection, appointing a new management team to resolve the issues.\nRamsay UK CEO Mark Page (pictured) said the report was 'very disappointing'\nThe hospital, which has 17 beds, four operating theatres, a day-case unit, outpatient and diagnostic facilities, was assessed in five areas.\nIt was branded inadequate for safety and leadership, and requiring improvement for effectiveness and responsiveness. However, it was rated good for caring.\nDuring the year under scrutiny, the hospital received 60 complaints and the CQC themselves received 11 complaints about the hospital, including from a whistleblower.\nNHS patients, private medical patients, and private medical insurance patients are treated there.\nFrom July 2015 to June 2106 there were 27,868 outpatient attendances, 93 per cent of which were NHS funded.\nThe hospital provides a range of non-surgical and surgical treatment, including orthopaedic surgery, general surgery, gynaecology, ENT and urology.\nThe facility is particularly known for knee and hip replacements, cosmetic, cardiac, and weight loss surgery.\nRamsay UK CEO Mark Page said the report was 'very disappointing' given the organisation's reputation in providing excellent patient care.\nHe said: 'We have made fixing all issues identified by the CQC an absolute priority and have been implementing these changes, with the assistance of the CQC, since October last year when they were first identified.\n'I am confident that the new hospital management team and the staff of Oaklands, together with clinical governance support from Ramsay UK has implemented significant improvements since this time.\n'While there can be no denying the seriousness of the issues which need to be fixed, we were pleased that the CQC report rated Oaklands Hospital 'good' in the area of caring and highlighted that our staff treated patients with kindness and respect.'","url":"https://www.dailymail.co.uk/news/article-4320844/Hospital-bosses-sacked-anaesthetists-leaving-theatre.html"}
