{"authors":[],"date_download":"2018-10-22 23:07:55","date_modify":"2018-10-22 23:07:55","date_publish":"2017-03-16 05:53:13","description":"China and Saudi Arabia signed agreements potentially worth tens of billions of dollars on Thursday, Beijing said, as President Xi Jinping welcomed Saudi King...","filename":"data/vaneerConsumption/HostingSaudikingChinapursuesMideastcharmoffensive.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227797-1489660998-293_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318982_Hosting-Saudi-king-China-pursues-Mideast-charm-offensive_1540249675.html","title":"Hosting Saudi king, China pursues Mideast charm offensive","title_page":"Hosting Saudi king, China pursues Mideast charm offensive | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chinese President Xi Jinping (right) welcomed Saudi King Salman bin Abdulaziz at the Great Hall of the People as Beijing continues a charm offensive toward the Middle East\nChina and Saudi Arabia signed agreements potentially worth tens of billions of dollars on Thursday, Beijing said, as President Xi Jinping welcomed Saudi King Salman on a state visit.\nThe visit by the 81-year-old king comes as China pursues a charm offensive towards the Middle East, where it has previously kept a low profile.\nThe trip returns the favour after Xi visited the kingdom last year as part of the first state visit to the Middle East by a Chinese leader in seven years.\nNo specifics were given about the 14 memoranda of understanding that were signed at Beijing's Great Hall of the People, which included agreements in energy, and a range of other spheres.\nBut China's Vice Foreign Minister Zhang Ming told reporters various projects could be worth up to $65 billion.\nKing Salman arrived Wednesday with a reportedly massive entourage of around 1,000 people following stops in Japan, Malaysia and Indonesia as part of a month-long Asia tour.\nChina's President Xi Jinping (right) and Saudi King Salman bin Abdulaziz signed 14 memoranda of understanding during a ceremony at the Great Hall of the People in Beijing, on March 16, 2017\nLocal media in countries they visited have fixated on Salman's lavish travelling party, which is said to have included luxury vehicles, an 80-inch (200 centimetre) television and hundreds of tons of luggage.\nChina is pivoting towards the Middle East, and Saudi Arabia is strengthening its alliances in east Asia, as the United States' global diplomatic stance under President Donald Trump remains unclear.\nChina depends on the volatile Middle East for oil supplies but has long taken a back seat in its disputes.\n- A new approach -\nBut over the past year Xi has taken a new approach, with steps that include offering to host talks between the opposing parties in the Syrian conflict.\nZhang said both the Syrian and Yemen wars were discussed on Thursday, with the two parties agreeing that the crises should be resolved through political discussions.\nChina is also pushing Xi's signature \"One Belt, One Road\" policy, a strategy to increase trade links and market connectivity between China, Europe and regions in between, based loosely on the ancient \"Silk Road\" trading route.\nSaudi King Salman bin Abdulaziz (centre) reviews an honour guard during a welcoming ceremony at the Great Hall of the People in Beijing, on March 16, 2017\n\"This visit will push forward and continue to improve the quality of our relations and bear new fruit,\" Xi told the king, who entered their meeting walking gingerly with a cane and later arrived at the day's closing ceremonies in a small green motorised cart.\nChina has been Saudi Arabia's largest trading partner since 2015 and the kingdom was for years the biggest source of crude oil for the fuel-hungry Chinese economy.\nRussia last year supplanted the Saudis as China's top oil source, according to official Chinese statistics.\nThe visit is the monarch's first to China since taking the throne in 2015.\nTies between Riyadh and Washington were strained during the Obama administration, and although they are expected to improve under Trump, the Saudis are keen to solidify east Asian ties as a hedge.\n\"Past (China-Saudi) ties were good, but at least from a Saudi perspective, can use a significant boost,\" said Joseph Kechichian, a senior fellow at Riyadh's King Faisal Center for Research and Islamic Studies.\nIn an interview with Chinese state news agency Xinhua, Saudi ambassador Turki Bin Mohamed Al-Mady emphasised his country's potential role in the \"One Belt, One Road\" initiative.\n\"In terms of strategic location, Saudi Arabia serves as the central hub connecting three continents -- Asia, Africa and Europe -- and has been an important part of the initiative,\" Al-Mady said.\nZhang said Salman pledged Saudi Arabia's enthusiastic participation in the trade project.","url":"https://www.dailymail.co.uk/wires/afp/article-4318982/Hosting-Saudi-king-China-pursues-Mideast-charm-offensive.html"}
