{"authors":["Harry Pettit For Mailonline"],"date_download":"2018-10-23 02:29:21","date_modify":"2018-10-23 02:29:21","date_publish":"2017-03-10 11:36:10","description":"Gateshead-based science presenter Steve Mould created the the test to see if they can hear the difference between hot and cold water. The two sound distinct because of their different viscosities.","filename":"data/vaneerConsumption/Hotandcoldwatermakedifferentnoises.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/12/3E1AC37C00000578-0-image-a-15_1489063742420.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4297086_Hot-cold-water-make-different-noises_1540261761.html","title":"Hot and cold water make different noises","title_page":"Hot and cold water make different noises | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Your brain harnesses a hidden skill that you didn't know you had.\nWe can tell the difference between hot and cold water purely through sound.\nPeople hear hot and cold drinks poured so often that they subconsciously learn the difference between the two.\nIn a new video, science presenter Steve Mould puts this theory to the test with a hot and cold water quiz, revealing that it is surprisingly easy to pick between the two.\nWatch the video below to take the test\nWHY DO HOT AND COLD WATER SOUND DIFFERENT? Changes in the viscosities of hot and cold water are what we hear. In cold water, the molecules carry less energy and are less 'excited'. This means that they move more slowly and are more likely to 'stick' to other molecules. Cold water's higher viscosity also causes it to bubble less when poured. This creates a lower frequency sound when the water is poured. Hot water produces a higher pitched sound when poured because the energised molecules are moving around more rapidly.\nThe first pour in the video is cold, while the second pour is hot.\nThe two sound different because hot and cold water have a different viscosity or 'thickness'.\n'The viscosity of water goes down when you heat it,' Mr Mould explains in the video.\n'This is easier to see with a liquid like honey - warm honey is more runny than cold honey.\n'With water this is less visually apparent, but when you pour water, the way it splashes into a cup is affected by the viscosity.'\nThe slight changes in viscosity between hot and cold water change the sound of the splashes when poured.\nIt is these subtle changes that our brains learn over time.\nThe two sound different because hot and cold water have a different viscosity or 'thickness'. Cold water has a higher viscosity, meaning its molecules are less energised, and so they make a different sound when they 'splash' at the bottom of a mug or shower\nHeat changes the viscosity of liquids because it energises the molecules.\nIn cold water, the molecules carry less energy and are less 'excited', meaning it is more viscous.\nThis means that the water molecules move more slowly and are more likely to 'stick' together.\nCold water's higher viscosity also causes it to bubble less when poured.\nThis creates a lower frequency sound, the Naked Scientist reports.\nHot water on the other hand produces a higher pitched sound when poured because the energised molecules are moving around more rapidly.\nIt is these small differences in sound that our brains have learned to distinguish, and this is why we can pick out hot and cold water just with our ears.","url":"https://www.dailymail.co.uk/sciencetech/article-4297086/Hot-cold-water-make-different-noises.html"}
