{"authors":[],"date_download":"2018-10-22 21:42:10","date_modify":"2018-10-22 21:42:10","date_publish":"2014-05-07 23:46:20","description":"More cancellations have hit Dorchester Collection hotels, owned by the Brunei Investment Agency, over the introduction of Sharia law.","filename":"data/vaneerConsumption/HotelBoycottAgainstShariaLawExpandsLossesHit15M.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/427831/140507-beverly-hills-hotel-brunei-mms-1938_3c77722dfa7d86dd207afb37e4302598.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_hotel-boycott-against-sharia-law-expands-losses-hit-1-5m-n99926_1540244530.html","title":"Hotel Boycott Against Sharia Law Expands, Losses Hit $1.5M","title_page":"Hotel Boycott Against Sharia Law Expands, Losses Hit $1.5M","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe introduction of Sharia law in Brunei continued to ripple to the shores of California on Wednesday as the oil-rich nation's ownership of the iconic Beverly Hills Hotel resulted in business cancellations amounting to at least $1.5 million.\n\"The impact has been predominantly in the local events business where those have been canceled and we're up to probably about $1.5 million so far, but we can weather the storm. We're very, very much larger than that,\" Dorchester Collection CEO Christopher Cowdray told CNBC.\n\"If you take the global perspective of this city, we're not the only hotel or establishment or business that is owned by a country which has Sharia laws,\" he said. \"There's so many hotels, banks and other organizations that have connections to countries which have this type of law.\"\nBoycotts by celebrities including Ellen DeGeneres, Jay Leno, Stephen Fry, Sharon Osbourne, Virgin CEO Richard Branson and Dreamworks CEO Jeffrey Katzenberg were elevated as Los Angeles' mayor and city attorney joined in. Several organizations said they were canceling major events scheduled at the hotels owned by a branch of the Brunei government.\nThe Brunei Investment Agency owns the Dorchester Collection of 10 luxury hotels: the Beverly Hills Hotel; the Hotel Bel-Air in Los Angeles; The Dorchester and 45 Park Lane in London; Coworth Park in Ascot, England; Le Meurice and Hotel Plaza Athenee in Paris; Hotel Eden in Rome; Le Richemond in Geneva; and Hotel Principe di Savoia in Milan.\nThe City Council of Beverly Hills voted Tuesday to urge the hotel to untangle itself from its connection to Sharia law.\n\"These laws are shocking, inhumane and must be met with a strong statement of support for human rights of the people of Brunei,\" said Beverly Hills Mayor Lili Bosse. \"It is extremely important that we separate the hotel from the ownership. This hotel is 102 years old. Beverly Hills is 100 years old this year. The city and the hotel have grown up together and always had a strong and supportive relationship. This is why I'm not calling for a city sanctioned boycott of the hotel. I feel that each individual and group should make their own decision. Personally and sadly, I will not be attending any events at the hotel until this is resolved.\"\nThe hotel, as she noted, is 102 years old, slightly older than the city itself, which is celebrating its centennial this year.\nThe UNITE HERE Local 11 hospitality workers union had stronger words for the ownership.\n\"The Sultan of Brunei is anti-worker, anti-gay and anti-woman,\" Tom Walsh, president of the union, said in a statement Tuesday. \"We want him out of Beverly Hills and out of the United States. These historic hotels deserve ownership that will respect human rights and the rights of their own workers.\"\nThe union raised another issue with the hotel ownership: \"In 2009, Dorchester closed the Hotel Bel-Air for renovations. It's customary ... for hotel owners to bring back the housekeepers, cooks and gardeners when the property reopens. Instead, the owners of the Hotel Bel-Air fired all the workers and refused to rehire the majority of longtime workers. Workers lost houses, cars and filed bankruptcy as they struggled to find good jobs.\"\nA spokesperson for the hotel did not reply to CNBC's request for comment on the union's statements.\nEarlier in the week, Dorchester CEO Cowdray said the boycott was misdirected. \"Today's global economy needs to be placed in a broader perspective,\" he said. \"Most of us are not aware of the investors behind the brands that have become an integral part of our everyday life, from the gas we put in our cars, to the clothes we wear, to the way we use social media and to the hotels we frequent. American companies across the board are funded by foreign investment, including sovereign wealth funds.\"","url":"https://www.nbcnews.com/business/travel/hotel-boycott-against-sharia-law-expands-losses-hit-1-5m-n99926"}
