{"authors":[],"date_download":"2018-10-22 21:22:56","date_modify":"2018-10-22 21:22:56","date_publish":"2014-05-05 17:34:36","description":"A growing list of celebrities refuse to stay at luxury Dorchester properties, including The Beverly Hills Hotel and Hotel Bel-Air.","filename":"data/vaneerConsumption/HotelBoycottGrowsOverOwnersTiestoShariaLaw.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/421071/140505-dorchester-hotel-1340_98754ad33169b97e4973eb3ad1098c1e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_hotel-boycott-grows-over-owners-ties-sharia-law-n97401_1540243376.html","title":"Hotel Boycott Grows Over Owner's Ties to Sharia Law","title_page":"Hotel Boycott Grows Over Owner's Ties to Sharia Law","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nVirgin CEO Richard Branson has joined the likes of Ellen Degeneres, Stephen Fry and some fashion designers who said they are boycotting the luxury Dorchester Hotel chain over the owner's ties to the introduction of Sharia law in the Sultanate of Brunei.\n\"No @Virgin employee, nor our family, will stay at Dorchester Hotels until the Sultan abides by basic human rights,\" Branson tweeted Saturday from his personal Twitter account.\nThe Dorchester Collection, which includes The Beverly Hills Hotel, Hotel Bel-Air, The Dorchester and several other luxury-level properties around the word, is owned by the Brunei Investment Agency, a branch of the Ministry of Finance of Brunei.\nAt issue is the decision of the oil-rich state to adopt a strict form of Sharia law that would call for the severing of limbs for theft, as well as stoning to death for adultery or homosexual acts, according to the BBC. Enforcement would be limited to within the borders of Brunei.\nThe annual Global Women's Rights Awards, co-chaired by Jay and Mavis Leno, moved from the Beverly Hills Hotel as part of the boycott. The awards instead were held at the Hammer Museum.\nOn Tuesday night, the Beverly Hills city council is expected to discuss whether to ask the government of Brunei to divest itself of the Beverly Hills Hotel.\nChristopher Cowdray, the chief executive officer of the Dorchester Collection, said boycott should not be directed at the hotels and its employees.","url":"https://www.nbcnews.com/business/travel/hotel-boycott-grows-over-owners-ties-sharia-law-n97401"}
