{"authors":["Sadie Whitelocks For Mailonline"],"date_download":"2018-10-23 03:21:04","date_modify":"2018-10-23 03:21:04","date_publish":"2017-04-26 14:46:32","description":"A traveller staying in Baku, Azerbaijan, decided to get inventive with his duvets and pillows, crafting a mix of hilarious objects.","filename":"data/vaneerConsumption/Hotelguestcreateshilariousobjectsforcleaner.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FB30400000578-0-image-a-29_1493210288293.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4447704_Hotel-guest-creates-hilarious-objects-cleaner_1540264864.html","title":"Hotel guest creates hilarious objects for cleaner","title_page":"Hotel guest creates hilarious objects for cleaner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There can't be too many plus sides to being a hotel room cleaner, which makes what this guest did all the more endearing.\nThe traveller, who was staying in Baku, Azerbaijan, decided to get inventive with his duvets and pillows and craft a mix of hilarious objects and figures to cheer up the cleaning staff.\nCalling it the 'room service challenge', the hotel guest kept himself busy making objects, including a car and smiley face, with the furnishings. He then photographed the maid's response.\nLady caller: A traveller staying in Baku, Azerbaijan, decided to get inventive with his duvets and pillows, crafting a mix of hilarious objects to cheer up the cleaning staff\nNoted: Calling it the 'room service challenge', the hotel guest decided to make objects with a range furnishings, before photographing the maid's response\nSmiley face: The hotel guest got very inventive during his stay at the unknown hotel\nTo his surprise, each day the cleaner left a note expressing her appreciation using a mix of smiley emojis.\nOn the eighth day she wrote 'you have cheered me up, thank you!' after discovering a craftily-built car on the bed.\nOn the tenth day, the hotel guest went about constructing a person wearing a bath robe, before propping the life-like object upright behind the desk.\nAnd on his final night before checking out, he created a heart shape out of his blanket as a thank you to his new friend, the cleaner. In the middle he left a small hoard of edible goodies.\nLaugh out loud: To his surprise, each day the cleaner left a note expressing her appreciation, with smiley emojis\nMattress monster: The traveller crafted a beast with his pillows and even added some toiletries to mark out some eyes\nComing to life: On day four the duvet and pillows were fashioned to create a human-like figure\nDesert island dreaming: This pillow creation appears to represent a palm tree\nOther plush creations included a palm tree, small man and monster-like creature.\nImages of the 'room service challenge' were first shared on AcidCow.com.\nDozens of viewers have given the comical picture series the thumbs up.\nOne reader, a cleaner herself, said that she loves it when people show their appreciation of what she does.\nAnother added: 'This is one of the most beautiful mini stories I have ever read!\n'It really is. I wish the best to these mystery people, who through tiny gestures created a little happiness in an otherwise indifferent world.'\nPen pals: It's not known if the hotel guest and cleaner ever met in person after the back and forth exchange\nBeep beep: The blanket was turned into a car, with notepaper cut out to represent windows\nWelcome surprise: The hotel maid appeared to love the automobile and said it brightened her day\nMystery caller: By day ten, the hotel guest had mastered his artistic skills and he went about creating a person wearing a robe before propping the life-like object upright behind the desk\nLove letters: The maid loved her final find and said the duvet person was 'very, very beautiful'","url":"https://www.dailymail.co.uk/travel/travel_news/article-4447704/Hotel-guest-creates-hilarious-objects-cleaner.html"}
