{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 03:43:39","date_modify":"2018-10-23 03:43:39","date_publish":"2017-03-16 14:47:25","description":"Taser-trained officer PC Alan Cottrell was among those to take down Matthew Williams (pictured) in November 2014 after he killed Cerys Yemm at a hotel in Blackwood, Gwent.","filename":"data/vaneerConsumption/Hotelkillerhadhandsstuckinmutilatedvictimsface.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E4E528F00000578-0-image-a-59_1489675384267.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320436_Hotel-killer-hands-stuck-mutilated-victim-s-face_1540266219.html","title":"Hotel killer had hands 'stuck in mutilated victim's face'","title_page":"Hotel killer had hands 'stuck in mutilated victim's face' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A police officer has spoken of the moment he saw the 'black' eyes of a 'cannibal' killer who mutilated a woman he had taken back to his hotel room.\nTaser-trained officer PC Alan Cottrell was among those to take down Matthew Williams in November 2014 after he killed 22-year-old Cerys Yemm in Blackwood, Gwent.\nPc Cottrell said he and Raymond Miles - co-owner of the Sirhowy Arms - had to force the door open as there was something obstructing it and that when the door opened Williams rolled onto his back and landed between Miss Yemm's legs.\nRaymond Miles (pictured, left) was Tasered by police officers after killing 22-yea-old Cerys Yemm (right)\nAsked what his state was when he opened the door Pc Cottrell said: 'I have never been more scared in my life.\n'I have gone to some horrific things through my service but this was the most horrendous thing I have ever seen.\n'The next thing to happen is you try and engage with him but I looked at this face and he just looked possessed.\n'It was just totally vacant. It was an angry sort of look but if you looked in his eyes you could not see colour. They were almost all black.'\nPC Cottrell said he and a colleague went to the hotel after the 999 call and that he recognised Williams' name when it was given over the radio.\nHe added: 'Saying I feared for my safety is just police jargon. I was absolutely bricking it. If he'd got up God knows what he could've done.\n'We were told he had a screwdriver. We didn't know where that was so as far as I was concerned until it was secured he could've potentially used it as a weapon.\n'We'd been told he was eating someone. Obviously we now know that's not the case. But he was chewing on something and I didn't want him to take a chunk out of me.'\nThe horrific scene took place at the Sirhowy Arms hotel, in Blackwood, Gwent (pictured)\nDescribing what he knew and found out while travelling to the scene, he said he had dealt with Williams a few times previously.\nThe first being in 2012 when Williams was Tasered by another officer and it had not worked. He said he knew Williams was a 'rather large, violent male'.\nHe said: 'As soon as Matthew Williams is mentioned your brain just uses previous knowledge of him.'\nHe said he believed the Taser had not worked previously because the officer who used it was too close and Williams' 'intoxicated state' enabled him to 'fight through it' and escape through a window.\nHe said: 'Your mind is thinking straight away \"It didn't work on him last time due to to distance; you have got to get a decent amount of distance in order for it to be effective on him this time\".'\nPc Cottrell said it was also mentioned 'that the male was eating the victim' and that firearms officers had been notified but 'were a good distance from the hotel'.\nHe said he understood officers were being given 'full authority' which meant the firearms officers were engaged to use deadly force if required.\nWilliams suffered from paranoid schizophrenia and was released from prison without any medication\nHe added that there had been a discussion about whether he and the other Taser-trained officers should go into the room or just 'contain' the scene and wait for the firearms officers.\n'There was a clear threat to life,' he said. 'The first Taser officer to attend will go in regardless.'\nPc Cottrell said he shouted at Williams that he had a Taser and asked him to roll away from Miss Yemm.\n'He was in the process of squirming,' he said.\n'It was my opinion that he was trying to get up either to carry on the attack of Cerys or to come at us.\n'It did not strike me that he was trying to get out of the way to surrender.\n'He was laying there snarling and growling.'\nPc Cottrell said he used the Taser on Williams and saw that the first barb went into his gut area but did not find out until the paramedics asked him to remove it that the second barb had struck Williams between his eyes.\nOf his decision to use the Taser he added: 'I have got no doubt if he managed to get to his feet and he came at me I would not have been able to defend myself.'\nHe said he believed the Taser had worked and had achieved neuromuscular incapacitation on Williams but that he then started to move so he decided to handcuff him and put leg straps on.\nPc Cottrell said: 'He was just not responding. He was just snarling and growling and he appeared to be chewing on something.'\nThe inquest heard other officers arrived and Williams started to try to rise up again about seven minutes after the Taser was first used.\nFloral tributes and a teddy bear were left outside the scene of the brutal killing\nPc Cottrell said he was being lifted by Williams who was moving upwards 'as if we weren't there'.\nThe inquest heard he used the Taser again in angled drive stun mode three more times in the space of 27 seconds, after Williams repeatedly tried to get up.\nPc Cottrell said he then went to the floor and did not rise up again but was breathing and 'I had no concerns about his condition at that stage'.\nEarlier, Raymond Miles had told how he saw crazed Williams crouched over Miss Yemm, in a room of his 'halfway house' hotel.\nMr Miles, 46, was called to the room after his wife, Mandy, shouted that she'd seen Williams 'eating' shopworker Miss Yemm in the frenzied attack.\nHe told the inquest: 'I could see Cerys lying on the floor with Williams on top of Cerys.\n'They were laying directly in front of me with heads nearest the door.\n'I saw Williams on top of Cerys. I'm not quite sure but it looks like he had his hands on her eyes or in her mouth.'\nThe inquest heard Miss Yemm was killed in the hotel room in a scene compared to a 'horror film' by witness Mrs Miles.\nThis tribute reads: 'RIP Cerys. taken so young in a horrific attack. Thinking of all your family + friends for their loss'\nMr Miles, who lived in a cottage in the grounds of the Sirhowy Arms hotel, in Blackwood, Gwent, said he was ordered by his wife to stand guard and make sure Williams didn't escape from the room.\nHe said: 'There was noises coming from the room. Thumping and grunting.\n'A resident and my son, Christian, wanted to go in but I said no.'\nMr Miles said he opened the door of room number seven using a key code for three police officers armed with Tasers.\nBut he said he found it difficult to open.\nHe said: 'There was resistance on the other side. Whether that was Williams or it was the girl lying in front of the door...'\nMr Miles then said he eventually opened it to witness the scene of Williams with his hands on her mutilated face.\nMr Miles said Williams resisted officers when they tried to apprehend him, leading to a male officer shooting a Taser in his back, taking him to the floor.\nMr Miles said he shouted 'hit him again' when Williams tried to get back to his feet, and the killer was Tasered for a second time.\nHe agreed that Williams 'clearly needed to be restrained' after he failed to comply with the officers, and denied suggestions they had gone 'over the top' by using their Taser guns.\nMiss Yemm had gone back to the hotel with newly-released prisoner Williams to the hotel in Argoed, near Caerphilly, South Wales, in November 2014.\nMr Miles said Williams got up off Miss Yemm as the police entered and was Tasered by an officer and, lodging two electric barbs in his back.\n'When he was being Tasered, he was like spasming and he dropped to the floor,' he said, adding that the male officer put his knee on Williams' back.\nThe inquest heard Miss Yemm was killed in the hotel room in a scene compared to a 'horror film' by witness Mrs Miles (pictured)\nHe said: 'He is on top of him trying to keep him down because Michael was still struggling to get back up.\n'There was a female officer holding his legs and there was another female officer holding his head.'\nNicholas Bowen QC, acting on behalf of the Williams family, said the male officer weighed 15st 7lb and was 6ft 1in and asked Mr Miles if Williams was successful in his attempts to get up 'given there are three people on him'.\nMr Miles said he was not and said Williams was not exhibiting 'extraordinary strength', when asked by Mr Bowen, who added that the timings of the Taser showed that Williams had also been 'drive-stunned', which is when the weapon is put directly on the skin.\nMr Miles said Williams went 'floppy' and seemed to be unconscious.\nJeremy Johnson QC, who was representing Gwent Police, asked: 'You weren't worried that the police were using too much force?' Mr Miles said: 'No'.\nMr Johnson said: 'If anything, you were worried that they should be using a bit more force. Did you at one stage say 'hit him again'?'\nMr Miles agreed and said: 'That is when he was trying to get up.'\nThe inquest previously heard Williams suffered from paranoid schizophrenia and was released from HMP Parc in Bridgend on October 23 with no support or medication.\nThe inquest in Newport is continuing.","url":"https://www.dailymail.co.uk/news/article-4320436/Hotel-killer-hands-stuck-mutilated-victim-s-face.html"}
