{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-22 23:58:54","date_modify":"2018-10-22 23:58:54","date_publish":"2017-04-26 09:04:49","description":"Sefton Park Hotel in Liverpool, which averages 3.5 stars, was criticised by a guest from Zurich who complained that his curtains only drew over less than half of his window.","filename":"data/vaneerConsumption/Hotelbosshitsbackatarrogantandaggressivereviewer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EFB5600000578-0-image-a-69_1493201801273.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446648_Hotel-boss-hits-arrogant-aggressive-reviewer_1540252734.html","title":"Hotel boss hits back at 'arrogant and aggressive' reviewer","title_page":"Hotel boss hits back at 'arrogant and aggressive' reviewer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manager Conor O'Donovan recommended that the guest channelled his 'considerable energy in a more positive manner'\nA hotel boss has hit back at an 'arrogant, bullying and aggressive' TripAdvisor reviewer after the customer branded his business 'the worst in Liverpool'.\nSefton Park Hotel - which averages 3.5 stars and is the former home of the Stuart Sutcliffe, the fifth Beatle - was criticised by a guest from Zurich who complained that his curtains only drew over less than half of his window.\nThe man also complained that it was the worst mattress he had ever slept on, the room was 'freezing' and he had to pay a £25 deposit on top of his nightly rate.\nBut manager Conor O'Donovan issued an extraordinary response that blasted the 'arrogant, bullying and aggressive' guest and criticised his 'incessant waffle'.\nHe added that the guest had 'wasted half an hour of your own time' by rambling on and 'must have been pretty worn out at the end of it'.\nMr O'Donovan then recommended that he channelled his 'considerable energy in a more positive manner' and should try meditation, breathing exercises or yoga.\nSefton Park Hotel, which averages 3.5 stars, was criticised by a guest from Zurich who complained that his curtains only drew over less than half of his window\nSawadee_1's complaint said: 'So, upon check in I was asked for £25 deposit on top of the room charge. I was also told if I smoked in the room I would be charged £178.\n'This was within the first two minutes of checking in. I expressed my dissatisfaction of this ridiculous 'deposit' but nevertheless I paid it.\n'Here comes the fun part, the room. I went to room 208, no help with my suitcases at all. The room had curtains that only drew 40 per cent across the window, so you would be sleeping with street light and neighbours peering in at you.\n'Plus the 6am sunrise would come in on top of you. Then the bed, or the excuse of a bed, it was the worst mattress I have EVER lay on, it was like a paper towel.\nSefton Park Hotel, which averages 3.5 stars, was criticised by a guest from Zurich who complained that his curtains only drew over less than half of his window\n'The room was freezing, no heating, rubbish bed, no curtains and cold... that's it, I'm checking out.\n'Then when I leave they charge my room a second time, despite me not giving any authoritative decision to do so. I will be informing my bank tomorrow.\n'The hotel has beached my contractual right and then illegally accessed my credit card for an unauthorised transaction.\n'Stay away from this place folks, for an extra €17 you could stay in a best western down the road... a real hotel! Stayed October 2016, travelled on business.'\nThe hotel's manager Conor O'Donovan issued an extraordinary response that blasted the 'arrogant, bullying and aggressive' guest and criticised his 'incessant waffle'\nBut Mr O'Donovan said in his response: 'On check in, you were adamant that you had paid for your room, which I'm pretty sure you knew wasn't in fact wasn't the case, despite your managing to bully a new member of staff into thinking otherwise.\n'Probably the worst hotel in Liverpool...' TripAdvisor review by sawadee_1 So, upon check in I was asked for £25 deposit on top of the room charge. I was also told if I smoked in the room I would be charged £178. This was within the first 2 minutes of checking in. I expressed my dissatisfaction of this ridiculous 'deposit' but nevertheless I paid it. Here comes the fun part the room, I went to room 208, no help with my suitcases at all. The room had curtains that only drew 40% across the window, so you would be sleeping with street light and neighbours peering in at you. Plus the 6am sunrise would come in on top of you. Then the bed, or the excuse of a bed, it was the worst mattress I have EVER lay on, it was like a paper towel. The room was freezing, no heating, rubbish bed, no curtains and cold... that's it, I'm checking out. Then when I leave they charge my room a second time, despite me not giving any authoritative decision to do so. I will be informing my bank tomorrow. The hotel has beached my contractual right and then illegally accessed my credit card for an unauthorised transaction. Stay away from this place folks, for an extra €17 you could stay in a best western down the road... a real hotel! Stayed October 2016, travelled on business\n'You refer to the £25.00 pre-authorisation which we take as a ridiculous deposit. All it is in fact is a swipe of a credit card so that we may open account for you on our system so that you may charge items such as food and drink to your room.\n'You then decided that you weren't happy with your room and wished to check out. We were happy to oblige. You were however still adamant that you had paid for your room and demanded a refund of the cost of same.\n'A sum of money was refunded to your card by the same member of staff who had checked you in as your bullying and general aggression continued.\n'It was then picked up by a manager who realised the error that had been made, and they charged your card for the amount which you had been mistakenly refunded.'\nHe continued: 'My best advice to you would be to consider ways in which to channel your considerable energy in a more positive manner, you'd feel so much better afterwards and it would have a very positive impact on your overall health and well being.\n'Perhaps begin with something easy such as a short meditation, breathing exercises or maybe some beginners' yoga.'\nThe hotel is ranked 67th out of 99 hotels in Liverpool and rooms are available for just £30 a night.\nIts website tells potential guests: 'Join us and experience a warm welcome, personal service, comfortable accommodation and excellent food and drink in a relaxing parkland setting under 10 minutes from Liverpool city centre.\n'We also offer extensive function and event space, making us the ideal venue for everything from weddings and parties to conferences and meetings.'\nThe hotel is the former home of the Stuart Sutcliffe, the fifth Beatle, who died aged 21\nAfter the story of his response was widely shared, Mr O'Donovan told MailOnline: 'Genuine reviewers with constructive criticism serve a great purpose and their opinions are very much welcome, but unfortunately some review sites seem to have a small army of serial complainers.\n'As a hotel we always strive to improve our customer service and our entire offering, but as an employer we also have a duty of care to show our team a balanced level of support when they are faced with a less than agreeable guest.\n'Whilst we can't discuss the minutiae of individual complaints, I can say that the gentleman who wrote the review was extremely unpleasant in his approach and reduced a young female staff member to tears.\n'Therefore, when considering my response I may have included some hints of sarcasm, however this was done in a tongue and cheek manner, given the gentleman's behaviour at the hotel and his subsequent review.\n'We hope that it will be taken in the same way by the majority of balanced reviewers who provide considered and constructive feedback, helping continually improve the guest experience and providing balanced opinions to share with other readers.'\nThe hotel was the family home of Sutcliffe, who was the original bass guitarist for the Beatles, in the 1960s. His family continued to live there while he was on tour with the band, but he died in Hamburg aged 21.","url":"https://www.dailymail.co.uk/news/article-4446648/Hotel-boss-hits-arrogant-aggressive-reviewer.html"}
