{"authors":["Nelson Groom For Daily Mail Australia"],"date_download":"2018-10-23 01:43:16","date_modify":"2018-10-23 01:43:16","date_publish":"2017-03-16 11:56:21","description":"The abandoned Ho Thuy Tien park in Central Vietnam once teeming with life, but haunting images show the landscape has taken on an post-apocalyptic air.","filename":"data/vaneerConsumption/HoThuyTienparkinVietnamhasbeenreclaimedbynature.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E5389A500000578-0-image-a-29_1489662638954.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319702_Ho-Thuy-Tien-park-Vietnam-reclaimed-nature_1540258996.html","title":"Ho Thuy Tien park in Vietnam has been reclaimed by nature","title_page":"Ho Thuy Tien park in Vietnam has been reclaimed by nature | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was meant to play host to children's happiest memories, but this abandoned water park now looks more like a nightmare after being left to crumble into ruin.\nThe Ho Thuy Tien park in Central Vietnam once teeming with life, but haunting images show the park has now taken on an post-apocalyptic air as plants creep into every crevice.\nBrisbane photographer Nathan Peauril was drawn to the mysterious landscape, which was opened in a half-finished state in 2004 before shutting up shop due to a lack of visitors.\nChasing the dragon: Brisbane photographer Nathan Peauril was drawn to the mysterious Ho Thuy Tien park in Central Vietnam\nProtector: Explorers are greeted at the entrance by a huge metal dragon perched protectively atop of the abandoned aquarium\n'There is a timeless and surreal beauty in viewing nature retaking man-made structures,' he told Daily Mail Australia.\n'There is a certain nostalgic feeling you get that can't be replicated elsewhere.'\nVisitors are greeted by a huge metal dragon perched protectively atop the abandoned aquarium. The corridors winding out below resemble the beast's ribs.\nImages show cracked slides shrouded in leaves and palm trees growing through their spirals. The pools where crocodiles once lurked are now filled with murky algae-infested waters.\nWhile the park has tourism company who opened the park have long moved on, Mr Peauril said animals have since taken up residence.\n'There was a group of cows and an amorous bull. I'm told three crocodiles were left behind after the park closed, but I understand they were moved on by animal services.'\nPlace of reflection: The park was once teeming with life, but haunting images show it has now taken on an post-apocalyptic air\nSlip and slide: Images show cracked slides shrouded in leaves and palm trees grow through their spirals\nThe pools where crocodiles once lurked are now half-filled with murky algae-infested waters\nThe park originally opened in 2004 and cost US$3 million to build, and despite falling derelict it now garners more tourism as an attraction for urban explorers.\n'If my experience is anything to go by, the park appears significantly more popular now in its dilapidated state than when new and operational.'\nMr Peauril said fellow visitors made it challenging to photograph the site, but strongly suggested a visit.\nYou can visit more of his work here\nWhile the park has tourism company who opened the park have long moved on, Mr Peauril said animals have since taken up residence","url":"https://www.dailymail.co.uk/news/article-4319702/Ho-Thuy-Tien-park-Vietnam-reclaimed-nature.html"}
