{"authors":["Ian Ladyman For Mailonline"],"date_download":"2018-10-23 04:45:48","date_modify":"2018-10-23 04:45:48","date_publish":"2017-03-10 14:51:27","description":"It's Hot or Not time again as Sportsmail's IAN LADYMAN reveals what's been making him feel warm and what's been leaving him cold.","filename":"data/vaneerConsumption/HOTORNOTWestBromprovethathavingballisoverrated.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E01609800000578-0-image-a-17_1489156890436.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301254_HOT-NOT-West-Brom-prove-having-ball-rated_1540269948.html","title":"HOT OR NOT: West Brom prove that having ball is over-rated","title_page":"HOT OR NOT: West Brom prove that having ball is over-rated | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's Hot or Not time again as Sportsmail's IAN LADYMAN reveals what's been making him feel warm and what's been leaving him cold.\nHOT\nWEST BROM\nThe football hipsters won't like this but Tony Pulis and his improving team are showing that there is more than one way to win a football match. The Baggies are eighth in the Premier League despite having less possession than their opponents in every single game they have played. Proof that having the ball is over-rated.\nTony Pulis and West Brom are showing that there is more than one way to win a football match\nJOHN MURRAY\nOne of BBC 5 Live sport's strengths is its diversity but old school values remain. That's why lead football commentator Murray was recognised as the best in his field at the Sports Journalism Awards. Listening to big John is like turning the radio to have your head massaged.\nCommentator John Murray was recognised as the best in his field at Sports Journalism Awards\nLAURA MUIR\nThe GB athlete's double gold at the European Indoor Athletic Championships sets the trainee vet up perfectly for the outdoor season but it seems she has her priorities straight. One of her first post-race interviews was to the 'Veterinary Times' (circulation unknown) and she was back on work placement the day after returning from victory in Belgrade.\nAthlete Laura Muir returns from the European Indoor Championships with two gold medals\nJOSE MOURINHO\nThe Manchester United manager's pitch gripes in Rostov were tedious but YouTube footage of his exchange with an overwhelmed ball boy in the tunnel pre-kick off was one of the highlights of the week. If you haven't seen it, you must.\nManchester United manager Jose Mourinho greets a star struck ball boy in Rostov\nMourinho gave the lad a hug, with the ball boy unable to believe his good fortune\nNOT\nTHE DRS ROW\nIndia captain Virat Kohli has accused Australian batsmen of seeking signals from team-mates watching TV in the pavilion before deciding whether to review LBW decisions. Just one question: Why has nobody thought of this before?\nVirat Kohli was unhappy after Steve Smith appeared to ask his dressing room for DRS advice\nNICKLAS BENDTNER\nThe former Arsenal striker predicted in 2009 that he would one day be among the world's best. But after more than a decade trying to make it, the Dane has left Nottingham Forest to return to Scandinavia with Rosenborg. In football terms, it's the equivalent of moving back in with your parents.\nRosenberg's official Instagram account posted this photo of Nicklas Bendtner signing for them\nPARIS SAINT-GERMAIN\nAll hail the miracle of the Nou Camp but vanquished PSG may take a while to recover. The French champions completed only four passes in the final 11 minutes and three of those were kick-offs. The price, perhaps, of playing in a domestic league that is short on the challenge of real competition.\nPSG boss Unai Emery cuts dejected figure after Barcelona secured sensational comeback win\nGRAEME MCDOWELL\nThe superstar golfer was late to Twitter so has found the @gmac handle he craves has already been taken by a chap called Graeme Maclachlan from Glasgow. His offer to 'grab this handle from you' this week fell on deaf ears. Substitute 'grab' for 'buy' and the real GMac may find he has a deal….","url":"https://www.dailymail.co.uk/sport/football/article-4301254/HOT-NOT-West-Brom-prove-having-ball-rated.html"}
