{"authors":[],"date_download":"2018-10-23 01:39:17","date_modify":"2018-10-23 01:39:17","date_publish":"2017-03-10 10:08:09","description":"Film buffs with the hottest ticket in town were left running for safety after a giant model of King Kong went up in flames at the sizzling Vietnam premiere...","filename":"data/vaneerConsumption/HotticketVietnamKingKongpremiereruinedbymonsterfire.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/10/wire-195251-1489140495-453_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300662_Hot-ticket-Vietnam-King-Kong-premiere-ruined-monster-fire_1540258757.html","title":"Hot ticket: Vietnam King Kong premiere ruined by monster fire","title_page":"Hot ticket: Vietnam King Kong premiere ruined by monster fire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fire tore through a giant model of King Kong during the premiere of the \"Kong: Skull Island\" in Ho Chi Minh City on March 9, 2017\nFilm buffs with the hottest ticket in town were left running for safety after a giant model of King Kong went up in flames at the sizzling Vietnam premiere of the rebooted horror classic.\nThe blaze began as a glamorous announcer welcomed communist party officials, diplomats and celebrities to the screening of 'Kong: Skull Island' in Ho Chi Minh City on Thursday night.\nBut the razz-matazz soon gave away to farce as a blaze -- apparently started by a torch discarded by a fire dancer -- consumed the over-sized primate in minutes.\nThe fire tore through the five-metre high model, sending film-goers scurrying for cover as flames burned demon-like through King Kong's eyes.\nThe only injuries caused by the fire were to the model of the giant ape -- and the pride of event organisers, as video of the fiasco went viral.\n\"Due to a mistake from one of the (fire) dancers, part of the stage caught fire and spread to all of the decorations,\" according to a statement by Vietsin Commercial Complex Development, the company in charge of the shopping mall where the premiere was held.\nThe fire was extinguished after five minutes.\nBut Vietnamese social media lit up with amusement at the bungled launch.\n\"It was better than watching a 3D movie,\" a facebook user called Hoang Quoc Hiep quipped, while others speculated the fire was part of a PR stunt.\nDirected by Jordan Vogt-Roberts, the latest outing for Kong features an A-list cast led by Samuel L Jackson, Tom Hiddleston, Brie Larson and John Goodman.\nThe $185 million blockbuster is the first Hollywood movie to be shot in the communist country and includes many landmark locations, including the limestone cliffs of Ha Long bay.","url":"https://www.dailymail.co.uk/wires/afp/article-4300662/Hot-ticket-Vietnam-King-Kong-premiere-ruined-monster-fire.html"}
