{"authors":["Ap Reporter"],"date_download":"2018-10-23 00:03:52","date_modify":"2018-10-23 00:03:52","date_publish":"2017-04-26 09:15:55","description":"NBA PLAY-OFFS ROUND-UP: James Harden had 34 points as his supporting cast helped Houston get a 105-99 victory over Oklahoma City on Tuesday night to seal a 4-1 series win.","filename":"data/vaneerConsumption/HoustonRocketsbeatOklahomaCityThundertoreachsemis.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9BDD7400000578-0-image-a-27_1493194081619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_othersports_article-4446710_Houston-Rockets-beat-Oklahoma-City-Thunder-reach-semis_1540253032.html","title":"Houston Rockets beat Oklahoma City Thunder to reach semis","title_page":"Houston Rockets beat Oklahoma City Thunder to reach semis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"James Harden had 34 points and his supporting cast helped Houston overcome a 47-point game by Russell Westbrook to get a 105-99 victory over Oklahoma City on Tuesday night to advance to the NBA's Western Conference semi-finals.\nThe Thunder head home a year after advancing to the Western Conference finals after Houston took this series 4-1.\nThe Rockets used a 5-1 run, with all their points coming on free throws, to pull away from the Thunder and make it 98-91. Victor Oladipo threw a pass about five feet above Westbrook's head and out of bounds on the next possession and Harden made a layup on the other end with about three minutes left.\nJames Harden goes to the basket during Houston Rockets's win over Oklahoma City Thunder\nThe Rockets began eating up the clock after that and Oklahoma City missed shot after shot that could have closed the gap.\nHouston couldn't add to the lead though and the Thunder cut it to four points twice in the final seconds, with the second one coming on a basket by Alex Abrines. But Harden made two free throws both times they got close to secure the win.\nSPURS 116, GRIZZLIES 103\nKawhi Leonard had 28 points and San Antonio rebounded from two discouraging road losses to beat Memphis and take a 3-2 lead in their first-round series.\nSan Antonio shot 14 for 28 on three-point attempts, two off their post-season record, including five-for-seven shooting by Patty Mills.\nSan Antonio Spurs forward Kawhi Leonard shots during his team's victory on Tuesday night\nMills finished with 20 points and Tony Parker added 16.\nMike Conley had 26 points and Marc Gasol added 17 for the Grizzlies, who have lost nine straight post-season games in San Antonio.\nWith each team winning on its home court, Game Six is Thursday night in Memphis.\nJAZZ 96, CLIPPERS 92\nGordon Hayward scored 27 points, Utah controlled the paint, and the Jazz beat the Los Angeles Clippers to take a 3-2 lead in their first-round series.\nHayward returned after missing most of Utah's win in Game Four because of food poisoning.\nChris Paul's three-pointer drew the Clippers within two with five seconds left. After George Hill hit two free throws, Paul struggled getting the ball under control near the sideline and couldn't do anything as time expired.\nGordon Hayward managed 27 points as Utah Jazz beat the LA Clippers at the Staples Center\nThe Jazz made five three-pointers in the fourth quarter, including three by Rodney Hood, who finished with 16 points.\nPaul led the Clippers with 28 points and J.J. Redick added 26 with injured star Blake Griffin watching from the bench, his right foot encased in a black walking boot.\nThe Jazz can clinch the series with a victory in Game Six on Friday night in Salt Lake City.","url":"https://www.dailymail.co.uk/sport/othersports/article-4446710/Houston-Rockets-beat-Oklahoma-City-Thunder-reach-semis.html"}
