{"authors":[],"date_download":"2018-10-22 22:13:07","date_modify":"2018-10-22 22:13:07","date_publish":"2014-05-09 13:40:28","description":"The housing rebound is waning. And it may be awhile before it gets a second wind.","filename":"data/vaneerConsumption/HousingsFadingReboundWillRippleThroughEconomy.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/431716/140509-realesate_0953_3b2546bd4ab36e6ef337044b62dc082d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_real-estate_housings-fading-rebound-will-ripple-through-economy-n101331_1540246387.html","title":"Housing's Fading Rebound Will Ripple Through Economy","title_page":"Housing's Fading Rebound Will Ripple Through Economy ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe housing rebound is waning. And it may be awhile before it gets a second wind.\nLast spring, a surge in home sales boosted house prices—along with hopes that the 7-year-old housing bust was finally over. But after a bleak winter that depressed the entire economy, this spring is looking like a washout.\n\"Bargain prices brought out massive amounts of investment buying last year—which was not where demand usually comes from,\" said Joel Naroff, chief economist of Naroff Economic Advisors. \"When you had double-digit increases in sales starts and prices, the idea that would continue is unrealistic.\"\nNow, with prices leveling off and sales weakening again, there are rising concerns that the downturn could be more than a temporary winter slump, and that it could blow cold winds through the broader economy.\nOn Wednesday, Fed Chair Janet Yellen warned a congressional panel that \"the recent flattening in housing activity could prove more protracted than currently expected.\"\nFor the last eight years, the economic recovery has been held back by the weakest housing recovery since the Great Depression. After sales of existing homes peaked at an annual rate of 7.3 million in 2005, a historic, four-year slide cut them to roughly half that level. Sales perked up in 2009 thanks to tax breaks for first-time homebuyers, but tanked again to new lows after the program expired in 2010.\nSince 2012, a gradual bottoming of prices has helped spur a wave of heavy buying by investors—everyone from mom-and-pop landlords to hedge funds snapping up houses in bulk. Cash buyers still make up more than 40 percent of home sales, according to RealtyTrac.\nBut as price gains level off, the strength of that cash infusion is fading.\n\"The transition that we're going through now is this slowdown in the investment component to the more traditional buyer,\" said Naroff. \"How long will it take? We've never been through this. So I don't think anyone can answer that question.\"\nAs Yellen's caution indicated, the outcome will have widespread implications for the overall economy. Part of the uncertainty is based on the heavy flow of investment cash that has masked ongoing weakness in underlying demand for housing, especially from first-time and non-cash buyers.\nTight credit gets some of the blame for that weakness. Though mortgage rates remain relatively low by historical standards, lenders remain choosy about who they'll approve for a loan.\n\"When you have folks on the bottom who can't get access to credit and can't buy—then the home you're trying to sell has less value because there's less demand for it. There's a ripple up effect.\"\nWhile lending standards have eased for commercial and other types of consumer loans, \"we have not seen meaningful signs of easing in mortgage lending despite rising house prices and very low levels of mortgage defaults,\" said Goldman Sachs economist Hui Shan in a recent note.\nThose tighter lending standards have forced a sizeable portion of potential buyers to the sidelines, shrinking the market for homeowners with a property to sell.\n\"We've raised the bar for the bottom 25 percent of the market who otherwise would have been eligible buyers,\" said John Taylor, president of the National Community Reinvestment Coalition. \"When you have folks on the bottom who can't get access to credit and can't buy—then the home you're trying to sell has less value because there's less demand for it. There's a ripple up effect.\"\nYounger buyers struggle\nMuch of the softening of demand has come from younger entry-level buyers, who are struggling to move out on their own after surviving the Great Recession's weak job market. As of 2012, nearly 4 percent of U.S. households included an adult child aged 25 to 34, an increase of 1.2 million from 2006.\n\"Today's young adults have achieved homeownership at a lower rate than their parents at the same age, and we believe that they will continue to do so for some time,\" according to Chris Porter, chief demographer at John Burns Real Estate Consulting.\nFor those who do strike out on their own, the housing bust and foreclosure crisis has had a chilling effect on the generations-old American Dream of homeownership. A recent survey by the National Endowment for Financial Education found that homeownership was a top priority for just 13 percent of those aged 18-34. Half of the group put the goal of retirement savings at the top of their list.\nFor many millennials, financial goals have been crimped by record levels of student debt, which has doubled in the past decade to more than a trillion dollars. The average student loan balance for a collage gradate in 2013 hit $35,000, according to a survey by Fidelity.\n\"In the old days that would have been the cost of the house,\" said Taylor. \"In the recent old days that would have been a down payment. Instead it prevents (younger buyers) from getting a loan and dings their credit score because of the amount of debt. These poor kinds are paying 6, 8 and 9 percent. It's twice what a mortgage is today.\"\nOlder buyers locked out\nMillions of older buyers are also locked out of the market because they owe more than their home is worth. As of the fourth quarter of last year, some 6.5 million residential properties were underwater—or about 13.5 percent of the 50 million homes with a mortgage, according to CoreLogic. Some 10.4 million—or roughly 1 in 5—have less than 20 percent equity.\nThe hope is that over the long term, traditional homebuyers and sellers will see their financial situations improve and return to the market\n\"We haven't had that normal churn for six to seven years,\" said Naroff. \"So there's a lot of pent-up demand to move.\"\nUnless that demand kicks in soon, though, the slowdown in investment from cash buyers threatens to take even more wind out of the housing market's sails. Goldman Sachs figures a further housing market slump could lop a half point from gross domestic product in the second half of the year.\nThe impact of such a slowdown would be felt beyond the housing industry, said Naroff.\n\"It hits sales of all the things and services that people buy to make a new home their own,\" he said. \"When you have slower housing sales that effects retail sales as well. It hits across the economy.\"","url":"https://www.nbcnews.com/business/real-estate/housings-fading-rebound-will-ripple-through-economy-n101331"}
