{"authors":["Mark Fleming","First American Financial Corporation"],"date_download":"2018-10-30 23:11:33","date_modify":"2018-10-30 23:11:33","date_publish":"2018-07-22 00:00:00","description":"Home completions in the US increased more than 2% over the last year, bringing the housing market is now almost at a 3-year low in the gap between housing supply and demand. While the increase in completions is a welcome sign, two measures of future housing supply declined.","filename":"data/vaneerConsumption/Housingmarketisclosetoa3yearlowinsupplydemandgap.json","image_url":"https://amp.businessinsider.com/images/5b522d9d19032f50408b45ca-480-240.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_housing-market-is-close-to-a-3-year-low-in-supply-demand-gap-2018-7_1540941093.html","title":"Housing market is close to a 3-year-low in supply-demand gap","title_page":"    Housing market is close to a 3-year-low in supply-demand gap - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"AP Photo/John Raoux, File\nYesterday's Census Bureau report on housing construction bodes well for home buyers, as the pace of housing completions increased 2.2 percent over last year. The continued year-over-year growth in completions means more homes on the market in the short-term, offering some immediate relief in alleviating housing supply shortages.\n\"The growth in the pace of housing completions, now at a 1.26 million seasonally adjusted annualized rate, means we're almost at a 3-year low in the gap between housing supply and demand.\"\nThe growth in the pace of housing completions, now at a 1.26 million seasonally adjusted annualized rate (SAAR), means we're almost at a 3-year low in the gap between housing supply and demand. As builders start work on additional housing, we will inch closer to balancing inventory with demand. But, with millennials entering household formation age and baby boomers living longer and more independently than previous generations, builders will remain under pressure to keep up with the growing demand.\nWhile the increase in completions is a welcome sign, two measures of future housing supply declined. Building permits decreased 3.0 percent since this time last year, while housing starts fell 4.2 percent, indicating a slight decrease in the longer-term production pipeline of new housing supply.\nHowever, another important metric indicates we may see further increases in housing construction soon. Construction labor, which saw an increase of nearly 4,000 residential construction jobs between May 2018 and June 2018, supports further improvement in the pace of home-building and signals that housing construction is likely going to increase in the months ahead.\nFirstAm\nJune 2018 Housing Starts\nFor the month of June 2018, the new residential construction report shows that:\nThe number of building permits issued, a leading indicator of housing starts, decreased by 3.0 percent year over year.\nHousing starts decreased by 4.2 percent, compared with a year ago.\nThe stock of housing units authorized to be built increased by 10.3 percent, and the number of housing units under construction increased by 4.9 percent on an annual basis.\nThe number of completed homes, which is additional new net supply added to the housing stock, increased by 2.2 percent compared with a year ago.\nChief Economist Analysis Highlights\nThe annual increase in completions signals modest immediate relief from the housing shortage and sends an optimistic message about the housing market.\nIn June, the overall pace of housing starts, at 1.17 million units, is a 12.2 percent decrease from the previous month. Based on the less volatile three-month moving average, the volume of total residential (single- and multi-family) housing starts is 54,000 less than May 2018, but 99,000 units higher than a year ago.\nHousing starts are an important indicator of future supply as the housing market continues to face a supply constraint challenge.\nAn estimated seasonally adjusted annualized rate of 1.26 million housing units were completed in June, representing a 2.2 percent increase from the June 2017 figure of 1.25 million - a modest, yet important, step toward producing enough housing to meet market demand.\nWhat Insight Does Monthly Housing Start Data Provide?\nHousing starts data reports the number of housing units on which construction has been started in the month reported, providing a gauge of future real estate supply levels. The source of monthly housing starts data is the \"New Residential Construction Report\" issued by the U.S. Census Bureau jointly with the U.S. Department of Housing and Urban Development (HUD). The data is derived from surveys of homebuilders nationwide, and three metrics are provided: building permits, housing starts and housing completions. Building permits are a leading indicator of housing starts and completions, providing insight into the housing market and overall economic activity in upcoming months. Housing starts reflect the commitment of home builders to new construction, as home builders usually don't start building a house unless they are confident it will sell upon completion. Changes in the pace of housing starts tells us a lot about the future supply of homes available in the housing market. In addition, increase in housing starts can lead to increases in construction employment, which benefits the overall economy. Once the home is completed and sold, it generates revenue for the home builder and other related industries, and is added to the housing stock.","url":"https://www.businessinsider.com/housing-market-is-close-to-a-3-year-low-in-supply-demand-gap-2018-7"}
