{"authors":[],"date_download":"2018-10-30 17:59:50","date_modify":"2018-10-30 17:59:50","date_publish":"2017-03-15 22:08:00","description":"A House subcommittee in Georgia stripped the \"Back the Badge\" bill of language relating to protesters who obstruct public passages.","filename":"data/vaneerConsumption/HousecommitteestripsBacktheBadgebillofobstructionlanguage.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/15/Images/newsEngin.18095596_jwj-David-Joseph-0604.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_b0b49e67ab45db9413be91b37638fab4__1540922390.html","title":"House committee strips 'Back the Badge' bill of 'obstruction' language","title_page":"House committee strips 'Back the Badge' bill of 'obstruction' language","title_rss":"NULL","source_domain":"ajc.com","text":"A House subcommittee voted Wednesday to strip a bill of language that would have punished individuals who purposefully obstruct highways, streets and public passages to the satisfaction of civil rights groups.\nPublic Safety Committee Chairman Tyler Harper said Senate Bill 160, dubbed “Back the Badge Act,” is an effort to show law enforcement officials that the state cares for them and appreciates the work they do. The bill expands protections for officers who are assaulted in the line of duty.\nBut several civil rights groups, including American Civil Liberties Union of Georgia and Asian Americans Advancing Justice of Atlanta, took issue with a section of the bill that would have convicted a “person who, without authority of law, purposefully or recklessly obstructs any highway, street, sidewalk, or other public passage in such a way as to render it impassible without unreasonable inconvenience or hazard and fails or refuses to remove the obstruction after receiving a reasonable request” with a misdemeanor of high and aggravated nature.\nIn a press conference held Wednesday prior to the subcommittee meeting, Andrea Young, executive director of ACLU of Georgia, said the language targeted political speech and discouraged political engagement.\nShe referenced a protest in July that temporarily shut down the Downtown Connector after the shooting of two black men by police officers in Louisiana and Minnesota and a man was found hanging from a tree in Piedmont Park. Footage from Periscope showed a group of protesters shouting “Black Lives Matter” and “Hands Up, Don’t Shoot.”\n“We are opposed to any legislation that would enhance penalties, create felonies for people who are involved in protest is directly affected at impeding people’s right to be hear and to express their political views,” Young said.\nHarper, the bill’s sponsor, said he does not intend for the legislation to discriminate or deter peaceful protest.\n“If you abide by the law, nothing in this bill will affect you,” said Harper, a Republican from Ocilla. “This is not pointed at anybody. It doesn’t stop anybody from exercising their first amendment rights. I believe this is an appropriate part of this legislation.”\nStill, committee members voted 6-4 to adopt an amendment proposed by state Rep. Robert Trammell, D-Luthersville, to remove the section in the bill.\n“I think in practice it cracks down on civil disobedience,” said state Rep. Ed Setzler, R-Acworth. “I dont want to enable civil disobedience or turn a blind eye to it, but I just think there’s a lot of first amendment things right on the line that I wrestle with on this that I don’t know existing law isn’t already handling.”\nLawmakers also voted to decrease the fine that violators could be required to pay from $5,000 to $2,000.\n“A $5,000 may be more on the unrealistic side. That may even dissaude somebody under terms of probation from ever even attempting to make payments on that because it’s more than they could possibly afford,” said state Rep. Bert Reeves, chairman of the subcommittee.\nWith this victory, Aisha Yaqoob, policy director for AAAJ of Atlanta, said she is shifting focus to Senate Bill 1, sponsored by Senate Majority Leader Bill Cowsert, which broadly rewrites Georgia’s domestic terrorism law to give the state attorney general more power, by overseeing multi-jurisdictional investigations, to prosecute alleged terrorists.\nSB 1 will continue to be heard Thursday morning.","url":"https://www.ajc.com/news/state--regional-govt--politics/house-subcommittee-strips-back-the-badge-bill-obstruction-language/UtaScsbgsZCDuO2lQlQSzJ/"}
