{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:54:54","date_modify":"2018-10-30 21:54:54","date_publish":"2016-12-16 00:00:00","description":"Brexit risks leaving UK citizens 'less safe,' the House of Lords warned, unless existing relationships with EU police and security forces are maintained.","filename":"data/vaneerConsumption/HouseofLordsreportonBrexitsafetyandsecurity.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_house-of-lords-report-on-brexit-safety-and-security-2016-12_1540936494.html","title":"House of Lords report on Brexit safety and security","title_page":"    House of Lords report on Brexit safety and security - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"PA Brexit risks leaving UK citizens \"less safe,\" the House of Lords warned, unless existing relationships with European Union police and security forces are maintained.\n\"We therefore expect this to form an essential part of negotiations on the UK's future relationship with the European Union, with the UK and the EU-27 sharing an interest in ensuring that there is no diminution in the level of safety and security afforded to their citizens,\" the Lords said.\nThere are around 30 criminal justice agreements between UK and European authorities which should be \"retained or adequately replaced\" to snuff out increased security risks, according to a report from a House of Lords sub-committee on EU membership.\nThe UK may also lose decision-making clout in international security forces, such as Interpol, the committee said.\nTerrorism does not respect national borders, the Lords said, and so agreements have to be in place to ensure corporation with EU countries after Brexit.\n\"We anticipate that even with the utmost good will on both sides, and a recognition of the mutual interest at stake, there may be practical constraints on how closely the UK and the EU-27 can work together in future if they are no longer bound by the same rules, enforced by the same supranational institutions,\" the Lords said.\nFinally the Lords warned that the UK could be left out of policy decisions on rules for data protection and privacy.\n\"Although the UK is currently bound by EU standards, and is therefore likely to comply with them comfortably at the point when it leaves the EU, this could pose a problem in future as EU policy continues to develop and rules are updated while the UK is no longer at the table to influence the pace and direction of change,\" the committee said.","url":"https://www.businessinsider.com/house-of-lords-report-on-brexit-safety-and-security-2016-12"}
