{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:14:17","date_modify":"2018-10-30 20:14:17","date_publish":"2015-07-29 22:32:23","description":"House Leaves for Recess With No Vote to Defund Planned Parenthood","filename":"data/vaneerConsumption/HouseRecessNoVotetoDefundPlannedParenthood.json","image_url":"https://media.breitbart.com/media/2015/07/House-Members-Leave-Congress-J.-Scott-ApplewhiteAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_29__1540930457.html","title":"House Recess, No Vote to Defund Planned Parenthood","title_page":"House Recess, No Vote to Defund Planned Parenthood","title_rss":"NULL","source_domain":"breitbart.com","text":"The House is leaving for its summer recess until September 8 without voting on legislation to defund Planned Parenthood in the wake of the recent gruesome videos released of the abortion giant’s practice of harvesting the body parts of aborted babies for sale to biomedical companies.\nA House leadership aide reportedly told The Hill, “In order to enact legislation to defund Planned Parenthood, we need more Republicans and Democrats in both the House and the Senate to support our efforts.”\nThousands of Americans participated in rallies across the nation Tuesday to urge their state and federal lawmakers to investigate and defund Planned Parenthood in the wake of the revelations in the videos.\nRep. Diane Black condemned the chamber for its failure to pass the Defund Planned Parenthood Act of 2015, a measure she introduced and for which there are 150 cosponsors, only one of which is a Democrat, Rep. Dan Lipinski (IL).\nBlack said on the House floor:\nI stand here profoundly disappointed that the House will leave town today without taking a vote on my legislation to defund Planned Parenthood. Over the past two weeks, we’ve all seen the gruesome videos showing the heartless depravity of this organization. We issued statements, we made passionate floor speeches, and we pledged action. Now, our constituents would like to know when we’re going to follow through on that promise.\n“Today, I’m reminded of the words of Dietrich Bonhoeffer: ‘Silence in the face of evil is itself evil. Not to speak is to speak. Not to act is to act,’” she added.\nBlack, who has been a nurse for over 40 years and is a member of the Congressional Pro-Life Caucus, concluded by saying, “[W]e have a moral obligation to defund Planned Parenthood, and we must do it now – not when the politicians and pundits think it is most politically expedient.”\nThough House Republican leaders have lambasted the videos, The Hill reports they have indicated legislation to defund Planned Parenthood would not likely come up for a vote in the near future.\nThe Senate, nevertheless, is expected to vote next week on a legislation effort led by Sen. Rand Paul that would defund Planned Parenthood. Senate Majority Leader Mitch McConnell confirmed Tuesday that the Senate will vote next week to eliminate the $540 million in taxpayer funding the nation’s largest abortion provider receives.\nAt least one Republican senator, Sen. Susan Collins (ME), said Wednesday, according to the Associated Press, that until she knows more, she will oppose ending federal support to Planned Parenthood.","url":"https://www.breitbart.com/politics/2015/07/29/house-leaves-for-recess-with-no-vote-to-defund-planned-parenthood/"}
