{"authors":[],"date_download":"2018-10-22 21:50:24","date_modify":"2018-10-22 21:50:24","date_publish":"2014-05-08 14:47:13","description":"The House Veterans Affairs Committee on Thursday voted to subpoena Veterans Affairs Secretary Eric Shinseki.","filename":"data/vaneerConsumption/HouseCommitteeSubpoenasShinsekiAmidVAScandal.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/429091/140508-shinseki_va_housesubpoena-1039_7e507488975e0c213544fe99f7cb4558.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_house-committee-subpoenas-shinseki-amid-va-scandal-n100351_1540245024.html","title":"House Committee Subpoenas Shinseki Amid VA Scandal","title_page":"House Committee Subpoenas Shinseki Amid VA Scandal","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe House Veterans Affairs Committee on Thursday voted to subpoena Veterans Affairs Secretary Eric Shinseki after reports that 40 veterans may have died while waiting for treatment at a Phoenix VA hospital.\nThe committee is calling on Shinseki to produce emails and correspondence he sent to several top VA officials dating back to April 9, 2014.\nThe American Legion, the nation’s largest veterans group, along with some members of Congress are demanding Shinseki resign after allegations that hospital administrators attempted to cover up the deaths by destroying records of veterans who died while seeking care.\nAlso on Thursday, Shinseki accepted an invitation from Senate Veterans’ Affairs Committee Chair Bernie Sanders to appear the panel on May 15.\nShinseki has brushed aside calls for his resignation, telling NBC News, “I serve at the pleasure of the president.”\nThe White House issued a statement saying President Barack Obama remains confident in Shinseki.\nHouse Speaker John Boehner, R-Ohio, also said he is “not ready to join the chorus of people calling on him to step down” during a news conference Thursday.","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/house-committee-subpoenas-shinseki-amid-va-scandal-n100351"}
