{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:51","date_modify":"2018-10-30 19:55:51","date_publish":"2016-07-07 14:48:34","description":"Gun Owners of America warns that guns should not be part of post-Orlando discussion. Rather, the focus should be on abolishing gun-free zones.","filename":"data/vaneerConsumption/HouseGOPShouldFocusonGunFreeZonesNotGuns.json","image_url":"https://media.breitbart.com/media/2016/02/gun-free-zone-business-flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/2nd-amendment_2016_07_07__1540929351.html","title":"House GOP Should Focus on Gun-Free Zones, Not Guns","title_page":"GOA: House GOP Should Focus on Gun-Free Zones, Not Guns","title_rss":"NULL","source_domain":"breitbart.com","text":"While House Speaker Paul Ryan (R-Wisc.) and other GOP lawmakers vacillate on gun control, combined with the language of terrorism, Gun Owners of America (GOA) warns that guns should not be part of the post-Orlando conversation. Rather, the focus should be on abolishing gun-free zones–like Pulse Orlando–and arresting the individuals who are named in terror watch lists, if those lists are actually reliable.\nGOA sounded the alarm because of House Majority Leader Kevin McCarthy’s (R-CA-23) HR 5611, a bill that institutes elaborate new gun controls under the guise of fighting terrorism.\nGOA has a simple solution: focus on terrorists, not guns. France and California have proven that determined terrorists can get guns no matter how strict the laws. The solution is not to weaken the position of law-abiding citizens by going after firearms, thereby making it even harder for them to get the weapons they need for self defense. Rather, the solution is to go after terrorists who are considered too dangerous to board a passenger jet or purchase a firearm.\nIn a letter to Congress, GOA’s Erich Pratt contended, “If you’re too dangerous to fly, you’re too dangerous to come into our country and walk our streets. And if the people on the terror watch list are too dangerous to buy a gun, then why is the administration not prosecuting and incarcerating them?”\nPratt believes this “administration’s failure” to go after people on such lists “is a tacit admission that many of [those people] do NOT belong on a watch list,” thus the GOA’s continued opposition to using such imprecise lists as a litmus test for who does or does not possess constitutional rights.\nIf people on the lists are such a threat, arrest them or bar them from entrance into the country. Do not leave them among us or grant them entry and then use their propensities as a justification for more gun laws.\nAdditionally, GOA makes clear that gun-free zones are killing fields, and Pulse Orlando was simply the latest proof. If Speaker Ryan and House leadership want to do something to keep Americans safe, they should move to abolish gun-free zones–where they possess power to do so–and encourage their colleagues in the Senate to follow suit.\nIn August 2015, Breitbart News published an overview of just eight attacks in gun free zones: Virginia Tech (April 2007), Fort Hood (November 2009), Aurora movie theater (July 2012), Sandy Hook Elementary School (December 2012), DC Navy Yard (September 2013), Fort Hood (April 2014), Chattanooga military offices (July 2015), and Lafayette Grand Theatre (July 2015). In those eight attacks alone, 105 lives were lost, and more than 150 others were injured.\nIn each incident, the attacker had the upper hand because his targets could not shoot back.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/2nd-amendment/2016/07/07/goa-house-gop-should-focus-on-gun-free-zones-terrorists-not-guns/"}
