{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:56:24","date_modify":"2018-10-30 19:56:24","date_publish":"2016-09-08 11:49:59","description":"The chairman of the House Committee on Veterans Affairs told Breitbart News Donald J. Trump understands the problems facing today's veterans, and he is the only one who can fix the scandal-ridden Department of Veterans Affairs. | Politics","filename":"data/vaneerConsumption/HouseVeteransChairTrumpsTheOneWhoUnderstandsTheDesperateNeedtoServeVeteransInthe21stCentury.json","image_url":"https://media.breitbart.com/media/2016/05/Vets-for-Trump-AP-Ted-S.-Warren.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_08__1540929384.html","title":"House Veterans Chair: Trump's The One Who Understands The Desperate Need to Serve Veterans In the 21st Century","title_page":"House Veterans Chair: Trump's The One Who Understands The Desperate Need to Serve Veterans In the 21st Century | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The chairman of the House Committee on Veterans Affairs told Breitbart News Donald Trump understands the problems facing today’s veterans, and he is the only one who can fix the scandal-ridden Department of Veterans Affairs.\n“Donald Trump is the only candidate who understands the desperate need to reform the Department of Veterans to serve veterans in the 21st century,” said Rep. Jefferson B. Miller (R.-Fla.), who represents the northwest section of the Sunshine State. “Hillary Clinton is more of the same.”\nMiller said he was personally impressed with Trump’s 10-point plan to address the problems at the VA. “Trump‘s plan hits upon those areas that need reform most,” he said.\n“Accountability and transparency are at the top of that list,” said the man, who replaced in Congress Joe Scarborough, who resigned in the middle of his term in September 2001, shortly before the Sept. 11 attacks. The congressman himself retires at the end of the congressional session.\nThis is the outline of the Trump plan for veterans:\nIncrease funding for post-traumatic stress disorder (PTSD), traumatic brain injury and suicide prevention services to address our veterans’ invisible wounds. Increase funding for job training and placement services (including incentives for companies hiring veterans), educational support and business loans. Better support our women veterans. Fire the corrupt and incompetent VA executives that let our veterans down. End waste, fraud and abuse at the VA. Modernize the VA. Empower the caregivers to ensure our veterans receive quality care quickly. Embed satellite VA clinics in rural and other underserved areas. Ensure our veterans get the care they need wherever and whenever they need it. Support the whole veteran.\nMiller said Trump will have the strength to talk one of the most stubborn obstacles to making things better for veterans, the department’s union, the American Federation of Government Employees.\nThe union leaders want to protect the status quo and they are not concerned with the well-being of the veterans, he said.\nA classic example of how the union works to protect its workers as the expense of the veterans is when the union got an early draft of the Veterans First Act, he said. The act was a bill sponsored by Sen. Johnny Isakson (R.-Ga.) that would have seriously changed how the VA went about its business.\n“They basically demanded that senators water down the bill in four key areas,” he said.\nAfter Senate Republicans met the demands of the union, the AFGE supported the bill, which created the appearance of their supporting reforms, while actually gutting reform, the congressman said.\n“Once the union bosses gave their approval to revised Veterans First Act, the Secretary McDonald went around trying to rally support,” he said. “But, the bill does not provide the accountability that’s necessary to transform the Department of Veterans Affairs.”\nIn the original bill, VA Secretary Robert McDonald floated a plan that would have given the secretary the authority to fire poorly performing members of the Senior Executive Service, Miller said. But “when the White House heard about it, it said: ‘No way, no how,’ and shot it down,” he said.\nMiller said he is working up against both a union leadership opposed to reform and at VA leadership politically-allied with the union leaders. Meanwhile, nobody is making things better for the veterans.\n“In their perpetual quest to placate Big Labor’s ‘powers that be,’ the taxpayers and the veterans the workers are charged with serving are really paying the price,” he said.","url":"https://www.breitbart.com/politics/2016/09/08/house-vet-cmte-chair-trumps-one/"}
