{"authors":[],"date_download":"2018-10-22 21:11:14","date_modify":"2018-10-22 21:11:14","date_publish":"2014-06-04 15:46:49","description":"Top House leaders say Obama must \"to personally take action in order to make things right for those who have served","filename":"data/vaneerConsumption/HouseGOPPushesObamaonVAScandal.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/487096/va_hospital_24f0bb558822cd86b3ae2b9d0e2e0906.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_house-gop-pushes-obama-va-scandal-n122416_1540242674.html","title":"House GOP Pushes Obama on VA Scandal","title_page":"House GOP Pushes Obama on VA Scandal","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCalling the Veterans Affairs scandal a “national disgrace,” House Republicans are telling President Barack Obama “to personally take action in order to make things right for those who have served.”\nIn a letter to the White House, House Speaker John Boehner and his top three lieutenants write that Obama should present short- and long-term solutions to the problems that have long plagued the VA, “even if it means shaking up the current bureaucracy and rethinking the entire system.”\nThe GOP members want Obama to push for Senate passage of a bill that would ease the firings or demotions of top VA officials and to back a GOP-sponsored plan to “address veterans who are waiting for care across the country” – or present an alternative proposal.\nThe letter is signed by Boehner, Majority Leader Eric Cantor of Virginia, Majority Whip Kevin McCarthy of California and House Republican Conference Chair Cathy McMorris Rodgers of Washington.\nThe effort could serve to redirect some attention to the Veterans Affairs scandal after it was largely pushed off the front pages due to Saturday’s prisoner swap – and VA Secretary Eric Shinseki's resignation. The administration has said it wants to find a permanent replacement for Shinseki soon.","url":"https://www.nbcnews.com/politics/congress/house-gop-pushes-obama-va-scandal-n122416"}
