{"authors":["Adam Taggart","Peak Prosperity"],"date_download":"2018-10-30 23:39:49","date_modify":"2018-10-30 23:39:49","date_publish":"2018-07-17 00:00:00","description":"The easy environment financial and housing markets have had for nearly a decade are ending. Prices will waiver as investors remain in denial and refuse to sell at lower prices — but soon that denial will turn to panic, and prices will plummet.","filename":"data/vaneerConsumption/HousingmarketPricesabouttoplummetworldwide.json","image_url":"https://amp.businessinsider.com/images/5b4e338c4474db3c008b48a4-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_housing-market-prices-about-to-plummet-worldwide-2018-7_1540942789.html","title":"Housing market: Prices about to plummet worldwide","title_page":"    Housing market: Prices about to plummet worldwide - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Mark Blinch\nOur good friend John Rubino over at DollarCollapse.com just released an analysis titled US Housing Bubble Enters Stage Two: Suddenly Motivated Sellers.\nHe reminds us that housing bubbles follow a predictable progression:\nStage One: Mania -- Prices rise at an accelerating rate as factors like excess central bank liquidity/loose credit/hot foreign money drive a virtuous bidding cycle well above sustainably afforable levels.\nPrices rise at an accelerating rate as factors like excess central bank liquidity/loose credit/hot foreign money drive a virtuous bidding cycle well above sustainably afforable levels. Stage Two: Peak -- Increasingly jittery owners attempt to sell out before the party ends. Supply jumps as prices stagnate.\nIncreasingly jittery owners attempt to sell out before the party ends. Supply jumps as prices stagnate. Stage Three: Bust -- As inventory builds, sellers start having to lower prices. This begins a vicious cycle: buyers go on strike not wanting to catch a falling knife, causing sellers to drop prices further.\nRubino cites recent statistics that may indicate the US national housing market is finally entering Stage Two after a rip-roaring decade of recovery since the bursting of the 2007 housing bubble:\nthe supply of homes for sale during the \"all important\" spring market rose at 3x last year's rate\n30 of America's 100 largest cities now have more inventory than they did a year ago, and\nmortage applications for new homes dropped 9% YoY\nTaken together, these suggest that residential housing supply is increasing as sales slow, exactly what you'd expect to see in the transition from Stage One to Stage Two.\nIf that's indeed what's happening, Rubino warns the following comes next:\nPeak Prosperity\nRubino's article is timely, as we've lately been seeing a proliferation of signs that the global boom in housing is suddenly cooling. I've also recently encountered similar evidence that the housing market in my own pocket of northern California is weakening, and I'm curious to learn if other PeakProsperity.com are seeing the same in their hometowns.\nThe Global Housing Bubble\nHousing, as they accurately say, is local. Conditions differ from region to region, making generalizations of the overall market difficult.\nThat said, the tsunami of $trillions printed by the world's central banking cartel since 2008 clearly found its way into the housing market.\nThe world real estate market is HUGE, over $200 trillion. That dwarfs the global debt and equity markets. So it's no surprise the central authorities did all they could to reverse the losses the GFC created for property owners.\nAs a result, many of the most popular locations to live are now clearly in bubble territory when it comes to home prices:\nPeak Prosperity\nThe chart above displays the most bubblicious major cities around the world in red. But it's important to note that the merely 'overvalued' markets denoted in yellow, and even some of the green 'fair-valued' ones, are still wildly-unaffordable for the average resident.\nFor example, in \"yellow\" San Francisco, where the median home now costs $1.6 million, prices are well-above the excesses seen during the previous housing bubble:\nPeak Prosperity\nAnd in 'fair-valued' New York City, the median household must spend 65% of its annual income on housing alone.\nIs it any wonder that 70% of millennials who don't yet own a home fear they'll never be able to afford one?\nSigns Galore Of Topping Markets\nAt the end of a speculative bubble, it's the assets that are most overvalued that correct first and correct hardest.\nSo we would expect that as the highest-priced real estate markets fare from here, the general real estate market will follow.\nWhen we take a closer look at what's currently going on with the red-hot real estate markets noted in the chart above, we indeed see evidence supportive of Rubino's claim that the decade-long Stage One mania may now be ending.\nHere's a spate of recent headlines about these cities:\nSure looks like Rubino's predicted Stage Two symptoms of rising supply and stagnating prices.\nLocal Signs, Too\nAs mentioned, I live in northern California, quite close to Santa Rosa.\nThings here aren't as nuts as they are in San Franscico; but it's still a moderately-affluent region with lots of second homes. It's one of the semi-frothy areas I'd expect to see cooling off in first should there be a downwards turn in macroeconomic conditions.\nLocated less than an hour north of San Francisco, residential housing prices here have roughly increased 2x over the past six years as the Bay Area has boomed. Supply has been in chronic shortage, exacerbated by the loss of thousands of structures burned during last October's destructive Tubbs fire.\nBut recently, for the first time in many years, realtors here are beginning to talk of a softening they're seeing in the local housing market.\nMedian sale prices dropped from May to June, which is counter to previous years. And several towns are seeing year-over-year declines in median price -- something unheard of over the past 7 years.\nMeanwhile, the days-on-market ratio for properties is beginning to creep up.\nOf the greatest concern to the realtors in my area: bidding wars are no longer happening. Houses are selling either at or below asking prices now. That's a *big* development in a market where houses have routinely sold for $50-100K+ above the listing price.\nIn a similar vein, I'm hearing evidence of the softening rents down in San Franscico and the East Bay (Oakland/Berkeley). Wolf Richter has done a good job chronicalling the substantial volume of newly-constructed units that have recently hit the market threatening to depress rents, and I've heard from a multi-family unit owner down there how landlords in the area are now finding their rents ~$500 too high for the market to bear.\nThis is all early and anecdotal data. It's too little at this point to claim definitively that my local housing market has entered Stage Two.\nBut I'm curious to hear from other PeakProsperity.com readers. What are you observing in your local markets? Are you seeing similar signs of concern?\nPlease share any insights you have in the Comments section below. Collectively, we may be able to add clarity, in one direction or another, to Rubino's hypothesis.\nPrepping For Stage Two\nWhatever the timing, Stage Two is an inevitability for today's ridiculously-overpriced real estate markets. It's not a matter of if it (as well as Stage Three) arrives, but when.\nGiven the data above, I think Rubino is correct in his assessment. Or at least, correct enough that prudent action is warranted today.\nThis makes even greater sense when considered along with the current trends of rising interest rates and quantitative tightening. Remember, home prices and interest rates have a mathematically inverse relationship: as rates go up, home prices must go down (all else being equal). And as central banks start withdrawing in earnest the excess liquidity that inflated property values to their current nose-bleed heights, expect further downward pressure on prices.\nTo drive the urgeny home even harder, we haven't even yet talked about the damage an economic recession and/or a painful correction in the financial markets would wreak on the real estate market. With the current expansion cycle the second-longest on record and our all-time-high markets looking increasingly vulnerable, it seems very unlikely we'll avoid at least one of those crises in the near to mid-future.\nHere are worthwhile steps we recommend at this point:\nConsider selling : If you're a homeowner and are not committed to remaining in your property for the next decade+, do some scenario planning. If prices fell 20%, how much of a financial and emotional impact would that have on you? If you have substantial equity gains in your home, Stage Two is the time to protect them. If you have little equity right now, make sure you're fully aware of the repercussions you'll face should you find yourself underwater on your properity. What will your options be should you lose your job in the next recession? Whether to hold, or sell now and rent, is a weighty decision; and the rationale differs for each household -- so we strongly recommend making it with the guidance of your professional financial advisor.\n: If you're a homeowner and are not committed to remaining in your property for the next decade+, do some scenario planning. If prices fell 20%, how much of a financial and emotional impact would that have on you? If you have substantial equity gains in your home, Stage Two is the time to protect them. If you have little equity right now, make sure you're fully aware of the repercussions you'll face should you find yourself underwater on your properity. What will your options be should you lose your job in the next recession? Whether to hold, or sell now and rent, is a weighty decision; and the rationale differs for each household -- so we strongly recommend making it with the guidance of your professional financial advisor. Raise cash : The vicious cycle that begins as Stage Two transitions into Stage Three is deflationary. Lower prices beget lower prices. During this period, cash is king. By sitting on it, your purchasing power increases the farther home prices drop. And when the dust settles, you'll be positioned to take advantage of the resulting values in the real estate market. We've written at length about the wisdom of this strategy given current market conditions, as well as how, while waiting for lower prices, you can get 30x the return on your cash savings than your bank is willing to pay you, with lower risk. Our recent report on the topic is a must-read.\n: The vicious cycle that begins as Stage Two transitions into Stage Three is deflationary. Lower prices beget lower prices. During this period, cash is king. By sitting on it, your purchasing power increases the farther home prices drop. And when the dust settles, you'll be positioned to take advantage of the resulting values in the real estate market. We've written at length about the wisdom of this strategy given current market conditions, as well as how, while waiting for lower prices, you can get 30x the return on your cash savings than your bank is willing to pay you, with lower risk. Our recent report on the topic is a must-read. Educate yourself: Yes, real estate is overpriced in a number of markets. But it has been and will remain one of the best ways available to the non-elites to amass income and tangible wealth. And as mentioned, when the next Stage 3 brings prices down, there will be value to be had -- potentially extreme value. If you aren't already an experienced real estate investor, now is the time to educate yourself; so that you'll be positioned to take informed action when the time to buy arises. Our recent podcast interview on Real Estate Investing 101 is a good place to start.\nIn Part 2: The Case For Starting To Build A (Small) Short Position, we conduct a similar analysis into the overvaluation and growing vulnerability of the financial markets (which are highly likely to correct much faster, sooner and more violently than the housing market), including the details on a recent short position we've started building.\nThe tranquil \"free ride\" the financial and housing markets have had for nearly a decade are ending. The string of easy gains with little effort are over now that the central bank money spigots are turning off at the same time the \"greater fools\" pocketbooks are tapping out.\nFor a brief time, prices will waiver, as investors remain in denial and refuse to sell at lower prices. But soon that denial will turn to panic, and prices will plummet.\nMake sure you're positioned prudently before then.","url":"https://www.businessinsider.com/housing-market-prices-about-to-plummet-worldwide-2018-7"}
