{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:45:56","date_modify":"2018-10-30 21:45:56","date_publish":"2015-10-21 23:15:06","description":"As Paul Ryan left the meeting a reporter asked about the endorsement. Ryan joked \"How did you guys know we were having a meeting?\"","filename":"data/vaneerConsumption/HouseFreedomCaucustoFurtherDiscussPaulRyanasHouseSpeaker.json","image_url":"https://media.breitbart.com/media/2015/10/AP70980854119.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_21__1540935956.html","title":"House Freedom Caucus to Further Discuss Paul Ryan as House Speaker","title_page":"House Freedom Caucus to Further Discuss Paul Ryan as House Speaker | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The House Freedom Caucus met with House Way and Means Chairman Rep. Paul Ryan (R-WI) inside the Capitol, but no members were willing to tell dozens of reporters gathered outside the door whether or not Ryan will get an endorsement for Speaker of the House from its conservative members.\nAs Ryan left the meeting, a reporter asked if he thinks he will get the endorsement. Ryan ignored the question and jokingly asked, “How did you guys know we were having a meeting?”\nAfter more than 20 minutes, the members of the House Freedom Caucus exited the room and Rep. Mark Meadows (R-NC) told reporters the group plans to hold another meeting to discuss what Ryan said to them and whether or not to change its endorsement.\nPrior to Rep. Kevin McCarthy (R-CA) withdrawing from the race for House Speaker, the House Freedom Caucus decided to endorse Rep. Daniel Webster (R-FL) over McCarthy and the other declared candidate at the time, Rep. Jason Chaffetz (R-UT). Chaffetz dropped out of the running once Ryan said he would run if the conservatives endorse him.\n“We’re trying to arrange it tonight,” Meadows said of the groups later meeting as he passed by the media.\nRep. Tim Huelskamp (R-KS) told reporters they had “a lot of good discussion, [but] we’re not done yet.”\n“There’s going to be more discussion,” he said. “It doesn’t necessarily have to be done on Friday.”\nFriday is the deadline Ryan gave the House Freedom Caucus and conservative members to endorse him, saying he would only run for Speaker if the conference united behind him.\n“We’ve had four and a half years, I think, of bad leadership and here’s a chance to fix that and you don’t do that in one meeting,” Huelskamp told reporters.\nBut Huelskamp appeared optimistic adding, “We heard a lot of different things in there that we hadn’t heard from leadership before in a long time.”","url":"https://www.breitbart.com/politics/2015/10/21/house-freedom-caucus-discuss-paul-ryan-house-speaker/"}
