{"authors":["Lucia Mutikani"],"date_download":"2018-10-30 23:39:21","date_modify":"2018-10-30 23:39:21","date_publish":"2018-07-18 00:00:00","description":"Housing starts fell to their lowest level in nine months in June as the burden from \"rising construction material costs\" weighed.","filename":"data/vaneerConsumption/Housingstartstumbleto9monthlow.json","image_url":"https://amp.businessinsider.com/images/5b4f4a18f3fd991a008b466b-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_housing-starts-tumble-to-9-month-low-2018-7_1540942761.html","title":"Housing starts tumble to 9-month low","title_page":"    Housing starts tumble to 9-month low - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Construction workers are pictured building a new home in Vienna, Virginia, outside of Washington, October 20, 2014. REUTERS/Larry Downing\n(Reuters) - U.S. homebuilding fell to a nine-month low in June and permits declined for a third straight month, dealing a blow to the housing market as it struggles with a dearth of properties available for sale.\nHigher lumber prices and shortages of land and labor are constraining homebuilding. The housingmarket is lagging overall economic growth, which appears to have accelerated in the second quarter after hitting a soft patch at the start of the year.\n\"We're seeing pressure on both sides of the market, from increasingly expensive inputs on the supply side to prices that are charging ahead of wage growth on the demand side, and the result is that neither builders nor buyers can keep up,\" said John Pataky, chief consumer and commercial banking executive at TIAA Bank in Jacksonville, Florida.\nHousing starts tumbled 12.3 percent to a seasonally adjusted annual rate of 1.173 million units last month, the lowest level since September 2017, the Commerce Department said on Wednesday. The percent drop was the biggest since November 2016 and both single and multi-family home construction declined in June.\nData for May was revised down to show starts rising at a 1.337 million-unit rate instead of the previously reported 1.350 million-unit rate. Starts fell in all four regions last month.\nBuilding permits dropped 2.2 percent to a rate of 1.273 million units, also the lowest level since September 2017.\nEconomists polled by Reuters had forecast housing starts falling to a pace of 1.320 million units last month and permits rising to a rate of 1.330 million units.\nThe dollar slightly extended losses against a basket of currencies after the data while prices for U.S. Treasuries rose.\nSingle-family homebuilding, which accounts for the largest share of the housing market, decreased 9.1 percent to a rate of 858,000 units in June. Single-family homebuilding has lost momentum since hitting a pace of 948,000 units last November, which was the strongest in more than 10 years.\nA survey on Tuesday showed confidence among single-family homebuilders unchanged in July, with builders continuing to be \"burdened by rising construction material costs.\"\nThe Trump administration in April 2017 imposed anti-subsidy duties on imports of Canadian softwood lumber, which builders say have boosted the price of a new single-family home.\nResidential investment contracted in the first quarter. June's sharp drop in homebuilding could impact on economists' forecasts for second-quarter growth, which are as high as a 5.3 percent annualized rate. The economy grew at a 2.0 percent pace in the first quarter.\nWhile permits to build single-family homes rose 0.8 percent in June to a pace of 850,000 units, they continued to trail starts. This suggests moderate gains in single-family homebuilding in the months ahead.\nStarts for the volatile multi-family housing segment plunged 19.8 percent to a rate of 315,000 units in June. Starts for buildings with five units or more fell to a 10-month low.\nPermits for the construction of multi-family homes dropped 7.6 percent to a pace of 423,000 units. The housing inventory squeeze is unlikely to ease. Housing completions were unchanged at a rate of 1.261 million units in June. The number of single-family houses completed last month fell 2.3 percent.\nRealtors estimate that housing starts and completion rates need to be in a range of 1.5 million to 1.6 million units per month to plug the inventory gap.\nThe stock of housing under construction slipped 0.5 percent to 1.121 million units. Single-family homes under construction last month dipped 0.2 percent to 515,000 units.\n(Reporting by Lucia Mutikani; Editing by Andrea Ricci)","url":"https://www.businessinsider.com/housing-starts-tumble-to-9-month-low-2018-7"}
