{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 22:12:19","date_modify":"2018-10-30 22:12:19","date_publish":"2017-02-07 16:43:51","description":"The chairman of the Science, Space and Technology Committee praised retired NOAA scientist John L. Bates for coming forward through interviews and a lengthy blog post outling how his former colleagues massaged data to produce a report debunking the so-called pause in global warming from 1998 forward.","filename":"data/vaneerConsumption/HouseChairPraisesRetiredNOAAScientistforExposingFakeScienceBehindStudyDebunkingGlobalWarmingPause.json","image_url":"https://media.breitbart.com/media/2015/10/noaa.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_07__1540937539.html","title":"House Chair Praises Retired NOAA Scientist for Exposing Fake Science Behind Study Debunking Global Warming Pause","title_page":"House Chair Praises Retired NOAA Scientist for Exposing Fake Science Behind Study Debunking Global Warming Pause","title_rss":"NULL","source_domain":"breitbart.com","text":"The chairman of the Science, Space and Technology Committee praised retired NOAA scientist John L. Bates for coming forward through interviews and a lengthy blog post outling how his former colleagues massaged data to produce a report debunking the so-called pause in global warming from 1998 forward.\n“I thank Dr. John Bates for courageously stepping forward to tell the truth about NOAA’s senior officials playing fast and loose with the data in order to meet a politically predetermined conclusion,” said Rep. Lamar Smith (R.-Texas), who is also a former chairman of the House Judiciary and Ethics committees.\n“Now that Dr. Bates has confirmed that there were heated disagreements within NOAA about the quality and transparency of the data before publication, we know why NOAA fought transparency and oversight at every turn.\n“Dr. Bates’ revelations and NOAA’s obstruction certainly lend credence to what I’ve expected all along – that the Karl study used flawed data, was rushed to publication in an effort to support the president’s climate change agenda, and ignored NOAA’s own standards for scientific study.”\nBates was the principal scientist at the National Climate Data Center and a meteorologist at NOAA and a 2014 recipient of the Department of Commerce Gold Medal.\nThe June 4, 2015 study “The Recent Global Surface Warming Hiatus” was released as President Barack Obama was organizing world leaders to join United Nations Framework Convention on Climate Change as the program was updated in Paris that year into a formal understanding know as the Paris Agreement. The study’s lead author Thomas R. Karl, was then the director of the National Centers for Environmental Information and he was the focus of what Bates described as Karl putting his thumb on the scale to reach the conclusion that global warming had not paused at all.\nIn fact, the study retroactively changed NOAA’s own temperature readings to show that instead of the global warming pause, temperatures had been increasing. The pause in rising temperature was the primary reason for climate hawks to drop “global warming” in favor of “climate change.”\nKarl retired from the National Oceanic and Atmospheric Administration six months ago after 41 years of federal service. Although Karl was often introduced and identified as “Dr. Karl,” he left his PhD program after one semester and his “doctorate,” is an LHD, or Doctor of Humane Letters, the honorary degree colleges grant graduation speakers. Karl’s bachelors and masters degree are in meteorology.\nSmith said after the study was released individuals familiar with Karl and his methodology reached out to the committee privately.\n“In the summer of 2015, whistleblowers alerted the Committee that the Karl study was rushed to publication before underlying data issues were resolved to help influence public debate about the so-called Clean Power Plan and upcoming Paris climate conference,” Smith said. “Since then, the Committee has attempted to obtain information that would shed further light on these allegations, but was obstructed at every turn by the previous administration’s officials. I repeatedly asked, ‘What does NOAA have to hide?'”\nBates posted his indictment of Karl in post at Climate Etc Friday: “The land temperature dataset used in the Karl study had never been processed through the station adjustment software before, which led me to believe something was amiss,” Bates wrote. “When I pressed the co-authors, they said they had decided not to archive the dataset, but did not defend the decision. One of the co-authors said there were ‘some decisions [he was] not happy with’.”\nTurns out the data or work product to back up the study was not posted in a digital format or properly archived for others to examine, he said. “I was dumbstruck that Tom Karl, the NCEI Director in charge of NOAA’s climate data archive, would not follow the policy of his own agency nor the guidelines in Science magazine for dataset archival and documentation.” The study was published in Science magazine.\nIn addition to those just-mentioned irregularities, Bates detailed how Karl changed how his center measured temperature and relied on software that was riddled with bugs because the version he was using produced the warming results he was looking for.\nAs Bates continued to review the study, he said there was no explanation why authors said they had a 90 percent confidence in their evaluations of their calculations, a departure from the academic standard of 95 percent.\n“So, in every aspect of the preparation and release of the datasets leading into K15, we find Tom Karl’s thumb on the scale pushing for, and often insisting on, decisions that maximize warming and minimize documentation,” he wrote.\nA Capitol Hill source, familiar with the committee’s interaction with NOAA whistleblowers, told Breitbart News that Bates was not the only one inside the agency concerned about Karl and his study, known inside NOAA as K15. It is a point Bates talked about in his post:\nA NOAA NCEI supervisor remarked how it was eye-opening to watch Karl work the co-authors, mostly subtly but sometimes not, pushing choices to emphasize warming. Gradually, in the months after K15 came out, the evidence kept mounting that Tom Karl constantly had his ‘thumb on the scale’—in the documentation, scientific choices, and release of datasets—in an effort to discredit the notion of a global warming hiatus and rush to time the publication of the paper to influence national and international deliberations on climate policy.\nIn the previous session of Congress, Smith issued subpoenas to the Department of Commerce demanding work product and data used to write the K15 study, as well as department communication relating the production of the study. These subpoenas were ignored by Obama’s Commerce Department, which invoked a privilege for its scientists and their need to work outside of political influence.\nThe subpoenas expired with the last Congress, but a source close to the committee told Breitbart News that unlike other committees, such at the House Oversight and Government Reform Committee, the science committee chairman and staff are looking for ways to work with President Donald J. Trump’s new administration in a more cooperative spirit.\nSmith is looking to give Trump some space, given that the Commerce Secretary-designate Wilbur L. Ross Jr., has not been confirmed by the Senate and there is now a Trump-appointed NOAA administrator–and the committee itself is just now organizing for the new session.","url":"https://www.breitbart.com/politics/2017/02/07/retired-noaa-scientist-for-exposes-fake-science-behind-study-debunking-global-warming-pause/"}
