{"authors":["Associated Press"],"date_download":"2018-10-23 01:12:03","date_modify":"2018-10-23 01:12:03","date_publish":"2017-03-10 09:04:19","description":"WASHINGTON (AP) - Women seeking abortions and some basic health services, including prenatal care, contraception and cancer screenings, would face...","filename":"data/vaneerConsumption/HouseGOPhealthbillwouldcutwomensservices.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/17/wire-197133-1489165776-940_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300438_Womens-health-services-face-cuts-Republican-bill_1540257123.html","title":"House GOP health bill would cut women's services","title_page":"House GOP health bill would cut women's services | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Women seeking abortions and some basic health services, including prenatal care, contraception and cancer screenings, would face restrictions and struggle to pay for some of that medical care under the House Republicans' proposed bill.\nThe legislation, which would replace much of former President Barack Obama's health law, was approved by two House committees on Thursday. Republicans are hoping to move quickly to pass it, despite unified opposition from Democrats, criticism from some conservatives who don't think it goes far enough and several health groups who fear millions of Americans would lose coverage and benefits.\nThe bill would prohibit for a year any funding to Planned Parenthood, a major provider of women's health services, restrict abortion access in covered plans on the health exchange and scale back Medicaid services used by many low-income women, among other changes.\nFILE - In this Feb. 21, 2017, file photo, Sen. Patty Murray, D-Wash., speaks at a news conference at FareStart in Seattle. Women seeking abortions and some basic health services, including prenatal care, contraception and cancer screenings, would face restrictions and struggle to pay for some of that medical care under the House Republicans' proposed bill. Murray, the top Democrat on the Health, Labor, Education and Pensions Committee, says the legislation is a \"slap in the face\" to women. She said it would shift more decisions to insurance companies. (AP Photo/Elaine Thompson, File)\nWashington Sen. Patty Murray, the top Democrat on the Health, Labor, Education and Pensions Committee, said the legislation is a \"slap in the face\" to women. She said it would shift more decisions to insurance companies.\n\"You buy it thinking you will be covered, but there is no guarantee,\" Murray said.\nHouse Republican leaders said the bill, which is backed by President Donald Trump, will prevent higher premiums some have seen under the current law and give patients more control over their care.\n\"Lower costs, more choices not less, patients in control, universal access to care,\" House Speaker Paul Ryan, R-Wis., said Thursday.\nThe abortion restrictions and cuts to women's health care could draw opposition from some Republican women.\nSens. Lisa Murkowski of Alaska and Susan Collins of Maine have both said that a prohibition on Planned Parenthood funding shouldn't be part of the bill. Last month, before the legislation was released, Murkowski told the Alaska state legislature that she doesn't believe that taxpayer money should go toward abortions but added, \"I will not vote to deny Alaskans access to the health services that Planned Parenthood provides.\"\nSupport from Collins and Murkowski will be crucial once the bill moves to the Senate, since there are 52 Republicans and the GOP will need 50 votes to pass it.\nA look at how the bill would affect women's health care:\n___\nPLANNED PARENTHOOD\nRepublicans have tried for years to block federal payments to the group, but weren't able to do so with Democrat Barack Obama in the White House. Now that Republican Donald Trump is president, they are adding the one-year freeze in funding to their bill.\nMost GOP lawmakers have long opposed Planned Parenthood because many of its clinics provide abortions. Their antagonism intensified after anti-abortion activists released secretly recorded videos in 2015 showing Planned Parenthood officials discussing how they sometimes provide fetal tissue to researchers, which is legal if no profit is made.\nFederal dollars comprise nearly half of the group's annual billion-dollar budget. Government dollars don't pay for abortions, but the organization is reimbursed by Medicaid for other services, including birth control, cancer screenings and treatment of sexually transmitted diseases. The group has said the vast majority of women seek out those non-abortion services.\nRyan boasted this week that the bill is a \"conservative wish list,\" as it \"ends funding to Planned Parenthood and sends money to community centers.\" Democrats argue that many of the other clinics are already overloaded and would not be able to meet the increased demand for screenings and other services.\n___\nABORTION COVERAGE\nUnder Obama's health law, health plans on the exchange can cover elective abortions, but they must collect a separate premium to pay for them so it's clear that no federal funds are used. The GOP bill would go further, prohibiting the use of new federal tax credits to purchase any plan that covers abortions.\nThat could make it more difficult for women covered under the federal exchange to find a plan that covers abortions at all, because many companies may just drop the abortion coverage if it disqualifies the entire plan from the tax credits.\nMassachusetts Rep. Joe Kennedy, a Democrat, said during the Energy and Commerce Committee's debate on the bill Thursday that he is concerned those prohibitions will extend to hospitals that do abortions, as well.\n___\nMEDICAID AND 'ESSENTIAL HEALTH BENEFITS'\nThe bill would phase out the current law's expanded Medicaid coverage for more low-income people that 31 states accepted, which is almost completely financed by federal funds. That could affect women's health care services, including mammograms and prenatal care, for those who would lose that coverage. The legislation also repeals the requirement that state Medicaid plans must provide \"essential health benefits\" that are currently required, including pregnancy, maternity and newborn care for women.\nThe legislation will still require that private health plans fund the essential health benefits, but those insurers will have more leeway as to how much is covered.\nRep. John Shimkus, R-Ill., complained during the committee debate about the current law's requirements that certain services be covered.\n\"What about men having to purchase pre-natal care?\" Shimkus said in response to a question from a Democrat who asked him what mandates he was concerned about. \"Is that not correct? And should they?\"\n___\nAssociated Press writer Ricardo Alonso-Zaldivar contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4300438/Womens-health-services-face-cuts-Republican-bill.html"}
