{"authors":[],"date_download":"2018-10-30 17:58:11","date_modify":"2018-10-30 17:58:11","date_publish":"2016-01-14 17:59:00","description":"As he was laid to rest Thursday, longtime state legislator Mike Egan was being remembered at the Georgia Capitol as a pioneering Republican and a “leader of great courage and integrity.","filename":"data/vaneerConsumption/HouseremembersMikeEgan.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/14/Images/photos.medleyphoto.8580088.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_house-remembers-mike-egan__1540922291.html","title":"House remembers Mike Egan","title_page":"House remembers Mike Egan","title_rss":"NULL","source_domain":"ajc.com","text":"As he was laid to rest Thursday, longtime state legislator Mike Egan was being remembered at the Georgia Capitol as a pioneering Republican and a “leader of great courage and integrity.”\n“They called him the conscience of the Senate,” Speaker David Ralston, R-Blue Ridge said from the well of the House. “That quality guided his entire legislative career. He was an intelligent force with which to be reckoned.”\nEgan, a native of Savannah, died Jan. 7 at his home in Atlanta. He was 89.\nAn attorney, Egan was named Associate Attorney General under President Jimmy Carter in 1971. Prior to that appointment, he had served in the Georgia House since 1965, becoming minority leader in 1971. Egan’s first vote was to seat Julian Bond, an Atlanta Democrat and African-American who had angered the powers of the Capitol with his opposition to the Vietnam War.\nHe returned to the General Assembly in 1989, serving as a state senator until 2000.\nRalston said he had known Egan since the 1960s and considered him a friend and mentor “for many, many years.”\nIn his role as House minority leader, Egan “knew a little about tough fights and long odds,” the speaker said.\nRepublicans, who now dominate the 180-member House and 56-member Senate had a caucus of 22 in the House in those days, Ralston said.\nWhat Egan lacked in troop strength, he more than made up with in smarts, craftiness and morale courage, Ralston said.\n“It was a great thrill to service with him,” he said. “Mike was a leader of great courage and integrity.”","url":"https://www.ajc.com/news/house-remembers-mike-egan/zTscyXlsoJ37zCLSpr7RYK/"}
