{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:11:11","date_modify":"2018-10-30 20:11:11","date_publish":"2015-05-08 15:22:14","description":"The House of Representatives will vote on a bill next week that would ban abortions past the fifth month of pregnancy. The United States, China, North Korea and Canada are the only nations in the world that permit abortion for any reason after viability. |","filename":"data/vaneerConsumption/HouseToVoteon20WeekAbortionPainBillTimedWithGosnellMurderConvictionAnniversary.json","image_url":"https://media.breitbart.com/media/2015/03/abortion-clinic-planned-parenthood-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_08__1540930271.html","title":"House To Vote on 20-Week Abortion Pain Bill, Timed With Gosnell Murder Conviction Anniversary","title_page":"House To Vote on 20-Week Abortion Pain Bill, Timed With Gosnell Murder Conviction Anniversary | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The House of Representatives will vote on a bill next week that would ban abortions past the fifth month of pregnancy.\nThe timing of the vote on the Pain Capable Unborn Child Protection Act would coincide with the second anniversary of the murder conviction of late-term abortionist Kermit Gosnell, who was found guilty of killing three babies who survived abortion procedures and of negligence in the death of a patient.\n“Life is precious and we must do everything we can to fight for it and protect it,” House Majority Leader Rep. Kevin McCarthy (R-CA) tells the Weekly Standard. “Our commitment for the House to consider this important legislation has been steadfast and I am proud of the work of our members to prepare this bill for House consideration next week.”\nWhile the measure was introduced by Rep. Trent Franks (R-AZ) in early January, a vote on the bill has been a long time in coming. McCarthy’s office has had little to say about its delay since the measure was pulled from the House floor on the eve of the March for Life, in late January, when a group of Republicans led by Rep. Renee Ellmers (R-NC) objected to the language of the bill, arguing it needed to be altered with regard to a rape-reporting requirement that would have women report a rape to law enforcement prior to undergoing a late-term abortion.\nHouse Republicans now say that requirement has been removed from the bill. The measure will instead mandate abortion providers ensure that rape victims have received either medical treatment or licensed counseling at least 48 hours prior to the late-term abortion.\nAccording to one pro-life leader, the new language in the bill would require treatment or counseling to be provided by physicians or counselors from outside of the abortion industry.\n“We are happy to see that dedicated pro-life leaders in the House were able to work together to stop the Pain Capable bill from having significant loopholes for late-term abortions and put in place the necessary counseling and medical treatment that victims of rape and incest need,” Kristan Hawkins, president of Students for Life of America said in a statement to Breitbart News. “As soon as the House passes the bill next week, the Republican-led Senate must schedule an immediate vote. No more time can be wasted in trying to protect innocent life, especially for those who have been proven to feel pain and are viable outside the womb.”\nSimilarly, Father Frank Pavone, national director of Priests for Life, said, “I want to thank the Speaker and all the House leadership for their patient work in getting to the point where a vote can be held on this historic measure.”\nPavone emphasized that all unborn babies deserve protection from abortion.\nThe focus here is that children feel pain when they are ripped apart alive by abortion. Every abortion is wrong — even if it weren’t painful — and every baby deserves protection,” he said. “And precisely because of that, it is time to protect the babies we can protect now. The abortion debate is usually far too abstract to be effective. We need to talk about pain, and about what abortion does to the child.\nPavone said all citizens should contact their members of Congress and urge them to vote in favor of the Pain Capable bill.\nIn a statement to Breitbart News, Dr. Charmaine Yoest, president of Americans United for Life (AUL), emphasized the danger of late-term abortion for both babies and their mothers.\n“Limiting abortion at five months of pregnancy, as an unborn child becomes able to live outside the womb and as the procedure becomes even more dangerous for women, is a common sense law long overdue,” she said. “This type of legislation represents the mother-child strategy that AUL recommends because it deals directly with the ugly reality of abortion, which hurts both people exposed to an industry willing to harm people for profit.”\nAUL cites the following research:\nAfter two months of pregnancy, the chance of dying from an abortion increases 38 percent each week.\nAt five months of pregnancy, a woman is 35 times more likely to die from an abortion than she was in the first trimester.\nAfter 21 weeks, a woman is 91 times more likely to die from an abortion than she was in the first trimester.\nThe announcement of the scheduling of the vote on the measure comes on the heels of an article published Wednesday in the New York Times that revealed more very premature babies – even those born at 22 weeks – are surviving outside the womb with fewer health problems due to medical advances.\nFamily Research Council President Tony Perkins said in a statement the bill is essential to save “up to thirteen thousand babies a year from a gruesomely painful death from late term abortion.”\nHe continued:\nIt also is based on the idea that Congress has a compelling interest in protecting unborn babies from experiencing pain. Medical science today shows that at this time babies can experience excruciating pain. Congress should act to stop this cruel practice. There are greater protections for babies born alive and a required 48-hour waiting period for excepted abortions. The bill also upholds the sexual assault reporting requirements of the states.\nMarjorie Dannenfelser, president of Susan B. Anthony List, noted the importance of scheduling the vote at the time of the second anniversary of Gosnell’s murder conviction.\n“Two years ago, the barbarism of late-term abortion was brought into the national spotlight by the trial of late-term abortionist Dr. Kermit Gosnell,” she observed. “America’s eyes were opened to the horrific reality of late-term abortion, a stain on our national conscience.”\n“This legislation will be the defining abortion issue of the 2016 elections and put pro-life candidates on offense,” Dannenfelser continued. “Already, the entire Republican presidential field has rallied behind this popular legislation while Hillary Clinton remains elusive on her late-term abortion position.”\nTo date, 14 declared and potential GOP presidential candidates are on record in support of the bill.\nThe United States, China, North Korea and Canada are the only nations in the world that permit abortion for any reason after viability.","url":"https://www.breitbart.com/politics/2015/05/08/house-to-vote-on-20-week-abortion-pain-bill-timed-with-gosnell-murder-conviction-anniversary/"}
