{"authors":["Cathy Frye"],"date_download":"2018-10-30 19:55:10","date_modify":"2018-10-30 19:55:10","date_publish":"2014-10-31 03:02:00","description":"A Little Rock judge issued an arrest warrant Thursday for Rodney Forte, executive director of the Metropolitan Housing Alliance, over accusations he has failed to produce documents requested by the Arkansas Democrat-Gazette for the past three months.","filename":"data/vaneerConsumption/Housingchiefhitwithwritofarrest.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_oct_31__1540929310.html","title":"Housing chief hit with writ of arrest","title_page":"Housing chief hit with writ of arrest","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A Little Rock judge issued an arrest warrant Thursday for Rodney Forte, executive director of the Metropolitan Housing Alliance, over accusations he has failed to produce documents requested by the Arkansas Democrat-Gazette for the past three months.\nHe faces a Class C misdemeanor charge of failing to comply with the Freedom of Information Act by \"unlawfully, negligently failing to provide copies of or make available for inspection requested public documents,\" according to an arrest affidavit issued by the Pulaski County prosecuting attorney's office.\nDistrict Judge Alice Lightle signed off on the warrant late Thursday afternoon. An Arkansas Democrat-Gazette photographer sent to the housing office saw two Little Rock police officers enter the agency. One stepped back out and got his citation book. The officers were there for at least 20 minutes.\nForte wasn't taken into custody but will have to appear in court on a specified date, said Deputy Prosecuting Attorney Leigh Patterson. At that time, Forte will enter a plea.\n\"There's no reason to believe that Mr. Forte would not do anything but the responsible thing ... which is to appear in court,\" said Prosecuting Attorney Larry Jegley.\nThe warrant stems from a criminal complaint filed last week by the Democrat-Gazette.\nStaff writer Chelsea Boozer and City Editor Danny Shameer went to District Court on Thursday and signed the arrest affidavit, in which they had detailed numerous attempts to obtain documents and other public information from the housing agency.\nBoozer made her first Freedom on Information Act request on Aug. 13. Her efforts were documented in emails exchanged among her, Forte and Marshall Nash, the housing agency's director of administrative services whom Forte had designated to handle records requests. The agency has complied with some of the requests but has not fully responded to others.\nIn recent weeks, Shameer met with Forte to see whether he could persuade the executive director to produce the documents and information requested by Boozer.\nAt that time, Forte told Shameer to request the information yet again, even though by this time Boozer had done so nine times -- to no avail. Shameer also had already twice asked that the agency turn over the documents.\nOn Tuesday, Nash sent an invoice to the Democrat-Gazette charging more than $16,000 to hire outside workers to help the agency comply with the records-release request -- a practice the Little Rock city attorney and other Arkansas Freedom of Information Act experts said is illegal.\nForte answered his personal cellphone Thursday evening, but said only \"Hello? Hello? Hello?\" before hanging up. He did not answer subsequent calls to that phone or his office cellphone.\nNash, also reached Thursday evening, said he didn't know whether Forte had been served with the arrest warrant.\nHe declined to comment, saying, \"I have to have permission to do interviews. And I do not have that permission. I apologize, but this is how it goes.\"\nThe invoice sent to the newspaper Tuesday wasn't itemized and offered scant explanation for the cost of producing public records.\nIt stated only:\nAdditional Manpower: $16,231.00\nAdditional Supplies: $147\nTotal: $16,378.00\nLittle Rock Mayor Mark Stodola contacted Forte on Wednesday in an attempt to intervene in the latest dispute over records. Stodola is a former Little Rock city attorney and Pulaski County prosecutor.\n\"I am not familiar with any request for payment for such a large nature as this, and based on my interpretation of the Freedom of Information Act, the computer systems that the agency has are required to make this information readily available,\" Stodola told the newspaper Wednesday.\n\"These kinds of document requests are routine, and when I was prosecutor, virtually all of this kind of information [at most agencies] is kept in an electronic format that can be downloaded quite easily.\"\nStodola told the newspaper that Forte told him that the housing agency's work orders are kept in a proprietary software and that each document would have to be printed off, then scanned in order to email them. Forte estimated that the records amounted to between 5,000 and 10,000 documents, the mayor said.\nArkansas Code Annotated 25-19-105 (g) states that any software acquired by an agency \"shall be in full compliance with the requirements\" of the Freedom of Information Act and \"shall not impede public access to records in electronic form.\"\nBoozer started asking for records after learning that the agency had hired a deputy executive director this year at a $92,000 salary.\nThe new hire came at a time when several lower-level positions -- including maintenance ones -- remained vacant and all workers were under furloughs that amount to a 10 percent reduction in pay. The furloughs continue.\nForte's salary would be $132,955 if not for the furloughs. With those in place, his salary is $119,696.\nJegley told the newspaper Wednesday that in his 23 years with the prosecutor's office, he has never before authorized an arrest affidavit for a Freedom of Information Act violation, which rates as a Class C misdemeanor.\n\"Usually, we can work things out for people to get the documents they're entitled to -- that's ultimately what it's all about,\" Jegley said, calling this instance with the housing agency \"over the top,\" \"outrageous\" and \"absolutely indicative of bad faith on the part of the agency and the responsible individuals.\"\nState Desk on 10/31/2014","url":"https://www.arkansasonline.com/news/2014/oct/31/housing-chief-hit-with-writ-of-arrest-2/"}
