{"authors":["Breitbart Tv"],"date_download":"2018-10-30 19:41:30","date_modify":"2018-10-30 19:41:30","date_publish":"2014-06-01 16:02:27","description":"On Sunday’s “State of the Union” on CNN, House Intelligence Committee chairman Rep. Mike Rogers (R-MI) explained to moderator Candy |","filename":"data/vaneerConsumption/HouseIntelChairMikeRogersObamaViolatedtheLawwithBergdahlDeal.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-TV/2014/06/01/Rogers61a.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2014_06_01__1540928490.html","title":"House Intel Chair Mike Rogers: Obama 'Violated the Law' with Bergdahl Deal","title_page":"House Intel Chair Mike Rogers: Obama 'Violated the Law' with Bergdahl Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Sunday’s “State of the Union” on CNN, House Intelligence Committee chairman Rep. Mike Rogers (R-MI) explained to moderator Candy Crowley why the Obama administration’s deal to secure American prisoner of war Bowe Bergdahl’s release for five Guantanamo detainees was a bad deal and broke law.\nAccording to Rogers, this sends the wrong message to terrorists around the world.\n“[W]e have other means to use, and remember, they came to Congress about a year ago and we’re thinking about doing these negotiations. And by the way, they didn’t get a very warm reception from either party in the national security committees. They said this is fraught with trouble. So this all of a sudden comes a year later. They didn’t notify Congress. I think they violated the law in two different places here. Why is because this is a — this is morphing into different places. So, an al Qaeda affiliate in now Africa looks a lot and functions a lot like the al Qaeda affiliates operating out of the tribal areas in Pakistan. If you negotiate here, you’ve sent a message to every al Qaeda group in the world that says, and by the way some holding U.S. hostages today, that there is some value now in that hostage in a way they didn’t have before. That is dangerous. And so, our argument is, listen, we don’t fight this like we would fight a nation-state war. You can’t, and you shouldn’t negotiate with terrorists.”\nFollow Jeff on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2014/06/01/house-intel-chair-mike-rogers-obama-violated-the-law-with-bergdahl-deal/"}
