{"authors":[],"date_download":"2018-10-22 21:38:23","date_modify":"2018-10-22 21:38:23","date_publish":"2014-05-07 20:13:57","description":null,"filename":"data/vaneerConsumption/HouseVotestoHoldExIRSOfficialinContempt.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427221/140507-lerner_contempt_5_7-1549_69ed0040165af258cc6576cec2132adb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_house-votes-hold-ex-irs-official-contempt-n99691_1540244303.html","title":"House Votes to Hold Ex-IRS Official in Contempt","title_page":"House Votes to Hold Ex-IRS Official in Contempt ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Republicans voted Wednesday to hold former IRS official Lois Lerner in contempt of Congress for refusing to testify about the agency’s improper targeting of conservative groups applying for tax-exempt status.\nIn a partisan 231-187 vote, the House passed the contempt resolution, sending the matter to the U.S. Attorney for the District of Columbia. Six Democrats voted for the measure.\nIt is unclear how the Justice Department will proceed. It did not move forward on the last contempt of Congress resolution passed in the House, which was issued for Attorney General Eric Holder in 2012.\nLerner invoked her Fifth Amendment at two hearings of the House Oversight and Government Reform Committee about IRS targeting of conservative groups. Her refusal to testify in March led to a tense exchange between Committee Chair Darrell Issa, R-Calif., and Rep. Elijah Cummings, D-Md., after Issa gaveled the meeting closed without allowing Democrats to participate.\nRepublicans argue Lerner waived her Fifth Amendment right by proclaiming her innocence before refusing to testify, while Democrats have called the contempt charge a partisan vote meant to keep the story alive in an election year.\n\"Today’s vote has nothing to do with the facts or the law,\" Lerner's attorney, William Taylor III said in a statement. \"Its only purpose is to keep the baseless IRS 'conspiracy' alive through the mid-term elections.\"\nThe House also passed a separate resolution calling on Holder to appoint a special counsel to investigate how the IRS treated nonprofit groups.","url":"https://www.nbcnews.com/politics/congress/house-votes-hold-ex-irs-official-contempt-n99691"}
