{"authors":[],"date_download":"2018-10-22 22:03:01","date_modify":"2018-10-22 22:03:01","date_publish":"2014-05-08 22:30:45","description":"House Republicans on Thursday overwhelmingly supported a resolution to establish a new committee to investigate the deadly attack in Benghazi.","filename":"data/vaneerConsumption/HouseGOPVoteForNewBenghaziInvestigation.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_43/413806/140501-benghazi-mn-1320_abdb7f29874be61cfea38264b12c4e72.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_house-gop-vote-new-benghazi-investigation-n100836_1540245781.html","title":"House GOP Vote For New Benghazi Investigation","title_page":"House GOP Vote For New Benghazi Investigation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Republicans on Thursday overwhelmingly approved a resolution to establish a new committee to investigate the deadly attack in Benghazi, a move panned by Democrats as an election-year distraction aimed to motivate the GOP ahead of November's midterm contests.\nThe resolution, which passed the House by a 232-186 vote, establishes a 12-member select committee made up of seven Republicans and five Democrats to investigate the Sept. 11, 2012 attack that resulted in the deaths of four Americans. Just seven Democrats voted for the measure.\nHouse Speaker John Boehner promised an \"eminently fair\" probe into the assault and its aftermath. He said the committee is necessary following newly released White House talking points that Republicans contend show the Obama administration willfully misled the public after the attack.\n“In my view, these discoveries compel the House to respond as one institution and establish one select committee, a committee with robust authority,\" Boehner said on the House floor Thursday, \"A committee that will do its work while the House continues to focus on the people's priorities.”\nDemocrats however are considering boycotting the committee, angered they are outnumbered on the panel and that only Republican chair Rep. Trey Gowdy has subpoena authority.\n“I think this has degenerated to a select committee on talking points, and a really partisan exercise,” Rep Adam Schiff, D-Calif., a member of the House Intelligence Committee, told NBC News, “I don’t see what new ground it will cover, and it’s hard to conclude it’s anything more than an effort to excite and raise money from their base.”\nDemocrats have also criticized the National Republican Congressional Committee for including the Benghazi attacks in fundraising appeals.\n“Fundraising off the Benghazi tragedy is despicable and insulting and has no place in the national conversation,” Rep. Steve Israel, chair of the Democratic Congressional Campaign Committee, said in a statement.","url":"https://www.nbcnews.com/politics/congress/house-gop-vote-new-benghazi-investigation-n100836"}
