{"authors":["James Gordon For Dailymail.Com"],"date_download":"2018-10-23 05:36:46","date_modify":"2018-10-23 05:36:46","date_publish":"2017-04-26 17:04:50","description":"A Texas family added a little furry, four-legged friend to their family over the weekend after they rescued a kitten that was found stuck in the wall of their west Houston apartment.","filename":"data/vaneerConsumption/Houstonfamilycutthroughwalltodiscovertrappedkitten.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA087BB00000578-0-image-a-5_1493221223464.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448080_Houston-family-cut-wall-discover-trapped-kitten_1540273006.html","title":"Houston family cut through wall to discover trapped kitten","title_page":"Houston family cut through wall to discover trapped kitten | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Houston family has discovered a tiny kitten trapped behind the wall in their apartment.\nThe Guerrero/Griffin family only knew something was up when their dog, Little Momma, inexplicably began barking at the wall at the weekend.\nThe entire episode seemed completely out of character for her, especially when the dog became increasingly restless.\nA family found a tiny kitten hiding behind their wall. Alfred Griffin, left, and Alexis Guerrero were first alerted when their dog began barking at the wall\nAlfred got down on his hands and knees to drill a hole in the wall to see what was behind it\nThe hole led to a very tiny space which was a maze of nails and wood\n'She would not stop growling so I said, \"What? Show mommy.\" Alexis Guerrero said to ABC 13. 'But she wasn't looking at the front door, she was looking this way!' she added, pointing to the wall.\nHer husband Alfred Griffin said: 'The dog followed me in and went straight to the wall and was like, \"mmm get it out.\"'\nThe family put their ears to the wall and thought they could indeed hear the sound of a cat and several kittens.\nAt first the family thought the cats were simply hiding in a safe space but then the cries began to sound more desperate and so the family decided to cut a hole in the wall.\nAlfred said the kitten is fitting in well with the family including Little Momma their dog\nIt's believed the kitten was abandoned by her mother and was left to fend for herself\nThe family captured the rescue on camera to show how the tiny gray kitten was saved. Their grandson named her 'Angel', he says because angels never die\nAlexis said: 'Babe, there's a cat stuck in the wall.'\nThe cats were lodged in a particularly hard-to-reach location and stuck between planks of wood and nails that were sticking out of the wall.\nThe entire rescue of the tiny grey kitten from behind the plaster was caught on camera.\nTheir grandson named her 'Angel', he says because angels never die.\nBest of all, the cute kitten gets on really well with Little Momma who now has a brand new furry friend.\n'I wasn't a cat person before,' said Alfred, 'but I guess I'll have to adjust. And we will, right, Angel?'","url":"https://www.dailymail.co.uk/news/article-4448080/Houston-family-cut-wall-discover-trapped-kitten.html"}
