{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:04:21","date_modify":"2018-10-31 00:04:21","date_publish":"2016-12-04 00:00:00","description":"'We're getting inundated with demand,' founder Robinson told BI. 'We're having to hire three new valuers because we're getting so much business.'","filename":"data/vaneerConsumption/HousesalesstartupNestedoffered10millionofpropertyaweek.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_nested-house-sales-offers-property-per-week-2016-12_1540944261.html","title":"House sales startup Nested offered £10 million of property a week","title_page":"    House sales startup Nested offered £10 million of property a week - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Nested founders. Nested LONDON — Nested, a UK startup that helps people sell their house by guaranteeing them a minimum price in cash, is being offered £10 million ($12.6 million) of property a week just months after launch, according to its CEO.\nMatt Robinson, the founder and CEO of Nested, told Business Insider the numbers were \"insane.\" Nested launched to the public just 10 weeks ago and has already given out thousands of valuations.\nRobinson cofounded direct debit startup GoCardless in 2011 before setting up Nested and he said the growth trajectory of his last company was nothing like Nested.\n\"We're getting inundated with demand,\" Robinson told BI. \"We're having to hire three new valuers because we're getting so much business.\"\nThis week OpenDoor, a US business similar to Nested, raised money at a $1 billion valuation. OpenDoor \"flips\" houses, buying them for cash, doing minor work to them, then selling for more. Nested's model is slightly different but also turns house sellers into cash buyers.\nNested lets people get an immediate cash offer on the value of their house, just a fraction off the full valuation. If you like the offer, Nested will then take over the process of selling your house for you and if that is not done within 90 days it will lend you the cash it guaranteed at the beginning, interest-free, to let you buy a new house.\n\"We're letting you buy before you sell,\" Robinson told BI.\nNested does not actually take ownership of the house and when the house does sell, if it goes for more than the valuation Nested gave you, you get 80% of any upside and Nested takes 20%. (It also charges a minimum 1.8% fee.)\nAn example: Your house is worth £100,000, Nested offer you £95,000 guaranteed. You take it and go house-hunting. Your house eventually sells for £120,000 — that's £20,000 above Nested's valuation. Nested takes 20% of the £20,000, while you keep the rest — £16,000. You end up with £95,000 in cash after 90 days and a nice £16,000 windfall when it eventually shifts. (All these figures are just to illustrate the point of course.)\nThe £10 million figure is calculated from the amount of \"qualified offers\" Nested is making. This is where Nested offers a guaranteed cash minimum for a property.\nWhile Nested is quoting a lot of offers, Robinson says it is being highly selective in the number of actual deals it does.\n\"We only have a limited amount of capital to play with and we want to make sure we nail the first few deals,\" Robinson told BI.\nNested has so far only taken on 3 deals and has already completed its first sale of a property in Streatham, South London.\nNested guaranteed a minimum of £430,000 for the 2-bed flat, which sold for £462,000 in just a few days. Robinson says the seller was a growing family who had found a property they loved in Hainault, in east London, and wanted the cash to make sure they could secure the house.\nRobinson says: \"All of the deals are home owners who have found their dream home and need to make sure they can get it.\"","url":"https://www.businessinsider.com/nested-house-sales-offers-property-per-week-2016-12"}
