{"authors":["John Canally","Lpl Financial"],"date_download":"2018-10-31 00:05:48","date_modify":"2018-10-31 00:05:48","date_publish":"2014-09-30 00:00:00","description":"Housing will likely continue to add to GDP growth in 2015 and beyond.","filename":"data/vaneerConsumption/HousingRecoveryWontBeOverForYears.json","image_url":"https://amp.businessinsider.com/images/530f644eeab8eaa9772a450d-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_housing-recovery-wont-be-over-for-years-2014-9_1540944348.html","title":"Housing Recovery Won't Be Over For Years","title_page":"    Housing Recovery Won't Be Over For Years - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The inventory of new and existing homes for sale as a percentage of total homes has never been lower. Justin Sullivan/Getty Images The most recent figures on gross domestic product (GDP) — the broadest measure of economic activity — revealed that residential investment (a.k.a. housing) grew at an 8.8% annualized pace between the first and second quarters of 2014. As a result, housing contributed 0.3 percentage points to the overall 4.6% gain in GDP in Q2.\nIt was the first time since Q3 2013 that housing added to GDP growth; but it marked the 12th quarter of the last 15, dating back to late 2010, that housing has made a positive contribution to GDP. Prior to that, between late 2005 and late 2010, housing had been a drag on the overall economy in 17 of the 20 quarters (or five years), as the economy endured the housing-induced Great Recession and its aftermath [Figure 1].\nLPL Financial\nUntil housing's solid performance in Q2 2014, there was concern among market participants about the sharp rise in interest rates in 2013 limiting housing activity. This concern, along with the notion that pent-up demand in housing had run its course, and that many buyers were being squeezed out of the market by cash sales, led to broader concerns that the housing recovery had stalled. We continue to expect (per our long-held view) housing may add to GDP growth in 2014 and for the next several years as the market normalizes following the severe housing bust of 2005-2010.\nHeading for Home\nSeveral factors will likely determine the pace at which housing adds to GDP growth in the coming years. Among them are:\nHousing affordability. Housing affordability, the ability of a household with the median income to afford the payments on a median-priced house at prevailing mortgage rates, hit an all-time high in early 2013, before the big run-up in mortgage rates that began in mid-May 2013 as a result of what is now known as the \"taper tantrum.\" Since then, a combination of rising home prices, sluggish income growth, and higher mortgage rates have driven affordability some 30% lower. (Although interest rates are lower this year, they have not returned to 2013 lows that preceded the taper tantrum.)\nDespite the drop, affordability is well above its long-term average [Figure 2] and also well above the levels during the mid-2000s housing boom. The three components of affordability — incomes, home prices, and rates — are all likely to continue to move higher, likely driving affordability back toward its long-term average, but not much below.\nLPL Financial\nHousing supply. At just over 200,000 units for sale, the number of new single-family homes for sale at the end of August 2014 was well below the peak of nearly 600,000 units for sale in 2006, but above recent lows (150,000 units). Similarly, the number of existing single-family homes for sale (2.05 million in August 2014) is also off its peak, but still 500,000 units above recent lows. Combined, the level of new and existing homes for sale remains well below average [Figure 3], relative to the number of households in the economy — and the low level of inventory is likely to be a big factor in driving housing construction in the coming years.\nLPL Financial\nSupply of home mortgages. From the mid-1990s through late 2006, bank lending standards (required down payments, credit scores, work history, etc.) for residential mortgages were relatively easy. Coupled with low rates and rapid innovation in financial products backing residential mortgages, this easy credit helped to fuel the housing boom.\nThe banking industry began tightening lending standards in early 2007 and continued to tighten standards for more than two years. Lending standards eased in 2009 and 2010, but remained more restrictive than they were in the peak boom years from 2004 to 2006. The latest survey (August 2014) revealed that bank lending standards for home mortgages are the easiest since mid-2006 [Figure 4]. The improvement in this indicator in recent quarters is a good sign and should help to offset the recent rise in the rates banks are charging for mortgages.\nLPL Financial\nDemand for home mortgages. On the demand side of the equation, consumer demand for mortgages remained muted during the first two-and-a-half years (early 2009 through late 2011) of the housing recovery, as consumers remained uncertain about prospects for home price appreciation and their own financial and employment status. The taper tantrum in the spring and summer quarters of 2013 saw consumer demand for home mortgages dip to the levels seen in 2007 and 2008.\nSince then, an improved labor market, Federal Reserve (Fed) actions to help lower mortgage rates, and rising home prices have driven consumer demand for mortgages to levels last seen on a sustained basis in the early 2000s [Figure 5]. The Fed compiles these data in the Senior Loan Officer Opinion Survey on Bank Lending Practices, which is released quarterly. Still, historically low mortgage rates — thanks to a sluggish economy and an aggressive Fed — are making home ownership an attractive alternative to renting. The housing recovery is dependent upon low interest rates, but not necessarily the lowest interest rates. History shows us that if job and income growth can rise along with mortgage rates, the growth in housing can continue.\nLPL Financial\nConclusion\nWe continue to expect that housing may add to economic growth in the years ahead. Although interest rates are likely to move higher in the coming years, the trends that have helped the housing market out of the housing bust will likely remain in place. Still, like other segments of the economy that have struggled to recover from the Great Recession, the housing recovery remains choppy and uneven.","url":"https://www.businessinsider.com/housing-recovery-wont-be-over-for-years-2014-9"}
