{"authors":[],"date_download":"2018-10-22 22:12:52","date_modify":"2018-10-22 22:12:52","date_publish":"2014-05-09 13:09:36","description":"Netflix is raising internet video subscriber rates by $1 per month for new customers to help pay for more original programming like \"House of Cards.\"","filename":"data/vaneerConsumption/HouseofCardsEffectNetflixRaisingVideoSubscriptionRates.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/431586/140509-140509-hoc-0912_cf59e955fb8377d82d5e15c591e304e5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_house-cards-effect-netflix-raising-video-subscription-rates-n101291_1540246372.html","title":"House of Cards Effect: Netflix Raising Video Subscription Rates","title_page":"House of Cards Effect: Netflix Raising Video Subscription Rates","title_rss":"NULL","source_domain":"nbcnews.com","text":"The price increase, Netflix's first in nearly three years, is no surprise. The company disclosed plans to raise its rates last month without specifying the precise amount. Netflix says it needs more money so it can afford to pay for more original programming along the lines of its Emmy award-winning political drama \"House of Cards\" and \"Orange is the New Black.\"\nBy delaying the price increase for current subscribers, Netflix hopes to avoid the backlash in 2011 when it raised its prices by as much as 60 percent. The company lost about 800,000 customers within a few months in an exodus that alarmed investors, causing Netflix's stock to plunge by more than 80 percent in a year.\nNetflix eventually lured back subscribers and revived its customer growth, lifting its stock to record highs this year. Subscription prices also will be increasing by the equivalent of about $1 month in Netflix's markets outside the U.S. The company ended March with nearly 13 million international customers in more than 40 countries.\n- The Associated Press","url":"https://www.nbcnews.com/business/consumer/house-cards-effect-netflix-raising-video-subscription-rates-n101291"}
