{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:34:31","date_modify":"2018-10-30 20:34:31","date_publish":"2016-12-30 00:00:00","description":"'House of Fraser is committed to a transformation of its business over the next 5 years and this new partnership is just one illustration of how we’ll deliver.'","filename":"data/vaneerConsumption/HouseofFrasertoinvestandpartnerwithapponlychallengerbankTandem.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_house-of-fraser-invest-partner-app-only-challenger-bank-tandem-2016-12_1540931671.html","title":"House of Fraser to invest and partner with app-only challenger bank Tandem","title_page":"    House of Fraser to invest and partner with app-only challenger bank Tandem - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Ricky Knox, Tandem. Tandem LONDON — Department store House of Fraser is planning to invest £35 million into app-only challenger bank Tandem.\nThe investment will be part of a tie-up between the startup and House of Fraser, according to a release from Tandem. The department store wants to offer financial services to customers through its partnership with Tandem, founded in 2014.\n\"House of Fraser is committed to a transformation of its business over the next five years and this new partnership is just one illustration of how we'll deliver a meaningfully different set of services to our customers,\" House of Fraser chairman Frank Slevin says in an emailed statement.\nThe investment is subject to some unspecified conditions and is a minimum commitment, according to the emailed statement.\nTandem has raised over $30 million from investors including eBay founder Pierre Omidyar. Earlier this year the bank raised £1 million in a crowdfunding campaign that valued it at £65 million.\nRicky Knox, founder and deputy CEO of Tandem, says in an emailed statement: \"House of Fraser is one of the great loved retail giants, with a customer-centric heritage that aligns closely with Tandem's mission and values. We're excited about the opportunity to help their loyal customers with their financial lives.\"\nTandem, which gained its banking licence last year, is an app-only bank that currently offers a savings tool that lets people monitor spending on any bank account. It began rolling out its app last month and plans to launch credit and debit products next year.\nTandem is one of a number of app-only startup banks, dubbed \"neobanks\", vying for market share in Britain at the moment. Rivals include Monzo, Starling, and Atom.","url":"https://www.businessinsider.com/house-of-fraser-invest-partner-app-only-challenger-bank-tandem-2016-12"}
