{"authors":[],"date_download":"2018-10-22 20:34:19","date_modify":"2018-10-22 20:34:19","date_publish":"2014-05-02 15:36:19","description":"The committee will be led by GOP Rep. Trey Gowdy of South Carolina.","filename":"data/vaneerConsumption/HouseGOPtoFormSpecialSelectCommitteeonBenghazi.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/416336/2012-12-19t160142z_1595684297_tm3e8cj0u8101_rtrmadp_3_usa-benghazi-clinton_1d1977c81a85f3d32801b677f872aad5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_house-gop-form-special-select-committee-benghazi-n95696_1540240459.html","title":"House GOP to Form Special Select Committee on Benghazi","title_page":"House GOP to Form Special Select Committee on Benghazi","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Republicans announced on Friday their intention to form a special select committee on Benghazi, intensifying already highly-charged GOP scrutiny of the Obama administration’s handling of the September 2012 attacks that left four Americans dead.\nThe committee will be led by GOP Rep. Trey Gowdy of South Carolina.\n\"It's clear that questions remain, and the administration still does not respect the authority of Congress to provide proper oversight,\" House Speaker John Boehner said in a statement. \"This dismissiveness and evasion requires us to elevate the investigation to a new level. I intend for this select committee to have robust authority, and I will expect it to work quickly to get answers for the American people and the families of the victims.\"\nPast select committees have included members of both parties. A spokesman for House Minority Leader Nancy Pelosi said that Democrats \"have not been contacted by Speaker Boehner or the Republican leadership concerning a select committee proposal.”\nIn a statement, Senate Majority Leader Harry Reid derided the committee as an attempt to \"rekindle debunked right-wing conspiracy theories.\"\n\"There have already been multiple investigations into this issue and an independent Accountability Review Board is mandated under current law,\" he said. \"For Republicans to waste the American people’s time and money staging a partisan political circus instead of focusing on the middle class is simply a bad decision.\"\nThe announcement comes after newly released documents reignited the controversy over how the White House and the State Department crafted their response to the attack. Republicans allege that the White House knowingly misled the public about the origin of the assault in order to bolster claims that terrorist groups had been weakened during Obama’s first term; Democrats say that the GOP has fueled the controversy for political purposes alone.\nEarlier Friday, House Oversight and Government Reform Committee Chairman Darrell Issa announced the subpoena of Secretary of State John Kerry over documents related to the attack.\nNBC's Carrie Dann and Frank Thorp contributed to this report.","url":"https://www.nbcnews.com/politics/congress/house-gop-form-special-select-committee-benghazi-n95696"}
