{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:41:29","date_modify":"2018-10-30 21:41:29","date_publish":"2015-07-09 00:32:22","description":"Many in the GOP reportedly refrained from voting until the last minute and some changed their votes under pressure from Republican leadership. Only one conservative amendment, introduced by Rep. Matt Salmon (R-AZ) was adopted, by a vote of 251-178, that would allow parents to opt their children out of standardized testing. |","filename":"data/vaneerConsumption/HouseVotesToReauthorizeNoChildLeftBehind.json","image_url":"https://media.breitbart.com/media/2015/05/common-core-protest-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_08__1540935689.html","title":"House Votes To Reauthorize No Child Left Behind","title_page":"House Votes To Reauthorize No Child Left Behind | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The House barely approved the reauthorization of the controversial No Child Left Behind law Wednesday, 218-213, with 27 Republicans joining all Democrats in opposition to the measure.\nThe Hill reports that many in the GOP refrained from voting until the last minute and some changed their votes under pressure from Republican leadership.\nOnly one conservative amendment, introduced by Rep. Matt Salmon (R-AZ) was adopted, by a vote of 251-178, that would allow parents to opt their children out of standardized testing.\n“Parents are becoming increasingly fed up with such constant and onerous testing requirements, as well as the teachers,” Salmon said on the floor of the House during debate.\nAnother proposal, introduced by Reps. Mark Walker (R-NC) and Ron DeSantis (R-FL), would have allowed states to opt out of No Child Left Behind and still receive federal funding. That amendment, however, failed 195-235, with 49 Republicans joining Democrats to defeat it.\nThat particular vote was especially crucial to grassroots groups of parents – the conservative base of the GOP – who want to see a much more limited role for the federal government in education.\n“The underlying bill is not worth passing unless this amendment is adopted,” said Heritage Action CEO Michael Needham.\nThe measure, dubbed the Student Success Act, was pulled from the House floor by GOP leadership in late February after it was determined the measure lacked sufficient support. Grassroots parents’ groups – many that have been fighting against the Common Core standards in their states – voiced their concerns that the reauthorization still required excessive federal intrusion into the right of states to set their own education policies.\nThe Senate is debating its version of the reauthorization of the law, which is the current iteration of the Elementary and Secondary Education Act (ESEA), signed into law by President Lyndon Johnson.\nAccording to the Associated Press, the Senate has rejected a plan that would turn federal aid for low-income students over to the states and then allow parents to choose whether they wanted their children to attend public or private schools. That proposal was defeated 45-52, with Sen. Patty Murray (D-WA) saying such a change would “retreat on our fundamental commitment to make sure that every child has access to a quality education.”\nSen. Lamar Alexander (R-TN), who chairs the Senate committee that oversees education, said that the House and Senate bills aren’t that different, and that his goal is to get legislation to President Barack Obama for his signature.\n“We’re not here to make a political speech. We’re here to get a result and fix NCLB,” he said.","url":"https://www.breitbart.com/politics/2015/07/08/house-votes-to-reauthorize-no-child-left-behind/"}
