{"authors":["Press Association"],"date_download":"2018-10-22 23:36:01","date_modify":"2018-10-22 23:36:01","date_publish":"2017-04-26 08:09:09","description":"Westbrook´s 47 points weren´t enough to see off the Rockets as Houston secure their place in the last eight.","filename":"data/vaneerConsumption/HoustonRocketsovercomeRussellWestbrooktosendOklahomaCityThunderhome.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463789-1493190578-168_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446574_Houston-Rockets-overcome-Russell-Westbrook-send-Oklahoma-City-Thunder-home_1540251361.html","title":"Houston Rockets overcome Russell Westbrook to send Oklahoma City Thunder home","title_page":"Houston Rockets overcome Russell Westbrook to send Oklahoma City Thunder home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Houston Rockets withstood a brilliant individual performance from Oklahoma City Thunder star Russell Westbrook to become the third team to qualify for the conference semi-finals in the NBA play-offs.\nWestbrook poured in 47 points, grabbed 11 rebounds and handed out nine assists but it was not enough to prevent Houston seeing off the Thunder 105-99 at Toyota Centre.\nTo emphasise Westbrook’s dominance for the visitors, the next-best scoring Thunder players were Alex Abrines and Jerami Grant with just 11 points apiece.\nHouston Rockets' Patrick Beverley and Oklahoma City Thunder's Russell Westbrook\nRuss: \"I consider it a good season. Everybody did an amazing job. I can be nothing but proud of them. Our team rallied around each other.\" pic.twitter.com/65OkXNwYQ4 — OKC THUNDER (@okcthunder) April 26, 2017\nThe victory earned Houston a 4-1 series win and a place in the last eight, where they join already-qualified Golden State and Cleveland.\nHouston, for whom James Harden contributed 34 points, await the winners of the San Antonio Spurs-Memphis Grizzlies clash.\nThe Spurs now lead that series 3-2 after winning game five 116-103 at AT&T Center.\nKawhi Leonard led with 28 points for San Antonio but he received good support with five of his team-mates scoring in double figures.\nIn the night’s other game, the Utah Jazz edged out the Los Angeles Clippers 96-92 at Staples Center to take a 3-2 lead in their series.\nGordon Hayward paced the Jazz with 27 points while team-mate Rudy Gobert’s double-double of 11 points and 11 rebounds also helped keep their opponents at bay.\nChris Paul (28 points) and JJ Redick (26 points) provided the bulk of the Clippers’ points but the hosts – who overcame a 11-point deficit early in the fourth quarter to level the scores at 69-69 – just ran out of steam in the end.","url":"https://www.dailymail.co.uk/wires/pa/article-4446574/Houston-Rockets-overcome-Russell-Westbrook-send-Oklahoma-City-Thunder-home.html"}
