{"authors":["Caroline May"],"date_download":"2018-10-30 22:16:12","date_modify":"2018-10-30 22:16:12","date_publish":"2015-07-16 19:46:59","description":"House Judiciary Committee’s Immigration and Border Security Subcommittee will hold a hearing “Sanctuary Cities: A Threat to Public Safety.”","filename":"data/vaneerConsumption/HouseHearingToExamineSanctuaryCityThreat.json","image_url":"https://media.breitbart.com/media/2015/07/Francisco-Sanchez-court-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_16__1540937772.html","title":"House Hearing To Examine Sanctuary City Threat","title_page":"House Hearing To Examine Sanctuary City Threat | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A House panel will take a closer look at sanctuary cities, which refuse to cooperate with federal immigration authorities, during a hearing next week.\n“Sanctuary city policies needlessly endanger American lives by refusing to honor the federal government’s authority to enforce immigration laws,” House Judiciary Committee Chairman Bob Goodlatte said Thursday.\n“Unfortunately, the Obama Administration’s own foolish policies enable rogue local governments to defy federal immigration laws,” he added. “All too often, these reckless policies create preventable tragedies.”\nThe murder of Kathryn Steinle — allegedly by a five-time deported, multiple-felon illegal immigrant who was released from police custody due to San Francisco pier’s sanctuary policies — has brought sanctuary cities under increased scrutiny.\nNext Thursday the House Judiciary Committee’s Immigration and Border Security Subcommittee will hold a hearing titled “Sanctuary Cities: A Threat to Public Safety.”\n“The border is porous, there are insufficient internal security mechanisms in place, and this administration has embraced non-enforcement and a constitutionally-suspect rewriting of what inadequate current laws do exist,” Subcommittee Chairman Trey Gowdy (R-SC) said.\n“These administration policies enable the willful failure of localities to respect detainers and create more than benign-sounding things like ‘sanctuary’ cities. It creates gaping holes in our criminal justice system, which leads to deadly consequences,” he added.\nAt a House Judiciary Committee Department of Homeland Security oversight hearing this week, DHS Sec. Jeh Johnson argued against legislation forcing sanctuary cities to comply with federal immigration law.\nRepublicans in recent weeks have filed a number of bills aimed at compelling sanctuary cities to honor federal immigration detainer and notification requests.\nThe House Appropriations Committee earlier this week approved a DHS appropriations bill that includes a provision prohibiting sanctuary cities from receiving federal law enforcement grants.","url":"https://www.breitbart.com/politics/2015/07/16/house-hearing-to-examine-sanctuary-city-threat/"}
