{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:01:10","date_modify":"2018-10-30 22:01:10","date_publish":"2016-12-15 00:00:00","description":"The House of Lords report on Brexit's possible impact on financial services also calls for a transition deal to help companies avoid a 'cliff edge.'","filename":"data/vaneerConsumption/HouseofLordsreportonBrexitimpactonfinancialservices.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_house-of-lords-report-on-brexit-impact-on-financial-services-new-york-cliff-edge-2016-12_1540936870.html","title":"House of Lords report on Brexit impact on financial services","title_page":"    House of Lords report on Brexit impact on financial services - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The rising sun lights the Brooklyn Bridge and One World Trade in the Manhattan borough of New York, U.S.,November 2, 2016. REUTERS/Lucas Jackson LONDON — Financial services relocating away from Britain as a result of Brexit are more likely to move to New York than elsewhere in the European Union, a House of Lords committee has concluded.\nThe House of Lords European Union select committee says in a report on Brexit's impact on financial services published on Thursday: \"We were told that much of the business lost by the UK would be more likely to relocate to New York than to the EU.\"\nThe committee highlighted the fact that New York already has a highly evolved finance \"ecosystem,\" second only to London, and says businesses feel it would be easier to become part of New York's scene than try to replicate a rival ecosystem in a city like Paris, Frankfurt, or Dublin.\nThe difficulties in replicating London's unique financial services system could also be used as a bargaining tool, the committee suggests.\n\"Repatriation could happen. But the difficulties associated with replicating the services currently provided in the UK give us some hope that a deal might be reached that would be in the mutual economic interest of both the UK and the EU.\"\nThe downside of such complexity is that it is very hard for the government to predict the likely impact of possible Brexit-related changes, the report says.\n\"The interconnectedness of the UK financial system presents serious difficulties for firms and the Government in determining the impact of changes to the relationship between the EU and the UK,\" the committee writes. Like a game of Jenga, move one wrong piece and the whole thing could come crashing down.\nThe Lords say that avoiding disruption to financial services must be \"a high priority\" in Brexit negotiations, warning that businesses need certainty otherwise may relocate thousands of jobs elsewhere. The report calls for the government to agree a transition deal to ease the process of Brexit for the City, a conclusion already trailed in the press earlier this week.\nThe report says: \"We find that a key priority will be to ensure that there is an adequate transition period, avoiding a 'cliff edge' both at the moment of withdrawal following the Article 50 process and as the UK and the EU move towards a new relationship.\"\nThe Lords committee also says that \"maintaining appropriate labour market flexibility will be critical to the UK's long-term economic prosperity.\"","url":"https://www.businessinsider.com/house-of-lords-report-on-brexit-impact-on-financial-services-new-york-cliff-edge-2016-12"}
