{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:42:20","date_modify":"2018-10-30 20:42:20","date_publish":"2015-03-28 02:27:43","description":"Iran-backed Houthi rebels vow to transform Yemen into a “graveyard of invaders” if the Saudi Arabia-led airstrikes are followed by a ground offensive.","filename":"data/vaneerConsumption/HouthiLeadertoUnitedArabCoalitionYemenWillBeaGraveyardofInvaders.json","image_url":"https://media.breitbart.com/media/2015/01/5961e93410caa9036b0f6a706700c76c.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_27__1540932140.html","title":"Houthi Leader to United Arab Coalition: Yemen Will Be a 'Graveyard of Invaders'","title_page":"Houthi Leader to United Arab Coalition: Yemen Will Be a 'Graveyard of Invaders' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran-backed Houthi rebels vow to transform Yemen into a “graveyard of invaders” if the Saudi Arabia-led airstrikes are followed by a ground offensive.\nYemen will become the “graveyard of invaders” if the Saudi-led coalition puts boots on the ground, declared Abdulmalik al-Houthi, the Houthi rebel’s leader, as he called for an end to what he described as illegal and unprovoked aggression, according to The Guardian.\nEgyptian security and military officials told The Associated Press that Saudi Arabia and Egypt will be leading a ground offensive against Houthi rebels and their allies in Yemen.\nGround forces are expected to “enter by land from Saudi Arabia and by sea from the Red Sea and Arabian Sea.”\nThe possibility of a ground offensive escalated when Egypt declared its willingness to send troops into Yemen “if necessary,” reports British newspaper The Guardian.\nEgypt issued that declaration following Saudi-led airstrikes launched against Houthi targets in Yemen late on Wednesday.\nShiite Houthis in Yemen are fighting to overthrow U.S.-backed Yemeni President Abd-Rabbu Mansour Hadi, who fled Yemen on Wednesday and arrived in the Saudi capital Riyadh on Thursday, according to Saudi state-run television.\nThe Saudi-led campaign in Yemen, dubbed Operation Decisive Storm, is backed by the U.S., Gulf States, Turkey, and Egypt.\nAccording to Saudi-owned Al Arabiya News, Saudi Arabia deployed 100 fighter jets, 150,000 soldiers, and other navy units on Thursday for the anti-Houthi campaign.\nThe United Arab Emirates also contributed 30 fighter jets, while Kuwait and Bahrain each deployed 15, Qatar deployed 10, and Jordan 6.\nEgypt is reportedly sending four warships to secure the Gulf of Aden, Reuters reports. The White House said the U.S. is providing “logistical and intelligence support.”\nSaudi defense minister Prince Muhammad bin Salman, the king’s son, is leading the operation.\nIn the wake of the Saudi-led airstrikes, foreign ministers from the Arab states met in Egypt on Thursday and unanimously agreed to form a unified military force to deal with the Houthis and other security threats against them, reports Al Arabiya News.\nAt a press briefing that day, Nabil al-Arabi, the Arab League’s secretary-general, said the ministers acknowledged that the creation of joint military Arab force is “historic.”\n“This is the first time that a force will be created and work under the name of Arab states,” he said, Agence France-Presse (AFP) reports.\nChiefs of staff from the Arab armies are expected to coordinate and establish the coalition within one month.\n“Egypt has declared its political and military support, as well as its participation with the coalition with an aerial and naval Egyptian force, as well as a ground force if necessary, in light of Egypt’s historic and unshakeable responsibility towards Arab and Gulf national security,” Egypt’s foreign minister, Sameh Shoukry, told the Arab foreign ministers on Thursday, according to The Guardian.\nThe Houthi rebels have been linked to Iran by the U.S. intelligence community, a relationship that the Shiite group denies. Shiite Houthis are fighting against forces loyal to the U.S.-backed Yemeni president.\nSaudi Arabia’s move to attack Houthis in Yemen was described by Al Arabiya News as “a major gamble by the world’s top oil exporter to check Iranian influence in its backyard without direct military backing from Washington.”\nThe Saudi-led offensive “threatens to spark a regional confrontation between Iran and its Arab rivals, who are increasingly anxious at the Islamic Republic’s growing influence in Yemen, Iraq, Syria and Lebanon,” adds The Guardian.\nA ground operation in Yemen would pit the Saudi-led coalition against an Iran-backed rebel group, potentially posing a major threat to stability in the region.\nIran, which has aligned itself with the Houthis, has called for an “immediate stop” to the Saudi offensive in Yemen.\nOn Thursday, the Kremlin said Russian President Vladimir Putin also called for an “immediate cessation of military activities” in Yemen during a phone conversations with his Iranian counterpart, Hassan Rouhani, notes The Guardian.\nReportedly, the Saudi-led coalition struck a rebel-held military base, arms depots, and a civilian airport held by the Houthis, among other targets.\nFollow Edwin Mora on Twitter: @EdwinMora83.","url":"https://www.breitbart.com/national-security/2015/03/27/houthi-leader-to-united-arab-coalition-yemen-will-be-a-graveyard-of-invaders/"}
