{"authors":["Alexandra Klausner For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 23:16:54","date_modify":"2018-10-22 23:16:54","date_publish":"2016-01-28 11:59:19","description":"The MTA banned hoverboards from the New York City transit system on Wednesday for safety reasons after the toy is tied to at least 40 fires in 19 states.","filename":"data/vaneerConsumption/HoverboardsbannedonNYCtransitsystem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAFC4600000578-0-image-a-6_1453991971788.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420810_Hoverboards-banned-NYC-transit-system_1540250214.html","title":"Hoverboards banned on NYC transit system","title_page":"Hoverboards banned on NYC transit system | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The MTA has banned hoverboards from the New York City transit system for safety reasons.\nTransit officials announced on Wednesday that riders will not be allowed to bring the two-wheeled motorized devices on buses, subway platforms and trains, the Long Island Rail Road, Metro-North Railroad and the Staten Island Railway.\nOfficials say the ban is being issued because the lithium battery devices are a fire risk. MTA board vice chairman Fernando Ferrer says: 'There have been reports of exploding batteries, and certainly you don’t want anything like that in a crowded subway car or a train.'\nThe MTA will launch an ad campaign reminding riders of the band using their signature bubble people along with the saying, 'no hoverboards allowed'.\nScroll down for video\nBan: MTA officials announced on Wednesday that riders will not be allowed to bring the two-wheeled motorized devices on buses, subway platforms and trains, the Long Island Rail Road, Metro-North Railroad and the Staten Island Railway\nAnnouncement: MTA chief safety officer David Mayer compared the use of hoverboards to 'skateboards or other personal wheeled vehicles,' which are also banned from the MTA. Lithium batteries also pose a potential fire risk\nMTA chief safety officer David Mayer compared the use of hoverboards to 'skateboards or other personal wheeled vehicles,' which are also banned from the MTA.\n'We’re equally concerned about the safety risk of bringing devices that pose fire hazards into the confined spaces inside trains and buses,' Mayer said.\nIn recent weeks, Amazon offered refunds to anyone who bought hoverboards on its website as safety concerns continue to grow.\nThe move comes amid growing concerns that the two-wheeled balance boards are not safe and continue to remain a fire hazard.\nSAFETY TIPS FROM THE CONSUMER PRODUCT SAFETY COMMISSION 1. Have a working fire extinguisher nearby while charging or using these boards in and around your home 2. Charge in an open area away from combustible materials 3. Gear up before riding, which means putting on a skateboard helmet, elbow and knee pads and wrist guards 4. Do not use a hoverboard on or near a road\nThe e-retail giant has agreed to provide full refunds on all hoverboards purchased through its online store at any of the company's sites including the U.S. and in Britain.\nThe CPSC said it was looking into at least forty blazes involving in 19 states the smart boards, thought to be caused by lithium-ion batteries and the hoverboards' electronic wiring.\nOver the last couple of months, countless videos have been produced and posted to YouTube of the products bursting into flames for no apparent reason.\nIn the very worst cases, entire homes have been burned down and users have received burn injuries.\nCPSC chairman Elliot Kaye said that the boards also sent a serious falling risk.\n'The current designs of these products might not take fully into consideration the different weights of different users, potentially leading to the units speeding up or lurching in a manner that a user would not have reason to anticipate,' he said.\nThe CPSC welcomed Amazon's decision to offer refunds, and has called on other retailers and manufacturers to do the same.\nAmazon stopped selling many models in December but despite this latest decision, The Everything Store is still selling hoverboards on its site including a model from Swagway, which is listed as one of the 13 companies whose products are being investigated by the CPSC.\nThe MTA will launch an ad campaign reminding riders of the band using their signature bubble people along with the saying, 'no hoverboards allowed.' Pictured here is a tweet of the announcement\nHOW TO SPOT A SAFE HOVERBOARD Consumers are advised to check the packaging has a manufacturer's name and contact details In the past few months, hoverboard companies have come under fire for issuing products that can suddenly explode. Many of these occurrences were found to be a result of counterfeit devices. One consumer found instructions that include: 'Get off the bus, get off before you stop intelligent drifting scooter balance state, one foot down, the other one foot in the left drifting scooter again.' KCC Trading Standards Operations Manager James Whiddett said: 'The first thing consumers should do is check the packaging. 'They won't have manufacturer details on them. 'Plugs won't go into your socket properly and without a fuse, they're very dangerous. 'The product itself should have a CE mark on it and the ones we have found have nothing on them at all. 'These things have batteries in them that can overheat and catch fire and we've seen that happen in the county already. Remember the golden rule, if it seems too good to be true, it probably is.' The instructions should contain all the information you need to use the product safely and the manufacturers name and address should be included so you can contact them if anything goes wrong. Check for spelling mistakes on the box; this is a giveaway for counterfeits. They also often copy safety marks, so take a close look to be sure they are genuine.\nAmazon's refund offer is the latest in a series of hiccups for hoverboards, which have been banned by all three major U.S. airlines, along with smaller airlines.\n'Poorly labeled, powerful lithium-ion batteries powering hoverboards are the issue,' Delta Airlines said in a statement at the time.\n'Delta reviewed hoverboard product specifications and found that manufacturers do not consistently provide detail about the size or power of their lithium-ion batteries.'\nColleges have also banned them and the U.S. Postal Service will only agree to transport the devices by ground. A leading manufacturer, Swagway, has been hit with a class-action lawsuit.\nSome hoverboards contain lithium-ion batteries that top 160 watt hours, exceeding regulatory limits. It’s possible, therefore, that the devices could overheat and spontaneously combust.\nHoverboards, which consist of a self-balancing board between two small wheels, were among the must-have Christmas gifts of 2015.\nHowever, the devices, which range in price from $200 to $2,000, have become notorious for starting fires - with at least 17 of 50 states reporting at least one over the holidays.\nMeanwhile, Australian consumer affairs minister Kelly O'Dwyer has been asked to consider a country-wide ban on the devices following a fire in Victoria.\nWhile the exact cause of the fires has not been established, it appears the fault lies with the lithium-ion batteries mounted inside.\nMillions of devices, from laptops to phones and e-cigarettes, are fitted with the batteries which are preferred to older nickel-cadmium units because they are more powerful, last longer, and do not develop a 'memory' if not fully charged each time.\nWhile the batteries are perfectly safe if undamaged and wired properly, there is concern that some hoverboards are being manufactured incorrectly, leaving them at risk.\nGood quality devices have special circuits that prevent the batteries from overheating or being overcharged, dramatically reducing the chance of catastrophic failure.\nHowever, poorly manufactured, non-branded units, often from China, usually do not have these additional safety systems.\nSome hoverboards contain lithium-ion batteries that top 160 watt hours, exceeding regulatory limits. It’s possible, therefore, that the devices could short-circuit, overheat and spontaneously combust\nIn the UK, National Trading Standards said 15,000 of the 17,000 – or nine in ten - of the gadgets it has examined since October have been detained, mainly for having non-compliant electrical components that could explode or catch fire.\nAnd New York City has officially banned hoverboards. Anyone found riding the two-wheeled electric vehicles on the street or sidewalk could face a $500 fine and have their hoverboard impounded.","url":"https://www.dailymail.co.uk/news/article-3420810/Hoverboards-banned-NYC-transit-system.html"}
