{"authors":[],"date_download":"2018-10-30 21:17:07","date_modify":"2018-10-30 21:17:07","date_publish":"2018-08-17 23:00:00","description":"Pennsylvania grand jury report on Catholic abuse cases, cover-ups draws reactions in Atlanta","filename":"data/vaneerConsumption/HowAtlantansviewPennsylvaniaCatholicabusereport.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/17/Images/newsEngin.22804255_081818-ENT-catholic-abuse-ba02-U68115551157wRe-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_religion_pennsyl_f25e0d99013bd7349df88944147795f9__1540934227.html","title":"How Atlantans view Pennsylvania Catholic abuse report","title_page":"How Atlantans view Pennsylvania Catholic abuse report","title_rss":"NULL","source_domain":"ajc.com","text":"In response to the release of a damning Pennsylvania grand jury report that outlined decades of sexual abuse by priests and cover-ups by church authorities, Atlanta Archbishop Wilton D. Gregory penned an open letter to area Catholics.\nAll Catholics, he wrote, “including so many good and generous priests, are rightly angered, confused, and embarrassed by this testimony that the leadership of the church failed to care for our people with compassion and honesty.”\nHe said the archdiocese grieves for those survivors and offers prayers.\nGregory, who was unavailable for comment, vowed to take whatever next steps “are necessary to ensure vigilance and accountability and to foster healing.”\nPaul McLennan, a Decatur resident and former Catholic, who says he was sexually abused as a teen, is watching it all with growing frustration and anger.\n“Thoughts and prayers are not doing it,” said McLennan, who has seen the letter. “We’re way past that. We need to see action. It’s time for systemic change.”\nHis feelings are like those of many other survivors of clerical sexual abuse. For them, it’s the same story all over again — only the name of the diocese has changed.\nThe U.S. Catholic Church has struggled with the issue of abuse for decades. One of the most explosive revelations came out of Boston, in which the Boston Globe’s Spotlight team investigated decades of widespread and systemic child sex abuse cases by several Roman Catholic priests.\nPaul McLennan in his 1971 yearbook photo. He says that when he was a teenager, he was abused by a Catholic priest in a suburb of Chicago. BOB ANDRES /BANDRES@AJC.COM (The Atlanta Journal-Constitution)\nThe most recent findings in Pennsylvania have put unprecedented pressure on the Vatican and U.S. church officials to take action.\nFor its part, the Vatican on Thursday broke its silence on the Pennsylvania scandal, calling it “criminal and morally reprehensible,” according to CNN.\n“How many bad apples does it take to an indict a system?” asked McLennan, a 64-year-old grandfather . “What we have here is the failure of an institution to critically examine how its values and culture have contributed to this crisis.”\nNearly five decades ago, McLennan says, he was sexually abused by a priest at the high school he attended in a suburb of Chicago. He was 16 at the time and on a weekend retreat out of town, when a priest, who had “groomed” him, climbed into bed with him and touched him inappropriately.\nRelated: Church abuse case shakes Catholics around the nation\nThe now-retired MARTA employee never told his parents. He never complained to church officials. It wasn’t until November 2017 that McLennan decided to write to Father James Marchionda, the prior provincial for Dominican Friars Central Province USA in Chicago, to ask about their policy in dealing with priests who are accused of sexual abuse. Even then, he didn’t ask for an investigation.\nThe priest was dead. Marchionda responded, writing McLennan what happened was “despicable, and I apologize in the name of both the Dominicans and the entire Church that you and others like you have had to bear such heavy burdens in life because of the failures of individual priests and many Catholic institutions.”\nRelated: Lobbyist for archdiocese works to gut childhood sexual abuse bill\nMarchionda said in a telephone interview that he could find one complaint against that same priest for inappropriate behavior and that it didn’t involve a minor.\n“I apologize when somebody reveals something like this to me,” Marchionda said.\nMcLennan has lived with the trauma from that night many years ago. He still goes to therapy and support group meetings and is on his fourth marriage.\n“It’s case after case, country after country, report after report,” he said. “Where is the self-examination? What are the values that have allowed this to continue for generations? I don’t see any reform coming from the Vatican.”\nTim Lennon, president of the Survivors Network of Those Abused by Priests (SNAP), isn’t hopeful that even the massive Pennsylvania investigation, one of the largest scandals in the U.S. Catholic Church, will result in significant change in how the church deals with abusive priests and those who shelter them or look the other way. He said many abuse victims don’t come forward or if they do, it could be decades later.\n“Seeing something like Pennsylvania happen, it’s not like the church is doing anything on their own,” said Lennon, who works with cases in Georgia. The church “only does something in response to outside intervention. Civil society must intervene. Is any diocese, like in Alabama or Georgia, any different than Pennsylvania?”\nRelated: Senate changes wreck law on statute of limitations for childhood sexual abuse\nThis is not the first time Gregory, Atlanta’s sixth archbishop, has had to address church sexual abuse issues. The archdiocese has several programs to help abuse survivors, including a hotline and victims assistance program.\nEarlier this year, the Catholic Church in Atlanta, led by Gregory, opposed a bill in the legislative session that would have given victims of sex abuse more time to sue pedophiles and organizations.\nThe legislation, dubbed the “Hidden Predator Act,” would have extended the statute of limitations for victims from age 23 to 38, and created other avenues for adults to sue long after that age. The lobbying effort against the bill also included the Boy Scouts.\nAccording to an article in The Atlanta Journal-Constitution, Gregory wrote that the bill was “extraordinarily unfair” to the church and would hinder its mission by allowing lawsuits for actions that occurred years ago.\nIn 2002, The New York Times detailed a meeting of Roman Catholic bishops in Dallas.\nPresent at that meeting was Gregory, then president of the U.S. Conference of Catholic Bishops. They were meeting to construct a national policy on preventing and addressing clerical sexual abuse. “We are the ones who are worried more about the possibility of scandal than bringing about the kind of openness that helps prevent abuse,” Gregory said, according to the article.\nDuring his time as president of the USCCB, in office, the bishops implemented the “Charter for the Protection of Children and Young People,” which lays out a comprehensive set of procedures for addressing allegations of sexual abuse of minors by Catholic clergy, according to the USCCB website. It also includes guidelines for reconciliation, healing, accountability and prevention of future acts of abuse.\nThe charter has been revised several times, most recently in 2018.\nFOR HELP\nArchdiocese of Atlanta 24-hour abuse reporting line: 1-888-437-0764\nSNAP, 1-877-SNAP-HEALS (1-877-762-7432)\nRAINN, National Sexual Assault Hotline: 1-800-656-4673","url":"https://www.ajc.com/lifestyles/religion/pennsylvania-report-catholic-abuse-cases-draws-reactions-atlanta/JZMC2e2i0vIK7hulF1x3FP/"}
