{"authors":[],"date_download":"2018-10-31 00:04:57","date_modify":"2018-10-31 00:04:57","date_publish":"2016-10-07 00:00:00","description":"Gov. Pete Wilson tried to wrest key powers from the CalPERS board. A labor-led counterattack left the board more independent than ever.","filename":"data/vaneerConsumption/HowagovernorsbidtoexertcontroloverCaliforniapublicpensionsbackfired.json","image_url":"https://www.trbimg.com/img-57eee042/turbine/la-1475272938-snap-photo/600","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944297.html","title":"How a governor’s bid to exert control over California public pensions backfired","title_page":"How a governor’s bid to exert control over California public pensions backfired - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"Facing an unprecedented budget deficit shortly after taking office in 1991, Republican Gov. Pete Wilson made an unusual request of the state’s largest pension fund: Can you be more liberal in your predictions about the stock market? This series is a partnership of If the California Public Employees’ Retirement System raised its official projection of investment growth, Wilson said, the state’s required contribution to the pension fund would go down by more than $300 million. CalPERS rejected the idea, but Wilson still needed a way to balance the books. So he proposed a sweeping reorganization of CalPERS that attempted to grab more than just pension cash. What happened next helped chart the course of pension politics over the past quarter century — and ensured that the autonomy of public pension funds would be spelled out in California’s constitution.\nA state budget debate that became a fight over pension fund power “It always starts with the money,” said Fred Main, a longtime Sacramento lobbyist. ADVERTISEMENT For almost four decades, governors facing budget gaps have looked to ease the financial effect of past retirement promises to government workers. Some governors have created breathing space by delaying mandatory pension payments — an approach attempted with mixed success by Jerry Brown in 1982 and George Deukmejian in 1990. Govs. Gray Davis and Arnold Schwarzenegger tried to raise money for pension obligations by selling bonds, before being blocked in court. Wilson mounted his gambit in the face of a newly projected $14.3-billion budget deficit. Ultimately, the Legislature agreed to reallocate some $1.6 billion from obscure pension sub-accounts intended to provide an inflation supplement for the meager benefits of the oldest retirees. That $1.6 billion, once infused into the complex formulas that fund pensions, reduced the overall contribution owed by state and local governments. “We were looking for whatever pot of money we could find,” recalled Tom Hayes, who was the governor’s budget director in 1991 and went on to serve as state treasurer. The Pension Gap: Read the story But the money was only the beginning. Wilson’s plan included two major changes to CalPERS operations: Forcing the fund to transfer control of actuarial projections — the prediction of investment profits — to his own administration, and a reorganization of the pension fund’s board of directors so a majority of its members would be appointed by the governor. The changes to the board would have diminished the power of public employee unions, from whose ranks came many of the pension fund’s directors. “Everyone thought that Democrats weren’t going to give that up,” said Steve Coony, who was then staff director for the leader of the state Senate. Wilson, elected governor just a few months earlier with a plurality of votes cast, found himself battling powerful legislative leaders from the very beginning of his term. But he had also spent months laying out the state’s dire financial circumstances to the public. And he shrewdly realized that the budget crisis left Democratic legislative leaders willing to do almost anything to avoid deeper cuts in social services and possible mass layoffs of state workers. “They said, ‘We’ll meet you halfway, but the rest of it, governor, is up to you,’” Wilson, now 83, recalled in a recent interview. When It Comes To Pensions, Illinois Is California's Ghost Of Christmas Yet To Come Listen to a report by Capital Public Radio. Read the story In July 1991, he signed into law a budget plan that assumed both the cash grab and the oversight of pension fund actuarial projections by the governor. Wilson abandoned the latter idea after legislative Democrats refused to approve the final plan. Wilson’s effort to change the makeup of the governing board also was rejected almost from the start by lawmakers. In the end, the governor succeeded only in a short-term transfer of cash. Even so, the broader fight over pension operations lit a fuse with public employee unions. Three months later, they struck back.\nProposition 162: The ‘potential costs are unknown’ In October 1991, critics of Wilson’s pension proposal filed a ballot measure that sought to permanently block the structural changes to CalPERS that the governor had sought. That year’s fight had suggested to labor that the pension fund’s autonomy needed bolstering in the state constitution. The proposal qualified for the Nov. 3, 1992, statewide election as Proposition 162. It passed by a single percentage point. “It was an extraordinary event,” said Keith Brainard, research director for the National Assn. of State Retirement Administrators. Leading the charge for Prop. 162 was a coalition of public employee unions, whose leaders were angry over what they saw as a decade’s worth of political gamesmanship and were looking for a bulwark against any future tinkering with CalPERS. The California Public Employees’ Retirement System is the nation’s largest pension fund. Organized labor has long wielded considerable influence over the 13-member board. (Carl Costas / For The Times) “It's not right to allow politicians to balance their budgets on the backs of seniors and retirees,” said the ballot argument in favor of Prop. 162, signed by representatives of retirees and government workers. The campaign pitch was straightforward, even though the ballot measure language was arcane. The language was also ironclad, giving directors “the sole and exclusive power over the management and investment of public pension funds.” Prop. 162 covered dozens of local government pension funds too, assuring their independence from elected officials in cities, counties and special districts. Perhaps even less understood was how the 1992 ballot measure would change the pension funds’ core mission. For decades, CalPERS and local pension agencies had been required to balance three co-equal responsibilities: Provide retirement benefits to government workers; minimize the contributions needed by state and local governments; and spend reasonably on administrative operations. The initiative revised those marching orders, amending the state constitution to decree that a pension fund’s responsibility to workers and their families would “take precedence over any other duty.” The implication seemed to be that pension directors were no longer required to balance benefits with costs. “That was a point that was not that well-publicized,” said Ed Mendel, a former statehouse reporter for more than three decades who now writes the blog Calpensions. For voters who glanced at the 1992 ballot guide analysis, there was a prescient warning: “The requirement that pension system boards give highest priority to providing benefits to members and their beneficiaries could result in higher costs to employers.” Voters may not have been aware that as taxpayers, they were the employers in question. “Placing benefits as the highest priority,” said the ballot guide analysis, “could result in higher costs to employers if board decisions increase benefits without equal consideration to the cost for those benefits.” Prop 162 also gave CalPERS permanent control over the actuarial projections of its investment returns. Compared to some of the other pension funds in the country, Brainard said, CalPERS is “quite independent.” The 1992 campaign also made it more difficult to reconfigure the pension board, where six of the 13 seats are reserved for public employee representatives and offer at least an indirect connection to politically powerful unions. Wilson sought to radically reshape the board by grabbing much of the appointment power. In response, Prop 162 ensured that any future effort would play out in the court of public opinion. “Now, you have to get a vote of the people” to change the makeup of the CalPERS board, Coony said. For some local pension plans, the makeup of the governing board can be changed only by a vote of the government workers who pay into the pension system. Support our public service journalism Become a Los Angeles Times subscriber today to support collaborations like this one. Start getting full access to our signature journalism for just 99 cents for the first four weeks. “Those counties might have made different choices” about pension governance were it not for Prop. 162, said Main, who at the time worked for the California Chamber of Commerce. Wilson played no formal role in the 1992 campaign sparked by his attempt to remake the pension system. But he said it’s clear that in any political battle in California, the rules written by voters can trump everything. “The use of the initiative, depending on your point of view, can be enormous,” he said. Contact the reporter. Follow @johnmyers on Twitter and listen to the weekly California Politics Podcast.\nCredits: Design and production by Lily Mihalik\nCalifornia's Pension Crisis: Coming next in the series Gov. Jerry Brown brokered the biggest pension rollback in California history. But how much of the problem has he really solved? Sign up for our Essential Politics newsletter to receive the next installment in your inbox Privacy policy","url":"http://www.latimes.com/projects/la-pol-sac-pension-fight-pete-wilson-20161009/"}
