{"authors":[],"date_download":"2018-10-30 18:30:34","date_modify":"2018-10-30 18:30:34","date_publish":"2016-09-24 02:19:00","description":"When an Air Force veteran wandered through his Chamblee apartment complex naked, he was in crisis. Anthony Hill’s service in Afghanistan contributed to his post-traumatic stress disorder, which was complicated by his bipolar disorder.","filename":"data/vaneerConsumption/HowAtlantapolicehandlecallsinvolvingthementallyill.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/24/Images/photos.medleyphoto.11494019.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_how-atlanta-poli_2c1a342048fa0009d5e3e3b01d24bef8__1540924234.html","title":"How Atlanta police handle calls involving the mentally ill","title_page":"How Atlanta police handle calls involving the mentally ill","title_rss":"NULL","source_domain":"ajc.com","text":"When an Air Force veteran wandered through his Chamblee apartment complex naked, he was in crisis. Anthony Hill’s service in Afghanistan contributed to his post-traumatic stress disorder, which was complicated by his bipolar disorder.\nThe DeKalb County police officer who responded to calls about Hill, and who sent bullets tearing through his chest tattoo — “Be sensible” — had been trained to de-escalate situations, avoid excessive force and handle persons in crisis.\nFormer officer Robert Olsen attended 40 hours of Crisis Intervention Training in 2009, six years before he killed Hill in March 2015.\nIn Olsen’s case the training didn’t work, but law enforcement isn’t giving up.\nAgencies continue to work with the Georgia Bureau of Investigation and the National Alliance of Mental Illness to train officers how to recognize those suffering from mental illness, problems of addiction and diseases such as Alzheimer’s and autism.\nThe ‘chief’s challenge’ to fund crisis training in Georgia\nIn 2004, a group from NAMI approached the GBI about bringing a national program to agencies across Georgia, Director Vernon Keenan said. He talked about the course during a recent event at Brookhaven police headquarters for NAMIWalks, a nationwide fundraising and mental health awareness program.\nBrookhaven Police Chief Gary Yandura, Georgia Bureau of Investigation Director Vernon Keenan and National Alliance of Mental Illness Georgia Executive Director Kim Jones encourage law enforcement officials from around the state to participate in a challenge to raise money for Crisis Intervention Training through NAMIWalks. (Credit: NAMI Georgia)\nKeenan spoke about Crisis Intervention Training in front of about 50 state troopers, sheriffs, deputies, police chiefs and officers from all over the state Sept. 2, ahead of a 5-kilometer fundraising walk scheduled for Oct. 8 in Atlanta’s Grant Park.\nPat Strode, the CIT Program administrator, and Brookhaven Police Chief Gary Yandura hosted the 30-minute presentation as a friendly “chief’s challenge” aimed to add money specifically for the CIT Program from officials who walk.\nLt. Daniel Lindsay, who traveled more than 200 miles from the Moultrie Police Department, said the training he completed in 2010 changed his career. He now volunteers to train officers to avoid or minimize use of force when possible.\n‘Touchy, feely, sensitivity-type training’\nKeenan told the group about his wife, Joan, a retired licensed clinical social worker who in 2004 went to the University of Memphis CIT Center with other law enforcement officials to visit one of the best mental health training programs in the country.\nHe said his wife’s opinion influences him, though he admitted he wasn’t 100 percent sold on the training at the time, more than a decade ago.\nStill, Keenan encouraged chiefs across the state to send officers to the first Georgia CIT class.\n“The first class, all the officers were ordered to be there,” Keenan said. “No one wanted to be involved in the touchy, feely, sensitivity-type training.”\nWhen an officer approached Keenan with feedback after that initial class, he said he knew then how crucial CIT was.\n“A supervisor told me he was ashamed of some of the things his department had done in interacting with the mentally ill,” Keenan said, but would now take what he had learned and go back to his department to change the way the officers did business.\nWhat some activists want\nHill’s girlfriend, who he dated for almost three years before he was fatally shot, has been outspoken against the way DeKalb County police respond to the mentally ill and those in crisis. Bridget Anderson helped start a nonprofit call-to-action called “Mental Illness is Not a Crime” to take a stand against the criminalization of the mentally ill.\nBridget Anderson kneels at the door of one of the tents outside the DeKalb County Courthouse, where she and other activists await a grand jury decision in the death of Anthony Hill, the unarmed veteran shot and killed by police in March. Anderson was Hill’s girlfriend. GRACIE BONDS STAPLES / GSTAPLES@AJC.COM\nAnderson said she doesn’t think the crisis training is enough and wants mental health response units and a separate number other than 911 for family members and friends to call when a loved one is in crisis.\n“I don’t believe that police officers need to handle mentally ill people — period. No matter how much training, they’ll still shoot,” Anderson tweeted recently.\nRELATED: Think before you call\nHill’s aunt, who asked not to be named, said she thinks CIT might be a good start, but the mental health response units would be much more ideal.\n“Many officers are trained to err on the side of caution by using deadly force,” she said. “This is bad for people who are not expressing appropriate body language and/or not fully comprehending their surroundings. In a world with skyrocketing rates of autism, dementia and PTSD, it is crucial that our officers know how to properly interact and de-escalate these populations, yet maintain their own safety.”\nThe goals of keeping police officers safe and de-escalating a situation are not mutually exclusive, Hill’s aunt said.\nThe need to react and gain control of a situation is paramount for police and, sometimes, officials can’t calm someone down when he or she is having an apparent breakdown, Keenan said.\n“Some situations you cannot de-escalate; they’ve spiraled out of control by the time the officer gets there,” Keenan said.\nThe threats to officer safety\nWitnesses said Hill had been knocking on doors the day he died in 2015, but he was not threatening anyone and he was — obviously — not armed.\nWhy didn’t Olsen use the tools he learned during his training?\nWhen Olsen shot and killed Hill, the former police officer swore he felt threatened. Olsen was indicted, pleaded not guilty to murder and aggravated assault charges and will likely go to trial in 2017.\nHe failed to de-escalate the situation, but DeKalb Police Chief James Conroy said crisis classes teach officers to see the “totality of the situation.”\nConroy said he thinks he was ahead of the curve when the shooting occurred because DeKalb officers were already starting to fill crisis training classes. Conroy took the class in 2014.\nWhen Olsen shot Hill, on March 9, 2015, Olsen was one of 100 of the roughly 760 officers in the DeKalb Police Department who had completed the course, Conroy said. A year and a half later, 281 of 750 DeKalb officers – or about 37 percent — had been trained to help calm people in crisis and avoid excessive use of force.\nKeenan said the courses are taught by volunteers and there aren’t enough classes available to meet the demand.\nConroy said when he started his career in law enforcement 26 years ago, officers had few options and virtually no training on handling people with mental health issues or drug addiction.\nAfter the Georgia Mental Health Institute lost its funding and closed in 1997, Conroy said he could only “bring them to the sheriff’s office and lodge them in the jail.”\nNow, DeKalb’s police department is partnered with the DeKalb Community Mental Health Board, which Conroy said helps get mentally ill people in beds and off the streets without putting them in jail.\nThe CIT Program helps officers understand when the services are needed.\nAll the money raised by the law enforcement agencies and individuals who walk Oct. 8 is earmarked for the CIT Program, according to Rachel Barber, the walk’s administrator. The training was previously only funded through a Georgia Department of Behavioral Health and Developmental Disabilities grant that has to be renewed annually.\n‘I felt his presence’\nKezia Garnett helps train officers in Atlanta classes by sharing her personal story of crisis. She was panicked during a manic phase of her own bipolar disorder and running through an airport.\n“They tried to put me in the back of the paddy wagon and I wouldn’t go,” Garnett said. “This one police officer was on the other side of the car and he gently nudged me with his hand. I felt his presence.”\nThe officer took her aside and got her some food. Garnett said he calmed and comforted her during her moment of mania.\n“The feeling he gave me was like my dad,” Garnett said. “He didn’t judge me. He made me feel loved and comforted – until my dad came to pick me up.”\nIt’s a story Garnett tells over and over to officers in CIT classes. She answers their questions and helps them understand she is more than her mental status.\nLook at the behavior\nNew DeKalb officers started receiving CIT training in 2015, during the mandatory six-month police academy.\nA 40-hour, five-day curriculum is approved by the Georgia Peace Officers Standards and Training Council for all Georgia law enforcement agencies. NAMI also offers an eight-hour crash course.\nThe classes teach people that when they see a hypothetical lady with a knife, they look at her behavior, Conroy said. Officers aren’t trained to look at race, physical location or economic background – as difficult as it may be to filter those things out.\n“Let’s look at, is she behaving irrationally?” Conroy said, describing how an officer can decide if a person is having a panic attack or dealing with a drug addiction.\nHe described a time when a woman he knew had a knife but wasn’t listening and wouldn’t drop the weapon.\n“I said, ‘Hey, we know each other,’ but she didn’t recognize that,” Conroy said. “That was drug induced.”\nSeeing ‘the human side’\nSometimes “regulars,” people known by police officers, are easier to calm.\nAtlanta police Officer Cerrina Leeks, who received the CIT Coordinator of the Year award in 2014, said safety always comes first, but she strives to see the human side of the people she interacts with.\nWhile working with the Homeless Outreach Prevention Emergency team, Leeks met a 25-year-old woman who had six children and was living on the street because she refused to get help for her crack-cocaine addiction.\nAbout five years ago, she was high, roaming the streets and looking in trash cans.\n“She became somewhat violent, but (because) she was one of our regulars we pretty much knew how to handle her,” Leeks said.\nLeeks said she had sympathy for the 25-year-old woman, but only to a point.\n“Being pregnant and doing crack was not something I was going to allow (her) to do — and she was about seven and a half months,” Leeks said. “I arrested her for urban camping because she was sleeping on the sidewalk.”\nLeeks and the other officer found out who her mother was and convinced her to show up to the woman’s court hearing. Leeks and officers from the HOPE team spoke to the judge on the young mother’s behalf. Though the 25-year-old protested a rehabilitation program, the judge mandated her to drug treatment, which is what Leeks said the woman needed.\nWhen she protested and said, “I’m not going to do it; I’m not taking medication,” the judge said he would keep her in jail until she had the baby so they would know the baby was OK, Leeks said.\nThe effect on officers\nLori Brickman, a NAMI volunteer who has a loved one struggling with mental health issues, said she is passionate about reaching officers on a human level and helping them see the story behind every police incident.\nA recent graduate emailed her about a week after a recent course, asking for help for someone in the community. One of the people the officer came across needed a bed, mattress, dresser and chair and asked Brickman if she could help.\n“A police officer’s job is not to find a mattress and sheets for someone on probation, but this officer is now sensitive to the bigger picture,” Brickman said. “Instead of an incident, they learn to see the person and the story behind the incident. He took it upon himself to learn the person’s story.”\nFifteen minutes after she posted it to Facebook, people offered to donate a kitchen table, six chairs, a couch and a chair.\n“This is what CIT is all about,” Brickman said. “This is why I love these officers who are so committed to making a difference in our community. Being kind is not something you can teach.”","url":"https://www.ajc.com/news/local/how-atlanta-police-handle-calls-involving-the-mentally-ill/cGaX44eZ0xgmpAcyAXdOSP/"}
