{"authors":["Amitai Winehouse For Mailonline"],"date_download":"2018-10-23 04:15:39","date_modify":"2018-10-23 04:15:39","date_publish":"2017-03-10 14:21:51","description":"At one point last month, the best selling football book on Amazon was not Johan Cruyff’s. It was not the life story of the controversial Joey Barton. It was not even written by Zlatan Ibrahimovic.","filename":"data/vaneerConsumption/Howabookaboutfiveasidetoppedlastmonthschart.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E231A4200000578-0-image-a-38_1489155634240.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301436_How-book-five-topped-month-s-chart_1540268139.html","title":"How a book about five-a-side topped last month's chart","title_page":"How a book about five-a-side topped last month's chart | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At one point last month, the best selling football book on Amazon was not Johan Cruyff’s autobiography. It was not the life story of the controversial Joey Barton. It was not even written by Zlatan Ibrahimovic.\nJames Brown, the author of Above Head Height - A Five-a-Side Life, cannot believe it himself. Brown is the founder and creator Loaded magazine and former editor of GQ. Just like the 1.5million others who play small sided football every week, according to the FA, he is obsessed with the casual amateur game.\nOver two hours and tea at Cafe Royal in Soho - requests for Yorkshire Tea from the Leeds lad are only met with confusion - Brown enthuses about his career with the ball at his feet.\nJames Brown - Loaded magazine's founder and creator - is an enthusiastic five-a-side player\nHis book, Above Head Height, was one of last month's most popular football books\nAnd, as his book discusses, it is a career. Above Head Height charts everything from those initial childhood games that everyone plays to the post-Loaded years, in which small-sided games replaced weekends filled with alcohol and partying.\nThere is a sad tale behind Brown’s decision to put his thoughts to print. James Kyllo, who he played with for 17 years, passed away in 2015. Brown considered him to be a friend but realised: ‘I played football with James for 17 years and I knew very little about him.’\n‘This is one of the problems of turning 50 rather than turning 30. The whole book started on the success of the article, which came about because of someone dying.\n‘He died of sudden adult death syndrome, so when we buried him we didn’t know what he’d died of for some time. He didn’t have any health issues, he didn’t have a self-destructive lifestyle. This is what happens.’\nBrown speaks about how the book is really ‘about getting older’, but it’s also just a love letter to football in all of its forms. It’s the bible for anyone who has spent slightly too big a chunk of their working day imagining what might happen if a scout happens to catch you at the right moment.\nWhile Brown believes ‘that stops in your early 30s’, a segment of the book recalls a conversation with other five-a-siders in which they were discussing who they support. One replied ‘I’m a Liverpool player’.\n‘Even though it was quite late in the writing of the book, it legitimized it. Him saying that, I just thought “thank god for that”.\nBrown (front row, second right) lining up alongside QPR legend Stan Bowles (front row, right)\n‘I did wonder whether anybody would care. There was lots of identification but I wasn’t sure whether the rest of the story would hold it.’\nBrown’s book talks about playing five-a-side in what sounds like a cellar in Shoreditch. He speaks of the best goal he ever scored - ‘it bounced off the wall like a snooker shot’, his best moment watching the game - seeing his son score for the first time - and copying Cruyff’s karate kick as a kid with as much enthusiasm as any strike he’s seen in a stadium or on television.\nIt explains why Brown enjoyed putting together Above Head Height so much: ‘I loved writing that book. The best jobs are the ones you can't believe you're being paid for.’\nThat’s why so many readers have loved it too. It’s not about just about him but about shared experiences - fetching balls from under cars, headers and volleys, and Wembley.\nBrown is enthusiastic about football and that is obvious in every part aspect of the book\nBut what about those who have achieved and reached the pinnacle of the game? Brown has spent plenty of time in their company, first as part of Loaded, then as editor of Leeds United magazine Leeds Leeds Leeds in the 1990s. Add in his role as a host on Talksport and it gives him enough material to ensure our two-hour conversation was peppered with entertaining anecdote after anecdote.\nTake a question to John Sheridan. Brown asked him whether it was true that he had missed a post-match massage under Ron Atkinson at Sheffield Wednesday to play for his brother’s Sunday team.\nSheridan was appalled and replied: ‘No, that’s absolutely not true… it was a Friday night game and I was playing for Leeds.’\nIt was hard to stifle laughter as Brown continued to quote Sheridan: ‘At the end of the game the ref came in and said “can I have a word with that No 10 please?” We all froze because they could have got thrown out for having an unregistered player.\n‘The referee said: “He's at the wrong level, you really should get him to a better standard.”'\nHe reeled off stories throughout the interview, including one about John Sheridan (right)\nBrown also recalled the time Dave Bassett told him about getting lost on a pre-match jog\nThe book is littered with stories like these. There’s Alan Shearer hurling ashtrays into the sea while on tour with Newcastle, Dave Bassett going jogging pre-match in Hereford and getting lost and Jason Euell looking forward to playing against Tony Adams because he was ‘always cracking jokes’.\nTo Brown, finding out Andy Townsend nearly didn’t become a footballer because he was making ‘quite a lot of money hustling pool’ is just evidence that there is no real gap between the amateur and professional pitches. The same stories and moments of comedy emerge, like Brown finding out about a fellow player who had felt unwell and taken a seat by the pitch, only to find out later he had suffered a heart attack.\nHe expresses disappointment at learning players don’t continue playing after retiring before segueing into his excitement at finding out where Robert Pires plays five-a-side these days.\nA Leeds obsessive, one of Brown’s favourite stories is the time he walked in on Gary Kelly flying an Irish tricolor at the club’s training ground in the early 2000s. It was shortly after he had been replaced in the first-team by Danny Mills, and according to Brown, Kelly pointed at David O’Leary while explaining: ‘I’m trying to remind THAT idiot which country he comes from.’\nHe claimed Andy Townsend nearly did not become a footballer due to his skills at pool\nBrown recalled Gary Kelly humorously flying an Irish tricolor at manager David O'Leary\nBut Brown is just someone who adores football. It’s reasonable to suggest that it has been his entire life, and he feels as though his own successes are influenced by the game.\nHe grew up in the house opposite Leeds icon and FA Cup winner Allan Clarke: ‘It made a big difference. I've got no qualifications. But I won every award going in the space of about 36 months. I learned everything on the job. I was supremely confident when I was in my 20s.\n‘I think the fact that the England and Leeds centre-forward, who was my hero, made things seem achievable. I knew their dog Pele before I knew the footballer.\n'Imagine if you’re a six-year-old boy or girl getting into football and your hero is Ronaldo. He might as well live in space. It seems so otherworldly.’\nHe grew up in a house opposite FA Cup winner Allan Clarke (right) in Leeds and said it is where his confidence came from during his 20s, when he was editor of Loaded\nTo that end, the book works. It takes football from that mysterious sphere that means that playing it no longer feels like it is in the hands of normal people. Sometimes it's hard to imagine having a game without the latest boots or without being able to rabona a cross.\nThat's a shame when very few people out there did not spend their formative years dodging cars and bouncing footballs off walls with their friends.\nBut Brown says person after person have come to him after reading Above Head Height and told him they want to start playing football again after long breaks.\nThis reporter is one of them. Have any of Cruyff, Ibrahimovic or Barton’s books inspired the same?\nAbove Head Height - A Five-a-Side Life, is published by Quercus Books and is available from all major retailers. Click here for purchasing options.","url":"https://www.dailymail.co.uk/sport/football/article-4301436/How-book-five-topped-month-s-chart.html"}
