{"authors":["Jessica Taylor","Rep. Renee Ellmers"],"date_download":"2018-10-22 23:03:36","date_modify":"2018-10-22 23:03:36","date_publish":"2016-06-06 00:00:00","description":"The political evolution Rep. Renee Ellmers has undergone since 2010 could cost the North Carolina Republican her job in Tuesday's special GOP congressional primary.","filename":"data/vaneerConsumption/HowATeaPartierBecameItsVillainAndWhySheCouldLoseTuesday.json","image_url":"https://media.npr.org/assets/img/2016/06/05/gettyimages-185725278_wide-5f8c91597c25062e8650cbcc1138ab15130c4b9c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_06_06_480845342_how-a-tea-partier-became-its-villain-and-why-she-could-lose-tuesday_1540249416.html","title":"How A Tea Partier Became Its Villain - And Why She Could Lose Tuesday","title_page":"How A Tea Partier Became Its Villain — And Why She Could Lose Tuesday : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How A Tea Partier Became Its Villain — And Why She Could Lose Tuesday\nEnlarge this image toggle caption Alex Wong/Getty Images Alex Wong/Getty Images\nOn Tuesday, Renee Ellmers may see her political career cut short by her one-time allies.\nSix years ago, the North Carolina Republican was a rising star swept into office with the 2010 Tea Party wave. But now conservative groups have her squarely in their cross hairs, arguing she's lost her way since she went to Washington. Upset with her votes on spending and budgets, and on an abortion bill, opponents who once backed her have now spent over $1.1 million trying to defeat her in the state's special primary.\nEllmers is fighting for her political life in the special June 7 primary, in part thanks to an unusual mid-decade redistricting. She's facing fellow Rep. George Holding in the redrawn district, along with physician Greg Brannon, who has unsuccessfully run for the GOP Senate nomination twice.\nBecause of the intraparty face-off, at least one incumbent will become the first GOP casualty this year. But will the more pragmatic approach that Ellmers brags about triumph — or will conservative groups propel one of her rivals to win, claiming victory for conservative orthodoxy?\nA 'Pragmatist' Who 'Wants To Get Things Done'\nIn a town hall last Tuesday in Wake Forest, N.C., Ellmers sounded like a politician on the defensive.\nShe began by explaining to a crowd of about two-dozen people why she'd placed some now-maligned votes that have led to repeated television, radio and direct mail attacks against her record.\nYes, she voted for a budget deal that raised spending caps. Yes, she voted for the Export-Import Bank, a government business loan program to U.S. and foreign companies that many conservatives oppose, because it would save jobs in her district. None of those bills were perfect, she argued, but they were necessary to keep the government functioning.\n\"I would love for [those bills] to be more conservative, but I'm also a common-sense person,\" Ellmers said. \"I'm a pragmatist. I want to get things done. I'm not going to go to Washington and vote no on everything because some outside special interest group says that's the way that I should vote.\"\nSix years ago, no one would have expected those words to come out of Ellmers' mouth. First elected in the Tea Party wave, she made national news with a blistering ad against Democratic Rep. Bob Etheridge, tying him to President Obama and the idea that the president wanted to build a \"victory mosque\" at Ground Zero in New York. She was one of former Alaska Gov. Sarah Palin's original \"Mama Grizzlies.\" And while she was helped by the GOP wave that year and the fact that her opponent was caught on camera berating a Republican tracker, Ellmers seemed primed to be a leading Tea Party voice in Washington.\nI'm a pragmatist. I want to get things done. I'm not going to go to Washington and vote no on everything because some outside special interest group says that's the way that I should vote.\nBut when Ellmers got to Washington, she quickly rose up the leadership ranks and became a trusted ally of former Speaker John Boehner. Her voting scorecard from those \"special interest groups\" took a hit as she voted more in line with the GOP establishment. And now, they see a prime chance to take her out.\nEllmers admitted in an interview after the town hall that the mosque ad was \"pretty over the top\" (and noted that her consultant who created it is now working for Holding). But she argued that she has stayed true to the original principles she ran on — smaller government, and replacing and repealing Obamacare — and that she has been an effective legislator in getting seven bills signed into law, while Holding has only had one since he was elected in 2012.\nShe said these groups are simply singling her out as an easy target to further pad their pockets because they have little to work with while the GOP is in power.\n\"In order to raise money, you have to have a villain,\" Ellmers told NPR. \" And if you have Republicans that are in the majority in the House, you've got to single people out.\"\nOver the weekend, she got some help of her own from presumptive GOP presidential nominee Donald Trump, whom she endorsed just before North Carolina's March 15 primary. In a robocall for her campaign, Trump said he \"need[s] her help in Washington so we can work together to defeat ISIS, secure our border and bring back jobs and, frankly, so many other things.\"\nA 'Warning Shot For Washington'\nGroups actively working against Ellmers acknowledge that they are making her a target, in part because they want her to be an example of what could happen to other Republicans if they fall out of line.\nThe Koch-backed group Americans for Prosperity (AFP) has spent in the \"low six figures\" against Ellmers, targeting her especially for her support of the Export-Import Bank, which they say was the final straw. Their North Carolina chapter, one of the group's most active, has been running digital ads, sending direct mail, and making thousands of door-to-door visits, targeting high-propensity GOP voters who are most likely to go to the polls in what's expected to be a low-turnout election since it was rescheduled.\nDonald Bryson, who is AFP's North Carolina state director, said he has personally knocked on 500 to 600 doors and has yet to find someone who is voting for Ellmers. The group hasn't endorsed Holding or Brannon, though this is the first time it has gotten involved in a House GOP primary against an incumbent.\n\"This is also a warning shot for Washington,\" Bryson told NPR in an interview by the state Capitol. \"Hey, we take corporate welfare very seriously. Conservatives get a knock very often that we're too easy on corporations.\"\nThe Club for Growth is the biggest spender in the district so far, with its political action committee dumping over $700,000 against Ellmers on TV and digital ads calling her \"part of the problem in Washington.\"\nBut it's not just her votes on fiscal issues that have angered conservative groups. The Susan B. Anthony List, whose goal is to elect more anti-abortion women to Congress, took the unusual step of endorsing Holding over Ellmers — the first time they've ever endorsed a man over a \"pro-life woman.\"\nThat's because they say Ellmers helped derail one of their top priorities this Congress — a 20-week abortion ban, known as the \"Pain-Capable Unborn Child Protection Act.\"\nEllmers and other GOP women and some moderate members had objected to a provision in the bill that would have required women seeking a rape or incest exemption to have reported those rapes to the authorities.\nEllmers, a former nurse, argued it was an undue burden and would have hurt the GOP, which was already trying to rebound from an election year when several Republican male candidates were under fire for the way they talked about rape. She points out she still has a perfect record with the National Right to Life, though it and the Susan B. Anthony List are now opposing her.\nThe groups say her actions on the bill she once championed were unforgivable and caused their important legislative goal to lose steam. SBA List is also waging a field program and running digital ads against Ellmers, whom they'd previously endorsed.\nJason Kirkman and Emily Webster, canvassers for the anti-abortion group, were knocking on doors in a suburban Apex, N.C., neighborhood last Tuesday afternoon. Many people weren't home midday Tuesday, but the duo said that at the many houses where they have been able to talk to people over time, the vast majority didn't know of her actions on the bill, which made them less likely to vote for her.\nPlacards that the two leave on doors for voters not home proclaim that \"we cannot trust Renee Ellmers to protect the unborn\" and that her actions had \"betrayed the unborn children who die from painful abortions every day.\"\nDoomed From The Start?\nIf Ellmers does go down on Tuesday, these outside groups will claim her loss as a victory for conservative purity. But the truth is, it's possible Ellmers may have been doomed from the start.\nEllmers previously represented less than 20 percent of the new district, looking at it post-court-ordered redistricting, though parts of it were in her pre-2012 district. Holding, however, previously represented almost 60 percent of the new 2nd District, even though his home is just outside its current boundaries.\nBut according to Steven Greene, a political science professor at North Carolina State University, the simple dynamics that began by favoring Holding shouldn't be discounted. And given the heavy investment from conservative groups who are anxious to make Ellmers an example, her fate may already be sealed.\n\"She's someone who got to Washington and realized she wanted to get things done,\" Greene said of her seeming evolution over the past six years. \"And that's not a popular thing in the GOP.\"\nWhile there's been no reliable public polling of the race, Greene said Ellmers should be seen as the underdog, and he said he believes the ground games from these groups against Ellmers, especially, will make a big difference. Her one chance could be if both Holding and Brannon split the anti-Ellmers vote and she is able to escape with a plurality of the vote.\nBut if she doesn't survive, the \"example\" that conservative groups want to make of her could lead to even more polarization in Congress, if they wage similar campaigns against incumbents who don't fall in line.\n\"When you take compromise off the table, that's not good for American democracy,\" Greene said.","url":"https://www.npr.org/2016/06/06/480845342/how-a-tea-partier-became-its-villain-and-why-she-could-lose-tuesday"}
