{"authors":["Leah Thomas"],"date_download":"2018-10-31 01:38:49","date_modify":"2018-10-31 01:38:49","date_publish":"2018-08-29 07:00:52","description":"Spoilers ahead for the \"Past Perfect\" episode of Castle Rock. Henry Deaver didn't return to his hometown on Castle Rock just to take on a peculiar case. The town's mythology is intertwined in his own mysterious past. How are Henry and the Kid…","filename":"data/vaneerConsumption/HowAreHenryTheKidConnectedOnCastleRockTheirStrangeRelationshipIsMassivelyImportantToTheShow.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/24/9bdab642-5490-447a-8cf3-3322919b0e84-casr_106_ds_742rt.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-are-henry-the-kid-connected-on-castle-rock-their-strange-relationship-is-massively-important-to-the-show-10232091_1540949929.html","title":"How Are Henry & The Kid Connected On ‘Castle Rock’? Their Strange Relationship Is Massively Important To The Show","title_page":"How Are Henry & The Kid Connected On ‘Castle Rock’? Their Strange Relationship Is Massively Important To The Show","title_rss":"NULL","source_domain":"bustle.com","text":"Spoilers ahead for the \"Past Perfect\" episode of Castle Rock. Henry Deaver didn't return to his hometown on Castle Rock just to take on a peculiar case. The town's mythology is intertwined in his own mysterious past. How are Henry and the Kid connected on Castle Rock, however? There's clearly more than legal representation between them.\n\"I waited for you for 27 years,\" the Kid tells Henry in the Aug. 29 episode. The sentiment isn't exactly as romantic as The Notebook, but still intriguing and new information. \"I rescued you from that basement and I didn't ask for any of this.\" Wait, he did what now? This is possibly the most that the Kid has ever said out loud — aside from when he was pretending to be Ruth's ex-husband — all season. What basement? What happened to Henry out in the woods?\nIt sort of sounds like the Kid is insinuating that whatever Henry's father found in the woods, whether it was God or the Devil or some other kind of supernatural force, may have infected him way back when. That it was saving Henry that damned the Kid in whatever way. Was it after then that his powers of persuasion started? Was it after then that Dale Lacy became convinced that the Kid was Satan incarnate, and put him in the hole below Shawshank?\nPatrick Harbron/Hulu\nIt also seems like the Kid needs Henry's help with some sort of larger mission. \"I don't think he's ready yet,\" the Kid says to Molly at the end of the episode, talking about Henry. He's connected to Molly too, apparently. \"I think you can help me,\" he continues, \"because you know me.\"\nWhile feeding her her life story, the kid says he knows what posters she had on her wall and what she used to paint her nails because \"I was there.\" That could be a clue, actually. Language-wise, it's similar to the way that Molly describes her own connection with Henry. When she describes locating him in the woods, she says she was there with him. When she talks about pulling the plug on his father, she says he was there with her. Maybe the three of them have a psychic connection.\nSeacia Pavao/Hulu\nSidebar, has Molly been dead this whole time — or was the Kid looking into the future and talking about it in present tense? He seems to know what's going to happen before it does. For example, when Henry asks him where Wendell is, he glances at the door where Wendell will show up moments later. Speaking of Henry's son, he did make the comment in last week's episode that (in his augmented reality game at least) the dead don't ever die. That comment could have been foreshadowing what's going on with Molly. However, that would mean that a lot of people in Castle Rock, including a teenage drug dealer and a local news crew, would have to have second sight.\nOther than a supernatural tinnitus, Henry Deaver hasn't ever really shown any signs of powers or abilities like Molly and the Kid have. However, it's clear that he still has a lot to uncover about his past and himself. Maybe now that Henry has discovered that the Kid hasn't aged in over two decades, per Lacy's obsessive Close Encounters-esque paintings of him with various dates, Henry's memory will job and the connection between them will become more clear. Castle Rock Season 1 has started to barrel towards a conclusion, and it's seriously time for some answers.","url":"https://www.bustle.com/p/how-are-henry-the-kid-connected-on-castle-rock-their-strange-relationship-is-massively-important-to-the-show-10232091"}
