{"authors":[],"date_download":"2018-10-30 19:52:47","date_modify":"2018-10-30 19:52:47","date_publish":"2018-06-28 18:56:52","description":"Authorities accuse Natasha and Devore Bray, who are married, of running the scam while the wife worked at the Georgia Department of Juvenile Justice in DeKalb County.","filename":"data/vaneerConsumption/HowaDeKalbcoupleallegedlystole200Kthroughacarwashingscheme.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/28/Images/Capture_452x318.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_how-dekalb-coupl_012130d0e12053e5999ab287f4ab1c68__1540929167.html","title":"How a DeKalb couple allegedly stole $200K through a car washing scheme","title_page":"How a DeKalb couple allegedly stole $200K through a car washing scheme","title_rss":"NULL","source_domain":"ajc.com","text":"It started, according to the indictment, with fake bills for car washes that never happened and ended with $222,223 stolen from Georgia taxpayers.\nAuthorities accuse Natasha and Devore Bray, who are married, of running the scam while the wife worked at the Georgia Department of Juvenile Justice in DeKalb County.\nThe wife, a longtime employee, held various positions, but was over the agency’s vehicle budget in December 2014.\nThe indictment, announced this week by state Attorney General Chris Carr’s office, alleges:\nThe husband opened a bank account at Wells Fargo under the name Lowes Enterprises, which was the same name of a company that previously did work for the state. The wife then started paying the company for vehicle pressure washing and detailing.\nREAD: DeKalb Bloods gang members get long sentences for executing 2 women\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nREAD: ‘A murderer I am not’: Woman tells judge she was abused before killing\nThe services never happened, Carr alleges, but the wife paid for them through April 2017. In the process, the couple is accused of funneling $222,233 from the Lowes Enterprises account to the husband’s personal account.\nThe investigation began when a supervisor became suspicious.\nThe duo is now charged with racketeering. They were arrested earlier this week and released on bond, but couldn’t be reached for comment.\nThe attorney general said: “It is our responsibility to see that state employees discharge those duties ethically and honestly, and if they do not, we will hold them accountable.”\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/how-dekalb-couple-allegedly-stole-200k-through-car-washing-scheme/FbbknHGqguF0Rukdm0Y79J/"}
