{"authors":[],"date_download":"2018-10-31 00:04:12","date_modify":"2018-10-31 00:04:12","date_publish":"2016-09-18 00:00:00","description":"It was a deal that wasn’t supposed to cost taxpayers an extra dime. Now California’s annual tab is in the billions, and the cost keeps climbing.","filename":"data/vaneerConsumption/HowapensiondealwentwrongandcostCaliforniataxpayersbillions.json","image_url":"https://www.trbimg.com/img-57dc7421/turbine/la-pension-gap-social","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects_la-me-pension-crisis-davis-deal__789_1540944252.html","title":"How a pension deal went wrong and cost California taxpayers billions","title_page":"How a pension deal went wrong and cost California taxpayers billions - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"It was a deal that wasn’t supposed to cost taxpayers an extra dime. Now the state’s annual tab is in the billions, and the cost keeps climbing.\nWith the stroke of a pen, California Gov. Gray Davis signed legislation that gave prison guards, park rangers, Cal State professors and other state employees the kind of retirement security normally reserved for the wealthy.\nMore than 200,000 civil servants became eligible to retire at 55 — and in many cases collect more than half their highest salary for life. California Highway Patrol officers could retire at 50 and receive as much as 90% of their peak pay for as long as they lived.\nThis series is a partnership of\nProponents sold the measure in 1999 with the promise that it would impose no new costs on California taxpayers. The state employees’ pension fund, they said, would grow fast enough to pay the bill in full.\nThey were off — by billions of dollars — and taxpayers will bear the consequences for decades to come.\nThis year, state employee pensions will cost taxpayers $5.4 billion, according to the Department of Finance. That’s more than the state will spend on environmental protection, fighting wildfires and the emergency response to the drought combined.\nAnd it’s more than 30 times what the state paid for retirement benefits in 2000, before the effects of the new pension law, SB 400, had kicked in, according to data from the California Public Employees’ Retirement System.\nADVERTISEMENT\nCities, counties and school districts across California are in the same financial vise. After state workers won richer retirement benefits, unions representing teachers, police, firefighters and other local employees demanded similar benefits, and got them in many cases.\nToday, the difference between what all California government agencies have set aside for pensions and what they will eventually owe amounts to $241 billion, according to the state controller.\nDavis, who was elected in 1998 with more than $5 million in campaign contributions from public employee unions, says that if he had it to do over, he would not support the pension improvements.\n“If you’re asking me, with everything I’ve learned in the last 17 years, would I have signed SB 400…. no, I would not have signed it,” Davis, now 73, said in a recent interview at his Century City law office.\nThe law took effect in 2000, and that same year CalPERS investments were hammered by the bursting of the dot.com bubble. Eight years later, the housing market collapsed and the Great Recession set in, putting the pension fund in a deep hole.\nCalPERS had projected in 1999 that the improved benefits would cause no increase in the state’s annual pension contributions over the next 11 years. In fact, the state had to raise its payments by a total of $18 billion over that period to fill the gap, according to an analysis of CalPERS data.\nThe pension fund has not been able to catch up, even though financial markets eventually rebounded. That’s because during the lean years, older employees kept retiring and younger ones continued to build up credit toward their own pensions. Pay raises and extended lifespans have magnified the impact of the sweetened benefits.\nOne of the few voices of restraint back in 1999 belonged to Ronald Seeling, then CalPERS’ chief actuary.\nAsked to study differing scenarios for the financial markets, Seeling told the CalPERS board that if the pension fund’s investments grew at about half the projected rate of 8.25% per year on average, the consequences would be “fairly catastrophic.”\nThe warning made no discernible impression on the board, dominated by union leaders and their political allies.\n“There was no real taxpayer representation in that room,” Seeling, now retired and living in a Dallas suburb, said in a recent interview. “It was all union people. The greed was overwhelming.”\nThe enhanced benefits stand in stark contrast to the financial insecurity facing most Americans in retirement. The vast majority of private sector workers have no pensions and very little retirement savings, and will depend largely on Social Security payments, which average about $16,000 per year.\nUnion leaders say their generous pensions are preserving the middle-class dream of a comfortable retirement.\n“People should not have to work their whole life and never be able to retire,” said Dave Low, executive director of the California School Employees Assn.\n“We need to fix the system … but fixing it doesn’t mean taking secure retirements away from the last people who have them.”\nState pensions are funded by regular deductions from workers’ paychecks and contributions from the state. CalPERS invests the money to cover future benefits.\nThe employee contribution, typically determined through collective bargaining, remains fairly constant. The employer contribution fluctuates based on CalPERS investment returns.\nBy far the largest group of state workers — office workers at the Department of Motor Vehicles, the Department of Social Services and dozens of other agencies — contributed between 5% and 11% of their salary in 2015, and the state kicked in an additional 24%. To fund their more costly benefits, Highway Patrol officers contributed 11.5% of pay and the state added 42%.\nSeparately, the state pays for lifetime health insurance for retirees who worked at least 20 years.\nState agencies don’t have a say in how much they contribute toward pensions. That’s determined by CalPERS, where unions have long had considerable influence. Six of the agency’s 13 board members are chosen by public employees; the others are elected officials and their appointees.\nBy 1999, the retirement system’s investments had grown to $159 billion, from $49 billion in 1990, making it the largest public pension fund in the country and one of the largest institutional investors in the world.\nTo labor representatives and their allies on the board, the time seemed right to fix what they described as years of “benefit inequity.” They saw Davis, a Democratic former Assemblyman and state controller, as a savior after 16 years of Republican governors.\nHis predecessor, Gov. Pete Wilson, took $1.6 billion from CalPERS accounts in 1991 to help close a state budget gap. Wilson also reduced retirement benefits for new state employees, effectively creating a second class of state workers.\nIn May 1999, board members started work on what became SB 400. The state’s formula for calculating pensions had not changed in 20 years, and retirees had lost ground to inflation, according to background material prepared for the board.\nThe board invited a long list of union leaders to weigh in. They talked about fairness and about employees’ desire to be treated with respect.\nIt fell to Michael Picker, an aide to then-state Treasurer Phil Angelides who was sitting in for him that day, to raise what he called the “rainy day question.”\n“The bull market has been on such a good run for so long that I continually wake up expecting to find out that the bottom has dropped out from underneath us,” Picker said, according to meeting transcripts.\nPicker suggested the board refrain from pushing for expanded benefits until Seeling, the CalPERS actuary, had come up with best- and worst-case scenarios for investments over the next decade.\nBoard chairman William Crist, an economics professor at Cal State Stanislaus and former president of the faculty union, interrupted with sarcasm.\n“I guess the best case for the retirement system is everybody dies tonight,” Crist said, meaning the fund wouldn’t have to pay any benefits. “We could go through a modeling exercise where we make all sorts of different assumptions and make predictions, but that’s really more than I think we can expect our staff to do.”\nWilliam Crist, an economics professor at CSU Stanislaus, was chairman of the CalPERS board when it pushed for bigger state employee pensions in 1999. (Steve Yeater / For the Times)\nDespite the objection, Seeling did the analysis, considering three different scenarios.\nOne assumed that the fund’s investments earned what CalPERS was expecting, an average annual return of 8.25% over the coming decade.\nIn that case, even with improved pension benefits, the annual contribution required from taxpayers would actually go down. By Seeling’s calculations, it would hover around $650 million a year — $110 million less than the state was currently chipping in.\nA second scenario showed what would happen if the investments earned 12.1% per year on average: CalPERS would be so flush that the state would not have to contribute any money.\nThen Seeling turned to his most pessimistic assumption: investment growth of 4.4% per year, about half the rate CalPERS was expecting.\nThat would be “fairly catastrophic,” Seeling said at a May 18, 1999, meeting of the board’s benefits committee.\nThe scariest part of that scenario was a hypothetical 18% one-year loss in investment value, which would require a multi-billion-dollar bailout from taxpayers.\nThe discussion was over in a few minutes, and board members did not revisit the issue, according to meeting transcripts. That summer, they approved the benefits expansion, the legislature passed it by overwhelming margins in both houses and the governor signed the bill in September 1999.\nIn November, CalPERS executives produced an in-house video congratulating themselves, Davis and the sponsoring legislators.\nCrist appears, applauding the board for finding a way to ensure secure retirements for state employees “without imposing any additional cost on the taxpayers.”\nThe measure was “the biggest thing since sliced bread,” Perry Kenny, then president of the California State Employees Assn., says on the video.\nNo less enthusiastic were unnamed state employees interviewed on-camera. “I have so much I want to do, and I dreaded being too old to enjoy it,” says one, adding that the opportunity to retire comfortably at 55 “opens up a whole new world to me.”\nThe next year, 2000, the Dow Jones Industrial Average dropped for the first time in a decade, by 6%. The following year, it fell 7%, and then again the next year, by 17%.\nCalPERS investments lost 3% in 2008 and 24% in 2009 — wiping out $67 billion in value.\nCrist retired from the board and CSU in 2003. In 2010, his name surfaced in a pay-to-play scandal that rocked CalPERS. After retiring, he had accepted more than $800,000 from a British financial firm to help secure hundreds of millions in investments from the pension fund. Crist was not accused of wrongdoing\nHis wife said he suffered a stroke three years ago and was unable to respond to questions for this article.\nHis state pension is $112,000 per year, CalPERS records show.\nAlthough all state employees benefited from SB 400, none hit the jackpot quite like the 6,500 sworn officers then on the California Highway Patrol. Previously, their pensions had been calculated by multiplying 2% of their salary times the number of years they worked. SB 400 raised that to 3%.\nIt was an innocuous-looking change on paper, but it had a huge effect.\nCHP officers who retired in 1999 or earlier after at least 30 years on the job collected pensions averaging $62,218, according to CalPERS data.\nFor those who retired after 1999, the average pension was $96,270.\nThe average retirement age for CHP officers is 54. Someone that age without a pension who wanted to buy an annuity to generate the same income for life would have to pay more than $2.6 million, according to Fidelity Investments.\nFew Americans have that kind of nest egg.\nAbout a third of those between 55 and 64 have no retirement savings, according to Alicia Munnell, who was an economic advisor to President Bill Clinton and is now director of the Center for Retirement Research at Boston College. For those with savings, the median was $111,000 in 2013, she said.\nJon Hamm, the recently retired chief executive of the California Assn. of Highway Patrolmen, is widely regarded as the father of the “3 at 50” formula, which has been expanded to cover prison guards, police and firefighters across the state.\nJon Hamm, former head of the California Assn. of Highway Patrolmen, helped secure an earlier retirement age and bigger pensions for union members. (Steve Yeater / CALmatters)\nHamm said he now worries that “pension envy” could lead to a backlash against public employees.\n“If I was in the private sector just struggling to get by, had no dream of retiring, would I be upset?” Hamm asked during a recent interview. “Yeah. And we have to understand that’s a reality.”\nJoe Nation, a former Democratic assemblyman who teaches public policy at Stanford’s Institute for Economic Policy Research, sees the same reality bearing down on public employees. He believes their sweetened pensions are not sustainable.\n“There’s no way to close this gap without some sort of hit, or financial pain, for those employees,” he said.\nHe pointed to Detroit, where pensions were cut by nearly 7% after the city went bankrupt in 2013.\nCalifornia labor leaders insist that could not happen here because state courts have ruled that pension benefits promised on the day an employee begins work can never be reduced.\nPensions have not been cut in any of the three California cities that declared bankruptcy in recent years — Stockton, San Bernardino and Vallejo.\nBut a number of rulings in those and other California cases have paved the way for a state Supreme Court showdown on whether bankrupt cities can treat retirees like other creditors, forcing them to stand in line hoping for pennies on the dollar of what they are owed.\nNation said he has been vilified by labor leaders for suggesting public employees voluntarily surrender some of their benefits. He comes from a family of public employees and was a union representative in the 1980s when he worked as a flight attendant for Pan Am.\n“It’s hard to believe anyone would consider me anti-union,” Nation said. “I’m just a Democrat who can do math.”\nWhen the legislature considered SB 400 in 1999, Democrats championed the expansion of pension benefits. Most Republican legislators voted for it, too — a reflection of the economic optimism of the time.\nDan Pellissier, then an aide to Republican Assembly leader Scott Baugh, said he was surprised that CalPERS thought it could afford such generosity toward future retirees, himself included. But he was not inclined to doubt it.\n“It came down to everyone wanting to believe that CalPERS were masters of the universe,” said Pellissier. “I figured, who am I to substitute my judgment for theirs?”\nHe feels differently now. Pellissier is president of an advocacy group called California Pension Reform, which is seeking to curb retirement benefits.\nIn the Assembly, Democrats voted unanimously for the bill, as did 23 of 32 Republicans.\nLou Correa, then a freshman Democrat who carried the bill in the Assembly, said he fell victim to inexperience. He remembers seeing actuarial reports and assuming he’d “kicked the tires” and asked the right questions.\nCorrea, now running for Congress in Orange County’s 46th district, said he should have sought independent financial advice.\nADVERTISEMENT\nIn the Senate, it took Deborah Ortiz less than 45 seconds to pitch SB 400 to her colleagues on Sept. 10, 1999. She sponsored the bill because her Sacramento district had the most state workers.\nOrtiz recited a few changes to complicated retirement formulas and then pointed to the security staff, the sergeants-at-arms, noting their retirements would be enhanced with a yes vote.\nThe measure passed unanimously, without debate.\nOrtiz now runs a Sacramento nonprofit that resettles refugees and victims of human trafficking.\nIn a recent interview, she said CalPERS’ assurances that investments growth would cover the costs “made sense at the time,” and there was no real opposition from any of the state government’s financial analysts.\n“All of the assumptions across the board were wrong,” Ortiz said. “I don’t think it was anything nefarious. Everyone was just wrong.”\nDavis said he took “with a grain of salt” assurances that SB 400 wouldn’t cost taxpayers anything extra. Still, he recalled, CalPERS had seen steady gains in its investments and at the time had billions more than it needed to meet its obligations.\n“I believed, when I signed it, it was sustainable,” Davis said. “I knew it might take some tweaks here and there…but nobody on the planet Earth predicted we’d be going through what 2008 brought us.”\nIn 2003, months into his second term, Davis became the first California governor to be recalled from office. His successor, Arnold Schwarzenegger, tried to rein in pension costs but failed. He blamed fellow Republicans in the legislature for voting against his proposal in return for contributions from the state prison guards union.\nIn 2012, Gov. Jerry Brown, a Democrat, persuaded the legislature to raise the retirement age for new employees and reduce their benefits slightly. That will save money decades from now, when those employees retire, but it will not reduce the cost of benefits already locked in for active and retired workers.\nLawmakers blocked Brown’s broader effort to create a hybrid retirement system, with some of the state’s contribution steered to 401k accounts, which are much less costly for employers because they don’t guarantee benefits.\nBrown also failed in his bid to add independent members to state retirement boards — people with financial expertise and no ties to public employee unions.\nThe outcome didn’t surprise Ron Seeling. If the board had included truly independent financial experts in 1999 — the state treasurer and controller, he noted, are elected officials dependent on campaign contributions — they might have pushed to save the extra money from the boom years for a “rainy day,” he said.\n“They had that surplus, and there was an incredible push to spend it,” said Seeling who collects a $110,000 state pension after a 20-year career at CalPERS.\n“Politics and pensions just don’t mix. That’s all there is to it.”\nContact the reporter. Twitter: @jackdolanLAT\nReporter Judy Lin of CALmatters contributed to this report.\nCredits: Animations by Eben McCue. Graphics by Len DeGroot, Ryan Menezes and Jon Schleuss. Design by Lily Mihalik. Video by Mel Melcon.\nCalifornia's Pension Crisis: Coming next in the series Gov. Jerry Brown brokered the biggest pension rollback in California history. But how much of the problem has he really solved? Sign up for our Essential Politics newsletter to receive the next installment in your inbox Privacy policy","url":"http://www.latimes.com/projects/la-me-pension-crisis-davis-deal/?789"}
