{"authors":["Ben Spencer Medical Correspondent For The Daily Mail"],"date_download":"2018-10-22 21:05:46","date_modify":"2018-10-22 21:05:46","date_publish":"2017-04-26 01:07:40","description":"Doctors tracked 3,000 visitors to the Munich Octoberfest, and found those who drank the most were more likely to develop an abnormal heart rhythm.","filename":"data/vaneerConsumption/Howbingedrinkingdisruptsyourheartbeat.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/01D60F750000044D-0-image-a-28_1493165225710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445968_How-binge-drinking-disrupts-heartbeat_1540242346.html","title":"How binge drinking disrupts your heartbeat","title_page":"How binge drinking disrupts your heartbeat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Binge drinking can cause an irregular heartbeat, experts have found.\nDoctors tracked 3,000 visitors to the Munich Octoberfest, and found those who drank the most were more likely to develop an abnormal heart rhythm.\nThe problem, called cardiac arrhythmia, occurs while people are drinking - a problem dubbed 'holiday heart syndrome'.\nThe experts found that even young, slim, healthy people were at risk.\nThe problem, called cardiac arrhythmia, occurs while people are drinking - a problem dubbed 'holiday heart syndrome'\nAnd while most did not immediately show symptoms, any alteration of heart beat can cause severe health problems in later life.\nThe research, published in the European Heart Journal, is the first study to investigate the link between acute alcohol consumption and cardiac arrhythmias in a large number of people while they were actually drinking.\nAll studies until now have asked people to remember at some point afterwards how much they had drunk - an approach with obvious accuracy drawbacks.\nThe researchers, from University Hospital Munich, used breathalysers to monitor alcohol consumption and a small electrocardiogram - or ECG - monitor to track the impact on the heart.\nThey found the participants, who had an average age of 35, had a blood alcohol level of up to 3g per litre of blood - six times over the drink-driving limit, brought on by drinking at least 12 pints of beer.\nThe researchers found cardiac arrhythmias in an astonishing 30.5 per cent of the participants - compared to a normal population level of between 1 and 4 per cent.\nAnd the risk increased with the levels patients had drunk.\nFor every four pints of beer consumed the likelihood of a cardiac arrhythmia increased by 75 per cent.\nResearcher Dr Stefan Brunner said: 'Three grams of alcohol per kilogram of blood reflects a very high alcohol intake, approaching the border of intoxication, and not many people can tolerate it.\n'For comparison, the legal driving limit in Germany is set at 0.5g/kg.'\nHe added: 'Our research is continuing and several follow-up studies are under way.\n'In particular, we plan to better quantify the autonomic imbalance induced by acute alcohol consumption, and to perform long-term ECG recording to see if atrial fibrillation or other sustained arrhythmias occur after acute alcohol consumption.'\nAll studies until now have asked people to remember at some point afterwards how much they had drunk - an approach with obvious accuracy drawbacks\nThe researchers said the arrhythmias detected during the Octoberfest were probably temporary and once the participants had sobered up, their hearts would return to normal.\nHowever, they don't know this as they only conducted the ECGs once while people were drinking.\nBut the authors say if a person has, for example, an already diseased heart, then the arrhythmia triggered by the alcohol could persist afterwards.\n'But this cannot be answered finally by our study and will require further research,' Dr Brunner said.","url":"https://www.dailymail.co.uk/news/article-4445968/How-binge-drinking-disrupts-heartbeat.html"}
