{"authors":["Barbara J. King"],"date_download":"2018-10-21 03:30:46","date_modify":"2018-10-21 03:30:46","date_publish":"2018-07-26 19:12:26","description":"Ben Goldfarb makes a strong case on behalf of the troublemaking rodent in “Eager.”","filename":"data/vaneerConsumption/Howbeaverscansavetheworldfromenvironmentalruin.json","image_url":"https://www.washingtonpost.com/resizer/teOosAGyjh4sWB48J64ISmMzwYI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ITGOIAUPNMI6RN3J4P77C7YGRE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-beavers-can-sav_e44133923b05750a9a7a4c134eab8654_7d7f9caa-53c9-11e8-a551-5b648abe29ef_story_1540092646.html","title":"How beavers can save the world from environmental ruin","title_page":"How beavers can save the world from environmental ruin - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Barbara J. King is emerita professor of anthropology at the College of William and Mary and the author of six books about animals, including “How Animals Grieve.”\nA 50-pound male beaver is transported to a creek near Ellensburg, Wash., in 2014. Under a program in central Washington, nuisance beavers are being trapped and relocated to the headwaters of the Yakima River where biologists hope their dams help restore water systems used by salmon, other animals and people. (AP Photo/Manuel Valdes)\nBeavers, those paddle-tailed, buck-toothed dam-builders we know from local ponds and streams, create chaos. They pull down trees, cause creeks to flood and generally confound the human need for order and control. But in his new book, “Eager,” environmental journalist Ben Goldfarb makes a convincing case that we should change our view of this tumultuous behavior and recognize it for exactly what it is: animal engineering capable of restoring our ailing environment.\nSubtitled “The Surprising, Secret Life of Beavers and Why They Matter,” the book shows the many contributions of this oily-coated rodent. Beavers create wetlands and make conditions favorable for many animals to thrive. Beaver ponds and meadows store carbon, which keeps it out of the atmosphere and thus helps counteract the rising temperatures associated with global warming. We must, Goldfarb contends, overcome our penchant for seeing beavers as pests — and too often killing them as a result — and instead recognize them as “the ultimate keystone species,” indeed as “the animal that doubles as an ecosystem.”\nHistorically, beavers and their constructions thoroughly clogged rivers; even New York’s Times Square was once “a rodent-impounded maple swamp.” Westward e xplorers complained about being forced to use deep-water channels for navigation because of the handiwork of beavers. Despite this hardship, Meriwether Lewis of the Lewis and Clark expedition struck a rare note of admiration, writing in an 1805 journal entry of impressive five-foot beaver dams on the Jefferson River in Montana.\nBeaver populations gradually diminished through a “three-century killing spree” that began in the 1500s and was exacerbated by demand for fur coats and hats. The ecological results were disastrous. “The disappearance of beavers,” Goldfarb writes, “dried up wetlands and meadows, hastened erosion, altered the course of countless streams, and imperiled water-loving fish, fowl, and amphibians.”\nWhere beavers are reintroduced and left to do their dam-building best, the positive effects on ecosystems may be considerable. To document these transformations, Goldfarb treks all over the United States, from Western wilderness areas to Walmart parking lots. In Washington state, under the direction of a biologist, he hikes up a creek to help release a pair called Sandy and Chomper to their new home. He attends the 10th Annual Martinez Beaver festival in California, where he interviews numerous “Beaver Believer” ecologists and activists, including inventors of flow-device tools that partially drain ponds or prevent beavers from damming up culverts and washing out roads, and thus save beavers’ lives. The result is a book that’s a most unexpected gift: a marvelously humor-laced page-turner about the science of semi-aquatic rodents.\nGoldfarb concedes that it’s impossible to return to the golden age of a “magnificently ponded world” before widespread beaver trapping. But he shows how we can deploy nonlethal beaver management strategies, and relocate the animals to ailing habitats and let them do their thing. Consider what’s happened in Yellowstone National Park in the past few decades. Yes, the wolves reintroduced to the park in 1995 get the credit in viral news stories and videos about the “trophic cascade” in which the movement patterns of elk shifted, allowing aspen and willow to regenerate and creeks to deepen and thrive. What goes missing in this picture, though? Beavers, relocated first to the nearby Absaroka-Beartooth Wilderness Area and eventually emergent in Yellowstone. Their story usurped by the flashier wolves, the beavers significantly aid the willows’ regrowth; the trees’ roots are kept wet by way of beaver dams.\nElsewhere, beavers counteract some of the worst pollution from agriculture and ­fossil-fuel emissions. Along Maryland’s coastal plains, the presence of beavers means reduced pollutants like phosphorus and nitrogen. In Colorado’s Rocky Mountain National Park, “active beaver complexes” on 27 streams stored carbon in amounts equivalent to what 37,000 acres of American forest can do. Despite myths to the contrary, beaver dams don’t much impede fish navigation on rivers; most fish figure out a workaround. In fact, in beaver habitats, numbers zoom of the tiny invertebrates that make for fish food.\nUnfortunately, enlightened policy toward beavers is in short supply. In 2016 alone, Goldfarb reports, the Wildlife Services arm of the U.S. Department of Agriculture killed 21,184 beavers. Washington state has become “the country’s most sizzling hotbed of castor relocation” because of a 2012 bill that promotes the live trapping and relocation of these animals. Yet even here, recreational trappers and people whose careers involve killing “nuisance” wildlife ensure the demise of more than 2,500 beavers annually. Even in the Beaver State, Oregon, the situation is dismal. Activism on behalf of beavers is starting to turn around these prejudices in some places, but progress is slow.\nGoldfarb’s evident affection for beavers shines through the book. When he goes one-on-one with beavers, their individual personalities come through. Occasionally he gets carried away, as when he claims that because of intense wildlife management, Yellowstone’s animal residents are “hardly more self-willed than the orcas at SeaWorld.” Measure those orca tanks, and I doubt you will find that statement close to credible.\nBut here’s the take-home message: Goldfarb has built a masterpiece of a treatise on the natural world, how that world stands now and how it could be in the future if we protect beaver populations. He gives us abundant reasons to respect environment-restoring beavers and their behaviors, for their own good and for ours.","url":"https://www.washingtonpost.com/outlook/how-beavers-can-save-the-world-from-environmental-ruin/2018/07/26/7d7f9caa-53c9-11e8-a551-5b648abe29ef_story.html"}
