{"authors":["Ben Christopher","Guest Commentary","Dan Walters"],"date_download":"2018-10-30 22:47:31","date_modify":"2018-10-30 22:47:31","date_publish":"2018-08-10 18:53:10","description":"Where do all those gasoline taxes and car fees you pay actually go? We tried to answer that question. Believe it or not, this interactive data octopus is the simple version.","filename":"data/vaneerConsumption/HowdoesCaliforniareallyspendyourgastaxdollarsSeeforyourself.json","image_url":"https://calmatters.org/wp-content/uploads/Screen-Shot-2018-08-10-at-11.23.55-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939651.html","title":"How does California really spend your gas tax dollars? See for yourself.","title_page":"How does California really spend your gas tax dollars? See for yourself. | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The political battle over Proposition 6 boils down to a simple question: Where do all those gasoline taxes and car fees you pay actually go?\nWe tried to answer that question here. Believe it or not, this is the simple version.\nTo fully appreciate how the state of California spends its road, highway, and transit dollars in all its mind-boggling complexity, consider this chart put together by the California Department of Transportation.\nIn our version above, we’ve excluded license fees and other car registration taxes that don’t go toward roads, highways, trains, buses, and anything else that actually helps move people from one place to another. If you want to find out how the state funds the Department of Motor Vehicles, that is a whole other graphic—and a whole other controversy.\nWhat’s left are the excise and sales taxes you pay when you fill up at the pump, commercial truck weight fees, and a new annual “transportation improvement fee” that was introduced as part of last year’s major transportation funding package. These are the payments that all drivers chip in and which are legally required to be used for transportation purposes. But as you can see, it’s a little more complicated than that.\nBecause all of these fees are channeled through the state budget where they are intermingled with other sources, slosh from one fund to the next, before being diverted to specific programs, it can get tricky to say exactly which dollars are going where. (Imagine tracking a cup of water from the top of a water fountain to the bottom.) To come up with our estimate, we assumed that each funding source is distributed evenly across each fund unless specifically earmarked. For example, if gas tax money makes up 50 percent of a particular budgetary account (along with, say money from the federal government or other parts of the state budget), then we assume that for every dollar the fund spends on a given program, 50 cents come from the gas tax. In short: what you’re seeing here isn’t all state transportation spending, it’s just a depiction of how your gas taxes and car fees are spent.\nAnd if you’re interested in the new taxes and fees—the ones that Proposition 6 would eliminate, those are the ones that are color-coded in CALmatters orange.","url":"https://calmatters.org/articles/how-california-really-spends-gas-tax-dollars-dataviz/"}
