{"authors":["Chris Arnold"],"date_download":"2018-10-23 05:53:27","date_modify":"2018-10-23 05:53:27","date_publish":"2015-11-13 00:00:00","description":"Participating in a 401(k) with automatic deductions makes it fairly easy to put away money. But what can you do if your employer doesn't offer a retirement plan? Experts share tips on going it alone.","filename":"data/vaneerConsumption/HowDoYouStartSavingYourTaxRefundMayBeTheAnswer.json","image_url":"https://media.npr.org/assets/img/2015/11/12/alex-w-beets_wide-e46ba5940bf6ec634ebcb8f8c1b895f47606a845.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_13_455798610_how-do-you-start-saving-your-tax-refund-may-be-the-answer_1540274007.html","title":"How Do You Start Saving? Your Tax Refund May Be The Answer","title_page":"How Do You Start Saving? Your Tax Refund May Be The Answer : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How Do You Start Saving? Your Tax Refund May Be The Answer\nEnlarge this image toggle caption Chris Arnold/NPR Chris Arnold/NPR\nMany Americans feel they can't save any money for the future. Yet if an employer automatically enrolls workers in a 401(k) plan and matches some of their contributions, 90 percent of people stick with it and save and invest for retirement.\nNow, what if your employer doesn't do that for you? What can you do? People in NPR's new Your Money and Your Life Facebook group wanted to know.\nAlex Browning, 26, works at Green Meadows Farm in Hamilton, Mass. \"There isn't a savings benefit plan and there isn't a lot of room to breathe financially,\" she says.\nBoth she and her co-worker Erin Feeney said they joined the Facebook group because they know they have to figure this out for themselves. \"I've always had short-term, nonprofit work since I finished college and none of those jobs offer any kind of savings benefits at all,\" Feeney says. \"That's kinda scary. I know I have to start a Roth IRA but what do I have to do to do that? I don't know.\"\nOn Your Own\nWe decided to answer this question: What's the best way to set up a retirement account on your own — and in a way that you're likely to keep contributing money to it?\n\"The most important thing is to get started,\" says Brigitte Madrian, a behavioral economist and professor at Harvard University. \"The biggest mistake that people make is procrastination.\"\nBut the most important thing is also the hardest thing. This is why it's such a huge advantage if an employer enrolls you automatically. Left to our own devices, we humans have a bunch of what are called \"behavioral biases\" that get in the way.\n'We're Focused On The Present'\n\"The term that I think applies best is 'present biased,' \" Madrian says. \"We're focused on the present and less focused on things that will make us better off in the future.\" That's a big reason that we tend to be so bad at saving. More than half of U.S. households have precariously low savings.\nAnother problem is there's no deadline to give us a kick in the pants to set up a retirement account, like there is with paying our taxes, for example. We'd never get around to doing that if we didn't have the federal government forcing us to do it by April 15.\nBut, Madrian says there are good ways to nudge yourself into starting a good retirement account.\n\"There's a lot of research that plan-making can help people follow through on their good intentions,\" she says. \"And the research suggests that the more concrete is your plan, the more likely you are to be successful.\"\nMake A Plan\nMadrian says people should make a plan about when they're going to open, for example, an IRA or a Roth IRA and exactly how they are going to do that. Telling friends about it, too, creates some social pressure. Research shows that helps your chances of following through.\nShe suggests taking all or half of your tax refund when it comes to open your first retirement account — or for that matter your first 529 college savings plan. That's a great way to make a plan with a deadline, Madrian says.\nAnother issue is how much money you need to have saved up in order to open a retirement account. What's the minimum investment?\n\"The good news is things have modernized tremendously,\" says Stephany Kirkpatrick, a vice president at LearnVest, a low-cost online financial advice company.\nSet It To Automatic\nKirkpatrick says some companies require a minimum of $1,000 or $3,000 to get started. But, she says, others have much lower minimum investments. She says that's \"more on the roboadviser side of things to enable you to put in a very minimum amount — sometimes $10 a week, $25 a month — on an automated basis.\"\nKirkpatrick and Madrian both say that whatever account you set up, making the savings automatic is key. That makes your do-it-yourself IRA feel a lot more like a 401(k), Kirkpatrick says. \"That's why we like it. It's automated. We don't have to think about it.\"\nAnd she says that makes it much more likely we'll keep squirreling away money each week or month. \"The behavioral economics here are really key,\" Kirkpatrick says.\nAll of the investing experts and economists we interviewed for this series also stressed the importance of finding investments with low fees. Many said you should try to keep total annual fees below 0.5 percent in any investment account (401(k), IRA, 529, etc.). There's more information about that in our profile of investment guru Jack Bogle and our sample portfolios page.\nIf you want more help with all of this, you can join the NPR Your Money and Your Life Facebook group. Madrian says she'll help nudge people to follow through on a pledge to set up smart, successful investment accounts.","url":"https://www.npr.org/2015/11/13/455798610/how-do-you-start-saving-your-tax-refund-may-be-the-answer"}
