{"authors":["Ephraim Hardcastle For The Daily Mail"],"date_download":"2018-10-22 21:40:36","date_modify":"2018-10-22 21:40:36","date_publish":"2017-03-16 01:53:07","description":"When's President Donald Trump (pictured) visiting us? An option under consideration is for him to turn up with little public notice, thus minimising the time available to protesters.","filename":"data/vaneerConsumption/HowDonaldTrumpcouldarrivewithlittlepublicnotice.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/04821139000003E8-0-image-a-28_1489629115323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-4318648_EPHRAIM-HARDCASTLE-s-President-Trump-visiting-us_1540244436.html","title":"How Donald Trump could arrive with little public notice","title_page":"How Donald Trump could arrive with little public notice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When's President Donald Trump visiting us? An option under consideration is for him to turn up with little public notice, thus minimising the time available to protesters.\nFor the same reason, most of his time here would be behind closed doors at Buckingham Palace and the US Embassy.\nIt would resemble more an official visit than a full state visit – an option Theresa May was advised to go for in the first place.\nAn option under consideration is for Donald Trump (pictured) to turn up with little public notice, thus minimising the time available to protesters\nDame Joan Collins has made clear (here in the Mail) her disapproval of BBC presenter Michael Buerk, who, interviewing her for Radio Times, asked impertinently: 'Has age (she's 83) made you calmer?' Now Buerk tells a mutual friend his only regret is that Radio Times cut out his best line: 'I said that calling Joan Collins a diva is like describing a dwarf as short.'\nPrince William's ill-advised skiing jaunt, missing the Commonwealth Day service, has wrong-footed his inexperienced team of advisers. They've brought forward details of other royal engagements to counter 'workshy William' claims. 'Now their biggest task is to ensure that the prince – who is notoriously Press-averse – smiles occasionally during his visit on Friday to Paris,' whispers a source.\nSir Mick Jagger's former muse Marianne Faithfull, 70, says she's never liked Morocco, reflecting in the rock magazine Uncut about pop music's links there: 'Maybe it was just too decadent. If only I'd not gone to all these opium-smoking, coke-snorting parties… I fell in with the wrong crowd.' Be that as it may, the French have awarded her their Legion d'Honneur.\nSir Mick Jagger's former muse Marianne Faithfull, 70, (pictured together) says she's never liked Morocco\nApropos William and Kate missing the Commonwealth Day service, the excuse offered by their staff – that they'd attended for the last two years, will probably attend again, so took a year off – dismays some courtiers. They point out that the Queen has missed only one, in 2013, because of gastroenteritis.\nHow fortunate that students at the London School of Economics are to be treated to movie star Angelina Jolie's first lecture as a visiting professor at the university's Centre for Women, Peace and Security. No mention was made of her academic qualifications. Ms Jolie has recalled that she belonged to a school gang called the Kissy Girls, who bestowed unsolicited smooches on boys and dropped out of high school. In other words, she attended the university of life.\nHollywood actress Angelina Jolie (pictured) gave her first lecture at the London School of Economics this week\nStill dining out on his single outing as James Bond in 1969, caddish George Lazenby now blames the movie's stuntmen for his failure to bed co-star Dame Diana Rigg. Speaking in a new TV documentary about his role in On Her Majesty's Secret Service, Lazenby, now 77, claims Dame Diana, 78, fancied an offscreen affair with him but changed her mind – 'that was the end of that!' – after catching him canoodling in a tent with the Bond cast's hotel receptionist.","url":"https://www.dailymail.co.uk/debate/article-4318648/EPHRAIM-HARDCASTLE-s-President-Trump-visiting-us.html"}
