{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:03:36","date_modify":"2018-10-30 23:03:36","date_publish":"2016-02-10 08:00:00","description":"Several times in the last year, Assemblyman Eric Linder (R-Corona) pushed the green “Yes” button on his desk when most of his Republican colleagues","filename":"data/vaneerConsumption/HowdidEricLinderwintheleftandtheright.json","image_url":"https://calmatters.org/wp-content/uploads/Dababneh_Linder.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940616.html","title":"How did Eric Linder win the left and the right?","title_page":"How did Eric Linder win the left and the right? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Several times in the last year, Assemblyman Eric Linder (R-Corona) pushed the green “Yes” button on his desk when most of his Republican colleagues pressed “No.”\nHe broke from his party to vote for labor-backed bills requiring more disclosure of health care rates, new layoff protections for civil servants and a system for workers to collect unpaid wages from employers.\nThose votes, along with his efforts to mediate a labor dispute at a hospital in his Riverside County district, helped Linder earn an unusual distinction last month: he’s the first Republican in more than 20 years to get the endorsement of the Service Employees International Union.\nCalifornia’s largest public employee union supports tax increases and government spending, so it usually finds more in common with Democrats. Its endorsement of Linder – the son of a Mexican immigrant who first won election pledging not to raise taxes – has left some politicos scratching their heads, and others wondering if it signals an emerging trend of labor making nice with the GOP.\n“He is the kind of guy who is going to start changing the Republican Party,” said SEIU’s political director, Alma Hernandez. “We’re willing to spend money and help good Republicans get elected.”\nThe endorsement comes as power dynamics are shifting in the state Capitol, where the political middle appears to be growing. In the past, business interests lined up behind Republicans, while labor unions largely supported Democrats. But now, business-backed Democrats wield significant power and Republicans are pleased that one of their own is endorsed by labor.\n“We have to reach out to all Californians,” said Assembly Republican Leader Chad Mayes (R-Yucca Valley). “Even though we’ve got groups that don’t agree with us 100 percent of the time, if we can agree some of the time that’s great.”\nLinder, 37, represents a blurring of political lines, having received support from both the liberal SEIU and, in earlier campaigns, the conservative Koch brothers.\n“I’ve been told by so many people that this is good for us, it’s good for me, and I think it’s good for the SEIU too,” Linder said of the endorsement.\nRepublicans hold a 5-point advantage in his district, but voters in 2012 went for Barack Obama.\nThe union’s decision is a blow to Linder’s Democratic challenger, Sabrina Cervantes, who’s been endorsed by the Legislature’s Latino caucus and some local unions, but trails Linder in fundraising. Asked about SEIU’s choice, Cervantes emphasized her support from labor.\n“We’ve done very well in receiving a number of labor endorsements thus far,” she said.\nBecause SEIU is so big – it has 700,000 members in California – its endorsement of Linder could have a spillover effect and lead other unions to back him as well. Linder’s is one of three legislative races where the United Food and Commercial Workers is considering endorsing a Republican, said executive director James Araby.\n“We’re not going to endorse a Republican just to endorse a Republican,” Araby said. “They are going to have to want a relationship with us and think about how they can best represent our members.”\nUnions have backed Republicans in the past, but not in large numbers. The California Labor Federation endorsed one Republican in legislative contests during each of the last two general elections.\nLinder became a father at age 16, was a punk-rock drummer in his 20s, and landed in the Legislature at age 34 never having held elective office. He didn’t go to college, instead following his father into the title insurance business directly after high school. During a recent memorial speech to his father on the Assembly floor, Linder reminisced about their shared love of music and talking politics over beers at his dad’s retirement home in Mexico.\nLinder grew up speaking English at home in Riverside County, but speaks Spanish well enough to talk about Republican transportation policy proposals on Spanish-language TV. His Latino heritage has helped Linder develop “broad-based support beyond the traditional Republican base,” said Riverside County Republican Party Chairman Scott Mann.\nLinder’s career in politics grew out of his years as a Republican activist, said Jon Fleischman, a former director of the state GOP who helped Linder launch his first run for office in 2012. Linder signed Grover Norquist’s “Taxpayer Protection Pledge” in Fleischman’s office during his first campaign.\n“Eric is a consistent conservative Republican whose political goals are the opposite of the SEIU’s. So it’s odd to me,” Fleischman said of the endorsement. “It doesn’t make sense.”\nLinder didn’t seek SEIU’s support during his first two elections. In 2012 and 2014, he received donations from conservative stalwarts: the Howard Jarvis Taxpayers Association, which opposes new taxes, and Koch Industries, the Kansas-based company owned by billionaire brothers Charles and David Koch.\nTo earn SEIU’s endorsement this year, Linder attended a forum with union members and completed its candidate questionnaire. The union would not make the questionnaire public, but said it’s a pared-down version of what it used in 2014. That one asks candidates to pledge support for workers who are organizing a union, commit to working with SEIU to develop legislation, and state their “revenue-generating ideas” for funding public services.\n“There may have been one question on Prop. 13 and I said, ‘I’m a Republican because I believe in holding the line on taxes.’ I was very honest about that and up front,” Linder said.\nHe attributed the endorsement to his effort to help resolve a labor dispute at the Parkview Community Hospital in Riverside, where workers voted to join SEIU and hospital executives questioned the validity of the union’s election.\n“I intervened and I said, hey, if I can help bring all parties to the table as a neutral third person who can put pressure on both sides to sit down and work things out, I was glad to do it,” Linder said.\n“I don’t think they had ever had that kind of approach, maybe, with a Republican before.”","url":"https://calmatters.org/articles/how-did-eric-linder-win-the-left-and-the-right/"}
