{"authors":[],"date_download":"2018-10-30 01:05:18","date_modify":"2018-10-30 01:05:18","date_publish":"2015-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/HowDoDemocratsRankObamasPresidency.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_how_do_democrats_rank_obamas_presidency_1540861518.html","title":"How Do Democrats Rank Obama's Presidency?","title_page":"How Do Democrats Rank Obama's Presidency?","title_rss":"NULL","source_domain":"americanthinker.com","text":"How Do Democrats Rank Obama's Presidency?\nHighly regarded presidential scholar William Leuchtenburg told UNC- TV book show host and columnist DG Martin he has been asked more and more lately to size up Barack Obama's term in office. His tepid opinion of the president's reign reflects the disappointment by his Democrat friends that the first black president did not meet -- or exceed -- the liberal standard of government largesse established by FDR, Lechtenburg's most well-known subject Lechtenburg says Obama is going to fit into the middling range. \"Nobody is going to regard him as a great or near great president. What I'm struck by whenever I talk to fellow historians and to friends who are well-informed, most of them enthusiastic Democrats, all of whom voted for Obama both times, is a sense of disappointment\".\nFDR's New Deal during the Great Depression set the gold standard for Democratic Party policy. Ever since, Democrats -- and the country -- remain in the thrall of progressive ideals and government interference into individual and business privacy. To Lechtenburg and his fellow Democrats, there are excuses for Obama's failure to attain FDR's vaunted status, pointing out that he was impeded by bad press (that will be disputed since Obama was given a free ride by the media), the Republicans in Congress, and the mood of the country turning against excessive federal involvement in civic affairs. Despite these alleged reasons for his limp presidency, Lechtenburrg does come up with three accomplishments by Obama: “First, he brought the country out of the deep economic chaos that he inherited from the second George Bush. Second, in a very perilous world situation, he made no major blunders. He made no commitments overseas with the kind of disastrous results that the second George Bush had in Iraq. And third, he extended the great benefits of health insurance to millions of Americans who weren't covered\". Only a true-blue yellow dog Democrat like Lechtenburger could make lemonade out of the lemons Obama threw at the financial crisis. First of all, Obama had little concept of the U.S. economy, much less how to fix it. He did not understand the reality that over 90% of American businesses generate less than one million in revenue annually. By surrounded himself with macro-economists, who espoused London School of Economics theory that defines the business world by major sectors, Obama ignored the reality that this is a nation of small businesses. If the haughty global gurus would look out their window on 1-95 in DC, and note the small business vans and trucks, rather than attend a Morgan Stanley cocktail party (as Lechtenburg did), they would see economic reality much more clearly. Obama charged ahead with programs he should have delayed until the economy was back on its feet. The combination of big government spending and a recession has led to a record deficit of $19 trillion and a flaccid recovery.Largely due to his failure to offer tax breaks and rebates to small businesses and middle-class taxpayers, the recovery has been more painful than positive -- and has inflicted seven long years of false hopes and uncertainty for most Americans. Obama's failure to lead the country out of this despair has left the U.S. economy in the hands of the Federal Reserve. The Fed is keeping the entire economic edifice from collapsing by printing more money to buy U.S. government debt at nearly zero interest, so-called \"quantitative easing\". The idea is to drive investments out of cash and bonds into equities seeking a return, thus goosing up the stock market to give the false impression all is well. Obama will be leaving a legacy of disaster when the Fed finally pulls the plug and equities crash -- hardly the positive legacy Lechtenburg claims for Obama. Lechtenburg's opinion that Obama's second accomplishment, to have avoided blunders of diplomacy and keeping us from committing troops in foreign wars, is a disingenuous piece of folderol. Obama let the warring tribes in Afghanistan know exactly when the U.S. is pulling out and removed U.S. forces from Iraq immediately, resulting in the rise of the Islamic State of Syria and the Levant (ISIL), a lethal development in the Middle East. In reality, Obama's blunders of foreign policy range from Benghazi to Tel Aviv to Teheran. His third accomplishment, says Lechentenburg, is he \"extended the great benefits of health insurance to millions of Americans who weren't covered\". That's a reach, with the jury of public opinion still not in favor. Ironically, ObamaCare is forcing Americans who previously received free medical care to pay. Additionally, health care is gradually becoming entirely run by government, health insurance companies are fearful about the money they are losing, and there is a sense of dread on the part of existing insurance customers that a committee of bureaucrats will decide what care they receive. Lechtenburg makes the point that a black candidate winning the presidency is the story -- not what he did in office .\" It may be\", said Lechenburg,\"that Obama will be remembered less that he was the first man of color in the White House, than that his race mattered so little in the end.” At least the end is nigh.","url":"https://www.americanthinker.com/blog/2015/05/how_do_democrats_rank_obamas_presidency.html"}
