{"authors":["Prashanth Perumal"],"date_download":"2018-10-30 23:35:29","date_modify":"2018-10-30 23:35:29","date_publish":"2016-12-06 00:00:00","description":null,"filename":"data/vaneerConsumption/HowDougHaynesmovedfrombeingMcKinseyconsultanttoPoint72.json","image_url":"https://amp.businessinsider.com/images/5845c6d4e02ba7d73c8b6b2a-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_how-doug-haynes-moved-from-being-mckinsey-consultant-to-point72-2016-12_1540942529.html","title":"How Doug Haynes moved from being McKinsey consultant to Point72","title_page":"    How Doug Haynes moved from being McKinsey consultant to Point72 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Doug Haynes, president of Point72 Asset Management, didn't have his sights set on a career in the hedge fund business.\nBut that's where he ended after a call from legendary money manager Steven Cohen in late-2013.\nIn a recent interview with Skiddy von Stade of OneWire, Haynes explained his career transition from mechanical engineering to programming for the CIA, and then into McKinsey before eventually ending up at Point72.\n\"If you have a career in consulting, there's an age by which if you don't retire from being a consultant, you will retire as a consultant,\" Haynes said. \"Once you pass a certain tenure, it doesn't make sense to leave the profession, you don't have enough runway left to go do something else and build that new set of skills.\"\nHaynes, after considering retirement twice, finally took the decision to retire from the firm.\n\"I decided I'm gonna make the jump. A couple of my friends had done so and were very happy and I just felt like it was right for me, so I retired.\"\nAt the time, Steve Cohen had just closed down his hedge fund SAC Capital following an insider trading investigation, and launched Point72, a family office. He called Haynes just before Christmas in 2013, asking him to put together a McKinsey team. Cohen hadn't heard about Haynes' retirement.\n\"He says 'I need you to put together a McKinsey team,' and I said 'Tell me about it.' He says 'We've exited all of our outside capital, and we've had a bunch of change, and downsized the firm. We've made all these big changes, and we really need to reset the firm. I want a new strategy,'\" Haynes recalled.\n\"I said that is a great idea. It would be an even better idea if I hadn't retired six weeks ago,\" he replied.\nIn the end, Cohen asked him to join the firm as an adviser.\n\"We had an explicit agreement that I would do that between six and 12 months, whatever [time] it took to get a strategy in place and [then] I would go on to do whatever it is that I was going to do next.\"\nHaynes joined the firm as managing director of human capital in February 2014, but became Point72's president six months later. \"I came as the head of human capital but pretty quickly that mandate spread to touch a lot of different aspects of the firm, and then six months later [Cohen] ends up offering me the opportunity to be president.\"","url":"https://www.businessinsider.com/how-doug-haynes-moved-from-being-mckinsey-consultant-to-point72-2016-12"}
