{"authors":["Peter Over","Jim Zarroli"],"date_download":"2018-10-23 05:49:03","date_modify":"2018-10-23 05:49:03","date_publish":"2017-01-28 00:00:00","description":"The executive action targets seven majority-Muslim countries, but not six others where the president's private businesses are engaged.","filename":"data/vaneerConsumption/HowDoesTrumpsImmigrationFreezeSquareWithHisBusinessInterests.json","image_url":"https://media.npr.org/assets/img/2017/01/28/gettyimages-632867424_wide-c059ca860906b3b4374d578f58b41eda78a1c6d0.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_28_511996783_how-does-trumps-immigration-freeze-square-with-his-business-interests_1540273743.html","title":"How Does Trump's Immigration Freeze Square With His Business Interests?","title_page":"As Trump Restricts Visitors From Some Majority-Muslim Countries, His Family Does Business In Others : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How Does Trump's Immigration Freeze Square With His Business Interests?\nEnlarge this image toggle caption Olivier Douliery-Pool/Getty Images Olivier Douliery-Pool/Getty Images\nEven as President Trump takes steps to restrict visitors from some majority-Muslim countries, he and his family continue to do business in some of the others.\nEthics experts question whether that might indicate conflicts between Trump's business interests and his role as U.S. president.\nThe executive action, \"Protecting The Nation From Foreign Terrorist Entry Into The United States,\" targets seven nations: Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen. Trump has no business interests in those countries.\nOne other thing they have in common, as NPR's Greg Myre writes: \"No Muslim extremist from any of these places has carried out a fatal attack in the U.S. in more than two decades.\"\nThe 19 terrorists in the Sept. 11 attacks were from Saudi Arabia, Egypt, Lebanon and the United Arab Emirates, Myre points out. They are among the Muslim-majority countries not affected by Trump's immigration freeze, but where Trump does business.\nHe has significant commercial interests in Turkey and Azerbaijan, is developing properties in Indonesia and Dubai, and has formed companies in Egypt and Saudi Arabia. His daughter Ivanka said in 2015 that the company was looking at \"multiple opportunities in Dubai, Abu Dhabi, Qatar, Saudi Arabia — the four areas where we are seeing the most interest.\"\nCritics said it appears that Trump is picking favorites, overlooking terrorist links in countries such as Saudi Arabia and Turkey that have their own history of terrorism.\nAnd there appear to be conflict-of-interest questions, which could raise legal and constitutional concerns for the Trump White House.\nNorman Eisen, a former ethics adviser to President Obama and a current fellow in governance studies at the Brookings Institution, told NPR in an interview:\n\"I don't believe that our Constitution allows the president to order State Department and other U.S. government employees to discriminate between otherwise identical people, favoring those from countries he likes because they give him unconstitutional foreign emoluments, and punishing those from other countries that do not pay such personal and illegal tribute to him.\"\nEmoluments are gifts. A provision of the U.S. Constitution, called the emoluments clause, prohibits U.S. officials from taking gifts of value from foreign officials or governments.\nEisen said of Trump: \"Normally he would, of course, have freer rein legally in these foreign policy, immigration and refugee matters, but his open and notorious violation of the Constitution changes that. This is the corrupt misconduct of a medieval potentate, not an American president.\"\nSpeaking with NPR Friday, Eisen said the executive action may lead to lawsuits, for example by American citizens whose family members are now barred from joining them in this country. \"These decisions about who to let in and not to let into the United States can now be challenged, because there's an unconstitutional basis for the president's decision,\" he said.\nThe Institute for Policy Studies, a progressive think tank, hit the same point harder, saying Trump was \"carpet-bombing U.S. foreign policy\":","url":"https://www.npr.org/2017/01/28/511996783/how-does-trumps-immigration-freeze-square-with-his-business-interests"}
