{"authors":["Angelica Florio"],"date_download":"2018-10-31 01:48:59","date_modify":"2018-10-31 01:48:59","date_publish":"2018-09-06 14:39:56","description":"In the new horror movie The Nun, out on Sept. 7, a terrifying demon named Valak haunts the halls of a Romanian monastery. The Nun isn't the first time that Valak has made a terrifying appearance in a movie, since the shadowy spirit first appeared in…","filename":"data/vaneerConsumption/HowDoesTheNunConnectToTheConjuringThePrequelPlaysABigPartInTheHorrorSeries.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/401054e9-bfaa-42ef-949e-3832d0182778-screen-shot-2018-09-05-at-104743-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-does-the-nun-connect-to-the-conjuring-the-prequel-plays-a-big-part-in-the-horror-series-11769623_1540950539.html","title":"How Does 'The Nun' Connect To 'The Conjuring'? The Prequel Plays A Big Part In The Horror Series","title_page":"How Does 'The Nun' Connect To 'The Conjuring'? The Prequel Plays A Big Part In The Horror Series","title_rss":"NULL","source_domain":"bustle.com","text":"In the new horror movie The Nun, out on Sept. 7, a terrifying demon named Valak haunts the halls of a Romanian monastery. The Nun isn't the first time that Valak has made a terrifying appearance in a movie, since the shadowy spirit first appeared in The Conjuring 2, and it's since appeared in other Conjuring spin-off movies. Just as the Marvel Cinematic Universe includes origin stories for different superheroes, The Nun tells the origin story of one of the Conjuring universe's eeriest demons. If you're wondering how The Nun connects to The Conjuring, it's worth breaking down all of the prequels, sequels, and spin-offs that have come from the 2013 movie chronicling Ed and Lorraine Warren's paranormal investigations.\nInThe Conjuring, actors Patrick Wilson and Vera Farmiga play Ed and Lorraine Warren, respectively, who were real-life paranormal experts that went to sites of reported ghost hauntings or possessions. One of the most famous real-life haunting cases which the Warrens investigated was the Amityville Horror case that took place in 1976. The Conjuring follows the ghost-hunting couple while they explored the haunting at a family's home in the early '70s. Valak, the Nun, didn't appear in that movie, but she played a big role in The Conjuring 2, which came out in 2016.\nThe sequel followed a 1977 paranormal investigation, during which Lorraine has multiple visions of the demonic nun, and a horrifying encounter. In one of Lorraine's vision with the grey-skinned nun, Lorraine discovered wrote the demon's name, \"Valak,\" in her Bible. It turned out that Valak had appeared in Lorraine's visions to possess the ghost hunter herself, and at the end of the movie, Mrs. Warren conjures Valak by calling it by name, and she condemns it back to Hell.\nNew Line Cinema/YouTube\nEven if The Conjuring 2's end showed viewers how Valak meets its end in the Conjuring Universe, the character was just beginning to make its mark. The next time movie-goers saw the terrifying nun was in much more subtler forms in 2017's Annabelle: Creation, like in a photo in the background. The 2017 movie came out three years after the first Annabelle movie, called Annabelle. Both movies follow a haunted doll that first appeared in The Conjuring, and both Annabelle movies are prequels to The Conjuring.\nThe end credits scene of Annabelle: Creation was like an MCU post-credits scene because it previewed the upcoming installment to the Conjuring Universe. In that scene, you see Valak hauntingly walk down the halls of a monastery, presumably the one in The Nun.\nWarner Bros. Pictures on YouTube\nNow, The Nun follows a prospective nun, Sister Irene, and a priest, Father Burke, who go to the Carta Monastery in Romania to investigate a nun's suicide. The Nun takes place in 1952, while Annabelle: Creation was set in 1955. That makes The Nun a prequel to The Conjuring's prequel, and you can expect to learn a lot more about the mysterious demon, Valak, which is a real-life mythological demon. Yeah, as if just the images from the trailer of The Nun weren't scary enough, you can definitely prepare yourself to get extremely freaked out when you go see the newest addition to The Conjuring Universe.","url":"https://www.bustle.com/p/how-does-the-nun-connect-to-the-conjuring-the-prequel-plays-a-big-part-in-the-horror-series-11769623"}
