{"authors":["Marissa Lorusso"],"date_download":"2018-10-22 20:31:40","date_modify":"2018-10-22 20:31:40","date_publish":"2017-03-09 00:00:00","description":"Artists from Adele to Vagabon to First Aid Kit weighed in on women's rights and gender equality with tweets, songs and more.","filename":"data/vaneerConsumption/HowdInternationalWomensDayGoForMusicians.json","image_url":"https://media.npr.org/assets/img/2017/03/09/gettyimages-649899754_wide-884508437d94930d9c5763b7fc3b2588afb91ae4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_therecord_2017_03_09_519475755_howd-international-womens-day-go-for-musicians_1540240300.html","title":"How'd International Women's Day Go For Musicians?","title_page":"How'd International Women's Day Go For Musicians? : The Record : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How'd International Women's Day Go For Musicians?\nEnlarge this image toggle caption Elijah Nouvelage/Getty Images Elijah Nouvelage/Getty Images\nYesterday was International Women's Day, a holiday that commemorates the global fight for gender equality and women's rights. It was celebrated across the world with labor strikes, commentaries on the status of women and plenty of posts on social media. Many musicians got involved in the conversation; notably, Beyonce, Coldplay, John Legend, Madonna — among other artists and activists — signed an open letter in support of women's rights. The letter, posted by social action platform Global Citizen, calls the fight for gender equality \"the emergency and the opportunity of our time.\" Though its language about the persistent need to fight for women's rights was not particularly new, it was framed as a reaction to increasing threats faced by women in the current political climate.\nChime for Change, who sponsored the open letter, is a campaign started by Gucci to raise awareness of (and money for) women's and girls' rights. And it wasn't the only music-and-fashion collaboration of the day; Madonna released \"Her-Story,\" a deeply glamorous (if mildly tone-deaf) short film, made in collaboration with Vogue Italy, about the fight for women's equality. (These collaborations are slightly ironic, given that International Women's Day was originally organized as National Working Women's Day by the Socialist Party of America in honor of protests against working conditions in garment factors.)\nElsewhere on the internet, some of music's most famous women shared relatively benign reflections on the holiday — unsurprising in an era where women musicians are expected to give an enthusiastic \"Yes!\" whenever interviewers ask if they're feminists, but when that response is hardly ever expected to evidence substantive political engagement.\nAdele tweeted a quotation about female dominance:\nKaty Perry expressed her gratitude for the women in her life:\nNicki Minaj gave herself props for reaching a feminist milestone... kinda: she tied Aretha Franklin for most singles among women on the Billboard Hot 100:\nA post shared by Nicki Minaj (@nickiminaj) on Mar 8, 2017 at 8:53am PST\nBritney Spears took a moment to express her love for two \"of the many women who inspire\" her:\nBeyonce telegraphed her admiration for an inspiring woman, albeit one with less star power than Britney's picks. Bey shared a blog post that honored Lynn Clark, the executive director of Habitat for Humanity of Greater Baton Rouge, who has been helping to rebuild the city following a massive flood in August 2016. It's fitting, as Beyonce has family roots in Louisiana, and the state has become a cornerstone of her recent music and charity work.\nInternational Women's Day brought expressions of social media solidarity from many male artists who were happy to renew their allyship credentials — mainly by reminding fans how much they love their moms:\nThe group that organized January's post-inauguration Women's March called for a general strike on International Women's Day, aptly named \"A Day Without A Woman.\" Questions about whether musicians could or would strike are complicated and invoke larger questions about when art counts as work, what women artists' silence means and what artists owe their fans. When women's voices are already underrepresented in many areas of music, would these musicians' silence force things to shut down — as the strike intends — or further marginalize their perspectives?\nIn an interview with MTV News, Laetitia Tamko of Vagabon said, \"I'm always striking every day! I strike by existing, by demanding respect, by forcing my way into places that people make it difficult for women — all women — to be in and to thrive in. That feels like resistance, personally.\" Other artists, like Margo Price and Katie Bennett of Free Cake for Every Creature, told MTV that striking from music would be akin to silencing themselves in an industry that needs more women's voices to be heard.\nStill, some musicians publicly supported the strike. Sia, for example, posted a call to action to join on Instagram.\nA DAY WITHOUT WOMEN. #RESIST - Team Sia A post shared by SIA (@siathisisacting) on Mar 7, 2017 at 5:20pm PST\nSome musicians chose to tackle more complicated aspects of the feminist struggle. Folk duo First Aid Kit released a fiery rebuke of rape culture, called \"You Are The Problem Here.\" It's direct in its exasperation with entitled men, with lyrics like \"You are the problem here / No one made you do anything / That's not how liquor works ... And I hope you fucking suffer.\"\nYouTube\nSongwriter and activist Taina Asili released a protest song and video, called \"No Es Mi Presidente,\" about interconnected feminist struggles. In an interview with Rolling Stone, Asili explains that the video is a means of pushing back against the forces of \"white supremacy, patriarchy, the desecration of sacred sites and harm to our earth.\" The song is in both English and Spanish; Asili explains that \"as the Trump regime has taken hold, Latinos in this country are being targeted,\" so she \"wanted to use this language as a voice to express our dissent, our resistance.\"\nYouTube\nDowntown Boys's Victoria Ruiz, who has been involved with the pushback against SXSW's immigration language, shared some more terse thoughts on the racial divide in last year's election and its relation to the feminist movement.\nIn Seattle, members of Russian political punk group Pussy Riot appeared at a rally for women's economic and social equality, focused mainly on access to healthcare and union organizing rights, before playing a show later that night.\nOther musicians took International Women's Day as an opportunity to speak out about the challenges that gender inequality poses to nonbinary and trans people. Musician Mal Blum, who uses they/them pronouns, posted about the persistent misgendering they receive from the media.\nThe most inspiring and emoji-studded message of the day, though, probably — and not all that surprisingly — came from Cher.","url":"https://www.npr.org/sections/therecord/2017/03/09/519475755/howd-international-womens-day-go-for-musicians"}
