{"authors":[],"date_download":"2018-10-30 20:38:29","date_modify":"2018-10-30 20:38:29","date_publish":"2015-06-13 22:39:23","description":"The tiniest of cuts perhaps from the scratch of a fingernail. The nip of an insect or maybe a slight abrasion acquired unnoticed during the course of a normal day.","filename":"data/vaneerConsumption/HowdidthiswomangetFleshEatingBacteria.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/13/Images/photos.medleyphoto.7427503.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_hard-know-how-gw_1da90ee2e3032c1fe2a3133fcbd2e039__1540931909.html","title":"How did this woman get Flesh-Eating Bacteria?","title_page":"How did this woman get Flesh-Eating Bacteria?","title_rss":"NULL","source_domain":"ajc.com","text":"The tiniest of cuts perhaps from the scratch of a fingernail. The nip of an insect or maybe a slight abrasion acquired unnoticed during the course of a normal day.\nDoctors at Gwinnett Medical Center don’t know which, if any of these things caused 34-year-old Cindy Martinez to acquire a deadly form of bacteria that is rapidly eating away at her flesh.\nBut on Saturday, they were trying not only to pinpoint the infection’s cause but to stop its spread through Martinez’s body.\nHer husband says it started as a small pain in her shoulder. Now the Gwinnett mother could lose her limbs.\n“That seems to be the mystery at this point,” Martinez’s husband, David, told Channel 2 Action News. “We don’t know. She didn’t have any injury, and initially at home when she was feeling the pain, I looked at where the pain was at and I didn’t notice anything and that’s what’s troubling. I don’t know.\"\nThe flesh-decaying bacteria, called necrotizing fasciitis, typically comes from some kind of open wound. Three years ago Aimee Copeland, then a 24-year-old graduate student from Snellville battled a similar flesh-decaying disease after a ziplining accident. Copeland lost a leg, foot and both her hands to the disease which doctors at one point thought would claim her life. Copeland survived but went through months of intense rehabilitation to regain her mobility.\nEpidemiologists and trauma specialists say, that while there are several kinds of bacteria that could have caused the devastating infection in Martinez, a likely candidate could be the same class of bacteria that causes strep throat, a class commonly known as Group A streptococcus. The strain that causes necrotizing fasciitis is far more virulent. It can enter the body through a minor cut, abrasion or even a puncture wound left by an insect bite, said Ruth Berkelman, a professor of epidemiology at the Rollins School of Public Health at Emory University.\n“Usually when you talk with patients if you ask them if they remember having a cut or something, they say “yes,” but not always,” Berkelman said Saturday in an interview with The Atlanta Journal-Constitution. “Maybe there was an insect bite or mild abrasion they didn’t pay attention to, but it does happen when people don’t remember anything.”\nIf the outer layers of a person’s skin do not seem irritated at the outset of the infection it can easily be missed, Dr. Luttrell Toussaint, a trauma surgeon with Gwinnett Medical Group wrote in a statement to the AJC on Saturday. And if a person’s health is already compromised by an existing condition such as diabetes, obesity or an autoimmune disorder, the bacterial infection can spread rapidly, according to Toussaint. It is not known whether Cindy Martinez had any preexisting conditions that made her especially vulnerable to the infection.\nAs the bacteria spreads through the system, it announces its presence through “redness, exquisite tenderness, tense shiny skin, and rapidly progressive swelling/edema,” Toussaint wrote. “Toxins from the bacteria separate soft tissues causing crunchiness in the tissue also known as crepitus. As the infection progresses tissues can quickly progress to fulminant necrosis and gangrene in a matter of hours/days.”\nThe only way to diagnose the infection is to remove tissue and test it. Already Cindy Martinez has undergone surgery to removed dead muscle and tissue.\nDavid Martinez is wondering if doctors will have to surgically remove her hands and feet to stop the spread of the infection. Antibiotics alone often will not stop the bacteria.\nFor the past two weeks, the Gwinnett County police officer has been by his wife’s side, and took a leave of absence to do so.\n“I still have two small children who need their dad, you know? We still have normal days of life, bills and work, we have to get done,” Martinez told Channel 2.\nThe couple met as young Marines in their 20s.\n“We have two children together,” said her husband. “Our son is 5 and our daughter is 2 years old. We’ve been married for 13 years.\n“I love her more than ever before,” said Martinez.\nA GoFundMe page has been set up to help support the family.","url":"https://www.ajc.com/news/local/hard-know-how-gwinnett-woman-got-flesh-eating-bacteria/FztHcLj0CJNmuVTDcaRQPI/"}
