{"authors":["Robert Siegel","Selena Simmons-Duffin"],"date_download":"2018-10-22 21:21:30","date_modify":"2018-10-22 21:21:30","date_publish":"2017-03-07 00:00:00","description":"The story of how that population grew so large is a long one that's mostly about Mexico, and full of unintended consequences.","filename":"data/vaneerConsumption/HowDidWeGetTo11MillionUnauthorizedImmigrants.json","image_url":"https://media.npr.org/assets/img/2017/03/07/immig-promo_wide-b1ef9c1a97db4ba218e72ed14b76ea65762edc81.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_03_07_518201210_how-did-we-get-to-11-million-unauthorized-immigrants_1540243290.html","title":"How Did We Get To 11 Million Unauthorized Immigrants?","title_page":"How Did We Get To 11 Million Unauthorized Immigrants? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How Did We Get To 11 Million Unauthorized Immigrants?\nEnlarge this image toggle caption Lennox McLendon/AP Lennox McLendon/AP\nAn estimated 11 million immigrants live and work in the United States illegally. Their fate is one of the big policy questions facing the country. The story of how that population grew so large is a long one that's mostly about Mexico, and full of unintended consequences.\nPrior to the 1920s, the U.S. had few restrictions on immigration, save for a few notable exclusions.\n\"Basically, people could show up,\" says Jeffrey Passel, of the Pew Research Center.\nFor workers in Mexico, crossing into the U.S. made a lot of economic sense, then and now.\n\"That person can make seven, eight, perhaps even 10 times more than they make in Mexico,\" says Jorge Castañeda, Mexico's former foreign minister.\nAs more people came into the U.S. to find work, Mexicans became a larger percentage of the workforce.\n\"Mexican immigration is something from our grandparents' era,\" says Michael Clemens, an economist at the Center for Global Development. \"The fraction of the labor force in Kansas that was Mexican in 1929 was higher than it was in 1990. The same is true of Arizona. The same is true of New Mexico.\"\nA legal worker program\nDuring World War II, the federal government created a legal system for Mexican farmworkers to come work in the U.S. It was called the Bracero program, and its advocates were growers who wanted a ready supply of farm labor. In its peak year, it brought in 400,000 legal workers nationwide.\nCritics said the Bracero program cost American farmworkers jobs. It was problematic in other ways, too. For one, workers were bound to one employer.\n\"That person had total control over your life,\" says Doris Meissner, former commissioner for the U.S. Immigration and Naturalization Service. \"And that leads to a very unequal relationship, and it's a recipe for exploitation.\"\nAnother criticism of the program was that it was thought to depress the wages of American workers. President John F. Kennedy campaigned against the Bracero program, and his successor, Lyndon Johnson, ended it in 1965. It was not replaced.\n\"What came then was the market operating, which is people coming to the country anyway because the jobs were here, the relationships existed between Mexico and the United States, and there was limited enforcement across the Southwest border,\" Meissner says.\nWhile it was a crime to bring unauthorized migrants into the country or harbor them, under a federal law passed in 1952 it was not a crime to employ them.\nA perfect storm\nBy 1980, the number of people in the U.S. without authorization had grown to 1.5 million. That decade witnessed what Clemens calls a demographic and economic perfect storm.\nA Mexican economic crisis sent many young Mexicans looking for work, while a booming U.S. economy meant fewer young Americans were entering the workforce. By 1986, there were 3.2 million unauthorized people in the U.S., prompting action from Congress.\nThe Simpson-Mazzoli Act was introduced as a way to end illegal border crossings once and for all. It had three parts: Give amnesty to those who had been in the country for at least five years, crack down on employers who hire people who can't legally work here, and pump up border security to prevent future illegal crossings.\nPresident Reagan supported the bill and signed it into law in 1986. Three million people were granted amnesty under the Simpson-Mazzoli Act, but by 1990 the number of unauthorized immigrants was back up to 3.5 million.\n\"Border enforcement never really kicked in in any significant way until about a decade later — the mid '90s,\" Meissner says. \"Then, the real centerpiece of it, which was employer sanctions, was very weak. There was not really an effective way to enforce employer sanctions and lots of ways for both employers and workers to get around it.\"\nMoreover, those who had been in the U.S. less than five years weren't eligible for the amnesty.\n\"So those people who couldn't apply for the legalization program became the seedbed for today's 11 million,\" Meissner says.\nBoom and bust\nThe U.S enjoyed huge economic expansion through the 1990s, which sent the number of unauthorized immigrants soaring. According to the Pew Research Center, by 1995, despite increased border enforcement, the population hit 5.7 million.\nAs it became more difficult and dangerous for migrants to go back and forth between their homes in Mexico and jobs in the U.S., many of them stayed in the U.S. The growth continued, reaching 8.6 million in the year 2000.\n\"Things slowed down a little bit with the recession in 2001 to [2003],\" Passel says. \"And then the flows picked up again as the economy heated up through 2006 to [2007].\"\nIt was then that the country hit the highest number — more than 12 million.\n\"With the onset of the Great Recession, the flows ceased, pretty much, for a couple of years,\" Passel says. \"After 2009, the U.S. economy expanded, unemployment rates went down, but the unauthorized flows did not pick up again.\"\nThe number has been around 11 million for almost a decade.\n2017 snapshot\nToday, the population of unauthorized immigrants is more urban, less seasonal and less Mexican than it used to be. About 52 percent are from Mexico, and the population is less single and male than before.\n\"At this point, the unauthorized immigrant population is largely a family-based population,\" Passel says. \"About half of the unauthorized immigrant adults in the United States have U.S.-born children.\"\nAn estimated 40 percent of unauthorized immigrants did not sneak into the country; they entered legally and overstayed their visas. The work they do has changed from being strictly agricultural to a range of mostly low-wage, low-skilled jobs such as landscaping, meat rendering and back kitchen work in restaurants.\nAll Things Considered editor Andrea Hsu and intern Esteban Bustillos contributed to this report.","url":"https://www.npr.org/2017/03/07/518201210/how-did-we-get-to-11-million-unauthorized-immigrants"}
