{"authors":["Adrian Thrills For The Daily Mail"],"date_download":"2018-10-22 20:25:34","date_modify":"2018-10-22 20:25:34","date_publish":"2016-01-29 01:33:55","description":"When British musician Phil Collins found himself alone after a world tour, he passed the time by making music at home on his tape recorder.","filename":"data/vaneerConsumption/HowdivorceturnedPhilCollinsintoasuperstar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/309975E100000578-0-image-a-67_1454031228165.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422068_How-divorce-turned-Phil-Collins-superstar-Reissues-Face-Value-Sides-heartbreak-hits-bruised-ballads-defining-moment_1540239934.html","title":"How divorce turned Phil Collins into a superstar","title_page":"How divorce turned Phil Collins into a superstar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Against all odds: Fans snapped up Phil Collins’s albums\nPhil Collins: Face Value/Both Sides (Atlantic)\nVerdict: Heartbreak hits and bruised ballads, revisited\nRating:\nWhen Phil Collins found himself alone after a world tour with Genesis, he passed the time by making music at home on his tape recorder.\nThe songs, inspired by his troubled family life and created with the help of a drum machine, were ‘just doodles’ for personal, not public, consumption.\nSo what happened next took everyone by surprise. Buoyed by the response of friends, he applied polish to the tapes and released them as Face Value, assuming the album would be seen as a low-key set by a singing drummer. How wrong he was.\nNow viewed as his defining moment, that 1981 album turned Phil Collins into an improbable superstar.\nFans snapped up a record that was unlike anything he had recorded with prog-rockers Genesis. Thirty-five years on, its blend of pop, soul and jazz still seduces.\nFace Value, with 1993’s similarly introspective Both Sides, forms the first part of a series that will see all of Collins’ solo albums repackaged, on CD, vinyl and download.\nCurated by the singer, now 64, the records have been expanded and the sleeves recreated with new photos.\nThe power of Face Value lies in its immediacy. Faced with the collapse of his marriage to first wife Andrea Bertorelli, Collins bared his soul on I Missed Again, If Leaving Me Is Easy and the brooding In The Air Tonight.\nHis failed marriage looms large. Performing In The Air Tonight on Top Of The Pops, he famously placed a paint pot by his piano in a veiled reference to Andrea’s alleged fling with a decorator.\nTwelve years on, Collins’s fifth album, Both Sides, was largely forgotten as Britpop took hold, but its troubled tales (this time inspired by the end of his second marriage, to Jill Tavelman) are worth another listen.\nIn his prime: Collins in his heyday at the US leg of the 1985 Live Aid concert in Philadelphia\nA true solo effort, Both Sides has an understated power, but it lacks the commercial clout of Face Value. Highlights include ballad Everyday and the bittersweet I’ve Forgotten Everything.\nBoth of the reissued albums come with bonus discs of live recordings and out-takes available for the first time on CD.\nFace Value’s material includes a live version of In The Air Tonight, notable for the cheer that greets its thundering drum rolls.\nThere’s also an early demo of Against All Odds. ‘I didn’t think it was good enough to be on the album,’ says Phil, in his sleeve notes, of the song that became a U.S. chart-topper.\nAs for Both Sides’ bonus disc, the live material sounds dated, but there is a fine cover of Curtis Mayfield’s I’ve Been Trying.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422068/How-divorce-turned-Phil-Collins-superstar-Reissues-Face-Value-Sides-heartbreak-hits-bruised-ballads-defining-moment.html"}
