{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-23 00:49:04","date_modify":"2018-10-23 00:49:04","date_publish":"2016-01-11 10:39:17","description":"David Bowie owned a waterfront apartment in Sydney at the height of his career and he would use it as a base for outback adventures and trips to far north Queensland to visit the rainforests.","filename":"data/vaneerConsumption/HowDavidBowielivedinaSydneyapartmentfor10YEARS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B529B00000578-0-image-a-9_1452524742966.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393619_David-Bowie-history-filming-music-video-clip-Let-s-Dance-China-Girl-Sydney_1540255744.html","title":"How David Bowie lived in a Sydney apartment for 10 YEARS","title_page":"How David Bowie lived in a Sydney apartment for 10 YEARS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Bowie had a real love affair with Australia and lived in an apartment in Sydney for 10 years during which time he fell for a local waitress and immersed himself in Aboriginal culture.\nAs the world mourns the loss of the superstar, Daily Mail Australia has taken a look at Bowie's secret life Down Under and his determination to bring the country to the forefront of pop culture.\nThe flamboyant rocker owned a luxury waterfront apartment in Elizabeth Bay for a decade up until 1992, arguably the height of his career, but he would keep a low profile to avoid media attention.\nHe would stay for at least a month at a time and would often use the flat as a base for outback adventures and trips to far north Queensland to visit the rainforests.\nLove affair: David Bowie lived in an apartment in Sydney for 10 years during which time he fell for a local waitress and immersed himself in Aboriginal culture, pictured in 2004\nIconic: China Girl, released in 1983, was filmed in Sydney's Chinatown district, and featured Australian-based, New Zealand model Geeling Ng as David's on-screen love interest\nBowie first visited Australia during his 1978 Heroes World Tour, but it wasn't until he returned in 1983 that he started forging a closer relationship - filming China Girl and Let's Dance in Sydney.\nIt was while filming China Girl in 1983 that he met and fell in love with Australian-based New Zealand model Geeling Ng, whom he plucked to star as his on-screen love interest.\nDavid discovered Geeling, who is of Chinese descent, while she was working as a waitress in an Australian restaurant, before inviting her to star in his music clip.\nLocal issues: David also delved into Aboriginal rights in his film clip for the hit song Let's Dance, which was released in 1983\nHome: The flamboyant rocker owned a luxury waterfront apartment in Elizabeth Bay for a decade up until 1992, arguably the height of his career\nIn the video, the legendary crooner with different coloured blue and brown eyes is depicted lying naked on top of her writhing on the beach.\nIt didn't take long for the pair's friendship to blossom into romance off-screen.\nThe clip was banned in several countries for being sexually explicit but it later earned him an MTV award for Best Male Video in 1984.\n'Acting opposite David was terrifying, because he had a long history as a performer and I was a model and waitress', Geeling had said in an interview with The Guardian in 2013.\n'After the shoot, I got a call: 'Do you want to come to Europe with me?' I became a bit of a groupie for two weeks. I knew it was a passing phase, I was 23, we lived in different worlds, but he gave me an experience that I'll never forget,' mused Geeling.\nDavid was fascinated by Australian culture, which featured heavily in his music, particularly in his film clip for hit song Let's Dance, released in 1983.\nA love for the land Down Under: Despite his British roots, David Bowie was determined to bring the Australian landscape to the forefront of pop-culture in the Eighties\nIman Abdulmajid, who married David Bowie in 1992 (pictureed together), tweeted two powerful messages in the days leading up to the death of David Bowie\nShot using an unmistakably Australian cast, the clip also featured both rural and urban backdrops, with part of it filmed in Sydney and the other in New South Wales sheep farming outpost, Carinda.\nThe song's lyrics were about Aboriginal rights, offering David's first evidence of a hands-on socio-political venture.\nLet's Dance was also filmed in a smoke-filled public bar at the Carinda Hotel in a tiny town in western New South Wales, which has since become a pilgrimage for tourists and fans.\n'When we have tourists come through they always ask where David Bowie did the video clip,' bartender Ms Draper told the ABC.\nEd Gibbs, the co-writer and producer of the music video, said Bowie fearlessly called out any racism he witnessed while travelling around the country.\n'Nothing was holding him back in terms of what he felt he could say or not say, or how he could express himself,' Mr Gibbs said.\n'I can't imagine that many other artists like that making a statement like that at that time.\nRacy: David discovered Geeling Ng while she was working as a waitress in an Australian restaurant, before inviting her to star in his locally filmed clip. Seen here in China Girl\nRole to remember: 'Acting opposite David was terrifying, because he had a long history as a performer and I was a model and waitress', said Geeling\nDesert landscape: Shot using an unmistakably Australian cast, Let's Dance featured both rural and urban backdrops\n'But as we know he had decades of very gutsy creative behaviour throughout his life and career, right up until a few days ago when he released his latest record.'\nIn a 1983 interview with Rolling Stone, Bowie said: 'As much as I love this country, it's probably one of the most racially intolerant in the world, well in line with South Africa.'\nHe developed a fascination for Australia at the age of 12 after seeing a picture of Uluru on the cover of a Stravinsky album.\n'And I bought that particular one — I was only about 12 — because of the picture on the front and I thought — what a fantastic looking mountain or whatever that is,' he said in 2004.\n'It looked really exciting and subsequently when I read the sleeve notes, I realised it was this place in Australia and I always wanted to see it because of that.\n'I've seen it a couple of times now. It's a childhood image that stays in your mind, and it became an ambition of some kind.'\nHe fell in love with the country during his Australian concert tour in 1978, and went on to spend much of the 1980s living in Sydney.\nIdyllic: David lived in the Kincoppal apartment complex at the same time he was recording his second album with the band Tin Machine in 1989\nStunning views: During an interview with The Boston Globe, guitarist Reeves Gabrels reportedly leaned on Bowie's balcony, saying: 'I was thinking, if only my father, who died when I was 15, could see this'\nHe sold the apartment in 1992, around the same time that he married model Iman Abdulmajid\nLegend: Bowie first fell in love with the country during his Australian concert tour in 1978, and went on to spend much of the 1980s living in Sydney, pictured in 2004\n'I would come over for a month or so at a time,' he says. 'It was really, really fabulous. I loved being there. It was just a great place to be,' he told the Sydney Morning Herald.\nHe lived in the Kincoppal apartment complex at the same time he was recording his second album with the band Tin Machine in 1989.\nDuring an interview with The Boston Globe, guitarist Reeves Gabrels reportedly leaned on Bowie's balcony, saying: 'I was thinking, if only my father, who died when I was 15, could see this.\n'Here I am in Sydney, Australia, in this amazing place, in a condo owned by David Bowie, and we're about to do our second album together.'\nTo which the rock legend replied: 'I think the same thing. Probably less frequently than you, after all this time, but you don't even have to say it. I should be a shipping clerk in Brixton. I'm still amazed.'\nHe sold the apartment in 1992, around the same time that he married model Iman Abdulmajid.\nPolitical statement: The lyrics of his song Let's Dance were about Aboriginal rights, pictured is a still from the video\nHit song: Let's Dance was filmed in a smoke-filled public bar at the Carinda Hotel (pictured) in a tiny town in western New South Wales\nIconic setting: The Carinda Hotel (pictured) has since become a pilgrimage for tourists and fans\nSpeaking about the decision, he reportedly said: 'Mainly the reason being that I just wasn't getting there enough and it seems a waste of a really nice apartment.\n'I hear young Russell Crowe has a place there now. I b***** sold mine, unfortunately, because Iman and I were getting married.'\nHe only brought four of his world tours to Australia, the 1978 Low/Heroes tour, the 1983 Serious Moonlight tour, the 1987 Glass Spider tour and the 2004 A Reality Tour.\nThe performer kept a relatively low profile over the past few years, giving no hint that he was gravely ill before the announcement of his death at the age of 69.\nHe died in New York on Sunday, following an 18-month illness battle with cancer, according to his family.\nIman tweeted two powerful messages in the days leading up the artist's death.\nBowie enjoyed a glittering career spanning six decades that saw him become one of the biggest recording artists of all time.\nHe collected dozens of awards, including two Brits Awards, two Grammys and three MTV awards and transferred his artistry to film in 51 music videos.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393619/David-Bowie-history-filming-music-video-clip-Let-s-Dance-China-Girl-Sydney.html"}
