{"authors":["Jr Thorpe"],"date_download":"2018-10-31 01:43:23","date_modify":"2018-10-31 01:43:23","date_publish":"2018-09-14 15:44:37","description":"Everybody worries about how they appear when they first meet somebody new. Did they like us, did we seem smart or cool or appropriately professional or mature — the list goes on. A new study published in Psychological Science reveals that we…","filename":"data/vaneerConsumption/HowDoYouMakeAGoodFirstImpressionANewStudySaysYouProbablyMakeABetterImpactThanYouThink.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/5077c71f-7519-46ee-b451-739664f97db7-bustle_102416_290.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-do-you-make-a-good-first-impression-a-new-study-says-you-probably-make-a-better-impact-than-you-think-11876250_1540950203.html","title":"How Do You Make A Good First Impression? A New Study Says You Probably Make A Better Impact Than You Think","title_page":"How Do You Make A Good First Impression? A New Study Says You Probably Make A Better Impact Than You Think","title_rss":"NULL","source_domain":"bustle.com","text":"Everybody worries about how they appear when they first meet somebody new. Did they like us, did we seem smart or cool or appropriately professional or mature — the list goes on. A new study published in Psychological Science reveals that we shouldn't actually worry all that much about it, though. It turns out that there's a pretty serious gap between the way in which we think a first impression has gone and how much new acquaintances actually like us. The scientists call it the \"liking gap\", and it's set to make all your first dates and job interviews much easier.\nThe \"liking gap,\" the scientists observed, is a social phenomenon that creates a mismatch in every fresh social encounter. When two people meet for the first time, they're always preoccupied with how they're being perceived. And the scientists noted, over a range of experiments, that in first meetings, peoples' own ratings of how they'd appeared were much lower than the ratings their new conversational partners had given them. In other words, we're all doing way better than we think when it comes to first impressions — but we're too busy worrying about it to realize it.\n\"Our research suggests that accurately estimating how much a new conversation partner likes us — even though this a fundamental part of social life and something we have ample practice with — is a much more difficult task than we imagine,\" study authors Erica Boothby of Cornell and Gus Cooney of Harvard University said in a press release. They observed conversations in a host of settings — in the lab, in personal development workshops, in long introductory chats in dormitories — and found that the liking gap persisted in all of them. And, when it came to introductions between college roommates, the gap lasted for months.\nThe fact that the liking gap exists is weird, since humans are pretty socially aware. We pick up on extremely tiny cues from others in conversation, often in ways we don't consciously observe. By rights, we should be able to tell how much somebody else likes us when we meet them. The scientists noted, though, that when people met for the first time they stopped paying attention to subtle body signals, because they were so preoccupied with their own behavior.\n\"When it comes to social interaction and conversation, people are often hesitant, uncertain about the impression they're leaving on others, and overly critical of their own performance,\" the researchers explained.\nWhy do we feel like this? As anybody who's gone to a new school or remembers the first day of a new job will know, first impressions matter a lot. They can set the tone for interactions for a long time to come, and a study in 2017 found that glancing at a person's face for an extremely brief period of time — 33 milliseconds — is enough for most of us to start to form an opinion. Work by the Association of Psychological Science has also found that opinions about new people we develop early on, particularly negative ones, are hard to shift, even if we explicitly try to do so. We've all absorbed the knowledge that first impressions are a big deal, and that's making us so cautious that we're missing the big picture.\nThe good news is that this study provides an anxiety-busting antidote to worries about your next interview or introduction. The \"liking gap\" will mean you probably come off far better than you think you did — so take your concerns about that clumsy joke you made with a grain of salt.","url":"https://www.bustle.com/p/how-do-you-make-a-good-first-impression-a-new-study-says-you-probably-make-a-better-impact-than-you-think-11876250"}
