{"authors":[],"date_download":"2018-10-30 00:54:09","date_modify":"2018-10-30 00:54:09","date_publish":"2016-11-14 15:15:48","description":null,"filename":"data/vaneerConsumption/HowDoesYourStateRankPublicSectorLaborLaws.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/5053646886_972bc26e92_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860849.html","title":"How Does Your State Rank? Public Sector Labor Laws","title_page":"How Does Your State Rank? Public Sector Labor LawsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Twenty-two states rank an abysmal “D” or “F” for the negative impact of their public sector labor laws on taxpayers and government workers. Thirteen fare little better with a “C,” and just seven earn an “A+.” These rankings are revealed in a first-of-its-kind 50-state public sector labor report released by the Commonwealth Foundation, Pennsylvania’s free market think tank.\nTransforming Labor: A Comprehensive, Nationwide Comparison and Grading of Public Sector Labor Laws evaluates 11 key measures that directly affect taxpayers and public employees.\nThe report reveals that only ten states have some form of paycheck protection, which prevents the use of public resources to collect political contributions for government unions. Additionally, just 12 states require government union contract negotiations to be open to the public. One lone state—Wisconsin—regularly requires government unions to hold elections to continue representing members.\nPublic sector labor issues extend far beyond a state’s right-to-work status. Even highly graded states will see areas for improvement, including transparency in contract negotiations, legality of worker strikes, workers’ rights in leaving a union, and paycheck protection laws. These are reform areas that can guarantee greater protections of government workers’ freedom of association.\nPublic Sector Labor Law Report Card\nIn truth, public-sector labor laws cut to the core of our liberties, including freedom of speech and freedom of association. That’s why it’s critical that states take steps to preserve these freedoms that are often trampled by little-known statutes and obscure collective bargaining agreements.\nBut the good news is that momentum for workers’ rights is growing. While some states are embracing worker freedom through right-to-work laws, others are making negotiations over taxpayer-funded contracts more transparent, and still others are protecting workers who opt not to join a union. We fully expect this trend to continue in the coming years.\nClick here for an online, interactive comparison of state labor laws.\nTo produce the report, Commonwealth Foundation researchers combed through state-level laws, administrative codes, and regulations relating to public sector collective bargaining. Where no law or statutory provision existed, we examined local- and state-level labor agreements and used the designation “written in union contracts” to show how such matters are addressed at the negotiating table.","url":"https://spectator.org/how-does-your-state-rank-public-sector-labor-laws/"}
