{"authors":[],"date_download":"2018-10-22 22:26:34","date_modify":"2018-10-22 22:26:34","date_publish":"2014-05-10 15:10:16","description":"Since 1964, the NTSB has investigated 775 hot air balloon incidents, 70 involving fatalities. The deadliest accident occurred in Egypt in 2013.","filename":"data/vaneerConsumption/HowDeadlyisHotAirBallooningFatalitiesAreRareStatsShow.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/433921/140510-hot-air-balloons-mn-1020_d6f207a0496c89c02e06707f52c3e484.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hot-air-balloon-accident_how-deadly-hot-air-ballooning-fatalities-are-rare-stats-show-n102116_1540247194.html","title":"How Deadly is Hot Air Ballooning? Fatalities Are Rare, Stats Show","title_page":"How Deadly is Hot Air Ballooning? Fatalities Are Rare, Stats Show","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe hot air balloon that burst into flames in eastern Virginia on Friday night, presumably killing all three on board, appears to be a freak accident — and uncommon for a leisurely activity associated with color and calm.\nSince 1964, the National Transportation Safety Board has investigated 775 hot air balloon incidents in the United States, 70 involving fatalities. Sixteen people died while hot air ballooning from 2002 to 2012, the NTSB said.\n“People have been flying hot air balloons safely, since 1783 to be exact, long before the Wright Brother's first successful powered flight in 1903,” air safety expert Carl Holden told USA Today last year.\nWhile experts stress the safety of flying, some of the most deadliest hot air ballooning accidents have occurred in recent years.\nThe deadliest occurred in February 2013, when a hot air balloon caught fire while floating over Luxor, Egypt, killing 19 of the 21 on board.\nIn 2012, a hot air balloon hit a power line in New Zealand and burst into flames, killing 11 people. In 2008, a balloon caught fire in Phoenixville, Pa., killing 4 passengers.\nAll hot air balloons operated in the U.S. must be inspected annually or every 100 hours of flight time if operated commercially, according to Federal Aviation Administration rules. Hot air balloon pilots are required to successfully complete a flight review every two years.\nThe Balloon Federation of America, the official national aero club for all balloonists, acts as an organizer for the more than 50 balloon clubs in 31 states and Canada.\nFriday's accident occurred during a gathering of the Mid-Atlantic Balloon Festival in Caroline County, Va. — one of over 200 festivals that have taken place since 2013.\nThe largest festival in the world occurs every October in Albuquerque, N.M., attracting 750 balloons.\n— Mel Bailey","url":"https://www.nbcnews.com/storyline/hot-air-balloon-accident/how-deadly-hot-air-ballooning-fatalities-are-rare-stats-show-n102116"}
