{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:20","date_modify":"2018-10-23 05:25:20","date_publish":"2014-07-03 00:00:00","description":"There are more U.S. jobs now than there were before the recession. But the jobs are different — and they're in different places.","filename":"data/vaneerConsumption/HowEveryUSStateHasFaredSinceTheRecessionIn1Graph.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_07_03_327719641_how-every-u-s-state-has-fared-since-the-recession-in-1-graph_1540272320.html","title":"How Every U.S. State Has Fared Since The Recession, In 1 Graph","title_page":"How Every U.S. State Has Fared Since The Recession, In 1 Graph : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How Every U.S. State Has Fared Since The Recession, In 1 Graph\nThis spring, the U.S. finally gained back all the jobs that were lost during the recession. In other words, the number of jobs in the country is now higher than it was back in January 2008, at the beginning of the recession.\nBut the jobs are different — and they're in different places. In a handful of states, there are lots more jobs than there used to be. But in many others, there are still far fewer jobs than there were before the recession.\nWhat's going on in North Dakota and Texas? These two states have seen a boom in oil and natural gas and related industries. \"That spills over into lots of other service, professional and construction jobs,\" says Pia M. Orrenius, an economist at the Federal Reserve Bank of Dallas.\nTexas alone now has nearly 1 million more jobs than it did at the start of the recession.\nAt the other end of the spectrum are Arizona and Nevada — two states that had particularly large real estate bubbles during the boom. A massive decline in construction jobs accounts for more than half of the job losses in both states.","url":"https://www.npr.org/sections/money/2014/07/03/327719641/how-every-u-s-state-has-fared-since-the-recession-in-1-graph"}
