{"authors":["Laurel Rosenhall","Robbie Short","Guest Commentary","Dan Morain"],"date_download":"2018-10-30 22:28:53","date_modify":"2018-10-30 22:28:53","date_publish":"2018-07-26 00:28:36","description":"Gov. Jerry Brown rose to power in the 1970s expressing a passion for cleaning up politics—but hasn't demonstrated the same zeal in the sunset of his career.","filename":"data/vaneerConsumption/HoweffectiveisthepoliticalwatchdogJerryBrownhelpedcreate.json","image_url":"https://calmatters.org/wp-content/uploads/POLITICAL-WATCHDOG-e1532556479945.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938533.html","title":"How effective is the political watchdog Jerry Brown helped create?","title_page":"How effective is the political watchdog Jerry Brown helped create?| CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Jerry Brown, when he first ran for governor in 1974, was an ambitious young man with a full head of hair and a head full of ideas about how to reform government and combat corruption. As fallout from the Watergate scandal swept the nation, he promised to clean up the California Capitol—describing it as “a frat house” full of backroom deals between legislators and the lobbyists who wined and dined them.\nHow would he do it? Principally by campaigning for a ballot initiative to require public disclosure of campaign donations and limit lobbyists to spending just $10 on government officials—enough, Brown famously said, to buy “two hamburgers and a Coke.” Voters overwhelmingly approved the Political Reform Act, which also created the Fair Political Practices Commission to enforce the new rules.\nThe watchdog commission’s power has ebbed and flowed over the decades, depending largely on who’s in charge. At times, it’s rocked the political landscape by exposing campaign money laundering and illegal lobbying practices, such as the lobbyist who was fined more than $100,000 a few years ago for entertaining politicians at his house with fancy booze and cigars. At other times it’s been criticized—even by Brown himself, who sued the agency in 2000—for getting bogged down with minimal violations, missing the broader goal of instilling what he called “a deep sense of ethics.”\nNow, as the balding octogenarian nears the end of his political career, Brown is making his final marks on the watchdog panel that is one piece of the legacy he’ll leave after 16 years as California governor. He recently tapped an old friend—a woman who raised money for his 1976 presidential campaign—to lead the commission as it recovers from a spate of tumult and infighting. And he could fill one more vacancy on the five-person panel before his term is up in January.\nYet while Brown rose to power in the 1970s expressing a passion for cleaning up politics, he has not demonstrated the same zeal in the sunset of his career. The idealism of a young candidate has been replaced with the resignation of an experienced politician who seems to doubt how much the government can regulate human foibles.\n“When Jerry Brown is out of power he’s the best reformer ever. When he’s in power, he’s not as good a reformer,” said Bob Stern, who worked with Brown in writing the Political Reform Act and served as the FPPC’s first general counsel.\nBrown declined to comment for this article but said in a 2014 video that the law he championed can’t completely stop bribery and abuse of power with “human nature being what it is.”\nStill, the agency tasked with monitoring the ethics of roughly 500,000 public officials in California—from the governor down to school board and city council members—has been struggling in the last year. Commissioners were frequently at odds with each other, not only about the right way to regulate politics—but also about how to share power among themselves. The split resulted in testy exchanges at public meetings and a new rule allowing more campaign money to flow to a Democratic legislator being recalled by GOP activists.\nThe divided commission sparred over increasing its own pay and reorganizing its workload to take some power away from then-Chairwoman Jodi Remke. In an unusual move, the governor’s office stepped in to urge the commission not to overhaul the power structure. But it did anyway, right after Remke quit. Roughly a week later, another commissioner quit too, saying her new job precluded her from remaining on the panel. Its executive director recently announced she is stepping down in August.\nThrough the tumult, the agency set a record in 2017 by settling 340 cases and levying more than $1.1 million in fines on politicians, lobbyists and campaigns that ran afoul of ethics rules. Raw numbers alone do not tell how effective each commission has been at preventing corruption, because many cases concern minor infractions like filing campaign paperwork late—the political equivalent of a traffic ticket. And the commission has recently developed a massive backlog of unresolved cases—which now stands at more than 1,000—likely making it harder to tackle new complaints in a timely manner.\nNow it has a new leader who has spent many years in the political trenches but has little experience as a government regulator. Alice Germond, a longtime Democratic Party activist, took over this month to complete the term of the prior chair who resigned. The term ends early next year, when the new governor may appoint a replacement.\nGermond, 75, worked on several presidential campaigns, including Bill Clinton’s, before becoming a leader in the Democratic National Committee. She recently moved back to Los Angeles after many years in Washington, and admits she had little familiarity with the FPPC’s work until she began talking to Brown’s staff about the post.But she says she wants to elevate the agency’s profile, hoping to instill more trust in the electorate—perhaps holding meetings outside of Sacramento, she said, or partnering with colleges or good-government groups to get the word out.\n“I am a true believer in democracy and our process and I want people to feel… the excitement in participating in our system,” she said.\nGermond got her start in politics traveling the country to raise money for Brown’s presidential bid. It was 1976 and Brown had agreed to limit his fundraising in order to qualify for matching funds from the government—an approach he abandoned in later campaigns as he raised millions from special interests.\nIt’s not the only sign that Brown has changed since his early days as a crusader for political ethics. In 2014, as the Capitol was reeling from federal corruption charges against two state senators (who were later sent to prison), lawmakers passed a bill that would have made Brown’s Political Reform Act even tougher by, among other things, barring all gifts from lobbyists. Brown vetoed the bill, citing an academic essay by one of his law school professors that said politicians should avoid “the temptation to garner glory in the public eye” by passing laws meant to prove their own moral virtue.\nOf course, that’s what Brown did in 1974, when he won his first race for the state’s top office while championing the Political Reform Act—setting the stage for him to become the longest-serving governor in California history.","url":"https://calmatters.org/articles/jerry-brown-political-watchdog-fight-corruption-california/"}
