{"authors":[],"date_download":"2018-10-30 19:45:35","date_modify":"2018-10-30 19:45:35","date_publish":"2018-08-21 09:00:00","description":"Aflac President Teresa White, other women leaders give back by helping new generation through Girls Inc.'s Bold Moves","filename":"data/vaneerConsumption/HowGirlsIncsBoldMovesbenefitsleadersandtheirstudents.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/21/Images/newsEngin.22809041_tw.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_women-leaders-re_03a4c406375b6d4bb693c8550f796f18__1540928735.html","title":"How Girls Inc.'s Bold Moves benefits leaders and their students","title_page":"How Girls Inc.'s Bold Moves benefits leaders and their students","title_rss":"NULL","source_domain":"ajc.com","text":"Every Wednesday for eight weeks this summer, Ava Pittman rubbed elbows with some of the most successful and influential women Georgia has to offer.\nCpl. Angela Florence at the Columbus Police Department. Kathy Bruer, owner of Belles & Beaus Etiquette & Manners and Aflac retiree. Teresa White, the first woman and African-American to hold the title of president at Aflac.\nThey showed her what was possible. They encouraged her. They inspired her to be strong, to be smart, to be bold.\nTheir message wasn’t all that different from what Pittman, 13, had been hearing during her four years with Girls Inc., but now she was learning practical lessons about things the nonprofit only talked about: personal finance, entrepreneurship, table etiquette and college prep.\nIt might not have happened had it not been for White, founder of the Girls Inc. program she calls Bold Moves.\nFor years, White had been serving on various boards of directors, including the United Way and the River Center of the Performing Arts in Columbus. She’d also used her considerable influence and expertise to help women in her church and workplace find their place in the world. She helped them tweak their resumes to match jobs in which they were interested. She wrote letters of recommendation. She encouraged them to pursue their dreams.\nAlthough not in a formal sense, she was a mentor through and through.\nThere were plenty of people who appreciated that about her, but White never quite felt she’d given back nearly enough.\n“There was this monotony of getting up on Sunday morning, going to church, listening to the sermon, getting lunch with my husband, getting up on Monday and going to work again,” she said. “I felt very thankful for the opportunities I’d had, but I also felt ashamed because there was so much I could give to other young girls but hadn’t.”\nRELATED | Sometimes, even good students need push in right direction\nAbout the time she started to dream about the possibilities, Girls Inc. got wind of what she’d been doing and in 2015 presented her with its national Celebrating Women of Achievement Award at its annual luncheon in New York.\nShe appreciated the recognition but still wanted to do more. She began sharing her concerns with some of the women in her Aflac circle. Darcy Brito. Mary Ellen Keim. Mary Daniel. Laura Grantham.\nBy February 2015, they had a curriculum, a logo, and a name to match their dream — Bold Moves — and they agreed Girls Inc. would be the perfect place to give back.\nBy summer, they were ready to host the first class of girls ages 12-17, who gathered at a Girls Inc. campus in Columbus.\nBold Moves attendees turn to give their full attention to a speaker this summer in Columbus. CONTRIBUTED (The Atlanta Journal-Constitution)\nWhite was blown away. By the girls. By the caliber of volunteer businesswomen and community leaders who turned out to share their expertise.\nThis summer marked Bold Moves’ fourth year.\nNot bad for a girl who many would’ve thought had no future.\nTeresa White, after all, was the daughter of a single mom who couldn’t even afford to live on her own until White was a teenager. But with the help and guidance from her grandparents and members of the Dallas church she attended, she managed to stay focused, shaking off negative stereotypes of black girls.\nRELATED | Are black girls worse than white girls?\nShe graduated from high school in 1984 and then headed to the University of Texas at Arlington, where she earned a bachelor of business administration.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nIn 1988, the same year she graduated, she married her college sweetheart James White and moved to Fairbanks, Alaska, and then to Columbus, where she eventually joined Aflac.\nBut she never forgot all the people who’d helped shape her along the way, people who helped her find her voice, build her coding skills, and who steered her away from danger.\n“I’ve just always had people around me who were willing to put something in me, who helped me find myself,” she said. “Sometimes it was things they said I shouldn’t do, or go in that direction, or follow that trend.”\nHer memory of them and the role they played in her own success weighed heavily on her in 2014, when she realized she needed to do more to uplift her community.\nHad it not been for them pushing her to do her best, modeling for her a strong work ethic, her meteoric rise at Aflac might not have happened at all.\nNow, with help from another circle of women, she hoped to inspire another generation of girls to meet their full potential.\n“This is about making sure these young ladies aren’t intimidated by what life puts in front of them,” White said.\nTo date, Bold Moves has touched the lives of some 90 girls in the Columbus/Phenix City, Ala., area. And that’s not all. White has also expanded her outreach to her church, St. James AME, so men and women are able to earn their GED and attend a local technical college.\nThis year was Ava Pittman’s first attending Bold Moves.\nAva Pittman, 13, was one of more than 20 teens who attended Bold Moves this summer in Columbus. CONTRIBUTED (The Atlanta Journal-Constitution)\n“It was a good opportunity for me, especially being around girls who build you up,” she said.\nWhat she won’t likely forget anytime soon, Pittman said, is “just because you’re a woman, doesn’t mean your future is limited.”\nAnd as is always the case when we give, the benefits extend to the giver as well.\n“I thought I’d teach the girls something, but it’s been the complete opposite,” Brito said. “It’s helped me to remember the big dreamer I was as a little girl and tell the little girl in me, you can do it, too. They have reignited a fire in me and influenced me to be a better me. I have Teresa to thank for that.”\nListening, White thought about that for a moment.\n“That just fills my cup,” she said.\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/women-leaders-reignite-own-fire-while-helping-girls-find-their-way/GZ46CDgNkA6ggF0ZkeCSjJ/"}
