{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:42:37","date_modify":"2018-10-30 18:42:37","date_publish":"2017-01-12 17:10:54","description":"“Senator my belief is that we have to stay focused on a military that is so lethal that on the battlefield that it will be the enemies longest day and their worst day when they run into that force,” Gen. James Mattis says during a confirmation hearing. | Politics","filename":"data/vaneerConsumption/HowGenJamesMattisAnsweredDemocratQuestionsonGaysandWomenintheMilitary.json","image_url":"https://media.breitbart.com/media/2017/01/GettyImages-631543246.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_12__1540924957.html","title":"How Gen. James Mattis Answered Democrat Questions on Gays and Women in the Military","title_page":"How Gen. James Mattis Answered Democrat Questions on Gays and Women in the Military | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate Democrats challenged Gen. James Mattis for his previous statements questioning the decision to allow gays to serve openly in the military and to allow women to serve in combat roles.\n“Frankly, Senator, I’ve never cared much about two consenting adults and who they go to bed with,” Mattis replied, when pressed by Sen. Kirsten Gillibrand (D-NY) about homosexuals serving openly in the military.\n“Do you believe that openly serving homosexuals along with women in combat units is undermining our force?” Gillibrand continued.\n“Senator my belief is that we have to stay focused on a military that is so lethal that on the battlefield that it will be the enemy’s longest day and their worst day when they run into that force,” he said.\nMattis would not say that he changed his views, but said he had no interest in trying to roll back immediately the social policies that were enacted by previous administrations.\nHe advised that Washington bureaucrats should prepare military leaders to handle the consequences of their social directives.\n“I believe that if we are going to execute policies like this, we had better train our leaders so they can handle all things that come from a policy decided in this town,” he said.\nMattis specified that he had hundreds of women under his command serving on the front lines in the Iraq war.\n“I have no plans to oppose women in any aspect of our military,” he stated.\nMissouri Democrat Sen. Clarie McCaskill questioned how committed Mattis would be to allowing men and women to serve together in combat.\nMatts said that he would not change the physical standards required for serving in combat or the military.\n“The standards are the standards and when people meet that standards that’s the end of the discussion of that,” he said.","url":"https://www.breitbart.com/politics/2017/01/12/gen-james-mattis-answers-questions-on-gays-and-women-in-the-military/"}
