{"authors":[],"date_download":"2018-10-22 21:44:46","date_modify":"2018-10-22 21:44:46","date_publish":"2014-05-07 17:27:35","description":"Climate change may lead to crops that provide less zinc, iron and protein, a new report finds.","filename":"data/vaneerConsumption/HowGlobalWarmingMayStarveUsMoreCarbonLessNutrition.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/427751/140507-wheat-harvest-jms-1932_fda353e09f07dcad8c98db0a88f0374f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_how-global-warming-may-starve-us-more-carbon-less-nutrition-n99481_1540244686.html","title":"How Global Warming May Starve Us: More Carbon, Less Nutrition","title_page":"How Global Warming May Starve Us: More Carbon, Less Nutrition","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nClimate change may cause floods, hurricanes, droughts and severe weather, but surely it will be good for plants, right? After all, the carbon dioxide that plants thrive on will build up in the atmosphere.\nActually, that doesn’t translate into better crops, researchers reported on Wednesday. While grains such as corn, wheat and rice might grow faster and even taller, they’ll carry fewer of the nutrients that people need, such as zinc and iron.\nSo even as people have more to eat, malnutrition in the poorest regions of the world may get worse, the experts reported in the journal Nature.\n“This study is the first to resolve the question of whether rising carbon dioxide concentrations — which have been increasing steadily since the Industrial Revolution — threaten human nutrition,” said Samuel Myers of the Harvard School of Public Health, who led the study.\nJust this week, the White House issued a new report showing every region of the United States will be affected by climate change.\nAnd the rest of the world is set to suffer even more extremes.\n“Reductions in the zinc and iron content of the edible portion of these food crops will increase the risk of zinc and iron deficiencies.\"\n“The public health implications of global climate change are difficult to predict, and we expect many surprises,” Myers and colleagues added in their report. “The finding that raising atmospheric carbon dioxide lowers the nutritional value of (certain) food crops is one such surprise that we can now better predict and prepare for.”\nThe United Nations estimates that 2 billion to 3 billion people depend on the vulnerable crops for most of their zinc and iron, and many are already deficient.\n“Reductions in the zinc and iron content of the edible portion of these food crops will increase the risk of zinc and iron deficiencies across these populations and will add to the already considerable burden of disease associated with them,” the researchers noted.\nIron deficiency anemia affects child development and can cause fatigue and learning problems. Iron and zinc are also important for the immune system and people who are deficient are more vulnerable to infection.\n“You get big plants but nothing to eat.”\nMyers and colleagues gathered together all of the research they could find on the effects of climate change on food crops. While each study on its own doesn’t provide a clear answer, putting all of the results together can.\nThey found that raising levels of carbon dioxide in the atmosphere affected corn, rice, wheat and legumes such as field peas and soybeans. At carbon dioxide levels that are projected for the year 2050, wheat lost more than 9 percent of its zinc content, 5 percent of iron and 6 percent of its protein.\nHow can this be happening? It's because carbon dioxide makes many plants grow faster, says David Wolfe, a professor of plant and soil ecology at Cornell University, who was not involved in the research.","url":"https://www.nbcnews.com/health/health-news/how-global-warming-may-starve-us-more-carbon-less-nutrition-n99481"}
