{"authors":[],"date_download":"2018-10-30 21:14:12","date_modify":"2018-10-30 21:14:12","date_publish":"2015-05-04 13:03:03","description":"On Friday night, a huge, diverse coalition of video game enthusiasts descended on Local 16, a bar in Washington, DC. Feminists don't like gamers much, so |","filename":"data/vaneerConsumption/HowGamerGatecriticArthurChugotmelaid.json","image_url":"https://media.breitbart.com/media/2015/05/Screen-Shot-2015-05-03-at-11.51.45.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_05_04__1540934052.html","title":"How GamerGate critic Arthur Chu got me laid","title_page":"How GamerGate critic Arthur Chu got me laid - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Friday night, a huge, diverse coalition of video game enthusiasts descended on Local 16, a bar in Washington, DC. Feminists don’t like gamers much, so their response was to call in a bomb threat in an attempt to disrupt the evening.\nThey failed. And although, it’s true, some people are asking whether the threat came from malicious third parties, to me the finger points directly at supporters of professional idiot and Salon columnist Arthur Chu, a former Jeopardy champion who has attempted to parlay his 15 minutes of fame into a career as a far-Left agitator and wacky social justice columnist.\nHere is an email @arthur_affect sent the #GGinDC venue last night, just before his supporters called in a bomb threat pic.twitter.com/KjHRP0Jtac — Milo Yiannopoulos (@Nero) May 2, 2015\nArthur Chu describes himself as a “social justice stormtrooper” who uses the “Dark Arts” to “mindkill” himself in order to pursue his mission of being a “feminist anti-racist progressive.” Apparently, Chu’s never seen Star Wars, or he’d know what tends to happen to stormtroopers. (Dark Arts practitioners in black robes don’t fare much better in popular culture either.)\nChu spent most of the day on Friday trying to intimidate Local 16 into shutting down our meetup. He said we were a “right-wing hate group” which “celebrates… harassment of women.” Quite what the poor bar owner was to make of me, a flagrant homosexual, and Christina Hoff Sommers, a feminist scholar and registered Democrat, as leaders of this supposed hate movement is left as an exercise to the reader’s imagination.\nSadly for Chu and his supporters, Local 16 declined to eject the lesbians, blacks, transsexuals, gays and feminist professors who met up to share their love of video games and to advocate for higher standards in games journalism and a rejection of loony left-wing feminist criticism.\nAnyone still laboring under the delusion that GamerGate is a sexist, misogynistic, racist, transphobic (insert your bigotry of choice) movement would have felt deeply ashamed of themselves looking out on a room as diverse as Friday night’s.\nContrary to the uniformly straight white middle-class conferences at which social justice warriors bang on about “structural oppression,” the GamerGate meetup was packed to the rafters with ethnic and sexual minorities who came together to share their love of video games. ‎Between 200 and 300 people showed up in the end.\nShortly after midnight, someone, no doubt spurred on by the hysteria Chu had fomented on social media and by calling and emailing the venue, tweeted a bomb threat that the FBI decided might be credible. The police don’t yet know who made the threat, or why, but it seems obvious to me that it was a social justice agitator spurred on by Chu’s frothing, clownish behaviour.\nOf course, calling in threats, pulling fire alarms and killing the lights are all classic feminist strategies.\nBut then something unexpected happened. As we were waiting on the pavement outside to be let back in after the police and bomb squad had checked the building over to make sure it was safe, I got chatting to a video game fan I might not otherwise have spoken to for long. The rest, as they say, will go down in GamerGate history.\nYo @arthur_affect thx for getting me laid dude with your bomb threat. Wouldn't have met @Nero on street otherwise. pic.twitter.com/3cY2hGxY0L — Peter (@JetpackNinja) May 2, 2015\nThe GGinDC meetup was a terrific success. And even though a grotesquely irresponsible and childish person decided to‎ call in a bomb threat, attendees remained good-natured and in high spirits throughout the night.\nIt just goes to show how utterly the anti-GamerGate supporters have lost the argument. Their only method of attack now is to call in bomb threats instead of coming down for a drink and a chat to find some common ground and, who knows, maybe even have their minds changed.\nIt doesn’t surprise me that when an NPR reporter got in touch with me about the event and I told him to come down and have his prejudices challenged, he suddenly lost interest in the story. GamerGate is winning in spite of the headlines and prejudiced reporting. It’s incredible.\nAs for Arthur Chu, what can I say? Thanks for the orgasms, man! I’m just sorry there were no women in the room at the time – a clear example, I’m sure you’ll agree, of patriarchal misogynistic oppression if ever I saw one.\nAs a footnote, you might be wondering what kind of people this bomb threat, inspired by the oafish Chu, actually hurt. Thanks to my Breitbart London colleague Allum Bokhari, I can tell you: disabled lesbians. Great job, you preposterous buffoon.","url":"https://www.breitbart.com/europe/2015/05/04/how-gamergate-hater-and-social-justice-clown-arthur-chu-got-me-laid/"}
