{"authors":["Mika Doyle"],"date_download":"2018-10-31 01:38:56","date_modify":"2018-10-31 01:38:56","date_publish":"2018-08-29 16:38:29","description":"You probably wipe down the elliptical when you’re done using it, but do you let your sanitizing guard down when you get to the locker room? When you find out how gross gym locker rooms actually are, you might rethink that. FitRated, a website that…","filename":"data/vaneerConsumption/HowGrossAreGymLockerRoomsTheAmountOfGermsTheseResearchersFoundWillFloorYou.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/29/0c98fa60-dd9e-4579-9bfd-4b2c4f367bdc-fotolia_193937235_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-gross-are-gym-locker-rooms-the-amount-of-germs-these-researchers-found-will-floor-you-10933247_1540949936.html","title":"How Gross Are Gym Locker Rooms? The Amount Of Germs These Researchers Found Will Floor You","title_page":"How Gross Are Gym Locker Rooms? The Amount Of Germs These Researchers Found Will Floor You","title_rss":"NULL","source_domain":"bustle.com","text":"You probably wipe down the elliptical when you’re done using it, but do you let your sanitizing guard down when you get to the locker room? When you find out how gross gym locker rooms actually are, you might rethink that. FitRated, a website that reviews fitness equipment, conducted a study of four commercial gym locker rooms in the U.S. by collecting 15 gram and stain culture tests on various surfaces. According to FitRated, the results of the study are based on the colony-units per square inch — or the amount of bacteria that grew from the swabs they took.\nThe results were a bit vomit-inducing. According to FitRated, faucet handles, shower handles, and locker room benches all came up positive for types of bacteria that are harmful to humans, such as those that cause food poisoning or pneumonia. “The average gym faucet handle showed the highest count of bacteria, and ... a vast majority of those germs could be dangerous,” says FitRated. To give you a frame of reference, the researchers say gym locker room faucet handles had eight times more bacteria than school cafeteria water fountain spigots. Gym shower handles had seven times more bacteria than the average home kitchen sink. And locker room benches, where you park your freshly-showered tush, had six times more bacteria than an animal crate.\nAndrew Zaeh for Bustle\nA 2014 study published in the International Journal of Environmental Research and Public Health found that the most common bacteria found in public gyms is staph. However, fungal infections like athlete’s foot and ringworm, or illnesses like colds and flus are also commonly spread at the gym, says Health.com. That’s why it’s important to take health precautions both inside and outside the locker room. Marilyn Roberts, professor of environmental and occupational health sciences at the University of Washington School of Public Health, told Tonic to always wear foot protection in the gym locker room, especially when taking a shower. Roberts told Tonic you need to protect your feet from hair (including pubic hair), sweat, fungi, mold, bacteria, and urine from the 62 percent of people who say they pee in the shower on a regular basis. (*Screams internally for a thousand years*)\nIt's important to be minimize your risk of staph exposure, because an infection can lead to anything from skin issues to toxic shock syndrome, according to the Mayo Clinic. But protecting yourself from staph is actually fairly simple. According to Cleveland Clinic, staph enters the body through cuts in the skin, so cover any open wounds or cuts and minimize your contact with surfaces. That also includes benches, so maybe lay down a towel before sitting down, says Cleveland Clinic.\nYour biggest takeaway from this study shouldn’t be to cancel your gym membership immediately. Germs are everywhere, so if we let them scare us away from everyday life, we’d miss out on some pretty amazing stuff. Yes, the results are gross. But now you know how to protect yourself from icky germs that can make you sick. So the next time you hit the gym, just take precautions to avoid germs — both inside and outside the locker room.","url":"https://www.bustle.com/p/how-gross-are-gym-locker-rooms-the-amount-of-germs-these-researchers-found-will-floor-you-10933247"}
