{"authors":[],"date_download":"2018-10-30 14:32:38","date_modify":"2018-10-30 14:32:38","date_publish":"2016-10-11 18:19:00","description":"When Cobb County schools have to close, who makes the decision and how is it done?","filename":"data/vaneerConsumption/Howisthedecisionmade.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/11/29/Images/fog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cobb-school-closings-how-the-decision-made__1540909958.html","title":"How is the decision made?","title_page":"Cobb County Schools closings: How is the decision made?","title_rss":"NULL","source_domain":"ajc.com","text":"When bad weather and emergencies happen Cobb County officials must decide when to close schools. Lots of time and thought go into making that decision for the district's 112,000 students and their families.\nHere is some insight into the process, including who makes the decision, how it’s done, and how you'll know when it's made.\nFor a detailed forecast, visit The Atlanta Journal-Constitution weather page.\nWho makes the decision?\nAccording to the district's website the superintendent and administrative staff carefully watch the weather conditions during seasons of possible inclement weather. They consult with local law-enforcement, review weather reports and take into consideration that even if roads may be clear on one street, they may be dangerous in other parts of the county. The director of transportation tests the road conditions on bus routes as early as 3:30 a.m.\nThe superintendent of schools is responsible for the final decision, based all of these factors and recommendations from district staff.\nHow is the decision made?\nDistrict officials consider the following factors when deciding whether to close schools:\nInformation on road conditions from the director of transportation and from law enforcement, including whether roads are icy, flooded, or impassable;\nTime that precipitation begins to accumulate and the amount;\nWeather predictions;\nBuilding conditions (e.g., whether schools have power and heat);\nParking lot conditions;\nTemperature and wind-chill.\nWhen is the decision made and how will you know?\nThe decision is made by 5:30 a.m .— except in situations when inclement weather may force school closings during the school day — so that radio and TV stations can be notified.\nDetails will be posted immediately on the school district website and on social media such as Twitter and Facebook. Parents will also be notified through the district's automated calling system.\nRELATED Channel 2 Action News maintains a running list of school closings around metro Atlanta.\nWSB radio at 750 on the AM dial also gets the closing decision and broadcasts it.\nAnd, what if school closes during the day?\nIf school closes during the day all students will be sent home on their regular bus or daycare van unless other directions from a parent are on file. Parents should give a written explanation to a teacher of where their student should go in these situations. School staff will not accept phoned in directions for students during this time.\nParents can also sign up for texts, emails or phone notifications through the school system. Contact you local school front office to make sure that it has your most current information.","url":"https://www.ajc.com/news/local/cobb-school-closings-how-the-decision-made/nUYBkC7bgMEWs1bfDB9czL/"}
