{"authors":["Don Gonyea","Texas Sen. Ted Cruz","Speaking About Donald Trump To Donors In Leaked Audio A Closed-Door Meeting"],"date_download":"2018-10-23 01:06:52","date_modify":"2018-10-23 01:06:52","date_publish":"2015-12-15 00:00:00","description":"National security and terrorism have been a top issue for Republicans, but they have gained even more importance after the Paris and San Bernardino, Calif., attacks.","filename":"data/vaneerConsumption/HowISISParisAndSanBernardinoHaveChangedTheRepublicanRace.json","image_url":"https://media.npr.org/assets/img/2015/12/15/gettyimages-501417344_wide-0e5ba0b4c825f3c70609ebe16f03022f0cf5bbbc.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_12_15_459841998_how-isis-paris-and-san-bernardino-have-changed-the-republican-race_1540256812.html","title":"How ISIS, Paris And San Bernardino Have Changed The Republican Race","title_page":"How ISIS, Paris And San Bernardino Have Changed The Republican Race : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How ISIS, Paris And San Bernardino Have Changed The Republican Race\nEnlarge this image toggle caption Anadolu Agency/Getty Images Anadolu Agency/Getty Images\nThe Republican presidential hopefuls debate in Las Vegas Tuesday night will be the first since the terrorist attacks in Paris and in San Bernardino, Calif. In recent weeks, ISIS and how to keep Americans safe have dominated the campaign and shot to the top of Americans' concerns.\nAn NBC/Wall Street Journal poll this week found that 40 percent rated national security and terrorism as what should be the government's top priority, double those who said so in April. The issue has been a top one for Republicans for some time. But Quinnipiac found that while in November, Iowa Republicans rated the economy and jobs as the top issue with terrorism second, since the Paris and San Bernardino attacks, that has flipped.\nThe last debate — back on Nov. 10 — focused mostly on the economy. But days later, 130 were killed in terrorist attacks in Paris. Then, just weeks later, on Dec. 2, another jolt.\nA radicalized husband-and-wife couple killed more than a dozen in San Bernardino at an office party. Both shooters were Muslim. One was an American citizen; his wife came to the U.S. on a fiancee visa.\nImmediately, GOP candidates pointed fingers at President Obama, saying he didn't take terrorist threats and ISIS seriously enough.\nAfter San Bernardino, Donald Trump called for stopping all Muslims from entering the U.S., at least temporarily — \"until our country's representatives can figure out what the hell is going on.\"\nSuch tough talk from Trump was nothing new. There was his expletive-laden call to bomb ISIS even before Paris. Amid all of this Trump surged in national polls of GOP voters.\nWho am I comfortable with their finger on the button?\nOther candidates, including Marco Rubio, Jeb Bush, Chris Christie and John Kasich, called Trump unhinged, offensive and ridiculous.\nTed Cruz — who hopes to win over Trump supporters when, as he expects, Trump fades — was more mild in his critique.\n\"No, that that that is not my policy,\" he told NBC. \"I believe the focus should be on Islamic radical terrorism.\"\nSo that's the backdrop for tonight's debate.\nTrump remains on top. Ben Carson has slipped after several stumbles on foreign policy. Gaining ground is Cruz, who suddenly has a big lead in the new Des Moines Register poll in Iowa, considered the gold standard in the state. His rise is being fueled there by religious conservatives, a group he has carefully courted.\nSo Trump is now going after Cruz.\n\"I don't think he's qualified to be president,\" Trump said on Fox News Sunday, explaining, \"because I don't think he has the right temperament. I don't think he's got the right judgment.\"\nTrump got an opening from audio leaked to the New York Times of a Cruz fundraiser in which Cruz questions Trump's seriousness and judgment.\n\"Who am I comfortable with their finger on the button?\" Cruz is heard saying in one part.\nThere's also the chance for a triangle of fire. The always-on-message Marco Rubio, who serves on the Senate Foreign Relations Committee, could go after Cruz for his support of getting rid of the NSA's metadata program.\nAnd that sets the stage for a top-tier showdown.\nTuesday night is also, however, important to another candidate who has gotten a boost since the last debate: Chris Christie. The New Jersey governor was endorsed by New Hampshire's biggest newspaper, the Union Leader. Trump still leads in that state, but Christie sees an opportunity.\nOn Michael Medved's radio show, he dismissed Trump's proposed ban on Muslims.\n\"There are folks in this race who don't care about what the law says, because they're used to being able to just fire people indiscriminately on television,\" Christie jabbed.\nIn all, there will be nine candidates on the main stage; among them, Ohio Gov. John Kasich, who has been Trump's most persistent critic in the race. A superPAC supporting Kasich has a new Web ad that tries to deflate Trump's blue-collar appeal. It features Trump — and a flatulent hippopotamus.\nYouTube\n\"One bellows,\" an announcer says. \"One bellows malarkey. Donald Trump repeatedly says one thing, does another. The hypocrite says he's champion of American workers but had his line of Trump ties made in China.\"","url":"https://www.npr.org/2015/12/15/459841998/how-isis-paris-and-san-bernardino-have-changed-the-republican-race"}
