{"authors":[],"date_download":"2018-10-30 14:32:25","date_modify":"2018-10-30 14:32:25","date_publish":"2016-10-07 18:43:00","description":"Inevitably, harsh weather finds DeKalb County each year, forcing schools to make the call whether to cancel classes.","filename":"data/vaneerConsumption/Howisclosingdecisionmade.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/02/24/Images/photos.medleyphoto.6830093.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-school-closings-how-the-decision-made__1540909945.html","title":"How is closing decision made?","title_page":"DeKalb County schools: How is closing decision made?","title_rss":"NULL","source_domain":"ajc.com","text":"Inevitably, harsh weather finds DeKalb County each year, forcing schools to make the call whether to close.\nBelow are answers to common questions that arise for parents in such times.\nFor a detailed forecast, visit The Atlanta Journal-Constitution weather page.\nWho makes the decision? Superintendent Steve Green holds the power to cancel or alter schedules for DeKalb County schools. District officials say he consults with an emergency weather team that includes members of his cabinet, and is in contact overnight with such agencies as the National Weather Service, the DeKalb County Police Department, DeKalb County Emergency Management and the Georgia State Patrol.\nWhen is the decision made? The superintendent decides before 5 a.m.\nHow do parents know? The district sends the information through “all communication channels,” and word is typically broadcast in local media by 6:15 a.m., the website says. Parents, students and employees may also find out through the district website or emails and automatic calls that parents can sign up for through your school. The districts mobile app or social media, such as Twitter, also put information out. You can find DeKalb’s tweets by following @DeKalbSchools and sometimes get more precise information by checking your child’s individual school Twitter account.\nChannel 2 Action News maintains a running list of school closings around metro Atlanta.\nWSB radio also broadcasts school closings on 750 on the AM dial.\nAlso: The district says if parents feel the weather could threaten their child, the parents should keep the child home.\nSevere Weather Team 2 Meteorologist Brad Nitz reports.\n---\nYou can find information about DeKalb County schools, such as test scores, graduation rates, and school climate ratings at the Ultimate Atlanta School Guide.","url":"https://www.ajc.com/news/local/dekalb-school-closings-how-the-decision-made/zYn3tXvwH5dkULH9WMPznN/"}
