{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:46:10","date_modify":"2018-10-31 01:46:10","date_publish":"2018-09-11 17:35:32","description":"Princess Eugenie is sure to have many of her royally famous relatives in attendance at her upcoming wedding to Jack Brooksbank — one relative being Queen Elizabeth. You might be wondering, how is Princess Eugenie related to the Queen? Well, the two…","filename":"data/vaneerConsumption/HowIsPrincessEugenieRelatedToTheQueenTheseTwoRoyalsHaveACloseRelationship.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/5dffacd2-7bbc-461f-bdc7-0df2e838430e-screen-shot-2018-09-11-at-10738-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-is-princess-eugenie-related-to-the-queen-these-two-royals-have-a-close-relationship-11863188_1540950370.html","title":"How Is Princess Eugenie Related To The Queen? These Two Royals Have A Close Relationship","title_page":"How Is Princess Eugenie Related To The Queen? These Two Royals Have A Close Relationship","title_rss":"NULL","source_domain":"bustle.com","text":"Princess Eugenie is sure to have many of her royally famous relatives in attendance at her upcoming wedding to Jack Brooksbank — one relative being Queen Elizabeth. You might be wondering, how is Princess Eugenie related to the Queen? Well, the two royals actually have a close bond.\nIf you're not a royal watcher, you might be a bit surprised to learn that Eugenie has a closer connection to Elizabeth than one might think. As Time noted, Eugenie is the daughter of Prince Andrew and Sarah Ferguson, the Duchess of York. Since Andrew is the son of Elizabeth, that means that the monarch is the grandmother of the bride-to-be. What does that mean for the Princess' inclusion in the line of succession? Considering that she does have a close connection to the Queen, it makes sense that she's fairly high up, ninth in line to be exact, as it concerns the succession.\nAs previously mentioned, the Queen will right there to support her granddaughter as she marries Brooksbank. The royal family previously announced that Eugenie would marry her longtime boyfriend in an official statement from Buckingham Palace in January. The couple, who have been dating for around seven years, per People, became engaged in early January during a trip to Nicaragua.\nWPA Pool/Getty Images Entertainment/Getty Images\nIn the months leading up to their October nuptials, there have been plenty of details released about the pair's special day. As their wedding announcement detailed, they're getting married in a location that should ring familiar to all of those diehard Prince Harry and Meghan Markle fans out there. Like the Duke and Duchess of Sussex before them, Eugenie and Brooksbank will exchange vows in St. George's Chapel at Windsor Castle.\nMore recently on Sept. 11, People described many other new details about the grand affair. According to the publication, wedding guests are in for a weekend-long celebration come Oct. 12. Aside from their wedding ceremony and reception on Oct. 12, there will also be a big celebration going on at the Royal Lodge, which is near Windsor Castle, on Oct. 13. So it sounds like there's going to be a couple of chances to spot your favorite royals getting their party on.\nAdditionally, there's a ton of famous guests that will likely be in attendance right alongside the Queen and the other royals. People reported that David and Victoria Beckham, Elton John, and George and Amal Clooney all might find themselves in St. George's Chapel once again come Oct. 12.\nTristan Fewings/Getty Images Entertainment/Getty Images\nTheir wedding location isn't the only thing that Eugenie and her intended have in common with the Duke and Duchess of Sussex, though. According to Town & Country, the bride and groom-to-be currently reside in Ivy Cottage at Kensington Palace right next door to Harry and Markle's Nottingham Cottage at the estate. Thanks to their close proximity in Kensington Palace, and their similarly located weddings, it sounds like both sets of newlyweds will have a lot to bond over.\nAnd when Eugenie and Brooksbank's October nuptials finally arrive, not only will their royal neighbors be in attendance, but the Princess' grandmother, the Queen, will definitely be there, as well.","url":"https://www.bustle.com/p/how-is-princess-eugenie-related-to-the-queen-these-two-royals-have-a-close-relationship-11863188"}
