{"authors":["Julie Cart","Dan Morain","Alastair Bland"],"date_download":"2018-10-31 00:04:26","date_modify":"2018-10-31 00:04:26","date_publish":"2016-03-04 08:00:00","description":"A panel of energy experts gave mostly passing marks to California’s landmark climate change law, but raised concerns about the cost of implementing","filename":"data/vaneerConsumption/HowisCaliforniadoingonclimatechange.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944266.html","title":"How is California doing on climate change?","title_page":"How is California doing on climate change? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"A panel of energy experts gave mostly passing marks to California’s landmark climate change law, but raised concerns about the cost of implementing additional, more stringent, measures.\nIn a spirited but cordial debate Thursday night in Bakersfield, lawmakers, regulators and advocates explored the state of play in the decade since the passage of AB32, the Global Warming Solutions Act, and the increasingly complicated tradeoff between renewable energy and fossil fuels.\n“It’s wonderful to have ambitious goals, I appreciate that,” said Cathy Reheis-Boyd, president of the Western States Petroleum Assn. “Let’s not forget that these programs and policies — all meritorious — have impacts to the consumer.”\nThe forum, co-sponsored by CALmatters and the Bakersfield Californian, was attended by about 100 people at The Mark, in the heart of the state’s oil patch. The panelists agreed that the goals of the 2006 Global Warming Solutions Act — to reduce greenhouse gas emissions to 1990 levels by 2020 — would be met.\nTodd Strauss, senior director of policy planning for PG&E, said the utility already derived 30 percent of its power from renewable energy. The most recent state benchmark is 50 percent by 2030.\nWhile Dean Florez of the California Air Resources Board declared AB32 an “absolute success,” others noted that the fact the state’s power providers are on track to reach the renewable goals indicates that lawmakers set the carbon-reduction bar too low.\n“I give it an F,” said renewable energy advocate Paul Gipe, asked to grade the law. “It’s a target that was built on hype. It was unambitious. It will easily be surpassed.”\nGipe noted that much of the state’s renewable portfolio was built decades ago and new in-state generation accounts for only 14 percent, he said.\nWith the price of a barrel of oil plummeting, down to $30 from $100 a few years ago, the pace and cost of weaning California off inexpensive, carbon-heavy fuels needs to be constantly calculated, panelists said. Gov. Brown’s goal is to reduce gasoline consumption by half by 2030.\n“I think we can hit the 50 percent goal with ease,” said state Sen. Jean Fuller (R-Bakersfield). “The problem is what human behavioral changes do we want to make in our society and how much do we want to pay for it?”\nFuller said layoffs in the energy sector hit the Central Valley hard and that residents of the economically depressed region would bear the brunt of energy-reduction mandates.\nGeography and long distances between remote towns and business hubs means Kern County drivers are on the road more than motorists in urban areas, Fuller said. “How are we going to truck our groceries? How are we going to move our ag?”\nShe said San Francisco is an example of a region that might easily reduce fuel consumption. “They have a harbor next door, they don’t have to truck stuff long distances. They can use electric cars,” Fuller said.\n“Our region is going to be hit the hardest so we have to speak up the most. Can we hit [the fuel reduction goal]? Yes. Some people will hit it with very little pain. Our area will hit it with a great deal of pain.”\nNext to Hawaii, California has the nation’s highest gas tax, Reheis-Boyd said, amounting to about 60-70 cents a gallon. She warned of unintended consequences should the state’s 126 million cars go on fuel diet.\n“Our entire state infrastructure is built on the gas tax,” she said. “We haven’t figured out yet what will happen when we start to have less consumption.”","url":"https://calmatters.org/articles/how-is-california-doing-on-climate-change/"}
