{"authors":["Julie Cart","Guest Commentary","Laurel Rosenhall"],"date_download":"2018-10-30 22:59:44","date_modify":"2018-10-30 22:59:44","date_publish":"2018-07-11 21:42:25","description":"Bills to manage California energy and the state's power supply await the Legislature when it returns from a July recess.","filename":"data/vaneerConsumption/HowlegislatorsaretryingtonavigateachangingCaliforniaenergylandscape.json","image_url":"https://calmatters.org/wp-content/uploads/Transmission-lines-e1531258677524.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940384.html","title":"How legislators are trying to navigate a changing California energy landscape","title_page":"How legislators are trying to navigate a changing California energy landscape","title_rss":"NULL","source_domain":"calmatters.org","text":"(End-of-session update: The governor signed the 100 percent clean-energy proposal, the measure to allow consumers to buy power from sources other than utilities, and the bill to extend rebates on energy storage. The proposal for a regional power grid stalled, as did legislation that would have required some gas-fired power plants to report their emissions.)\nState lawmakers, faced with a transformed energy landscape and a glut of renewable power as California charges into a greener future, are considering a handful of measures to meet the state’s energy challenges.\nThe puzzle: how to align state policies with the quickly-evolving electricity world, one lawmakers are attempting to define and to decide how to regulate. Key questions include who should be allowed to distribute energy and whether to expand consumers’ choices in purchasing electricity.\nThe debate is taking place as the summer heat has been unleashed, when demand for power rises in concert with temperatures. At issue are the reliability and resiliency of the power grid–its ability to supply electricity consistently and balance itself when unexpected demand or supply arises.\nOne of the most sweeping and controversial ideas, presented as a way for California to produce and use electricity more efficiently, is chilling to some: the replacement of California’s own grid operator with a new regional authority to manage power for the entire West. The question is whether California would be giving up too much for too little.\nThe proposal , from Assemblyman Chris Holden, a Pasadena Democrat, would open a market for California’s solar power but could also loosen the state’s grip on some distribution decisions. It has been percolating for several years in one form or another and has been, to say the least, hotly debated in Sacramento.\nYes, California’s Independent System Operator in its present form would disappear. But a multi-state power authority run by a board of representatives from each participating state would operate more efficiently, better harness renewable energy and expand the state’s climate policies to its neighbors, some supporters say.\nThere are already many masters in the existing energy distribution system to dispatch power west of the Rockies. On the top of that food chain is the Federal Energy Regulatory Commission, which oversees interstate power transmission.\nHolden’s legislation would still allow California to make its own decisions about buying energy, said Kellie Smith, chief consultant to the Assembly Committee on Utilities and Energy, which Holden chairs. The new unified commission would fill a much-needed role as transmission traffic cop, she said: “We are not ceding any more authority than is there today. It’s status quo.”\nBut opponents say that California would be handing over critical decision-making power to states peddling fossil-fueled energy. They say Rocky Mountain coal states could send more dirty power to California, if they elected to participate.\n“To begin with, let me guarantee you that Wyoming and Utah have no interest in joining anything that California is part of,” Smith said. “Secondly, we already have coal coming in every day.”\nEven though California has policies requiring utilities to buy a certain amount of renewable power, it can be difficult to determine how each watt of power coming into the state was generated. A unified grid would provide needed transparency, supporters say.\nOpponents counter that the proposal would saddle California consumers with unfair costs for new transmission lines and other infrastructure outside the state. That’s one reason some labor groups oppose the bill; they’ve estimated that tens of thousands of construction jobs will be lost to other states.\nMatthew Freedman, an attorney with The Utility Reform Network, a watchdog group, applauds improvements to the transmission system. But, echoing critics who say more vetting is needed, he expressed concern that the Holden bill would be a precipitous step.\n“This is not a decision that you can undo,” Freedman said in an interview. “There are many things a state can do to try out a new policy. If it doesn’t work, we can flip it. But once you get rid of the (current system) …. You can’t put the toothpaste back in the tube.”\nThe proposal has long held the interest of Gov. Brown and carries his considerable political weight behind it.\nOther proposals in the mix include allowing industrial and commercial energy customers to cut the cord that binds them to major utilities, as well as a bid to help California reach its climate goals by fashioning a fully “clean” power supply by 2045.\nCalifornia is at the forefront of the budding consumer choice movement—ratepayers leaving behind fortress-like utilities and grouping together to buy power from alternate providers. It’s caught on in more than a dozen California cities and counties, where local governments now determine their own power mix.\nOne bill the Legislature is considering would allow commercial and industrial power customers to join the “community choice” movement, unplugging from utilities.\nThe freedom of choice would encourage competition among power providers and drive down prices, said the bill’s author, Sen. Robert Hertzberg, a Democrat from Van Nuys. The highly technical proposal has flown somewhat under the radar, and its prospects for passage are unclear.\nThe state Public Utilities Commission has already weighed in on the idea of community grids and other ad hoc arrangements. It warns in a draft report that they could leave consumers vulnerable to fly-by-night operators, stranded without power.\nIn an interview with CALmatters, commission President Michael Picker invoked the price spikes and blackouts that rolled across California during the energy crisis of 2000 after deregulation of the energy market.\n“In the last deregulation, we had a plan, however flawed,” Picker said. “Now, we are deregulating electric markets through dozens of different decisions and legislative actions, but we do not have a plan. If we are not careful, we can drift into another crisis.”\nAmong the other ideas that will be on lawmakers’ agenda when they return from recess next month is one that failed last year and has a second chance now: Sen. Kevin de León’s proposal that California use 100 percent clean power within the next 27 years.\nThe Los Angeles Democrat maintains that the state is on track to meet this accelerated goal. But his legislation is opposed by such powerful interests as the California Chamber of Commerce and the state’s three largest utilities. Legislative politics, which stymied the bill’s passage in the last session, appear to be at work again, making its prospects somewhat murky.\nUpdate: After this article was published, the Legislature passed the 100 percent clean-energy proposal, the measure to allow consumers to buy power from sources other than utilities and the bill to extend rebates on energy storage. The proposal for a regional power grid stalled, as did the legislation that would have required some gas-fired power plants to report their emissions.","url":"https://calmatters.org/articles/power-play-how-california-lawmakers-are-trying-to-navigate-a-changing-energy-landscape/"}
