{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:58:30","date_modify":"2018-10-30 21:58:30","date_publish":"2017-02-07 19:38:22","description":"A new documentary, \"Hate Spaces,\" aims to expose what it calls the the left's coalition with radical Islamic groups on campus.","filename":"data/vaneerConsumption/HowLeftistBigotryFuelsAntisemitismonCampus.json","image_url":"https://media.breitbart.com/media/2015/02/Swastikas-Facebook.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_02_07__1540936710.html","title":"How Leftist Bigotry Fuels Antisemitism on Campus","title_page":"'Hate Spaces': How Leftist Bigotry Fuels Antisemitism on Campus","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — A new documentary, Hate Spaces: The Politics of Intolerance on Campus, aims to expose what it calls the the left’s coalition with radical Islamic and antisemitic groups on college campuses throughout the United States, working together to marginalize pro-Israel students.\nThe film was released by Americans for Peace and Tolerance (APT), a Boston-based non-profit headed by Charles Jacobs. It was produced by Avi Goldwasser, a seasoned documentarian who has devoted much of his professional life to addressing this issue.\nHate Spaces claims that three leading anti-Israel groups — Students for Justice in Palestine (SJP), the Muslim Student Association (MSA), and American Muslims for Palestine (AMP) — are waging an expensive and allegedly Middle Eastern-funded campaign against the Jewish State of Israel.\n“Jewish students are under ideological assault on campuses across America and campus administrations are not protecting them. This needs to change,” Jacobs, who is also the film’s associate producer, told Breitbart News. “The Jewish civil rights movement of our time has to be to protect Jewish students on our camps and to extend to them the protections that are granted to all other minorities.” He added, “We’re trying to get laws passed that extend to Jewish kids on campuses.”\nGoldwasser is a child of Holocaust survivors who was born in Poland and immigrated to the United States. His other works include Columbia Unbecoming, which focuses on anti-Israel bias at the Ivy League school; The J Street Challenge, about the radical far-left pressure group; and The Forgotten Refugees, which is about Jews who were expelled from Arab countries.\n“Every student is entitled to a hostile-free environment,” Goldwasser said during a screening of the documentary at Kemp Mill Synagogue in Silver Spring, Maryland on Thursday. He referred to the the rise of antisemitism on college campuses as “an epidemic that’s not being recognized by Jewish leadership and the media. If this was happening to any other minority, there would be outrage.”\nHate Spaces highlights just a few of the most egregious displays of antisemitism that have taken place on American college campuses. For example, it notes that in in April 2013, Northeastern University SJP activists stormed a classroom and interrupted a Holocaust memorial service. “The lessons of the Holocaust were not learned, you are child murderers,” SJP members were caught saying on camera.\nIn 2014, SJP was briefly suspended from Northeastern University by president Joseph Aoun for slipping hundreds of anti-Israel mock eviction notices under dorm room doors.\nIn February 2015, four members of the nine-member UCLA student government voted against appointing Rachel Beyda, a female Jewish candidate for a student government body, suggesting her Jewish background deemed her unfit for the position. The students behind the attack on Beyda were active in the SJP movement.\nHate Spaces also describes what it calls a “red-green alliance” between left-wing socialists and radical Muslims to undermine the Jewish state.\nHate Spaces made its debut in New York on November 30 and will continue being screened throughout the United States until the DVD is released later in 2017.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2017/02/07/hate-spaces-how-leftist-bigotry-on-college-campuses-fuels-antisemitism/"}
