{"authors":["Emma Mcgowan"],"date_download":"2018-10-31 01:48:07","date_modify":"2018-10-31 01:48:07","date_publish":"2018-09-11 14:00:56","description":"In Bustle's Sex IDK column, certified sex educator and writer Emma McGowan answers the questions you still have about sex. No topic is off limits, and there's nothing to be embarrassed about. Think of it as the sex ed you should've had. Today's…","filename":"data/vaneerConsumption/HowLikelyAreYouToGetAnSTIHeresTheTruthAboutTransmission.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/10/c1017889-2e09-4fc4-8cac-1c5ca17d71e5-zaeh_bustle_aug2015-216.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-likely-are-you-to-get-sti-heres-the-truth-about-transmission-9969142_1540950487.html","title":"How Likely Are You To Get An STI? Here's The Truth About Transmission","title_page":"How Likely Are You To Get An STI? Here's The Truth About Transmission","title_rss":"NULL","source_domain":"bustle.com","text":"In Bustle's Sex IDK column, certified sex educator and writer Emma McGowan answers the questions you still have about sex. No topic is off limits, and there's nothing to be embarrassed about. Think of it as the sex ed you should've had. Today's topic: how the most common STIs transmitted.\nIf you had sex ed in the United States, part of your brain probably thinks that being in the same room with someone else’s naked genitals is going to give you a sexually transmitted infection (STI). And if anything sexual happens in that room, you’re definitely getting infected. Rubbing up on each other? STI. Blow jobs or cunnilingus? STI. Vaginal intercourse? STI and a baby. Butt sex? Definitely STI.\nAnd if that’s how you think about STI transmission, it’s not your fault. Because so much of our sex ed is fear-based and sex-negative, there’s a lot of misinformation about sex out there, particularly when it comes to STIs. And, unfortunately, that's the only sex ed that so many Americans get. So it's time to set the record straight on STI transmission: How it happens and how likely you are to actually get something from your partner(s).\nMy name is Emma McGowan, and I’m the new sex columnist here at Bustle. I’m an SFSI-endorsed sex educator, but I’ve been an unofficial sex educator since I was a tween, when my two best friends asked me how to give a blow job. I hadn’t actually given a blow job yet, but I didn’t want to give them bad info. So I went to the library, looked it up in books, and then supplemented that knowledge with some early-internet research.\nWhile I admire 13-year-old me’s impulse to give my friends the facts — and giving fact-based information is a value I still hold dear — these days the advice I’m dispensing is much more informed and accurate than the blow job advice I gave back then. I’ve been writing about sex, sexuality, and gender issues online for seven years. As a sex educator, I believe that everyone deserves access to science-based, non-judgmental sex information to help them integrate sex holistically and healthily into their lives.\nSo let’s talk about STIs. Fear of STIs is very, very common — and extremely overblown. The photos that most of us were shown in high school sex ed make it seem like every STI is going to engulf your genitals, causing them to rot and fall off in pieces like a Halloween zombie dripping to the floor. We’re warned about herpes and HPV and how they never go away. We’re taught that getting HIV is the end our lives, if not the end of the world.\nHere’s the reality: Human beings give each other infections. Sometimes those infections are in our sinuses and sometimes those infections are in our junk. Bacterial infections — including gonorrhea, chlamydia, and syphilis — can be cured with a quick bout of antibiotics, just like a sinus infection. Viral infections — including HPV, herpes, and HIV — can’t be cured, but can be treated and managed. And as long as an STI is caught early, the physical symptoms of most STIs are experienced as a minor inconvenience.\nThere's one important caveat here, though. Just because most infections are a minor inconvenience doesn’t mean all are. Different people’s bodies react differently to viruses and bacteria, so while one person may have a nearly microscopic blemish when they contract herpes, another might have a flare-up that leaves them with weeping wounds for a week. Additionally, some STIs (including chlamydia, gonorrhea, and syphilis) can cause infertility if not treated. So while our attitudes toward STIs are generally blown out of proportion, it’s still a good idea to use condoms to reduce your risk, get tested regularly, and get treated if you get something.\nBut the emotional element of contracting an STI? That’s a whole other story. So many people — myself included — have stories of feeling devastated when they got an STI diagnosis. That’s because of that aforementioned misinformation and fear, which also breeds stigma about STIs. When we go through life operating on incorrect info (and drenched in shame about sex), we’re bound to freak out more about an STI diagnosis — in ourselves or in a partner — than we are to freak out about a diagnosis of the flu or a sinus infection.\nSo how likely are you to actually get an STI? First things first: You can’t get an STI if the person you’re having sex with doesn’t have an STI. And I know that sounds obvious, but it’s important to acknowledge, because a lot of people do think that sex without a condom automatically means you’re going to get an STI. Remember that whole incomprehensive sex ed thing? This is that in action.\nAlso, having sex with a person who is infected with an STI does not automatically mean you’re going to get that STI. It’s very hard to gather good data on rates of transmission for each act of intercourse, but there's plenty of people who don’t get infected after having sex with someone who has an infection. However, having sex multiple times with a person who has an infection absolutely increases the likelihood that you’ll get an infection, too. Also, transmission rates vary based on the type of sex you're having (anal sex, for example, is generally higher risk because there's a greater chance of tearing). And people are more or less contagious at different points in the life cycle of the STI they have, which can also affect transmission rates.\nAnd finally, before we get into the weeds about each STI, I need to say a little bit about health disparities. Unfortunately, STI rates are not the same for every race, gender, or age. There are many, many factors that contribute to why one group may have higher rates than another group. They include, but are not limited to: the physical sex acts they’re likely to engage in, access to health care, access to barrier methods (like condoms), access to sexual education, likelihood of sexual assault, and likelihood of multiple partners. So when you read that men are more likely than women or African Americans are more likely than Latinx people to have a certain STI, please keep in mind that it’s not a judgment on that group, but actually a combination of very complex social factors.\nSo, here are some of the most common STIs and how they're transmitted.\n1 Gonorrhea Ashley Batz/Bustle Gonorrhea is a bacterial infection, and it’s one of the most common STIs in the United States. It can be spread via oral, vaginal, or anal sex, which means condoms are very good protection against it. Untreated, gonorrhea can cause infertility (especially in people with uteruses) but it’s easily treated with antibiotics. Women who have sex with men are at a higher risk of contracting gonorrhea if they have sex with an infected person than men who have sex with women are. The highest risk group, however, is men who have sex with men. That’s because gonorrhea bacteria likes to get in those mucus membranes and both anuses and vaginas are very receptive mucus membranes. According to the CDC, the highest rates of infections are in sexually active teens, young adults, and African Americans.\n2 Chlamydia Ashley Batz/Bustle Chlamydia is the most common bacterial STI in the United States. And, once again, condoms are your friend, because chlamydia is spread via oral, anal, and vaginal intercourse. Untreated, chlamydia can cause infertility (especially in people with uteruses), but it’s easily treated with antibiotics. Young people are at a much higher risk of chlamydia than older people. According to the CDC, almost two-thirds of the estimated 2.86 million new chlamydia infections each year are in people between the ages of 15 and 24. There are also major racial and ethnic disparities when it comes to how common chlamydia is. Non-Hispanic black people are 5.6 times more likely to get chlamydia than white people. It’s also very common in men who have sex with men.\n3 HPV Andrew Zaeh for Bustle Here’s the thing about HPV: Just about everyone has been exposed to one or more of the more than 100 strains of it. If you’ve had sex, you’ve probably been exposed at some point. It’s just super, super common in humans. Think of it like the common cold. There are a bunch of strains and most people catch at least one at some point in their lifetime. HPV is a virus and it’s also the most common sexually transmitted infection. An estimated 13 strains can lead to cancer, while the others either show up as warts or don’t have any symptoms or effects at all. And because it’s spread via skin-to-skin contact, condoms provide some protection, but won’t totally protect you. So how likely are you to get HPV? Very, very likely. But regular Pap tests for people with cervixes can detect abnormal cells that lead to cancer early. Certain strains of HPV can also cause oral cancer, and white, non-smoking men between the ages of 35 and 55 are at the highest risk of developing oral cancer from HPV. Oral cancer is usually detected when a person starts showing symptoms.\n4 Herpes Andrew Zaeh for Bustle Herpes is caused by two related viruses: Herpes simplex-1 and herpes simplex-2. It’s spread via skin-to-skin contact and can show up as sores on your anus, buttocks, vulva, vagina, penis, scrotum, inner thighs, lips, throat, and mouth. Generally, herpes-1 causes sores around the mouth (oral herpes or cold sores), while generally herpes-2 causes sores in the genital area. But either virus can cause sores in either area. And while the sores can be intense for some people, for most people they’re minor or even go unnoticed — or they don't get them at all. That's because you can carry the herpes virus and be symptom-free throughout the entire time. It can also lie dormant in people, which means they have (and can spread) the virus, but may not show any symptoms for years. Other than sores, herpes doesn’t cause any other health problems. The CDC estimates that more than one out of every six people between the ages of 14 and 49 has genital herpes. And because it’s spread from skin-to-skin contact, condoms once again provide some protection, but aren’t a guarantee.\n5 HIV Andrew Zaeh for Bustle HIV is transmitted via body fluids, including semen (cum), vaginal fluids, breast milk, blood, and rectal fluids. Condoms are extremely effective at protecting against HIV. These days, there's another great option for protection against HIV — PrEP, which is a pill you take every day that prevents infection. And if you have sex with someone who is HIV positive and are concerned about getting infected yourself, there's another pill called PEP that you can take within 72 hours and then daily for 28 days to prevent infection. (It's kind of like the morning after pill, but for HIV instead of pregnancy.) Finally, it's important to note that if someone is living with HIV, taking their medication, and has an undetectable viral load, they're not able to pass on the virus. While anyone could potentially get it, HIV is one STI that has very large disparities when it comes to who is more or less likely to get it. Gay men, bisexual men, and other men who have sex with men are the most likely to get HIV in the United States. They make up about 70 percent of new cases every year, according to the CDC. This is partially due to the fact that anal intercourse is one of the highest risk types of sex when it comes to getting HIV. There are serious disparities in HIV infection when it comes to race as well. African Americans are more likely than other races to get HIV and are disproportionately affected. While African Americans make up approximately 12 percent of the U.S. population, they account for 44 percent of new HIV diagnoses. Latinx people are also disproportionately affected, although not to as high a degree as African Americans.","url":"https://www.bustle.com/p/how-likely-are-you-to-get-sti-heres-the-truth-about-transmission-9969142"}
