{"authors":["Staff Reports"],"date_download":"2018-10-30 21:06:56","date_modify":"2018-10-30 21:06:56","date_publish":"2018-06-21 15:46:00","description":"Local fireworks ordinances build off of Georgia state law regarding when and where fireworks can be used this Fourth of July.","filename":"data/vaneerConsumption/HowlatecanyoushootfireworksinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/Statesman/2017/06/23/Videos/4116944.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_how-late-can-you-shoot-fireworks-georgia__1540933616.html","title":"How late can you shoot fireworks in Georgia?","title_page":"Fourth of July 2018: How late can you shoot fireworks in Georgia?","title_rss":"NULL","source_domain":"ajc.com","text":"Planning on setting off fireworks to celebrate America’s birthday? The sale and personal use of fireworks is legal in Georgia after relatively recent legislation.\n»RELATED: The ultimate Fourth of July weekend guide\nBut there are some caveats and limitations on when and where you can set off fireworks.\nHow late can you shoot fireworks?\nGeorgians can set off fireworks on normal days until 9 p.m., until midnight on Fourth of July, according to the legislation. (On New Year’s, fireworks can be set off until 1 a.m.)\nWhat fireworks can you shoot in Georgia?\nIn 2016, the state legalized the use and sale of fireworks such as firecrackers, Roman candles, bottle rockets and mortars. However, HB 727, limits where and when firecrackers can be used.\nPlanning to shoot fireworks? Here are some Georgia fireworks laws you may not know. Video by Fiza Pirani/AJC. Photos by AJC staff.\nWhile Georgia cities cannot ban the use of fireworks, they can extend hours, regulate where fireworks are sold through zoning and enact taxes on sales, according to the Georgia Municipal Association.\nHow does your city regulate fireworks?\nIn Cobb County, some cities used to ban fireworks entirely. Read more about Cobb County's city ordinances here.\nIn DeKalb County, one city extended its fireworks curfew so revelers can even celebrate longer. Read more about DeKalb County's city ordinances here.\nIn Gwinnett County, have any cities taken any action on fireworks? Read more about Gwinnett County's city ordinances here.\nIn North Fulton, one city says you need written permission to shoot fireworks in parks. Read more about North Fulton's city ordinances here.","url":"https://www.ajc.com/news/local/how-late-can-you-shoot-fireworks-georgia/GNyS7X1OA56DqC7eSOucmL/"}
