{"authors":["Jodi Walker"],"date_download":"2018-10-30 22:49:21","date_modify":"2018-10-30 22:49:21","date_publish":"2014-08-14 18:15:06","description":"It’s pretty insane that 26 years ago, the higher-ups at Discovery thought, “Hey let’s give people a full week of shark-related programming and see what happens.” You know what happened? People loved it. Well, people loved it, while also frequently…","filename":"data/vaneerConsumption/HowLikelyIsaSharkAttackOrHowToSimmerDownAfterSharkWeek.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9be8c9fe-a5ef-42c9-9d33-083584c405a9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35733-how-likely-is-a-shark-attack-or-how-to-simmer-down-after-shark-week_1540939761.html","title":"How Likely Is a Shark Attack? (Or How To Simmer Down After Shark Week)","title_page":"How Likely Is a Shark Attack? (Or How To Simmer Down After Shark Week)","title_rss":"NULL","source_domain":"bustle.com","text":"It’s pretty insane that 26 years ago, the higher-ups at Discovery thought, “Hey let’s give people a full week of shark-related programming and see what happens.” You know what happened? People loved it. Well, people loved it, while also frequently developing an even more irrational fear of shark attacks, which, when you think about it, is probably not what those Discovery folks were aiming for. But don't despair: The Discovery Channel holds that the chances that you will ever be attacked by a shark are about one in 11.5 million, and of the average 65 shark \"attacks\" each year, few are fatal.\nIn fact, many shark-lovers out there disapprove of the full week devoted to their cartilage-heavy friends. A turn in recent years toward mockumentary-style features like last year's Megalodon: The Monster Shark That Lives and this year's Shark of Darkness: The Wrath of Submarine make it much more difficult to differentiate between fact and fiction in Shark Week's programming. With so much focus on the growth of sharks, their carnivorous habits, and especially their interactions with humans, Shark Week, for all of its entertainment and education, can make shark attacks and the dangers they pose seem much more prevalent than they are... much more.\nSo, maybe, after taking in four days’ worth of shark programming, you’re starting to feel like your next beach trip is going to be a little something like this:\nAnd truthfully, if you're big on the ocean, it could actually be like this:\nBut Don't Worry\nThe chances of you actually coming face-to-face with a shark are practically zero. If you're feeling a little weary, just remember: less than one death by shark attack occur every two years, according to National Geographic.\nJeff Kurr, leading Shark Week expert Says Sharks Aren't So Bad\nIn Kurr's Shark Week Reddit AMA, the legendary Shark Week producer and underwater cinematographer naturally received quite a few questions about why people are often scared of sharks without cause. The man with over 23 years of regularly being just a few feet from sharks responded:\nThe fear of sharks is deep-rooted in most people. So, it doesn't help when the media sensationalizes a shark attack … I went on Fox News a couple of weeks ago after the Manhattan Beach \"Shark Attack\" to try and clarify the situation. It wasn't really an attack, this was a case of a juvenile shark that was hooked on a line fighting to escape and accidentally biting someone … I pointed out (as I always do) that sharks are all around us when we're in the ocean and they only attack under the rarest of circumstances … almost never.\nPerhaps even knowing that sharks are all around us in the ocean, but hardly ever want to come up and say \"hi,\" doesn't make you less fearful. So, if all else fails...\nJust remember what sharks look like when humans aren't looking\nImages: Mark Daniels/Discovery Channel; Giphy (2); Leah Jenner/Instagram; Gifsoup; nicklablue/Imgur; hugelol; Rebloggy","url":"https://www.bustle.com/articles/35733-how-likely-is-a-shark-attack-or-how-to-simmer-down-after-shark-week"}
