{"authors":["Myra Butterworth For Mailonline"],"date_download":"2018-10-23 02:06:25","date_modify":"2018-10-23 02:06:25","date_publish":"2017-04-26 13:01:00","description":"A third of homes had their original asking price reduced, with the average discount standing at £24,989, according to research by property website Zoopla.","filename":"data/vaneerConsumption/Howmuchbelowapropertysaskingpriceshouldyouoffer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F2B1600000578-0-image-a-14_1493203999925.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-4447006_How-property-s-asking-price-offer_1540260385.html","title":"How much below a property's asking price should you offer?","title_page":"How much below a property's asking price should you offer? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's the age-old dilemma that every homebuyer faces: How much should you offer to buy the property for?\nIf you offer too little, someone else might offer more and snatch your dream home from under your feet. But if you offer too much, you risk paying over the odds for a property that ends up being less than good value.\nNew research aims to give you a helping hand by providing an indication of how much of a reduction buyers could be asking for across the country - with almost £25,000 below a property's asking price being the magic figure.\nThis four bedroom house in Darlington in County Durham has been reduced by £50,000 since first being listed for sale via estate agents eMoove in March 2016\nThe family house was built in 2005 and includes a large kitchen with an integrated dishwasher\nProperty website Zoopla has identified the areas with the highest proportion of properties for sale that have been reduced in price\nThe findings by property website Zoopla found that nearly a third of homes had their original asking price reduced, with the average discount standing at £24,989.\nIt said that just under a third - at 31.6 per cent - of properties on the market for sale have been reduced in price.\nThose selling a home in the North East of England are particularly likely to have slashed their asking prices, with Darlington in County Durham, South Shields in Tyne and Wear, and Middlesbrough in North Yorkshire among the places with the highest proportions of homes for sale with a discount.\nBlackwood in South Wales, Woking in Surrey and Great Yarmouth in Norfolk are also among the places where house sellers are most likely to be offering a discount.\nA sense of realism seems to be coming into the market\nBy contrast, sellers in Exeter in Devon are the least likely to have cut their asking prices, with only 22 per cent of homes on the market having been reduced in price.\nIt compares with around 46 per cent in Darlington, where the biggest proportion of reductions was found.\nThis three bedroom house in South Shields in Tyne and Wear has been reduced in price by 12% and is currently for sale for £139,950 via estate agents Kings\nTOP 10 AREAS WITH THE LARGEST ASKING PRICE REDUCTIONS Rank Town Average price reduction (%) Average price reduction (£) Reduced properties on the market (%) 1 Stockton-on-Tees 8.04% £11,532 39.47% 2 Hartlepool 7.80% £13,654 31.87% 3 South Shields 7.71% £9,323 43.90% 4 Bishop Auckland 7.58% £13,824 34.78% 5 Middlesbrough 7.38% £9,800 42.52% 6 Bradford 7.27% £11,176 34.68% 7 Halifax 7.25% £12,365 35.08% 8 Blackburn 7.17% £9,979 30.41% 9 Hull 7.17% £9,564 28.89% 10 Pontefract 7.10% £14,034 35.76% Source: Zoopla\nIn London, 32.3 per cent of properties for sale have had their asking price reduced, with an average discount of £57,323.\nWHAT IS THE RIGHT PRICE TO OFFER? North London estate agent Jeremy Leaf, gives his advice for offering the right price, saying: 'Be aware of the strength of your bargaining position before looking for a discount. The market is weaker because of Brexit and uncertainty about the General Election but that doesn't mean that if a particular house comes onto the market there won't be a lot of interest. If it is the right price, there could be a lot of demand so if you make a lower offer, you won't get very far.' Do your homework: If you are asking for a discount it is always better to base your request on hard evidence. If you can find examples of similar properties in the area selling for less, you are more likely to be successful. Put yourself in as strong a position as possible: Agree to get the valuation and survey done within a couple of days of your lower offer being accepted. Get your finance lined up: Use an independent mortgage broker as this will help identifying a lender who can move quickly and won't hold things up if you have promised the vendor that you can exchange by a certain date.\nWithin London, the borough of Merton has the greatest proportion of reduced price listings, at 39.1 per cent.\nAmong homes that have had the price reduced, the biggest discounts in London can typically be found in the London boroughs of Kensington and Chelsea, at 7.7 per cent or £135,702 and Westminster at 7.2 per cent or £124,144.\nJonathan Harris, director of mortgage broker Anderson Harris, said: 'Encouragingly, a sense of realism seems to be coming into the market with sellers beginning to appreciate that they can't get whatever they want for their property.\n'It is not surprising to see the biggest discounts in London and the south-east, where there is a larger proportion of high-value properties. Buyers are simply not willing to pay inflated prices and will hold off until vendors accept that their properties are no longer worth what they were previously.\n'What is surprising is that there are discounted prices right across the country, which seems to demonstrate a wider reaching drop in values at all levels.\n'This is great news for first-time buyers in particular who don't have a property to sell. While there is still a big gap between property prices and incomes, the market is no longer running away with itself and pricing first-time buyers out further.'\nBOTTOM 10 AREAS WITH THE LOWEST PROPORTION OF ASKING PRICE REDUCTIONS Rank Town Reduced properties on the market (%) Average price reduction (%) Average price reduction (£) 1 Exeter 21.83 5.11 £20,352 2 Bedford 22.82 5.3 £17,527 3 Luton 22.94 4.73 £13,114 4 Poole 22.99 6.18 £57,455 5 Coventry 23.78 5.32 £15,077 6 Cambridge 23.88 5.85 £31,015 7 Glasgow 23.9 6.39 £8,842 8 Paignton 23.95 5.58 £10,701 9 Huntingdon 24 5.01 £18,174 10 Crewe 24.04 6.25 £16,272 Source: Zoopla\nThis two bedroom house in Middlesborough in North Yorkshire has been reduced in price by 14 per cent since first being advertised for sale in March 2016\nThe asking price currently stands at £150,000 and the sale is being handled by estate agents Your Move","url":"https://www.dailymail.co.uk/property/article-4447006/How-property-s-asking-price-offer.html"}
