{"authors":["Dana Varinsky"],"date_download":"2018-10-31 00:35:52","date_modify":"2018-10-31 00:35:52","date_publish":"2016-12-01 00:00:00","description":"If Trump pulls out of the Paris agreement, a critical mass of US cities could enact policies to put the country on track to achieve its climate goals anyway.","filename":"data/vaneerConsumption/HowmayorscouldoverrideTrumpontheParisclimateaccord.json","image_url":"https://amp.businessinsider.com/images/583c5379e02ba71c008b66a8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mayors-could-override-trump-on-paris-accord-2016-11_1540946152.html","title":"How mayors could override Trump on the Paris climate accord","title_page":"    How mayors could override Trump on the Paris climate accord - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"New York City mayor Bill de Blasio speaks in front of Trump Tower after his meeting with president-elect Donald Trump. Drew Angerer/Getty Images\nPresident-elect Donald Trump can try to slow down environmental progress in the US, but he can't reverse it altogether.\nIn a recent op-ed, former New York City mayor Michael Bloomberg suggested that Donald Trump won't succeed in keeping the US from acting on climate change.\nThat's because city officials have long been the ones driving the country's progress on reducing emissions and promoting sustainability, he said. And that gives them a lot of power, even without federal support.\n\"If the Trump administration does withdraw from the Paris accord, I will recommend that the 128 U.S. mayors who are part of the Global Covenant of Mayors seek to join in its place,\" Bloomberg wrote.\nThe Global Covenant is a newly formed alliance that brings together more than 7,100 cities to collaborate in fighting climate change. US members include New York City, Houston, Miami Beach, and Chicago. Bloomberg, who has served as the UN's Special Envoy for Cities and Climate Change since 2014, is co-chair of the coalition.\n\"Mayors and local leaders around the country are determined to keep pushing ahead on climate change — because it is in their interest to do so,\" he wrote in the piece, noting that \"the US' success in fighting climate change has never been primarily dependent on Washington.\"\nDuring his presidential campaign, Donald Trump suggested he would withdraw the US from the Paris agreement, the landmark international accord that aims to keep the global temperature from rising more than 2 degrees Celsius. Due to the structure of the agreement, which went into effect November 4, it would take three to four years for the US to fully pull out of the deal. So the situation Bloomberg describes is for now hypothetical, and could not become a reality until the end of Trump's term.\nMichael Bloomberg and Paris Mayor Anne Hidalgo pose with thousands of mayors from different cities at the Paris city hall. Thierry Chesnot/Getty Images The Paris agreement doesn't include any mechanisms (beyond transparency) to force countries to hit their emissions reduction goals. The most likely scenario seems to be that President-elect Trump would just ignore the goal the US submitted, which is to reduce greenhouse gas emissions by 26-28% below 2005 levels by 2025.\n\"I think the danger of Trump isn't so much what he does but what he doesn't do, and this is true in climate change,\" says Benjamin Barber, a political theorist and the founder of the Global Parliament of Mayors, an international body of 80 mayors that convened for the first time in September.\nThat situation of inaction, urban planning experts say, is where Bloomberg's suggestion about the Paris agreement has merit. A group of mayors would most likely not be able to sign an international accord in place of a federal government. They could, however, collectively decide to enact policies that would put the country on track to achieve its Paris goals anyway.\n\"Given that in nations now more than half the population all over the world is in cities, and in the US 75% of the population is in cities, I think any nation with a concerted effort by its cities can hit whatever goals the nation as a whole set,\" Barber says.\nIn the US, cities and surrounding areas are responsible for the majority of greenhouse gas emissions, since they have the largest populations, heaviest industry and highest volume of cars. Because of that, they are in a position to make a big impact. Achieving the Paris goals was always contingent on the cooperation of cities, Barber says.\n\"To put it differently, even at its best, even were President Trump to decide to allow [the Paris agreement] to go ahead, it's going to depend heavily on cities,\" he says.\nAccording to Barber, the key to cities taking effective action against climate change is collaboration. By combining their efforts and committing to goals as a group, a critical mass of cities can become a strong force. That's true in areas other than climate, too — mayors are already declaring their cities sanctuaries for immigrants, for example.\nBut Barber says cities could even go as far as placing collective bulk orders for sustainable technologies — like waste-to-energy plants or electric buses — bringing the price point down and making them affordable around the world.\nBloomberg and Barber both have books coming out in April that discuss the impact city governments can have — Bloomberg's is titled, \"Overheated: How Cooler Heads Can Cool the World,\" and Barber's is \"Cool Cities: The Urban Fix for Global Warming.\"\nBoth suggest that it's in urban residents and their leaders' best interests to support sustainability and emissions reduction.\n\"The motive is that an awful lot of cities are on lakes, rivers and oceans, where sea rise extreme weather and flooding is most likely to occur. So they have a responsibility to those citizens that the nation as a whole might not feel to the same degree,\" he says, adding that there's also an economic incentive, since environmental threats lead to less investment in property and businesses.\n\"Miami is already beginning to realize that with the high tide now coming in across the avenues, it's harder for people to invest,\" he says.\nJoe Raedle/Getty Images Brooks Rainwater, director of the Center for City Solutions at the National League of Cities, tells Business Insider that city dwellers are voicing their support for eco-friendly measures by voting for green initiatives across the country.\n\"If you look at this last election, American voters in cities approved more than $200 billion in local measures to improve quality of life and reduce carbon pollution, whether that be $54 billion that Seattle voted to approve for transit investments or $120 billion that Los Angeles approved,\" he says.\nBut the success of those actions depends on support at the state and federal level, Rainwater says, since city initiatives work best if aided by national regulations and funding.\n\"Truthfully, in order to really meet our goals and go beyond our goals, we need the federal government there in partnership,\" he says.\nSo far, that alignment looks unlikely with a Trump administration. Myron Ebell, who is leading the Environmental Protection Agency transition, has spent his career working to discredit climate science, and suggested that climate research is actually an arm of a coordinated political movement. And Bob Walker, a Trump adviser, told The Guardian this week that the new administration plans to cut earth science research at NASA, calling it \"politicized science.\"\nRainwater believes it is possible, however, for cities to ensure the US meets its Paris goals.\n\"I think what Bloomberg is calling for we would definitely support, and we'd like to see it go in that direction,\" he says. \"Would it be difficult? Yes. But anything is possible.\"","url":"https://www.businessinsider.com/mayors-could-override-trump-on-paris-accord-2016-11"}
