{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:33:12","date_modify":"2018-10-30 23:33:12","date_publish":"2014-08-13 17:09:56","description":"Separating yourself from the outside world for a maximum of three months, like Cody Calafiore and his cohorts do on Big Brother , would be really hard for me. There would be no phones (aka, no Kim Kardashian iPhone game), no Internet, no…","filename":"data/vaneerConsumption/HowMuchDoesCodyCalafioreMakeOutsideoftheBigBrotherHouseItsMoreThanYoudExpect.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2e449684-6f78-4bc5-8d7e-a9744d1ea4d4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35605-how-much-does-cody-calafiore-make-outside-of-the-big-brother-house-its-more-than-youd_1540942392.html","title":"How Much Does Cody Calafiore Make Outside of the 'Big Brother' House? It's More Than You'd Expect","title_page":"How Much Does Cody Calafiore Make Outside of the 'Big Brother' House? It's More Than You'd Expect","title_rss":"NULL","source_domain":"bustle.com","text":"Separating yourself from the outside world for a maximum of three months, like Cody Calafiore and his cohorts do on Big Brother , would be really hard for me. There would be no phones (aka, no Kim Kardashian iPhone game), no Internet, no communication with family, you’re completely cut off from the world. But, before I make it sound awful, there is a chance of winning $500,000, and of course the fact that you are on television — three nights a week — on a major network like CBS, if that’s the sort of thing you’re into.\nRecently, Frankie Grande revealed that he's Ariana Grande’s brother and if he won the $500,000 he was going to use it to build schools in Africa. This is obviously a noble gesture, but it seemed to rub a few of the houseguests the wrong way, since all of them are there to win the $500,000 for themselves and their livelihood. While the houseguests all respect Frankie's charitable actions, they worry that the jury is automatically going to vote for him to win knowing the money is going to go to furthering education in Africa. Cody mentioned that he didn't enter the house so Frankie could win the money and donate it to charity, in fact, Cody said he would have made more working this summer if that were the case.\nSo what is it that Cody does that makes him more than 12,000 big ones in three months? Here's how he does it; turns out he may be earning a lot more money than you’d expect.\nHe's a “Sales Account Executive”\nCody’s official job title on Big Brother states that he is a \"sales account executive.\" Even though we know that Cody's side job is \"underwear model,\" the sales account executive job seems to be the 23-year-old’s main source of income. According to Cody’s LinkedIn profile, Cody works as a sales associate and district manager for the company ADP. Glassdoor states that a sales associate with the company makes on average an annual income of $54,142 while a district manager makes on average $86,333 annually. Because Cody says that he is the district manager, we will assume he makes the higher end of that estimate at around $86,000 a year. These numbers would allow him to make approximately $22,000 for the three months he is in the Big Brother house.\nHis, er, Modeling\nEarlier in the summer it was revealed that Cody has a modeling past, but not just any modeling past, and underwear modeling past. While it is difficult to estimate how much Cody earned for modeling, the undisclosed amount would add to his annual income.\nIt seems that the 23-year-old soccer player is doing pretty well for himself outside of the house, but that doesn't mean the $500,000 would be a burden to win.\nImages: CBS; C-IN2/Facebook","url":"https://www.bustle.com/articles/35605-how-much-does-cody-calafiore-make-outside-of-the-big-brother-house-its-more-than-youd"}
