{"authors":[],"date_download":"2018-10-30 01:22:48","date_modify":"2018-10-30 01:22:48","date_publish":"2015-04-01 00:00:00","description":null,"filename":"data/vaneerConsumption/HowmanymoreallieshavetobesacrificedforObamasego.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_03_how_many_more_allies_have_to_be_sacrificed_for_obamas_ego__comments_1540862568.html","title":"How many more allies have to be sacrificed for Obama's ego?","title_page":"Articles: How many more allies have to be sacrificed for Obama's ego?","title_rss":"NULL","source_domain":"americanthinker.com","text":"When George W. Bush left office, Libya was a halfway ally, which had dropped its nuclear weapons program at the insistence of the Bush administration. That was a victory for sanity over extreme danger – i.e., the risk that nukes would fall into the hands of suicide-glorifying gangs like al-Qaeda and ISIS. Today, Obama has overthrown Gaddafi for no particular reason, causing tens of thousands of deaths and a raging civil war in Libya. When George W. Bush left office, Egypt was still a stable country at peace with its neighbors. So were Saudi Arabia, Syria, Yemen. Even Iraq and Afghanistan were taking precarious steps toward stability. After six years of Obamanismo, Egypt is at civil war with the Muslim Brotherhood and with ISIS/al-Qaeda terrorists in the Sinai Desert. Egypt has blown up a reported sixty smuggling tunnels to Hamas in Gaza, because Hamas is the terrorist group spun off by the Brotherhood. Obama has consistently supported the... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/03/how_many_more_allies_have_to_be_sacrificed_for_obamas_ego__comments.html"}
r gang, now part of ISIS.\nISIS itself exploded into power after Obama told Americans during the election that al-Qaeda is “decimated.” Al-Qaeda is alive, all right, and now its big brother ISIS is laying claim to parts of Iraq and Syria to set up a caliphate – a Muslim sharia empire.\nWhen George W. left office, it was still possible to stop Iran from building nukes, using the same methods that worked so well with Saddam Hussein’s Iraq: a trade embargo combined with a no-fly zone enforced by the U.S. Air Force, which made it impossible for Saddam to attack other nations by air, sea, or land.\nUltimately we invaded and knocked a weakened Saddam from power in three weeks. (Our mistake was to stay there afterward.)\nWhen George W. left office, the Iranian imperial campaign was still contained to Iran. Today, Iran’s Al-Quds Brigade is in Iraq, Syria, Yemen, and, via Iran’s proxy terror group Hezb’allah, in Lebanon. The boss of the Al-Quds brigade just threatened to invade Jordan, which would give him blitzkrieg access across the desert to Mecca and Medina, the mullahs’ real theological targets.\nWhen George W. left office, the most threatened and yet the most modern nation in the Middle East, Israel, was feeling reasonably safe. So were Saudi Arabia and the other Sunni powers like Egypt.\nToday they are all frightened to death by Obama’s obsessive surrender to Iranian nukes.\nAll over the Middle East, people see the United States as an enemy rather than a friend. The only exception is the two anarchic forces Obama has supported over and over again: the Iranian war priests, the mullahs, and their fanatical troops; and on the Sunni side, the Muslim Brotherhood, which has a dozen known loyalists in high positions in this administration.\nFour-star admiral James (“Ace”) Lyons (USN, ret.) has pointed out Muslim Brotherhood infiltration in so many words.\n“[There is] Muslim Brotherhood penetration in every one of our national security agencies, including all our intelligence agencies[.]” ... Admiral Lyons said that our “lead intelligence agency” is “headed by a Muslim convert,” a reference to Obama CIA head John Brennan.\nBy now the story has leaked that Obama has blindly and arrogantly overruled any military advice, as we can see from his utter failure to deal with the al-Qaeda attack on our CIA weapons compound in Benghazi, Libya. Obama’s and Hillary’s biggest objectives were to cover their rear ends, and our hyper-corrupt media colluded in the Benghazi cover-ups, which are still going on today. The reason is that Benghazi involved Obama’s and Hillary’s direct and knowing collusion with al-Qaeda gangs, who were trusted to help us smuggle massive quantities of modern Libyan arms to the AQ rebels in Syria.\nAnother brilliant Obama move that went bad.\nDuring the election, with corrupt media collusion, Obama lied that al-Qaeda was defeated. But the front pages of newspaper on September 11, 2012 showed the black flag flying over a part of the U.S. Embassy in Cairo, and in Libya as well.\nEverything Obama and Hillary have said since that moment has been a lie. Today AQ and ISIS are alive and murdering innocent people on YouTube, and Obama is seen as a traitor by Egypt, the Saudis, and the rest. Only the mullahs love Obama, which is why they treat him with contempt.\nThe Sunni Arabs have now announced a military alliance against Iran. (Not against Israel, which is helping the Sunnis with intelligence and satellite recon.)\nThe Middle East is fracturing along its ancient theological fault lines, the Shi’ites of Iran against the majority Sunnis of the rest of the world.\nWith Obama’s delusional “peace agreement,” which will sidestep the U.S. Senate’s constitutionally required “advice and consent” for treaties with foreign powers, Obama is clearing the way for nuclear escalation in the most unstable part of the world.\nThe only conceivable purpose for this unprecedented sham parade by the United States of America is to serve the glorious egos of Obama and Hillary. Both have consistently abused their federal offices, with the direct collusion of the rotten media. Both have used all their powers and privileges to violate their oaths of office and the clear language of the United States Constitution. Both are plausible candidates to be tried for high crimes and misdemeanors, if any federal prosecutor or Senate committee ever got up the guts to expose them.\nSo when you watch Obama’s phony ego ceremony on TV, just remember Jeremiah (6:14), who saw it all before:\nThey say, “peace, peace.”\nBut there is no peace.","url":"https://www.americanthinker.com/articles/2015/03/how_many_more_allies_have_to_be_sacrificed_for_obamas_ego_.html"}
