{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:33:47","date_modify":"2018-10-30 22:33:47","date_publish":"2016-01-30 08:00:00","description":"The searchable database below shows how teacher and staff salaries have grown since the Great Recession in more than 650 of California’s 1,022 school","filename":"data/vaneerConsumption/Howmuchareteachersinyourdistrictpaid.json","image_url":"https://calmatters.org/wp-content/uploads/vallejohigh_0274.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938827.html","title":"How much are teachers in your district paid?","title_page":"How much are teachers in your district paid? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The searchable database below shows how teacher and staff salaries have grown since the Great Recession in more than 650 of California’s 1,022 school districts.\nAs it illustrates, California education funding is finally booming. The $71.6 billion budget that Gov. Jerry Brown proposed in January would be the fifth consecutive year of growth since the Great Recession. If approved by the Legislature in June, the budget will be up 50 percent from 2011. Most of the increased funds have gone to teacher and staff salaries, which account for more than 85 percent of school budgets.\nNot accounting for inflation, average school salaries across the state grew 10.6 percent from 2008 to 2014, from $66,995 to $74,090 in 2015. By comparison, median earnings for California workers with a bachelor’s degree grew by 7 percent over the same period.\nAfter adjusting for inflation, the average real purchasing power of teachers and credentialed staff at California schools has increased in each of the last three years. Today, however, it is still below its 2009 peak.\nStatewide averages mask considerable differences between individual school districts in how much they pay teachers and staff. Average 2014 salaries range from over $113,000 at Mountain View Los Altos Union High School District in Silicon Valley to around $41,000 at Dunsmuir Unified School District, north of Redding.\nThe database below is from optional self-reports filed by school districts every year to the state. For some districts, it includes wages for credentialed staff like librarians and counselors that collectively bargain alongside teachers.\nSearch for your school district below by typing in the name of your district in the search box. You can also sort school districts from highest to lowest salaries and vice versa by clicking on the column title below, such as “Avg. Salary 2014-15”.\nData in the table dates back to 2008 and is not adjusted for inflation. School districts that did not report salary data are not included in the table below.\nThe salaries listed below show an average of what districts pay teachers and staff who collectively bargain. Because pay is commensurate with experience, the average salary reflects not only the rate of pay but the overall experience level of the workforce.","url":"https://calmatters.org/articles/search-how-much-your-school-district-pays-teachers/"}
