{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:34:39","date_modify":"2018-10-30 22:34:39","date_publish":"2016-01-04 08:00:00","description":"One of the biggest winners in Gov. Jerry Brown's January budget was public schools, which has enjoyed a rapid funding rise in recent years. The governor","filename":"data/vaneerConsumption/HowmuchhasCaliforniaschoolspendinggrowninthelast5years.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/vallejohigh_0352-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938879.html","title":"How much has California school spending grown in the last 5 years?","title_page":"How much has California school spending grown in the last 5 years? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"One of the biggest winners in Gov. Jerry Brown’s January budget was public schools, which has enjoyed a rapid funding rise in recent years. The governor proposed a $71.6 billion education budget in the fiscal year that starts this July. That marks a 51 percent increase in the minimum funding for California’s public schools — according to the formula set by Proposition 98 — since 2011, when the budget was about $47 billion.\nThis marks the fifth consecutive year of growth in Proposition 98 guarantee since the lowest point caused by the recession.\nK-12 public schools have enjoyed added state support through a voter-approved sales and income tax increase three years ago. That temporary tax — Proposition 30 — has sent an extra $8 billion a year to educate California’s 6.2 million elementary and secondary school students.\nAccording to the state Department of Finance, California spends more than $3,800 on each child now than it did during the depths of the recession. Including all funds, the state spent $10,699 per student in 2011 compared to a projected $14,550 for 2016.\nSchools that were once handing out pink slips are now scrambling to find teachers. Teachers are once again getting raises and schools are offering recruits signing bonuses. Counselors, librarians and support staff are being hired. The state is directing some of the increased money to help districts implement Common Core standards in English and math, part of a national movement to better prepare students for college and a career.\nYet California still lags in per-pupil spending, leaving a debate about what’s really the right level of funding to educate children.\nAccording to Education Week’s annual state rankings on K-12 education spending, California was last in per-pupil when adjusted for regional cost differences in 2011. It moved up to 41st for 2013.\nWhat changes have you seen in your school in the last five years?\n___\nThis story was revised on Jan. 22, 2016, to update figures from the governor’s January budget proposal and Education Week’s 2013 state rankings on education spending.","url":"https://calmatters.org/articles/how-much-has-californias-education-spending-grown-in-last-5-years/"}
