{"authors":["Imogen Blake For Mailonline"],"date_download":"2018-10-23 01:55:26","date_modify":"2018-10-23 01:55:26","date_publish":"2017-03-16 12:10:55","description":"Researchers have analysed dozens of sweet packets for brands including Wine Gums and Starburst. They found exactly which colours are the most common for the UK's most famous sweets.","filename":"data/vaneerConsumption/Howmanyofeachcolouryougetinasweetpacketrevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53B95000000578-0-image-a-12_1489665751078.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-4319728_How-colour-sweet-packet-revealed_1540259726.html","title":"How many of each colour you get in a sweet packet revealed","title_page":"How many of each colour you get in a sweet packet revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When it comes to sweets, everyone has their favourite flavour - so it's disappointing when you open a packet to find there are only a few of your preferred colour.\nBut it's not just a case of bad luck, a tooth-achingly sweet investigation has found.\nA team of sweetie fans ate their way through dozens of packets of some of the UK's most popular confectionery, and have revealed how many of each colour you get on average when you buy certain treats.\nAnd the proportion of each flavour is far from equal for some of the most famous sweet brands.\nThe lime green sweets were the most common flavour on average in packets of Skittles, the team found. A survey by Tellwut in 2013 found that most people's favourite are the strawberry-flavoured red sweets, but you get much less of these than orange or green on average\nThe team, from UK kitchen company CDA, analysed dozens of sweet packets for the UK's most popular sweet brands: Skittles, Wine Gums, Fruit Pastilles, Gold Bears and Starburst. They then worked out how many of each colour you get in a packet on average based on the packs they had munched their way through.\nStarburst was found to have the most equal proportion of each colour in a packet, followed by Gold Bears - great news for those who like every flavour.\nBut other brands have much more of one colour than the others.\nYou're in luck if your favourites are green Fruit Pastilles and red Wine Gums as these are the most common colours for those brands, on average.\nBut otherwise, you may have to just hope that the packet you buy bucks the trend uncovered by the research.\nFRUIT PASTILLES In an average 52g pack of Rowntree's Fruit Pastilles, the team found there were 14 sweets in a packet on average, split into the colours red, green, purple, yellow and orange. They found green was the most common colour, with four of these sweets per packet on average, while the other colours were split evenly. The most of one colour the team found in any single packet was eight green ones.\nWINE GUMS Unlike with fruit pastilles or Skittles, red was the most common colour found in Fruit Pastilles on average, the team found, with a quarter of the pack dedicated to the strawberry-flavoured sweets. There was an even split between the remaining colours, on average. The most of any colour the team found in any one single packet was a whopping seven red sweets in a packet of 12. Mondelez, which makes Maynard's Wine Gums, reported 80 per cent of people preferred red and black wine gums so it seems the brand is catering to customer preferences.\nGOLD BEARS A 100g bag of Haribo Gold Bears was found to contain 43 gold bears on average and there did seem to be a more even split between the various coloured sweets than with other brands, the team discovered. There was an even number of red, gold and green bears, eight of each, but the most number of any colour found in a single packet was 11 white bears.\nJELLY BABIES Red and yellow sweets were found to be the most common colours in packets of Maynards Bassetts Jelly Babies on average, while the green ones were the rarest. The most of any one colour in a single packet was 15 red ones in a 45-sweet pack - good news for fans of the strawberry-flavoured sweets.","url":"https://www.dailymail.co.uk/femail/food/article-4319728/How-colour-sweet-packet-revealed.html"}
