{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 04:05:56","date_modify":"2018-10-23 04:05:56","date_publish":"2017-03-16 15:14:57","description":"Researchers from eMoov have analysed the price of the houses of the UK's longest serving soap character to find out how much they've increased in value in the years they've been on screen.","filename":"data/vaneerConsumption/HowmuchisYOURfavouritesoapstarshouseworth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E544E2500000578-0-image-a-139_1489670929379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320256_How-favourite-soap-star-s-house-worth_1540267556.html","title":"How much is YOUR favourite soap star's house worth?","title_page":"How much is YOUR favourite soap star's house worth? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The people in your favourite soap are meant to be the down-to-earth types that everyone can relate to.\nBut your favourite character may well be a secret millionaire, thanks to the property they live in.\nResearchers from eMoov have analysed the price of the houses of the UK's longest serving soap characters to find out how much they've increased in value in the years they've been on screen.\nAnd characters such as Ian Beale and Ken Barlow have seen huge increases in their property values as prices continue to soar across the country.\nCORONATION STREET\nIt's worth how much? In the 57 years Ken has been on screen his house has increased in value by more than 800 per cent\nKen Barlow's terraced house, number one Coronation Street, would now cost £142,759\nAs the longest running soap in the world, Corries also has the most veteran character, Ken Barlow, who first appeared on screen in December 1960.\nBack then the modest Manchester terrace house where he resides would have cost just £1,614.\nBut Manchester has experienced a huge increase in price since then, meaning a house like Ken's would now cost £142,759.\nWhile it seems reasonable compare to London prices, it's a huge increase of more than 8,000 per cent.\nResearchers from eMoov have analysed the price of the houses of the UK's longest serving soap characters\nEASTENDERS\nIan Beale has been a fixture in everyone's living room since the London soap first aired in 1985.\nHis character may be an entrepreneur striving to make money from a cafe, chip shop and market stall but his house is where the real money lies.\nIt would have cost around £35,4000 32 years ago, but it's now worth £494,231, an increase of almost 500 per cent.\nIan Beale, played by Adam Woodyatt, has been an Eastenders stalwart since the show began in 1985\nIan's East London terrace had skyrocketed in value since the '80s and would now set him back more than £400,000\nEMMERDALE\nEric Pollard is an Emmerdale veteran, joining the rural drama back in 1986.\nA detached home in Yorkshire Dales district of Craven where the soap is set would have cost just over £64,000 21 years ago.\nNow it has a price tag of of more than £333,000, and Eric's property could be even more valuable given that it's a B&B.\nEric Pollard, as played by Chris Chittell, is an Emmerdale veteran, joining the rural drama back in 1986\nEric's property in the Yorkshire Dales now has a price tag of of more than £333,000\nHOLLYOAKS\nTony Hutchinson is the Chester-based soap's longest-standing character and lives in a semi-detached terraced house.\nWhen Tony first appeared on screens in 1995, his home would have been worth just over £35,000.\nBut these days, a similar property would cost around £143,000, an increase of more than 300 per cent.\nTony Hutchinson is Hollyoaks' longest-standing character and his terraced house is now worth around £143,000\nCASUALTY\nIt's the longest running medical drama in the world and Charlie Fairhead, played by Derek Thompson, has been in it from the start since if first aired in 1986.\nIt's set in the fictional town of Wyvern in Bristol where a semi-detached home would have cost £59,758 in the 80s.\nHowever, Charlie would be enjoying a significant boost to his fortunes now as a house is currently worth more than £310,000 today.\nCasualty veteran Charlie Fairhead will have seen a 420 per cent rise in the value of his home since the 1980s\nDOCTORS\nJimmi Clay is the longest serving character since the departure of Julia Parsons, played by Diane Keen.\nHe played guest appearances in the early 2000s, but became a permanent member of the cast in 2005.\nA terraced house in the city would have cost £112,267, but now it's worth 30 per cent more at £146,898 today.","url":"https://www.dailymail.co.uk/femail/article-4320256/How-favourite-soap-star-s-house-worth.html"}
