{"authors":["Gina Vaynshteyn"],"date_download":"2018-10-30 22:31:17","date_modify":"2018-10-30 22:31:17","date_publish":"2014-08-15 14:41:52","description":"Growing up, my father always drove. He drove us to the grocery store, he drove us to vacations up north in Minnesota, he drove us to the dentist, and he drove us to Russian galas downtown. I don’t know whether it was because my mother was afraid of…","filename":"data/vaneerConsumption/HowMyConservativeDadLearnedToLetMeGoMyOwnWayObamaBallotandAll.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/52f393c4-10aa-48bb-b9e8-f5c0614bfdbd.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34285-how-my-conservative-dad-learned-to-let-me-go-my-own-way-obama-ballot-and-all_1540938677.html","title":"How My Conservative Dad Learned To Let Me Go My Own Way, Obama Ballot and All","title_page":"How My Conservative Dad Learned To Let Me Go My Own Way, Obama Ballot and All","title_rss":"NULL","source_domain":"bustle.com","text":"Growing up, my father always drove. He drove us to the grocery store, he drove us to vacations up north in Minnesota, he drove us to the dentist, and he drove us to Russian galas downtown. I don’t know whether it was because my mother was afraid of driving, or whether it was my father who enabled this fear. To this day, my mom only feels comfortable driving to Trader Joe's and to my grandma’s apartment.\nMy dad always liked to fix things. Plumbing issues, a broken heater, or a sputtering VCR player my dad took ownership of and neatly, quietly fixed. He never asked anyone for help. When asked about a broken light bulb, or setting up a voice mail for her cellphone, my mom would reply, “It’s just not my thing,\" as though someone asked her whether she liked snorkeling with alligators in Belize.\nA few weeks ago at dinner, he turned to my fiancé and said, “Can you make sure her car gets an oil change?” As though I hadn’t been driving to Jiffy Lube since high-school.\nMy dad was born in 1947 in Ukraine. When he was 18, his father, who had spent the last eight years in prison for starting a business (hooray, communism) died of a massive stroke, leaving him, my grandmother, and his toddler brother to fend for themselves in a Soviet country still in post-WWII shambles.\nSomeone had to feed the chickens, make sure his brother got to school, make sure everything didn’t fall apart. That someone was my dad. When his family scraped just enough money to send him to the university, he latched on to that opportunity like it was the very last opportunity, ever. He became an engineer and ended up designing submarines for Russia, supporting his brother while my grandma worked in the coal mines (she was one tough lady). When he emigrated to America, he went from earning ten dollars an hour to owning his own dry-cleaning business, which he named Falconer’s, after the most resilient, smartest birds.\nLike many others with similar background, my father is a staunch Republican. He come from a place with far less opportunity than the U.S. When you’re raised in such a calloused, survive-or-die environment and then dumped into a river of immigrants, you learn to swim. Fast. He took two dollars and he turned it into 2000 with his bare hands, and he expected everyone else do the same. He firmly didn’t believe in hand-outs. He supported the military and George W. Bush’s decision to invade Iraq. Instead of God, he prays to our free market. And of course, he hates President Obama.\nI don't think my dad ever had any reason to think about the possible costs of deregulation, or American imperialism, or what it might be like to grow up in this country as a member of a marginalized group.\nAnd I don't think he thought about how life would be different in America if he were female. Because I was a girl, I don’t think my dad expected much from me. He always loved me; he still loves me to death. He was happy he had a daughter, but he wasn't sure what to do with me.\nTo be fair, I wasn’t the most coordinated kid in the world. I broke a microscope lens in seventh grade while trying to examine the amount of bacteria a wad of spit contained. I spent an entire summer working at Panera Bread just to pay for a huge scrape on my mom’s car that I had invited by brushing by a pole in a Michael’s parking lot.\nBut I was so good at destroying things because I so desperately wanted to do things. I was thirsty for everything. I wanted to move out of my parents’ house. I wanted to drive wherever I felt like driving. I wanted to live, and I wanted to live on my own.\nIn the 12th grade, I announced that I was applying to schools with decent English programs. I had already sent out applications and essays to eight schools in California.\n“English. Who studies English? You speak English, you don’t major in it,” my dad told me. Both my mom and dad were horrified I wasn’t going to pharmacy school, a future they had decided for me long before I could chew Cheerios. I was to go to pharmacy school, become a pharmacist who worked comfortable hours. I was to marry a nice Jewish doctor and give birth to nice Jewish kids named Rebecca and David.\n“How will you make money? Who will take care of you?” My dad asked me one night, fearful for my life. I guess I hadn’t actually thought about a career yet. I was 18, and had spent most of my time fantasizing about my someday apartment filled with books, flowers in vases made of wine bottles, and hot dudes who liked The Smiths. Although I hadn’t thought about money, I also hadn’t thought about the idea of someone taking care of me in college. The idea itself that I would need someone to take care of me was unnerving.\nThroughout the first few years of college before I met my fiancé, my father slyly tried setting me up with some reserved Jewish guys. Convinced I would die alone without a man around, my parents desperately wanted to find me a suitor. We would be at a Hanukkah party back home, and suddenly I would realize I was in the middle of a dating reality show.\nBut I kept dating guys who gave me pretentious books for Christmas. I kept writing short stories and poems for my college literary magazine, memorizing Sylvia Plath stanzas by heart. During the 2008 elections, I defiantly called him, told him I had just mailed in my ballot and checked off \"Obama.\" He sighed, telling me, \"You think you understand how things work, but you don't.\" When Obama won, a group of college friends and I celebrated with Pepsi and Popov in the dorms.\nWhen I announced that I'd gotten into a master’s program, my dad seemed deeply disturbed. If I announced I was getting my Ph.D. in glitter, his facial expression probably would have been the same. In his time, you went to school because you knew you were you going to come out with a well-paying job. It was like going to grocery store with the desire for two-percent milk and coming out with just that: two-percent milk. Getting a master’s, let alone a bachelor’s in English, was deemed frivolous, and unnecessary.\nMy first year in grad school was tough. Not because of the workload, but because I didn't feel like my dad believed in what I was doing, and it was important to me that he believed in me. My very first poetry publication was for some scrappy journal based out of someone's basement. But I was so proud of my baby accomplishment; even when the complimentary copy of the \"journal\" arrived, looking like someone had stapled a few pieces of construction paper together, I put it on display in my living room.\nI told my dad about it, and instead of congratulating me, he asked how much money I made from it — which was kind of hilarious but mostly pissed me off. I had been published! But he wasn't impressed. He also wasn't impressed when my first essay was published online, because I still wasn't getting paid. For my dad, accomplishments were measured by money. I wasn't succeeding, based on his standards. I stopped telling him about my writing projects.\nThe next year, bigger, more reputable journals started publishing my work. I still wasn't getting paid (because poetry), but I was starting to feel more and more confident about my writing. I started getting paid for my work online, and slowly but surely, this whole writing dream life I had envisioned for myself was becoming more of a reality than some dumb, college fantasy. With every publication, every successful article, my fiancé and I had a celebratory drink, or we would go get victory ice-cream. After a while, I forgot I was even keeping this part of my life from my dad.\nThat was, until he started stumbling upon articles I had written online. More and more, he would call and ask what I was writing. Who I was writing for. What I was up to. He seemed to have developed an interest in my work he never had before. A part of me felt like I had proven myself to him; I was giddy with that satisfaction, yet annoyed it had taken him this long. I was also frustrated that I still wanted his approval, that his opinion still weighed heavier than a sack of pianos.\nMy father is who he is. He believes in quantitative over qualitative. But his phone calls and emails to me that genuinely expressed intrigue were a huge step for him.\nWhen I got engaged, my dad didn't even bat an eye. Almost like a business arrangement, he asked how many months I thought we needed to plan a wedding, if we were saving money, and other practical inquiries. He never congratulated me, exactly. But I knew that if he wasn't happy with my decision and my relationship, he would have been more than vocal about it.\nHe genuinely likes my fiancé, knows he's a stand-up dude and hard-worker, just like himself. I think seeing me in a relationship, as well as working my ass off doing something I was good at, made him see me as a different person. A grown-up person who wouldn't need her dad for everything anymore. And maybe that makes him a little bit sad (secretly, of course); his role as The Father Who Fixed Everything has become smaller. But it also makes him happy. Relieved, at least.\nMy dad, who is 67 years old, seems finally at peace with his daughter who never became a pharmacist. His daughter who works really weird hours, seven days a week, on the Internet, mostly. Who has been engaged to a half-Irish, half-Russian, non-Jewish chef with surprisingly no complaints from my parents, for two years. Who has a cat instead of a baby. Who is a Democrat. When politics come up now, he listens. He may not agree with me, but he doesn't tell me I don't know anything, either.\nBut some things never change. A few weeks ago at dinner, he turned to my fiancé and said, “Can you make sure her car gets an oil change?” As though I hadn’t been driving to Jiffy Lube since high school.\nBut he’ll click on the articles I write. He’ll notify me that he “LOVED” my story about ice-cream. When I wrote about Putin's inhuman laws concerning homosexuality in Russia, he shared the article with his friends. I didn't expect that. When I told him I’m probably moving to LA next year to become more serious about my writing, he didn’t protest. He didn’t ask how. He just nodded, and said, “OK.”","url":"https://www.bustle.com/articles/34285-how-my-conservative-dad-learned-to-let-me-go-my-own-way-obama-ballot-and-all"}
