{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:19","date_modify":"2018-10-23 05:25:19","date_publish":"2014-06-24 00:00:00","description":"See how home prices and incomes have changed over the past 25 years, and how your city compares with others around the country.","filename":"data/vaneerConsumption/HowMuchHouseYouCanBuyIn385USCities.json","image_url":"https://media.npr.org/assets/img/2014/06/24/ap857720371388_wide-f71ed7223dd6533c7434b4ec159d1c8043134b3a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_06_24_323974597_how-much-house-you-can-buy-in-385-u-s-cities_1540272319.html","title":"How Much House You Can Buy, In 385 U.S. Cities","title_page":"How Much House You Can Buy, In 385 U.S. Cities : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How Much House You Can Buy, In 385 U.S. Cities\nAre home prices cheap in your city right now?\nIt's common to answer this question by talking about how prices today compare with prices last year, or to look at how prices in your city compare with prices in other cities.\nBut there's another way to frame the question: Compare home prices with income. You would expect that the ratio would be similar in different places. In cities where incomes are higher, home prices should also be higher. In cities where incomes are lower, home prices should also be lower.\nThis basically holds up. In most parts of America, the typical home costs between one and two times as much as the typical family earns in a year. (You would also expect that during a bubble, home prices would rise much faster than wages. This also holds up.)\nThere are, however some outliers. A bunch of California cities have home-price-to-income ratios that are far, far above the national norm. Geography and zoning play a big role here.\n\"Coastal California starts out with relatively little flat land,\" says Jed Kolko, chief economist at Trulia. \"If you draw a circle around San Francisco, most of that circle will be water or mountain.\"\nHe says that when you add zoning rules and the review process into the mix, you have a situation where housing stock is way more constrained than it is in many other cities in the country.\nSo, even in nonboom times, the home-price-to-income ratio is high in San Francisco. And with the current tech boom, it has shot up to levels that are even higher than usual.\nMany of the areas where price-to-income ratios are lowest are in Texas, where flat land is abundant, zoning is lax, and the oil boom has driven up wages.\nAnd the city where the homes are really cheap? Not surprisingly, it's Detroit, where the population is shrinking and the city is struggling to get rid of empty houses.","url":"https://www.npr.org/sections/money/2014/06/24/323974597/how-much-house-you-can-buy-in-385-u-s-cities"}
