{"authors":["Krystin Arneson"],"date_download":"2018-10-30 21:05:00","date_modify":"2018-10-30 21:05:00","date_publish":"2016-12-22 00:00:00","description":"If you're looking for a celebration that's a little off the beaten path this year, check out these seven unique New Year's Eve traditions.","filename":"data/vaneerConsumption/HowNewYearsEveiscelebratedin7differentcountries.json","image_url":"https://amp.businessinsider.com/images/585c37e8dd089536208b49d0-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-years-eve-in-around-the-world-2016-12_1540933500.html","title":"How New Year's Eve is celebrated in 7 different countries","title_page":"    How New Year's Eve is celebrated in 7 different countries - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"New Year celebrations in New York's Times Square. Lucas Jackson/REUTERS\nRinging in the new year and bidding adieu to the old one is a tradition that spans the globe. But it's not just all fireworks and glittery ball drops everywhere. Some celebrate by eating 12 grapes, while others smash fine china.\nIf you're looking for a celebration that's a little off the beaten path this year, check out our list below of seven unique New Year's Eve traditions around the world.\n1. Hogmanay in Edinburgh\nReuters/Russell Cheyne\nNew Year's Eve is actually a three-day celebration in Scotland's capital -- and across the country. On December 30, 8,000 revelers holding torches create a \"river of fire\" that winds down through Old Town's streets, from Parliament Square to Calton Hill. To top off the procession, pipers and drums walk in step. On New Year's Eve itself, enjoy a few wee drams and ceilidh, a social gathering with Scottish music and traditional dancing. And if your head isn't aching from all the wee drams you knock back the night before, catch the last ceilidh of the holiday season on January 1. If you're truly brave, take part in the Loony Dook, a costumed, polar-plunge event in the Firth of Forth just outside the city.\n2. Eating Grapes in Spain\nGet your New Year's health resolutions off to a good start, thanks to Spain's tradition of eating 12 grapes, one for each stroke of midnight. It's harder than it sounds (people even practice for it), but if you're successful, tradition says you'll have a year of prosperity. The place to do it is in the Puerta del Sol in Madrid for Nochevieja (or New Year's Eve). Join the crowds, who will have 12 grapes in one hand and a glass of cava in the other. Stick around as it turns into a big party or head out to dance until the early hours of the morning at one of the city's clubs.\n3. Smashing Plates in Denmark\nSmashing things against someone's house might be considered bad luck — but in Denmark, people hold on to chipped dishes and glasses all year just for New Year's Eve. That night, they go around to the homes of friends and family and smash them against their front doors. The more shards you have on your doorstep the next morning, the more popular you are.\n4. Jumping Seven Waves in Brazil\nAP/Mauro Pimentel\nWe're all for a little mid-winter warmth, and while the festivities in Rio de Janeiro — especially on Copacabana Beach — are worth a trip in their own right, a few local traditions should definitely be thrown into the mix. One of them dictates that jumping seven waves will bring good luck in the coming year. Bonus points if you wear white while doing so (to bring peace) and bring a bouquet with you to throw into the ocean (an offering to the goddess of the seas).\n5. Feasting Seven, Nine, or 12 Times in Estonia\nFoodies and gourmands should head to Estonia for New Year's Eve -- not only is the capital city of Tallinn exceptionally gorgeous, but the New Year's Eve tradition of eating a lucky number of meals makes for a good excuse to indulge. And don't think you can get away with an extra meal or two -- the numbers seven, nine, and 12 are considered the luckiest. And as the tradition goes, eating seven, nine, or 12 times means you'll have the strength of that many men (we'd like to think women, too) in the new year. But you don't have to finish everything on your plate; leaving some food behind will make ancestral spirits happy.\n6. Ringing Bells 108 Times in Japan\nAP/Eugene Hoshiko\nIn Japan, New Year's Eve (or Omisoka) is celebrated by ringing bells in Buddhist temples. However, instead of a mere dozen times, ringing a bell 108 times -- the number of human desires and thus, causes of suffering, according to the Buddhist tradition — is thought to dispel negative emotions and mentalities. If you're in Tokyo, witness the ritual at the city's iconic Zojoji Temple.\n7. Catch Junkanoo in the Bahamas\nJunkanoo, a Bahamian festival that takes place on both Boxing Day and New Year's Day (the party starts at 2 a.m. on the first day of the year), is a can't-miss if you're visiting Nassau during the winter. Thought to have started in the late 18th century, when slaves were allowed to leave plantations to celebrate Christmas as a community, these noisy, vibrant parades that carry on until 10 a.m. are now an important part of the islands' holiday traditions. Groups of dancers hit the streets, while musicians beat goatskin drums and cow whistles. Plus, the costumes alone are a sight to behold.","url":"https://www.businessinsider.com/new-years-eve-in-around-the-world-2016-12"}
