{"authors":[],"date_download":"2018-10-30 14:26:24","date_modify":"2018-10-30 14:26:24","date_publish":"2016-03-19 00:00:00","description":null,"filename":"data/vaneerConsumption/HowObamaTerrorizestheTerrorists.json","image_url":"https://www.americanthinker.com/images/bucket/2016-03/196303.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_03_how_obama_terrorizes_the_terrorists_1540909584.html","title":"How Obama Terrorizes the Terrorists","title_page":"How Obama Terrorizes the Terrorists","title_rss":"NULL","source_domain":"americanthinker.com","text":"Father Tom was kidnapped when ISIS burst into a nursing home in Yemen, where they murdered four of Mother Teresa's Missionaries of Charity, two Yemeni female staff members, eight residents, and a security guard.\nFor Easter break, Obama and his family visited South America. Meanwhile, ISIS celebrated Good Friday by torturing, whipping, and maybe even crucifying a 56-year-old Indian Salesian priest named Father Tom Uzhunnalil.\nThe terrorists, who Obama has reassured Americans would never infiltrate our shores masked as refugees, cleverly masqueraded as relatives of a resident of the southern Yemeni elderly care home. Then, after the imposters gained entry, they proceeded to splatter the walls of the facility with innocent blood.\nThe Yemen attack took place on March 4, which means that Obama defeating ISIS \"by saying 'you are not strong, you are weak'\" did not stop the Islamic State from brutalizing a Catholic priest. In fact, if ISIS did re-enact Jesus's crucifixion, it's likely that Father Uzhunnalil was flogged until his flesh was stripped and his spine exposed.\nMeanwhile, in between calling for an end to the Cuban embargo and drawing a moral equivalency between communism and capitalism, Obama stressed that he's apathetic because disregarding terrorism is what evokes panic in ISIS. And while Barack's stunning indifference surely causes ISIS to cower in fear, shoving a crown of thorns deep into the skull of a Catholic priest appears to have dispelled those fears.\nThe terrorist group also subdued lingering nervousness by following up that crown of thorns with nailing the Indian priest to a cross.\nAccording to the archbishop of Vienna, Cardinal Christoph Schönborn, whereas Obama was concluding his family vacation in South America, ISIS was reaffirming its commitment to Allah by lifting up a hemorrhaging priest's shattered body on a cross, where he likely hung until smothered to death.\nAnd then, before raping a few Yazidi girls to celebrate, and to make sure Father Tom was dead, further trepidation was likely quelled when ISIS thrust a spear through the priest's side.\nThe eternal reward for a man's martyrdom is not what is in question here. What is in question is how Obama, who claimed to be observing Good Friday while a Christian died an excruciating death on a cross, will respond to ISIS's latest atrocity.\nLast week, after 35 people, including four Americans, were blown to smithereens at a Belgium airport, Obama must have spooked ISIS with his heavy-duty messaging.\nFor starters, immediately following the news of the violence, the president demonstrated firm resolve by symbolically blowing ISIS away with the wave at a Cuban baseball game.\nThen, as the metal and glass were swept up, and a pile of shredded victims was being identified in a Brussels morgue, Obama issued ISIS a second, even stronger warning by climbing aboard a smaller Air Force One and doing some hiking and sightseeing in Parque Llao Llao.\nLet's remember: according to the president, the terrorists of ISIS quake in their boots when they see him boogying and banqueting. Not to mention the harrowing fear that grips the heart of every terrorist when Obama sends a message of strength by joking around on Cuban television and playing dominoes.\nThat's why, following the Brussels attack, at a state dinner in Argentina, Obama sent the Islamic State his fiercest message to date when he slithered around the dance floor doing a stiff, stone-faced tango with a hottie in a gold-sequined dress.\nThen, while ISIS attempted to recapture the upper hand by crucifying a priest, Barack Obama took advantage of a timely opportunity to remind the barbarians who's really in charge.\nIn keeping with the Easter spirit, the White House's 138th Easter Egg Roll undoubtedly made the Islamic State's blood run cold.\nTo ensure that ISIS fully abandons its quest for both a dirty bomb and world domination, by rolling hardboiled eggs on the White House lawn and acting out Where the Wild Things Are in the story corner, Barack Obama drove home the point that fun brings terrorism to its knees.\nThen, in the shadow of hip-hop Michelle doing the \"Whip/Nae Nae,\" the president of the United States sent one last hair-raising warning to ISIS by domineering the Eggtivity Zone Obstacle Course.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2016/03/how_obama_terrorizes_the_terrorists.html"}
