{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 22:29:03","date_modify":"2018-10-30 22:29:03","date_publish":"2014-08-15 15:28:35","description":"Most of wash our hair either daily or every other day, even relying on dry shampoo to fake freshness in between washes. Me? I have to wash my locks every morning or you would look at me with raised eyebrows. It looks unwashed and like a grease pit.…","filename":"data/vaneerConsumption/HowOftenShouldYouShampooNeverAccordingToMichaelGordonofBumbleAndBumble.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/077dfe14-cca1-43ee-83cd-6986056436a1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35920-how-often-should-you-shampoo-never-according-to-michael-gordon-of-bumble-and-bumble_1540938543.html","title":"How Often Should You Shampoo? Never, According To Michael Gordon of Bumble And Bumble","title_page":"How Often Should You Shampoo? Never, According To Michael Gordon of Bumble And Bumble","title_rss":"NULL","source_domain":"bustle.com","text":"Most of wash our hair either daily or every other day, even relying on dry shampoo to fake freshness in between washes. Me? I have to wash my locks every morning or you would look at me with raised eyebrows. It looks unwashed and like a grease pit. I could lube my car with my strands. I can't style my hair unless it's clean and conditioned. However, in a Wired feature, Michael Gordon, the creator of hip haircare line Bumble and Bumble relayed the fact that he thinks people should stop using shampoo and that the product should become obsolete. He wants to move on from the product, like actress Connie Britton, who doesn't use shampoo.\nWait, what? A guy who made some serious cash on hair products, including shampoo, is championing the extinction of shampoo, something most of us think we can't live without, which haircare companies very literally bank on. Is this the end of clean hair as we know it?\nWell, not really. He just thinks people should switch over to his Purely Perfect range, which will challenge everything you think you know and have always believed about clean hair. This is making more sense. The collection boasts just three products and conditioner isn't one of them, since there is no need for it.\nOkay, how does this work? Gordon is glad you asked.\nGordon is hawking Purely Perfect Cleansing Creme, the \"un-shampoo\" that is devoid of detergents and that doesn't foam. Most shampoos contain sodium laureth sulfate, which obliterates oil and leaves your scalp all sorts of fresh feeling as you lather away. But depleting oil comes with a pretty steep price. The sodium laureth sulfate leads to dry skin and hair, which is why we resort to using (and shelling out loot for) conditioners, goopy masks, hot oil treatments, scalp remedies, and more, all to replace what we just removed with shampoo. It's a vicious cycle but it makes you realize that shampoo is sort of bad for follices.\nHere's the Cleansing Creme recipe: aloe vera, rose flower oil, evening primrose oil, and peppermint oil. I know, it sounds very hippie-like. But you exchange sudsing for massaging. That's right. Massage it into the scalp, through your follicles, and rinse.\nGordon launched the line in the late '90s because he noticed that top level hairstylists weren't using the popular, pricy, and prestige brands. \"They’d use a lot of grease, French hair care stuff, face creams, they’d use sugar, they’d use soap, a lot of things—but not normal hair products,\" he told Wired.\nGordon also has ideas for products that won't leave behind any waste. So like a hair cleanser without a container? Hmm. Guess we'll have to wait and see about that. I'm still trying to wrap my head around (!!!) this whole not using shampoo thing and that's going to take a minute, since I am, uh, conditioned to use it. Since my hair is so oily, the wash-and-condition cycle has worked for me. Plus, I admit I lurve how shampoo makes my hair feel.\nImages: Purely Perfect; Giphy","url":"https://www.bustle.com/articles/35920-how-often-should-you-shampoo-never-according-to-michael-gordon-of-bumble-and-bumble"}
