{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 03:24:58","date_modify":"2018-10-23 03:24:58","date_publish":"2016-01-28 18:53:27","description":"The 61-year-old is a spokesperson for the diet program and has lost 26 pounds since joining. She also owns just under 6.4million shares of Weight Watchers.","filename":"data/vaneerConsumption/HowOprahWinfreyconqueredherpotatochipaddiction.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACB40900000578-0-image-a-38_1454004221384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421304_Oprah-Winfrey-describes-frustration-joined-Weight-Watchersand-confessed-controlled-potatoes_1540265098.html","title":"How Oprah Winfrey conquered her potato chip addiction","title_page":"How Oprah Winfrey conquered her potato chip addiction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oprah Winfrey has described the level of frustration she was at when she decided to begin her journey with Weight Watchers.\n'I was really at my wits' end,' the TV icon told company members as she remembered putting on 17 pounds last summer during a private Q&A on Wednesday, according to People.\nThe 61-year-old, who owns just under 6.4m shares of the company and has dropped 26 pounds with the program, also described how she has been 'controlled' by potatoes for much of her life.\nScroll down for video\n'I was really at my wits end': Oprah Winfrey, pictured at the premiere of Belief in New York in October 2015, explained her frustrations with weight loss during a private call with Weight Watchers members\n'I had tried everything,' Oprah added.\nOprah took the opportunity to explain the shame she felt being unable to fit into older articles of clothing as she addressed the concern.\n'None of those people had stood in their closets with three different sizes to try on on the floor, where the waistline didn't fit and the arms didn't fit, and the hips didn't fit, and you can't get it zipped, and felt that shame and that humiliation of \"Wow, I can't believe I'm in this position again,\"' she said.\nThe star also described a nearly lifelong weakness for potatoes.\n'\"I can't believe I'm in this position again\"': Winfrey, pictured in New York City in September 2015, didn't hold back as she described the humiliation of once more being unable to fit into articles of clothing during her chat\n'I have been controlled by potatoes for 40 years,' she said, according to the website. 'Any kind of fried potato, baked potato, scalloped potato – oh my god.'\nBut in spite of her Achilles heel, Oprah was through the moon to admit she was recently able to limit herself to just 10 potato chips.\n'I actually was traveling the other day and opened a 5 oz. bag of crinkle cut, black pepper potato chips and I counted out 10 chips...And I ate the 10 and I savored every one. And I put the bag away.'\nAchilles' heel: The 61-year-old, photographed in Melbourne in December 2015, admitted to a nearly lifelong weakness for potatoes\n'Of all the accomplishments that made in the world, all the red carpets, and the awards and those things that I've done...The fact that I could close the bag and not take another chip – it's major for me.'\nNow, the talk show icon says she has altered her views of food for the remainder of her life.\n'The difference is, I've made the shift and this is the way I'm going to live for the rest of my life,' she added.\nMajor accomplishment: The talk show star, in New York in October 2015, was no doubt proud to share that she was able to limit herself to just 10 potato chips, in spite of her fondness for them\nShe also went on to compare the frustration of overeating with other obstacles.\n'If you're an alcoholic you can hide that, or you're a drug addict you can hide that, if you're a gambler you can hide that, if you're a shopping addict you can hide that, if you work too much you can hide that. But if you overeat, it's hard to hide that,' she said.\nThe private talk comes after Weight Watchers stocks soared following a new commercial that starred Oprah aired, where she says she has lost 26 pounds on the program.\nGoing green: The star Instagrammed a snap of her healthy meals\n'I love bread!' Oprah raved about how Weight Watchers hasn't completely stopped her from enjoying bread in a new commercial for the brand\nOprah posted the ad online Tuesday to her nearly 31million Twitter followers and shares of New York-based Weight Watchers International Inc rose 21 per cent from $11.49 to $13.44 between 1pm and 3pm during afternoon trading.\nThe star owns just under 6.4million shares of Weight Watchers, and as the shares of the company rose on Tuesday, so did Winfrey’s wealth, all the way to $12million, according to Market Watch.\n'I love bread!' Winfrey says in the new commercial. 'That's the genius of this program. I lost 26 pounds and I have eaten bread every single day.'\nAlong for the ride! Oprah's best friend Gayle King has also dropped 14 pounds since beginning the program; here the pair are pictured in Dallas, Texas in June 2012\nWinfrey bought a 10 percent stake in the weight-loss company in October. Its stock is up more than 90 percent since then.\nOprah's best friend, CBS This Morning anchor Gayle King, began posting photos of the success she was having with the weight-loss program last September. She has now lost 14 pounds.\nThe television personality first joined the group in August, and managed to shed an impressive 15lbs in a month.\nPreviously: The television star made an appearance at the 60th Primetime Emmy Awards in Los Angeles in 2008\nHowever, the star faced criticism when her position as spokesperson was announced in an advert, with some viewers believing the resources at her disposal made her out of touch with the true hardship of weight loss, according to People.\nOprah famously lost 67lbs in 1988, dropping down to a size 10 after living on a liquid protein diet.\nProud of her weight loss, she even wheeled out a wagon loaded with fat on her eponymous talk show, which represented all the weight she had lost.\nHowever, the star has gone on to publicly say she regrets her unhealthy fad diet.\nAnd the results were shortlived, as within two days of returning to a diet of solid foods, Oprah could no longer fit into a size 10.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421304/Oprah-Winfrey-describes-frustration-joined-Weight-Watchersand-confessed-controlled-potatoes.html"}
