{"authors":["Peter Over"],"date_download":"2018-10-22 21:41:42","date_modify":"2018-10-22 21:41:42","date_publish":"2016-07-16 00:00:00","description":"By picking Mike Pence as his vice presidential candidate, Donald Trump may cost his campaign contributions from the financial services industry.","filename":"data/vaneerConsumption/HowPickingMikePenceAsVPMightCostTheTrumpCampaignDonations.json","image_url":"https://media.npr.org/assets/img/2016/07/15/gettyimages-468206778_wide-6af598e83e747f72dccd80f1dbbd6aed3df85d3b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_07_16_486205890_how-picking-mike-pence-as-vp-might-cost-the-trump-campaign-donations_1540244502.html","title":"How Picking Mike Pence As VP Might Cost The Trump Campaign Donations","title_page":"Picking Mike Pence As VP May Cost Donald Trump Campaign Contributions From Banks : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How Picking Mike Pence As VP Might Cost The Trump Campaign Donations\nEnlarge this image toggle caption Aaron P. Bernstein/Getty Images Aaron P. Bernstein/Getty Images\nPresidential nominees choose vice presidential running mates for what they add to the ticket, whether it be experience or the capacity to draw votes. Here's what Mike Pence might subtract from this fall's Republican ticket with Donald Trump: an unknowable amount of campaign cash from the financial services industry.\nAs governor of Indiana, Pence oversees state agencies that handle pension investments and municipal bonds. Federal pay-to-play rules impose harsh penalties on financial services firms if their employees solicit or make significant campaign contributions to local or state officials – such as Mike Pence.\nWith Pence on the ticket, \"it creates a significant hurdle to raising money from Wall Street firms,\" said campaign finance lawyer Ken Gross, whose clients include some of those firms.\nPay-to-play rules hurt then-governor Rick Perry of Texas in the 2012 Republican primaries, and they helped turn nominee Mitt Romney against choosing New Jersey Gov. Chris Christie for Vice President that year. One federal agency sent out a warning to the industry when Gov. Sarah Palin of Alaska became Sen. John McCain's running mate in 2008.\nMost campaign-finance regulations are written, narrowly, by politicians. The pay-to-play rules are expansive. The Securities and Exchange Commission, Commodity Futures Trading Commission and Municipal Securities Rulemaking Board imposed them to break long histories of corrupt relationships involving local officials, bankers and financial advisers.\nThe rules affect municipal bonds, state pension funds, the big banks and hedge funds that invest their funds and advisors who guide the government officials. Gross said, \"These are multi-trillion dollar industries.\"\nWhat it all means: A financial-services professional who dealt with Indiana state or local funds could not give or raise more than $350 for the Trump-Pence campaign or two committees that raise money for both the campaign and the Republican National Committee. Anything larger could trigger \"sudden death,\" banishment of the firm from Indiana for two years, or \"indentured servitude,\" two years in which the firm could continue its work in Indiana but couldn't get paid for it.\nThat's on the financial side. On the political side, Trump has been shunned by the financial services industry as he's relished attacking it. But Pence was favored by financial industry donors during his six terms in Congress.\n\"If it was Jeb Bush, it would be a problem,\" said Charlie Spies, a campaign finance lawyer who worked for Bush's superPAC in the primaries. \"For Trump, it's less of a problem.\"\nIt's in the personal politics that implications are harder to discern. No individual donor can give the Trump-Pence ticket more than $2,700 although donors can give as much as $334,000 to the Republican National Committee. But a donor seeking favor or access might wonder, Which of these will be most appreciated by the candidates themselves?\nThe pay-to-play rules won't stop the flow of really big money. Most contributions to the RNC aren't affected by the rules and neither are the unlimited contributions allowed to superPACs. But the Trump campaign has less control over how the RNC spends its cash and no say over how superPACs spend their money.","url":"https://www.npr.org/2016/07/16/486205890/how-picking-mike-pence-as-vp-might-cost-the-trump-campaign-donations"}
