{"authors":["Tyler Atwood"],"date_download":"2018-10-30 22:36:11","date_modify":"2018-10-30 22:36:11","date_publish":"2014-08-14 22:00:03","description":"I detest appearing nondescript. In my opinion, an ensemble is a way to express one's point of view, emotions, and artistry. For this reason, I wear red dresses. I love towering heels and quirky flats even when they don't exactly fit the occasion.…","filename":"data/vaneerConsumption/HowPeopleOnTheStreetReactedToMyLadylikeDressVsMyClubReadyLeatherMiniSkirt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bf6b4e99-be7c-4f01-99bb-d7012ae43606.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34887-how-people-on-the-street-reacted-to-my-ladylike-dress-vs-my-club-ready-leather-mini-skirt_1540938971.html","title":"How People On The Street Reacted To My \"Ladylike\" Dress Vs. My Club-Ready, Leather Mini Skirt","title_page":"How People On The Street Reacted To My \"Ladylike\" Dress Vs. My Club-Ready, Leather Mini Skirt","title_rss":"NULL","source_domain":"bustle.com","text":"I detest appearing nondescript. In my opinion, an ensemble is a way to express one's point of view, emotions, and artistry. For this reason, I wear red dresses. I love towering heels and quirky flats even when they don't exactly fit the occasion. I'm still learning how to say no to glitter. However, like any other woman I have my missteps, or weekends during which my favorite leggings get more usage than an ostentatiously printed dress or red heels. On several particularly humiliating occasions, I have worn skirts that could have benefitted from a few of those dress weights Kate Middleton uses to maintain decency in high winds, or dresses which in hindsight needed a slip. It was one such occasion that fostered a certain curiosity in me regarding strangers' reactions to my clothing. It was an unusually sunny day for the winter, and I was clad in a black dress. This piece was the type of long-sleeved, long-hemmed cowl neck which caused a boy at my university to describe the look as \"witchy,\" a comment I assumed meant somewhat matronly and covered-up. As I was strolling along, I felt a tap on my shoulder, and turned around to see a scowling, middle-aged woman glaring at me.\n\"I can see the outline of your underwear\", she exclaimed, \"Did you know that? Did you know when you walked out the door you were wearing a tarty dress? It's making people uncomfortable.\" I glanced around at the few unconcerned people who had seemed not to notice me or my apparently burlesque-worthy dress.\n\"I'm sorry, I didn't realize that... whoops!\", I responded. Still glaring, the woman went off, muttering about how inappropriate and inconsiderate I was, regardless of the fact that I was unaware of the dress's flaw.\nUnfortunately, this is not an uncommon reaction from women, in my experience. I have also incited glares for wearing ladylike dresses and heels, sneers when I'm in yoga pants, and, most commonly, blatant looks of disapproval when I'm clad in a miniskirt. Men, on the other hand, seem not to notice me unless I'm particularly gussied up or wearing my gym gear. In their case, I may receive a few more sidelong glances and smiles than I'm accustomed to.\nTo satisfy my curiosity about how one's clothing affects public perception, I decided to try a little experiment. I dressed in slightly baggy boyfriend jeans, an unadorned white peasant top, and flats to run a few daily errands, and repeated the same routine over the following days wearing a respectful shift dress, then an ensemble which has only seen the inside of a few bars and clubs after dark. The reactions I received were fascinating at least, and incredibly telling.\n1. DRESSED DOWN IN BOYFRIEND JEANS: THE INVISIBILITY CLOAK\nI decided to begin my experiment by wearing a pair of slightly slouchy boyfriend jeans and a plain white peasant blouse on my daily run to lunch, coffee, and assorted errands. In an entirely foreseeable outcome, I flew under the radar the entire day through. Passerby neither sent me curious looks nor showed signs of above-average politesse. It appears that a woman in a casual ensemble is the norm for 2014.\n2. DRESSED EVEN FURTHER DOWN IN GYM CLOTHES: THE AWKWARD ONCE-OVER\nGoing about my daily routine in gym clothes made a perfectly normal day into one that left me questioning my self confidence and how I appear to the outside world. After outfitting myself in cropped yoga pants and a stretchy neon gym tank, I found that I was suddenly back on New York's radar — and not in a pleasant way. Women felt entitled to narrow their eyes at me give me an uncomfortably long once-over while the men who noticed me appeared to fixate on territory south of my head. I quickly learned to keep a steady gaze straight ahead and refuse to engage with passerby.\n3. DRESSED IN A PRIM, LADYLIKE ENSEMBLE: CHIVALRY IS NOT DEAD\nThe most remarkable reactions by far were those I received while clad in a \"ladylike\" ensemble. By \"ladylike\", I'm referring to the stereotypical 1950s vision of a feminine ensemble: full, floral silk dress with a modest collar, a swipe of punch-colored lipstick and prim, nude heels. A generous fellow helped me step out of the way of a construction site's debris, strangers smiled sweetly, and I received no glances laced with barely-contained scorn. In short, I spent a day experiencing a type of unsolicited good humor and help which New York City decidedly doesn't offer consistently.\n4. DRESSED IN CLUB ATTIRE: THE WRATH OF SLUT-SHAMERS\nFor the sake of the experiment, I decided to venture out in a short leather miniskirt, black silk tank top, and staggeringly high heels. The ensemble certainly could have been much more risqué, but exposed skin enough skin to fall under the \"church-inappropriate\" category. On the subject of clubbing attire, I will say only this: the higher the hemline and the lower the neckline, the less respect I seem to elicit from others, especially during sunlight hours. Whether this is some form of latent slut shaming or merely the result of speculation about the type of person who would wear such a getup in public, I couldn't say. However, when nighttime finally rolled around and I was amongst a sea of similarly-clad happy hour attendees, I could have sworn my outfit solicited a few looks of unabashed appreciation.\nImages: Tyler Atwood","url":"https://www.bustle.com/articles/34887-how-people-on-the-street-reacted-to-my-ladylike-dress-vs-my-club-ready-leather-mini-skirt"}
