{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 04:36:16","date_modify":"2018-10-23 04:36:16","date_publish":"2016-01-28 20:34:36","description":"Prends Moi, the world's first weight loss perfume, promises to help you cut calories by triggering the release of B-endorphins which send pleasure messages to the brain, reducing the urge to eat.","filename":"data/vaneerConsumption/HowPERFUMEcanhelpyoushedpounds.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD2F3100000578-0-image-a-4_1454011325426.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421603_How-PERFUME-help-shed-pounds_1540269376.html","title":"How PERFUME can help you shed pounds","title_page":"How PERFUME can help you shed pounds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As the battle against the post-festive bulge rages on, many of us are seeking out any extra help we can get with New Year's resolutions to lose weight.\nBuy can a fragrance really help to curb your appetite and speed you towards your weight loss goals?\nPrends Moi by Velds is the UK’s first fragrance to aid weight loss and promises to induce the release of B-endorphins in the skin - triggering a sense of wellbeing, thus reducing the urge to overeat.\nScroll down for video\nPrends Moi is the UK's first weight loss fragrance and claims to help users to lose weight by triggering the release of B-endorphins, which send a pleasure message to the brain making you feel content and reducing the urge to snack or overeat\nCosting £15, its makers claim the fragrance is designed to ‘slim with pleasure’ and is based on 'aromatherapeutic' and ‘neurocosmetic’ research.\nDeveloped by the French perfume house Robertet, its zesty scent comes from a blend of bergamot, mandarin, lilac and ylang ylang.\nIt also contains active ingredients including Betaphroline, a wild indigo seed extract, which when it comes in to contact with keratinocytes (cells found in the outer layer of the skin) will induce the release of B-endorphins present.\nThis sends a 'pleasure message' to the brain and the resulting sensation of wellbeing and increased feeling of contentment will supposedly stop you reaching for the biscuit tin to get a feelgood fix.\nThe perfume also contains a Slimming Complex formulated with caffeine, carnitine and spirulina extract, which activates the two key enzymes directly involved in lipolysis\nA trial study of women aged between 18 and 70 years of age, who were not on a diet, found that 75% felt the perfume limited the need to snack and 73% felt a feeling of pleasure\nIn addition, it contains a ‘Slimming Complex’ formulated with caffeine, carnitine and spirulina extract, which activates the two key enzymes directly involved in lipolysis (fat degradation).\nThe fragrance's claims appear to be backed up by science.\nA trial study by BIO-EC, the Centre of Biological Research and Cutaneous Experimentation, appears to back up the claims made my Prends Moi.\nThey carried out a study of women aged between 18 and 70 years of age, who were not on a diet, found that 75 per cent felt the perfume limited the need to snack and 73 per cent felt a feeling of pleasure.\nMore than 80 per cent experienced a feeling of comfort after application and 70 per cent felt it had an impact on their eating behaviour.\nTo get the full effect, Prends Moi advises that you generously spritz in the morning, as you would do with any perfume, and throughout the day when the need for snacking arises.\nFurther results can be achieved by very lightly massaging into targeted areas, morning and night to help sculpt and slim the contours of the body.\nWhen first launched there was a waiting list of more than 6,000 customers but it's now available to snap up from The Fragrance Shop immediately.","url":"https://www.dailymail.co.uk/femail/article-3421603/How-PERFUME-help-shed-pounds.html"}
