{"authors":["Breitbart News"],"date_download":"2018-10-30 20:49:20","date_modify":"2018-10-30 20:49:20","date_publish":"2014-09-21 09:29:30","description":"This article originally appeared in The Telegraph:Few outsiders have noticed, but radical Islamists now control Libya's capital. These militias stormed |","filename":"data/vaneerConsumption/HowQatarisFundingtheRiseofRadicalIslam.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2013/Middle%20East/Qatar/qatar_emir_morsi_reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_09_21__1540932560.html","title":"How Qatar is Funding the Rise of Radical Islam","title_page":"How Qatar is Funding the Rise of Radical Islam | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Few outsiders have noticed, but radical Islamists now control Libya’s capital. These militias stormed Tripoli last month, forcing the official government to flee and hastening the country’s collapse into a failed state.\nMoreover, the new overlords of Tripoli are allies of Ansar al-Sharia, a brutal jihadist movement suspected of killing America’s then ambassador to Libya, Christopher Stevens, and of trying to murder his British counterpart, Sir Dominic Asquith.\nBarely three years after Britain helped to free Libya from Col Gaddafi’s tyranny, anti-Western radicals hold sway. How could Britain’s goal of a stable and friendly Libya have been thwarted so completely.\nStep forward a fabulously wealthy Gulf state that owns an array of London landmarks and claims to be one of our best friends in the Middle East.\nQatar, the owner of Harrods, has dispatched cargo planes laden with weapons to the victorious Islamist coalition, styling itself “Libya Dawn”.\nWestern officials have tracked the Qatari arms flights as they land in the city of Misrata, about 100 miles east of Tripoli, where the Islamist militias have their stronghold. Even after the fall of the capital and the removal of Libya’s government, Qatar is “still flying in weapons straight to Misrata airport”, said a senior Western official.\nSo it is that Qatar buys London property while working against British interests in Libya and arming friends of the jihadists who tried to kill one of our ambassadors. A state that partly owns 1 Hyde Park, London’s most expensive apartment block, and the Shard, the city’s tallest building, is working with people who would gladly destroy Western society.\nRead the full story in The Telegraph.","url":"https://www.breitbart.com/national-security/2014/09/21/how-qatar-is-funding-the-rise-of-radical-islam/"}
