{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-23 02:13:47","date_modify":"2018-10-23 02:13:47","date_publish":"2017-03-10 11:13:54","description":"Brighton can take another step towards the Premier League on Friday night when they host Derby County at the Amex Stadium. But how ready are the south coast club for top-flight football?","filename":"data/vaneerConsumption/HowreadyareBrightonforthePremierLeague.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E228F5200000578-0-image-a-31_1489145718009.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300626_How-ready-Brighton-Premier-League_1540260827.html","title":"How ready are Brighton for the Premier League?","title_page":"How ready are Brighton for the Premier League? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brighton can take another step towards the Premier League on Friday night when they host Derby County at the Amex Stadium.\nAfter years in the lower divisions and in the wilderness, and three failed play-off attempts, the Seagulls are finally hoping to make their top-flight return via the automatic route.\nThe last time Brighton graced the top division was in 1983 but they're better placed in the table than ever to make the leap.\nBut is the club ready for the Premier League? We take a closer look.\nBrighton can take another step towards the Premier League when they play Derby on Friday\nBrighton have a six-point lead on Huddersfield in the second automatic promotion spot\nBACKGROUND AND FORM\nBrighton have certainly had their fill of the Championship play-offs in the recent past. They lost out to their rivals Crystal Palace in the 2013 semi-finals, then were defeated by Derby County at the same stage 12 months later.\nLast season, they almost made it up to the Premier League automatically, missing out to Middlesbrough on goal difference on the final day of the season.\nDuly shoved into the play-offs, they couldn't rouse themselves for another push and lost out 3-1 on aggregate to Sheffield Wednesday.\nBrighton drew with Middlesbrough on the final day of last season - missing out on automatic promotion to their opponents on goal difference\nBrighton were then defeated by Sheffield Wednesday in the play-off semi-finals\nThis season, they intend to achieve promotion by the easier route of finishing in the top two and have done supremely well, matching title favourites Newcastle United stride-for-stride.\nChris Hughton's team lost only two league matches before the New Year and were top at the end of January.\nThere have admittedly been a few wobbles since then, including back-to-back losses to Newcastle and Nottingham Forest last week, but they got back on track by beating Rotherham on Tuesday night.\nWith a six-point cushion to third-placed Huddersfield Town and 10 matches left to play, it is most definitely Brighton's to lose now.\nWhat's more, they should achieve promotion in some style given the slick and attack-minded way they play football.\nBrighton celebrate after Glenn Murray scored for them at Birmingham back in December\nThere have been a few wobbles, such as their home loss to Newcastle United last week\nSTADIUM\nTake one look at Brighton's splendid Amex Stadium and you soon appreciate that they are a Premier League club-in-waiting.\nThe facilities at the 30,750-capacity stadium are more than a match for most top-flight grounds and, with its sweeping curves, the Amex is attractive to look at too with its South Downs surroundings.\nFor long-standing Brighton fans, watching football at the Amex is heavenly after the nomadic existence they led after the Goldstone Ground was closed in 1997.\nBrighton's original home, the Goldstone Ground, as it looked on its final day in 1997\nThe club was forced to play at the Withdean Stadium, an athletics venue, for many years\nFor two years, the club ground-shared at Gillingham's Priestfield ground, located 75 miles away in Kent, and then, upon returning to Brighton, had to put up with the inadequate conditions of the Withdean Stadium, an athletics venue.\nAlthough the site of the Amex Stadium at Falmer was first identified in the late 1990s, it wasn't until 2011 that the club realised their ambition of playing there.\nIt feels as though a great deal of thought has gone into the stadium, which though out-of-town is located right next to a railway station and the A27 bypass.\nA view of the Amex Stadium as it looked when it hosted games at the Rugby World Cup\nFANBASE\nThe potential fanbase for the club is enormous. Brighton itself has a population of just under 300,000 and a glance at the map shows there aren't too many large-sized rivals in the region.\nOf course, Brighton is located just 50 miles south of London, with regular transport links, but it is just far enough for none of the clubs there to take fans away.\nThere is a feeling that Brighton missed out on a generation of potential support when they played at Gillingham and the Withdean, where crowds averaged around 7,000.\nBut with the opening of the Amex, the fans are flocking back. Average crowds started at just over 20,000 but with extension works and a successful side, the crowds regularly reach 27-28,000 this season.\nTravelling Brighton fans await the arrival of their team at Nottingham Forest last weekend\nBrighton's run-in Friday Derby County (H) Live on Sky Sports 1 March 18 Leeds United (A) Live on Sky Sports 1 April 1 Blackburn Rovers (H) April 4 Birmingham City (H) April 7 Queens Park Rangers (A) Live on Sky Sports 1 April 14 Wolverhampton Wanderers (A) Live on Sky Sports 1 April 17 Wigan Athletic (H) April 22 Norwich City (A) April 29 Bristol City (H) May 7 Aston Villa (A)\nThe club's chief executive Paul Barber, speaking at the recent Sports Industry Group, said: 'We need to catch the hearts and minds of Sussex before we take over the world.\n'For now our biggest priority is getting ourselves to be the biggest club in Sussex and the south of England.'\nOne clever strategy the club have used is to encourage a new generation of young fans through cheap ticket prices and straightforward generosity.\nEvery seven-year-old is sent a free replica shirt on their birthday if they're registered with the club and live locally.\n'Now when you look around the parks and the seafront in Brighton, instead of seeing Spurs, Arsenal and Manchester United shirts, you see Brighton shirts,' said Barber.\nThen there are ticket prices tiered by age group to encourage families to attend - for example, while an adult ticket for Friday's derby game costs £32, an under 21 could get one for £24, an under 18 for £15 and an under 10 for £5.\nThere is then Brighton's investment in the matchday experience. Outside the Amex, you often see a live band performing before games, while the concourse bars are kept open well after the final whistle so fans can enjoy another drink while the queue for the trains dies down.\nIn the away end, the club have also tried to make visiting fans welcome by having a guest beer from back home on tap.\nFINANCES\nThe push for the Premier League has taken a certain toll on Brighton, who announced a loss of £25.9million to the end of the 2015-16 season.\nThis was a large increase on their loss of £10.44m the previous year and reflected more expensive investment in the squad to try and crack promotion.\nDespite the loss, Brighton did remain within the boundaries of the Financial Fair Play regulations, which permit a club's losses to reach an aggregate of £39m over the course of three seasons.\nBrighton fans put on a display ahead of the play-off semi-final with Sheffield Wednesday\nHowever, with this in mind, it has become increasingly imperative for Brighton to reach the Premier League sooner rather than later so as not to overstretch themselves.\nTheir chairman Tony Bloom, speaking when the losses were announced in December, made a good point: 'Any Championship club without parachute payments wishing to compete for promotion will inevitably make significant losses.'\nIt simply serves to illustrate how transformative it is to clubs when they achieve promotion to the Premier League and gain the riches of broadcast revenue, prize funds and international commercial opportunities.\nBrighton chief executive Paul Barber with Alex Scott and Casey Stoney ahead of an England women's game staged at the ground in 2014\nMANAGER\nBrighton were in a perilous state when Hughton was appointed on New Year's Eve 2014. Under Sami Hyypia, the club has slumped from play-off candidates to a relegation battle after a run of just one win in 18 games.\nHughton did just about enough to keep Brighton in the division, despite failing to win any of their last seven matches, and worked hard on restoring them to the higher sections of the table that summer.\nFollowing considerable investment and an almost total overhaul of the squad, the team were transformed and didn't lose last season in the league until December 19, an unbeaten run of 21 matches.\nChris Hughton is on course to guide Brighton into the Premier League after a few near-misses\nAfter January 16, they were beaten only once yet agonisingly lost out to Middlesbrough on the final day of the season and then to Wednesday in the play-offs.\nHughton, with his calm and collected manner, has Premier League experience from his time with Newcastle United and Norwich City which will come in very handy if they get promoted.\nPLAYERS\nAchieving promotion from the Championship is a gruelling task. The season is a 46-match marathon and tremendous staying power is required, as well as considerable squad depth.\nBrighton have this and, under Hughton, have been forward-thinking and exciting to watch. Their tally of 60 league goals this season is the joint-third highest with only Newcastle United and Norwich City scoring more.\nThe return of Glenn Murray from Bournemouth, firstly on loan and then permanently from January, has proved an inspired move after his 17 league goals.\nTop scorer Glenn Murray in action during Brighton's defeat at Nottingham Forest last week\nAnthony Knockaert celebrates Brighton's return to winning ways at Rotherham on Tuesday\nIsrael international Tomer Hemed has scored 13 for the season and entertainer Anthony Knockaert, in his first full season with the club, has scored 12 and created many more.\nSam Baldock, another attacking option, has scored a number of important goals in the past few weeks and has 11 this season.\nBut for all this attacking firepower, Brighton are usually watertight in defence as well with Lewis Dunk and Shane Duffy particularly impressive.\nSo it's undoubtedly a squad that could achieve promotion, but will they be strong enough in the Premier League.\nYou'd say that with one or two shrewd acquisitions, Brighton should have a squad capable of staying up in their first season.\nForward Sam Baldock fires in a shot at goal during Brighton's win over Rotherham","url":"https://www.dailymail.co.uk/sport/football/article-4300626/How-ready-Brighton-Premier-League.html"}
