{"authors":[],"date_download":"2018-10-31 00:07:42","date_modify":"2018-10-31 00:07:42","date_publish":"2016-12-21 00:00:00","description":"Pension costs for state and local government will begin to rise in 2017 after CalPERS officials voted to throttle back the expectations on profits earned from its $299 billion portfolio.","filename":"data/vaneerConsumption/HowstateandlocalgovernmentbudgetswillbeaffectedbyCalPERStrimmedinvestmentexpectations.json","image_url":"https://www.trbimg.com/img-585ae859/turbine/la-calpers-investment-return-20161221-photos-003/600/5x3","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944462.html","title":"How state and local government budgets will be affected by CalPERS' trimmed investment expectations","title_page":"How state and local government budgets will be affected by CalPERS’ trimmed investment expectations - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"In the four years since California’s largest pension fund recalibrated its investment projections, the annual contribution from state and local governments — in effect, the money paid by taxpayers — has slowly been on the rise.\nBy the summer of next year, the pace of those payments will quicken, as the California Public Employees’ Retirement System throttles back the expectations of profits earned on its $300-billion portfolio.\nThis series is a partnership of\nThose expectations were officially made more conservative on Wednesday by CalPERS’ board of directors, a half-percentage-point decrease in assumed returns over three years that will send shock waves through all sectors of state and local government faced with billions of dollars in new pension costs.\nEven so, those higher contributions could add some long-term strength to a government employee retirement program that has fallen deeper into the danger zone in recent years.\n“This will make for a more sustainable system,” Gov. Jerry Brown said in a statement after the pension board’s vote.\nThe final approval for shrinking CalPERS’ official rate of investment profit, from its current 7.5% to 7%, came one day after the proposal was vetted and recommended by the board of directors’ investment committee, putting in place the mechanism to shrink CalPERS’ expectations to its lowest rate in modern history.\n“This is very monumental for the organization,” said Richard Costigan, the CalPERS board member whose finance committee vetted the proposal.\nIt was a decision some members of the pension board, most notably those from the ranks of public employee unions, have resisted. Other board members said it was simply a matter of the math for CalPERS, the biggest public employee pension fund in the nation.\nThat was best seen in Wednesday’s report by the fund’s chief investment officer that actual investment returns over the last 20 years have averaged only 6.9%, and returns for the current fiscal year are a paltry 2.3%.\nThe impacts will first be felt in the state budget, which already makes annual payments of $5.4 billion a year into the CalPERS fund. While local governments and schools won’t have to boost their pension contributions until 2018, the state budget will begin to feel the effects of the CalPERS decision in almost six months.\nPension fund leaders were told on Tuesday that Brown, who will unveil his new state budget in less than three weeks, believes the ratcheting down of CalPERS’ investment profits will force the state to pay an additional $2 billion above current pension mandates by the summer of 2024.\n“These costs have very real and significant budget pressures,” Eric Stern, a pension adviser to Brown, said in testimony on Tuesday.\nADVERTISEMENT\nWith only three real sources of money — investment returns, government funds and government worker contributions — to make up billions of dollars in long-term pension shortfalls, the admission by CalPERS of weaker portfolio profits will have a domino effect in communities across California.\nGovernment workers hired before the state’s 2012 pension overhaul could be asked to set aside more for their pensions in their paychecks through future collective bargaining. Workers hired after the 2012 changes, though, will have to automatically pay more.\nSo, too, will local governments, which made $4.4 billion in CalPERS payments in the most recently completed fiscal year.\n“We believe it’s a step in the right direction, in spite of the strains it will put on our budgets,” said Dane Hutchings of the League of California Cities.\nEven so, those dollars are now being diverted in some cases from local public services and law enforcement. In Sacramento, fire and police department positions remain vacant due to a lack of dollars.\n“This change will obviously be very difficult for us, and this will continue our inability to fill those positions,” Sacramento city finance director Phil Wright said in testimony to pension board members.\nSchool workers, such as custodians and maintenance workers, are also promised pensions paid through CalPERS. Dennis Meyers of the California School Boards Assn. told officials on Tuesday the rate change could add $500 million a year to school pension payments.\n“That is money off the table, and it’s money that’s not being able to be used to decrease achievement gaps, or buy textbooks or technology, or all of those things we need to do to move our student population forward,” Meyers said.\nAny objections by CalPERS directors to the new conservative investment assumptions were largely absent this week, a shift from strong critiques made last month by those who represent public employee labor unions.\nThe only labor criticism this week came from Jai Sookprasert, the assistant director of the California School Employees Assn., who told board members on Tuesday the action was “very aggressive” in light of current stock performance records being set on Wall Street.\nOne board member, J.J. Jelincic, abstained from supporting the plan because he said it was too small of a dose of reality for state and local governments. Jelincic said the kinds of investments CalPERS has made aren’t designed to yield a 7% return, the new lower projection.\n“I think the number is too high,” he said in an interview on Wednesday. “I think it was more a political decision to aid [government] employers.”\nContact the reporter. Twitter: @johnmyers","url":"http://www.latimes.com/projects/la-me-pension-changes/"}
