{"authors":["Jr Thorpe"],"date_download":"2018-10-31 01:47:54","date_modify":"2018-10-31 01:47:54","date_publish":"2018-09-11 16:06:13","description":"Who among us hasn't worried about money? Paying down student loan debt, while keeping up with ballooning costs of living, while also trying to save for a far-off retirement, can feel impossible for many of us. And for women in particular, this hits…","filename":"data/vaneerConsumption/HowSexistAttitudesAboutMoneyContributeToFinancialAnxietyAccordingToAMoneyExpert.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/bfc6742d-6e2c-47e8-abc2-30ce02fa941a-stock_ab-8883.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-sexist-attitudes-about-money-contribute-to-financial-anxiety-according-to-a-money-expert-10214487_1540950474.html","title":"How Sexist Attitudes About Money Contribute To Financial Anxiety, According To A Money Expert","title_page":"How Sexist Attitudes About Money Contribute To Financial Anxiety, According To A Money Expert","title_rss":"NULL","source_domain":"bustle.com","text":"Who among us hasn't worried about money? Paying down student loan debt, while keeping up with ballooning costs of living, while also trying to save for a far-off retirement, can feel impossible for many of us. And for women in particular, this hits us hard. Women report more financial anxiety than men, according to a 2017 study, and research says that anxiety and stress about money, particularly debt and the financial future, is common for millennial women in particular. And there's a very specific reason for this: not only are women still financially at a disadvantage in the modern economy, we're still dealing with the legacy of financial sexism from centuries ago.\nIt's not that dealing with money is complex or 'difficult' for women; it's that women historically have been excluded from talking about it, and that sets us up for financial failure. Our anxiety about our finances is \"a cruel paradox of modern women's rights and the unprecedented number of opportunities available to young women today,\" Iona Bain, founder of the Young Money Blog and author of Spare Change: Better Ways to Manage Money, tells Bustle. \"Financial independence is a relatively new concept for [women].\"\nHannah Burton/Bustle\nWhile it's easy for women these days to open bank accounts, run their own ISAs (tax-free savings accounts) and save for retirement, this is actually a pretty new phenomenon. \"It used to be very difficult (if not impossible) for women to completely earn, manage and spend their own money,\" Bain explains. \"It's still in living memory that regulations prevented women taking out financial products like mortgages and credit cards without the co-operation of a male co-signer.\" Yes, really; up until the late 1970s, many loans had to be co-signed by men because women were seen as a 'riskier' financial investment.\nBut, Bain explains, this had a knock-on effect on women's financial education. \"The flip-side of these restrictions was that financial (and indeed all) decisions were a lot simpler,\" she tells Bustle. \"There was a commonly-established path from parental to marital home, with the patriarchal structure behind you at all times, shielding you from the sharp edges of working life and the responsibility of major financial choices.\" Women were supposed to \"know their place,\" and that place was not in charge of any financial decisions.\nThese days, of course, things have changed. \"Today, progress in women's rights plus changing social norms means record numbers of young women are living on their own, paying their way and spending their income in myriad ways,\" Bain says. \"But this greater autonomy brings its own problems. There are complex decisions to be made almost every day when you have ownership of your career and finances.\" And because women have been shut out of financial learning for centuries, we don't exactly have a heap of experience to fall back on when we make these choices.\nAndrew Zaeh for Bustle\nIt's not helped by the fact that women are still subjected to sexism when it comes to how they handle money. Women these days still pay more for credit cards than men do, according to data from the Financial Industry Regulatory Authority in 2012, and their mortgages are 15 percent less affordable than men's, according to the Office of National Statistics.\nOf course, sexism also has an enormous impact on our financial futures. \"When women (on average) have lower incomes, more career breaks, and greater social pressures to spend money to help their children or please men, they have less money to save, insure themselves, and invest even though they often need these financial safeguards more than their male counterparts,\" Bain says.\nAnd the way we talk about women and money doesn't help. \"How can we earn the biggest salaries, do huge social good, love what we do, have a rich personal life, use our wealth to signify our value to the world (as is expected of us) while also saving enough for the future?\" she asks. \"All are impossible to achieve at the same time, but young women struggle to know what to prioritize when they are bombarded with contradictory and psychologically manipulative messages through the media — all driven by an underlying commercial or political agenda.\"\nKnowing this doesn't make financial anxiety go away, necessarily, but it can help you work against it. By being aware of this problem, we can work to combat it — and give ourselves the financial education we deserve.","url":"https://www.bustle.com/p/how-sexist-attitudes-about-money-contribute-to-financial-anxiety-according-to-a-money-expert-10214487"}
