{"authors":[],"date_download":"2018-10-22 22:24:02","date_modify":"2018-10-22 22:24:02","date_publish":"2014-06-09 21:57:38","description":"Astronaut Steve Swanson and his daughter designed a space station patch that looked like a Star Trek Klingon emblem, but NASA wouldn't go for it.","filename":"data/vaneerConsumption/HowStarTreksKlingonsInspiredaSpaceStationPatch.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/497886/140609-klingon1_b3c0cfd27d5aa6fb8b6171c44c94998f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_how-star-treks-klingons-inspired-space-station-patch-n126756_1540247042.html","title":"How Star Trek's Klingons Inspired a Space Station Patch","title_page":"How Star Trek's Klingons Inspired a Space Station Patch","title_rss":"NULL","source_domain":"nbcnews.com","text":"What Swanson had first proposed however, was a badge of a decidedly different type. \"He wanted something that was kind of badass,\" Mary Swanson, Steve's wife, said during a phone call with CollectSpace, \"and Klingons are kind of badass.\"\nSteve and Caroline Swanson's original idea for the patch derived its shape and trefoil logo from an emblem created for the Klingon \"Brotherhood of the Sword,\" as seen on the 1990s television series \"Star Trek: The Next Generation.\"\nSwanson and his daughter, a computer science major who began her studies in graphic design, modified the Klingon patch, replacing its image of a swordlike weapon called a \"Bat'leth\" with a similarly shaped icon depicting the space station. A Klingon-language inscription along the border of the original emblem was supplanted by the Swansons with the names of the six-person Expedition 40 crew.\nThe Klingon logo from the original patch was also altered to envelop a Russian Soyuz rocket, like the type Swanson and his crewmates rode into orbit in late March.\nSwanson wanted to pay tribute to the role that science fiction has had inspiring real space explorers, as he wrote in the caption describing his and his daughter's initial design. But NASA's lawyers said no. Due to copyright concerns, the expedition's patch was redesigned. The Soyuz rocket still remained, but the Klingon influences were removed.\n— Robert Z. Pearlman, CollectSpace.com\nThis is a condensed version of a story from CollectSpace.com. Read the full report on CollectSPACE.com and get a close look at astronaut Steve Swanson’s Klingon-inspired space patch. Follow CollectSpace.com on Facebook and on Twitter at @collectSPACE. Copyright 2014 CollectSpace.com. Distributed by Space.com. All rights reserved.","url":"https://www.nbcnews.com/science/space/how-star-treks-klingons-inspired-space-station-patch-n126756"}
