{"authors":[],"date_download":"2018-10-30 14:29:36","date_modify":"2018-10-30 14:29:36","date_publish":"2017-04-25 04:55:14","description":"Five observations from the Hawks’ 111-101 victory over the Wizards in Game 4 of their Eastern...","filename":"data/vaneerConsumption/HowtheHawksconfidenceremainedwithseriestyingwinoverWi.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/25/Images/newsEngin.18364560_042517-hawks-game-CC15.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_how-the-h_e0f8e7941f938ad609f83e486190a533__1540909776.html","title":"How the Hawks’ confidence remained with series-tying win over Wi","title_page":"How the Hawks’ confidence remained with series-tying win over Wi","title_rss":"NULL","source_domain":"ajc.com","text":"Five observations from the Hawks’ 111-101 victory over the Wizards in Game 4 of their Eastern Conference first-round playoff series Monday.\n1. The Hawks were still in a must-win situation. They did not want to return to Washington, D.C. down 3-1 with the Wizards on the verge of clinching the series.\nNow, it’s the best of three.\n“This game was very important for us,” Dwight Howard said. “I think we came out with the right mentality from the beginning of the game until the end. This is something we needed. The first two games it felt like we were right there. A couple mistakes cost us. These last two games, we stayed together, played as hard as we can and got a good win.”\nEntering the postseason, only 18 teams have come back to win a best-of-seven series after trailing 3-1. Long odds indeed.\nAfter two losses in Washington, after leading in each, the Hawks believe they know what it takes to steal a victory away from home.\n“It’s pretty high,” Paul Millsap said of the team’s confidence. “I think we know how to beat this team. It’s up to us to get out there and continue to play the way we’ve been playing. If we can carry this over to Washington, we’ll be fine.”\n2. The Hawks got the game they’ve been waiting for all series from Howard. The center finished with 15 point and 16 rebounds. In the first three games, he had a total of 18 points and 32 rebounds.\n“Obviously, it was his best game,” Hawks coach Mike Budenholzer said. “We needed that extra boost. He certainly brought it. I thought is defense, his activity on the boards, his second- and third-efforts getting rebounds. We need more of that every night, every possession. When he’s like that, I think it can help carry his teammates and move us forward.”\n3. Kent Bazemore finished with 16 points and seven assists. Two of the assists were of the alley-oop variety that Howard finished with dunks on back-to-back possessions.\nThe dunks came in the second quarter with the score tied 43-43. The Hawks took the four-point lead and never trailed again. The Wizards would tie the score several times but never regained the lead.\n“It’s definitely an adjustment,” Bazemore said of the chemistry between the two. “To have the trust to throw it so high, the pass is above the backboard, and you recognize that there is only one person who is going to get up there and he’s on your team. It’s all about trust. … You let it go and you are like ‘There is no way he’s getting it.” And he gets it with two hands and throws it home. It comes with time and I think I’m on to something.”\n4. Jose Calderon gave the Hawks some big minutes as the backup point guard. Starter Dennis Schroder had to sit on the bench after picking up his third foul with 2:29 remaining in the first quarter. He did not return until the start of the second half.\nIn the second quarter, Calderon played all but 1:02. He had eight points, including two 3-pointers, and four assists. He picked up his second and third fouls, plus a technical, but was a plus-22. For the game, Calderon finished with 10 points and five assists.\n“I feel comfortable with my teammates,” Calderon said. “As a point guard, it’s all about staying ready. We’ve been working hard for these kinds of fouls. I got three fouls quick too and coach kept me in the game. He could have picked somebody else. He trusted I could stay in with those three fouls. Whatever it takes.”\n5. The Paul Millsap vs. Markieff Morris was a one-sided affair – again. Millsap finished with 19 points, nine rebounds and seven assists. Morris, who was booed by the Philips Arena crowd for calling Millsap a crybaby after Game 3, struggled. He finished with nine points, on 3 of 10 shooting, with four rebounds. Morris was again in foul trouble and was limited by five.\nMillsap has been stellar in the past three games.\nHe gave the Hawks a huge lift in the fourth quarter with an and-one basket that he tipped while falling backward. It came as part of a decisive 14-5 run by the Hawks.\n“For all the kids out there, you have to practice that in the back yard,” Millsap said. “Growing up, at my grandma’s house, we played on dirt. I used to shoot fall-away shots like that all the time and get fouled. There is a place for those shots.”","url":"https://www.ajc.com/sports/basketball/how-the-hawks-confidence-remained-with-series-tying-win-over-wizards/uG5XJW0N0FW0tLIEKNEI4M/"}
